{"title":"Where cycling meets skiing: the iconic slopes at the soul of the peloton","link":"https://cyclingtips.com/2023/03/where-cycling-meets-skiing-the-iconic-slopes-at-the-soul-of-the-peloton/","date":1678197225000,"content":"<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2023/03/IMG_0916.jpg?width=1200\" alt=\"Where cycling meets skiing: the iconic slopes at the soul of the peloton\" /></figure><p>GRAND TOURMALET, France — Anyone who’s pedaled up a ski track knows it’s a lot steeper going up on two wheels than zipping down on skis.</p>\n<p>That was certainly the case during a trip last winter to Grand Tourmalet, the French Pryénéan ski area straddling one of Europe’s most famous climbs.</p>\n<p>The <em>hors-categorie</em> steeps of the Col du Tourmalet are little more than a switchback between runs in the snow-choked Pyrénées.</p>\n<p>Yet there it was, buried two meters under wet, slushy spring snow, the <em>bête noire</em> of plenty of cyclists, be it WorldTour pro or weekend warrior. It almost seemed benign, like a bear in a winter’s slumber.</p>\n<p>The Tourmalet always packs a punch, and is a fitting backdrop for all seasons.</p>\n<p>Every summer, cycling’s biggest races rumble up the steepest roads in the Alps, Pyrénées and Dolomites.</p>\n<p>Some of cycling’s most iconic climbs — Alpe d’Huez, Italy’s Passo Fedaia below the Marmolada, Arcalis in Andorra, or Spain’s Sierra Nevada — zig-zag up to Europe’s biggest winter playgrounds.</p>\n<p>Most of those roads and stages, however, usually dead-end where the real winter fun starts. The Tourmalet is different. The intrepid skier/road cyclist can actually ski down one of the sport’s most famous climbs.</p>\n<p>What’s 10 percent grades going up on the bike barely rates as a catwalk, yet the Col du Tourmalet is an awesome brute in any season.</p>\n<h2>Cycling up, skiing down</h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/03/IMG_0745-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" /><figcaption><span>The sign says it all. There’s fun in all seasons.</span> (Photo: Andrew Hood)</figcaption></figure>\n<p>Cycling has a long tradition of visiting ski areas. It’s a mutually beneficial relationship that dates back decades.</p>\n<p>Perhaps what is cycling’s most famous climb up the 21 switchbacks at Alpe d’Huez debuted in 1952, and has been a regular stop since the 1970s.</p>\n<p>It’s the perfect match. Ski areas are keen to show off their brand and promote summer tourism. And race organizers need long, steep, and steady climbs.</p>\n<p>Ready-made roads laced with switchbacks offer plenty of parking for the race caravan at the top. And plenty of hotels for the teams, staffers, and ragtag troop of media, fans, and others following summer’s moveable suffer-fest.</p>\n<p>It’s no surprise that many of these ski destinations fully embrace cycling as its natural touristic complement. Alpe d’Huez is almost more famous in some circles for its links to the Tour de France than for its otherwise superb skiing playground.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/03/IMG_0910-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" /><figcaption><span>Signs point the way to La Mongie, a site of several Tour de France stage finishes.</span> (Photo: Andrew Hood)</figcaption></figure>\n<p>Every summer, tens of thousands of cyclists sweat and grind up the famed 21 <em>lacets</em> in bucket-list trips to match their times against the greats of the peloton.</p>\n<p>According to Alpe d’Huez tourism officials, an average of 1,000 cyclo-tourists per day ride up the famous climb. There’s even an official certificate that local officials award to anyone who signs up and proves they made it to the top.</p>\n<blockquote>\n<p>A stage of the Tour. On Alpe D’Huez. On Bastille day <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f92f.png\" alt=\"🤯\" /> <a href=\"https://twitter.com/INEOSGrenadiers?ref_src=twsrc%5Etfw\">@INEOSGrenadiers</a> <a href=\"https://twitter.com/LeTour?ref_src=twsrc%5Etfw\">@LeTour</a> <a href=\"https://t.co/PlCUkqlhLc\">pic.twitter.com/PlCUkqlhLc</a></p>\n<p>— Tom Pidcock (@tompidcock) <a href=\"https://twitter.com/tompidcock/status/1547807429517123596?ref_src=twsrc%5Etfw\">July 15, 2022</a></p></blockquote>\n<p></p>\n<p>Pick any major ski resort across the Alps, Dolomites, and Pyrénées, and chances are the local ski operator’s hosted a bike race.</p>\n<p>Villages on both sides of the Col du Tourmalet embrace the summer cycling community. The village of Luz-Saint-Sauveur is on the western approach of the Tourmalet, and locals have posted commemorative signs celebrating the Tour’s long history with the climb dating back to 1910.</p>\n<p>The eastern approach up the Tourmalet leads up to La Mongie, a bustling winter base area packed with ski rental shops, restaurants with sun decks, and cheesy, cement-block styled architecture straight out of the 1970s.</p>\n<p>Almost every major climb up to ski resorts in Europe are sign-posted with gradients, distance, and historical notes. During winter, most of those signs are buried under a few feet of the white stuff.</p>\n<h2>Skiing in the French Pyrénées</h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/03/IMG_0776-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" /><figcaption><span><span>A skier heads down the slopes at Luz-Ardiden, with the Tourmalet on the horizon. (Photo: Andrew Hood)</span></span></figcaption></figure>\n<p>Skiing at the Gran Tourmalet ski area is unique in that the curious road cyclist can actually ski down portions of the Col du Tourmalet.</p>\n<p>At Alpe d’Huez, the famous 21 <em>lacets</em> end where the upper base area begins. That’s also true at the nearby Luz-Ardiden, called by some the “Alpe d’Huez of the Pyrénées.”</p>\n<p>A steep series of switchbacks leads up Luz-Ardiden, making for one of the more challenging climbs in the Pyrénées. Yet where the pavement ends, the ski area begins.</p>\n<p>There’s endless summer trails for gravelers and mountain bikers, but for the roadies, the road stops usually where the ski area begins.</p>\n<p>That’s where the Tourmalet is a bit different.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/03/IMG_1006-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" /><figcaption><span>No winter trip to the Pyrénées is complete without a full lunch, here at Luz-Saint-Sauveur at the base of the Col du Tourmalet.</span> (Photo: Andrew Hood)</figcaption></figure>\n<p>Col du Tourmalet tops out at 2,115m (6,939 feet), high enough to be snowed out each winter and it serves as the saddle for the larger ski area, with La Mongie on one side and Barège on the other.</p>\n<p>That makes it possible to rip down both sides of the upper reaches of the Tourmalet climb.</p>\n<p>Well above tree-line, the Pyrénées tower above with endless runs carved between deep canyons and wide-open posts. Chairlifts go up from there, and the hulking mass of the Pic du Midi at 2,877m (9,439 feet) serves up gondola-serviced off-piste tracks and expert terrain leading down to the Tourmalet.</p>\n<p>The skiing in the Pyrénées is generally very good. There’s plenty of terrain for all skill levels, but elevation and snow cover are key.</p>\n<p>At 1,000m (more than 3,000ft) lower than the Alps, the snowpack can be thin with somewhat wetter, heavier snow, and the season runs shorter than in the high Alps.</p>\n<p>The season runs from early December into early April, depending on snowfall.</p>\n<p>Lift tickets won’t break the bank, with full-day lift tickets running about $50 a day.</p>\n<p>Luz-Saint-Sauveur is an ideal base for both winter and summer fun. During the winter, Grand Tourmalet, Luz-Ardiden, Cauterets, and Gavarnie all within an easy drive. Local hotels start around $100 a night on weekends, with dinners starting at $15 to $20 a plate.</p>\n<p>Hit the repeat button in the summer, with the many giants of the Pyrénées, including the Col du Tourmalet, Luz-Ardiden, the Col d’Aubisque, and Hautacam, all within reach of a day ride.</p>\n<p>And by late spring, when the days are longer, it would be possible to cycle up to Luz-Ardiden and then swap out for some skis, and get the best of both worlds.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/03/IMG_0802-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" /><figcaption><span>The switchbacks of Luz-Ardiden provide a runway to both skiing fun and a summer challenge on two wheels.</span> (Photo: Andrew Hood)</figcaption></figure>\n<p><em>European editor Andrew Hood will be writing about top European travel and cultural destinations in a regular feature on CyclingTips. </em></p>","author":"Andrew Hood","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0d4754fab006dad185f1941d884f957152d78d064f59ef17142bb29a4eac7ed0","category":"Cycling"}