{"title":"Shimano Cues kills off Alivio, Acera and Altus, with Tiagra to be phased out","link":"https://www.bikeradar.com/news/shimano-cues/","date":1677600048000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Shimano-Cues-cropped-d893f4f.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Shimano-Cues-cropped-d893f4f.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Shimano-Cues-cropped-d893f4f.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Shimano-Cues-cropped-d893f4f.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Shimano-Cues-cropped-d893f4f.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Shimano-Cues-cropped-d893f4f.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Shimano-Cues-cropped-d893f4f.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Shimano-Cues-cropped-d893f4f.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Shimano-Cues-cropped-d893f4f.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/02/Shimano-Cues-cropped-d893f4f.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Shimano Cues cropped\" title=\"Shimano Cues cropped\" />                                            <p>Shimano Cues is a new range of 9-, 10- and 11-speed drivetrain components that replace Alivio, Acera and Altus, as well as select Deore components.</p>\n<p>Shimano has also hinted strongly that drop-bar variants of Cues will come in the future, phasing out <a href=\"https://www.bikeradar.com/news/shimano-tiagra-st-4720-levers/\">Tiagra</a>, Sora and Claris.</p>\n<p>Though 2x components suitable for mountain biking or urban riding are available as part of the range, Cues is focused primarily on offering affordable <a href=\"https://www.bikeradar.com/advice/buyers-guides/1x-drivetrains/\">1x drivetrains</a> for all disciplines.</p>\n<p>This has been a notable omission from Shimano’s range to date, and we expect to see Cues specced on a wide range of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hybrid-bikes/\">hybrids</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike/\">mountain bikes</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-an-electric-bike/\">electric bikes</a> of all styles.</p>\n<p>Cues (<strong>C</strong>reate <strong>U</strong>nique <strong>E</strong>xperience<strong>S</strong>, if you’re wondering) was introduced last year with <a href=\"https://www.bikeradar.com/news/shimano-cues-di2/\">Di2 components for electric urban and mountain bikes</a>.</p>\n<p>The new Shimano Cues range currently encompasses a full suite of flat-bar mechanical drivetrains.</p>\n<p>The Shimano Cues range is broken down into the following tiers:</p>\n<ul><li><strong>Shimano Cues U3000</strong>: 9-speed</li>\n<li><strong>Shimano Cues U4000</strong>: 9-speed</li>\n<li><strong>Shimano Cues U6000</strong>: 10- or 11-speed</li>\n<li><strong>Shimano Cues U8000</strong>: 11-speed</li>\n</ul><p>This isn’t a strictly accurate representation of how the range is laid out because some components (eg, <a href=\"https://www.bikeradar.com/advice/buyers-guides/front-derailleur/\">front derailleurs</a> or <a href=\"https://www.bikeradar.com/advice/buyers-guides/cranksets/\">cranksets</a>) span multiple ‘speed’ groupsets, but it gives a rough overview of the hierarchy.</p>\n<p>Unlike Shimano’s existing groupsets, the cable pull ratio, cassette cog spacing and chains are shared across all components – regardless of whether they are 9-, 10- or 11-speed, and where they sit in the product hierarchy.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Cues is intended to make it easier for brands to spec bikes as they wish.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>This means bike brands and consumers will be freer to spec from “a menu of components” to suit their needs.</p>\n<p>If the unconfirmed drop-bar shifters use the same cable pull ratio, this will mean mullet-drivetrain builds – pairing truly wide-range MTB drivetrains with drop bars – will soon be a possibility.</p>\n<p>This will be a first for Shimano mechanical groupsets and should see fewer instances of brands speccing third-party components to build the bikes they want.</p>\n<p>Although Shimano has made its overall intention with Cues clear, it has provided few details on some key components. We will update this story as more information is released.</p>\n<p>In this in-depth article, we’ll take a look at</p>\n<ul><li><a href=\"#compatibility\">Why increased compatibility is key to Cues</a></li>\n<li><a href=\"#linkglide\">What LinkGlide is and how it works</a></li>\n<li><a href=\"#range-overview\">How each tier of the new Cues range shapes up</a></li>\n</ul><section><div>\n        \n<h2>Shimano Cues in brief:</h2>\n<ul><li>Shimano Cues is a new range of 9-, 10- and 11-speed drivetrain components</li>\n<li>10- and 11-speed Deore will be subsumed by Cues. Alivio, Acera and Altus will also be merged into the Cues brand</li>\n<li>Though it hasn’t been confirmed officially, Shimano has strongly hinted Cues will replace Tiagra, Sora and Claris road groupsets</li>\n<li>Cassette spacing, chains and cable pull ratios are shared across all components, boosting inter-compatibility</li>\n<li>All components are based on Shimano LinkGlide technology</li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Why develop a new groupset? Compatibility and adaptability for all</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Cues will be specced on a wide range of bikes, including mountain bikes.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>Shimano Cues was developed in reaction to demand from manufacturers to simplify Shimano’s component range.</p>\n<p>More specifically, brands wanted the option to spec affordable wide-range clutch-equipped 1x drivetrains for bikes of all styles.</p>\n<p><a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-deore-m6100-groupset-review/\">Deore M6100</a> was previously Shimano’s entry point for a clutch-equipped 1x drivetrain.</p>\n<p>Though a solid mid-level option, Deore still sits several tiers above Acera, Alivio and Altus, with a correspondingly high price.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Shimano Cues was developed to meet the demands of OEMs.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>This led many brands to spec third-party derailleurs (particularly those from <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-microshift/\">Microshift</a>), shifters or cranksets, particularly on affordable hybrids and city bikes.</p>\n<p>Brands also demanded greater freedom to build bikes as desired. Cues offers broad inter-compatibility of the groupset components to enable this, the details of which are outlined in further detail below.</p>\n<p>It is important to note Shimano is pitching Cues as an OEM-first (original equipment manufacturer) groupset.</p>\n<p>Though parts will be available aftermarket and Shimano believes Cues will make the buying journey easier for new cyclists, it’s clear the brand sees this as a groupset that aims to cater to the needs of bike brands first.</p>\n<p>This is reflected in the brevity of some tech details on the new groupset. We have contacted Shimano to clarify some key points and will update this story as we get further information.</p>\n<h3>Shared chains and cassette spacing</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> All Cues components share the same cassette spacing and cable pull ratios.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>All Shimano Cues components are compatible with any 11-speed Shimano chain. This includes both HyperGlide and LinkGlide chains.</p>\n<p>For clarity, this means a 9-speed Cues drivetrain uses an 11-speed chain.</p>\n<p>This is because the cassette cog spacing is shared across all cassettes.</p>\n<p>Shimano says existing HyperGlide cassettes are incompatible with Cues drivetrains</p>\n<p>LinkGlide cassettes mount on a standard HG-style freehub and are available in a range of sizes to suit different disciplines, and 1x or 2x drivetrains.</p>\n<div>\n                <table><colgroup><col></col><col></col><col></col></colgroup><thead><tr><th>Speed</th><th></th><th></th></tr></thead><tbody><tr><td>9-speed</td><td>CS-LG300-9, 11-36t</td><td>CS-LG400-9, 11-41t</td>        </tr><tr><td>10-speed</td><td>CS-LG300-10, 11-39t</td><td>CS-LG400-10, 11-48t</td>        </tr><tr><td>11-speed</td><td>CS-LG400-11, 11-50t</td><td>CS-LG700, 11-50t or 11-45t</td>        </tr></tbody></table></div>\n\n<h3>Cranksets</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Cranksets will be available in classic HollowTech, a new two-piece design or square taper options.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>All Shimano Cues cranksets are compatible with every ‘speed’ of drivetrain.</p>\n<p>This means bike brands will be free to, for example, spec a wide-range 11-speed rear derailleur and cassette, while reducing costs with a lower-tier crankset.</p>\n<p>Both square taper and Hollowtech-style external bottom bracket cranksets will be available.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Shimano is adopting a new style of crankset with Cues.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>Some external <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket</a> cranksets use a new design that sees the driveside crankarm pressed onto a fixed spindle. A similar arrangement is used on SRAM’s DUB cranksets.</p>\n<p>Shimano calls this a two-piece crankset in supporting literature. As far as we can tell, this still uses a standard 24mm spindle, but must be used with redesigned bottom brackets. A new tool (TL-FC1O, TL-FC15 or TL-FC11) will be required to service these.</p>\n<h3>Cable pull</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> I-spec? Shifter windows? Clamp on? Shimano Cues says yes.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>Cable pull ratio describes the amount the derailleur moves for every millimetre of cable pulled through by the shifter.</p>\n<p>Current Shimano groupsets use different cable pull ratios across road/gravel and mountain bike components (Shimano refers to cable pull ratio as ‘actuation ratio’). Further differences exist between different-speed groupsets.</p>\n<p>For example, a 10-speed Deore derailleur uses a different cable pull ratio from 9-speed Acera shifter, so they are incompatible (our <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">complete guide to rear derailleurs</a> explains this subject in greater detail).</p>\n<p>The cable pull ratio is the same across all Shimano Cues components.</p>\n<p>For example, an 11-speed Cues derailleur could be used with 9-speed shifters.</p>\n<p>Unofficially, a 10-speed shifter will work on a 9-speed drivetrain (provided you set the limit screws accordingly).</p>\n<p>While not an ideal solution, it does mean retailers are less likely to be left in a pinch.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> LinkGlide derailleurs have a different cable pull ratio from HyperGlide. However, Cues will work with the XT and Deore LinkGlide components launched in 2021.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>It’s worth stressing that LinkGlide components use a different cable pull ratio from HyperGlide components.</p>\n<p>For example, this means you will not be able to use an 11-speed Cues U8000 rear derailleur with either 11-speed road/gravel or mountain bike shifters.</p>\n<p>Cues components are compatible with the aforementioned Deore XT or Deore LinkGlide components launched last year.</p>\n<h3>Don’t sweat the small stuff</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Small components, such as individual cassette cogs, will work across all groupsets.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>Inter-compatibility extends beyond headline components.</p>\n<p>For example, 11- and 13-tooth cassette cogs are shared across all models, regardless of speed (these will be available as aftermarket replacement parts).</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> With fewer individual components, Shimano believes shops will need to hold less stock overall.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>13t pulley wheels are also shared across all 1x rear derailleurs.</p>\n<p>All of this will make the lives of bike shop owners and mechanics – and in turn, consumers – easier and, theoretically, cheaper.</p>\n<p>Assuming Cues becomes dominant as existing mid-tier components are phased out, shops shouldn’t need to hold as many distinct replacement items in stock.</p>\n<p> </p>\n\n<h2>What is Shimano LinkGlide?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> LinkGlide technology is at the heart of Cues.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>All components in the Shimano Cues range use LinkGlide technology.</p>\n<p>Compared to Shimano’s long-standing HyperGlide components, LinkGlide uses thicker cogs, taller teeth and chunkier shift ramps to reduce drivetrain wear under high torque use without impacting shift quality, according to Shimano.</p>\n<p>This is said to lead to lower maintenance and replacement costs, with a claimed three-fold increase in durability compared to HyperGlide components.</p>\n<p>LinkGlide was also designed to enable automatic shifting on electric bikes. This puts a drivetrain under enormous strain compared to shifting conventionally on a non-assisted bike.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Shimano LinkGlide features chunkier teeth than HyperGlide.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>The increased durability and smoother shifting offered by LinkGlide makes it a great option for inexperienced riders who may assume it’s fine to shift, even under load, according to Shimano.</p>\n<p>It’s said to be more forgiving of indelicate (read: abusive) shifting technique and prioritises longevity over lightness.</p>\n<p>LinkGlide was introduced in 2021 with <a href=\"https://www.bikeradar.com/news/shimano-linkglide-xt-deore/\">a limited range of Deore XT and Deore mountain bike components</a>.</p>\n<p>Further LinkGlide components were introduced with the <a href=\"https://www.bikeradar.com/news/shimano-xt-di2-m8150/\">Cues RD-U6070 Di2 and XT M8150-11 Di2 rear derailleurs</a> released in July 2022.</p>\n<h2></h2>\n<h2>Shimano Cues range overview</h2>\n<p>Shimano has provided few details on the specific components that make up the Cues range. The following is a broad overview of how each tier shapes up and which bikes you can expect to see it specced on.</p>\n<h3>Shimano Cues U8000</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> U8000 is the top-of-the-range Cues groupset.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>Shimano Cues U8000 is the top-tier Cues groupset. Shimano says it is best viewed as a replacement for the T8000 Deore XT Trekking groupset.</p>\n<p>U8000 has a premium finish and all of its components are 11-speed.</p>\n<p>A spokesperson for Shimano said the brand expects to see the groupset specced widely on electric ‘trekking’ bikes (electric bikes designed for long days out and/or touring) and high-end urban bikes.</p>\n<p>The crankset uses a standard HollowTech bottom bracket and is available in a 42t or 40t single chainring option (FC-U8000-1), or a 46/32 double crankset (FC-U8000-2).</p>\n<p>A 1x-specific (RD-U8000) and 2x/1x derailleur (RD-U8020) are available.</p>\n<h3>Shimano Cues U6000</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> U6000 is expected to be specced on entry-level mountain bikes.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>Shimano Cues U6000 is the second-tier groupset and the one Shimano expects to see specced widely on <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-best-mountain-bikes-under-500/\">entry-level mountain bikes</a>.</p>\n<p>The range spans both 10- and 11-speed components.</p>\n<p>The 1x rear derailleur (RD-U6000) is shared between both 10- and 11-speed components. This has a traditional Shimano clutch.</p>\n<p>There are two 2x rear derailleurs for either 10-speed (RD-U6020-10) or 11-speed (RD-U6020-11) groupsets. These will also both work with 1x groupsets.</p>\n<p>The crankset is available in 42t, 40t, 32t and 30t options for 1x cranksets (FC-U6000-1).</p>\n<p>A single HollowTech 46/32 double crankset is available (FC-U6010-2).</p>\n<p>Two-piece 2x cranksets are available in 36-22 or 46-30t options (FC-U6000-2). This crankset uses solid crank arms with the driveside crank pressed onto a spindle.</p>\n<h3>Shimano Cues U4000</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> U4000 has the widest range of crankset options.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>Shimano Cues U4000 is the cheapest full groupset range and has the widest variety of components.</p>\n<p>The 9-speed groupset includes a rear derailleur for either 1x (RD-U4000) or 2x (RD-U4020) groupsets.</p>\n<p>The rear derailleur does not feature a traditional one-way friction clutch. It instead uses a stronger lower knuckle spring to put increased tension on the chain.</p>\n<p>Shimano says, because there’s no clutch, it won’t be as quiet. However, it claims this new design still offers “excellent chain retention, exceeding the performance of previous-generation 11-speed XT and SLX” drivetrains (which feature a clutch).</p>\n<p>Cues U4000 uses a range of crankset styles:</p>\n<ul><li><strong>1x square taper</strong>: 42t, 40t, 32t or 30t (FC-U4000-1)</li>\n<li><strong>2x two-piece</strong>: 36/22t or 40/26t (FC-U4010-2)</li>\n<li><strong>2x square taper</strong>: 36/22t or 40/26t (FC-U4000-2)</li>\n</ul><p>Shimano expects Cues U4000 will be specced on mountain bikes, but will be seen more commonly on hybrids.</p>\n<h3>Shimano Cues U3000</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The U3000 range is made up of one rear derailleur at present.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>The Shimano Cues U3000 range currently comprises a single rear derailleur for 1x or 2x drivetrains (RD-U3020). No further details are available.</p>\n<h2>Shimano Cues pricing</h2>\n<p>Shimano has only supplied pricing for select U8000 components in the USA.</p>\n<p>It has also provided total prices for U6000 and U4000 groupsets. This pricing is based on a 1x drivetrain with the widest available gear range. Prices do not include brakes, a bottom bracket or crankset.</p>\n<p>We will add further pricing details as they become available. No availability information was available at the time of writing.</p>\n<div>\n                <table><colgroup><col></col><col></col></colgroup><thead><tr><th>Shimano CUES example pricing</th><th>RRP (USD)</th></tr></thead><tbody><tr><td><b>Shimano Cues U8000 pricing</b></td><td></td>        </tr><tr><td>1x11 w/ crankset &amp; BB</td><td></td>        </tr><tr><td>SL-U8000-11R 11spd rear shifter</td><td>$59.99</td>        </tr><tr><td>CS-LG700-11 (11-50t) cassette</td><td>$130.99</td>        </tr><tr><td>RD-U8000/RD-U8020 rear derailleur</td><td>$74.99</td>        </tr><tr><td>CN-LG500 chain</td><td>$22.99</td>        </tr><tr><td>BB-MT501 bottom bracket</td><td>$22.99</td>        </tr><tr><td>FC-U8000-1 1x11 crankset</td><td>$139.99</td>        </tr><tr><td>Total</td><td>$451.94</td>        </tr><tr><td></td><td></td>        </tr><tr><td><b>Shimano Cues U6000</b></td><td></td>        </tr><tr><td>1x11 without crankset or bottom bracket</td><td>$213.96</td>        </tr><tr><td></td><td></td>        </tr><tr><td><b>Shimano Cues U6000</b></td><td></td>        </tr><tr><td>1x10 without crankset or bottom bracket</td><td>$186.96</td>        </tr><tr><td></td><td></td>        </tr><tr><td><b>Shimano Cues U4000</b></td><td></td>        </tr><tr><td>1x9 without crankset or bottom bracket</td><td>$150.96</td>        </tr></tbody></table></div>","author":"Jack Luke","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"1830c64a37d847ab7f91b33a9dc2ebd6d4638e758e8a82213c4454a57e729877","category":"Cycling"}