{"title":"Windows Insider เพิ่มกลุ่มทดสอบ Canary Channel ได้ฟีเจอร์ระดับแพลตฟอร์มใหม่ที่สุด","link":"https://www.blognone.com/node/132915","date":1678193672000,"content":"<div><div><div><p>ไมโครซอฟท์ประกาศเพิ่ม Canary Channel ให้กลุ่มผู้ทดสอบ Windows Insider เพิ่มมาจากของเดิมที่มี Dev, Beta, Release Preview รวมเป็น 4 ระดับ</p>\n<p>Canary Channel จะได้ Windows Build ที่ใหม่ที่สุด มีการเปลี่ยนแปลงระดับแพลตฟอร์ม (เช่น เคอร์เนลหรือ API) และจะออกอัพเดต Build บ่อยๆ โดยบางครั้งอาจไม่มีบล็อกหรือเอกสารเขียนถึงว่ามีอะไรใหม่บ้าง (เขียนไม่ทัน) แตกต่างจาก Dev, Beta, Release Preview ที่จะมีบล็อกเขียนกำกับเสมอ</p>\n<p>ส่วน Dev Channel จะเป็นกลุ่มทดสอบที่ได้ฟีเจอร์ใหม่ที่ไม่ใช่ระดับแพลตฟอร์ม (เช่น แอพใหม่) หลายฟีเจอร์จะเป็นแค่การทดลองไอเดียใหม่ๆ ที่อาจไม่ได้นำมาใช้จริง หรืออาจนำมาใช้แต่ต้องใช้เวลานาน เพราะจะใช้ต่อเมื่อมั่นใจว่าพร้อมจริงๆ เท่านั้น และบางครั้งฟีเจอร์ใน Dev อาจไม่มีใน Canary ด้วยซ้ำ เพราะไมโครซอฟท์มีวิธีการทดสอบฟีเจอร์เฉพาะกลุ่ม (A/B testing) ที่เรียกว่า Controlled Feature Rollout (CFR)</p>\n<p>เมื่อมั่นใจว่าฟีเจอร์ใหม่พร้อมใช้งานแล้ว ไมโครซอฟท์จะนำไปใส่ใน Beta Channel ก่อนเลื่อนชั้นไปเป็น Release Preview ก่อนออกรุ่นเสถียร (Beta/Release Preview ใช้นโยบายเดิมไม่เปลี่ยนแปลง)</p>\n<p>กลุ่มผู้ใช้ Dev Channel จะถูกย้ายไปทดสอบ Canary แทนโดยอัตโนมัติ หากต้องการถอยกลับมา Dev ใน Build ที่ตัวเลขต่ำกว่า จำเป็นต้องติดตั้งใหม่แบบ clean install เท่านั้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8ea7fe1b0c1f7f6715f22016358861e1.png\" /></p>\n<p>ที่มา - <a href=\"https://blogs.windows.com/windows-insider/2023/03/06/whats-coming-for-the-windows-insider-program-in-2023/\">Windows Insider Blog</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/windows-11\">Windows 11</a></div><div><a href=\"/topics/windows\">Windows</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/operating-system\">Operating System</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"19ff801f15110d9fe2a68c6ab68747cae523efe68cb64516403e56fea8b71f57","category":"Thai"}