{"title":"Tirreno-Adriatico 2023 - contenders and predictions","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico-2023-contenders-and-predictions","date":1678089600000,"content":"\n      \n<p>The seventh leg of the 2023 WorldTour gets going on Tuesday with the beginning of the 58th <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico\">Tirreno-Adriatico</a>, featuring flat and punchy stages, a time trial, a mountain top finish, and a brutal ‘Tappa dei Muri’ stage the race has become renowned for in recent years. </p>\n<div></div>\n<p>In the absence of defending champions Tadej Pogačar (UAE Team Emirates) and Jonas Vingegaard (Jumbo-Visma), who are both riding <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice\">Paris-Nice</a> instead, as well as Primož Roglič (Jumbo-Visma) and Remco Evenepoel (Soudal - Quick-Step), who are preparing for the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\" target=\"_blank\">Giro d’Italia</a> by training rather than racing, the race for overall victory looks wide open. Riders used to trailing that dominant quartet will relish the chance to win one of the WorldTour’s most prestigious stage races. </p>\n<p><span>This will also be the first time Wout van Aert (Jumbo-Visma) and Mathieu van der Poel (Alpecin-Deceuninck) will face off against each other on the road this season, and the first time since their bout at the Cyclocross World Championships. And they will be joined by Julian Alaphilippe (Soudal - Quick-Step), in what promises to be a dry run ahead of the upcoming Classics this spring. </span></p>\n<p><span>Here are the key contenders for the race, and our predictions as to what might happen. </span></p>\n<h3><span>Adam Yates</span></h3>\n<p>Adam Yates might not have been able to defeat Remco Evenepoel at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uae-tour-everything-you-need-to-know\">UAE Tour</a>, but he was nevertheless on fire, claiming victory atop Jebel Hafeet with the fastest ever ascent of the climb. That ride suggests that Yates has started the 2023 season in flying form, and is UAE Team Emirates’ best candidate for leadership at Tirreno-Adriatico, from a line-up that, despite the absence of Pogačar, still boasts the talent of João Almeida and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/men-s-santos-tour-down-under-2023-preview-route-prediction-and-contenders\">Tour Down Under</a> winner Jay Vine. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1136421413.jpg?v=1677759271\" alt=\"Adam Yates during the 2019 Tirreno-Adriatico\" /><em>Yates during the 2019 Tirreno-Adriatico (Tim de Waele/Getty Images)</em></p>\n<p><span>Having previously missed out on overall victory at the 2019 edition to Primož Roglič by just one second, Yates will feel he has unfinished business at Tirreno-Adriatico. </span></p>\n<h3>Mikel Landa</h3>\n<p>Unbelievably, Mikel Landa has never before won a WorldTour stage race in his entire career. Some of his nearest misses came at the two most recent editions of Tirreno-Adriatico, where he placed third, but on both occasions he was overpowered by the might of Tadej Pogačar.</p>\n<p><span>Despite having turned 33, he’s not done yet with trying to earn that elusive title, and second-place overall at the Ruta del Sol last month indicates that he has the form to compete for victory in Italy. Whereas he formed a two-pronged attack in that race with Santiago Buitrago, this time he and Damiano Caruso look set to be Bahrain-Victorious’ co-leaders. </span></p>\n<h3>Aleksandr Vlasov</h3>\n<p>Vlasov was one of the stars of the spring last season, during which time he won the Tour de Romandie and Volta a la Comunitat Valenciana and made the podium at Itzulia Basque Country and Flèche Wallonne. Though he hasn’t begun this season quite so brightly, placing just fifth overall at Valenciana, he proved last year that he is a threat in virtually any stage race. </p>\n<p><span>His punchy style should make him well-suited to the stage six Tappa dei Muri that could be the decisive stage of the race, and in Giro d’Italia winner Jai Hindley he has a teammate also capable of challenging for the top honour. </span></p>\n<h3>Enric Mas</h3>\n<p>Of all the potential GC contenders, Enric Mas might be the one most relieved at the absence of the top stage racing stars. The Spaniard has habitually been frustrated by those riders, finishing runner-up to both Roglič and Evenepoel at the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>, and Pogačar at Il Lombardia.</p>\n<p><span>In their absence, the pressure will be on Mas to make the most of this opportunity to win what would be a first ever WorldTour stage race title. He typically makes slow starts to the season, instead preserving his best form until the Grand Tours, but fifth overall at the recent Ruta del Sol, where he also registered two second-place finishes, suggests that might not be the case this year. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1243820135.jpg?v=1677759468\" alt=\"Enric Mas and Tadej Pogačar at the Giro di Lombardia in 2022\" /><em>Mas and Pogačar battling it out at the Tour of Lombardy (Luca Bettini/Pool/AFP via Getty Images)</em></span></p>\n<h3>Geraint Thomas</h3>\n<p><span>The most experienced GC contender at this year’s Tirreno-Adriatico, Geraint Thomas has an impressive record at this race, having placed second, third and fifth between 2017-2022, but has never quite managed to win it.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1306878909.jpg?v=1677759649\" alt=\"Geraint Thomas during the 2021 Tirreno-Adriatico\" /><em>Thomas on stage four of the Tirreno-Adriatico in 2021 (Tim de Waele/Getty Images)</em></span></p>\n<p><span>On paper he’s a top candidate to do so, especially after his third place overall at last year’s Tour de France proved that age has yet to catch up to him. But his form in unclear after illness compromised his start to the season; team-mate Thymen Arensman will step up should the Welshman not be at his best, eager to stake a claim for co-leadership for the upcoming Giro d’Italia.</span></p>\n<h3>Wout van Aert</h3>\n<p>One of the most intriguing questions heading into the Tirreno-Adriatico is whether or not Wout van Aert has his sights on a push for overall victory. He targeted it the last time he raced here in 2021, and came very close to winning, finishing second overall behind Pogačar.</p>\n<p><span>Jumbo-Visma are bringing a strong line-up featuring powerful rouleurs like opening weekend winners Tiesj Benoot and Dylan van Baarle, but don’t have an obvious GC leader aside from new signing Wilco Kelderman, so it may well be up to Van Aert. The 13km climb at the finish of stage five will be his main obstacle, but if he can climb as well as he has done at the Tour de France and limit his losses, there is plenty of time for him to gain in the punchy stages, as well as bonus seconds in sprint finishes. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1422866850.jpg?v=1677760905\" alt=\"Wout Van Aert and team Jumbo Visma\" /><em>This will be Wout van Aert's first road race back after the cyclocross season (Dario Belingheri/Getty Images)</em></span></p>\n<h3>Puncheurs, sprinters and other contenders</h3>\n<p>The punchy nature of the parcours makes Tirreno-Adriatico a particularly appealing prospect for Classics specialists, and many of the world’s best will be competing. That includes <strong>Julian Alaphilippe</strong> who, like Van Aert, could be an outside contender for overall victory having placed sixth overall in 2019, but is more likely to target stage wins as he continues to adjust to top level racing after an injury-disrupted 2022 season. </p>\n<p><span><strong>Mathieu van der Poel</strong> will also be riding, and we can expect the recently-crowned world cyclocross champion to ignite the race on the Tappa dei Muri. It will be interesting to see how <strong>Tom Pidcock</strong> approaches the race; he’ll be riding alongside Thomas and Arensman for Ineos Grenadiers, but could also do a good GC ride himself on this parcours. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1469494097.jpg?v=1677759950\" alt=\"Tom Pidcock riding on the cobbles at the 2023 Omloop Het Nieuwsblad\" /><em>Pidcock during Omloop Het Nieuwsblad last week (Luc Claessen/Getty Images)</em></span></p>\n<p><span><strong>Giulio Ciccone</strong> (Trek-Segafredo) is an outside shout for a high GC placing having finished second overall at Volta a la Comunitat Valenciana, while <strong>Thibaut Pinot</strong> (Groupama-FDJ) is set to make his first WorldTour appearance in what is his swansong season as a pro. The likes of <strong>Matej Mohorič</strong> (Bahrain-Victorious), <strong>Benoît Cosnefroy</strong> (Ag2r Citroën), <strong>Diego Ulissi</strong> (UAE Team Emirates), <strong>Alberto Bettiol</strong> (EF Education-EasyPost), and <strong>Valentin Madouas</strong> (Groupama-FDJ) could all pick up wins in the punchy stages. </span></p>\n<p><span>There will be some opportunities for the sprinters, with stage two, three and seven all having the potential for bunch finishes. <strong>Jasper Philipsen</strong> competes in his first stage race of the season with his Alpecin-Deceuninck badly in need of a first win of 2023, and he’ll come up against the likes of <strong>Fabio Jakobsen</strong> (Soudal - Quick-Step), <strong>Mark Cavendish</strong> (Astana Qazaqstan), <strong>Alberto Dainese</strong> (DSM), <strong>Jordi Meeus</strong> (Bora-Hansgrohe) and <strong>Biniam Girmay</strong> (Intermarché-Circus-Wanty). </span></p>\n<h3><span>Tirreno-Adriatico 2023 predictions</span></h3>\n<span>It will be a wide-open race, full of attacking riding and with no rider or team likely to exercise a firm grip on proceedings. Of the contenders, </span><span>Adam Yates </span><span>looks to be in the best form, and has a strong enough team to help him gain overall victory. </span>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1b19560de11b73eaeaf6b44e910de20d11ac31473dac3904e9d32c6c747f85c6","category":"Cycling"}