{"title":"6 things I’ve learned about injury recovery","link":"https://www.bikeradar.com/features/opinion/6-things-ive-learned-about-injury-recovery/","date":1677920437000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/09/CanyonUltimate2022-79-3ec925301-0c75506.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/09/CanyonUltimate2022-79-3ec925301-0c75506.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2022/09/CanyonUltimate2022-79-3ec925301-0c75506.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/09/CanyonUltimate2022-79-3ec925301-0c75506.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/09/CanyonUltimate2022-79-3ec925301-0c75506.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/09/CanyonUltimate2022-79-3ec925301-0c75506.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/09/CanyonUltimate2022-79-3ec925301-0c75506.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/09/CanyonUltimate2022-79-3ec925301-0c75506.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/09/CanyonUltimate2022-79-3ec925301-0c75506.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Man riding a road bike out of the saddle\" title=\"CanyonUltimate2022-79-3ec9253_01\" />                                            <p>Injuries are among a cyclist’s worst nightmares.</p>\n<p>They derail everything you love about cycling, stopping you from riding the way you want to or, even worse, keeping you off the bike completely.</p>\n<p>Not only are they taxing on your body, but they can put strain on your mental health as well as your wider wellbeing and life.</p>\n<p>It’s tough, and when I spoke to <a href=\"https://www.bikeradar.com/author/bromleysimon/\">Simon von Bromley</a> recently about my ongoing experience with injury, it hammered home just how much it has affected me. Plus, it scratched away at the things I’ve learned about <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-tips-for-conquering-a-cycling-injury/\">injury recovery</a>.</p>\n\n<p>Even as a keen sportsman, I’ve been relatively lucky to have precious few physical setbacks throughout my life.</p>\n<p>So, the process has presented – if nothing else – a brilliant opportunity to firm up some well-established but often-ignored good practices for injury recovery. It’s also enabled me to get to grips with some new processes that might help you, too.</p>\n<h2>1. STOP!</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Ash had to manage his quite-fresh injury carefully through August 2022’s Canyon Ultimate launch.</span></figcaption><span> <i>Canyon</i></span></div>\n<p>Initially, it can be so tempting to keep on ploughing through a niggle or injury, in the vain hope it’ll ‘work itself out’ or fade away of its own accord.</p>\n<p>It might, but the chances are that excess discomfort or pain (beyond the usual exertions of training) is a sign something is amiss and it’s time to rest.</p>\n<p>How long you need to step away is always down to your specific circumstances and pain level, and your rate of recovery.</p>\n<p>Naturally, we all hope that with a few days or weeks off, the pain will have subsided and you’ll be ready to return to action (with care).</p>\n<p>However, stopping the activity for a short period enables your body’s initial inflammatory response to injury to subside, and enables you to focus on any root causes, rather than treating the symptom.</p>\n<p>In my case, the medial pain I initially felt in my knee turned out to be caused by a tight groin area, which didn’t become apparent until the aggravated knee pain (inflammation) had subsided.</p>\n<h2>2. Seek professional help</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Working with a sports therapist can be a massive help when trying to navigate your way through (hopefully temporary) physical limitations.</span></figcaption><span> <i>Caiaimage/Trevor Adeline</i></span></div>\n<p>The decision to consult with a sports therapist is one of the best I’ve made in the course of my recovery.</p>\n<p>I chose to have an initial assessment to help me understand the cause of my injury, then set up regular periodic sessions – every three to four weeks – for treatment and guidance.</p>\n<p>Engaging with an experienced professional is especially useful if you’re not sure how best to proceed or worried about making a problem worse.</p>\n<p>But I also found it very helpful to put aside my own expectations and ideas about how to proceed.</p>\n<p>Weeks of rest with occasional attempts to engage in gentle riding as a form of active recovery wasn’t working. While the discomfort had somewhat reduced in my knee, it had also migrated to other areas of my leg.</p>\n<p>It can be confusing and frustrating, not to mention inhibiting in general life. But being able to take a positive diagnosis and receive hands-on treatment from a professional enabled me to direct my rehabilitation process, and generally ease the mental burden of being unable to ride my bike.</p>\n<p>Personally, actively doing something to aid my recovery has proven (and continues to be) incredibly helpful as I look to build back better, stronger and more resilient than before.</p>\n<h2>3. Prehab is better than rehab</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Putting in the work off the bike so you’re prepared to ride can result in real progress.</span></figcaption><span> <i>Joseph Branston / Immediate Media</i></span></div>\n<p>Wait, isn’t ‘prehab’ just a different word for warming up?</p>\n<p>Sort of. The effects of <a href=\"https://www.bikeradar.com/advice/fitness-and-training/why-you-need-to-warm-up-before-a-hard-ride/\">warming up</a> effectively are well established, increasing muscle effectiveness and suppleness, as well as contributing to injury prevention.</p>\n<p>But prehab (short for prehabilitation) is the term I’ve got used to using under the advice of my sports therapist.</p>\n<p>This centres around the idea that, instead of simply jumping on the bike, being well prepared to ride the bike in the first place is far more effective at encouraging good movement patterns and protecting problem areas.</p>\n<p>In short, putting the work in before getting on the bike is better than riding, then addressing it when it could be too late.</p>\n<p>Of course, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/8-stretches-to-improve-your-flexibility-and-cycling-performance/\">stretching</a> afterwards and generally to loosen tight and tired muscles remains good practice.</p>\n<p>But engaging in a programme designed to strengthen and prepare your body, plus an active warm-up that specifically targets the injury area and those areas and chains affected by it right before you ride (known as preactivation), can be key when returning to activity.</p>\n<p>My experience over the past five months suggests there is definitely some merit to this approach.</p>\n<p>My prehab routine is now in full swing and established as a habit (whether I’m riding or visiting the gym). I find I’m able to train more effectively, and – importantly – with more confidence that my weaker areas are able to do what I’m asking of them.</p>\n<h2>4. Live healthily</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Images of healthy food are often used to convey overall lifestyle health, but remember that rest and recuperation – both physical and mental – are also important to manage.</span></figcaption><span> <a href=\"https://www.gettyimages.co.uk/detail/photo/cropped-view-of-table-laid-with-crockery-and-fresh-royalty-free-image/1032617410\"><strong>10'000 Hours / Getty Images</strong></a></span></div>\n<p>You’ve probably read a hundred times the well-published advice to eat a healthy balanced diet, as well as get the rest and recovery you need to support your goals.</p>\n<p>That advice remains golden, and is good whether you’re a full-time rider, or a weekend warrior.</p>\n<p>However, when cycling forms part of your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/30-great-benefits-of-cycling/\">wider healthy lifestyle</a> – in my case, it’s good for me physically and mentally – distraction from what you’re missing can be a good tactic. If you can’t ride for a period of time, I’ve found it’s a really good idea to try to focus on other areas of your training and broader life.</p>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>You might choose to take advantage of your time off the bike to rejig your training. I found stability and <a href=\"https://www.bikeradar.com/advice/fitness-and-training/strength-training-cycling/\">strength training</a> in the gym helped me (knowing it was still supporting my end goals), while a new sport that doesn’t stress the area could provide your exercise fix.</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div>\n<div></div>\n<div>If this isn’t possible, taking the time you would have spent training to do something else constructive – yes, DIY counts – can be a great way to distract yourself from the riding you’d normally be doing.</div>\n</div>\n<p>What works for you will be unique, but I’ve definitely found that fully embracing different activities has been an eye-opening and rewarding experience when cycling how I’d like hasn’t been on the cards.</p>\n<h2>5. Think about getting a bike fit</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Even if you’ve had a bike fit in the past, things may have changed and it may be worth revisiting.</span></figcaption><span> <i>BikeRadar</i></span></div>\n<p>With niggles and injuries part and parcel of an active cycling lifestyle (sadly), you may also want to consider a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-much-difference-does-a-bike-fit-make/\">bike fit</a>.</p>\n<p>Our bodies are ever changing, and the demands we place on them change with time too.</p>\n<p>This means that, even if you’ve had a bike fit before, a periodic update is likely a good idea to check that you’re not overly stressing a particular area of your body.</p>\n<p>In my case, a degree of fettling with my six-year-old fit (with the best of intentions) had exposed a natural imbalance. In turn, this had caused the stress to my groin and knee, injuring me to the point where returning to my old fit, even after complete rest, didn’t solve the problem.</p>\n<p>It took an injury for me to address my bike fit properly again – in the event, my saddle height dropped significantly and was pulled forward, while I was encouraged to swap the saddle itself and switch to a zero-setback seatpost. My cleats were moved too.</p>\n<p>But adopting this new position – and sticking with it despite feeling unnatural (different) initially – has paid dividends in tandem with my rehabilitation processes.</p>\n<p>I’m pedalling more smoothly now, almost completely pain-free, while I continue to work on my weaknesses. My sit bone-saddle interaction has markedly changed to effectively take some of the strain away from the problem area.</p>\n<p>I’m forced to conclude that it’s played a major role in getting me back on the bike and riding more comfortably, alongside the work put in to rebuild my strength and stability.</p>\n<h2>6. Patience is key</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Being able to ride again without worrying about a recurrence of an injury takes time and patience.</span></figcaption><span> <i>Markus Greber</i></span></div>\n<p>The path to recovery from significant injury is long and winding, and requires patience and dedication.</p>\n<p>Assuming you’re like me – an amateur, with a full-time job and life stresses (as opposed to a typical professional paid to race bikes) – it’s a significant challenge. It’s arguably more difficult than for those who have access to (or can afford) full-time rehabilitation support.</p>\n<p>Naturally, the type and severity of an injury largely sets the canvas on which to paint your recovery too.</p>\n<p>But inevitably, there are ups and downs to any recovery journey, and there will be setbacks to tackle.</p>\n<p>The ability to be disciplined – equally to stick to a well-considered plan and to listen to your body when that plan is taxing it too much – is important. Adapting your approach to training can help in the long run.</p>\n<p>For me (someone who loves to have a plan and stick rigidly to it), the risk of being off the bike for even longer than the initial two months’ rest was a key motivator. It helped me to train consistently, yet tweak things when they’re not quite right.</p>\n<p>While there are no guarantees that any recovery process will stick to a set timeframe, remaining patient and continuing to chip away at the task at hand will yield results.</p>\n<p>Plus, in a strange way, I’ve found it oddly rewarding too.</p>","author":"Ashley Quinlan","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"211b9d02c274091c062ca53a8c2763f5de2426b411c6d36d4b5f7f7af683f1c0","category":"Cycling"}