{"title":"Shadow Drop","link":"https://markpeak.net/shadow-drop/","date":1674961655000,"content":"<p>วงการเกมสัปดาห์ที่ผ่านมา มีปรากฏการณ์ที่น่าสนใจเรียกว่า “Shadow Drop” จาก<a href=\"https://www.blognone.com/node/132393\">การเปิดตัวเกมใหม่ Hi-Fi Rush แล้วเปิดขาย-เปิดให้เล่นเลยทันที</a> ถือเป็นวิธีทำการตลาดเกมที่น่าสนใจมากของปี 2023</p>\n<p>เรื่องมีอยู่ว่า ค่าย Microsoft/Xbox/Bethesda มีกำหนดโชว์รายละเอียดของเกมใหม่ (ที่เปิดตัวไปก่อนนานแล้ว) ใช้ชื่องานว่า Developer_Direct โดยประกาศล่วงหน้าเอาไว้ว่าจะพูดถึงเกม 4 เกมคือ Forza Motorsport, Minecraft Legends, The Elder Scrolls Online และ Redfall ทำให้แฟนๆ ต่างพูดคุยกันว่าเกมแต่ละเกมจะมีอะไรมาโชว์บ้าง ประกาศวันขายวันไหน ฯลฯ</p>\n<p>แต่พอถึงงานจริง ในคลิปแถลงกลับมีเกมที่ 5 โผล่มาด้วยคือ Hi-Fi Rush ของสตูดิโอ Tango Gameworks ในเครือ Bethesda</p>\n<p>ช่วงเปิดตัวเกม Hi-fi Rush อยู่นาทีที่ 15:13 เป็นต้นไป</p>\n<p></p>\n<p>เทรลเลอร์ของ Hi-Fi Rush</p>\n<p></p>\n<p>การเปิดตัวเกม Hi-Fi Rush นั้นสะสมพลัง “เซอร์ไพร์ส” หลายเด้ง เอามาปล่อยตูมเดียว ตั้งแต่</p>\n<ul>\n<li><strong>เด้งที่ 1:</strong> ไม่มีใครรู้มาก่อนว่ามีเกม Hi-Fi Rush ถูกพัฒนาอยู่ (มีหลุดก่อนงานเล็กน้อย แต่ก็ไม่ได้เป็นข่าวใหญ่อะไรนัก) อันนี้ถือเป็นเซอร์ไพร์สที่ทำกันทั่วไป</li>\n<li><strong>เด้งที่ 2:</strong> เกม Hi-Fi Rush พัฒนาโดยสตูดิโอ Tango Gameworks ของ Shinji Mikami บิดาแห่ง Biohazard/Resident Evil และที่ผ่านมาเขาสร้างเกมผีมาตลอด ทั้ง The Evil Within และ Ghostwire: Tokyo แล้วจู่ๆ มาเปิดตัวเกมแนวการ์ตูน สีสันสดใส ฉีกแนวสุดๆ</li>\n<li><strong>เด้งที่ 3:</strong> หลังเปิดตัวในคลิปแล้ว เกมวางขายทันที (จะซื้อแยกหรือเล่นผ่าน Game Pass ก็ได้) เกิด call to action ที่ทำได้เลยทันที นั่นคือ ดูคลิปจบ รออีกสักแปป กดดาวน์โหลดเกมมาเล่นได้เลย</li>\n</ul>\n<p>ในคลิปถึงขั้นต้องพูดซ้ำๆ ย้ำๆ ว่าเปิดให้เล่นวันนี้เลย เป็นเกมตัวเต็มด้วยไม่ใช่เดโม (Shinji Mikami คือคนซ้าย)</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2023/01/hifi2.jpg\" alt width=\"900\" height=\"506\" srcset=\"https://markpeak.net/wp-content/uploads/2023/01/hifi2.jpg 900w, https://markpeak.net/wp-content/uploads/2023/01/hifi2-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2023/01/hifi2-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2023/01/hifi2-700x394.jpg 700w\" /></p>\n<p>การเปิดตัวเกมแล้วเปิดให้เล่นเลยแบบไม่มีใครรู้ตัวมาก่อน จึงถูกเรียกกันว่า “shadow drop” นั่นเอง สื่อสายเกมจึงใช้คำนี้กันหมด</p>\n<blockquote>\n<p>Hi-Fi Rush was shadow dropped today! Have you tried it out on Game Pass yet? <a href=\"https://t.co/d3NhlW9J9y\">pic.twitter.com/d3NhlW9J9y</a></p>\n<p>— IGN (@IGN) <a href=\"https://twitter.com/IGN/status/1618406279139164161?ref_src=twsrc%5Etfw\">January 26, 2023</a></p></blockquote>\n<p></p>\n<p>นอกจากจังหวะกลายปล่อยเซอร์ไพร์สทีเดียวก้อนใหญ่แล้ว ยังมีปัจจัยอีกหลายอย่างที่ช่วยดันให้เกมน่าสนใจและถูกพูดถึงกันมาก</p>\n<ul>\n<li><strong>เด้งที่ 4:</strong> สไตล์เกมแนวการ์ตูน cell-shade แบบ Hi-Fi Rush ไม่ค่อยมีคนทำในช่วงหลังๆ คือมักไปแนวภาพสมจริงกันหมด เกมแนว cell-shade ผสมดนตรี อาจต้องย้อนไปไกลถึงยุค Jet Set Radio โน่นเลย ต้องบอกว่า Tango กล้าตัดสินใจฉีกแนวจริงๆ แล้วประสบความสำเร็จ</li>\n<li><strong>เด้งที่ 5:</strong> ช่วงเดือนมกราคม 2023 ดันไม่ค่อยมีเกมออกใหม่ในช่วงนี้พอดี เพราะรอบการออกเกมใหญ่ๆ มักไปใส่กันช่วงก่อนคริสต์มาส (ประมาณเดือน ตค.-พค.) กันหมดแล้ว เกมใหญ่ช่วงเดียวกันนี้มีเพียง Dead Space Remake กับ Forspoken (เป็น exclusive PS5 ที่รีวิวออกมาไม่ดี) ทำให้ Hi-Fi Rush มีคนสนใจและลองเล่นกันมาก (ยุทธศาสตร์เรื่องเวลานี้ Elden Ring ทำสำเร็จมาก่อนในช่วงต้นปี 2022)</li>\n<li><strong>เด้งที่ 6:</strong> เกมราคาไม่แพงด้วยคือ 29.99 ดอลลาร์ เทียบกับเกมระดับ AAA ยุคนี้ที่ตั้งราคากัน 69.99 ดอลลาร์ไปแล้ว ลดความคาดหวังของผู้เล่นลงได้ว่าเกมจะต้องดีมาก คือถ้าเกมราคาแค่ครึ่งเดียวของปกติ คนก็ไม่ได้คาดหวังว่าต้องดีสุดยอด แค่ดีประมาณนึงก็โอเคแล้ว</li>\n<li><strong>เด้งที่ 7:</strong> แต่เกมก็ดันทำออกมาดีด้วยอีกต่างหาก <a href=\"https://www.metacritic.com/game/xbox-series-x/hi-fi-rush\">คะแนนรีวิวเฉลี่ยจากนักวิจารณ์ 88/100 และคะแนนรีวิวจากผู้ใช้ 9.2/10</a> ถือว่าค่อนข้างดีเลย ปัจจัยบวกยิ่งเยอะ คนที่สนใจเล่นก็กล้าซื้อ แถมพอยุคนี้มี Game Pass ทำให้คนกล้าลองเกมใหม่ๆ เพราะไม่ต้องจ่ายเพิ่ม</li>\n<li><strong>เด้งที่ 8:</strong> การทำ Shadow Drop เปิดตัวเกมแล้วขายทันที โดยไม่ส่งให้สื่อรีวิวก่อน (สื่อไม่รู้ด้วยซ้ำว่ามีเกมนี้อยู่) ทำให้ไม่มีรีวิวจากสื่อเลยในช่วงวันแรกๆ ที่เปิดขาย มีแต่การบอกกันปากต่อปากของผู้เล่นล้วนๆ บนโซเชียล พอเกมคุณภาพดีเป็นทุนอยู่แล้ว เลยยิ่งเกิดการไฮป์เข้าไปอีก</li>\n</ul>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2023/01/hifi3.jpg\" alt width=\"1080\" height=\"1545\" srcset=\"https://markpeak.net/wp-content/uploads/2023/01/hifi3.jpg 1080w, https://markpeak.net/wp-content/uploads/2023/01/hifi3-210x300.jpg 210w, https://markpeak.net/wp-content/uploads/2023/01/hifi3-716x1024.jpg 716w, https://markpeak.net/wp-content/uploads/2023/01/hifi3-768x1099.jpg 768w, https://markpeak.net/wp-content/uploads/2023/01/hifi3-1074x1536.jpg 1074w, https://markpeak.net/wp-content/uploads/2023/01/hifi3-489x700.jpg 489w\" /></p>\n<p>Phil Spencer ในฐานะบอสใหญ่ของ Xbox ก็<a href=\"https://www.ign.com/articles/phil-spencer-interview-2023\">ยอมรับว่ายุทธศาสตร์นี้เวิร์คมากในเคสนี้</a> และเล่าว่าไอเดียนี้มาจากทีมผู้สร้างเอง</p>\n<blockquote><p>Phil Spencer, Microsoft Gaming CEO: Yeah, <strong>the shadow drop, it seems like it worked really well this time.</strong> It’s not a thing we’ve done a ton of. This was an idea from the team. They’d been playing the game, felt good about their launch date and some of the early signals on quality, and said, “Hey, it would just be fun. It would just be fun to be able to launch this during the Developer Direct and say, ‘Play it now.'” So we rolled with that. We’re always learning, always listening, and it seems like the community’s responding well, which I think is a good signal.</p></blockquote>\n<p>การตลาดของเกม Hi-Fi Rush จึงเป็นสิ่งที่น่าจดจำ แม้อาจไม่ใช่ครั้งแรกของวงการเกม แต่ก็เป็นกรณีศึกษาที่ดีว่าสิ่งที่ทำแล้วประสบความสำเร็จเป็นอย่างไร</p>\n<p>บทความนี้มีพูดถึง Shadow Drop ในอดีตว่าเกมไหนทำแล้วสำเร็จมาบ้าง ตัวอย่างที่คนนึกถึงกันคือ Apex Legends และ PT</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.thegamer.com/hi-fi-rush-best-shadow-dropped-games-apex-pt/\">\n\t\t\t\t\t<img src=\"https://static1.thegamerimages.com/wordpress/wp-content/uploads/2023/01/17-following-hi-fi-rush-gamers-discuss-best-shadow-dropped-games-from-apex-to-pt.jpg\" alt=\"Following Hi-Fi Rush, Gamers Discuss Best Shadow-Dropped Games From Apex To PT\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.thegamer.com/hi-fi-rush-best-shadow-dropped-games-apex-pt/\">\n\t\t\tFollowing Hi-Fi Rush, Gamers Discuss Best Shadow-Dropped Games From Apex To PT\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.thegamer.com/hi-fi-rush-best-shadow-dropped-games-apex-pt/\">\n\t\t\t<p>Maybe more big names should shadow drop their games.</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://www.thegamer.com/public/build/images/favicon-48x48.1631f6a1.png\" alt=\"TheGamer\" />\t\tTheGamer\t</div>\n</div>The post <a href=\"https://markpeak.net/shadow-drop/\">Shadow Drop</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"3273e03a148221367a8929a327335fe903bece700638e678697d8b965736286b","category":"Thai"}