{"title":"Introducing Tech Editor Alvin Holbrook","link":"https://cyclingtips.com/2023/03/introducing-tech-editor-alvin-holbrook/","date":1677707403000,"content":"<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2023/03/alvin_hero.jpg?width=1200\" alt=\"Introducing Tech Editor Alvin Holbrook\" /></figure><p><span>We are proud to welcome Alvin Holbrook to the Outside Road/Gravel team as a new Tech Editor. We asked him a few questions to learn more about his history with cycling, as well as what he likes to do away from the bike.</span></p>\n<p><b>What was your first bike? </b></p>\n<p><span>My first two bikes or so were Walmart workhorses. I really got into caring about my bicycle on a 20″ Pacific full suspension bike. It had a Shimano derailleur out back; today I know it to be sub-Tourney level of quality but for 11-year-old me, that was a point of pride that I could justify to kids who knew less than I did.</span></p>\n<p><span>The bike that really got me to fall in love with cycling, however, was a Bridgestone 500. Here’s the </span><a href=\"https://us01.z.antigena.com/l/6G5V7KEQnE9DHgS0iAt5S56bT9jyNbRfCupC-sC7Lz0BtfCztrfhwJM8-UhkpXRhkKHoXr2dMG5zTjv~aZi4wFeVWxT5~sGOjW6KOpnHKt5Cj2S6uyl~ASZVKGhLffSNPrVvuUfsayhY4RFFAnbrYkrXp5zygU-NjVMDr9Ai9X7kHskYOXFZoSCfZuE87nBUvQ\" target=\"_blank\"><span>catalog version courtesy of Sheldon Brown</span></a><span> but mine was a metallic blue.  Mine came to me stock, and like lots of road bikes in the late 00’s to early aughts, I made mine a sweet fixie. </span><a href=\"https://us01.z.antigena.com/l/DmV-3cakq6PFHBy-1KiloS6_E0lkD6dgEqlpKoAkbZf22cY-JRhiDN_O_jlJT_euKU_1Z-zSxSmwOX6fVXY5wjJ0P07GWPl_vGSlWKmrTQDfPLqP4nDbHP2MUoW16AIXH0IwDsffoTzolMds7MzUmmVp~JaIQk\" target=\"_blank\"><span>Here’s the link to the velospace I made for it</span></a><span>, if anyone remembers that site. Unfortunately I don’t have any other images of it. I loved that bike dearly, though, and I still have the original pedals from that bike as a keepsake.</span></p>\n<figure><img loading=\"lazy\" src=\"https://cyclingtips.com/wp-content/uploads/2023/03/bridgestonealvin.png?width=604\" alt width=\"604\" height=\"402\" /><figcaption><span>A Bridgestone 500 kicked off Alvin’s love for the bike.</span></figcaption></figure>\n<p><b>How do cycling and freedom relate for you?</b></p>\n<p><span>Cycling was a form of freedom for me. I think that’s the case with almost everyone who gets into cycling to some degree. Maybe someone gets into cycling recreationally, and there’s a freedom that comes with pushing yourself physically and mentally. I certainly appreciate that. My experience of freedom in the bicycle was in a much more practical sense. My family had one car, but I grew up just outside of downtown Sacramento, California. Most things were within walking distance, but there was a whole new world within biking distance. </span></p>\n<p><span>I didn’t have to settle for a walk through local alleyways; I could ride to the American River Bike Trail. I didn’t have to wait for my mom to give me a ride to my friend’s house for a sleepover; I could take my bicycle. And importantly, sneaking out at midnight for a hot donut didn’t mean I was gone for an hour; I was gone for 20 minutes, maybe 15 if the line at Marie’s Donuts was short. </span></p>\n<p><span>A bicycle provided me with autonomy that I could never have dreamed of if I decided to wait until I was 16 to pursue my driver’s license. </span></p>\n<p><b>A perfect day off the bike?</b></p>\n<p><span>I haven’t done this in a while, but I would say I’d wake up in my tent after having arrived for a quick overnight bikepack/ride thing. Grant Peterson calls it a sub 24-hour overnighter. I’d ride back in time to hit the market for some ingredients. Then I’d finally fix the sunroof issue in my Volkswagen, help my wife with whatever puzzle or project she’s in the midst of, and then finish the day by cooking whatever ingredients I bought earlier in the day. I’ve been on a big pizza kick lately, so probably something with that. </span></p>\n<p><b>Tell us about your work with San Antonio Gravel Collective.</b></p>\n<p><span>San Antonio Gravel Collective! So we belong to a network called the Gravel Collective, which recently became a 501c3! I am the leader for the San Antonio chapter, which was the second of these chapters. It isn’t too different from something like Radical Adventure Riders if you’re familiar with that, just with more of a gravel ride flavor and a lil less bikepacking going on. The goal is to be an inclusive space for folks generally underrepresented in gravel cycling, namely FTWNB, BIPOC, and others. </span></p>\n<figure><img loading=\"lazy\" src=\"https://cyclingtips.com/wp-content/uploads/2023/03/gravelcollective-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" /><figcaption><span>The San Antonio Gravel Collective.</span></figcaption></figure>\n<p><span>What I’m doing as chair is organizing monthly rides in different places around the area. Each ride has a leader, but they are more a sag at the back to make sure nobody is left behind. We usually have a few route options too: one that’s easy and short and usually one or two others for folks who want to ride farther and/or faster.</span></p>\n<p><span>We also do quarterly how-to nights or get togethers. Our most recent one was off-bike strength for folks addicted to cycling. Was pretty fun. </span></p>\n<figure><img loading=\"lazy\" src=\"https://cyclingtips.com/wp-content/uploads/2023/03/alvin-1340x1787.jpg?width=730\" alt width=\"1340\" height=\"1787\" /><figcaption><span>Alvin and his gravel bike.</span></figcaption></figure>\n<p><b>And your work with Bike San Antonio? </b></p>\n<p><span>Bike San Antonio is a group in the city advocating for better transportation infrastructure for marginalized groups, namely people walking or riding bikes. We’re currently conducting a general survey to understand everyone’s comfort in navigating the city. This will be presented to the city’s planning committee later this summer. It honestly isn’t the most organized thing in the world, but there are a lot of problems in this city and someone needs to tell the city to stop building dangerous roads.</span></p>\n<p><span>I joined Bike San Antonio as a board member largely due to my interest in city planning. Most people have an opinion about their city, particularly when it doesn’t work in their favor. I studied city planning and civil engineering, so with Bike SA, I can bridge the gap between folks who don’t want to have to get mad at cyclists, and the city planners, engineers, and local politicians who actuate change. </span></p>\n<p><span>The way I see it, a city should be safe enough for young Alvin to get around on his Bridgestone without his parents worrying that he’ll get hit in an intersection by a driver. It should be safe enough for your grandparent to walk to the local grocery store, and for everyone in between. That’s what I’m trying to fight for with Bike San Antonio. </span></p>\n<p><b>What are your passions outside of cycling? </b></p>\n<p><span>I’m a big car nerd. I haven’t had a cool car in a few years but I love a boxy 80’s Volvo wagon, a base Mitsubishi Mirage hatchback, and a Mercedes-Petronas F1 car all the same.</span></p>\n<p><span>I care about cooking and food, and I love cooking for my wife, Nekel.</span></p>\n<p><span>I play the drums! I was in a band in high school and haven’t really done anything since but I’ll play along to a Tiny Desk concert whenever I have the bandwidth.</span></p>\n<p><span>Basketball is my favorite sport. While in high school I wrote for Sactown Royalty, a blog which Vox/SB Nation recently dropped. Big bummer. One of my favorite memories was writing a piece about DeMarcus Cousins about why he’s a perfect fit in Sacramento, and then seeing him a week later at a party and telling him about the story. Great stuff. I also have a really silly substack that houses all of my silly basketball musings. </span></p>","author":"Will Tracy","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"497cb9f1f0750cb937e2bd432ac9466a339ecc64b912539200e809431d6d6225","category":"Cycling"}