{"title":"Trailblazer: Marianne Martin","link":"https://www.cyclingtips.com/2023/03/trailblazer-marianne-martin/","date":1678284032000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/MARTIN_HERO-1.webp?width=1200\" alt=\"Trailblazer: Marianne Martin\" /></figure><p>In a small cottage in Boulder, Colorado, a yellow jersey hangs in a closet. It belongs to Marianne Martin, and when I say it belongs to her, I mean that in the truest sense—she won it. Martin was America’s first <a href=\"http://velonews.com/tag/tour-de-france\" target=\"_blank\">Tour de France</a> winner. In 1984, she blasted into Paris in yellow and stood on the podium next to <a href=\"http://velonews.com/tag/laurent-fignon\" target=\"_blank\">Laurent Fignon</a>, beaming at the crowds and the legion of photographers. It’s a powerful image. There is no visible hierarchy there; it’s simply a man and woman side by side, both in yellow, both winners of the Tour de France.</p>\n<p>When I spoke to Martin over a crackly phone line from London, she was recovering from breaking some ribs after falling from a horse. She’s modest, effervescent, intelligent. And underneath you can detect the steely character that took her all the way to Paris.</p>\n<figure><img loading=\"lazy\" src=\"https://www.pelotonmagazine-digital.com/pelotonmagazine/july_2015/data/articles/./img/Pc1050000.jpg?width=730\" alt=\"Pc1050000\" width=\"929\" height=\"631\" /><figcaption>Image courtesy, Marianne Martin.</figcaption></figure>\n<p>Martin turned to cycling after a back injury ended her running career. She did well at her first race and, as she told me: “There was a great party afterwards, so I thought I’d stick with cycling. It took a couple of years for me to get to the top level. I was always a good climber, which I put down to dancing as a child. Dancing is great for strong legs. I found a coach called Tim Kelly who did a lot of work with me on visualization, which was very unusual back then, and is still surprisingly rare now. Around the same time I met two doctors who worked with cancer patients; they made me tapes, which I listened to every morning and evening, about building strength, about seeing pain as a positive element.”</p>\n<p>Coming into the 1984 season though, Martin wasn’t feeling as strong as she would have liked. Every spring, as her training levels intensified, she would get anemic and lose condition. It was only when her father, a doctor, diagnosed the precise form of anemia she suffered from that she was able to begin adapting her training. With the support of coach Andy Pruitt, Martin learned the importance of balancing rest with training activity.</p>\n<p>“Once I understood the anemia, I could manage it by going into each training cycle more conservatively. I rested a lot more than anybody else I was racing against. I knew how to let my body build back up. As soon as I heard there was going to be a women’s Tour de France, I wanted to do that race. I didn’t care about any other race. I had to do the Tour. So I started training smartly, going hard then recovering, going hard then recovering, working in planned cycles. I hung out with male riders a lot and learned from them. I watched people over-train all the time, and learned the importance of rest. Everything I did was very specific. I didn’t have any junk miles.”</p>\n<p>The hard work paid off. Martin was selected for the U.S. national team for the Tour de France Féminin, as it was called, but only just—she was the last name to be confirmed. When given the news, she told the team coach, the legendary Eddie B: “Believe me, you won’t be disappointed.”</p>\n<p>The women rode 18 stages, following the same course as the men, but with the early parts of the course cut out to shorten the distance. The Tour Féminin stages finished two hours before the men each day and so enjoyed the same huge crowds. Martin remembers that the race organizers were keen to whisk the women’s peloton away from the finish area as quickly as possible. There was little interaction with the men. One wonders whether it was entanglements of the logistical kind that the organizers feared, or entanglements of the romantic kind.</p>\n<p>The American team proved dominant, winning the overall, the team classification and the polka-dot climber’s jersey. Deborah Shumway, finishing third, joined Martin on the podium. In the early, flat stages the Dutch team showed their strength, with Heleen “Keetie” Hage emerging as race leader. But as the race progressed, Martin’s powers of recovery, and her climbing prowess, came into their own. She took the yellow jersey late in the race, on stage 14, and her lead was quickly decisive.</p>\n<figure><img loading=\"lazy\" src=\"https://www.pelotonmagazine-digital.com/pelotonmagazine/july_2015/data/articles/./img/Pc1070000.jpg?width=730\" alt=\"Pc1070000\" width=\"929\" height=\"622\" /><figcaption>[LEFT to RIGHT]: Marianne Martin, Jane Seymour, Laurent Fignon and a shirtless Cyrille Guimard.</figcaption></figure>\n<p>Riding into Paris in yellow was an incredible moment for the young American, originally from Fenton, Michigan. Standing on the podium alongside Fignon, Greg LeMond, Bernard Hinault and Robert Millar was the culmination of a lot of hard work. And then there was the after-party.</p>\n<p>“The party in Paris was a crazy, crazy night. I didn’t speak much French but the actress Jane Seymour was there and she interpreted between me and Fignon.”</p>\n<p>What a beautiful image. The elegant English actress translating between two Tour de France winners, a young Frenchman with Warhol hair and the vivacious Midwesterner who has surprised everyone to arrive on the Champs-Élysées in yellow.</p>\n<p>The Tour de France Féminin was the peak of Martin’s cycling career, and was somewhat overshadowed—in the States at least—by the Olympic Games later that summer in Los Angeles. The Tour Féminin continued in the same format until 1989 but then began a slow decline, losing stages and rider numbers. In 1998, it was forced to change its name to La Grande Boucle, and the decline went on until 2004 when the race was discontinued. Although it later restarted with different organizers, the race never had the same authority and profile as it did in the mid-1980s.</p>\n<p>The failure of the race during the 1990s and beyond reflects the wider issues that still affect women’s cycling. Without media coverage, sponsorship money is meager, and organizers cannot make their business cases stack up. There may be some old-fashioned sexism in the mix too, but Martin believes that money is the key to unlocking women’s racing. “If you can find the money,” she said. “They’ll let you put the bike race on. I won $1,000 at the Tour and had to share that with my team. I paid for my own flight to New York, to get to Paris. I funded everything myself, bought my own bikes, got into debt to fund my career.”</p>\n<p>With events like La Course on the Champs-Élysées and the expansion of the UCI calendar, women’s cycling is showing the green shoots of recovery. Martin’s local race, the USA Pro Challenge has just announced an inaugural event for women in 2015, over three stages. But there’s still some way to go before the calendar looks as healthy as it did three decades ago. “The skill level of the women continues to grow, but there were so many great races back then,” Martin said.</p>\n<p><img src=\"https://www.pelotonmagazine-digital.com/pelotonmagazine/july_2015/data/articles/./img/Pc1090000.jpg?width=730\" alt=\"Pc1090000\" /></p>\n<p>And now? Martin runs a photography business. She rides horses not bikes, and falls off them from time to time. And recently she’s been thinking again about some of the techniques that took her to victory in Paris. “I would love to work with young women riders on visualization. I’m a firm believer in how important sport is for people, and how important sport is for kids.”</p>\n<p>A truly independent spirit, Marianne Martin blazed a trail for American cycling, and she did so simply because she loved the sport, loved the opportunities it gave her, and she had the grit to fight her way to success. Though I love this sport, I’ve always struggled to really find a rider to root for, a hero to follow. Maybe I just found that rider. Now if only I could go back 31 years….</p>\n<p><i>This story originally appeared in issue 43 of Peloton magazine.</i></p>","author":"Will Tracy","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"50fe26944b96be0b8138f21d6bfdf0ea78d0baf944e60f82d3e539dabf3cfbd8","category":"Cycling"}