{"title":"Strava Adds Photo Crowdsourcing For Routes: Here’s How it Works!","link":"https://www.dcrainmaker.com/2023/02/strava-photos-crowdsourcing-routes-review.html","date":1676628515000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2023/02/Strava-Routes-Photo-Crowdsourcing.jpg\"><img title=\"Strava-Routes-Photo-Crowdsourcing\" src=\"https://media.dcrainmaker.com/images/2023/02/Strava-Routes-Photo-Crowdsourcing_thumb.jpg\" alt=\"Strava-Routes-Photo-Crowdsourcing\" width=\"720\" height=\"480\" /></a></p>\n<p>Strava has added the ability to see photos uploaded to the platform from other users to the route planning tools in their smartphone app. This means that if you use any of the route functions on the Strava app, you can see other geotagged photos in a new panel along with other route details. For those of you familiar with route <a href=\"http://www.komoot.com\">planning platform Komoot</a>, this will seem pretty familiar.</p>\n<p>The idea being that you can better scope out the details of a route ahead of time by looking at actual photos, versus just satellite imagery taken from <a href=\"https://en.wikipedia.org/wiki/Geostationary_orbit\">800km above the earth.</a> As one who often uses Komoot specifically for photos to cross-reference routes in new territory areas, this has the potential to be super interesting. In information <a href=\"https://www.theverge.com/2023/2/16/23601087/strava-app-photos-route-trail-conditions\">provided to The Verge</a>, Strava says that “the platform has roughly 2.3 million photos from 200 million user-uploaded public activities in the past year to pull from. It estimates that more than 30,000 photos will be added to the Routes feature weekly from Strava users all over the world.”</p>\n<p>Now, before we start diving into some examples – some quick baselining:</p>\n<p>A) Theoretically no pictures with faces will show up (but people from behind might)<br />\nB) Theoretically no pictures with “identifiable gear” will show up<br />\nC) It appears to only include photos from 2022/2023<br />\nD) You can opt-out of this option in your settings (Settings &gt; Privacy Controls &gt; Public Photos on Routes)<br />\nE) Photos will not show from ANY Private activity or profile<br />\nF) It’s only available on the app at this time (not the website)<br />\nG) You need to be on at least app version 294<br />\nH) Only Strava-paid members can use the route planning tools, however, anyone can view existing routes (e.g. from someone else)<br />\nI) It does not show any photos taken inside one of your privacy zones (e.g. near your house)</p>\n<p>Got all that? Good, let’s get rolling. Last night I actually created a route for this morning’s long run. The purpose of creating this route was more about distance planning than exploring new lands. If I tap on the route, I see a new panel at the very top (above elevation) with the photos.</p>\n<p>I can swipe left/right through the photos, tap on any individual photo for a bigger view, or, I can tap to see all photos along the route (up to 200 of them):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/02/clip_image001-2.png\"><img title=\"clip_image001\" src=\"https://media.dcrainmaker.com/images/2023/02/clip_image001_thumb-2.png\" alt=\"clip_image001\" width=\"237\" height=\"511\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/02/clip_image0016-1.png\"><img title=\"clip_image001[6]\" src=\"https://media.dcrainmaker.com/images/2023/02/clip_image0016_thumb-1.png\" alt=\"clip_image001[6]\" width=\"237\" height=\"511\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/02/clip_image0018-2.png\"><img title=\"clip_image001[8]\" src=\"https://media.dcrainmaker.com/images/2023/02/clip_image0018_thumb-2.png\" alt=\"clip_image001[8]\" width=\"237\" height=\"511\" /></a></p>\n<p>It’ll show a little tag if the photo was recent, including in the last two weeks. So, the question is, if I went out and ran that route, and added photos, would any of them show up in the collection? So yesterday morning, I then went out and ran said route, and added a smattering of photos taken along the way to my Strava activity upload today. In short, no, none did. In fact, I even narrowed it down to relatively specific mostly empty sections – and none of them showed up (even when Strava only offered just a couple other photos, one recent). I suspect there may be some sort of nightly process to pull these in, but as of 22 hours later, the photos aren’t showing up yet – which, is perfectly logical. I’ll check again tomorrow to see if any of my photos got pulled in.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7102.png\"><img title=\"IMG_7102\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7102_thumb.png\" alt=\"IMG_7102\" width=\"357\" height=\"770\" /></a><a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7101.png\"><img title=\"IMG_7101\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7101_thumb.png\" alt=\"IMG_7101\" width=\"357\" height=\"770\" /></a></p>\n<p>As an aside, for some other nearby routes, I’ve seen some really stunning photos in here – it’s kinda impressive. I’m not sure if Strava is doing some sort of higher-level filtering to get rid of random junk, or if Strava users just take good photos. The same goes for up in the mountains (where it’s a bit easier to take interesting photos).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7090.png\"><img title=\"IMG_7090\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7090_thumb.png\" alt=\"IMG_7090\" width=\"224\" height=\"482\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7091.png\"><img title=\"IMG_7091\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7091_thumb.png\" alt=\"IMG_7091\" width=\"224\" height=\"482\" /></a>  <a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7093.png\"><img title=\"IMG_7093\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7093_thumb.png\" alt=\"IMG_7093\" width=\"224\" height=\"482\" /></a></p>\n<p>Next, let’s compare a <a href=\"https://www.strava.com/activities/6502809849\">trail/hiking route I did about a year ago</a> (in the Canary Islands, Tenerife), where I very explicitly used Komoot ahead of time to try and figure out just how scenic the route was. In fact, it was so scenic I filmed my Garmin Epix In-Depth Review video from an amazing spot on the trail (<a href=\"https://www.youtube.com/watch?v=7mZRmAJ4zyw\">check it out</a>). In this case, no photos from my hike (from January 2022) showed up, which is fine, but plenty of others’ perfectly good ones did (85 in total).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7103.png\"><img title=\"IMG_7103\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7103_thumb.png\" alt=\"IMG_7103\" width=\"357\" height=\"770\" /></a><a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7104.png\"><img title=\"IMG_7104\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7104_thumb.png\" alt=\"IMG_7104\" width=\"357\" height=\"770\" /></a></p>\n<p>Meanwhile, for that same route, Komoot also shows photos, but, it gives me the map sections these photos are on. Whereas Strava just gives me a giant bucket of all photos from the entire route, with no location information. Having the context on where the photo is taken is useful for perhaps picking certain chunks of a route (or avoiding certain chunks).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/02/Komoot.png\"><img title=\"Komoot\" src=\"https://media.dcrainmaker.com/images/2023/02/Komoot_thumb.png\" alt=\"Komoot\" width=\"722\" height=\"530\" /></a></p>\n<p>Next, let’s take a look at a route in an even less populated area – on the Canadian island of Newfoundland, where my wife grew up. I usually end up there once a year, and while there are plenty of people there – there are less on Strava, and even less uploading photos to Strava. Still, this is a popular route with trail runners in the area, and is maintained by a local trail society. Unfortunately, no photos showed up at all (middle screenshot below) – despite me being able to easily find photos in just the Top 10 leaderboard of a segment along the route (right screenshot below).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7109.png\"><img title=\"IMG_7109\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7109_thumb.png\" alt=\"IMG_7109\" width=\"224\" height=\"482\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7108.png\"><img title=\"IMG_7108\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7108_thumb.png\" alt=\"IMG_7108\" width=\"237\" height=\"510\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7110.png\"><img title=\"IMG_7110\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7110_thumb.png\" alt=\"IMG_7110\" width=\"237\" height=\"510\" /></a></p>\n<p>But in looking, the photos that did show up here were from 2020. And that’s when I realized it was limited to basically 2022/2023 photos only. I haven’t seen a single photo in any of the lists from 2021 or previous years. Perhaps they’re trying to limit things quality-wise, but in some lesser-visited regions, that’s also limiting their options considerably.</p>\n<p>Now, there are really three main gaps I’d like to see addressed here:</p>\n<p><strong>A) Showing where the heck the photo was taken:</strong> Right now when I create a route (say 80KM), I have no idea where on that route the photos shown were taken. It just gives me a giant pile of photos. I’d really like to be able to tap on a photo and see (roughly) where it was taken. This would allow me to perhaps tweak routes with the best (or worst) parts taken into account.</p>\n<p><strong>B) Doesn’t show for segments:</strong> Totally understand that Strava had to start somewhere, but I’d like to see this exact same UI shown on the Segment panel. That’d be great, and really help with both hyper-specific route sections, as well as just checking out segments individually from a competition standpoint.</p>\n<p><strong>C) Show older photos:</strong> I’m not saying I need to see photos from 2013 (maybe…), but I think 2020 photos are still totally valid here, and would fill in the gaps in less populous places.</p>\n<p>Inversely, I do like:</p>\n<p>A) The tag showing “last two weeks” and “last month” tags on photos</p>\n<p>B) Either Strava users take really damn good photos, or Strava seems to be adding some logic to pick the nicest photos (using whatever algorithm they have). I’m mildly astounded at how good some of these photos are (not resolution-wise, but composition, lighting, etc…)</p>\n<p>C) The overall presentation is pretty good here, super easy to find, and not buried deep somewhere.</p>\n<p>Finally, if you want to turn this off, you can do so under the settings (Settings &gt; Privacy Controls &gt; Public Photos on Routes):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7094.png\"><img title=\"IMG_7094\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7094_thumb.png\" alt=\"IMG_7094\" width=\"357\" height=\"770\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/02/IMG_7095.png\"><img title=\"IMG_7095\" src=\"https://media.dcrainmaker.com/images/2023/02/IMG_7095_thumb.png\" alt=\"IMG_7095\" width=\"357\" height=\"770\" /></a></p>\n<p>Overall, it’s a good addition, and with a few minor tweaks could be even more useful. Of course, it’s worth pointing out though that if converting subscribers is the goal, then Strava just added yet another feature to the free tier – giving less of a reason to pay the subscription fee. At some point, Strava has to decide what their subscription strategy is. Thus, even when they do cool tech things – that doesn’t seem to be aligned with whatever the business strategy is.</p>\n<p>Speaking of which, as a casual reminder, Strava still hasn’t sent an e-mail out <a href=\"https://www.dcrainmaker.com/2023/01/strava-responds-pricing-country.html\">about their price increases</a>. <a href=\"https://www.pelobuddy.com/price-increase-august-2022/\">Peloton did</a>, <a href=\"https://www.dcrainmaker.com/2023/01/trainerroad-raises-prices-optional.html\">TrainerRoad did</a>, <a href=\"https://www.dcrainmaker.com/2023/02/trainingpeaks-slightly-mywhoosh.html\">TrainingPeaks did</a>, and just yesterday, <a href=\"https://www.dcrainmaker.com/2023/02/subscription-features-lifetime.html\">Whoop even sent out an e-mail about price decreases</a>. Still waiting…</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"5d5d8340ef5c2c6ad1a9f6add01b02a72e3a2ec64b62ffc1a79dc88198ba8cc9","category":"Cycling"}