{"title":"Apple’s yellow iPhone is a red flag for the likelihood of a spring event","link":"https://www.macworld.com/article/1534315/yellow-iphone-spring-event-macbook-air.html","date":1678298861000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>Good news: There’s a <a href=\"https://www.macworld.com/article/1534034/iphone-14-plus-yellow-color-announced.html\">yellow iPhone 14</a>. Bad news: This probably means Apple has given up on the idea of an <a href=\"https://www.macworld.com/article/1484151/apple-spring-2023-event-date-time-how-to-watch-rumors.html\">Apple spring event in 2023</a>.</p>\n\n\n\n<p>We’ve <a href=\"https://www.macworld.com/article/1519210/why-apple-is-probably-skipping-the-spring-event-this-year.html\">suspected this</a> for a while, in fact. Apple originally planned to focus on its long-awaited AR headset in this year’s spring event, but the latest round of rumored delays means that’s unlikely to happen. (I say “latest,” but that’s not quite true: even more reported delays mean the headset might not appear <a href=\"https://www.macworld.com/article/1523516/reality-pro-ar-headset-september-iphone-event-launch.html\">until the fall</a>.) In the absence of the headliner, there was always a strong possibility that Apple would pull the event entirely.</p>\n\n\n\n<p>The launch of a new iPhone color, however, elevates the no-event theory from “strong possibility” to “near certainty.” The last two spring events have seen similar announcements: the Alpine Green iPhone 13 Pro was unveiled at the Peek Performance event in March 2022, while the purple iPhone 12 made its debut at the Spring Loaded event in April 2021. If Apple still planned to hold an event in spring 2023, it would <em>surely</em> wait until it had the world’s attention to reveal the yellow iPhone 14. The only possible reason to launch it now would be to trick pundits into thinking there won’t be an event… which isn’t an <em>impossible</em> theory given Apple’s fondness for discrediting leakers but is unlikely.</p>\n\n\n\n<p>After all, spring events don’t happen every year. Sure, there was one last year and the year before, but not in 2020 (though the beginning of the Covid pandemic might have upset Apple’s plans for an event that introduced the iPhone SE, 4th-gen iPad Pro, and Magic Keyboard). There were spring events in 2018 and 2019, but not in 2017. We get used to routines, but that doesn’t mean they’re set in stone. And aside from the logistical hassle, holding an event when you haven’t got anything earth-shattering to talk about risks reducing your audience’s interest the next time you send out invitations.</p>\n\n\n\n<p>Mind you, there’s a wild card that could render this whole theory moot. Apple is believed to have something quite interesting up its sleeve that could arrive as early as April. This spring’s “surprise,” if you can use that term for a product that’s been leaked as widely as this, is the arrival of the 15-inch MacBook Air and the early arrival of the <a href=\"https://www.macworld.com/article/1532945/macbook-air-m3-chip-15-inch-spring-summer-2023.html\">M3 chip</a>, which was expected in late 2023 or early 2024 but could feasibly appear in April. </p>\n\n\n\n<p>Just as the announcement of the yellow iPhone means there probably won’t be a spring event, perhaps the lack of a spring event means the MacBook Air either isn’t coming yet. Or it’s just a larger model and isn’t as exciting as we’re hoping it is. Or Apple is just messing with us.</p>\n\n\n\n<p>But assuming our calculations are correct, you probably want to start looking at WWDC for your next keynote fix. See you in June, everyone.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"67ceba6c0cd17783da85ccf94d8842e9bb6e76f529b06cfd9062a3d1eccde116","category":"Apple"}