{"title":"Facebook เตรียมนำ Messenger กลับมาใส่ใน Facebook แอปหลักอีกครั้ง","link":"https://www.blognone.com/node/132924","date":1678235185000,"content":"<div><div><div><p>Tom Alison หัวหน้าฝ่าย Facebook ของ Meta ประกาศทิศทางใหม่ของ Facebook ที่จะเกิดขึ้นจากนี้ โดยมีการเปลี่ยนแปลงสำคัญคือ นำคุณสมบัติการส่งข้อความ <strong>Messenger กลับเข้ามาในแอป Facebook หลัก</strong>อีกครั้ง หลังจาก Facebook แยกคุณสมบัตินี้ออกไป <a href=\"https://www.blognone.com/node/58771\">ผู้ใช้งานต้องโหลดแอปแยกมาตั้งแต่ปี 2014</a></p>\n<p>Facebook ให้เหตุผลของการเปลี่ยนแปลงนี้ว่า เพื่อรองรับพฤติกรรมการใช้งานที่เปลี่ยนไป คนเลือกแชร์คอนเทนต์น่าสนใจที่พบบน Facebook ให้กับเพื่อนผ่าน Messenger ซึ่งมีความเป็นส่วนตัวมากขึ้น และพบพฤติกรรมแบบเดียวกันใน Instagram ที่สามารถแชร์ได้โดยตรงผ่าน DM ในแอป จึงตัดสินใจนำคุณสมบัติ Messenger กลับมาในแอปอีกครั้ง เพื่อให้ผู้ใช้งานไม่ต้องสลับแอปไปมา โดยจะเริ่มทดสอบกับผู้ใช้งานทุกคนเร็ว ๆ นี้</p>\n<p>การเปลี่ยนแปลงนี้ Facebook ยังบอกว่าเพื่อรองรับระบบแชตใน Facebook Groups ซึ่งพบว่าผู้คนในกลุ่มที่มีความสนใจเรื่องเดียวกัน หันมาใช้ Messenger ในการพูดคุยกันมากขึ้นด้วย รวมทั้งจะเพิ่มความสามารถของ AI ในการแนะนำเนื้อหาจากครีเอเตอร์มาแสดง ให้ตรงกับความสนใจของผู้ใช้งานแต่ละคนมากขึ้น</p>\n<p>ในประกาศนี้ Tom Alison ยังพูดถึงจำนวนผู้ใช้งาน Facebook ที่มีการใช้งานเป็นประจำทุกวัน (DAUs) มากกว่า 2 พันล้านบัญชีต่อวัน Facebook จึงยังไม่ได้ตายหรือใกล้ตาย (not dead nor dying) แบบที่รายงานข่าวหลายฉบับพูดกัน</p>\n<p>ที่มา: <a href=\"https://about.fb.com/news/2023/03/facebook-today-and-tomorrow/\">Facebook</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b34480ef9d1ac498516100f8beac0051.png\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/facebook-messenger\">Facebook Messenger</a></div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/social-media\">Social Media</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"6a2d713c5d180d4aafa81189e659e27c8fdc56be010129ccb16706d6516e4549","category":"Thai"}