{"title":"‘I am completely open-minded’ – Zoe Bäckstedt on Opening Weekend, the Roubaix dream and building Lego","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-am-completely-open-minded-zoe-backstedt-on-starting-opening-weekend-the-roubaix-dream-and-building-lego","date":1677150879000,"content":"\n      <p><span>Zoe Bäckstedt has had just four days off her bike after a busy – and extremely successful – cyclocross campaign. This is the first time in months that things have really slowed down for the British rider. The ‘cross races come thick and fast over Christmas and the New Year, so there hasn’t been much time for her to have a breather. There isn’t much opportunity for her to use these four days to reflect or consider her success in the field, either, as her attention has already turned to starting her road season with EF Education-Tibco-SVB.</span></p>\n<div></div>\n<p><span>Luckily, Bäckstedt is someone who relishes the fast-paced, varied lifestyle of a multi-disciplinary bike rider. Through the youth and junior ranks, the 18-year-old really did it all, racing cyclocross, track and road. She excelled across the board, so much so that she signed her WorldTour contact with EF Education-Tibco-SVB last year while she was still a junior rider, riding as a stagiaire for them last summer. </span></p>\n<p><span>“I remember I had a Zoom call with Linda Jackson who's the team boss,” reflects Bäckstedt. “We chatted for half an hour or so. I came off the phone and then messaged my agent and I was like, I want to sign for them. And that was pretty much it.”</span></p>\n<p><span>EF Education-Tibco-SVB’s open approach to Bäckstedt continuing to race cyclocross alongside the road, and the team’s unique, laid-back attitude were big draws for the Brit, as was their understanding of her desire to develop slowly as a rider.</span></p>\n<p><span>“I don't want to burn out. I'm still young. I've got a long career ahead of me so that is one thing in our minds,” she says. “I don’t want to do too much too soon. I don't want to get into the WorldTour this year and be really eager and do every single race. I need to learn to hold myself back a little bit and the team knows that and they won't put too much much pressure on me to perform.”</span></p>\n<p><span>Despite their shared understanding of Bäckstedt’s relative inexperience in the WorldTour peloton, the 18-year-old will open her 2023 road season with Omloop het Hageland and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad\">Omloop Het Nieuwsblad</a> in just a few days time – Nieuwsblad being of the biggest races on the women’s calendar.</span></p>\n<p><span>“I'm doing it for the experience. I'm young and it's my first year in the WorldTour,” Bäckstedt says. “I'm going to make mistakes. I need to learn how to do everything, it's a bigger peloton, it's a more experienced peloton and it is an older peloton. It's longer racing, it's harder racing. I know that.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-08095_1024x1024.jpg?v=1677078605\" alt=\"Bäckstedt at the 2022 Junior Road World Championships\" /></div>\n<p><span><em><span>Bäckstedt at the 2022 Junior Road World Championships (Image: Zac Williams/SWpix)</span></em></span></p>\n<p><span>Bäckstedt certainly appears level-headed and without expectation about her first WorldTour race, but the innate competitiveness that all successful athletes have mean that she isn’t fully counting out all chances of a good result. </span></p>\n<p><span>“Honestly, I am completely open minded. I don't expect the team to be working for me. It's not something that I would want for my first races. That would put a little bit of pressure on me. I'm here to help the team get results, get podiums, wins, whatever we can,” Bäckstedt explains. “Whether that's with the race knowledge that I have, whether it's putting me on the front for 20, 30 or 40 kilometres and going as hard as I can to bring back a break or being in a break myself, I want to help.”</span></p>\n<p><span>As a double junior world champion on the road and after such a successful cyclocross season, it’s unavoidable that Bäckstedt will be a watched rider in the opening Classics, even if she doesn’t count herself as a contender. Despite her age, the British rider seems able to shoulder this pressure with maturity. </span></p>\n<p><span>“I know that I'm going to be a rider to watch because a lot of people know me from my junior years winning the world titles in Australia. There's no doubt about it, even though I'm a first year in the WorldTour. Also with my surname, it's not exactly easy to just slide in under the radar, it’s not going to happen. But I already know that, so that's one step ahead for me,” she says.</span></p>\n<p><span>It’s true that the Bäckstedt name carries weight in the cycling world. Zoe’s father, Magnus, is a winner of Paris-Roubaix, her mother, Megan, is a former British National Champion and her sister, Elynor, rides for the women’s WorldTour team, Trek-Segafredo. “Cycling is just in my blood. I was kind of born onto a bike,” Bäckstedt says.</span></p>\n<p><span>In 2023, the three quarters of the Bäckstedt clan will be in the professional women’s peloton, with Magnus taking a role as sports director for Canyon//SRAM Racing this season. This means that he’ll be in the team car directing riders who are on a rival team to his two daughters. There’s some potential for a strange dynamic if one of the Bäckstedt sisters finds themselves in a breakaway with a Canyon//SRAM rider, but Zoe seems unfazed when I mention this.</span></p>\n<p><span>“If I'm away in a break with one of his riders and if it's just the two of us, obviously, they're at the advantage because [my dad] knows exactly how I ride and what my strengths are, what I’ll do if it's a sprint, if it's a climb,” she explains. “You just have to accept it, he's going to be in the car, he's going to be working with them for the next couple of years. There's nothing I can do about it apart from just knowing that I've got Dad behind me if I do come down hard or if I finish the race and I'm like, I just need a hug.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_1549_1024x1024.jpg?v=1677078663\" alt=\"Bäckstedt after winning the British National Cyclocross Championships\" /></div>\n<p><span><em>Bäckstedt after winning the British National Cyclocross Championships (Image: Alex Whitehead/SWpix)</em></span></p>\n<p><span>With Zoe stepping up to the WorldTour this year, it gives her the first chance to potentially ride Paris-Roubaix Femmes, a race which holds a special part in her family’s history. “One day, I want to win it, one hundred percent,” she says. “It's not going to be this year, it might not be next year, it might be three, four or five years until that, but one day. I’d be keen to race it this year but I will have to see where I am at.”</span></p>\n<p><span>Bäckstedt explains that she’s still yet to have a fully confirmed race calendar for 2023 and her participation in Paris-Roubaix will largely depend on how she’s managing fatigue by that point in the season. </span></p>\n<p><span>“I have to see what my body's feeling like after the first couple of races. It'd be super cool if I could race it this year being a first year pro. It's my sister's first year that she would race it as well due to crashes in previous seasons. If I could race it this year and she could race it and have Dad in the convoy, it gives me goosebumps.”</span></p>\n<p><span>While Paris-Roubaix is high on Bäckstedt’s bucket list of races she wants to win in her career, she’s dreaming even bigger, too. “Roubaix would be special to win but things like the Olympics and Worlds. I want to win everything really, just everything,” she says.</span></p>\n<p><span>The British rider doesn’t rule out a return to the track either. With her talent for the individual pursuit, Bäckstedt could be an asset to the British team in the team pursuit squad in future Olympics. It seems that the challenge for Bäckstedt is simply that she is so talented, it’s hard to know where she should place her focus. </span></p>\n<p><span>“2028 is a long way away now, so if something comes up in the next few years with the Olympics and it is on track, then yeah, why not? But there’s not enough time in the day!” she jokes.</span></p>\n<p><span>As for the now, Bäckstedt bases herself in Belgium full-time, living in the heart of Flanders, close to the routes of the Classics races that she loves. This means she’s already been able to ride the courses of Omloop het Nieuwsblad and other important Belgian one-day races, something that will undoubtedly be an advantage when she takes to the start line.</span></p>\n<p><span>“Living on my own has been quite fun so far, I'm really enjoying it, just having my own space that I can come back to after a race and just lay down in my bed and then only have to drive like an hour to a ‘cross race at the weekend. The Classics are at my front door,” she says. “I was doing some training just a couple of days ago when I was doing the Nieuwsblad recon all around Oudenaarde and I was like: oh, this road is in it. I literally know all of these roads. I've done them like 100 times and I just didn't realise that they were in this race.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_3609_1024x1024.jpg?v=1677078721\" alt /><em>Bäckstedt after winning the 2022 Junior Road World Championships (Image: Alex Whitehead/SWpix)</em></span></p>\n<p><span>In her spare time, Bäckstedt can be found building Lego that will live in the stand she created for it during her four-day break after the cyclo-cross season. For the EF Education-Tibco-SVB rider, it’s all about never losing the fun aspect of the sport, or getting bogged down by the pressure.</span></p>\n<p><span>“You have to shoulder the pressure and get on with it, otherwise it becomes a lot sometimes. You just learn to deal with it. You learn that the people around you will help you as well and find a positive environment,” she says.</span></p>\n<p><span>Bäckstedt admits that she isn’t immune to the nerves that big events bring, citing the Junior Road World Championships last year as a moment where she felt that everyone was watching her. “Obviously I knew that I could win it. I wanted to win it but everything could have gone wrong on race day and I could have had the worst day of my career.”</span></p>\n<p><span>However, part of what has made the 18-year-old so successful in her racing so far is being able to enjoy what she’s doing, and as the races get bigger and the stakes get higher, this is something she doesn’t want to forget. “If I'm having fun on the bike then my results come. I just try to enjoy it out there, take it as it comes,” she says with a smile. “You can't get too caught up in racing.”</span></p>\n<p><em><span>Cover image: </span>Alex Whitehead/SWpix</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"77a6bc18c284c4da212525114a95c29d8daa6708f67984b2c83d454638f5de16","category":"Cycling"}