{"title":"Places of cycling: A woman by the sea — the poetry of Sophia de Mello Breyner Andresen","link":"https://www.cyclingtips.com/2023/03/places-of-cycling-a-woman-by-the-sea-the-poetry-of-sophia-de-mello-breyner-andresen/","date":1678300674000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/HERO-1-8.webp?width=1200\" alt=\"Places of cycling: A woman by the sea — the poetry of Sophia de Mello Breyner Andresen\" /></figure><p>The Algarve in February. Warmth and light welcome after the long winter months, empty beaches (for the locals still have their coats on) and the constant crash of the Atlantic Ocean. Sophia de Mello Breyner Andresen, one of the great Portuguese poets of the twentieth century, loved the Algarve. Throughout her life she went there to holiday, first as a child, then with her own children. When a documentary-maker made a lyrical film about her in 1969, it was no accident that most of the scenes were filmed on the Algarve coastline.</p>\n<figure><img loading=\"lazy\" src=\"https://pelotonmagazine.com/wp-content/uploads/2022/02/GettyImages-1199868881-1024x992.jpg?width=620\" alt width=\"620\" height=\"600\" /><figcaption>Portrait de la poétesse portuguaise Sophia de Mello Breyner Andresen en novembre 1988 en France. (Photo by Louis MONIER/Gamma-Rapho via Getty Images)</figcaption></figure>\n<p>The sea is a significant theme in Andresen’s work. She used it to express her feelings about life and death, myth and eternity. The sea was a constant source of power and peacefulness. The mornings at Praia de Granja, a beach south of Porto, and Picasso’s 1922 painting <em>Woman by the Sea</em> were strong influences on her work. In <em>Discovery</em> she wrote: Green-muscled ocean / Idol of many arms like an octopus / Convulsive incorruptible chaos.</p>\n<p><strong>Also read: </strong><a href=\"https://www.velonews.com/culture/female-pressroom-pioneer-darcy-kiefel/\" target=\"_blank\">Female pressroom pioneer: Darcy Kiefel</a></p>\n<p>Andresen was born in Porto in 1919. Her last name came from her paternal great-grandfather Jan Andresen, a Dane who came to Portugal as a child and settled. In 1895 Jan Andresen’s son bought the Quinta do Campo Alegre, a handsome red house in Porto surrounded by extensive botanical gardens. Here Sophia enjoyed a privileged upbringing, with staff to look after her, and freedom to roam the estate. In 1936 she moved to Lisbon to study at the university. Over the following years Andresen became active in progressive liberal politics, railing against the nationalist rule of President Salazar. But it was poetry that defined her life. She began writing verse as a child, her imagination fired by the poems taught to her by the women who cared for her. Living in the lush surroundings of Quinta do Campo Alegre provided ample material for the young poet; many of her early poems were about houses.</p>\n<figure><img loading=\"lazy\" src=\"https://pelotonmagazine.com/wp-content/uploads/2022/02/GettyImages-1226813584-1024x678.jpg?width=600\" alt width=\"600\" height=\"397\" /><figcaption>Bordeira beach at Punta Carrapateira, in the Southwest Alentejo and Vicentine Coast Natural Park, considered one of the most beautiful in Algarve, Portugal. (Photo by Cristina Arias/Cover/Getty Images)</figcaption></figure>\n<p>In later life her subject matter expanded. Nature, particularly the sea, became an important theme, bound up with her belief in naturalism – the doctrine of naturalism holds that nature is the single source for everything that exists, and that only natural laws exist. However abstract her belief systems, Andresen maintained that poetry should deal with the tangible elements of life: ‘That is why the poem speaks not of an ideal life but of a concrete one: the angle of a window, the resonance of the streets, cities and rooms, the shade cast by a wall, a sudden face, the stars’ silence, distance and brightness, the night’s breathing, the scent of the linden and of oregano.’</p>\n<p>Andresen felt that poems came to her, rather than were constructed by her. And mostly they came to her at night. ‘I cannot write in the morning,’ she said. ‘I need that special concentration that is being created at night.’</p>\n<p>Perhaps night-time was simply when she managed to shut the door and reflect on the day. For Andresen poetry and life were indivisible. One informed the other. She said that poetry ‘does not require my time and labour. It does not ask me to have science, or aesthetics or theories. Instead it demands the entireness of my being, a consciousness running deeper than my intellect.’</p>\n<p>Andresen won the Prémio Camões, Portugal’s highest prize for poetry, in 1999. She has been translated into English, and also acclaimed for her many children’s stories. Sophia de Mello Breyner Andresen died in 2004, aged 84, in Lisbon. She is buried in the National Pantheon in Lisbon in recognition of her status as one of Portugal’s greatest poets.</p>","author":"Will Tracy","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"80d06d328e3118c158988e59cde7bdc38b0aceba3c4116f9c22f78cf800eb92f","category":"Cycling"}