{"title":"These juvenile snapping shrimp have the fastest claws in the sea","link":"https://arstechnica.com/?p=1922223","date":1678225008000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><img alt=\"Juvenile snapping shrimp now hold the acceleration record for a repeatable body movement underwater. They can snap their claws at accelerations on par with a bullet shot from a gun.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/snapping-shrimp-claw.gif\" /><p>Juvenile snapping shrimp now hold the acceleration record for a repeatable body movement underwater. They can snap their claws at accelerations on par with a bullet shot from a gun. (credit: Harrison and Patek, 2023)</p></div>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Alpheidae\">snapping shrimp</a>, aka the pistol shrimp, is one of the loudest creatures in the ocean, thanks to the snaps produced by its whip-fast claws. And juvenile snapping shrimp are even faster than their fully grown elders, according to a <a href=\"https://journals.biologists.com/jeb/article-abstract/226/4/jeb244645/287686/Developing-elastic-mechanisms-ultrafast-motion-and?redirectedFrom=fulltext\">recent paper</a> published in the Journal of Experimental Biology. Juvenile claws accelerate as fast as a bullet shot from a gun when they snap, essentially setting a new acceleration record for a repeated movement performed underwater.</p>\n<p>As <a href=\"https://arstechnica.com/science/2022/07/pistol-shrimp-sport-tiny-helmets-to-protect-selves-from-their-own-shock-waves/\">we've reported</a> previously, the source of that loud snap is an impressive <a href=\"https://cocktailpartyphysics.com/running_hot_and/\" target=\"_blank\">set of asymmetrically sized claws;</a> the larger of the two produces the snap. Each snap also produces a powerful shockwave that can stun or even kill a small fish. That shockwave produces collapsing bubbles that emit a barely visible flash of light—a rare natural example of <a href=\"https://en.wikipedia.org/wiki/Sonoluminescence\">sonoluminescence</a>.</p>\n<p>Scientists believe that the snapping is used for communication, as well as for hunting. A shrimp on the prowl will hide in a burrow or similar obscured spot, extending antennae to detect any passing fish. When it does, the shrimp emerges from its hiding place, pulls back its claw, and lets loose with a powerful snap, producing the deadly shockwave. It can then pull the stunned prey back into the burrow to feed. </p></div><p><a href=\"https://arstechnica.com/?p=1922223#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1922223&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"94c3ed063c3fe4fb035b17f4853a028b6a5bb5c0268b7bf02e5b6c4a439da98a","category":"Tech"}