{"title":"A winning formula for SD Worx - Women's Omloop Het Nieuwsblad 2023 in review","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-winning-formula-for-sd-worx-the-womens-omloop-het-nieuwblad-2023-in-review","date":1677407166000,"content":"\n      \n<p>Staking her claim to be considered the queen of the cobbles, Lotte Kopecky triumphed on what was her first race of the season at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad\">Omloop Het Nieuwsblad</a>. Nobody could match her vicious acceleration up the Muur van Geraardsbergen, and, despite a committed chase in the finale, she held on to win by 11 seconds. </p>\n<div></div>\n<p><span>By winning the sprint for second place, Lorena Wiebes sealed a one-two for SD Worx, whose new-look Classics line-up already looks like a winning formula.</span></p>\n<h3><span>Kopecky goes all in for the win</span></h3>\n<p>No rider was a more regular presence in the front end of the biggest Classics during the 2022 season, but if there was a criticism that could be levelled towards Lotte Kopecky, it was that she finished runner-up too often. Although she won both <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a> and the Tour of Flanders by using her superior sprint against Annemiek van Vleuten, she made the mistake of letting her Dutch rival slip away to beat her into second at the World Championships in Wollongong, and also had to settle for second-place after failing to bring back Elisa Longo Borghini (Trek-Segafredo) at Paris-Roubaix. </p>\n<p><span>There was no risk of her finishing second at Omloop Het Nieuwsblad, after she produced an all-or-nothing attack on the Muur. And it turned out to be ‘all’ rather than ‘nothing’, as she proved produced an acceleration that nobody could even come close to matching.</span></p>\n<p><span>It was striking just how quicker she was up the climb than any of her rivals. The likes of Borghini, CecilIe Uttrup Ludwig, Grace Brown (both FDJ-Suez) and Liane Lippert (Movistar) all started the climb nearby, but were immediately dropped. The only rider to stay with her for any period of time was young Brit Pfeiffer Georgi (DSM), and she too was jettisoned within moments.</span></p>\n<p><span>She looked incredibly at ease over the cobbles, riding over them smoothly while others were laboured. There’s arguably nobody in the peloton better at handling the jagged surfaces than her. And with victory today, Kopecky has confirmed herself as the woman to beat in the cobbled classics this spring.</span></p>\n<h3><span>SD Worx’s new Classics line-up excels </span></h3>\n<p><span>When SD Worx announced the signing of Lorena Wiebes for the 2023 season, there were some concerns whether she and Lotte Kopecky might step on each other's toes, considering their focus on sprint finishes.</span></p>\n<p><span>But on the evidence of their first race riding together, it could well turn out to be a match made in heaven.</span></p>\n<p><span>While Wiebes has been surprised in the early bunch sprints this year, losing two already at the UAE Tour behind Charlotte Kool (DSM) having been virtually unbeatable last year, her performance today suggests she’s improved as an all-round classics contender. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1247471096.jpg?v=1677406847\" alt /></span></p>\n<p><span>Especially impressive was the way she stuck to the wheel of Liane Lippert as the German attacked on the Bosberg, ensuring the Italian could not set off in pursuit of her team-mate Kopecky. It wasn’t just that Wiebes survived the climbs; she was one of the best over them.</span></p>\n<p><span>With Wiebes present in the chasing group, SD Worx had all bases covered, and, by comfortably winning the sprint for second-place in the peloton, Wiebes demonstrated how she and the team probably would still have won even if Kopecky had been caught.</span></p>\n<p><span>With Demi Vollering also going well, making the ten-woman selection that formed behind Kopecky on the Muur, SD Worx look as strong as ever going into the rest of the spring Classics.</span></p>\n<h3><span>Van Vleuten punctures, but Movistar promising</span></h3>\n<p><span>Although Lotte Kopecky ended up winning comfortably, the race might have played out very differently had Annemiek van Vleuten not suffered an ill-timed stroke of misfortune.</span></p>\n<p><span>The world champion punctured at the worst possible moment: just before the climb of the Muur, where Kopecky made her attack, and the decisive selections were formed.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1469531425.jpg?v=1677406967\" alt /></span></p>\n<p><span>Prior to that moment, Movistar had ridden very impressively as a team. The team had placed their entire six-woman roster (Van Vleuten, Lippert, Arlenis Sierra, Aude Biannnic, Emma Norsgaard and Floortje Mackaij) is a select group that formed briefly on the run-in to the Muur, and then fired Sierra up the road to gain a lead of over one minute.</span></p>\n<p><span>Sierra remained in the lead on the Muur, where she was joined by Kopecky, and could have been a very useful decoy for Van Vleuten had the Dutchwoman not punctured. Instead, however, she was dropped on the Bosberg, and was too tired at the finishing sprint to finish any higher than 27th.</span></p>\n<p><span>Still, the signs were that Movistar have gelled well as a team for the 2023 season. Whereas they’ve been very reliant on Van Vleuten for success ever since she signed in 2021, today they had multiple cards to play, with Lippert also launching a powerful attack on the Bosberg, and Norsgaard sprinting for a credible fourth-place at the finish.</span></p>\n<p><span>Assuming Van Vleuten isn’t suffering from a long term case of the curse of the rainbow jersey, they should be able to provide a real challenge to SD Worx in the coming Classics. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c85c4d1683672ddb4e247d06558e17dc6256a546950383fd9f14559f20771a64","category":"Cycling"}