{"title":"Ads are everywhere on Apple devices and it’s not a good look","link":"https://www.macworld.com/article/1533160/apple-tv-plus-app-store-ads.html","date":1678188600000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>Apple gets so much right about the user experience, often highly important aspects like <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2023/02/27/top-us-cybersecurity-apple-two-factor-praise/&amp;xcust=1-1-1533160-1-0-0&amp;sref=https://www.macworld.com/feed\">user security</a>. There are, however, still some things it gets comically wrong.</p>\n\n\n\n<p>You can complain about Siri, and you can complain about autocorrect, but for the Macalope’s money, there is nothing more antithetical to the Platonic ideal of the Apple user experience than ads.</p>\n\n\n\n<p>We roundly–and rightly!–mock Windows PCs and Android devices for being so stuffed with crapware you’d expect them to look like a busted can of biscuits.</p>\n\n\n\n<p>Customer: “Why is this laptop bursting at the seams like that?”</p>\n\n\n\n<p>Salesperson: “Um, it’s full of fluffy computer goodness?”</p>\n\n\n\n<p>You’ve paid for these devices, why are they overflowing with garbage that slows down your device and spies on you? Because someone decided that the company could make more money at the expense of your user experience, that’s why.</p>\n\n\n\n<p>Well, ads are definitely the crapware of Apple devices.</p>\n\n\n\n<p>It is sigh-inducing how Apple thinks it’s okay to have notifications default to telling you there are games or apps you could be downloading! Whaaat? This mobile computer can run apps from some sort of store? Fascinating. Please tell me repeatedly about it until I can find the setting to turn it off. Which, even if you manage to do, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://mastodon.social/@marioguzman/109837199666420835&amp;xcust=1-1-1533160-1-0-0&amp;sref=https://www.macworld.com/feed\">has its own pitfalls</a>.</p>\n\n\n\n<p>And speaking of the App Store, what would be great is when you’re searching for something on the store an ad could be shoved up at the top for something this likely either A) designed to confuse you into downloading it instead of the thing they were looking for, or B) some sort of virtual coin gambling because everyone loves gambling with virtual coins.</p>\n\n\n\n<p>App Store ads don’t benefit users, certainly, and even for app makers they create an adversarial environment for search results. If you don’t buy ads for searches for your own app, then a competitor or online casino might. It is the poster child for the phrase “This is a nice app you have here. It’d be a shame if something were to happen to it.”</p>\n\n\n\n<p>The worst recently, however, is ads on Apple TV+. Start an episode of one TV+ show and you’ll get an ad for a different TV+ show. Is that what the “+” in Apple TV+ is for? You may also get an ad for a premium TV+ feature like Major League Soccer. At least that’s an upsell. The first one is an ad for another show you could watch for free, delaying you from watching the show you actually were trying to watch. You’ve already got the Macalope’s money. What exactly are you trying to sell to him?</p>\n\n\n\n<p>Admittedly, it’s not as bad as when the Macalope used to use the CW’s app to watch some shows and he’d often get an ad <em>for the show he was already watching</em>. “Watching ‘Legends of Tomorrow’? You might also like… [sound of gears turning, algorithm chunking, a cat hissing, and DING!]… ‘Legends of Tomorrow’!”</p>\n\n\n\n<p>Nailed it.</p>\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/idge/imported/imageapi/2021/12/28/13/macalope-2021-100915055-orig.jpg?quality=50&amp;strip=all&amp;auto=webp&amp;quality=85,70\" alt=\"Macalope\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n\n<p>The ad experience on Apple platforms is like having coin locks on the bathroom stalls at a fancy restaurant. From top to bottom, they are needless, detrimental to the user experience, and seem so un-Apple.</p>\n\n\n\n<p>While the company may itself collect a fair amount of user data, it at least doesn’t sell it to third parties like so many of its competitors. It could make even more money doing that, but it doesn’t. Likewise, it could choose to simply not do ads, including so-called “house ads” (which are not ads for the show “House” but ads for in-house products). TV+ preroll ads might seem less egregious because they’re just like what you get when you go to the movie theater, but they’re still ads (and unlike what you might see before a movie, they give you no idea of the many amenities available in the lobby).</p>\n\n\n\n<p>Apple makes a lot of money and it loves to claim that it does so simply by offering a superior user experience. That’s largely true, but the Macalope wishes the company would stick to its shtick completely and ditch the ads.</p>\n\nApple TV, iOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"c968debd3afe51c416a0ef7806f5272e725308049a189669b40d479a22d14583","category":"Apple"}