{"title":"Optimizing The Image Element LCP","link":"https://smashingmagazine.com/2023/01/optimizing-image-element-lcp/","date":1673892000000,"content":"<p><strong>Largest Contentful Paint (or LCP)</strong> is one of three metrics of the Core Web Vitals. These metrics are used by Google to evaluate the quality of user experience. LCP measures the time it takes for the browser to load the main content in the viewport. </p>\n<p>Since recently becoming a ranking factor, this major web performance KPI is still a new concept for many web developers. It becomes especially tricky to optimize <strong>when the LCP element is an image</strong>.</p>\n<p>To address this problem, I’ll provide an overview of the best practices for the integration and optimization of an LCP image. I’ll cover the following:</p>\n<ul>\n<li>How to improve the LCP <em>Resource load time</em> subpart with the help of the <code>&lt;img&gt;</code> tag and a focus on proper LCP image sizing.</li>\n<li>Some explanations on the browsers’ behavior for this <code>&lt;img&gt;</code> tag and its attributes, so you can really understand and integrate your LCP image correctly.</li>\n<li>How to improve LCP <em>Resource load delay</em> subpart.</li>\n</ul>\n<p>All the explanations will be illustrated by an example that we will iterate on. The images used in the article’s Codepen demonstrations will be integrated with <a href=\"https://www.twicpics.com/\">TwicPics</a> to save time in their creation and speed up the optimization of the LCP metric.</p>\n<p><strong>Note</strong>: <em>The other LCP subparts are “Time to first Byte” and “Element render delay,” which will not be covered here. Read this “<a href=\"https://web.dev/optimize-lcp/\">Optimize Largest Contentful Paint</a>” article by Philip Walton and Barry Pollard to learn more about the four LCP subparts and their relation to each other.</em><br /><em>If you want to find out how to identify the LCP element on your web pages, check out this <a href=\"https://www.twicpics.com/blog/how-to-find-the-lcp-element-a-complete-guide\">guide</a> by Laurent Cazanove.</em></p>\nImprove LCP Resource Load Time With The Help Of The <code>&lt;img&gt;</code> Tag\n<p>The goal here is to decrease the loading time of your LCP image as much as possible without compromising its visual quality. To succeed in this operation, one of the key points is to <strong>let the browser choose the best-suited version of the image</strong>.</p>\n<p>Instead of declaring a single image file via the <code>src</code> attribute — whose dimensions would be identical for all users across any devices — we need to let the browser choose the image file best suited to each context. This approach allows images with smaller dimensions to be downloaded for users on smaller devices. This way, the image loads faster, and your website will get a better LCP score.</p>\n<p><img src=\"https://archive.smashing.media/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e912754e-e730-4b7e-9072-17de698e244b/4-optimizing-image-element-lcp.png\" /></p>\n<p>To do this, we need to give the browser the information it needs using the <code>&lt;img&gt;</code> tag and its <code>srcset</code> and <code>sizes</code> attributes:</p>\n<ul>\n<li>The <code>srcset</code> attribute points the browser to a list of image files, with a description of their <a href=\"https://developer.mozilla.org/en-US/docs/Glossary/Intrinsic_Size\">intrinsic width</a>.</li>\n<li>The <code>sizes</code> attribute tells the browser the intended display width of the image. It can be combined with CSS media queries to select the appropriate image for the width of the screen.</li>\n</ul>\n<p><strong>Note</strong>: <em>The <code>&lt;picture&gt;</code> tag could be used instead of <code>&lt;img&gt;</code> to allow the browser to load different images depending on device characteristics, such as the width of the viewport or image format compatibility. For simplicity, we will only use the <code>&lt;img&gt;</code> tag in our examples.</em></p>\n<h3>The <code>srcset</code> Attribute Of The <code>&lt;img&gt;</code> Tag</h3>\n<p>The <code>srcset</code> attribute of the <code>&lt;img&gt;</code> tag indicates a list of image files and their intrinsic width. The browser uses this list to choose the image that it thinks is best suited to the users’ context. </p>\n<p>This makes the <code>srcset</code> attribute the first step towards optimizing your LCP image.</p>\n<pre><code>&lt;img srcset=\"\" src=\"\" alt=\"\" /&gt;\n</code></pre>\n\n<p>To declare this list of images, it is recommended to follow a <strong>mobile-first</strong> approach. That means first declaring the smallest image as the default option with the <code>src</code> attribute and then declaring it again within the <code>srcset</code> attribute, followed by the larger dimension variants.</p>\n<p><img src=\"https://archive.smashing.media/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ff2eca08-f45e-4094-978a-57a509749ffc/3-optimizing-image-element-lcp.png\" /></p>\n<p>The <strong>intrinsic width</strong> of each image, <strong>expressed in pixels</strong>, should also be indicated using the unit <code>w</code> (<code>w</code> for \"width\"):</p>\n<pre><code>&lt;img\n  src=\"image-300.png\"\n  srcset=\"\n    image-300.png 300w,\n    image-900.png 900w,\n    image-1800.png 1800w\" \n  alt=\"Image description\"\n/&gt;\n</code></pre>\n\n<p>Our example above defines three images (<code>image-300.png</code>, <code>image-900.png</code>, and <code>image-1800.png</code>) separated by a comma, with respective intrinsic widths of 300, 900, and 1800 pixels. To respect the mobile-first approach, <code>image-300.png</code> is the default image here, defined in the <code>src</code> and <code>srcset</code> attributes.</p>\n<p><strong>Note</strong>: <em>When using the <code>srcset</code> attribute, it is important to keep the <code>src</code> attribute, so the browser knows which is the default image and to ensure that it is displayed on browsers that do not support the <code>srcset</code> attribute.</em></p>\n<p><strong>Note</strong>: <em>It is also possible to use the <code>srcset</code> attribute by declaring the Device Pixel Ratio (DPR) of images rather than their intrinsic width; however, this approach will not be discussed here.</em></p>\n<p>Knowing the user’s context, the browser can now choose the image to load from the list declared in the <code>srcset</code> attribute. </p>\n<p><img src=\"https://archive.smashing.media/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1d45560d-830b-440b-bd67-5d3430eb4fe3/5-optimizing-image-element-lcp.png\" /></p>\n<p>However, in order to avoid unexpected results, we need to understand how the browser selects the best-suited image:</p>\n<ul>\n<li>Within the <code>srcset</code> attribute, the browser always chooses the image <strong>according to the viewport size</strong>; it ignores the image display dimensions. Consequently, your CSS styles and media queries have no impact on its choice. You will also have to keep in mind the <strong>landscape orientation</strong> of mobiles and tablets when defining the list of images.</li>\n<li>By default (without the <code>size</code> attribute being specified), the browser chooses the image, assuming it is intended to occupy <strong>100% of the viewport width</strong>. </li>\n<li>As the browser knows the resolution of the devices, it also <strong>adjusts for the Device Pixel Ratio (DPR)</strong> in its calculations. Therefore, to optimize the LCP image, it will also be necessary to <strong>define a variant for each DPR</strong>.</li>\n</ul>\n<p>Based on these behaviors, the default formula applied by the browser to choose the image according to the viewport width is:</p>\n<p><code>viewportWidth x 100% x DPR</code></p>\n<p><strong>Note</strong>: <em>When no image in the list matches the calculation, the browser will choose the closest match. In case of a tie, the browser selects the larger image.</em></p>\n<p>Let’s illustrate the browser’s behavior with an example using our previous code: </p>\n<pre><code>&lt;img\n  src=\"image-300.png\" \n  srcset=\"\n    image-300.png 300w,\n    image-900.png 900w,\n    image-1800.png 1800w\"\n  alt=\"Image description\"\n/&gt;\n</code></pre>\n\n<p>👉 See live: <a href=\"https://codepen.io/twicpics/pen/LYrVeYm/bc493820d1618f435d00d7c809882973\">Codepen demo 1</a>.</p>\n<p><strong>Note</strong>: <em>In your browser development tools, open the <code>Network &gt; Img</code> tabs to see the image chosen by the browser according to each viewport and DPR.</em></p>\n<p>The image in this demo is displayed at a fixed width of <code>280px</code> on all devices. But on a <code>900px</code> wide screen with <code>DPR 1</code>, the browser will search the <code>srcset</code> attribute image list for an image that is:</p>\n<p><code>900px (viewport width) x 100% (viewport width occupied by the image by default) x 1 (DPR)</code></p>\n<p>In this case, the browser is looking for an image <code>900px</code> wide.</p>\n<p>In our example, while the display width of the image is <code>280px</code>, the image with the intrinsic width of <code>900px</code> will be loaded anyway.</p>\n<p><img src=\"https://archive.smashing.media/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4e1d4253-3981-40b1-a928-cfa32a6f0304/1-optimizing-image-element-lcp.png\" /></p>\n<p>We can see from this example that the images declared within our <code>srcset</code> attribute are not adapted to the display width of <code>280px</code> on all devices. </p>\n<p>While the browser applies the formula <code>viewportWidth x 100% x DPR</code> to pick the image to load, we can use a simpler formula to generate the different images declared in the <code>srcset</code> attribute:</p>\n<p><code>imageRenderedSize x DPR</code></p>\n<p>Taking into account DPRs 1, 2, and 3 on <a href=\"https://codepen.io/twicpics/pen/LYrVeYm/bc493820d1618f435d00d7c809882973\">our first demo</a>, we would need to create and define the following three images:</p>\n<ul>\n<li><strong>DPR 1</strong>: <code>280 x 1</code> =&gt; an image <code>280 pixels</code> wide;</li>\n<li><strong>DPR 2</strong>: <code>280 x 2</code> =&gt; an image <code>560 pixels</code> wide;</li>\n<li><strong>DPR 3</strong>: <code>280 x 3</code> =&gt; an image <code>840 pixels</code> wide.</li>\n</ul>\n<p>And finally, update our code : </p>\n<pre><code>&lt;img\n  src=\"image-280.png\" \nsrcset=\"\n    image-280.png 280w,\n    image-560.png 560w,\n    image-840.png 840w\"\n  alt=\"Image description\"\n/&gt;\n</code></pre>\n\n<p>👉 See live: <a href=\"https://codepen.io/twicpics/pen/LYrVeRB/fb316fa8e41d263f20b0312a5023de08\">Codepen demo 2</a>.</p>\n<p>Still, the updated code is not fully optimized for all devices yet.</p>\n<p>In fact, for a <em>laptop</em> device with a viewport of <code>1024px</code> and DPR 2, the optimal image should be an intrinsic width of <code>560px</code> (<code>imageRenderedSize x DPR</code>= <code>280 x 2</code>= <code>560</code>). But with this code, the browser will want to load an image of <code>1024 x 100% x 2</code>, i.e., an image of <code>2048px</code>, which does not exist in the <code>srcset</code> attribute.</p>\n<p>Let’s see how the <code>sizes</code> attribute can help us solve this issue.</p>\n<h3>The <code>sizes</code> Attribute Of The <code>&lt;img&gt;</code> Tag</h3>\n<p>The <code>sizes</code> attribute gives developers additional control over the browser’s behavior, preventing the browser from assuming images occupy 100% of the viewport. This helps to ensure the optimal image will be loaded and, consequently, optimize your LCP metric.</p>\n<pre><code>&lt;img srcset=\"\" sizes=\"\" src=\"\" alt=\"\" /&gt;\n</code></pre>\n\n<p><strong>Note</strong>: <em>The <code>sizes</code> attribute is therefore not necessary when the image actually occupies 100% of the viewport.</em></p>\n<p>To assign the value of the <code>sizes</code> attribute, we can use and combine the following approaches:</p>\n<ul>\n<li>Define the image width as a <strong>percentage of the viewport width</strong>, e.g., <code>sizes=\"50vw\"</code>, when the image is responsive (for example, when the CSS <code>width</code> property is defined as a <em>percentage</em>).</li>\n<li>Define the width of the image in <strong>pixels</strong>, e.g., <code>sizes=\"500px\"</code>, when it has a fixed display width regardless of the users’ devices.</li>\n<li>Use one or more media queries to allow the browser to make the best choice of an image according to different viewports, e.g., <code>sizes=\"(min-width: 1024px) 800px, (min-width: 768px) 80vw, 100vw\"</code> (with <code>100vw</code> being the default when no media query is applied).</li>\n</ul>\n<p>Let’s update our code example:</p>\n<pre><code>&lt;img\n  src=\"image-280.png\" \n  srcset=\"\n    image-280.png 280w,\n    image-480.png 480w,\n    image-560.png 560w,\n    image-840.png 840w,\n    image-960.png 960w,\n    image-1440.png 1440w\"\n  sizes=\"(min-width: 768px) 480px, 87.5vw\" \n  alt=\"Image description\"\n/&gt;\n</code></pre>\n\n<p><strong>Note</strong>: <em>To know the width of the viewport occupied by the image in percentage, apply the calculation formula <code>(imageRenderedSize / viewportWidth) x 100</code>, e.g., <code>(280 / 320) x 100</code> = 87.5% of the viewport width (<code>87.5vw</code>).</em></p>\n<p>👉 See live: <a href=\"https://codepen.io/twicpics/pen/bGKdaYE/2d9a5f5a650d29c71d84056cade858e1\">Codepen demo 3</a>.</p>\n<p>Now with the source code of our <a href=\"https://codepen.io/twicpics/pen/bGKdaYE/2d9a5f5a650d29c71d84056cade858e1\">third demo</a>, and regardless of the DPR, the browser can load the perfect image:</p>\n<ol>\n<li>For a display width of <code>280px</code> for a viewport of <code>320px</code> (87.5% of the viewport).</li>\n<li>And for a display width of <code>480px</code> on all devices with a viewport of at least <code>768px</code>.</li>\n</ol>\n<p>At this stage, if the integration of the LCP image has been correctly carried out thanks to the <code>&lt;img&gt;</code> tag and its <code>srcset</code> and <code>sizes</code> attributes, the optimization of LCP <em>Resource load time</em> should be optimal.</p>\n<p><strong>Note</strong>: <em>We’ve mainly focused here on properly sizing the LCP image according to the users’ device. For the LCP score and its “Resource load time” subpart to be really optimal, you may also consider compressing your images using <a href=\"https://developer.mozilla.org/en-US/docs/Learn/HTML/Multimedia_and_embedding/Responsive_images#use_modern_image_formats_boldly\">modern image formats</a>, setting far-future cache expiry headers, or even using a CDN to reduce network distance.</em></p>\n<p><strong>Note</strong>: <em>Even if your LCP image is well-optimized and well-integrated within the <code>&lt;img&gt;</code> tag, keep in mind that this would not be sufficient if your page contains render-blocking resources such as JavaScript files. Refer to <a href=\"https://www.youtube.com/watch?v=fWoI9DXmpdk\">this talk</a> by Philip Walton to see how you can eliminate unnecessary element render delay.</em></p>\n<p>Now let’s see how it is possible to further optimize the LCP score by reducing its loading time.</p>\nImprove LCP Resource Load Delay Subpart\n<p>In this section, we are going to complete the code example used earlier to see how to load the LCP image as soon as possible.</p>\n<h3>Don’t Lazy-load The LCP Image Element</h3>\n<p>When users browse the internet to visit a website, the LCP image’s loading is often delayed by the lazy loading technique, whether applied by native lazy loading or a JavaScript library. But it’s important to note that this loading delay <strong>is included in the calculation of the LCP time</strong>.</p>\n<p>For instance, with a lazy-loading JavaScript library, the script must first be loaded in order to load the final image. This additional step contributes to a significant delay in loading the LCP resource.</p>\n<p>In other words, lazy loading an LCP image penalizes the LCP score of the web page.</p>\n<p>Similarly, progressive loading or <a href=\"https://codepen.io/twicpics/pen/jwGxZd\">Low-Quality Image Placeholder</a> (or LQIP) is not considered for LCP by Google at the time of this writing. However, <a href=\"https://github.com/w3c/largest-contentful-paint/issues/71\">discussions are ongoing</a> regarding LQIP, so the situation may change in the future.</p>\n<h3>Use Priority Hints</h3>\n<p>We have just seen that the LCP image must not be lazy-loaded. But how can we prioritize its loading?</p>\n<p>To manage the resources of a page, the browser natively applies a loading order according to a priority defined, <a href=\"https://web.dev/priority-hints/#resource-priority\">among other parameters</a>, by the type of the resource. </p>\n<p>Images have a lower priority than render-blocking resources. In addition to meaning the resource is fetched with a lower priority, it also means the fetch is actually delayed, as browsers deliberately delay “low” resources initially so that they can concentrate on more critical, often render-blocking, resources. </p>\n<p>This means you need to change the browser’s default load order and its behavior towards hero images so that the LCP image <strong>is not delayed</strong> and can be loaded <strong>as soon as the HTML document is received</strong>.</p>\n<p>It is the <code>fetchpriority=\"high\"</code> attribute that allows us to modify this loading priority. </p>\n<pre><code>&lt;img fetchpriority=\"high\" src=\"\" alt=\"\"&gt;\n</code></pre>\n\n<p>Let’s update our code example. Simply add the attribute to the <code>&lt;img&gt;</code> tag, and the browser will automatically determine the right version of the image for prioritizing based on the sources declared in the <code>srcset</code> attribute:</p>\n<pre><code>&lt;img fetchpriority=\"high\"\n  src=\"image-280.png\"\n  srcset=\"\n    image-280.png 280w,\n    image-480.png 480w,\n    image-560.png 560w,\n    image-840.png 840w,\n    image-960.png 960w,\n    image-1440.png 1440w\"\n  sizes=\"(min-width: 768px) 480px, 87.5vw\"\n  alt=\"Image description\"\n/&gt;\n</code></pre>\n\n<p>👉 See <a href=\"https://codepen.io/twicpics/pen/Poawrwa/7c54b62826b525bd6ce445441facb2bc\">the final demo</a>.</p>\n<p><strong>Note</strong>: <em>The <code>fetchpriority</code> attribute also works on the <code>&lt;img&gt;</code> tag of the <code>&lt;picture&gt;</code> element. For now, it’s mainly compatible with Chromium but <a href=\"https://github.com/whatwg/html/issues/7150#issuecomment-1299923593\">should be supported by Firefox in early 2023</a>. However, note that you can still use the <code>fetchpriority</code> attribute without any downsides: the attribute will be simply ignored by browsers that do not support it.</em></p>\n<p>As shown in our demo, the <code>&lt;img&gt;</code> tag and its <code>src</code> and <code>srcset</code> attributes are present in the initial HTML source code. This means there is no need to preload the LCP resource here, as the browser’s preload scanner can discover it.</p>\n<p><strong>Note</strong>: <em>The preloading of responsive images is not supported by all browsers, <a href=\"https://caniuse.com/?search=imagesrcset\">as is the case for Safari</a>: make sure not to use the <code>href</code> attribute on the <code>&lt;link&gt;</code> element so that non-supporting browsers don’t request a useless image. <a href=\"https://web.dev/optimize-lcp/#optimize-when-the-resource-is-discovered\">Read this article</a> to learn more about this topic and see when you might need to preload your LCP resource.</em></p>\n<p>In this last demo, not only can the browser now know the optimal image required for devices with a viewport of <code>320px</code> and for devices with a viewport of at least <code>768px</code>, but it can also prioritize its loading compared to other resources. As developers, all the points illustrated in this article should therefore help you improve the LCP score of your website.</p>\n<p><img src=\"https://archive.smashing.media/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/da8f9086-81de-4b25-87f2-746cafacc775/6-optimizing-image-element-lcp.png\" /></p>\nConclusion\n<p>In conclusion, here is a summary of the steps required to optimize the LCP image:</p>\n<ol>\n<li>Once the page template for your website has been defined, <strong>create</strong> and <strong>store all the images</strong> needed for <strong>each device</strong> and <strong>each DPR</strong> based on the <code>imageRenderedSize x DPR</code> formula. To simplify this step, you can use the <a href=\"https://www.twicpics.com/\">TwicPics</a> API to generate multiple versions at different dimensions from the high-quality original image.</li>\n<li>Use the <code>srcset</code> attribute of the <code>&lt;img&gt;</code> tag to include <strong>the list of images defined in step 1</strong>, following a <em>mobile-first</em> approach (remembering to put the default image within the <code>src</code> attribute).</li>\n<li>Using the <code>sizes</code> attribute of the <code>&lt;img&gt;</code> tag, combined with the <strong>media queries</strong> as needed, tell the browser the display width the image would occupy according to the different device contexts:<ul>\n<li>If the image is <strong>responsive</strong>, define its width as a <strong>percentage of the viewport width</strong> using the formula <code>(imageRenderedSize / viewportWidth) x 100</code>.</li>\n<li>If the image is <strong>fixed</strong> for a range of viewport widths, simply define its width in <strong>pixels</strong>.</li>\n</ul>\n</li>\n<li>To further improve your LCP score, use priority hints with the attribute <code>fetchpriority=\"high\"</code> to prioritize the loading of the LCP image. And remember not to lazy load your LCP image resource!</li>\n</ol>\n<h3>Further Reading on SmashingMag</h3>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2022/07/powerful-image-optimization-tools/\">Powerful Image Optimization Tools</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2021/09/modern-image-formats-avif-webp/\">Using Modern Image Formats: AVIF And WebP</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2022/11/guide-image-optimization-jamstack-sites/\">A Guide To Image Optimization On Jamstack Sites</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2022/04/boost-resource-loading-new-priority-hint-fetchpriority/\">Boost Resource Loading With <code>fetchpriority</code>, A New Priority Hint</a></li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"d1fe288c7d2e9c6b070e48c97b65b47546cb435ab9a9171ae2d12018a7bc0d62","category":"Tech"}