{"title":"Paris-Nice 2023: Essential guide to the Race to the Sun","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice","date":1677501463000,"content":"\n      <p><b>Date:</b><span> Sunday March 5, 2023 - Sunday March 12, 2023 <br /></span><b>Start:</b><span> La Verrière<br /></span><b>Finish</b><span>: Nice <br /></span><b>Total distance:</b><span> 1,201.1km <br /></span><b>Riders: </b>154<br /><b>Teams:</b><span> 22<br /></span><b>Defending champion:</b><span> Primož Roglič (Jumbo-Visma)</span></p>\n<p>Now in its 90th edition, Paris-Nice, also named the Race to the Sun, has been running since 1933 and has become one of the most critical races in a rider’s calendar outside of the three Grand Tours. Run by ASO, the same company which runs the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> and Paris-Roubaix, Paris-Nice is a testing week-long tour, with competing riders needing to be good climbers and time triallists to be in with a chance of winning. Much like the Tour, the leader in the general classification will wear a yellow jersey. </p>\n<p>Following a similar format to its previous years, the race will begin near Paris in a town called La Verrière and head towards the South of France and the mountains. This year’s race also features two summit finishes on stages four and seven, and a team time trial, something which hasn’t featured in this race since 1993. </p>\n<p><span>Sean Kelly holds the record for victories in this race having won seven consecutive editions from 1982 until 1988. The only other rider to come close to Kelly’s record is French rider Jacques Anquetil, who won the Paris-Nice GC on five occasions. No one in recent years has come close to rivalling Kelly’s dominance. </span></p>\n<p><span>The current defending champion is Primož Roglič, who in 2022 won the race for the first time in his career. However, he will not return to the race this year to defend his title, instead, team-mate and Tour de France winner Jonas Vingegaard will take on the eight stages to try and continue Jumbo-Visma’s reign. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB1_7262.jpg?v=1676465366\" alt=\"Men's peloton racing in the Paris-Nice race\" /></span></p>\n<h3><b>Paris-Nice teams: </b></h3>\n<ul>\n<li><span>AG2R Citroën Team</span></li>\n<li><span>Alpecin-Deceuninck</span></li>\n<li><span>Astana Qazaqstan </span></li>\n<li><span>Bahrain-Victorious </span></li>\n<li><span>Bora-Hansgrohe </span></li>\n<li><span>Cofidis </span></li>\n<li><span>EF Education-EasyPost </span></li>\n<li><span>Groupama-FDJ</span></li>\n<li><span>Ineos Grenadiers </span></li>\n<li><span>Intermarché-Circus-Wanty </span></li>\n<li><span>Jumbo-Visma</span></li>\n<li><span>Movistar </span></li>\n<li><span>Soudal Quick-Step</span></li>\n<li><span>Team DSM</span></li>\n<li><span>Jayco AlUla</span></li>\n<li><span>Team Arkéa-Samsic </span></li>\n<li><span>Trek-Segafredo</span></li>\n<li><span>UAE Team Emirates </span></li>\n<li><span>Lotto dstny </span></li>\n<li><span>TotalEnergies </span></li>\n<li><span>Israel-Premier Tech </span></li>\n<li><span>Uno-X Pro Cycling Team</span></li>\n</ul>\n<h3><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB1_6889.jpg?v=1676464952\" alt=\"Men's peloton in the 2019 Paris-Nice race\" /></b></h3>\n<h3><b>Paris-Nice route: </b></h3>\n<p><span>This year’s Race to the Sun begins with two undulating laps around La Verrière, warming up the rider's legs with the Côte de Milon-la-Chapelle – a 500m ramp with an average gradient of 12%. Stage two is virtually flat, travelling from Bazainville to Fontainebleau. </span></p>\n<p><span>On day three, a team time trial makes an appearance, having not featured in the race for over 30 years. The 32.2km TTT around Dampierre-en-Burly is very straightforward with little to no elevation, instead just flat straight roads for the majority of the route. </span></p>\n<p>Paris-Nice this year has two summit finishes and stage four sees the first of the two. The peloton begins in Saint-Amand-Montrond and heads southeasterly towards La Loge des Gardes. Facing several challenging ascents throughout the 164.7km route, the peloton first tackles the Côte de Vernet, then the Col du Beaujolais, before finishing atop the La Loge des Gardes, which is a 6.7km long climb with an average gradient of 7.1% to the finish line.</p>\n<p>This is followed by the longest stage of the race, and while the 221.4km-long route is classed as flat, there are five climbs that the peloton is faced with – four of which are categorised. In the first 35km, they need to get over three of them – Côte de Coise, Côte de l'Aubépin and Côte de Trèves. The rest of the route is pan-flat until they reach the Col de Devès and finally, the Côte d’Aleyrac. Thankfully for the sprinters, the day finishes on a flat run to the finish. </p>\n<p><span>Stage six brings with it more challenging climbs from start to finish. Beginning in Tourves, the peloton heads for the easiest of the six climbs, the Côte de Roquebrussanne. Then throughout the day they face climb after climb before a welcome descent into the finish in La Colle-Sur-Loup.</span></p>\n<p><span>The final two stages are defined by the mountains, and stage seven is the queen stage of the race, featuring two big climbs. The first one comes after 30km in the saddle. The Côte de Tourette-du-Château is a 17.8km climb with an average gradient of 4.6%. The only downhill relief comes at 64km. This stage is also the second of the summit finishes, finishing on the winding climb of Col de la Couillole. </span></p>\n<p><span>To close the race, stage eight is 118.4km and features five climbs with the last climb, Col d'Èze, being the steepest. After reaching the top of Col d’Èze, the riders plunge downhill to Nice where the eight-stage race will come to a close. </span></p>\n<p><b>Stage one: </b><span>169.4km, La Verrière - La Verrière</span></p>\n<p><b>Stage two: </b><span>163.7km, Bazainville - Fontainebleau</span></p>\n<p><b>Stage three:</b><span> 32.2km, Dampierre-en-Burly (TTT)</span></p>\n<p><b>Stage four: </b><span>164.7km, Saint-Amand-Montrond - La Loge des Gardes</span></p>\n<p><b>Stage five:</b><span> 212.4km, Saint-Symphorien-sur-Coise - Saint-Paul-Trois-Châteaux</span></p>\n<p><b>Stage six: </b><span>197.4km, Tourves - La-Colle-sur-Loup</span></p>\n<p><b>Stage seven: </b><span>142.9km, Nice - Col de la Couillole</span></p>\n<p><b>Stage eight:</b><span> 118.4km, Nice - Nice </span></p>\n<h3><b>How to watch Paris-Nice 2023: </b></h3>\n<p><span>Daily coverage of Paris-Nice will be streamed live on GCN+ for those watching from the UK and Europe. If you do not have the time to tune in live, GCN+ also offers full race replays of each stage. </span></p>\n<p><span>Eurosport and Discovery+ will also be covering the race live. If you have a SkyQ, Sky Stream and Sky Glass subscription, you are now able to sign up to Discovery+ for free as part of your package. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d2fb82dbecbe7fa88f0cd09e138abdf1c8f59ed0ad99a31de3679b196215bf69","category":"Cycling"}