{"title":"Apple’s always-on display will likely still be a Pro feature on the iPhone 15","link":"https://www.macworld.com/article/1535236/iphone-15-rumors-promotion-always-on-screen.html","date":1678280152000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>The steady supply of iPhone 15 leaks continues, with fresh information emerging this week about the screen features of Apple’s 2023 handsets. But it’s not good news for those planning to buy the standard iPhone 15.</p>\n\n\n\n<p>The iPhone 15 and 15 Plus, according to an anonymous industry source cited by “yeux1122” on the Korean <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://m.blog.naver.com/PostView.naver?blogId=yeux1122&amp;logNo=223037718015&amp;navType=by&amp;xcust=1-1-1535236-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Naver blog</a>, still won’t get access to the ProMotion dynamic screen tech which arrived on the Pro models in 2021 and enables a phone to adjust the refresh rate to suit its current activity and preserve battery life. As the blog writes (via automated translation), “What is confirmed here is that only the Pro Series will have a specification that supports LTPO 120 refresh rate, with the basic regular [and] Plus model not having it in [their] requirements.”</p>\n\n\n\n<p>This logically means, as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/03/07/iphone-15-no-promotion-always-on-display/&amp;xcust=1-1-1535236-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MacRumors</a> reasons, that the standard models won’t get the always-on screen feature that debuted last year either, because ProMotion’s ability to lower refresh rate all the way down to 1Hz was essential in stopping the always-on screen from being a battery killer. While ProMotion is a subtle improvement that produces smoother animation and better battery performance without the user necessarily being aware of it, the always-on screen is an in-your-face flagship feature, and (comparatively) budget-minded customers will be disappointed to miss out again.</p>\n\n\n\n<p>yeux1122 has a spotty track record, accurately predicting the iPhone 14 price and Deep Purple color, but <a href=\"https://www.macworld.com/article/678471/memory-boost-for-all-iphone-14-models.html\">missing on RAM</a> and charging speeds. But this rumor tracks with previous predictions: last September Ross Young, a displays industry analyst with an excellent track record, made the same prediction. On the plus side, Young reports that the Dynamic Island will be available on the non-Pro model later this year.</p>\n\n\n\n<p>It looks, in other words, as though Apple plans to continue its recent strategy of pushing customers into buying the more expensive Pro models, even to the detriment of sales of the standard phones. In 2022, the standard iPhone 14 missed out on a plethora of Pro upgrades–ProMotion, the always-on display, and the Dynamic Island–and it didn’t even get the latest processor. This is all aside from the usual differential of a weaker camera system and an inability to access the highest storage tiers. In our <a href=\"https://www.macworld.com/article/1073091/iphone-14-review.html\">iPhone 14 review</a>, we called it “basically an iPhone 13s.”</p>\n\n\n\n<p>For the latest news and rumors about this year’s new iPhones, check out our regularly updated <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15</a> superguide.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e47bd25b6f77e9ce0750182f1722234f153813b10efecabcfcd7cb7a85cc8d75","category":"Apple"}