{"title":"SRAM Force AXS 2023: First ride review","link":"https://cyclingtips.com/2023/03/sram-force-axs-2023-first-ride-review/","date":1677682800000,"content":"<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2023/02/brazodehierro_SRAM_force-AXS-launch_bike-check-3-9951.jpg?width=1200\" alt=\"SRAM Force AXS 2023: First ride review\" /></figure>\n<p>Here we have it, the all-new SRAM Force AXS; that’s right, not just an update to a groupset, but a slight update to the name. They’re dropping the “etap” bit from the previous generation’s name. This would be unfortunate for me as it would be a few fewer characters I could rely on for my word count. But luckily, I don’t have those worries. Instead, I will force, nope, hope, you to sit back and enjoy this video review. </p>\n\n\n\n<div></div>\n\n\n\n<p>Also, you may wonder, “why would Shoddy Dave worry about word count when it comes to a new groupset, surely there’s loads to spill the beans on”. Well, while I sit here mulling over what I like and dislike about the new groupset, I feel as though there’s not much to tell you. Or, to be more precise, not loads to whinge or nitpick about. Or both, kind of!  </p>\n\n\n\n<p>Ok, let me set the scene, a few weeks back, I got to head to Portugal and spend two days on two lovely bikes to see what SRAM had on offer with the new groupset. And apart from finding out that Portugal is more than a worthwhile destination for bike riding, I found out that SRAM’s latest road and gravel groupset should please many, but may have a few wondering where the benefits are for upgrading to this new glittery, sleeker group. Ok, enough of my rambling, please hit that play button and see exactly what I thought for this first ride review.</p>\n\n\n\n<p>Cheers, Shoddy Dave</p>","author":"Dave Everett","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e6eda3fe56b71a83b225222593bf67f3be943de344a83702b84d712de69edf35","category":"Cycling"}