{"title":"Strava’s CEO Resigns: Company Begins Search for New KOM","link":"https://www.dcrainmaker.com/2023/02/strava-ceo-michael-horvath-resigns-company.html","date":1676313842000,"content":"<p><img src=\"https://media.dcrainmaker.com/images/2020/06/DSC_5861_thumb.jpg\" /></p>\n<p>Strava’s CEO, Michael Horvath, has resigned, saying that “I have decided that Strava needs a CEO with the experience and skills to help us make the most of this next chapter”. The company says that “the search for Strava’s next CEO is underway”. While not listed in the letter, I’ve been told other members of the executive team are leaving as well, in a decision supported by the Strava board. Horvath will continue to serve as CEO until a replacement is found.</p>\n<p>Michael Horvath and Mark Gainey originally founded Strava in 2009, and it has since grown to over 100 million users, a portion of which are also paid subscribers. This is not the first time though that Michael Horvath has left the company. He previously left in 2013, though joined again in 2019 as CEO. The company changed directions then to focusing primarily on new features for paid subscribers, including <a href=\"https://www.dcrainmaker.com/2020/05/strava-cuts-off-leaderboard-for-free-users-reduces-3rd-party-apps-for-all-and-more.html/\">cutting off much of the leaderboard for free users</a>, as well as reducing access to mapping tools. While unpopular with non-paying users, the company did add a significant number of new features since he became CEO in 2019 – following a period where Strava seemingly went years without anything changing.</p>\n<p>In terms of the resignation, Strava employees were notified of the decision a week ago. This followed a few rough months of news for the company. First Strava <a href=\"https://www.bicycleretailer.com/industry-news/2022/12/05/layoffs-affect-about-15-staff-strava\">laid off about 15%</a> of their employees in December, followed by <a href=\"https://www.dcrainmaker.com/2023/01/strava-raises-prices-doubling.html\">multiple rounds</a> of bad press after the company significantly <a href=\"https://www.dcrainmaker.com/2023/01/strava-responds-pricing-country.html\">increased prices without notifying customers</a>. At present, Strava has yet to notify their subscribers of their unilateral price changes (or the CEO change), though they are allowing folks to request a discount via customer service (more on that down below).</p>\n<h3><span>Full Copy of Letter:</span></h3>\n<p>Here is a full copy of the letter that was published to the press site. This appears to be different than what was sent internally (entirely logical):</p>\n<blockquote><p>Dear Strava Community,</p>\n<p> </p>\n<p>This week I let Strava, the company, know that we are commencing the search for my successor as CEO. I feel it is important to share the same news with you, the Strava Community.</p>\n<p> </p>\n<p>When Mark Gainey and I, together with the founding team of Davis Kitchel, Chris Donahue, Mark Shaw and Pelle Sommansson, started Strava in 2009 we set out to bring people together around what they loved to do to be active. Over the years we have grown the team and our community well beyond the expectations we set for ourselves at the time. I am so appreciative of the hundreds of individuals who have joined us over the years in building Strava into what it is today, the service you rely on for daily connection and motivation. I am extremely proud that in my second run as CEO, through the dedication of this team and under my leadership, we have expanded who Strava is built for, invested in people and technologies to help more people find the motivation to be more active, and transformed our business success through the simple principle of making the product better.</p>\n<p> </p>\n<p>I have great confidence that these investments will put Strava and our subscription at the center of connected fitness for many, many more people over the coming decade and beyond. This represents a massive opportunity to help the world be more active and healthier! Yet, as co-founder and CEO, it’s only part of my job to ensure we are picking the right path to that destination. The other part of it is to ensure we always recruit and support the right leaders for the right times. What got us <i>here</i> will not be exactly the same as what will get us <i>there</i>. I have decided that Strava needs a CEO with the experience and skills to help us make the most of this next chapter. The search for Strava’s next CEO is underway and I can’t wait to see how Strava becomes <i>the</i> company and service that motivates the world to move.</p>\n<p> </p>\n<p>Mark and I are as committed to Strava’s future as ever. We’ve got exciting things in store for all of you in 2023. Together with the support of our leadership team and board of directors, I want to ensure that Strava doesn’t miss a beat between now and when we find our new leader.</p>\n<p> </p>\n<p>With deep gratitude,<br />\nMichael</p></blockquote>\n<p>You can find a copy of the letter on <a href=\"https://blog.strava.com/press/a-letter-from-michael/\">Strava’s press site here</a>.</p>\n<h3><span>A Pricing Update</span></h3>\n<p>For those following along at home, undoubtedly, a core reason for this decision being supported by the board was Strava’s aim to increase (or find) profitability. Those efforts have been met with significant resistance and cancellations in the wake of their <a href=\"https://www.dcrainmaker.com/2023/01/strava-raises-prices-doubling.html\">pricing changes last month</a>. As noted above, Strava has yet to announce these policy/pricing changes to users via e-mail. Instead, users are only notified once they get within 30 days of their upcoming renewal date.</p>\n<p>Without rehashing a <a href=\"https://www.dcrainmaker.com/2023/01/strava-responds-pricing-country.html\">previous post too much</a>, many EU users have been upset at the different pricing levels for different EU counties – a stance that the EU <a href=\"https://europa.eu/youreurope/citizens/consumers/unfair-treatment/unfair-pricing/index_en.htm\">says isn’t actually legal for</a> online services such as Strava (given it doesn’t have a different media/product catalog as a company like Netflix would). As a result, some users have e-mailed Strava Customer service, asking why they should be paying significantly more than another EU member state directly next door.</p>\n<p>Turns out, Strava customer service seems to agree in spirit, and is offering these users a 33% discount upon request:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/02/StravaPricing.jpg\"><img title=\"StravaPricing\" src=\"https://media.dcrainmaker.com/images/2023/02/StravaPricing_thumb.jpg\" alt=\"StravaPricing\" width=\"355\" height=\"768\" /></a></p>\n<p>Such a discount for a German user paying €74.99 would essentially make it match the lowest EU member state price, from Sweden, which pays ~€49 (depending on the day’s exchange rate) – thus in effect bringing it into compliance with the EU requirement for a single price discrimination policy for non-differentiated products.</p>\n<h3><span>Going Forward:</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/01/DSC_5349_thumb.jpg\" /></p>\n<p>While a new CEO will undoubtedly change the direction for Strava, it won’t immediately fix the near-term issues the company faces. The biggest issue is actually the hardest one to solve: Its free product is simply too good.</p>\n<p>Strava has tried to remedy this under now previous CEO Michael Horvath, via a blend of new features for subscribers only – but also cutting and removing existing features for free users. The challenge is, they simply haven’t found the right blend there yet. In many cases, some of the new features Strava has added (like video support last summer), should realistically have been paid features – giving one more carrot (no matter how small) to try and get people to subscribe. And inversely, Strava’s cutting of core free features (such as the leaderboards a few years ago), only served to alienate the very (long-term) users they’d eventually try and entice to the paid side.</p>\n<p>But beyond that, if Strava wants to charge the premium they do, Strava simply needs to find a way to make new features memorable. We again find ourselves in the same spot as 4 years ago, where virtually nobody can name even one new Strava feature in the last year. This isn’t to say Strava hasn’t added features in that time period – they actually very much have (such as the <a href=\"https://www.youtube.com/watch?v=Fr4jAiVbPO0\">offline maps and trail activities</a>). But many of them don’t often seem targeted at Strava’s long-time core user base, but rather at adjacent user bases. And while trying to market to new audiences is always important, trying to win back users already familiar with your product is generally easier.</p>\n<p>Further, many of these features are ones already offered by watch/device makers. One of the most common refrains I’ve heard in the past few weeks has been: “Garmin Connect already does XYZ feature anyway”, which kinda surprised me. Not because it was a surprise those features exist in Garmin Connect, but because Garmin as a company has grown their market share so much in the last 3-5 years that the overlap between paying Strava subscriber and paying Garmin device owner is probably pretty high. Thus in some ways Strava has been building features for consumers that already have them.</p>\n<p>Strava’s often unmentioned strength is the <a href=\"https://www.strava.com/apps\">very deep community of apps</a> that connects to it via the Strava API (for apps <a href=\"https://veloviewer.com/\">such as VeloViewer</a>). And while Strava often neglects these developers (in numerous ways), the app developers that manage to persist are an incredible draw for many Strava users and communities. As a company, Strava needs to figure out a way to partner with these apps to bring them and their features into the fold (such as their recently announced FATMAP acquisition). Obviously, there are pros and cons to acquiring smaller companies – but it’s clear there’s significant value in many of these features.</p>\n<p>Finally, at the same time – Strava needs to learn to listen to the new blood employees it hires. One common thread I’ve heard from existing and former Strava employees over the last few weeks, is that many times suggestions for improvements in recent years are dismissed by the ‘old guard’. Be it technical/feature suggestions, communications suggestions, or policy suggestions. Perhaps this changing of the guard will open the doors a bit more to that.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"eae3b188785f49e526e400c0a437dfc755449871cfcfb8052a5961bae5885467","category":"Cycling"}