{"title":"Apple Is Lobbying Biden Administration to Overturn Apple Watch Patent Ban","link":"https://thehill.com/lobbying/3862071-apple-flexes-lobbying-power-as-apple-watch-ban-comes-before-biden-next-week/","date":1676926480000,"content":"\n<p>Karl Evers-Hillstrom, reporting for The Hill:</p>\n\n<blockquote>\n  <p>The U.S. International Trade Commission (ITC) ruled in December\nthat Apple infringed on medical device company AliveCor’s wearable\nelectrocardiogram patents. The commission’s ruling could result in\nan import ban on popular Apple Watch models, unless the Biden\nadministration steps in.</p>\n\n<p>Apple responded by contracting with Shara Aranoff, a lobbyist at\nCovington &amp; Burling who chaired the ITC during the Obama\nadministration.</p>\n</blockquote>\n\n<p>I’m not sure what to make of the patent claims here. But this doesn’t sound right to me:</p>\n\n<blockquote>\n  <p>AliveCor told The Hill that it believed that it had a good\nrelationship with the Silicon Valley giant and went on to sell an\nECG accessory for the Apple Watch. But in 2018, Apple launched an\nApple Watch with a built-in ECG sensor and made third-party heart\nmonitoring software incompatible with the product, forcing\nAliveCor to cancel sales of its product.</p>\n\n<p>“We come up with new technologies, and instead of the ecosystem\nletting us thrive and continue to build on top of the innovations\nwe already have, Apple cuts us out up front, steals our\ntechnology, uses their platform power to scale it, and now is\nbasically saying it’s scaled so it can’t be cut off,” Abani said.</p>\n</blockquote>\n\n<p><a href=\"https://www.macrumors.com/2017/11/30/alivecor-kardia-ekg-band-medical-fda-apple-watch/\">Here’s a MacRumors story from 2017</a> about AliveCor’s $200 Kardia Band accessory, which is seemingly at the heart of this dispute. It sounds to me not that Apple “stole” any specific technology from AliveCor but rather that AliveCor is asserting that its patents give them exclusive rights to the idea of an ECG sensor that connects to a smart watch.</p>\n\n<p>I’m also not sure how to square this controversy with the fact that Apple <a href=\"https://www.fiercebiotech.com/medtech/apple-wins-battle-patent-war-alivecor-over-portable-ecg-tech\">seemingly won a decision regarding these patents from the U.S. Patent and Trademark Office in December</a>. But the stakes are serious for Apple: all of the Series 8 and Ultra models <a href=\"https://www.apple.com/watch/compare/\">have ECG sensors</a>; the only model Apple still sells without one is the SE. Surely the upcoming Series 9 (and Ultra 2?) models have ECG sensors as well.</p>\n\n<p>The other thing that struck me, as ever, with The Hill’s report is how low the financial stakes are for political lobbying:</p>\n\n<blockquote>\n  <p>Long a darling on Capitol Hill, Apple has aggressively bolstered\nits lobbying presence in recent years as lawmakers began to\nclosely scrutinize its market dominance. Apple spent nearly $9.4\nmillion on lobbying in 2022, the highest figure in the company’s\nhistory, according to nonpartisan research group OpenSecrets.</p>\n</blockquote>\n\n<p>$9.4 million is loose pocket change for Apple. The company generated about $95 <em>billion</em> in profit <a href=\"https://sixcolors.com/post/2023/02/apple-results-and-charts-117-2b-quarter-is-still-a-step-back/\">over its last four financial quarters</a>. So (<em>does some back-of-the-envelope math</em>) Apple spends about <em>one hour</em> of its annual profit on lobbying.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/02/20/apple-alivecor-patent-ban\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"eeb55cb33e5c614b73881571127ceb7aa00f293bef6617a2acb554f7b840b8d8","category":"Tech"}