{"title":"Rivian recalls nearly 13,000 electric trucks and SUVs for seatbelt fix","link":"https://arstechnica.com/?p=1921906","date":1678112665000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/Rivian-SUVs-1-800x600.jpg\" alt=\"A pair of Rivian SUVs next to a motel\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/Rivian-SUVs-1-scaled.jpg\">Enlarge</a> <span>/</span> The recall affects both the Rivian R1S (pictured) and the R1T pickup truck. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Rivian is in the <a href=\"https://static.nhtsa.gov/odi/rcl/2023/RCLRPT-23V109-4124.PDF\">process of recalling</a> nearly 13,000 <a href=\"https://arstechnica.com/cars/2021/09/rivians-67-500-314-mile-electric-adventure-truck-put-to-the-test/\">R1T trucks</a> and <a href=\"https://arstechnica.com/cars/2022/07/rivians-r1s-is-an-electric-suv-for-those-with-an-adventurous-lifestyle/\">R1S SUVs</a> due to a potential seatbelt problem. It believes that in some vehicles, a sensor within the seatbelt system is missized or \"dimensionally out of tolerance,\" which could prevent the automatic locking retractor from working properly. That, in turn, could lead the front passenger airbag to believe the seat was unoccupied during a crash and fail to trigger.</p>\n<p>Last July, Rivian and its supplier were investigating a vehicle displaying a message that the front passenger airbag was off despite having a passenger in that seat. Rivian and its supplier, Autoliv, worked on the problem until January, collecting more potentially suspect parts from other Rivian EVs. In February, the startup determined that vehicles with the suspect parts would not be compliant with federal safety regulations and initiated the recall.</p>\n<p>Unlike many problems we see on new EVs, this one is not the sort that can just be fixed with a software patch. Although Rivian thinks that only 1 percent of the 12,716 affected cars have a defective part, it will inspect and, if necessary, replace the passenger seatbelt components in those affected vehicles.</p></div><p><a href=\"https://arstechnica.com/?p=1921906#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1921906&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fc972e516c0f09061b37d40de897b9e2c20bcc215d2e89ad2647fdc794db338c","category":"Tech"}