{"title":"Headphones without headphones: We test Lucyd Lyte Bluetooth sunglasses","link":"https://arstechnica.com/?p=1747875","date":1615241147000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>missed it by that much —</h4><h2 itemprop=\"description\">Bluetooth sunglasses are a great idea—but these aren't quite good enough.</h2></header><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-mirrorshades-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-mirrorshades.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-mirrorshades-980x638.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-mirrorshades-1440x938.jpg 2560\" data-sub-html=\"#caption-1747892\"><figure><figcaption id=\"caption-1747892\"><span></span><p>The pair of Lucid Lyte we received as a review sample are unassuming, mildly reflective Wayfarer-style sunglasses.</p><p><span></span> Jim Salter</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-in-car-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-in-car.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-in-car-980x856.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-in-car-1440x1258.jpg 2560\" data-sub-html=\"#caption-1747891\"><figure><figcaption id=\"caption-1747891\"><span></span><p>The Lucid Lytes make pretty decent sunglasses. They wear comfortably and don't look like weird techno things.</p><p><span></span> Jim Salter</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/view-through-glasses-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/view-through-glasses.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/view-through-glasses-980x898.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/view-through-glasses-1440x1320.jpg 2560\" data-sub-html=\"#caption-1747937\"><figure><figcaption id=\"caption-1747937\"><span></span><p>The tint on the Wayfarer Lucyd Lytes I tested is solidly medium—dark enough to provide relief on a sunny day, but not so dark that you can't keep playing catch with the kids at sunset.</p><p><span></span> Jim Salter</p></figcaption></figure></li></ul></div><p><a href=\"https://fave.co/3cb5cfH\" target=\"_blank\" rel=\"noopener\">Lucyd Lyte</a> is a pair of $150 sunglasses which includes speakers and a mic, suitable for making phone calls or listening to podcasts. This isn't a category of device I was aware of at all before a PR rep reached out to offer a review unit—but once I knew it was a thing, I very much wanted to test it.</p><p>The Wayfarer style that I tested is a neutral, unremarkable style unlikely to get much attention whether negative or positive. They look nicer than gas station sunglasses but without any particular style cue to lead a viewer into thinking they're an expensive designer brand. There's no visual clue about the onboard audio, either—the frames are a touch on the thick side, but unlike <a href=\"https://amzn.to/3qoUqax\" target=\"_blank\" rel=\"noopener\">Bose Frames</a>, there's no telltale shape to give the extra functionality away.</p><p>Lucyd Lyte paired with my Pixel 2XL phone quickly and easily. The instructions recommend a two-hour initial charging period; when factory-new and after the initial charging period, the phones are both on and in pairing mode—all you need to do is open the pairing menu on your phone and select \"Lucyd Lyte.\"</p><p>There is no specific trigger to \"pairing mode\" on the Lucyd Lytes—if they're not in range of the device they were last paired to, they go into pairing mode and can be selected from any new device in range.</p><h2>Testing</h2><p>As sunglasses, Lucyd Lytes are quite good. I found them comfortable enough to \"disappear\" on my head in six-plus hours of continuous wear, beginning with a 45-minute drive and continuing through conversations with my parents, playing catch with my kids, and otherwise goofing off outdoors on a bright sunny Saturday.</p><p>As Bluetooth headphones, they're unfortunately not as stellar. The audio quality is decent, but the maximum volume level is low—and anyone nearby can hear what you're listening to nearly as well as you can. I listened to podcasts on the 45-minute drive out to my parents' house, and my daughter reported that she could hear the podcasts easily (including making out most or all of the words) from the passenger's seat.</p><p>The low max volume isn't a problem when listening to music or to well-normalized podcasts, but it's likely to be an issue on phone calls or podcasts with a very quiet source. At maximum volume, Joe Ressington's <a href=\"https://latenightlinux.com/\">Late Night Linux</a>&nbsp;wasn't quite as loud as I wanted it to be, but I could understand everyone speaking over the interstate road noise. Jamie Loftus' <a href=\"https://www.iheart.com/podcast/1119-lolita-73899842/\">Lolita Podcast</a>&nbsp;was another story entirely—engineered with far quieter source levels, I needed to cup one ear (drastically increasing perceived volume from the phones) almost continuously.</p><p>Maintaining the Bluetooth connection was also a bit of a crapshoot. With the Pixel 2XL sitting in a cupholder, the connection was fine. Putting the Pixel in the pocket of my jeans would almost immediately kill the connection, after which the Pixel would connect to my car instead until manually redirected to my (unpocketed) phone. I had much better luck with the phone pocketed while walking around than I had in my car—but it was never rock solid.</p><p>Aside from the volume issues, the audio quality is decent—better than you might expect from practically microscopic speakers embedded in a sunglasses stem, but not up to snuff when compared to typical earbuds or headphones. For voice calls or podcasts—again, assuming the level is high enough—you're unlikely to have any complaints. The Lytes&nbsp;are unlikely to be anyone's favorite music listening device, however, with nearly nonexistent bass and little if any sense of stereo positioning.</p><p>We tested Lucyd Lyte's mic using a voice recorder app rather than a call, to eliminate any potential telephony issues. The experience is better than putting the Pixel 2XL in speakerphone mode, but it's not as good as either the phone's native mic in normal mode or the mic in most standard headsets. The audio level and clarity are quite good, but there's little to no differentiation between the speaker's voice and ambient noise—in my test recording, my kids' voices and the episode of&nbsp;<em>Spongebob Squarepants</em> on the television were just as much in the foreground as my own voice was.</p><p>Battery life seemed easily up to the manufacturer's claim of eight hours—we didn't attempt to run them dry, but after about 90 minutes of driving and nonstop listening to podcasts, the Bluetooth connection dialog on the Pixel 2XL reported the Lytes' batteries at 85 percent.</p><h2>Controls</h2><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/lucyd-control-button-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/lucyd-control-button.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/lucyd-control-button-980x678.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/lucyd-control-button-1440x996.jpg 2560\" data-sub-html=\"#caption-1747952\"><figure><figcaption id=\"caption-1747952\"><span></span><p>There's an inconspicuous but tactile brass button on the bottom of each stem, near the eyepiece. The buttons accept short press, double-press, triple-press (!), and long-press actions.</p><p><span></span> Jim Salter</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-pinhole-LED-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-pinhole-LED.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-pinhole-LED-980x735.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/glasses-pinhole-LED-1440x1080.jpg 2560\" data-sub-html=\"#caption-1747935\"><figure><figcaption id=\"caption-1747935\"><span></span><p>There's a tiny pinhole LED on each stem that flashes red/blue for pairing or powering on and gently pulses blue/off/blue when powered on and connected.</p><p><span></span> Jim Salter</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/lucyd-lyte-charge-port-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/lucyd-lyte-charge-port.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/lucyd-lyte-charge-port.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/lucyd-lyte-charge-port.png 2560\" data-sub-html=\"#caption-1747936\"><figure><figcaption id=\"caption-1747936\"><span></span><p>Lucid Lyte has one magnetically coupled charge connector on each stem, which connects to the two ends of a Y-style charging cable.</p></figcaption></figure></li></ul></div><p>The Lucyd Lyte phones are easy to manage—the included charge cable has magnetically coupled two-pin connectors which snap directly onto contacts on each stem of the sunglasses. The charging cable is a Y-splitter type and needs to be connected to both stems—they have independent batteries which must also be charged independently.</p><p>The individual stems are also powered on independently. Long-pressing one control button results in that stem's voice eventually declaring \"powered on,\" after which you can long-press the button on the other until it, too, powers up. With only one stem powered on, the onboard voice will declare \"connected\"—once the second stem also powers on and connects, you get a Windows-style \"bing-bong\" sound effect that lets you know everything is fully connected.</p><p>Once powered on, what the controls do depends in part on whether you're taking a call or listening to music—a single tap on either button will answer an incoming call, or a two-second long press will decline it. While connected (to either calls or music), a single press of the left button increases volume, and a single press of the right button decreases it. Double-pressing either button pauses music (or podcast) playback, and triple-pressing either button skips tracks forward or backward depending on button.</p><p>Powering the headphones off is done with an eight-second-long press on either button. Unlike the power-on procedure, powering either stem off turns the other one off along with it.</p><h2>Conclusions</h2><p>My wife and I were both pretty excited about this device—even though the audio quality isn't up to par with good traditional headphones, the light weight and lack of aural intrusion appealed to us both. If these were cheap devices, I'd be on board with them for certain use cases despite their Bluetooth connection flaws and relatively low volume.</p><p>The ambient broadcast factor of the Lucyd Lytes is also unappealing. Half the point of using headphones is sparing those around you from hearing your music or podcasts—which the Lucyd Lytes absolutely do not do. In a car full of road noise, it's much less obnoxious than blaring a podcast out over the car stereo—but if there's something in your podcast or music you'd prefer other people not overhear, these aren't a good choice.</p><p>Unfortunately, at $150, this isn't a cheap device. At that price, we expect a solid, reliable Bluetooth connection at the very least—and we didn't get it. For us, that's the deal-breaking flaw in Lucyd Lyte.</p><h3>The Good</h3><ul><li>Comfortable</li><li>Lightweight</li><li>Unobtrusive styling</li><li>Neither in nor on your ears</li><li>Reasonably clear audio</li><li>You can still hear what's going on around you</li><li>Simple, tactile controls</li><li>Magnetically coupled charging</li><li>Can be ordered with standard, prescription, bifocal, or reader lenses</li></ul><h3>The Bad</h3><ul><li>Flaky Bluetooth connection</li><li>Inadequate maximum volume</li><li>Completely audible to anyone nearby</li></ul><h3>The Ugly</h3><ul><li>We didn't know we wanted Bluetooth sunglasses until testing these</li><li>Now we know—and these are tantalizingly close, but still not quite there</li></ul><p><em>Listing image by Jim Salter</em></p></div></div></div>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0002bbc9dd13501ffa4c11ab728becea857462431a09fb6faae3f36781307349","category":"Tech"}