{"title":"Australia passes law to force Facebook and Google to pay for news","link":"https://arstechnica.com/?p=1745134","date":1614275080000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>The end of the beginning —</h4><h2 itemprop=\"description\">Australia's approach could become a model for other countries.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1303955757-800x533.jpg\" alt=\"Australian Prime Minister Scott Morrison.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1303955757.jpg\" data-height=\"2985\" data-width=\"4477\">Enlarge</a> <span>/</span> Australian Prime Minister Scott Morrison.</p><p>Sam Mooy/Getty Images</p></figcaption></figure><p>The Parliament of Australia has passed a final version of legislation designed to force Google and Facebook to pay to link to news articles. The passage of the&nbsp;News Media Bargaining Code marks the end of a contentious months-long negotiation between the Australian government and the two technology giants—which are singled out in the code.</p><p>Google and Facebook have long argued that they shouldn't have to pay a dime to link to news articles, since the links send valuable traffic to news sites. Over the last decade, Google has successfully <a href=\"https://www.theguardian.com/media-network/2014/dec/12/google-news-spain-tax-withdraws\">beaten back</a> efforts to undermine the principle of free linking.</p><p>But over the last couple of years, governments in Australia and Europe have become more determined to force American technology giants to financially support their domestic news industries. In 2019, the European Parliament <a href=\"https://arstechnica.com/tech-policy/2019/03/the-eu-votes-on-a-confusing-new-copyright-law-tuesday/\">created a new \"neighboring right\"</a> giving news sites the right to control the use of \"snippets\" in search results, and French regulators <a href=\"https://arstechnica.com/tech-policy/2020/04/french-regulator-says-google-must-pay-news-sites-to-send-them-traffic/\">made it clear</a> that Google wasn't allowed to simply stop showing snippets—Google needed to cough up some cash.</p><p>The initial version of the Australian law was even more aggressive. It not only required tech giants to negotiate with news sites, it proposed a baseball-style arbitration process where each party (an Australian news publisher and a technology giant, respectively) would put forward a proposal, and then an independent arbitrator would decide which proposal was more \"reasonable.\" This was widely seen as increasing the bargaining power of the news sites.</p><p>In January, Google <a href=\"https://arstechnica.com/tech-policy/2021/01/google-threatens-to-shut-down-australian-search-over-link-tax-proposal/\">threatened to shut down</a> its Australian search engine if the law went into effect. Last week Facebook went even further, <a href=\"https://arstechnica.com/tech-policy/2021/02/facebook-bans-all-australian-news-content-over-pay-to-link-proposal/\">blocking users</a> from sharing any Australian news articles. Microsoft seized on the opportunity to undermine its rivals, loudly <a href=\"https://arstechnica.com/tech-policy/2021/02/microsoft-backs-australian-law-forcing-google-to-pay-for-news-links/\">endorsing</a> the Australian approach and supporting the concept of paying for news content.</p><h2>Google and Facebook are opening their wallets</h2><p>After several days of intense bargaining, Facebook and Australia <a href=\"https://arstechnica.com/tech-policy/2021/02/facebook-to-reverse-australia-news-ban-after-lawmakers-alter-bill/\">reached a deal</a> that let both of them save face. Facebook agreed to re-enable sharing of news articles. In exchange, the Australian government allowed Facebook to opt out of the forced arbitration process if it could convince the government that it had already \"made a significant contribution to the sustainability of the Australian news industry through reaching commercial agreements with news media businesses.\" Google and Facebook have both been busily <a href=\"https://newscorp.com/2021/02/17/news-corp-and-google-agree-to-global-partnership-on-news/\">inking</a>&nbsp;<a href=\"https://www.sevenwestmedia.com.au/assets/pdfs/Seven-West-Media-and-Facebook-set-up-new-partnership.pdf\">deals</a> with Australian media companies in an effort to show that more coercive measures were unnecessary.</p><p>The revised law gives tech companies a longer window of time to reach voluntary deals before they're forced into an arbitration process.</p><p>While these changes were tactical gains for Facebook and Google relative to Australia's harsh original proposal, it's clear that the tech giants have abandoned their earlier stance that they shouldn't have to pay at all. At this point, there seems to be little prospect that Google will be able to resist similar proposals in EU member states, though they may get deals watered down at the margin.</p><p>Canada and other countries are <a href=\"https://www.reuters.com/article/us-facebook-canada/facebook-exploring-potential-news-licensing-agreements-in-canada-source-idUSKBN2AO2WD\">considering similar legislation</a>. Facebook and Google are rushing to preempt those laws by <a href=\"https://www.cnbc.com/2021/02/10/google-is-going-to-start-paying-uk-publishers-for-news.html\">striking voluntary deals</a> with news organizations around the world.</p><p>In the long run, this could leave the United States as an outlier among developed countries. As far as we know, there are no serious proposals to adopt the Australian model here. The courts could strike down such a requirement on First Amendment grounds. And constitutional issues aside, it's hard to imagine the US Congress making the necessary changes to US copyright and antitrust laws.</p></div></div>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"003b027cda761d458c3be4e94859b89ba8dafabf0e5ad21c55079423d7e02ebc","category":"Tech"}