{"title":"Ousted CEO Matze sues Parler, claims board robbed him of millions","link":"https://arstechnica.com/?p=1751654","date":1616601925000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>drama —</h4><h2 itemprop=\"description\">The suit provides a peek into Parler's founding and behind-the-scenes drama.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1230527708-800x534.jpg\" alt=\"Parler leadership is a bit shadowy at the moment.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1230527708.jpg\" data-height=\"2568\" data-width=\"3844\">Enlarge</a> <span>/</span> Parler leadership is a bit shadowy at the moment.</p></figcaption></figure><p>Former Parler CEO John Matze is suing the board of the troubled social media company, alleging that funder Rebekah Mercer and board members she placed engaged in a scheme to steal his share in the company he co-founded.</p><p>\"While Mercer readily acknowledged and broadly boasted... that Parler was an enterprise worth hundreds of millions of dollars, if not a billion dollars, she and others orchestrated a theft of Matze's 40 percent ownership, claiming that it could be taken from him for a mere $3.00,\" Matze claims in the suit (<a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/a-21-831556-b.pdf\">PDF</a>).</p><p>The complaint calls the maneuvering \"outlandish and arrogant theft,\" adding that \"this scheme is epitomized by oppression, fraud, and malice, for which Matze is entitled to receive punitive damages\" of at&nbsp;least three times the \"millions he is owed in compensatory damages.\"</p><p>In the suit, Matze&nbsp;names not only Mercer and several other members of the Parler board but also ten unnamed defendant individuals (Does I through X) and ten unnamed defendant corporations (Roes XI through XX), \"unknown to Matze at the present time,\" who he believes are also responsible and who he seeks to learn the true identities of through the discovery process.</p><p>The suit was filed late Monday in Clark County, Nevada, where Matze resides. The Las Vegas Sun was <a href=\"https://lasvegassun.com/news/2021/mar/22/parler-co-founder-sues-over-ouster-claiming-theft/\">first to report</a>.</p><h2>There’s some history here...</h2><p>The suit presents a narrative of the founding of the company that has largely not been made public to date, as well as more details about allegations Matze made earlier this year.</p><p>Parler <a href=\"https://arstechnica.com/tech-policy/2020/11/what-is-parler-and-why-is-everyone-suddenly-talking-about-it/\">launched in 2018</a>, billing itself as \"a non-biased, free speech social media focused on protecting user's rights.\" Matze and his college roommate, Jared Thomson, built out the site, which began to attract a population of conservative, Republican, and extreme right-wing users against the backdrop of the contentious 2020 US presidential election.</p><p>Mercer's involvement became public in November thanks to a <a href=\"https://www.wsj.com/articles/parler-backed-by-mercer-family-makes-play-for-conservatives-mad-at-facebook-twitter-11605382430\">Wall Street Journal report</a>. Rebekah Mercer and her father Robert are well-known donors to conservative causes, including <a href=\"https://theintercept.com/2021/01/14/capitol-riot-mercers-election-unrest/\">conservative</a> <a href=\"https://www.cnbc.com/2021/01/11/capitol-hill-riot-pac-once-funded-by-trump-ally-mercer-promoted-rally-march.html\">super PACs</a> and <a href=\"https://www.cnbc.com/2020/04/15/robert-mercer-starts-big-money-effort-for-trump-campaign.html\">both of former US President Donald Trump's presidential campaigns</a>. The family also backed <a href=\"https://apnews.com/article/64280ae1f30c44eb8b82049f6875dddd\">Cambridge Analytica</a>.</p><p>Matze in the suit claims that he was introduced to Mercer in 2017 and that he and she discussed the possibility of building a community commenting platform for extreme right-wing site Breitbart News. The two agreed to work together, and when a contract with Breitbart \"did not materialize,\" Matze suggested he work instead on the platform that would become Parler, and Mercer agreed to fund the project.</p><p>\"At her direction, Mercer's ownership in Parler was initially intended to be a secret,\" the suit alleges, and was therefore held in the name of NDMascendant, LLC. \"However,\" the complaint goes on, \"Matze alleges and believes that NDM simply served as Mercer's alter ego to mask her role in Parler. Mercer herself believed that her involvement would serve as a distraction and would be potentially toxic to Parler's business objectives.\"</p><p>Matze and Mercer worked out an arrangement in which&nbsp;NDM would be the 60 percent owner of all voting shares, with Matze retaining the remaining 40 percent, the suit claims. Matze had the authority to appoint one manager—himself. NDM had the authority to appoint two managers. One was Matthew Richardson, who stepped into an \"executive committee\" role following Matze's split from the company. <em>Hillbilly Elegy</em> author and <a href=\"https://www.washingtonpost.com/opinions/2021/03/19/jd-vance-senate-ohio/\">potential Senate candidate</a> J.D. Vance also showed up to \"at least one manager's meeting\" claiming to be a manager of Parler, \"although Matze was never provided with confirming documentation.\"</p><p>Mercer lost interest in Parler for a time in 2019 and 2020, the suit alleges, leading Matze to talk to other potential investors, including conservative media personality Dan Bongino. In fall of 2020, as Parler became more popular, Matze says he laid out potential strategies for growth with investors, and everyone involved mutually agreed that aggressive growth, relying on Amazon Web Services to continue hosting the platform, was the best path forward.</p><h2>Then everything hit the fan</h2><p>From Parler's point of view, everything went abruptly pear-shaped in the wake of the January 6 insurrection at the US Capitol. Hundreds of participants in the mob were <a href=\"https://projects.propublica.org/parler-capitol-videos/\">sharing live video and photos</a> of the violence on Parler, as well as using the service to post violent threats and egg each other on.</p><p>The attack at the Capitol happened on a Wednesday. By Friday, Google <a href=\"https://arstechnica.com/tech-policy/2021/01/google-bans-parler-from-android-app-store/\">banned the Parler app</a> from its Google Play store. Apple <a href=\"https://www.theverge.com/2021/1/9/22221730/apple-removes-suspends-bans-parler-app-store\">followed suit</a> within hours, kicking Parler out of the iOS App Store. And by the end of the weekend, the biggest hammer of all fell on Parler, when Amazon <a href=\"https://arstechnica.com/tech-policy/2021/01/amazon-cuts-off-parlers-web-hosting-following-apple-google-bans/\">suspended the site's web hosting</a>, driving it temporarily offline.</p><p>Parler <a href=\"https://arstechnica.com/tech-policy/2021/01/parler-goes-dark-sues-amazon-to-demand-immediate-reinstatement/\">sued Amazon</a> over the suspension of service, demanding reinstatement. Amazon in turn pointed out that it had <a href=\"https://arstechnica.com/tech-policy/2021/01/filing-amazon-warned-parler-for-months-about-more-than-100-violent-threats/\">warned Parler about violent content</a> on the platform for months. By February, Parler <a href=\"https://arstechnica.com/tech-policy/2021/02/parler-says-its-back-without-big-tech-after-being-kicked-off-amazon/\">brought itself back online</a> with alternate hosting and is slowly trying to work its way back to the level of popularity it had late last year.</p><p>While Parler was offline after getting the boot from Amazon, the board <a href=\"https://arstechnica.com/tech-policy/2021/02/parler-financial-backers-oust-founder-and-ceo-matze-from-company/\">fired Matze</a>. In his suit, Matze claims his firing was \"in violation of the law and public policy\" because he \"endeavor[ed] to preserve Parler's commitment to free expression while combatting any misuse by violent extremists and domestic terrorists.\"</p><p>That was Mercer's doing, Matze alleges. \"To address what Matze viewed as improper threats from Apple and Amazon, Matze proposed to Mercer... that Parler bar any identifiable extremist groups like QAnon and neo-Nazis from Parler's platform\" because they were inciting violence and acts of domestic terrorism. Matze claims his proposal \"was met with dead silence.\" Instead of getting Parler back online more quickly, he claims, Mercer wanted to make it \"the 'tip of the conservative spear'... Parler was now being hijacked to serve the personal political interests and personal advantages of [Mercer and the board] rather than serve as the free expression platform as originally conceived.\"</p><p>Jeffrey Wernick, a \"third-party consultant\" who \"was allowed to portray himself as Chief Operating Officer\" of Parler approached Matze at the end of January \"and threatened him with financial ruin if he did not immediately sign a release of claims and resign,\" the suit alleges. \"Wernick threatened Matze that he would be buried under an avalanche of legal claims and expenses if he dared defy Mercer.\" Matze claims he refused to sign the release and consulted his attorney, at which point \"he was abruptly and unceremoniously fired the next day\" by Mark Meckler, who is currently serving as Parler's interim CEO.</p><p>After firing him, Matze claims, Parler leadership undertook a public campaign \"to defame Matze's business reputation,\" alleging he stood in violation of the Parler operating agreement and allowing \"the forced sale and purchase\" of his 40 percent stake in the company. Despite their own claims that Parler should be valued at hundreds of millions of dollars, Matze claims, \"Mercer, through Meckler and Richardson, claimed they had determined the 'fair market value' of Matze's 40 percent interest to be a mere $3.00.\"</p><p>We have asked Parler for comment and will update this story if we hear back.</p></div></div></div>","author":"Kate Cox","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0056e0950ed95446cec742b2907da34e4f87061d2979f9acf2b7b58407717518","category":"Tech"}