{"title":"PA woman charged with using deepfakes to harass teenage cheerleaders","link":"https://arstechnica.com/?p=1749616","date":1615841980000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>unreal —</h4><h2 itemprop=\"description\">Specifically using deepfakes isn't against state law, but harassment sure is.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-699162433-800x533.jpg\" alt=\"The manipulated images showed the cheerleaders holding much less innocent things than pompoms. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-699162433.jpg\" data-height=\"3072\" data-width=\"4608\">Enlarge</a> <span>/</span> The manipulated images showed the cheerleaders holding much less innocent things than pompoms.</p></figcaption></figure><p>A woman in eastern Pennsylvania allegedly created a series of deepfake videos in a harassment and bullying campaign meant to intimidate teenage girls in competition with her daughter and get them kicked off a local cheerleading team.</p><p>Hilltown Township police earlier this month charged Raffaela Spone with three counts of cyber harassment of a child after she allegedly began harassing the teenagers last July, according to the <a href=\"https://bucks.crimewatchpa.com/da/29567/post/chalfont-woman-charged-cyberbullying-daughters-cheerleading-rivals\">Bucks County District Attorney</a> Matthew Weintraub.</p><p>The girls received voice and text messages saying, \"You should kill yourself,\" followed by doctored videos taken from images on their social media profiles and altered to make them appear nude, vaping, or drinking. The altered images included captions reading, \"toxic traits, revenge, dating boys, and smoking\" and \"was drinking at the shore, smokes pot, and uses 'attentionwh0re69' as a screen name.\" The images and videos were also sent to coaches for the team, seemingly in an attempt to have the girls removed from the team.</p><p>On review, police found video \"to be the work of a program that is or is similar to 'Deep Fakes,' where a still image can be mapped onto an existing video and alter the appearance of the person in the video to show the likeness of the victim's image instead,\" according to an affidavit filed in the case. Spone allegedly used several phone numbers to send the messages, but investigators determined all the numbers were obtained through the same wholesaler and executed a warrant on the wholesaler seeking IP address information about the originating calls. That information was linked to Spone's residence, and after searching Spone's devices, police determined her phone was \"used to download, access, and or manipulate data\" on the wholesaler's app.</p><p>Weintraub said Spone faces misdemeanor charges and not higher-level charges because the \"nude\" images did not actually depict minors in sexual situations (real or simulated). Instead, the images were basically crude digital removals of an existing bikini to create a \"Barbie doll-like\" effect \"with no obvious genitalia.\" Had the images actually looked like nudes, Spone would have faced \"a much more serious felony offense.\"</p><h2>Fake images, real crimes</h2><p>In the way of many once-novel technologies, tools for creating deepfake video are rapidly becoming more accessible and more affordable. In 2019, for example, the maker of a program called DeepNude, which used neural networks to make images of clothed women appear to be realistic nudes, was forced to <a href=\"https://arstechnica.com/tech-policy/2019/06/author-pulls-software-that-used-deep-learning-to-virtually-undress-women/\">stop distributing the tool</a> following strong public backlash. A few months later, Ars' own Timothy Lee <a href=\"https://arstechnica.com/science/2019/12/how-i-created-a-deepfake-of-mark-zuckerberg-and-star-treks-data/\">demonstrated</a> how to turn Facebook CEO Mark Zuckerberg into the galaxy's most famous android, Lt. Cmdr. Data from <em>Star Trek: The Next Generation</em> using neural networks.</p><p>In recent years, as the technology has become more accessible, several states have passed laws specifically addressing use of deepfakes. Virginia in 2019 became the first to <a href=\"https://arstechnica.com/tech-policy/2019/07/deepfake-revenge-porn-distribution-now-a-crime-in-virginia/\">adopt a law</a> imposing criminal penalties on distribution of faked, nonconsensual, sexually themed material (i.e., revenge porn). In the same year, Texas banned deepfakes designed to influence an election. California then passed two laws, one to deal with revenge porn and one to deal with election manipulation, and several other states have continued to introduce legislation tackling one or the other.</p><p>The federal government, too, is trying to find its way on the issue. The 2020 National Defense Authorization Act (passed in December 2019) <a href=\"https://blog.malwarebytes.com/artificial-intelligence/2020/01/deepfake-rules-take-hold-in-the-us/\">included several provisions</a> related to studying the potential national security threat poised by deepfake content. The <a href=\"https://arstechnica.com/tech-policy/2020/12/house-overrides-trump-veto-defying-demand-to-repeal-section-230/\">2021 version</a> included similar provisions.</p></div></div></div>","author":"Kate Cox","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0082206c375d73bd7303c87eb4fbdc397af0cf8eaf09e082c7e991ec66aabb18","category":"Tech"}