{"title":"‘Don’t say the name’: Mark Cavendish inches closer to Eddy Merckx’s record","link":"https://cyclingtips.com/2021/07/dont-say-the-name-mark-cavendish-inches-closer-to-eddy-merckxs-record/","date":1625163799000,"content":"<div><p></p><h4>Mark Cavendish wins stage 6 of the Tour de France.</h4><p></p><div><p>Mark Cavendish moved to within two victories of Eddy Merckx’s all-time record for <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a> stage wins on <a href=\"https://cyclingtips.com/2021/07/cavendish-sprints-to-another-victory-on-stage-6-of-the-tour-de-france/\" target=\"_blank\">Thursday</a> – but don’t tell the 36-year-old Manxman that.</p><p>Even as it became more apparent than ever that Cavendish has a real shot at the record after he won Thursday’s stage 6 of the Tour de France, the 32-time Tour stage winner continued to play it coy after the race, much as he has in the past several interviews he has given.</p><p>“Don’t say the name,” Cavendish said with a smile when an interviewer brought up the record without mentioning Merckx directly after stage 6. “I am not thinking about anything. I just won a stage in the Tour de France. That’s what people work their whole lives for. I’m very, very happy. If I win another 50 more, I’m good enough to win 50. If I’m good enough to never win again here, so be it, I’m not good enough to win here. It’s the Tour de France.”</p><p>Five years removed from his last Tour stage win and less than a year removed from saying he expected to retire at the end of 2020, Cavendish came into this race as a <a href=\"https://cyclingtips.com/2021/06/mark-cavendish-is-going-to-the-tour-de-france/\" target=\"_blank\">last-minute addition</a> to the Deceuninck-QuickStep squad after Sam Bennett was taken off the Tour roster. Having already proven his form against a strong field on the final stage of the Baloise Belgium Tour, he went into the Tour feeling good but avoiding making any prognostications about what to expect.</p><p>He went on to take a clear victory on Tuesday’s stage 4, bringing his career Tour stage win count to 31, and then he made it 32 when he took another clear victory on stage 6 in Châteauroux, where he had already won twice in his career.</p><p>He has already jumped out to a commanding lead in the points classification, and whether he wants to talk about it or not, Cavendish seems primed to contend for more wins as the race goes on, putting the record of 34 victories into play. For starters, he looks to be in flying form, and is supported by an elite lead-out train at Deceuninck-QuickStep. What’s more, the current Tour sprint field is without the likes of Sam Bennett, Caleb Ewan (Lotto Soudal), and Dylan Groenewegen (Jumbo-Visma). With Cavendish saying on Wednesday that he expects Deceuninck-QuickStep to take Fabio Jakobsen to next year’s race, he may never have a better shot at the record than he has right now – and he will get his opportunities too.</p><p>Even with three sprint stages in the rearview mirror at the Tour, there are still five potential chances for the bunch sprinters to come. Cavendish doesn’t even need to win half of them to tie the record of that all-time great whose name he prefers we avoid mentioning, and if he wins on more than half of those stages, he’ll set a new record.</p><p>Should it come to that, Cavendish just might address what he has accomplished. Until then, expect him to keep playing it cool – it’s been working pretty well so far.</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"00b1262d545fe26af906bbb629bc3ceed747a27aca2eea1d4c6464f420338cd2","category":"Cycling"}