{"title":"Mike Woods is ‘all in for the Olympics’ in 2021","link":"https://cyclingtips.com/2021/04/mike-woods-is-all-in-for-the-olympics-in-2021/","date":1617632820000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Mike Woods wins stage 2 of the Tour des Alpes Maritimes et du Var.</h4><p></p><div><p>After five seasons with the Slipstream organization, Mike Woods made the move over to Israel Start-Up Nation at the start of 2021. Following his first ever change of teams at the WorldTour level, Woods might have been forgiven for taking some time to get used to his new digs.</p><p>It took him two days of racing to get his first win in his new kit. The 34-year-old Canadian stormed to victory on stage 2 of the Tour des Alpes Maritimes et du Var in February, and then rode to second overall.</p><p>A bout with bronchitis derailed his plan of starting Tirreno-Adriatico, but Woods recovered in time to race the Volta a Catalunya, where he rode to second on a mountainous stage 4. In short, he seems to be settling in just fine, and as he takes on the Itzulia Basque Country this week with the Ardennes Classics to follow, he has plenty of reason to be optimistic about his first season with Israel Start-Up Nation, where he is one of several newcomers alongside the likes of Chris Froome and Sep Vanmarcke.</p><p>“What’s really stood out for me is how easy the transition’s been,” Woods told CyclingTips by phone. “By virtue of having Paulo Saldanha as the head of performance and the owner Sylvan Adams, those two guys being the reason why I got into pro cycling, having them at the helm of the team has made the transition super-easy because there’s just been a lot of familiarity coming aboard.”</p><p>Woods, Saldanha, and Adams go back several years now.</p><p>“I was working with Paolo in 2013,” Woods said. “He was sponsoring Garneau-Quebecor, which was the Continental team I was on. He provided coaching services to the team. I decided to take him up on his coaching services and went to his PowerWatts studio in Montreal and there we did some testing and in testing he was like, ‘Man, your numbers are so good you could be a pro.’ And I said, ‘Ok, but I can’t justify quitting my job and committing to this full time,’ because I was 26 at the time, and he said, ‘Don’t worry, I’ll figure this out.'”</p><p>That’s where Adams came in.</p><p>“[Saldanha] was working with Sylvan Adams at the time, and Sylvan gave me some funding the next year that changed my life. It enabled me to quit my job and focus on my training and it really was one of those moments when you look back and you realize that was what changed things for me. I’m so fortunate to have had him in my corner and have him in my corner now.”</p><p>Reunited with two figures who have played major roles in his career progression so far, Woods has found it easy to be comfortable in his new digs. He has been very happy with his training too. His offseason went well, and the former competitive runner has reintroduced running into his regimen to great effect.</p><p>“This year’s the first year where I’m actually doing it regularly throughout the season, and I’m so glad I’m doing it,” Woods said. “I basically now don’t take easy days on the bike. If I have an easy day I just swap it out for an easy run. I just love the simplicity of it. Even an easy day, a one-hour ride is a two-hour investment in time, whereas an hour run is max an hour and 10 minutes investment in time. As a dad, time is precious – particularly on those easy days, you want to spend a lot of time with your kid.”</p><p>Woods should have plenty of opportunities to put his training to the test this week at the Itzulia Basque Country, where he’s eyeing stage wins ahead of the Ardennes.</p><p>“I feel like I’m at a 100% for the Basque country,” Woods said. “Obviously my time trial is pretty weak, especially compared to some of the guys who are coming in as the big contenders like [Tadej] Pogacar and [Primoz] Roglic. But I think I’m going to be able to contend on certain stages and I think the Basque Country is just such an important race for preparing for the Ardennes.”</p><p>Looking ahead to those Ardennes Classics, where he’ll race La Flèche Wallonne and Liège-Bastogne-Liège, Woods will be part of a promising one-two punch alongside Dan Martin, a former Liège winner and two-time Flèche Wallonne runner-up. The way Woods sees it, Liège-Bastogne-Liège is an ideal race for a tandem approach.</p><p>“When [Martin] won Liege, another Canadian played a big role in that – Ryder Hesjedal, he attacked late in the race,” Woods pointed out. “Having a multi-pronged attack, particularly in Liège, is very useful. I came second in Liege because QuickStep played that same card. They had [Bob] Jungels up the road and then a guy like [Julian] Alaphilippe could sit on. It’s only to my advantage having a guy like Dan there.”</p><p>Success in the Ardennes is one of Woods’s big goals for this season, alongside a strong run at the Tour, where he expects to target stages and build toward his biggest goal of all: the Olympics. The up-and-down course on tap for Tokyo should suit Woods’s skill set well.</p><p>“That’s kind of the big X on the calendar,” he said. “Everything else is going to be secondary to that. The Tour, the Classics, those are those secondary big goals. But it’s all in for the Olympics for me.</p><p>“I always like one-day races, it’s a lot of climbing miles, and it’s the Olympics. As a Canadian, as a guy coming from a track background, the Olympics are the kind of be-all, end-all, and I hold them in higher esteem than most cyclists, particularly because I’m a proud Canadian.”</p><p>There’s plenty of ground to cover before July, of course, and for now, Woods is looking forward to the green, punchy hills of the Basque Country and a chance to put his form to the test.</p><p>“You start thinking … I’m turning 35 this year, but I was telling my wife yesterday that I feel the strongest I’ve ever felt on the bike and I feel like I’m improving,” Woods said. “It’s really nice to be doing something at my age where I’m not just improving mentally and skills-wise but also strength-wise.”</p><div><h5>Tags</h5></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"00c4384c4b3f3be28eda6fbe047c90adb46eceee1200abec66e482c26e662f5d","category":"Cycling"}