{"title":"รีวิวซีพียู Core 11th Gen รุ่นหลุดมาขายก่อน แรงขึ้นเล็กน้อย แต่ร้อนขึ้นมาก ยังแพ้ AMD","link":"https://www.blognone.com/node/121557","date":1615005334000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/intel-08-removebg-preview%20%281%29.png?itok=U63X9ojh\"></p><div itemprop=\"description\"><p>อินเทลมีกำหนดเปิดตัว <a href=\"https://www.blognone.com/node/120539\">ซีพียู Core 11th Gen ฝั่งเดสก์ท็อป \"Rocket Lake\" เริ่มวางขายวันที่ 30 มีนาคมนี้</a> แต่กลับมีสินค้าหลุดออกมาขายก่อนแล้ว และเว็บไซต์ AnandTech ได้สินค้าชุดแรกนี้มารีวิวก่อนกำหนด (ไม่ได้มาจากตัวอย่างที่อินเทลส่งให้)</p><p>ซีพียูรุ่นที่ได้มาคือ Core i7-11700K จำนวน 8 คอร์ 16 เธร็ด ถือเป็นรุ่นรองจาก <a href=\"https://www.blognone.com/node/121400\">Core i9-11900K ที่อินเทลนำเบนช์มาร์คมาโชว์ก่อนหน้านี้</a> (ซึ่งเป็น 8 คอร์ 16 เธร็ดเหมือนกัน น่าจะต่างกันแค่คล็อค) จีพียูเป็น Xe-LP และยังใช้การผลิตที่ 14 นาโนเมตร</p><p>ของใหม่จริงๆ ใน Core 11th Gen ฝั่งเดสก์ท็อปคือ สถาปัตยกรรมย่อย (microarchitecture) ที่อัพเกรดจาก Sunny Cove ในซีพียูโน้ตบุ๊ก (Gen 10 Ice Lake) มาเป็น Cypress Cove ที่ต่างจากเดิมเล็กน้อย แต่เป็นครั้งแรกที่ซีพียูฝั่งเดสก์ท็อปได้ใช้สถาปัตยกรรมใหม่นี้ ของใหม่อีกอย่างคือรองรับชุดคำสั่ง AVX-512 ที่เดิมมีเฉพาะใน Xeon หรือซีพียูเดสก์ท็อปกลุ่ม Core-X เท่านั้น</p><p><img src=\"https://www.blognone.com/sites/default/files/externals/6d7d043efbd059b362b5fc110e4f4aea.png\"></p><p>AnandTech ทดสอบ Core i7-11700K เทียบกับรุ่นพี่ที่ระดับเดียวกันคือ Core i7-10700K และคู่แข่งระดับเดียวกันคือ Ryzen 7 5800X (8 คอร์ 16 เธร็ดเท่ากัน)</p><p>สิ่งที่พบได้ชัดเจนคือ i7-11700K ร้อนกว่าเดิมมาก (ทั้งที่ใช้พลังงาน 125 วัตต์เท่ากัน) ปัจจัยสำคัญมาจาก AVX-512 นั่นเอง ส่วนในแง่ประสิทธิภาพ ในภาพรวมแล้ว i7-11700K แรงขึ้นจาก i7-10700K แต่ยังแพ้ Ryzen 7 5800X อยู่ในแทบทุกการทดสอบ</p><p>AnandTech บอกว่า Rocket Lake เป็นความพยายามดิ้นรนของอินเทล ที่ยังก้าวไป 10 นาโนเมตรได้ไม่สมบูรณ์ จึงต้องแก้ขัดด้วยการนำสถาปัตยกรรม Sunny Cove ที่ถูกสร้างขึ้นมาเพื่อ 10 นาโนเมตร backport กลับมาใช้กับ 14 นาโนเมตร (กลายเป็น Cypress Cove), ใส่จีพียูตัวใหม่ Xe และฟีเจอร์ใหม่อย่าง AVX-512 กับ PCIe 4.0 เข้ามา ผลคือประสิทธิภาพดีขึ้นกว่าเดิมจริง แต่ต้องแลกมาด้วยพลังงานและความร้อนที่เยอะกว่าเดิมมาก</p><p>ที่มา - <a href=\"https://www.anandtech.com/show/16535/intel-core-i7-11700k-review-blasting-off-with-rocket-lake\">AnandTech</a></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0193aa6073d8ee57aaca4add3210090e711852dc1841bb6f3c02d16bee089478","category":"Thai"}