{"title":"The best thing on the internet today is this lovely ode to trail dogs","link":"https://cyclingtips.com/2021/04/the-best-thing-on-the-internet-today-is-this-lovely-ode-to-trail-dogs/","date":1619489103000,"content":"<div><div><p>I truly don’t know what Shimano’s play is here. There is no hard-sell of disc brakes or groupsets, no gratuitous close-ups of expensive bike gadgets.</p><p>Instead, you just get nine wholesome minutes of dogs flying along trails. It’s not selling anything and yet, I want it all: all of the mountain bikes, all of the dogs.</p><p>There are big dogs and small dogs. A pair of little Jack Russells; a gorgeous Labradoodle thing. Their names are Levi, Lucy &amp; Syd, Driggs, Nash and Emmy. They are each, in their own unique way, Very Good Boys and Girls who love nothing more than going for a run in the forest with their humans.</p><figure><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Screen-Shot-2021-04-27-at-11.02.29-am-1340x697.jpg\"><figcaption>Levi always looks like he’s about to stack it hard, his legs akimbo, his tum grazing the earth. Boy howdy, look at him go!</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Screen-Shot-2021-04-27-at-11.06.20-am-1340x742.jpg\"><figcaption>Here’s Driggs with some incredible hang-time and lollopy curls.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Screen-Shot-2021-04-27-at-11.08.06-am-1340x700.jpg\"><figcaption>Nash has a jacket and a puddle to run through. Nash is Nash’s own spirit animal.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Screen-Shot-2021-04-27-at-11.10.13-am-1340x699.jpg\"><figcaption>Emmy! Look at Emmy about to clear those rocks! How good is Emmy!</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Screen-Shot-2021-04-27-at-11.29.55-am-1340x699.jpg\"><figcaption>Here is either Lucy or Syd, one of a pair of barrel-shaped Jack Russells that lack the spriteliness of a Driggs or a Levi, but are also Extremely Good Dogs whether at nap or at play.</figcaption></figure></li></ul></figure><p>The whole thing’s gorgeously filmed, interestingly soundtracked (ambient &gt; EDM &gt; repeat), and has a weirdly moving voiceover that meditates on ageing and the unbreakable bond between a dog and its master.</p><p>Will you cry at the end? I’m not ruling it out. Did I get choked up? Do I really need to answer that question?</p><p>Who knows what the point of all this is, because I can’t imagine it’s shifting too many shifters. Who cares. It’s just absolutely goddamn lovely. Watch it.</p></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"023e833e0732e1974db8681b1bd409fb50a1522c4eea6b0d58ebc081e312dc89","category":"Cycling"}