{"title":"Gravel riding: the best of both worlds","link":"https://www.cyclist.co.uk/sponsored/9204/gravel-riding-the-best-of-both-worlds","date":1612453314000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>While you can’t beat cycling on smooth tarmac for the thrill and speed of the ride, it can feel limiting if you’re looking for more of a challenge and want to get that little bit closer to some beautiful scenery. For those who love to explore as much as they love to ride, gravel cycling can open up a new realm of possibilities, getting you off the road, onto different types of terrain and out into nature.</p><p>Whether you try out some towpaths, country trails, bridleways or even some of the less-technical mountain bike routes, you can explore further afield and discover new places and experiences along the way. Your route doesn’t have to end just because the road does.</p><h3>The rise of gravel cycling</h3><p>A huge part of the appeal of gravel cycling is that you are freed from the limits dictated by roads. For city dwellers, in particular, mapping out a route close to home that gets you away from roads and into more natural surroundings can be very appealing – and even in big cities like London, there are plenty of easily accessible gravel experiences if you know where to look.</p><p>The nature of unpaved paths and trails means a more challenging ride over trickier terrain – your progress may not be as smooth or fast, but your bike handling skills will be put through their paces, delivering a sense of achievement every time you head off the beaten track. Not every gravel surface is created equal – some may be relatively smooth and compact, while others may have loose stones and shingle to contend with. You’ll learn to expect the unexpected, and instinctively navigate around the rocks and potholes that will inevitably feature in some of your gravel adventures.</p><p>Gravel routes can combine everything from sandy coastal paths and singletrack forest trails, to rocky climbs and steep, loose descents, all presenting different technical and physical challenges along the way. Plan your route well and you can get to grips with all sorts of terrain in one outing, combining sections that test your fitness with others that challenge your technical skills.</p><p>This surge in popularity for gravel cycling has been reflected in some of the sport’s biggest events, with a number of the most famous races in the world now including gravel segments. For the last few years, the Tour de France has featured off-road sections, with the unpaved Plateau des Glières a key stage in the 2020 race.</p><p>Perhaps the most famous gravel event is the Strade Bianche, which translates to 'white roads'. It’s an extremely technical and unique race that mixes road and off-road sections, getting its name from the white gravel paths that make up a significant and iconic part of the route.</p><div id=\"file-42996\"><p><img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/02/strade_bianche.jpg?itok=BRDE5GCj\" alt=\"\"></p></div><p>The Strade Bianche demonstrates exactly what makes gravel cycling so appealing – the challenge of the ride, and the combination of performance road cycling and beautiful, natural routes. The men’s Strade Bianche 2020 incorporated eleven sections of Tuscany’s white gravel roads, against a backdrop of postcard-perfect rolling hills and archetypal cypress trees.</p><p>The white roads make for an exciting and challenging experience for participants and spectators alike – with dust, loose rocks, and winding paths to contend with instead of the usual smooth, black tarmac of road racing. Due to the unique challenges presented by gravel riding and its rise in popularity in professional cycling, the UCI has introduced new rules governing gravel sections.</p><p>Race organisers must provide detailed descriptions of the sections and ensure they are safe in all weather conditions. It’s worth taking similar precautions when planning an off-road adventure – always consider the time of year and weather forecast, and whether your desired route might become too dangerous in very wet or cold conditions.</p><h3>Making the most of the experience</h3><p>Getting up to speed with gravel cycling isn’t just about planning your route and working on your technical skills over different terrains, it’s also vital to have the right equipment.</p><p>With gravel riding becoming part of mainstream road cycling, there’s a whole host of bikes designed specifically for the discipline. These drop-bar bikes have a lot in common with a road bike, but with wider tyres, greater tyre clearance, disc brakes and lower gearing, making them suitable for off-road terrain as well as smooth roads.</p><p>While getting the right bike can really elevate the experience, it’s not the only important factor. Everyone knows that poor saddle comfort can spoil any ride, but when your route traverses rough and undulating terrain, the right saddle can be the difference between ending your adventure with a smile or a grimace.</p><p>The Prologo AGX saddle line is designed specifically for gravel cycling, using two very practical sources of inspiration in its developmental process. The first leveraged the brand’s position as the official technical partner of the Strade Bianche 2020 (it will also be the official 2021 partner). The unique and extremely technical nature of this route requires a versatile saddle that can deliver both comfort and performance no matter what the terrain – Prologo’s aim was to design exactly that, a saddle which could support riders no matter what the route throws at them.</p><p>The second source of inspiration was the 'Explore the World' Project by Education First (one of the six pro tour teams sponsored by Prologo). Showcasing the beauty and versatility of gravel cycling, this project saw professional riders cycling iconic off-road trails around the world, and provided a great testing ground for the new Prologo AGX design.</p><p>The AGX line uses a number of innovative technologies across its range to ensure both comfort and performance. The T-shaped Scratch M5 AGX uses MSS (Multi-Sector System), which maps out different areas of interactive foam on the saddle, with each area working independently to support different riding positions.</p><p>The Active Base technology of both the Akero AGX and the Scratch M5 AGX is a hollowed shell which gives the benefits of a cutout, but with a cover to protect against water and mud, thus allowing for extended time on the bike without compromising speed or power. The V-shaped Dimension AGX has a special ergonomic design, eliminating pressure spikes and numbness by improving blood flow. The rails are made from a light-alloy steel which absorbs vibrations, making them both resistant and light.</p><p>The Prologo brand has winning credentials, too. The Scratch M5 AGX is the gravel version of the saddle used by Tadej Pogacar during his Tour De France victory. So, if you’re looking to get in the saddle on gravel routes, make sure you’re onto a winner.</p><p><a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5613291775&amp;iu=/359/impcount.co.uk\" target=\"_blank\" rel=\"nofollow\"><strong><em>Discover the full AGX saddle range</em></strong></a></p></div></div>","author":"LauraB","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"029fce952a4fa73fe4fec8f71929ef122fc98050f6073ddf6bc30dcc5c5abf8f","category":"Cycling"}