{"title":"T-Mobile will tell advertisers how you use the web starting next month","link":"https://arstechnica.com/?p=1748388","date":1615329308000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>T-Mobile data sales —</h4><h2 itemprop=\"headline\">T-Mobile will sell your web usage data to advertisers unless you opt out</h2><h2 itemprop=\"description\">Data sales begin April 26 unless you opt out; T-Mobile claims it'll be anonymous.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/09/getty-t-mobile-Deutsche-Telekom-800x532.jpg\" alt=\"The logo of Deutsche Telekom, owner of T-Mobile, seen over a booth at the Mobile World Congress expo hall.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/09/getty-t-mobile-Deutsche-Telekom.jpg\" data-height=\"681\" data-width=\"1024\">Enlarge</a> <span>/</span> The logo of Deutsche Telekom, owner of T-Mobile, seen at Mobile World Congress in February 2019 in Barcelona, Spain.</p><p>Getty Images | NurPhoto</p></figcaption></figure><p>T-Mobile next month will start a new program that gives customers' web browsing and device usage data to advertisers unless customers opt out of the data sharing.</p><p>\"[S]tarting April 26, 2021, T‑Mobile will begin a new program that uses some data we have about you, including information we learn from your web and device usage data (like the apps installed on your device) and interactions with our products and services for our own and 3rd party advertising, unless you tell us not to,\" T-Mobile said in a privacy notice. \"When we share this information with third parties, it is not tied to your name or information that directly identifies you.\"</p><p>For directions on how to opt out of the expanded data sharing, see the first section of the <a href=\"https://www.t-mobile.com/privacy-center/our-practices/privacy-policy\">T-Mobile privacy notice</a>.</p><p>T-Mobile, which completed its purchase of Sprint in <a href=\"https://arstechnica.com/information-technology/2020/04/t-mobile-completes-sprint-merger-john-legere-leaves-ceo-job-a-month-early/\">April 2020</a>, said that the new advertising \"program changes the way Sprint offered choices for sharing in the past, as this data was previously used only if you indicated that it was OK with you first.\"</p><p>It's not clear exactly how big a change this is for non-Sprint customers of T-Mobile. An <a href=\"https://web.archive.org/web/20210215224502if_/https://www.t-mobile.com/privacy-center/our-practices/privacy-policy\">August 2020 version</a> of the privacy policy said that T-Mobile collects \"websites and URLs visited\" but did not list smartphone customers' web browsing data in the list of information shared with third parties.&nbsp;However, that August 2020 version said that T-Mobile sold \"device identifiers and Internet and electronic network activity to facilitate certain advertising activities commonly deployed by online and technology companies.\" A similar disclosure was in T-Mobile's privacy policy <a href=\"https://web.archive.org/web/20200325080029/https://www.t-mobile.com/privacy-center/our-practices/privacy-policy\">before the Sprint acquisition</a> as well.</p><p>T-Mobile says in <a href=\"https://www.t-mobile.com/privacy-center/education-and-resources/advertising-analytics\">another webpage</a> describing its advertising and analytics program that it collects \"addresses of websites visited; types of websites visited, like sports sites, music sites, etc.; applications, content, and features used—including how much time you spent using them, and information from servers that host these apps, content, and features.\"</p><h2>Advertising IDs used instead of customer names</h2><p>In order to anonymize data before it's sold to third parties, T-Mobile said that it ties the information \"to your mobile advertising identifier or another unique identifier\" instead of the customer's name. But you'll have to take T-Mobile's word on just how anonymous the anonymized data actually is. \"[P]rivacy groups say those IDs can be linked back to people by comparing different data sets,\" The Wall Street Journal noted in an <a href=\"https://www.wsj.com/articles/t-mobile-to-step-up-ad-targeting-of-cellphone-customers-11615285803?mod=hp_lead_pos2\">article</a> on the T-Mobile changes today.</p><p>\"It's hard to say with a straight face, 'We're not going to share your name with it,'\" Electronic Frontier Foundation lawyer Aaron Mackey told the Journal. \"This type of data is very personal and revealing, and it's trivial to link that de-identified info back to you.\"</p><p>Before the merger with T-Mobile, \"Sprint had previously shared similar data only from customers who opted into its third-party ad program,\" the Journal wrote.&nbsp;\"We've heard many say they prefer more relevant ads so we're defaulting to this [opt-out] setting,\" a T-Mobile spokesperson told the Journal.</p><p>We asked T-Mobile several questions about the data-sharing changes and for details on how exactly it ensures that data can't be linked to individual customers, and we'll update this article if we get a response.</p><h2>AT&amp;T and Verizon data-sharing doesn't go as far</h2><p>The Journal article said that T-Mobile is being more aggressive in sharing individual customers' Internet usage data with advertisers than AT&amp;T and Verizon:</p><blockquote><p>AT&amp;T automatically enrolls wireless subscribers in a basic ad program that pools them into groups based on inferred interests, such as sports or buying a car. An enhanced version of the program shares more-detailed personal information with partners from customers who opt into it.</p><p>Verizon likewise pools subscriber data before sharing inferences about them with advertisers, with a more-detailed sharing program called Verizon Selects for users who enroll. Its separate Verizon Media division shares data gathered through its Yahoo and AOL brands.</p></blockquote><p>AT&amp;T says on <a href=\"https://about.att.com/csr/home/privacy/full_privacy_policy.html#choice\">this webpage</a> that \"We don't share information about your individual web browsing or TV viewing\" in its \"relevant advertising\" system, but offers an \"enhanced relevant advertising\" system that shares additional information only with customers' \"prior explicit consent.\"</p><p>Verizon says on a <a href=\"https://www.verizon.com/support/mobile-ads-faqs/\" rel=\"nofollow\">relevant mobile advertising FAQ</a> that \"Information Verizon Wireless has about web activity from your mobile device is not used in the program.\" The program does use \"mobile and online web browsing information\" collected by Verizon's Yahoo and AOL subsidiaries, but this apparently wouldn't cover browsing to non-Verizon websites. Customers can opt out of this targeted advertising program.</p><p>In 2016, <a href=\"https://arstechnica.com/information-technology/2016/03/verizons-supercookies-violated-net-neutrality-transparency-rule/\">Verizon agreed</a> to pay a $1.35 million fine and give users more control over \"supercookies\" that identify customers in order to deliver targeted ads. Verizon's previous use of the supercookies without properly notifying users violated an FCC rule that required Internet providers to disclose accurate information about network management practices to consumers.</p><h2>Carriers sold location data without consent</h2><p>T-Mobile and the other major carriers were previously <a href=\"https://arstechnica.com/tech-policy/2020/02/fcc-issues-wrist-slap-fines-to-carriers-that-sold-your-phone-location-data/\">caught</a> selling their customers' real-time location data to third-party data brokers without customer consent, violating a <a href=\"https://arstechnica.com/tech-policy/2020/01/ajit-pai-carrier-sales-of-phone-location-data-is-illegal-fcc-plans-punishment/\">law banning sales</a> of phone-location data. The Federal Communications Commission in February 2020 proposed a fine of $91 million for T-Mobile, the biggest for any of the major carriers, but T-Mobile said it would fight the penalty.</p><p>The Obama-era FCC tried to require home Internet and mobile broadband providers to get consumers' opt-in consent before using, sharing, or selling Web browsing and app usage histories, but a Republican-controlled Congress and then-President Trump <a href=\"https://arstechnica.com/tech-policy/2017/04/trumps-signature-makes-it-official-isp-privacy-rules-are-dead/\">killed the rule</a> in 2017 before it took effect.</p></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"048fe49d70a0039aa68856e756de893ac33306de665ab2dede2a65abeff3f0fd","category":"Tech"}