{"title":"Zuckerberg responds to Apple’s privacy policies: “We need to inflict pain”","link":"https://arstechnica.com/?p=1742352","date":1613412800000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Facebook —</h4><h2 itemprop=\"description\">Meeting between Zuckerberg, Cook \"resulted in a tense standoff.\"</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/12/GettyImages-944446086-800x550.jpg\" alt=\"Facebook co-founder, chairman, and CEO Mark Zuckerberg departs after testifying before a combined Senate Judiciary and Commerce Committee hearing in the Hart Senate Office Building on Capitol Hill, April 10, 2018, in Washington, DC. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/12/GettyImages-944446086.jpg\" data-height=\"2062\" data-width=\"3000\">Enlarge</a> <span>/</span> Facebook co-founder, chairman, and CEO Mark Zuckerberg departs after testifying before a combined Senate Judiciary and Commerce Committee hearing in the Hart Senate Office Building on Capitol Hill, April 10, 2018, in Washington, DC.</p><p>Win McNamee/Getty Images</p></figcaption></figure><p>Facebook CEO Mark Zuckerberg told employees close to him, \"we need to inflict pain\" on Apple for comments by Apple CEO Tim Cook that Zuckerberg described as \"extremely glib.\"</p><p>This and other insights into an ongoing rift between the two companies appeared in a report <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\">in The Wall Street Journal</a> this weekend. The article indicates that based on first-hand reports, Zuckerberg has taken Cook and Apple's public criticisms of Facebook's privacy policies, whether direct or indirect, as personal affronts.</p><p>For example, Cook publicly <a href=\"https://arstechnica.com/tech-policy/2018/03/tim-cook-says-apples-customers-are-not-its-products-unlike-facebook/\">responded</a> to Facebook's 2018 Cambridge Analytica scandal by saying such a scandal would never happen to Apple because Apple does not treat its customers like products. When asked what he would do in Zuckerberg's position, he said, \"I wouldn't be in this situation,\" calling Facebook's approach \"an invasion of privacy.\" This was one of the comments that has led Zuckerberg to see Apple as an opponent.</p><p>Before that, in 2017, Zuckerberg and Cook met to attempt to smooth an already souring relationship, the article says, but the meeting \"resulted in a tense standoff.\" Since then, the relationship has continued to sour.</p><p>The disputes reached new prominence last year, when Apple announced plans to require that iOS apps ask users for permission to track them with IDFA (ID For Advertisers) tags across apps and websites. The change in policy is already reflected in Apple's terms of service for app developers but will not be enforced until early spring, after the release of iOS 14.5.</p><p>Facebook, whose business model and competitive advantage rely on this kind of tracking, responded by telling investors to expect falling revenues—and by running full-page newspaper ads declaring that the change would hurt small businesses.</p><p>Further, Facebook has <a href=\"https://arstechnica.com/gadgets/2021/01/why-facebook-and-apple-are-going-to-war-over-privacy/\">explored</a> filing a lawsuit against Apple, alleging that the smartphone maker's policies are anticompetitive.</p><p>The Wall Street Journal story also notes that Facebook has directly aided <a href=\"https://arstechnica.com/series/epic-vs-apple-google/\">Epic Games' battle against Apple</a> over a separate but loosely related battle over Apple's grip on its App Store and that Facebook has been \"waging a campaign against Apple\" with government officials and antitrust regulators.</p><p>Apple has attempted to position itself as the Big Tech company on the side of privacy because its business model is not built on tracking like Facebook's or Google's.</p><p>But there are other dimensions at play, too. Both Cook and Zuckerberg have said they view augmented and mixed reality as \"the next computing platform,\" and Facebook and Apple are on a course toward competing more directly with their products in the future.</p><p>Facebook has agreed to follow Apple's rules requiring user opt-in for tracking in its iOS apps, but it has tested ways to pre-empt the Apple-required prompt in order to make the case to users to opt in.</p><p>Meanwhile, both companies are subject to wide-ranging lawsuits and investigations alleging anticompetitive behavior, albeit mostly for very different reasons.</p></div></div>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"04a079591f8daba064832173911bc3c4976075c4d66d1c639f6f8d880cdd702e","category":"Tech"}