{"title":"Qualcomm Opposes Nvidia's Acquisition of Arm as Deal Comes Under Increasing Scrutiny","link":"https://www.macrumors.com/2021/02/12/qualcomm-opposes-nvidia-acquisition-of-arm/","date":1613148199000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/12/qualcomm-opposes-nvidia-acquisition-of-arm/\"><p>U.S. chipmaker and <a href=\"https://www.macrumors.com/2020/10/21/iphone-12-qualcomm-x55-modem/\">Apple supplier</a> Qualcomm has told regulators around the world that it opposes Nvidia's $40 billion <a href=\"https://www.macrumors.com/2020/09/13/softbank-nearing-deal-to-sell-arm/\">proposed acquisition of Arm</a>, according to <em><a href=\"https://www.cnbc.com/2021/02/12/qualcomm-objects-to-nvidias-40-billion-arm-acquisition.html\">CNBC</a></em>.</p><p><img alt=\"arm logo blue bg\" width=\"1600\" height=\"900\" src=\"https://images.macrumors.com/t/vVPUQa1qDZ5Yhws_Lv1aXgQM-ys=/400x0/filters:quality(90)/article-new/2021/02/arm-logo-blue-bg.jpg?lossy\" data-src=\"https://images.macrumors.com/t/vVPUQa1qDZ5Yhws_Lv1aXgQM-ys=/400x0/filters:quality(90)/article-new/2021/02/arm-logo-blue-bg.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/vVPUQa1qDZ5Yhws_Lv1aXgQM-ys=/400x0/filters:quality(90)/article-new/2021/02/arm-logo-blue-bg.jpg?lossy 400w,https://images.macrumors.com/t/C_NwBbPOySjF7-xno7kEZNl38bE=/800x0/filters:quality(90)/article-new/2021/02/arm-logo-blue-bg.jpg?lossy 800w,https://images.macrumors.com/t/zy-BTFoXD1t4YsNbF8dVsz5V2mw=/1600x0/filters:quality(90)/article-new/2021/02/arm-logo-blue-bg.jpg 1600w,https://images.macrumors.com/t/XNZvE00DkUnF4xeuzXSIuTAQyd8=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/arm-logo-blue-bg.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/vVPUQa1qDZ5Yhws_Lv1aXgQM-ys=/400x0/filters:quality(90)/article-new/2021/02/arm-logo-blue-bg.jpg?lossy 400w,https://images.macrumors.com/t/C_NwBbPOySjF7-xno7kEZNl38bE=/800x0/filters:quality(90)/article-new/2021/02/arm-logo-blue-bg.jpg?lossy 800w,https://images.macrumors.com/t/zy-BTFoXD1t4YsNbF8dVsz5V2mw=/1600x0/filters:quality(90)/article-new/2021/02/arm-logo-blue-bg.jpg 1600w,https://images.macrumors.com/t/XNZvE00DkUnF4xeuzXSIuTAQyd8=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/arm-logo-blue-bg.jpg 2500w\"></p><p>Qualcomm has registered an objection to Nvidia's acquisition of Arm with the Federal Trade Commission (FTC), the European Commission, the UK Competition and Markets Authority, and China's State Administration for Market Regulation. Qualcomm believes that the acquisition risks Nvidia acting as a gatekeeper for Arm's technology, and could prevent other chipmakers from using it. Most importantly, Qualcomm is building a case to suggest that the only way Nvidia can make the acquisition profitable will be to gatekeep Arm's technology.</p><p>British chip architect Arm is currently owned by Japanese tech giant <a href=\"https://www.macrumors.com/2020/07/22/apple-not-interested-in-buying-arm/\">SoftBank</a> and licenses its chip designs to over 500 companies, including Apple. With Arm's architecture being used in 95 percent of the world's smartphones, there has been significant concern around Nvidia, which is a rival to Arm licensees such as AMD and Apple, acquiring the company.</p><p>Arm's architecture underpins all of Apple's custom silicon processors such as the A14 in the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> or the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> in the MacBook Pro, since Apple licenses the Arm instruction set. While Apple does not license entire core designs from Arm and still designs its own custom silicon, if the deal is permitted, Nvidia will become responsible for the vital instruction set behind Apple's own chips.</p><p>Nvidia says that the deal will create the world's \"premier computing company for the age of AI,\" and has pledged to keep the company headquartered in Cambridge, England.</p><p>The FTC has now reportedly moved into the \"second phase\" of its investigations, asking SoftBank, Nvidia, and Arm itself to provide more information about the acquisition. This phase is also expected to involve discussion with other companies with relevant information, such as Qualcomm. Since a number of large documents will now need to be produced, the investigation is expected to continue for several more months.</p><p>Qualcomm is said to believe that it will play a significant role in whether the deal is allowed to continue, having spoken to antitrust representatives and legal counsel. Nvidia told <em>CNBC</em> that it is confident regulators will see the benefits of the acquisition, yet five senior industry sources said that the deal has \"a very high chance of being blocked\" by regulators.</p><blockquote><p>At the end of the day, whether this deal is anti-competitive or not, is based on a very simple idea: Arm is an enabler of competition. It enables companies to go out and compete. Whether you are MediaTek, Amazon Web Services, Qualcomm, or NXP. Any company — regardless of your R&amp;D (research and development) budget — can take and license from Arm and build their own Arm-based CPU. That is a unique model.</p></blockquote><p>SoftBank <a href=\"https://www.macrumors.com/2020/07/22/apple-not-interested-in-buying-arm/\">reportedly approached Apple</a> to see if it was interested in the purchase of Arm last year, but Apple was believed to have rejected the opportunity in part due to these regulatory concerns.</p><p>In addition to Qualcomm, AI chip start-up company Graphcore has raised concerns with the UK's Competition and Markets Authority, saying that the deal is anti-competitive, while in China, Huawei is similarly calling for the deal to be blocked.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-health-app-data-crime-investigation/\">Apple Health App Data Helps Send a Man to Prison for His Wife's Death</a></h3><p>Tuesday February 9, 2021 1:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>A man who claimed to be innocent following the death of his wife was found to be guilty after police used evidence sourced from the Apple Health app on his iPhone to convict him. As outlined by The Birmingham News (via Cult of Mac), Kat West, Jeff West's wife, was found dead in January 2018 after suffering a blow to the head. Jeff West claimed that she was drunk and fell while he was asleep...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-releases-macos-big-sur-11-2-1/\">Apple Releases macOS Big Sur 11.2.1 With Fix for MacBook Pro Charging Issue [Updated]</a></h3><p>Tuesday February 9, 2021 10:13 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today released macOS Big Sur 11.2.1, the third update to the macOS Big Sur operating system that launched in November. macOS Big Sur‌ 11.2.1 comes a little over a week after the release of macOS 11.2. The new ‌‌‌macOS Big Sur‌‌ 11.2.1‌ update can be downloaded for free on all eligible Macs using the Software Update section of System Preferences. According to Apple's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/useful-mac-accessories-worth-checking-out/\">Useful Mac Accessories Worth Checking Out</a></h3><p>Wednesday February 10, 2021 1:21 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>If you recently picked up one of the new M1 Macs that Apple released in November, or received a new Mac for the holidays, you may be in search of useful accessories to go along with it. In our latest YouTube video, we rounded up some great Mac accessories that are worth checking out. Subscribe to the MacRumors YouTube channel for more videos. MacRumors videographer Dan has highlighted several ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/2016-2017-macbook-pro-battery-charging-issue/\">Apple Offering Free Battery Replacements for 2016-2017 MacBook Pros That Can't Charge Past 1%</a></h3><p>Tuesday February 9, 2021 4:45 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today released macOS Big Sur 11.2.1 to address an issue that may prevent the battery from charging in some 2016 and 2017 MacBook Pro models, and the company has since shared a new support document with more details. Apple says a \"very small number of customers\" with 2016 and 2017 models of the 13-inch and 15-inch MacBook Pro have experienced an issue with the battery not charging past...</p></div></div></div>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"04b5fa59a05e9b732a39b4fed03dc251147d9fa59d5189852214f8925609a24c","category":"Apple"}