{"title":"Zero-days under active exploit are keeping Windows users busy","link":"https://arstechnica.com/?p=1740984","date":1612907453000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>UPDATE TUESDAY —</h4><h2 itemprop=\"description\">Microsoft and Adobe issue patches to stop malicious attacks in the wild.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/zeroday-800x534.jpg\" alt=\"The word ZERO-DAY is hidden amidst a screen filled with ones and zeroes.\"><figcaption></figcaption></figure><p>It’s the second Tuesday of February, and that means Microsoft and other software makers are releasing dozens of updates to fix security vulnerabilities. Topping off this month’s list are two zero-days under active exploit and critical networking flaws that allow attackers to remotely execute malicious code or shut down computers.</p><p>The most important patch fixes a code-execution flaw in Adobe Reader, which despite its long-in-the-tooth status remains widely used for viewing and working with PDF documents. <a href=\"https://helpx.adobe.com/security/products/acrobat/apsb21-09.html\">CVE-2021-21017</a>, as the critical vulnerability is tracked, stems from a heap-based buffer overflow. After being tipped off by an anonymous source, Adobe warned that the flaw has been actively exploited in limited attacks that target Reader users running Windows.</p><p>Adobe didn’t provide additional details about the vulnerability or the in-the-wild attacks exploiting it. Typically, hackers use specially crafted documents sent by email or published online to trigger the vulnerability and execute code that installs malware on the device running the application. Adobe’s use of the word “limited” likely means that the hackers are narrowly focusing their attacks on a small number of high-value targets.</p><p>Microsoft, meanwhile, has issued a fix for a vulnerability in Windows 10 and Windows Server 2019 that’s also under active attack. The flaw, indexed as <a href=\"https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-1732\">CVE-2021-1732</a>, allows attackers to run their malicious code with elevated system rights.</p><h2>Chain of exploits?</h2><p>Hackers typically use these so-called elevation-of-privilege exploits alongside attack code that targets a separate vulnerability. The former will allow code execution while the latter ensures the code runs with privileges that are high enough to access sensitive parts of the operating system. Microsoft credited JinQuan, MaDongZe, TuXiaoYi, and LiHao of DBAPPSecurity Co. Ltd. with discovering and reporting the vulnerability.</p><p>The simultaneous patching of CVE-2021-21017 and CVE-2021-1732 and their nexus to Windows raise the distinct possibility that in-the-wild attacks are combining exploits for the two vulnerabilities. Neither Microsoft nor Adobe has provided details that confirm this speculation, however.</p><p>Microsoft on Tuesday published a <a href=\"https://msrc-blog.microsoft.com/2021/02/09/multiple-security-updates-affecting-tcp-ip/\">security bulletin</a> strongly urging users to patch three vulnerabilities in the Windows TCP/IP component, which is responsible for sending and receiving Internet traffic. <a href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-24074\">CVE-2021-24074</a> and <a href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-24094\">CVE-2021-24094</a> are both rated as critical and allow attackers to send maliciously manipulated network packets that execute code. Both flaws also allow hackers to launch denial-of-service attacks—as does a third TCP/IP vulnerability tracked as <a href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-24086\">CVE-2021-24086</a>.</p><p>The bulletin said that developing reliable code-execution exploits will be hard but that DoS attacks are much easier and hence likely to be exploited in the wild.</p><p>“The two RCE vulnerabilities are complex which make it difficult to create functional exploits, so they are not likely in the short term,” Tuesday’s bulletin said. “We believe attackers will be able to create DoS exploits much more quickly and expect all three issues might be exploited with a DoS attack shortly after release. Thus, we recommend customers move quickly to apply Windows security updates this month.”</p><p>The three vulnerabilities stem from a flaw in Microsoft’s implementation of TCP/IP and affect all supported versions of Windows versions. Non-Microsoft implementations aren’t affected. Microsoft said it identified the vulnerabilities internally.</p><h2>56 vulnerabilities</h2><p>In all, Microsoft patched 56 vulnerabilities across multiple products including Windows, Office, and SharePoint. Microsoft rated 11 of the vulnerabilities as critical. As usual, affected users should install patches as soon as practical. Those who can’t patch immediately should refer to workarounds listed in the advisories.</p><p>A word, too, about Adobe Reader. Adobe has devoted significant resources over the past few years to improving the security of the product. That said, Reader includes a bevy of advanced features that casual users rarely, if ever, need. These advanced features create the kind of attack surface that hackers love. The vast majority of computer users may want to consider a default reader that has fewer bells and whistles. Edge, Chrome, or Firefox are all suitable replacements.</p></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"054e5f93a641099928d56c0f0b098075d8a441220655b0b8874b769768c7e354","category":"Tech"}