{"title":"Dangerholm’s custom 7.13 kg Scott Addict Gravel is a work of art","link":"https://cyclingtips.com/2021/09/dangerholms-custom-7-13-kg-scott-addict-gravel-is-a-work-of-art/","date":1630677637000,"content":"<div><div><p><em>Gustav Gullholm, aka <a href=\"https://www.instagram.com/dangerholm/?hl=en\" target=\"_blank\">Dangerholm</a>, is known in the mountain bike world for building incredibly light bikes, scraping paint off brand new carbon frames with a bush knife, and some truly creative modifications. Now Gullholm has turned his attention to the gravel world with a customised Scott Addict Gravel. In the following article Gullholm talks through this new 7.13 kg (15.72 lbs) creation.  </em></p><hr><p>I may be a mountain biker at heart, but the gravel roads are where I have spent most of my time in recent years. It’s a good way to get your training hours in and for your mind to relax, while enjoying the scenery with little to no traffic to worry about. So after several ambitious mountain bike builds, aiming for record low weights or <a href=\"https://cyclingtips.com/2021/02/dangerholm-scott-hyper-spark/\" target=\"_blank\">new levels of integration</a>, it was finally time for a real gravel bike. It was a natural step and my first foray into the drop-bar world.</p><p>I must admit that, taking this step, I felt humbled by the task. I love bikes, period. But while I keep an eye on trends and know exactly what I want for myself from a mountain bike, I was now heading into road territory – a slightly different point of view, and a world with rich history and its own “rules”. So starting to plan for this build there was a lot to learn and to consider. Luckily for me, it feels a bit like gravel bikes are in a similar place to where mountain bikes were in the ’90s: tons of experimenting, different directions, and all-around excitement.</p><p>Thankfully the bikes of today, slightly experimental or not, are incredibly great riding machines compared to the bikes of old. And as it would turn out, the <a href=\"https://cyclingtips.com/2021/07/2022-scott-addict-gravel-goes-longer-and-lower-with-a-slick-new-shape/\" target=\"_blank\">Scott Addict Gravel</a> chassis would exceed all my expectations.</p><h2>Build ideas and goals</h2><p>With some truly lightweight builds behind me (how about a <a href=\"https://www.pinkbike.com/news/building-the-worlds-lightest-29ers.html\" target=\"_blank\">6.22 kg mountain bike</a>?), to no big surprise, it was tempting to go gram-hunting once again. It wouldn’t be a bad idea since Scott is well known for lightweight frames and the new Addict Gravel is no exception. Claimed weight is from 930 grams for the frame and 395 g for the fork, with weights varying depending on frame size and paint job as always. So component weights were searched for, websites scrolled, and spreadsheets made – could I maybe even get close to 6 kg?</p><p>But upon receiving the frame and getting to have a good look at it, I quickly realized that it deserved something different. With its modern aero tubing and great integration thanks to the Syncros cockpit that goes with it, the superlight low profile rims and skinny tires needed to reach low-6 kg wouldn’t be a perfect look. Besides, it felt more important to truly focus on making it into a fast and great-performing bike. My inner mountain biker also really liked the idea of tires with a healthy width of 45 mm.</p><p>So I decided to go for a very performance-focused spec list and to add a few grams of paint to make it look the part. With that said, there’s no shortage of lightweight details.</p><h2>Tuning, modification and the paint job</h2><p>The first step was to bring out the knife and sanding paper once again. Going for a mostly raw carbon look I did the majority of the paint removal work with the knife. While it comes down to personal preference, I can see better what I’m doing and it gives me better control compared to sanding.</p><p>There was a good amount of paint on the frameset, but what was revealed was an unusually good carbon finish. Essentially all carbon frames are sanded a bit when coming out of the mold at the factory, often going through a layer or two of carbon (quite safely though) in difficult-to-produce places such as tube joints and complex shapes. But take a closer look at this frame and you’ll find nice clean carbon sheets pretty much all around.</p><p>Personally, I really like when parts on a bike have the same or at least a similar surface finish. For example, it often looks better to have all matte carbon parts than a mix of matte and glossy. So there was no time to relax when the frame was finished. The crankset, seatpost, and saddle also had the clear coat removed to perfectly match the frame.</p><p>With the frameset raw I took the chance to do some small modifications to it as well. I knew that the bike would be very suitable for really long rides and adventures, so it would be nice to have some bags for it. And while it works very well to strap some onto the frame, why not make something even better?</p><p>So four rivets were added to the frame by a carbon specialist. Three at the bottom of the top tube and one on the down tube. Together with the upper bottle cage rivet on the down tube, these will be the fixing points for a triangular bolt-on frame bag. To go with that, two holes were added to the back of the seatpost in order to run a matching bag there. Or whatever else I might want to mount.</p><p>Raw carbon is a super-practical finish and very-nice looking, especially in the sunlight. But I wanted to add a little life and contrast to the bike so it was time for a bit of paint.</p><p>The color I fell for is called Zanzibar Brown and is actually found on Range Rovers and select Audi cars. It’s a deep metallic paint that shifts between brown, bronze, and gold. Just like the raw carbon fiber it truly comes alive when the sun hits it.</p><p>To kind of match both the raw and refined characteristics of the bike, I went for a front-end-heavy and aggressive-looking paint design. And to make the bike stand out even more I decided to paint the rims as well. Matching wheels can easily be way over the top, and maybe some will think so in this case as well, but I felt that the bike was so clean anyway that it would just add to the looks.</p><h2>Components and highlights</h2><h3>Frameset</h3><p>The <a href=\"https://cyclingtips.com/2021/07/2022-scott-addict-gravel-goes-longer-and-lower-with-a-slick-new-shape/\" target=\"_blank\">Scott Addict Gravel</a> is something of a fast and race-oriented gravel frame, but with features and geometry making it capable enough for more adventurous riding as well. It has clearance for up to 45 mm-wide tires, it’s both 1x and 2x compatible, it has two extra accessory mounts, and even dedicated fender mounts.</p><p>My build is based on the Tuned version, which is the top-of-the-line Addict Gravel model featuring the brand’s HMX carbon. Just like with most brands, there are different levels of carbon quality. The HMX level offers low weight and great stiffness, only topped by the HMX SL available on select road and mountain bikes which pushes the weight even lower.</p><h3>Cockpit</h3><p>To go with the frame is the newly developed Syncros Creston iC SL X handlebar. Sitting in the same house, the designers and engineers at Scott and Syncros developed the frameset and handlebar as one system. This way it perfectly hides all cables as they go through the handlebar unit, through the upper headset and into the frame.</p><p>Besides this and great looks, another benefit of a one-piece stem and handlebar unit is that it can offer a very good stiffness-to-weight ratio. And speaking of weight, in this case that is 335 g.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-30-1340x754.jpg\"><figcaption>Clean.</figcaption></figure><p>At the front is the matching Garmin mount, which is made by K-Edge for Syncros. In case you’d like to mount a light or a camera, there’s also a GoPro combo mount version available.</p><p>With comfort being super important on a gravel bike I didn’t want to go full weight-weenie with the handlebar tape. So I’m running the quite thick and very grippy Syncros Gravel Bar Tape.</p><h3><strong>S</strong>hifters and derailleur</h3><p>These days it feels like it’s all about electronic shifting, and while there are many benefits it doesn’t mean that mechanical shifting is dead yet. In some cases mechanical can be lighter, there’s something to be said about the way the slimmer derailleur looks, and maybe you simply don’t want more batteries to charge. Don’t get me wrong, I love electronic shifting and use it on several of my bikes, but there’s something about that mechanical feeling.</p><p>I knew I wanted to run a wide-range 12-speed cassette, but how to get that working with an 11-speed road shifter?</p><p>Apparently, I’m not the only one wanting to do this – a company called <a href=\"https://cyclingtips.com/2020/10/ratio-technology-sram-1x12-speed-upgrade-kit/\" target=\"_blank\">Ratio Technology makes conversion kits</a> for this very application. Essentially you replace the stock ratchet with 10 clicks (11-speed) that sits inside your shifter to one with 11 clicks (12-speed). Experiencing the COVID-19 bicycle component shortage I had to settle for a SRAM Force left side lever and SRAM Red right side shifter, but with both being stripped down to bare carbon it’s all good.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-23-1340x754.jpg\"><figcaption>SRAM 11-speed mechanical shifters were fitted with a Ratio 12-speed conversion.</figcaption></figure><p>Road and MTB derailleurs have different cable pull ratios, so a little work is also needed on the derailleur. Here you replace the cable fin, making a SRAM Eagle MTB derailleur compatible with road shifters. Depending on the frame’s cable port design you might also have to replace the cable wheel with a rear entry barrel adjuster like I’ve done here. Now you have a fully functional “mullet drivetrain” setup.</p><p>The rear derailleur did see plenty more work though. First I rebuilt most of it with Hopp Carbon Parts bits and pieces, saving weight while adding looks.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-26-1340x754.jpg\"><figcaption>The b-knuckle, parallelogram and even the pins holding it all together are made from carbon fiber.</figcaption></figure><p>Since I wanted to go all-in on making it a fast and well-performing bike, that meant looking into marginal gains too. In addition to those watts saved by the aero frameset I also wanted to optimize my drivetrain. So the rear derailleur got a <a href=\"https://cyclingtips.com/2019/05/ceramicspeed-ospw-review-oversized-pulley-wheel-system/\" target=\"_blank\">CeramicSpeed OSPW system</a>, which I stripped to a silver look to match the rest of the drivetrain components.</p><h3>Drivetrain</h3><p>Up front is a set of raw carbon SRAM Red crank arms in a 175 mm length. These are well proven to say the least, and they weigh in at a very impressive 335 g. The bottom bracket is a CeramicSpeed PF41 DUB to keep things spinning with minimal effort.</p><p>Once again I went with a Garbaruk chainring. The tall teeth profile seems to make it almost impossible to drop a chain. I don’t use a chain guide even on my downhill bike with these, and in five years of riding I’ve only dropped a chain on a single occasion. I’m not the engineer to tell you if this tooth profile has any negative effects on chain friction, but the benefit here on a gravel bike is that I can run a low derailleur cage spring tension for low friction without any worries.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-32-1340x754.jpg\"><figcaption>A light and reliable combo.</figcaption></figure><p>Starting out with a 46T ring, I sort of underestimated how fast this bike is. I might get myself one or two more chainrings in different sizing to alternate with.</p><p>The cassette is a lightweight 11-46T model from Rotor, and runs with a SRAM X01 Eagle chain.</p><p>Pushing the limits of minimalism you have the prototype 3D-printed titanium pedals from German brand Titanum. These have a 3D-printed pedal body featuring small leaf springs instead of traditional spring systems. What you see on my bike is a pre-production version and they’re still finalizing the design. But they will be available in both steel and titanium axle versions and the latter weighs an incredible 100 g for the pair – less than one-third of a set of XTR pedals. The quite slim cleats are also made from titanium and weigh 20 g each.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-31-1340x754.jpg\"><figcaption>3D-printed titanium pedals are one of the more weight-weenie items on this build.</figcaption></figure><h3>Wheels</h3><p>Having already decided on wide 45 mm tires and wanting high-profile rims to go with the aero design of the frame I began to search for rim options. In traditional Dangerholm fashion I didn’t want them to be very heavy either. I came across a rim called MGRX45 from German wheelbuilding shop and specialist Radsporttechnik Müller. This is their in-house brand and this particular model features 45 mm height, 25 mm inner width, and comes in at 405-410 g per rim. In other words it was a perfect match.</p><p>But to keep things honest I have to admit that the beautiful Zanzibar Brown paint added 18-20 g per rim. Totally worth it if you ask me.</p><p>At the center of the wheels you’ll find a set of Tune Prince and Princess hubs. These little works of art are the German brand’s top-of-the-line hubs, combining low weight with great looks. They’re available in all sorts of configurations and colors but I went for the clean-looking silver anodizing, ceramic bearings, and carbon end caps on the front hub. The spokes are Sapim CX-Ray in silver.</p><p>Thru-axles are one of my favorite places to save weight. The wheels are equipped with thru-axles from Italian component maker Carbon-Ti.</p><h3>Brakes</h3><p>Another set of prototype components on this build are the brand new road and gravel flat-mount brake calipers from <a href=\"https://www.trickstuff-shop.de/en_GB\" target=\"_blank\">Trickstuff</a>. These are obviously yet to be released and I honestly don’t have that many hard facts about them at the moment. But they will be called Strada and so far they have been very, very impressive.</p><p>The weight is a few grams heavier than SRAM Red calipers, but they sure look stiff and the big surface area should help a little with heat dissipation. The backing plates of the brake pads are made from titanium, and all in all the calipers sure look amazing.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-34-1340x754.jpg\"><figcaption>I’ve used Trickstuff brakes on all of my recent mountain bike builds.</figcaption></figure><p>The Addict Gravel can run 140 mm or 160 mm rear brake discs matched with 160 mm or 180 mm up front. Here we have the smaller option, using Trickstuff Dächle UL brake discs. UL stands for Ultra Light and they strike a good balance between low weight and stopping performance.</p><h3>Seating</h3><p>To go with the aero-shaped seat tube of the frame there is the Syncros Duncan SL Aero seatpost. It’s lightweight at 155 g and features a very easy to use clamping mechanism – some clever engineering and design there.</p><p>On top is a Schmolke Carbon SL79 saddle weighing 79 g, as the name suggests. It features the kind of “old school” shape with an upwards rear end which suits me perfectly and it also offers good shell flex for comfort. It’s easy to think all full carbon saddles are uncomfortable, but with the right shape and some flex they can be really comfortable.</p><h2>Summary</h2><p>With this being my first proper gravel bike I won’t go in-depth with ride impressions since I don’t have that much to compare it to. But what I can tell you is that it’s one fast and fun bike to ride. I’ve been positively surprised in so many ways and it definitely will be my go-to bike for a ton of riding.</p><p>Next up is getting the custom frame bags sorted for it, and maybe painting a set of fenders to match when autumn arrives. Feel free to keep up with that and all my other builds via my <a href=\"https://www.instagram.com/dangerholm/?hl=en\" target=\"_blank\">Instagram</a>. Sooner or later there is bound to be a road bike project coming …</p><h2>Spec</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Spec-list.jpeg\"></figure><hr><div><p><em>Based in Sweden, Gustav Gullholm has a history of modyfing bikes and sharing his projects online.</em></p><p><em>Gullholm recently became an ambassador for Scott Bikes. CyclingTips is sharing this content because it’s brilliant and we thank Gustav Gullholm for it. CyclingTips has not benefitted commercially by publishing this content.</em></p></div><h2>Gallery</h2><figure><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-21-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-18-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-29-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-36.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-47-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-45-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-43.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-41.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-40.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-38.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-37.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-20-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-4.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-35.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-33-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-28-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-27-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-25-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-19-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-16-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-15.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-13.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-12.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-11.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-10.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-9.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-8.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-7.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-46-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Scott-Addict-Gravel-Dangerholm-Custom-Dream-Build-22-1340x754.jpg\"></figure></li></ul></figure></div></div>","author":"Gustav Gullholm","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0703855bea7c56cef240a6bf6647bba575243956cfa39a946808d21a5152d0da","category":"Cycling"}