{"title":"Texas woman sues Griddy after being charged $9,546 for 19 days of power","link":"https://arstechnica.com/?p=1745532","date":1614361768000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Class action seeks $1 billion —</h4><h2 itemprop=\"description\">Griddy blames state agency as variable-rate plans produce outrageous power bills.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/getty-texas-power-800x531.jpg\" alt=\"US and Texas flags seen next to power lines and transmission towers.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/getty-texas-power.jpg\" data-height=\"1684\" data-width=\"2538\">Enlarge</a> <span>/</span> The US and Texas flags fly in front of high-voltage transmission towers on February 21, 2021 in Houston, Texas.</p><p>Getty Images | Justin Sullivan</p></figcaption></figure><p>A Texas woman who was charged $9,546 for power this month has filed a class-action lawsuit against Griddy, alleging that the variable-rate electricity provider violated a state law against price gouging during disasters.</p><p>Lisa Khoury, a retiree in Mont Belvieu, signed up with Griddy in June 2019 and typically received monthly bills of $200 to $250 until this month's <a href=\"https://arstechnica.com/science/2021/02/even-power-disasters-are-bigger-in-texas-heres-why/\">power disaster</a>&nbsp;sent rates soaring. Griddy charged Khoury and her husband $9,546 from February 1 to 19, 2021, the lawsuit said, noting that \"some customers received bills as high as $17,000.\"</p><p>Khoury's <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/griddy-lawsuit.pdf\">lawsuit,</a> filed Monday in Harris County District Court, seeks certification of a class of thousands of Texas residents who bought power from Griddy, claiming they're entitled to damages of over $1 billion.</p><p>\"Griddy's charging of excessive prices for electricity with their variable-rate plan is unconscionable,\" the lawsuit said. \"An unconscionable act [as defined by Texas law] 'takes advantage of the lack of knowledge, ability, experience, or capacity of the consumer to a grossly unfair degree.' Khoury and Class Members are unsophisticated consumers. They chose Griddy, a wholesale electricity provider, to pay less. Variable-rate plans, however, are a gamble and unpredictable. Consumers rarely understand the risks. Griddy took advantage of this lack of knowledge to a grossly unfair degree when selling these plans.\"</p><p>The lawsuit further says that Griddy should have \"had a system in place to prevent its customers from being charged excessive prices and taken aggressive steps to prevent it.\" The lawsuit alleged that Griddy violated the <a href=\"https://statutes.capitol.texas.gov/SOTWDocs/BC/htm/BC.17.htm\">Texas Deceptive Trade Practices Act</a>, which outlaws \"taking advantage of a disaster\" by charging excessive prices for necessities, and that it is guilty of negligence and unjust enrichment.</p><h2>Griddy: It’s not our fault</h2><p>In a <a href=\"https://www.dallasnews.com/business/energy/2021/02/23/texas-electricity-supplier-griddy-hit-with-1-billion-class-action-lawsuit-for-price-gouging-after-outages/\">statement</a> to The Dallas Morning News, Griddy said it is not at fault because \"Griddy passes through the wholesale electricity price to customers without mark-up. The prices charged are the direct result of the non-market prices ordered by the PUCT [Public Utility Commission of Texas] last week. The lawsuit is meritless and we plan to vigorously defend it.\"</p><p>Griddy further defended its pricing in a <a href=\"https://www.griddy.com/post/griddy-update-why-energy-prices-were-sky-high-this-week\">statement on its website on February 18</a>. Griddy said that PUCT \"cited its '<a href=\"http://www.puc.texas.gov/51617WinterERCOTOrder.pdf\">complete authority over ERCOT (Electric Reliability Council of Texas)</a>' to direct that ERCOT set pricing at $9/kWh until the grid could manage the outage situation after being ravaged by the freezing winter storm.\"</p><p>The statement continued:</p><blockquote><p>Under ERCOT's market rules, such a pricing scenario is only enforced when available generation is about to run out (they usually leave a cushion of around 1,000 MW). This is the energy market that Griddy was designed for—one that allows consumers the ability to plan their usage based on the highs and lows of wholesale energy and shift their usage to the cheapest time periods.</p><p>However, the PUCT changed the rules on Monday.</p><p>As of today (Thursday, February 18), 99 percent of homes have their power restored and available generation was well above the 1,000 MW cushion. Yet, the PUCT left the directive in place and continued to force prices to $9/kWh, approximately 300x higher than the normal wholesale price. For a home that uses 2,000 kWh per month, prices at $9/kWh work out to over $640 per day in energy charges. By comparison, that same household would typically pay $2 per day.</p></blockquote><p>A <a href=\"https://www.griddy.com/post/griddy-seeks-relief-from-ercot-for-customers-exposed-to-non-market-pricing\">subsequent statement</a> from Griddy said the company is \"engaging with ERCOT and the PUCT seeking customer relief... and is committed to crediting customers for any relief received, dollar-for-dollar.\"&nbsp;Customers who contact Griddy are getting an auto-reply email that says, \"We will fight for, and alongside, our customers for accountability into why prices were allowed to remain so high for so long.\" Griddy is also directing customers toward an <a href=\"https://www.griddy.com/dpp\">application</a> for its deferred payment plan.</p><p>We asked Griddy if it has any further response to the lawsuit and will update this article if we get an answer.</p><h2>Griddy withdrew $1,200 from bank account</h2><p>Khoury's lawsuit noted that Griddy customers pay a $10 monthly fee plus \"the cost of spot power trades on Texas's power grid based on the time of day they use power.\" Khoury generally kept a $150 balance in her Griddy account to pay bills. After the storm hit, \"Griddy automatically withdrew from Khoury's bank account each time her electricity bill hit the recharge amount of $150. From February 13 to 18, 2021, Griddy withdrew eight times from Khoury's bank account, $150 each time. By Friday, February 19, 2021, Griddy withdrew a total of $1,200 from Khoury's bank account.\"</p><p>Khoury placed a stop payment on her bank account to prevent further withdrawals but \"still owed Griddy an additional $8,235,\" the lawsuit said.</p><p>\"Griddy charged Khoury in the middle of a disaster,\" the complaint said. \"She and her husband mostly were without power in their home from Wednesday, February 17, 2021 to Thursday, February 18, 2021. At the same time, Khoury hosted her parents and in-laws, who are in their 80s, during the storm. Even then, she continued to minimize any power usage because of the high prices.\"</p><p>The lawsuit said that Griddy can be \"held accountable and liable for price gouging\" during a disaster under the Texas Deceptive Trade Practices Act, even though \"Griddy attempted to justify the price increases as being a result of the wholesale power market and places the burden on customers to track market prices.\"</p><p>Griddy failed to take steps that could have prevented the large bills, the lawsuit said: \"Griddy had the ability, capacity, and contractual right to prevent charging customers excessive prices during the disaster. Griddy controlled its services and platform and oversaw pricing and contracting.\"</p><p>Griddy emailed 29,000 customers on February 14, suggesting they switch to a different power company with a fixed rate, the lawsuit said. However, the lawsuit said, \"Customers could not switch providers because other providers were not accepting new customers due to the storm. Khoury attempted to change providers on Tuesday, February 16, 2021 and was initially told service could only start in a week. Persistent under pressure, Khoury was able to change providers on Friday, February 19, 2021.\"</p><h2>Lt. Gov: “Read the fine print”</h2><p>Khoury's lawsuit quoted government officials who spoke out against the high power bills, including Sen. Ted Cruz (R-Texas), who <a href=\"https://twitter.com/tedcruz/status/1363529410268319747\">said</a>, \"No power company should get a windfall because of a natural disaster, and Texans shouldn't get hammered by ridiculous rate increases for last week's energy debacle.\"</p><p>Texas Lt. Gov. Dan Patrick <a href=\"https://www.youtube.com/watch?v=UONyL2QmYYU\">told Fox News</a> that \"people who are getting those big bills are people who gambled on a very, very low rate, and it would go up with the power [costs].\"</p><p>Patrick said the government will take some kind of action, potentially including ending variable-rate plans. \"Going forward, people need to read the fine print in those kinds of bills, and we may even end that type of variable plan because people were surprised,\" he said.</p></div></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"070d6d05d24f6ae779f9dfafd76325e6917e6dce149176ae213ca14e940ff97e","category":"Tech"}