{"title":"Segments Series: Fabien Palcau","link":"https://blog.strava.com/fabienpalcau-21458/","date":1609362369000,"content":"<div id=\"readability-page-1\" class=\"page\"><article><div><p>As we still miss bibs and start lines at the start of this year, Strava and <a href=\"https://www.strava.com/clubs/distance-store\">Distance</a> are launching the <a href=\"https://www.strava.com/segments-series\" target=\"_blank\" rel=\"noopener noreferrer\">Segments Series</a>, an invitation for the runners from all across France to strive for their best time on 12 segments throughout the country, until Feb 7th. To fuel your first stride, don’t miss our series of interviews that shines a spotlight on some of the most promising of the next generation of French athletes. We spent a day with them to get an idea of the effort and the sacrifices they make daily; to understand their motivations; their state of mind after an unprecedented year; and the dreams they want to make reality. These athletes took us to their favourite training grounds and showed us a segment that suits their strengths, their specialism, or their character – so you can measure yourself against the future of French athletics.</p><p>Come with us for <a href=\"https://www.strava.com/pros/17849304\" target=\"_blank\" rel=\"noopener noreferrer\">Fabien Palcau</a>’s ‘life segment’, as told by the Distance team, with photos by Anne Sophie Soudoplatoff.</p><p><a href=\"https://www.strava.com/pros/17849304\" target=\"_blank\" rel=\"noopener noreferrer\">FABIEN PALCAU</a><br>23 years old<br>Favourite segment: <a href=\"https://www.strava.com/segments/10523007?filter=overall\" target=\"_blank\" rel=\"noopener noreferrer\">Bois du Roy – Aller</a><br>Runner up in the French national championships in the 10,000 metres and 5,000 metres<br>Dijon, France</p><p><span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;Hi Fabien. How are you and where are you at in this strange season?&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:31104,&quot;10&quot;:0,&quot;11&quot;:4,&quot;14&quot;:[null,2,16711680],&quot;15&quot;:&quot;Arial&quot;,&quot;16&quot;:11,&quot;17&quot;:1}\"><strong>Hi Fabien. How are you and where are you at in this strange season?</strong><br>Hi! Things are good with me. As far as training goes, the lockdown period went very well. I spent it in an ideal setting, by some fields with a forest less than a kilometre away, so my isolation passed very well, I did a lot of training. I was able to use it to go further in my preparation.<br></span></p><p><strong>So we hear you had a rather satisfying result on the track over 10,000 metres?</strong><br>Ah yes! I ran a <a href=\"https://www.strava.com/activities/4070281432\" target=\"_blank\" rel=\"noopener noreferrer\">28’07”</a> [editor’s note: he came runner up in the 2020 national championships], so all the work I’ve put in over the past years, and in this period of six months without much in the way of competitive running, paid off. That’s the most important thing.</p><p><strong>What was your previous record?</strong><br>29’37”, on the road, so I beat it by 1’30”! [big smile]</p><p><strong>How did you begin in athletics?</strong><br>You could say that I fell into it when I was little. My parents competed in orienteering, so I started with that, racing in the woods from the age of three or four. I’ve always run. My mother raced with Dijon University Club, my lifelong club that I still race for. As soon as I could, I got my licence, went along and I was hooked straight away.</p><p><strong>So you chose athletics over competitive orienteering?</strong><br>I really just wanted to run. I found competitive orienteering a little frustrating as I couldn’t get the best out of myself running a race in which you had to choose where to go, and stop and read the map. I ‘only’ wanted to run, so I drifted towards athletics very early one, even if I also did other sports.</p><p><strong>Which other sports?</strong><br>I did five years of swimming, learned how to swim, but I wasn’t very good. Since I like competing –&nbsp;being in the mix for titles, winning – when I saw that I was so far behind I wasn’t happy.</p><p><strong>What are your best qualities and your weaknesses? How did you choose your events?</strong><br>I think my strengths are mental. Maybe at a certain period that was my weak point, but today it’s become a strength. I’m comfortable with long efforts, that was obvious right from my first 10K, when I put in a good performance. My other strength is in the finishing. My weaknesses: pure speed and lactic tolerance. My events now are the 5,000 and 10,000 metres, and cross country – that’s what I was naturally best at to begin with. In cross country, I immediately got good results: my first selection for the national team and my first national title were in cross country. It happened naturally. I ran the 1,500 metres a bit, but I’d say it doesn’t play to my natural strengths, I’d get beaten in the finishing straight. I didn’t have the finish of a natural 1,500 metre runner.</p><p><strong>When did you realise that you had the potential, that you really stood out?</strong><br>I’d say it was in primary school, in PE classes. We were running round and I’d lap all the others even though I wasn’t training at all. My classmates asked me how it was possible to run so fast, and I didn’t know what to say! That’s when I realised I might be able to do something. It’s also when I knew I wanted to run at a very high level when I was older.</p><p><strong>So that’s when you started athletics school?</strong><br>Yes, there were a few empty years in junior high when I wasn’t as interested, but I always had the idea I’d take it back up again and train seriously in high school. I already knew I’d be a runner later on. Some people wanted to be firemen, policemen, or whatever, but I wanted to be a runner.</p><p><strong>Who are the most important people around you these days?</strong><br>My family. My parents, who have supported me since the start, who’ve always supported me and always will. Family in the wider sense – my grandparents too. <a href=\"https://www.strava.com/athletes/25702922\" target=\"_blank\" rel=\"noopener noreferrer\">Rémy Geoffroy</a>, my coach: without him I wouldn’t be here today, so I’m very grateful to him. All the staff I have around me, the medical guys including my physio, osteopath, physical conditioner. My club, which has always been there for me. We’re a development club, so I’m thinking of all the coaches who trained us in the lower categories, who congratulated and encouraged use even when things weren’t going well. That’s really an amazing thing, it’s also thanks to them I’m here now. Then there’s the guys I train with, particularly <a href=\"https://www.strava.com/pros/10816005\" target=\"_blank\" rel=\"noopener noreferrer\">Alexis</a> [Miellet, current French 1,500m champion] and the other runners – my group has done a lot for me.</p><p><strong>What values must an athlete have to flourish?</strong><br>Good question! I think you really have to work on what you need to succeed, to live up to your own ambitions and reach the goals you set. You’ve got to do everything you can to make things work, and not simply be upset if you don’t get there first time. You have to set intermediate goals, and be patient. You need patience and perseverance, even after setbacks: when you’re upset and disappointed you have to have a long-term vision. I work on long timelines, not on a ‘one-shot’ approach: I look a long way forward, I think that’s the way to thrive, despite those days when you race badly. Not getting what you want, that happens to everyone. You have to hold your line, get there one step at a time.</p><p><strong>What has your sport taught you and how has that helped you grow?</strong><br>The values I just outlined, and patience in particular. Not being patient was my biggest problem – and not being patient with myself above all. When you’re young you see others blow up, others stagnate, and you’ve got to remain focused on your own progression. Perseverance, too: believe in your training, the things you’re putting in place, tell yourself that it’s got to work. Sport – athletics – has formed my character and the guy I am.</p><p><strong>In what ways is your environment ideal for your training?</strong><br>[Fabien turns away and looks around] See for yourself – I’m 10 minutes from the stadium, from the track and the weights room, but I don’t live in town. I’m next to some fields, so there are kilometres and kilometres of trails, whether in the woods and meadows or on the road: I have all types of terrain and ground. To limit injuries I run in the forest. If I want to do sessions or runs that are a bit quicker I’ll hit the road, everything is available, it’s all close. I’ve got a sauna and a little room for physical conditioning at home, so lockdown didn’t pose a problem. At the stadium there are several weights rooms, a hall, two tracks – 150 metres and 400 metres – with cross training around them, really everything! Frankly it would be difficult to find better.</p><p><strong>How far would you like to go with these tools? Which races do you dream about? What would you like to have on your palmarès?</strong><br>The Olympics have always been my goal, and with my 10,000-metre performance at the nationals I now know that everything is possible. Before, I believed I could do it, but it wasn’t the same. Now it’s really here. As for titles, it has to be the Olympics, even if that’s very difficult – I mustn’t be content simply with being at the Games, I have to go there for a title or a medal. In a race, anything is possible. But progress has to be step by step, so inevitably some European and world titles too.</p><p><strong>In the 5,000 or the 10,000 metres?</strong><br>5,000, 10,000 and then the marathon, that’s inevitable, it’s only a matter of time. And why not a bit of trail running later on? But for now I’ll stick to the Olympic events and have some fun afterwards! I have enough goals and challenges for the next 10-15 years already!</p><p><strong>What’s your favourite session, and your favourite place to train?</strong><br>I really like anything at medium pace, tempo, threshold, long, active sessions. I also like interval sessions for 5,000 and 10,000 metres – when they go quickly, that’s when you have the best sensations. I love training on the track, in the Colette Besson Stadium right next to my house. I also like training in the mornings just behind where I live, on my little <a href=\"https://www.strava.com/segments/10523007\" target=\"_blank\" rel=\"noopener noreferrer\">Strava segment</a>. The other place I love is Font Romeu [the French national altitude centre in the Pyrenees], I think I’ll be spending more and more time there. You’re up in the mountains, disconnected from everything, focused, I love the atmosphere there.</p><p><strong>Tell us a bit about <a href=\"https://www.strava.com/segments/10523007\" target=\"_blank\" rel=\"noopener noreferrer\">your segment</a> then – what is unique about it and why does it represent you well?<br></strong>It’s very simple, I must have done thousands of times since I started running. It’s just under a kilometre from my house, and runs for a kilometre, so even when I was running for 20-30 minutes when I was little I would run it on, when I started going out, and since that time I do it several times a week. Really, thousands of times!</p><p><img src=\"https://1n4rcn88bk4ziht713dla5ub-wpengine.netdna-ssl.com/wp-content/uploads/2020/12/Segment_FabienPalcau-736x640.png\" alt=\"\" width=\"736\" height=\"640\" srcset=\"https://1n4rcn88bk4ziht713dla5ub-wpengine.netdna-ssl.com/wp-content/uploads/2020/12/Segment_FabienPalcau-736x640.png 736w, https://1n4rcn88bk4ziht713dla5ub-wpengine.netdna-ssl.com/wp-content/uploads/2020/12/Segment_FabienPalcau-615x534.png 615w, https://1n4rcn88bk4ziht713dla5ub-wpengine.netdna-ssl.com/wp-content/uploads/2020/12/Segment_FabienPalcau.png 748w\" sizes=\"(max-width: 736px) 100vw, 736px\"></p><p><strong>Strava recently launched the ‘Local Legend’ achievement: where do people see you running most? Do you feel you’re already the most recognised runner in town?</strong><br>Yes and no! You can see me in the mornings on the loop that includes my segment. I leave the house and run that way, it’s the way I go most often. I see some people almost every morning who must be starting to think ‘That guy runs a lot!’, but apart from that I’m not always recognised in the neighbourhood. Some of my neighbours ask for news about my results, and others not at all. Just the other day I was out on a run with my mum, who was following me on a bike, a neighbour wished me a good session. I said I was out for a run, and he asking me jokingly if I was preparing for the Olympics. Yes indeed, I said – 2024! He was surprised! There are some who are up to speed and some who don’t know what I’m doing at all, the contrast is quite funny.</p><p><strong>At your level, you obviously must take a lot of segment Course Records when training. Is this something you pay attention to, and do you ever go CR hunting?</strong><br>It’s always nice to be the fastest on a segment but I don’t give it too much thought, because the things I’m focused on are the real, official competitions – championships and track meets. I see Strava more as a way of uniting around a common passion, and sharing with the running community. I’m not in competition mode on Strava, but I can also understand that it helps people surpass their limits!</p><p><strong>Do you have any advice to help people beat your best time on your segment? Do you know anyone who could take it from you?</strong><br>Yes, <a href=\"https://www.strava.com/pros/10816005\" target=\"_blank\" rel=\"noopener noreferrer\">Alexis</a> [Miellet] could! It’s not a very technical segment, quite flat but, at a kilometre, a bit long: you can’t go off like on a 200 metres, you have to manage your effort! The ground is very soft and pleasant to run on, there’s just a little root at the beginning where you have to take care; at the end you finish on singletrack, so you have to be careful not to meet any cyclists. It’s best to go there early or late in the day.</p><p><strong>Do you have an suggestions for clubs or athletes to follow on Strava?</strong><br>I’d start by saying <a href=\"https://www.strava.com/clubs/temporunclub\" target=\"_blank\" rel=\"noopener noreferrer\">Tempo Run Club</a>. As for athletes I’d say <a href=\"https://www.strava.com/pros/34895835\" target=\"_blank\" rel=\"noopener noreferrer\">Jimmy [Gressier]</a> who recently joined Strava. <a href=\"https://www.strava.com/pros/34895835\" target=\"_blank\" rel=\"noopener noreferrer\">Alexis Miellet</a>, <a href=\"https://www.strava.com/athletes/11688123\" target=\"_blank\" rel=\"noopener noreferrer\">Quentin Malriq</a>… the Gras brother (<a href=\"https://www.strava.com/athletes/33940887\" target=\"_blank\" rel=\"noopener noreferrer\">Michael</a> &amp; <a href=\"https://www.strava.com/athletes/19512379\" target=\"_blank\" rel=\"noopener noreferrer\">Damien</a>) share a lot of stuff too. There’s lots to see!</p><p><strong>Follow <a href=\"https://www.strava.com/pros/17849304\" target=\"_blank\" rel=\"noopener noreferrer\">Fabien</a> on Strava.</strong><br><strong>Discover the <a href=\"https://www.strava.com/segments-series\" target=\"_blank\" rel=\"noopener noreferrer\">Segments Series</a>.</strong></p></div></article></div>","author":"Lionel Fracture","siteTitle":"Strava","siteHash":"1aad548e4b317c88a2037e855444a0a9609f710eecec184d87146b59efcbecdb","entryHash":"072b264291c09febeaf8e33ccd7ea68304b10076e316bc7ff53d540b1ed52cc0","category":"Cycling"}