{"title":"Wout van Aert is selling his three biggest victories as NFTs","link":"https://cyclingtips.com/2021/11/wout-van-aert-is-selling-his-three-biggest-victories-as-nfts/","date":1636932000000,"content":"<div><div><p>Wout van Aert has had a remarkable couple of years, winning Monuments, mountain stages at the Tour, classics, and cyclocross races. Now, to commemorate his long, hot streak, he’s selling what he reckons are his three biggest victories – as non-fungible tokens (NFTs).</p><p>Non-fungible tokens, you ask? Let me try to explain.</p><p>An NFT is a unique piece of data that’s linked to a digital ledger called a blockchain, which records who possesses the NFT. An NFT is not the asset itself, but more like a digital certificate showing ownership of the asset. Which in this case is an animated cartoon of beloved Belgian bicyclist Wout van Aert winning a bike race.</p><p>In a promotional tweet, a visibly ecstatic Van Aert claims to be “excited” to share the announcement of the NFTs, which will “immortalise … three of his career highlights”.</p><p>Big hostage video vibes below:</p><blockquote><p>Something special! My three biggest victories will be sold as NFT’s. Check all details on <a href=\"https://t.co/DCDNv4WoF5\">https://t.co/DCDNv4WoF5</a> <a href=\"https://t.co/uclYXEWCkw\">pic.twitter.com/uclYXEWCkw</a></p>— Wout van Aert (@WoutvanAert) <a href=\"https://twitter.com/WoutvanAert/status/1459089490308440074?ref_src=twsrc%5Etfw\">November 12, 2021</a></blockquote><p>Those highlights are the 2020 edition of Strade Bianche (it was hot and dusty, <a href=\"https://cyclingtips.com/2020/08/strade-bianche-photo-gallery-clouds-of-dust-under-the-tuscan-sun/\">maybe you remember it</a>), the double-Mont Ventoux stage of this year’s Tour de France, and his Tour-capping sprint win on the Champs Élysées. For each, there is a gently pivoting video with a representation of Van Aert saluting his victory.</p><p>All three are currently being auctioned at Opensea.io, with a little less than two days remaining. Bids are steadily ticking upwards, with the Mont Ventoux NFT clearly resonating the most with the digital art collectors of the cycling world. At time of writing, somebody was prepared to pay 0.4 WETH (US$1,837.02) for this:</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Screen-Shot-2021-11-15-at-12.21.12-pm.png\"></figure><p>Now, at risk of editorialising, it all strikes me personally as a little bit silly and <a href=\"https://www.theverge.com/2021/3/15/22328203/nft-cryptoart-ethereum-blockchain-climate-change\">terrible for the environment</a> and the artwork isn’t even very good and we live in a world full of evil so what are we even doing here.</p><p>But if you’re sitting on a nest egg of cryptocurrency and want to be able to say you own the rights to a digital rendering of a cyclist winning a race that literally anyone can access and save to their computer, <a href=\"https://www.momentible.io/wout-van-aert\">knock yourself out</a>.</p></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"07886c466fdbf1ee008dff1a80ff916ca7d6629eabd058d9ac69851140e024eb","category":"Cycling"}