{"title":"Peter Sagan has COVID-19","link":"https://cyclingtips.com/2021/02/peter-sagan-has-covid-19/","date":1612625773000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Tortoreto - Italy - wielrennen - cycling - cyclisme - radsport - Peter Sagan (Slovakia / Team Bora - hansgrohe) pictured during 103rd Giro d’Italia (2.UWT) stage 10 from Lanciano &gt; Tortoreto (177KM) - photo LB/RB/Cor Vos © 2020</h4><p></p><div><p>Peter Sagan tested positive for COVID-19 at a training camp in Gran Canaria and is currently in quarantine along with his brother Juraj and teammate Erik Baska, who also tested positive.</p><p>All three riders, who were at a private training camp together, took a PCR test on January 29 ahead of their planned flights home. All three tests came back positive.</p><p>“We are all feeling well but, obviously, since that day, we have remained in quarantine,” Peter Sagan wrote on Instagram.</p><p>“We are kept under continuous remote supervision and will remain here for as long as required. Hopefully, our next test results will be negative so that we can resume our normal training schedule as soon as possible.”</p><p>The three riders have returned multiple positive tests since the 29th, according to Bora’s head of medical Christopher Edler, all but ruling out the possibility of false positives.</p><blockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/CK8bVqgBjGe/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"13\" id=\"instagram-media-payload-0\"></blockquote><p>Peter Sagan was set to kick off his season at Omloop Het Nieuwsblad on February 27, while Baska intended to start his season at the Tour de la Provence on February 11. Both starts are now in question, according to team manager Ralph Denk. It would be the second time Sagan’s season has been delayed this year, after his original planned start at the Vuelta a San Juan was cancelled.</p><p>“The timing is certainly not ideal, but then again, there is no good time to become ill with COVID. Peter was – and is – extremely motivated, and that’s why he was already quite far along in his preparatory build up for the season,” Denk said. “But the most important thing now is that all three are well and not displaying any severe symptoms.”</p><div><h5>Tags</h5></div></div></div>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0817aec474305c02a09fa886c8339fb1f97acef4acb8c252b19715914fda7cd5","category":"Cycling"}