{"title":"Confusion reigns as Denmark and Great Britain collide in the team pursuit","link":"https://cyclingtips.com/2021/08/confusion-rains-as-denmark-and-great-britain-collide-in-the-team-pursuit/","date":1627980186000,"content":"<div><div><p>Denmark’s Olympic team pursuit hopes appear to be in tatters after crashing out of their round one showdown with Great Britain.</p><p>Denmark was on course to cruise into the gold medal final. The British team was in disarray, having lost Ed Clancy to injury before the start and quickly losing not one but two riders as the teams approached the final kilometres. Denmark on the other hand still had three riders together, were about to lap the British team, and seemed on course to reclaim the world record they had lost to Italy moments earlier.</p><figure></figure><p>Then disaster struck. As Freddy Madsen lead the Danish trio into the final kilometre bearing down on the British team, he rode into the back of Charlie Tanfield who was dropped by his British teammates but had to continue racing as Britain had already lost a rider earlier in the race.</p><p>Madsen was furious after the crash and was seen roaring at Tanfield who lay shell shocked on the floor. Replays suggest Madsen, who adopts an extremely aggressive position, most likely didn’t see Tanfield moving much slower in front of him. Madsen’s position allows him to tuck his head behind his hands and in line with his torso for an extremely aerodynamic position, however, visibility is hampered at best and seems entirely non-existent given the nature of the crash.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/Denmark-Great-Britain-Tokyo-2020-Olympic-team-pursuit-crash-4-1340x754.jpg\"><figcaption>Madsen was furious with Tanfield, he may feel differently when he sees a replay of the race and incident.</figcaption></figure><p>Charlie Tanfield did remount his bike and finished the 4km, although, understandably with the slowest time. It is unclear if Denmark is considered to have finished the race or not. If</p><p>Although it initially appeared Denmark were out having not finished the ride, the commissaries may deem that Denmark completed a catch of Great Britain having literally caught Tanfield. The rules for team pursuiting deem a catch completed when one team closes to within one metre of their opponents. Having completed the catch the race was effectively already over when the crash happened, handing Denmark perhaps the most bizarre route to an Olympic final. But did Denmark close to within one metre of the team or just Charlie Tanfield.</p><p>The UCI’s own Track Cycling Twitter feed lists Denmark as finalists, however, this is unlikely to be the last we hear of this story. Expect appeals from other teams if Denmark does go through. More to follow</p><p>Some twitter response</p><figure></figure><figure></figure><figure><div><blockquote><p>This Team Pursuit competition 👀</p>— Geraint Thomas (@GeraintThomas86) <a href=\"https://twitter.com/GeraintThomas86/status/1422465864700473371?ref_src=twsrc%5Etfw\">August 3, 2021</a></blockquote></div></figure><figure><div><blockquote><p>The Danes are in the final after beating GB. They actually caught them before the unfortunate crash. The aforementioned shin tape has been removed and will be applied to the mouths of jealous critics.</p>— Brian Nygaard (@nygaardbn) <a href=\"https://twitter.com/nygaardbn/status/1422473069659107338?ref_src=twsrc%5Etfw\">August 3, 2021</a></blockquote></div></figure><figure><div><blockquote><p>A correction — TP and IP catch rules are different. In TP the current rule is that you close to within 1m of the other team. So DEN are going to be making an argument that they made the catch (Tanfield still being 3rd man).</p>— Michael Hutchinson (@Doctor_Hutch) <a href=\"https://twitter.com/Doctor_Hutch/status/1422473994670911491?ref_src=twsrc%5Etfw\">August 3, 2021</a></blockquote></div></figure><figure><figcaption>The UCI track cycling Twitter feed suggests Denmark are through to face Italy, but expect appeals to come from a number of teams.</figcaption></figure></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0942ab3c89f98a1de8c4b78a94b67b3f88ae4db1b30bf0bf598c24ca28323922","category":"Cycling"}