{"title":"Power analysis: Egan Bernal’s Strava and power file from his Stage 9 victory","link":"https://cyclingtips.com/2021/05/power-analysis-egan-bernals-strava-and-power-file-from-his-stage-9-victory/","date":1621277981000,"content":"<div><div><p>Egan Bernal powered up the gravel climb to the finish of stage 9 to take the win, the pink jersey, and a bucket full of confidence as he recovers from his lingering back injury. </p><p>Thanks to the wonders of modern technology, aka Strava, and Bernal’s willingness to share his data, we can now see precisely the effort required to drop some of the best climbers in the world. </p><p>Stage 9, or “lunch ride” as Strava somewhat understatedly names Bernal’s file, saw riders cover 156km with 3,500m+ of climbing in just four hours and eight minutes. If this wasn’t impressive enough, Bernal, who weighs approximately 59-60kg, averaged 250watts (4.2watts/kg) for the four hours, burning 3,724kj, and still had enough in the tank to attack for victory in the final kilometre. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/FF54676_311218-1340x894.jpg\"><figcaption>Stage nine was fast from start to finish</figcaption></figure><h2>Never an easy moment</h2><p>For some, 4watts/kg for four hours might seem quite achievable. Even Bernal’s peak one minute of 525w (8.9 w/kg) might not seem out of this world. But bear in mind this is after nine stages and four hours of racing. The ability to perform and hit peak powers at the end of a hard stage, with all the accumulative fatigue of more than a week of racing, is what sets the pros apart from us mere mortals.</p><p>Stage nine was the first four-star rated stage of this year’s Giro, and the combination of stage hunters and domestiques attempting to infiltrate the breakaway meant the riders covered more than 60km before a break finally pushed clear and the peloton could briefly relax. In fact, despite featuring 709m of climbing, the peloton covered 38km in the first hour of racing, with Bernal averaging more than 300watts despite “sitting” protected in the peloton. </p><p>Things didn’t get much easier in the second hour. After a long descent, the peloton raced up an unclassified climb which Bernal crested after a 25min effort again around 300watts. </p><p>The break finally went clear, and Bernal could relax, somewhat cresting a category three GPM with a relatively mundane 255w for 30minutes. This downtime didn’t last long, as the pace in the peloton picked up again on the second category climb to Ovindoli. </p><p>This climb was in no way decisive but again added to the accumulative fatigue that so often can be the deciding factor later in a stage. As the pace in the peloton was increased first by the Ineos Grenadiers and then Bahrain-Victorius, Bernal again averaged just over 300watts for 25minutes. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/CORVOS_00033135-071-1340x894.jpg\"><figcaption>Nobody could match Bernal’s final effort</figcaption></figure><h2>Fight for the win</h2><p>As the breakaway split and fought its way towards the finish, the action in the peloton was well and truly hotting up. Looking at Bernal’s file, the effort shifts from a steadier type of output to follow his teammates on the climbs to a much more stochastic power output fighting to maintain position on undulating terrain.  </p><p>Just looking at the final 25minutes of the race, the average wattage is very similar at 298watts, but this masks the true difficulty of the closing stages of such a difficult stage. In fact, Bernal averages a huge 340watts (5.8w/kg) for the ten minutes before the bunch hit the gravel climb to the finish, a huge effort even before the proverbial hit the fan.</p><p>With all that context, let’s look again at Bernal’s final effort to take the win. Bernal’s ride includes a small section after the finish line with effectively zero effort, so I have zoomed in on what appears from the data to be the final kilometre of racing. </p><p>Bernal takes just three minutes to complete the final kilometre despite the gravel and average gradient of 9%, and a maximum of 14%. Bernal pushes out a mammoth 441 watts (7.5w/kg) for that three-minute effort. To do the math on that at home, take your weight in kilograms and multiply it by 7.5. Take that number and try to sustain that wattage for three minutes on your next ride. Difficult is an understatement, more like impossible to most, especially after nine days of racing. </p><p>Delve a little deeper, and the ride is even more impressive. Bernal rides under the flamme rouge marking the final kilometre in Gianni Moscon’s wheel. Moscon leads the remnants of the bunch all the way to 600m to go when Vlasov lifts the pace. Bernal again follows Vlasov’s wheel briefly before launching his attack at approximately 550m to go. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/CORVOS_00033135-072-1340x774.jpg\"><figcaption>Bernal’s attack left his rivals in his wake, most of whom were very evenly matched.</figcaption></figure><p>Bernal shifts to the big ring and unleashes a stinging attack he sustained all the way to the finish line just over one minute later. That attack included 90 seconds at 494 watts, 1minute at 518 watts and an incredible 30 seconds at 582 watts. Good enough to win the stage, take the leaders jersey and distance all his rivals.</p><p>Again it is worth mentioning: this stage-winning effort was all on gravel, in the big ring, with his rear wheel hopping and skipping behind him. Surely any concerns about his back are now well and truly behind Bernal. </p><p>One word of caution for any Bernal fans, though. Remco Evenepoel started that final 400m very poorly positioned, at least twelve wheels and seven seconds back from Bernal. Bernal attacked that final minute with clear roads ahead of him. Despite having to carve himself a path through the other riders, Evenepoel crossed the line at just ten seconds down, an impressive recovery. This Giro is far from over! </p></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0a3d3fea5301508f0a1e7bf175cba91152864ac960bd5a322e8fb1618de9badd","category":"Cycling"}