{"title":"Qualcomm’s new Snapdragon 780G beefs up the midrange mobile CPU space","link":"https://arstechnica.com/?p=1752495","date":1616783913000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>multithreaded muscle —</h4><h2 itemprop=\"description\">Significant changes in SoC architecture should produce faster midrange phones.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/qualcomm-780g-hero-800x534.png\" alt=\"Significantly faster mid-range Android phones and tablets are on the way starting in Q2 2021.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/qualcomm-780g-hero.png\" data-height=\"611\" data-width=\"915\">Enlarge</a> <span>/</span> Significantly faster mid-range Android phones and tablets are on the way starting in Q2 2021.</p><p>Qualcomm</p></figcaption></figure><p>On Thursday, Qualcomm announced its newest midrange mobile processor—the <a href=\"https://www.qualcomm.com/media/documents/files/qualcomm-snapdragon-780g-mobile-platform-product-brief.pdf\">Snapdragon 780G</a>, a 5nm part that succeeds last year's 765. The Snapdragon 700 series is a midrange line that offers similar features to the flagship Snapdragon 800 series but at somewhat lower performance for significantly lower cost.</p><p>On the surface, it's easy to look at last year's Snapdragon 768G and this year's 780G and see a similar product: an octa-core processor with Adreno GPU. But although the core count remained constant, the types of cores did not.</p><p>Earlier Snapdragon 700 series SoCs used one \"fastest\" Cortex A-76 core, another \"almost as fast\" Cortex A-76, and six \"slow-and-low\" Cortex A-55 cores that can get background tasks done with a minimum of battery drain. The new 780G shifts things around, with three fast secondary cores and only four slow cores:</p><table><tbody><tr><td><strong>SoC</strong></td><td><strong>Fastest Core</strong></td><td><strong>Fast Core(s)</strong></td><td><strong>Slow/Efficient Cores</strong></td></tr><tr><td>Snapdragon 768G</td><td>1x Cortex A-76 @ 2.8 GHz</td><td>1x Cortex A-76 @ 2.4 GHz</td><td>6x Cortex A-55 @ 1.8 GHz</td></tr><tr><td>Snapdragon 780G</td><td>1x Cortex A-78 @ 2.4 GHz</td><td><strong>3x</strong> Cortex A-78 @ 2.2 GHz</td><td>4x Cortex A-55 @ 1.9 GHz</td></tr></tbody></table><p>This strikes us as a pretty large shift, and it highlights how much wiggle room there is in a word like \"octa-core\" in modern big/little CPUs, where the different cores have very different capabilities and performance levels.</p><p>The 780G also gets an upgraded GPU—Qualcomm says its Adreno 642 gets a 50 percent performance boost over the Adreno 620 in the 768G. Anandtech's back-of-the-napkin <a href=\"https://www.anandtech.com/show/16578/qualcomm-announces-snapdragon-780g-new-5nm-765-successor\">math</a>&nbsp;puts that roughly on par with the Adreno 640 in late 2018's Snapdragon 855 flagship.</p><p>Snapdragon 780G offers a new and improved Hexagon 770 AI processor, with an additional lower-powered AI accelerator that can handle tasks like filtering out wind and background noise during calls without eating too far into battery reserves. There's also support for 5G and Wi-Fi 6E modems and an image signal processor that can process three 25 MP images simultaneously. That allows for a phone with a triple lens arrangement to capture images from wide, ultra-wide, and telephoto cameras from a single click.</p><p>Qualcomm says the first Snapdragon 780G-equipped devices should begin shipping in Q2 2021.</p></div></div>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0ac81bdc2a2f6c3e34511eef77ec8aaf53daf577e37c51d312c0c50ebf1a0bf5","category":"Tech"}