{"title":"Eight questions to be answered in women’s cycling in 2021","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/eight-questions-to-be-answered-in-women-s-cycling-in-2021","date":1614871064000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>With the 2021 women’s cycling season now officially underway, our minds are also racing with speculation about how the coming months will unfold. As the peloton heads to Tuscany to kick off the Women’s WorldTour with Strade Bianche, we take a look at some of the biggest questions to be answered on the road this year.</p><h4>Who Can Stop Annemiek Van Vleuten?</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Annemiek_Van_Vleuten_1024x1024.jpg?v=1614869577\" alt=\"\"></p><p><em>Photo credit: Alex Whitehead/<span>SWpix.com</span></em></p><p>Poor positioning at a key moment ultimately cost Van Vleuten a result in Saturday’s Omloop Het Nieuwsblad, but everyone knows just how unstoppable she can be on any other day.&nbsp;</p><p>The 38-year-old Dutch rider has been arguably the most dominant force in the sport for the past few years and was on a stellar run of results last season before fracturing her wrist while leading the Giro Rosa. She returned only eight days later at the World Championships to secure a silver medal in the road race behind compatriot Anna van der Breggen, and there’s no reason to believe that the current European champion will be any less impressive this year with her new team, Movistar.</p><p>Van der Breggen’s victory at Omloop on the weekend suggests she’ll continue to be a more than worthy rival alongside Trek-Segafredo duo Lizzie Deignan and Elisa Longo Borghini, but expect Van Vleuten to go into almost every race she starts in 2021 as the number one favourite yet again.</p><h4>And How Will Team Bikeexchange Fare Without Her?</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC00845_1_1024x1024.jpg?v=1614869868\" alt=\"\"></p><p><em>Amanda Spratt – Photo credit: Zac Williams/<span>SWpix.com</span></em></p><p>With Van Vleuten wearing new colours this year, the team formerly known as Mitchelton-Scott find themselves looking for a way to fill the void left by her departure. It’s a daunting task, but they can count themselves fortunate to already have a rider who’s well prepared for such an opportunity in Amanda Spratt.&nbsp;</p><p>The Australian has been a consistent presence at the pointy end of major races since her big breakout season in 2018 and would have likely been a leading contender for a road race medal in Imola last September had she not been injured in the same crash as Van Vleuten the week before. Her decision to stay in Europe to train this winter rather than head home to defend her national road race title shows she certainly means business, and it wouldn’t be a surprise to see her go toe-to-toe with her old team leader in the Ardennes come the spring.</p><p>Grace Brown will also be one to watch after her second-place finish at Liège-Bastogne-Liège and Brabantse-Pijl victory last year, while other riders like Lucy Kennedy, Sarah Roy, Janneke Ensing and Georgia Williams all have the ability to pick up some big results, too. Losing the the most dominant rider in the WorldTour certainly stings, but the Aussie outfit have the pieces in place to still be major players this season.</p><h4>How Will Jumbo-Visma’s Debut Season Go?</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Vertical-Actiefoto_s_campagne_outfit_2021_7_1024x1024.jpg?v=1614870010\" alt=\"\"></p><p>The past few years have seen an increasing number of men’s team sponsors cross over into women’s cycling, and the latest outfit to join the peloton needs no introduction. Headlined by Marianne Vos, Jumbo-Visma may not have the kind of depth that Trek-Segafredo or SD Worx enjoy, but there is plenty of talent on their roster outside the three-time road race world champion.</p><p>They’ll likely be relying on their team leader for the majority of victories in year one, but in Jip van den Bos, Anna Henderson, Riejanne Markus and others, they have a young foundation that should not only serve as solid support for Vos but also stand them in good stead for the future. Don’t expect them to top the WorldTour rankings in 2021, but they have the capability to influence races right from the get-go.</p><h4>Can Kasia Niewiadoma And Cecilie Uttrup Ludwig Take Another Step Up?</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW1_4013_1_c8bb00f6-ef7f-4d2e-b195-c7b07ca28fe5_1024x1024.jpg?v=1614870046\" alt=\"\"></p><p>Photo credit: Alex Whitehead/<span>SWPix.com</span></p><p>There are plenty of similarities between Niewiadoma and Uttrup Ludwig. Both are former WorldTour Youth Jersey winners with an aggressive racing style, bags of charisma and some notable results already on their palmarès.&nbsp;</p><p>Neither rider has quite managed to make the step up to consistently challenge Van Vleuten and Van der Breggen yet, but with the full backing of Canyon-SRAM and FDJ Nouvelle-Aquitaine Futuroscope, respectively, it seems only a matter of time before they’re both devouring victories left, right and centre. And even if it doesn’t happen this season, they’ll still be two of the most exciting riders to watch.</p><h4>Who’ll Be The First Women’s Paris-Roubaix Champion?</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Cobble_-_Paris-Roubaix_1024x1024.jpg?v=1614870239\" alt=\"\"></p><p>A late addition to the rearranged 2020 calendar before COVID restrictions forced its cancellation, the most hotly anticipated race on this year’s schedule is almost certainly the inaugural Women’s Paris-Roubaix.&nbsp;</p><p>Newly-crowned cyclo-cross world champion Lucinda Brand seems like an early favourite thanks to her classics pedigree and superb bike-handling skills (arguably the best in the entire sport), but Liv Racing’s Lotte Kopecky is another sure-fire contender. Highly adept on the cobbles, the Belgian sprinter earned podium finishes at Gent-Wevelgem, the Ronde van Vlaanderen and Driedaagse Brugge-De Panne last year and has already got off the mark this season with victory at Le Samyn des Dames. You’re unlikely to see her win solo, but if the race comes down to a group sprint in the Roubaix Velodrome, the 25-year-old will be tough to beat.</p><p>Elsewhere, Chantal van den Broek-Blaak has the ability to win from any number of different scenarios, while the same goes for her SD Worx teammates Christine Majerus and Jolien D’Hoore. And of course, all the usual suspects like Van Vleuten, Van der Breggen and Vos should be in the mix, too. Of course, being Paris-Roubaix – anything can happen. We'll be keeping an eye on cross riders like Ceylin del Carmen Alvarado and Sanne Cant&nbsp;for a possible upset.</p><h4>Which Young Rider Will Enjoy The Biggest Breakout?</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/02_Cecilie_9242-copy_1024x1024.jpg?v=1614870572\" alt=\"\"></p><meta charset=\"utf-8\"><p><em><span>Cecilie Uttrup Ludwig –&nbsp;</span>Photo credit: David Powell</em></p><p>Like we saw with the previously mentioned Niewiadoma in 2016 and Uttrup Ludwig a year later, there always seems to be one young rider every season who emerges as a star in the making.&nbsp;</p><p>More recently, Lorena Wiebes and Liane Lippert have proved they’re worthy of such a title, and there are no shortage of names who could do the same this year. 23-year-old Italian Elisa Balsamo already has two WorldTour wins to her name and possesses the potential to be the fastest finisher in the peloton, while Emma Norsgaard’s recent second-place finishes at Omloop and Les Samyn des Dames proved she’s another promising sprinter to keep an eye on.</p><p>New Canyon-SRAM rider Mikayla Harvey will also be looking to build on her impressive display at last year’s Giro Rosa, where she finished only 32 seconds off a podium spot in fifth-place overall, while Sarah Gigante’s incredible performances on the Australian domestic scene suggest she could already be a force to be reckoned with once she hits Europe despite being only 20 years old. Of course, we can't forget about junior World Champion Megan Jastrab – after all, cycling's stars are getting younger each year.</p><h4>How Will The Calendar Be Affected?&nbsp;</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_7225_1024x1024.jpg?v=1614864151\" alt=\"\"></p><meta charset=\"utf-8\"><p><em>Photo credit: Alex Whitehead/<span>SWPix.com</span></em></p><p>It’s not something any cycling fan wants to think about as the season kicks into gear, but there’s no escaping the possibility that the 2021 calendar could eventually look very different if COVID becomes an issue once more.&nbsp;</p><p>Last year’s Women’s WorldTour schedule was decimated by cancellations to the point where only 10 races survived following the restart, and this season has already seen the Cadel Evans Great Ocean Road Race, Itzulia Women and the RideLondon Classique fall by the wayside along with a host of ProSeries events.&nbsp;</p><p>The Ronde van Drenthe and Women’s Tour have also been postponed in the hope they can be rescheduled for a later date, and it wouldn’t be a surprise to see more races follow suit if things with the virus take another turn for the worse. Of course, in that instance the cycling season may be the least of our concerns.</p><h4>Will We Have A New Olympic Road Race Champion?</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/sw02_womens-road-race_1_1024x1024.jpg?v=1614870436\" alt=\"\"></p><meta charset=\"utf-8\"><p><em>Photo credit: Alex Whitehead/<span>SWPix.com</span></em></p><p>Without any three-week grand tours or five monument classics, the Olympic road race has always seemed to take on extra significance in women’s cycling. The 2016 event was especially memorable, culminating in victory for Van der Breggen, and we can only hope that COVID doesn’t prevent us from enjoying a similarly thrilling affair this summer.</p><p>With her retirement planned for the end of the season, the defending champion will be looking to go out on a high with her second consecutive gold, but Dutch teammate Van Vleuten will also be aiming to banish the memories of the horror crash that ended her medal hopes in Rio. Add the likes of Deignan, Spratt and Chloe Dygert into the mix on a 137-kilometre course with 2,692 climbing metres, and you have all the ingredients for another great race – if the Games do indeed go ahead.</p></div></div>","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0bc616316599999c049f14353c660dc335c71bf397a03158246a837070b3aaa4","category":"Cycling"}