{"title":"Atlantic currents seem to have started fading last century","link":"https://arstechnica.com/?p=1745781","date":1614435019000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>In deep —</h4><h2 itemprop=\"description\">Another predicted impact of climate change may be here.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/gulfstream_amo_2005108_sst-800x492.jpg\" alt=\"Image of a white, meandering band separating purple areas from grey ones.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/gulfstream_amo_2005108_sst.jpg\" data-height=\"889\" data-width=\"1445\">Enlarge</a> <span>/</span> The Gulf Stream, as imaged from space.</p></figcaption></figure><p>The major currents in the Atlantic Ocean help control the climate by moving warm surface waters north and south from the equator, with colder deep water pushing back toward the equator from the poles. The presence of that warm surface water plays a key role in moderating the climate in the North Atlantic, giving places like the UK a far more moderate climate than its location—the equivalent of northern Ontario—would otherwise dictate.</p><p>But the temperature differences that drive that flow are expected to fade as our climate continues to warm. A bit over a decade ago, measurements of the currents seemed to be indicating that temperatures were dropping, suggesting that we might be seeing these predictions come to pass. But a few years later, it became clear that there was just too much year-to-year variation for us to tell.</p><p>Over time, however, researchers have figured out ways of getting indirect measures of the currents, using material that is influenced by the strengths of the water's flow. These measures have now let us look back on the current's behavior over the past several centuries. And the results confirm that the strength of the currents has dropped dramatically over the last century.</p><h2>On the conveyor</h2><p>The most famous of the currents at issue is probably the Gulf Stream, which runs up the east coast of the US and Canada, taking warm water from the tropics toward Europe. But the Gulf Stream is just one part of a far larger ocean conveyor system, which redistributes heat in all the major ocean basins outside of the Arctic. And while its reach is global, a lot of the force that drives the system develops in the polar regions. That's where surface waters cool off, increase in density, sink to the ocean floor, and begin to flow south. It's that process that helps draw warmer water north to replace what has sunk.</p><p>It's the density of the cold, salty water that is key to the whole process—and that's where climate change can intervene to slow down or halt the water's turnover. The Arctic is warming faster than any other area on Earth, which means that the surface waters are starting to take longer to cool off. The Arctic warming is also melting off a lot of the ice, both on land and in the floating ice sheets that have typically covered the Arctic Ocean. This process can form a layer of fresher water over the surface of the ocean nearby that, even after it cools, won't be as dense as the salt water beneath it.</p><p>If this process has kicked in, we should be able to detect it by measuring the strength of the currents flowing north. But that has turned out to be less informative than we might want. While we have detected significant drops in some years, they were often countered by large rises in others. This internal variability in the system is so large that it would take decades for any trend to reach the point of statistical significance.</p><p>The alternative would be to extend our records back in time. But since we can't retroactively place buoys in the North Atlantic early last century, researchers have to identify other ways of figuring out how strong the flow of water was before we had accurate measurements.</p><h2>Current by proxy</h2><p>The research community as a whole has identified a number of ways to figure out what was going on in the oceans in the past. Some are pretty direct. For example, stronger ocean currents can keep larger particles of sediment flowing in the water for longer. So examining the average particle size deposited in sediments on the ocean floor can tell us something about the currents that flowed past that site. Other measures are a bit less direct, like nitrogen isotope ratios in corals, which tell us something about the productivity of the ocean in that area.</p><p>Overall, there are about a half-dozen different ways of understanding past ocean conditions used in the new study. Each has different levels of uncertainty, and many don't provide an exact measure of conditions in a single year, instead giving a sense of what the average conditions were over a period of several decades.</p><p>Complicating matters further, the measures don't all come from the same locations. Samples taken from deeper waters will capture the equator-directed cold water flow, while shallow sites will yield data on the warm waters flowing north. The Gulf Stream also breaks up into multiple individual currents in the North Atlantic so that some sites only capture a small part of the total picture.</p><p>Given all this, it's not possible to build a complete picture of the Atlantic currents in the past. But with enough sites covered, it's possible to get a sense of whether there have been any general changes at any point over the last 1,600 years based on the overlaps of the different records.</p><p>To identify any major transitions, a research team did change-point analysis, essentially searching for points in the history where the mean behavior before and after are significantly different. They found two change points that show up consistently in the data from multiple proxies. One occurred in the late 1800s, and the second happened around 1960, when the current period of warming really started to take off.</p><p>Of the 11 different records examined in the researchers' work, 10 show that the current's lowest strength has been within the past century. And that identification is statistically significant in nine of them. \"Together, these data consistently show that the modern [current] slowdown is unprecedented in over a thousand years,\" the paper's authors conclude.</p><p>Obviously, we'd like to build up better records that more fully capture the dynamics of what has been going on and, if possible, give us more direct measures of the currents' actual strengths. It's also important to emphasize that this doesn't necessarily portend a sudden, radical shift to a completely new climate. Europe might see a little less warming from ocean currents, but it's also going to be seeing a lot more warming due to rising atmospheric temperatures. However, the drop in this current will have wide-reaching effects, both on the land surrounding the North Atlantic and the ecosystems within it. So getting more data should be a high priority.</p><p><em>Nature Geoscience</em>, 2021. DOI: <a href=\"http://dx.doi.org/10.1038/s41561-021-00699-z\">10.1038/s41561-021-00699-z</a> &nbsp;(<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0c2147a4f6f8e67ae43c93fbc14939df0598f24ece90f0c0f627552e0ae027be","category":"Tech"}