{"title":"Event Horizon Telescope captures new view of black hole in polarized light","link":"https://arstechnica.com/?p=1751226","date":1616608213000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>A new look for the black hole in M87 —</h4><h2 itemprop=\"description\">It should yield insight into how black holes gobble up matter and emit powerful jets.</h2></header><div itemprop=\"articleBody\"><figure></figure><p>Two years ago, the <a href=\"https://eventhorizontelescope.org/\">Event Horizon Telescope</a> (EHT) made headlines with its announcement of the first direct image of a black hole. Science magazine named the image its <a href=\"https://www.aaas.org/news/sciences-2019-breakthrough-first-image-supermassive-black-hole\">Breakthrough of the Year</a>. Now the EHT collaboration is back with another groundbreaking result: a new image of the same black hole, this time showing how it looks in polarized light. The ability to measure that polarization for the first time—a signature of magnetic fields at the black hole's edge—is expected to yield fresh insight into how black holes gobble up matter and emit powerful jets from their cores. The new findings were described in three papers published in The Astrophysical Journal Letters.</p><p>\"This work is a major milestone: the polarization of light carries information that allows us to better understand the physics behind the image we saw in April 2019, which was not possible before,\" <a href=\"https://eventhorizontelescope.org/blog/astronomers-image-magnetic-fields-edge-m87s-black-hole\">said co-author Iván Martí-Vidal,</a> coordinator of the EHT Polarimetry Working Group and a researcher at the University of Valencia, Spain. \"Unveiling this new polarized-light image required years of work due to the complex techniques involved in obtaining and analyzing the data.\"</p><p>As Ars' <a href=\"https://arstechnica.com/science/2019/04/event-horizon-telescope-gives-us-first-images-of-what-its-named-for/\">John Timmer reported back in 2019</a>:</p><blockquote><p>The Event Horizon Telescope isn't a telescope in the traditional sense. Instead, it's a collection of telescopes scattered around the globe. In its current iteration, it includes hardware from Hawaii to Europe, and from the South Pole to Greenland, though not all of these were active during the initial observations. The telescope is created by a process called interferometry, which uses light captured at different locations to build an image with a resolution similar to that of a telescope the size of the most distant locations.</p><p>Interferometry has been used for facilities like ALMA, the Atacama Large Millimeter/submillimeter Array, where telescopes can be spread across 16km of desert. In theory, there's no upper limit on the size of the array, but there are several challenges. To know which photons originated at the same time at the source, you need very precise location and timing information on each of the sites. And you still have to gather sufficient photons in order to see anything. In general, that means atomic clocks (which had to be installed at many of the locations) and extremely precise GPS measurements built up over time. For the Event Horizon Telescope, the large collecting area of ALMA, combined with choosing a wavelength where supermassive black holes are very bright, ensured sufficient photons. The net result is a telescope that can do the equivalent of reading the year stamped on a coin in Los Angeles from New York City—assuming the coin was glowing at radio wavelengths. There's no way we can do better without relying on hardware that's not located on Earth.</p></blockquote><p>Those multiple imaging methods resulted in the <a href=\"https://www.eso.org/public/images/eso1907a/\">first direct image ever taken</a> of a black hole at the center of an elliptical galaxy. Located in the constellation of Virgo, some 55 million light years away, the galaxy is called Messier 87 (M87). The collaboration's findings were <a href=\"https://www.eso.org/public/news/eso1907/\">published on April 10, 2019</a> in six different papers featured in The Astrophysical Journal Letters. It's a feat that would have been impossible a mere generation ago, made possible by technological breakthroughs, innovative new algorithms, and of course, connecting several of the world's best radio observatories. The image confirmed that the object at the center of M87 is indeed a black hole.</p><p>The EHT captured photons trapped in orbit around the black hole, swirling around at near the speed of light, creating a bright ring around it. From this, astronomers were able to deduce that the black hole is spinning clockwise. The imaging also revealed the shadow of the black hole, a dark central region within the ring. That shadow is as close as astronomers can get to taking a picture of the actual black hole, from which light cannot escape once it crosses the event horizon. And just as the size of the event horizon is proportional to the black hole's mass, so, too, is the black hole's shadow: the more massive the black hole, the larger the shadow. (The M87 black hole's mass is 6.5 billion times that of our Sun.) It was a stunning confirmation of the general theory of relativity, showing that those predictions hold up even in extreme gravitational environments.</p><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht8-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht8.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht8-980x780.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht8.jpg 2560\" data-sub-html=\"#caption-1751637\"><figure><figcaption id=\"caption-1751637\"><span></span><p>Map showing M87 in the constellation of Virgo.</p><p><span></span> ESO/IAU/Sky &amp; Telescope</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht6CROP-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht6CROP.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht6CROP-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht6CROP.jpg 2560\" data-sub-html=\"#caption-1751634\"><figure><figcaption id=\"caption-1751634\"><span></span><p>M87 captured by ESO's Very Large Telescope.</p><p><span></span> ESO</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht5-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht5.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht5-980x652.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht5.jpg 2560\" data-sub-html=\"#caption-1751633\"><figure><figcaption id=\"caption-1751633\"><span></span><p>First image of a black hole, taken by the Event Horizon Telescope.</p><p><span></span> EHT Collaboration</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht7-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht7.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht7-980x654.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht7.jpg 2560\" data-sub-html=\"#caption-1751636\"><figure><figcaption id=\"caption-1751636\"><span></span><p>Artist's impression of the black hole at the heart of the elliptical galaxy M87</p><p><span></span> ESO/M. Kornmesser</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht1CROP-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht1CROP.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht1CROP-980x654.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht1CROP.jpg 2560\" data-sub-html=\"#caption-1751230\"><figure><figcaption id=\"caption-1751230\"><span></span><p>A view of the M87 supermassive black hole in polarized light</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht3CROP-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht3CROP.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht3CROP-980x1104.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht3CROP.jpg 2560\" data-sub-html=\"#caption-1751631\"><figure><figcaption id=\"caption-1751631\"><span></span><p>Four ways of looking at the central region of M87. At top, an image in visible light taken by the Hubble Space Telescope. The other three images show the jets and central region in polarized light.</p><p><span></span> EHT Collaboration/NASA/ESA/Hubble Heritage Team</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht4-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht4.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht4-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht4.jpg 2560\" data-sub-html=\"#caption-1751632\"><figure><figcaption id=\"caption-1751632\"><span></span><p>ALMA image showing M87 jet in polarized light.</p><p><span></span> ALMA (ESO/NAOJ/NRAO)/Goddi et al.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht9-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht9.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht9-980x481.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/eht9.jpg 2560\" data-sub-html=\"#caption-1751638\"><figure><figcaption id=\"caption-1751638\"><span></span><p>Side-by-side images showing a reconstruction of the black hole image including data from ALMA and APEK (left), and what it would look like without that data (right).</p><p><span></span> EHT Collaboration</p></figcaption></figure></li></ul></div><p>However, what was lacking was insight into the process behind the powerful twin jets produced by the black hole gobbling up matter, ejecting a portion of the material falling into it away at nearly light speed. (The black hole at the center of our Milky Way is less ravenous, i.e., relatively quiet, compared to M87's black hole.) For example, astronomers don't yet agree about how those jets get accelerated to such high speeds. These new results place additional constraints around the various competing theories, narrowing the possibilities.</p><p>In much the same way that polarized sunglasses reduce glare from bright surfaces, the polarized light around a black hole provides a sharper view of the region around it. In this case, the polarization of light isn't due to special filters (like the lenses in sunglasses) but the presence of magnetic fields in the hot region of space surrounding the black hole. That polarization enables astronomers to map the magnetic field lines at the inner edge and to study the interaction between matter flowing in and being blown outward.</p><p>\"The observations suggest that the magnetic fields at the black hole's edge are strong enough to push back on the hot gas and help it resist gravity's pull. Only the gas that slips through the field can spiral inwards to the event horizon,\" <a href=\"https://eventhorizontelescope.org/blog/astronomers-image-magnetic-fields-edge-m87s-black-hole\">said co-author Jason Dexter</a> of the University of Colorado Boulder, who is also coordinator of the EHT Theory Working Group. That means that only theoretical models that incorporate the feature of a strongly magnetized gas accurately describe what the EHT collaboration has observed.</p><p>DOI: \"First M87 Event Horizon Telescope Results VII: polarization of the ring,\" Astrophysical Journal Letters, 2021. <a href=\"http://dx.doi.org/10.3847/2041-8213/abe71d\">10.3847/2041-8213/abe71d</a>.</p><p>DOI: \"First M87 Event Horizon Telescope Results VIII: Magnetic Field Structure Near The Event Horizon,\" Astrophysical Journal Letters, 2021. <a href=\"http://dx.doi.org/10.3847/2041-8213/abe4de\">10.3847/2041-8213/abe4de</a>.</p><p>DOI: \"Polarimetric properties of Event Horizon Telescope targets from ALMA,\" Astrophysical Journal Letters, 2021. <a href=\"http://dx.doi.org/10.3847/2041-8213/abee6a\">10.3847/2041-8213/abee6a</a> (<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div></div>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0c52742a55c360a4bc1d758a7c90fa603f26209ced0d2f550c69b02716ed5e2b","category":"Tech"}