{"title":"Disney redundancy: Fox CGI-animation studio behind Ice Age, Rio to shut down","link":"https://arstechnica.com/?p=1740867","date":1612898070000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Disney minus —</h4><h2 itemprop=\"description\">Blue Sky, formed in <em>TRON</em>'s '80s wake, leaves behind legacy of billions in cartoon sales.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/blue-sky-listing-800x500.png\" alt=\"Two rows of posters for animated films.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/blue-sky-listing.png\" data-height=\"875\" data-width=\"1400\">Enlarge</a> <span>/</span> By the end of April, the dedicated Blue Sky Studios team behind the above films will be shuttered by its current owners at Disney.</p></figcaption></figure><p>After <a href=\"https://arstechnica.com/tech-policy/2018/06/trump-administration-approves-potential-disneyfox-merger/\">acquiring 21st Century Fox in 2018</a>, Disney moved forward with content plans that, in some ways, celebrated and married the combined corporate-entertainment universes. But film cancellations and corporate redundancies soon followed, and today's announcement is a huge one for CGI animation. Blue Sky Studios, the makers of the <em>Ice Age</em> and <em>Rio</em> film series, is shutting down.</p><p>Citing \"the current economic realities,\" a Disney spokesperson <a href=\"https://deadline.com/2021/02/blue-sky-studios-closing-disney-ice-age-franchise-animation-1234690310/\">confirmed to Deadline</a> that Blue Sky will be fully shut down by this April, affecting all 450+ employees in the Greenwich, Connecticut, studio. But Disney will keep all the rights to Blue Sky's series and characters, and according to the same Deadline report, an unnamed animation team inside the Disney corporate machine is moving forward with an <em>Ice Age</em> series exclusively for Disney+.</p><h2>Bad <em>Nimona</em> news</h2><p>For years, CG animation at Disney had a severe split in quality between its outside partnership with Pixar and the company's in-house Disney Animation Studios. That changed with the megaton budget and years of stops-and-restarts in the making of 2010's&nbsp;<em>Tangled</em>, a critical and commercial success that paved the way to more internal-production successes like <a href=\"https://arstechnica.com/gaming/2019/11/review-frozen-ii-is-fun-family-fare-with-stunning-visuals-and-so-so-soundtrack/\"><em>Frozen</em></a>, <em>Moana</em>, and <a href=\"https://arstechnica.com/gaming/2012/11/from-zangief-to-heros-duty-a-gamers-guide-to-wreck-it-ralph/\"><em>Wreck-It Ralph</em></a>. At the same time, Pixar became <a href=\"https://arstechnica.com/uncategorized/2006/01/6038-2/\">a wholly owned Disney property in 2006</a> and continued to thrive with its own universe of existing IP and <a href=\"https://arstechnica.com/gaming/2020/03/onward-film-review-the-best-tolkien-loving-comedy-this-side-of-holy-grail/\">new series</a>.</p><p>Enter Blue Sky Studios, whose eyes in 2018 were on an entirely new franchise in the form of <em>Spies in Disguise</em>. The film debuted one year later as arguably Blue Sky's worst theatrical performance yet—though how much of its marketing and hype cycle was affected by the handover from Fox to Disney remains unclear. Today's Deadline report says that the studio's closure means curtains for Blue Sky's next brand-new film series, based on the half-sci-fi, half-fantasy graphic novel <em>Nimona</em>, which originally eyed a 2020 theatrical launch when it was announced in 2017. Deadline reports that the project only had \"10 months\" of production left to complete and will, for the time being, remain unfinished.</p><p>Today's news marks a bitter full-circle story for Blue Sky, since the company began in the 1980s after six of its founders were laid off at a different studio: MAGI, a pioneering CGI-animation firm that shut down shortly after finishing contract work for Disney on 1982's <em>TRON</em>.</p><p><em>Ice Age</em>'s Disney+ series is a good indicator that Disney will continue exploiting the billions in box office and home video sales of Blue Sky's biggest properties—and perhaps Disney will follow through on a spokesperson pledge to rehire Blue Sky staffers inside the Disney family, thus clearing the way for those staffers to continue working on prior Blue Sky series (or their work on licensed series like Peanuts and Dr. Seuss books).</p></div></div>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0d74481f085fbf07d32eb6dcfbf2eca55d5590822b09e784aa80e510971e57ee","category":"Tech"}