{"title":"Cavendish will not race the Tour with Bennett reportedly set to start","link":"https://cyclingtips.com/2021/06/cavendish-will-not-race-the-tour-with-bennett-reportedly-set-to-start/","date":1624071556000,"content":"<div><div><p>After a brief period of uncertainty after Sam Bennett injured his knee, <a href=\"https://www.cyclingnews.com/news/mark-cavendish-set-to-miss-tour-de-france-selection-after-sam-bennett-cleared-to-race/\" target=\"_blank\">Cyclingnews</a> reports that the reigning points classification champ will, in fact, be in the Deceuninck-QuickStep Tour de France lineup – ruling out the possibility of Mark Cavendish making the start.</p><p>Bennett, who won two stages at last year’s Tour, had been planning to race the Baloise Belgium Tour last week as a pre-Tour tune-up race, but a knee injury derailed those plans. Deceuninck-QuickStep backed Cavendish in the sprints at the race instead, and the 36-year-old Manxman delivered with a stage victory on the final day of the race.</p><p>With Bennett’s status uncertain over the past few days, questions began to arise over whether Cavendish might replace Bennett for the Tour. After initial reports suggested that Cavendish might not want to make the start on his current salary, he told The Telegraph that he would be interested, if Bennett were unable to race.</p><p>According to Cyclingnews, however, Bennett is now slated to make the start after all, leaving Cavendish without a spot.</p><p>Bennett will thus be hunting for his third career Tour stage win, and possibly another green jersey. Cavendish, meanwhile, will have to wait on contending for any further Tour stage victories. He currently counts 30 on his career palmares, four shy of Eddy Merckx’s all-time record of 34.</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0e045e0231f3bed2a4c1ca91217b32e1e5e15103ffeaece14a249f89d807e225","category":"Cycling"}