{"title":"Google claims it will stop tracking individual users for ads","link":"https://arstechnica.com/?p=1746842","date":1614810998000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>We've evolved beyond your pathetic need for cookies, muahahaha! —</h4><h2 itemprop=\"description\">Google says anonymized, group-based interest tracking will be good enough.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/12/google-web-800x450.jpg\" alt=\"The word \" google=\"\" photoshopped=\"\" onto=\"\" a=\"\" spider=\"\" web.=\"\"><figcaption></figcaption></figure><p>As Google's plan to <a href=\"https://arstechnica.com/information-technology/2020/01/google-plans-to-drop-chrome-support-for-tracking-cookies-by-2022/\">kill third-party tracking cookies</a> ramps up, the company is answering questions about what will replace it. A lot of people have wondered, if Google kills cookies, won't it just cook up some other method for individually tracking users?</p><p>Today, Google answered those concerns in a post on its \"<a href=\"https://blog.google/products/ads-commerce/a-more-privacy-first-web/\">Ads &amp; Commerce</a>\" blog, pledging it won't come up with \"any technology used for tracking&nbsp;individual people.\" The company wrote:</p><blockquote><p>We continue to get questions about whether Google will join others in the ad tech industry who plan to replace third-party cookies with alternative user-level identifiers. Today, we’re making explicit that once third-party cookies are phased out, we will not build alternate identifiers to track individuals as they browse across the web, nor will we use them in our products.</p></blockquote><p>You might look at that statement and think that Google is sacrificing something or turning over a new leaf when it comes to privacy, but really, the fact is Google doesn't&nbsp;need to track <em>individuals</em> for advertisements. Google's cookie-tracking replacement technology, the Chrome \"<a href=\"https://www.chromium.org/Home/chromium-privacy/privacy-sandbox\">Privacy Sandbox</a>,\" uses group tracking, which is more in line with how advertisers think anyway.</p><p>As Google puts it in its blog post, \"advertisers don't need to track individual consumers across the web to get the performance benefits of digital advertising. Advances in aggregation, anonymization, on-device processing and other privacy-preserving technologies offer a clear path to replacing individual identifiers.\"&nbsp;If you're an advertiser with a phone ad, you would&nbsp;only ever want to show your ad to \"people who care about phones.\" As an advertiser, you wouldn't really care about individuals or exact browsing history, as long as you knew they were open to being manipulated by your ad.</p><h2>Chrome’s “Privacy Sandbox” interest tracker</h2><p><a href=\"https://github.com/WICG/floc\">The plan to&nbsp;kill cookies</a> is still a bit fuzzy since none of this exists yet. But generally, Google wants to build a machine-learning-powered tracking system into Chrome that groups people into various interest groups like \"classical music lovers\" rather than building individual profiles of people. Then, when it's time to serve ads, Chrome can serve up a list of your interests and pull in relevant ads. It's all the same ad relevance but without any personally identifying info going up to the cloud.</p><p>I think a good way of explaining this was that, before, through cookies, you would end up sending personal information and detailed browser history to various web ad servers, which could then build an ad interest file on you in the cloud. Now, the goal is that Chrome will keep that detailed information locally and build that ad interest profile locally, and only the interest profile would be shipped to the advertisers for relevant ads through an <a href=\"https://github.com/google/ads-privacy/blob/master/proposals/FLoC/FLOC-Whitepaper-Google.pdf\">open API</a>. Again, this is all very early and only in the experimental stage right now, so there's not an abundance of concrete detail to go into.</p><p>Google thinks this solution will be good enough to continue to make <a href=\"https://www.statista.com/statistics/266249/advertising-revenue-of-google/#:~:text=In%202020%2C%20Google's%20ad%20revenue,and%20apps)%20to%20web%20users.\">almost $150 billion</a> in ad money per year, even if it stops tracking individuals. The new setup is also a valuable weapon in the war against government regulators, who did get a shout-out in Google's blog post. The company wrote that, while other ad agencies might build new individual user-tracking technologies, \"We don’t believe these solutions will meet rising consumer expectations for privacy, nor will they stand up to rapidly evolving regulatory restrictions, and therefore aren’t a sustainable long-term investment. Instead, our web products will be powered by&nbsp;privacy-preserving APIs&nbsp;which prevent individual tracking while still delivering results for advertisers and publishers.\"</p></div></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0e0b848d64cde88e225ed3632b2e8a6b04bcdcc7f16b6a05d9068c292b95c7ed","category":"Tech"}