{"title":"Johnson & Johnson’s vaccine safe and effective, FDA review concludes","link":"https://arstechnica.com/?p=1744836","date":1614187311000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Green light —</h4><h2 itemprop=\"description\">An advisory committee for the agency will further review the vaccine this Friday.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/08/GettyImages-1170407888-800x533.jpg\" alt=\"A sign at the Johnson &amp; Johnson campus on August 26, 2019 in Irvine, California. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/08/GettyImages-1170407888.jpg\" data-height=\"3648\" data-width=\"5472\">Enlarge</a> <span>/</span> A sign at the Johnson &amp; Johnson campus on August 26, 2019 in Irvine, California.</p></figcaption></figure><p>Johnson &amp; Johnson’s single-shot COVID-19 vaccine is effective and has a “favorable safety profile,” according to scientists at the Food and Drug Administration.</p><p><a href=\"https://www.fda.gov/media/146217/download\">The endorsement</a> comes out of a review released by the regulatory agency Wednesday. The FDA has been looking over data on Johnson &amp; Johnson’s vaccine since February 4, when the company applied for Emergency Use Authorization. The agency’s green light is a positive sign ahead of this Friday, February 26, when the FDA will convene an advisory committee to make a recommendation on whether the FDA should grant the EUA. The FDA isn’t obligated to follow the committee’s recommendation, but it usually does.</p><p>If Johnson &amp; Johnson’s vaccine is granted an EUA, it will become the third COVID-19 vaccine available for use in the US. The other two vaccines are both two-dose, mRNA-based vaccines, one made by Pfizer and its German partner BioNTech&nbsp;and the other from Moderna, which developed its vaccine in collaboration with researchers at the US National Institutes of Health.</p><p>According to data from a Phase III clinical trial involving more than 44,000 participants, Johnson &amp; Johnson’s vaccine is less effective than the two mRNA vaccines, which were both around 95 percent effective at preventing symptomatic COVID-19. Johnson &amp; Johnson’s vaccine was found to be 66 percent effective overall at preventing moderate to severe COVID-19. However, efficacy differed based on the trial’s location sites, with efficacy found to be 72 percent in the United States, 66 percent in Latin America, and 57 percent in South Africa. The differences may be partly explained by the circulation of variants in Latin America and South Africa, which have been found to reduce the efficacy of vaccines.</p><h2>Favorable review</h2><p>But overall, Johnson &amp; Johnson’s vaccine was 85 percent effective against severe COVID-19. Even in South Africa, the vaccine was 82 percent effective against severe and critical COVID-19, according to the FDA’s review.</p><p>After the shot, six vaccinated participants and 42 participants who received the placebo were hospitalized. When researchers looked out 28 days after vaccination, zero vaccinated participants were hospitalized, compared with 16 in the placebo group. There were seven deaths in the trial, but all were in the placebo.</p><p>Though the efficacy numbers are lower than the mRNA vaccines, experts spotlight the high efficacy against severe disease and death—the most critical functions of any vaccine. Moreover, Johnson &amp; Johnson’s vaccine has clear logistical advantages over the other vaccines. It is only one shot, rather than two, and it also doesn’t require freezer temperatures during shipping.</p><p>In terms of side effects, the FDA found that the vaccine has a favorable safety profile, with no specific safety concerns and the most common effects being mild to moderate pain at the injection site, headache, fatigue, and myalgia.</p><p>The fate of the vaccine now moves to the FDA advisory committee, which will dive deeper into all the data. If the FDA grants the EUA, Johnson &amp; Johnson’s executive said in congressional testimony this week that the company would provide 4 million doses after the EUA, with a total of 20 million ready by the end of March and a total of 100 million by the end of June.</p></div></div>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0e31f589a58f5b7821457e1a817332f683fc189fc4d761fb1bbb93792371571a","category":"Tech"}