{"title":"Scott Sunderland announced as race director for Wollongong Worlds","link":"https://cyclingtips.com/2021/11/scott-sunderland-announced-as-race-director-for-wollongong-worlds/","date":1638303060000,"content":"<div><div><p>Former Australian pro Scott Sunderland has been appointed race director for the 2022 Road World Championships in Wollongong, Australia.</p><p>Sunderland, who raced as a professional for <a href=\"https://cyclingtips.com/2013/04/where-are-they-now-scott-sunderland/\" target=\"_blank\">more than a decade</a> through the 1990s and early 2000s, is the current race director for Flanders Classics races, the Cadel Evans Great Ocean Road Race, and Ride London. He said it was an honour to be appointed to the Wollongong 2022 team.</p><p>“The championships are a prestigious event for many professional riders who strive to win that coveted rainbow jersey,” he said. “I’m enthusiastic about supporting the development of a course that is challenging, exciting and will create unforgettable memories for athletes and spectators alike. </p><p>“We have a rich landscape on the east coast of Australia, particularly in Wollongong where the escarpment meets the quintessential white sand beaches. I’m sure the riders, officials, fans and media will be surprised by the racing that unfolds against this spectacular backdrop. </p><p>“I’m a proud Australian for being given the chance to create a lasting legacy for Wollongong and surrounds through this event, while inspiring future generations in Australia, it’s wonderful.” </p><p>Sunderland will be joined on the Wollongong 2022 organising committee by fellow former Aussie pro, Mark Renshaw. Regarded as <a href=\"https://cyclingtips.com/2019/09/the-best-lead-out-man-ever-a-tribute-to-the-career-of-mark-renshaw/\" target=\"_blank\">one of the sport’s greatest-ever lead-out men</a>, Renshaw will be the event’s safety manager in what is his first role as a race official. In the words of event organisers, “Mark’s appointment as safety manager leverages his experience at the pointy end of race finishes to support the UCI  and Wollongong 2022’s commitment to race safety.”</p><p>“I’m really grateful for the opportunity to be involved with the 2022 UCI Road World Championships in Wollongong,” Renshaw said, “and I look forward to using my 16 years of racing experience to bring the perspective of the rider to the preparations for this event.”</p><p>The <a href=\"https://wollongong2022.com.au/\" target=\"_blank\">Wollongong Road World Championships</a> will be held from September 18-25, 2022. Courses for the event are expected to be revealed in the coming weeks.</p></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0ead084d68bd98d46415f1f7e6492dd46ae9ac0ba9adee44f087211c0fc8a9fa","category":"Cycling"}