{"title":"Apple 'Surprised' By Developer Frustration With Its App Review Process","link":"https://www.macrumors.com/2021/03/22/apple-surprised-developer-concerns-app-review/","date":1616411488000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/22/apple-surprised-developer-concerns-app-review/\"><p>Apple has told Australia's competition watchdog that it's \"surprised\" to hear that some developers have concerns over the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> and the process in which apps are reviewed, rejected, or approved for distribution on the platform.</p><p><img alt=\"appstore\" width=\"2000\" height=\"1032\" src=\"https://images.macrumors.com/t/XyvRcZPIoWZcqWJKshyWw9crqn8=/400x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy\" data-src=\"https://images.macrumors.com/t/XyvRcZPIoWZcqWJKshyWw9crqn8=/400x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/XyvRcZPIoWZcqWJKshyWw9crqn8=/400x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy 400w,https://images.macrumors.com/t/9wSP_e8gFBBM8r9pbfvocpUDcRs=/800x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy 800w,https://images.macrumors.com/t/87-geFpXfhycYKNU8cs1hNWvxOs=/1600x0/filters:quality(90)/article-new/2020/03/appstore.jpg 1600w,https://images.macrumors.com/t/gZWZEY0g2uffob2DbUaMBLOcnPw=/2500x0/filters:no_upscale():quality(90)/article-new/2020/03/appstore.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/XyvRcZPIoWZcqWJKshyWw9crqn8=/400x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy 400w,https://images.macrumors.com/t/9wSP_e8gFBBM8r9pbfvocpUDcRs=/800x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy 800w,https://images.macrumors.com/t/87-geFpXfhycYKNU8cs1hNWvxOs=/1600x0/filters:quality(90)/article-new/2020/03/appstore.jpg 1600w,https://images.macrumors.com/t/gZWZEY0g2uffob2DbUaMBLOcnPw=/2500x0/filters:no_upscale():quality(90)/article-new/2020/03/appstore.jpg 2500w\"></p><p>In September of last year, the Australian Competition and Consumer Commission (ACCC) <a href=\"https://www.macrumors.com/2020/09/08/australia-opens-antitrust-inquiry-into-app-store/\">launched an investigation</a> into Apple's ‌App Store‌ and Google's Play Store to examine the experiences of consumers, suppliers, and developers in Australia.</p><p>The commission is set to release an interim report of its findings based on customer and developers' submissions on <a href=\"https://www.accc.gov.au/focus-areas/inquiries-ongoing/digital-platform-services-inquiry-2020-2025/march-2021-interim-report\">March 31</a>. In an apparent last-ditch effort to ease concerns highlighted in the report, Apple has provided the commission with some more information surrounding its ‌App Store‌ and App Review Process.</p><p>In a <a href=\"https://www.accc.gov.au/system/files/DPB%20-%20March%202021%20Report%20-%20Submission%20-%20Apple%20-%208%20March%202021%20-%20PUBLIC%20FOR%20PUBLISHING.pdf\">submission</a> to the commission, Apple says that it's \"surprised to hear that developers have legitimate concerns about their ability to engage with Apple in the app review process,\" and that it \"invests significant time and resources in engaging with developers directly\" to ensure the quality of apps on the platform.</p><p>Apple lays out in detail the process of how apps are reviewed for distribution on the store. It says the app review system is a \"human-led process\" and that all human reviewers ensure that apps \"are reliable, perform as expected, respect user privacy, and are free of objectionable content.\"</p><p>Throughout the years, Apple has sped up how long apps submitted to the platform are under review. According to Apple, 73% of prospective apps submitted by developers to the platform are now reviewed within 24 hours, and at the end, a final verdict is delivered to developers on whether the app is approved or rejected.</p><p>If an app is rejected, Apple says it provides the developer with information on the reason for the rejection, and says that the app makers have an opportunity to \"correspond with the Apple team member who reviewed the app.\" Furthermore, developers have a chance to appeal a rejection to the ‌App Store‌ Review Board.</p><p>Targeting concerns that Apple exploits the app review process to maintain a dominant position in certain areas, or categories for apps, Apple says its goal is to protect consumers from \"fraudulent, non-functioning, malicious or scam apps.\" Central to the review process is the protection of consumers' privacy and security, according to Apple.</p><blockquote><p>Developers also have the option to make a formal appeal to the ‌App Store‌ Review Board. This is comprised of senior app reviewers with a high degree of experience in reviewing apps. The Board will review the app afresh and provide the developer with their response.</p><p>The main purpose of the App Review process is to protect consumers from fraudulent, non-functioning, malicious or scam apps. Central to the App Review process is the protection of our consumers' privacy and security. That is why the App Review process is iterative and some apps may require multiple rounds of submission before Apple is satisfied the app meets all of the Guidelines.</p></blockquote><p>The ACCC investigation will include submissions from Australian developers about their disapproval of the app review process or how they think they've been mistreated by the Cupertino-based tech giant. Apple rejects that sentiment, however, saying that Australian developers work directly with its Australian Developer Relations team to offer support and guidance on matters such as developing, designing, and maintaining apps.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/19/handy-iphone-shortcuts/\">Handy iPhone and iPad Shortcuts You Should Check Out</a></h3><p>Friday March 19, 2021 12:31 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of iOS 13, Apple introduced Shortcuts support and the Shortcuts app, adding a whole range of new functionality to the iPhone. Shortcuts have continued to be popular since their debut, and in iOS 14, the addition of Home screen widgets made it even easier to get to your Shortcuts, so we thought we'd round up some of our most useful Shortcut options for iPhone and iPad. Subscribe ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/19/apple-stops-signing-ios-14-4-1/\">Apple Stops Signing iOS 14.4 Following Release of iOS 14.4.1</a></h3><p>Friday March 19, 2021 1:23 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Following the release of iOS 14.4.1 on March 8, Apple has stopped signing iOS 14.4, the previous version of iOS 14. With the software no longer being signed, it is no longer possible to downgrade from iOS 14.4.1 to iOS 14.4 if you've already upgraded your iPhone or iPad. Apple routinely stops signing older versions of software updates after new releases come out in order to encourage...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/20/apple-brazil-fine-iphone-charger/\">Apple Fined $2 Million in Brazil for Selling iPhones Without Chargers</a></h3><p>Saturday March 20, 2021 8:04 am PDT by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple has been slapped with a near $2 million fine in the Brazilian state of São Paulo over violations of the Consumer Law Code due to the lack of a charger in the box for newer iPhones, Brazilian tech news outlet Tilt reports. Procon-SP, São Paulo's consumer protection agency, decided to fine Apple following intense scrutiny over the decision to remove the power adapter from the boxes of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/18/intel-anti-dongle-m1-mac-ad/\">Intel Dunks on Apple's Dongles in Continued Anti-M1 Mac Campaign</a></h3><p>Thursday March 18, 2021 10:05 am PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Intel is continuing its anti-Apple ad campaign, today sharing a tweet that calls out the lack of ports on M1 Macs. In a photo, actor Justin Long sits on a couch with a Windows PC and holds up a handful of Apple dongles. Anyone know who these belong to? #GoPC pic.twitter.com/W6wCfMSEb8— Intel (@intel) March 18, 2021 Apple's Macs have long been derided for their lack of ports and the need to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/18/apple-event-april-rumor-recap/\">Apple Event in April? Recapping the Latest iPad Pro, AirPods, and AirTags Rumors</a></h3><p>It's been a whirlwind of a month for Apple rumors. First, we heard from leaker Jon Prosser that an Apple Event was planned for March 16, but that was ruled out by Bloomberg's Mark Gurman. Once that date passed, Prosser and other leakers then suggested there would be an Apple Event on March 23, which is seemingly not happening either. With attention now shifting to April, we've put together...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/20/top-stories-thunderbolt-ipad-pro/\">Top Stories: iPad Pro With Thunderbolt?, Intel Mocks M1 Macs, iMac Pro Officially Discontinued</a></h3><p>We're past the halfway point of March with no sign of an Apple media event, but that doesn't mean we won't be seeing an event or simply some product launches via press release in the coming weeks, as rumors of upcoming products continue to circulate. Subscribe to the MacRumors YouTube channel for more videos. Perhaps the biggest news topic this week was Justin Long of Apple's \"Get a Mac\" ad...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/20/512gb-1tb-ssd-imac-21-discontinued/\">Apple Discontinues 512GB and 1TB SSD Configurations of 4K 21.5-inch iMac</a></h3><p>Saturday March 20, 2021 8:15 am PDT by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Just hours after officially discontinuing the iMac Pro, Apple has also discontinued the 512GB and 1TB SSD configurations of the 4K 21.5-inch iMac. Last month, both options became unavailable for purchase, although it was unclear at the time whether it was a temporary issue due to a component supply problem or if it was a permanent decision to no longer offer the options. Apple has now...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/18/apple-launches-pc-vs-mac-comparison-website/\">Intel Launches Heavily Biased 'PC vs. Mac' Comparison Website</a></h3><p>Thursday March 18, 2021 11:56 am PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>As part of its barrage of attacks against M1 Macs, Intel this week launched a \"PC vs. Mac\" website that's biased heavily in favor of PC machines that are equipped with Intel chips and that makes questionable claims about Apple's M1 Mac lineup. Intel's website says that Apple's M1 Mac benchmarks don't \"translate to real-world usage\" and that when compared to PCs with 11th-Generation Intel...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/20/apple-vs-epic-trial-tim-cook-scott-forstall/\">Tim Cook, Craig Federighi, Phil Schiller and Scott Forstall to Testify in Epic v. Apple Trial</a></h3><p>Friday March 19, 2021 9:49 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today submitted its witness list for its upcoming bench trial with Epic Games, and several Apple executives will be testifying, including Apple CEO Tim Cook, Apple Fellow Phil Schiller, and Apple Senior Vice President of Software Engineering Craig Federighi. Cook will be directly examined for one hour, with a one hour cross examination also included. Federighi will testify for two...</p></div></div></div>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0eca888e6cd68559079350e0522ec41a452a2a07a6dc6ceac952bd58fc94ce31","category":"Apple"}