{"title":"Building A Discord Bot Using Discord.js","link":"https://smashingmagazine.com/2021/02/building-discord-bot-discordjs/","date":1614254400000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"article__content\"><div><div><figure role=\"presentation\"><a href=\"https://www.smashingmagazine.com/author/subha-chanda\"><div><picture><source type=\"image/avif\" srcset=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fc3d445f-58b1-4882-8264-69e037d75b72/subha-chanda-200x200.avif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b604ba55-3400-4ffe-9693-44544fb20bea/subha-chanda-200x200.jpg\" loading=\"eager\" width=\"100\" height=\"100\" alt=\"Subha Chanda\"></picture></div></a></figure></div><div id=\"author__desc\"><p>Subha is a freelance web developer and a learner who is always passionate about learning and experimenting with new things. He loves to write about his new … <a href=\"https://www.smashingmagazine.com/author/subha-chanda\">More about Subha ↬</a></p></div></div><p><section aria-label=\"quick summary\">An introduction to building a Discord bot using the Discord.js module. The bot will share random jokes, assign or revoke user roles, and post tweets of a specific account to a Discord channel.</section></p><p>Team communication platforms are getting popular day by day, as more and more people work from home. Slack and Discord are two of the most popular team communication platforms. While Discord is focused on gamers, some functionality, such as the ability to add up to 50 members in the voice call room, make it an excellent alternative to Slack. One of the most significant advantages of using such a platform is that many <strong>tasks can be automated</strong> using bots.</p><p>In this article, <strong>we’ll build a bot from scratch</strong> using JavaScript and with help from Discord.js. We’ll cover the process from building the bot up to deploying it to the cloud. Before building our bot, let’s jot down the functionality that our bot will have:</p><ul><li>Share random jokes from an array of jokes.</li><li>Add and remove user roles by selecting emoji.</li><li>Share tweets from a particular account to a particular channel.</li></ul><p>Because the Discord.js module is based on Node.js, I’ll assume that you are somewhat familiar with Node.js and npm. Familiarity with JavaScript is a must for this article.</p><p>Now that we know the prerequisites and our goal, let’s start. And if you want to clone and explore the code right away, you can with <a href=\"https://github.com/nemo0/SmashingBot\">the GitHub repository</a>.</p><h3 id=\"steps-to-follow\">Steps To Follow</h3><p>We will be building the bot by following a few steps.</p><p><strong>First, we’ll build a Discord server</strong>. A Discord server is like a group in which you can assign various topics to various channels, very similar to a Slack server. A major difference between Slack and Discord is that Slack requires different login credentials to access different servers, whereas in Discord you can access all of the servers that you are part of with a single authentication.</p><p>The reason we need to create a server is that, without admin privileges for a server, we won’t be able to add a bot to the server. Once our server is created, we will add the bot to the server and get the access token from Discord’s developer portal. This token allows us to communicate with the Discord API. Discord provides an official open API for us to interact with. The API can be used for anything from serving requests for bots to integrating OAuth. The API supports everything from a single-server bot all the way up to a bot that can be integrated on hundreds of servers. It is very powerful and can be implemented in a lot of ways.</p><p>The Discord.js library will help us to communicate with the Discord API using the <strong>access token</strong>. All of the functions will be based on the Discord API. Then, we can start coding our bot. We will start by writing small bits of code that will introduce us to the Discord API and the Discord.js library. We will then understand the concept of partials in Discord.js. Once we understand partials, we’ll add what’s known as a “reaction role” system to the bot. With that done, we will also know how to communicate with Twitter using an npm package called <code>twit</code>. This npm package will help us to integrate the Twitter tweet-forwarding functionality. Finally, we will deploy it to the cloud using Heroku.</p><p>Now that we know how we are going to build our bot, let’s start working on it.</p><h3 id=\"building-a-discord-server\">Building A Discord Server</h3><p>The first thing we have to do is <strong>create a Discord server</strong>. Without a server with admin privileges, we won’t be able to integrate the bot.</p><p>Building a Discord server is easy, and Discord now provides templates, which make it even easier. Follow the steps below, and your Discord server will be ready. First, we’ll choose how we are going to access the Discord portal. We can use either the web version or the app. Both work the same way. We’ll use the web version for this tutorial.</p><p>If you’re reading this article, I’ll assume that you already have a Discord account. If not, just create an account as you would on any other website. Click the “Login” button in the top right, and log in if you have an account, or click the “Register” button. Fill out the simple form, complete the Captcha, and you will have successfully created an account. After opening the Discord app or website, click the plus icon on the left side, where the server list is. When you click it, you’ll be prompted to choose a template or to create your own.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c56733d0-e2c0-453d-81c0-a549ed28ee3d/1-building-discord-bot-discordjs.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"417\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c56733d0-e2c0-453d-81c0-a549ed28ee3d/1-building-discord-bot-discordjs.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c56733d0-e2c0-453d-81c0-a549ed28ee3d/1-building-discord-bot-discordjs.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c56733d0-e2c0-453d-81c0-a549ed28ee3d/1-building-discord-bot-discordjs.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c56733d0-e2c0-453d-81c0-a549ed28ee3d/1-building-discord-bot-discordjs.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c56733d0-e2c0-453d-81c0-a549ed28ee3d/1-building-discord-bot-discordjs.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c56733d0-e2c0-453d-81c0-a549ed28ee3d/1-building-discord-bot-discordjs.png\" sizes=\"100vw\" alt=\"Creating a server from a template or from scratch in Discord\"></a><figcaption>Creating a server in Discord (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c56733d0-e2c0-453d-81c0-a549ed28ee3d/1-building-discord-bot-discordjs.png\">Large preview</a>)</figcaption></figure><p>We’ll choose the “Create My Own” option. Let’s skip the next question. We’ll call our Discord server “Smashing Example”. You may also provide a photo for your server. Clicking the “Create” button will create your server.</p><h3 id=\"registering-the-bot-with-discord\">Registering the Bot With Discord</h3><p>Before coding the bot, we need to <strong>get a token provided by Discord</strong>. This token will establish a connection from our code to Discord. To get the token, we have to register our bot with our server. To register the bot, we have to visit <a href=\"https://discord.com/developers/applications\">Discord’s developer portal</a>. If you are building a Discord app for the first time, you’ll find an empty list there. To register our app, click on the “New Application” link in the top-right corner. Give your application a name, and click the “Create” button. We’ll name our app “Smashing App”.</p><figure><p><iframe loading=\"lazy\" data-src=\"https://player.vimeo.com/video/509933655\" title=\"vimeo video\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\" src=\"https://player.vimeo.com/video/509933655\"></iframe></p><figcaption>Adding a new app to the Discord Developer Portal</figcaption></figure><p>The new menu gives us some options. On the right side is an option labelled “Bot”. Click it, and select “Add Bot”. Click the confirmation, change the name of the bot if you want, save the changes, and copy the token received from this page. Our bot is now registered with Discord. We can start adding functionality and coding the bot.</p><h3 id=\"building-the-bot\">Building The Bot</h3><h4 id=\"what-is-discord-js\">What Is Discord.js?</h4><p><a href=\"https://discord.js.org/\">Discord.js defines itself</a> like so:</p><blockquote>Discord.js is a powerful node.js module that allows you to interact with the Discord API very easily. It takes a much more object-oriented approach than most other JS Discord libraries, making your bot’s code significantly tidier and easier to comprehend.</blockquote><p>So, Discord.js makes interaction with the Discord API much easier. It has 100% coverage with the official Discord API.</p><h4 id=\"initializing-the-bot\">Initializing The Bot</h4><p>Open your favorite text editor, and create a folder in which all of your files will be saved. Open the command-line interface (CLI), <code>cd</code> into the folder, and initialize the folder with npm: <code>npm init -y</code>.</p><p>We will need <strong>two packages</strong> to start building the bot. The first is dotenv, and the second, obviously, is the Discord.js Node.js module. If you are familiar with Node.js, then you’ll be familiar with the dotenv package. It loads the environment variables from a file named <code>.env</code> to <code>process.env</code>.</p><p>Install these two using <code>npm i dotenv discord.js</code>.</p><p>Once the installation is complete, <strong>create two files</strong> in your root folder. Name one of the files <code>.env</code>. Name the other main file whatever you want. I’ll name it <code>app.js</code>. The folder structure will look like this:</p><p>We’ll store tokens and other sensitive information in the <code>.env</code> file, and store the code that produces the results in the <code>app.js</code> file.</p><p>Open the <code>.env</code> file, and create a new variable. Let’s name the variable <code>BOT_TOKEN</code> for this example. Paste your token in this file. The <code>.env</code> file will look similar to this now:</p><p>We can start working on the <code>app.js</code> file. The first thing to do is to require the modules that we installed.</p><p>The <code>dotenv</code> module is initialized using the <code>config()</code> method. We can pass in parameters to the <code>config()</code> method. But because this is a very simple use of the dotenv module, we don’t need any special function from it.</p><p>To start using the Discord.js module, we have to initialize a constructor. This is shown in the documentation:</p><p>The Discord.js module provides a method named <code>client.on</code>. The <code>client.on</code> method listens for various events. The Discord.js library is <strong>event-based</strong>, meaning that every time an event is emitted from Discord, the functionality attached to that event will be invoked.</p><p>The first event we will listen for is the <code>ready</code> event. This method will fire up when the connection with the Discord API is ready. In this method, we can pass in functions that will be executed when a connection is established between the Discord API and our app. Let’s pass a <code>console.log</code> statement in this method, so that we can know whether a connection is established. The <code>client.on</code> method with the <code>ready</code> event will look like this:</p><p>But, this won’t establish a connection with the API because we haven’t logged into the bot with the Discord server. To enable this, the Discord.js module provides a <code>login</code> method. By using the <code>login</code> method available on the client and passing the token in this method, we can log into the app with the Discord server.</p><p>If you start the app now — with <code>node app.js</code> or, if you are using nodemon, then with <code>nodemon app.js</code> — you will be able to see the console message that you defined. Our bot has successfully logged in with the Discord server now. We can start experimenting with some functionality.</p><p>Let’s start by getting some message content depending on the code.</p><h4 id=\"the-message-event\">The <code>message</code> Event</h4><p>The <code>message</code> event listens for some message. Using the <code>reply</code> method, we can program the bot to reply according to the user’s message.</p><p>This example code will reply with a “Hi” whenever a “Hello” message is received. But in order to make this work, we have to connect the bot with a server.</p><h4 id=\"connecting-the-bot-with-a-discord-server\">Connecting The Bot With A Discord Server</h4><p>Up to this point, the bot is not connected with any server. To connect with our server (<em>Smashing Example</em>), visit <a href=\"https://discord.com/developers/docs\">Discord’s developer portal</a>. Click on the name of the app that we created earlier in this tutorial (in our case, “Smashing App”). Select the app, and click on the “OAuth2” option in the menu. You’ll find a group named “Scopes”. Check the “bot” checkbox, and copy the URL that is generated.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f07a3cf0-67c3-4e42-8698-b240c64f02ae/2-building-discord-bot-discordjs.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"416\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f07a3cf0-67c3-4e42-8698-b240c64f02ae/2-building-discord-bot-discordjs.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f07a3cf0-67c3-4e42-8698-b240c64f02ae/2-building-discord-bot-discordjs.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f07a3cf0-67c3-4e42-8698-b240c64f02ae/2-building-discord-bot-discordjs.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f07a3cf0-67c3-4e42-8698-b240c64f02ae/2-building-discord-bot-discordjs.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f07a3cf0-67c3-4e42-8698-b240c64f02ae/2-building-discord-bot-discordjs.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f07a3cf0-67c3-4e42-8698-b240c64f02ae/2-building-discord-bot-discordjs.png\" sizes=\"100vw\" alt=\"Connecting the bot with the Discord server\"></a><figcaption>OAuth for bot (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f07a3cf0-67c3-4e42-8698-b240c64f02ae/2-building-discord-bot-discordjs.png\">Large preview</a>)</figcaption></figure><p>Visit this URL in a new tab, choose your server, and click on “Authorize”. Complete the Captcha, and our bot will now be connected with the server that we chose.</p><p>If you visit the Discord server now, you will see that a notification has already been sent by Discord, and the bot is now also showing up in the members’ list on the right side.</p><h4 id=\"adding-functionality-to-the-bot\">Adding Functionality to the Bot</h4><p>Now that our bot is connected with the server, if you send a “Hello” to the server, the bot will reply with a “Hi”. This is just an introduction to the Discord API. The real fun is about to start.</p><p>To familiarize ourselves a bit more with the Discord.js module, let’s add functionality that sends a joke whenever a particular command is received. This is similar to what we have just done.</p><h3 id=\"adding-a-random-joke-function-to-the-bot\">Adding A Random Joke Function To The Bot</h3><p>To make this part clearer and easier to understand, we aren’t going to use any APIs. The jokes that our bot will return will be a simple array. A random number will be generated each time within the range of the array, and that specific location of the array will be accessed to return a joke.</p><p>In case you have ever used functionality provided by a bot in Discord, you might have noticed that some <strong>special character</strong> distinguishes normal messages from special commands. I am going to use a <code>?</code> in front of our commands to make them look different than normal messages. So, our joke command will be <code>?joke</code>.</p><p>We will create an array named <code>jokes</code> in our <code>app.js</code> file. The way we will get a random joke from the array is by using this formula:</p><p>The <code>Math.random() * jokes.length</code> formula will generate a random number within the range of the array. The <code>Math.floor</code> method will floor the number that is generated.</p><p>If you <code>console.log()</code> this, <code>Math.floor(Math.random() * jokes.length)</code>, you’ll get a better understanding. Finally, <code>jokes[]</code> will give us a random joke from the <code>jokes</code> array.</p><p>You might have noticed that our first code was used to reply to our message. But we don’t want to get a reply here. Rather, we want to get a joke as a message, without tagging anyone. For this, the Discord.js module has a method named <code>channel.send()</code>. Using this method, we can send messages to the channel where the command was called. So, the complete code up to this point looks like this:</p><p>I have removed the “Hello”/“Hi” part of the code because that is of no use to us anymore.</p><p>Now that you have a basic understanding of the Discord.js module, let’s go deeper. But the module can do a lot more — for example, <strong>adding roles</strong> to a person or banning them or kicking them out. For now, we will be building a simple reaction-role system.</p><h3 id=\"building-a-reaction-role-system\">Building A Reaction-Role System</h3><p>Whenever a user responds with a special emoji in a particular message or channel, a role tied to that emoji will be given to the user. The implementation will be very simple. But before building this reaction-role system, we have to understand partials.</p><h4 id=\"partials\">Partials</h4><p>Partial is a Discord.js concept. Discord.js usually caches all messages, which means that it stores messages in a collection. When a cached message receives some event, like getting a message or a reply, an event is emitted. But messages sent before the bot has started are uncached. So, reacting to such instances will not emit any event, unless we fetch them before we use them. Version 12 of the Discord.js library introduces the concept of partials. If we want to <strong>capture such uncached events</strong>, we have to opt in to partials. The library has five types of partials:</p><ol><li><code>USER</code></li><li><code>CHANNEL</code></li><li><code>GUILD_MEMBER</code></li><li><code>MESSAGE</code></li><li><code>REACTION</code></li></ol><p>In our case, we will need only three types of partials:</p><ul><li><code>USER</code>, the person who reacts;</li><li><code>MESSAGE</code>, the message being reacted to;</li><li><code>REACTION</code>, the reaction given by the user to the message.</li></ul><p>The documentation has <a href=\"https://github.com/discordjs/discord.js/blob/master/docs/topics/partials.md#:~:text=Partials%20allow%20you%20to%20receive,js%20would%20discard%20the%20event.\">more about partials</a>.</p><p>The Discord.js library provides a very easy way to use partials. We just need to add a single line of code, passing an object in the <code>Discord.Client()</code> constructor. The new constructor looks like this:</p><h4 id=\"creating-roles-on-the-discord-server\">Creating Roles On The Discord Server</h4><p>To enable the reaction-role system, we have to create some roles. The first role we are going to create is the <strong>bot role</strong>. To create a role, go to “Server Settings”:</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b324885-abd1-48cf-bb8f-b16ec5a5f356/3-building-discord-bot-discordjs.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"433\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b324885-abd1-48cf-bb8f-b16ec5a5f356/3-building-discord-bot-discordjs.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b324885-abd1-48cf-bb8f-b16ec5a5f356/3-building-discord-bot-discordjs.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b324885-abd1-48cf-bb8f-b16ec5a5f356/3-building-discord-bot-discordjs.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b324885-abd1-48cf-bb8f-b16ec5a5f356/3-building-discord-bot-discordjs.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b324885-abd1-48cf-bb8f-b16ec5a5f356/3-building-discord-bot-discordjs.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b324885-abd1-48cf-bb8f-b16ec5a5f356/3-building-discord-bot-discordjs.png\" sizes=\"100vw\" alt=\"Open server settings to create roles\"></a><figcaption>Server settings option (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7b324885-abd1-48cf-bb8f-b16ec5a5f356/3-building-discord-bot-discordjs.png\">Large preview</a>)</figcaption></figure><p>In the server settings, go to the “Roles” option, and click on the small plus icon (<code>+</code>) beside where it says “Roles”.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a304bdf2-2471-4892-b207-d6472e39a49d/4-building-discord-bot-discordjs.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"416\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a304bdf2-2471-4892-b207-d6472e39a49d/4-building-discord-bot-discordjs.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a304bdf2-2471-4892-b207-d6472e39a49d/4-building-discord-bot-discordjs.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a304bdf2-2471-4892-b207-d6472e39a49d/4-building-discord-bot-discordjs.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a304bdf2-2471-4892-b207-d6472e39a49d/4-building-discord-bot-discordjs.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a304bdf2-2471-4892-b207-d6472e39a49d/4-building-discord-bot-discordjs.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a304bdf2-2471-4892-b207-d6472e39a49d/4-building-discord-bot-discordjs.png\" sizes=\"100vw\" alt=\"Creating roles in Discord\"></a><figcaption>Adding roles (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a304bdf2-2471-4892-b207-d6472e39a49d/4-building-discord-bot-discordjs.png\">Large preview</a>)</figcaption></figure><p>First, let’s create the <code>bot</code> role, and make sure to check the “Manage Roles” option in the role options menu. Once the <code>bot</code> role is created, you can add some more roles. I’ve added <code>js</code>, <code>c++</code>, and <code>python</code> roles. You don’t have to give them any special ability, but it’s an option.</p><p>Here, remember one thing: The <strong>Discord roles work based on priority</strong>. Any role that has roles below it can manage the roles below it, but it can’t manage the roles above it. We want our bot role to manage the <code>js</code>, <code>c++</code>, and <code>python</code> roles. So, make sure that the <code>bot</code> role is above the other roles. Simply drag and drop to change the order of the roles in the “Roles” menu of your server settings.</p><p>When you are done creating roles, <strong>assign the <code>bot</code> role to the bot</strong>. To give a role, click on the bot’s name in the members’ list on the server’s right side, and then click on the small plus icon (<code>+</code>). It’ll show you all of the available roles. Select the “bot” role here, and you will be done.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2551a38d-3d1b-4df9-9ec2-a95afabbd487/5-building-discord-bot-discordjs.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"435\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2551a38d-3d1b-4df9-9ec2-a95afabbd487/5-building-discord-bot-discordjs.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2551a38d-3d1b-4df9-9ec2-a95afabbd487/5-building-discord-bot-discordjs.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2551a38d-3d1b-4df9-9ec2-a95afabbd487/5-building-discord-bot-discordjs.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2551a38d-3d1b-4df9-9ec2-a95afabbd487/5-building-discord-bot-discordjs.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2551a38d-3d1b-4df9-9ec2-a95afabbd487/5-building-discord-bot-discordjs.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2551a38d-3d1b-4df9-9ec2-a95afabbd487/5-building-discord-bot-discordjs.png\" sizes=\"100vw\" alt=\"Assigning roles manually\"></a><figcaption>Assinging roles (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2551a38d-3d1b-4df9-9ec2-a95afabbd487/5-building-discord-bot-discordjs.png\">Large preview</a>)</figcaption></figure><h4 id=\"activating-developer-mode-in-discord\">Activating Developer Mode in Discord</h4><p>The roles we have created cannot be used by their names in our code. In Discord, everything from messages to roles has its own ID. If you click on the “more” indicator in any message, you’ll see an option named “Copy ID”. This option is available for everything in Discord, including roles.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/71c921da-0008-4bc8-9ee4-8b0d6ed99262/6-building-discord-bot-discordjs.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"436\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/71c921da-0008-4bc8-9ee4-8b0d6ed99262/6-building-discord-bot-discordjs.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/71c921da-0008-4bc8-9ee4-8b0d6ed99262/6-building-discord-bot-discordjs.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/71c921da-0008-4bc8-9ee4-8b0d6ed99262/6-building-discord-bot-discordjs.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/71c921da-0008-4bc8-9ee4-8b0d6ed99262/6-building-discord-bot-discordjs.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/71c921da-0008-4bc8-9ee4-8b0d6ed99262/6-building-discord-bot-discordjs.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/71c921da-0008-4bc8-9ee4-8b0d6ed99262/6-building-discord-bot-discordjs.png\" sizes=\"100vw\" alt=\"Copy ID option in Discord\"></a><figcaption>Copy ID in Discord (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/71c921da-0008-4bc8-9ee4-8b0d6ed99262/6-building-discord-bot-discordjs.png\">Large preview</a>)</figcaption></figure><p>Most likely, you won’t find this option by default. You’ll have to activate an option called “Developer Mode”. To activate it, head to the Discord settings (not your server settings), right next to your name in the bottom left. Then go to the “Appearance” option under “App Settings”, and activate “Developer Mode” from here. Now you’ll be able to copy IDs.</p><h4 id=\"messagereactionadd-and-messagereactionremove\"><code>messageReactionAdd</code> and <code>messageReactionRemove</code></h4><p>The event that needs to be emitted when a message is reacted is <code>messageReactionAdd</code>. And whenever a reaction is removed, the <code>messageReactionRemove</code> event should be emitted.</p><p>Let’s continue building the system. As I said, first we need to listen for the <code>messageReactionAdd</code> event. Both the <code>messageReactionAdd</code> and <code>messageReactionRemove</code> events take two parameters in their callback function. The first parameter is <code>reaction</code>, and the second is <code>user</code>. These are pretty self-explanatory.</p><h4 id=\"coding-the-reaction-role-functionality\">Coding the Reaction-Role Functionality</h4><p>First, we’ll create a message that describes which emoji will give which role, something like what I’ve done here:</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4a875920-0139-43be-8295-6ea4f6ba5604/7-building-discord-bot-discordjs.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"434\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4a875920-0139-43be-8295-6ea4f6ba5604/7-building-discord-bot-discordjs.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4a875920-0139-43be-8295-6ea4f6ba5604/7-building-discord-bot-discordjs.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4a875920-0139-43be-8295-6ea4f6ba5604/7-building-discord-bot-discordjs.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4a875920-0139-43be-8295-6ea4f6ba5604/7-building-discord-bot-discordjs.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4a875920-0139-43be-8295-6ea4f6ba5604/7-building-discord-bot-discordjs.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4a875920-0139-43be-8295-6ea4f6ba5604/7-building-discord-bot-discordjs.png\" sizes=\"100vw\" alt=\"The reaction-role message on server\"></a><figcaption>Reaction-role message (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4a875920-0139-43be-8295-6ea4f6ba5604/7-building-discord-bot-discordjs.png\">Large preview</a>)</figcaption></figure><p>You might be thinking, how are we going to use those emoji in our code? The default emoji are Unicode, and we will have to copy the Unicode version. If you follow the syntax <code>\\:emojiName:</code> and hit “Enter”, you will get an emoji with the name. For example, my emoji for the JavaScript role is fox; so, if I type in <code>\\:fox:</code> and hit “Enter” in Discord, I’ll receive a fox emoji. Similarly, I would use <code>\\:tiger:</code> and <code>\\:snake:</code> to get those emoji. Keep these in your Discord setup; we will need them later.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4414c335-84d7-4e84-988e-f230bc3063fd/8-building-discord-bot-discordjs.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4414c335-84d7-4e84-988e-f230bc3063fd/8-building-discord-bot-discordjs.gif\" width=\"800\" height=\"450\" alt=\"Getting Unicode emoji\"></a><figcaption>Getting Unicode emoji (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4414c335-84d7-4e84-988e-f230bc3063fd/8-building-discord-bot-discordjs.gif\">Large preview</a>)</figcaption></figure><p>Here is the starting code. This part of the code simply checks for some edge cases. Once we understand these cases, we’ll implement the logic of the reaction-role system.</p><p>We are passing in an asynchronous function. In the callback, the first thing we are doing is <strong>checking whether the message is a partial</strong>. If it is, then we fetch it, meaning caching or storing it in a JavaScript map method. Similarly, we are checking whether the reaction itself is a partial and then doing the same thing. Then, we check whether the user who reacted is a bot, because we don’t want to assign roles to the bot that is reacting to our messages. Finally, we are checking whether the message is on the server. Discord.js uses <code>guild</code> as an alternative name of the server. If the message is not on the server, then we would stop the function.</p><p>Our bot will only assign the roles if the message is in the <code>roles</code> channel. If you right-click on the <code>roles</code> channel, you’ll see a “Copy ID” option. Copy the ID and follow along.</p><p>Above is the rest of the code in the callback. We are using the <code>reaction.message.channel.id</code> property to get the ID of the channel. Then, we are comparing it with the roles channel ID that we just copied. If it is true, then we check for the emoji and compare them with the reactions. The <code>reaction.emoji.name</code> returns the emoji that was used to react. We compare it with our Unicode version of the emoji. If they match, then we await for the <code>reaction.message.guild.members.cache</code> property.</p><p>The cache is a <strong>collection that stores the data</strong>. These collections are a JavaScript <code>Map</code> with additional utilities. One of the utilities that it provides is the <code>get</code> method. To get anything by ID, we can simply pass in the ID in this method. So, we pass the <code>user.id</code> in the <code>get</code> method to get the user. Finally, the <code>roles.add</code> method adds the role to the user. In the <code>roles.add</code> method, we are passing the role ID. You can find the role ID in your server setting’s “Role” option. Right-clicking on a role will give you the option to copy the role ID. And we are done adding the reaction-role system to our bot!</p><p>We can add functionality for a role to be removed when a user removes their reaction from the message. This is exactly the same as our code above, the only difference being that we are listening for the <code>messageReactionRemove</code> event and using the <code>roles.remove</code> method. So, the complete code for adding and removing roles would be like this:</p><h3 id=\"adding-twitter-forwarding-function\">Adding Twitter Forwarding Function</h3><p>The next function we are going to add to our bot is going to be a bit more challenging. We want to focus on a particular Twitter account, so that any time the Twitter account posts a tweet, it <strong>will be forwarded to our Discord channel</strong>.</p><p>Before starting to code, we will have to get the required tokens from the <a href=\"https://developer.twitter.com/en/portal\">Twitter developer portal</a>. Visit the portal and create a new app by clicking the “Create App” button in the “Overview” option. Give your app a name, copy all of the tokens, and paste them in the <code>.env</code> file of your code, with the proper names. Then click on “App Settings”, and enable the three-legged OAuth feature. Add the URLs below as callback URLs for testing purposes:</p><p>If you own a website, add the address to the website URL and click “Save”. Head over to the “Keys and Tokens” tab, and generate the access keys and tokens. Copy and save them in your <code>.env</code> file. Our work with the Twitter developer portal is done. We can go back to our text editor to continue coding the bot. To achieve the functionality we want, we have to add another npm package named <code>twit</code>. It is a Twitter API client for Node.js. It supports both REST and streaming API.</p><p>First, install the twit package using <code>npm install twit</code>, and require it in your main file:</p><p>We have to create a twit instance using the <code>Twit</code> constructor. Pass in an object in the <code>Twit</code> constructor with all of the tokens that we got from Twitter:</p><p>A <strong>timeout</strong> is also specified here. We want all of the forwards to be in a specific channel. I have created a separate channel called “Twitter forwards”, where all of the tweets will be forwarded. I have already explained how you can create a channel. Create your own channel and copy the ID.</p><p>Now we have to create a stream. A stream API allows access to a stream of data over the network. The data is broken into smaller chunks, and then it is transmitted. Here is our code to stream the data:</p><p>In the <code>follow</code> key, I am specifying <code>@Stupidcounter</code> because it tweets every minute, which is great for our testing purposes. You can provide any Twitter handle’s ID to get its tweets. <a href=\"https://tweeterid.com/\">TweeterID</a> will give you the ID of any handle. Finally, use the <code>stream.on</code> method to get the data and stream it to the desired channel.</p><p>We are listening for the <code>tweet</code> event and, whenever that occurs, passing the tweet to a callback function. We’ll build a custom message; in our case, the message will be:</p><p>Again, we are using the <code>client.channels.cache.get</code> method to get the desired channel and the <code>.send</code> method to send our message. Now, run your bot and wait for a minute. The Twitter message will be sent to the server.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e965a27-da4a-43b8-a957-f5fe8008f942/9-building-discord-bot-discordjs.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"435\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e965a27-da4a-43b8-a957-f5fe8008f942/9-building-discord-bot-discordjs.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e965a27-da4a-43b8-a957-f5fe8008f942/9-building-discord-bot-discordjs.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e965a27-da4a-43b8-a957-f5fe8008f942/9-building-discord-bot-discordjs.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e965a27-da4a-43b8-a957-f5fe8008f942/9-building-discord-bot-discordjs.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e965a27-da4a-43b8-a957-f5fe8008f942/9-building-discord-bot-discordjs.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e965a27-da4a-43b8-a957-f5fe8008f942/9-building-discord-bot-discordjs.png\" sizes=\"100vw\" alt=\"The bot sends the tweet to Discord\"></a><figcaption>Tweets forwarded to Discord (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e965a27-da4a-43b8-a957-f5fe8008f942/9-building-discord-bot-discordjs.png\">Large preview</a>)</figcaption></figure><p>So, here is the complete Twitter forwarding code:</p><p>All of the functions that we want to add are done. The only thing left now is to deploy it to the cloud. We’ll use Heroku for that.</p><h3 id=\"deploying-the-bot-to-heroku\">Deploying The Bot To Heroku</h3><p>First, create a new file in the root directory of your bot code’s folder. Name it <code>Procfile</code>. This <code>Procfile</code> will contain the commands to be executed when the program starts. In the file, we will add <code>worker: node app.js</code>, which will inform Heroku about which file to run at startup.</p><p>After adding the file, let’s initiate a <code>git</code> repository, and push our code to GitHub (how to do so is beyond the scope of this article). One thing I would suggest is to add the <code>node_modules</code> folder and the <code>.env</code> file to the <code>.gitignore</code> file, so that your package size remains small and sensitive information does not get shared outside.</p><p>Once you’ve successfully pushed all of your code to GitHub, visit the <a href=\"https://www.heroku.com/\">Heroku</a> website. Log in, or create an account if you don’t have one already. Click on the “New” button to create a new app, and name it as you wish. Choose the “Deployment Method” as GitHub.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/11d1edfc-2451-486e-ab10-af035d6f90a3/10-building-discord-bot-discordjs.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"404\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/11d1edfc-2451-486e-ab10-af035d6f90a3/10-building-discord-bot-discordjs.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/11d1edfc-2451-486e-ab10-af035d6f90a3/10-building-discord-bot-discordjs.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/11d1edfc-2451-486e-ab10-af035d6f90a3/10-building-discord-bot-discordjs.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/11d1edfc-2451-486e-ab10-af035d6f90a3/10-building-discord-bot-discordjs.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/11d1edfc-2451-486e-ab10-af035d6f90a3/10-building-discord-bot-discordjs.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/11d1edfc-2451-486e-ab10-af035d6f90a3/10-building-discord-bot-discordjs.png\" sizes=\"100vw\" alt=\"Choose GitHub as deployment method\"></a><figcaption>Choose GitHub as the deployment method (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/11d1edfc-2451-486e-ab10-af035d6f90a3/10-building-discord-bot-discordjs.png\">Large preview</a>)</figcaption></figure><p>Search for your app, and click on connect once you find it. Enable automatic deployment from the “Deploy” menu, so that each time you push changes to the code, the code will get deployed automatically to Heroku.</p><p>Now, we have to add the configuration variables to Heroku, which is very easy. Go to the “Settings” option, below your app’s name, and click on “Reveal Config Vars”.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bb1f8f80-c45c-4a53-ad7b-f0cc5c2daa58/11-building-discord-bot-discordjs.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"404\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bb1f8f80-c45c-4a53-ad7b-f0cc5c2daa58/11-building-discord-bot-discordjs.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bb1f8f80-c45c-4a53-ad7b-f0cc5c2daa58/11-building-discord-bot-discordjs.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bb1f8f80-c45c-4a53-ad7b-f0cc5c2daa58/11-building-discord-bot-discordjs.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bb1f8f80-c45c-4a53-ad7b-f0cc5c2daa58/11-building-discord-bot-discordjs.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bb1f8f80-c45c-4a53-ad7b-f0cc5c2daa58/11-building-discord-bot-discordjs.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bb1f8f80-c45c-4a53-ad7b-f0cc5c2daa58/11-building-discord-bot-discordjs.png\" sizes=\"100vw\" alt=\"Revealing and adding configuration variables to Heroku\"></a><figcaption>Config Vars on Heroku (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bb1f8f80-c45c-4a53-ad7b-f0cc5c2daa58/11-building-discord-bot-discordjs.png\">Large preview</a>)</figcaption></figure><p>Here, we’ve added the configuration variables as key-value pairs. Once you are done, go to the “Deploy” tab again, and click on “Deploy Branch” under “Manual Deploy”.</p><p>The last thing to consider is that you might encounter a <strong>60-second error crash</strong> that stops the bot from executing. To prevent this from happening, we have to change the worker type of the app. In Heroku, if you go to the “Resources” tab of your app, you’ll see that, under “Free Dynos”, <code>web npm start</code> is enabled. We have to turn this off and enable <code>worker node app.js</code>. So, click on the edit button beside the <code>web npm start</code> button, turn it off, and enable the <code>worker node app.js</code> option. Confirm the change. Restart all of your dynos, and we are done!</p><h3 id=\"conclusion\">Conclusion</h3><p>I hope you’ve enjoyed reading this article. I tried to cover all of the basics that you need to understand in developing a complicated bot. <a href=\"https://discord.js.org/#/docs/main/stable/general/welcome\">Discord.js’ documentation</a> is a great place to learn more. It has great explanations. Also, you will find all of the code in <a href=\"https://github.com/nemo0/SmashingBot\">the GitHub repository</a>. And here are a few resources that will be helpful in your further development:</p><ul><li><a href=\"https://discord.com/developers/docs/intro\">Documentation</a>, Discord Developer Portal</li><li><a href=\"https://discord.com/invite/discord-api\">Discord API</a> (Discord server)</li><li><a href=\"https://github.com/discordjs/discord.js/blob/master/docs/topics/partials.md\">Partials</a>, Discord.js, GitHub</li><li><a href=\"https://developer.twitter.com/en/portal/dashboard\">Developer Portal</a>, Twitter</li><li><a href=\"https://www.npmjs.com/package/twit\">Twit</a>, package and documentation</li></ul><p><img src=\"https://www.smashingmagazine.com/images/logo/logo--red.png\" alt=\"Smashing Editorial\" width=\"35\" height=\"46\" loading=\"lazy\" decoding=\"async\"> <span>(vf, il, al)</span></p></div></div>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"0f2979ed11894a23650637534dffdb58b1e5f9e200d46ed74bc9d27348f95684","category":"Tech"}