{"title":"An Essential Tool for Capturing Your Career Accomplishments","link":"https://alistapart.com/article/the-career-management-document/","date":1565271920000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Imagine you’re ready to apply for your next job. Like most busy professionals, you probably haven’t updated your résumé or your portfolio since you looked for your current job.&nbsp;</p><p><span>Article Continues Below</span></p><p>Now you need to update both, and you can’t remember what work you’ve done over the past few years. (In fact, you can barely remember what you’ve done over the past few months!)</p><p>So you scramble to update your résumé with new content. Then you spend all weekend scraping together a new portfolio using screenshots of whatever work evidence you can find on your laptop. You submit the résumé and portfolio with your application, hoping you didn’t forget to include any major career milestones you achieved over the last few years.&nbsp;</p><p>This is the process most of us use to approach our job search. We wait until we’re ready to find a job, panic at our lack of résumé and portfolio, and pull together a “good enough” version of each for the job application. (Trust me, I’ve done this many times myself.)</p><p>This is a stressful and ineffective way to approach a job search. There’s a much better approach you can take—and you can start working on it now, even if you’re not on the job market.</p><h2 id=\"section2\"><strong>The Career Management Document</strong><a href=\"#section2\">#section2</a></h2><p>A Career Management Document (CMD) is a comprehensive collection of your résumé and portfolio content. It’s a document you update regularly, over time, with all the work you’ve done.&nbsp;</p><p>When you’re ready to apply for your next job, you’ll have all the résumé and portfolio pieces available in your CMD. All you need to do is assemble those pieces into résumé and portfolio documents, then send the documents off with your job application.</p><p>I update my CMD about once a week. I start by reviewing evidence of my recent work. I review Slack messages, Basecamp posts, emails, and any other current work-related content. I write my accomplishments in the format of résumé bullets, using the <a href=\"https://www.manager-tools.com/2005/10/your-resume-stinks\">framework of responsibilities and accomplishments from this Manager Tools podcast</a>. Then I add those bullets to the CMD.&nbsp;</p><p>Here are some examples from my CMD:</p><ul><li>Coached a student on writing a stronger portfolio story to showcase their advanced UX skills, resulting in the student getting a job interview.</li><li>Facilitated an end-of-study analysis in under 90 minutes to help the team synthesize user research data from 12 participants.</li><li>Led a remote retrospective with teams in two offices, developed actionable takeaways, and ended on time despite a delayed start.</li></ul><p>My CMD has several hundred résumé bullets, and it continues to grow. I organize content by year and by project. Within each project are responsibilities and accomplishments.</p><p>I add any content to the CMD that might go into my résumé someday. I include everything I can think of, even if it seems insignificant or trivial at the time.&nbsp;</p><p>For example, I sometimes help with social media marketing at Center Centre, the UX design school where I’m a faculty member. I include it in my CMD. I don’t plan to pursue social media marketing as a career, but it may be relevant to a future job. Who knows—I may apply to work for an organization that makes social media marketing software someday. In that case, my social media experience could be relevant.</p><h2 id=\"section3\"><strong>Include portfolio artifacts with your CMD</strong><a href=\"#section3\">#section3</a></h2><p>In addition to capturing bullets for my résumé, I capture content for my portfolio. Each week, I gather screenshots of my work, photos of me working with the team, and any other artifacts I can find. I store them in an organized system I can reference later.&nbsp;</p><p>I also take brief notes about the work I did and store them with the artifacts. That way, if I look back at these materials a year from now, I’ll have notes about what I did during the project, reminding me of the details.</p><p>For example, after I facilitated a user research analysis session late last year, I captured evidence of it for my portfolio. I included photos of the whiteboard where I recorded public notes during the session. I also captured brief notes about who attended the session, the date, and when it took place during the project.&nbsp;</p><p>You can use whatever tools you’d like to gather evidence of your work. I use Google Docs for the résumé portion of my CMD. I use Dropbox to store my portfolio artifacts. I create Dropbox folders with dates and project names that correspond to the contents of my CMD.</p><figure id=\"figure1\"><img loading=\"lazy\" width=\"728\" height=\"312\" src=\"https://alistapart.com/wp-content/uploads/2019/08/cmd-screenshot-1.jpg?resize=960%2C412\" alt=\"\"><figcaption><br>Résumé content from my CMD. I wrote about coaching a student on crafting a presentation for her job interview. The highlighted areas are where I left comments reminding me of the details of the work. Note that some of the résumé bullets seem redundant, which is OK. When I create my next résumé, I’ll choose the most appropriate bullets.</figcaption></figure><figure id=\"figure2\"><img loading=\"lazy\" width=\"728\" height=\"398\" src=\"https://alistapart.com/wp-content/uploads/2019/08/cmd-screenshot-2.jpg?resize=960%2C525\" alt=\"\"><figcaption><br>I took notes on a whiteboard while coaching the student. I stored a photo of the whiteboard in Dropbox in a folder named with the date of the work and a description of what I did.</figcaption></figure><p>The key is to collect the evidence regularly and store it in an accessible, organized way that works for you. To know if you’re storing work evidence effectively, ask yourself, “Will I understand this CMD content a year from now based on how I’m capturing and storing it today?” If the answer is “yes,” you’re in good shape.</p><h2 id=\"section4\"><strong>Update your CMD regularly</strong><a href=\"#section4\">#section4</a></h2><p>For the CMD to work when you need it, it needs to be comprehensive and up-to-date. As I mentioned before, I update my CMD once a week. I schedule thirty minutes on my calendar each week so I remember to do it.&nbsp;</p><p>Sometimes I have a busy week, and I can’t spend thirty minutes on my CMD. So I spend whatever amount of time I have. Some weeks, I only spend ten minutes. Ten minutes per week is better than zero minutes per week.&nbsp;</p><p>Occasionally, I don’t get a chance to update it because my week is so hectic. That’s OK because I’ll probably get to it the following week.&nbsp;</p><p>I recommend updating your CMD once a week and not once a month or once a quarter. If you wait even a month, you’ll have trouble remembering what you did three and a half weeks ago. Even worse, if you schedule a CMD update once a month and then miss it, you won’t get to it until the next month. That means you have to think back and remember two months of work, which is hard to do.&nbsp;</p><p>Updating your CMD every week, while the work is fresh in your mind, gets the best results.</p><h2 id=\"section5\"><strong>The CMD benefits you in additional ways</strong><a href=\"#section5\">#section5</a></h2><p>The CMD can help you prepare for your job search beyond your résumé and your portfolio.&nbsp;</p><p>You can use it to prepare for a job interview. Since you’re capturing work evidence from each stage of the process in your CMD, you can use that evidence to remember what you did throughout a project. Then, you can craft a story about your role on that project.&nbsp;</p><p>Hiring managers love to hear stories about your work during job interviews. For instance, if you’re a designer, they want to know the journey you took during your design process, from the start of a project to the end. A detailed CMD will help you remember this process so you can share it in an interview.&nbsp;</p><p>I’ve even used my CMD to write blog posts. I’ve been blogging regularly for the past two years, and I often refer to my CMD to remember work experience I had that’s relevant to what I’m writing. When I wrote the article “<a href=\"https://uxdesign.cc/how-to-tell-compelling-stories-during-a-ux-job-interview-ef5350ff83e7\">How to Tell Compelling Stories During a UX Job Interview</a>,” I used my CMD to remember interview preparation exercises I did with students.&nbsp;</p><p>The CMD can also help you track work accomplishments for your quarterly or annual performance reviews. Additionally, you can use it to write job ads when hiring for related roles on your team.</p><p>Lastly, I find it rewarding to peruse my CMD now and then, especially when I look back at work I did over a year ago. The CMD serves as a record of all my professional accomplishments. This record helps me appreciate my professional growth because I see how far my skills have come over time.</p><h2 id=\"section6\"><strong>Learn more about the CMD from Manager Tools</strong><a href=\"#section6\">#section6</a></h2><p>At Center Centre, we originally learned about the Career Management Document through the <a href=\"https://www.manager-tools.com/\">Manager Tools podcast series</a>.</p><p>Manager Tools’ podcasts explain how to use a CMD for your résumé. We expanded their approach to include portfolio work as well. I recommend listening to their podcasts about creating and maintaining your CMD:</p><ul><li><a href=\"https://www.manager-tools.com/2010/06/systematic-career-documentation-part-1-hall-fame-guidance\">Systematic Career Documentation (Part 1)</a></li><li><a href=\"https://www.manager-tools.com/2010/06/systematic-career-documentation-part-2-hall-fame-guidance\">Systematic Career Documentation (Part 2)</a></li></ul><h2 id=\"section7\"><strong>Prepare for your next job search now</strong><a href=\"#section7\">#section7</a></h2><p>We tell our students at Center Centre that preparing for your next job search is a process that starts early. It’s like saving for retirement—the sooner you start saving money, the more likely you are to be prepared when the time comes.&nbsp;</p><p>Similarly, collecting résumé and portfolio content ahead of time will prepare you to find your next job whenever you’re ready to do so. It also prepares you for a sudden job termination like an unexpected layoff. If you lose your job without warning, you’ll likely be under a lot of stress to find a new position. Having a CMD ready will relieve the additional stress of building a résumé and portfolio from scratch.&nbsp;</p><p>If you don’t have a CMD yet, now is a great time to start one. Schedule 30 minutes this week to begin crafting your repository of work accomplishments. You’ll be glad you did when you seek your next job.</p></div></div>","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"0f46747731ea0e2645b42153354e260e2b328425a9613e9e016bc46dfc1e9f79","category":"Tech"}