{"title":"Apple Offering Discounts on Fitness Subscription Apps for Apple Card Users","link":"https://www.macrumors.com/2021/02/16/apple-card-fitness-apps-discounts/","date":1613500482000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/16/apple-card-fitness-apps-discounts/\"><p>Apple today began offering special app discounts and perks to <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a> holders, a feature that appears to be new to the service. There are several Fitness-focused apps that are available at discounted prices or with an extended free trial for ‌Apple Card‌ users.</p><p><img alt=\"apple card hands\" width=\"1422\" height=\"800\" src=\"https://images.macrumors.com/t/u9MRzkAoq8sBNEqzkY8opWdKFZY=/400x0/filters:quality(90)/article-new/2021/02/apple-card-hands.jpg?lossy\" data-src=\"https://images.macrumors.com/t/u9MRzkAoq8sBNEqzkY8opWdKFZY=/400x0/filters:quality(90)/article-new/2021/02/apple-card-hands.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/u9MRzkAoq8sBNEqzkY8opWdKFZY=/400x0/filters:quality(90)/article-new/2021/02/apple-card-hands.jpg?lossy 400w,https://images.macrumors.com/t/adGVZ6maSbDEkb_gCSP7uF_AajU=/800x0/filters:quality(90)/article-new/2021/02/apple-card-hands.jpg?lossy 800w,https://images.macrumors.com/t/7z_tvEybVsRZTUjiFU8CgCHJGYU=/1600x0/filters:quality(90)/article-new/2021/02/apple-card-hands.jpg 1600w,https://images.macrumors.com/t/sudWpLcr9kba8SBiFLgVzr-nii0=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/apple-card-hands.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/u9MRzkAoq8sBNEqzkY8opWdKFZY=/400x0/filters:quality(90)/article-new/2021/02/apple-card-hands.jpg?lossy 400w,https://images.macrumors.com/t/adGVZ6maSbDEkb_gCSP7uF_AajU=/800x0/filters:quality(90)/article-new/2021/02/apple-card-hands.jpg?lossy 800w,https://images.macrumors.com/t/7z_tvEybVsRZTUjiFU8CgCHJGYU=/1600x0/filters:quality(90)/article-new/2021/02/apple-card-hands.jpg 1600w,https://images.macrumors.com/t/sudWpLcr9kba8SBiFLgVzr-nii0=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/apple-card-hands.jpg 2500w\"><br>Apple is offering an extended 60-day free trial for the Strava app, 40 percent off an annual subscription for Ten Percent Happier, 50 percent off an annual subscription for Sleep Cycle, and 50 percent off an annual Lifesum subscription.</p><p>All of these deals are exclusive to ‌Apple Card‌ holders and can be redeemed using links that are provided in the emails that are going out to ‌Apple Card‌ users.</p><p>Apple has offered a similar <a href=\"https://www.macrumors.com/2020/12/09/panera-bread-apple-card-promo/\">one-time discount</a> for Panera Bread in the past, but the wording of the email suggests that going forward, Apple may be providing new offers on a monthly basis.</p><p>The email also highlights ‌Apple Card‌ Monthly Installment payments for Apple Watch and <a href=\"https://www.macrumors.com/2021/02/02/apple-watch-trade-in-promotion-heart-month/\">extra trade-in savings</a> that are available at the current time as part of Heart Month.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/13/zuckerberg-facebook-inflict-pain-on-apple-privacy/\">Mark Zuckerberg Reportedly Told Staff Facebook Needs to 'Inflict Pain' on Apple Over Privacy Dispute</a></h3><p>Saturday February 13, 2021 2:33 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple and Facebook have been in a very public spat over the course of the last few months as Apple dials up its pro-privacy stance. The two companies have long had tension, but more recently, Facebook is taking shots at an upcoming iOS and iPadOS feature that will require apps and data companies such as Facebook to ask for users' permission before tracking them across other sites and websites. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/prosser-airtags-ipad-pro-next-month/\">Leaker Jon Prosser Claims AirTags and New iPad Pro to Be Announced Next Month</a></h3><p>Friday February 12, 2021 11:56 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple is slated to release a number of new products this year, and the first round of products could be just a few weeks away. YouTuber Jon Prosser, who has a mixed track record when it comes to reporting on Apple's plans, claims that AirTags and brand new iPad Pro models are set to be announced next month, presumably via a virtual event. Prosser, who runs the tech-news show \"Front Page...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/one-last-intel-mac/\">Apple Surprisingly Sticking With Intel Chips for One Last Mac</a></h3><p>Despite having begun the transition towards using its own custom silicon across the Mac product lineup, somewhat surprising recent rumors have suggested that Apple may continue to use Intel chips for one Mac model. Last year at WWDC, Apple announced plans to transition away from Intel chips to Macs built with its own Apple Silicon, such as the M1 chip, starting in late 2020. It set out its ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/iphone-tips-february-2021/\">Useful iPhone Tips You Might Not Know</a></h3><p>Friday February 12, 2021 3:00 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>There seem to be an endless number of iPhone tips and tricks to share, and that's because Apple's smartphones are so feature rich that it's impossible to keep up with everything they're capable of. We've rounded up some useful tips and hacks in our latest video, so check them out to see if there's something you didn't know about. Subscribe to the MacRumors YouTube channel for more videos. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/14/heart-month-activity-challenge/\">Apple's Heart Month Activity Challenge Requires 60 Minutes of Exercise on Valentine's Day</a></h3><p>Saturday February 13, 2021 10:15 pm PST by <a href=\"https://www.macrumors.com/author/frank-mcshan/\" rel=\"author\">Frank McShan</a></p><p>Today only, Apple Watch owners can complete a new Apple Watch activity challenge in celebration of Heart Month, which is aimed at promoting cardiovascular health. The challenge, which is listed in the Fitness app on the iPhone, tasks users with earning 60 minutes on their Exercise ring. Show your heart some love. Get this award by earning 60 minutes on your Exercise ring this Valentine's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/ipad-2021-major-upgrade/\">Major Upgrades Coming to the iPad in 2021</a></h3><p>Apple is looking to launch an updated ninth-generation iPad with a larger display, the A13 Bionic chip, 4GB of RAM, and a thinner, lighter design in the first half of this year, according to recent reports. Reports from cnBeta and Mac Otakara, citing supply chain sources in China, have offered similar projections for the ninth-generation ‌iPad, explaining that the updated device will...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/youtube-ios-update/\">YouTube's iOS App Gets First Update in Two Months</a></h3><p>Friday February 12, 2021 7:59 pm PST by <a href=\"https://www.macrumors.com/author/eric-slivka/\" rel=\"author\">Eric Slivka</a></p><p>Google today finally updated its YouTube iOS app for the first time in over two months, becoming one of the highest-profile Google apps to see an update since early December when Apple began requiring that developers disclose privacy practices for each of their apps in order to have their updates approved. Most of Google's apps have yet to be updated since the requirement went into effect,...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0f5464ac9be240dec27aa078fe8294ff014c57a2a4b4e175d3e23f1bfc71146b","category":"Apple"}