{"title":"Tim Berners-Lee Worries Australian Law Could Make the Web ‘Unworkable’","link":"https://www.independent.co.uk/news/australia-internet-law-tim-berners-lee-b1803988.html","date":1613780291000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"main\"><p><a href=\"https://www.independent.co.uk/topic/internet\">Internet</a> pioneer <a href=\"https://www.independent.co.uk/topic/tim-berners-lee-0\">Tim Berners-Lee</a> has said <a href=\"https://www.independent.co.uk/topic/australia\">Australia</a>’s plan to make tech giants pay for journalism could render the internet as we know it “unworkable”.</p><p>The inventor of the World Wide Web claimed that proposed laws could disrupt the established order of the internet.</p><p>“Specifically, I am concerned that that code risks breaching a fundamental principle of the web by requiring payment for linking between certain content online,” Berners-Lee told a Senate committee scrutinizing a bill that would create the New Media Bargaining Code.</p><p>If the code is deployed globally, it could “make the web unworkable around the world”, he said.</p><p>It’s a question dividing proponents and critics of the proposed Australian law: does it effectively make Google and Facebook “pay for clicks” and might it be the beginning of the end of free access?</p><p>The battle is being watched closely in the European Union, where officials and lawmakers are drafting sweeping new digital regulations.</p><p>Google contends the law does require it to pay for clicks. Google regional managing director Melanie Silva told the same Senate committee that read Berners-Lee’s submission last month she is most concerned that the code “requires payments simply for links and snippets.”</p><div amp-access=\"loggedIn\" amp-access-hide=\"\"><form amp-access=\"loggedIn\" id=\"reg-lite--form-logged-in\" target=\"_top\" method=\"post\" action-xhr=\"/internal-api/newsletter-component/logged-in/update\" novalidate=\"\" amp-access-hide=\"\"><p><label><small><p><label for=\"form-consent-li\">I would like to be emailed about offers, events and updates from The Independent.<p>Read our <a href=\"https://www.independent.co.uk/service/privacy-policy-a6184181.html\">privacy notice</a></p></label></p></small></label></p></form></div><p>“The concept of paying a very small group of website or content creators for appearing purely in our organic search results sets a dangerous precedent for us that presents unmanageable risk from a product and business-model point of view,” Silva said.</p><p>Facebook regional vice president Simon Milner agreed that the potential cost for news under the code was “entirely uncapped and unknowable.”</p><p>Uniquely, Australia’s code includes a negotiation safety net. An arbitration panel would prevent digital giants from abusing their dominant negotiating positions by making take-it-or-leave-it payment offers to news businesses for their journalism.</p><interaction data-token=\"5bbe30dfc3ecd7c158342081\"></interaction><p>In the case of a standoff, the panel would make a binding decision on whose best-offer wins.</p><p>Peter Lewis, director of the Australia Institute’s Center for Responsible Technology think tank, said the monetary value of public interest journalism has yet to be established.</p><p>“The reason it’s such as ephemeral process, if you like, is that no one’s ever tried this before,” Lewis told Australian Broadcasting Corp.</p><p>“How do you value fact-based news absent advertising? News has always been valued on the back of how much ads that the outlet can sell. Because Google and Facebook have dominated the advertising market and taken that out of the equation, we’re now trying to work out the value of public interest journalism,” Lewis added.</p><p>Google has reacted to the threat of compulsory arbitration by stepping up negotiations on licensing content agreements with Australian media companies through its own News Showcase model.</p><p>Facebook responded Thursday by blocking users from accessing and sharing Australian news.</p><div on=\"tap:gallery-1513\" tabindex=\"0\" role=\"button\"><header><h2><span><svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 24 18\" fill=\"#EC1A2E\"><path d=\"M9 9c0-.552.448-1 1.001-1 .553 0 .999.448.999 1s-.446 1-.999 1C9.448 10 9 9.552 9 9zm6.2 0l-1.7 2.6-1.3-1.6L9 14h10l-3.8-5zM24 4v14H4v-3H0V0h21v4h3zM4 13V4h15V2H2v11h2zm18-7H6v10h16V6z\" fill-rule=\"nonzero\"></path></svg> </span>Facebook birthday: 15 defining moments for the social network</h2><span>Show all 15</span></header></div><p>Treasurer Josh Frydenberg amended draft legislation after weekend talks with Facebook CEO Mark Zuckerberg and Sundar Pichai, chief executive of Alphabet Inc. and its subsidiary Google, to make it clear the platforms would not be charged per news snippet or link.</p><p>“We never intended that . . . if the arbitrator was overseeing a deal between a television station and one of the digital platforms, that they would make that digital platform pay 2 cents, for example, for every click over the forthcoming year,” Frydenberg said. “That was never the intention. It was always the intention was to have a lump sum payment and that’s what we have made explicit in the code.”</p><p>Dan Stinton is managing director of Guardian Australia and New Zealand which is negotiating a licensing deal through Google’s News Showcase.</p><p>Stinton said Google has benefitted from news through engagement with search users who link to journalism, the consumer data Google collects from publishers and from its revenue share from ads that are published with news articles.</p><p>“Google have been prosecuting an argument that they’re being asked to pay for links in Search and that is not the case,” Stinton said.</p><p>“They’re not stealing published content, but I do believe they are using their market power to preference their own businesses to the detriment of publishers and that’s not right,” Stinton said.</p><p>“It’s not just paying for links and snippets within search, it’s paying for the entire benefit that Google receives,” he added.</p><p>Google has reached pay deals with more than 450 publications globally since it launched News Showcase in October.</p><p>The EU’s executive Commission has proposed new rules aimed at taming the biggest digital “gatekeepers.” Proposals working their way through negotiations among lawmakers from the 27-member bloc’s parliament could be amended to include elements of Australia’s model.</p><p>Britain, which recently left the EU, is planning similar digital reforms that include shaking up the relationship between online platforms and news publishers.</p><p>“There’s definitely an influence” from Australia, said Angela Mills Wade, executive director of the European Publishers Council, a lobbying group for media companies. “It is being closely monitored by all who have a stake in the outcome.”</p><p>Publishers in European countries already can request payments from tech companies for using their stories under recently revamped copyright rules. France was the first country to adopt those rules into national legislation and Google initially balked at payments. It changed its tune when a court ordered it into negotiations that resulted in a deal with a group of French publishers.</p><p>One part of the Australian model that has caught attention in Europe is the requirement for binding arbitration if payment talks don’t lead to an agreement, which Google has resisted because it would give the company less control.</p><p>Mills Wade said several leading EU lawmakers want to add an arbitration mechanism to the digital regulations.</p><p>“Given that Google and Facebook have been undermining the scope of the publishers’ right it is clear that regulatory measures are needed, especially the final arbitration mechanism,” said Mills Wade. “Otherwise the majority of publishers won’t have the negotiating power to reach agreements.”</p><p>Google has been striking other news payment deals, including a multi-year agreement with tycoon Rupert Murdoch’s News Corp.</p><p>Mills Wade welcomed that deal, saying it shows Google puts “enormous value” on news content.</p><p>“However, regulators in Australia, but also in Europe, should not be misled into thinking that single deals, especially just before comprehensive laws come into effect, are the answer to ensuring the fair remuneration due to all publishers large and small, whose content is used by Google,” she said.</p><p>Facebook’s decision to block news in the country may have allowed the tech giant to at least temporarily dictate the narrative, though Human Rights Watch’s Australian director Elaine Pearson described it as a “dangerous turn of events”.</p><p>She said: “Cutting off access to vital information to an entire country in the dead of the night is unconscionable.”</p><p><em>Additional reporting from agencies</em>.</p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"0f703f8302d593f7d3b2444d550b9d3997c9416c6d6bf166818837160d9619ce","category":"Tech"}