{"title":"Boeing recommends grounding 777s with Pratt & Whitney engines","link":"https://arstechnica.com/?p=1744177","date":1614003589000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Into the hangar —</h4><h2 itemprop=\"description\">Many of the engine components fell over populated areas.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1303234843-800x593.jpg\" alt=\"United Airlines 238 suffered an engine out failure on Saturday, Feb. 20.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1303234843.jpg\" data-height=\"1623\" data-width=\"2190\">Enlarge</a> <span>/</span> United Airlines 238 suffered an engine out failure on Saturday, Feb. 20.</p><p>Andy Cross/MediaNews Group/The Denver Post via Getty Images</p></figcaption></figure><p>While the National Transportation Safety Board investigates&nbsp;an aircraft engine failure that occurred in flight on Saturday, manufacturer Boeing has recommended that airlines suspend flying certain versions of the 777 wide-body airliner.</p><p>\"Boeing is actively monitoring recent events related to&nbsp;United Airlines Flight 328,\" <a href=\"https://boeing.mediaroom.com/news-releases-statements?item=130829\">the company stated</a> on Sunday. \"While the NTSB investigation is ongoing, we recommended suspending operations of the 69 in-service and 59 in-storage 777s powered by Pratt &amp; Whitney&nbsp;4000-112&nbsp;engines until the FAA identifies the appropriate inspection protocol.\"</p><p>There are versions of the 777 aircraft with engines built by three different manufacturers. For about the last 15 years, new 777s have all been delivered with GE-made engines. So this recommendation applies to older models of the aircraft still in service.</p><p>Before Boeing's announcement on Sunday, Japan's transport ministry had already told its domestic airlines,&nbsp;All Nippon Airways and Japan Airlines, to ground their fleets of 777 aircraft flying with&nbsp;Pratt &amp; Whitney engines.</p><p>This was to give investigators more time to determine what happened with United Airlines Flight 328 on Saturday, when a passenger plane took off from Denver International Airport bound for Honolulu, Hawaii. None of the 229 passengers or 10 crew members was injured.</p><p>On Sunday, the NTSB released a <a href=\"https://www.ntsb.gov/news/press-releases/Pages/MR20210221.aspx\">preliminary update</a> on the incident, when the plane experienced a right engine failure shortly after flying from the Denver airport. Investigators found that the inlet and cowling separated from the&nbsp;PW4077 engine and that two fan blades were fractured. The other fan blades in the engine were damaged. Many of the engine components fell over populated areas.</p><p>\"Shortly after the NTSB was notified of the event, a senior NTSB investigator who lives in the Denver area began working with local law enforcement officials to coordinate the recovery of the components that separated from the engine, many of which landed in residential areas,\" the agency said.</p><p>The cockpit voice recorder and flight data recorder have already been recovered and transported to the NTSB laboratory in Washington where each will be downloaded and analyzed.</p><p>Also on Sunday, engine manufacturer Pratt &amp; Whitney withheld detailed comment about the investigation, pending findings from the NTSB. \"Pratt &amp; Whitney is actively coordinating with operators and regulators to support the revised inspection interval of the Pratt &amp; Whitney PW4000 engines that power Boeing 777 aircraft,\" <a href=\"https://newsroom.prattwhitney.com/2021-2-21-Pratt-Whitney-Statement-on-United-Airlines-Flight-328\">the company said</a>.</p><p>The problems with the 777 aircraft engine come just months after Boeing's 737 MAX aircraft returned to service, with an American Airlines flight in December 2020. That smaller aircraft had been grounded in March 2019 following two crashes. Over the course of 20 wrenching months, Boeing <a href=\"https://arstechnica.com/tech-policy/2020/11/us-regulator-clears-boeings-737-max-to-fly-again/\">sought to address</a> both that failure and its safety culture.</p></div></div>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0f9ec3bff8e3a6dae9c833b1e9bc70e8ce36639be89daaea32f252534d48d32e","category":"Tech"}