{"title":"แนะนำเรื่องการเพิ่ม technical skill ของนักพัฒนา","link":"https://www.somkiat.cc/improve-your-technical-skills/","date":1625668239000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"page\"><article><div id=\"content_box\"><header></header><div><figure><img src=\"https://www.somkiat.cc/wp-content/uploads/2021/07/Screen-Shot-2564-07-07-at-21.21.35.png\" alt=\"\" width=\"542\" height=\"374\" srcset=\"https://www.somkiat.cc/wp-content/uploads/2021/07/Screen-Shot-2564-07-07-at-21.21.35.png 614w, https://www.somkiat.cc/wp-content/uploads/2021/07/Screen-Shot-2564-07-07-at-21.21.35-300x207.png 300w\" sizes=\"(max-width: 542px) 100vw, 542px\"></figure><p>เพิ่งทำการสอนและแนะนำเกี่ยวกับการพัฒนาระบบงานให้นักพัฒนาไป<br>มีคำถามที่น่าสนใจเกี่ยวกับ การเพิ่ม skill<br>หรือ ความสามารถในเรื่องของ technical<br>ว่าต้องทำอย่างไรบ้าง ?<br>จึงทำการสรุปสิ่งที่ได้ตอบและแนะนำไปนิดหน่อย</p><p><strong>เรื่องแรก การตั้งเป้าหมายที่ชัดเจน</strong></p><div><p>ในปัจจุบันมีการพูดกันว่าต้องรู้ลึกหรือรู้กว้างกัน<br>ซึ่งผมก็ไม่รู้เหมือนกันว่าแบบไหนดีกว่า<br>แต่สิ่งหนึ่งที่อยากให้ตั้งก่อนคือ <strong>เป้าหมายที่ชัดเจน</strong><br>ว่าเราต้องการอะไรกันแน่</p><p><strong>เช่นจะเลือกศึกษาภาษา program ก็เลือกสักอย่างเอาให้ชัด</strong><br>เริ่มได้สักหนึ่งที่ถนัดและเข้าใจ<br>แล้วค่อยไปศึกษาภาษาอื่น ๆ จะง่ายขึ้น<br>เลือกผิดไม่เป็นไร อย่างน้อยเราเริ่มได้แล้ว<br>การศึกษาเพิ่มเติมจะง่ายกว่า<br>เพราะว่าเรามีความรู้ในการเรียนรู้แล้วนั่นเอง</p></div><p><strong>เรื่องที่สอง ต้องรู้ว่าจะหาคำตอบในปัญหา หรือ คำถามต่าง ๆ อย่างไร ?</strong></p><div><p>คงไม่ต้องสอนแล้วว่า ต้องไปหาที่ไหน<br>ทั้ง google, stack overflow, facebook, twitter และ reddit เป็นต้น<br>แต่สิ่งที่สำคัญคือ <strong>keyword</strong> ในการหา</p><p><strong>รวมทั้งภาษาอังกฤษ สำคัญมาก ๆ</strong><br>เพราะว่าเอกสารต่าง ๆ ที่ update สุด ๆ คือภาษาอังกฤษนี่แหละ<br>อย่าไปรอหรืออ่านแต่ภาษาไทย<br>เพราะว่า อาจจะช้าหรือไม่ update แล้วก็ได้</p><p><strong>แต่ก่อนถามควรทำการบ้านมาให้ดี</strong><br>เขียนอธิบายให้ชัดว่าทำอะไรมาบ้าง<br>ติดปัญหาอะไรบ้าง<br>ถ้ามี code, config หรือ error message อะไร<br>รวมทั้ง environment ต่าง ๆ ที่ใช้งาน<br>ก็เขียนไปให้ครบถ้วน</p><p><strong><em>หรือต้องรู้ว่าจะต้องถามใคร เมื่อใด และ อย่างไร<br>ตรงนี้ต้องฝึกฝน</em></strong></p></div><p><strong>เรื่องที่สาม การแบ่งปัญหาใหญ่ ๆ ออกเป็นปัญหาย่อย ๆ</strong></p><div><p>เนื่องจากปัญหาใหญ่ ๆ มันแก้ไขยากไป<br>ดังนั้นหัดแบ่งออกมาเป็นปัญหาย่อย ๆ<br>เพื่อให้ง่ายต่อการแก้ไข<br>และช่วยให้ focus กับงานหรือปัญหานั้น ๆ</p><p><strong><em>เมื่อเจอปัญหาต้องเข้าไปให้ถึง root cause เสมอ<br>รวมไปถึงการตัดสิ่งที่ไม่จำเป็นออกไปด้วยเช่นกัน</em></strong></p><p><strong>และการจัดเรียงความสำคัญของสิ่งที่ทำ</strong><br>อะไรควรทำก่อนหรือหลัง<br>มิเช่นนั้น จะมีแต่สิ่งที่สำคัญไปหมด<br>แน่นอนว่า จะไม่เสร็จอะไรสักอย่าง</p></div><p><strong>เรื่องที่สี่ ปรับปรุงเรื่องของการสื่อสาร รวมทั้งการแบ่งปัน</strong></p><p>สิ่งที่ควรปรับปรุงและพัฒนาอยู่อย่างเสมอคือ<br>การสื่อสารเรื่องต่าง ๆ ให้คนอื่นรู้และเข้าใจได้ง่าย<br>ไม่ว่าจะเป็นเพื่อร่วมทีมหรือคนอื่น ๆ นอกทีม หรือ นอกบริษัท<br>อีกทั้งเรื่องของการแบ่งปันความรู้ต่าง ๆ ออกไปทั้งในหรือนอกบริษัท<br>เพื่อช่วยปรับปรุงการสื่อสารทั้งการพูด ทั้งการเขียน หรือการสอนก็ตาม</p><p><strong>เรื่องที่ห้า เรียนรู้อยู่อย่างสม่ำเสมอ</strong></p><div><p>ถ้าเรามีเป้าหมายที่ชัดเจนแล้ว<br>จะทำให้เราติดตาม หรือ เรียนรู้ในสิ่งที่ต้องการได้ง่าย<br>จากนั้นก็ศึกษา เรียนรู้ อย่างสม่ำเสมอ<br>เพราะว่าในปัจจุบันมีการเปลี่ยนแปลงเยอะมาก</p><p>แต่สิ่งหนึ่งที่ไม่ค่อยเปลี่ยนคือ <strong>fundamental</strong> หรือ ความรู้พื้นฐานนั่นเอง<br>ต้องเสริมฐานให้แน่น เพื่อต่อยอดได้อย่างมั่นคง<br>ไม่มีอะไรได้มาแบบง่าย ๆ ต้องค่อย ๆ ลงมือทำ และเก็บสะสม</p></div><p><strong><em>เมื่ออ่านแล้ว ก็ลงมือทำได้แล้ว<br>ถ้าไม่ลงมือทำ จะพัฒนาได้อย่างไร</em></strong></p></div><div><p><img alt=\"\" src=\"https://secure.gravatar.com/avatar/e5cb9aad7bf4f0e43462bd51d6ff7021?s=90&amp;d=mm&amp;r=g\" srcset=\"https://secure.gravatar.com/avatar/e5cb9aad7bf4f0e43462bd51d6ff7021?s=180&amp;d=mm&amp;r=g 2x\" height=\"90\" width=\"90\"></p><h4>Article by <a href=\"https://www.facebook.com/somkiatspns\">Somkiat Puisungnoen</a></h4><p>To be Craftmanship</p></div></div></article></div></div>","author":"somkiat","siteTitle":"cc :: somkiat","siteHash":"3a23a5a4389e1e40c6fbb16520a8cc20df5b3591c25145ce72aaa18b19e48201","entryHash":"0fdf75bbe3e4fb6680526cce1d64d933e13e55bec4134cb107c88fbda16d0433","category":"Thai"}