{"title":"Manuela Fundación agreed to pay about €7 million for Mitchelton-Scott before deal collapsed","link":"https://cyclingtips.com/2021/10/manuela-fundacion-agreed-pay-about-e7-million-for-mitchelton-scott-before-deal-collapsed/","date":1634324858000,"content":"<div><div><p><a href=\"https://www.marca.com/ciclismo/2021/10/15/61695d3dca47416e2c8b459e.html\" target=\"_blank\">Marca</a> has revealed the details of the deal that reportedly <a href=\"https://cyclingtips.com/2020/06/mitchelton-scott-is-becoming-team-manuela-fundacion/\" target=\"_blank\">would have seen</a> the Manuela Fundación take over ownership and sponsorship of the Mitchelton-Scott team (now the BikeExchange team) in 2020 before the deal <a href=\"https://cyclingtips.com/2020/06/gerry-ryan-cancels-greenedge-deal-with-manuela-fundacion/\" target=\"_blank\">fell apart</a>. According to a Head of Terms agreement published by the Spanish newspaper, the Manuela Fundación was going to acquire the team and its WorldTour license for a total of €6,980,000 before team owner Gerry Ryan called off the deal.</p><p>Back in June of 2020, after months of reports on the Mitchelton-Scott team’s search for a new sponsor, the squad put out a surprising announcement that it had reached a “longterm agreement” with a Spanish non-profit called Manuela Fundación. Run by business magnate Francisco Huertas and his wife Maria Angustias González, the Manuela Fundación was set to take over as title sponsor for both the men’s and women’s teams, and the announcement included imagery of what was set to become the team’s new kit.</p><p>Within days, however, team owner Gerry Ryan had called off the deal, saying that team brass had “concluded that the relationship will not proceed.” Less than two weeks later, the team bid farewell to general manager Shayne Bannan and financial manager Alvaro Crespi, who had reportedly been involved in putting the deal together, while Brent Copeland and Darach McQuaid joined the management team.</p><p>At the time, Huertas opted to offer little public comment on the situation, and while members of the Manuela Fundación camp – like former pro Stefano Garzelli – did register their frustration with the way things played out, details remained scarce. Some 16 months later, however, Marca’s report offers some of the Manuela Fundación’s side of the story.</p><p>According to the report, the Manuela Fundación had been set to make an initial payment of €3,180,000 for the team in July of 2020 with a further €600,000 paid “for expenses related to 2020 and UCI expenses for issue [of] the 2021 WorldTour licenses” of both the men’s and women’s teams, with the remainder of an amount totaling €6,980,000 to follow. The deal would have seen the Manuela Fundación take over ownership of the entire team structure, with Garzelli and fellow former pro Emilio Rodriguez set to join team management.</p><p>As it turned out, none of that happened. Instead, Ryan made a renewed commitment to keep the team afloat, and Mitchelton-Scott became BikeExchange for the 2021 season.</p><p>Huertas told Marca that he later engaged in talks with Deceuninck-QuickStep manager Patrick Lefevere, but those talks apparently did not lead to a deal.</p><p>As such, the Manuela Fundación has not yet become part of the WorldTour as originally planned, but it is nonetheless becoming increasingly involved in the sport. Having sponsored junior teams in Spain for some time, the Manuela Fundación will back a team competing at the Continental level in 2022.</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0fdfc4ef18faf39b2348a2f7c173202fce2de8ba004933c8abbe0ccc80f7b820","category":"Cycling"}