{"title":"Spotlight: Rapha Bar Bag","link":"https://cyclingtips.com/2021/03/spotlight-rapha-bar-bag/","date":1616027880000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>I started using the Rapha Bar Bag just before Christmas, and after a few months of use, it has become my go-to bag option. While this colour option is not the most practical for dirty winter roads, the bag offers stacks of capacity.&nbsp;&nbsp;</p><p>Although by no means the biggest bar bag ever, the internal layout with one large compartment and two mesh pockets offers plenty of space. This interior design means contents are easily accessible when the bag is open, but the zipper location limits access on the move, especially when combined with an out-front computer mount.&nbsp;&nbsp;</p><p>The smaller front pocket is much more accessible and is perfect for storing food, keys, or a phone. A reflective panel across the front pocket helps with visibility on the road and has loops for attaching a light or hanging shades off.&nbsp;The bar bag can also mount to a top tube for use as a frame bag.</p><p>While I like the bag, it’s not perfect. As mentioned, the main compartment zipper could be more accessible, and the weatherproofing could be better. Rapha lists the bag as having “Waterproof fabric for excellent weatherproofing”, in reality, anything more than road spray will quickly seep into the bag.&nbsp;&nbsp;</p><p>The bar straps are sewn to the bag, and I fear the positioning of the plastic buckles could mark carbon frames and handlebars. A moveable buckle or softer back could easily solve this issue. The two bar straps get locking clips that secure the fit but that clip is absent from the head tube strap, meaning this strap works its way loose.</p><p>Lastly, with no means of securing the excess strap at the handlebar, the straps flap in the wind and rub on your knees while out of the saddle, which I find annoying.</p><p>The Bar Bag is priced at US$60 / £45 / AU$80 / €55, and available in four colours; Dark Yellow (aka orange) as tested, Brick, Black, and Stone.&nbsp;</p><p>Head to <a target=\"_blank\" href=\"https://www.rapha.cc/eu/en/shop/bar-bag/product/BBA01XXKLP\" rel=\"noreferrer noopener\">Rapha.com</a>&nbsp;for more information.</p><div data-block-name=\"highlight-box\" id=\"\"><p><em>Follow the link to see previous products we’ve reviewed in our <a href=\"https://cyclingtips.com/tag/spotlight/\" target=\"_blank\" rel=\"noopener\">Spotlight series</a>.</em></p></div><div><h5>Tags</h5></div></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"104d9377eff111ab44d0f9e43f587d14c81d40dca6d20bb2c52eb79994ca344a","category":"Cycling"}