{"title":"Gab, a haven for pro-Trump conspiracy theories, has been hacked again","link":"https://arstechnica.com/?p=1748174","date":1615265620000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>GAB HACK —</h4><h2 itemprop=\"description\">A failure to purge authentication tokens taken in the first breach leads to a second one.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/gab-800x450.png\" alt=\"Promotional image for social media site Gab says \" get=\"\" on=\"\" gab=\"\" and=\"\" speak=\"\" freely.=\"\"><figcaption></figcaption></figure><p>Beleaguered social networking site Gab was breached on Monday, marking the second time in as many weeks that hackers have gained unauthorized access to a platform that caters to users pushing hate speech and pro-Trump conspiracy theories.</p><p>The compromise came to light after someone hijacked the account of Gab founder and CEO Andrew Torba and left a post criticizing him for not paying an 8 bitcoin ransom for the safe return of documents used to verify the identity of some users. The unknown hacker also accused Torba of failing to disclose the full extent of the earlier breach.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/gab-hack-no-2.jpg\" data-height=\"973\" data-width=\"1027\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/gab-hack-no-2-640x606.jpg\" width=\"640\" height=\"606\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/gab-hack-no-2.jpg 2x\"></a><figcaption><p>https://archive.md/mSYxk</p></figcaption></figure><p>Gab quickly took the site offline and removed the post, but not before it was archived <a href=\"https://archive.md/mSYxk\">here</a>. When the service was restored a few hours later, a <a href=\"https://gab.com/a/posts/105857352965159221\">statement Torba posted</a> said that Monday’s breach was the result of site administrators failing to revoke <a href=\"https://tools.ietf.org/html/rfc6750\">OAuth2 bearer tokens</a>, which browsers and mobile apps store after a user has successfully logged in to a site.</p><h2>Token harvesting</h2><p>“The attacker who stole data from Gab harvested OAuth2 bearer tokens during their initial attack,” Torba wrote. “Though their ability to harvest new tokens was patched, we did not clear all tokens related to the original attack. By reusing these old tokens, the attacker was able to post 177 statuses in an 8-minute period today.”</p><p>Gab's failure to purge bearer tokens may have stemmed from unfamiliarity with the open-source <a href=\"https://joinmastodon.org/\">Mastodon code</a> the site runs or an unwillingness to require users to go through the hassle of resetting OAuth2 bearer tokens. The theft of the tokens came as a surprise to many because they weren’t included in a trove of hacked Gab data <a href=\"https://ddosecrets.com/wiki/GabLeaks\">posted</a> by the Wikileaks-style site Distributed Denial of Secrets following the breach.</p><p>“I think what's noteworthy here is that they never knew this data was obtained, at least not based on their reporting,” Troy Hunt, owner of the breach notification service Have I been Pwned?, said, referring to <a href=\"https://news.gab.com/2021/03/06/update-number-2-on-the-gab-breach/#more-2740\">this notification</a> that Gab posted on Saturday. Hunt said he was also surprised that Gab has yet to enforce a mandatory password reset for all users. Such resets are standard practice after sites experience breaches that compromise user data.</p><p>The first breach <a href=\"https://arstechnica.com/information-technology/2021/03/gab-the-far-right-website-has-been-hacked-and-70gb-of-data-leaked/\">came to light</a> last Monday, when DDoSecrets said that it obtained 70GB of passwords, private posts, and more from Gab and was making them available to select researchers and journalists. The data, DDoSecrets co-founder Emma Best said, was provided by an unidentified hacker who breached Gab by exploiting a SQL-injection vulnerability in Gab’s website code.</p><h2>Trying to stay afloat</h2><p>Shortly after the first breach was discovered, someone at Gab patched a critical SQL-injection vulnerability that was introduced into the website code by <a href=\"https://arstechnica.com/gadgets/2021/03/rookie-coding-mistake-prior-to-gab-hack-came-from-sites-cto/\">site CTO Fosco Marotto</a>. Marotto declined to say if that vulnerability was the one hackers exploited to take over the site, but the bug’s introduction early this year and its removal so soon after the site compromise stoked speculation that it was indeed the one used in the hack.</p><p>Marotto didn’t immediately respond to an email seeking comment for this post.</p><p>Gab has been struggling to stay afloat for more than two years as it continues to provide a haven for hate speech and conspiracy theories. In 2017, Google <a href=\"https://arstechnica.com/tech-policy/2017/08/gab-the-right-wing-twitter-rival-just-got-its-app-banned-by-google/\">removed the Gab app</a> from the Play store for terms of service violations. A year later, web host <a href=\"https://arstechnica.com/tech-policy/2018/10/gab-forced-offline-over-apparent-tie-to-pittsburgh-synagogue-shooter/\">GoDaddy terminated service to Gab</a> after one of its users took to the site to criticize the Hebrew Immigrant Aid Society shortly before killing 11 people in a Pittsburgh synagogue.</p><p>Following the January 6 storming of the US Capitol by pro-Trump extremists, Amazon and other web hosts have refused to provide service to the site, citing its inability to moderate user content including unfounded claims by Torba and users alike that the 2020 election was stolen from former President Trump.</p><p>The revelation that the earlier hack exposed OAuth 2 bearer tokens leaves open the possibility that those responsible obtained other types of sensitive user data. And if that's the case, Gab's security woes may still not yet be over.</p><p><em>Post updated to remove second-to-last paragraph, which contained incorrect information about Gab's relationship with Amazon.</em></p></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"10641d4d5385f65f3d45377f25574ac32fac8a7671a426eaf3806f480e6e95f6","category":"Tech"}