{"title":"Apple TV+ Is Now Available on Google TV","link":"https://blog.google/products/google-tv/apple-tv-now-available/","date":1613707003000,"content":"<div id=\"readability-page-1\" class=\"page\"><div data-component=\"uni-article-paragraph\"><p>Starting today, the Apple TV app, including Apple TV+, is now globally available on the new <a href=\"https://store.google.com/us/product/chromecast_google_tv\" target=\"_blank\" data-analytics-onclick=\"{&quot;event&quot;:&quot;page interaction&quot;,&quot;category&quot;:&quot;in-article links&quot;,&quot;action&quot;:&quot;link click&quot;,&quot;label&quot;:&quot;https://store.google.com/us/product/chromecast_google_tv&quot;}\">Chromecast with Google TV</a>, with more Google TV devices to come. To access the Apple TV app, navigate to the Apps tab or the apps row in the For you tab.</p><p>Google TV gives users with subscriptions to Apple TV+ the ability to tune into award-winning original shows, movies and documentaries from the world’s most creative storytellers. You can enjoy Apple Originals, including series like “Ted Lasso,” which was recently nominated for two Golden Globes, “For All Mankind” season two debuting tomorrow, “The Morning Show” and “Servant,” as well as movies like “Greyhound” and “Palmer.” The Apple TV app also gives you access to your library of movie and TV show purchases from Apple, as well as personalized and curated recommendations and Apple TV channels. And with Family Sharing, up to six family members can share subscriptions to Apple TV+ and Apple TV channels.</p><p>With Google TV in the U.S., you can browse Apple Originals in your personalized recommendations and search results. And with Google Assistant, you can also use your voice to ask Google to open the Apple TV app or play an Apple Original title. If you aren’t ready to watch right away, you can add Apple Originals to your Watchlist for later. These features will roll out globally in the coming months.</p><p>The Chromecast with Google TV is packed with the latest technology—it streams crystal-clear video in up to 4K HDR at up to 60 frames per second and now has a voice remote. The remote has a dedicated Google Assistant button that helps you find something to watch, answer everyday questions like “how's the weather?” or dim your compatible smart home lights with just your voice. It also eliminates the need for multiple remotes thanks to programmable TV controls for power, volume and input.&nbsp;</p><p>In addition to Chromecast with Google TV, the Apple TV app will also be available on Google TVs from Sony and TCL. We plan to roll out to more Android TV-powered devices in the coming months.<span></span></p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"10a05f0024d19a2ada21c79f9a12694ff7a5ac3ed0c41396026c752e0b4ec00a","category":"Tech"}