{"title":"กูเกิลงานเข้า ยุโรปกำลังหาช่องทางบังคับแพลตฟอร์มจ่ายเงินให้สำนักข่าวเหมือนออสเตรเลีย","link":"https://www.blognone.com/node/121108","date":1612858223000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p></p><h2 itemprop=\"name\"><a href=\"https://www.blognone.com/node/121108\" title=\"กูเกิลงานเข้า ยุโรปกำลังหาช่องทางบังคับแพลตฟอร์มจ่ายเงินให้สำนักข่าวเหมือนออสเตรเลีย \">กูเกิลงานเข้า ยุโรปกำลังหาช่องทางบังคับแพลตฟอร์มจ่ายเงินให้สำนักข่าวเหมือนออสเตรเลีย</a></h2><p></p><div><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/Google_2015_logo.svg_.png?itok=A192ealk\"></p><div itemprop=\"description\"><p>คณะนิติบัญญัติของสหภาพยุโรปที่ทำงานเกี่ยวกับร่างกฎระเบียบด้านดิจิทัลของยุโรป 2 ฉบับคือ <a href=\"https://www.blognone.com/node/120151\">Digital Services Act (DSA) และ Digital Markets Act (DMA)</a> เผยกับ Financial Times เล็งจะนำร่างกฎหมายของออสเตรเลียหรือ News Media Bargaining Code กฎหมายจ่ายเงินให้สำนักข่าวที่แสดงเนื้อหาบนแพลตฟอร์มมาปรับใช้ ด้วยเห็นว่าเป็นช่วยเพิ่มอำนาจต่อรองให้กับสำนักข่าวและผู้ผลิตเนื้อหา</p><p>Alex Saliba หนึ่งในสมาชิกสภายุโรป กล่าวว่าแนวทางของออสเตรเลียที่มีต่อ Google และ Facebook นั้นสามารถจัดการกับความไม่สมดุลของอำนาจระหว่างแพลตฟอร์มโซเชียลและผู้ผลิตเนื้อหาได้ ด้าน Andrus Ansip สมาชิกสภายุโรปชาวเอสโตเนีย และมีบทบาทในกฎหมายลิขสิทธิ์ ระบุว่า ลิขสิทธิ์ช่วยเพิ่มอำนาจต่อรองให้แก่ผู้ผลิตเนื้อหา และได้รับรู้ด้วยว่ากระบวนการนี้กำลังเกิดขึ้นที่ออสเตรเลีย อย่างไรก็ตาม ยังเปิดรับต่อการเปลี่ยนแปลงใหม่ๆ ที่จะเกิดขึ้น และต้องดูรายละเอียดของกฎหมาย DSA ให้ชัดเจนขึ้นอีก</p><p><img src=\"https://www.blognone.com/sites/default/files/externals/c51b0b3a3e53bc898f25b7844b17f2c4.jpg\" alt=\"\"></p><p>กูเกิลบอกว่ากฎหมายยุโรปมีจุดมุ่งหมายเพื่อสร้างสมดุลที่เหมาะสมระหว่างผู้เผยแพร่เนื้อหาและแพลตฟอร์ม ผู้ใช้กูเกิลค้นหาข้อมูลที่เกี่ยวข้องและเชื่อถือได้จากเว็บไซต์ต่างๆ เรายินดีที่จะจ่ายเงินเพื่อสนับสนุนการสื่อสารมวลชนต่อไปและเรากำลังทำเช่นนั้นทั่วโลก เห็นได้จาก Google News Showcase ที่จ่ายเงินให้ผู้ผลิตเนื้อหาระยะยาว 1 พันล้านดอลลาร์ ส่วน Facebook ยังไม่ออกมาแสดงความเห็นใด</p><p>ที่ผ่านมา กูเกิลค้านกฎหมาย News Media Bargaining Code ของออสเตรเลียมาตลอด บอกว่ากฎหมายจะทำร้ายบริการฟรี และทำร้ายเสรีภาพในการเข้าถึงข้อมูลข่าวสาร และยังขู่จะนำบริการค้นหาออกจากออสเตรเลียด้วย</p><p>ที่มา - <a href=\"https://www.ft.com/content/4c40c890-afd3-40a3-9582-78a66c37a8af\">Financial Times</a></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"10ef67d48549bb64ae7cafb700c3bbfedf97c6c261b8dbdafccf7b2bc311bd54","category":"Thai"}