{"title":"The new Google Pay repeats all the same mistakes of Google Allo","link":"https://arstechnica.com/?p=1747061","date":1615127435000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Please stop —</h4><h2 itemprop=\"description\">For P2P users, the new app has fewer features, is less convenient, and has more fees.</h2></header><section><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/flushing-google-play-800x450.jpg\" alt=\"The Google Play logo is flushed down a toilet alongside many dollar bills.\"><figcaption></figcaption></figure><p>The new Google Pay app came out of beta this week, and it marks the first step in a major upheaval in the Google Pay service. Existing Google Pay users are about to go through a transition reminiscent of the recent move from Google Music to YouTube Music: Google is killing one perfectly fine service and replacing it with a worse, less functional service. The fun, confusing wrinkle here is that the new and old services are both called \"Google Pay.\"</p><p>Allow us to explain.</p><p>The old Google Pay service that has been <a href=\"https://arstechnica.com/gadgets/2018/01/google-rebrands-all-its-payment-solutions-as-google-pay/\">around for years</a> is dying. The app will be shut down in the US on April 5, and if you want to continue using New Google Pay, you'll have to go find and download a totally new app. NFC tap-and-pay functionality won't really change once you set up the new app, but the New Google Pay app won't use your Google account for P2P payments anymore. You'll be required to make a new account. You won't be able to send any money to your new contacts until they download the new app and make a new account, too. On top of all that, the Google Pay website will be stripped of all payment functionality in the US on April 5, and New Google Pay won't support doing anything from the web. You won't be able to transfer money, view payment activity, or see your balance from a browser.</p><p>In addition to less convenient access and forcing users to remake their accounts, New Google Pay is also enticing users to switch with <a href=\"https://9to5google.com/2020/11/23/google-pay-web-fees/\">new fees</a> for transfers to debit cards. Old Google Pay did this for free, but New Google Pay now has \"a fee of 1.5% or $.31 (whichever is higher), when you transfer out money with a debit card.\"</p><p>Google is currently sending out emails to existing users detailing all this. There's also <a href=\"https://support.google.com/pay/answer/10197120?p=pay-app-changes_email&amp;visit_id=637504853590671808-3574169040&amp;rd=1#new-tos\">a support page link</a> and a notice at the top of <a href=\"https://pay.google.com/\">pay.google.com</a>. On the Play Store, Google has already started hiding the old Google Pay app from search results, renamed it \"Google Pay (old app),\" and updated the app home screen with a message to sign up for the new app.</p><h2>New Google Pay’s Internet-hostile design</h2><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/31-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/31.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/31-980x1041.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/31-1440x1529.jpg 2560\" data-sub-html=\"#caption-1747327\"><figure><figcaption id=\"caption-1747327\"><span></span><p>Oh no, not this again. Google Pay requires you to sign up with your carrier SMS number.</p><p><span></span> Ron Amadeo</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_jdlIGerusS-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_jdlIGerusS.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_jdlIGerusS.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_jdlIGerusS.png 2560\" data-sub-html=\"#caption-1747331\"><figure><figcaption id=\"caption-1747331\"><span></span><p>The website is dying because websites don't have SIM cards.</p><p><span></span> Ron Amadeo</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/36-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/36.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/36-980x1027.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/36-1440x1509.jpg 2560\" data-sub-html=\"#caption-1747606\"><figure><figcaption id=\"caption-1747606\"><span></span><p>Here is what the actual app looks like, if you're wondering.</p><p><span></span> Ron Amadeo</p></figcaption></figure></li></ul></div><p>We've spent some time with the new Google Pay app now that it's out of beta, and Google looks like it is repeating all the same mistakes it made with Google Allo, one of Google's biggest messaging-app flops.&nbsp;Google Allo was the messaging app that was released in 2016, a few years after Google Hangouts. The service represented Google's attempt to clone WhatsApp <a href=\"https://www.businessinsider.com/google-offered-to-buy-whatsapp-for-10-billion-before-facebook-swooped-in-with-more-money-2014-2\">after losing</a> an acquisition bidding war with Facebook two years earlier. Like New Google Pay, Allo debuted in India and was <a href=\"https://arstechnica.com/gadgets/2016/09/google-allos-limitations-explained-in-one-word-india/\">laser-targeted</a> at the country before being forced on the rest of us for some reason. Allo was thoroughly rejected by consumers and was <a href=\"https://www.androidpolice.com/2017/01/31/google-allo-drops-off-the-top-500-apps-chart-on-google-play/\">dead in the water</a> after four months of availability. It was shut down after about two years.</p><p>In Google land, targeting an app at India means building an Internet-hostile design that ignores existing Google infrastructure, data, and contacts, and building something powered entirely by the carriers' SMS system.&nbsp;New Google Pay, like Allo, doesn't use your Google account (at least, not for payments). Instead, you have to sign up for the new Google Pay using your carrier's phone number. None of your existing Google Pay contacts will carry over, and they'll all have to sign up for new accounts with their carrier phone numbers, too. Making payments entirely SMS-driven theoretically makes signing up for the service easier in India, but in the rest of the world—where people interested in a Google service generally have a Google account and multiple devices—it's more inconvenient compared to rival services.</p><p>Just like with Google Allo, SMS-based authentication means there's no desktop support at all. The Google Pay website is being stripped of all its useful functionality because a browser does not have a carrier SIM card and therefore can't be authenticated by the SMS-reliant system. Google Allo eventually copied WhatsApp and came up with a clunky, QR-code-driven browser login process that forwarded your phone access to the browser (and didn't work if your phone was off/dead/missing). Google Pay could eventually cook up something like that, but that seems like a heap of work for what should be (and used to be) a quick money transaction.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/35.jpg\" data-height=\"986\" data-width=\"1698\" alt=\"SMS-based apps like Google Pay only support one device at a time.\"><img alt=\"SMS-based apps like Google Pay only support one device at a time.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/35-980x569.jpg\" width=\"980\" height=\"569\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/35.jpg\" data-height=\"986\" data-width=\"1698\">Enlarge</a> <span>/</span> SMS-based apps like Google Pay only support one device at a time.</p><p>Ron Amadeo</p></figcaption></figure><p>The other SMS-based limitation of Google Pay is that you can only be logged in on one device at a time, just like Allo. This is less of an issue for a payment app, but the old version of Google Pay worked on smart watches, too. If Google ever wants to <a href=\"https://arstechnica.com/gadgets/2021/01/google-closes-the-fitbit-acquisition-pledges-to-not-use-data-for-ads/\">revive its wearables segment,</a> this seems like a bad limitation.</p><p>Basically, everyone is being kicked off the old Google Pay service, and you'll all have to join and reconnect on this new thing. Like with YouTube Music, this is a great chance for Google to lose users as they are forced to re-evaluate their app choices and set up something new. There's a possibility that users move to a different, more stable, more respectful platform. This move also kills the synergy between NFC tap-and-pay Google Pay and Send-money-to-people Google Pay. The two services, both in a single app, now use completely different log-in methods: Google Pay NFC on the new app still uses your Google account and will carry over your credit cards.</p><p>SMS identity is not a completely unworkable solution, but it's definitely not the future we should be pushing for, when regular account systems are free, more accessible, and much more stable. I know you technically don't own anything on any company cloud service, but a phone number, which is tied to a bill and your ability to pay, feels a lot more temporary than something like an email address. I am sure there are people who have had the same phone number for many years, but that only happens if you constantly pay the bill, every single month, for years. You're also trusting the notoriously bad billing and customer service departments of your local cell phone carrier to do the right thing and screw you out of your phone number for some dumb reason, which has definitely happened before. You might even have a moral argument that tying identity to your ability to pay a bill is wrong.</p><p>The other problem with SMS is that it's considerably easier to get Internet service than it is cell service. In a Venn diagram of Internet access, cell phone service is a smaller circle inside a bigger \"Internet\" circle, which also has options for wired Internet from your local ISP. For instance, my parents live in a cottage in the woods and don't get cell phone service, which has never been a big deal thanks to wired services. But they would have to leave the house to set up Google Pay. We'll probably switch to something else.</p></div><nav>Page: <span>1 <a href=\"https://arstechnica.com/gadgets/2021/03/the-new-google-pay-repeats-all-the-same-mistakes-of-google-allo/2/\">2</a> <a href=\"https://arstechnica.com/gadgets/2021/03/the-new-google-pay-repeats-all-the-same-mistakes-of-google-allo/2/\"><span>Next <span>→</span></span></a></span></nav></section></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"111c71a0bfdb6edcf55bfd95d90d427517771b976e8a5d982868c24f15e0d165","category":"Tech"}