{"title":"Preview: What you need to know about stage 16 of the 2021 Tour de France","link":"https://cyclingtips.com/2021/07/preview-what-you-need-to-know-about-stage-16-of-the-2021-tour-de-france/","date":1626134382000,"content":"<div><div><p><strong>Date: </strong>Tuesday July 13<br><strong>Start: </strong>Pas del a Case<br><strong>Finish: </strong>Saint-Gaudens<br><strong>Distance: </strong>169 km</p><p>The riders will start the final week on Andorran soil but will be back in France when the neutral zone ends. This is a lumpy day featuring a fourth-category climb, two second-category climbs, and a first-category climb. The last climb is the Cat 4 (800 m at 8.4%) which peaks 7 km from the line. The last 400 metres of the stage are uphill.</p><p><strong>What to watch for:</strong> The polka dot jersey hopefuls will have a tough decision on their hands. There are some KOM points on offer on Tuesday, but the next two stages will offer more points while also being a lot harder. Will any of the mountains classification contenders try to get into the break here? As for the stage battle, that last climb looks like a great launchpad for someone up the road who’s still feeling fresh.</p><p><strong>Who’s it for:</strong> The breakaway.</p><p><strong>Dane Cash’s picks:</strong> <em>Julian Alaphilippe and Wout van Aert have both shown a willingness to get up the road at the Tour and this profile probably suits them better than that of any other stage still to come in the race. Others to watch include Magnus Cort Nielsen and Jasper Stuyven, who will both be tough to beat if a small group comes to the line, as well as Matej Mohoric, Omar Fraile, and Sergio Higuita.</em></p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/TDF21_PROFILS-ETAPES-SANS-RAVITO_ETP16-1340x1005.jpeg\"></figure><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/TDF21_ET16_carte-1340x947.jpeg\"></figure></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"122d26f0a81334f87b0368e3179e8d88bcaa0201f709b9bb064edb4c9aa34823","category":"Cycling"}