{"title":"Tour de France mechanics: combining SRAM Red Etap AXS with Di2 buttons","link":"https://cyclingtips.com/2021/06/tour-de-france-mechanics-combining-sram-red-etap-axs-with-di2-buttons/","date":1624652548000,"content":"<div><div><p>Out and about at Le Grand Départ we spotted a little SRAM Red etap: Di2 combination on Trek-Segafredo’s Edward Theuns’ Trek Madone.</p><p>The 30-year-old Belgian rider, most likely on lead-out duty at this year’s Grande Boucle, has Shimano’s Di2 SW-R610 “sprinter shifters” tucked neatly beneath the bar tape in the drops of his Bontrager bars.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/sprint-shifters-1-2-1340x754.jpg\"></figure><p>The inclusion of the sprinter buttons is not in itself all that surprising. However, to see the Di2 component on an otherwise entirely SRAM Red Etap AXS equipped bike is interesting, if not entirely new.</p><p>Both Shimano and SRAM offer satellite shifter options for their electronic groupsets. While Shimano offers a range of shifters, with sprinting and climbing orientated options, SRAM offers the recently released “MultiClic” satellite shifter option. Looking at sprinting options, the Shimano SW-R610 is smaller and easier mounted on the drops, than the SRAM option.</p><figure><ul><div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/SRAM-MultiClic-remote-shifter-2-1340x894.jpg\"><figcaption>SRAM’s MultiClic buttons (Photo – SRAM)</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Di2-Sprint-shifters-SW-R610-1340x754.jpg\"><figcaption>Shimano’s SW-R610 sprinter shifters (Photo – Shimano)</figcaption></figure></li></div></div></ul><figcaption>Both SRAM and Shimano offer satellite shifters, Campagnolo do not.</figcaption></figure><p>This hack is actually not all that difficult. Although both the Di2 and the SRAM blip satellite shifters have very different connector heads, both are functionally very similar and underneath the hood are just simple microswitches.</p><p>The hack is as simple as cutting the wire on both units, swapping the connectors, and resoldering the wire. Perhaps not a job to risk if you are new to soldering, but this is likely one of the easier tasks a team might request of a World Tour mechanic.</p><p>The hack does give us a little insight into the importance of rider comfort, ergonomics, and some of the behind the scenes work of World Tour mechanics. Not to mention how far drivetrains have progressed, from downtube shifters 30 years ago to electronic shifting with up to six individual rear derailleur shifting controls on the bars of a modern road bike.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/sprint-shifters-2-2-1340x754.jpg\"></figure></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"125cbea0aa80ba714bfefd1d38873dae0f4eff414ccbe6095f512188c28a51cc","category":"Cycling"}