{"title":"Super High-Fidelity Mario: The quest to find original gaming audio samples","link":"https://arstechnica.com/?p=1740020","date":1612555947000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>now hear this —</h4><h2 itemprop=\"description\">Investigation of original, uncompressed samples leads to CD-quality restorations.</h2></header><div itemprop=\"articleBody\"><figure><p><iframe type=\"text/html\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/SyN7qOFyG9Q?start=0&amp;wmode=transparent\" frameborder=\"0\" allowfullscreen=\"\"></iframe></p><figcaption><p>One of many <em>Super Mario World</em> tracks that have now been remastered from their original, high-fidelity audio samples.</p></figcaption></figure><p>Classic-gaming archaeology doesn't always revolve around digging up&nbsp;<a href=\"https://arstechnica.com/gaming/2018/01/see-the-long-lost-nes-prototype-of-simcity/\">rare</a> and <a href=\"https://arstechnica.com/gaming/2021/02/we-have-finally-played-the-lost-official-goldeneye-007-remaster-for-xbox-360/\">unreleased</a> games. Sometimes, it's about taking well-known relics and reconstructing them from newly unearthed and higher-fidelity original component parts. As a result of this work, one of the biggest games of all time <a href=\"https://www.youtube.com/playlist?list=PLD-vbw8Jmuyg3JYDxm1QPPj1mP3soOVEx\">now sounds completely different</a>.</p><p>Remastering the <em>Super Mario World</em> soundtrack in this way means diving deep into the world of compressed video game audio samples. These were most common in the late cartridge era; the samples were nestled between the literal bleeps and bloops of the earliest video game sound chips and the CD-quality audio of the optical disc. Games in this era would frequently chain together brief snippets of recorded audio and replay them over and over with different effects, as if they'd been loaded into an electronic keyboard.</p><p>The game cartridges couldn't store much data, of course, so the original synthesizer samples usually took a heavy hit in fidelity during the transition to game soundtracks. \"The composer [often felt] obligated to sacrifice sound quality to get their music running without any lag and to fit into the cartridge,\" said Michael, a video game music source investigator from El Salvador (who didn't share his last name). \"Especially if all the audio work is made by the CPU (like on the Nintendo 64), this limitation can distort how the music sounds. In some ways, this isn't the best take of the game's music.\"</p><p>\"As a person who enjoys video game music, it made me wonder how the music would sound without those limitations. It's like old photo restorations, where they clean the photo and add color to it.\"</p><figure><p><iframe type=\"text/html\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/pl_PpuGlb1U?start=0&amp;wmode=transparent\" frameborder=\"0\" allowfullscreen=\"\"></iframe></p><figcaption><p>American audiences never even got to hear the compressed version of this tune, much less this high-fidelity recreation.</p></figcaption></figure><p>Michael is not alone. He's part of a loose collection of hundreds of video game music (VGM) source investigators who have spent years scouring old audio collections and analyzing classic synthesizer hardware to track down the original, uncompressed samples that were the building blocks for some classic video game tracks. That work has resulted in complete, uncompressed recreations for <a href=\"https://www.youtube.com/watch?v=xsNZjGQND2A\">a number</a> of <a href=\"https://www.youtube.com/watch?v=pl_PpuGlb1U\">classic</a> gaming <a href=\"https://www.youtube.com/watch?v=TaHKLtvRKa8\">tunes</a>&nbsp;that now have a richer, fuller audio profile that can completely change a listener's perspective.</p><p>Remastering game tracks from their original sources in this way \"provides a better glimpse of what the song would have sounded like as a demo track, before reverse-engineering it for the console,\" said VGM source investigator and audio producer Moola, based in Upstate New York.</p><p>\"I think it can breathe some new life into songs with compressed instruments—hearing them with lost frequencies and with more clarity or clearness\" added Miles, a VGM source investigator from the US.</p><h2>The search</h2><p>The organized effort to identify original video game sound samples dates back to at least 2012, when user AceKombat started <a href=\"https://hcs64.com/mboard/forum.php?showthread=24937\">an unassuming thread on the Halley's Comet Software message boards</a> titled \"The VGM/Others Instrument Source Thread.\" Nine years and thousands of posts later, that thread is <a href=\"https://hcs64.com/mboard/forum.php?showthread=24937&amp;showpage=232\">still going strong</a>, alongside newer Discord servers and <a href=\"https://docs.google.com/spreadsheets/d/1JJBlHHDc65fhZmKUGLrDTLCm6rfUU83-kbuD8Y0zU0o/edit\">Google spreadsheets</a>, in which a community of hundreds of sound sleuths discusses its findings.</p><p>\"Sometimes, I'll be listening to a video game song and I'll hear something in the background and immediately recognize it from <a href=\"https://en.wikipedia.org/wiki/Virtual_Studio_Technology\">a VST plugin</a> or sample library,\" Miles said. \"Others, I'll be listening to a plugin or sample and recognize it from a song I know. Other times, I have to take a second or third listen to a song or source, and the connection between them will click for me.\"</p><p>Often, identification of a single sample can cascade into a chain of discoveries. \"[Audio equipment manufacturer] Prosonus released their stuff in different libraries and other media,\" Michael said. \"[So] if we find some sample from this manufacturer that was used in a game, that gives us a clue to research if the composer used more stuff from this manufacturer. Most of the time, this gives us discoveries without knowing the composer's gear.\"</p><p>Sometimes, though, a sound investigation requires outside historical research in addition to a good ear. Community members were able to track down contemporaneous pictures of famed Nintendo composer Koji Kondo <a href=\"https://equipboard.com/pros/koji-kondo/kawai-k1r\">sitting in a studio with a Kawai K1 synthesizer</a>, which turned out to be the source of many iconic samples from <em>Super Mario World</em>.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/kondok1.png\" data-height=\"1080\" data-width=\"1920\" alt=\"Photos like this one of Koji Kondo at work provide crucial clues to reconstructing the original samples behind old game music.\"><img alt=\"Photos like this one of Koji Kondo at work provide crucial clues to reconstructing the original samples behind old game music.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/kondok1-640x360.png\" width=\"640\" height=\"360\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/kondok1-1280x720.png 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/kondok1.png\" data-height=\"1080\" data-width=\"1920\">Enlarge</a> <span>/</span> Photos like this one of Koji Kondo at work provide crucial clues to reconstructing the original samples behind old game music.</p></figcaption></figure><p>Hardware and library information can also come from unexpected sources. Last summer's <a href=\"https://arstechnica.com/gaming/2020/07/nintendo-gigaleak-reveals-classic-nintendo-prototypes-source-code/\">\"Gigaleak\" of early Nintendo documents and source code</a>, for instance, included some file names and notes that alluded to samples from the Samplecell Factory Library and the Roland D-50 synthesizer in games like <em>Super Mario Advance</em> and <em>Star Fox 64</em>. Those sources turned out to be the key to unlocking the true origins of some long-undiscovered samples in games like <em>Super Mario World</em> and <em>Super Mario 64</em>.</p><p>Other times, investigators have to get around a lack of access to a composer's original synthesizer hardware. \"[Famed Rareware composer] Grant Kirkhope had a Proteus FX, [but] we don't have an emulator or third-party sample libraries for that synth,\" Michael notes. \"But we have the first three Proteus series, which share samples with Proteus FX. [Because] the manufacturer tends to recycle their stuff, this will give us clues to spot the original sources.\"</p><h2>Make me a match</h2><p>With a composer's original synthesizer and/or library identified, picking out which specific sample matches an in-game \"instrument\" line can still be a painstaking process. \"A confirmed 'match' requires the waveforms to look and sound similar and the spectra to match,\" Moola said. \"If certain frequencies appear significantly different between samples, the sample is often 'deconfirmed.'\"</p><p>Even when you identify a true source sample, overlap in various historical sound libraries can make further investigation difficult. In Roland synthesizers, for instance, VGM Instrument Sources Discord moderator NintendoGurkan notes that \"there's a certain acoustic guitar that they have used in many of their synths, so if you end up finding it in a song, it's not easy to know where it comes from unless you know the exact gear the composer owns. Sometimes, an instrument can even appear in multiple libraries that were released by completely different companies.\"</p><figure><p><iframe type=\"text/html\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/TaHKLtvRKa8?start=0&amp;wmode=transparent\" frameborder=\"0\" allowfullscreen=\"\"></iframe></p><figcaption><p>This is what the SNES CD version of <em>Super Metroid</em> might sound like...</p></figcaption></figure><p>The search can require a lot of dedication. \"For around eight months, I was looking for a construction kit (a folder of a mini-song, with stems of different melodies) used in a game called <em>Garfield 2</em>,\" Miles said. \"That game is pretty interesting since it uses a lot of samples from sample libraries for drums, melodies, and other sounds. But the one used in the 'Hall' theme in particular intrigued me because I ended up finding it in one other video game song (from <em>Destroy All Monsters 2</em>) and a production music song.\"</p><p>Miles scoured through a bunch of disco-themed sample packs to unearth the perfect match and found some guitar and synth samples that \"sounded very similar\" but weren't quite right, he said. It wasn't until Christmas Day 2020 when he said he stumbled upon a 2004 sample pack called \"Sounds of the '70s\" that had what he was looking for. \"It was [in] a folder called '110-Doctor Groovenstein,'\" Miles recalled.</p><h2>From samples to songs</h2><p>Once every sample from a particular video game track has been identified, individual artists can restore the song to its original, uncompressed glory (the results usually end up scattered on individual YouTube channels; a few examples are embedded in this story). But even then, there is some debate about how to balance authenticity with quality.</p><p>\"There are multiple types of restoration, some of which are more faithful to the original tracks than others,\" Moola said. \"In my restorations, I use the original sequence data and apply the uncompressed instruments, then mix everything and apply effects where needed to make it sound modern. I don’t try to recreate, say, the bad loop points or the exact echo effect that was used in the original tracks.</p><p>\"While it’s not one-to-one with the original, it sounds close enough to be recognized, and I want people to think about what they’ve been missing out on for the decades the game has been out,\" Moola continued.</p><blockquote><p>[Restoration]&nbsp;provides a better glimpse of what the song would have sounded like as a demo track, before reverse-engineering it for the&nbsp;console.</p></blockquote><p>Other restorers take a different tack, though, trying to match the panning, volume, reverb levels, and other plugin effects found in the original game. \"Generally, I think it's best to match up the sounds as best as you can while retaining a higher quality,\" Miles said. \"It's basically trying to translate the game's mixing to traditional audio mixing,\" Michael added. \"This depends [on the specific] person, so it can vary a lot in how the [restorations are mixed].\"</p><p>Transforming compressed mono samples back to their original stereo sources can also introduce some vagaries to the restoration process. \"If you want to make a good restoration, you have to mix the stereo samples or synths with the mono ones,\" Michael said. \"I care about mono compatibility, so I make sure that my restoration also sounds good on mono.\"</p><p>For some, this restoration process is a way into the original artist's head. \"Locating sample origins and recreating songs from a game from last year is as captivating to me as doing the same for a game from 1990,\" Moola said. \"It’s all about trying to think how the composer would [do it], and to me that’s the most interesting part.\"</p><p>For others, the process is a great way to discover more about the classic music they love. Why does Michael do it? \"Because music isn't only about theory and composition,\" he said. \"It's also about technology and how it goes hand in hand with musicians and history... In the past, [music production] was really different, and it's interesting to look at that retrospectively.\"</p><p>\"And of course, [you gain] knowledge!\"</p><p><em>Listing image by <a href=\"https://equipboard.com/pros/koji-kondo/kawai-k1r\">Equipboard</a></em></p></div></div></div>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1338abb26fc08b1d85fc5819db11c6bdcd17886e6aa40d5457332845cef38828","category":"Tech"}