{"title":"Spotlight: Warmfront Chest Warmer","link":"https://cyclingtips.com/2021/03/spotlight-warmfront-chest-warmer/","date":1616455500000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>We already have a wealth of good options for helping us stay warm and cozy during the cooler mornings and evenings as the world makes the transition between winter and summer. Vests/gilets? Ultralight jackets? Windproof jerseys? Check, check, and check.&nbsp;</p><p>So do we really need another one? Maybe.</p><p>Warmfront is an upstart Colorado company offering a modern (and far more functional) take on the old-fashioned dickey. Just as the name suggests, these chest warmers add an extra layer right on the front of your torso, where it’s arguably needed most.&nbsp;</p><p>There are three versions available. The Ultralight uses a waffle-pattern fleece body, whereas the Koselig (“cozy” in Norwegian) incorporates an additional windproof layer for extra protection. Both include high-cut collars with Velcro closures for easy on-and-off and several pattern choices for the collar. Finally, there’s the Warmfront Max, which uses a more traditional fleece material for insulation, but with a laminated windproof layer and built-in waffle-pattern fleece neck warmer. All of them roll up super small (smaller than a pair of arm warmers) to easily tuck away in a jersey pocket.</p><p>Warmfront even offers custom sizing — possible only because of the small-batch, local manufacturing — and the company also has a “<a href=\"https://www.thewarmfront.com/buy-one-give-one.html\" target=\"_blank\" rel=\"noreferrer noopener\">Buy One Give One</a>” program whereby a special Warmfront is donated to a breast cancer survivor for every one purchased at retail.</p><p>Do these look a little silly? Well, by themselves, sure — but they’re not supposed to be visible, anyway. And wouldn’t a vest do the same thing while keeping the windproof layer on the very outside? Yes again, but they also don’t feel quite as warm, either.&nbsp;</p><p>Silliness aside, I have to admit after using these for a few weeks that they actually work pretty well, and they’ve also been handy for other activities like skiing. And truth be told, I haven’t found them to be a replacement for a vest or jacket, but rather a good addition to one to expand the comfortable temperature range of my kit even further. The pricing isn’t too bad, either.</p><p><strong>Price: </strong>US$29-39 / AU$40-50</p><p><strong>More information: </strong><a href=\"http://www.thewarmfront.com/\" target=\"_blank\" rel=\"noreferrer noopener\">www.thewarmfront.com</a></p><div data-block-name=\"highlight-box\" id=\"\"><p><em>Follow the link to see previous products we’ve reviewed in our <a href=\"https://cyclingtips.com/tag/spotlight/\" target=\"_blank\" rel=\"noopener\">Spotlight series</a>.</em></p></div><div><h5>Tags</h5></div></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1367ed2a961bb83d464cf1dde91c415fe9ec16575e75c99246551f6208ab0120","category":"Cycling"}