{"title":"Tens of thousands of US organizations hit in ongoing Microsoft Exchange hack","link":"https://arstechnica.com/?p=1747745","date":1615071007000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>MASS HACK —</h4><h2 itemprop=\"description\">Multiple hacking groups are exploiting vulnerabilities to backdoor unpatched servers.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/10/malware-800x600.jpg\" alt=\"A stylized skull and crossbones made out of ones and zeroes.\"><figcaption></figcaption></figure><p>Tens of thousands of US-based organizations are running Microsoft Exchange servers that have been backdoored by threat actors who are stealing administrator passwords and exploiting critical vulnerabilities in the email and calendaring application, it was widely reported. Microsoft <a href=\"https://arstechnica.com/information-technology/2021/03/microsoft-issues-emergency-patches-for-4-exploited-0days-in-exchange/\">issued</a> emergency patches on Tuesday, but they do nothing to disinfect systems that are already compromised.</p><p>KrebsOnSecurity was the <a href=\"https://krebsonsecurity.com/2021/03/at-least-30000-u-s-organizations-newly-hacked-via-holes-in-microsofts-email-software/\">first to report</a> the mass hack. Citing multiple unnamed people, reporter Brian Krebs put the number of compromised US organizations at at least 30,000. Worldwide, Krebs said there were at least 100,000 hacked organizations. Other news outlets, also citing unnamed sources, quickly followed with <a href=\"https://www.wired.com/story/china-microsoft-exchange-server-hack-victims/\">posts</a> <a href=\"https://www.reuters.com/article/us-usa-cyber-microsoft/more-than-20000-u-s-organizations-compromised-through-microsoft-flaw-source-idUSKBN2AX23U\">reporting</a> the hack had hit <a href=\"https://www.wsj.com/articles/china-linked-hack-hits-tens-of-thousands-of-u-s-microsoft-customers-11615007991\">tens of thousands</a> of organizations in the US.</p><h2>Assume compromise</h2><p>“This is the real deal,” Chris Krebs, the former head of the Cybersecurity and Infrastructure Security Agency, <a href=\"https://twitter.com/C_C_Krebs/status/1367673471669526528\">said</a> on Twitter, referring to the attacks on on-premisis Exchange, which is also known as Outlook Web Access. “If your organization runs an OWA server exposed to the internet, assume compromise between 02/26-03/03.” His comments accompanied a Tweet on Thursday from Jake Sullivan, the White House national security advisor to President Biden.</p><h2>Hafnium has company</h2><p>Microsoft on Tuesday said on-premises Exchange servers were being hacked in “limited targeted attacks” by a China-based hacking group the software maker is calling Hafnium. Following Friday’s post from Brian Krebs, Microsoft updated its <a href=\"https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/\" rel=\"nofollow\">post</a> to say that it was seeing “increased use of these vulnerabilities in attacks targeting unpatched systems by multiple malicious actors beyond HAFNIUM.”</p><p>Katie Nickels, director of intelligence at security firm Red Canary, told Ars that her team has found Exchange servers that were compromised by hackers using tactics, techniques, and procedures that are distinctly different than those used by the Hafnium group Microsoft named. She said Red Canary has counted five “clusters that look differently from each other, [though] telling if the people behind those are different or not is really challenging and unclear right now.”</p><p>On Twitter, Red Canary <a href=\"https://twitter.com/redcanary/status/1367935292724948992\">said</a> that some of the compromised Exchange servers the company has tracked ran malware that fellow security firm Carbon Black <a href=\"https://www.carbonblack.com/blog/cb-tau-technical-analysis-dltminer-campaign-targeting-corporations-in-asia/\">analyzed</a> in 2019. The malware was part of an attack that installed cryptomining software called DLTminer. It's unlikely Hafnium would install a payload like that.</p><p>Microsoft said that Hafnium is a skilled hacking group from China that focuses primarily on stealing data from US-based infectious disease researchers, law firms, higher-education institutions, defense contractors, policy think tanks, and nongovernmental organizations. The group, Microsoft said, was hacking servers by either exploiting the recently fixed zeroday vulnerabilities or by using compromised administrator credentials.</p><p>It’s not clear what percentage of infected servers are the work of Hafnium. Microsoft on Tuesday warned that the ease of exploiting the vulnerabilities made it likely other hack groups would soon join Hafnium. If ransomware groups aren’t yet among the clusters compromising servers, it’s almost inevitable that they soon will be.</p><h2>Backdooring servers</h2><p>Brian Krebs and others reported that tens of thousands of Exchange servers had been compromised with a webshell, which hackers install once they’ve gained access to a server. The software allows attackers to enter administrative commands through a terminal Window that’s accessed through a web browser.</p><p>Researchers have been careful to note that simply installing the patches Microsoft issued in Tuesday’s emergency release would do nothing to disinfect servers that have already been backdoored. The webshells and any other malicious software that have been installed will persist until it is actively removed, ideally by completely rebuilding the server.</p><p>People who administer Exchange servers in their networks should drop whatever they’re doing right now and carefully inspect their machines for signs of compromise. Microsoft has listed indicators of compromise <a href=\"https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/\" rel=\"nofollow\">here</a>. Admins can also use <a href=\"https://github.com/microsoft/CSS-Exchange/tree/main/Security\">this script</a> from Microsoft to test if their environments are affected.</p><p>This week’s escalation of Exchange server hacks comes three months after security professionals uncovered the hack of at least nine federal agencies and about 100 companies. The primary vector for infections was through software updates from network tools maker SolarWinds. The mass hack was one of—if not <em>the</em>—the worst computer intrusions in US history. It’s possible the Exchange Server will soon claim that distinction.</p><p>There’s still much that remains unknown. For now, people would do well to follow Chris Krebs’ advice to assume on-premises servers are compromised and act accordingly.</p></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"14701e4ec49c8e577175c9e681cb742e5f268b908945e349cf4995697aa5fe2b","category":"Tech"}