{"title":"Apple is already working on developing 6G wireless technology","link":"https://arstechnica.com/?p=1743468","date":1613676023000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>All the Gs —</h4><h2 itemprop=\"description\">6G is still many years away, but Apple doesn't want to depend on Qualcomm again.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/10/iPhone-12-and-12-Pro-header-800x445.jpg\" alt=\"The iPhone 12 and 12 Pro, side-by-side\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/10/iPhone-12-and-12-Pro-header.jpg\" data-height=\"1033\" data-width=\"1857\">Enlarge</a> <span>/</span> The iPhone 12 and 12 Pro, side by side.</p><p>Samuel Axon</p></figcaption></figure><p>Apple has <a href=\"https://jobs.apple.com/en-us/details/200200769/ran1-ran4-standards-engineer?team=HRDWR\">posted</a> multiple <a href=\"https://jobs.apple.com/en-us/details/200223684/wireless-research-systems-engineer-5g-6g?team=HRDWR\">job listings</a> indicating that it is hiring engineers to work on 6G technology internally so it does not have to rely on partners like Qualcomm as the next generation of wireless technology hits several years down the line.</p><p>The job listings, which were first spotted and reported by <a href=\"https://www.bloomberg.com/news/articles/2021-02-18/apple-hiring-engineers-to-develop-6g-wireless\">Bloomberg</a>, include titles like \"Wireless Research Systems Engineer - 5G/6G\" and \"RAN1/RAN4 Standards Engineer.\"</p><p>The listings have statements like \"You will be part of a team defining and doing research of next-generation standards like 6G,\" \"You will research and design next-generation (6G) wireless communication systems for radio access networks with emphasis on the PHY/MAC/L2/L3 layers,\" \"Participate in industry/academic forums passionate about 6G technology,\" and \"Contribute to future 3GPP RAN work items on 6G technology.\"</p><p>The roles are in the company's Cupertino headquarters, as well as in San Diego, where Apple opened offices specifically to focus on wireless and silicon technologies, with an apparent aim to snipe talent from Qualcomm's San Diego HQ.</p><p>Apple introduced its first 5G iPhones in the iPhone 12 lineup late last year, and those phones use Qualcomm modems. But recent reports have already revealed that Apple plans to <a href=\"https://arstechnica.com/gadgets/2020/12/apple-is-full-steam-ahead-on-replacing-qualcomm-modems-with-its-own/\">design its own modems</a> so it can drop the Qualcomm components from future phones, just as it is developing its own silicon for Macs now to ultimately replace Intel chips in most of the product lineup.</p><p>Total end-to-end integration of all parts of the hardware, software, and services in devices has long been both a key marketing point and an internal guiding principle for product development at Apple. The company says it believes this approach enables better products and experiences for users, but it also allows Apple to forge ahead with less and less dependence on other actors to achieve success.</p><p>Apple recently <a href=\"https://www.cnet.com/news/apple-google-lg-join-industry-group-working-on-6g/\">joined</a> the industry group \"Next G Alliance\" with other companies like LG and Google to work together to define the specifications for 6G, which is nascent and not expected to reach consumers for many years yet. There are no details yet about either the timeline, specifications, or features of 6G. 5G is only just rolling out in the past couple of years, and the vast majority of the globe does not yet have access to 5G or the full capabilities thereof.</p><p>So when Apple joins groups like the Next G Alliance or hires for positions like these, it's not generally going to tell us much about near-future product plans. That said, reports of the company's progress on its own modems suggest that Apple is likely to reach that capability before 6G rolls out, so the first Apple-made modems will probably be 5G, not 6G.</p><p>In our <a href=\"https://arstechnica.com/gadgets/2020/10/iphone-12-and-12-pro-double-review-playing-apples-greatest-hits/\">reviews of the iPhone 12 lineup</a> last year, we found that 5G had a significant negative impact on the phones' battery life. Future modem refinements may reduce that impact.</p></div></div>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"14c918e6e659b6adb3271a441b18c830942068018a191ecb50f182e0348ca1e1","category":"Tech"}