{"title":"How the Velosense Formula 1 probe is helping Jumbo-Visma dominate time trialling","link":"https://cyclingtips.com/2021/07/how-the-velosense-formula-1-probe-is-helping-jumbo-visma-dominate-time-trialling/","date":1626510760000,"content":"<div><p></p><h4>I spotted this aero sensor on the front of Jonas Vingegaard P5.</h4><p></p><div><p>Ahead of the final time trial of this year’s Tour de France, we want to look back to the first time trial, and specifically an aero sensor we spotted on Jonas Vingegaard’s Cervelo P5. </p><p>We spotted this sensor on Vingegaard’s bike as he headed out on the morning recon, and once again, as he returned, team mechanics removed it from below the handlebars. Vingegaard went on to finish third in that time trial a few hours later, the first glimpse of his GC potential at this <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a>. Check out our <a href=\"https://cyclingtips.com/2021/07/gallerytour-de-france-time-trial-tech-part-two/\" target=\"_blank\">time trial tech gallery</a> to see those photos. After several conversations, we can now confirm the sensor is from VeloSense, aerodynamic sensor specialists in Formula One and cycling. </p><p>In short, it’s designed to measure aerodynamic drag, wind speed, elevation, wind direction, and more in real time, which teams can then use along with power and other data to optimise position, equipment, and pacing.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/Velosense-Ventos-aero-sensor-horizontal-zoom-1340x754.jpg\"><figcaption>The Velosense Ventos is a wind speed, yaw angle and altitude measuring aero sensor.</figcaption></figure><p>Velosense is a British company set up by Formula One aerodynamicists Barnaby Garrood and John Buckley. Both men are keen cyclists and wanted to bring their aerodynamic expertise to the cycling world. </p><p>I spoke with Buckley, who confirmed the sensor on Vingegaard’s bike is from Velosense: “That is one of our Ventos sensors on a central mount. It measures wind speed, direction, and altitude.”  </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/Velosense-Ventos-Formula-one--1340x754.jpg\"><figcaption>The Ventos is a variant of Velosense’s patented Formula One aero probe.</figcaption></figure><p>According to the Velosense website, Buckley and Garrood started with their patented probe design from their Formula One days, which measures wind speed and yaw angles. </p><p>Yaw angle and accurate elevation have proved a challenge for aero sensor designers and manufacturers. The Ventos probe measures yaw angle, and Velosense claims elevation accuracy is within 20cm. The elevation accuracy is particularly important for an aerosensor to provide accurate CdA calculations and this level of accuracy is almost unheard of. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/Velosense-ventos-aero-sensor-1340x754.jpg\"><figcaption>A better photo of the Ventos on a time trial bike.</figcaption></figure><p>Although he couldn’t go into any specifics of work with teams, Buckley did say “We have been working with selected partners to improve their performance, and in this case they are measuring the wind speed and direction prior to the TT” </p><p><em>“The primary use for the sensor is measuring aerodynamic drag (CdA), but it can also map the wind speed and direction along a course to provide a team’s riders with detailed information about the wind around the course, highlighting any areas that might have increased winds.”</em></p><p>The Ventos has three main uses; </p><ol><li>Traverse lap testing: the rider completes an out and back loop starting and finishing at the same place. Velosense claims the ventos can measure CdA with velodrome testing levels of accuracy. </li><li>  Snapshots: Velosense can analyse any session using an algorithm that automatically picks out suitable sections within a ride to track a riders CdA and ability to maintain position throughout a ride. The algorithm checks airspeed, braking, cornering etc., to find these segments and provide a snapshot of a rider’s CdA at multiple points in a ride.  </li><li>Realtime CdA and Poweradvantage: When paired with a compatible head unit, the Ventos can calculate and display “realtime” CdA. This real-time is actually a timed rolling average. Velosense currently recommends a 45 seconds average but are working on technology to get this down to just 15 seconds. </li></ol><p>Velosense also has ambitions to use GPS to create a section-based average. As the technology improves, the hope is that this section-based testing should have similar accuracy to that of the traverse testing. </p><p>The Ventos also calculates what Velosense calls a rider’s Poweradvantage, using airspeed and body position. This compares the rider’s current position to previously acquired position data to estimate the number of watts a rider could gain or lose compared to the “ideal” position. </p><p>Velosense suggests this feature could help riders determine whether an aero or upright position will be best on an uphill.  </p><p>Buckley couldn’t go into too many specifics, but explained that the Ventos pairs to another sensor from Velosense, the Zenith, to measure the rider’s head position, torso position and if the rider is seated or standing. All this is used in calculating the Poweradvatnage metric.  </p><p>Velosense believes pairing body position and aero sensor data together will enable riders to perfect their positions, measure how sustainable the position is, and get a better understanding of how their body position affects aero drag. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/Tour-de-France-time-trial-368-1340x754.jpg\"><figcaption>While Buckley could not confirm who the selected partners are, we can make a fairly good guess.</figcaption></figure><p>Velosense is currently only supplying sensors to selected partners as it refines the final offering, but its long term plan is to deliver affordable and accurate aero testing to the public. “Velosense’s aim is not just to measure a cyclists drag, but to combine knowledge of body position and drag to allow rider’s to ride more efficiently and comfortably,” Buckley said.</p><blockquote><p>“Our long term goal is to make a consumer device that will make aero testing more affordable and effective for competitive cyclists. Currently we are working with selected partners to improve rider performance and reduce fatigue through our aerodynamic and body sensors. I cannot disclose who we are working with, but I can confirm that sensor in the picture is one of our Ventos Aero Sensors.”</p><cite>John Buckley</cite></blockquote><p>What is perhaps most interesting is that both Jumbo-Visma and Mercedes F1 teams are using variants of the Velosense probe, which speaks to Velosense’s experience in the aerodynamics field. Jumbo-Visma has dominated time trialling this season, and Mercedes has won the last seven world championships.</p><p>It is expected that Jumbo-Visma will again use the sensor during recon ahead of Saturday’s TT. I asked Buckley why the team would use the Ventos sensor on the morning of the first time trial, as it seemed unlikely the team would adjust rider positions so close to a Tour de France TT. </p><p>“The reason for running a sensor on the recon lap on the day of the race is that it gives the team an accurate measurement of the wind speed and direction over the entire course” Buckley explained. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/Tour-de-France-time-trial-371-1340x754.jpg\"><figcaption>Mechanics removed the Ventos from Vingegaard’s P5 immediately after the recon ride.</figcaption></figure><p>Of course similar data is available with modern weather apps and a local weather station. Buckley explained “these published measurements are taken at 1.5 meters above the ground in a clear location. The local wind speed and direction which the cyclist actually encounters at different locations on the course can vary by up to 90° depending and half the speed. </p><p>“A simple example would be a road with buildings along both sides. The wind direction must change for it to pass around the building. Therefore the wind in cities generally travels along the direction of the roads. The effect is called ‘canalisation’ and can also occur with hills, canyons, hedgerows, etc.”</p><p>Buckley explained that Team Jumbo-Visma uses this information to create more detailed race strategies, relay areas of unexpected wind changes or gusts in an opening, and inform equipment selection decisions.  </p><p>“During the development of the Velosense aero probe, we often saw sharp spikes in wind which we initially attributed to hardware or software problems. When we mapped these spikes onto GPS we would usually find that they corresponded to gates in hedges or gaps between buildings. We are now able to provide wind information along an entire course showing specific points where the wind speed may spike or the wind angle changes can be noted and the rider can approach those sections on the upwind side of the road, which reduces the chances of being blown off the road. If the winds are severe, a less aggressive wheel option may be chosen.”</p><p>Buckley also explained the team could use the data collected on the morning recon for correlation and comparison. “For climbers, watts per kilogram is the yardstick, for time trialists, it is watts vs CdA. Therefore in order for teams to be competitive, they do not just need to know their riders power on the day, but also to have some measure of their aerodynamic drag, as it often deviates in races from training and the wind tunnel.”</p><p>I spoke to Mathieu Heijboer, head of performance at Jumbo-Visma for an upcoming <a target=\"_blank\" href=\"https://cyclingtips.com/tag/cyclingtips-nerd-alert-podcast/\">Nerd Alert podcast</a> and asked him about how the team uses the Velosense Ventos. </p><p>Heijboer repeated the value of creating a wind profile for a course on race day to inform wheel selection, and also explained how the team used the Ventos to optimise Vingegaard’s time trial position despite Covid-19 lockdowns in Denmark over the winter.  </p><p>Somewhat surprisingly, Heijboer explained Vingegaard has never been in a wind tunnel and was the fastest rider in the stage five time trial not to have optimised his position in a wind tunnel. </p><p>For more information, visit <a target=\"_blank\" href=\"https://www.velosense.com/\">www.velosense.com</a></p></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1556478ae475d07f089b99bf9805a132123f2f213eb6315efeb93bcfbf5a8eb0","category":"Cycling"}