{"title":"Lachlan Morton’s next adventure is a 1,000km mountain bike race in South Africa","link":"https://cyclingtips.com/2021/11/lachlan-mortons-next-adventure-a-1000km-mountain-bike-race-in-south-africa/","date":1637771638000,"content":"<div><div><p>Lachlan Morton’s next adventure will take him on a mountain bike journey of more than 1,000km across South Africa.</p><p>The 29-year-old Australian is currently gearing up for The Munga, which will get underway on December 1 in Bloemfontein. The race, first run in 2014, traverses the dry Karoo region as it makes its way towards Wellington in the Cape Winelands, some 70km from Cape Town. Organizers describe the event as a single-stage, “semi-supported” mountain bike race; there are five race villages and 10 water points along the route, but outside of those areas, riders must support themselves. Whoever makes it from start to finish first wins.</p><p>“Every time I’ve come to South Africa, people have told me about it and been like, ‘You should come to this, race this,'” Morton told CyclingTips by phone this week. “It’s always been a little bit in the too-hard basket, just being in December. It’s never made sense to come and do it. And then I was here for the Cape Epic, got home and I didn’t feel like I had all the racing out of me, if that makes senes, so I was like, ‘Why don’t I go and do the Munga?’ It’s the perfect opportunity to come and see what it’s all about and race it.”</p><p>As he has focused on “alternative” adventures the past few years, Morton has completed quite a few long-distance challenges, including winning the GBDuro in 2019, setting the Fastest Known Time on the Kokopelli Trail in 2020, and riding the route of the 2021 Tour de France self-supported.</p><p>He said that he sees The Munga as an opportunity to get some “me time” in a place that he has long wanted to explore a bit more.</p><p>“I’ve been to South Africa … five times but I’ve only really spent time in Cape Town and the Western Cape area, so a big draw card was the idea of seeing a big chunk of the country, because it’s still somewhat of a mystery to me as to what’s out there,” Morton said. “What better way to see it then to just ride across?</p><p>“Another big draw card was the fact that I had a very busy three or four months, like, including since the Alt Tour, so I kind of really liked the idea of getting on the road with a singular focus again for a few days, just having a bit of me time. That was a draw card in that I felt like I needed that.”</p><p>At over 1,000km in length, his next challenge will cover multiple days on the bike with the five race villages offering potential places to sleep – but it will be up to the riders where and when they will stop to rest (if at all). Last year’s winner, Hansie Joubert, completed the race in under 57 hours, reportedly on a grand total of 20 minutes of sleep.</p><p>Morton plans to take a wait-and-see approach to deciding whether he will stop to sleep and for how long.</p><p>“With the checkpoint setup, it kind of allows you to maybe push the idea of, ‘I’m not going to sleep,’ and then if I have to, I’ll have a safety net there,” he explained. “My approach to these things is always, ‘I’m going to push and then the second I feel like I’m too tired I’m going to stop.’ That’s the way I’ve always done it. Sometimes that means you keep going for a few days, sometimes it means you need four hours of sleep on the first night.”</p><p>The combination of self-supported stretches with set checkpoints intrigues Morton, who says he is looking forward to see how that format impacts the race.</p><p>“You’re self-sufficient on the road but then you have access to food, water, and sleeping facilities at like five different stages, which just makes it logistically easy to get your head around, because you’re just like, ‘OK, I just need to be able to survive 200k at a time,” he said. “So that means you can get away with a little bit less research I think. But on the road, it’s kind of that same ruleset. You’re relying on yourself for everything you need.</p><p>“It’s a new format for me. I’ve never done a race with this kind fo setup, so I’m interested to see how that unfolds and how it impacts the way people approach it and race. But yeah, it’s just one big slog I think and then probably a few naps along the way.”</p><p>Morton and over 150 other riders will embark on their journey a week from Wednesday.</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"15871930d08f8fafadf30d4c481316e9add6dcd6c4b5485a9d4c8c3001043204","category":"Cycling"}