{"title":"Garmin Fenix 6 Pro Solar smartwatch review","link":"https://www.cyclist.co.uk/garmin/9224/garmin-fenix-6-pro-solar-smartwatch-review","date":1612888114000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>A bike computer is one of the pricier add-ons most riders might want to buy to get more out of their riding.&nbsp;But although it’s easy to use when riding, the shape and size of units like the <a href=\"https://www.cyclist.co.uk/garmin/9104/garmin-edge-1030-plus-gps-bike-computer-review\">Garmin Edge computers</a> mean that they’re not very useful if you do anything <em>except</em> cycling.</p><p>For other sports like running and swimming, a watch format makes a lot more sense.</p><p>The Garmin Fenix 6 Pro Solar promises all the cycling functionality of the Edge computers in a more versatile format, as well as broader health monitoring and support for sports from triathlon to golf and skiing. There’s light-based continuous heart rate monitoring and pulse oximetry built in.</p>&nbsp;<p>The Fenix 6 is available in three sizes: 42mm, 47mm and 51mm. I tested the intermediate 47mm size. It’s plenty large enough to read off your stats from the three data fields in the default view while riding. Like the Edge, you can parameterise the screens and fields displayed.</p>&nbsp;<p>At the same time, it’s not so large that I found that I bashed it into things, it was compact enough to push under a cuff and I was comfortable wearing it 24/7. It’s held up well through months of use and shows little sign of wear.</p><p>Controlling the Fenix 6 is simple too, via its five buttons. Unlike Suunto’s higher spec smartwatches, for example, there’s no touchscreen.</p>&nbsp;<p><a href=\"https://www.wiggle.co.uk/garmin-fenix-6-pro-solar-gps-watch\" target=\"_blank\"><em><strong>Buy the Garmin Fenix 6 Pro solar smartwatch now from Wiggle</strong></em></a></p><h3>Cycling functionality</h3><p>The Fenix 6 does pretty much everything an Edge does for a cyclist. Recording a ride is just a matter of pressing the start button, then pressing it again to stop recording once you get home.</p><p>During your ride, the Fenix 6 records your heart rate from your wrist. It’s usually as accurate as a strap, although I found that sometimes when I was wearing it under a jacket it could be induced to misread. It needs to be worn reasonably tight and above your wrist to get the best accuracy.</p><p>A disadvantage on winter rides is that you can’t easily see the screen and get a heart rate reading, without a jacket cuff getting in the way. But you can also pair the Fenix 6 up with a heart rate strap (and a power meter or other devices) via either ANT+ or Bluetooth.</p><p>I normally wore it over my jacket sleeve so it was readable; you can buy a mount for your handlebars from Garmin too.</p>&nbsp;<p>The Fenix 6 lets you follow a pre-planned route (which Garmin calls a course), which you can map in the Garmin Connect computer or phone app and upload to the watch. There’s also functionality in-built to calculate a route of a specified length and direction.</p><p>This uses Garmin’s data on riders’ preferred routes, so you’re unlikely to find yourself riding down a dual carriageway for miles.</p>&nbsp;<p>The course is displayed overlaid on a basemap, with the Fenix 6 giving you turn-by-turn guidance. The first turn warning is far enough in advance, but the second which an Edge would give you at the turn tended to come up after I’d passed a junction.</p><p>You get basemaps of the whole world, with your local area in enough detail to see woods, side roads and paths. It’s easy to see your route ahead on the map, although panning around is fiddly without a touchscreen as you need to press one button to cycle through zoom, move left/right and move up/down modes and another two to change what your’re looking at.</p><p><a href=\"https://www.wiggle.co.uk/garmin-fenix-6-pro-solar-gps-watch\" target=\"_blank\"><em><strong>Buy the Garmin Fenix 6 Pro solar smartwatch now from Wiggle</strong></em></a></p><p>Go off course and the Fenix 6 automatically notifies you and calculates a new route though, with the map zooming automatically to a larger view of your route back to that originally plotted.</p><p>As with Edge computers, you can get a route back to start too.</p><p>Other functionality that's in the Fenix 6 and also found in the Edge includes Bluetooth connectivity to a phone, letting you use LiveTrack, GroupTrack and Incident Detection functions. The phone can also push notifications for calls and texts to the Fenix 6.</p><p>At the end of your ride, you can upload it to Garmin Connect via Bluetooth, Wi-Fi or USB and then on to Strava or other training apps.</p>&nbsp;<h3>Health monitoring</h3><p>Wear the Garmin Fenix 6 all day and it can build up an impressive array of data about your fitness. That starts with number of steps and flights climbed each day. You get an estimated VO2 Max for running and estimated race times for different distances, although if you want cycling VO2 Max, you need a power meter.</p><p>There’s a calculation of stress level over the course of a day based on heart rate variability and a 'body battery' score that tracks how much you’ve depleted your reserves during the day.</p><p>They’re replenished by a good night’s sleep. Garmin tracks this, splitting your sleep into different phases and giving you a sleep score and narrative. The watch seemed to be able to work out when I went to bed and got up well enough, but sometimes thought I was asleep when I was awake and vice versa.</p><p>During sleep, it will log your movements, heart rate and breathing rate, as well as pulse oximetry. The last of these was less useful than I’d expected though and consistently measured lower than a medical grade oximeter.</p><p>Its main use is if you want to track your altitude acclimatisation, which under a stay-at-home order wasn’t relevant for me.</p>&nbsp;<h3>Solar charging</h3><p>The Fenix 6 Solar and Instinct Solar smartwatches add photovoltaic charging to the watch’s face. This can potentially boost your battery life, so you can run the watch for longer between charges.</p><p>With mixed use including a few hours of riding, I typically got five or six days’ use of the Garmin Fenix 6 Pro Solar between charges. The unit warns you that your battery level is below 30%, at which point you’ll get another bike ride or another couple of days before the battery gives up.</p><p>Recharging with Garmin’s proprietary USB cable takes a couple of hours.</p><p><a href=\"https://www.wiggle.co.uk/garmin-fenix-6-pro-solar-gps-watch\" target=\"_blank\"><em><strong>Buy the Garmin Fenix 6 Pro solar smartwatch now from Wiggle</strong></em></a></p><p>That doesn’t seem unreasonable, but I found that a burst of solar gain didn’t increase it significantly. In the depths of the UK winter, wearing the Fenix 6 over my jacket sleeve, the solar charging seldom registered over 50% efficiency and for short periods only. Wear the Fenix 6 Solar under a jacket and that would be zero.</p><p>On a cloudless day in the autumn, I was able to get around 100% solar charge efficiency. But even after four hours, I only saw a 2% increase in charge, which wouldn’t give you much extra battery life.</p>&nbsp;<p>Fortunately, you can go into the watch’s settings to turn off a lot of the functionality and lower the GPS tracking accuracy. The Fenix 6 lets you know how much you’ve extended the estimated battery life by so doing and you can get this up to three weeks plus.</p><p>That might be useful if you’re planning a long off-grid expedition, but for the cyclist the flip side is that you’re stopping a lot of the data collection that you’re likely to find useful.</p>&nbsp;<h3>Loads of other functions</h3><p>There’s a whole lot of other stuff packed into the Fenix 6, including maps of over 40,000 golf courses and ski piste maps. Plus you can use Garmin Pay to store credit card details, so you don’t have to carry extra means of payment with you on a ride and you can store playlists on the watch to listen to via Bluetooth headphones (but probably not when riding outside).</p><p><a href=\"https://www.wiggle.co.uk/garmin-fenix-6-pro-solar-gps-watch\" target=\"_blank\"><em><strong>Buy the Garmin Fenix 6 Pro solar smartwatch now from Wiggle</strong></em></a></p><p>As we’ve discussed previously, the Fenix 6 can sit alongside an Edge if you want to keep your cycling-specific GPS. For triathletes, Garmin lets you set the Edge up in Extended Display mode, which mirrors data from the Fenix on its screen, so you can see your stats on a larger unit as you ride – something also now offered by the new Wahoo Elemnt Rival Multisport GPS watch.</p><p>You get an impressive amount of functionality in the Garmin Fenix 6 Pro in a wearable that’s comfortable, has good battery life and weighs just 84 grams, with the extra functionality over a top spec Edge helping to justify the smartwatch’s price.</p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"15bb376dba2abe9c30713f9b0687ac5efa6fc7d6c3938562ccea3e5f89bfd333","category":"Cycling"}