{"title":"Qualcomm Debuts World's First 10 Gigabit 5G Modem, Destined for 2022 iPhones","link":"https://www.macrumors.com/2021/02/09/qualcomm-snapdragon-x65/","date":1612873805000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/09/qualcomm-snapdragon-x65/\"><p>Qualcomm today introduced the Snapdragon X65, the world's first 10 Gigabit 5G modem and antenna system for smartphones, enabling theoretical data speeds up to 10 gigabits per second. Apple will likely use the Snapdragon X65 in 2022 iPhones.</p><p><img alt=\"qualcomm snapdragon x65 10 gigabit 5g\" width=\"1600\" height=\"873\" src=\"https://images.macrumors.com/t/tX9x3ZTEjY_oUpMLXU1y60oRJ08=/400x0/filters:quality(90)/article-new/2021/02/qualcomm-snapdragon-x65-10-gigabit-5g.jpg?lossy\" data-src=\"https://images.macrumors.com/t/tX9x3ZTEjY_oUpMLXU1y60oRJ08=/400x0/filters:quality(90)/article-new/2021/02/qualcomm-snapdragon-x65-10-gigabit-5g.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/tX9x3ZTEjY_oUpMLXU1y60oRJ08=/400x0/filters:quality(90)/article-new/2021/02/qualcomm-snapdragon-x65-10-gigabit-5g.jpg?lossy 400w,https://images.macrumors.com/t/rPINFN8TY0-N_rdLQnHfE4Zr5aY=/800x0/filters:quality(90)/article-new/2021/02/qualcomm-snapdragon-x65-10-gigabit-5g.jpg?lossy 800w,https://images.macrumors.com/t/s6GkbcHHVBBYF-jIjYbTl48s0U0=/1600x0/filters:quality(90)/article-new/2021/02/qualcomm-snapdragon-x65-10-gigabit-5g.jpg 1600w,https://images.macrumors.com/t/NbGU2I9zXJeMeGdCiHbYmiiwfis=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/qualcomm-snapdragon-x65-10-gigabit-5g.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/tX9x3ZTEjY_oUpMLXU1y60oRJ08=/400x0/filters:quality(90)/article-new/2021/02/qualcomm-snapdragon-x65-10-gigabit-5g.jpg?lossy 400w,https://images.macrumors.com/t/rPINFN8TY0-N_rdLQnHfE4Zr5aY=/800x0/filters:quality(90)/article-new/2021/02/qualcomm-snapdragon-x65-10-gigabit-5g.jpg?lossy 800w,https://images.macrumors.com/t/s6GkbcHHVBBYF-jIjYbTl48s0U0=/1600x0/filters:quality(90)/article-new/2021/02/qualcomm-snapdragon-x65-10-gigabit-5g.jpg 1600w,https://images.macrumors.com/t/NbGU2I9zXJeMeGdCiHbYmiiwfis=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/qualcomm-snapdragon-x65-10-gigabit-5g.jpg 2500w\"><br>While real-world download speeds will likely remain far below the peak of 10 gigabits per second, devices equipped with the Snapdragon X65 should see faster 5G speeds overall. The modem has many other benefits, too, including improved power efficiency, enhanced coverage for both mmWave and sub-6 GHz bands, and support for all global commercialized mmWave frequencies, including the new n259 (41 GHz) band.</p><p>As with the previous-generation <a href=\"https://www.macrumors.com/2020/02/19/qualcomm-snapdragon-x60-5g-modem/\">Snapdragon X60</a>, the X65 can aggregate data from mmWave and sub-6GHz bands simultaneously to achieve an optimal combination of high-speed and low-latency coverage. The modem is paired with Qualcomm's new fourth-generation mmWave antenna module for extended mmWave coverage and power efficiency.</p><p>mmWave is a set of 5G frequencies that promise ultra-fast speeds at short distances, making it best suited for dense urban areas. By comparison, sub-6GHz 5G is generally slower than mmWave, but the signals travel further, better serving suburban and rural areas. mmWave support on iPhone 12 models is limited to the United States, but rumors suggest that iPhone 13 models <a href=\"https://www.macrumors.com/2021/01/04/iphone-13-may-feature-mmwave-5g-in-more-countries/\">may support mmWave in additional countries</a>.</p><p>In 2019, Apple and Qualcomm <a href=\"https://www.macrumors.com/2019/04/16/apple-qualcomm-settlement/\">settled a legal battle</a> and reached a multiyear chipset supply agreement, paving the way for Apple to use Qualcomm's 5G modems, starting with the Snapdragon X55 in iPhone 12 models. Beyond that, <a href=\"https://www.macrumors.com/2020/10/21/apple-qualcomm-5g-modem-roadmap/\">a court document from the settlement revealed</a> that Apple will likely use the Snapdragon X60 modem for 2021 iPhones, followed by the Snapdragon X65 in 2022 iPhones.</p><p>The Snapdragon X65 could be the last Qualcomm modem used in iPhones, as Barclays analysts and multiple other sources have forecasted that Apple will <a href=\"https://www.macrumors.com/2020/12/10/apple-developing-modem-in-house/\">switch to its own in-house 5G modem</a> for iPhones by 2023.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/intel-11th-gen-vs-apple-m1-chip-benchmarks/\">Intel Downplays Apple's M1 Chip With 'Carefully Crafted' Benchmarks</a></h3><p>Saturday February 6, 2021 3:17 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Nearly three months after the launch of Apple's rave-reviewed M1 Macs, Intel has fired back, but there are some asterisks involved. In a slideshow shared by PCWorld this week, Intel highlighted what PCWorld described as \"carefully crafted\" benchmarks in an attempt to prove that laptops with the latest 11th Generation Core processors are superior to those with Apple's custom-designed M1 chip. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-dtk-credit-for-developers-increased/\">Apple Ups DTK Mac Mini Return Credit to $500 After Developer Complaints</a></h3><p>Friday February 5, 2021 8:51 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Prior to the release of the M1 Macs, Apple offered developers a $500 Developer Transition Kit (DTK) that included a Mac mini equipped with an A12Z Bionic chip first used in the iPad Pro, 16GB RAM, a 512GB SSD, two USB-C ports, two USB-A ports, and an HDMI 2.0 port. The DTKs were available on a temporary basis, and earlier this week, Apple said that it would soon begin asking developers to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/01/imac-apple-silicon-redesign/\">iMac to Get a Whole New Look for Apple Silicon</a></h3><p>Apple's long-awaited iMac with Apple Silicon is expected to arrive this year featuring a complete redesign, according to a range of reports. According to Bloomberg's Mark Gurman, the redesigned iMac models will feature significantly slimmed down bezels around the display. The large aluminum \"chin\" segment, below the display of current iMacs, will be removed entirely for a design that...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/07/iphone-12-risk-magnets-pacemakers/\">Medical Doctors Underline Potential Risk of iPhone 12 Interference With Pacemakers</a></h3><p>Sunday February 7, 2021 4:11 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple's warning to keep the iPhone 12 away from cardiac devices due to electromagnetic interference was further underlined by U.S. cardiologists this week in a new report (via NBC25 News). Apple's iPhone 12 series includes an array of magnets that help align the phone on Apple's MagSafe charging accessory to maximize charging, and Apple already advises users with implanted pacemakers and...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/top-stories-ios-14-5-beta/\">Top Stories: iOS 14.5 Beta, macOS 11.2 Released, VR Headset and Apple Car Rumors</a></h3><p>It was a big week for software this week, with Apple kicking off a new round of betas for its operating systems with plenty of tweaks and changes in iOS 14.5 and related updates. We also saw the public release of macOS 11.2, which trailed last week's release of iOS 14.4. In other news, we got some significant new rumors about Apple's VR headset project and the Apple Car, while over on our...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-pauses-car-talks-hyundai-kia/\">Apple Pauses Electric Car Talks With Hyundai and Kia</a></h3><p>Friday February 5, 2021 2:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Multiple rumors over the course of the last week have suggested that Apple has been discussing Apple car manufacturing with Hyundai and Hyundai affiliate Kia, but those talks have paused recently, reports Bloomberg. Apple has also been discussing its Apple Car plans with other automobile manufacturers, so despite rumors suggesting Apple is considering a deal with Hyundai/Kia, Apple could...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/ios-14-5-beta-siri-default-music-service/\">Siri Setting in iOS 14.5 Beta Lets Users Select Default Music Streaming Service</a></h3><p>Monday February 8, 2021 4:09 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple last week released beta versions of upcoming iOS 14.5 and iPadOS 14.5 updates to developers and public beta testers, and among a number of new features, Apple has added the ability to set a default music streaming service when using Siri to play songs. Image via Reddit user matejamm1 First spotted by Reddit users, the first time you ask Siri to play a song in iOS 14.5, you are given the ...</p></div></div></div>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"166b1b34a889db1d191bb5ce87aaeb7c4400c246192abeb32956f35c8961d672","category":"Apple"}