{"title":"iOS 14.5 Beta Directs 'Safe Browsing' Traffic in Safari Through Apple Server Instead of Google to Protect Personal User Data","link":"https://www.macrumors.com/2021/02/11/ios-14-5-beta-safe-browsing-safari-apple-google/","date":1613034683000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/11/ios-14-5-beta-safe-browsing-safari-apple-google/\"><p>Starting with <a href=\"https://www.macrumors.com/guide/everything-new-in-ios-14-5-beta/\">iOS and iPadOS 14.5</a>, Apple will proxy Google's \"Safe Browsing\" service used in Safari through its own servers instead of relying on Google as a way to limit which personal data Google sees about users.</p><p><img alt=\"iOS 14 safari feature\" width=\"2250\" height=\"1266\" src=\"https://images.macrumors.com/t/WKZwL3lo_QkPMV8hvB9QJ2CBqpc=/400x0/filters:quality(90)/article-new/2020/08/iOS-14-safari-feature.jpg?lossy\" data-src=\"https://images.macrumors.com/t/WKZwL3lo_QkPMV8hvB9QJ2CBqpc=/400x0/filters:quality(90)/article-new/2020/08/iOS-14-safari-feature.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/WKZwL3lo_QkPMV8hvB9QJ2CBqpc=/400x0/filters:quality(90)/article-new/2020/08/iOS-14-safari-feature.jpg?lossy 400w,https://images.macrumors.com/t/5SiLTJNLGX4nQS66DZHiS5Grd38=/800x0/filters:quality(90)/article-new/2020/08/iOS-14-safari-feature.jpg?lossy 800w,https://images.macrumors.com/t/6BGwWd48UwyEpaPyrAmO34S92oI=/1600x0/filters:quality(90)/article-new/2020/08/iOS-14-safari-feature.jpg 1600w,https://images.macrumors.com/t/zyk1H0IGKjnAm1puE1gO2l-n6I0=/2500x0/filters:no_upscale():quality(90)/article-new/2020/08/iOS-14-safari-feature.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/WKZwL3lo_QkPMV8hvB9QJ2CBqpc=/400x0/filters:quality(90)/article-new/2020/08/iOS-14-safari-feature.jpg?lossy 400w,https://images.macrumors.com/t/5SiLTJNLGX4nQS66DZHiS5Grd38=/800x0/filters:quality(90)/article-new/2020/08/iOS-14-safari-feature.jpg?lossy 800w,https://images.macrumors.com/t/6BGwWd48UwyEpaPyrAmO34S92oI=/1600x0/filters:quality(90)/article-new/2020/08/iOS-14-safari-feature.jpg 1600w,https://images.macrumors.com/t/zyk1H0IGKjnAm1puE1gO2l-n6I0=/2500x0/filters:no_upscale():quality(90)/article-new/2020/08/iOS-14-safari-feature.jpg 2500w\"></p><p>Safari on iOS and iPadOS includes a built-in feature called \"Fraudulent Website Warning.\" As Apple describes it, having the feature enabled will prompt Safari to warn users if they're visiting a suspected phishing website, or in other words, a website attempting to steal your data such as username, passwords, and other information.</p><p>In order to provide this feature, Apple relies on Google's \"Safe Browsing,\" a database/blocklist of websites crawled by Google of websites that it deems to be suspected phishing or scam. In practice Google sends Safari a list of hashed prefixes of URLs that it determines to be malicious/phishing, Safari then checks the website you're trying to visit against the list from Google. Any match in hashed prefix will cause Safari to request the full URL link from Google, and by using the hashed prefix, Google never sees the website's URL you're trying to go to.</p><p>While Google doesn't know which specific URL you're trying to visit, it may collect your IP address during its interaction with Safari. Now on iOS/iPadOS 14.5, that's no longer the case. As <a href=\"https://twitter.com/othermaciej/status/1359736220809531393?s=21\">confirmed</a> by the Head of Engineering for WebKit, Apple will now proxy Google's Safe Browsing feature through its own servers instead of Google as a way to \"limit the risk of information leak.\"</p><p>Screenshots posted on <a href=\"https://www.reddit.com/r/iOSBeta/comments/lg10f3/ios_145_beta_1_apple_proxies_google_safebrowsing/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Reddit</a> of incoming/outgoing connections on a device running the latest iOS 14.5 beta shows a new \"proxy.safebrowsing.apple\" URL, and testing by <em>MacRumors</em> shows the same URL alongside \"safebrowsing.g.applimg.com\" and \"token.safebrowsing.apple\" being used to proxy \"Safe Browsing.\"</p><p>The new change in iOS and iPadOS is part of a comprehensive set of privacy-focused features for the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> and Apple's recent <a href=\"https://www.macrumors.com/2021/02/02/apple-ceo-tim-cook-privacy-speech/\">forceful push</a> towards more stringent privacy features/rules. In addition to the change in \"Safe Browsing,\" iOS 14.5 will also require apps to asks for <a href=\"https://www.macrumors.com/2021/01/28/app-tracking-transparency-required-soon/\">user's permission before tracking them</a> across other apps and websites.</p><p>The new requirement called \"ATT\" or App Tracking Transparency has caused companies such as <a href=\"https://www.macrumors.com/2020/12/17/facebook-runs-apple-vs-free-internet-ad/\">Facebook</a> and <a href=\"https://www.macrumors.com/2021/02/09/twitter-apple-app-tracking-transparency-impact/\">Twitter</a> to voice concerns about how the new feature will impact their bottom-line, specifically when it comes to personalized advertising.</p><p>Another noteworthy feature in the upcoming update is <a href=\"https://www.macrumors.com/2021/02/09/ios-14-5-apple-maps-crowdsourcing-accidents/\">crowdsource reporting</a> for accidents, speed traps, and hazards within <a href=\"https://www.macrumors.com/guide/maps/\">Apple Maps</a>. Apple released the first beta to developers and public beta testers <a href=\"https://www.macrumors.com/2021/02/01/apple-releases-ios-14-5-beta-1-to-developers/\">last week</a> and says that iOS and iPadOS 14.5 will roll out to the public in the \"early spring.\"</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-health-app-data-crime-investigation/\">Apple Health App Data Helps Send a Man to Prison for His Wife's Death</a></h3><p>Tuesday February 9, 2021 1:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>A man who claimed to be innocent following the death of his wife was found to be guilty after police used evidence sourced from the Apple Health app on his iPhone to convict him. As outlined by The Birmingham News (via Cult of Mac), Kat West, Jeff West's wife, was found dead in January 2018 after suffering a blow to the head. Jeff West claimed that she was drunk and fell while he was asleep...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-releases-macos-big-sur-11-2-1/\">Apple Releases macOS Big Sur 11.2.1 With Fix for MacBook Pro Charging Issue [Updated]</a></h3><p>Tuesday February 9, 2021 10:13 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today released macOS Big Sur 11.2.1, the third update to the macOS Big Sur operating system that launched in November. macOS Big Sur‌ 11.2.1 comes a little over a week after the release of macOS 11.2. The new ‌‌‌macOS Big Sur‌‌ 11.2.1‌ update can be downloaded for free on all eligible Macs using the Software Update section of System Preferences. According to Apple's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/01/imac-apple-silicon-redesign/\">iMac to Get a Whole New Look for Apple Silicon</a></h3><p>Apple's long-awaited iMac with Apple Silicon is expected to arrive this year featuring a complete redesign, according to a range of reports. According to Bloomberg's Mark Gurman, the redesigned iMac models will feature significantly slimmed down bezels around the display. The large aluminum \"chin\" segment, below the display of current iMacs, will be removed entirely for a design that...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/2016-2017-macbook-pro-battery-charging-issue/\">Apple Offering Free Battery Replacements for 2016-2017 MacBook Pros That Can't Charge Past 1%</a></h3><p>Tuesday February 9, 2021 4:45 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today released macOS Big Sur 11.2.1 to address an issue that may prevent the battery from charging in some 2016 and 2017 MacBook Pro models, and the company has since shared a new support document with more details. Apple says a \"very small number of customers\" with 2016 and 2017 models of the 13-inch and 15-inch MacBook Pro have experienced an issue with the battery not charging past...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/ios-14-5-beta-siri-default-music-service/\">Siri Setting in iOS 14.5 Beta Lets Users Select Default Music Streaming Service</a></h3><p>Monday February 8, 2021 4:09 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple last week released beta versions of upcoming iOS 14.5 and iPadOS 14.5 updates to developers and public beta testers, and among a number of new features, Apple has added the ability to set a default music streaming service when using Siri to play songs. Image via Reddit user matejamm1 First spotted by Reddit users, the first time you ask Siri to play a song in iOS 14.5, you are given the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div></div></div>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1731b775a9a58ea90c4b8b050706b2227df4cf6e208a06f7a3360c7ac405b11c","category":"Apple"}