{"title":"Google’s new Nest display wants to watch you while you sleep","link":"https://arstechnica.com/?p=1750055","date":1615933707000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Creepy and expensive —</h4><h2 itemprop=\"description\">There's no camera—sleep tracking happens via a Soli radar chip.</h2></header><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_I9c45LUoil-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_I9c45LUoil.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_I9c45LUoil-980x551.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_I9c45LUoil-1440x810.png 2560\" data-sub-html=\"#caption-1750146\"><figure><figcaption id=\"caption-1750146\"><span></span><p>The Nest Hub blasts radar waves all over an unsuspecting sleeper.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/3-3-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/3-3.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/3-3-980x735.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/3-3.jpg 2560\" data-sub-html=\"#caption-1750174\"><figure><figcaption id=\"caption-1750174\"><span></span><p>You'll be warned when sleep sensing is active.</p><p><span></span> Google</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/1-4-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/1-4.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/1-4-980x1040.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/1-4.jpg 2560\" data-sub-html=\"#caption-1750175\"><figure><figcaption id=\"caption-1750175\"><span></span><p>The back of the Nest Hub gen 2. It looks identical to the old one.</p><p><span></span> Google</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_jLg02329Sd-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_jLg02329Sd.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_jLg02329Sd-980x551.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_jLg02329Sd-1440x810.png 2560\" data-sub-html=\"#caption-1750147\"><figure><figcaption id=\"caption-1750147\"><span></span><p>A sleep-sensing report you'll get in the morning.</p><p><span></span> Google</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_aq34wu6Dqw-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_aq34wu6Dqw.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_aq34wu6Dqw-980x551.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/chrome_aq34wu6Dqw-1440x810.png 2560\" data-sub-html=\"#caption-1750148\"><figure><figcaption id=\"caption-1750148\"><span></span><p>A more detailed sleep-sensing screen.</p><p><span></span> Google</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/2-3-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/2-3.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/2-3.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/2-3.jpg 2560\" data-sub-html=\"#caption-1750177\"><figure><figcaption id=\"caption-1750177\"><span></span><p>A sleep-sensing report on Google Fit.</p><p><span></span> Google</p></figcaption></figure></li></ul></div><p>Google <a href=\"https://blog.google/products/google-nest/new-nest-hub-soli/\">has announced</a> a sequel to the Nest Hub (formerly the <a href=\"https://arstechnica.com/gadgets/2018/10/google-home-hub-review-a-minimum-viable-product-with-potential/\">Google Home Hub</a>): the \"second-generation\" Nest Hub. It looks exactly like the existing Nest Hub—with the same design and 7-inch display—but with better sound and a few extra sensors.&nbsp;The headline feature is the inclusion of Google's Soli Radar technology, which enables air gestures and sleep tracking.</p><p>Like the other second-gen Nest Audio speakers, the Nest Hub 2 has better sound. \"The new Nest Hub's speaker is based on the same audio technology as Nest Audio,\" Google's blog post says, \"and has 50 percent more bass than the original Hub.\" Also like the second-gen speaker hardware, the new Hub comes with \"a dedicated on-device machine-learning chip which moves some Assistant experiences from our data centers directly onto the device, so responses to common commands become faster over time.\" Google notes that the on-device ML is available in the US only.</p><p>Soli is the main new addition. Google's in-house chip was previously <a href=\"https://arstechnica.com/gadgets/2019/11/google-pixel-4-review-overpriced-uncompetitive-and-out-of-touch/#h4\">included on</a> (and then <a href=\"https://arstechnica.com/gadgets/2020/11/pixel-5-review-google-spends-its-bill-of-materials-budget-unwisely/\">removed from</a>) the Pixel line. The technology is interesting: Google miniaturized radar into a chip small enough that it could be shoved into an electronic device. The early demos promised to capture&nbsp;\"sub-millimeter motions of your fingers,\" allowing for gestures like spinning a virtual dial or tapping a button. In the path to commercialization, Google had to cut down these lab prototypes, and now Soli can only detect big, arm-waving gestures, which are a lot less useful.&nbsp;Soli was a flop on the Pixel 4 because it offered inaccurate gestures that didn't provide much value compared to the giant touchscreen on a phone, which had clear labels and better accuracy.</p><figure><img alt=\"Soli's only quick gesture on the Nest Hub appears to be this &quot;stop&quot; gesture.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/4-2.jpg\" width=\"480\" height=\"270\"><figcaption><p>Soli's only quick gesture on the Nest Hub appears to be this \"stop\" gesture.</p><p>Google</p></figcaption></figure><p>Google looks to be porting the feature over to the Nest Hub, unimproved, with \"Quick Gestures.\" The only gesture mentioned is a big, hand-up \"stop\" gesture that you can do a few inches in front of the screen. This gesture will play or pause content, snooze an alarm, and stop a timer. Like on the Pixel 4, there's also a huge, more accurate touch button on the screen when any of this is happening, so you'll probably be hard-pressed to pick the air gesture over the screen tap. I could see air gestures being useful if you're cooking and have dirty hands (smart displays are popular in the kitchen, after all), but remember these devices also have Google Assistant voice commands, which can start and stop music as well as a bunch of other things hands-free, without the range limitations of Soli.</p><h2>Google dreams of monthly subscription services</h2><p>The Nest Hub 2 doesn't have a camera, but it does want to watch you while you sleep via Soli's radar. The new \"sleep sensing\" feature will \"analyze how the person closest to the display is sleeping, based on their movement and breathing—all without a camera or wearable.\" You'll be gently caressed by radar waves as you sleep for movement detection, the microphone can detect coughing&nbsp;or snoring, and the ambient light and temperature sensors can track what's happening in the room. In the morning, you'll know whether or not you should feel tired (I guess?) via a sleep summary that will be shown on the Nest Hub display. Sleep sensing can also connect to the Google Fit app on a smartphone and share data with it.</p><p>The wearables shoutout is interesting, since most tech companies would do sleep tracking via a wearable, but the terrible performance of Wear OS in the marketplace means Google doesn't have a viable wearable platform. Google is currently undergoing a rework of its wearables strategy after <a href=\"https://arstechnica.com/gadgets/2021/01/google-closes-the-fitbit-acquisition-pledges-to-not-use-data-for-ads/\">buying Fitbit</a>, and this blog post says \"We'll also be looking for ways to work with Fitbit's sleep-tracking features in the future.\"</p><p>Google notes that sleep sensing is optional and \"your coughing and snoring audio data is only processed on the device—it isn't sent to Google servers.\" For now, sleep sensing is \"a preview,\" and it sounds like Google is planning to <em>charge extra</em> for the service sometime next year.</p><p>Here's the relevant quote from the support page:</p><blockquote><p>Enjoy a preview of Sleep Sensing for free until next year. Google is learning and innovating on this new technology, and also exploring how Sleep Sensing can become a part of the Fitbit and Fitbit Premium experiences. Google and Fitbit will keep you updated on any future plans related Sleep Sensing.</p></blockquote><p>Fitbit Premium—a service currently undergoing upheaval along with everything else at Fitbit—is $10 per month.</p><h2>A chip for Project CHIP</h2><p>The new Nest Hub also features the new smarthome standard, \"<a href=\"https://arstechnica.com/gadgets/2019/12/apple-google-and-amazon-team-up-for-joint-smart-home-standard/\">Project Connected Home over IP</a>\" or \"Project CHIP.\" CHIP is a conglomerate of heavy hitters—Google, Apple, Amazon, Zigbee, and others—that finally want to figure out smarthome standards once and for all with a new, additional standard (feel free to link that XKCD comic in the comments). The Nest Hub already has a ton of smarthome controls, but it relies on your existing smarthome hub bridging commands and data over to Wi-Fi and the Google Assistant. With a built-in Thread radio (one of the IoT communication protocols for CHIP), it could theoretically be a more active part of a smarthome network or possibly replace your hub.</p><p>The CHIP standard isn't done yet, so it's not clear exactly what Google is planning here. Google has integrated smarthome hardware into devices before, like <a href=\"https://arstechnica.com/gadgets/2015/08/google-onhub-review-googles-smart-home-trojan-horse-is-a-200-leap-of-faith/\">Google OnHub router</a>&nbsp;which also came with a Thread radio. Absolutely nothing became of the OnHub's secret smarthome functionality, so we're not holding our breath for something to happen here. Google’s follow-ups to the OnHub (the Google Wi-Fi and Google Nest Wi-Fi) can also <a href=\"https://support.google.com/googlenest/answer/9649361?hl=en\">join Thread networks</a>, but there's no reason why you would want to do that. Currently, the Google Assistant's <a href=\"https://developers.google.com/assistant/smarthome/guides\">\"Actions\" API</a> makes it fantastic for smarthome voice control, so it's not clear what bringing any of that on board would actually accomplish from a consumer perspective.</p><p>The second-gen Nest Hub is up for preorder now on the <a href=\"https://store.google.com/product/nest_hub_2nd_gen\">Google Store</a> for $99.99. It looks like it ships around March 30.</p><p><em>Listing image by <a href=\"https://blog.google/products/google-nest/new-nest-hub-soli/\">Google</a></em></p></div></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"17b8eb9ec87d2e44cd31be5c51ef4afa7814b57a83635c8561c287cf66d2c7dd","category":"Tech"}