{"title":"ซีอีโอบริษัทแม่เจ้าของ GTA และ NBA2K บอกว่าผู้บริโภคพร้อมซื้อเกมราคา 70 ดอลลาร์แล้ว","link":"https://www.blognone.com/node/121599","date":1615263188000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/take2.png?itok=CzDjWigc\"></p><div itemprop=\"description\"><p>Strauss Zelnick ซีอีโอของ Take-Two Interactive บริษัทแม่ของ Rockstar Games ผู้สร้าง GTA และ 2K Games ผู้สร้าง NBA2K ถูกถามถึงกรณีที่ บริษัทขายเกม NBA2K21 ในราคา 69.99 ดอลลาร์ จากปกติราคาเกมทั่วไปอยู่ที่ 59.99 ดอลลาร์ ว่าเขามีความคิดเห็นอย่างไรบ้าง</p><p>เขายืนยันว่ามูลค่าของเกมที่ให้ประสบการณ์การเล่นที่พิเศษกว่า และเล่นซ้ำได้หลายครั้ง เหมาะสมกับราคานี้แล้ว และบอกว่าครั้งล่าสุดที่เกมมีการขึ้นราคาก็ตั้งแต่ปี 2005, 2006 มาแล้ว และผู้บริโภคพร้อมแล้วสำหรับราคาใหม่นี้</p><p>แต่ Zelnick ก็ไม่ได้ยืนยันว่าเกมทุกเกมจากบริษัทในอนาคตจะขายที่ราคานี้ แต่แค่บอกว่าจะขึ้นอยู่กับแต่ละเกมไป และหากจะขายราคานี้ ตัวเกมก็ต้องมีคอนเทนต์ที่ทำให้ผู้บริโภครู้สึกว่าได้รับประสบการณ์ที่คุ้มค่ากว่าเงินที่จ่ายและไม่รู้สึกว่าถูกขูดรีดจนเกินไป</p><p><img src=\"https://www.blognone.com/sites/default/files/externals/0d0f573dddeef17dd919a9771102a961.jpg\" alt=\"\"><em>เกม NBA2K21 เวอร์ชั่นเน็กซ์เจ็น ขายในราคา 69.99 ดอลลาร</em></p><p>หลายบริษัทยังคงมีความเห็นแตกต่างกันไปว่าราคาเกมควรเพิ่มเป็น 70 ดอลลาร์ (69.99 ดอลลาร์) หรือไม่ แต่เกมที่ขึ้นราคานำไปก่อนแล้วคือ NBA2K21 ที่เป็นเกมเน็กซ์เจ็นเกมแรกที่ขายในราคานี้ ส่วน Sony ก็เริ่มขายเกม PS5 บางเกม เช่น Demon’s Soul และ Spider-Man: Miles Morales ในราคานี้แล้วเช่นกัน</p><p>Ubisoft ก็บอกว่าเกมเน็กซ์เจ็น ไม่น่ามีราคาแพงกว่าเกมในเจ็นก่อน ส่วน Phil Spencer ซีอีโอของ Xbox กล่าวในการให้<a href=\"https://www.washingtonpost.com/video-games/2020/07/16/phil-spencer-console-war-mentality-xboxs-shift-away-box/\">สัมภาษณ์กับ Washington Post</a> ว่าแต่ละบริษัทก็คงมีนโยบายทางธุรกิจที่แตกต่างกันไป แต่สุดท้ายแล้วผู้บริโภคก็จะเป็นคนเลือกเองว่าจะยอมจ่ายที่ราคาเท่าไร เพราะปัจจุบันผู้บริโภคมีตัวเลือกในการเล่นเกมมากกว่าที่เคย</p><p>ที่มา - <a href=\"https://www.videogameschronicle.com/news/rockstar-owner-argues-players-are-ready-for-70-games/\">VGC</a></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"18a59dc6b2d77b207067be3b7e0bfd77d83300ea862af44abefec6c49fbd85c2","category":"Thai"}