{"title":"Lou Ottens, Inventor of the Cassette Tape, Dies at 94","link":"https://www.latimes.com/obituaries/story/2021-03-12/lou-ottens-invented-cassette-tape-cds-dies","date":1615594800000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Lou Ottens, the Dutch inventor who pioneered the compact disc and invented the cassette tape — the medium of choice for millions of homemade mix tapes — has died at a care facility in the Netherlands.</p><p>Ottens died March 6 at 94, the Dutch electronic conglomerate Philips announced.</p><p>A structural engineer who trained at the prestigious Technical University in Delft, he joined Philips in 1952 and was head of the company’s product development department when he began work on an alternative for existing tape recorders with their cumbersome large spools of tape.</p><p>His goal was simple: making tapes and their players far more portable and easier to use.</p><p>“During the development of the cassette tape, in the early 1960s, he had a wooden block made that fit exactly in his coat pocket,” said Olga Coolen, director of the Philips Museum in the southern city of Eindhoven. “This was how big the first compact cassette was to be, making it a lot handier than the bulky tape recorders in use at the time.”</p><p>The final product created in 1962 later turned into a worldwide hit, with more than 100 billion cassettes sold, many to music fans who would record their own compilations direct from the radio. Its popularity waned with the arrival of the compact disc, an invention Ottens also helped create as supervisor of a development team, Philips said.</p><p>The cassette tape’s success stemmed from its simplicity, Ottens said in an interview published by the Philips Museum.</p><p>“It was a breakthrough because it was foolproof,” he said, adding that players and recorders also could run on batteries, making them very user-friendly and, ultimately, portable.</p><p>“Everybody could put music in their pocket,” Ottens said.</p><p>The prototype wooden block never made it to the company’s museum. Ottens used it to prop up his jack when replacing a flat tire and left it by the side of a road, Coolen said.</p><p>“Lou loved technology. When he talked about that his eyes began to twinkle,” Coolen said.<br></p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"19be40c296b0cf230dee5549d09a51b35cad262a30809a884d129dd462670388","category":"Tech"}