{"title":"Spotlight: POC Devour sunglasses","link":"https://cyclingtips.com/2021/03/spotlight-poc-devour-sunglasses/","date":1615423200000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><em>Spotlight is a new series on CyclingTips we’re using to briefly showcase new products we’ve just received, and/or products that require just a short review. This regular and short-form tech coverage replaces our previous <a href=\"https://cyclingtips.com/tag/tech-round-up/\" target=\"_blank\" rel=\"noreferrer noopener\">Tech Round-Up series</a>.</em></p><hr><p>POC’s new Devour sunglasses are unabashedly large and in charge, with a distinctly oversized shield-type lens that offers a generous field of view as well as ample coverage against sun, wind, and debris.&nbsp;</p><p>Whereas POC has mostly used spherical lens shapes in the past, the Devour instead uses a cylindrical one that lends a bit of a retro vibe while also keeping the lens a little closer to your face despite its size. Vents up top and ample space between the frame and lens promise to reduce the chance of fogging, and both sides of the lens are treated with hydrophobic, oleophobic, and scratch-resistant coatings.</p><p>The way the lens is held in the frame is somewhat novel, being clipped into place at just six points around the periphery while lending the outward appearance (at least when using a mirrored lens) of a frameless design. At first glance, the frame design seems like it would cut off peripheral vision when viewed head-on, but it’s cleverly curved so that there isn’t any negative impact in reality.</p><p>The Devour obviously seems best-suited for bigger faces, but there’s still a decent amount of tunability for a more widely accommodating fit. The rubber-tipped temples are adjustable in length, and the rubber nosepiece offers two indexed positions to account for more or less prominent face curvatures.&nbsp;</p><p>POC offers the Devour in seven different frame and lens combinations, all of which include a spare clear lens for low-light use.</p><h2>First impressions</h2><p>No question, the POC Devour offers a massive amount of coverage, and even at higher speeds and lower temperatures, there’s plenty of protection to keep your eyeballs from watering. The ample ventilation really does do a pretty good job of keeping the lens from fogging up, too.&nbsp;</p><p>Despite the visual bulk, the Devour is decently light at 41 g and also quite comfortable to wear. As a nice bonus, the curved earpieces minimize interference with some helmet retention systems.</p><p>Clarity and contrast with the Zeiss-certified lens is excellent, as I’ve experienced with other POC sunglasses I’ve used in years past. However, there’s some noticeable distortion associated with POC’s decision to use a cylindrical lens shape instead of the more optically correct spherical one, although it’s maybe worth pointing out that I seem to be more sensitive to this sort of thing than average.&nbsp;</p><p>Stylistically, the POC Devour will obviously be a matter of personal preference. Functionally, however, this may be a case where smaller-faced riders who still like to wear bigger sunglasses might want to think twice. At least on my small-to-medium sized head, the temple ends don’t shorten enough so that the hooks actually wrap behind my ears as they should, and so the fit isn’t quite as secure as I’d like. It’s ok on smoother road rides, but bumpier gravel and mountain bike rides have been a little more questionable.&nbsp;</p><p>That said, none of this has tempered the desires of a good friend of mine, who made clear her pining for these sunglasses despite the fact her face is smaller than mine. As they say, beauty is in the eye of the beholder.</p><p><strong>Price: </strong>US$250 / €250 / £250 (AU price TBC)</p><p><strong>More information: </strong><a href=\"http://www.pocsports.com/\" target=\"_blank\" rel=\"noreferrer noopener\">www.pocsports.com</a></p><div><h5>Tags</h5></div></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"19dddc204f3656b738c4d249353aa0133f94d093d7311e586cfb32ef4d01f03d","category":"Cycling"}