{"title":"TotalEnergies signs Sagan and will race on Specialized through 2023","link":"https://cyclingtips.com/2021/08/peter-sagan-will-join-totalenergies-next-season/","date":1628006771000,"content":"<div><p></p><h4>Peter Sagan wins stage 10 of the Giro d'Italia.</h4><p></p><div><p>Peter Sagan will head to TotalEnergies next season – and Specialized is coming along as well.</p><p>After five seasons with Bora-Hansgrohe, Sagan’s contract with the German WorldTour outfit is up at the end of this year. Following months of rumors of a potential move to TotalEnergies, the French ProTeam confirmed on Tuesday that Sagan would be coming aboard on a two-year deal. <a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Peter-sagan-signe-chez-totalenergies-pour-deux-saisons/1275796\" target=\"_blank\">L’Equipe reports</a> that the deal includes an option for two further seasons.</p><p>Sagan will bring multiple personnel with him as he makes the transfer. Daniel Oss and Maciej Bodnar are among those who will join him at TotalEnergies.</p><p>Sagan’s arrival will represent a step down to the second division for the 31-year-old Slovakian, but a major upgrade for the TotalEnergies roster, immediately giving the team a new Classics contender with Niki Terpstra – who has been beset by injuries since joining the team in 2019 – currently out of contract at the end of the season.</p><p>According to L’Equipe, Sagan’s program with his new team could also include some off-road events.</p><p>TotalEnergies, which currently rides Wilier bikes, will move over to Specialized as Sagan comes aboard, with the American bike brand announcing that it will be the squad’s “official supplier of bicycles, tires, shoes, and helmets, along with Roval wheels and components for the 2022-2023 seasons.”</p><p>Meanwhile, media reports have suggested that Specialized will also continue to partner with Bora-Hansgrohe through the 2022 season.</p><p>Specialized has partnered with Sagan since 2015, back when he was a member of the Tinkoff-Saxo squad. Since then, he has won all three of his world championship titles, the Tour of Flanders, Paris-Roubaix, and four green jerseys, to name only a few of his career achievements. In 2021, Sagan has won stages at the Volta a Catalunya, the Tour de Romandie, and the Giro d’Italia, where he also secured the maglia ciclamino of the points classification.</p><p>“Peter has been a huge part of writing our Specialized history in racing,” said Specialized founder and CEO Mike Sinyard. “We are so fortunate to continue this partnership together and are looking forward to more exciting years ahead. Additionally, we anticipate great things from Team TotalEnergies. We admire their commitment to transition to renewableenergies for a sustainable future. Together, we’ll innovate for riders everywhere to pedal the planet forward.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1a0eb581065963de93b13196af83f6f5ae7e52577da1a2bfefc463e7483b12c3","category":"Cycling"}