{"title":"Basque Country: It’s good to be back at a bike race","link":"https://cyclingtips.com/2021/04/basque-country-its-good-to-be-back-at-a-bike-race/","date":1618254998000,"content":"<div><div><p>The Itzulia Basque Country, formally known as The Tour of the Basque Country, has often played second fiddle in the UCI Calendar during the Easter period; I don’t think I need to tell you to what races. But it’s been the Tony Rominger to Indurain, the Gimondi to Merckx … is it fair to say the Thomas to Froome? I suppose so, or at least the Froome up until the 2018 Tour.</p><p>For 2021, though, things changed. The Itzulia Basque Country finally nabbed that spotlight. It got the coverage that it clearly deserved, it got the adulation, and I’m guessing the increased eyeballs on the race than any other year, or at least in television viewership type eyeballs.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/CORVOS_00033032-004-1340x893.jpg\"><figcaption>All eyes were on the Basque race this year due to a certain cobbled classic being called off.</figcaption></figure><p>So, for a race that could only accommodate fans in the region – and the Basques are mega-fans – and journalists with a negative Covid test due to strict national regulations, was it a race that had the buzz of a normal bike race? No certainly not.</p><p>Instead it was different. Very different. The Basque fans know how to put on a good show, but I noticed, and I’m sure TV viewers noticed too, that extra missing rowdy-ness from international fans. Because the roadside, as I found out, was a sparse affair, not the usually orange clad Glastonbury type festival on the verges of the race route. More subdued than any race I’ve ever been too, and that goes for some local Cat 3 crits.</p><p>I went along initially in a journalistic capacity, hoping to, in some small way, do my job. To chat with the riders (abet at a distance), get tech tidbits, dig into the gossip on the ground and hope to bring you guys the fruits of my labor. I knew very well that it was going to be different, very different, but I wanted to survey the area, to see if racing has got back to some sort of normality as the last race we as a media organization attended was the Tour de France.</p><p>There it was understandably a chore to get any sort of unique content, but this was the Basque Country, far smaller in scale, so theoretically should be more open. Again I was proven wrong. If anything, it was more closed off than ever, with teams being strict about who they chatted to and where. Clearly, lessons have been learned from other races. Teams and organizers are working hard to keep racing on the right track. It’s going to be a long road back to normality, to when people can scream and shout together as an ensemble of like-minded fans, where interviews won’t be conducted via microphones on selfie sticks.</p><p>I praise all who are doing all they can to bring us professional bike races and a UCI calendar as uninterrupted as humanly possible by this bloody pandemic. The sport’s not the same at the moment, but from what I’ve seen, we’ll get there, and I can’t wait.</p><p>So please, delve in to the video. I’ve tried to give you a little bit of the flavor of how races are on the ground at the moment.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/CORVOS_00033032-016-1340x893.jpg\"><figcaption>Will future editions of Izulia prosper from its hightened coverage in 2021? I sure hope so</figcaption></figure></div></div>","author":"Dave Everett","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1a3437e77554cbaa7b4d29ef4ecdc1d9186358a3dd8c95a993b2c3c963959d04","category":"Cycling"}