{"title":"Loop Hero review: I’ve somehow gotten hooked on an RPG that plays itself","link":"https://arstechnica.com/?p=1746823","date":1614873627000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>I don't remember remembering you —</h4><h2 itemprop=\"description\">Think of it as the ultimate game to play on a second monitor.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/loop-hero-listing-1-800x474.png\" alt=\"Loop Hero review: I’ve somehow gotten hooked on an RPG that plays itself\"><figcaption><p>Devolver Digital / Four Quarters</p></figcaption></figure><p>I cannot think of a single YouTube trailer that would do the addictive, compelling new video game <em>Loop Hero</em> an iota of justice. That's not a remark on its 360p resolution or 8-bit color depth; we've seen plenty of games work within such confines while looking beautiful and fluid. But this dark RPG doubles down on simplicity, thanks to itty-bitty sprites, limited animations, and a menu-swapping interface that combine to scream the word \"boring.\"</p><p>The game includes some aesthetic exceptions, particularly a few higher-res illustrations, but the point stands. <em>Loop Hero</em> was made to work within the processing confines of an '80s PC, as opposed to immediately capturing your imagination at a single glance. The reason lies in the game's key design principle: in more respects than any other RPG we've seen, <em>Loop Hero</em> wrests direct control away from the player. If you thought the menu-driven combat of pioneering JRPGs was too \"hands-on,\" you ain't seen nothin'.</p><p>In a figurative sense, this game reimagines Camelot as a hamster wheel, where knights like Sir Galahad have become tiny, pixellated cogs. Yet as boring as that might sound, I cannot stop playing this game.</p><p>After nearly writing off this Devolver Digital game as another uninspired, lo-fi indie game, I decided—admittedly, upon a colleague's prodding—to give&nbsp;<em>Loop Hero</em>&nbsp;a spin. Pretty quickly, I discovered a fascinating twist on the \"idle\" genre—thanks to how it gives players significant choices, secrets, upgrades, and even a compelling narrative. The results won't be everyone's cup of barely interactive tea, but if you like the idea of a \"second monitor\" game with tasteful dashes of tower defense and deckbuilding, you should seriously consider running <em>Loop Hero</em> in the background of your nerdy life.</p><h2>You don't control the game... the game controls you</h2><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302124725_1-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302124725_1.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302124725_1-980x551.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302124725_1-1440x810.jpg 2560\" data-sub-html=\"#caption-1747013\"><figure><figcaption id=\"caption-1747013\"><span></span><p>A simpler version of the Loop Hero map. In this primary \"walking around the loop\" interface, you're the white character in the top-right of the loop.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/1-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/1.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/1-980x551.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/1-1440x810.jpg 2560\" data-sub-html=\"#caption-1747016\"><figure><figcaption id=\"caption-1747016\"><span></span><p>A slightly more fleshed-out version of the Loop Hero map in a run that has made greater progress. Tons of landmarks have been placed, and this player has a few more available as \"cards,\" though they can only be placed in specific zones based on their types.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302122822_1-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302122822_1.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302122822_1-980x551.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302122822_1-1440x810.jpg 2560\" data-sub-html=\"#caption-1747014\"><figure><figcaption id=\"caption-1747014\"><span></span><p>Battles start out simply enough against single opponents. You cannot control these at all, with the exception of being able to put on new, better equipment if any drops in the middle of a fight.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/3-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/3.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/3-980x551.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/3-1440x810.jpg 2560\" data-sub-html=\"#caption-1747017\"><figure><figcaption id=\"caption-1747017\"><span></span><p>Battles scale up as you take on \"advanced\" runs later in the game.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screenshot-2511-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screenshot-2511.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screenshot-2511-980x551.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screenshot-2511-1440x810.png 2560\" data-sub-html=\"#caption-1747022\"><figure><figcaption id=\"caption-1747022\"><span></span><p>Sometimes, the game's animations and attacks rise above mediocrity for flashy moments like this one.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/10-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/10.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/10-980x551.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/10-1440x810.jpg 2560\" data-sub-html=\"#caption-1747018\"><figure><figcaption id=\"caption-1747018\"><span></span><p>Between runs, go back to your safe encampment to upgrade buildings and add new abilities and classes to your future attempts.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/2_1-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/2_1.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/2_1-980x551.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/2_1-1440x810.jpg 2560\" data-sub-html=\"#caption-1747020\"><figure><figcaption id=\"caption-1747020\"><span></span><p>Use resources gathered in each loop to build new, useful buildings.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/8_2-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/8_2.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/8_2-980x551.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/8_2-1440x810.jpg 2560\" data-sub-html=\"#caption-1747019\"><figure><figcaption id=\"caption-1747019\"><span></span><p>A more built-out encampment.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/6_1-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/6_1.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/6_1-980x551.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/6_1-1440x810.jpg 2560\" data-sub-html=\"#caption-1747021\"><figure><figcaption id=\"caption-1747021\"><span></span><p>The further you play, the more \"cards\" you'll unlock. You can only have so many in your deck per loop run, and they limit your default landmark-building options.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210301211355_1-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210301211355_1.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210301211355_1-980x551.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210301211355_1-1440x810.jpg 2560\" data-sub-html=\"#caption-1747015\"><figure><figcaption id=\"caption-1747015\"><span></span><p>Much of the game's plot unravels as you meet brand-new enemies and allies alike.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302124350_1-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302124350_1.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302124350_1-980x551.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/20210302124350_1-1440x810.jpg 2560\" data-sub-html=\"#caption-1747012\"><figure><figcaption id=\"caption-1747012\"><span></span><p>We're particular fans of games that turn the tables on the hero's so-called morality. Who's the real hero in a world cast in darkness, after all?</p></figcaption></figure></li></ul></div><p>The game opens with your hero—and nearly everyone else—waking from an amnesia-like blackout. In a daze, your hero sees a single road ahead and marches forward to jog their memory, unaware that it's a loop—but also uncovering more monsters, landmarks, and increasingly powerful weapons with every step on the path.</p><p>In gameplay terms, this means you can walk away from <em>Loop Hero</em> after its opening plot sequence and watch your hero auto-walk and auto-battle until they die. (Upon every death, the world's amnesia haze consumes you, and you start over in another blacked-out world.) Your hero's movement tracks along a loop (not a round one, mind you, but made of chunky '80s-computing right angles), with the hero and enemies appearing as tiny icons. Whenever the hero walks into a foe, a larger \"battle\" window opens up with higher-res versions of each hero and monster, and everyone auto-slashes each other until one side is dead. Huh. That's it?</p><p>Of course, it's not that simple. In your very first adventure, the first wimpy enemies you kill will either drop items or \"cards.\" The former are limited to equippable fare (weapons, armor, shields, rings), and like in most RPGs, these primarily tweak your battling stats. The latter play into the game's rolling-amnesia angle, because you're asked to rebuild your forgotten world one landmark at a time. Some landmarks, like meadows and mountains, add bonuses to your stats. Others, like a cemetery or a haunted mansion, will add new, deadlier monsters to your looped path.</p><p><em>Loop Hero</em> truly begins once you realize its gimmick: you need to place landmarks around your loop to jog your memory and reach each new threshold of world recovery,&nbsp;<em>and</em> you need to place these landmarks intentionally to help your hero survive and get stronger. Jog your memory enough, and you'll find a boss to fight on a loop. With each new loop, everything starts anew, and you'll have to accrue new gear, place new landmarks, and hunt for a new boss. (We'll get to how all of these randomly generated loops chain together in a second.)</p><p>Placing all the deadliest landmarks in a single corner of a loop will go poorly, for starters. You'll do better when you realize how certain landmarks play off of each other—like a \"dry grove\" that generates annoying rats but also lets you plant a helpful, enemy-killing \"blood grove,\" so long as it's adjacent to the dry one. That's a simple chain reaction, then: spread dry groves out early on so that their squares overlap with the \"generate super-deadly vampires\" mansions in ways that let the blood groves do some helpful damage.</p><h2>What happens when I make a 3x3 square...?</h2><figure><p><iframe type=\"text/html\" width=\"640\" height=\"480\" src=\"https://www.youtube.com/embed/G37bO9vg8RY?start=0&amp;wmode=transparent\" frameborder=\"0\" allowfullscreen=\"\"></iframe></p><figcaption><p>Loop Hero reveal trailer.</p></figcaption></figure><p>Round and round you'll go, until your hero either dies or retreats. You can always elect to \"retreat,\" because while you're winding around the loop, facing ever-greater odds, you'll also pick up various crafting supplies. Retreat at the loop's \"starting\" point, marked by an eensy-weensy campfire, and you'll take every crafting element back to an encampment. Retreat elsewhere within a loop, and you'll lose some of those elements. Die, and you'll return to the encampment with much less.</p><p>Unlike the dangerous, amnesia-stricken loop you walk alone, <em>Loop Hero</em>'s camp appears to be protected. Your neighbors remain between runs, as do their memories, and the same goes for any new useful buildings and training zones you build with all of those supplies you keep picking up. You've seen these kinds of camps in other roguelikes, which let you jazz up future playthroughs by spending resources on more abilities, items, and challenge levels. The biggest difference with <em>Loop Hero</em>'s town is that some of its resources require figuring out certain secrets in the landmark-placing portion of normal gameplay. Some crafting elements appear in the average course of killing monsters. Others only pop up if you kill particularly nasty creatures.</p><p>And still others only appear if, say, you experiment with where you place landmarks on the map, only to realize certain shapes or patterns can create entirely new structures (which spawn oh-so-valuable resources). I love these clever moments, by the way, as they gently nudge you into realizing that this \"automatic\" game requires a lot more cultivation and landscaping from players than they might originally suspect.</p><p>Advancing your town is the only way to unlock <em>Loop Hero</em>'s new \"classes,\" by the way, and these come with&nbsp;<em>wickedly</em> different mechanics than the default \"warrior\" class. I'd prefer not to spoil the twists inherent in playing as a class like the rogue; instead, I'll say that the game invents entirely new ways to automatically parcel out its combat, items, landmark cards, and other surprises. You're still automatically walking around a loop, getting into automatic combat, and putting down landmark cards... but surviving and winning requires getting your head around a new set of rules each time, and they're never subtle.</p><h2>The devil finds work for idle games</h2><p>Idle games traditionally are not as involved as <em>Loop Hero</em>—and are sometimes confused with \"clicker\" games, which ask players to mindlessly click on various menus and graphics to make certain numbers or currencies go up. Idle games hit a similar philosophy, in that they subvert players' expectations that they'll meaningfully interact with a game in terms of, say, directly controlling a hero or managing an economy. Sometimes, that means watching a world whisk by with seemingly optional menu taps. Other times, that means <a href=\"https://arstechnica.com/gaming/2014/12/looking-back-at-the-best-games-of-the-2010s-so-far/2/\">furiously clicking on a cow</a>.</p><p>By&nbsp;<em>resembling</em> those kinds of limited games, <em>Loop Hero</em> puts itself in a unique corner—and the game's developers have crawled out of that corner with surprisingly clever ideas. Every session I've played thus far has vacillated between simple comfort and tense experimentation. I can leave the game on my secondary work monitor, easily paused at any moment in a given loop, then click and activate the game to either let a simple portion whisk by or exert a few minutes of intense micromanagement. I'll obsess over whether my current equipped-item loadout is going to work on my current path—should I invest in more \"vampiric\" power to keep my health level stable, or should I keep my fingers crossed that I find other landmark-related ways to stay in the green?</p><p>By the end of a run, after erecting enough landmarks to make a \"boss\" monster appear, the game takes on a whole new level of last-minute management and second-guessing about how I reached this point. <em>I should've combined certain landmarks earlier!</em> I mutter to myself. <em>I should've spread out my most dangerous monster encounters!</em> Should I retreat and cut my losses with resources now, or might I scrape by with my loop's build and get to the campfire? Or have I racked up enough gear and special abilities to keep looping and&nbsp;<em>finally</em> beat this one stubborn boss?</p><p><span></span>For a so-called \"automatic\" game, <em>Loop Hero</em> sure presents enough questions and choices to get me invested in its missions, its accumulation of city structures, and its organic lessons about how to max out a particular loop. I haven't felt this surprised and engaged by a mix of new and familiar in a game since <a href=\"https://arstechnica.com/gaming/2019/05/video-slay-the-spire-is-a-friendly-game-of-death-but-it-was-hard-to-get-it-right/\"><em>Slay the Spire</em></a>. That description should terrify anybody who is&nbsp;<em>not</em> in need of another unique gaming obsession, because if my addiction is any indication, <em>Loop Hero</em> could very well burrow into your brain for the next few weeks. You've been warned.</p><h2>The good:</h2><ul><li>Surprising depth and strategy in a seemingly \"automatic\" game.</li><li>Clever, mysterious dialogue and handsomely drawn portraits buttress a compelling plot.</li><li>Once you get hooked on the game's opening challenge, new classes and abilities open the game's potential even wider.</li><li>Lo-fi sound design makes the most of dated sound-chip technology in really appealing ways, both in music and in sounds of vampires eerily laughing at you.</li></ul><h2>The bad:</h2><ul><li>You may be charmed by the game's mid-'80s PC-gaming aesthetic, but I'd have liked more animation and detail.</li><li>While the game's automatic walking speed is adjustable, it certainly could be faster—especially in the calmer portions of a new loop.</li></ul><h2>The ugly:</h2><ul><li>Hopefully the game gets a \"pause while window is inactive\" option soon, because alt-tabbing to deal with work while addicted to this game has led to some runs ending in inadvertent, unintended deaths. Frowny face.</li><li>Insert port-begging whininess for platforms like smartphones and Switch here.</li></ul><p><strong>Verdict</strong>: Buy, unless you have responsibilities. This game could very well threaten them.</p></div></div></div>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1a51141e8d17a25f70c983a2f80cc829053959db0d42e3b323d39ba19574b43c","category":"Tech"}