{"title":"Jane Does v. GirlsDoPorn: How 22 millennial women brought down a porn empire","link":"https://arstechnica.com/?p=1740595","date":1614775530000,"content":"<div id=\"readability-page-1\" class=\"page\"><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Screen-Shot-2021-02-19-at-10.29.09-AM-800x592.png\" alt=\"San Diego Superior Court\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Screen-Shot-2021-02-19-at-10.29.09-AM.png\" data-height=\"1358\" data-width=\"1836\">Enlarge</a> <span>/</span> San Diego Superior Court</p></figcaption></figure><p>When she flew to San Diego in October 2013 with her friend who found a modeling ad on Craigslist, Jane Doe 7 believed she’d be paid $2,000 to do a nude photo shoot. And that photo shoot would only be released in Australia.</p><p>Instead, she found a much different reality. Jane Doe 7 ended up filming a porn video under duress in a hotel room where furniture blocked the door, preventing her from leaving.</p><p>First, Jane Doe 7 found out the photo shoot was actually a video shoot only when she was picked up at the airport by Matthew Wolfe, a videographer working for the porn website GirlsDoPorn. Doe didn’t know that last fact, either.</p><p>She asked at least 20 times where the video would air before agreeing to do it. Both Wolfe and porn actor Andre Garcia assured her the video would not go online, but it would instead be released on DVD in Australia. It was a believable lie given Wolfe’s New Zealand accent and the duo’s consistency in telling the same story.</p><p>Once Doe agreed to film the video, she was rushed through signing a contract and told “we needed to get this done.” Wolfe and Garcia soon put furniture in front of the hotel room door during filming; Jane Doe 7 said she couldn’t leave and was scared.</p><p>“I was being coached and I felt like I had to do it,” Doe said later <a href=\"https://www.courthousenews.com/woman-testifies-of-violent-sex-blocked-door-in-porn-fraud-trial/\">during trial</a>.</p><p>The sex was so hard Doe bled. She locked herself in the bathroom while Wolfe and Garcia tried to coax her out. Eventually, she finished the shoot and took a shower. But soon after the incident, she was harassed at work—Jane Doe 7’s video had been posted online. While she only looked at it on one website, others told Doe the video was now all over the Internet.</p><p>“I’m too afraid to Google it,” Doe said.</p><p>Jane Doe 7 was far from the only woman duped into filming pornography for the subscription website GirlsDoPorn. Her experience ultimately led to a San Diego Superior Court room where—one by one over the course of several months—22 millennial women answered affirmatively when attorneys for GirlsDoPorn asked them if they had ever viewed porn online. Yet in this fraud trial, these women all claimed they believed the porn videos they shot, which were published among GirlsDoPorn’s library of hundreds of porn flicks viewed collectively over one billion times, would never get posted online.</p><p>How could millennial women, living in an age where porn is almost exclusively viewed online, ever believe their own videos would never be posted on the Internet? To start, it takes a thought-out criminal scheme where the perpetrators were dedicated to leaving no paper trail. But GirlsDoPorn's successful manipulation was possible because large swaths of society still label women who participate in sex work as cultural pariahs. The GirlsDoPorn operators knew this, and they wagered the Does' shame over appearing in porn would likely ensure these victims would not take the site's management to task for this fraud.</p><p>Ultimately, though, the wild success of those viral GirlsDoPorn Internet videos is what led to the site team's downfall. The Does were eventually able to find one another—and by doing so, they collectively found the strength to come forth and build a successful legal case against GirlsDoPorn.</p><h2>The fraud: Three men and accomplices avoid a paper trail</h2><p>The owners and operators of GirlsDoPorn knew the type of women they wanted to appear in their amateur porn videos—college-age millennials—would not agree to casually participate in the porn industry. After all, these women grew up in the Internet age, where amateur porn has been rampantly available for years. On top of that, many instances of their peers’ sexual exploration through sexting had traveled down several slippery slopes, including cases where teens had been criminally charged for sharing x-rated media they took of <i>themselves</i>.</p><p>In 2019, a Maryland appellate court <a href=\"https://www.washingtonpost.com/local/legal-issues/mds-top-court-upholds-child-pornography-charge-against-teen-who-texted-friends-a-video-of-herself/2019/08/28/95cd6ba6-822c-11e9-95a9-e2c830afe24f_story.html\">found</a> 6-1 that child pornography laws apply when a teen is both the subject and sender of sexually explicit media. Under the ruling, where the judicial panel encouraged lawmakers to change the law, the appellate court upheld a lower court’s decision where a 16-year-old girl was convicted as her own pornographer.</p><p>Prosecution of minors under child pornography laws, the American Academy of Pediatrics <a href=\"https://pediatrics.aappublications.org/content/pediatrics/143/5/e20183183.full.pdf\">warned</a> in 2019, “has the potential to have dire legal ramifications for teens,” as sexting among young people—and prosecution of them under child pornography laws—continues to rise.</p><p>That’s precisely why GirlsDoPorn owner Michael Pratt, videographer Matthew Wolfe, and actor Andre Garcia created a bait-and-switch scheme to get the women to appear in their videos.</p><p>That scheme, revealed during the months-long trial in San Diego Superior Court Judge Kevin <a href=\"https://www.courthousenews.com/porn-fraud-civil-trial-to-continue-despite-criminal-charges/\">Enright’s courtroom</a>, led to criminal <a href=\"https://www.courthousenews.com/porn-company-charged-by-feds-for-sex-trafficking/\">human trafficking charges</a> being filed by the US Attorneys Office in the Southern District of California.</p><p>Garcia pleaded guilty (<a href=\"https://drive.google.com/file/d/1B6KIGB-zKQ4c6U_djJBTLzsEsFNYt1Aw/view\">PDF</a>) last year to conspiracy and sex-trafficking charges related to five Doe victims. He faces 15 years to life in prison. Wolfe is in federal custody awaiting trial. Pratt is a fugitive on the FBI’s Most Wanted <a href=\"https://www.fbi.gov/wanted/additional/michael-james-pratt/@@download.pdf\">list</a>, and there is a $10,000 reward for information leading to his arrest. He may have fled to his native New Zealand, where authorities there are looking for him and have agreed to extradite him to the United States if he’s caught.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/Screen-Shot-2020-09-25-at-4.23.38-PM.png\" data-height=\"1324\" data-width=\"2030\" alt=\"GirlsDoPorn's Pratt remains on the run, and the FBI is offering a $10,000 reward for information that can lead to his arrest.\"><img alt=\"GirlsDoPorn's Pratt remains on the run, and the FBI is offering a $10,000 reward for information that can lead to his arrest.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/Screen-Shot-2020-09-25-at-4.23.38-PM-640x417.png\" width=\"640\" height=\"417\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/Screen-Shot-2020-09-25-at-4.23.38-PM-1280x835.png 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/Screen-Shot-2020-09-25-at-4.23.38-PM.png\" data-height=\"1324\" data-width=\"2030\">Enlarge</a> <span>/</span> GirlsDoPorn's Pratt remains on the run, and the FBI is offering a $10,000 reward for information that can lead to his arrest.</p><p>FBI</p></figcaption></figure><p>GirlsDoPorn’s racket started with strategic targeting. All three men were involved in recruiting college students to shoot their first porn videos, and by and large they sought out women who were low-income and may have needed money for things like rent, books, and tuition.</p><p>From there, the scheme grew digitally. These women were recruited via Craigslist modeling ads and then directed to fill out contact forms on benign-sounding websites like BeginModeling.com and CaliforniaModeling.com. They were then contacted by Garcia, who revealed applicants were actually being recruited to film a 30-minute porn video that they would be paid several thousand dollars to film.</p><p>In general, at this point, the GirlsDoPorn trio had to quell the natural skepticism while also avoiding much of a paper trail. Garcia would proactively tell the women the videos were either for a private collector or to be sold on DVDs in adult stores overseas in places like New Zealand and Australia. The videos would never get posted online, and their names would never be associated with the videos, Garcia claimed.</p><p>As soon as women had particular questions about where the porn videos were distributed, Garcia would take the conversations offline. He called and FaceTimed the women, dodging answering any specific questions by instead offering to immediately book plane tickets—even before any women had agreed to participate in the filming.</p><p>During the trial, Garcia pleaded the fifth and did not testify.</p><p>Wolfe was the only one of the three to testify in person. He <a href=\"https://www.courthousenews.com/porn-company-employee-says-recruiting-continues-during-fraud-trial/\">said</a> during the trial that he filmed around 100 videos for GirlsDoPorn and moved to the US in 2011 to help Pratt, his childhood friend from New Zealand. Wolfe, who was identified as the “person most qualified” to testify on behalf of the company, is also an owner of GirlsDoPorn’s affiliate website, GirlsDoToys.</p><p>According to Wolfe, Garcia was still recruiting women to film videos for GirlsDoPorn during the trial. But Wolfe said he did not know about any policies in place during the trial to tell the women their videos could end up on GirlsDoPorn’s website.</p><blockquote><p>“Do any contracts presented to models since the lawsuit was filed in June 2016 reference websites?” attorney Brian Holm asked Wolfe.</p><p>“No, I don’t believe so,” Wolfe said.</p><p>“Is it fair to say the contracts being used in recruiting today are the same as the contracts prior to the lawsuit?” Holm asked.</p><p>“I think so,” Wolfe confirmed.</p><p>“Were the contracts changed in any way to reference GirlsDoPorn.com?” Holm pressed.</p><p>“No,” Wolfe responded.</p></blockquote><p>When Wolfe was asked about the use of the word “website” on a version of the model talent release form GirlsDoPorn had some of the models sign, Wolfe said he wasn’t aware of any questions or concerns raised by the women who were recruited to film videos for DVDs sold overseas. But he made an aside:</p><blockquote><p>“That’s where almost all of pornography that’s produced goes,” Wolfe said.</p><p>“It only went on the Internet? It only went on websites?” Holm asked.</p><p>“Yes,” Wolfe confirmed.</p></blockquote><p>When asked if women had insisted on knowing where the videos were published, Wolfe said he would have told them it was posted online but would not have disclosed GirlsDoPorn’s name “because of online trolls harassing GirlsDoPorn’s employees.”</p><p>“Most people know porn goes online,” he said.</p><p>Just as attorneys for GirlsDoPorn asked the women one by one during their testimony in the months-long trial if they had ever viewed porn online, the Does’ own attorneys asked all of them a different question: would they have agreed to appear in GirlsDoPorn’s videos had they known the truth—that the videos were posted online?</p><p>One by one, the women each had the same response: they would <i>not</i> have appeared in the videos.</p></div></div>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1a6240f50d5de5f8bd24bb490f3e55aa6e5cd5e45028908ae0a650848f31e582","category":"Tech"}