{"title":"House Republicans propose nationwide ban on municipal broadband networks","link":"https://arstechnica.com/?p=1743485","date":1613671461000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Create competition by banning it —</h4><h2 itemprop=\"description\">GOP claims ban would \"promote competition by limiting government-run networks.\"</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/getty-us-network-800x519.jpg\" alt=\"A United States map overlaid with crisscrossing lines to represent a broadband network.\"><figcaption><p>Getty Images | Paul Taylor</p></figcaption></figure><p>House Republicans have unveiled their plan for \"boosting\" broadband connectivity and competition, and one of the key planks is prohibiting states and cities from building their own networks. The proposal to ban new public networks was included in the \"Boosting Broadband Connectivity Agenda\" <a href=\"https://republicans-energycommerce.house.gov/news/press-release/ec-gop-leaders-unveil-the-boosting-broadband-connectivity-agenda/\">announced Tuesday</a> by Reps. Cathy McMorris Rodgers (R-Wash.) and Bob Latta (R-Ohio), the top Republicans on the House Commerce Committee and Subcommittee for Communications and Technology, respectively.</p><p>Republicans call it the <a href=\"https://republicans-energycommerce.house.gov/wp-content/uploads/2021/02/CONNECT-Act.pdf\">CONNECT Act</a>, for \"Communities Overregulating Networks Need Economic Competition Today.\" The bill \"would promote competition by limiting government-run broadband networks throughout the country and encouraging private investment,\" the Commerce Committee Republicans said in their announcement, without explaining how limiting the number of broadband networks would increase competition. Rep. Billy Long (R-Mo.) is the lead sponsor.</p><p>The bill itself says that \"a State or political subdivision thereof may not provide or offer for sale to the public, a telecommunications provider, or to a commercial provider of broadband Internet access service, retail or wholesale broadband Internet access service.\"</p><p>The bill has an exception that would allow existing government networks to continue in cities and towns without substantial broadband competition. States or municipalities that already offer Internet service may continue to do so if \"there is no more than one other commercial provider of broadband Internet access that provides competition for that service in a particular area.\"</p><p>But existing networks would also be prevented from expanding into other areas. The bill says that states and municipalities already offering service \"may not construct or extend facilities used to deliver broadband Internet access service beyond the geographic area in which the State or political subdivision thereof lawfully operates.\"&nbsp;The Republican bill also makes an exception for the Tennessee Valley Authority, which <a href=\"https://www.govtech.com/dc/articles/Tennessee-Valley-Authority-to-Invest-300M-Expanding-Fiber-Network.html\">operates a fiber network</a>&nbsp;but doesn't have carveouts for any other specific entities.</p><p>The bill is reminiscent of laws in nearly 20 states that restrict the building of municipal networks. But it has no realistic chance of passage in the Democratic-controlled House.</p><p>\"I think they know it won't go anywhere and just want to make a statement against municipal networks without really caring how it will work,\" Christopher Mitchell, director of the Community Broadband Networks initiative at the Institute for Local Self-Reliance, told Ars.&nbsp;Mitchell's group has done <a href=\"https://muninetworks.org/content/successes-and-failures\">research</a> on how publicly owned networks encourage economic development by attracting businesses and jobs.</p><p>PCMag recently named Chattanooga, Tennessee, the <a href=\"https://www.pcmag.com/news/the-best-work-from-home-cities-for-2021\">best work-from-home city in the nation</a>, citing in part the city's \"widely available broadband Internet\" provided by the&nbsp;Chattanooga Electric Power Board. Comcast initially <a href=\"https://www.chattanoogan.com/2008/4/22/126367/Comcast-Sues-EPB-In-Hamilton-County.aspx\">tried to block</a> that public network from being built but eventually <a href=\"https://arstechnica.com/information-technology/2015/04/comcast-brings-fiber-to-city-that-it-sued-7-years-ago-to-stop-fiber-rollout/\">upgraded</a> its own service to better compete against the public option.</p><p>The Republicans' proposed ban on state and municipal networks is one of <a href=\"https://republicans-energycommerce.house.gov/wp-content/uploads/2021/02/2.16.21-Boosting-Broadband-Connectivity-Agenda.pdf\">28 bills</a> in the Republican agenda. Most of the others remove regulatory requirements or speed up permitting processes for ISPs. Republicans said the 28 bills \"aim to turbocharge public and private investment,\" even though the ban on state or municipal networks would reduce public investment.</p><h2>Bill called “utterly absurd”</h2><p>Attorney Jim Baller, who represents local governments and maintains a <a href=\"https://www.baller.com/wp-content/uploads/BallerStokesLideStateBarriers7-1-20.pdf\">list of states</a> that restrict municipal broadband or other public communications initiatives, pointed out that Republicans in Congress are taking the opposite approach as Republicans in the Arkansas State Legislature. Baller told Ars:</p><blockquote><p>In the face of compelling pandemic-driven evidence that affordable broadband Internet access is essential to modern life, that tens of millions of Americans are being left behind, and that an emergency requiring immediate action exists, five enlightened Arkansas Republicans recently persuaded their overwhelmingly Republican legislature to <a href=\"https://legiscan.com/AR/bill/SB74/2021\">vote unanimously</a> to give local governments <a href=\"https://www.arkleg.state.ar.us/Bills/Detail?id=sb74&amp;ddBienniumSession=2021%2F2021R&amp;Search=\">significant new authority</a> to provide or support the provision of broadband Internet access. Now, taking exactly the opposite approach in the US Congress, the Republicans on the House Energy and Commerce Committee have just introduced a bill that would all but extinguish public broadband initiatives and public-private broadband partnerships nationwide. That's utterly absurd.</p></blockquote><p>Arkansas is one of 19 states on Baller's list of states that restrict municipal networks. Baller said that Arkansas still prohibits municipalities from offering local exchange service but \"has made great strides in expanding local options,\" which will be reflected the next time he updates the list.</p><h2>Democrats oppose limits on municipal broadband</h2><p>Democrats have tried to eliminate restrictions on community broadband networks over the years. House Democrats last year <a href=\"https://arstechnica.com/tech-policy/2020/06/100-billion-universal-fiber-plan-proposed-by-democrats-in-congress/\">proposed legislation</a> that would overturn state laws that prevent the growth of municipal broadband.</p><p>In 2015, under then-Chairman Tom Wheeler, the Federal Communications Commission <a href=\"https://arstechnica.com/information-technology/2015/02/fcc-overturns-state-laws-that-protect-isps-from-local-competition/\">voted to preempt state laws</a> in North Carolina and Tennessee that prevent municipal broadband providers from expanding outside their territories. The preemption was <a href=\"https://arstechnica.com/tech-policy/2016/08/in-blow-to-muni-broadband-fcc-loses-bid-to-overturn-state-laws/\">thrown out in court</a>, however, allowing the states to continue imposing the restrictions.</p><p>The Democratic-led House Commerce Committee, which held a hearing on expanding Internet access during the pandemic <a href=\"https://energycommerce.house.gov/committee-activity/hearings/hearing-on-connecting-america-broadband-solutions-to-pandemic-problems\">yesterday</a>, last week approved a $7.6 billion Emergency Connectivity Fund \"<a href=\"https://energycommerce.house.gov/newsroom/press-releases/pallone-on-committee-passage-of-covid-19-relief-legislation\">to expand</a> Internet connectivity for students and teachers without Internet access.\"</p></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1b88cec86eaa885d2c16498b70c77bfa11cce715b325931e6f7821274ae7ad79","category":"Tech"}