{"title":"Courses for the Wollongong Road Worlds have finally been revealed … sort of","link":"https://cyclingtips.com/2021/12/courses-for-the-wollongong-road-worlds-have-finally-been-revealed-sort-of/","date":1639095123000,"content":"<div><div><p>Organisers of the 2022 Road World Championships in Wollongong, Australia have today given us a glimpse of what we can expect from next September’s races. They haven’t provided every detail – we don’t know race lengths nor how much climbing is involved – but they have revealed the elements that will make up each course. It’s enough to paint an intriguing picture.</p><p>Here’s what we know so far.</p><h2>Elite men’s and women’s road races</h2><p>The elite men and women’s road races will both start in the same place – in the town of Helensburgh, north of Wollongong, not far from Sydney’s southern fringes. From there the riders will head 35 km down Australia’s eastern coast to Wollongong, crossing the iconic Sea Cliff Bridge along the way.</p><p>The elite fields will then tackle two separate circuits around Wollongong.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/RR-Men-Elite-1340x1577.jpg\"></figure><p>The Mt. Keira Loop, unsurprisingly, takes riders up and down nearby Mt. Keira, a popular local cycling route on the escarpment west of Wollongong. The loop is roughly <a href=\"https://ridewithgps.com/routes/38150052?privacy_code=0fe6PGaNtDJV6xiP\" target=\"_blank\">34.1 km long</a> and is defined by an 8.7 km climb through sub-tropical rainforest at an average gradient of 5%. There are multiple pitches on the climb above 10% including a maximum gradient of 15%. The descent back into Wollongong is equally steep in places. Each lap includes 630 metres of climbing.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/RR-Mount-Keira-Loop-1340x1592.jpg\"></figure><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/Screen-Shot-2021-12-10-at-9.51.31-am-1340x297.jpg\"><figcaption>Elevation profile for the Mt. Keira loop.</figcaption></figure><p>The second circuit  – the Wollongong City Circuit – is <a href=\"https://ridewithgps.com/routes/38150071?privacy_code=GVrW99WlxAiDCjel\" target=\"_blank\">approximately 17.7 km in length</a> and, as the name suggests, takes riders through the streets of Wollongong. The loop features around 220 metres of climbing per lap, including a 900 metre stretch at an average of 4.5%, followed shortly afterwards by the Mt. Pleasant climb – 1.1 km with an average gradient of 7.7% (and a maximum of 14%).</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/RR-Wollongong-City-Circuit-1340x1578.jpg\"></figure><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/Screen-Shot-2021-12-10-at-9.58.18-am-1340x297.jpg\"><figcaption>Elevation profile for the city circuit.</figcaption></figure><p>Crucially, it’s not yet clear what order the two circuits will appear in, whether riders will go back and forth between the two (<a href=\"https://cyclingtips.com/2021/05/the-mens-road-race-course-for-the-2021-worlds-is-pretty-wild/\" target=\"_blank\">as happened at Flanders 2021</a>), and how many times each circuit will be included in each race.</p><p>Both elite races will finish on the Wollongong beachfront on Marine Drive, capping off what are sure to be two decidedly scenic bike races. The last 2 km includes a couple of short, gentle rises, but it’s essentially a flat finish.</p><p><em>The final few hundred metres on Marine Drive.</em></p><hr><p>While we don’t know exactly how the elite road races will look, we can make some educated guesses. </p><p>In an interview with CyclingTips this week Steve Peterson, head of sport for Wollongong 2022, suggests that the courses will be weighted more heavily towards the city circuits than the Mt. Keira loop.</p><p>“This really has come from David Lappartient since he’s come in as [UCI] president – he has a real focus on that city circuit,” Peterson said. “Ultimately he’s a big believer and in turn a lot of the UCI are big believers in having the large bulk of races taking place on the city circuit itself. From their perspective, that means more of the race is generally populated heavily by spectators, which makes for good TV images or that sort of stuff.</p><p>“Our response to that has been to formulate a configuration that is largely focussed around that city circuit.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/GettyImages-128082983-1340x868.jpeg\"><figcaption>Wollongong, New South Wales, Australia – host of the 2022 Road World Championships.</figcaption></figure><p>A look at the <a href=\"https://assets.ctfassets.net/761l7gh5x5an/2qPklRk6XJyLMSKYF9Z2z4/e7b12550abe91c9ef73a961ed14b3276/2-ROA-20211101-E.pdf\" target=\"_blank\">UCI regulations for Worlds road races</a> sheds further light on possible course configurations. According to the governing body, the elite women’s road race at Worlds should be 130-160 km in length. Assuming there are no exemptions given for Wollongong 2022, some possible combinations within that distance range that prioritise the city circuit include:</p><ul><li>35 km opening, 2 x Mt. Keira loop, 3 x city circuit = <strong>157 km / 2,300 m</strong></li><li>35 km opening, 1 x Mt. Keira loop, 4 x city circuit = <strong>141 km / 1,890 m</strong></li><li>35 km opening, 1 x Mt. Keira loop, 5 x city circuit = <strong>159 km / 2,110 m</strong></li></ul><p>UCI regulations suggest the elite men’s race should be between 250-280 km long. Possible permutations, with a focus on the city circuit, and again assuming no exemptions to the distance rule, include:</p><ul><li>35 km opening, 4 x Mt. Keira loop, 5 x city circuit = <strong>261 km / 4,000 m</strong></li><li>35 km opening, 3 x Mt. Keira loop, 6 x city circuit = <strong>245 km / 3,590 m</strong></li><li>35 km opening, 3 x Mt. Keira loop, 7 x city circuit = <strong>263 km / 3,810 m</strong></li><li>35 km opening, 2 x Mt. Keira loop, 8 x city circuit = <strong>247 km / 3,400 m</strong></li><li>35 km opening, 2 x Mt. Keira loop, 9 x city circuit = <strong>265 km / 3,620 m</strong></li><li>35 km opening, 1 x Mt. Keira loop, 10 x city circuit = <strong>249 km / 3,210 m</strong></li><li>35 km opening, 1 x Mt. Keira loop, 11 x city circuit = <strong>267 km / 3,430 m</strong></li></ul><p>Given the city circuits are a priority, it seems likely we’ll see multiple laps of that circuit to conclude the elite races. If so, we’re looking at races that could favour a diverse range of riders. </p><p>Fast finishers who climb well should be able to hang on over Mt. Keira (depending on many times that’s tackled), and also over the two short climbs on each lap of the city circuit. As such, a reduced bunch sprint is one possible outcome.</p><p>Equally, the two short, suburban climbs on the city circuit would seem to provide the perfect launch pad for late attacks. The two ascents peak roughly 10 km and 8 km from the end of the 17.7 km lap, with a mostly flat and downhill run to the line. Expect decisive moves to come on those climbs, particularly the longer and steeper of the two.</p><p><em>This climb up Ramah Avenue to Mt. Pleasant in suburban Wollongong is likely to be play a defining role in the elite road races.</em> <em>It’s the main climb on the city circuit (1 km at 7.7%).</em></p><hr><h2>Other road races</h2><p>While the elite women and men’s races will include the 35 km coastal section and the Mt. Keira circuit, the other road races will not. The U23 men, junior men, and junior women will all contest the rainbow bands over laps of the 17.7 km Wollongong City Circuit.</p><p>While the exact number of laps for each race hasn’t been confirmed, we can again make some assumptions based on UCI regulations:</p><ul><li>The U23 men’s race should be 160-180 km, which suggests <strong>nine or 10 laps</strong>.</li><li>The junior men race over 120-140 km – likely <strong>seven or eight laps</strong>.</li><li>Junior women race between 60-80 km, which seems to point to <strong>four laps</strong>.</li></ul><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/RR-Men-U23-1340x1588.jpg\"><figcaption>The city circuit that the U23 men, junior men, and women will use in their road races.</figcaption></figure><h2>Elite time trials</h2><p>The Wollongong 2022 time trials will be contested on a course similar to the city circuit used in the road races. Notably, elite women and men will contest their individual time trial over the same distance, and on the same day – two firsts for Road Worlds.</p><p>The designated loop for the elite TTs is approximately <a href=\"https://ridewithgps.com/routes/38150086?privacy_code=Q7bSrArzeVyByp7U\" target=\"_blank\">18 km long</a> and includes a 1 km section of climbing at around 5%. There’s roughly 140 metres of climbing per lap. It’s a relatively technical circuit with a few tight twists and turns to navigate.</p><p>Again race organisers have not revealed the full length of the races, but it seems most likely both elite events will be contested over two laps for a total of 36 km.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/TT-Women-Elite-1340x1574.jpg\"><figcaption>If the elite TT course looks similar to the city circuit used in the road race, that’s because it is. The climb is a bit shorter on the TT route, and there’s an extension to the north, but the two courses are very similar.</figcaption></figure><p>While 36 km is longer than the UCI’s guidelines allow for the elite women’s TT at Worlds (20-30 km), the organisation has made an exception to that rule the past three years. And 36 km would be shorter than the stipulated 40-50 km for the men’s TT, but that too has seen some variation in recent years (e.g. 31 km in 2017 and 31.7 km in 2020).</p><h2>Other time trials</h2><p>The U23 men, junior men, junior women, and team time trial mixed relay riders will contest their events on a circuit basically identical to that used by the elites, albeit without a short section through northern Wollongong.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/TT-Women-Junior-1340x1574.jpg\"></figure><h2>Why no full courses?</h2><p>Normally the full courses for Road Worlds are announced a year in advance, at the previous year’s championships. So why not with Wollongong 2022? The answer, as with most questions about delays and cancellations in recent years, is “COVID-19”.</p><p>“Realistically, we would have probably had the UCI out here three or four times between when [Wollongong] got the appointment as host and then the event, and we just haven’t had that opportunity,” Peterson told CyclingTips. “So I think realistically the UCI want to come out here and absolutely double down on what the proposal is, make sure they’re comfortable with the format, safety, all of those things.”</p><p>The fact the UCI is comfortable with event organisers announcing which roads and circuits the courses will contain suggests the governing body is largely happy with what’s been proposed. So what still needs to be checked off with a site visit?</p><p>“It could be a conversation around specific numbers of laps and stuff,” Peterson said. “They [the UCI] want to keep the door open in that regard. From our perspective, we want to already start that process of talking with the community.</p><p>“From our perspective, it’s super important to have at least the course locations and the course footprints nailed so that we can start to describe what the impact’s going to look like. [It’s a] logistically complex event. We need to maintain as much business-as-usual activity for the residents and businesses as we can, and we want to really start that work now.</p><p>“So whilst the door is a little bit open around some of the precise technical details, we’re in a very strong place. If it was up to us, we’d be talking in precise details about [the courses], but that’s the UCI’s call. Ultimately, it’s their event to own and operate.”</p><p><em>The road up Mt. Keira. How many laps of the climb will the elite men and women do?</em></p><hr><p>As of today, we now know the elements that will make up the courses for Wollongong Road Worlds. But at least in the case of the road races, it’s still not entirely clear what sort of races we can actually expect.</p><p>An announcement about the finalised courses is expected sometime around March 2022. Until then, let the speculation begin.</p><div><h2>Schedule for the 2022 Road Worlds</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/Screen-Shot-2021-12-10-at-10.12.46-am-1340x788.jpg\"></figure></div></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1bf0e39c415590ff57bda325e2a4fa93aea332b1b1355bdd354e1bb9fac7c4c8","category":"Cycling"}