{"title":"Apple Releases Safari Technology Preview 120 With Bug Fixes and Performance Improvements","link":"https://www.macrumors.com/2021/02/11/apple-releases-safari-technology-preview-120/","date":1613067494000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/11/apple-releases-safari-technology-preview-120/\"><p><img alt=\"safaripreviewicon\" width=\"200\" height=\"200\" src=\"https://images.macrumors.com/t/xjnjKu1XTUplh6V7CNAYHwhN030=/400x0/filters:quality(90)/article-new/2016/03/safaripreviewicon.jpg?lossy\" data-src=\"https://images.macrumors.com/t/xjnjKu1XTUplh6V7CNAYHwhN030=/400x0/filters:quality(90)/article-new/2016/03/safaripreviewicon.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/xjnjKu1XTUplh6V7CNAYHwhN030=/400x0/filters:quality(90)/article-new/2016/03/safaripreviewicon.jpg?lossy 400w,https://images.macrumors.com/t/ZVtURNfrLZr5NFghuJbG0HM0b3M=/800x0/filters:quality(90)/article-new/2016/03/safaripreviewicon.jpg?lossy 800w,https://images.macrumors.com/t/X_xLjrZKDw7Jth4YwJFGYIYSZR0=/1600x0/filters:quality(90)/article-new/2016/03/safaripreviewicon.jpg 1600w,https://images.macrumors.com/t/qi2GgHfylTpd4jqQzz5gxA3Kmg0=/2500x0/filters:no_upscale():quality(90)/article-new/2016/03/safaripreviewicon.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/xjnjKu1XTUplh6V7CNAYHwhN030=/400x0/filters:quality(90)/article-new/2016/03/safaripreviewicon.jpg?lossy 400w,https://images.macrumors.com/t/ZVtURNfrLZr5NFghuJbG0HM0b3M=/800x0/filters:quality(90)/article-new/2016/03/safaripreviewicon.jpg?lossy 800w,https://images.macrumors.com/t/X_xLjrZKDw7Jth4YwJFGYIYSZR0=/1600x0/filters:quality(90)/article-new/2016/03/safaripreviewicon.jpg 1600w,https://images.macrumors.com/t/qi2GgHfylTpd4jqQzz5gxA3Kmg0=/2500x0/filters:no_upscale():quality(90)/article-new/2016/03/safaripreviewicon.jpg 2500w\">Apple today <a href=\"https://developer.apple.com/safari/download/\">released a new update</a> for <a href=\"https://www.macrumors.com/guide/safari-technology-preview/\">Safari Technology Preview</a>, the experimental browser Apple <a href=\"https://www.macrumors.com/2016/03/30/apple-safari-technology-preview-browser/\">first introduced</a> in March 2016. Apple designed the ‌Safari Technology Preview‌ to test features that may be introduced into future release versions of Safari.</p><p>‌Safari Technology Preview‌ release 120 includes bug fixes and performance improvements for Web Inspector, Scrolling, CSS, JavaScript, Web API, Media, WebRTC, Web Audio, Accessibility, Payment Request, Speech Recognition, and Private Click Measurement.</p><p>The current ‌Safari Technology Preview‌ release is the built on the new Safari 14 update included in <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">macOS Big Sur</a> with support for Safari Web Extensions imported from other browsers, tab previews, password breach notifications, web authentication with <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a>, and more.</p><p>The new ‌Safari Technology Preview‌ update is available for both <a href=\"https://www.macrumors.com/roundup/macos-10-15/\">macOS Catalina</a> and ‌macOS Big Sur‌, the newest version of the Mac operating system.</p><p>The ‌Safari Technology Preview‌ update is available through the Software Update mechanism in System Preferences to anyone who has <a href=\"https://developer.apple.com/safari/download/\">downloaded the browser</a>. Full release notes for the update are available <a href=\"https://developer.apple.com/safari/technology-preview/release-notes/\">on the Safari Technology Preview website</a>.</p><p>Apple's aim with ‌Safari Technology Preview‌ is to gather feedback from developers and users on its browser development process. ‌Safari Technology Preview‌ can run side-by-side with the existing Safari browser and while designed for developers, it does not require a developer account to download.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-health-app-data-crime-investigation/\">Apple Health App Data Helps Send a Man to Prison for His Wife's Death</a></h3><p>Tuesday February 9, 2021 1:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>A man who claimed to be innocent following the death of his wife was found to be guilty after police used evidence sourced from the Apple Health app on his iPhone to convict him. As outlined by The Birmingham News (via Cult of Mac), Kat West, Jeff West's wife, was found dead in January 2018 after suffering a blow to the head. Jeff West claimed that she was drunk and fell while he was asleep...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-releases-macos-big-sur-11-2-1/\">Apple Releases macOS Big Sur 11.2.1 With Fix for MacBook Pro Charging Issue [Updated]</a></h3><p>Tuesday February 9, 2021 10:13 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today released macOS Big Sur 11.2.1, the third update to the macOS Big Sur operating system that launched in November. macOS Big Sur‌ 11.2.1 comes a little over a week after the release of macOS 11.2. The new ‌‌‌macOS Big Sur‌‌ 11.2.1‌ update can be downloaded for free on all eligible Macs using the Software Update section of System Preferences. According to Apple's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/01/imac-apple-silicon-redesign/\">iMac to Get a Whole New Look for Apple Silicon</a></h3><p>Apple's long-awaited iMac with Apple Silicon is expected to arrive this year featuring a complete redesign, according to a range of reports. According to Bloomberg's Mark Gurman, the redesigned iMac models will feature significantly slimmed down bezels around the display. The large aluminum \"chin\" segment, below the display of current iMacs, will be removed entirely for a design that...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/2016-2017-macbook-pro-battery-charging-issue/\">Apple Offering Free Battery Replacements for 2016-2017 MacBook Pros That Can't Charge Past 1%</a></h3><p>Tuesday February 9, 2021 4:45 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today released macOS Big Sur 11.2.1 to address an issue that may prevent the battery from charging in some 2016 and 2017 MacBook Pro models, and the company has since shared a new support document with more details. Apple says a \"very small number of customers\" with 2016 and 2017 models of the 13-inch and 15-inch MacBook Pro have experienced an issue with the battery not charging past...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/ios-14-5-beta-siri-default-music-service/\">Siri Setting in iOS 14.5 Beta Lets Users Select Default Music Streaming Service</a></h3><p>Monday February 8, 2021 4:09 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple last week released beta versions of upcoming iOS 14.5 and iPadOS 14.5 updates to developers and public beta testers, and among a number of new features, Apple has added the ability to set a default music streaming service when using Siri to play songs. Image via Reddit user matejamm1 First spotted by Reddit users, the first time you ask Siri to play a song in iOS 14.5, you are given the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1d552d24abf388deb0123af31a65f40eaee99e5590307a864df5b029926612c7","category":"Apple"}