{"title":"Gent-Wevelgem 2021 Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/gent-wevelgem-2021-preview","date":1615834529000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>March 15, 2021</span></p><p>Rouleur previews the 2021 edition of Gent-Wevelgem, possibly the best chance for the sprinters to prevail this spring.</p></div><div><p>Gent-Wevelgem is set to take place on 28th March. It is one of the Belgian classics that make up the Flemish Cycling Week, where cobbles, steep climbs, wind and rain are commonplace.</p><p>The race is frequently described as a sprinters classic due to its flat terrain in the final kilometres. Despite this, it’s not abnormal for attackers in a small group, or even a single escapee to claim victory.&nbsp;</p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><span>After being robbed of its typical position on the calendar due to the global pandemic in 2020, the 2021 edition of Gent-Wevelgem returns to it’s familiar place in spring. Nonetheless, s<span>trong crosswinds and unpleasant weather conditions are likely to add to the suffering — this race is not for the faint-hearted.</span></span></p><p><span><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related – The 2021 Men's Early Season: The Rouleur Racing Guide</a>&nbsp;<br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">Related –&nbsp;</a></strong><strong><span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">The Women's 2021 Early Season: The Rouleur Racing Guide<br></a></span></strong></em></span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-2021-preview\" target=\"_blank\" rel=\"noopener noreferrer\"><span><em><strong>Related – Tour of Flanders 2021 Preview</strong></em></span></a></p><p>No rider has won the race more than three times. Peter Sagan is the only rider in the current peloton to have achieved that feat,&nbsp;as well as being&nbsp;the only rider to have achieved six podium finishes. Sagan’s victories&nbsp;display the unpredictable nature of the race perfectly — he won solo in 2013, from a select group of four riders including Fabian Cancellara in 2016, and in a mass-sprint in 2018.</p><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/route_600x600.jpg?v=1615834211\" alt=\"\"></p><p>The official route for Gent-Wevelgem 2021 will be revealed the day prior to the race. However, we can expect a similar route to previous seasons which saw riders take on over 230km and the Kemmelberg twice.</p><h4><strong>Contenders</strong></h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032915-243_1024x1024.jpg?v=1615831311\" alt=\"Davide Ballerini\"><i><span>Davide Ballerini sprinting to victory at Omloop Het Nieuwsblad earlier this year. (Image credit PdV/PN/Cor Vos)</span></i></p><p><span>Although not finalised, we know many of the riders planning to start Gent-Wevelgem in 2021.</span></p><p><span>Among the favourites are Deceuninck-Quick-Step. The Belgian outfit are always the team to beat in the cobble classics and that doesn’t change here. Sam Bennett and Davide Ballerini are both present, the team will be confident riding for either in a sprint finish. In terms of attackers, they have numerous options in Yves Lampaert, </span><span>Florian Sénéchal</span><span> and </span><span>Zdeněk Štybar.</span></p><p><span>Davide Ballerini could be their best option and should he win he'd become the first man to win Omloop and Gent-Wevelgem in the same year since Greg Van Avermaet did so in 2017.</span></p><p><span>Bar Sam Bennett and Davide Ballerini, some of the strongest sprinters present are&nbsp;</span><span>Arnaud Démare</span><span>, Giacomo Nizzolo and Elia Viviani.&nbsp;</span></p><p><a href=\"https://www.rouleur.cc/blogs/desire-journal/pro-team-bikes-2021\"><em><strong>Related – The best WorldTour team bikes 2021</strong></em></a></p><p><span>Trek-Segafredo are led by Mads Pedersen and Jasper Stuyven. Stuyven won Omloop in a two-man sprint last year whereas Pedersen won Kuurne-Brussels-Kuurne in a mass-sprint earlier this season. The duo are both quick and will be among the favourites, particularly if some of the pure sprinters are dropped. Trek have Matteo Moschetti in their ranks too, though it is less likely he’ll make the front group.</span></p><p><span>Where there’s a Wout there’s a way. Wout Van Aert is perhaps the most well-rounded cyclist in the world today. He can time-trial, climb, descend, sprint and ride cobbles among the best. Sprint and cobbles will be his cards to play at GW. Van der Poel isn’t here this year so there will be no messing around in the final kilometres, something that cost both WVA and VDP a chance at winning Gent-Wevelgem last season.</span></p><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032325-020_1024x1024.jpg?v=1615833133\" alt=\"Wout Van Aert\"><em>Wout Van Aert (Image credit: LB/RB/CorVos/SWpix)</em></span></p><p><span>Instead, Alpecin bring Jasper Philipsen as their lead sprinter. The young Belgian has mentioned that he’d like to become a classics specialist, though he is one of the most talented pure sprinters around. This is a great chance for him to prove he can do it over 230km.</span></p><p><span>Christophe Laporte has had a fine 2021 season so far. The Frenchman won the opening stage at Etoile de Besseges, and picked up two second-place finishes at Paris-Nice. Laporte still hunts his first WorldTour win and there are few reasons he couldn’t do so here — he is quick in a sprint and is strong on hills and cobbled roads. Cofidis also bring Elia Viviani who looks rejuvenated after a luckless first year with the team.</span></p><p><span>Greg Van Avermaet is a name that is now synonymous with the Belgian classics. He won Gent-Wevelgem back in 2017, a result that added to one of the great classics campaigns — he also won Omloop Het Nieuwsblad, E3 Harelbeke, Paris-Roubaix and finished second at the Tour of Flanders that year. Now 35, he will be searching for that form of old. Oli Naesen is another option for AG2R Citroen and Marc Sarreau is their sprinter.</span></p><p><span>Can you ever count out Peter Sagan? Not entirely. The Slovak was not competitive by his standards at Tirreno-Adriatico, but his season was pushed back after contracting COVID-19. Perhaps the most successful Gent-Wevelgem competitor of all-time, if Sagan makes the final selection, watch out.</span></p><p><b>Favourites: </b><span>Wout Van Aert, Davide Ballerini, Mads Pedersen</span></p><p><b>Outsiders:</b><span> Christophe Laporte, Jasper Philipsen, Timothy Dupont</span></p><p><i><span>Cover image:&nbsp;Presse Sports / Offside</span></i></p></div></div>","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1de4da6f6437e54862d1ee7ed7616438c4a298eba80aeec2cd88c615178dfc6b","category":"Cycling"}