{"title":"Pogacar tops Roglic to win stage 3 in the Basque Country: Daily News","link":"https://cyclingtips.com/2021/04/pogacar-tops-roglic-to-win-stage-3-in-the-basque-country-daily-news/","date":1617832219000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Tadej Pogacar wins stage 3 of the Itzulia Basque Country.</h4><p></p><div><p>Hello again, CyclingTips readers,</p><p>Wednesday saw big names in action at both the Itzulia Basque Country, where the climbers clashed on a steep final ascent, and at Scheldeprijs, where sprinters had a chance to put their speed on display.</p><p>Read on for the latest from the world of cycling.</p><p><em>Dane Cash<br>News Editor</em></p><h2>What’s news?</h2><h3>Pogacar tops Roglic to win stage 3 in the Basque Country</h3><p><strong>Tadej Pogacar</strong> bested <strong>Primoz Roglic</strong> after a hard-fought battle on a steep finishing climb to win stage 3 of the Itzulia Basque Country on Wednesday, with <strong>Alejandro Valverde</strong> taking third on the day. Roglic still leads the GC with three stages to go, with Pogacar moving into second overall.</p><p>The 167.7 km stage from Amurrio to Ermualde tested riders with a challenging final 25 km that included an uncategorized climb leading into a punchy second-category climb before the steep first-category finale. After the peloton swept up the last survivor of the early break, <strong>Oier Lazkano</strong>, on the second-category climb, <strong>Sergio Higuita</strong>, <strong>Magnus Cort</strong>, <strong>Aurelien Paret-Peintre</strong>, and <strong>Richard Carapaz</strong> fired off the front. Shortly thereafter, a crash knocked <strong>Mike Woods</strong> and <strong>Wilco Kelderman</strong> out of contention for the stage on the run-in to the final climb, which started with 3.1 km to go.</p><p>The pack closed down all but Carapaz in early goings of the climb, where an average gradient of 10.2% rapidly thinned down the group. Pogacar then hit the front with Roglic just behind, and with around 2 km left to race, the duo began to pull clear. They caught and passed Carapaz while a handful of contenders tried to organize a chase.</p><p><strong>Mikel Landa</strong>, <strong>Adam Yates</strong>, and <strong>Mauri Vansevenant</strong> clawed back up to Roglic and Pogacar but neither of the Slovenian duo would relent. Pogacar spurred a move that only Roglic could follow before Yates, Landa, Valverde, and <strong>David Gaudu</strong> joined them again, but then Roglic attacked with only Pogacar able to follow inside the last kilometer. This time, the pair pulled clear for good.</p><p>Roglic led the way for the final few hundred meters until Pogacar surged past with around 200 meters to go, the defending Tour de France champ hit the line first to nab the stage victory. Five seconds later, Valverde won the sprint for third.</p><p><strong>Top 10, stage 3</strong></p><p>1 POGACAR Tadej (UAE-Team Emirates) 4:04:50<br>2 ROGLIC Primoz (Jumbo-Visma)<br>3 VALVERDE Alejandro (Movistar) 0:05<br>4 YATES Adam (Ineos Grenadiers)<br>5 LANDA Mikel (Bahrain Victorious)<br>6 GAUDU David (Groupama-FDJ) 0:08<br>7 KNOX James (Deceuninck-QuickStep) 0:16<br>8 VINGEGAARD Jonas (Jumbo-Visma)<br>9 VANSEVENANT Mauri (Deceuninck-QuickStep)<br>10 MCNULTY Brandon (UAE-Team Emirates) 0:18</p><p><strong>Top 10, GC</strong></p><p>1 ROGLIC Primoz (Jumbo-Visma) 8:07:48<br>2 POGACAR Tadej (UAE-Team Emirates) 0:20<br>3 MCNULTY Brandon (UAE-Team Emirates) 0:30<br>4 YATES Adam (Ineos Grenadiers) 0:39<br>5 VALVERDE Alejandro (Movistar) 0:50<br>6 VINGEGAARD Jonas (Jumbo-Visma) 0:54<br>7 LANDA Mikel (Bahrain Victorious) 1:00<br>8 BILBAO Pello (Bahrain Victorious) 1:08<br>9 VANSEVENANT Mauri (Deceuninck-QuickStep) 1:09<br>10 SCHACHMANN Maximilian (Bora-Hansgrohe)</p><h3>Wiebes powers to Scheldeprijs victory</h3><p><strong>Lorena Wiebes</strong> won the first ever <strong>Scheldeprijs</strong> women’s race on Wednesday, out-sprinting <strong>Emma Norsgaard</strong> and <strong>Elisa Balsamo</strong> in Schoten.</p><p>The 136.2 km race came down to a bunch kick after the pack caught the day’s lone breakaway rider, Daniek Hengeveld, with just under 10 km to go and then reeled in a late move from Letizia Borghesi. Movistar led the way into the finale, and then Sarah Roy opened things up in the sprint. She was overtaken by Lisa Brennauer, but then Wiebes and several others surged past.</p><p>Wiebes led into the last hundred meters and held on to take a convincing victory at the line with Norsgaard taking runner-up honors on the day and Balsamo rounding out the podium.</p><p><strong>Top 10</strong></p><p>1 WIEBES Lorena (DSM) 3:26:49<br>2 NORSGAARD Emma (Movistar)<br>3 BALSAMO Elisa (Valcar-Travel &amp; Service)<br>4 MOBERG Emilie (Drops-Le Col)<br>5 KLEIN Lisa (Canyon-SRAM)<br>6 SIERRA Arlenis (A.R. Monex)<br>7 ROY Sarah (BikeExchange)<br>8 ALONSO Sandra (Bizkaia Durango)<br>9 DIDERIKSEN Amalie (Trek-Segafredo)<br>10 KOOL Charlotte (NXTG)</p><h3>Philipsen sprints to Scheldeprijs victory ahead of Bennett and Cavendish</h3><p><strong>Jasper Philipsen</strong> sprinted to victory at <strong>Scheldeprijs</strong> on Wednesday, topping the Deceuninck-QuickStep duo of <strong>Sam Bennett</strong> and <strong>Mark Cavendish</strong> in Schoten.</p><p>The Belgian one-day took place under chilly and windy conditions, and that wind helped force splits early in the race. Bennett and Philipsen were among the riders in a strong lead group that formed with nearly 140 km left to race, while Cavendish and several others were in a second group, with other groups farther behind. The second group linked up with the first group with around 75 km to go, and that new lead selection of around 30 riders would stay clear of those behind and contend for the win.</p><p>Deceuninck-QuickStep was well-represented in the group and led into the final kilometer, but then Alpecin-Fenix surged forward, taking over at the front and putting Philipsen into an excellent position for the final kick with Bennett behind and Cavendish on his teammate’s wheel. Philipsen delivered on the finishing straight, winding up to speed with Bennett unable to come past. Philipsen took his first win of the year and his first win as a member of Alpecin-Fenix with Bennett settling for second and Cavendish taking third just behind his teammate.</p><p><strong>Top 10</strong></p><p>1 PHILIPSEN Jasper (Alpecin-Fenix) 4:03:30<br>2 BENNETT Sam (Deceuninck-QuickStep)<br>3 CAVENDISH Mark (Deceuninck-QuickStep)<br>4 VAN POPPEL Danny (Intermarché-Wanty-Gobert Matériaux)<br>5 RUSSO Clément (Arkéa-Samsic)<br>6 ACKERMANN Pascal (Bora-Hansgrohe)<br>7 MOZZATO Luca (B&amp;B Hotels-KTM)<br>8 NIZZOLO Giacomo (Qhubeka-Assos)<br>9 SARREAU Marc (AG2R Citroën)<br>10 VAN GESTEL Dries (Total Direct Energie)</p><h3>Bouhanni does not start Scheldeprijs, UCI denounces racist abuse</h3><p><strong>Nacer Bouhanni</strong> did not make the start at <strong>Scheldeprijs</strong> on Wednesday. His <strong>Arkéa-Samsic</strong> team said on Twitter that “following recent events,” he was “not in full capacity to take the start.”</p><p>Earlier this week, Bouhanni posted screenshots of several instances of racist abuse that has been directed his way after his relegation at Cholet-Pays de la Loire. The French sprinter said that he is taking legal action in response to the abusive messages.</p><p>The <strong>UCI</strong> <a href=\"https://cyclingtips.com/2021/04/the-uci-condemns-racist-abuse-directed-at-bouhanni/\" target=\"_blank\" rel=\"noreferrer noopener\">addressed the subject</a> in a statement on Wednesday.</p><p>“The Union Cycliste Internationale (UCI) wishes to firmly condemn the racist attacks aimed at the French rider Nacer Bouhanni on social media following his disqualification for dangerous conduct during the final sprint at the Cholet-Pays de la Loire,” the organization said in a statement.</p><p>“However serious the fault of the French rider – which forced the UCI to refer the incident to its Disciplinary Commission and demand the imposition of sanctions against him – , nothing justifies the insults he has been subject to in the days following the act he is accused of.”</p><h3>Jakobsen will return to racing this weekend</h3><p>Over eight months after he sustained serious injuries in a crash on the opening stage of the <strong>Tour of Poland</strong>, <strong>Fabio Jakobsen</strong> will return to competition for the first time this coming weekend at the <strong>Tour of Turkey</strong>.</p><p>Jakobsen suffered several broken bones in his face and underwent multiple surgeries in the aftermath of the crash. Having spent the past few months recovering and working his way back into form on the bike, he will return to racing at the Tour of Turkey, which gets underway on Sunday.</p><h3>Simon Richardson passes away</h3><p><strong>Simon Richardson</strong>, sales manager at Endura, died on Sunday in a bike crash. He was 58. Further details of the incident have not been released.</p><p>Endura founders Jim McFarlane and Pamela Barclay paid tribute to Richardson in a statement.</p><p>“Rest in peace Simon Richardson, beloved and universally respected Endura UK and international sales manager, following a bike accident in Henley on Easter Sunday,” McFarlane and Barclay said.</p><p>“Our thoughts and prayers go out to his wife Camilla and his children Emily, Evan and Holly as we all come to terms with this colossal loss. Simon’s contribution is a profoundly important part of what built Endura into what it is today.”</p><p>Richardson was an active participant in the CyclingTips community, a VeloClub member, and an avid listener to the CyclingTips podcast. Our thoughts are with his family and friends.</p><h2>Coming up …</h2><p>The Itzulia Basque Country continues on Thursday with a fourth stage that should offer an entertaining finale, with two tough climbs in the last 50 km but a flat finish. Riders will tackle the Jaizkibel –&nbsp;a fixture at the Clásica San Sebastián –&nbsp;and then the Erlaitz before descending to the run-in to the line, so it’s tough to say whether the stage will go to an attacker or come down to a small group.</p><h2>Meme of the Day</h2><p>Sooner or later we’ll move on from memes related to designated littering zones, but we just keep seeing good ones …</p><blockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/CNXRGmphrnJ/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"13\" id=\"instagram-media-payload-0\"></blockquote><h2>In case you missed it …</h2><ul><li>This week’s <a href=\"https://cyclingtips.com/2021/04/win-it-weekly-velocio/\" target=\"_blank\" rel=\"noreferrer noopener\">Win It Weekly</a> prize is a gift certificate from <strong>Velocio Apparel</strong>.</li><li>James Huang <a href=\"https://cyclingtips.com/2021/04/spotlight-shadowstand-bike-stand/\" target=\"_blank\" rel=\"noreferrer noopener\">takes a closer look</a> at the <strong>ShadowStand</strong>.</li><li>Josh Ogle’s $1,000 oversized <strong>pulley cage</strong> is <a href=\"https://cyclingtips.com/2021/04/the-1000-oversized-pulley-cage-and-its-creators-road-to-redemption/\" target=\"_blank\" rel=\"noreferrer noopener\">mega-cool and ridiculously rigid</a>.</li><li>Want to <strong>work with CyclingTips</strong>? We’re hiring a <a href=\"https://cyclingtips.com/2021/04/want-to-work-with-ct-were-hiring-a-marketing-manager/\" target=\"_blank\" rel=\"noreferrer noopener\">marketing manager</a> …</li></ul><div><h5>Tags</h5></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1e11a1352029bdc070220cb6adfb46226444d5d51eea46691eb102a81533571d","category":"Cycling"}