{"title":"Cort holds on to win stage 6 of the Vuelta as Roglič takes red","link":"https://cyclingtips.com/2021/08/cort-holds-on-to-win-stage-6-of-the-vuelta-as-roglic-takes-red/","date":1629388697000,"content":"<div><div><p>Magnus Cort (EF Education-Nippo) surged to an impressive victory on Thursday’s stage 6 of the Vuelta a España, narrowly holding on from the early breakaway to win just ahead of Primoz Roglič (Jumbo-Visma), who moved into the overall race lead.</p><p>Cort was part of a five-rider breakaway that got clear around 50 km into the 158.3 km stage from Requena to Alto de la Montaña de Cullera. The peloton allowed the gap to around seven minutes before increasing the pace.</p><p>With a little over 30 km to go, the wind picked up and the race split in a stretch of crosswinds. After a few tense minutes, things came back together, but Hugh Carthy (EF Education-Nippo) found himself at the back with around 15 km to go and then was suddenly distanced. A collection of his teammates dropped back to help close the gap, however, and they eventually did reconnect with the pack.</p><p>An Ineos Grenadiers-led peloton brought to gap to the break down to 30 seconds with 2.6 km to go as the short but steep final climb loomed. Midway up the ascent, with a hard-charging pack closing in, Cort and Bert-Jan Lindeman (Qhubeka-NextHash) pressed on from the break, and then Cort dropped Lindeman to contine on alone.</p><p>With 500 meters to go, Cort was only a few seconds off the front of the pack as Michael Matthews (BikeExchange) opened up a gap on the rest of the pursuers. With 300 meters to go, Roglič would lead a small group of chasers flying past Matthews, but Cort would not be caught. He rounded the final corner with Roglič nearly on his wheel, but he held on to take the win with Roglič settling for second on the same time and Andrea Bagioli (Deceuninck-QuickStep) taking third on the day, two seconds back. With overnight leader Kenny Elissonde (Trek-Segafredo) finishing more than four minutes back, Roglič took over the GC lead. Aleksandr Vlasov of Astana-Premier Tech, Movistar’s trio of Alejandro Valverde, Miguel Ángel López, and Enric Mas, and Egan Bernal of the Ineos Grenadiers all finished within 10 seconds of Roglic. Bernal’s teammates Adam Yates and Richard Carapaz were further back, finishing 25 and 27 seconds down, respectively. Carthy, after catching back onto the pack on the run-on to the final climb, struggled on the steep gradients and would lose 2:50 on the day.</p><div><div><p>La Vuelta ciclista a España (2.UWT) <span>Requena → Alto de la Montaña de Cullera</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/ee/magnus-cort-nielsen-2021.jpeg\"></p></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1e2c93d0fc2c9d3090d1837ddbae1833da15c31b7e3b77b1710122136a662141","category":"Cycling"}