{"title":"Trump Acquitted; 57-43 Vote in Senate Falls Short of Two-Thirds Needed for Conviction","link":"https://www.washingtonpost.com/politics/trump-acquitted-impeachment-riot/2021/02/13/dbf6b172-6e12-11eb-ba56-d7e2c8defa31_story.html","date":1613263218000,"content":"<div id=\"readability-page-1\" class=\"page\"><section><p data-el=\"text\">The tally came after senators briefly upended the proceeding by voting to allow witnesses — only to reverse themselves amid Republican opposition and following hours of negotiations with House Democrats and Trump’s defense team.</p><p data-el=\"text\">The decision in the end to forgo testimony set the stage for Trump’s acquittal without a full accounting of his actions on Jan.&nbsp;6, when pro-Trump rioters who believed his false claims that he had actually won the election stormed the Capitol and endangered the lives of lawmakers, Vice President Mike Pence and hundreds of staff and police officers. The melee resulted in the deaths of one police officer and four others.</p><p data-el=\"text\">Even some of those who voted to acquit the former president excoriated him from the Senate floor after the impeachment trial ended.</p><p data-el=\"text\">“These criminals were carrying his banners, hanging his flag and screaming their loyalty to him,” said Senate Minority Leader Mitch McConnell (R-Ky.), who voted to acquit but has previously denounced Trump’s role in the insurrection and has not spoken to him since mid-December. “It was so obvious that only President Trump could end this. He was the only one.”</p><p data-el=\"text\">The remarks seemed aimed at attempting to turn the page on the Trump era, while also avoiding stoking the wider GOP civil war that a conviction would probably have brought.</p><p data-el=\"text\">But McConnell’s comments infuriated House Speaker Nancy Pelosi (D-Calif.), who excoriated him as “disingenuous” for following up critical words with a vote to acquit, and dismissing his reasoning as “an excuse.”</p><p data-el=\"text\">Senate Majority Leader Charles E. Schumer (D-N.Y.), meanwhile, took aim at the Republicans who defended Trump because of his continuing popularity among GOP voters and their fears that Trump or his base could turn on them if they did not remain loyal. Schumer appeared to be previewing a political argument that is likely to feature prominently in the 2022 election cycle.</p><p data-el=\"text\">“Just look what Republicans have been forced to defend,” Schumer said. “Look what Republicans have chosen to forgive.”</p><p data-el=\"text\">Trump is the only U.S. president to have been impeached twice by the House, which last year handed down articles of impeachment for his attempts to pressure Ukraine in hopes of damaging his then-<br>rival, Joe Biden, who would go on to defeat him in the 2020 presidential election. Trump was impeached again by the Democratic-controlled House last month over his alleged role in inciting the deadly Capitol insurrection.</p><p data-el=\"text\">In a statement after his acquittal, Trump thanked his legal team and decried his impeachment, tying the move to broader efforts made against him by Democrats during his term in office.</p><p data-el=\"text\">“This has been yet another phase of the greatest witch hunt in the history of our Country,” Trump’s statement said. “No president has ever gone through anything like it, and it continues because our opponents cannot forget the almost 75 million people, the highest number ever for a sitting president, who voted for us just a few short months ago.”</p><p data-el=\"text\">Trump has already threatened to support primary challenges against Republicans who did not promote his false claims that the election was stolen, and the power of that threat was evident in Saturday’s roll call — even though the party lost both the White House and Congress during his tumultuous tenure.</p><p data-el=\"text\">Among the seven GOP senators who voted to convict, only one, Lisa Murkowski of Alaska, faces reelection in 2022. Two others, Patrick J. Toomey of Pennsylvania and Richard Burr of North Carolina, have announced plans to retire. Three — Susan Collins of Maine, Ben Sasse of Nebraska and Bill Cassidy of Louisiana — were just reelected last year. And Mitt Romney of Utah doesn’t face reelection until 2024.</p><p data-el=\"text\">“As a result of President Trump’s actions, for the first time in American history, the transfer of presidential power was not peaceful,” Toomey said in a statement. “A lawless attempt to retain power by a president was one of the founders’ greatest fears motivating the inclusion of the impeachment authorities in the U.S. Constitution.”</p><p data-el=\"text\">Republican and Democratic senators alike indicated all week that they opposed allowing witness testimony because of the potential to extend the trial for weeks or even months. Many said the testimony was unlikely to change minds in the evenly divided chamber.</p><p data-el=\"text\">While many Democrats argued that a protracted proceeding would get in the way of President Biden’s agenda, in particular a <a href=\"https://www.washingtonpost.com/coronavirus/?itid=lk_inline_manual_30\" target=\"_blank\">coronavirus</a> relief bill, Saturday’s drama made clear that tensions remained among Democrats over whether to pursue a deeper examination of the events of Jan. 6.</p><p data-el=\"text\">“Each witness can lead to other witnesses and new information,” Sen. Edward J. Markey (D-Mass.) wrote on Twitter after the initial vote to allow testimony. “This can also prompt others with new evidence to come forward voluntarily.”</p><p data-el=\"text\">The drama began when the lead House impeachment manager, Rep. Jamie B. Raskin (D-Md.), opened the day’s proceedings with an unexpected request to call Rep. Jaime Herrera Beutler (R-Wash.) as a witness following reports of<a href=\"https://www.washingtonpost.com/politics/2021/02/13/jaime-herrera-beutler-impeachment/?itid=lk_inline_manual_34\" title=\"www.washingtonpost.com\"> her account </a>that Trump had refused the entreaties of House Minority Leader Kevin McCarthy (R-Calif.) to call off the rioters.</p><p data-el=\"text\">Herrera Beutler described a phone call in which Trump falsely claimed that the rioters were members of antifa, the loose-knit movement of sometimes violent liberal activists. He also accused McCarthy of caring less about Trump’s efforts to overturn Biden’s victory than the rioters did.</p><p data-el=\"text\">Schumer had told Democrats earlier Saturday that the decision about witnesses would be left to the House managers. So after Raskin’s request, the chamber voted 55 to 45 to allow witnesses, with five Republicans joining Democrats and the chamber sliding into uncertainty as groups of senators huddled for hours to figure out what would come next.</p><p data-el=\"text\">A White House official, speaking on the condition of anonymity to discuss internal deliberations, said they monitored what happened in the Senate but were not involved in the negotiations.</p><p data-el=\"text\">The possibility of a protracted trial clearly alarmed Republicans, with Sen. Lindsey O. Graham (R-S.C.) shaking his head and resting his forehead on his hand as Raskin spoke. Separately, Sen. Ron Johnson (R-Wis.) angrily pointed at Romney after the 2012 GOP presidential nominee voted for allowing witnesses.</p><p data-el=\"text\">Trump’s lawyers also threatened to call hundreds of witnesses, though they would not have been allowed to do so without Senate approval.</p><p data-el=\"text\">After nearly three hours of deliberations, the Senate came back to order and Raskin announced that he was willing to accept a compromise in which Herrera Beutler’s statement would be admitted as evidence — and that Trump and his lawyers would stipulate to its veracity.</p><p data-el=\"text\">Stacey Plaskett, a Democratic delegate from the Virgin Islands who was one of the impeachment managers, said in explaining the decision that “other individuals who may have been there with the president were not friendly . . . to us and would have required subpoenas and months of litigation.”</p><p data-el=\"text\">One individual close to the House managers’ deliberations said getting Trump to agree that Herrera Beutler’s statement was true was an important victory. The person also said that the “already overwhelming evidence” admitted in the trial had made the managers’ case “without the need for subpoena, deposition and other testimony.”</p><p data-el=\"text\">However, in his closing argument, Trump attorney Michael T. van der Veen said the former president and his lawyer were not stipulating to the “truthfulness” of Herrera Beutler’s statement.</p><p data-el=\"text\">The five-day trial featured dramatic presentations by the nine House impeachment managers, who offered a harrowing retelling of the terror that engulfed the Capitol last month. They shared <a href=\"https://www.washingtonpost.com/politics/2021/02/10/trump-impeachment-live-updates/?itid=lk_inline_manual_50\" title=\"www.washingtonpost.com\">shocking new audio and video recordings </a>of rioters declaring their intent to harm Pence and other top officials — and showing how close they came to doing so.</p><p data-el=\"text\">There were chants to “Hang Mike Pence!” and a sinister clip of a man looking for Pelosi and asking, “Naaaancy? Where aaaare you, Nancy?” And there was new surveillance video showing Romney being rushed back into the Senate chamber by Officer Eugene Goodman moments before Goodman confronted a mob of insurrectionists just paces away.</p><p data-el=\"text\">All of it, the impeachment managers said, was a direct result of the president’s months-long effort to persuade his supporters of the “big lie” that the election had been stolen. After he had exhausted all other options to overturn Biden’s victory — including dozens of lawsuits and a sustained campaign to pressure state election officials — they said Trump turned his sights to Jan. 6, the day Congress was scheduled to formalize Biden’s electoral college victory.</p><p data-el=\"text\">The managers, led by Raskin, also detailed the casualties of that day, including a U.S. Capitol Police officer and four others who died. Two more officers took their own lives in the subsequent days. One officer is expected to lose an eye, others lost fingers and several are still recovering from serious head injuries.</p><p data-el=\"text\">“President Trump put a target on their backs,” said Plaskett, describing the threat to all of those in the Capitol that day. “And his mob broke into the Capitol to hunt them down.”</p><p data-el=\"text\">In their closing arguments Saturday, the House managers highlighted Trump’s disregard for the safety of congressional leaders as well as Pence — and urged senators to convict “for the safety and security of our democracy and our people.”</p><p data-el=\"text\">“We’ve proven to the satisfaction of the American people, certainly, that the president, after the breach and the invasion took place, was not working on the side of defending the Capitol, but rather was continuing to pursue his political goals,” Raskin said.</p><p data-el=\"text\">The managers also attempted to rebut the Trump defense team’s claims that Democrats view Trump’s Jan. 6 speech as the sole incitement for the attack, that Trump could not have known that violence would erupt that day, and that the insurrectionists came to Washington of their own accord.</p><p data-el=\"text\">“This was not one speech,” said impeachment manager Rep. Madeleine Dean (D-Pa.). “This was a deliberate, purposeful effort by Donald Trump over many months that resulted in the well-organized mob’s attack on January the 6th.” The fact that the insurrection was planned, Dean argued, further supports Democrats’ point.</p><p data-el=\"text\">Trump’s lawyers — who used only a small fraction of their allotted time to make their closing arguments Saturday — emphasized that the former president never explicitly urged violence and that his false claims about the election were protected under the First Amendment.</p><p data-el=\"text\">They and other Republicans also argued it was unconstitutional to hold an impeachment trial after a president has left office.</p><p data-el=\"text\">“At no point did you hear anything that could ever possibly be construed as Mr. Trump encouraging or sanctioning an insurrection,” van der Veen said. “Senators, you did not hear those tapes because they do not exist, because the act of incitement never happened.”</p><p data-el=\"text\">Rosalind S. Helderman, Paul Kane, Felicia Sonmez, John Wagner and Amy B Wang contributed to this report.</p></section></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"1e302a9ff017d1e906de5c0424b35ebf41bb435217b45d489c7ec07f5de4218e","category":"Tech"}