{"title":"Romain Bardet climbs to stage 14 victory at the Vuelta a España","link":"https://cyclingtips.com/2021/08/romain-bardet-climbs-to-stage-14-victory-at-the-vuelta-a-espana/","date":1630165444000,"content":"<div><div><p>Romain Bardet (Team DSM) took a fantastic victory on stage 14 of the Vuelta a España after attacking the breakaway in the closing kilometres of the final climb. As well as taking only his second win outside France – both in Spain – Bardet also takes the lead in the mountains classification.</p><p>Stage 14 got started with a relatively relaxed first half, followed by a very challenging back end that culminated in a never-before-used summit finish. The peloton was happy to let 18 riders slip away soon after leaving Don Benito, before settling into the 165.7 km route to Pico Villuercas.</p><p>The breakaway stretched their gap to over 10 minutes inside the first 100 km, and after dipping over the first-category Puerto Collado de Ballesteros, the gap bounced out to over 14 minutes on the approach to the final climb.</p><p>By 30 km to go, the breakaway had fractured following an attack initiated by Matt Holmes (Lotto Soudal) just inside 50 km to go. The Brit was held up by a flat tyre, but before long he had rejoined Nicolas Prodhomme (AG2R-Citroën) and Daniel Navarro (Burgos-BH), bringing Sep Vanmarcke (Israel Start-Up Nation) with him.</p><p>Just as Bardet led the chase-down of the lead group, Prodhomme attacked again, once more chased by Navarro and Vanmarcke. However, the young Frenchman was alone within a couple of kilometres, as Navarro took out Vanmarcke after misjudging a corner. It was the second crash to bruise the breakaway after Jay Vine’s (Alpecin-Fenix) alarming earlier tumble after getting caught up with a team car.</p><p>Prodhomme started the final climb with around a minute’s advantage over a 12-strong chasing group, which was quick to wear itself down with a flurry of accelerations. Early attacker Andrey Zeits (BikeExchange) finally made it up to the leader after an eight kilometre grind, but just as he made it to the front, Bardet flew past them after attacking the group behind.</p><p>Bardet made short work of the steep gradients, quickly gaining a substantial advantage that he maintained all the way to the finish. Best of the rest from the breakaway was Jesús Herrada (Cofidis) after following a late acceleration by Jay Vine, his jersey in tatters, the Australian taking a remarkable podium finish in his maiden Grand Tour.</p><p>Miguel Ángel López (Movistar) led the GC riders home 10:25 after Bardet finished having attacked a few kilometres from the top. In the end, he only finished four seconds ahead of a small group led by Primož Roglič (Jumbo-Visma), with Enric Mas (Movistar), Egan Bernal (Ineos Grenadiers) and Jack Haig (Bahrain-Victorious) on his wheel. Odd Christian Eiking (Intermarché-Wanty-Gobert Matériaux) finished just 20 seconds later to keep the red jersey by 58 seconds, surviving an earlier attack from Guillaume Martin of Team Cofidis who only won back a handful of seconds.</p><div><div><p>La Vuelta ciclista a España (2.UWT) <span>Don Benito → Pico Villuercas</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/fb/romain-bardet-2021.jpeg\"></p></div></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1e515d0c0704c7f832515a414d2f2ceb4481ca1eb96a2f1102101d7b10dfefd3","category":"Cycling"}