{"title":"Whisky Parts Co. Spano handlebar review: Gravel flare done right","link":"https://cyclingtips.com/2021/09/whisky-parts-co-spano-handlebar-review/","date":1632318895000,"content":"<div><div><p>There’s certainly no shortage of “gravel-specific” handlebars on the market these days, nearly all with variations on a common theme: wider available widths, short reach, shallow drop, and some degree of flare. Yet despite the explosion of the category, most models ignore the fact that brake lever bodies are designed to be positioned nominally vertical.</p><p>Whisky Parts Co’s new carbon fiber Spano follows in the footsteps of <a href=\"https://cyclingtips.com/2020/06/3t-exploro-racemax/\" target=\"_blank\">3T’s Superghiaia</a> and a few others by incorporating a so-called “progressive” flare. More specifically, the upper section of the drops is flared at a modest 12° so as not to mess too much with the hood angle, while the lower section sits at a more pronounced 20°. This still provides riders with the additional width down below where it’s most useful (6 cm more width at the end of the drops as compared to the where the levers mount, measured center-to-center), but without forcing your wrists into a weird position or creating a goofy reach to the brake levers when you’re on the hoods.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Whisky-Spano-handlebar-review-2-1340x754.jpg\"><figcaption>The compound flare offers the width and control that many gravel riders want, but without the goofy lever angle that comes with many flared bars.</figcaption></figure><p>The tops are flattened “to promote flex and cutdown on feedback from rougher surfaces”, and the compact 68 mm reach and 100 mm drop are about what you’d expect. The ends are also drilled for internal Shimano Di2 wire routing, and it’s offered in five widths: 40, 42, 44, 46, and 48 cm (measured center-to-center at the hoods), all with a 31.8 mm stem clamp diameter.</p><p>Actual weight for my 44 cm sample is 239 g, and retail price is US$280 — not as low as I would have liked to see from a brand like Whisky, but at least competitive with other options. Availability is limited to North America for now given the limited initial production quantities, but Whisky is hoping that changes in the near future.</p><h2><strong>On the trail with the Spano</strong></h2><p>First things first: handlebars are nearly as personal an item as saddles or shoes, so take my comments here with a grain of salt.</p><p>I should make it clear right from the get-go that I haven’t historically been a fan of many flared bars for gravel. I’ve never liked the weird lever angle, and haven’t always gotten along with the concept that the extra leverage afforded by the additional bar width also requires you to get <em>lower </em>— which is the opposite of what I usually want if and when things get hairy.</p><p>To that end, the Spano strikes me as a solid compromise, and it honestly surprised me a bit.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Whisky-Spano-handlebar-review-3-1340x754.jpg\"><figcaption>By limiting the flare up top to a modest 12°, the levers end up at a more natural-feeling angle for your hands.</figcaption></figure><p>For one, I think Whisky, 3T, and any other bar brands out there that are using this sort of compound flare design have got the right idea. The mild outward cant of the lever blades produced by this design still feels pretty natural to me while on the hoods, and the difference between the upper and lower flare angles isn’t so extreme that the brake lever blades end up in a weird position when you’re down in the drops. To me, the more typical flared bars gain versatility in the drops at the expense of comfort on the hoods, but that’s not the case here.</p><p>Kudos to Whisky for the segment-appropriate drop and reach figures, too, as well as the tight bend right where the levers mount. Whereas I prefer a big change in body position when I transition between the hoods and the drops on road bikes, this setup retains a more neutral posture throughout for more control without shifting the weight bias too far forward. I’d caution against clocking your levers too far upward, though, as it can make for an awkward reach to the brakes.</p><p>In terms of comfort, I did find the Spano to be very agreeable, but not for the reasons Whisky claims. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Whisky-Spano-handlebar-review-5-1340x754.jpg\"><figcaption>The compact reach and shallow drop feel just about right for the intended usage.</figcaption></figure><p>There’s a bit of flex, sure, but it doesn’t strike me as dramatically different from most other carbon drop bars I’ve used over the years (and I ultimately installed my trusty Redshift Sports ShockStop suspension stem to bring back my usual levels of squishiness). What I did quickly come to appreciate, however, is how the subtle shaping is so well suited to my hands. </p><p>The tops are flattened enough to help spread out pressure on your palms, but not so much that it feels weird to hold. In fact, once you account for brake lines (and derailleur housing, if applicable) under the tape, the overall shape is close to round, which I generally prefer. Also good to see is the tight-radius bend at the ends of the tops to help maximize the available width, and the slight rearward sweep that makes for a slightly more neutral wrist angle. Taken in total, it makes the tops a nice place to spend some time if you’re doing some more casual cruising.</p><p>Down in the drops, Whisky has also gone to the trouble of subtly flattening the upper and outer edge of the bar, which, again, makes for a more ergonomic shape in my hands and a more pleasant feel.  It’s by no means a dramatic difference, but one that’s noticeable nonetheless when switching back and forth between the Spano and something with a more rounded profile.</p><h2><strong>Yay or nay</strong></h2><p>People often question if carbon fiber handlebars makes sense relative to a good aluminum one. It’s a worthwhile question, especially given the 4-5x price differential, the fact that crashes are more common in gravel riding, and carbon bars’ annoying tendency to break instead of bend during a hard impact. From a purely practical standpoint, the answer is pretty obvious.</p><p>However, carbon bars are generally lighter and ride a little better, and the construction method allows for more elaborate shaping. I’d argue the weight and ride quality advantages are pretty minor in this case, but it’s the shaping where the Whisky Spano starts to make its case depending on how much trouble you have with your hands. I personally find the Spano’s refined form more comfortable to hold as compared to most aluminum bars, but let’s get real: some of that is negated just by running thick bar tape. </p><p>When all is said and done, the Spano is a luxury choice. If you’ve already budgeted for a carbon gravel bar, this is one of the nicer ones I’ve used, and my guess is that it’ll be sooner rather than later that more carbon models adopt this sort of compound flare design. But otherwise, as good as the Spano seems to be, most people will still be just fine with an aluminum bar.</p><p>More information can be found at <a href=\"https://whiskyparts.co/handlebars/spano-drop-handlebar#/\" target=\"_blank\">whiskyparts.co</a>.</p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Whisky-Spano-handlebar-review-4-1340x754.jpg\"><figcaption>The sharp bend at the end of the tops makes for more usable space.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Whisky-Spano-handlebar-review-6-1340x754.jpg\"><figcaption>The slightly flattened section here makes for a surprising boost in comfort when you’re in the drops.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Whisky-Spano-handlebar-review-7-1340x754.jpg\"><figcaption>The tops also sport a slight backsweep for a more natural wrist angle, and it’s offset forward to as to not affect the overall reach.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Whisky-Spano-handlebar-review-8-1340x754.jpg\"><figcaption>The end of the handlebar is drilled for internal Shimano Di2 wire routing.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Whisky-Spano-handlebar-review-9-1340x754.jpg\"><figcaption>The flattened tops don’t feel like they provide as much flex as the marketing materials suggest, but they do make for a lot of surface area for your hands. A close look at the finish also reveals clues about how the bar is constructed.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Whisky-Spano-handlebar-review-11-1340x754.jpg\"><figcaption>Textured clamp areas are always nice to see, but I’d still supplement with carbon friction paste.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Whisky-Spano-handlebar-review-12-1340x754.jpg\"><figcaption>It’s important to have some fun, no?</figcaption></figure></li></ul></div></figure></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1e83774dacf073863b4279ff8d7c75564f100f12cd43841561f59c59ee71cada","category":"Cycling"}