{"title":"USA Cycling announces women’s road Tokyo Olympic team","link":"https://cyclingtips.com/2021/06/usa-cycling-announces-womens-road-tokyo-olympic-team/","date":1623341874000,"content":"<div><div><p>With 45 days remaining until the women’s road race at the Olympic Games, USA Cycling has announced the five-woman team who will take to the line in Tokyo. Ruth Winder, Coryn Rivera, Chloe Dygert, and Leah Thomas have been named to the road race team, with Dygert also lining up for the time trial. In addition, Amber Neben will race the time trial in Tokyo.</p><p>Winder and Dygert both attended the Olympic Games in Rio de Janeiro albeit on the track for the team pursuit. Neben was part of the 2008 and 2012 Olympic teams.</p><p>Of the five, Winder is the only one to have won a race in 2021. The Trek-Segafredo rider won Brabantse Pijl in April and finished second at the Navarra Women’s Classic in May. She has been the USA national champion since 2019, the last time the event was held. In 2020, Winder won the overall at the Santos Women’s Tour Down Under after winning the third stage.</p><p>Dygert was the time trial world champion in 2019 and was close to a second title in 2020 before she suffered a horrendous crash and was unable to finish the race. Since then, Dygert has been working to recover from the incident at the USA Olympic Center in Colorado Springs. She has not been able to return to competition just yet but has been vocal about her goal of being in Toyko in July.</p><p>Dygert will likely also race on the track in Tokyo, she is a key member of the team pursuit team.</p><p>Apart from the ITT world title in 2019, Dygert does not have a ton of experience on the road, the 24-year old has dedicated most of her career to the track. Still, she won both the ITT and road race junior world titles in 2015, the Panamerican time trial title in 2017, and absolutely stormed the US scene in 2019. During the 2019 season, she won all three of the UCI stage races in the US along with multiple stages from each. The most impressive performance prior to her ITT world title was what she took all four stages and all four jerseys at the Colorado Classic.</p><p>Rivera is a legend of American cycling. To date, Rivera has had 72 national titles spanning the road and track. She won her first three titles in 2006 when she swept the road, ITT, and criterium events at the Junior road national championships and was the elite road race champion in 2018.</p><p>Rivera was the first American cyclist, men or women, to win the Tour of Flanders in 2017.</p><p>Thomas is the least experienced on the team but has had a few incredible years in Europe. In 2019, her first full season in Europe, Thomas won the Women’s Tour of Scotland and the ITT a the Pan American championships. In 2020 Thomas barely got to race, due to the pandemic and was still able to finish third at Strade Bianche. Earlier in 2020, she won the final stage of the Setmana Ciclista Valenciana.</p><p>Neben is the final rider named to the Olympic team. The 2016 ITT world champion has not yet raced in 2021 and only raced the World Championships and the first stage of the Giro Rosa in 2020. She won back to back titles at the Chrono de Gatineau ITT and the USA national ITT titles in 2019, 2018, and 2017.</p><p>The 137 km long course in Tokyo features one major climb before descending to the Fuji International Speedway. There is 2692 meters of climbing throughout the route, with a bit of a false flat rise to the finish. Overall, it looks like the course suits a sprinter-type who can hold on to the top of the climb.</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1f565998587bb020ce42f5f67c452a8a4bfc502fe0801cc0f5da3c03f7cc87a2","category":"Cycling"}