{"title":"Sepp Kuss will ride on with Jumbo-Visma through 2024","link":"https://cyclingtips.com/2021/03/sepp-kuss-will-ride-on-with-jumbo-visma-through-2024/","date":1616178551000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Sepp Kuss at the UAE Tour.</h4><p></p><div><p>Sepp Kuss has signed an extension to stick with Jumbo-Visma through the 2024 season, the team announced on Friday.</p><p>The 26-year-old American has been with the squad since 2018, when he came over from the Rally team. Since then, he has emerged as a key support rider for the Grand Tours while also taking some strong results of his own, including the overall win and three stages at the 2018 Tour of Utah, a stage win at the 2019 Vuelta a España, and a stage win at the 2020 Critérium du Dauphiné.</p><p>Moving forward, Kuss is expected to have a few more opportunities to ride for his own chances.</p><p>“I’m really happy to extend with the team. For me, over the past three years, it has felt really comfortable for me,” Kuss said.</p><p>“Everybody on the staff and all the riders make Team Jumbo-Visma a very nice environment for me. The special thing about the team is that everybody understands me as an athlete and, more importantly, as a person. That way we get the most out of each other. I always get opportunities and that helps me stay motivated. We are always striving for something big at this team and that’s really exciting and really special. So I hope to continue that and keep making some good memories.”</p><p>Kuss will be among the overall contenders next week at the Volta a Catalunya, and he is set to race the Tour de France and potentially the Vuelta a España later this year.</p><p>“Sepp is one of the best climbers in the peloton,” said Jumbo-Visma sport director Merijn Zeeman. “He has grown into a rider who takes his own chances, but he is also super important in supporting the leaders. He is increasingly becoming a leader himself and we will guide him in discovering his limits in the upcoming years.”</p><div><h5>Tags</h5></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1f718b8a05886b1674a9e9720268723e57c01614995bf24fc8f1a11ac3c1590b","category":"Cycling"}