{"title":"NHS COVID-19 Contact Tracing App Has Told 1.7 Million in England and Wales to Isolate Since September","link":"https://www.macrumors.com/2021/02/09/nhs-covid-app-1-7-million-self-isolate/","date":1612864734000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/09/nhs-covid-app-1-7-million-self-isolate/\"><p><a href=\"https://apps.apple.com/gb/app/nhs-covid-19/id1520427663\">NHS COVID-19</a>, the contact tracing app created by the U.K. government, has alerted 1.7 million users to isolate following close contact with someone who goes on to test positive.</p><p><img alt=\"exposure notification cartoon\" width=\"2500\" height=\"1406\" src=\"https://images.macrumors.com/t/cKaFsTg307OCYmjRbee5lxbvcuM=/400x0/filters:quality(90)/article-new/2020/04/Exposure-Notifications-W-People-and-Text.jpg?lossy\" data-src=\"https://images.macrumors.com/t/cKaFsTg307OCYmjRbee5lxbvcuM=/400x0/filters:quality(90)/article-new/2020/04/Exposure-Notifications-W-People-and-Text.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/cKaFsTg307OCYmjRbee5lxbvcuM=/400x0/filters:quality(90)/article-new/2020/04/Exposure-Notifications-W-People-and-Text.jpg?lossy 400w,https://images.macrumors.com/t/UtzpBO0fK-1lzJcFSnimXS0J9l8=/800x0/filters:quality(90)/article-new/2020/04/Exposure-Notifications-W-People-and-Text.jpg?lossy 800w,https://images.macrumors.com/t/zJ9S7Evpz6y--tdMnawaOb5nF6s=/1600x0/filters:quality(90)/article-new/2020/04/Exposure-Notifications-W-People-and-Text.jpg 1600w,https://images.macrumors.com/t/kizov9nRUJ4QnZVQw34uK_69zaQ=/2500x0/filters:no_upscale():quality(90)/article-new/2020/04/Exposure-Notifications-W-People-and-Text.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/cKaFsTg307OCYmjRbee5lxbvcuM=/400x0/filters:quality(90)/article-new/2020/04/Exposure-Notifications-W-People-and-Text.jpg?lossy 400w,https://images.macrumors.com/t/UtzpBO0fK-1lzJcFSnimXS0J9l8=/800x0/filters:quality(90)/article-new/2020/04/Exposure-Notifications-W-People-and-Text.jpg?lossy 800w,https://images.macrumors.com/t/zJ9S7Evpz6y--tdMnawaOb5nF6s=/1600x0/filters:quality(90)/article-new/2020/04/Exposure-Notifications-W-People-and-Text.jpg 1600w,https://images.macrumors.com/t/kizov9nRUJ4QnZVQw34uK_69zaQ=/2500x0/filters:no_upscale():quality(90)/article-new/2020/04/Exposure-Notifications-W-People-and-Text.jpg 2500w\"><br>That's according to an official <a href=\"https://www.gov.uk/government/news/nhs-covid-19-app-alerts-17-million-contacts-to-stop-spread-of-covid-19\">GOV.UK press release</a> from the Department of Heath and Social Care, which has been collating data about the app since it was launched in September 2020.<br></p><blockquote><p>Over 1.7 million app users across England and Wales have been advised to isolate by the NHS COVID-19 app following a close contact with someone who goes on to test positive, new data published today shows.</p><p>The NHS COVID-19 app has been breaking chains of transmission to protect users and their communities since its launch in September.</p></blockquote><p>Like other apps that take advantage of the anonymized <a href=\"https://www.macrumors.com/guide/exposure-notification/\">Exposure Notification API</a> from Apple and Google, NHS COVID-19 is designed to track who people come into contact with each other using Bluetooth, providing a notification if one of those people later comes down with the coronavirus.</p><p>Along with using a Bluetooth-based solution, NHS COVID-19 lets users scan QR codes to register visits to locations like stores and restaurants to aid in contact tracing, with U.K. businesses being encouraged to display QR posters for visitors to scan.</p><p>According to the press release, the app has now been downloaded 21.63 million times, representing 56% of the eligible population aged 16+ with a smartphone and was the second most downloaded free <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> app on the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> in 2020.</p><p>However, only about 16.5 million people are currently actively using the contact-tracing tool, which is 24% below the app's latest download tally. The difference is likely due to users uninstalling the app, disabling contact-tracing, or not activating it all.</p><p>Research conducted by scientists at The Alan Turing Institute and Oxford University shows for every 1% increase in app users, the number of coronavirus cases in the population can be reduced by 2.3%.</p><p>Research by the Turing/Oxford team into the epidemiological impact of the app also points to a causal link between app use and reduced case numbers, with their analysis suggesting the NHS COVID-19 app has prevented 600,000 cases since it was launched.<br></p><blockquote><p>\"The NHS COVID-19 app is an important tool in our pandemic response,\" said Health and Social Care Secretary Matt Hancock. \"We know it has instructed hundreds of thousands of at-risk people to self-isolate since it launched in September – including me – and this analysis shows it has been hugely effective at breaking chains of transmission, preventing an estimated 600,000 cases.\"</p></blockquote><p>The NHS did not initially plan to use Apple and Google's ‌‌<a href=\"https://www.macrumors.com/guide/exposure-notification/\">Exposure Notification</a>‌‌ API and was instead pursuing a <a href=\"https://www.macrumors.com/2020/04/27/uk-pursues-centralized-coronavirus-tracking-app/\">different solution</a>, but after the announcement of the API the NHS <a href=\"https://www.macrumors.com/2020/06/18/uk-contact-tracing-app-apple-google-api/\">changed course</a> and decided to work on an app using the Apple/Google API after all.</p><p>Zuhlke UK, the firm behind the contact tracing app, told the <em><a href=\"https://www.bbc.com/news/technology-55985562\">BBC</a></em> that despite the positive signs shown in the number of downloads of the app, it was essential for users to start re-activating its features as lockdown measures gradually eased.<br></p><blockquote><p>\"The data suggests that we have made a dent in the overall infection rate,\" said Wolfgang Emmerich, chief executive of Zuhlke UK.</p><p>\"What we really have to do now, particularly as we're preparing to come out of lockdown, is to drive that adoption rate back up and to get people to switch [the app] back on again.\"</p></blockquote><p>Emmerich also told the <em>BBC</em> that his team had put plans to extend the app to older ‌iPhone‌ models on the back burner so as to prioritize other new features, but declined to say what they are.</p><p><small>Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our <a href=\"https://forums.macrumors.com/forums/political-news.218/\">Political News</a> forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.</small></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/intel-11th-gen-vs-apple-m1-chip-benchmarks/\">Intel Downplays Apple's M1 Chip With 'Carefully Crafted' Benchmarks</a></h3><p>Saturday February 6, 2021 3:17 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Nearly three months after the launch of Apple's rave-reviewed M1 Macs, Intel has fired back, but there are some asterisks involved. In a slideshow shared by PCWorld this week, Intel highlighted what PCWorld described as \"carefully crafted\" benchmarks in an attempt to prove that laptops with the latest 11th Generation Core processors are superior to those with Apple's custom-designed M1 chip. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-dtk-credit-for-developers-increased/\">Apple Ups DTK Mac Mini Return Credit to $500 After Developer Complaints</a></h3><p>Friday February 5, 2021 8:51 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Prior to the release of the M1 Macs, Apple offered developers a $500 Developer Transition Kit (DTK) that included a Mac mini equipped with an A12Z Bionic chip first used in the iPad Pro, 16GB RAM, a 512GB SSD, two USB-C ports, two USB-A ports, and an HDMI 2.0 port. The DTKs were available on a temporary basis, and earlier this week, Apple said that it would soon begin asking developers to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/01/imac-apple-silicon-redesign/\">iMac to Get a Whole New Look for Apple Silicon</a></h3><p>Apple's long-awaited iMac with Apple Silicon is expected to arrive this year featuring a complete redesign, according to a range of reports. According to Bloomberg's Mark Gurman, the redesigned iMac models will feature significantly slimmed down bezels around the display. The large aluminum \"chin\" segment, below the display of current iMacs, will be removed entirely for a design that...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/07/iphone-12-risk-magnets-pacemakers/\">Medical Doctors Underline Potential Risk of iPhone 12 Interference With Pacemakers</a></h3><p>Sunday February 7, 2021 4:11 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple's warning to keep the iPhone 12 away from cardiac devices due to electromagnetic interference was further underlined by U.S. cardiologists this week in a new report (via NBC25 News). Apple's iPhone 12 series includes an array of magnets that help align the phone on Apple's MagSafe charging accessory to maximize charging, and Apple already advises users with implanted pacemakers and...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/top-stories-ios-14-5-beta/\">Top Stories: iOS 14.5 Beta, macOS 11.2 Released, VR Headset and Apple Car Rumors</a></h3><p>It was a big week for software this week, with Apple kicking off a new round of betas for its operating systems with plenty of tweaks and changes in iOS 14.5 and related updates. We also saw the public release of macOS 11.2, which trailed last week's release of iOS 14.4. In other news, we got some significant new rumors about Apple's VR headset project and the Apple Car, while over on our...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-pauses-car-talks-hyundai-kia/\">Apple Pauses Electric Car Talks With Hyundai and Kia</a></h3><p>Friday February 5, 2021 2:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Multiple rumors over the course of the last week have suggested that Apple has been discussing Apple car manufacturing with Hyundai and Hyundai affiliate Kia, but those talks have paused recently, reports Bloomberg. Apple has also been discussing its Apple Car plans with other automobile manufacturers, so despite rumors suggesting Apple is considering a deal with Hyundai/Kia, Apple could...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/ios-14-5-beta-siri-default-music-service/\">Siri Setting in iOS 14.5 Beta Lets Users Select Default Music Streaming Service</a></h3><p>Monday February 8, 2021 4:09 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple last week released beta versions of upcoming iOS 14.5 and iPadOS 14.5 updates to developers and public beta testers, and among a number of new features, Apple has added the ability to set a default music streaming service when using Siri to play songs. Image via Reddit user matejamm1 First spotted by Reddit users, the first time you ask Siri to play a song in iOS 14.5, you are given the ...</p></div></div></div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"20788990d82dd2fbeac96eac6a924d4c251b9900ba152138a3afccecfa1faebb","category":"Apple"}