{"title":"Why GameStop couldn’t cash in on its briefly inflated stock frenzy","link":"https://arstechnica.com/?p=1741478","date":1613064299000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>stonks —</h4><h2 itemprop=\"description\">And how the retailer could still arrange a stock-for-cash infusion in the future.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/gs-800x533.jpg\" alt=\"Hi, yeah, how much can I get by trading in this slighty used share of GameStop stock?\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/gs.jpg\" data-height=\"4480\" data-width=\"6720\">Enlarge</a> <span>/</span> Hi, yeah, how much can I get by trading in this slighty used share of GameStop stock?</p></figcaption></figure><p>At the beginning of the year, the stock market as a whole valued video game retailer GameStop at roughly $1.15 billion. By the close of trading on January 27, at the height of <a href=\"https://arstechnica.com/gaming/2021/01/the-complete-morons-guide-to-gamestops-stock-roller-coaster/\">the speculative mania surrounding the stock</a>, that total value had surged to about $22.6 billion. Today, GameStop's market cap has sunk back down to a more reasonable $3.34 billion.</p><p>You'd think GameStop would have tried to take advantage of this brief market mania, cashing in on its suddenly hot brand by trading inflated stock for real money that could help its <a href=\"https://arstechnica.com/gaming/2019/09/gamestop-plans-up-to-200-store-closures-expects-many-more-on-the-way/\">struggling brick-and-mortar business</a>. But <a href=\"https://www.reuters.com/article/us-retail-trading-gamestop-capitalraise/exclusive-how-gamestop-missed-out-on-capitalizing-on-the-reddit-rally-idUSKBN2AB14F\">a new Reuters report</a> cites \"three people familiar with the US video game retailer’s internal deliberations\" in detailing the logistical and regulatory hurdles that prevented that from happening.</p><h2>Insider red tape</h2><p>The core of GameStop's quick cash-in problem was the SEC's insider trading rules, which <a href=\"https://www.sec.gov/Archives/edgar/data/1697805/000121390019008879/f8k051519ex14-1_xynomic.htm\">define a specific \"trading window\" schedule</a> outlining when company insiders can and can't trade on quarterly earnings results that haven't yet been made public.</p><p>Unfortunately for GameStop, that regulatory window closed on January 25, six days before the end of the company's fiscal quarter. That means GameStop's opportunity for quick and easy capitalization on its stock price closed just as its then-roughly $5 billion market cap was ready to shoot up to its $22+ billion peak just two days later.</p><p>GameStop could have gotten around this problem by rushing to release a preliminary earnings report well ahead of its usual schedule (the report for the quarter ending last January wasn't released until late March). But that report would still have likely taken at least a few days to prepare for the public. SEC rules would have also required the company to wait an additional two full trading days after any such release to start cashing in. Given the volatility of GameStop's stock value at that point, the company likely still would have missed the peak, even with a rushed-out report.</p><p>What's more, anything short of a stellar earnings report may have burst the delicate bubble of speculative fervor that had driven GameStop stock up so high in the first place. If even a small segment of traders saw those earnings as a fresh warning sign that the stock was dangerously overvalued, it could have triggered the stock's inevitable sell-off much more quickly before GameStop would have been able to truly capitalize.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/gamestop-stock-bubble.jpg\" data-height=\"563\" data-width=\"1000\" alt=\"Pop goes the bubble...\"><img alt=\"Pop goes the bubble...\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/gamestop-stock-bubble-640x360.jpg\" width=\"640\" height=\"360\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/gamestop-stock-bubble.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/gamestop-stock-bubble.jpg\" data-height=\"563\" data-width=\"1000\">Enlarge</a> <span>/</span> Pop goes the bubble...</p></figcaption></figure><p>And even if the timing of a preliminary earnings report release worked out perfectly, GameStop may have been wary of increased regulator scrutiny of any such attempt to cash in. The SEC <a href=\"https://www.sec.gov/news/public-statement/joint-statement-market-volatility-2021-01-29\">wrote on January 29</a> that \"issuers must ensure compliance with the federal securities laws for any contemplated offers or sales of their own securities\" and that it would \"act to protect retail investors when the facts demonstrate abusive or manipulative trading activity that is prohibited by the federal securities laws.\" Such warnings could have easily given GameStop pause in trying to take advantage of its unexpected paper windfall.</p><p>GameStop's regulatory timing is even more unfortunate given the success that some other companies (with fiscal quarters ending in December) had in converting their recent brief January stock bubbles to actual financial gain. Theater chain AMC's new owners used the company's inflated stock price <a href=\"https://www.polygon.com/movies/2021/1/29/22256360/amc-stock-price-reddit-rally-robinhood-debt-conversion\">to effectively wipe out $600 million in debt</a>, a huge relief valve for a company that was <a href=\"https://www.cbsnews.com/news/amc-movie-theater-avoid-bankruptcy/\">on the verge of bankruptcy just a week before</a>. And American Airlines <a href=\"https://www.cnbc.com/2021/01/29/american-airlines-plans-another-1-billion-stock-sale-after-big-rally.html\">sold over $1 billion shares of new stock</a> after its shares rose nearly 50 percent last month.</p><h2>A cash-in deferred?</h2><p>Even though GameStop's stupendous stock peak now seems to have passed, the company's opportunity to cash in might not be completely over. GameStop stock is still trading at around $50 a share as of this writing, or roughly 375 percent of <a href=\"https://www.marketwatch.com/investing/stock/gme/analystestimates\">the consensus analyst estimate of a $13.44 target price</a>. That stock price has been relatively flat since February 4, too, suggesting there may still be just enough <a href=\"https://www.investopedia.com/terms/h/hodl.asp\">HODL-ing investors</a> out there to maintain some of that value in the near term.</p><p>Reuters reports that GameStop had already registered a plan with the SEC to sell $100 million of GameStop stock in December, when its market cap hovered around just $1 billion. While the company elected not to go through with that plan, it seems like it's something it might consider again if the market cap stays about five times as high.</p><p>A quick cash infusion from the sale of still somewhat-inflated stock might be just what GameStop needs to jumpstart activist investor (and <a href=\"https://www.businessinsider.com/gamestop-adds-chewy-ryan-cohen-wall-street-darling-to-board-2021-1\">recently installed GameStop board member</a>) Ryan Cohen's ambitious turnaround plans, too. Cohen <a href=\"https://www.sec.gov/Archives/edgar/data/1326380/000101359420000821/rc13da3-111620.pdf\">wrote in November</a> that he thinks GameStop should \"cut its excessive real estate costs and hire the right talent [to] begin building a powerful e-commerce platform that provides competitive pricing, broad gaming selection, fast shipping, and a truly high-touch experience that excites and delights customers.\"</p><p>It's unclear whether such an ambitious plan could help turn around a company whose core business model <a href=\"https://arstechnica.com/gaming/2019/12/why-new-consoles-probably-wont-be-enough-to-save-gamestop/\">still faces plenty of headwinds</a>. But it would be a shame if GameStop didn't end up as one of the winners in an incredible stock bubble that has <a href=\"https://arstechnica.com/tech-policy/2021/01/the-gamestop-bubble-is-going-to-hurt-a-lot-of-ordinary-investors/\">already generated a lot of unexpected winners and losers</a>.</p></div></div>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"207d1db18f9c80470a02c12632970e5fa3d2355e809081153d08e3b5d4aa6bdd","category":"Tech"}