{"title":"Panasonic to reduce Tesla reliance as battery tie-up evolves","link":"https://arstechnica.com/?p=1749601","date":1615814528000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Batteries for all —</h4><h2 itemprop=\"description\">Outgoing CEO steers company away from ‘one-legged’ dependence on US carmaker.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/panasonic-batteries-800x548.jpg\" alt=\"Panasonic Corp. lithium-ion batteries manufactured for Tesla Motors Inc. Model S electric vehicles are displayed at Panasonic Center Tokyo in Tokyo, Japan, on Tuesday, Nov. 19, 2013.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/panasonic-batteries.jpg\" data-height=\"702\" data-width=\"1024\">Enlarge</a> <span>/</span> Panasonic Corp. lithium-ion batteries manufactured for Tesla Motors Inc. Model S electric vehicles are displayed at Panasonic Center Tokyo in Tokyo, Japan, on Tuesday, Nov. 19, 2013.</p><p>Bloomberg | Getty Images</p></figcaption></figure><p>Panasonic plans to reduce its heavy reliance on Tesla by making batteries that are more compatible with electric vehicles from other global carmakers, according to the Japanese conglomerate’s outgoing chief executive.</p><p>The comments by Kazuhiro Tsuga come as Tesla begins developing its own batteries and expands its purchasing partners to South Korea’s LG Chem and China’s CATL to support growing sales of its electric vehicles.</p><p>“At some point, we need to graduate from our one-legged approach of relying solely on Tesla,” Tsuga, who will step down after nine years as CEO to become chairman from April 1, said in an interview with the Financial Times. “We are entering a different phase and we need to keep an eye on supplying manufacturers other than Tesla.”</p><p>Panasonic made its first investment in Tesla in 2010, but it was under Tsuga that Panasonic decided to shift its focus to the automotive business after he pulled the plug on its plasma display panels and other loss-making consumer lines to invest in Tesla’s $5 billion&nbsp;gigafactory in Nevada.</p><p>Having spent more than $2 billion on their joint battery manufacturing venture since the two companies signed a deal in 2014, those efforts are finally paying off as Panasonic expects to turn its first annual profit from Tesla’s battery business when the fiscal year ends in March.</p><p>In some ways, the fact Panasonic is no longer a sole supplier to Tesla is testimony to how far Elon Musk has expanded his business from a cash-strapped, loss-making company to the world’s most valuable carmaker worth $665 billion—more than 22 times bigger than Panasonic’s own market value.</p><p>Panasonic is now working on new battery cells based on a bigger format as Musk has revealed ambitions to halve the cost of Tesla’s batteries in a few years' time.</p><p>But Tsuga said the company will also need to make batteries that are not solely for use in Tesla’s vehicles.</p><p>Panasonic has an existing battery tie-up with Toyota, and it has previously supplied batteries to European carmakers including Volkswagen. But the cylindrical lithium-ion type it makes for Tesla requires sophisticated skills in temperature management to prevent batteries from catching fire and to make them last longer.</p><p>“We need to make batteries that are easy to use for other carmakers,” Tsuga said. “Currently it is difficult to sell unless there is a company that is able to handle our cylindrical batteries with Tesla specifications.”</p><p>For Tsuga, the tie-up with Elon Musk was also part of his efforts to change the Japanese conglomerate’s inward-looking corporate culture, along with high-profile executive hires from Microsoft and Google.</p><p>After accumulating losses of nearly $15 billion in the two years to March 2013, Tsuga spent most of his nine years as CEO plugging those losses and shifting the company to higher-margin businesses.</p><p>The company’s balance sheet has since recovered, and the group is now in talks for a multibillion-dollar deal to buy US supply-chain software provider Blue Yonder, according to two people with knowledge of the discussions.</p><p>“But when I tried to shift to high-growth areas such as automotive, I realized that the various other businesses were not able to build a growth strategy and losses kept popping up everywhere,” Tsuga said.</p><p>To break that downward spiral, he announced plans to shift the group to a holding company structure under new chief executive and current head of automotive business Yuki Kusumi.</p><p>The move, he says, will allow fast decision-making while instilling more discipline to ensure financial targets for each division are met. He suggested those that fail will probably be put up for sale.</p><p>“Because Panasonic is such a big company, people felt they could survive by shifting to another division even if there was no future in where they were currently based. We have to make sure there is no such escape route,” he said.</p></div></div>","author":"Financial Times","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"20da6add0880d4711fac177fd5059b0812c2e6d37ba2fd8d10b11e459ba09f78","category":"Tech"}