{"title":"Pogačar and Žigart: The power couple of Slovenian cycling","link":"https://cyclingtips.com/2021/06/pogacar-and-zigart-the-power-couple-of-slovenian-cycling/","date":1623637499000,"content":"<div><div><p>On May 9, Urška Žigart of Team BikeExchange won her first pro race. Watching on a small iPhone screen and via Twitter was her boyfriend, Tour de France champion Tadej Pogačar. “I think I texted her at least eight times after the finish line,” he says with a smile. “I maybe even added the word ‘finally’.” He had and has the utmost confidence in her. She is looking for and gradually finding more confidence. Together they are two of Slovenian’s best cyclists.</p><p>Pogačar and Žigart are on a training camp together in the rainy Italian resort of Sestrières when we catch up via Zoom. He is working towards defending his Tour de France title; she has smaller races to focus on. </p><p>“I only started racing when I was 18,” explains Žigart, now 24. “In bike years I am much younger than Tadej is. He started when he was nine years old. In my town there was no club for girls. I did some athletics and I liked riding my bike but my mum said I should try bike racing.</p><p>“I joined a training ride with the only Slovenian women’s team, BTC City Ljubljana. I had no peloton experience at all but the sports director saw potential. I was lucky that Slovenia is so small and I got this opportunity. Then the hard work started.</p><p>“Unfortunately there aren’t many opportunities for Slovenian junior women. They have to ride with the boys. If they get to race it’s in [neighboring] Italy and it’s not ideal.” </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/CORVOS_00032523-149-1340x893.jpg\"><figcaption>Žigart and Pogačar in Paris after Pogačar won the 2020 Tour de France.</figcaption></figure><p>Žigart and Pogačar met four years ago during a training camp when they were both part of the cycling club based in Slovenia’s capital, Ljubljana. For a country of just over 2 million inhabitants, Slovenia has two of the best riders in the world: Tour de France winner Pogačar and Vuelta a España winner Primož Roglič. Together they have brought Slovenia to third place on the men’s UCI nations ranking. </p><p>In the women’s ranking Slovenia is only 15th. The riders getting most points are all well over 30 years old, apart from Žigart who is only 24. She gained her points with a 10th place in the Tour de l’Ardèche 2020, in the Gran Premio Eibar this year, and with that first win: the fourth stage of the Vuelta Comunitat Valencia Feminas in early May. These are all mountainous races, something the women’s peloton doesn’t have enough, in Žigart’s opinion.</p><blockquote></blockquote><p>“I am a climber,” she says. “The more mountains, the better. That fourth stage in Valencia was the final stage and the hilliest one of the week in Spain. Before the race we discussed to make it aggressive and we did just that in the previous stages. On the final day I attacked on the Puerto de Tudons [the highest climb of the day]. I got caught but at 65 kilometres I tried again and bridged to race leader Nadine Gill. I felt it was a chance when we had four minutes. In the final the time gap went down fast but I never looked back. I can’t describe the feeling of winning.”</p><p>Pogačar remembers the moment fondly.</p><p>“I was filming with our sponsor Met Helmets,” he says. “I checked Twitter and the livestream. I knew she was in the breakaway. I was so nervous. When she won my heartrate went sky high. I was celebrating her win so much.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/CORVOS_00032538-314-1340x893.jpg\"><figcaption>Žigart at the 2020 world championships.</figcaption></figure><p>Where Pogačar is known for being extremely cool under pressure, Žigart admits she is more of the nervous type. “I didn’t have that peloton experience because I started cycling late,” she says. “I am not an aggressive person by nature and finding my way in a peloton is something that makes me nervous and something I really have to work on.</p><p>“People often ask me what I learn from Tadej,” she continues. “He is so calm and composed. He is also very confident in the racing. He never doubts himself and always tells me to have confidence in myself. That I am strong enough.</p><p>“You know, we all train, but on the mental side of things you can make the difference. A lot comes down to the mind.” </p><p>“Tadej is a born winner,” Žigart concludes. “He has the mentality to win where he starts. My confidence has grown after my first win but I don’t have that mentality just yet. There is still a lot to work on.” </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Sara-Cavallini-1340x892.jpeg\"><figcaption>Image: Sara Cavallini</figcaption></figure><p>Žigart’s confidence grows with every race and that first win in Valencia gave her a huge boost. Her career path is that of most women joining the elite peloton from the junior ranks. It’s a struggle to make that step up. </p><p>“I didn’t get to race much [in the beginning] because I was mostly in survival mode,” she recalls. “I was trying to find my way back to the finish in [Czech stage race] Gracia Orlova [after being dropped]. In that respect Tadej is so far ahead of me because he started so young.” </p><p>From dropping out and finding her way back to the team bus, Žigart started finishing races, attacking in races, and now winning in races. Pogačar’s career path, meanwhile, resembles that of a rocket launch. From a hesitant fifth place in the Tour of Slovenia when he was just 18 he went on to win the Tour de l’Avenir a month before his 20th birthday. He came third in the Vuelta a España when he was just 21 (winning three stages along the way) and won the Tour de France a day before his 22nd birthday. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/CORVOS_00032523-155-1340x864.jpeg\"><figcaption>Pogačar is the first Slovenian to win the Tour de France.</figcaption></figure><p>“I must say that the only thing that changed is that many people now ask me about Tadej,” Žigart says. “He gets many media requests but apart from that, nothing really changed. He is still Tadej. Some people recognize him on the streets in Slovenia but not many,” Žigart adds with a proud smile as she looks at her partner.</p><p>“Slovenia is about football and winter sports: alpine skiing and ski jumping,” Pogačar explains. Unlike his compatriot Roglič, Pogačar was never crazy enough to go down a ski jumping ramp though.</p><p>So what has Tadej learned from Urška?</p><p>“Urška teaches me a lot about food and nutrition,” he explains. “She knows a lot more about the science. In the beginning I was nervous for interviews,” he continues. “Urška helps me gain confidence in my media appearances.” </p><p>There’s a great contrast between the two partners. Žigart is an extrovert in her way of talking. She is energetic and bubbly. Pogačar is much more restrained. On the bike it’s the opposite – he is much more confident than she is. They help each other overcomes their own weaknesses.</p><p>“I try to help him bring out his character more in interviews,” Žigart says lovingly. “He is a bit guarded [with all the media attention]. With me he is a very funny and outgoing guy and I would like others to get to know him that way too.”</p><blockquote></blockquote><p>Pogačar watches a lot of women’s cycling and sees the difference compared to the men’s side. “There is more and more coverage which is so important for the professionalization of the sport,” he says. “If I get to watch I see an attractive and aggressive race where they attack until they crack. It makes it really fun to watch but I really don’t know if it’s fun to race,” he adds with a laugh. </p><p>“The sport is growing fast which is really good. More sponsors are now coming in which means women get to earn more money too. It’s all going in the right direction.”</p><blockquote></blockquote><p>Žigart herself is part of that professionalization. She signed with BikeExchange this season, one of the nine Women’s WorldTour teams and one of two that matches its women’s minimum salaries with that of its men’s team.</p><p>“BikeExchange is such a professional setup,” she says. “Being a bike rider is my job now and that changes things. I also study law at university but it’s on pause now [so] I can focus on cycling. The development of the sport is going well. I look forward to a women’s Tour de France and more mountainous racing. I like racing with really hard conditions. Of course, I would also like to win more but I don’t want to become arrogant after one victory,” she says with a smile. </p><p>“One day I hope to contest the win in races like Liège-Bastogne-Liège and Strade Bianche but we have strong women on the team and I need to be realistic as well. You lose more than you win. My next race is in Belgium. It’s not my terrain but it’s all about learning to race on the narrow roads too and fight for my position in the peloton.” </p><blockquote></blockquote><p>She watches Pogačar race often as well. She is not afraid of seeing him race steep climbs and fast descents. “I know he is very good at those but I always hate it when he mingles in the bunch sprints,” she says. “I know he has to protect his classification but I don’t like to watch it.” </p><p>After each race they try to text each other as soon as possible. “I think I sent her at least eight messages after her win in Valencia,” Pogačar says with a smile.</p><p>“And you always try to text me as soon as possible too [after his races] but the phone is usually on the bus,” Žigart adds. “When you have a feeling you might win, you give your phone to the soigneur at the finish line even.”</p><p>“It’s just great to talk to her after a race,” Pogačar adds. “It’s different questions than the ones journalists ask me. The ones about how I was feeling. She asks the race questions too but the next question might be about what we eat that night. That’s important for me. To hear someone else and to hear something else after a race.”</p></div></div>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"21905148cd6e391cfd9d48b01cfdcf10c9da70f9b7bdb134ecb50cfb16183977","category":"Cycling"}