{"title":"Ashton Lambie breaks four-minute pursuit barrier","link":"https://cyclingtips.com/2021/08/ashton-lambie-breaks-four-minute-pursuit-barrier/","date":1629316774000,"content":"<div><p></p><h4>US Ashton Lambie competes in the men's individual pursuit final at the UCI track cycling World Championship at the velodrome in Berlin on February 28, 2020. (Photo by Foto Olimpik/NurPhoto via Getty Images)</h4><p></p><div><p>American track racer Ashton Lambie has ridden the fastest-ever four-kilometre pursuit time, clocking an unofficial time of 3:59.930 at the Aguascalientes velodrome in Mexico City on Wednesday. His official time has not yet been confirmed by officials on site. If that unofficial time stands, he is the first to break the four-minute barrier over four kilometers.</p><p>Lambie rode a 64×15 gear for the record-setting ride. Check back for a full bike gallery and breakdown of the tech he used on the day.</p><p>Lambie announced the attempt earlier this month and pulled together a suite of aerodynamic experts and industry partners to help him find every split second. His previous best time of 4:03.640 was set at the Berlin track, not the high-altitude boards of Mexico city. The Aguascalientes track sits at 1,800 m, or 5,900 feet, and is known to be the fastest track in the world.</p><p>Lambie pointed to the four-minute running mile barrier broken by Roger Bannister in 1954 as inspiration for the effort.</p><p>Lambie popped up out of gravel racing in 2018 when he <a href=\"https://cyclingtips.com/2018/09/the-length-of-suffering-a-gravel-riders-unlikely-pursuit-record/\">set a new world pursuit record</a>, knocking off Jack Bobridge with a time of 4:09. That record has since tumbled as Lambie and Italian Filippo Ganna dropped it lower and lower. Prior to Lambie’s effort Wednesday, Ganna held the record with a time of 4:01.934.</p><p><em>This story is developing, check back for more.</em></p></div></div>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"21e2baa1fd206ac65bab348713580bfd7cee0f3619d83a989390c562ecc45022","category":"Cycling"}