{"title":"Here are five questions we would ask the nominee for NASA administrator","link":"https://arstechnica.com/?p=1750617","date":1616164761000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Why do you want this job? —</h4><h2 itemprop=\"description\">\"If we can't do a rocket for $11.5 billion, we ought to close up shop.\"</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/11/GettyImages-124937333-800x533.jpg\" alt=\"The Space Launch System was created as part of a political compromise between US Sen. Bill Nelson (D-Fla.) and senators from Alabama and Texas. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/11/GettyImages-124937333.jpg\" data-height=\"3498\" data-width=\"5247\">Enlarge</a> <span>/</span> The Space Launch System was created as part of a political compromise between US Sen. Bill Nelson (D-Fla.) and senators from Alabama and Texas.</p><p>Chip Somodevilla/Getty Images</p></figcaption></figure><p>This morning, the White House nominated former US Sen. Bill Nelson to become the next administrator of NASA.</p><p>Nelson, who is 78 years old, lost his 2018 bid for reelection to the Senate. He had served six terms as a member of the House of Representatives and three terms in the upper house. He has a close relationship with President Biden and effectively lobbied to gain the appointment. Nelson must still be confirmed by a majority of the US Senate, but this seems likely to happen given early support <a href=\"https://twitter.com/marcorubio/status/1372660331219148803\">from some Republicans</a> already.</p><p>\"Most every piece of space and science law has had his imprint, including passing the landmark NASA bill of 2010 along with&nbsp;Senator Kay Bailey Hutchinson,\" <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/19/president-biden-announces-his-intent-to-nominate-bill-nelson-for-the-national-aeronautics-and-space-administration/\">the nomination states</a>.</p><p>The former senator, who did indeed delve deeply into space policy, would bring plenty of experience and familiarity to the role of NASA administrator. In addition to representing Kennedy Space Center in Congress for decades, he flew as a payload specialist on space shuttle&nbsp;<em>Columbia</em>&nbsp;in January 1986. However, Nelson is <a href=\"https://arstechnica.com/science/2021/02/a-politician-who-said-politicians-shouldnt-run-nasa-wants-to-run-nasa/\">far from beloved in the space community</a>, both for the way he became an astronaut and for some of his space policy decisions.</p><p>Only senators get to ask questions of nominees at hearings, but if Ars had a seat at the table, here are the top five questions we'd be most interested in hearing Nelson respond to.</p><h2>1. If commercial space can do a better job, should NASA buy in?</h2><p>Nelson was initially antagonistic toward commercial spaceflight—particularly efforts to rely on private companies to deliver astronauts to the US space station. For example, during a Senate hearing in 2010, he suggested that the Senate might simply take President Obama's $6 billion request for commercial crew funding and put that money into the Space Launch System rocket.</p><p>“What would happen if Congress decided—since the Congress controls the purse strings—that we wanted to take the $6 billion projected by the president over the next five years and use that not for human certification of the commercial vehicles but instead to accelerate the ... heavy-lift vehicle for the Mars program?” <a href=\"https://spacenews.com/sen-nelson-floats-alternate-use-nasa-commercial-crew-money/\">Nelson asked</a>&nbsp;during one hearing.</p><p>Nelson made similar comments over the course of several years. He ultimately started making more positive comments about commercial crew after Boeing established in 2014 that its facility to process the Starliner crew vehicle would be at Kennedy Space Center in Florida. Later, he also began to appreciate that SpaceX would launch dozens of times a year from Florida. This makes clear that Nelson's motivations lie in protecting jobs in Florida—a parochial, if understandable, motivation for a senator from the state.</p><p>But a NASA administrator must represent all of NASA, not just stand up for a few states. Today, it's fairly well-established that NASA should buy commercial services from private companies in low Earth orbit. The debate now is whether this public-private partnership model should be extended into deep space for exploration. Doing so would likely save money and accelerate exploration, but it also threatens parochial political interests in Alabama, Florida, and elsewhere. Would Nelson be willing to stand against former friends in the Senate and aerospace industry to accomplish this?</p><h2>2. Do you still believe politicians should <em>not</em> run NASA?</h2><p>In 2017, Nelson led the opposition to Jim Bridenstine becoming administrator of NASA. Then serving as the ranking member on the Senate’s Committee on Commerce, Science, &amp; Transportation, which oversees NASA, Nelson said Bridenstine was too partisan and political to lead NASA. He also accused Bridenstine of not having the expertise to do so. “The head of NASA ought to be a space professional, not a politician,”&nbsp;<a href=\"https://www.politico.com/story/2017/09/01/marco-rubio-bill-nelson-trump-nasa-jim-bridenstine-242269\">Nelson said</a>&nbsp;of Bridenstine, then a two-term congressman from Oklahoma.</p><p>Now Nelson, a former politician like Bridenstine, will find himself in the witness chair. Why should the rules he used to oppose Bridenstine four years ago not apply to him now?</p><h2>3. How can NASA grow the nation’s global climate leadership?</h2><p>During the Bridenstine confirmation process in 2017, <a href=\"https://www.washingtonpost.com/news/the-switch/wp/2017/11/01/trumps-nominee-for-nasa-administrator-comes-under-fire-at-senate-hearing/\">Nelson also accused</a> Bridenstine of being a climate-change denier. In response, Bridenstine replied that his views on the subject had evolved, and true to his word, he generally supported NASA's efforts to study Earth science during his tenure.</p><p>One concern scientists have expressed about Nelson is that his support for Earth science was lukewarm during his tenure in the Senate. Yes, he absolutely believed in climate change and recognized the threat. However, he was far more interested in finding funding within the NASA budget for the Space Launch System rocket, and particularly hundreds of millions of dollars a year for work on ground systems at Kennedy Space Center.</p><p>The Biden administration has identified climate change as a top threat the United States must confront. How would Nelson attack that subject? And how would he work with the president's science advisers to do so?</p><h2>4. Should NASA close up shop?</h2><p>Alongside Texas Senator Kay Bailey Hutchison, in 2010 and 2011, Nelson was a key architect of the SLS rocket. NASA and the White House were wary of tackling this project, as it was well understood that building the rocket through traditional, cost-plus contracting methods would be time-consuming and expensive. The Obama administration wanted to see if private companies, such as United Launch Alliance and SpaceX, could do a better job.</p><p>Nelson relentlessly fought against this and promised that the SLS rocket program would deliver.&nbsp;“This rocket is coming in at the cost of what not only what we estimated in the NASA Authorization act, but less,” <a href=\"https://spacenews.com/nasa-commits-building-mandated-heavy-lift-rocket/\">Nelson said</a> at the time. “The cost of the rocket over a five- to six-year period in the NASA authorization bill was to be no more than $11.5 billion. This costs $10 billion for the rocket.”</p><p>Later, he went further, <a href=\"https://forum.nasaspaceflight.com/index.php?PHPSESSID=a6e13jj87k7g0vrjd2vh5j3vdr;topic=22270.1300\">saying</a>,&nbsp;\"If we can't do a rocket for $11.5 billion, we ought to close up shop.\"</p><p>More than a decade later, and having spent more than $20 billion, NASA is still probably about a year away from launching the SLS rocket for the first time. Despite notching a <a href=\"https://arstechnica.com/science/2021/03/nasa-gets-a-much-needed-win-as-sls-rocket-completes-test-firing/\">successful test firing on Thursday</a>, the program has been panned by critics as a \"jobs program\" that is hampering NASA rather than advancing its interests.</p><p>So should NASA close up shop? Or more realistically, should NASA accede to what the Obama administration wanted to do a decade ago and acknowledge that the private sector does a much better job of building rockets than government institutions?</p><h2>5. Why do you want this job?</h2><p>It's not clear what Nelson's vision for NASA is, and this is important, because serving as administrator is a difficult and demanding job. Frankly, there is widespread skepticism in the space community about Nelson's motivations. His flight on space shuttle <em>Columbia</em> in 1986 was widely seen as an opportunistic move to advance his political career. Some of his fellow astronauts nicknamed him \"Ballast\" for the role they perceived he played during the mission.</p><p>Bridenstine's nomination, of course, was also met with widespread skepticism in 2017, and he generally overcame those concerns&nbsp;<a href=\"https://arstechnica.com/science/2020/11/jim-bridenstine-is-leaving-nasa-how-should-we-assess-his-30-month-tenure/\">to get high marks</a> from space historians. It's possible that Nelson could rise to the occasion as well, and certainly the space community will be rooting for him to lead NASA forward. But how would he do that?</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/KSC-20190713-PH_JBS01_0148_large.jpg\" data-height=\"1280\" data-width=\"1920\" alt=\"One-time shuttle astronaut and former US Senator Bill Nelson rides in a classic Corvette&nbsp;during the &quot;Man on the Moon&quot; astronaut parade in Cocoa Beach, Florida on July 13, 2019. \"><img alt=\"One-time shuttle astronaut and former US Senator Bill Nelson rides in a classic Corvette&nbsp;during the &quot;Man on the Moon&quot; astronaut parade in Cocoa Beach, Florida on July 13, 2019. \" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/KSC-20190713-PH_JBS01_0148_large-980x653.jpg\" width=\"980\" height=\"653\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/KSC-20190713-PH_JBS01_0148_large.jpg\" data-height=\"1280\" data-width=\"1920\">Enlarge</a> <span>/</span> One-time shuttle astronaut and former US Senator Bill Nelson rides in a classic Corvette&nbsp;during the \"Man on the Moon\" astronaut parade in Cocoa Beach, Florida on July 13, 2019.</p></figcaption></figure><p>Back in 2017, some of us who track space policy closely understood that Bridenstine brought a lot to the table. During his two-plus terms in the House of Representatives, Bridenstine had shown a keen interest in space policy, and not for parochial interests. He was genuinely interested in seeing the US spaceflight enterprise—across civil, commercial, and national defense domains—advance into the future. He spoke of lunar resources as&nbsp;<a href=\"https://spacepolicyonline.com/news/bridenstine-this-is-our-sputnik-moment-the-moon-will-ensure-u-s-preeminence-in-space/\">America's Sputnik moment in space</a> and authored the ambitious <a href=\"https://spacepolicyonline.com/news/bridenstine-releases-american-space-renaissance-act-welcomes-comment/\">American Space Renaissance Act</a>. He wanted the NASA job to begin making those reforms, and that's what he tried to do.</p><p>Now, it's not clear why Nelson wants this job. What are his passions? How will the 78-year-old push NASA into a new era when the space industry is rapidly changing, with the emergence of myriad commercial companies and the rise of Chinese competition in civil space? Hopefully he can articulate this and explain how he will help get NASA astronauts to the Moon this decade, to stay, and in a sustainable way.</p></div></div></div>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"226a90afcb6fa2a6f3d4749347ac257f774c929d79bb0d7fd0469dcc11970d2a","category":"Tech"}