{"title":"SpaceX plans Starlink broadband for cars, boats, and planes","link":"https://arstechnica.com/?p=1748012","date":1615240037000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Starlink for moving vehicles —</h4><h2 itemprop=\"description\">Dishes will be modified for vehicles, vessels, and aircraft, SpaceX tells FCC.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/getty-off-road-car-800x534.jpg\" alt=\"Off-road vehicle driving up a road on a hill on a foggy morning.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/getty-off-road-car.jpg\" data-height=\"1415\" data-width=\"2119\">Enlarge</a> <span>/</span> Cars could eventually get satellite Internet from SpaceX Starlink.</p></figcaption></figure><p>SpaceX on Friday <a href=\"https://fcc.report/IBFS/SES-LIC-INTR2021-00934\">asked</a> the Federal Communications Commission for permission to deploy Starlink satellite broadband to passenger cars and other moving vehicles.</p><p>The <a href=\"https://fcc.report/IBFS/SES-LIC-INTR2021-00934/3877177.pdf\">application</a> describes SpaceX's plans for Earth Stations in Motion (ESIMs) for automobiles, ships, and aircraft. SpaceX said it is \"seek[ing] authority to deploy and operate these earth stations... throughout the United States and its territories... in the territorial waters of the United States and throughout international waters worldwide, and... on US-registered aircraft operating worldwide and non-US-registered aircraft operating in US airspace.\"</p><p>\"Granting this application would serve the public interest by authorizing a new class of ground-based components for SpaceX's satellite system that will expand the range of broadband capabilities available to moving vehicles throughout the United States and to moving vessels and aircraft worldwide,\" SpaceX told the FCC.&nbsp;Internet users are no longer \"willing to forego connectivity while on the move, whether driving a truck across the country, moving a freighter from Europe to a US port, or while on a domestic or international flight,\" SpaceX said.</p><h2>“Electrically identical” to Starlink home terminals</h2><p>The application said that vehicle-mounted terminals will be similar to the <a href=\"https://arstechnica.com/information-technology/2020/12/teardown-of-dishy-mcflatface-the-spacex-starlink-user-terminal/\">Starlink satellite dishes</a> designed for home-Internet service, with some key differences:</p><blockquote><p>SpaceX Service's ESIMs are electrically identical to its previously authorized consumer user terminals but have mountings that allow them to be installed on vehicles, vessels, and aircraft, which are suitable for those environments. SpaceX Service's ESIMs will communicate only with those SpaceX satellites that are visible on the horizon above a minimum elevation angle of 25 degrees. The proposed phased array user terminal will track SpaceX's NGSO [non-geostationary orbit] satellites passing within its field of view. As the terminal steers the transmitting beam, it automatically changes the power to maintain a constant level at the receiving antenna of its target satellite, compensating for variations in antenna gain and path loss associated with the steering angle.</p></blockquote><p>The ESIM terminals could be deployed \"on passenger cars or pleasure boats,\" SpaceX said in a <a href=\"https://fcc.report/IBFS/SES-LIC-INTR2021-00934/3877179.pdf\">radiation hazard analysis</a> submitted with its application. ESIM terminals may also be deployed on \"the masts of ships or the tops of semitrucks that are not generally accessible to the public.\" The devices \"are compliant and will not result in exposure levels exceeding the applicable radiation hazard limits,\" SpaceX said.</p><p>SpaceX's application noted that it already has FCC permission to deploy up to 1 million user terminals in the US. The requested license allowing terminals on moving vehicles apparently would not increase the total number of terminals. But SpaceX has separately asked the FCC for permission to increase its allowed number of terminals from 1 million to <a href=\"https://arstechnica.com/information-technology/2020/08/spacex-now-plans-for-5-million-starlink-customers-in-us-up-from-1-million/\">5 million</a>.</p><p>While Starlink home-Internet service can be <a href=\"https://arstechnica.com/information-technology/2020/11/spacex-starlink-beta-tester-takes-user-terminal-into-forest-gets-120mbps/\">set up by users themselves</a>, that may not be the case with Starlink for moving vehicles. SpaceX said that it \"will ensure installation of ESIM terminals on vehicles and vessels by qualified installers who have an understanding of the antenna's radiation environment and the measures best suited to maximize protection of the general public and persons operating the vehicle and equipment.\"</p><p>The ESIMs will transmit in the 14.0-14.5 GHz band and receive in the 10.7-12.7 GHz band, and they will comply with spectrum-sharing rules to avoid interference with other spectrum users, SpaceX said. SpaceX is already <a href=\"https://arstechnica.com/tech-policy/2021/03/spacex-slams-dishs-baseless-attempt-to-block-starlinks-fcc-funding/\">battling Dish Network</a> over Dish's claim that Starlink could interfere with satellite TV and 5G mobile services that may eventually be permitted in the 12 GHz range.</p><h2>Starlink for Tesla (and other) cars</h2><p>Starlink terminals for moving vehicles could theoretically be installed on any brand of car. But Elon Musk, the CEO of both SpaceX and Tesla, would have a special interest in bring Starlink to Tesla vehicles.</p><p>\"Tesla's electric cars are connected to the Internet for features like video streaming and over-the-air updates, with the company even offering a 'Premium Connectivity' service as an option today,\" a <a href=\"https://www.teslarati.com/starlink-moving-vehicles-tesla-fcc-application/\">Teslarati article</a> about SpaceX's application said. \"With Starlink's capability to connect to the Internet in a moving vehicle, Tesla would no longer have to rely on existing mobile Internet providers for its cars.\"</p><p>Musk <a href=\"https://twitter.com/elonmusk/status/1316255322835759105\">tweeted in October 2020</a> that Starlink could be deployed on fast-moving vehicles. \"Everything is slow to a phased array antenna,\" he wrote at the time.</p></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2296f73807bc8cbfd7ac77849071a49b8edcd0cbc009c71f945fde9e49df8d2c","category":"Tech"}