{"title":"Tim Cook Shares Details on Acquisitions, Future of Mac and More at Shareholders Meeting","link":"https://www.macrumors.com/2021/02/23/apple-2021-shareholders-meeting-recap/","date":1614105844000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/02/23/apple-2021-shareholders-meeting-recap/\"><p>Apple's <a href=\"https://www.macrumors.com/2021/01/05/apple-shareholders-meeting-2021/\">annual shareholders meeting</a> took place this morning in a virtual format, allowing shareholders to vote on proposals and submit questions to Apple executives. Apple does not typically reveal product info in shareholder meetings, and 2021 was no exception. Much of what was said was a <a href=\"https://www.macrumors.com/2021/01/27/apple-1q-2021-earnings/\">recap of the Q1 earnings results</a> and a reiteration of Apple's policies on privacy, the environment, and other core values.</p><p><img alt=\"apple park drone june 2018 2\" width=\"1200\" height=\"675\" src=\"https://images.macrumors.com/t/1qEAdNuXNLDCdYqxSfikMM4sxHU=/400x0/filters:quality(90)/article-new/2018/06/apple-park-drone-june-2018-2.jpg?lossy\" data-src=\"https://images.macrumors.com/t/1qEAdNuXNLDCdYqxSfikMM4sxHU=/400x0/filters:quality(90)/article-new/2018/06/apple-park-drone-june-2018-2.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/1qEAdNuXNLDCdYqxSfikMM4sxHU=/400x0/filters:quality(90)/article-new/2018/06/apple-park-drone-june-2018-2.jpg?lossy 400w,https://images.macrumors.com/t/31jfHWCVrWp7Mxoxh3M1SXyDOoc=/800x0/filters:quality(90)/article-new/2018/06/apple-park-drone-june-2018-2.jpg?lossy 800w,https://images.macrumors.com/t/kxZDBBkW1Dj8LeSWuYo_SdnykDA=/1600x0/filters:quality(90)/article-new/2018/06/apple-park-drone-june-2018-2.jpg 1600w,https://images.macrumors.com/t/ua3VbOWwn7ZyPBdivvnpcGPg5iM=/2500x0/filters:no_upscale():quality(90)/article-new/2018/06/apple-park-drone-june-2018-2.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/1qEAdNuXNLDCdYqxSfikMM4sxHU=/400x0/filters:quality(90)/article-new/2018/06/apple-park-drone-june-2018-2.jpg?lossy 400w,https://images.macrumors.com/t/31jfHWCVrWp7Mxoxh3M1SXyDOoc=/800x0/filters:quality(90)/article-new/2018/06/apple-park-drone-june-2018-2.jpg?lossy 800w,https://images.macrumors.com/t/kxZDBBkW1Dj8LeSWuYo_SdnykDA=/1600x0/filters:quality(90)/article-new/2018/06/apple-park-drone-june-2018-2.jpg 1600w,https://images.macrumors.com/t/ua3VbOWwn7ZyPBdivvnpcGPg5iM=/2500x0/filters:no_upscale():quality(90)/article-new/2018/06/apple-park-drone-june-2018-2.jpg 2500w\"><br>Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> told shareholders that 2020 was a period of prolific innovation. \"Apple makes the best, most useful, most innovative, most trusted products out there, and this year, we took that mission to another level,\" said Cook.</p><p>Cook declined to provide specific details on any upcoming products, but said there are \"exciting things ahead for the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>\" and \"great things ahead for computing.\" Apple is working on new <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> models that will follow the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> lineup, plus there are rumors of revamped and redesigned iMacs and MacBook Pro models that will feature even more powerful Apple silicon chips.</p><p>The <a href=\"https://www.macrumors.com/roundup/airpods-max/\">AirPods Max</a> are \"hugely popular with reviewers and users alike,\" and the <a href=\"https://www.macrumors.com/roundup/homepod-mini/\">HomePod mini</a> was described as \"another hit\" during the holiday season.</p><p>Cook said that Apple has acquired close to 100 companies over the course of the last six years. \"We're not afraid to look at acquisitions of any size,\" said Cook. \"Focus is on small, innovative companies that complement our products and help push them forward.\"</p><p>On the topic of the environment, Cook said that Apple is on track to meet its \"most ambitious goal yet,\" which is to be carbon neutral across its entire supply chain by 2030. Meeting this goal is a companywide effort and that Apple's innovations and breakthroughs are setting it apart. \"We firmly believe that all companies -- if they hope to be competitive in the future -- have to begin with leadership in this area,\" said Cook. Apple is also aiming to make all of its products without extracting anything from the earth in the future, and the \"moonshot nature\" of this goal has \"created enormous energy internally\" to make big changes. Apple in 2020 eliminated power adapters and headphones from ‌iPhone‌ packaging, which the company said was done to further environmental goals and reduce waste.</p><p>\"I've always believed that the time to speak out is the time when you've got something to say,\" said Cook on a question asking why Apple was speaking out on privacy at this time. Cook said that he hopes Apple's efforts to improve privacy both in the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> and in apps with App Privacy labels and App Transparency requirements will be a \"ripple in the pond\" moving the whole industry forward. Apple continues to support a comprehensive federal privacy law in the United States and worldwide laws and international agreements to protect the \"fundamental rights of privacy everywhere.\"</p><p>On navigating the challenges of the pandemic, Cook said that Apple is still learning new things, but the \"remarkable run of innovation and creativity\" is a testament to employee resilience during a trying time. Apple employees adapted and collaborated better, but Cook said there is \"no substitute for meeting face to face\" and that most Apple employees \"can't wait\" to gather in the office again.</p><p>Cook also spoke on diversity and inclusion, pay equity at Apple, <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a>, ‌App Store‌ regulation, Apple's education goals, and, interestingly, Apple's identity.</p><blockquote><p>In so many ways, the world has changed, but in fundamental ways, Apple has not. Apple is made up of people who want to spend their lives making things that enrich the lives of others, making them more fulfilled, more creative, and more human. We're comfortable saying no to a lot of things and laser focused on the areas where we can have the greatest impact, innovating relentlessly. Technology made by people, for people, and with people's well being in mind. At its best and most hopeful, technology should help us leave the world better than we found it.</p></blockquote><p>Looking forward to the future, Cook said that he doesn't see challenges in 2021, but opportunities that will need to be managed \"creatively, intelligently, and diligently.\" Cook said that across the current ‌iPhone‌, Mac, and Apple Watch product lineups, there's never been a set of products with a \"greater degree of future potential.\"</p><p>Cook said that there's never been a more challenging environment that Apple has operated in than this year's pandemic, but he is optimistic about the future and Apple is always thinking about how to help communities emerge stronger, fair and equitable recovery, and \"how all of that can be helped by world class technology that puts humanity at its heart.\"</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/21/whatsapp-fate-of-accounts-privacy-policy/\">WhatsApp Reveals What Happens to Users Who Don't Agree to Upcoming Privacy Policy Changes</a></h3><p>Sunday February 21, 2021 1:11 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>WhatsApp has revealed how it will gradually limit the features available to accounts held by users who do not accept the platform's impending privacy policy changes, due to come into effect on May 15. WhatsApp's new banner explaining the privacy policy changes According to an email seen by TechCrunch to one of its merchant partners, WhatsApp said it will \"slowly ask\" users who have not yet...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/21/next-gen-airpods-image-leak/\">Alleged Leaked Image Claims to Show Third-Generation AirPods and Case</a></h3><p>Sunday February 21, 2021 2:49 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>A new image claims \u0010to offer our first real world look at Apple's next-generation AirPods. The image, shared by 52audio, showcases both AirPods and the charging case for what the site claims to be the third iteration of the wireless earbuds. 52audio has in the past shared images claiming to showcase different parts of the third-generation AirPods. Most notably, the site in November shared...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/20/apple-magsafe-wallet-long-term-review/\">Revisiting Apple's MagSafe Leather Wallet After 3 Months of Usage</a></h3><p>Saturday February 20, 2021 8:04 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Back in November when Apple's MagSafe-compatible Leather Wallet first launched, MacRumors videographer Dan took a look at the accessory and ended up disliking it because of the weak magnetic connection. Dan kept using the Leather Wallet despite its flaws, and after three months with the accessory, his opinion has changed and he wanted to share some new thoughts on it. Subscribe to the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/20/top-stories-ios-14-5-beta-2-changes/\">Top Stories: More iOS 14.5 Beta Changes, iPhone 13 Rumors, Apple Watch Charging Issue Fixed</a></h3><p>Apple is continuing to tweak things during the iOS 14.5 beta testing period, and it looks like there will be some nice changes coming in the update when it's released to the public in a month or so. This week also saw the release of a watchOS bug fix update for Series 5 and Series SE owners, addressing a serious issue where their watches may not charge after entering Power Reserve mode,...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/20/chrome-safari-ram-test/\">Chrome Used 10X More RAM Than Safari on macOS Big Sur in Recent Test [Updated]</a></h3><p>Saturday February 20, 2021 12:52 pm PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Under normal and lightweight web browsing, Google Chrome uses 10x more RAM than Safari on macOS Big Sur, according to a test conducted by Flotato creator Morten Just (via iMore). In a blog post, Just outlines that he put both browsers to the test in two scenarios on the latest version of macOS. The first test was conducted on a virtual machine, and the second on a 2019 16-inch MacBook Pro...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/19/no-apple-event-march-16/\">Gurman: No Apple Event Happening on March 16</a></h3><p>Friday February 19, 2021 5:42 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple does not have plans to hold an event on Tuesday, March 16, Bloomberg's Mark Gurman confirmed on Twitter this evening. Earlier this week, a report from Taiwanese site Economic Daily News suggested there would be a March 16 event, with the initial rumor picked up and circulated by a few other sites. Economic Daily News cited unverified and unsubstantiated content from Twitter accounts...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/22/apple-revokes-silver-sparrow-certificates/\">Apple Takes Step to Prevent Further Spread of 'Silver Sparrow' Malware on Macs</a></h3><p>Monday February 22, 2021 6:13 am PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Over the weekend, we reported on the second known piece of malware compiled to run natively on M1 Macs. Given the name \"Silver Sparrow,\" the malicious package is said to leverage the macOS Installer JavaScript API to execute suspicious commands. After observing the malware for over a week, however, security firm Red Canary did not observe any final payload, so the exact threat to users remains a...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/21/pink-squares-external-display-m1-mac-mini/\">Apple Investigating Issue With 'Pink Squares' Appearing on Displays Connected to M1 Mac Mini</a></h3><p>Sunday February 21, 2021 11:08 am PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>In an internal memo this week, obtained by MacRumors, Apple informed service providers that it is aware of and investigating an issue that may result in \"pink squares or pixels\" appearing on displays connected to an M1 Mac mini. Image via Twitter user @FatihVidyograf This issue has been reported by users across the Apple Support Communities, MacRumors Forums, and Reddit since the M1 Mac mini...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/20/m1-macs-silver-sparrow-malware/\">M1 Macs Targeted by Additional Malware, Exact Threat Remains a Mystery</a></h3><p>Saturday February 20, 2021 12:10 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>The second known piece of malware that has been compiled to run natively on M1 Macs has been discovered by security firm Red Canary. Given the name \"Silver Sparrow,\" the malicious package is said to leverage the macOS Installer JavaScript API to execute suspicious commands. After observing the malware for over a week, however, neither Red Canary nor its research partners observed a final...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"22b6b1dd7dc5cf99381661d0ae40e3c3f13d135598478c809675bc97325fc271","category":"Apple"}