{"title":"As Tibco leaps to the WorldTour, there’s cause for celebration – and reflection","link":"https://cyclingtips.com/2021/11/as-tibco-leaps-to-the-worldtour-theres-cause-for-celebration-and-reflection/","date":1635815954000,"content":"<div><div><p>Rachel Hedderman was one of the first women to direct a men’s team in a WorldTour race when she jumped behind the wheel at the 2014 edition of Milan-San Remo. For three years now she’s been a sports director of the American women’s team Tibco-Silicon Valley Bank, a team which steps up to WorldTour level in 2022. Ahead of that milestone season, I caught up with Hedderman – one of the pioneers of the sport – in a time where developments in women’s cycling move fast. </p><p>“It was the obvious decision for the team to apply for a WorldTour license,” Hedderman tells CyclingTips. “It’s the next step in our development. We started as a local bike shop team from Palo Alto, California in 2004 and we have been growing steadily ever since.”</p><p>The American team had a season where it raced a lot in Europe due to COVID-related cancellations in the USA and Canada. Being part of the UCI Women’s WorldTour next year means Tibco-SVB will ride even more European races, although in the Women’s WorldTour, participation in WorldTour races is not mandatory like it is for men’s WorldTour teams. </p><p>“We still have an important sponsor base in North America so [racing in the US is] still very important for us,” Hedderman says when asked if the team will be racing in Europe full time. “We will still be racing stateside and we will be racing a full program in Europe. We split the resources and riders. We will also focus on things like gravel racing in the US and an alternative calendar. We are already involved in that and will continue to be which is important for our sponsors.“</p><p>Tibco-SVB has road, gravel, and cyclocross specialists on the team. This mixed nature of teams has become a clear development in recent years.</p><p>“Some of our riders will be focused solely on road but some riders will do both road and the gravel scene or ride cyclocross,” Hedderman says. “I think that’s a good balance to have in a team. It’s become much more commonplace to combine disciplines. When I raced, I did some ‘cross but I was dead last but now you see riders being competitive in multiple disciplines. Riders are becoming more all-round.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/CORVOS_00033402-057-1340x959.jpg\"><figcaption>Kristen Faulkner wins the opening stage of the Tour of Norway 2021.</figcaption></figure><p>As one of the top 15 teams on the UCI ranking Tibco-SVB got invitations to many of the biggest races on the 2021 calendar like Paris-Roubaix, the Tour of Flanders, the Giro Rosa, the Women’s Tour, and Liège-Bastogne-Liège. Kristen Faulkner was the team’s most successful rider. Lauren Stephens won the American title and Veronica Ewers enjoyed a breakthrough performance with a fifth place in the Tour de l’Ardèche. </p><p>Hedderman and team manager Linda Jackson have a keen eye in spotting new talents in the USA who then go on to do well in European races.</p><p>“With COVID-19 there hasn’t been a lot of racing in the US these past two years,” Hedderman says. “Kristen just said she wanted to race her bike last summer and we invited her over to Ardèche [where she won a stage]. I learned with her specifically to never say never, to not say that the jump [to Europe] is too big.</p><p>“Veronica Ewers has a similar story. There haven’t been a lot of races in the US to flourish in so you are looking at snapshots of talent. I knew the course of this year’s Nationals [where Ewers won bronze] and then you know it’s not a fluke result. Her club team manager was a former Tibco rider and knew Linda. We asked her to say if Veronica was the real deal and to give us a realistic picture.”</p><p>It’s not an easy step from American racing to European races but Hedderman has experience guiding women to success in the European peloton. Having raced both stateside and in Europe herself she knows the biggest differences.</p><p>“For American riders it’s the roads; they are a quarter of the width to what they are in US and the pelotons are twice as big,” she explains. “In the US you can ride outside the peloton if you are good and get to the front.</p><p>“[In Europe] you have to learn the skill of riding in a big bunch. It takes some courage too, especially for riders who haven’t grown up on bikes like the Dutch. You have to learn that skill at an age where you are smart enough to know that if you are going to fall it hurts. When you are eight you fall and bounce back up and do it again. And you forget it hurts. Once you are older, there is more of a subconscious nervousness and you are more restrained.</p><p>“One of the big first challenges coming to Europe is becoming more fearless.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/CORVOS_00032119-005-1340x893.jpg\"><figcaption>Rachel Hedderman (right) before the start of the 2020 Spar Omloop van het Hageland.</figcaption></figure><p>Hedderman is one of the longest-standing sports directors in the women’s peloton; a scene that was dominated by male sports directors until a few years ago. With the current influx of new women in the driver’s seat, like Anna van der Breggen (SD Worx), Jolien d’Hoore (NXTG Racing), and Julia Soek (Drops-Le Col), there seems to be a demand for female sports directors for women’s teams. </p><p>“I already was used to being in a male-dominated environment being an engineer before I started in cycling,” Hedderman says. “That’s also changing now. Maybe if I was to go back to university there would be a higher percentage of female engineering students. My favorite subject has always been physics and that was not normal for girls,” she adds with a laugh.</p><p>“Women have a different perspective or approach but to me that’s more of a personality thing than a male-female thing,” Hedderman continues. “I would approach a race differently than Hendrik Redant at UHC but also differently than Giorgia Bronzini or Ina Teutenberg. We are female but not all the same, like all male directors are not the same personality.”</p><p>Hedderman herself will be in Europe less next season. Her son Cillian turns four and needs to go to school. The American team is looking for a new sports director but follows its own philosophy in finding the right character; not specifically a woman.</p><p>“It needs to be the right person and whether our new sports director is male or female is not important. We practice what we preach. We say women can do what men can but it’s also the other way around. Men can also direct a women’s team.”</p><p>The now 48-year-old British-born Hedderman is a modest person. She doesn’t come across as someone who wants to stand in the spotlight. She is all about the team spirit between her riders but also as a sports director. When asked what her strong suits are, she hesitates. </p><p>“I think experience and empathy are my strong suits,” she says. “Also, demanding-ness. I am making up a word here. I am about the team. I expect riders to follow the team plan and not act as individuals. As a domestique you sacrifice your own chances and that’s hard.</p><p>“I know what I ask of riders because I have been there. I helped others win medals at world championships and Olympic Games myself. I also see what domestiques bring to a team. Riders like Christine Majerus and Lauretta Hanson made a career out of being a domestique. One of the skills of a sports director is to see that, to see what was actually happening in the race and what everyone’s contribution was.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/CORVOS_00033061-211-1340x893.jpg\"></figure><p>Hedderman’s career highlight revolves around an example of teamwork and not around the team’s all-time biggest result.</p><p>“We had 1-2-3 and the last three riders on the results list in the final stage of the Tour of the Gila a few years ago,” she says. “The first three across the line came back to the finish line quite a while after they finished themselves to cheer on these other three. They were the three who set up the podium sweep. I think you are right in saying this embodies our team philosophy. It felt like I taught them well to be there for each other. There was teamwork and appreciation.</p><p>“From early on when I started directing, I wanted the whole team at the podium so they all realized they made it possible. When I’m talking to new riders, I usually ask them what their favorite race was, and I’m looking to see if they have a story on how the team did and not on how they did. It rules out certain riders and I have told those riders that it’s OK to be that rider but don’t sign for a team like ours. If I see that in the first race that you ride only for yourself, I just don’t want you in the team anymore.”</p><p>Next season Hedderman is looking for a group of 13 to 14 riders. Veronica Ewers came onboard with a two-year deal but other contract extensions and new riders have not been made public just yet.</p><p>“We have always looked for riders who are great riders and good people,” Hedderman says. “So many of our riders have stories beyond cycling. It’s maybe something that makes them better bike riders.</p><p>“I remember being on a national team trip when I was early in my career. A rider coming straight from school was complaining it was so hard. It told her it’s an amazing life when we are in Italy for a big race because I just came from that engineering job. Having done something outside of cycling gives you that perspective and gives you a sense of appreciation.”</p><p>Being part of the UHC men’s and women’s teams and now Tibco-SVB, Hedderman is seeing the development of women’s cycling from a front-row seat. In recent years more and more women have received a minimum wage. Riders now also have the possibility to go on pregnancy leave. More and more new races have been added to the calendar with Paris-Roubaix and the Tour de France Femmes the most notable new additions. There is still a lot to do but Hedderman warns against going too fast.</p><p>“I am a realist when it comes to the development of women’s cycling,” she says. “I have always been in male-dominated environments. I am a realist but I don’t want to conform to a status quo in women’s cycling. Paris-Roubaix felt like a long time coming but actually it wasn’t that long ago that ASO announced it. It was a fantastic platform to showcase the equality in terms of what kind of races women are perfectly capable of racing.</p><p>“There is no mountain too steep or cobbles too big for women to race on.</p><p>“The development is going fast. There is part of me that is optimistic and a dreamer and wants to believe this momentum continues, but I definitely think we shouldn’t go any faster. We are at the top end of how fast progress should go.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/CORVOS_00033270-038-1340x893.jpg\"><figcaption>Team Tibco-Sillicon Vally Bank in the team time trial from Fossano to Cuneo in the 2021 Giro Rosa.</figcaption></figure><p>These days there is more drive from sponsors towards equality and diversity in pro cycling. Cofidis will start a women’s team in 2022 and one of the principal reasons, besides the Tour de France Femmes, was that Cofidis wants its sponsorship to reflect the company and the people who work there. </p><p>“Our sponsors really support the push in equality in the workplace and in sports,” Hedderman says. “I also think you don’t need the UCI to mandate women’s teams for men’s WorldTour teams. The growth is organic as it is. You don’t need the teams that have expressed they are not interested. A forced women’s team is not sustainable if it doesn’t have the interest from the management. It becomes a second-class team. You don’t want or need the ‘oh we need women’ mandate. The sponsors that support women’s teams do it because they want to and see the value in it.”</p><p>As a WorldTour team Tibco-SVB will be at the start line for the Tour de France Femmes starting on July 24, 2022 in Paris. With a mixed bags of stages many riders have a shot at success, Hedderman thinks.</p><p>“In the Tour de France you broaden the scope of riders who can win on this course,” she says. “If you add five mountain-top finishes there are maybe one or two riders who can actually win. If you have two uphill finishes the race tailors to many more riders. I like the gravel stage because of our connection to the gravel scene but I haven’t studied it in depth yet.</p><p>“I heard people say we should have three weeks with 200 km stages [like the men]. I am not sure if 200 km stages make for more exciting races. You can celebrate progress and at the same time keep pushing for more. The Tour de France is so huge [as a brand]. Now women can say they rode the Tour de France.</p><p>“Despite being in cycling for a long time I was too late to experience the former women’s Tour de France [as a rider]. It’s definitely one of my bucket list races as a sports director and I hope to fly over for this one.”</p></div></div>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"22c66b0bd041311545f94ae4f1622aa22631a51da364297c51aa615be128616f","category":"Cycling"}