{"title":"PennyLane on Braket + Progress Toward Fault-Tolerant Quantum Computing + Tensor Network Simulator","link":"https://aws.amazon.com/blogs/aws/pennylane-on-braket-progress-toward-fault-tolerant-quantum-computing-tensor-network-simulator/","date":1607476552000,"content":"<div id=\"readability-page-1\" class=\"page\"><section property=\"articleBody\"><div id=\"amazon-polly-audio-tab\"><p><a href=\"https://aws.amazon.com/polly/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://a0.awsstatic.com/aws-blog/images/Voiced_by_Amazon_Polly_EN.png\" width=\"554\" height=\"56\"></a></p></div><p>I first wrote about <a href=\"https://aws.amazon.com/braket/\" title=\"\">Amazon Braket</a> last year and invited you to <a href=\"https://aws.amazon.com/blogs/aws/amazon-braket-get-started-with-quantum-computing/\">Get Started with Quantum Computing</a>! Since that launch we have continued to push forward, and have added several important &amp; powerful new features to <span title=\"\">Amazon Braket</span>:</p><p><a href=\"https://aws.amazon.com/about-aws/whats-new/2020/08/quantum-computing-available-aws-through-amazon-braket/\"><strong>August 2020</strong></a> – General Availability of <span title=\"\">Amazon Braket</span> with access to quantum computing hardware from D-Wave, IonQ, and Rigetti.</p><p><a href=\"https://aws.amazon.com/about-aws/whats-new/2020/09/amazon-braket-offers-d-waves-advantage-quantum-system-quantum-annealing/\"><strong>September 2020</strong></a> – Access to <a href=\"https://www.dwavesys.com/d-wave-two%E2%84%A2-system\">D-Wave’s Advantage</a> Quantum Processing Unit (QPU), which includes more than 5,000 qubits and 15-way connectivity.</p><p><strong>November 2020</strong> – Support for <a href=\"https://aws.amazon.com/about-aws/whats-new/2020/11/amazon-braket-supports-resource-tagging/\">resource tagging</a>, <a href=\"https://aws.amazon.com/about-aws/whats-new/2020/11/announcing-aws-privatelink-support-amazon-braket/\">AWS PrivateLink</a>, and <a href=\"https://aws.amazon.com/about-aws/whats-new/2020/11/amazon-braket-supports-manual-qubit-allocation/\">manual qubit allocation</a>. The first two features make it easy for you to connect your existing AWS applications to the new ones that you build with <span title=\"\">Amazon Braket</span>, and should help you to envision what a production-class cloud-based quantum computing application will look like in the future. The last feature is particularly interesting to researchers; from what I understand, certain qubits within a given piece of quantum computing hardware can have individual physical and connectivity properties that might make them perform somewhat better when used as part of a quantum circuit. You can read about <a href=\"https://github.com/aws/amazon-braket-examples/blob/main/braket_features/Allocating_Qubits_on_QPU_Devices.ipynb\">Allocating Qubits on QPU Devices</a> to learn more (this is somewhat similar to the way that a compiler allocates CPU registers to frequently used variables).</p><p>In my initial blog post I also announced the formation of the <a href=\"https://www.caltech.edu/about/news/preparations-begin-aws-center-quantum-computing-caltech\">AWS Center for Quantum Computing</a> adjacent to <a href=\"https://www.caltech.edu/\">Caltech</a>.</p><p>As I write this, we are in the Noisy Intermediate Scale Quantum (NISQ) era. This description captures the state of the art in quantum computers: each gate in a quantum computing circuit introduces a certain amount of accuracy-destroying noise, and the cumulative effect of this noise imposes some practical limits on the scale of the problems.</p><p><span><strong>Update Time</strong></span><br>We are working to address this challenge, as are many others in the quantum computing field. Today I would like to give you an update on what we are doing at the practical and the theoretical level.</p><p>Similar to the way that CPUs and GPUs work hand-in-hand to address large scale classical computing problems, the emerging field of <em>hybrid quantum algorithms</em> joins CPUs and QPUs to speed up specific calculations within a classical algorithm. This allows for shorter quantum executions that are less susceptible to the cumulative effects of noise and that run well on today’s devices.</p><p><em>Variational quantum algorithms</em> are an important type of hybrid quantum algorithm. The classical code (in the CPU) iteratively adjusts the parameters of a parameterized quantum circuit, in a manner reminiscent of the way that a neural network is built by repeatedly processing batches of training data and adjusting the parameters based on the results of an objective function. The output of the objective function provides the classical code with guidance that helps to steer the process of tuning the parameters in the desired direction. Mathematically (I’m way past the edge of my comfort zone here), this is called differentiable quantum computing.</p><p>So, with this rather lengthy introduction, what are we doing?</p><p><strong>First</strong>, we are making the <a href=\"https://pennylane.ai/\">PennyLane</a> library available so that you can <a href=\"https://aws.amazon.com/about-aws/whats-new/2020/12/amazon-braket-now-supports-pennylane\">build hybrid quantum-classical algorithms</a> and run them on <span title=\"\">Amazon Braket</span>. This library lets you “follow the gradient” and write code to address problems in computational chemistry (by way of the included <a href=\"https://pennylane.readthedocs.io/en/stable/introduction/chemistry.html\">Q-Chem</a> library), machine learning, and optimization. My AWS colleagues have been working with the PennyLane team to create an integrated experience when PennyLane is used together with <span title=\"\">Amazon Braket</span>.</p><p>PennyLane is pre-installed in Braket notebooks and you can also install the Braket-PennyLane plugin in your IDE. Once you do this, you can train quantum circuits as you would train neural networks, while also making use of familiar machine learning libraries such as <a href=\"https://pytorch.org/\" title=\"\">PyTorch</a> and <a href=\"https://www.tensorflow.org/\" title=\"\">TensorFlow</a>. When you use PennyLane on the managed simulators that are included in <span title=\"\">Amazon Braket</span>, you can train your circuits up to 10 times faster by using parallel circuit execution.</p><p><strong>Second</strong>, the AWS Center for Quantum Computing is working to address the noise issue in two different ways: we are investigating ways to make the gates themselves more accurate, while also working on the development of more efficient ways to encode information redundantly across multiple qubits. Our new paper, <a href=\"https://arxiv.org/abs/2012.04108\">Building a Fault-Tolerant Quantum Computer Using Concatenated Cat Codes</a>&nbsp;speaks to both of these efforts. While not light reading, the 100+ page paper proposes the construction of a 2-D grid of micron-scale electro-acoustic qubits that are coupled via superconducting circuits:</p><p><img src=\"https://media.amazonwebservices.com/blog/2020/qc_layout_3.png\" width=\"901\" height=\"343\"></p><p>Interestingly, this proposed qubit design was used to model a Toffoli gate, and then tested via simulations that ran for 170 hours on <strong>c5.18xlarge</strong> instances. In a very real sense, the classical computers are being used to design and then simulate their future quantum companions.</p><p>The proposed hybrid electro-acoustic qubits are far smaller than what is available today, and also offer a &gt; 10x reduction in overhead (measured in the number of physical qubits required per error-corrected qubit and the associated control lines). In addition to working on the experimental development of this architecture based around hybrid electro-acoustic qubits, the AWS CQC team will also continue to explore other promising alternatives for fault-tolerant quantum computing to bring new, more powerful computing resources to the world.</p><p>And <strong>Third</strong>, we are expanding the choice of managed simulators that are available on <span title=\"\">Amazon Braket</span>. In addition to the state vector simulator (which can simulate up to 34 qubits), you can use the new <a href=\"https://aws.amazon.com/about-aws/whats-new/2020/12/amazon-braket-tensor-network-simulator-supports-50-qubit-quantum-circuits\">tensor network simulator</a> that can simulate up to 50 qubits for certain circuits. This simulator builds a graph representation of the quantum circuit and uses the graph to find an optimized way to process it.</p><p><span><strong>Help Wanted</strong></span><br>If you are ready to help us to push the state of the art in quantum computing, take a look at our open positions. We are looking for <a href=\"https://www.amazon.jobs/en/search?offset=0&amp;result_limit=10&amp;sort=relevant&amp;category=research-science&amp;distanceType=Mi&amp;radius=24km&amp;latitude=&amp;longitude=&amp;loc_group_id=&amp;loc_query=&amp;base_query=quantum&amp;city=&amp;country=&amp;region=&amp;county=&amp;query_options=&amp;\">Quantum Research Scientists</a>, <a href=\"https://www.amazon.jobs/en/search?offset=0&amp;result_limit=10&amp;sort=relevant&amp;category=software-development&amp;distanceType=Mi&amp;radius=24km&amp;latitude=&amp;longitude=&amp;loc_group_id=&amp;loc_query=&amp;base_query=quantum&amp;city=&amp;country=&amp;region=&amp;county=&amp;query_options=&amp;\">Software Developers</a>, <a href=\"https://www.amazon.jobs/en/search?offset=0&amp;result_limit=10&amp;sort=relevant&amp;category=hardware-development&amp;distanceType=Mi&amp;radius=24km&amp;latitude=&amp;longitude=&amp;loc_group_id=&amp;loc_query=&amp;base_query=quantum&amp;city=&amp;country=&amp;region=&amp;county=&amp;query_options=&amp;\">Hardware Developers</a>, and <a href=\"https://www.amazon.jobs/en/jobs/1286210/principal-solutions-architect-quantum-computing-amazon-braket\">Solutions Architects</a>.</p><p><span><strong>Time to Learn</strong></span><br>It is still Day One (as we often say at Amazon) when it comes to quantum computing and now is the time to learn more and to get some experience with. Be sure to check out the <a href=\"https://github.com/aws/amazon-braket-examples\">Braket Tutorials</a> repository and let me know what you think.</p><p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p><p>PS – If you are ready to start exploring ways that you can put quantum computing to work in your organization, be sure to take a look at the <a href=\"https://aws.amazon.com/quantum-solutions-lab/\">Amazon Quantum Solutions Lab</a>.</p></section></div>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"237cb0158f38a4771f224df4f7a4c2a92d9e87b410c5e9b967bbc8af43cdd53a","category":"Tech"}