{"title":"Join the CyclingTips Fantasy competition","link":"https://cyclingtips.com/2021/06/join-the-cyclingtips-fantasy-competition/","date":1624406808000,"content":"<div><div><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/CTFantasy_FeatureImage_1600x900-1340x754.jpg\"></figure><p>The Grand Tour of Grand Tours is almost upon us, which means it’s time for another CyclingTips Fantasy Competition.</p><div><p>We’re shaking up the scoring system to make for a better competition. The new system rewards you with points for picking a rider in the top 10 of each stage, and the points scale is the same on every stage. In other words, you’ll get as many points for picking a sprint stage winner as you will for picking a mountaintop finish winner. Meanwhile, if you miss your proverbial throw at the start list dartboard on a breakaway day, you’ll be in the same boat as if you picked the 11th fastest finisher in a bunch kick, instead of being a seemingly insurmountable five minutes down on GC.</p><p>More on exactly how this works below.</p></div><p>As with previous editions, of course you can enter solo, but the real fun is in the <a href=\"https://fantasy.cyclingtips.com/Home/My-Competitions/Mini-Leagues?secID=823\">mini leagues</a> – so gather some cycling mates, join a mini league or create one and let the competition begin! There are some great prizes up for grabs, including Continental tyres, Rapha caps, Keep Cups, and for one lucky punter, the first edition of a very special new kit.</p><p>Naturally we’ll be keeping you up to date daily throughout the competition with details on how the various category leaderboards are progressing, as well as plenty of tips from the CyclingTips team on the ground and from further afield.</p><h2>HOW IT WORKS</h2><p>1. You choose a rider per stage. You get GC points based on where the rider finishes in the stage, as well as KOM and Sprint points. See the <a href=\"https://cyclingtips.com/fantasy-gc-rules\">competition rules</a> for a breakdown of the points allocation.</p><p>2. Each rider you choose has his points go towards your overall total. The person with the highest points at the end of the competition wins.</p><p>3. You can only choose a rider once throughout the race.</p><p>There are also prizes for the overall KOM and Sprint winners, and a Lanterne Rouge prize as well. What happens if you accidentally miss a stage? No problem: you’re not out of the game. You can read the <a href=\"https://cyclingtips.com/fantasy-gc-rules\">full rules here</a>.</p><p>You can also create mini-leagues to compete with your friends, colleagues or family, either for bragging rights or you can offer prizes of your own!</p><div><figure><a href=\"https://fantasy.cyclingtips.com/Home/Fantasy-Competition?secID=788\" target=\"_blank\"><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Screen-Shot-2021-05-04-at-10.38.04-am.jpg\"></a></figure></div><p><strong>NOTE:</strong> Entries will be accepted until Wednesday, June 30, 2021 (stage 5). Late entries will receive the default picks (see <a href=\"https://cyclingtips.com/fantasy-gc-rules\">rules</a>) for stages missed.</p><p>If you have any questions, please leave a comment below!</p><h2>PRIZE DETAILS</h2><div><h2>GENERAL CLASSIFICATION WINNER PRIZE</h2><p>The winner of the GC will take home a special CyclingTips winners bundle:<br>+ You’ll be the first to wear a very special new collaboration kit with Black Sheep Cycling, comprising a jersey, bibs, cap, and socks<br>+ A 1-year <a href=\"https://cyclingtips.com/signup/\">VeloClub membership</a><br>+ A pair of Continental GP5000 tyres<br>+ Special ‘Coppi’ edition CT KeepCup<br>+ A CyclingTips tee</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Screen-Shot-2021-06-22-at-3.48.09-pm-1340x404.png\"></figure></div><div><div><h2>SPRINT CLASSIFICATION WINNER PRIZE</h2><p>The winner of the Sprint classification will take home a special CyclingTips winners bundle, comprising:<br>+ A 1-year <a href=\"https://cyclingtips.com/signup/\">VeloClub membership</a><br>+ Special ‘Coppi’ edition CT KeepCup<br>+ A CyclingTips tee</p></div><div><h2>KOM CLASSIFICATION WINNER PRIZE</h2><p>The winner of the KOM classification will take home a special CyclingTips winners bundle, comprising:<br>+ A 1-year <a href=\"https://cyclingtips.com/signup/\">VeloClub membership</a><br>+ Special ‘Coppi’ edition CT KeepCup<br>+ A CyclingTips tee</p></div><div><h2>LANTERNE ROUGE CLASSIFICATION WINNER PRIZE</h2><p>The winner of the Lanterne Rouge will pick up a special one-off tee (for bragging rights, naturally).</p></div></div><h2>ADDITIONAL RESOURCES</h2></div></div>","author":"Andy van Bergen","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"2414d57cdf6db46a04549b44792496ef59c35e6bacac0da3498e2ae9703472eb","category":"Cycling"}