{"title":"Google wants to standardize digital car key and ID support on Android","link":"https://arstechnica.com/?p=1752399","date":1616779612000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>You better not run out of battery power —</h4><h2 itemprop=\"description\">Google will certify Secure Element chips and software as \"Android Ready SE.\"</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/12-1-800x451.jpg\" alt=\"The Android Ready SE logo. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/12-1.jpg\" data-height=\"539\" data-width=\"957\">Enlarge</a> <span>/</span> The Android Ready SE logo.</p><p>Google</p></figcaption></figure><p>OK, it's time to head out the door, so make sure you've got your phone, keys, and wallet.</p><p>That's a lot of items to carry around, so what if you only had to bring your phone? After all, your keys and wallet are just legacy authentication devices. We could totally replace them with a phone! That's the future Google is working toward as it pushes Android forward with support for driver's licenses and digital car keys.</p><p>Google's latest announcement details work to standardize an Android ecosystem around hardware and software, called the \"<a href=\"https://security.googleblog.com/2021/03/announcing-android-ready-se-alliance.html\">Android Ready SE Alliance</a>,\" that will make all this work. \"SE\" here is \"secure element,\" a hardware component quarantined from the rest of the system, designed to only run secure computing tasks like an NFC payment.&nbsp;The idea is that phone manufacturers will be able to buy an \"Android Ready SE\" from secure element vendors like NXP, Thales,&nbsp;STMicroelectronics, Giesecke+Devrient, and Kigen, and Google says that these SE vendors are \"joining hands with Google to create a set of open-source, validated, and ready-to-use SE Applets\" that will support these emerging use cases.</p><p>With this new SE standardization effort, Google wants to support \"digital keys\" for your car, home, and office; mobile driver's licenses; national IDs;&nbsp;ePassports;&nbsp;and the usual tap-and-go payments. Google notes that this initiative isn't just for phones and tablets; Wear OS, Android Automotive, and Android TV are also supported. Having a car key in your watch or a driver's license in your car computer sounds like a great idea, but Android TV? Why would I want a driver's license in my television?</p><p>Google lays out the full requirements for Android Ready SE:</p><blockquote><ol><li>Pick the appropriate, validated hardware part from their SE vendor</li><li>Enable SE to be initialized from the bootloader and provision the root-of-trust (RoT) parameters through the SPI interface or cryptographic binding</li><li>Work with Google to provision Attestation Keys/Certificates in the SE factory</li><li>Use the GA version of the StrongBox for the SE applet, adapted to your SE</li><li>Integrate HAL code</li><li>Enable an SE upgrade mechanism</li><li>Run CTS/VTS tests for StrongBox to verify that the integration is done correctly</li></ol></blockquote><p>What's not clear from Google's announcement is the difference between supporting StrongBox, Android's usual standard for a tamper-resistant hardware security module, and being certified for \"Android Ready SE.\" <a href=\"https://developer.android.com/training/articles/keystore#HardwareSecurityModule\">StrongBox modules</a> include their own CPU, secure storage, and a true random number generator, and they communicate with the rest of the system over the&nbsp;Keymaster HAL. StrongBox has been supported on Qualcomm chips through the&nbsp;Qualcomm \"<a href=\"https://www.qualcomm.com/news/releases/2019/06/25/qualcomm-snapdragon-855-becomes-first-mobile-soc-receive-smart-card\">Secure Processing Unit</a>\"&nbsp;(SPU) since 2018's Snapdragon 845. Today it looks like even the low end of Qualcomm's lineup, like the Snapdragon 460, contains a Secure Processing Unit.</p><h2>Qualcomm’s SPU isn’t good enough?</h2><p>Qualcomm is conspicuously absent from Google's blog post and the <a href=\"https://developers.google.com/android/security/android-ready-se/supported-chipsets?ENABLE_SIGNIFICATIO=False\">list of supported chipsets</a>, so is the whole point of this initiative to say that on-die secure elements are not good enough? Google's Pixel team has certainly moved in that direction with the development of the <a href=\"https://www.blog.google/products/pixel/titan-m-makes-pixel-3-our-most-secure-phone-yet/\">Titan M Security Chip</a> in the Pixel 3 and up, and Samsung is <a href=\"https://news.samsung.com/global/samsung-introduces-best-in-class-data-security-chip-solution-for-mobile-devices\">building its own</a> secure element now, too, for flagship phones. (Samsung is also not mentioned in Google's blog post.) If not for the post saying, \"Most modern phones now include discrete tamper-resistant hardware called a Secure Element (SE). We believe this SE offers the best path for introducing these new consumer use cases in Android,\" we would think that the blog post is pushing for off-die secure elements. But it's not clear how Google can use the word \"most\" if it's not counting Qualcomm's SPU. We've asked for clarification and will update this report if the company gets back to us.</p><p>Google is not the only company trying to lighten your daily loadout. Apple is working on <a href=\"https://www.techtimes.com/articles/250794/20200702/apple-is-working-to-replace-ids-like-passport-and-drivers-license-with-iphones.htm\">digital IDs</a> and <a href=\"https://arstechnica.com/cars/2020/06/apple-adds-carkey-function-to-ios14-bmw-will-support-it-first/\">car keys</a> for iPhones, and <a href=\"https://www.theverge.com/2021/1/14/22230960/samsung-digital-car-key-audi-bmw-ford-genesis-uwb-bluetooth\">Samsung</a> is partnering with individual car manufacturers to try to beat Google to the punch on Android. There have also been plenty of one-off car key apps from companies like BMW and Tesla.</p><p>For now, Google says it's prioritizing Mobile driver’s licenses and car keys. The company says it's working with the ecosystem to deliver the SE applets for these two use cases \"in conjunction with corresponding Android feature releases.\" The Android feature release for mobile driver's licenses is the <a href=\"https://arstechnica.com/gadgets/2020/09/android-11-the-ars-technica-review/7/\">Identity Credential API</a> that launched with Android 11. The holdup here is mostly that your local government agency needs to both pass a law authorizing digital IDs and then make a digital ID app. As far as we can tell, there is not an Android feature release for digital car keys yet, even in Android 12. When that gets announced, it will hopefully support the&nbsp;Car Connectivity Consortium's <a href=\"https://global-carconnectivity.org/\">Digital Key</a>&nbsp;standard, which would put Android and iOS on the same car key standard.</p><p>We'll be on the lookout.</p></div></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"244f7358efea368807bfec4036bdc76c912be8df0f70e4924e6f14f3c26a34de","category":"Tech"}