{"title":"Adding arthritis drug to current COVID treatment cuts deaths even more","link":"https://arstechnica.com/?p=1741901","date":1613151432000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>New weapon —</h4><h2 itemprop=\"description\">It's not a smash hit, but the benefits and the clear results are welcome.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1229918328-800x533.jpg\" alt=\"A medical staff member adjusts a ventilator on a patient in the COVID-19 intensive care unit (ICU) at the United Memorial Medical Center on December 2, 2020 in Houston, Texas. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1229918328.jpg\" data-height=\"3000\" data-width=\"4500\">Enlarge</a> <span>/</span> A medical staff member adjusts a ventilator on a patient in the COVID-19 intensive care unit (ICU) at the United Memorial Medical Center on December 2, 2020 in Houston, Texas.</p></figcaption></figure><p>An anti-inflammatory arthritis drug called tocilizumab modestly reduces deaths and hospital stays in patients with severe COVID-19, according to preliminary data from a randomized trial of over 4,000 patients.</p><p>Among hospitalized patients requiring oxygen in the trial, there were 596 deaths in the group of 2,022 patients randomly assigned to take tocilizumab—29 percent died—and 694 deaths in the group of 2,094 patients randomly assigned to standard care—33 percent died. That’s an absolute difference of 4 percent in deaths and a 14 percent drop in the relative rate of death.</p><p>Tocilizumab also appeared to shorten hospital stays, boosting the chances that surviving patients could leave the hospital within 28 days after randomization from 47 percent to 54 percent.</p><p>Lastly, the arthritis drug also appeared to help keep disease from progressing to the point where patients need mechanical ventilation, dropping the mechanical ventilation rate from 38 percent to 33 percent.</p><p>The benefits seen in the trial were in addition to benefits already seen while using dexamethasone, a cheap, readily available, easy-to-use steroid drug <a href=\"https://arstechnica.com/science/2020/06/cheap-steroid-may-lower-covid-19-death-rate-but-experts-urge-caution/\">found earlier to reduce deaths in COVID-19 patients</a>. In both patient groups—tocilizumab and standard care groups—dexamethasone was given to 82 percent of patients.</p><p>The trial findings—<a href=\"https://www.medrxiv.org/content/10.1101/2021.02.11.21249258v1\">published online but not yet peer-reviewed</a>—suggest that the combination of the two drugs could further chip away at the death rate of the devastating pandemic.</p><h2>Clear and welcome</h2><p>However, compared with dexamethasone, tocilizumab is not as cheap, readily available, or easy to use. The drug is a monoclonal antibody that essentially blocks signaling in the immune system that leads to inflammation. The antibody treatment needs to be delivered intravenously, while dexamethasone can be given orally, by injection, or intravenously. And while dexamethasone can cost around $7 for a course, tocilizumab can run as much as around $700.</p><p>As such, tocilizumab is unlikely to be a smash hit used everywhere in the fight against COVID-19. Still, with the scarcity of effective treatments against severe disease, doctors will likely be eager to add it to their arsenal when possible.</p><p>The data—from the massive<a href=\"https://www.recoverytrial.net/\"> RECOVERY trial</a> run in the United Kingdom—adds clarity to one of the many murky research areas of COVID-19. Seven smaller trials had also looked into using tocilizumab to treat severe COVID-19 patients in the past. However, the results were mixed and collectively inconclusive. RECOVERY, on the other hand, had data on over three times as many deaths as all seven trials combined and was able to make a clear conclusion.</p><p>“Previous trials of tocilizumab had shown mixed results, and it was unclear which patients might benefit from the treatment,” emerging infectious diseases expert and co-lead of RECOVERY Peter Horby&nbsp;said in a press statement. “We now know that the benefits of tocilizumab extend to all COVID patients with low oxygen levels and significant inflammation. The double impact of dexamethasone plus tocilizumab is impressive and very welcome.”</p></div></div>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"262b6545e052c1155114a8227672057476abecffbeee840685da5387e0a24e8f","category":"Tech"}