{"title":"‘NFT’s Are a Dangerous Trap’","link":"https://seths.blog/2021/03/nfts-are-a-dangerous-trap/","date":1616612129000,"content":"<div id=\"readability-page-1\" class=\"page\"><div data-url=\"https://seths.blog/2021/03/nfts-are-a-dangerous-trap/\" data-title=\"NFTs are a dangerous trap\"><p>Like most traps, they’re mysterious and then appealing and then it’s too late.</p><p>An NFT is digital treasure chest, a status symbol and an apparent item of value.</p><p>Like a Pokemon card, or an original Picasso drawing or the actual frame of a Disney animated film from 1955, NFTs are designed to be the one and only, a shred of non-fungible reality in a world gone digital.</p><p>You either own <em>this</em> thing or you don’t.</p><p>To make it really clear, consider <a rel=\"noreferrer noopener\" href=\"https://www.wikiwand.com/en/T206_Honus_Wagner\" target=\"_blank\">Honus Wagner</a>. A Honus Wagner baseball card is quite rare (Wagner didn’t permit the card to be made because he wanted nothing to do with cigarettes, foreshadowing some of the stuff below) and so there were fewer than 200 all in before production shut down. One of the cards last sold for more than $3,000,000.</p><p>Owning a Honus Wagner card doesn’t mean you own Honus Wagner. Or a royalty stream or anything else but the card itself.</p><p>For years, this was part of the business model of the collectible card industry. Make billions of cards, most get thrown out, some rookies get famous, some cards go up in value.</p><p>Now, consider an oil painting. Perhaps it was stolen a long time ago, or became famous for other reasons. It’s the one and only. If you somehow owned the Mona Lisa, it wouldn’t mean that you own the woman who is portrayed in it, or any part of DaVinci, it would simply mean you own a canvas, one that others also want to own.</p><p>People can look at images of the Mona Lisa all day long without compensating you, because you simply own the original trophy, not the idea…</p><p>But having it on your wall gives you a feeling, and telling other people you own it gives you another, slightly different feeling.</p><p>It’s worth noting two things about the art example:</p><ol><li>There’s a three-thousand-year cultural history of owning priceless works of art. Most people understand that an original Rothko is a high-status luxury good.</li><li>Almost all paintings are worthless (on a cash basis). They sell at garage sales for dollars, not millions, and original (and beautiful) works of art go unsold every day.</li></ol><p>So what’s an NFT? It’s a digital token (the same way a Bitcoin is a digital token) except it’s a one and only, like a Honus Wagner, there’s just one. One of these tokens might refer to something else (a video of a basketball shot, an oil painting, even this blog post) but it isn’t that thing. It’s simply a token authorized by the person who made it to be the one and only one. (The NBA has already sold more than $200 million in video clip highlight NFTs)…</p><p>And so the trap:</p><p><strong>CREATORS</strong> may rush to start minting NFTs as a way to get paid for what they’ve created. Unlike alternative digital currencies which are relatively complicated to invent and sell, it’s recently become super easy to ‘mint’ an NFT. I could, for example, turn each of the 8,500 posts on this blog into a token and sell them on the open market.</p><p>The more time and passion that creators devote to chasing the NFT, the more time they’ll spend trying to create the appearance of scarcity and hustling people to believe that the tokens will go up in value. They’ll become promoters of digital tokens more than they are creators. Because that’s the only reason that someone is likely to buy one–like a stock, they hope it will go up in value. Unlike some stocks, it doesn’t pay dividends or come with any other rights. And unlike actual works of art, NFTs aren’t usually aesthetically beautiful on their own, they simply represent something that is.</p><p><strong>BUYERS</strong> of NFTs may be blind to the fact that there’s no limit on the supply. In the case of baseball cards, there are only so many rookies a year. In the case of art, there’s a limited number of famous paintings and a limited amount of shelf space at Sotheby’s. NFTs are going to be more like Kindle books and YouTube videos. The vast majority are going to have ten views, not a billion. It’s an unregulated, non-transparent hustle with ‘bubble’ written all over it.</p><p><strong>THE REST OF US </strong>are going to pay for NFTs for a very long time. They use an <em><a rel=\"noreferrer noopener\" href=\"http://cryptoart.wtf/#https://superrare.co/artwork-v2/kitties-12133\" target=\"_blank\">astonishing</a></em> amount of electricity to create and trade. Together, they are already using more than is consumed by some states in the US. Imagine building a giant new power plant just to make Christie’s or the Basel Art Fair function. And the amount of power wasted will go up commensurate with their popularity and value. And keep going up. The details are <a rel=\"noreferrer noopener\" href=\"https://everestpipkin.medium.com/but-the-environmental-issues-with-cryptoart-1128ef72e6a3\" target=\"_blank\">here</a>. The short version is that for the foreseeable future, the method that’s used to verify the blockchain and to create new digital coins is deliberately energy-intensive and inefficient. That’s on purpose. And as they get more valuable, the energy used will go up, not down.</p><p>It’s an ongoing waste that creates little in ongoing value and gets less efficient and more expensive as time goes on. For most technological innovations the opposite is true.</p><p>The trap, then, is that creators can get hooked on creating these. Buyers with a sunk cost get hooked on making the prices go up, unable to walk away. And so creators and buyers are then hooked in a cycle, with all of us up paying the lifetime of costs associated with an unregulated system that consumes vast amounts of precious energy for no other purpose than to create some scarce digital tokens.</p><p>[<a href=\"https://venturebeat.com/2018/02/25/the-real-cost-of-mining-ethereum/\" target=\"_blank\" rel=\"noreferrer noopener\">Here</a> are <a href=\"https://blockonomi.com/ethereum-casper/\" target=\"_blank\" rel=\"noreferrer noopener\">some</a> <a href=\"http://sterlingcrispin.blogspot.com/2021/02/crypto-art-sky-is-not-falling.html?m=1\" target=\"_blank\" rel=\"noreferrer noopener\">other</a> <a href=\"https://tezos.gitlab.io/007/proof_of_stake.html\" target=\"_blank\" rel=\"noreferrer noopener\">views</a> on this].</p><p>I wrote a book about digital cash twenty years ago. This is precisely the sort of cool project and economic curiosity that I want to be excited about. But, alas, I can see the trap and I wanted to speak up with clarity. I would usually make this into an episode of my <a rel=\"noreferrer noopener\" href=\"https://www.akimbo.link/\" target=\"_blank\">podcast</a>, but Everest’s <a href=\"https://everestpipkin.medium.com/but-the-environmental-issues-with-cryptoart-1128ef72e6a3\" target=\"_blank\" rel=\"noreferrer noopener\">article</a> deserved a link and more focus, so here you go.</p><p>Let’s walk away from this one.</p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"2647c492d9bdc3e5817b0d9f2b73fd00ab4ac617ec8b7b3fbd6ff28215c6a188","category":"Tech"}