{"title":"Lefevere confirms that Cavendish has signed on to stay with QuickStep-Alpha Vinyl","link":"https://cyclingtips.com/2021/12/lefevere-confirms-that-cavendish-has-signed-on-to-stay-with-quickstep-alpha-vinyl/","date":1638466569000,"content":"<div><div><p>Deceuninck-QuickStep manager Patrick Lefevere says that his team has reached an agreement with Mark Cavendish.</p><p>The 34-year-old Manxman has reportedly signed a one-year deal to stay on with the squad.</p><p>“Mark wanted an extension of his fairy tale and I didn’t want to take that away from him,” Lefevere said, according to Sporza, in a media appearance on Thursday.</p><p>Cavendish will thus ride on with the squad as it becomes QuickStep-Alpha Vinyl next season. It will be his fifth season as a member of the team; he spent three years with the squad between 2013 and 2015, and then rejoined the organization in 2021. His second stint came after a challenging stretch in which he went more than three years without a professional victory, but Cavendish found himself back among the sport’s very fastest finishers this year, powering to four stage wins at the Tour de France and thus tying the record of Eddy Merckx for Tour stage victories in a career.</p><p>Cavendish has been in talks with Lefevere to stay on with the team into 2022, but it has taken some time for details to be ironed out, with Lefevere occasionally taking to the media to air his frustrations with the process. Negotiations were further put on hold after Cavendish crashed heavily at the Ghent Six, suffering multiple injuries.</p><p>As of this week, however, a deal has apparently been finished.</p><p>“Everyone knows the story by now: when managers and lawyers come into play, it gets more difficult,” Lefevere said, according to Sporza.</p><p>“Mark is very concerned about his image and I understand that. It took a long time, yes. However, it didn’t make me impatient in the sense that I knew it would happen anyway. But at some point you hand it over and when the contract is done, let the people do it.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"26b19d4b3ee80f7139f4f04785da4e4b1e98798a86d874ff3fb964314a11ecda","category":"Cycling"}