{"title":"Hunt launches 60 Limitless Aero Disc wheelset","link":"https://www.cyclist.co.uk/review/9275/hunt-60-limitless-aero-disc-wheelset","date":1614273905000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Hunt has announced the release of a new racing wheelset, the 60 Limitless Aero Disc.</p><p>The British manufacturer's latest carbon wheels are the third in its Limitless range, which features its patent-pending Limitless Width Technology.</p><p>Designed for criteriums, triathlons and road races, Hunt says the wheel 'excels at minimising aerodynamic drag while maintaining a smooth steering moment, allowing riders to carry higher speeds through corners and variable conditions'.</p><p>The new wheels will grace WorldTour team <a href=\"https://www.cyclist.co.uk/tags/qhubeka-assos\">Qhubeka-Assos</a>'s BMC TeamMachine bikes on flat stages at Grand Tours and beyond as well as the Hunt-supported LA Sweat Team at Tulsa Tough in Oklahoma.</p>&nbsp;<h3>Technology</h3><p>Hunt has gone so deep on research and testing that it has <a href=\"https://cdn.shopify.com/s/files/1/0686/6341/files/60_Limitless_White_Paper.pdf?mc_cid=6eef5395d1&amp;mc_eid=ab9c6be9c3\" target=\"_blank\">published a white paper</a> on the wheels showing how they perform alongside competitors.</p><p>The 60 Limitless Aero Disc wheelset maintains the same construction as its 48mm predecessor. It also keeps the Limitless Width Technology developed by aerospace engineer Luisa Grappone and materials scientists Pete Marchment that uses low-density carbon to create extra-wide but lightweight rims.</p><p>Following that extensive wind tunnel testing, the disc-specific rims have 21mm internal and 34mm external widths with a 60mm aero-optimised u-shape profile. Hunt says for optimum aerodynamics each rim should be fitted with 25-28mm tyres and the wheels are tubeless-ready for lower rolling resistance and weight.</p><p>Buyers have a choice between EZO and CeramicSpeed bearings, with the latter adding £260 to the bill. However Hunt says the reward of famously low rolling resistance for that extra cost, along with CeramicSpeed's six-year warranty, offers more freedom when racing.</p><p>The wheels are built with Hunt's FastEngage Sprint hubs that have 7.5° engagement with 48 ratchets in the hub shell.</p><h3>Specs, weight and pricing</h3><p>Hunt says the wheelset weighs in at 1669g for the pair, and with options for 8-11 speed Shimano and Sram freehubs and 8-12 speed for Sram XD/XDR and Campagnolo.</p><p>The price starts at £1,169 with EZO bearings and rises to £1429 when equipped with the CeramicSpeed.&nbsp;The Hunt 60 Limitless Aero Disc wheelset is available for pre-order now with estimated delivery in April.</p><table><tbody><tr><td>MSRP (EZO)</td><td>£1,169</td></tr><tr><td>MSRP (CeramicSpeed)</td><td>£1,429</td></tr><tr><td>Dimensions</td><td>34mm external, 21mm internal</td></tr><tr><td>Weight</td><td>1,669g</td></tr><tr><td>Hubs</td><td>FastEngage 7.5 Hub Sprint, with an engagement rate of 7.5°. 20/24 hole. Multi-point pawls, with 48 ratchets within the hub shell. Centre-Lock Disc.</td></tr><tr><td>Bearings</td><td>CeramicSpeed &amp; EZO available</td></tr><tr><td>Spokes</td><td>Pillar Elliptical Spokes, PSR Wing 20 14g Straight Pull Black</td></tr><tr><td>Tyre compatibility</td><td>Tubeless and clincher-ready, optimised for 25-28c, compatible</td></tr><tr><td>Freehub options</td><td>Shimano/Sram 8/9/10/11 speed, Sram XD/XDR, Campagnolo 8/9/10/11/12 speed</td></tr></tbody></table></div></div>","author":"wstrickson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"272422407d82e3b07303205357a1e08035b26084c35af80d85c5f44c00b20636","category":"Cycling"}