{"title":"Facebook and Instagram Link Previews Would Break EU Privacy Law, Say Security Researchers","link":"https://www.macrumors.com/2021/02/09/facebook-instagram-link-previews-break-privacy-law/","date":1612877318000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/09/facebook-instagram-link-previews-break-privacy-law/\"><p>A <a href=\"https://www.mysk.blog/2021/02/08/fb-link-previews/\">follow-up report</a> by security researchers Talal Haj Bakry and Tommy Mysk has alleged that Facebook Messenger and Instagram are collecting and using data from link previews in a way that would breach European privacy law.</p><p><img alt=\"facebook messenger icon new\" width=\"1200\" height=\"630\" src=\"https://images.macrumors.com/t/UiO3oapiVzelvsk7o72ebYijoOc=/400x0/filters:quality(90)/article-new/2021/02/facebook-messenger-icon-new.jpg?lossy\" data-src=\"https://images.macrumors.com/t/UiO3oapiVzelvsk7o72ebYijoOc=/400x0/filters:quality(90)/article-new/2021/02/facebook-messenger-icon-new.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/UiO3oapiVzelvsk7o72ebYijoOc=/400x0/filters:quality(90)/article-new/2021/02/facebook-messenger-icon-new.jpg?lossy 400w,https://images.macrumors.com/t/vICr2DDOG7OgtYYukJ0ZQKdKifs=/800x0/filters:quality(90)/article-new/2021/02/facebook-messenger-icon-new.jpg?lossy 800w,https://images.macrumors.com/t/ZZlFrMT27PwxZeOHRNMRGcVu8D8=/1600x0/filters:quality(90)/article-new/2021/02/facebook-messenger-icon-new.jpg 1600w,https://images.macrumors.com/t/CF58FwvCHmOrtQoN7AnvHGQ0yZQ=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/facebook-messenger-icon-new.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/UiO3oapiVzelvsk7o72ebYijoOc=/400x0/filters:quality(90)/article-new/2021/02/facebook-messenger-icon-new.jpg?lossy 400w,https://images.macrumors.com/t/vICr2DDOG7OgtYYukJ0ZQKdKifs=/800x0/filters:quality(90)/article-new/2021/02/facebook-messenger-icon-new.jpg?lossy 800w,https://images.macrumors.com/t/ZZlFrMT27PwxZeOHRNMRGcVu8D8=/1600x0/filters:quality(90)/article-new/2021/02/facebook-messenger-icon-new.jpg 1600w,https://images.macrumors.com/t/CF58FwvCHmOrtQoN7AnvHGQ0yZQ=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/facebook-messenger-icon-new.jpg 2500w\"></p><p>In October last year, <a href=\"https://www.macrumors.com/2020/10/26/link-previews-may-lead-to-security-vulnerabilities/\">Bakry and Mysk revealed</a> that link previews in popular messaging apps can lead to security and privacy issues on iOS and Android. It was discovered that apps could leak IP addresses, expose links sent in end-to-end encrypted chats, download large files without users' consent, and copy private data through link previews.</p><p>In that report, Bakry and Mysk found that Facebook Messenger and Instagram behaved unlike other messaging apps in that they downloaded the entire contents of any link to its servers, regardless of size. When questioned about this unusual behavior, Facebook reportedly said that it considers this to be \"working as intended.\"</p><p>Copies of link preview data kept on external servers could be subject to breaches or misuse, which may be particularly concerning for users who send links to sensitive or confidential private data such as business documents, bills, contracts, or medical records.</p><p>Now, Bakry and Mysk have found that Facebook has recently stopped generating link previews in Messenger and Instagram for users in Europe <a href=\"https://about.fb.com/news/2020/12/changes-to-facebook-messaging-services-in-europe/\">to comply with the European Union's ePrivacy Directive</a>. The change also applies to users outside Europe if they communicate with someone in the region.</p><p><img alt=\"messenger link previews\" width=\"2048\" height=\"933\" src=\"https://images.macrumors.com/t/DQWQ143F4uP_wB3WLN3bK1B13sM=/400x0/filters:quality(90)/article-new/2021/02/messenger-link-previews.jpg?lossy\" data-src=\"https://images.macrumors.com/t/DQWQ143F4uP_wB3WLN3bK1B13sM=/400x0/filters:quality(90)/article-new/2021/02/messenger-link-previews.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/DQWQ143F4uP_wB3WLN3bK1B13sM=/400x0/filters:quality(90)/article-new/2021/02/messenger-link-previews.jpg?lossy 400w,https://images.macrumors.com/t/cSBm8GnhImN4FiltMBm2ImcdiII=/800x0/filters:quality(90)/article-new/2021/02/messenger-link-previews.jpg?lossy 800w,https://images.macrumors.com/t/eZXWb-brdiG_5SEVIjVx41YNbsg=/1600x0/filters:quality(90)/article-new/2021/02/messenger-link-previews.jpg 1600w,https://images.macrumors.com/t/GMrld8oLF6ZQatb8WOg_WsvOv3s=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/messenger-link-previews.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/DQWQ143F4uP_wB3WLN3bK1B13sM=/400x0/filters:quality(90)/article-new/2021/02/messenger-link-previews.jpg?lossy 400w,https://images.macrumors.com/t/cSBm8GnhImN4FiltMBm2ImcdiII=/800x0/filters:quality(90)/article-new/2021/02/messenger-link-previews.jpg?lossy 800w,https://images.macrumors.com/t/eZXWb-brdiG_5SEVIjVx41YNbsg=/1600x0/filters:quality(90)/article-new/2021/02/messenger-link-previews.jpg 1600w,https://images.macrumors.com/t/GMrld8oLF6ZQatb8WOg_WsvOv3s=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/messenger-link-previews.jpg 2500w\"><em>Links sent in Facebook Messenger as seen in Europe and other regions</em></p><p>The researchers suggest that since Europe has \"some of the most robust privacy laws\" and Facebook has now removed link previews seemingly to comply with the legislation, the company must have been using the data from link previews in a way that would breach the ePrivacy Directive.</p><blockquote><p>It is an implicit confirmation that Facebook's handling of link previews in Messenger and Instagram did not conform to privacy regulations in Europe, otherwise they wouldn't have disabled the feature... Stopping this service in Europe strongly hints that Facebook may be using this content for purposes other than generating previews.</p></blockquote><p>Bakry and Mysk believe that Facebook's link previews may have infringed on articles 4:1a, 4:2, and 5:3 of the ePrivacy Directive. These articles include the requirement that personal data can only be accessed by authorized personnel for legal purposes, the need to inform users of the risks of a data breach, and the need to gain user consent having been provided with \"clear and comprehensive information\" about how data is collected.</p><p>As links may relate to personal data, the ePrivacy Directive prevents Facebook from storing, processing, or using this information without explicit consent from users in the EU. Facebook would also have to make it clear to users why it is downloading the contents of link previews prior to requesting consent.</p><p>Bakry and Mysk have demonstrated that Facebook servers download and store the content of links sent through its apps, and if the same link is sent a second time, Facebook generates a link preview without downloading the contents of the link. This purportedly indicates that the content is stored or cached by Facebook and is proven by the amount of data that is uploaded from a user's device.</p><p>Link previews continue to be available in Messenger and Instagram for users outside Europe. Facebook's current Terms of Service state that any content users share through any of Facebook's services will be used for various purposes such as personalizing content, ads, making suggestions, and learning about users, both on and off Facebook's products. In Europe, this use of personal data now requires explicit consent from users even if it is approved by Facebook's Terms of Service.</p><blockquote><p>Facebook disabled link previews for users in Europe to comply with new privacy regulations. This confirms our privacy concerns that sending links to private files in Messenger and Instagram is unsafe. While Facebook did disable link previews in Europe, users in other regions should refrain from sending links through either of these apps. The better option would be to switch to other messaging apps which respect user privacy in all parts of the world alike.</p></blockquote><p>Bakry and Mysk are now actively recommending that users outside Europe do not send links in Messenger or Instagram due to privacy concerns, and have even suggested that users move to other messaging apps entirely.</p><p>Beyond <a href=\"https://www.macrumors.com/2020/10/26/link-previews-may-lead-to-security-vulnerabilities/\">link previews</a>, the researchers have previously investigated popular <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> apps <a href=\"https://www.macrumors.com/2020/03/15/ios-apps-pasteboard-data-report/\">\"snooping\" on iOS pasteboard data</a> and HTTP <a href=\"https://www.macrumors.com/2020/04/18/tiktok-http-vulnerability/\">security vulnerabilities in TikTok</a>.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/intel-11th-gen-vs-apple-m1-chip-benchmarks/\">Intel Downplays Apple's M1 Chip With 'Carefully Crafted' Benchmarks</a></h3><p>Saturday February 6, 2021 3:17 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Nearly three months after the launch of Apple's rave-reviewed M1 Macs, Intel has fired back, but there are some asterisks involved. In a slideshow shared by PCWorld this week, Intel highlighted what PCWorld described as \"carefully crafted\" benchmarks in an attempt to prove that laptops with the latest 11th Generation Core processors are superior to those with Apple's custom-designed M1 chip. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-dtk-credit-for-developers-increased/\">Apple Ups DTK Mac Mini Return Credit to $500 After Developer Complaints</a></h3><p>Friday February 5, 2021 8:51 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Prior to the release of the M1 Macs, Apple offered developers a $500 Developer Transition Kit (DTK) that included a Mac mini equipped with an A12Z Bionic chip first used in the iPad Pro, 16GB RAM, a 512GB SSD, two USB-C ports, two USB-A ports, and an HDMI 2.0 port. The DTKs were available on a temporary basis, and earlier this week, Apple said that it would soon begin asking developers to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/01/imac-apple-silicon-redesign/\">iMac to Get a Whole New Look for Apple Silicon</a></h3><p>Apple's long-awaited iMac with Apple Silicon is expected to arrive this year featuring a complete redesign, according to a range of reports. According to Bloomberg's Mark Gurman, the redesigned iMac models will feature significantly slimmed down bezels around the display. The large aluminum \"chin\" segment, below the display of current iMacs, will be removed entirely for a design that...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/07/iphone-12-risk-magnets-pacemakers/\">Medical Doctors Underline Potential Risk of iPhone 12 Interference With Pacemakers</a></h3><p>Sunday February 7, 2021 4:11 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple's warning to keep the iPhone 12 away from cardiac devices due to electromagnetic interference was further underlined by U.S. cardiologists this week in a new report (via NBC25 News). Apple's iPhone 12 series includes an array of magnets that help align the phone on Apple's MagSafe charging accessory to maximize charging, and Apple already advises users with implanted pacemakers and...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/top-stories-ios-14-5-beta/\">Top Stories: iOS 14.5 Beta, macOS 11.2 Released, VR Headset and Apple Car Rumors</a></h3><p>It was a big week for software this week, with Apple kicking off a new round of betas for its operating systems with plenty of tweaks and changes in iOS 14.5 and related updates. We also saw the public release of macOS 11.2, which trailed last week's release of iOS 14.4. In other news, we got some significant new rumors about Apple's VR headset project and the Apple Car, while over on our...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-pauses-car-talks-hyundai-kia/\">Apple Pauses Electric Car Talks With Hyundai and Kia</a></h3><p>Friday February 5, 2021 2:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Multiple rumors over the course of the last week have suggested that Apple has been discussing Apple car manufacturing with Hyundai and Hyundai affiliate Kia, but those talks have paused recently, reports Bloomberg. Apple has also been discussing its Apple Car plans with other automobile manufacturers, so despite rumors suggesting Apple is considering a deal with Hyundai/Kia, Apple could...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/ios-14-5-beta-siri-default-music-service/\">Siri Setting in iOS 14.5 Beta Lets Users Select Default Music Streaming Service</a></h3><p>Monday February 8, 2021 4:09 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple last week released beta versions of upcoming iOS 14.5 and iPadOS 14.5 updates to developers and public beta testers, and among a number of new features, Apple has added the ability to set a default music streaming service when using Siri to play songs. Image via Reddit user matejamm1 First spotted by Reddit users, the first time you ask Siri to play a song in iOS 14.5, you are given the ...</p></div></div></div>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"282a4ff92f3491ae78c4ad3b5975ffc5055a2e6fd95c266035cde5d84e68fd5b","category":"Apple"}