{"title":"Apple Shares 'Fumble' Ad Highlighting iPhone 12 Ceramic Shield","link":"https://www.macrumors.com/2021/03/24/apple-fumble-iphone-12-ad/","date":1616636033000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/24/apple-fumble-iphone-12-ad/\"><p>Apple today shared a new ad that focuses on the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a>'s durability, specifically highlighting the Ceramic Shield display, which is meant to be tougher than standard smartphone glass.</p><p>In the ad, a woman's ‌iPhone 12‌ slips out of her hand and she fumbles with it for several seconds before it flies out of her grip and lands on the ground, coming away unscathed.</p><p>\"‌iPhone 12‌ with Ceramic Shield. Tougher than any smartphone glass. Relax, it's the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>,\" reads the video's caption.</p><p>All of the ‌iPhone 12‌ models feature Ceramic Shield OLED displays, which Apple says offers four times better drop protection than was available with prior ‌iPhone‌ models.</p><p>The Ceramic Shield material, which comes from Corning, is made by infusing nano-ceramic crystals into glass to improve durability. Though the Ceramic Shield seems to be <a href=\"https://www.macrumors.com/2020/10/26/iphone-12-drop-test-ceramic-shield/\">better able to withstand</a> drops than prior ‌iPhone‌ display technology, it is still <a href=\"https://www.macrumors.com/2020/10/28/iphone-12-ceramic-shield-test-jerryrigeverything/\">prone to scratching</a>.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/23/alleged-iphone-13-front-glass-photo/\">iPhone 13 Front Glass Reveals Smaller Notch With Earpiece Relocated to Top Bezel</a></h3><p>iPhone 13 models are widely expected to feature a smaller notch, and we are able to share a first look at the potential design. Greek repair provider iRepair has provided MacRumors with an alleged photo of front glass panels for iPhone 13 models, with the same three 5.4-inch, 6.1-inch, and 6.7-inch display sizes as the iPhone 12 lineup. The notch on each iPhone is visibly smaller as a result ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/22/apple-tvos-homepod-facetime-framework/\">Apple Adds FaceTime Framework to Apple TV/HomePod Amid Speaker With Screen Rumors</a></h3><p>Bloomberg's Mark Gurman today revealed that Apple has been developing new speakers that are equipped with \"screens and cameras,\" suggesting we could see a future HomePod-like device that has a built-in display and camera feature for FaceTiming and other functions. Ahead of these rumors, MacRumors contributor Steve Moser was combing through the tvOS 14.5 beta code and found that Apple has...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/23/intel-manufacture-apple-silicon-chips/\">After Anti-M1 Ads, Intel Wants to Make Future Apple Silicon Chips</a></h3><p>Tuesday March 23, 2021 3:30 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple in November started releasing Macs with Apple-designed M1 chips, and the Apple silicon technology will eventually replace all the Intel chips that Apple has used in its Mac lineup for years. Intel appears to be having a difficult time with Apple's transition. Last week, the company launched an anti-M1 Mac ad campaign starring Justin Long, and now, Intel is pinning its hopes on...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/22/apple-speakers-with-screens-and-cameras-report/\">Apple Developing New 'HomePod' Models With Screens and Cameras</a></h3><p>In a report today focused on an unactivated temperature/humidity sensor in the HomePod mini, Bloomberg's Mark Gurman briefly mentioned that Apple has \"been developing new speakers with screens and cameras.\" This reporting suggests that Apple could be at least exploring the idea of new HomePod models with a display and camera to compete with the likes of Google's Nest Hub Max, Amazon's Echo...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/23/apple-siri-remote-tvos-14-5-beta/\">Apple Removes 'Siri Remote' Mentions in tvOS 14.5 Beta, Changes 'Home' Button Name</a></h3><p>Tuesday March 23, 2021 12:40 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today released the fifth beta of tvOS 14.5, and there are some small but notable changes in the update found by MacRumors contributor Steve Moser. Apple is removing mentions of the \"Siri Remote\" and replacing them with \"Apple TV Remote\" across the operating system. The Siri Remote has always been the Apple TV Remote in countries where Siri functionality is not available on the Apple...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/22/apple-butterfly-keyboard-lawsuit-class-action/\">MacBook Owners' Butterfly Keyboard Lawsuit Against Apple Gets Class Action Certification</a></h3><p>Monday March 22, 2021 9:33 am PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple customers unhappy with the butterfly keyboards used in MacBook models from 2015 on will be able to proceed with a lawsuit against the Cupertino company, as the judge overseeing the case has given it class action status [PDF]. The suit covers anyone who purchased a MacBook with a butterfly keyboard in California, New York, Florida, Illinois, New Jersey, Washington, and Michigan. As...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/22/useful-iphone-accessories/\">Useful iPhone Accessories Worth Checking Out</a></h3><p>Monday March 22, 2021 8:01 am PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>MacRumors videographer Dan is regularly trying out new accessories for the iPhone, and in the latest MacRumors YouTube video, Dan highlights some of the latest iPhone accessories he’s been testing, many of which focus on iPhone photography and videography. There's a high-end microphone option, a new flash drive from SanDisk, mounts from Moment, and more. Subscribe to the MacRumors YouTube ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/22/apple-planning-to-discontinue-13-inch-macbook-pro/\">Apple Planning to Discontinue High-End 13-inch MacBook Pro</a></h3><p>Apple may discontinue the 13.3-inch high-end MacBook Pro, following rumors that the machine will be replaced with a redesigned 14-inch model later this year. While Apple appears to be committed to the 13.3-inch MacBook Pro for the time being as an entry-level model, having updated it with an M1 Apple silicon chip in November, the high-end 13.3-inch MacBook Pro has not been updated since May...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"29c7c9657e18c7f39a7ebca937b1bb6f7f99231c2882f77e279f384db3d4b35b","category":"Apple"}