{"title":"Volta a Catalunya underway, Paris-Roubaix uncertainty: Daily News","link":"https://cyclingtips.com/2021/03/volta-a-catalunya-underway-paris-roubaix-uncertainty-daily-news/","date":1616450143000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Andreas Kron wins stage 1 of the Volta a Catalunya.</h4><p></p><div><p>Hello again, CyclingTips readers,</p><p>As we get into a new week, the Volta a Catalunya has gotten underway, the Hitec Products team has a new name, and there continue to be question marks about whether Paris-Roubaix will go ahead this year.</p><p>Read on for the latest from the world of cycling.</p><p><em>Dane Cash<br>News Editor</em></p><h2>What’s news?</h2><h3>Kron wins Volta a Catalunya opener</h3><p><strong>Andreas Kron</strong> took his first WorldTour win on the opening stage of the <strong>Volta a Catalunya</strong> after jumping into a move that went clear inside the last 25 km of the day.</p><p>The WorldTour stage race kicked off with a 178.5 km stage that started and finished in Calella. A break formed in the early goings and worked its advantage up to over four minutes before the peloton started to bring the gap down as the road tilted upward on the uphill run-in to the second-category Port de les Guilleries. That ascent was followed by the Port de Santa Fe del Montseny, where the gap continued to fall and where several riders, including <strong>Chris Froome</strong>, lost touch with the pack.</p><p>The pack caught the last of the breakaway riders shortly after the climb, and from there, there was action at the front as riders tried to break clear. <strong>Luis Léon Sánchez</strong> spurred the move that would ultimately stick. He attacked with around 23 km to go and Kron, <strong>Lennard Kämna</strong>, and <strong>Rémy Rochas</strong> joined the move to make for a quartet off the front. The escapees held on over the Port de Collsacreu and descended into the finish together to battle for the win. In the final kick, Rochas launched first but Sánchez and Kron responded quickly, and Kron pipped Sánchez to get the victory at the line.</p><p><strong>Top 10, stage 1</strong></p><p>1 KRON Andreas (Lotto Soudal) 4:20:15<br>2 SÁNCHEZ Luis León (Astana – Premier Tech)<br>3 ROCHAS Rémy (Cofidis, Solutions Crédits)<br>4 KÄMNA Lennard (BORA – hansgrohe)<br>5 SMITH Dion (Team BikeExchange) 0:16<br>6 MOHORIC Matej (Bahrain – Victorious)<br>7 SCHELLING Ide (BORA – hansgrohe)<br>8 VALVERDE Alejandro (Movistar Team)<br>9 KAMP Alexander (Trek – Segafredo)<br>10 VALGREN Michael (EF Education – Nippo)</p><p><strong>Top 10, GC</strong></p><p>1 KRON Andreas (Lotto Soudal) 4:20:05<br>2 SÁNCHEZ Luis León (Astana – Premier Tech) 0:04<br>3 ROCHAS Rémy (Cofidis, Solutions Crédits) 0:06<br>4 KÄMNA Lennard (BORA – hansgrohe) 0:10<br>5 SMITH Dion (Team BikeExchange) 0:26<br>6 MOHORIC Matej (Bahrain – Victorious)<br>7 SCHELLING Ide (BORA – hansgrohe)<br>8 VALVERDE Alejandro (Movistar Team)<br>9 KAMP Alexander (Trek – Segafredo)<br>10 VALGREN Michael (EF Education – Nippo)</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Zdi-d0ntWiw\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></p><h3>Hirschi’s season start was delayed due to wisdom tooth, hip issues</h3><p><strong>Marc Hirschi</strong> made his 2021 racing debut at the <strong>Volta a Catalunya</strong> on Monday, and he explained to reporters that he had gotten his season underway a little later than planned due to a combination of factors.</p><p>“I was behind with my training plan as I had to have a wisdom tooth out and had problems with my hip,” Hirschi said, according to Cyclingnews.</p><p>Hirschi said that the Ardennes Classics continue to be a major objective, and that his “Ardennes campaign is not in danger.”</p><h3>Team Hitec Products becomes Coop-Hitec Products</h3><p>Women’s UCI squad <strong>Team Hitec Products</strong> announced on Monday that it has merged with men’s Continental squad <strong>Team Coop</strong>. The women’s team will now be known as Team Coop-Hitec Products.</p><p>“We are very happy to have a solid partner like Coop with us,” said <strong>Karl Lima</strong>, Coop-Hitec Products team manager. “The cycling team Team Coop has shown a continuity and enthusiasm for cycling over many years which is admirable. Coop thinks long-term and big, and together we can build a strong constellation. We will continue to be the platform for the best Norwegian female cyclists, combined with international stars.”</p><h3>Paris-Roubaix uncertainty continues</h3><p>There continues to be uncertainty around whether <strong>Paris-Roubaix</strong> will go ahead this year due to the coronavirus situation in France. In an interview with the French news channel France Bleu, <strong>Michel Lalande</strong>, the prefect of the Hauts-de-France region where Roubaix and most of the course of Paris-Roubaix is located, said he felt the skies were “less blue” when it came to Paris-Roubaix.</p><p>Lalande was asked by the interviewer if Paris-Roubaix could take place like races in Belgium, and he responded by saying, “I’ll give you an answer when the time is right, but you can guess it. The sky is less blue.” When asked how it was possible that Belgium did organize races, he said, “They will have to explain how it works with the barriers.” Region Hauts-de-France entered a new 4-week lockdown last Friday with a curfew and movement restrictions keeping people within 10 km of their houses.</p><h3>Calmejane out for three weeks after breaking metatarsal</h3><p><strong>AG2R Citroën</strong> said on Monday that <strong>Lilian Calmejane</strong> will miss three weeks after breaking the fifth metatarsal in his right foot in what the team said was “an accident at home.”</p><p>Calmejane had already spent time off the bike this season after suffering a concussion in a crash at the Tour de la Provence.</p><h3>Redlands Classic cancelled for 2021</h3><p>Organizers announced on Monday that the <strong>Redlands Classic</strong> would not be held this year.</p><p>“Our organization committee has been working diligently to determine the best path forward for 2021,” read a Tweet from the event’s Twitter account. “We have decided to cancel the race for 2021, focusing on creating an amazing race in April 2022, with all the elements people have come to love.”</p><h2>Coming up …</h2><p>The Volta a Catalunya continues on Tuesday with an 18.5 km time trial that will start and finish in Banyoles. Riders to watch include Rohan Dennis, Rémi Cavagna, João Almeida, Geraint Thomas, Brandon McNulty, Richie Porte, and Wilco Kelderman. Meanwhile, the Settimana Internazionale Coppi e Bartali will get underway in Italy. Tuesday’s stage 1a will traverse 97.8 km with a few trips up the Longiano climb in the second half of the stage, while stage 1b is a 14 km team time trial.</p><h2>In case you missed it …</h2><ul><li><a href=\"https://cyclingtips.com/2021/03/gallery-a-classic-crescendo-at-the-2021-milan-san-remo/\" target=\"_blank\" rel=\"noreferrer noopener\">Photos from Kristof Ramon and Cor Vos</a> tell the story of another great edition of <strong>Milan-San Remo</strong>.</li><li>As James Huang writes, <strong>Garmin’s</strong> new <strong>Rally</strong> power meter pedal family <a href=\"https://cyclingtips.com/2021/03/new-garmin-rally-power-meter-pedal-family-to-include-spd-sl-and-spd-models/\" target=\"_blank\" rel=\"noreferrer noopener\">will include both SPD and SPD-SL models</a>.</li><li>As Iain Treloar writes, <strong>Shimano</strong> has unveiled an <a href=\"https://cyclingtips.com/2021/03/shimano-unveils-ultra-limited-centennial-product/\" target=\"_blank\" rel=\"noreferrer noopener\">ultra-limited coffee-table book</a>.</li></ul><div><h5>Tags</h5></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"29d8498fcb05c308f59c20f7f45525b07f994174c4b576276e656e10bc9e8236","category":"Cycling"}