{"title":"Pogacar wins Tirreno-Adriatico as Van Aert takes stage 7: Daily News","link":"https://cyclingtips.com/2021/03/pogacar-wins-tirreno-adriatico-as-van-aert-takes-stage-7-daily-news/","date":1615922494000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Runner-up Wout van Aert, race winner Tadej Pogacar, and third-placed Mikel Landa on the GC podium at Tirreno-Adriatico.</h4><p></p><div><p>Hello again, CyclingTips readers,</p><p>Tirreno-Adriatico reached its conclusion on Tuesday with an individual time trial, where Wout van Aert nabbed another big stage win while Tadej Pogacar secured the overall title.</p><p>Read on for the latest from the world of cycling.</p><p><em>Dane Cash<br>News Editor</em></p><h2>What’s news?</h2><h3>Pogacar wins Tirreno-Adriatico as Van Aert wins the final stage</h3><p><strong>Tadej Pogacar</strong> sealed his overall victory at <strong>Tirreno-Adriatico</strong> on Tuesday as <strong>Wout van Aert</strong> stormed to his second stage victory of the race.</p><p>The seven-day race concluded with a 10.1 km time trial in San Benedetto del Tronto. Early occupants of the hot seat included <strong>Edoardo Affini</strong>, <strong>Sebastian Langeveld</strong>, and <strong>Michael Hepburn</strong> before <strong>Alberto Bettiol</strong> took over the provisional lead with a time of 11:24. <strong>Stefan Küng</strong>, however, would power through the course to set the fastest times at both the intermediate time check and the finish. The attention turned to pre-race favorite <strong>Filippo Ganna</strong> after Küng finished his ride, but the world time trial champ was just a bit slower at the first intermediate and ultimately came up five seconds short of besting Küng, who then spent more than an hour in the hot seat.</p><p>Van Aert, however, would not be denied on the short, fast course. The penultimate rider on the road, Van Aert started the day 1:15 back on Pogacar in the GC battle. Recovering that much time would be far too tall an order, but the Belgian time trial champ did put in a stellar performance to top Küng’s time by six seconds and take the stage win, his second of the race after he sprinted to victory in the opening stage. Pogacar finished a strong fourth on the day to wrap up the victory.</p><p>The reigning Tour de France champ stood atop the final standings with a margin of 1:03 to runner-up Van Aert, with <strong>Mikel Landa</strong> holding off <strong>Egan Bernal</strong> to nab the final podium spot, 3:57 down on Pogacar.</p><p><strong>Top 10, stage 7</strong></p><p>1 VAN AERT Wout (Team Jumbo-Visma) 0:11:06<br>2 KÜNG Stefan (Groupama – FDJ) 0:06<br>3 GANNA Filippo (INEOS Grenadiers) 0:11<br>4 POGACAR Tadej (UAE-Team Emirates) 0:12<br>5 THOMAS Benjamin (Groupama – FDJ) 0:16<br>6 BETTIOL Alberto (EF Education – Nippo) 0:18<br>7 ALMEIDA João (Deceuninck – Quick Step) 0:24<br>8 ASGREEN Kasper (Deceuninck – Quick Step) 0:26<br>9 HEPBURN Michael (Team BikeExchange) 0:27<br>10 LUDVIGSSON Tobias (Groupama – FDJ) 0:28</p><p><strong>Top 10, GC</strong></p><p>1 POGACAR Tadej (UAE-Team Emirates) 26:36:17<br>2 VAN AERT Wout (Team Jumbo-Visma) 1:03<br>3 LANDA Mikel (Bahrain – Victorious) 3:57<br>4 BERNAL Egan (INEOS Grenadiers) 4:13<br>5 FABBRO Matteo (BORA – hansgrohe) 4:37<br>6 ALMEIDA João (Deceuninck – Quick Step) 4:54<br>7 WELLENS Tim (Lotto Soudal) 5:00<br>8 BARDET Romain (Team DSM) 5:50<br>9 NIBALI Vincenzo (Trek – Segafredo) 6:30<br>10 YATES Simon (Team BikeExchange) 7:45</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/sV_swVXyxJU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></p><h3>Pinot is still dealing with back pain</h3><p>As <a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Article/Malgre-ses-problemes-de-dos-sur-le-tirreno-thibaut-pinot-groupama-fdj-garde-le-moral/1232921\" target=\"_blank\" rel=\"noreferrer noopener\">L’Equipe</a> reports, <strong>Thibaut Pinot</strong> is continuing to experience back issues. The 30-year-old Frenchman has been dealing with back pain since last year.</p><p>“He has good legs, but he is still a little blocked in the lumbar vertebrae, he still feels discomfort in the lower back,” <strong>Groupama-FDJ</strong> sport director Sébastien Joly told L’Equipe.</p><p>Pinot is set for further medical evaluations to try to solve the problem following <strong>Tirreno-Adriatico</strong>. Further down the road this season, he is hoping to contend at the <strong>Giro d’Italia</strong>.</p><h3>Bora-Hansgrohe confirms that Sagan will race Catalunya as prep for his Classics goals</h3><p>After the <strong>Volta a Catalunya</strong> announced on Monday that <strong>Peter Sagan</strong> would be making his debut there later this month, Bora<strong>-Hansgrohe</strong> confirmed to CyclingTips that Sagan would indeed be missing <strong>E3</strong> and <strong>Gent-Wevelgem</strong>.</p><p>Sagan’s early-season training process was interrupted by a bout with COVID-19, and a Bora-Hansgrohe representative said that the team sees the Volta a Catalunya as better prep for the Tour of Flanders and Paris-Roubaix considering his current fitness level.</p><h2>Coming Up …</h2><p>Wednesday will see cobbled racing in Belgium at Nokere Koerse. The women’s peloton will cover 120 km from Deinze to Kruisem while the men will traverse 195 km from Deinze to Nokere. With cobbles and some up-and-down on the menu, the race should offer some intrigue.</p><h2>In case you missed it …</h2><p>As James Huang writes, <strong>Canyon</strong> has <a href=\"https://cyclingtips.com/2021/03/canyon-launches-in-canada/\" target=\"_blank\" rel=\"noreferrer noopener\">entered the Canadian market</a>.</p><div><h5>Tags</h5></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"2a026648019ed578d18252d1645fc8167ea9ce66f4c88e4f895c6e56644f786d","category":"Cycling"}