{"title":"Primož Roglič takes an emphatic third consecutive Vuelta victory","link":"https://cyclingtips.com/2021/09/primoz-roglic-takes-an-emphatic-third-consecutive-vuelta-victory/","date":1630867115000,"content":"<div><div><p>Primož Roglič won the stage 21 time trial to Santiago de Compostela, taking his fourth victory of the 2021 Vuelta a España and sealing his third consecutive overall title.</p><p>Three weeks after starting at the cathedral in Burgos, the Vuelta came to a close at the Catedral de Santiago de Compostela, the traditional culmination of the Camino de Santiago pilgrimage route. To complete their own 21-stage pilgrimage, the peloton faced a lumpy 33.8 km individual time trial that would suit specialists in the discipline.</p><p>First off the ramp in Padrón was Czech national champion Josef Černy (Deceuninck-QuickStep) who was expected to set a solid benchmark for the day. His stint in the hot seat was not as long as he might have hoped however, as Magnus Cort (EF Education-Nippo) took over a minute out of his time just an hour later.</p><p>As the evening wore on, it was clear that the only man who could possibly challenge Cort’s time was Roglič, and sure enough, the race leader came through the first time check 20 seconds faster than the Dane. A momentary loss of concentration almost cost him dearly before the last uphill drag, but the Olympic champion held on to win by 13 seconds. Cort settled for the runner-up spot – and would visit the podium to collect the overall combatively award – and Thymen Arensmen (Team DSM) finished third.</p><div><div><p>La Vuelta ciclista a España (2.UWT) <span>Padrón → Santiago de Compostela</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/cc/primoz-roglic-2021-n2.jpeg\"></p></div></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"2a20f4e7d9007ae795305224e33bce4a3552d0a0a3189f81c24a52708f3fa831","category":"Cycling"}