{"title":"Preview: What you need to know about stage 11 of the 2021 Tour de France","link":"https://cyclingtips.com/2021/07/preview-what-you-need-to-know-about-stage-11-of-the-2021-tour-de-france/","date":1625619140000,"content":"<div><div><p><strong>Date: </strong>Wednesday July 7<br><strong>Start: </strong>Sorgues<br><strong>Finish: </strong>Malaucène<br><strong>Distance: </strong>199 km</p><p>What’s better than one ascent of Mont Ventoux? Two times Ventoux! After two early fourth-category climbs and a first-category climb, the riders will tackle the ‘Giant of Provence’ via two different approaches.</p><p>The first (Cat 1) is from the easier Sault side that’s rarely used in the Tour (22 km at 5.1%), while the second (HC) is the regular approach from Bédoin (15.7 km at 8.8%). This ascent meets the Sault ascent near Chalet Reynard, meaning we get to see the riders tackle the mythical moonscape near the summit on two occasions.</p><p>This isn’t an uphill finish though – after conquering Ventoux for the second time (there are bonus seconds at the top), the riders face the 22 km descent to the finish in Malaucène.</p><p><strong>What to watch for:</strong> Something always happens on the legendary Mont Ventoux. Chris Froome blowing away Nairo Quintana in 2013, Froome running up the mountain on a wind-shortened stage in 2016. What will happen this year? That final descent could play a role …</p><p><strong>Who’s it for:</strong> The elite climbers. Even if a breakaway wins the day, this stage will have significant ramifications for the overall.</p><p><strong>Dane Cash’s picks: </strong><em>It’s tough to predict whether this stage will go to the break or the GC riders. If the pack is motivated, it will be tough for the escapees to stay clear, but it seems unlikely that the race leader’s team will do all that much to reel in the move unless someone very dangerous gets a big gap. Should the break stay clear, Michael Woods, Nairo Quintana, Wout Poels, and Simon Yates seem like good bets to battle for the stage win. If it comes down to the yellow jersey group, it’s hard to see past Tadej Pogačar, although with that big lead he won’t have as much incentive to chase down attacks from his rivals as he might if this were a closer race, so watch out for Richard Carapaz and Rigoberto Urán.</em></p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/TDF21_PROFILS-ETAPES-SANS-RAVITO_ETP11-1340x811.jpeg\"></figure><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/TDF21_ET11_carte-1340x1895.jpeg\"></figure></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"2a49c656afb5da75265f5184f84d100a1a33611a56c42bf7a7409e3d793eb644","category":"Cycling"}