{"title":"Boardman ADV 9.0 gravel bike review","link":"https://www.cyclist.co.uk/boardman/9158/boardman-adv-90-gravel-bike-review","date":1611655853000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Hooning around trail centres or local field paths, tyres weighed down by mud, clogging the front mech and what remaining clearance there is between tyres and frame is all well and good, but it’s at the extreme of what <a href=\"https://www.cyclist.co.uk/cyclocross-gravel-and-adventure\">gravel/adventure bikes</a> are capable of, or designed for.</p><p>The Boardman ADV 9.0 strikes a very respectable balance between expectation and reality, being suited not only to an awful lot of road riding, but also to an equal amount of time spent exploring the nation’s bridleways and fire roads, preferably as far away from any other human as possible…</p>&nbsp;<h3>In the frame</h3><p>Where the Boardman ADV 9.0 differs to many adventure bikes is in its relatively lightweight carbon frame. The C10 carbon composite chassis allows for an all-up weight of 9.24kg for a size small ADV 9.0, which, while far from featherweight in the world of road bikes, is light enough for rolling along on rough roads and gravel paths, especially when loaded up with luggage.</p><p>A 71° head angle means the steering is relaxed, but countering this with a 80mm alloy stem gives some immediacy to cornering input.</p><p>A 73° seat angle and 535mm top tube allow for in-the-saddle climbing on rough surfaces with hands flat on the bar tops. And when the going gets gravity-assisted, a 6° flare to the drops of the alloy handlebars gives you a little more leverage for more technical descents off-road.</p><p>Not to mention a little more elbow width for commuter road presence.</p>&nbsp;<h3>Comfortably appointed</h3><p>The bow-curved seatstays of the Boardman ADV 9.0 are visually unappealing, but they’re there to do a job, not look good. Their design allows the frame to soak up a fair amount of vibration on the road, and to take some buzz out of lengthy periods on hard-packed off-road paths.</p><p><a href=\"https://www.halfords.com/bikes/road-bikes/boardman-adv-9.0-mens-road-bike-2021---s-m-l-xl-frames-426982.html\" target=\"_blank\"><em><strong>Buy the Boardman ADV 9.0 from Halfords now</strong></em></a></p>&nbsp;<p>Aiding them in this mission for comfort is a 27.2mm alloy Boardman seatpost, a particularly flexible and well padded Prologo Akero AGX saddle, and – more importantly – Panaracer Gravel King tyres wrapped around own-brand Boardman ADV alloy rims.</p>&nbsp;<h3>We have contact</h3><p>Those Panaracer tyres are one of the trump cards held by the Boardman ADV 9.0. The centre of the tyre features tread more tightly packed, in order to give the best possible rolling experience on smoother surfaces, while the knobbles on the shoulders of the Gravel King tyres stand more proud of the casing, and are more widely spread in order to grip when you need it on loose off-piste surfaces.</p><p><a href=\"https://www.halfords.com/bikes/road-bikes/boardman-adv-9.0-mens-road-bike-2021---s-m-l-xl-frames-426982.html\" target=\"_blank\"><em><strong>Buy the Boardman ADV 9.0 from Halfords now</strong></em></a></p>&nbsp;<p>Riding the bike on Fenland ditch-side paths, sweeping turns are pedalled through with confidence, while tighter turns are also dispatched with just a touch of brake on the approach.</p><p>A bottom bracket drop of 73mm leaves room to pedal through most corners without any fear of decking out pedals or toes. Speaking of wriggle room, the widely splayed chainstays, seatstays and spaced-away-from-the-frame front derailleur create clearance for even wider tyres, if you find the 38c Panaracers are holding you back, or you need more comfort from an even higher volume/lower pressure tyre.</p>&nbsp;<p>The Boardman ADV 9.0 will accommodate 42c knobblies, for those with loftier ambitions than a day out on local byways.</p><h3>Gearing up to be a good one</h3><p>The speed with which progress is made on the Boardman ADV 9.0 is amplified by the fitment of a 46-30 Shimano GRX chainset – it’s a decent compromise of ratios for both tarmac and gravel.</p><p><a href=\"https://www.halfords.com/bikes/road-bikes/boardman-adv-9.0-mens-road-bike-2021---s-m-l-xl-frames-426982.html\" target=\"_blank\"><em><strong>Buy the Boardman ADV 9.0 from Halfords now</strong></em></a></p><p>The Japanese firm’s gravel-specific groupset is used across the bike (with the exception of a Shimano 105 cassette), and it all gels well.</p>&nbsp;<p>GRX shifters accurately select each of the 11 cogs between the 11 and 32-tooth sprocket, and believe me – you don’t need anything easier than a smallest gear of 30-32.</p><p>If you’re using a 46-11 on any off-road descents, you’re a braver rider than me, but for road use, you don’t feel like you’re held back by the gearing.</p>&nbsp;<p>If you do happen to find yourself careering downhill with unreasonable rapidity, the hydraulic brakes, each operating 160mm Shimano rotors, bite with tender immediacy. There are no surprises, even in the wet.</p><p><a href=\"https://www.halfords.com/bikes/road-bikes/boardman-adv-9.0-mens-road-bike-2021---s-m-l-xl-frames-426982.html\" target=\"_blank\"><em><strong>Buy the Boardman ADV 9.0 from Halfords now</strong></em></a></p><h3>Go big, then go home</h3><p>Selling the spirit of adventure in the midst of a pandemic-induced stay at home order puts bike firms on a rather sticky wicket. That said, there are adventures to be had <a href=\"https://www.cyclist.co.uk/in-depth/8696/best-gravel-routes-in-london-heading-off-road-in-the-capital\">right from our doorsteps</a>, and this is where cycling becomes near-essential activity.</p><p>When ‘stay local’ is the order of the day, a quick scouting session on Komoot, <a href=\"https://www.cyclist.co.uk/tags/strava\">Strava</a> or OS Maps gives you enough to go on to plan a few hours of release.</p><p>There are multitudinous mounts on and below the top tube and down tube of the Boardman ADV 9.0 to accommodate frame bags and bottles. And neatly hidden mudguard mounts in the frame.</p>&nbsp;<p>For now, we might just be packing a picnic in a backpack, but – for me – the world needs adventure bikes now more than ever.</p><p>Pick a spot, ride there without seeing anyone else, ride home. Beaming smile guaranteed, from the jointly restorative power of exercise and exploration. This is a bike that’s straining at the leash for a weekend away, but for now it’ll simply make your day.</p><h3>Spec</h3><table><tbody><tr><td>Frame</td><td>Boardman C10 carbon frame and fork</td></tr><tr><td>Groupset</td><td>Shimano GRX RX600</td></tr><tr><td>Brakes</td><td>Shimano GRX RX400, hydraulic discs, 160mm rotors</td></tr><tr><td>Chainset</td><td>Shimano GRX RX600, 46-30</td></tr><tr><td>Cassette</td><td>Shimano 105, 11-32</td></tr><tr><td>Bars</td><td>Boardman, alloy, 31.8mm</td></tr><tr><td>Stem</td><td>Boardman, alloy</td></tr><tr><td>Seatpost</td><td>Boardman, alloy, 27.2mm</td></tr><tr><td>Saddle</td><td>Prologo Akero AGX</td></tr><tr><td>Wheels</td><td>Boardman ADV, tubeless-ready</td></tr><tr><td>Tyres</td><td>Panaracer Gravel King tyres, 700 x 38c</td></tr><tr><td>Weight</td><td>9.24kg (size S)</td></tr><tr><td>Contact</td><td>boardmanbikes.com</td></tr></tbody></table><p><a href=\"https://www.cyclist.co.uk/cyclist-reviews-policy\" target=\"_blank\"><em>All reviews are fully independent and no payments have been made by companies featured in reviews</em></a></p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"2aa0ba7a2e34a25de3bc2bb1346ee833e82a2ad8aa7054a4fcf8d5d9989eb9d8","category":"Cycling"}