{"title":"Rocket Report: Cornwall says “LOL, no” to space tourism, Korean rocket on track","link":"https://arstechnica.com/?p=1745368","date":1614340842000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Ready to fly —</h4><h2 itemprop=\"description\">\"If we were to entertain this it would be quite ridiculous.\"</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/08/newglenn-launch-800x616.png\" alt=\"We won't be seeing New Glenn take flight for nearly two years, at least.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/08/newglenn-launch.png\" data-height=\"899\" data-width=\"1168\">Enlarge</a> <span>/</span> We won't be seeing New Glenn take flight for nearly two years, at least.</p></figcaption></figure><p>Welcome to Edition 3.34 of the Rocket Report! I apologize for the <a href=\"https://arstechnica.com/science/2021/02/even-power-disasters-are-bigger-in-texas-heres-why/\">unplanned hiatus</a> last week. The Rocket Report's Houston-based author lacked power until Wednesday night amidst a massive winter storm and had no reliable Internet until Friday afternoon. We still had no hot water at our house, but at least we're no longer freezing. We're back just in time to spew all manner of spicy launch news this week.</p><p>As always, Ars <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcomes reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" width=\"560\" height=\"81\"></figure><p><strong>KSLV-2 rocket on track for 2022 launch</strong>. As part of its budget for 2021 space activities, South Korea will spend $553 million for satellites, rockets, and other equipment. <a href=\"https://spacenews.com/south-korea-to-spend-553-million-on-space-projects-in-2021/\" target=\"_blank\" rel=\"noopener\">SpaceNews reports</a> this funding will keep the country's development of its natively build KSLV-2 rocket, nicknamed Nuri, on schedule for a launch next year.</p><p><em>Testing going well</em> ... Boasting four 75-ton liquid engines in its first-stage booster, the three-stage rocket is meant to carry a 1.5-ton satellite into low Earth orbit. The second stage has a single 75-ton engine, and the third stage has a 7-ton engine. A second round of combustion tests on the KSLV-2's first-stage engines were conducted on Thursday, and the Korea Aerospace Research Institute said the 101-second test revealed no apparent problems with the engines' durability. (submitted by Ken the Bin).</p><p><strong>Firefly nabs launch contract</strong>. General Atomics said it has selected Firefly Aerospace to launch a small Earth-science satellite for NASA on an Alpha rocket in 2022. The company plans to launch its Orbital Test Bed 2 satellite on Firefly's Alpha rocket from Vandenberg Air Force Base in California, <a href=\"https://spacenews.com/general-atomics-selects-firefly-to-launch-nasa-earth-science-instrument/\" target=\"_blank\" rel=\"noopener\">SpaceNews reports</a>.</p><p><em>Terms of the contract were not disclosed</em> ... OTB-2 will carry a NASA instrument, the Multi-Angle Imager for Aerosols, intended to study particulate-matter air pollution in urban areas and help scientists understand its effects on human health. The spacecraft will operate in a polar orbit at an altitude of 740km. The Alpha rocket is due to debut later this spring. (submitted by platykurtic and Ken the Bin)</p><div data-list-id=\"248910\"><p>The easiest way to keep up with Eric Berger's space reporting is to sign up for his newsletter, we'll collect his stories in your inbox.</p></div><p><strong>Virgin Galactic delays next flight to May</strong>. Monday marked the second anniversary of the last powered flight above 80km (that flight was carried out by VSS<em> Unity</em> on February 22, 2019). On Thursday, <a href=\"https://investors.virgingalactic.com/news/news-details/2021/Virgin-Galactic-Announces-Fourth-Quarter-and-Full-Year-2020-Financial-Results/default.aspx\">Virgin announced</a> its fourth-quarter and full-year 2020 financial results. The company had net losses of $74 million, with no revenue, and retains $666 million in cash and cash equivalents on hand. It also finally released a timeline for its next powered spaceflight.</p><p><em>More checks required</em> ... The company had been expected to attempt a powered flight sometime this month, but its financial report states that this has now been delayed. The program will \"continue to prepare for [its] next rocket-powered spaceflight from Spaceport America, targeted for May 2021,\" the company said, \"completing modifications and conducting technical checks ahead of flight.\" This increases the likelihood that commercial flights for space tourists will not begin until 2022, at the earliest.</p><p><strong>Washington-based startup raises $9.1 million</strong>. Stoke Space Technologies—the Renton, Washington-based company founded by veterans of Jeff Bezos' Blue Origin space venture—has attracted $9.1 million in seed investments for extending rocket reusability to new frontiers, <a href=\"https://www.geekwire.com/2021/stoke-space-raises-9-1-million-create-new-breed-reusable-upper-stage-rockets/\" target=\"_blank\" rel=\"noopener\">GeekWire reports</a>. The first goal will be to develop a new kind of reusable upper stage, Stoke co-founder and CEO Andy Lapsa told the publication.</p><p><em>High-powered advisers</em> ... \"That's the last domino to fall in the industry before reusability is commonplace,\" Lapsa said. \"Even right now, I think space launch is in a production-limited paradigm.\" Retired Air Force Lt. Gen. Steven Kwast, an adviser to Stoke, goes so far as to say that the team reminds him of the Wright brothers. \"Stoke has the right idea about ultra-low-cost access to space, and similar to the first manned flight, will change the world of transportation and national security forever,\" he said. (submitted by Ken the Bin)</p><p><strong>Cornwall Spaceport not interested in tourism</strong>. Virgin Orbit is already a partner with Spaceport Cornwall, a horizontal launch facility in southwestern England. In recent days, some media reports have suggested that Virgin Galactic might become a tenant as well, offering customers short suborbital flights. However, at a meeting of the Cornwall Council this week, leader Julian German said there were no plans for space tourism, <a href=\"https://www.falmouthpacket.co.uk/news/19115257.spaceport-cornwall-richard-bransons-virgin-told-no-tourism/\" target=\"_blank\" rel=\"noopener\">the Falmouth Packet reports</a>.</p><p><em>If we're being blunt about it </em>... One council member, John Fitter, was more explicit, saying, \"If we were to entertain this, it would be quite ridiculous and send out the wrong message to those people in Cornwall who could possibly be suffering on below the minimum wage and in poverty and allow people who have got vast millions of pounds to spend to up to space for half an hour and come back down again.\" Another member called it an \"absolute waste of money.\"</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/mediuml.png\" width=\"560\" height=\"81\"></figure><p><strong>Falcon 9 mishap blamed on \"heat damage.\"</strong> A Falcon 9 first stage failed to land after its most recent launch on February 15 because of \"heat damage\" it sustained, <a href=\"https://spacenews.com/spacex-blames-failed-falcon-9-booster-landing-on-heat-damage/\" target=\"_blank\" rel=\"noopener\">SpaceNews reports</a>. \"This has to do with heat damage, but it's a running investigation,\" said Hans Koenigsmann, a senior advisor for SpaceX. He added that SpaceX was \"close to nailing it down\" and correcting the problem. \"That's all I can say at this point in time.\"</p><p><em>The mission was a success, however</em> ... Koenigsmann made his comments during a session of the 47th Spaceport Summit this week. He said he's still confident that SpaceX will be able to fly each of its Falcon 9 cores at least 10 times. He also noted that the primary mission of the launch—deployment of Starlink satellites—was a success. Another Starlink mission is scheduled for this coming Sunday. (submitted by platykurtic and Ken the Bin)</p><p><strong>Turkey plans Somalia-based launch site</strong>. As part of a space program announced by the nation, Turkey plans to build a launch site in Somalia. The African country lies along the equator, and spacecraft would launch eastward from it over the Indian Ocean. <a href=\"https://africanews.space/turkey-to-build-a-rocket-launch-site-in-somalia-to-support-its-usd-1-billion-moon-mission/\" target=\"_blank\" rel=\"noopener\">African News reports</a> that Somalia has been a key security partner to Turkey for the last decade and that this is an extension of that partnership.</p><p><em>Will X mark the spot?</em> ... Turkey appears to be targeting an initial launch by 2023, building a rocket in concert with international partners. Ultimately the country seeks to make a soft landing on the Moon by 2028. It is not clear whether these plans would involve SpaceX, whose founder, Elon Musk, and Turkey's leaders <a href=\"https://www.hurriyetdailynews.com/turkey-elon-musks-spacex-mull-new-space-projects-162021\" target=\"_blank\" rel=\"noopener\">have discussed</a> joint space projects.</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/heavyl.png\" width=\"560\" height=\"81\"></figure><p><strong>Blue Origin sets launch date for New Glenn</strong>. In a Thursday update on its website, Blue Origin said it planned to debut its large New Glenn rocket in the fourth quarter of 2022. \"As major progress is being made on the New Glenn launch vehicle and its Cape Canaveral facilities, the schedule has been refined to match the demand of Blue Origin's commercial customers,\" <a href=\"https://www.blueorigin.com/news/new-glenns-progress-towards-maiden-flight\" target=\"_blank\" rel=\"noopener\">the company said</a>. This is a delay from a previously announced timeline, but it's not unexpected.</p><p><em>No military contracts yet</em> ... The recent decision by the US Space Force to not select New Glenn as one of two providers for National Security Space Launch Phase 2 Launch Services Procurement was a setback. Also, the company has more immediate issues to resolve: completing the BE-4 engine for United Launch Alliance, competing for Human Landing System contracts and, hopefully, launching humans on New Shepard later this year. Our advice is to not expect a launch before 2023, but when the huge rocket does fly, it will be a sight to behold. (submitted by Unrulycow and Ken the Bin)</p><p><strong>Green Run hot fire test delayed</strong>. NASA said this week it would delay the second hot fire test of its Space Launch System rocket. The test firing was due to occur on February 25. \"During checkout preparations over the weekend, engineers determined that one of eight valves (a type of valve called a prevalve) was not working properly. This valve is part of the core-stage main propulsion system that supplies liquid oxygen to an RS-25 engine,\" <a href=\"https://blogs.nasa.gov/artemis/2021/02/22/green-run-update-nasa-investigating-valve-performance-before-second-hot-fire/\" target=\"_blank\" rel=\"noopener\">the agency noted</a>.</p><p><em>Test needs to run for at least four minutes</em> ... NASA and core-stage lead contractor Boeing will identify a path forward in the days ahead and reschedule the hot fire test. (Chris Bergin, <a href=\"https://twitter.com/NASASpaceflight/status/1365050738439843844\">of NASASpaceflight.com</a>, suggests the hot fire test will now occur no earlier than March 16). The first hot fire test took place in January, but it was cut short after 67.1 seconds due to a pressure reading going outside of preset boundaries. The core stage has now been installed on the test stand at Stennis Space Center, in Mississippi, for more than 13 months. (submitted by Ken the Bin)</p><p><strong>SLS launch delayed until 2022</strong>. During a recent call with reporters about the SLS core stage Green Run test, NASA's Tom Whitmeyer discussed the schedule for the Artemis I flight. In an ideal world in which nothing went wrong, he said, the mission could launch in October 2021. That was unlikely to happen, he acknowledged. And since then, things have already gone wrong, such as with the prevalve issue in the item above.</p><p><em>Never tweet while drunk</em> ... Sources have told Ars that the realistic \"no earlier than\" date for Artemis I inside NASA is now February 2022, and this presumes a successful Green Run hot fire test in early March. We're getting perilously close to the now somewhat infamous prediction I made in 2017 <a href=\"https://twitter.com/SciGuySpace/status/937873404685844481\" target=\"_blank\" rel=\"noopener\">on Twitter</a>—that the rocket would first launch in 2023.</p><p><strong>China formally moves ahead with Long March 9</strong>. China has officially approved the development of a super-heavy lift rocket named the Long March 9, or CZ-9 vehicle. The decision was revealed on Wednesday by Chinese state television. China National Space Agency, Wu Yanhua, said the main purpose of the new rocket is for any \"crewed lunar landing or crewed Mars landing missions\" the country may undertake, <a href=\"https://arstechnica.com/science/2021/02/china-officially-plans-to-move-ahead-with-super-heavy-long-march-9-rocket/\" target=\"_blank\" rel=\"noopener\">Ars reports</a>.</p><p><em>More powerful than Block 2 of the SLS</em> ... The country will target the year 2030 for a debut launch, consistent with previous timeline estimates. The rocket is planned to have a lift capacity of 140 metric tons, with the capability of sending 50 or more tons into lunar orbit. It would be an immense vehicle, with a 10-meter diameter core and 5-meter side boosters. China would also like to eventually make the rocket (or at least part of it) reusable.</p><h2>Next three launches</h2><p><strong>Feb. 28</strong>: PSLV | Amazonia 1, Anand &amp; SDsat | Satish Dhawan Space Center | 04:53 UTC</p><p><strong>Feb. 28</strong>: Soyuz 2.1b | Arktika-M 1 satellite | Baikonur Cosmodrome | 07:00 UTC</p><p><strong>March 1</strong>: Falcon 9 | Starlink-17 | Kennedy Space Center, Florida | 01:37 UTC</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/rocket.png\" width=\"120\" height=\"120\"></figure></div></div></div>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2d7a0c420e6496443edb0261edfd532c5cf6bbc71b4262e4dcc57dc60682354f","category":"Tech"}