{"title":"AT&T promises fiber-to-the-home expansion in 90 metro areas this year","link":"https://arstechnica.com/?p=1749297","date":1615583403000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>AT&amp;T fiber expansion —</h4><h2 itemprop=\"description\">Tens of millions in AT&amp;T territory lack fiber—3 million should get it in 2021.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/att-fiber-pole-800x479.jpg\" alt=\"AT&amp;T technician working with cables on a utility pole.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/att-fiber-pole.jpg\" data-height=\"1436\" data-width=\"2400\">Enlarge</a> <span>/</span> An AT&amp;T technician working on a fiber project.</p></figcaption></figure><p>AT&amp;T today <a href=\"https://about.att.com/story/2021/att_analyst_day.html\">said</a> it will bring fiber Internet to a few million more homes and businesses by the end of this year.&nbsp;\"In 2021, AT&amp;T plans to increase its fiber footprint by an additional 3 million customer locations across more than 90 metro areas,\" AT&amp;T said. This would raise AT&amp;T's fiber deployment to about 18 million homes and businesses.</p><p>AT&amp;T provided a list of the <a href=\"https://about.att.com/ecms/dam/snrdocs/fiber/ATTFiberBuild_8.5x11_03042021.jpg\">90 metro areas here</a>. The vast majority of them already have AT&amp;T fiber access, as seen in this <a href=\"https://www.att.com/shop/internet/gigapower/coverage-map.html\" rel=\"nofollow\">AT&amp;T fiber map</a>.</p><p>This likely means the 3 million new locations will primarily consist of homes and businesses close to AT&amp;T's existing fiber installations instead of homes and businesses in entirely unserved areas. We asked AT&amp;T for more details on the planned fiber deployment and will update this article if we get more information.</p><p>The fiber announcement is a bit of a turnabout <a href=\"https://arstechnica.com/tech-policy/2019/06/att-cuts-another-1800-jobs-as-it-finishes-fiber-internet-buildout/\">from mid-2019</a>, when an AT&amp;T executive said, \"We'll continue to invest in fiber, but we'll do it based on the incremental, economic case. We're not running to any household target.\"</p><h2>Most of AT&amp;T territory still lacks fiber</h2><p>While 3 million locations is a substantial buildout, there are tens of millions of homes without fiber in AT&amp;T's 21-state wireline service area. There were 52.97 million households in AT&amp;T's home-Internet service area and 14.93 million of them had fiber-to-the-home access, the Communications Workers of America (CWA) union told Ars in October 2020 when <a href=\"https://arstechnica.com/tech-policy/2020/10/life-in-atts-slow-lane-millions-left-without-fiber-as-company-kills-dsl/\">AT&amp;T announced</a> the discontinuation of legacy DSL services over copper phone lines.</p><p>Of the 38 million households in AT&amp;T territory that did not have fiber-to-the home at that time, 22.6 million had access to VDSL (aka fiber-to-the-node), and 13.9 million had the older DSL technology that is no longer offered to new customers, the CWA said. Poor people have been disproportionately excluded from AT&amp;T's high-speed Internet upgrades, <a href=\"https://arstechnica.com/information-technology/2017/03/att-allegedly-discriminated-against-poor-people-in-broadband-upgrades/\">research by</a> the National Digital Inclusion Alliance has found.</p><p>AT&amp;T was required to bring fiber to <a href=\"https://arstechnica.com/information-technology/2015/07/att-gets-directv-merger-approval-must-deploy-fiber-to-12-5m-customers/\">12.5 million locations</a> by mid-2019 under conditions imposed on its purchase of DirecTV and ended up <a href=\"https://about.att.com/story/2019/att_fiber_springfield.html\">hitting 14 million</a>&nbsp;around the same time as that deadline.</p><h2>Network neglect</h2><p>AT&amp;T has let its copper phone network deteriorate through neglect over the past decade, resulting in poor service quality and lengthy outages, a <a href=\"https://arstechnica.com/tech-policy/2021/02/att-raised-phone-prices-153-as-service-got-steadily-worse-report-finds/\">report</a> commissioned by the California state government found. AT&amp;T customers in low-income areas and areas without substantial competition fared the worst, the California report found.</p><p>AT&amp;T has been rapidly laying off employees the past few years <a href=\"https://arstechnica.com/tech-policy/2019/05/att-promised-7000-new-jobs-to-get-tax-break-it-cut-23000-jobs-instead/\">despite promising</a> to use a corporate tax cut to create jobs. AT&amp;T had <a href=\"https://otp.tools.investis.com/clients/us/atnt2/sec/sec-show.aspx?FilingId=14746187&amp;Cik=0000732717&amp;Type=PDF&amp;hasPdf=1\">230,000 employees</a> as of January 31, down from <a href=\"https://otp.tools.investis.com/clients/us/atnt2/sec/sec-show.aspx?FilingId=13241251&amp;Cik=0000732717&amp;Type=PDF&amp;hasPdf=1\">268,000 two years previously</a>. The layoffs are one big reason that AT&amp;T has failed to properly maintain large portions of its copper network or upgrade more of that network to fiber.</p><p>AT&amp;T's planned fiber-to-the-home upgrades this year will apparently target areas that at least have the semi-modern fiber-to-the-node network, leaving people in other parts of AT&amp;T territory with outdated technology.</p><p>\"We've got the opportunity to convert our VDSL... to fiber-to-the-home\" in locations where AT&amp;T already has fiber in the neighborhood, AT&amp;T CFO John Stephens said at an investor event a few days ago (see Seeking Alpha's <a href=\"https://seekingalpha.com/article/4412286-t-inc-t-presents-deutsche-bank-29th-annual-media-internet-telecom-conference-transcript\">transcript</a>).</p><p>AT&amp;T fiber has been popular with customers in areas where cable companies previously offered the fastest service. While cable and fiber both provide fast download speeds, cable networks are still far behind fiber on upload speeds.&nbsp;\"In areas where AT&amp;T has deployed its fiber network, the company has 10 percent higher market share than its competitors,\" AT&amp;T said today. But in many areas where AT&amp;T doesn't face a competitive threat from cable broadband, the company has been less willing to upgrade its network.</p><p>At year-end 2020, <a href=\"https://investors.att.com/~/media/Files/A/ATT-IR/financial-reports/quarterly-earnings/2020/q4-2020/4Q20_Trending_Schedule.pdf\">AT&amp;T had 4.95 million</a> fiber-to-the-premises Internet customers, 8.74 million fiber-to-the-node customers, and 407,000 legacy DSL customers.</p><h2>Wireless plans</h2><p>Fiber builds are important both for wired Internet and for backhaul to AT&amp;T's wireless network, Stephens noted. Today's announcement from AT&amp;T spent more time on AT&amp;T's HBO Max and 5G mobile plans than on the fiber-to-the-premises construction. In a <a href=\"https://arstechnica.com/information-technology/2021/02/verizon-and-att-dominate-spectrum-auction-spending-combined-69-billion/\">recent spectrum auction</a>, AT&amp;T submitted winning bids for nationwide access to 80 MHz of \"C-Band\" spectrum in the upper part of the 3 GHz band.</p><p>\"The company plans to begin deploying the first 40MHz of this spectrum by the end of 2021,\" AT&amp;T said today. \"AT&amp;T expects to spend $6-8 billion in capex deploying C-band spectrum, with the vast majority of the spend occurring from 2022 to 2024.\"</p><p>AT&amp;T's capital expenditures were <a href=\"https://investors.att.com/~/media/Files/A/ATT-IR/financial-reports/annual-reports/2020/complete-2020-annual-report.pdf\">$15.7 billion in 2020</a>, down from $19.6 billion in 2019 and over $21 billion annually in previous years. AT&amp;T said it plans \"capital expenditures in the $18 billion range\" in 2021.</p></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2e8400ede9e019484eb28cd97186cd1d64361cd6dd186fe333e5fe96aa8a7544","category":"Tech"}