{"title":"Kask Wasabi helmet review: All-weather versatility with an aero bonus","link":"https://cyclingtips.com/2021/11/kask-wasabi-helmet-review/","date":1638309879000,"content":"<div><div><p>The new Kask Wasabi is built around the same concept as the company’s <a href=\"https://cyclingtips.com/2013/06/kask-infinity-aero-helmet-review/\" target=\"_blank\">older Infinito model</a>, with a large panel you can slide back and forth to open and close the central vents on the fly. On the Infinito, Kask billed this more as an “aero on demand” sort of feature. Aero efficiency is still part of the story with the Wasabi, but this time around, the core message is more about temperature regulation.</p><p>“The Wasabi ensures temperature regulation like no other helmet thanks to its adjustable airflow system,” reads the marketing spiel. “With the push of a finger, a centralized vent can be opened when conditions heat up or closed when they cool down for a 1.5 °C (2.7 °F) internal temperature increase when riding at the same speed.”</p><p>When the vent is closed, the front, sides, and top of the helmet are almost completely closed off to the elements, with only the six rear exhaust ports left unobstructed to release any hot air. Sliding the panel back, however, reveals a large V-shaped vent (technically it’s three, but it’s effectively one) right at your forehead, plus another opening higher up that’s akin to a hood scoop on a car. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-2a.gif\"><figcaption>The airflow characteristics of the Wasabi change dramatically depending on the position of the sliding panel.</figcaption></figure><p>Inside, there’s not only a generous array of internal channeling, but also some prominent gaps in between the two layers of the helmet to help keep air flowing through. Kask hasn’t skimped at all on the padding, either, with much more of the interior covered in squishy bits than usual, and natural Merino wool-blend fabrics against your scalp.</p><p>Out back, Kask equips the Wasabi with its usual Octo Fit retention system with adjustable occipital pads and a very wide range of height adjustment, plus its now-trademark synthetic leather chin strap for comfort. The straps are fixed below the ears, but instead of using some sort of molded plastic bit at the intersection, Kask just stitches everything together.</p><p>The whole thing has a notably trim profile, and the sextet of monochrome matte finishes only add to the subdued appearance.</p><p>Kask offers the Wasabi in three sizes and six colors. Actual weight for a CPSC-approved medium sample is 315 grams, and retail price is a hefty US$350 / AU$409 / £269 / €300.</p><h2>Two helmets in one</h2><p>In mountain towns, “shoulder season” describes the time in between summer and winter, when it’s not yet snowy enough to ski, but quite chilly for riding (especially in the morning). When you pile on top the added weather variability of big changes in altitude, choosing the right clothing isn’t always a straightforward affair, and the same goes for helmets.</p><p>It’s of course easy to add or remove a cap depending on the conditions, but it’s not the easiest or safest thing to do while you’re rolling, and my guess is there isn’t a single person reading this right now who hasn’t started a descent and then pulled over after quickly realizing they could use another layer.</p><p>That’s not a problem with the Wasabi.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-4-1340x754.jpg\"><figcaption>The sliding panel is much easier to operate than the one on the old Infinito model.</figcaption></figure><p>I did nearly all of my testing during the month of October, and a typical ride saw me heading out the door when temperatures were around 7 °C (45 °F), climbing up a few hundred meters, and then diving back down into town right as things warmed up past 21 °C (70 °F).</p><p>Almost without fail, I started each of those rides with the Wasabi’s main panel snapped shut, where it does a surprisingly good job of keeping your head reasonably warm. It’s not as a warm as a proper cap (particularly since your ears are still exposed), but even just getting rid of the wind chill up there is remarkably effective. </p><p>I invariably then slid the panel open once I started climbing. You can immediately feel the air rushing over the top of your head when you do. It’s not as airy as a dedicated summer helmet, mind you, but the airflow is still pretty good even at moderate speeds. When it came time to descend, closing the panel again required just a flick of my hand. And as a nice bonus — and as I’ve noticed with most nominally aero helmets over the years — the Wasabi is also pretty quiet at high speeds with very reasonable levels of wind noise.</p><p>Should you be sufficiently hardy to ride in truly frigid temperatures, it’s worth noting that Kask even offers a full winter liner — earflaps and all — for the Wasabi.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-13-1340x754.jpg\"><figcaption>The interior of the helmet is generously padded, and feels that way on your head.</figcaption></figure><p>Kask has thankfully learned some lessons from the old Infinito in terms of how the sliding panel physically operates. On the Infinito, that section of plastic was totally smooth and slick so there was nothing to grab on to, and it also didn’t take very long before the movement started to feel a little loose and sloppy. But on the Wasabi, the upper vent provides a perfect grab point for your fingers, and despite literally spending hours mindlessly opening and closing the thing to simulate long-term wear, it still operates as good as new.</p><p>Granted, I didn’t toss in any grit or mud into the mix, but given the cost, I suspect the vast majority of these will stick to the road, and water doesn’t seem to have any effect on the mechanism. </p><p>Overall, the temperature versatility of the Wasabi is quite impressive, but there are limits. Although you don’t need to be moving <em>that </em>fast to feel air moving through the interior, there’s still an awful lot of closed shell on your head, leaving less open area for heat to escape during hard and slow climbs. Going with that, both tech editor Dave Rome and I noticed that moisture management on the Wasabi seems better than we’ve found on other Kask helmets, which is likely related to both the oversized vent right at your forehead and the wool pad material. </p><p>Nevertheless, steep climbs in the heat will still eventually result in some sweat dripping down your face since Kask hasn’t incorporated any sort of advanced sweat management like what Bell and Giro use (and, to some extent, Specialized). Adding insult to injury is the fact there’s nowhere to stash your sunglasses, either.  </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-6-1340x754.jpg\"><figcaption>Rear coverage is quite decent for a dedicated road helmet, but there’s also a lot of covered area without any venting.</figcaption></figure><p>I think the Wasabi is a little polarizing aesthetically, too, especially with the monochrome matte finishes. That smooth exterior may be good for aero efficiency, but I still sometimes look in the mirror and see <a href=\"https://en.wikipedia.org/wiki/Toad_(Nintendo)\" target=\"_blank\">Toad</a> from the Mario Brothers universe.</p><p>Other nitpicks? The retention system is super adjustable (and it plays well enough with most eyewear models I tried), but the rear straps run through the occipital pads, and the height adjustment doesn’t stay in place. As a result, there’s a little more fiddling required every time you put the Wasabi on as compared to other helmets that do a better job of retaining your settings.</p><p>Good luck scratching an itch on your head, too, and I’m sorry, Kask, but that “hi-viz” feature is nothing more than a reflective sticker on the rear. </p><p>Weight weenies will invariably note that the Wasabi isn’t exactly the lightest helmet, either. That moving panel is neat, but it also adds a fair bit of complication. Granted, 315 g doesn’t sound like a lot on paper (and Dave’s AS/NZ-approved sample is lighter at 280 g), but a true ultralight helmet like the <a href=\"https://cyclingtips.com/2021/02/poc-changes-gears-with-new-sub-200-gram-ventral-lite-road-helmet/\" target=\"_blank\">POC Ventral Lite</a> sure feels a lot different back-to-back. I dare say your neck might notice an extra 100 g atop your head after several hours in the saddle, too. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-11-1340x754.jpg\"><figcaption>In case you’re wondering, there’s no good place to stash sunglasses when wearing the Wasabi.</figcaption></figure><p>Comfort-wise, though, it’s hard to complain. I’m usually happiest in more ovoid helmets, and the Kask sits more at the rounder end of the spectrum. However, fiddliness and all, the high level of adjustability on the Octo Fit retention system nevertheless makes for an appropriately snug fit free of pressure points. That natural padding material lends a particularly cozy feel on my shaved head, too, and unlike some other performance-minded helmets, there’s no shortage of padding in general. </p><h2>Unanswered questions</h2><p>Whereas the old Infinito was billed at the time as Kask’s premier aero road helmet, that role has now been filled by the newer Utopia. Kask still describes the Wasabi as being aerodynamically efficient — and in particular, with aero characteristics that only differ by a single watt at 50 km/h when the vent is open or closed, unlike the Infinito — but those claims aren’t as overt as they once were.</p><p>In fact, Kask declined to provide any real aero data at all for this review, despite multiple requests, referring me instead to the <a href=\"https://www.youtube.com/watch?v=3Xpct10oWhM\" target=\"_blank\">somewhat vacuous marketing video</a> that only describes that the helmet was tested in a wind tunnel at multiple head positions and yaw angles. So is the Wasabi aero? Beats me, but you’d think that if it was, Kask would be more than eager to declare as such.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-15-1340x754.jpg\"><figcaption>The retention system is highly adjustable and quite comfortable. And while there’s some interference with eyewear arms, the way the retention system is shaped makes it pretty easy to tuck those arms underneath without much issue.</figcaption></figure><p>There’s also the question of safety. Kask has steadfastly resisted market pressure to incorporate MIPS or any equivalent rotational energy management system into any of its cycling helmets, repeatedly calling into doubt the effectiveness of that low-friction liner. Instead, the company — along with Rudy Project, and perhaps others — has embraced a European-based rotational impact test called <a href=\"https://www.kask.com/en-us/safety.htm\" target=\"_blank\">WG11</a> that is claimed to be “an objective method, based on scientific sources, for measuring the performance of its helmets against rotational impacts.” </p><p>Naturally, the Wasabi passes the WG11 test, and if the test is as valid as the company claims, the Wasabi is perhaps just as good as if it incorporated MIPS. Even so, this sure seems like an uphill battle in terms of public perception. Maybe the benefits of MIPS really are as questionable as Kask claims, but I have a hard time imagining the company isn’t losing sales because of it. </p><p>Even if you question MIPS’s in-house claims, there’s a growing contingent of buyers that are placing more weight on <a href=\"https://cyclingtips.com/2018/06/new-independent-test-ranks-bicycle-helmet-safety/\" target=\"_blank\">third-party university tests from Virginia Tech</a>. To date, Virginia Tech has only tested one Kask bicycle helmet model — <a href=\"https://cyclingtips.com/2018/06/kask-valegro-helmet-review-feathery-and-airy/\" target=\"_blank\">the Valegro</a> — but it only scored a middling 3/5 rating. The Wasabi is obviously a very different helmet in terms of its design, but take that as you will.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-12-1340x754.jpg\"><figcaption>As always, beauty is in the eye of the beholder, but the Wasabi still strikes me as a little more plain than what I usually expect from Kask.</figcaption></figure><h2>The perfect amount of bite, or not spicy enough?</h2><p>I’ve always been a big fan of things that can capably fulfill multiple roles and purposes (probably related to me never having as many Transformers as I wanted when I was a kid), and the Kask Wasabi most definitely checks that box. It’s admirably warm when the vent is closed, surprisingly cool when it’s open, and switching between the two modes could hardly be easier. </p><p>But I still wouldn’t consider it a great choice for properly hot and humid conditions — particularly at lower speeds — there are some question marks about its safety, it’s quite expensive, and also on the heavier side.  </p><p>Don’t get me wrong — I like it. Quite a lot, in fact, and if you have similarly variable weather conditions where you ride, I suspect you might feel the same. But what’s that convenience worth to you, and what are you willing to give up to get it?</p><p>More information can be found at <a href=\"https://www.kask.com/en/cycling/helmets/wasabi_24_99.htm\" target=\"_blank\">www.kask.com</a>.</p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-5-1340x754.jpg\"><figcaption>The rear exhaust ports work impressively well. Photo: Dave Rome.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-7-1340x754.jpg\"><figcaption>The internal channeling does a good job of keeping air moving across your head.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-8-1340x754.jpg\"><figcaption>The upper port is very big and open, but there are also gaps on the port’s upper edge that feed air into the space between the main helmet body and the sliding panel.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-9-1340x754.jpg\"><figcaption>These transfer ports are remarkably effective at pulling hot air off the top of your head and into that open space between the two helmet layers – at least while you’re moving, anyway.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-10-1340x754.jpg\"><figcaption>Kask makes reference to the Wasabi having a “hi-viz” feature, but it’s just a reflective sticker on the back of the shell.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-14-1340x754.jpg\"><figcaption>There’s nothing special built into the Wasabi in terms of sweat management, but this browpad – and perhaps that big vent right above it – somehow do a better job of keeping your glasses clear than many other Kask helmets I’ve used in the past.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-16-1340x754.jpg\"><figcaption>The occipital pads can slide laterally for a more fine-tuned fit, but the foam padding is already starting to fall off on my test sample.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-17-1340x754.jpg\"><figcaption>The height adjustment moves around too easily and often has to be readjusted when you put the helmet back on.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-18-1340x754.jpg\"><figcaption>The strap intersections are sewn in place and non-adjustable. They fit me OK, but I can see them being problematic with some other riders.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-19-1340x754.jpg\"><figcaption>The synthetic leather chin strap feels good against your skin.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-20-1340x754.jpg\"><figcaption>The front of the helmet dips down a bit, so some sunglasses will rattle against the edge.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Kask-Wasabi-helmet-review-21-1340x754.jpg\"><figcaption>Kask offers the Wasabi in six colors, all of which are monochromatic and matte.</figcaption></figure></li></ul></div></figure></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"2efd3d02c25a7acf23d671a181ea5f1c8ed7336d28aadb6af567954eb47eab6a","category":"Cycling"}