{"title":"Apple's Heart Month Activity Challenge Requires 60 Minutes of Exercise on Valentine's Day","link":"https://www.macrumors.com/2021/02/14/heart-month-activity-challenge/","date":1613283358000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/14/heart-month-activity-challenge/\"><p>Today only, Apple Watch owners can complete a new Apple Watch activity challenge in celebration of Heart Month, which is aimed at promoting cardiovascular health.</p><p><img alt=\"Apple Watch Heart Month Challenge\" width=\"1499\" height=\"1200\" src=\"https://images.macrumors.com/t/NnaJMWk-ya2nYiKoSrHb-NfkKgg=/400x0/filters:quality(90)/article-new/2021/02/Apple-Watch-Heart-Month-Challenge.jpg?lossy\" data-src=\"https://images.macrumors.com/t/NnaJMWk-ya2nYiKoSrHb-NfkKgg=/400x0/filters:quality(90)/article-new/2021/02/Apple-Watch-Heart-Month-Challenge.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/NnaJMWk-ya2nYiKoSrHb-NfkKgg=/400x0/filters:quality(90)/article-new/2021/02/Apple-Watch-Heart-Month-Challenge.jpg?lossy 400w,https://images.macrumors.com/t/GJzLhodKNNGlTmRqAnGSl-hbB4M=/800x0/filters:quality(90)/article-new/2021/02/Apple-Watch-Heart-Month-Challenge.jpg?lossy 800w,https://images.macrumors.com/t/5z0wihKT1d1bExL47GYvGN-Qjfs=/1600x0/filters:quality(90)/article-new/2021/02/Apple-Watch-Heart-Month-Challenge.jpg 1600w,https://images.macrumors.com/t/W-OndADEZRErVJq3s09XhaWvka8=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/Apple-Watch-Heart-Month-Challenge.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/NnaJMWk-ya2nYiKoSrHb-NfkKgg=/400x0/filters:quality(90)/article-new/2021/02/Apple-Watch-Heart-Month-Challenge.jpg?lossy 400w,https://images.macrumors.com/t/GJzLhodKNNGlTmRqAnGSl-hbB4M=/800x0/filters:quality(90)/article-new/2021/02/Apple-Watch-Heart-Month-Challenge.jpg?lossy 800w,https://images.macrumors.com/t/5z0wihKT1d1bExL47GYvGN-Qjfs=/1600x0/filters:quality(90)/article-new/2021/02/Apple-Watch-Heart-Month-Challenge.jpg 1600w,https://images.macrumors.com/t/W-OndADEZRErVJq3s09XhaWvka8=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/Apple-Watch-Heart-Month-Challenge.jpg 2500w\"><br>The challenge, which is listed in the Fitness app on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, tasks users with earning 60 minutes on their Exercise ring.</p><blockquote><p>Show your heart some love. Get this award by earning 60 minutes on your Exercise ring this Valentine's Day, February 14.</p></blockquote><p>Completing the challenge will award users with a unique badge viewable in both the Summary tab of the Fitness app on ‌iPhone‌ and the Awards section of the Activity app on Apple Watch.</p><p>Activity Challenges are often tied to special occasions or holidays throughout the year, including Earth Day, Veterans Day, Thanksgiving Day, and New Year's. Earlier in February, Apple <a href=\"https://www.macrumors.com/2021/02/01/apple-watch-unity-challenge-for-feb/\">kicked off a Unity challenge</a> in celebration of black history, tasking users to close their Move rings seven times in a row during the month.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/13/zuckerberg-facebook-inflict-pain-on-apple-privacy/\">Mark Zuckerberg Reportedly Told Staff Facebook Needs to 'Inflict Pain' on Apple Over Privacy Dispute</a></h3><p>Saturday February 13, 2021 2:33 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple and Facebook have been in a very public spat over the course of the last few months as Apple dials up its pro-privacy stance. The two companies have long had tension, but more recently, Facebook is taking shots at an upcoming iOS and iPadOS feature that will require apps and data companies such as Facebook to ask for users' permission before tracking them across other sites and websites. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/intel-anti-mac-ad-campaign/\">Intel's Anti-Mac Ad Campaign Highlights M1 Shortcomings</a></h3><p>Thursday February 11, 2021 5:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of the M1 Macs last November, Apple officially began its transition away from Intel's chips, and it's clear from Intel's latest advertising campaign that the company is feeling threatened by Apple's decision. In ads shared on Twitter, Intel has been highlighting the shortcomings of Apple's M1 Mac lineup. An ad this week, for example, points out the gaming capabilities of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/prosser-airtags-ipad-pro-next-month/\">Leaker Jon Prosser Claims AirTags and New iPad Pro to Be Announced Next Month</a></h3><p>Friday February 12, 2021 11:56 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple is slated to release a number of new products this year, and the first round of products could be just a few weeks away. YouTuber Jon Prosser, who has a mixed track record when it comes to reporting on Apple's plans, claims that AirTags and brand new iPad Pro models are set to be announced next month, presumably via a virtual event. Prosser, who runs the tech-news show \"Front Page...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/iphone-tips-february-2021/\">Useful iPhone Tips You Might Not Know</a></h3><p>Friday February 12, 2021 3:00 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>There seem to be an endless number of iPhone tips and tricks to share, and that's because Apple's smartphones are so feature rich that it's impossible to keep up with everything they're capable of. We've rounded up some useful tips and hacks in our latest video, so check them out to see if there's something you didn't know about. Subscribe to the MacRumors YouTube channel for more videos. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/useful-mac-accessories-worth-checking-out/\">Useful Mac Accessories Worth Checking Out</a></h3><p>Wednesday February 10, 2021 1:21 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>If you recently picked up one of the new M1 Macs that Apple released in November, or received a new Mac for the holidays, you may be in search of useful accessories to go along with it. In our latest YouTube video, we rounded up some great Mac accessories that are worth checking out. Subscribe to the MacRumors YouTube channel for more videos. MacRumors videographer Dan has highlighted several ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/one-last-intel-mac/\">Apple Surprisingly Sticking With Intel Chips for One Last Mac</a></h3><p>Despite having begun the transition towards using its own custom silicon across the Mac product lineup, somewhat surprising recent rumors have suggested that Apple may continue to use Intel chips for one Mac model. Last year at WWDC, Apple announced plans to transition away from Intel chips to Macs built with its own Apple Silicon, such as the M1 chip, starting in late 2020. It set out its ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/apple-turn-off-activation-lock-page/\">Apple Launches Self-Serve Portal for Initiating Activation Lock Removal Requests</a></h3><p>Friday February 12, 2021 8:13 am PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today added a new \"Turn off Activation Lock\" page to its website that provides steps users can take to turn off the security feature on an iPhone, iPad, or iPod touch. As noted on Reddit, the page includes a link to start an Activation Lock support request in the United States, meaning that customers no longer have to contact an Apple support representative by phone, email, or online...</p></div></div></div>","author":"Frank McShan","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2f245cb9232b5193508172757adbda5ac7f6addd00a5f7ac15b2cb6c82e54793","category":"Apple"}