{"title":"Apple Cracks Down on Apps With ‘Irrationally High Prices’ as App Store Scams Are Exposed","link":"https://9to5mac.com/2021/02/19/apple-cracks-down-on-apps-with-irrationally-high-prices-as-app-store-scams-are-exposed/","date":1613767567000,"content":"<div id=\"readability-page-1\" class=\"page\"><article itemscope=\"\" itemtype=\"http://schema.org/NewsArticle\"><div><p><img src=\"https://9to5mac.com/wp-content/uploads/sites/6/2020/11/App-Store-commission-cut.jpg?quality=82&amp;strip=all&amp;w=1500\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2020/11/App-Store-commission-cut.jpg?w=320&amp;quality=82&amp;strip=all&amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2020/11/App-Store-commission-cut.jpg?w=640&amp;quality=82&amp;strip=all&amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2020/11/App-Store-commission-cut.jpg?w=1024&amp;quality=82&amp;strip=all&amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2020/11/App-Store-commission-cut.jpg?w=1500&amp;quality=82&amp;strip=all&amp;ssl=1 1500w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2020/11/App-Store-commission-cut.jpg?w=2000&amp;quality=82&amp;strip=all&amp;ssl=1 2000w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2020/11/App-Store-commission-cut.jpg?w=2500&amp;quality=82&amp;strip=all&amp;ssl=1 2500w\" width=\"1500\" height=\"750\" loading=\"lazy\"></p></div><div itemprop=\"articleBody\"><p>App Store scams have <a href=\"https://9to5mac.com/2021/02/12/developer-reveals-fake-app-store-reviews-and-scams/\">recently resurfaced</a> as a developer exposed several scam apps in the App Store making millions of dollars per year. Most of these apps exploit fake ratings and reviews to show up in search results and look legit, but trick users into getting subscriptions at irrationally high prices.</p><p>It looks like Apple has started to crack down on scam attempts by rejecting apps that look like they have subscriptions or other in-app purchases with prices that don’t seem reasonable to the App Review team.</p><p><em>9to5Mac</em> obtained access to a rejection email shared by a developer that provides a subscription service through their app. It shows a rejection message from Apple telling them that their app would not be approved because the prices of their in-app purchase products “do not reflect the value of the features and content offered to the user.” Apple’s email goes as far as calling it a “rip-off to customers” (you can read the full letter at the end of this post).</p><p>We were initially skeptical about the veracity of this email given some of the wording choices, but looking through Apple’s <a href=\"https://developer.apple.com/app-store/review/guidelines/\">App Store Review Guidelines</a>, it’s possible to find the term “rip-off” at least twice, such as in section 3, where Apple states that “we won’t distribute apps and in-app purchase items that are clear rip-offs.”</p><p>In contact with the developer of the rejected app, we were able to verify the authenticity of the rejection email from Apple. Unfortunately in this case, it seems clear that the rejection was a mistake. The developer was able to work with the app review team and eventually got their app approved by explaining that the subscription price was justified because the app employed paid APIs to perform its tasks.&nbsp;Just as with many other items in the guidelines, it’s possible for the review team at Apple to encounter false positives that lead to wrongful rejections of apps, which highlights why moderating the App Store is such a complicated task.</p><p>This rule has been in place for a long time, so it’s unclear when Apple started enforcing it more rigorously. A quick Google search turns up a few results in the Apple Developer Forums with similar phrasing to this email going as far back as October 2020. It’s possible that recent issues with scams being exposed in the App Store have caused Apple to change its review policies to look at the prices of subscriptions and other in-app purchases more closely before approving an app.</p><p>We reached out to Apple for more information on these practices. The company reiterated its commitment to keeping the App Store a safe place for users to discover and download apps, and that app review rejects apps that attempt to scam or rip off users, based on section 3 of the review guidelines.</p><p>Here’s the full rejection letter from Apple:</p><blockquote><p>Customers expect the App Store to be a safe and trusted marketplace for purchasing digital goods. Apps should never betray this trust by attempting to rip-off or cheat users in any way.</p><p>Unfortunately, the prices you’ve selected for your app or in-app purchase products in your app do not reflect the value of the features and content offered to the user. Charging irrationally high prices for content or services with limited value is a rip-off to customers and is not appropriate for the App Store.</p><p>Specifically, the prices for the following items are irrationally high:</p><p>– (redacted)</p><p>Next Steps</p><p>To resolve this issue, we recommend you take the following steps:</p><p>– Revise your app or in-app purchase products to provide more value to the user at the time of purchase – Choose a price for your app or in-app purchase products that accurately reflects the value being provided to the user – Once you’ve made appropriate changes, resubmit your app for review</p><p>The next submission of this app may require a longer review time, and it won’t be eligible for an expedited review until this issue is resolved.</p></blockquote><p><em>Thanks to <a href=\"https://twitter.com/ilyakuh\">Ilia Kukharev</a>&nbsp;and&nbsp;<a href=\"https://twitter.com/aso_rad\">Radomir Novkovich</a>&nbsp;for their help.</em></p><p><em>FTC: We use income earning auto affiliate links.</em> <a href=\"https://9to5mac.com/about/#affiliate\">More.</a></p><hr><p><a href=\"https://www.youtube.com/c/9to5mac?sub_confirmation=1\" target=\"_blank\" rel=\"noopener\">Check out 9to5Mac on YouTube for more Apple news:</a></p><p><iframe title=\"Recent Videos\" src=\"https://www.youtube.com/embed/HUs0yyvfyWU?playlist=OkUaGvW2bTI,7XoQdxfOIJM,n-8ErnPRXDE,j_OtJ41PIcE,Rzi2FheKGb8,QLsxjPQ0Q8s,j12FV-PP8pA,KrhDey_ugls,Lf0of3Kavi4\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" width=\"1000\" height=\"563\"></iframe></p></div><div><h2>About the Author</h2></div></article></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"2f7220069196f3c4135f2dde6585112027d977f302d2fbd6bbca65a903e380cb","category":"Tech"}