{"title":"From buggies to buses, the first Black-owned US automaker did what few others dared","link":"https://arstechnica.com/?p=1747991","date":1615377653000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>\"Ample proportions at a very reasonable price\" —</h4><h2 itemprop=\"description\">Few of its products remain, but C.R. Patterson &amp; Sons was an industry trailblazer.</h2></header><section><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Patterson-Chasis-5-800x556.jpg\" alt=\"Frederick Patterson standing beside a bare Patterson-Greenfield automobile chassis, probably for a larger touring car body.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Patterson-Chasis-5.jpg\" data-height=\"3040\" data-width=\"4375\">Enlarge</a> <span>/</span> Frederick Patterson standing beside a bare Patterson-Greenfield automobile chassis, probably for a larger touring car body.</p></figcaption></figure><p>It’s September 1915 in Greenfield, Ohio, a small town located on the Paint Creek between Columbus and Cincinnati. At a time of year when summer’s warmth gives way to autumn’s chill, a change of another sort occurs in a small factory on N. Washington St.: the first Patterson-Greenfield Automobile is completed and readied for sale. It’s a major milestone, not just because this vehicle comes from a first-time automaker.</p><p>There have been more than 1,900 automobile manufacturers in the United States since the Duryea Motor Wagon Company sold its first automobile in Springfield, Mass. in 1896. Yet in the explosion of entrepreneurship that followed, only one American automaker has been founded and run by a Black individual: C.R. Patterson &amp; Sons of Greenfield, Ohio.</p><p>In some ways, Patterson’s fate was typical of many small-town, small-time automotive manufacturers—the business found some modicum of success though never rose to the same heights as the auto brands we still know in 2021. Yet, in retrospect this Black-owned business had quite a run. The team behind C.R. Patterson &amp; Sons worked its way through 74 years, three generations, and multiple changes in business strategy at a time of technological change and extreme prejudice, making the company’s story all the more remarkable.</p><h2>Life before the wheel</h2><p>Charles Richard Patterson was born into slavery on a Virginia plantation in 1833, the first of 13 children. Little else is known about his life there, and the same goes for how he and his family gained their freedom.</p><p>But eventually, around 1850, the Pattersons came to settle in Greenfield, Ohio. The town was already known for its strong abolitionist sympathies thanks to Rev. Samuel Crothers, the founder of the town’s First Presbyterian Church. With First Presbyterian, Crothers established one of Ohio’s—and the nation’s—earliest abolition societies in 1833. And before long, Greenfield became a stop on the Underground Railroad, and a magnet for Black slaves seeking freedom.</p><p>Here, the Pattersons eventually worked as blacksmiths, a common skilled trade for former slaves during a period when occupations commonly held by white individuals were closed off. By 1864, Patterson had become successful enough to woo and eventually marry Josephine Outz of Greenfield. Six children followed.</p><p>Like many blacksmiths, Patterson’s career led him to work for local carriage maker Dines &amp; Simpson, where he became foreman, working side-by-side with white workers and supervising others. But Patterson wanted to start his own business. Looking back, it’s easy to perceive that as an impossible goal with insurmountable hurdles given the lack of financing available to aspiring Black businessmen and the general prejudice behind many policies of the day.</p><p>Nevertheless, Patterson ultimately partnered with J.P. Lowe, a white man, and they established J.P. Lowe and Company in 1873. The company soon earned the same reputation Dines &amp; Simpson had enjoyed for constructing high-quality products. Lowe and Company grew a wholesale business supplying carriages to Cincinnati-area retailers and other regional customers.</p><p>As the business grew, so did Patterson’s community involvement. He was a trustee of the Greenfield African Methodist Episcopal Church in 1880, where he also taught Sunday school. Patterson was also active in the Cedar Grove Masonic Lodge No. 17 from 1871 through 1899. Patterson filed suit against the local Board of Education when his son was denied admission to all-white high school, a case he ultimately won.</p><p>Given his high profile locally, it’s no surprise that by 1888, the company employed 10 men, according to Ohio’s Bureau of Labor Statistics Report. It was a successful partnership that lasted until 1893, when faraway events would change Patterson’s life.</p><h2>A not great Depression</h2><p>The economy had been improving as 1892 ended, a notion reinforced by a myriad of economic business indicators. Unfortunately, there were signs the party was ending. Monthly indicators, such building construction and railroad investment, began to decline. In January, the failure of the Philadelphia and Reading Railroad, one of America’s largest employers, ignited panic on Wall Street, causing a run on banks. Needing deposits to feed the run, banks called in business and agricultural loans. But both sectors had become wildly overextended, leading to numerous bankruptcies, a drastic reduction in America’s gold supply on which the dollar was based, and a realignment of America’s political priorities.</p><p>The result was a four-year depression: the Panic of 1893. It was one of America’s worst depressions, and businesses in Greenfield, Ohio were not immune.</p><p>“The older firm of Lowe and Patterson, once extensive, dwindled through business depression to such proportions that the formation of the present partnership was opportuned and consummated,\" Patterson later recalled during a speech at the first meeting of the National Negro Business League in 1900.</p><p>Now sole proprietor of the renamed C.R. Patterson &amp; Sons, Patterson would soon bring his sons into the business. According to Christopher Nelson’s history of the family, The C.R. Patterson and Sons Company: Black Pioneers in the Vehicle Building Industry, 1865–1939, Frederick would graduate high school as a Valedictorian, entering Ohio State University in 1889. (He became the first Black player on the Ohio State University football team and served as class president in 1893.) He quickly joined the company beside his brother Samuel and their father before a few years of major family events changed things for Frederick. In 1899, Samuel died unexpectedly. Two years later, the younger Patterson married Betty Estelline Postell, and the couple would have two children who would also become part of the Patterson &amp; Sons company: Frederick Jr. and Postell.</p><h2>Victorian state-of-the-art</h2><p>By the turn of the century, Patterson’s integrated workforce averaged some 35-to-50 employees strong. They produced 28 carriage models priced from $120 to $150 and also made specialty vehicles, such as the Mail Delivery Buggy and the School Wagon. However, their most popular offering was the Doctor’s Buggy—hardly surprising given the company’s targeted advertising strategy. Aside from appearing in their local newspaper, ads for Patterson buggies regularly appeared in “The Journal of the National Medical Association,” selected Black magazines including “Alexander’s,” and “The Crisis,” and a regional agricultural publication called “The Ohio Farmer.”</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Image-5.jpg\" data-height=\"3141\" data-width=\"2430\" alt=\"An advertisement in The Greenfield Republican 1902 Holiday Edition. From the accompanying article: &quot;The news spread abroad 'that you get your money’s worth at Patterson’s.' Gradually the farmers got into the habit of coming into Patterson’s and giving orders for buggies. They found them just as good as those made in the mammoth factories of Cincinnati, Columbus, and South Bend, and besides the prices were lower and there was no freight and charges bill to pay. As the years went by and business grew, larger quarters were found necessary, until now the factory and show rooms on Washington streets are models of convenience and spaciousness.&quot;\"><img alt=\"An advertisement in The Greenfield Republican 1902 Holiday Edition. From the accompanying article: &quot;The news spread abroad 'that you get your money’s worth at Patterson’s.' Gradually the farmers got into the habit of coming into Patterson’s and giving orders for buggies. They found them just as good as those made in the mammoth factories of Cincinnati, Columbus, and South Bend, and besides the prices were lower and there was no freight and charges bill to pay. As the years went by and business grew, larger quarters were found necessary, until now the factory and show rooms on Washington streets are models of convenience and spaciousness.&quot;\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Image-5-300x388.jpg\" width=\"300\" height=\"388\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Image-5-640x827.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Image-5.jpg\" data-height=\"3141\" data-width=\"2430\">Enlarge</a> <span>/</span> An advertisement in The Greenfield Republican 1902 Holiday Edition. From the accompanying article: \"The news spread abroad 'that you get your money’s worth at Patterson’s.' Gradually the farmers got into the habit of coming into Patterson’s and giving orders for buggies. They found them just as good as those made in the mammoth factories of Cincinnati, Columbus, and South Bend, and besides the prices were lower and there was no freight and charges bill to pay. As the years went by and business grew, larger quarters were found necessary, until now the factory and show rooms on Washington streets are models of convenience and spaciousness.\"</p></figcaption></figure><p>Patterson did not consider his shop one that merely assembled parts built by other companies. At the same time, Patterson &amp; Sons was not large enough to mass-produce carriages, like Studebaker had done for most of the 19th Century. No, this was a custom shop where craftsmanship was good enough for the company to offer a two-year warranty on its vehicles.</p><p>Among some of Patterson &amp; Sons’ details: The wood used was seasoned for three years in the company’s yards, with ash frames and poplar panels. Bodies weighed as little as 30 pounds, yet boasted a 600-pound payload. Shafts were constructed from black hickory, and the wheels came from elm and white hickory. Rubber tires could be ordered to replace the steel rims commonly used.</p><p>The quality of the company’s products sustained business even after the initial arrival of the automobile. In fact, it took a full decade into the 20th century before Patterson &amp; Sons felt any economic impact. The year 1910 proved to be a turning point—C.R. Patterson died. Frederick, already heavily involved with designing and building of their products, took over management of the firm.</p><p>Unlike today, where there are 1.88 vehicles per household according to the US Department of Transportation, at this point in the US there was one car for every 800 people; that’s up from one car for every 65,000 people eight years before. During that time, Patterson &amp; Sons had already built up a side business of servicing automobiles—something that wasn’t unusual in the early days of motoring. Initially, this involved restoring paint and upholstery, but eventually the work included electrical and mechanical jobs. Frederick Patterson knew that the time had come for his carriage company to do what so many others had already done—build a horseless carriage.</p></div><nav>Page: <span>1 <a href=\"https://arstechnica.com/cars/2021/03/the-life-and-times-of-c-r-patterson-sons-the-first-black-owned-us-automaker/2/\">2</a> <a href=\"https://arstechnica.com/cars/2021/03/the-life-and-times-of-c-r-patterson-sons-the-first-black-owned-us-automaker/2/\"><span>Next <span>→</span></span></a></span></nav></section></div></div>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2f7bfb6f52e7145dc89aa157b01423f4e03cc9cbcb14ce721b434613d9a5931e","category":"Tech"}