{"title":"Zipp launches new 454 NSW, 404 Firecrest, and 858 NSW go-fast aero wheels","link":"https://cyclingtips.com/2021/06/zipp-launches-new-454-nsw-404-firecrest-and-858-nsw-go-fast-aero-wheels/","date":1624370404000,"content":"<div><div><p>Zipp’s latest generation of wheels — <a href=\"https://cyclingtips.com/2021/04/zipp-new-353-nsw-wheelset/\" target=\"_blank\">the 353 NSW</a>, the <a href=\"https://cyclingtips.com/2020/05/2021-zipp-303-firecrest/\" target=\"_blank\">303 Firecrest</a>, and the <a href=\"https://cyclingtips.com/2020/05/new-zipp-303-s-aero-wheels-are-wider-hookless-tubeless-cheaper-disc-only/\" target=\"_blank\">303-S</a> — have all featured aero shapes, but they’ve also been very progressively wide, disc-brake-only, and tubeless-only. Now joining that trio are three new models that follow in the same vein: the 454 NSW, the 404 Firecrest, and the 858 NSW.</p><h2>The second-generation 454 NSW is slower, but faster</h2><p>The new 454 NSW Tubeless Disc-Brake wheels (yes, that’s the official name) are designed to be the ideal all-rounder for road, paved or otherwise — if you could only afford one model in the Zipp family for your high-performance drop-bar bike, this would be it. </p><p>Although this wheel shares its model name with the original 454 NSW, there’s not a whole lot of resemblance. The new rim still features a sawtooth-like rim profile with an undulating 53-to-58 mm depth that Zipp still claims to offer superior crosswind stability as compared to a more conventional design (and based on my anecdotal experience with <a href=\"https://cyclingtips.com/2018/01/zipp-454-nsw-review/\" target=\"_blank\">the older 454 NSW</a> and <a href=\"https://cyclingtips.com/2018/09/princeton-carbonworks-wake-6560-wheelset-review-small-company-big-claims/\" target=\"_blank\">similar wheels from Princeton Carbon</a>, I’m inclined to agree). However, the new rim is a whole lot wider with a 23 mm internal width and 30.5 mm external one, and the clincher version is now tubeless-only — and disc-only — with a hookless tire bed.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-454-NSW-1-1340x754.jpg\"><figcaption>The new Zipp 454 NSW looks to be quite the excellent all-rounder – as it should be given the asking price. Photo: Zipp.</figcaption></figure><p>Despite the inflated dimensions, it’s also more than 450 g lighter with a claimed weight of just 1,358 g (631 g front, 727 g rear, without tubeless rim tape but with SRAM XDR driver body).</p><p>Zipp laces this rim to its updated Cognition V2 disc-brake hubs. The old magnetic pawl system of the original Cognition driver mechanism has been replaced with a “Sylomer” polymer leaf spring design, which Zipp claims to not only be 10 g lighter, but spins with “23% lower coasting friction” and offers faster engagement (6.67° vs. 10°) to boot. Zipp doesn’t make any mention of this, but the simpler design also uses a lot fewer parts and will likely be more reliable, too.</p><p>Zipp may be looking at more than just aerodynamic efficiency in its road wheels these days, but the company’s primary focus in this area is still figuring out how riders can eke out more speed from the same output, and to that end, the 454 NSW is certainly claimed to be a whole lot faster than the previous version. As compared to the original 454 NSW, the new one will supposedly save 10 watts of effort when traveling at 40 km/h (which, in all honesty, is a pretty attainable speed, even for a solo rider of fairly average fitness).</p><p>Interestingly, that improvement is despite the wheels actually being more than 3 W <em>slower </em>when viewed purely in terms of aerodynamic efficiency when tested with the same 25 mm (printed width) tires; all of the overall speed gains are coming from rolling resistance and weight improvements.</p><p>Speaking of aerodynamics, it’s worth noting that although Zipp says the new 454 NSW is optimized for a 25 mm (printed width) tire, the “<a href=\"https://blog.silca.cc/part-5-tire-pressure-and-aerodynamics\">105% rule</a>” suggests that a 28 mm tire would give up very little (if anything) in terms of drag.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-454-NSW-2-1340x649.jpg\"><figcaption>The Sawtooth rim profile sure seems like a gimmick. But after riding earlier versions, the design seems a lot less like a gimmick, and more like something with real performance benefits, particularly in terms of crosswind stability. Photo: Zipp.</figcaption></figure><p>Retail price for the Zipp 454 NSW is US$4,000 / AU$6,027 / £3,200 / €3,600.</p><p>Just to be clear, there is no rim-brake model for the new 454 NSW. However, SRAM has added a tubular version with the same undulating 58/53 mm rim profile and updated Cognition V2 hubset to satisfy its sponsored teams and athletes. Interestingly, though, claimed weight on the tubular version is actually 105 g heavier than the tubeless clincher version at 1,463 g.</p><h2>New 404 Firecrest follows in the footsteps of the 303 Firecrest</h2><p>Following the lead of Zipp’s versatile 303 Firecrest model, the new 404 Firecrest Tubeless Disc-Brake wheelset looks beyond just aerodynamic performance with a new focus on rolling efficiency and reduced weight. Rim depth remains the same at 58 mm, but the newly hookless internal width grows from 19 mm to 23 mm, and the external width is slightly more generous at 27.5 mm. Like nearly all of Zipp’s latest generation of road wheels, the 404 Firecrest is also disc-brake-only and tubeless clincher only.</p><p>As with the new 454 NSW, the revamped 404 Firecrest is less aerodynamically efficient than the current version (although, in this case, the claimed difference is just 0.9 W). However, the rolling efficiency gains that come with that broader internal rim width (and lower recommended inflation pressures) nevertheless give the new 404 Firecrest a 4 W total saving for an 85 kg rider (including bike) traveling at 40 km/h. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-1-1340x754.jpg\"><figcaption>Zipp’s revamped 404 Firecrest wheelset is basically a deeper version of the most recent 303 Firecrest, complete with a dramatically more generous internal width, tubeless-only tire compatibility, and major weight loss.</figcaption></figure><p>Unlike the new 454 NSW, though, the revamped 404 Firecrest’s more modest 27.5 mm external width means these are more purpose-built (at least in terms of aerodynamics) for tires no wider than about 26 mm.</p><p>The new hookless design does lop off a lot of mass, though. Actual weight for a set of 404 Firecrests is 1,508 g (691 g front, 817 g rear, with tubeless tape and a SRAM XDR driver body) — a saving of about 370 g.</p><p>Anchoring the new 404 Firecrest wheels is Zipp’s new “engineered in Germany” ZR1 DB hubset, which the company says incorporates updated seals for improved all-weather durability, plus a new six-pawl drive mechanism that offers a speedier 5.5° engagement speed.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-10-1340x754.jpg\"><figcaption>The rear hub on the 404 Firecrest uses a conventional six-pawl driver mechanism.</figcaption></figure><p>Although the 404 Firecrest may not be quite as efficient, light, or neat-looking as the 454 NSW, it sure is a heck of a lot less expensive. Retail price is a comparative bargain at US$1,900 / AU$2,863 / £1,600 / €1,800.</p><h2>Tri- and TT-focused 858 NSW gets a hub update</h2><p>Last but not least, Zipp’s most aggressive 858 NSW carries on with the same 77/82 mm undulating rim depth, 18 mm internal width, hooked rim profile, and tubeless clincher compatibility as the current model, but now with the same updated Cognition V2 hubset as the new 454 NSW. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-858-NSW-2-1340x754.jpg\"><figcaption>Zipp’s 858 NSW rim hasn’t changed, but given what’s been going on with the rest of the lineup, it seems like only a matter of time before it receives similar updates. Photo: Zipp.</figcaption></figure><p>Claimed weight is 1,773 g (838 g front, 935 g rear, without rim tape, with SRAM XDR driver body). Retail price is US$4,400 /  AU$TBC / £3,930 / €4,400.</p><p>All of Zipp’s new carbon wheelsets are supposedly available now, and also include the company’s latest lifetime warranty policy, which covers the original owner for “damage during intended use per the user manual, as well as defects in materials or workmanship, for the lifetime of the product.”</p><h2>Reviews pending</h2><p>Zipp sent samples of the new 404 Firecrest ahead of the official release date, but I’ve only ridden them enough for some initial impressions — and truth be told, it’s all quite favorable at the moment. Tests will be ramping up in earnest in the coming weeks, though, so stay tuned for a more complete report shortly.</p><p>For more information, visit <a href=\"https://www.sram.com/en/zipp\" target=\"_blank\">www.zipp.com</a>. </p><figure><ul><div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-353-NSW-10-1340x754.jpg\"><figcaption>The updated Axial Clutch design supposedly runs with less friction, but what’ll likely be more significant to owners is that the simpler parts layout should be more reliable over the long haul. Photo: Zipp.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-353-NSW-11-1340x754.jpg\"><figcaption>Unlike most hub driver designs, removing the freehub body on the Cognition v2 hub doesn’t reveal much. There’s more disassembly required to really get into the guts.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-353-NSW-12-1340x754.jpg\"><figcaption>Note how the spoke flanges have an undulating profile similar to the rim.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-353-NSW-13-1340x754.jpg\"><figcaption>Sapim bladed stainless steel spokes are used all around.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-353-NSW-14-1340x754.jpg\"><figcaption>SRAM offers complete wheelsets with either SRAM/Shimano HG or SRAM XDR freehub bodies. Campagnolo ones are offered, too, but they need to be purchased separately.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-2-1340x754.jpg\"><figcaption>You didn’t think Zipp was going to give up on its dimpled rim texture, did you?</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-3-1340x754.jpg\"><figcaption>The 23 mm inner width decreases rolling resistance relative to narrower setups, while the hookless profile supposedly makes for a stronger rim, too.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-5-1340x754.jpg\"><figcaption>The 72.5 psi maximum recommended pressure is mandated by ETRTO, not Zipp.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-6-1340x754.jpg\"><figcaption>The hookless profile also makes for a very smooth transition between the tire and rim.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-8-1340x754.jpg\"><figcaption>The big decals are easy to remove if you want, while the external nipples are refreshingly easy to service.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-9-2-1340x754.jpg\"><figcaption>The 404 Firecrest rear hub sports a smooth, oversized hub shell.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-9-1340x754.jpg\"><figcaption>Hubs are offered exclusively with a splined rotor interface, although six-bolt rotors will work with an adapter.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-11-1340x754.jpg\"><figcaption>All of the pawls are held in place with a spring clip so there’s no fear of one shooting off into parts unknown when you remove the body.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-12-1340x754.jpg\"><figcaption>Interestingly, there’s no sleeve in between the two freehub body bearings like you usually see in four-bearing rear hubs.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-13-1340x754.jpg\"><figcaption>Both the front and rear wheels are laced in a 24-hole, two-cross pattern.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-404-Firecrest-14-1340x754.jpg\"><figcaption>Bladed Sapim stainless steel spokes are used all around.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-Aero-vs.-rolling-resistance-data-1-1340x754.jpg\"><figcaption>Zipp is claiming some big efficiency gains with the new 454 NSW and 404 Firecrest wheels. Photo: Zipp.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-Aero-vs.-rolling-resistance-data-2-1340x754.jpg\"><figcaption>Interestingly, both the new 454 NSW and 404 Firecrest are less aerodynamic than their forebears. Photo: Zipp.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-Aero-vs.-rolling-resistance-data-3-1340x754.jpg\"><figcaption>The wider rim profiles on the new 454 NSW and 404 Firecrest yield big claimed rolling efficiency gains, though. Photo: Zipp.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Zipp-recommended-tire-pressure-chart-1340x754.jpg\"><figcaption>Zipp’s recommended tire pressure chart is interesting for how much lower the numbers are as compared to what a lot of people are probably running. But what’s also interesting is the crossover point for where people might want to consider a 28 mm tire instead of a 25 mm one. Photo: Zipp.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Zipp-858-NSW-1-1340x754.jpg\"><figcaption>Zipp’s 858 NSW wheelset soldiers on unchanged except for the updated rear hub internals. Photo: Zipp.</figcaption></figure></li></div></div></ul></figure></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"30cb079f3ecf618459105f74614028a89c6c1456f23ca7e848a1a7ea72528f2c","category":"Cycling"}