{"title":"Apple Discontinuing Full-Sized HomePod to Focus on HomePod Mini","link":"https://www.macrumors.com/2021/03/12/apple-discontinuing-homepod/","date":1615598062000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/12/apple-discontinuing-homepod/\"><p>Apple is planning to discontinue the standard <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> to focus exclusively on the <a href=\"https://www.macrumors.com/roundup/homepod-mini/\">HomePod mini</a>, reports <em><a href=\"https://techcrunch.com/2021/03/12/apple-discontinues-original-homepod-will-focus-on-mini/\">TechCrunch</a></em>. First introduced four years ago, Apple's larger ‌HomePod‌ has never sold well because of its high price tag.</p><p><img alt=\"HomePodandMini feature\" width=\"1436\" height=\"808\" src=\"https://images.macrumors.com/t/YHoUeTU6kEICPtg3zkUyXQRJTOE=/400x0/filters:quality(90)/article-new/2020/10/HomePodandMini-feature.jpg?lossy\" data-src=\"https://images.macrumors.com/t/YHoUeTU6kEICPtg3zkUyXQRJTOE=/400x0/filters:quality(90)/article-new/2020/10/HomePodandMini-feature.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/YHoUeTU6kEICPtg3zkUyXQRJTOE=/400x0/filters:quality(90)/article-new/2020/10/HomePodandMini-feature.jpg?lossy 400w,https://images.macrumors.com/t/9tlGvOYIP7SJC3NO-aGM2Vou5og=/800x0/filters:quality(90)/article-new/2020/10/HomePodandMini-feature.jpg?lossy 800w,https://images.macrumors.com/t/q89L9JngwrlC33LgTqf-3CaBNoo=/1600x0/filters:quality(90)/article-new/2020/10/HomePodandMini-feature.jpg 1600w,https://images.macrumors.com/t/qdO0dHfwkpmR5XO2Ah8qXZuoDRM=/2500x0/filters:no_upscale():quality(90)/article-new/2020/10/HomePodandMini-feature.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/YHoUeTU6kEICPtg3zkUyXQRJTOE=/400x0/filters:quality(90)/article-new/2020/10/HomePodandMini-feature.jpg?lossy 400w,https://images.macrumors.com/t/9tlGvOYIP7SJC3NO-aGM2Vou5og=/800x0/filters:quality(90)/article-new/2020/10/HomePodandMini-feature.jpg?lossy 800w,https://images.macrumors.com/t/q89L9JngwrlC33LgTqf-3CaBNoo=/1600x0/filters:quality(90)/article-new/2020/10/HomePodandMini-feature.jpg 1600w,https://images.macrumors.com/t/qdO0dHfwkpmR5XO2Ah8qXZuoDRM=/2500x0/filters:no_upscale():quality(90)/article-new/2020/10/HomePodandMini-feature.jpg 2500w\"><br>Apple hoped that the ‌HomePod‌'s high-quality sound profile would give it an edge over competing products, but sales of the ‌HomePod‌ have always been lackluster with so many more affordable options on the market. Apple has been selling the ‌HomePod‌ for $299, but it was originally priced at $350. The ‌HomePod mini‌ is available for $99.</p><p>In a statement, Apple said that the ‌HomePod‌ will continue to be available while supplies last through the Apple Online Store and <a href=\"https://www.macrumors.com/guide/apple-retail/\">Apple retail</a> stores.</p><blockquote><p>‌HomePod mini‌ has been a hit since its debut last fall, offering customers amazing sound, an intelligent assistant, and smart home control all for just $99. We are focusing our efforts on ‌HomePod mini‌. We are discontinuing the original ‌HomePod‌, it will continue to be available while supplies last through the Apple Online Store, Apple Retail Stores, and Apple Authorized Resellers. Apple will provide ‌HomePod‌ customers with software updates and service and support through Apple Care.<br></p></blockquote><p>On Thursday, many tech sites noticed that the full-sized Space Gray ‌HomePod‌ <a href=\"https://www.macrumors.com/2021/03/11/space-gray-homepod-shortage/\">was out of stock</a> in the United States, but it was believed to be just a stock shortage. As it turns out, it was because Apple no longer plans to sell the ‌HomePod‌.<br></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/09/apple-silicon-macbooks-production-report/\">Two New Apple Silicon MacBooks Expected to Enter Mass Production in Second Half of 2021</a></h3><p>Apple is planning redesigned 14-inch and 16-inch MacBook Pro models powered by Apple silicon for release in the second half of 2021, according to analyst Ming-Chi Kuo, and a Nikkei Asia report today lends credence to that timeframe. In a report focused on Apple slashing iPhone 12 orders from suppliers, the publication briefly noted that Apple has pushed back mass production of the two new...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/10/iphone-13-to-finally-feature-bigger-batteries/\">iPhone 13 to Finally Feature Bigger Batteries</a></h3><p>Apple appears to be improving the iPhone's battery life with the iPhone 13 lineup, using a number of design changes, bigger batteries, and efficiency improvements. In a recent investor note seen by MacRumors, reliable analyst Ming-Chi Kuo explained that all four of the iPhone 13 models will feature larger batteries with higher capacities:The new 2H21 iPhone models feature a larger battery ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/11/netflix-password-sharing-test/\">Netflix May Soon Crack Down on Password Sharing</a></h3><p>Thursday March 11, 2021 2:43 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Netflix may be cracking down on those who share passwords between separate households, according to a test found by The Streamable. Some Netflix subscribers have been getting a message about not living with the account holder when attempting to stream content. \"If you don't live with the owner of this account, you need your own account to keep watching,\" reads the warning message. From...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/10/leaked-renders-for-third-gen-airpods/\">Leaked Renders Claim to Show Third-Generation AirPods Design</a></h3><p>Wednesday March 10, 2021 3:14 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>A new set of renders claims to showcase the design of the upcoming third-generation AirPods, which could be announced during a rumored Apple event later this month. The renders were shared by Gizmochina, which claims to have received the renders from a \"supplier.\" The images depict AirPods with a shorter stem, similar to the AirPods Pro, and a smaller charging case. This information lines up ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/09/2021-ipad-pro-case-found-at-target/\">New 11-Inch iPad Case Found at Target as Rumors Swirl About Upcoming Refresh</a></h3><p>With rumors swirling about an upcoming iPad Pro refresh, which may be announced as part of an alleged Apple Event on Tuesday, March 23, it appears that at least one accessory maker has already started preparing. A photo shared on Reddit today shows what appears to be a Speck folio that is listed as being compatible with an as-yet-unannounced 2021 model of an 11-inch iPad, in addition to the...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/09/mini-led-ipad-pro-release-date-rumor/\">12.9-Inch iPad Pro With Mini-LED Display Said to Launch as Soon as Late March</a></h3><p>Taiwanese touch panel maker GIS plans to expand its backend module capacity for new products at its factory in Chengdu, China, according to industry sources cited in a report today from supply chain publication DigiTimes. One of the new products will likely be Apple's long-rumored 12.9-inch iPad Pro with a Mini-LED display, which is slated to launch at the end of March or early in the second ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/11/apple-employee-stole-trade-secrets-lawsuit/\">Apple Accuses Former Employee of Stealing Trade Secrets and Leaking Them to Media</a></h3><p>Thursday March 11, 2021 12:50 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today filed a lawsuit against Simon Lancaster, a former employee who allegedly used his position within the company to steal \"sensitive trade secret information\" from Apple that was then leaked to a journalist and published in rumor articles. Lancaster worked at Apple for more than a decade, using his seniority to attend internal meetings and access documents that Apple says were...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/iphone-13-touch-id-under-display/\">iPhone 13 Models Will 'Likely' Have Touch ID Under the Display</a></h3><p>iPhone 13 models slated for release later this year will \"likely\" feature a fingerprint scanner embedded under the display for authentication, in addition to Face ID, according to Barclays analyst Andrew Gardiner and three of his colleagues. In a research note shared with MacRumors today, the analysts added that iPhone 13 models will feature a smaller notch and that the LiDAR Scanner will...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"319320540af9a41e739a654bf7e84036c3918e0a2e35594709592c104a8bca43","category":"Apple"}