{"title":"Apple Clarifies When It Locks Your Apple ID Because You Owe Them Money","link":"https://9to5mac.com/2021/03/03/apple-card-apple-id-unrelated/","date":1614823383000,"content":"<div id=\"readability-page-1\" class=\"page\"><div itemprop=\"articleBody\"><p>Yesterday, <a href=\"https://9to5mac.com/2021/03/02/apple-id-held-hostage/\">we covered a story regarding</a> Dustin Curtis’s experience with his Apple ID getting disabled when a payment to his Apple Card failed. Apple has today shared a statement with 9to5Mac clarifying the situation. The company says that Apple Card and Apple ID are not linked in the way that the blog post alleged, and the company does not disable Apple ID services because of missed Apple Card payments.</p><p>The situation arose because the trade-in process was left unresolved, and Apple was following its standard procedures in matters of money owed; this is not anything specific to the Apple Card. When an account is marked as in bad standing, use of Apple ID services is restricted; things like Apple Music or App Store purchases. iCloud is wholly separate and is not disabled at all. You can read Apple’s full statement on the matter after the break.</p><p>When a customer makes a purchase using instant trade-in, the customer has around 14 days to send off the item to Apple. In most cases, the item is received and the sale completes.</p><p>However, if the item is not received, Apple communicates with the customer over email and phone. If the trade-in is still not completed, Apple charges the trade-in value back to the customer’s payment method on file, on the account that was used to buy the product from the store originally. However, if that charge fails, the account is marked as being in bad standing. Customers are prompted on multiple occasions to fix the billing issue or supply an alternative payment method instead.</p><p>If the issue persists, Apple disables all paid services for that Apple ID until the money is recovered — as the account is essentially in debt. This means things like Apple Music, the iTunes Store, and the App Store. (iCloud services are not disabled, so customers can still access their personal data like photos.)</p><p>In Curtis’s case, the payment method used was his Apple Card. However, Apple’s statement affirms that the above steps are not related to the Apple Card at all; it’s just following its standard retail store policies when customers do not pay outstanding invoices in a timely fashion. There is no change in procedure because an Apple Card was used, it would be the same for all payment methods.</p><p>Here’s Apple’s full statement:</p><blockquote><p>We apologize for any confusion or inconvenience we may have caused for this customer. The issue in question involved a restriction on the customer’s Apple ID that disabled App Store and iTunes purchases and subscription services, excluding iCloud. Apple provided an instant credit for the purchase of a new MacBook Pro, and as part of that agreement, the customer was to return their current unit to us. No matter what payment method was used, the ability to transact on the associated Apple ID was disabled because Apple could not collect funds. This is entirely unrelated to Apple Card.</p></blockquote><p>Obviously, Curtis was just trying to trade in his old laptop when buying an M1 Mac. For whatever reason, the trade-in process did not go through and was left unresolved. But, the consequences of that are unrelated to the fact he used an Apple Card to pay.</p><p><em>FTC: We use income earning auto affiliate links.</em> <a href=\"https://9to5mac.com/about/#affiliate\">More.</a></p><hr><p><a href=\"https://www.youtube.com/c/9to5mac?sub_confirmation=1\" target=\"_blank\" rel=\"noopener\">Check out 9to5Mac on YouTube for more Apple news:</a></p><p><iframe title=\"Recent Videos\" src=\"https://www.youtube.com/embed/j12FV-PP8pA?playlist=je4cF5d__mw,7XoQdxfOIJM,KrhDey_ugls,1qknuwb0LGM,OkUaGvW2bTI,HUs0yyvfyWU,Lf0of3Kavi4,NAPwFDryzGg,j_OtJ41PIcE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" width=\"1000\" height=\"563\"></iframe></p></div><div><h2>About the Author</h2><div><h3><span>Benjamin Mayo's favorite gear</span></h3></div></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"32dcc647c87cff88607c375e9e2df6841a70edfb06ee3565f469d6695ee4b599","category":"Tech"}