{"title":"One company wants to sell the feds location data from every car on Earth","link":"https://arstechnica.com/?p=1750420","date":1616098289000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>data for sale —</h4><h2 itemprop=\"description\">Federal agencies already buy tons of user data; one vendor is now being sued.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1042541428-800x533.jpg\" alt=\"Cars driving down I-80 in Berkeley, California, in May, 2018 when there were still places to go.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1042541428.jpg\" data-height=\"2667\" data-width=\"4000\">Enlarge</a> <span>/</span> Cars driving down I-80 in Berkeley, California, in May, 2018 when there were still places to go.</p></figcaption></figure><p>There is a strange sort of symmetry in the world of personal data this week: one new report has identified a company that wants to sell the US government granular car location data from basically every vehicle in the world, while a group of privacy advocates is suing another company for providing customer data to the feds.</p><p>A surveillance contractor called Ulysses can \"remotely geolocate vehicles in nearly every country except for North Korea and Cuba on a near real-time basis,\" <a href=\"https://www.vice.com/en/article/k7adn9/car-location-data-telematics-us-military-ulysses-group\">Vice Motherboard reports</a>.</p><p>Ulysses obtains vehicle telematics data from <a href=\"https://arstechnica.com/cars/2018/02/no-one-has-a-clue-whats-happening-with-their-connected-cars-data/\">embedded sensors and communications sensors that can transmit information</a> such as seatbelt status, engine temperature, and current vehicle location back to automakers or other parties.</p><p>\"Among the thousands of other data points, vehicle location data is transmitted on a constant and near real-time basis while the vehicle is operating,\" the company wrote in a sales pitch document obtained by Vice. As roughly 100 million new cars are manufactured worldwide each year which are \"increasingly connected to the manufacturer, other vehicles, infrastructure, and their owners it becomes apparent that telematics will revolutionize intelligence,\" the document adds. Ulysses claims it can currently access more than 15 billion vehicle locations around the world every month, and it estimates that, by 2025, 100 percent of new cars will be connected and transmitting gigabytes of collectible data per hour.</p><p>Vice said the office of Sen. Ron Wyden (D-Ore.), who serves on the Senate Intelligence Committee and often advocates for privacy issues, provided it with the document. \"Sen. Wyden is conducting an ongoing investigation into the sale of personal data, particularly via data brokers, to put some sunlight on this shady industry,\" Keith Chu, a representative for Wyden's office, told Vice. \"Our office is continuing to perform oversight into where data brokers are acquiring Americans' information, and who they're selling it to.\"</p><p>Ulysses does not currently have any contracts with the US government but has worked in the past with US Special Operations Command (SOCOM), Vice reports. That contract, which ran from 2016-2017, involved data SOCOM used \"to deepen our understanding on how foreign competitors used economic and financial tools against US interests\" in Central and South America and in Africa.</p><h2>Meanwhile, in California...</h2><p>If Ulysses does snag a federal contract, it would be joining a long line of other firms that sell personal user data to the government.</p><p>The Secret Service, Immigration and Customs Enforcement (ICE), and the IRS all <a href=\"https://arstechnica.com/tech-policy/2020/08/secret-service-other-agencies-buy-access-to-mobile-phone-location-data/\">purchase cell phone location data</a> that <a href=\"https://arstechnica.com/tech-policy/2021/01/military-intelligence-buys-location-data-instead-of-getting-warrants-memo-shows/\">might otherwise require a warrant</a> to obtain. Customs and Border Patrol (CBP) also <a href=\"https://arstechnica.com/tech-policy/2020/07/cbp-does-end-run-around-warrants-simply-buys-license-plate-reader-data/\">buys license plate-reader data</a>. The agencies that purchase data have contracts to access databases maintained by brokers that <a href=\"https://www.buzzfeednews.com/article/nicolenguyen/how-apps-take-your-data-and-sell-it-without-you-even\">collect information</a> from a wide variety of sources, then package and sell access to it.</p><p>The Washington Post <a href=\"https://www.washingtonpost.com/technology/2021/02/26/ice-private-utility-data/\">reported last month</a> that ICE also purchased access to a database chock-full of consumer information to track immigrants. The database ICE used, CLEAR, includes more than 400 million phone, water, electricity, and other utility documents the agency would otherwise not have been able to access on its own, according to the Post.</p><p>A coalition of privacy advocates in California is now <a href=\"https://www.washingtonpost.com/politics/2021/03/18/technology-202-activists-are-suing-thomson-reuters-over-its-sale-personal-data/\">suing Thomson Reuters</a>, which operates CLEAR, alleging that it violates state privacy law by collecting and sharing personal information without individuals' consent.</p><p>\"When we look at the ways that these data brokers are remaking our country, the Fourth Amendment concerns are terrifying,\" Surveillance Technology Oversight Project executive director Albert Fox Cahn, who is participating in the suit, <a href=\"https://www.washingtonpost.com/politics/2021/03/18/technology-202-activists-are-suing-thomson-reuters-over-its-sale-personal-data/\">told the WaPo</a>. \"But the way that they're allowing companies to track millions without the most basic consent is deeply alarming as well.\"</p><p>Sen. Wyden also told the Post he plans to introduce federal legislation soon to close the loopholes that allow such data sales. \"I do think that there's going to be a new focus on privacy in this session,\" Wyden said. \"I think as more and more states pass privacy legislation, pressure builds for Congress to finally pass federal legislation.\"</p></div></div>","author":"Kate Cox","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"35427007ddb1f3c85774aa89058647cfea673bdd508489da9b4f39a0a59b39a6","category":"Tech"}