{"title":"Xbox takes back-compat to new extremes, tricks old games to run faster","link":"https://arstechnica.com/?p=1743089","date":1613590198000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Blast processing 2.0 —</h4><h2 itemprop=\"headline\">Xbox’s new “FPS Boost”: A neat engineering trick for older games on Series X/S</h2><h2 itemprop=\"description\">\"FPS boost\" skips code injection, delivers doubled performance—for some weird games.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/xbox-fps-guage-green-800x450.jpg\" alt=\"Xbox takes back-compat to new extremes, tricks old games to run faster\"><figcaption><p>Aurich Lawson / Getty Images</p></figcaption></figure><p>Getting older video games to run on newer consoles may seem like a simple idea: the new boxes are faster, so older, weaker games should just work, right? Things never quite work out that way, especially when architecture changes dramatically between console generations, which is why we've been fascinated by Team Xbox's focus on \"backwards compatibility.\"</p><p>Microsoft's engineering team has already gotten <a href=\"https://arstechnica.com/gaming/2017/06/xbox-expanding-backwards-compatibility-program-to-original-xbox-games/\">hundreds of past-gen games to work on the Xbox One family</a> (and <a href=\"https://arstechnica.com/gaming/2020/08/how-your-ps4-and-xbox-one-games-will-work-on-ps5-and-series-x/\">beyond</a>). Now, the engineers have broken ground on a completely different vision for back-compat: making games from the past, particularly the wimpy base Xbox One, render more fluidly on Series X/S. This new feature, dubbed \"<a href=\"https://news.xbox.com/en-us/2021/02/17/making-backward-compatible-games-even-better-with-fps-boost/\">FPS Boost</a>,\" is particularly interesting because it requires zero code updates injected into older games.</p><h2>Not remasters; more like ReShades</h2><p>Unfortunately, Microsoft's announcement about the feature on Wednesday fails to explain exactly how it works. Instead, it leaves the storytelling duties to the frame analysts at Digital Foundry, who got exclusive dibs on the story. In <a href=\"https://www.youtube.com/watch?v=7dxJFCgkNws\">a Wednesday video breaking down how the feature works</a>, John Linneman confirms that Xbox Series consoles, while processing older games' code,&nbsp;can \"send data back from Direct3D [a longstanding API used in both Xbox consoles and Windows games] to the game faster than the original [consoles] did.\"</p><p>As a result, all internal game logic continues to render at its original target frame rate, yet the crucial stuff for 3D frame-rate performance, from animations to camera movement, can get a frame rate boost without breaking the underlying game. Linneman reports that this happens without either game code modifications or INI adjustments. During the broadcast, Digital Foundry's Richard Leadbetter chimes in to compare this to the PC-gaming ecosystem of mods, particularly popular post-processing injector mods like ReShade that fans often apply to PC versions left unattended by their creators (cough, cough, <em>Nier Automata</em>).</p><p>Digital Foundry's video joins us at Ars Technica in raising a serious eyebrow at how this feature is rolling out: in the form of five relatively low-profile games, all from the Xbox One generation. The below listed boosts apply to&nbsp;<em>both</em> Series X and Series S consoles.</p><ul><li><em>UFC 4</em> (boosting from 30fps to 60fps)</li><li><em>New Super Lucky's Tale</em> (from 60fps to 120fps)</li><li><em>Far Cry 4</em> (from 30fps to 60fps)</li><li><em>Watch Dogs 2</em> (from 30fps to 60fps)</li><li><em>Sniper Elite 4</em> (from 30fps to 60fps)</li></ul><p>Three of the listed games never received <a href=\"https://arstechnica.com/gaming/2018/04/surprise-red-dead-redemption-is-getting-a-4k-patch-on-xbox-one-x-today/\">an Xbox One X-compatibility patch</a>, and FPS Boost does <em>not</em> affect resolution. Thus, games like <em>Watch Dogs 2</em> and <em>Far Cry 4</em>&nbsp;continue to operate at base Xbox One resolutions while getting a boost in frame rate. Still, the results are impressive in terms of a set-it-and-forget-it patch to boost fluidity for older games, and keeping those boosted frame rates locked and steady, without breaking anything.</p><p>(<em>UFC 4</em> is a bit more confusing in terms of its boosts, so I'll quickly clarify: its existing version offered a lower-resolution 60fps mode on Xbox One X, and was locked to 30fps on base Xbox One. Now, both Series X/S can access 60fps modes, while Series X can get up to 1800p resolution at that frame rate.)</p><p>Also, none of the above games are formally published by Microsoft, which may be a power play to impress upon fans that these patches might soon show up for&nbsp;<em>any</em>&nbsp;older game, long left unpatched by original publishers—though Linneman confirms that Microsoft has testing to do on a game-by-game basis in terms of glitches introduced by this injection process. Still, if the $299 Series S is poised to benefit from such boosts at lower rendering resolutions, a larger FPS Boost ecosystem will make its value proposition all the greater for anybody less interested in pixels and more interested in sheer performance-per-dollar.</p><p>These updates are set to roll out today across Xbox Series consoles, while new per-game series of visual toggles will roll out \"this Spring\" according to Microsoft. This menu will include FPS Boost, <a href=\"https://arstechnica.com/gaming/2020/11/xbox-series-x-s-review-beautiful-powerful-but-whatcha-gonna-play/5/\">Auto-HDR</a>, and, according to Linneman, perhaps other options like anisotropic filtering.</p><p>As Linneman and Leadbetter point out, Microsoft had already teased plans to update frame rates for existing software, particularly <em>Fallout 4</em> (a game that Microsoft now technically owns publishing rights to, thanks to <a href=\"https://arstechnica.com/gaming/2020/09/microsoft-purchases-bethesda-softworks-in-industry-changing-acquisition/\">that Zenimax/Bethesda acquisition</a>). But <em>FO4</em> didn't appear in today's presentation, and it's unclear whether its frame rate plans require a full code rewrite, or if they'll leverage this clever FPS Boost trickery. Exactly how many more games we may see upgrades for remains unclear, beyond a promise of \"revealing more FPS Boost games soon,\" and we've yet to hear any pledges about FPS Boost possibly coming to Xbox 360 or OG Xbox games. But it's hard to imagine Microsoft building system-level teases about such upgrades and then only upgrading, say, a dozen older games, so we look forward to more frame rate updates to come.</p></div></div></div>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"362b9b6e22f0149f293cf8436d32d6b32a4045ea64f82231d33ae2af174f2667","category":"Tech"}