{"title":"Cadex 36 Disc wheelset review: lots of stiffness, little weight","link":"https://cyclingtips.com/2021/05/cadex-36-disc-road-wheelset-review/","date":1621962012000,"content":"<div><div><p>Today, Cadex Cycling, the premium performance component brand from Giant Bicycles, has released a new carbon fibre disc brake wheelset. With a 36 mm rim profile, the 36 Discs are now the shallowest option in the Cadex range and claim to set a benchmark for stiffness-to-weight when compared to other premium and feathery wheels from Roval, Bontrager and Zipp. </p><p>While Cadex’s previous wheel release saw rim- and disc-brake formats along with tubular and tubeless options, this new model is only for use with disc brakes and tubeless tyres (tube inside optional). </p><p>Talk of wheel stiffness isn’t something we hear much of these days – many brands instead talk about drag, grams and stability. However, as my testing of these wheels over the past couple of weeks has reminded me, there’s an instinct gratification related to riding such a light and tight wheel. </p><h2>An intro to the Cadex 36 Disc </h2><div><h2>Story Highlights</h2><ul><li><strong>What:</strong> Cadex’s new lowest-profile and lightest disc brake, tubeless wheelset.</li><li><strong>Key features:</strong> Carbon fibre spokes for low weight and high stiffness, hookless 22.4 mm rims, 36 mm rim depth, hybrid ceramic hub bearings.</li><li><strong>Weight:</strong> 1,310 g (actual, with rim tape and tubeless valves).</li><li><strong>Price:</strong> $1,500 / AU$1,960 front, US$1,950 / AU$2,540 rear. US$3,450 / AU$4,500 for the pair.</li><li><strong>Highs:</strong> Incredible stiffness under pedaling and cornering, low weight, secure and easy tubeless setup, attractive looks, ease to maintain hub mechanism, truly built as a wheel package, included wheel bags (unpadded) and tablet case.</li><li><strong>Lows:</strong> Stiffer ride quality, locked into tubeless tyres, likely poor aerodynamics with modern width tyres.</li></ul></div><p>It’s been two years since <a href=\"https://cyclingtips.com/2019/07/giant-cadex-components-2020/\" target=\"_blank\">Cadex Cycling launched with its 45 and 65 wheels</a> that sought to take a price-almost-no-object approach to design and manufacturing. The most obvious attribute of those wheels was the carbon fibre spokes, and such a component went a long way toward Cadex hitting impressively low weight figures while still claiming to be competitive in aerodynamics, serviceability, and stiffness. </p><p>Those spokes are effectively forged carbon with aluminium ends. The metal ends feature a cone shaping that’s mechanically fitted with the carbon, pulled into one another with some 400 kilograms of force. And where many wheelsets using carbon spokes bond them as one to rims, Cadex’s approach means the spokes can be replaced and the rims trued (this is done from inside the rim). </p><p>According to Cadex, the new 36 Disc wheelset is an evolution based on what the company has learned. Where the 65 was a dedicated aero wheel and the 42 an all-round racing wheel, the 36 is aimed to be the even-lighter do-it-all wheel that still has some aerodynamic benefit. The company claims some of its athletes will use the wheel for gravel races, while others are likely to pick it for long days in the mountains. </p><p>As with Cadex’s other wheels, both front and rear rims are matched to each other. Cadex sells its front and rear wheels separately so you can mix and match as you choose with other available depths. </p><p>The new 36s retain the tubeless-tyres-required hookless bead and grow out the width compared to the 42s. The rims now sit at 22.2 mm (22.4 mm claimed) wide internally – a somewhat middle of the road width for 2021 that Cadex says is what they’re all in with for road wheels moving forward.  Meanwhile the 26 mm external width comes with a somewhat traditional rim profile that’s more triangular than it is U-shaped. Cadex recommends tyres ranging from 25 to 32 mm for these rims. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-17-1340x754.jpg\"><figcaption>Giant and Cadex suggest they’re all-in with hookless technology.</figcaption></figure><p>There’s arguably no rim width that’s always going to be the best for everyone in every situation. Brands such as Enve and Zipp suggest that an approximate 25 mm internal rim width with no narrower than a 28 mm tyre is the future of going fast. Meanwhile, there’s Campagnolo, Shimano, Mavic, and yes, Cadex, who believe catering for narrower tyres is still the fastest option. To this end, Cadex suggests these wheels are optimised for 25 mm rubber.</p><p>When asked about wider external width rims, Cadex’s head of product and marketing, Jeff Schneider, suggested that going wider can be beneficial at certain yaw angles, but not necessarily across a wide-ranging average of wind directions. </p><p>Going with a wider tyre on the 36s will arguably break some well-proven aerodynamic concepts (namely the <a href=\"https://blog.silca.cc/part-5-tire-pressure-and-aerodynamics\" target=\"_blank\">105% “rule”</a>), but then, you’re probably not picking such a shallow wheel if you’re focused on cheating the wind. And judging by Cadex’s complete lack of provided aero data, that’s not the point of these wheels.  </p><h2>Stiffness and weight </h2><p>Ok, let’s talk weight as that’s surely a common reason to run a shallower rim. With the supplied tubeless rim tape and alloy tubeless valves, I weighed the front wheel at 590 g and the rear at 720 g. That’s a paired weight of 1,310 g and ready for tyres. </p><p>According to Schneider, the weight was hit without compromising on performance. A large part of that is the carbon spokes (21 front, 24 rear) that drop 46% of the weight compared to a common DT Swiss Aerolite or similar bladed steel spoke. Meanwhile the rim’s carbon layup is laser cut for precision and a high-grade UV-protected resin is used which results in unpainted rims. “Painted rims allow for a higher yield because you can fill in defects, but of course, that covering adds weight,” said Schneider. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-14-1340x754.jpg\"><figcaption>The carbon spokes are a central feature (pun intended).</figcaption></figure><p>The weight of the 36 Disc is impressively low, but not the lowest. For example, Roval’s marginally shallower (and tube-only) <a href=\"https://cyclingtips.com/2020/06/roval-ditches-tubeless-with-its-new-rapide-and-alpinist-clx-wheels/\" target=\"_blank\">Alpinist wheels</a> tip the scales at 1,248 g (tape included), Bontrager’s Aelous RSL 37 wheels are 1,325 g, while <a href=\"https://cyclingtips.com/2021/04/zipp-new-353-nsw-wheelset/\" target=\"_blank\">Zipp’s new 353 NW wheels</a> are claimed to weigh 1,255 g (no tape or valves included). However, where Cadex claims to have these competitors beat is in wheel stiffness. </p><p>“To measure the [lateral] stiffness you’re taking the wheel and mounting it at the hub, and then you’re adding a load to the rim to see how much deflection there is,” explained Schneider of the common test. “It’s a pretty simple test; it just gives you the static stiffness.”</p><p>Measuring the pedalling or transmission stiffness is a little more complicated. “We lock the rim in place and then see how much the hub is rotating within the system,” or in other words, how much spoke wind up there is. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-wheel-stiffness-comparison-1340x811.jpg\"><figcaption>Cadex’s provided stiffness data points to big stiffness gains over other popular lightweight options.</figcaption></figure><p>Of course, Cadex’s carbon spoked wheels offer measurably greater lateral and transmission stiffness than the compared steel-spoked wheels. And that stiffness sees them excel in a stiffness-to-weight ratio with those closely weighted wheels. However what isn’t provided is how Cadex’s 36 Disc wheels compare to ultra-high-priced (and vastly more expensive) carbon spoked wheels from the likes of Lightweight and Partington. My hunch is the percentage differences won’t be much. </p><p>So is a stiffer wheel actually faster? Honestly I can’t answer that, but I suspect the answer will be a very familiar “it depends”. A stiffer wheel is quite likely to be faster in a flat-out uphill attack on a beautifully sealed road, but then that speed may be traded off on rough terrain. And I base that on my ride experiences with these flashy hoops. </p><h2>A faster hub with a proprietary ratchet </h2><p>At the centre of these new wheels sits Cadex’s own aluminium hub shells with a proprietary ratchet-ring freehub mechanism in the rear. It’s the same hub as used in the 42 and 65 wheels, but this time Cadex has upgraded all the bearings to a hybrid ceramic for even smoother rolling. </p><p>The freehub mechanism is comparable to DT Swiss’ newer EXP ratchet system. Here, a loose 30T ratchet ring and spring mesh with a fixed-position ratchet ring within the hub body. And as with DT Swiss’ designs, you can simply pull on the freehub body to access the internals. Cadex offers the freehub to suit Shimano, SRAM XDR and Campagnolo (road style). </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-wheelset-rear-hub-ratchet-internal-details-1-1340x754.jpg\"><figcaption>A look inside. It’s quite similar to what DT Swiss offers.</figcaption></figure><p>Giant has a long history with using DT Swiss’ hub internals and so it’s interesting to see the brand go its own path. According to Schneider, Cadex’s own ratchet system can handle a 40% higher load than a DT Swiss 18T Star Ratchet. Also the force required to click (aka back drag) the freehub body is said to be measurably lower, too (measured while isolated from bearing friction). </p><h2>Tyre fitment and safety measures </h2><p>Getting the wheels ride-ready was a simple affair and Cadex’s own tyres (manufactured by Maxxis) provide a matched fit that are a positive poster child for road tubeless. </p><p>I was able to get Cadex’s Race tyres on the rims with good technique and a little pressure – no tyre levers required. They inflated immediately with a regular floor pump and there was no mistaking that the tyre beads had seated as they loudly snapped into place. I’m also impressed by the air retention on offer. I measured little pressure drop over the course of a week. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-wheels-Cadex-race-tyres-review-cyclingtips-3-1340x754.jpg\"><figcaption>Much like what Mavic did in the past with its road tubeless, Cadex has created a wheel system that’s designed to ensure easy and reliable tubeless use.</figcaption></figure><p>It’s been three years since Giant went all-in on road tubeless with its bikes, and clearly Cadex is aligned with that philosophy. A big part of that has been a focus on safety and Cadex (well, in this case Giant) says it’s being proactive in trying to progress the industry’s move to tubeless. They’ve supplied wheels to all major tyre manufacturers and have been working with them to create compatible products. And Cadex holds its ETRTO-compliant rim sizing to far tighter tolerances than the standard requires.</p><p>Giant and Cadex each offer detailed <a href=\"https://www.cadex-cycling.com/au/hookless-rim-technology\" target=\"_blank\">approved and non-approved tyre lists</a> for their respective wheels and more models are actively being added. However the practicalities of the company’s safety tests are debatable. For example, one test requires the tyre to be inflated to 1.5x its maximum stated pressure and left for 24 hours. If the bead doesn’t fail then that test is a pass. Some tubeless tyres have crazy-high maximum pressures printed on them, so they’re likely to fall short even though at real-world pressures they’d be fine. </p><p>Confusingly, printed on the sidewalls of the tested Cadex Race 28 mm tyres is an 85-115 psi pressure range. These pressures are silly-high for the size. I doubt anyone at the company would be rolling on these pressures themselves. Oddly, Cadex’s own website states this printed range is the max, which suggests they want you to run below 85-115 psi. Tickle me confused. I personally ran just shy of 60 psi in these tyres and didn’t think twice about the holding security. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-wheels-Cadex-race-tyres-review-cyclingtips-1-1340x754.jpg\"><figcaption>The listed pressures are a little impractical given a few competing hookless wheels carry a 72.5 psi maximum pressure.</figcaption></figure><p>Speaking of security, those beads really do seem to lock against the hookless rim and it requires a decent amount of force to unseat the bead from the rim. I’ve seen such tight fits become problematic once dried-up sealant gets involved so, if you’re not doing big kilometres, it may be a good idea to unseat and reseat the tyre beads every few months to ensure you’re not trying to fight them out on the road if your tyre sealant and tubeless plugs ever fail to fix a flat. </p><h2>Riding the Cadex 36 Disc wheels </h2><p>In the few weeks I’ve had these wheels I’ve managed to get a pretty clear feel for how they ride. And the feeling is not so subtle.</p><p>From the first burst of power it was immediately apparent that these wheels felt different. That stiffness effectively transforms the bike into something that feels more reactive, faster handling, and with better accuracy. The wheels feel amazing when you’re leant over and committed to an apex, and they truly shine when you find a steep pinch and try to see just how big a number you can get from your power meter. I know that all reads like a press release, but it’s true and it’s akin to what a pair of Lightweights achieve.  </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-10-1340x754.jpg\"><figcaption>I really like how these wheels look. Those carbon spokes and stealthy graphics provide a product that looks premium (and it is).</figcaption></figure><p>The trade-off to all that joyful stiffness is felt in the ride quality. The ride is certainly made firmer by these wheels and there’s clearly more feedback through the bike as a result. In combination with a tubeless tyre at a good pressure this increased stiffness is managed, but all things being equal, these wheels are certainly less forgiving than a steel-spoked wheel of a similar depth. </p><p>Just as the company claims, the rear hub offers a low back drag – where I’m used to getting a little chain droop when kicking the pedals back while in the 11T, these suffered no such delay. That low back drag and lightly sealed bearings provide a feeling of the bike building momentum rather effortlessly. Of course this is a tough one to measure and quantify. Hybrid ceramic bearings aren’t going to win you a race, but these wheels do roll smoothly. </p><p>The more noisy hubs I ride the more I miss quiet coasting, and this one had me wanting to keep pedalling. To be fair it’s actually not <em>that</em> loud – I’d rank it a little quieter than a new DT Swiss EXP but certainly noisier than the original DT Swiss Star Ratchet. Either way, it’s certainly no quiet-coaster. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-25-1340x754.jpg\"><figcaption>The internal width may not sound impressive against those pushing 25 mm figures for road, but it’s more than enough for modern width road tyres. Mount a 25 or even 28 mm tyre on these rims and you’ll be rewarded with a wonderfully rounded profile. Of course, that doesn’t mean the external width is aerodynamically suited to those bigger tyres.</figcaption></figure><p>My time riding these has seen them wrapped in Cadex’s Race 28 mm tyres, and it’s a nice combination. The single-layer casing 170 tpi tyres weigh around 330 g a piece and measure out at an actual 31.85 mm on these rims. The grip and ride feel are great, but unfortunately, I suffered a puncture within the first 40 km, and while it’s impossible to say whether the same incident would have happened with a different tyre, it’s still worthy of note given the puncture happened directly between the raised tread where protection is likely at a minimum. The sealant didn’t heal this one, but a Dynaplug did. </p><p>Finally, it’s of course too soon to discuss long-term durability, and while I have little to say there, early impressions are that the hubs should roll for a long time. Such a stiff wheel means the spokes aren’t under excessive and continuous tensioning and de-tensioning. </p><p>Speaking of the unknowns, Cadex provides a two-year warranty against manufacturer fault and then there’s a five-year warranty in case you get caught in a wreck or similar. That five-year policy provides a 50% discount on a replacement wheel, and while that is hugely more generous than “sorry, you should have stayed upright” it’s still not quite as good as some competing company policies that replace the wheel without further outlay. </p><h2>A verdict </h2><p>Giant formed Cadex as an avenue to create and sell performance products that didn’t need to hit a mass-market price point. The new 36 Disc certainly rides like a top-end product that genuinely provides a different sensation than many of the more traditionally built products out there. </p><p>That sensation is one of stiffness that provides a direct feel to the road. It’s quite wonderful for bringing a race-bred feeling to a modern disc-brake roadie, but it does come with a trade-off in absolute comfort. </p><p>Put another way, ignoring the width and price of these wheels, that ride quality alone would stop me from wanting these wheels on a gravel bike, but they’re exactly what I’d want for chasing tarmac bends where a map’s gradient lines are closely compacted.</p><p>More information can be found at <a href=\"http://cadex-cycling.com/36wheels\" target=\"_blank\">cadex-cycling.com</a>.</p><h2>Gallery</h2><figure><ul><div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-wheels-Cadex-race-tyres-review-cyclingtips-4-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-20-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-4-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-wheels-Cadex-race-tyres-review-cyclingtips-2-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-26-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-24-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-wheelset-rear-hub-ratchet-internal-details-2-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-23-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-12-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-11-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-9-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-8-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-1-1340x754.jpg\"><figcaption>The packaging is rather immense. Thankfully it’s all cardboard, and it ensures the wheels arrive safely.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-2-1340x754.jpg\"><figcaption>Inside you’ll find the wheel in a bag. And the manual in its own case.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-18-1340x754.jpg\"><figcaption>That manual case is actually a padded tablet case. Nice.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-3-1340x754.jpg\"><figcaption>The provided wheel bags are unpadded, but hey, it’s better than nothing.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Cadex-36-Disc-road-wheelset-cyclingtips-6-1340x754.jpg\"></figure></li></div></div></ul></figure></div></div>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"36db618bb4cb18996da8a20d522925eb4bc3c91ae5f46e5bdcda201bb86e9205","category":"Cycling"}