{"title":"Thibaut Pinot will not race the Giro d’Italia","link":"https://cyclingtips.com/2021/04/thibaut-pinot-will-not-race-the-giro-ditalia/","date":1619273247000,"content":"<div><p></p><h4>Thibaut Pinot at the Faun-Ardèche Classic.</h4><p></p><div><p>Thibaut Pinot will not race the 2021 Giro d’Italia as he’d originally planned due to lingering back problems. In a statement from Groupama-FDJ, the 30-year-old Frenchman explained that he would not be able to race the Giro at his best, and that missing the race would be “heartbreaking.”</p><p>Pinot Frenchman suffered a back injury in a crash on the opening stage of last year’s Tour de France, and despite focusing heavily on treatment and recovery over the offseason, he is still experiencing back pain. He raced in the Tour of the Alps over the past week, hoping to build towards the Giro, but instead came away realizing that he would not be able to make the Giro start he’d hoped for.</p><p>Groupama-FDJ announced the news on Saturday.</p><p>“I can’t hide from myself: I’m not in the medical condition to shine in the Giro. I would unnecessarily suffer and I would not be able to help the team,” Pinot said in a statement. “It’s not even a question of shape, but the pain in my back prevents me from performing well. It’s hard to explain.</p><p>“At the beginning of a stage it works, I even managed to get into the breakaway on the last day of this Tour of the Alps. Unfortunately, the more the kilometers go by, the more the pain increases and at some point, I am too sore to force myself. Tuesday was a very bad day for me. It was mentally hard, I didn’t expect to be so far in the classifications. Giving up crossed my mind but I am a competitor, I wanted to go to the end of the test, I needed to, in order not to have any regrets. Every day I gave everything. Not racing in the Giro d’Italia is heartbreaking, we did everything to be there! We really did our utmost so that I could ride at my best. I’m disappointed but I’m focused on the next step. I am only thinking about healing myself, leaving these back problems behind me, competing at my usual level and fighting with the best.”</p><p>Groupama-FDJ team physician Jacky Maillot explained that Pinot’s form appeared to be coming along, but his back issues remained too great an obstacle for a three-week race.</p><p>“In the recent weeks, we have seen a gradual improvement in Thibaut’s training. We knew that the Tour of the Alps would give us some answers,” Maillot said. “Unfortunately, the conclusions are clear: his sacroiliac inflammation, following his crash in the last Tour de France, still prevents him from riding at very high intensity despite all the treatments he received. Further investigations with new specialists in this field are scheduled for next week.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"37af2556d80b31573a8a3bb328bd0363a79fcef271edbe9e28b428d1fabc7a96","category":"Cycling"}