{"title":"Can Lael Wilcox beat The Tour Divide record?","link":"https://cyclingtips.com/2021/10/rapha-gone-racing-the-tour-divide/","date":1634074243000,"content":"<div><div><p>Crisscrossing the Continental Divide for 2,450 miles between Banff in the Canadian Rockies and Antelope Wells on the Mexican border, the Great Divide is one the world’s most iconic long distance mountain biking routes. On this sky high trail, there’s no such thing as a regular ride. But even by ultra cycling standards, Lael Wilcox’s history on the route is a colorful one.</p><p>In 2015, Lael raced the Tour Divide – an event that follows the route – and set a new women’s course record despite having to ride herself to an emergency room en route to deal with a persistent breathing issue. But rather than celebrating her achievement, Lael set out to better it. Just two weeks later, she rode to the start from her home in Alaska, took on the trail for a second time and lowered her own record by another day and a half.</p><p>Today, the outright course record is held by the late long-distance legend Mike Hall, whose time of 13 days 22 hours and 51 minutes has stood since 2016. Inspired by Mike’s methodical approach to managing the mileage but convinced she can beat the record, Lael is returning to the Rockies with unfinished business. In the latest episode of Rapha Gone Racing, we document her latest record attempt and follow her as she runs into issues much bigger than any bike ride.</p><div><h2>WHAT IS ‘FROM THE SOURCE’?</h2><p>When you see an article containing ‘From the source’ label on the homepage or with the headline in blue, note that this is content directly from the brand and it has been vetted by our Editors and deemed worthy of your attention. This is not paid or sponsored content but rather a way to bring you news worth sharing while freeing up our Editors to spend their time adding value where where their expertise lays. Follow the <a href=\"https://cyclingtips.com/what-is-from-the-source/\">link</a> to learn more about this type of content and our related publishing guidelines.</p></div></div></div>","author":"rapha racing","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"37b42dde13dfd3213e9d3d546fe2619c4e334b8791ba0efb823beebbeca3f06f","category":"Cycling"}