{"title":"Ex-Stadia developers dish on Google’s mismanagement and poor communication","link":"https://arstechnica.com/?p=1743024","date":1613585598000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Remember this when Google says it's \"in it for the long haul\" —</h4><h2 itemprop=\"description\">Former Stadia developers \"shocked\" by surprise shutdown of Google's game studio.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Stadia-800x450.jpg\" alt=\"Promotional image of video game controller.\"><figcaption></figcaption></figure><p>Google <a href=\"https://arstechnica.com/gaming/2021/02/google-closes-stadias-dedicated-game-studios-after-less-than-2-years/\">recently killed</a> its only in-house Stadia game development studio, Stadia Games and Entertainment (SG&amp;E), after building up the studio for only two years. In an industry where even established game studios take several years to ship a product, this was a breathtakingly fast pace for building and tearing down a game development studio. <a href=\"https://kotaku.com/stadia-leadership-praised-development-studios-for-great-1846281384?utm_source=twitter&amp;utm_medium=SocialMarketing&amp;utm_campaign=dlvrit&amp;utm_content=kotaku\">Kotaku</a> got in touch with some of the 150+ staffers who were dismissed from Google's studio, and they paint a picture of a dysfunctional work environment plagued by dishonest communication and mismanagement.</p><p>According to the report, developers at the studio were \"shocked\" by the sudden shutdown since, only a week earlier, Stadia's leading executive, game industry veteran Phil Harrison, told the group \"[SG&amp;E] has made great progress building a diverse and talented team and establishing a strong lineup of Stadia exclusive games.\" The one-week flip-flop was \"part of an apparent pattern of Stadia leadership not being honest and upfront with the company's developers,\" according to Kotaku, adding that many developers \"upended their lives and careers to join the team.\"</p><p>The report says Stadia's developers found out about the studio closure at \"almost the same time as everyone else.\" Stadia's developers had to wait three days before Harrison was available for a Q&amp;A conference call, which the report describes as \"contentious.\" The most chilling line in the report details Harrison's response to a question asking why the Studio was \"making great progress\" one week and then fired the next: \"When asked what changed from the week prior, Harrison admitted nothing had and told those on the call, 'We knew.'\"</p><h2>Who runs a game studio for only two years?</h2><p>One quote from Kotaku's source asks the same question we're wondering: why did Google start a game studio without a solid plan to keep it running long enough to make a game? \"If you started this studio and hired a hundred or so of these people, no one starts that just for it to go away in a year or so, right?\" one source asked. \"You can’t make a game in that amount of time... We had multi-year reassurance, and now we don’t.”</p><p>In its <a href=\"https://blog.google/products/stadia/focusing-on-stadias-future-as-a-platform-and-winding-down-sge/\">official post</a> announcing the shutdown of SG&amp;E, Harrison cited cost as the primary reason for killing the studio, saying \"Creating best-in-class games from the ground up takes many years and significant investment, and the cost is going up exponentially.\" It's hard to imagine Google's army of executives not correctly calculating the cost of a development team, so the most volatile input here is the amount of money Stadia is pulling in month-to-month.</p><p>Google doesn't publicly share how well (or poorly) Stadia is doing, but that blog post mentions that Google is looking for \"the best path to building Stadia into a long-term, sustainable business,\" strongly hinting that Stadia is not currently a sustainable business. The post details what sounds like a pretty strong change in strategy, pivoting from the direct-to-consumer \"game console\" business and more toward being a technology provider for gaming companies.</p><p>If Stadia was ever going to be successful, it seems like that should have happened over the last several months. The pandemic is making gaming <a href=\"https://arstechnica.com/gaming/2020/03/as-players-shelter-in-place-online-game-platforms-see-spike-in-demand/\">more popular than ever,</a> and everyone else's sales are up across the board. Stadia was also one of the <a href=\"https://www.theverge.com/2020/12/10/22167303/cyberpunk-2077-ps5-console-google-stadia\">best systems</a> to play the long-awaited&nbsp;<em><a href=\"https://arstechnica.com/gaming/2020/12/a-week-spent-in-cyberpunk-2077s-beautiful-messy-urban-future/\">Cyberpunk 2077</a></em> on, especially given that the other best options were next-gen consoles that were perpetually sold-out. If Google isn't seeing success now, it's hard to imagine a better opportunity for the service.</p><p>As a streaming service, if Stadia ever closes down, customers will lose access to all their games, so buying a game on Stadia requires having a certain level of confidence that the service will stick around. Stories of mismanagement like this, Google's <a href=\"https://arstechnica.com/gadgets/2019/04/googles-constant-product-shutdowns-are-damaging-its-brand/\">extensive history</a> of killing services, and the other constant <a href=\"https://arstechnica.com/gaming/2020/06/one-of-stadias-biggest-publishers-says-streaming-is-not-a-game-changer/\">negative press</a> makes the service hard to believe in.</p></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"384a1ee07ad9fcc8b2f35961e3e97ebcfbd15428406e03980ea4b9209ff25ab3","category":"Tech"}