{"title":"Blue Screen of the day—update crashes Windows 10 PCs on print","link":"https://arstechnica.com/?p=1748905","date":1615486566000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>pc load letter —</h4><h2 itemprop=\"description\">It's not always DNS... sometimes it's printers.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/bluescreen-pc-671x895.jpg\" alt=\"This is the BSOD victim of this week's Windows Update Woes seen after any attempt to print, from any application.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/bluescreen-pc.jpg\" data-height=\"895\" data-width=\"671\">Enlarge</a> <span>/</span> This is the BSOD victim of this week's Windows Update Woes seen after any attempt to print, from any application.</p><p>Teri Sheehan</p></figcaption></figure><p>A Microsoft Windows Update is wreaking havoc with printers worldwide this week—<code>KB50000802</code> (for newer Windows 10 builds; older Windows 10 and Server builds may have a KB ending in <code>808</code> or <code>822</code> instead) was intended to provide updates to security \"when Windows performs basic operations,\" but the update crashes some print drivers due to overflowing a <a href=\"https://docs.microsoft.com/en-us/windows/win32/sysinfo/gdi-objects\">GDI Object</a> limit of 10,000.</p><p>The bug afflicts a wide range of printers and print drivers—we can confirm having seen the issue on a Windows 10 2004 PC, which crashes with <code>APC_INDEX_MISMATCH</code>&nbsp;(photo above) after printing to any of several models of Kyocera printer (some local, some network).</p><p>If you're afflicted with this bug yourself, you can get some relief by uninstalling KB50000802 until Microsoft comes out with a fixed update, presumably by April's Patch Tuesday.</p><p>On a Windows 10 or Windows Server PC version 2004/20H2, click Start --&gt; type \"Control Panel\" and hit enter --&gt; go to Programs, then Programs and Features. From there, click \"View installed updates\" on the left-hand pane&nbsp;and uninstall <code>Security Update for Microsoft Windows KB50000802)</code>.</p><p>For Windows PCs version 1909, the same fix (and problem) is in <code>KB50000808</code>. If you're on version 1809, look for <code>KB50000822</code>. For more technical detail, Dutch tech site <a href=\"https://docs.winking.be/Tn/Article/225\">winking.be</a> has an excellent overview.</p><p>This flaw may also affect Windows 8.1 or Windows 7 PCs with KBs 848, 853, 841, or 851... but if you're still on Windows 8 or Windows 7 at this point, you've got worse problems than this. Please upgrade!</p></div></div>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"393b0ea03ed93669ecca3c476f14dea6a604b23e2465b6053e8ee22f147c92fd","category":"Tech"}