{"title":"New Specialized S-Works Romin Evo Mirror 3-D printed saddle coming soon?","link":"https://cyclingtips.com/2021/04/new-specialized-s-works-romin-evo-mirror-3-d-printed-saddle-coming-soon/","date":1617900452000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Despite its lofty price, Specialized has apparently seen enough success with its 3-D printed S-Works Power Mirror saddle to bring forth a follow-up model. Spotted in the background of <a href=\"https://www.instagram.com/p/CM6qmPkgniw/?igshid=q27fdqbzwa4e\" target=\"_blank\" rel=\"noreferrer noopener\">an Instagram post</a> from Bora-Hansgrohe rider Marcus Burghardt is what appears to be an upcoming S-Works Romin Evo Mirror saddle.</p><p>Much of that success invariably boils down to the remarkable amount of comfort that printed padding provides. Instead of a conventional foam, the Mirror uses a 3-D printed cellular structure, sort of like what you might find in a natural sea sponge. As a result, the padding on that saddle is thicker than what is more typically found in a high-end road model, and yet still provides excellent support since the softness can be tuned with location-specific cell shapes and sizes.</p><p>Our own “Shoddy” Dave Everett <a href=\"https://cyclingtips.com/2021/03/specialized-power-mirror-saddle-long-term-review/\">described the S-Works Power Mirror saddle</a> as, “exceptionally comfortable,” while CyclingTips editor-in-chief Caley Fretz was a bit more colorful in his description: “It makes my butt so happy. If I could twerk, which I can’t, it would twerk in the streets in unbridled, uncontrollable happiness.”</p><p>As popular as Specialized’s Power range is in general, however, not everyone is on board with the whole short-nosed saddle thing, so it makes sense that the company would follow up with its more traditionally shaped Romin Evo (or the slightly flatter Romin — it’s hard to tell at the moment, although the Romin Evo is the more popular shape of the two).</p><p>Specialized has yet to provide any official details on this new S-Works Romin Evo Mirror — including a release date — but based on the current S-Works Power Mirror, I expect the Romin Evo Mirror to come in around 165 grams, complete with a true carbon fiber shell and molded carbon fiber rails.&nbsp;</p><p>As for the price, it’ll likely be just as mind-blowingly expensive as the S-Works Power Mirror, which currently costs US$450 / AU$750 / £390 / €429.</p><div><h5>Tags</h5></div></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3a35dc0db7e8f1202db8bbbf0107c20acbf60d794f56c9789ec38778a0b198d3","category":"Cycling"}