{"title":"Apple Lobbying Against Arizona Bill That Would Let Developers Use Third-Party Payment Options","link":"https://www.macrumors.com/2021/03/01/apple-arizona-bill-lobbying/","date":1614643500000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/01/apple-arizona-bill-lobbying/\"><p>Arizona is <a href=\"https://www.macrumors.com/2021/02/26/minnesota-arizona-in-app-purchase-bills/\">considering legislation</a> that would prevent developers from being forced to use Apple's in-app purchase options, and as the bill heads to the Arizona Senate, Apple and Google are lobbying heavily against it.</p><p><img alt=\"app store blue banner\" width=\"1600\" height=\"957\" src=\"https://images.macrumors.com/t/8JQABSRMnxc_mCY8CCJ0NoSIVqY=/400x0/filters:quality(90)/article-new/2020/12/app-store-blue-banner.jpg?lossy\" data-src=\"https://images.macrumors.com/t/8JQABSRMnxc_mCY8CCJ0NoSIVqY=/400x0/filters:quality(90)/article-new/2020/12/app-store-blue-banner.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/8JQABSRMnxc_mCY8CCJ0NoSIVqY=/400x0/filters:quality(90)/article-new/2020/12/app-store-blue-banner.jpg?lossy 400w,https://images.macrumors.com/t/m800JGpXB7slQ-926uW0h00nC6o=/800x0/filters:quality(90)/article-new/2020/12/app-store-blue-banner.jpg?lossy 800w,https://images.macrumors.com/t/FSvnO5UaMaR55JG5y1h67NbxmCA=/1600x0/filters:quality(90)/article-new/2020/12/app-store-blue-banner.jpg 1600w,https://images.macrumors.com/t/Oc0YtxNGZHmh3hY1eQmpRs7dU1Q=/2500x0/filters:no_upscale():quality(90)/article-new/2020/12/app-store-blue-banner.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/8JQABSRMnxc_mCY8CCJ0NoSIVqY=/400x0/filters:quality(90)/article-new/2020/12/app-store-blue-banner.jpg?lossy 400w,https://images.macrumors.com/t/m800JGpXB7slQ-926uW0h00nC6o=/800x0/filters:quality(90)/article-new/2020/12/app-store-blue-banner.jpg?lossy 800w,https://images.macrumors.com/t/FSvnO5UaMaR55JG5y1h67NbxmCA=/1600x0/filters:quality(90)/article-new/2020/12/app-store-blue-banner.jpg 1600w,https://images.macrumors.com/t/Oc0YtxNGZHmh3hY1eQmpRs7dU1Q=/2500x0/filters:no_upscale():quality(90)/article-new/2020/12/app-store-blue-banner.jpg 2500w\"><br>As outlined by <em><a href=\"https://www.protocol.com/Policy/apple-google-lobbyists-arizona-bill\">Protocol</a></em>, Apple has been working against the bill since last month. Apple lobbyist Rob Didiron began fighting the legislation before it had been formally introduced, with Apple also hiring additional lobbyists and sending lawyers to Arizona.</p><p>\"We went through a very difficult weekend where Apple and Google hired probably almost every lobbyist in town,\" said Arizona State Representative Regina Cobb, who created HB2005.</p><p>HB2005, an amendment to an 2005 Arizona bill, is designed to let app developers use third-party payment options to avoid the 15 to 30 percent cut that Apple takes from app purchases and in-app payments.</p><p>Cobb developed the bill after being approached by lobbyist Ryan O'Daniel, who represents the Coalition for App Fairness. The Coalition for App Fairness was <a href=\"https://www.macrumors.com/2020/09/24/epic-games-spotify-tile-coalition-for-app-fairness/\">formed in September 2020</a> and its members include <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, Spotify, Tile, Basecamp, Blix, and other developers that have had disagreements with Apple.</p><p>In a <a href=\"https://www.kawc.org/post/arizona-lawmakers-address-battle-between-app-developers-and-tech-giants\">hearing last week</a>, Apple's chief compliance officer Kyle Andeer called HB2005 a \"government mandate that Apple give away the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>.\"</p><blockquote><p>\"This would allow billion-dollar developers to take all of the app store's value for free, even if they're selling digital goods, even if they're making millions or billions of dollars doing it. The bill is a government mandate that Apple give away the app store.\"</p></blockquote><p>Apple in November lowered its ‌App Store‌ cut for developers <a href=\"https://www.macrumors.com/2020/11/18/apple-drops-app-store-fees/\">making under $1 million</a> to 15 percent, so for the majority of developers, Apple now collects 15 percent instead of 30 percent. Andeer said that 83 percent of developers pay no fees at all, as they offer free apps.</p><p>Apple last month successfully fought back <a href=\"https://www.macrumors.com/2021/02/16/north-dakota-app-store-bill-fails/\">against a similar bill</a> in North Dakota, which would have paved the way for third-party app store options. The bill, which was also backed by the Coalition for App Fairness, <a href=\"https://www.macrumors.com/2021/02/16/north-dakota-app-store-bill-fails/\">was shot down</a> by the North Dakota Senate.</p><p>It is not clear if HB2005 will pass in Arizona, as it is facing opposition from Arizona Democrats who do not believe that state legislature should interfere with ongoing litigation, referencing the legal battle between Apple and ‌Epic Games‌. Cobb this week plans to meet with Apple executives to \"negotiate the contours of the bill.\"</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/26/bill-gates-prefers-android-over-iphone/\">Bill Gates Says His Preference for Android Over iPhone is Due to Pre-Installed Software</a></h3><p>Friday February 26, 2021 3:35 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Microsoft co-founder Bill Gates this week participated in his first meeting on Clubhouse, the increasingly popular invite-only conversation app, where he fielded a range of questions as part of an ongoing book tour. Gates was interviewed by journalist Andrew Ross Sorkin, and given that the Clubhouse app is currently only available on iOS, naturally one of the questions that came up was...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/27/top-stories-macbook-pro-imac-airpods-rumors/\">Top Stories: MacBook Pro, iMac, and AirPods Rumors, macOS 11.2.2, MagSafe Wallet Revisited</a></h3><p>March is right around the corner, and that means our first good opportunity for Apple product launches in 2021 as the company frequently has significant launches in March or April each year. We're hearing rumors about MacBook Pro, iMac, AirPods, and more, although many of these will be coming out at different times over the course of the year. This week also saw a macOS update to address a ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/01/iphone-lawsuit-programmed-obsolescence-portugal/\">Apple Faces Another iPhone Lawsuit Over 'Programmed Obsolescence'</a></h3><p>Monday March 1, 2021 6:44 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple faces a new class-action lawsuit that accuses it of deliberately releasing iOS updates that slowly reduce the performance of an iPhone, forcing customers to upgrade their devices. The lawsuit comes from the Portuguese Consumer Protection Agency, Deco Proteste (via Marketeer), which in a statement says that it will proceed with a case against the Cupertino tech giant because it...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/27/homekit-essentials-worth-checking-out/\">HomeKit Essentials Worth Checking Out</a></h3><p>Saturday February 27, 2021 7:05 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>HomeKit was slow to take off after its 2014 launch, but now that it's been around for seven years, there are hundreds of HomeKit products available, ranging from doorbells and speakers to TVs, lights, and cameras. In our latest YouTube video, we rounded up some of our favorite HomeKit products that we find most useful. Subscribe to the MacRumors YouTube channel for more videos. HomePod...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/01/wedbush-iphone-13-1tb-storage-lidar/\">iPhone 13 to Include 1TB Storage Option and LiDAR Across the Board, Says Wedbush Analyst</a></h3><p>Apple's forthcoming iPhone 13 could include a 1TB storage option for some models and LiDAR Scanners across the entire lineup, according to a report from Wedbush analysts. In a new note to investors, seen by MacRumors, Wedbush analyst Daniel Ives said that initial Asian supply chain checks gave the firm \"increased confidence\" that Apple's 5G-driven product cycle would extend well into 2022,...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/26/apple-developers-dtk-return-march-31/\">Apple Requiring Developers to Return DTK Mac Minis by March 31</a></h3><p>Friday February 26, 2021 3:57 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today sent out emails to developers who are in possession of a Developer Transition Kit, asking them to return the machines by March 31. The Developer Transition Kits are Mac minis with A12Z chips that Apple provided for development purposes ahead of the release of the M1 Macs. Apple in the emails provided developers with shipping instructions, and plans to begin collecting the DTKs...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/28/unc0ver-jailbreaking-tool-version-6-released/\">Jailbreak Tool 'unc0ver' 6.0.0 Released With iOS 14.3 Compatibility</a></h3><p>Sunday February 28, 2021 9:26 am PST by <a href=\"https://www.macrumors.com/author/frank-mcshan/\" rel=\"author\">Frank McShan</a></p><p>The team behind the \"unc0ver\" jailbreaking tool for iOS has released version 6.0.0 of its software, which can allegedly be used to jailbreak any device running iOS 11.0 through iOS 14.3 using a kernel vulnerability. The unc0ver website describes how the tool has been extensively tested across a range of iOS devices running various software versions, including an iPhone 12 Pro Max running iOS ...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3b1179f834b873355f1cb8b74fd2f198c957f2754ae2bf38cfe47c901807a76d","category":"Apple"}