{"title":"Meet Harry Sweeny, the first-year pro who almost won a Tour de France stage","link":"https://cyclingtips.com/2021/07/meet-harry-sweeny-the-first-year-pro-who-almost-won-a-tour-de-france-stage/","date":1625799243000,"content":"<div><p></p><h4>Sweeny (right) in the break on stage 12 of the 2021 Tour de France.</h4><p></p><div><p>It’s rare for a first-year professional to race the <a href=\"https://cyclingtips.com/tag/tour-de-france\" target=\"_blank\">Tour de France</a>. Most young pros will get a taste for three-week racing at the Giro d’Italia or the Vuelta a España. But 23-year-old Australian Harry Sweeny (Lotto Soudal) is diving in the deep end.</p><p>Sweeny isn’t just racing the Tour in his first season as a professional; on Thursday’s stage 12 he very nearly came away with a stage win in his debut Grand Tour.</p><hr><p>A former triathlete, Sweeny first turned his attention to cycling in 2015. It wasn’t long before the Queenslander was racing at the Continental level – with Chinese-Australian team Mitchelton-Scott in 2017 and 2018, and then with Irish outfit EvoPro Racing in 2019. That 2019 season was highlighted by a stage win in the hilly French stage race, the UCI 2.2 Rhône-Alpes Isère Tour.</p><p>In 2020 Sweeny joined Lotto Soudal’s U23 squad, and added another victory to his palmares: Il Piccolo Lombardia, the U23 version of the hilly Italian Monument. Around that time, Sweeny described himself in a Lotto Soudal press release as “a rider for the Classics and a good lead-out guy, but I can climb as well.” His win at Il Piccolo Lombardia was proof of his impressive versatility.</p><blockquote></blockquote><p>When 2021 began, Sweeny stepped up to the WorldTour with Lotto Soudal. The early months of the year proved tumultuous. He started his season well at the UAE Tour as part of Caleb Ewan’s lead-out train; a lead-out that helped Ewan to <a href=\"https://www.youtube.com/watch?v=e6sGzp5URI0\" target=\"_blank\">a win on stage 7</a>. But after racing a handful of Belgian one-days, Sweeny was struck down by COVID-19.</p><p>“Disappointed to be out of the next few Spring Classics after testing positive for COVID-19 yesterday,” Sweeny wrote on Twitter. “Time to focus on my recovery under the watchful eyes of the team staff and I’ll be cheering on the boys from the tele.”</p><p>That was late March. It wasn’t until mid May before Sweeny was racing again. From there he had little more than a month to prove himself worthy of a Tour start.</p><p>Sweeny told CyclingTips that he was initially surprised to make the Tour long list, but not surprised when he got the call-up to start the race.</p><p>“My first few races back after COVID, I did [Critérium du] Dauphiné [and] Belgium [Tour], back to back as a bit of a tester to see if the legs would be ready for the Tour,” he said. “Obviously, it’s a pretty hard combination – most guys after Dauphiné have a week pretty easy, but I went directly to Belgium and did the lead-outs with Caleb and they went really, really well.”</p><p>Ewan won two stages at the Belgium Tour. Keen not to disrupt a winning combination, Lotto Soudal sent virtually the same squad to the Tour de France, Sweeny included.</p><p>“To keep the same team for the Tour, I think it’s really important,” Sweeny told CyclingTips. “You know that the guys work well together. So yeah, I’m confident in the role here.”</p><blockquote></blockquote><p>When CyclingTips caught up with Sweeny, it was the morning of stage 3 of the Tour, a stage many expected Ewan to win. Sweeny was clear on his role for the day.</p><p>“For a day that’s mostly flat like today and downhill towards the finish, I’ll be doing probably the bulk of the work with Phil Gilbert to get the other guys that might be a bit more savvy in the final to help Caleb,” he said. “So it’s really just about managing the skills that we have together.</p><p>“Obviously, it’s my neo-pro season, so I’m not as savvy as the other guys that have been pro for 10 years. So it’s better for me to be able to keep them as fresh as possible.”</p><p>The stage was going well for the team. Despite several crashes that ended the GC hopes of several contenders, Lotto Soudal had Ewan in good position coming into the final sprint. But then the Aussie speedster clattered to the ground in a nasty tangle with Peter Sagan. With his collarbone broken, Ewan’s Tour was over, virtually before it began.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/crash-1340x890.jpg\"></figure><p>The withdrawal of the team’s figurehead sprinter forced a rethink for Lotto Soudal.</p><p>“It was rather quiet at the dinner table last night because, with so many sprint opportunities, most of our team was built around Caleb,” sent Brent Van Moer on stage 4. “That is why we had to change tactics and race offensively.”</p><p>Van Moer did just that the day after Ewan’s exit, putting in a stellar ride from the breakaway that only saw him caught <a href=\"https://cyclingtips.com/2021/06/sometimes-the-race-is-just-a-little-too-long/\" target=\"_blank\">with 150 metres to go</a>.</p><p>Sweeny tried his luck in the break on stage 9 to Tignes, a day that was ultimately <a href=\"https://cyclingtips.com/2021/07/interview-ben-oconnor-on-his-epic-tour-stage-win-and-defending-second-on-gc/\" target=\"_blank\">won by his compatriot Ben O’Connor (AG2R Citröen)</a>. And then on stage 12, Sweeny got his best opportunity yet.</p><p>It was a stage that looked destined for a bunch sprint, but with the help of some early crosswinds, a strong breakaway group forged clear after a frenetic opening 20 km. Among those in the lead group, world champion Julian Alaphilippe (Deceuninck-QuickStep), Andre Greipel (Israel Start-Up Nation), and Harry Sweeny.</p><blockquote>— Lotto Soudal (@Lotto_Soudal) <a href=\"https://twitter.com/Lotto_Soudal/status/1413142801550774282?ref_src=twsrc%5Etfw\">July 8, 2021</a></blockquote><p>With around 35 km remaining, a group of four burst clear from that breakaway. Sweeny was there, so too Stefan Küng (Groupama-FDJ), Imanol Erviti (Movistar), and Nils Politt (Bora-Hansgrohe). Before too long it was clear the winner was going to come from the leading quartet. Sweeny was in with a very real chance.</p><p>On a short climb with 14.5 km to go, Sweeny attacked and quickly distanced the other three. But when the others rejoined – minus Küng – Sweeny was spent, and unable to respond to the Politt attack that followed a couple kilometres later.</p><p>“I was hoping that the final climb would be a little harder,” Sweeny said later. “I attacked there and hoped it would be a little too hard for the others but they made it back and that is where I lost my legs a little bit. I knew I wouldn’t have a good enough sprint to beat those guys so I had to try something.”</p><p>With Politt riding away, Sweeny was left working with Erviti as the finish approached in Nîmes. The pair couldn’t get back on terms with Politt who rode to the biggest win of his career. Half a minute later, Sweeny found himself ahead of Erviti in the final sprint, and could do nothing when the Spaniard came around to take second.</p><p>Still, Sweeny had much to be proud of: he’d finished third in a stage of his debut Tour de France.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/Kramon_TdF2021_st12_09760-1340x897.jpeg\"><figcaption>Sweeny finishing third on stage 12 of the 2021 Tour de France.</figcaption></figure><p>“To be honest, it felt a bit surreal to fight for the stage victory today,” he said. “I didn’t expect to be at the Tour this year, let alone to be performing at this level.</p><p>“I knew I was capable of doing this but tactically, it’s another thing. Maybe I made a few mistakes in the final, but I can’t be disappointed with this result. It really was a tactical game at the end and maybe I showed my strength a little bit too much. Politt saw that and took a little advantage of that.</p><p>“However, I have only been pro for six months, so I have to be satisfied with third place. I’ve done everything to try and win the stage, so I can be happy.”</p><blockquote><p>Thoughts of a neo-pro at the TDF pt.4 “Less attacking more holding the wheel of Politt”</p>— Harry Sweeny (@harry_sweeny) <a href=\"https://twitter.com/harry_sweeny/status/1413164737756639236?ref_src=twsrc%5Etfw\">July 8, 2021</a></blockquote><p>Sweeny might have been beaten by more experienced riders on the day, but he can take much from his podium finish. If it wasn’t already clear before stage 12, Sweeny is well at home racing at the highest level of the sport, despite how new he is to the pro ranks. To his mind, that could be a result of his road to the WorldTour.</p><p>“In the past, I’ve done quite a lot of HC and .1 racing so the step up to the pro level wasn’t as much as people had told me,” Sweeny told CyclingTips before stage 3. “I felt pretty comfortable, especially in UAE [Tour] – it was a nice way to settle into the bunch. But the thing I notice [about WorldTour racing] is it’s either really easy or really, really hard. And I think that’s the main difference.</p><p>“It was one of my strengths in the amateur peloton that it’s just hard all day and it made it easy for me because I can just ride at a high tempo.”</p><p>He certainly can.</p><p>While Sweeny has spent most of his neo-pro year riding for others, he showed on the road to Nîmes that he’s more than capable of taking his own opportunities. That’s something he’s been keen on, ever since he joined the team.</p><p>“I hope to turn into a versatile rider in the future,” he <a href=\"https://www.lottosoudal.be/en/news/detail/4602/meet-the-lotto-soudal-youngsters-harry-sweeny\" target=\"_blank\">said back in February</a>. “Of course, I hope to become an essential part of Caleb’s lead-out, but I’d also like to explore my own qualities as a rider.</p><p>“I think I might do well at the Classics; I think that races like the Tour of Flanders and Paris-Roubaix will really suit me. But I hope to discover some other races as well, just to know where my ceiling is.”</p><p>Based on what we saw on Thursday, it seems likely that ceiling is pretty high.</p><div><p><em>Thanks to Ronan Mc Laughlin for interviewing Harry Sweeny before stage 3 of the Tour de France.</em></p></div></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3b3be84f0b78865a8c2b7d4ebd874fa3b66ec6d409cc8bd5528c7345d1d0fff4","category":"Cycling"}