{"title":"The Arctic Ocean may have gone fresh in ice age times","link":"https://arstechnica.com/?p=1739819","date":1612547402000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Pass (on) the salt —</h4><h2 itemprop=\"description\">Chemical clues in seafloor sediment show an absence of salt.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/arctic_jingke888-800x600.jpg\" alt=\"The Arctic Ocean may have gone fresh in ice age times\"><figcaption></figcaption></figure><p>The Arctic Ocean is many things. Cold and icy come to mind, of course, but \"salty\" should as well—it’s an ocean, after all. Yet a new study suggests that during certain ice age periods, the Arctic Ocean and the adjacent Greenland and Norwegian Seas (you can guess where those are if you don’t know) were filled with freshwater.</p><p>The paleo evidence for this idea is pretty subtle. The isotope thorium-230 is produced from the decay of uranium-234, which exists in seawater proportionally to its salinity. While the uranium dissolves in seawater, thorium tends to precipitate and fall to the seafloor. Bring up a core of seafloor sediment, then, and rising or falling concentrations of thorium-230 can tell you about rising or falling salinity in that region over time.</p><p>A new study led by Walter Geibert at the Alfred Wegener Institute analyzed a pair of sediment cores taken from the bottom of the Arctic Ocean. In those cores, there are two time intervals during which thorium-230 fell to zero—one interval about 60,000 to 70,000 years ago and another about 130,000 to 150,000 years ago.</p><h2>No more flow</h2><p>These are cold glacial periods, when great ice sheets covered large areas of the Northern Hemisphere continents and sea level was consequently much lower. This isotopic evidence, the researchers say, points to water that is fresh, lacking basically any salt—and so also lacking the uranium that produces thorium. Looking at eight other previously analyzed cores across the Arctic and down into the seas between Greenland and Antarctica, the same periods of low or absent thorium can be seen, so this doesn’t appear to be a local fluke.</p><p>Nor is it a fluke of thorium alone. The concentration of calcium, manganese, and sulfur drop extremely low at the same time in the team’s new cores. The number of shells from single-celled plankton called foraminifera also drops to near zero.</p><p>The big-picture scenario here, the researchers say, relates to the fact that the Bering Land Bridge between Asia and North America cuts off the Arctic Ocean from the Pacific when sea level drops far enough. With that outlet gone, the Arctic Ocean is then only connected by the Atlantic through the comparatively shallow seas between Greenland and Norway. The presence of floating ice shelves connected to glaciers on land in that shallow region could restrict water flow from the Atlantic into the Arctic. Melting glacial ice could then dump enough freshwater into the Arctic that any remaining flow would mostly go outward into the Atlantic, flushing out Arctic saltwater and stopping Atlantic saltwater from coming in to replace it.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/arctic_ocean_freshwater_intervals_illustration-3.jpg\" data-height=\"2008\" data-width=\"2072\" alt=\"Here's what the situation could have looked like.\"><img alt=\"Here's what the situation could have looked like.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/arctic_ocean_freshwater_intervals_illustration-3-640x620.jpg\" width=\"640\" height=\"620\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/arctic_ocean_freshwater_intervals_illustration-3-1280x1240.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/arctic_ocean_freshwater_intervals_illustration-3.jpg\" data-height=\"2008\" data-width=\"2072\">Enlarge</a> <span>/</span> Here's what the situation could have looked like.</p><p>Alfred Wegener Institute/Martin Künsting</p></figcaption></figure><p>There is other evidence for floating ice shelves in those places, including erosional marks where they could have come into contact with shallow seafloor. The researchers attempted some back-of-the-envelope volume estimates for glacial meltwater entering the Arctic and the ensuing flow through the constricted connection with the Atlantic. Even using conservative numbers, the researchers say that the saltwater could be flushed out and replaced within something like 8,000 years. That’s not quite the blink of an eye, but it’s fast enough to work with the time intervals identified here.</p><h2>Lack of alternatives</h2><p>A few alternative explanations have been suggested for the low thorium-230 sections, but the researchers found that none of them quite works. It’s not possible that the thorium was simply carried out of the area by currents, for example, because whatever seawater moved in to replace it should have carried its own thorium. Thorium tends to glom on to particles and sink straight down, anyway. One idea is that a rapid sedimentation event (perhaps due to glacial activity) could have diluted the thorium. But given that low thorium is seen across the Arctic, the scale and rate of sedimentation would have to be off the charts, and you’d expect that to produce some other changes in chemistry—which aren’t there.</p><p>Interestingly, this freshwater scenario actually makes trouble for some sea-level reconstructions. One way these reconstructions is done involves using isotopes of oxygen in seafloor fossils, as transfers of water from the ocean onto land (as ice) preferentially transfer more of one isotope than another. This means that the ratio of oxygen isotopes left behind in the ocean tracks the volume of ice on land.</p><p>But if a bunch of that ice on land melted, sending water into the Arctic Ocean <em>without mixing freely with seawater elsewhere</em>, the oxygen isotope ratio in the Atlantic would fail to accurately represent sea level. There are other data points for past sea level, like the elevation of platforms of coral fossils. The researchers point to some coral data points that show a higher sea level in these time periods than the oxygen isotope reconstruction shows. Perhaps a freshwater Arctic could explain the mismatch, necessitating a fresh look at sea level, too.</p><p>Nature, 2020. DOI: <a href=\"http://dx.doi.org/10.1038/s41586-021-03186-y%20\">10.1038/s41586-021-03186-y </a>(<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div>","author":"Scott K. Johnson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3b4a6656f53155e930f9447ad1bffe2def09be1ea35f7e61ff16162e4be24dd1","category":"Tech"}