{"title":"Comcast scrambled to fix mistake that cut some users’ upload speeds by 20%","link":"https://arstechnica.com/?p=1748580","date":1615403444000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Comcast upgrade goes wrong —</h4><h2 itemprop=\"description\">Comcast upgrade backfired, reducing uploads from 20 to 16Mbps until it was fixed.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/getty-oops-800x475.jpg\" alt=\"A computer keyboard with a key labeled \" oops.=\"\"><figcaption></figcaption></figure><p>Some Comcast customers received an unwelcome surprise yesterday morning when their upload speeds were suddenly lowered from 20Mbps to 16Mbps. Comcast was raising download speeds on its \"Extreme Pro\" tier from 600Mbps to 800Mbps—good news, to be sure—but the plan's relatively paltry 20Mbps upload speeds received a simultaneous 20 percent cut.</p><p>Customers affected by the change complained to Comcast, and two of them emailed Ars yesterday. When we passed these complaints on to Comcast public relations, a spokesperson initially told us that \"there was no change to the upstream speed.\" But after we pointed out that customers were in fact getting reduced upload speeds, Comcast investigated further and discovered it made a mistake while rolling out download-speed upgrades for some of its plans.</p><p>\"The customers who received the [download] speed increase last night should now be seeing the correct upload speeds in their usage meter,\" Comcast told Ars last night. \"When we pushed the speed increase overnight, there was an issue with how the upload speeds were provisioned, which is why the meter and our internal tools that our care agents use were showing the upload speed of 16Mbps. Once you notified us, we quickly looked into it and everything should be correct now.\"</p><p>The fix is rolling out automatically so customers don't have to do anything, Comcast said. \"For a period of less than 24 hours, customers would have seen slightly slower upload speeds,\" Comcast told us. \"This issue only impacted customers in our Central markets who received this [download] speed increase from 600Mbps to 800Mbps.\"</p><p>Comcast overprovisions speeds so that customers often get a bit more than their advertised plan states. This strategy can reduce user complaints in general, and it means that customers' uploads weren't necessarily cut all the way down to 16Mbps when yesterday's bug hit.</p><p>Comcast told us that the problem affected users in Alabama, Arkansas, Florida, Georgia, Illinois, Indiana, Kentucky, Louisiana, Michigan,&nbsp;Mississippi, South Carolina, and Tennessee. Comcast often makes network changes one region at a time, so we assume customers in other states will get the download-speed increases later on if they haven't already.</p><h2>Confusion for customers and Comcast reps</h2><p>The upload-speed cut caused confusion for customers and the Comcast customer-service agents who fielded their calls yesterday morning and afternoon.</p><p>\"I called in and had to talk with three different agents, then finally a supervisor,\" Wesley, a Comcast customer in Fort Lauderdale, Florida, told Ars yesterday afternoon. \"He said they have been getting calls all morning... He said my download went up to 800Mbps, I should be grateful. I explained I am now working from home due to COVID and spend my days web conferencing and need my upload speed. He then tried to talk me into upgrading my plan to Gig, for $20 more per month, which I can't afford. There was no warning, no price reduction, only shock by this shady move.\"</p><p>Another customer named Andrew in Lansing, Michigan, contacted us about the same problem yesterday morning, saying he saw the changed speeds in his account and ran a speed test that confirmed the higher download speeds and lower upload speeds.&nbsp;\"I just talked with [Comcast],\" he told us. \"Their documentation shows that it should be at 20Mbps upload however they were able to confirm on my account that it is at 16Mbps. They went ahead and made a ticket for it.\"</p><p>A speed test Andrew ran on Saturday, a few days before the change, showed speeds of 713Mbps down and 24Mbps up, higher than the advertised 600/20Mbps—evidence of Comcast's overprovisioning mentioned earlier in this article. After the change but before last night's fix, he got 945Mbps downloads (a 32.5 percent increase in actual speeds) and 19Mbps uploads (a 20.8 percent decrease in actual speeds). Andrew's measured upload speed was back to 24Mbps today, so he's got the same uploads as before but faster downloads.</p><p>Comcast told us that upload speeds were \"provisioned\" at 20Mbps yesterday even though customers' plan details were showing 16Mbps when the error was in place. Now that it's back to normal, customers should see 20Mbps as their advertised upload speeds&nbsp;and may get actual upload speeds above 20Mbps due to the over-provisioning that is normally in place.</p><p>Both Wesley and Andrew told us the problem had been fixed before 8 pm EST last night. \"I did a reboot of the cable modem, and my upload speeds have returned to 20Mbps, and the account online reports 20Mbps as well. Either someone messed up or Comcast backtracked from what they were planning to do,\" Andrew told Ars.</p><p>\"Perhaps the flood of calls Comcast received about this today made them quickly backtrack on this,\" Wesley told us last night. \"My modem just rebooted again, so I checked my account status and I got my [20Mbps] upload speed back... looks like they did the right thing for the customers.\"</p><h2>Comcast makes upload speeds hard to find</h2><p>The problem could have gone unnoticed and unfixed for longer if not for eagle-eyed customers tracking their upload speeds. Comcast makes finding its upload speeds exceedingly difficult, as we described in an <a href=\"https://arstechnica.com/tech-policy/2021/03/comcast-hides-upload-speeds-deep-inside-its-infuriating-ordering-system/\">article last week</a>. For new customers, Comcast's ordering system doesn't reveal each plan's upload speeds until you enter a valid credit card number. Even existing customers have had trouble finding their upload speeds, leading to <a href=\"https://forums.xfinity.com/t5/Your-Home-Network/Extreme-Pro-Internet-Upload-Speed/td-p/3274903\">customer-forum threads</a> where other users explained where to find them in the customer-account portal.</p><p>\"I have no idea why Comcast thinks upload speed isn't important,\" one person wrote in a Comcast <a href=\"https://forums.xfinity.com/t5/Your-Home-Network/How-do-I-find-upload-speeds-of-my-plan-or-any-other-plans/td-p/3362852\">customer forum</a> last week. \"It is extremely important for video conferencing which is a big part of our lives now, [and] every bit of data downloaded has to send confirmation packets back to the server. You can't download without adequate upload speeds. Really disappointed Comcast deliberately hides this info, but I get it. If I had such a lousy ratio of upload to download speed I'd hide it too. It's embarrassing. Max 35Mbps [upload speeds] for the gigabit [download] plan? It's a joke.\"</p><p>It's good for customers that Comcast keeps raising download speeds—and also good that yesterday's upload-speed cut turned out to be a mistake that was quickly reversed—but Comcast's download-speed hikes usually aren't paired with upload-speed increases. One exception is that Comcast this month <a href=\"https://arstechnica.com/tech-policy/2021/02/comcast-lifts-uploads-to-5mbps-amid-complaints-its-low-income-plan-is-too-slow/\">raised speeds</a> on its plan for low-income households from 25Mbps down and 3Mbps up to 50Mbps down and 5Mbps up after complaints about the plan's low speeds.</p><p>The cable industry has been promising higher upload speeds for years while hyping upgrades to DOCSIS, the Data Over Cable Service Interface Specification used to provide Internet access over coaxial cables. Yet cable upload speeds remain annoyingly low while fiber-to-the-home services that aren't as widely available as cable provide hundreds of megabits for both downloads and uploads.</p><p><a href=\"https://arstechnica.com/information-technology/2020/10/comcast-says-gigabit-downloads-and-uploads-are-now-possible-over-cable/\">Comcast in October 2020</a> announced a \"technical milestone\" that can deliver gigabit-plus download and upload speeds over existing cable wires. But the technology has only been deployed in testing, and Comcast's cable upload speeds still max out at the 35Mbps that come with the gigabit-download plan. Comcast last week told us it has \"nothing to announce about increases to our upstream speeds at this time.\"</p></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3b4da37f428d0333cee5a6b2bff17d639c4e8e3a054f495f796d3197d3d754f3","category":"Tech"}