{"title":"Benoît Cosnefroy vs Julian Alaphilippe: compatriots, friends and rivals","link":"https://cyclingtips.com/2021/12/benoit-cosnefroy-vs-julian-alaphilippe-compatriots-friends-and-rivals/","date":1638636490000,"content":"<div><div><p>Benoît Cosnefroy has been around for a while, having turned pro with his current team AG2R Citroën in late 2017 after a stagiare season the year before. But after a successful second half of 2021, he’s increasingly finding himself compared with fellow Frenchman Julian Alaphilippe.</p><p>“Julian is pretty much the best rider in the world in his profile. He definitely inspires me,” Cosnefroy told Cyclingnews. “When he wins a race, I look at how he does it, how he gets the better of his rivals. I get on very well with him. He’s a great rider. He’s very generous in his turns but he has this mischief. He plays a lot, he shows a lot of personality, and I like that.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/GettyImages-1342810526-1340x893.jpg\"><figcaption>Julian Alaphilippe celebrates his second consecutive world title with friend and teammate Benoît Cosnefroy.</figcaption></figure><p>The 26-year-old had been knocking on the door of a WorldTour victory for a couple of seasons before finally <a href=\"https://cyclingtips.com/2021/08/benoit-cosnefroy-out-sprints-julian-alaphilippe-to-win-the-bretagne-classic/\">snatching the Bretagne Classic</a> from under the nose of Alaphilippe this summer.</p><p>“At the start of the season, my aim was to win my first WorldTour race,” he said. “I knew it was possible but that I would need all the stars to align, and it’s not often that happens. There is quite a small circle of riders who win most WorldTour races. I said to myself maybe it can happen, but when I crossed the line I was like ‘it’s done, I did it’. It was a great satisfaction.”</p><p>The AG2R Citroën rider found himself outnumbered by Deceuninck-QuickStep riders after the trio broke clear towards the end of the race, but as they rode the last 60km together, he felt neither Alaphilippe nor Mikkel Honoré had the legs to attack him in the finale.</p><p>“I wasn’t stressed. I considered it an advantage to have two QuickStep riders with me – not a bad thing,” Cosnefroy recalled. “I know Julian and I know sometimes if he doesn’t win it’s not that serious. He has nothing to prove to anyone, so I thought maybe it’s not that big a deal for him if he doesn’t win this one.</p><p>“I didn’t have any fear about going to the sprint with Julian. I knew I was a little stronger on the day, so I sensed it was possible. It’s the first sprint I’ve ever won against him. Julian led me out really nicely, actually!”</p><p>Cosnefroy went on to win the lumpy Tour de Jura a week after winning the Bretagne Classic, and he took bronze in the European Championships a weekend later. Then, after a strong showing at the Skoda Tour de Luxembourg, Cosnefroy was a key part of the French tactical masterclass that culminated in <a href=\"https://cyclingtips.com/2021/09/julian-alaphilippe-successfully-defends-his-rainbow-jersey/\">Alaphilippe’s World Championship victory</a> in Leuven. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/GettyImages-1342652453-1340x893.jpg\"><figcaption>Benoît Cosnefroy (France) goes on the attack during the 2021 World Championship road race, marked by Remco Evenepoel (Belgium) and Magnus Cort (Denmark).</figcaption></figure><p>The 2017 U23 world champion also played a starring role in <a href=\"https://www.instagram.com/p/CUTLpSOAumv/?utm_source=ig_web_copy_link\">that evening’s festivities</a>.</p><p>“I’m someone who gives a lot – whether it’s in the race or the party,” a grinning Cosnefroy said. “It was a good party, that’s safe to say.</p><p>“You don’t get many moments like that in a career. You can’t be sure you’ll experience it again, so you have to make the most of it. You can’t bid your teammates goodnight after two hours, it’s not possible. We made the most of it and, it has to be said, Julian knows how to party as well.”</p><p>The comparisons between Cosnefroy and Alaphilippe, just three years his senior, are more than justified. Like the world champion, the younger man is well suited to the hilly Spring Classics, his best result so far coming at La Flèche Wallonne last year when he finished second behind Marc Hirschi.</p><p>With AG2R Citroën’s personnel shake-up coming into 2021 – Romain Bardet leaving for DSM, and the addition of Greg van Avermaet, Ben O’Connor and Bob Jungels – Cosnefroy was presented as a team leader heading into the spring.</p><p>However, with an old injury plaguing the early part of his season, Cosnefroy’s spring campaign did not go quite as he hoped.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/GettyImages-1312486436-1340x893.jpg\"><figcaption>Cosnefroy’s best result in his targeted Spring Classics was eighth at De Brabantse Pijl.</figcaption></figure><p>“The first half of the year was really difficult for me,” Cosnefroy said. “Looking back, I wasn’t ready at all for the Ardennes. I still had pain in the knee. I was hoping something could happen for me but I was not on my level. I wanted to do the races because it would have been harder for me not to do them. I went knowing I wasn’t at 100 per cent but I preferred to do that than watch on TV.”</p><p>Cosnefroy had also set his sights on the first weekend of the Tour de France, hosted by his beloved Brittany, but he got caught up in the early crashes and he wasn’t able to contest. It was of course Alaphilippe who surged to stage 1 victory in Landerneau and into the first yellow jersey of the race.</p><p>In 2022, Cosnefroy’s goals remain the same, starting with a maiden Ardennes Classic victory.</p><p>“That would be a dream. It’s really the big objective of my career,” Cosnefroy said. “I don’t know if it will happen, but I will work hard for it.”</p><p>One thing is for sure, Cosnefroy will not be able to avoid his compatriot, his friend, his rival.</p><p>“Next year, Julian and I will be playing a lot of the same matches. I’ve beaten him now, and and hope I can do it again.”</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3c8d4a6adb7a00ee5c5f447a578fa230b0265b484461164877bb46b323c76c4e","category":"Cycling"}