{"title":"Route revealed: The 2022 Giro looks like a good one for the climbers","link":"https://cyclingtips.com/2021/11/route-revealed-the-2022-giro-looks-like-a-good-one-for-the-climbers/","date":1636677307000,"content":"<div><div><p>It took more than a week for the route of the 2022 Giro d’Italia to be revealed as organizers decided to extend the process of presenting the <em>percorso</em> across several days this year, but the full course has finally been unveiled as of Thursday.</p><p>For the GC hopefuls with strong climbing legs, the long wait for the reveal paid off. The time trial talents, however, might feel a bit differently.</p><p>The 2022 Giro d’Italia will feature roughly 51,000 meters of total climbing across some very tough high mountain stages and a few punchy days too. Meanwhile, riders will only be facing a grand total of 26.3 km against the clock across two short TTs, both of which will feature Cat 4 climbs. That makes for the smallest amount of time trialing a Giro has included since all the way back in 1962.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/giromap-1340x1895.jpeg\"></figure><p>As announced last week when organizers kicked off the process of revealing the route, the Giro will roll out from Budapest on May 6 with the first of three stages in Hungary. Stage 1 is mostly flat before taking on a punchy finish. Up next is the first time trial, which closes out with a Cat 4 ascent, and then a day for the sprinters will close out the Giro’s Hungarian sojourn.</p><p>After a transfer to Sicily, the first week of the Giro will continue with a challenging mountain stage finishing on the slopes of Mount Etna. The following day will also cover Sicilian roads with a fast finisher likely to shine in a flat finale, and the speedsters should have another chance as the race heads to the Italian mainland on stage 6.</p><p>Stage 7 will feature a handful of tough climbs and a hilly stage 8 could make for an interesting day of up-and-down racing, much of it on a circuit in and around Bacoli. Then comes stage 9, which will ascend an early Cat 2 before taking on a brutal finale featuring the Cat 1 Passo Lanciano and the Cat 1 Blockhaus climb.</p><p>A well-deserved rest day will follow, and then the peloton will take on a hilly stage 10, a sprinter-friendly stage 11, a hilly stage 12, and another sprinter-friendly day on stage 13. The climbers will again come to the fore on a demanding stage 14. None of the numerous ascents on the docket is particularly daunting on its own, but all told, the day will ascend 3,470 vertical meters in a relatively short span of 153 km.</p><p>Riders won’t get much of an opportunity to catch their breath either. Stage 15 takes the peloton into the mountains with two Cat 2s and a Cat 1 inside the final 84 km of racing.</p><p>After a final rest day, the third week of the Giro will throw some serious challenges at the pack. Stage 16 will cover three Cat 1 climbs. First up after riders roll out from Salò is the Goletto di Cadino, which ascends to 1,938 meters. Then it’s onto the iconc Passo del Mortirolo. After a descent, an uncategorized but steep ascent, and another descent, riders will climb to Santa Cristina, summiting the climb 6.1 km from the stage finish in Aprica. Stage 17, from Ponte di Legno to Lavarone, won’t offer much of a reprieve, with two steep Cat 1s in the last 50 km of the day.</p><p>The sprinters should have their final chance of the race on stage 18 before three straight days with GC implications will close out the race. Stage 19 will cross into Slovenia to take on the steep Cat 1 Kolovrat climb, and the day will conclude with a punchy Cat 2 finish at the Santuario di Castelmonte. From there, it’s on to the last day in the high mountains.</p><p>Stage 20 will truly be a day for the mountain goats: First up is an ascent of the Cat 1 Passo San Pellegrino, topping out at 1,918 meters, and then comes the Passo Pordoi, which will take the peloton to the highest point in the Giro, the Cima Coppi, at 2,239 meters. After some tricky descending, riders will finish on the Passo Fedaia, whose final 5 km feature double-digit gradients.</p><p>After three weeks of racing, the Giro d’Italia will come to a close in Verona on May 29 with a 17.1 km time trial that tackles a Cat 4 climb shortly after the midpoint of the day. The route is the same as that of the final TT of the 2019 Giro, where Chad Haga took the win.</p><p>From start to finish, the race will feature four serious summit finishes and a handful of other tough mountain stages and several hilly days. For all the tough climbing on the menu, the sprinters should also have their fair share of chances, with something in the order of six or seven days for the fast finishers, with question marks on a handful of stages that feature climbs before flat finishes.</p><p>The time trialists, meanwhile, won’t have much distance to cover as they show off their talents, but there will at least be two stages on offer against the clock.</p><p>All told, the peloton will cover a grand total of 3,410.3 km as the top riders in the bunch look to follow 2021 winner Egan Bernal (Ineos Grenadiers) as Giro champ.</p><h2>The 2022 Giro d’Italia route</h2><p><strong>Stage 1</strong>: Budapest to Visegrád, 195 km<br><strong>Stage 2</strong>: Budapest to Budapest, 9.2 km (ITT)<br><strong>Stage 3</strong>: Kaposvár to Balatonfüred, 201 km<br><strong>Stage 4</strong>: Avola to Etna, 166 km<br><strong>Stage 5</strong>: Catania to Messina, 172 km<br><strong>Stage 6</strong>: Palmi to Scalea, 192 km<br><strong>Stage 7</strong>: Diamante to Potenza, 198 km<br><strong>Stage 8</strong>: Napoli to Napoli, 149 km<br><strong>Stage 9</strong>: Isernia to Blockhaus, 187 km<br><strong>Stage 10</strong>: Pescara to Jesi, 194 km<br><strong>Stage 11</strong>: Santarcangelo di Romagna to Reggio Emilia, 201 km<br><strong>Stage 12</strong>: Parma to Genova, 186 km<br><strong>Stage 13</strong>: Sanremo to Cuneo, 157 km<br><strong>Stage 14</strong>: Santena to Torino, 153 km<br><strong>Stage 15</strong>: Rivarolo Canavese to Cogne, 177 km<br><strong>Stage 16</strong>: Salò to Aprica, 200 km<br><strong>Stage 17</strong>: Ponte di Legno to Lavarone, 165 km<br><strong>Stage 18</strong>: Borgo Valsugana to Treviso, 146 km<br><strong>Stage 19</strong>: Marano Lagunare to Santuario di Castelmonte, 178 km<br><strong>Stage 20</strong>: Belluno to Marmolada (Passo Fedaia), 167 km<br><strong>Stage 21</strong>: Verona, 17.1 km (ITT)</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3cee0cd8e72b7333178cf91e4005297dce36014b21695ce7736a2cd84c9e28ae","category":"Cycling"}