{"title":"Former Trump vaccine czar fired over substantiated sexual harassment claim","link":"https://arstechnica.com/?p=1752031","date":1616618305000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>the best people —</h4><h2 itemprop=\"description\">GSK hired a law firm for an investigation, which substantiated the claims.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/slaoui-warp-speed-800x534.jpg\" alt=\"Two men in suits stand by a podium.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/slaoui-warp-speed.jpg\" data-height=\"683\" data-width=\"1024\">Enlarge</a> <span>/</span> President Donald Trump listens as Moncef Slaoui, the former head of GlaxoSmithKlines vaccines division, speaks about coronavirus vaccine development in the Rose Garden of the White House on May 15, 2020, in Washington, DC.</p></figcaption></figure><p>Moncef Slaoui, the former head scientist for the Trump administration’s Operation Warp Speed, has been fired from his position as chair of a biomedical company’s board of directors after an internal investigation substantiated allegations of sexual harassment against him.</p><p>Slaoui was chair of the board directors for Galvani Bioelectronics, a company formed through a partnership between pharmaceutical giant&nbsp;GlaxoSmithKline and Verily Life Sciences (formerly Google Life Sciences). GSK is the majority shareholder of Galvani.</p><p>According to <a href=\"https://www.gsk.com/en-gb/media/press-releases/moncef-slaoui-departs-galvani-bioelectronics-board-of-directors/\">an announcement by GSK</a>, the company received a letter from one of its employees containing allegations of sexual harassment and “inappropriate conduct” by Slaoui, which occurred several years ago while he was working there.</p><p>Slaoui had been an employee at GSK for nearly 30 years—heading the company’s divisions on research and development, then vaccines—before retiring from the company in 2017. He was working as a venture capitalist when the Trump administration tapped him to help lead Operation Warp Speed, where he spearheaded the administration’s effort to speed the development and distribution of COVID-19 vaccines. The Biden administration requested his resignation upon taking office, but Slaoui stayed on in an advisory role into February to help with the transition.</p><p>It was reportedly around that time that GSK received the letter containing allegations of sexual harassment. The company hired an outside law firm to conduct an investigation, which “substantiated the allegations and is ongoing,” GSK said.</p><p>“Dr. Slaoui’s behaviors are wholly unacceptable,” GSK said in its announcement. “They represent an abuse of his leadership position, violate company policies, and are contrary to the strong values that define GSK’s culture.\"</p><p>According to <a href=\"https://www.statnews.com/2021/03/24/moncef-slaoui-former-head-of-operation-warp-speed-fired-from-company-board-over-sexual-harassment-allegations/?utm_source=STAT+Newsletters&amp;utm_campaign=afd023ebee-breaking_COPY_01&amp;utm_medium=email&amp;utm_term=0_8cab1d7961-afd023ebee-149838809\">a report by Stat</a>, GSK CEO Emma Walmsley wrote a note to staff regarding the matter, saying that people at the highest levels of the company have been working for weeks to understand what happened.</p><p>She wrote:</p><blockquote><p>Protecting the woman who came forward and her privacy has been a critical priority throughout this time. This will continue. I respect and admire her courage and strength. I’ve spent many nights lately putting myself in her shoes. More than anything, this simply should not have happened… On a personal level, I am shocked and angry about all of this, but I’m resolute. I want to be clear that sexual harassment is strictly prohibited and will not be tolerated.</p></blockquote><p>Since resigning from Warp Speed, Slaoui has made headlines by saying that the operation had failed in its efforts to immunize Americans. “Indeed, the immunization definitely is not working appropriately,” he said at the end of January. “And as long as that is not working appropriately, we’re failing. Overall, <a href=\"https://arstechnica.com/science/2021/01/were-failing-ex-warp-speed-leader-proud-deflects-blame-on-vaccines/\">we’re failing</a>&nbsp;because the objective is to immunize.” However, he deflected blame for the failure, saying that it was a “huge misunderstanding” of Warp Speed’s intended role in getting shots into arms.</p></div></div>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3e5e7e984fd1fed3c096394768f82ca9b1eb0aea2f5c9c916ee050037f554797","category":"Tech"}