{"title":"Schmid wins stage 11 of the Giro d’Italia as Bernal distances his rivals","link":"https://cyclingtips.com/2021/05/schmid-wins-stage-11-of-the-giro-ditalia-as-bernal-distances-his-rivals/","date":1621438971000,"content":"<div><div><p>Mauro Schmid (Qhubeka-Assos) nabbed his first Grand Tour stage win in his first ever Grand Tour on Wednesday’s stage 11 of the Giro d’Italia. With its 35 km of gravel roads and a few tough climbs as well, the stage also saw some major changes to the GC standings, with Egan Bernal (Ineos Grenadiers) taking time on all of his rivals.</p><p>The 162 km stage from Perugia to Montalcino was contested by riders from the early break. Schmid joined the move that got clear only a few minutes into the stage, and that group was given plenty of breathing room by the peloton. Schmid put in a few surges over the course of the day before getting clear with Dries De Bondt (Alpecin-Fenix) and Alessandro Covi (UAE-Team Emirates) on the final gravel sector, and then Covi and Schmid press on together alone. They made it up and over the final climb together and then the battle for the stage came down to a sprint, where Schmid took a clear win with an emphatic celebration at the line. Harm Vanhoucke (Lotto-Soudal) took third on the day.</p><p>Behind, Dan Martin (Israel Start-Up Nation) and Davide Formolo (UAE-Team Emirates) had lost touch with the GC group with plenty of ground still to cover on the day, and then Remco Evenepoel (Deceuninck-QuickStep) found himself distanced on the penultimate gravel sector with around 20 km to go. Bernal took it upon himself to push the pace in the group and help widen the gap to those left behind.</p><p>Emanuel Buchmann (Bora-Hansgrohe) jumped off the front of the group on the final climb, but Bernal closed him down and then pulled away at the finish, getting a few seconds on Buchmann and several more on the likes of Simon Yates (BikeExchange) and Aleksandr Vlasov (Astana-Premier Tech). Evenepoel and Giulio Ciccone (Trek-Segafredo) as well would lose minutes on the day, while Martin and Formolo are now out of the GC picture entirely.</p><div><div><p>Giro d'Italia (2.UWT) <span>Perugia → Montalcino</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/ff/mauro-schmid-2021.jpeg\"></p></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"3fbc7b3f7488ee56848bb15e9007f5758efc215435a83f70be1c11216c01b223","category":"Cycling"}