{"title":"AWS director sues Amazon, alleging systemic racism in corporate office","link":"https://arstechnica.com/?p=1746418","date":1614721403000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>discrimination —</h4><h2 itemprop=\"description\">Amazon talks up inclusion in public but fails behind the scenes, suit claims.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/01/GettyImages-696675012-800x533.jpg\" alt=\"Amazon's orange-yellow logo wall.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/01/GettyImages-696675012.jpg\" data-height=\"2133\" data-width=\"3200\">Enlarge</a> <span>/</span> Amazon's orange-yellow logo wall.</p></figcaption></figure><p>A senior manager at Amazon Web Services has filed suit against the company alleging race and gender discrimination, saying that she was underpaid, denied promotions, and sexually assaulted at the firm.</p><p>Charlotte Newman, who is Black, began working at AWS in 2017 in a public policy role. Prior to joining Amazon, she served as a congressional advisor, including a senior role advising US Senator Cory Booker (D-NJ). From the start, she alleges, she was \"de-leveled\"—hired at a position below the one for which she applied and for which she was qualified—and undercompensated as a result.</p><p>Underpaying Black employees through de-leveling is routine at Amazon, the suit (<a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/gov.uscourts.dcd_.228121.1.0_1.pdf\">PDF</a>) alleges. \"When a company's top leaders traffic in stereotypes of Black employees and fail to condemn intimidation tactics, managers farther down the chain will take note of that <em>modus operandi</em> and behave accordingly,\" the filing reads.</p><p>During the 2017-2019 time frame, no Black employees were hired at or promoted to the director level (\"L8\") within Amazon's public policy division, the suit alleges. Neither were any Black employees hired at the next level down, L7, until December 2018. Newman had applied for an L7 position but was hired at L6; the suit alleges that she did the work of an L7 job for several years before receiving a promotion to that level in fall 2019.</p><p>While working for Amazon, Newman alleges that she faced multiple instances of colleagues overtly engaging in racial stereotypes to discuss her or her work, describing her as \"just scary,\" \"too direct,\" or looking \"like a gorilla.\"</p><h2>“Dismissive attitude”</h2><p>Management's \"dismissive attitude towards Black and female employees\" such as Newman created an environment in which a senior co-worker seemed to feel perfectly safe sexually harassing and assaulting Newman, the suit adds, outlining several instances in which the colleague touched her inappropriately or propositioned her.</p><p>Newman in 2020 filed complaints within the company about her colleague's behavior, the suit alleges, before then filing an administrative complaint with the Washington, DC Office of Human Rights about her experiences with Amazon.</p><p>Recent reporting would seem to back up Newman's claims about widespread issues within the company. Tech news site Recode last week <a href=\"https://www.vox.com/recode/2021/2/26/22297554/amazon-race-black-diversity-inclusion\">published a deep dive</a> about racial bias inside Amazon.</p><p>More than a dozen current and former corporate employees for the tech behemoth told Recode that Black employees inside Amazon \"often face both direct and insidious bias that harms their careers and personal lives.\" All of the Black employees who spoke with Recode said they or Black colleagues they knew were down-leveled at hiring. Recode also obtained internal documents which seemed to display signs of bias in performance reviews.</p><p>\"We do not tolerate discrimination or harassment of any kind and thoroughly investigate all claims and take appropriate action,\" Amazon said of the claims. \"We are currently investigating the new allegations included in this lawsuit.\"</p><h2>Endemic everywhere</h2><p>Unfortunately, the claims against Amazon are far from unique. Nearly every major tech firm has faced allegations of race and/or gender discrimination from employees in recent years.</p><p>A Black manager at Facebook <a href=\"https://www.washingtonpost.com/technology/2020/07/02/facebook-racial-bias-suit/\">filed a complaint</a> with federal regulators in 2020, alleging a pattern of discrimination and bias against Black employees in \"evaluations, promotions, pay, and hiring practices.\" At the time, just 1.5 percent of Facebook employees in technical jobs were Black.</p><p>Former Pinterest COO Francoise Brougher <a href=\"https://arstechnica.com/tech-policy/2020/08/ousted-coo-sues-pinterest-alleges-rampant-gender-discrimination/\">sued the company</a> in August, alleging that Pinterest, which targets an audience of mainly women, was in fact a rampantly sexist \"boys club\" at the executive level. Several Black women who had worked for Pinterest also spoke out in 2020 about discrimination they had faced at the company. Pinterest <a href=\"https://arstechnica.com/tech-policy/2020/12/pinterest-agrees-to-22-5-million-settlement-in-discrimination-lawsuit/\">settled with Brougher</a> for $22.5 million in December but still faces a <a href=\"https://arstechnica.com/tech-policy/2020/12/pinterest-shareholders-sue-firm-over-rampant-gender-race-discrimination/\">separate shareholder suit</a> over similar allegations.</p><p>Google, too, has faced multiple rounds of discrimination allegations. Last month, the company <a href=\"https://arstechnica.com/tech-policy/2021/02/google-settles-federal-gender-and-race-discrimination-charges-for-3-8m/\">agreed to a $3.8 million settlement</a> with federal regulators to settle allegations it underpaid women software engineers and unfairly passed over women and Asian candidates for software engineering roles. A Black Google employee <a href=\"https://news.bloomberglaw.com/daily-labor-report/google-uses-bait-and-switch-in-diversity-hires-worker-alleges\">also sued the company</a> in 2019, alleging the company used \"bait and switch tactics\" when it hired candidates from racial minorities by placing them in less desirable roles than the positions for which they interviewed.</p></div></div>","author":"Kate Cox","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"3ffb093a5dcf61b6340741cd0bac0f35fcb37b4d564f24382b2e39b4bfbc7a10","category":"Tech"}