{"title":"The Column: On Tom Pidcock's 5k run","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-column-tom-pidcock-5k-time-proves-he-ll-win-the-tour-de-france","date":1613153337000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>February 12, 2021</span></p><div><p><span>Tom Pidcock's 5k time proves he’ll someday win&nbsp;a Grand&nbsp;Tour, but not for the reason you’d think</span></p></div></div><div><p><span>Athletic crossovers are one of the highlights of modern sport. Whether it’s Michael Jordan trying his luck at baseball or Bradley Wiggins turning his formidable engine to rowing, a champion transitioning from one discipline to another is one of the few events to draw the interest of millions interested in neither sport. It presents questions around physiology, mental strength and the comparative toughness of different sports.&nbsp;</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><span>A common thread, however, is that these crossovers rarely come to much.&nbsp;</span></p><p><span>Of course, there are some notable exceptions, such as the extremely accomplished Rebecca Romero. But generally, the list of Olympic champions who have retrained in a new sport and become the world's best is extremely brief. Michael Jordan had to switch back to basketball, and Wiggins produced an impressive but far from world-beating time in his indoor rowing debut.</span></p><p><span><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-column-absolutely-tucked\">Related – The Column: Absolutely Tucked</a></strong></em><br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tom-pidcock-that-s-entertainment\"><em><strong>Related – Tom Pidcock: That's Entertainment</strong></em></a></span></p><p><span>Not quite a fully fledged crossover, but&nbsp;Tom Pidcock splashed across his social media that he had gone for a 5k run on Sunday morning, just to see how quickly he could do it. To his pleasant surprise, he clocked a time of 13 minutes and 25 seconds.</span></p><p><span>If you’re not much of a runner, then it’s worth clarifying exactly how fast 13.25 is. I can jog a 19-minute 5k in anger, which is decent for your average Joe. My fast friends can dip below 17 minutes. I have heard legends of friends of friends who clock around 15.</span></p><p><span>A time of 13.25, though, is ridiculously quick – quite literally. It’s simply impractically fast. A 13.25 5k makes for a one kilometre split of 2.41, an average mile in 4.19, each 100m split segment run in 16.1 seconds.</span></p><p><span>To put that into context, that’s five seconds off the British record. It’s faster than both the Chinese and Indian national record. It would put him just outside the top 25 5k runners of all time. Seemingly done&nbsp;</span>w<span>ith no preparation on a cold Sunday morning, while wearing a jacket, on a stretch of pavement near Gipton.</span></p><p><span>Which led to a popular question –&nbsp;did Pidcock actually run 13.25? Many&nbsp;argued that the video he posted on <a href=\"https://www.instagram.com/tompidcock/?hl=en\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a> didn’t&nbsp;show that sort of pace (in fairness, fast runners often don’t look fast), and others pointed towards abnormalities on his Strava file (have <a href=\"https://www.strava.com/athletes/16345903/posts/14406985\" target=\"_blank\" rel=\"noopener noreferrer\">a look</a> if you like).</span></p><p><span>None of this is to suggest that Pidcock in any way sought to deceive anyone, nor that we can 100% say he didn’t run 5k in 13.25. But, there’s something about Pidcock’s run that really says a lot about his character.</span></p><meta charset=\"utf-8\"><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Pidcock_column_2_1024x1024.jpg?v=1613146014\" alt=\"\"></span></p><p><span>Many athletes would perhaps have looked at their time, seen it was faster than the national record of multiple countries collectively containing billions of occupants, and suspected something was awry. Pidcock, seemingly, didn’t.</span></p><p><span>That confidence could easily be under-appreciated. If it were me who had mistaken a casual run for a genuinely historic athletic event, it would be fair to level accusations of&nbsp;a little over-confidence and naivety. But Pidcock is different.</span></p><p><span>Sitting at the pinnacle of the world in his sport, regularly lining up against some of the greatest cyclists to have ever lived and often besting them, takes a certain mentality. The mindset of an athlete who can shoulder the pressure of millions of spectators and not crumble in an anxious puddle requires something rather extraordinary. Amongst us normal mortals, you’d call it delusions of grandeur. Amongst world-topping athletes, it’s the&nbsp;necessary self-belief.</span></p><p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/neo-pros-to-watch-in-2021\"><em><strong>Related – Neo-Pros to watch in 2021</strong></em></a></p><p><span>So the reason Pidcock didn’t question running 5k in 13.25 is probably the same reason the 21-year old out-paced titans like Mathieu van der Poel and Toon Aerts at the Superprestige. He didn’t once stop to question if he was somehow out of his depth or in the midst of some spectacular lucid dream.</span></p><p><span>It will probably be the reason that he tears his legs to pieces in a Grand Tour in the seasons to come, chasing for the leading group of GC contenders – baffled that he can’t easily keep pace with them.</span></p><p><span>So, perhaps Pidcock did run one of the fastest 5k runs of all time last weekend,&nbsp;confirming a truly super-human biology that will see him win multiple Grand Tours and World titles. But, perhaps what’s more important is that he believed he did.&nbsp;</span></p><p><span>No doubt he believes he’ll be a Grand Tour winner someday too. That, we can believe.</span></p></div></div>","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4098dcea648b4779bd2b9269295e8af6815dd3e775d7cec9cce7395c4cf55dec","category":"Cycling"}