{"title":"Must Watch: This is Home – Matt Hunter, a Shimano Original","link":"https://bikerumor.com/2021/07/28/must-watch-this-is-home-matt-hunter-a-shimano-original/","date":1627487679000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Home. We’ve all been forced to revisit what that word means as the world has struggled through this pandemic. While most mountain bikers are nomadic by nature, searching for the best trails across the globe, there’s also something to be said for your home. Particularly if it’s somewhere that offers as much as Kamloops does for Matt Hunter.</p><p><span><iframe loading=\"lazy\" width=\"696\" height=\"392\" data-ezsrc=\"https://www.youtube.com/embed/HP-Kzn3ZfsI?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\" ezoid=\"0.6856141632327011\"></iframe></span></p><p>But as Matt eventually concludes — home isn’t worth much without the people who make it special.</p><p><i>For many people, mountain biking is a migratory sport. Once you get a taste for the trails, moving closer to ride every day is a no brainer for those who choose the lifestyle. For Matt Hunter, migration was&nbsp;never necessary. He grew up in Kamloops, where the surrounding landscape was an ever-present inspiration for his own riding.</i></p><p><i><p>A child of the BC outdoors, Matt’s idea of a good day is any day he gets to ride his bikes. It’s never been about being the best, but rather standing shoulder to shoulder with his peers, never apart and never&nbsp;above. Matt has always just wanted the sport to look as good as it feels when he stomps his butter-smooth lines and gargantuan airs.</p></i></p><p><i>In his hometown of Kamloops, Matt never needed to journey far to escape the distractions of everyday life. Now with kids of his own, however, those precious moments are all the more enriched by the people&nbsp;around him. Chill rides with the fam or power trains on The Farm, This is Home.</i></p></div></div>","author":"Zach Overholt","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"420c8d74e819996c60c81ada54adfd821f9acfdf8b669fb60cd480349f12acb6","category":"Cycling"}