{"title":"Lazer Bullet 2.0 helmet review","link":"https://www.cyclist.co.uk/reviews/9225/lazer-bullet-20-helmet-review","date":1612888271000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>If you’re not sure whether you want an aero helmet or one with more ventilation, the Lazer Bullet 2.0 lets you hedge your bets.<br>Its shape is edgily aero, with quite an enclosed, elongated profile with a long flat fin that juts out on top at the rear. Along with the long rear sides, it shelters the dial adjuster for the cradle from the airflow over the helmet.</p><p>The Lazer Bullet 2.0 sits quite close to the head, which should help lower its frontal profile for a bit less wind resistance.</p>&nbsp;<p>Front and centre is the Airslide adjustable vent system, with a sliding panel. Underneath the honeycomb patterned face are four sprung louvres. Slide the vent panel down and the louvres close too, giving you less airflow but a closed front to the helmet, which is potentially more aero.</p><p><a href=\"https://www.freewheel.co.uk/lazer-bullet-2-0-helmet-varbullet2\" target=\"_blank\"><em><strong>Buy the Lazer Bullet 2.0 from Freewheel now for £99.99</strong></em></a></p><p>When you slide the panel up on the helmet, the louvres spring open and a slot opens at the front of the helmet. This allows significantly more air to flow over the head, helping to keep you cooler. Although the open area at the front of the helmet is still smaller than with a more traditional road helmet, there are deep internal channels across the crest of the helmet that help with ventilation.</p>&nbsp;<p>Lazer ships the Bullet 2.0 with a second, fully enclosed front panel that can be used in place of the honeycomb vent. It too slides up and down, so you can open up the slot vent at the front of the helmet. There’s a second enclosed panel that you can swap in for the vent on the top of the helmet, for an even smoother profile.</p><p>The enclosed front panel slides up and down a bit more easily than the louvred one, which I found a bit tricky to operate while riding. A bit of vaseline on its edges made it smoother to operate.</p><p>For yet more aero, the Lazer Bullet 2.0 comes with a visor that attaches with two magnets. A third magnet, centrally placed, lets you dock the visor to the top of the helmet at its rear.</p>&nbsp;<p>So there’s a lot of potential to fine tune your helmet’s mix of aerodynamics and ventilation to how you want to ride. It’s a helmet that could be set up to work fine for road rides, but would also serve for a <a href=\"https://www.cyclist.co.uk/tags/time-trial\">time-trial</a> if you didn’t want to invest in a helmet specifically designed for rides against the clock.</p><h3>Comfortable as well as aero</h3><p>Put aside the Lazer Bullet 2.0’s aero creds and it’s comfortable to wear, sitting firmly on my head without pressure points or wobble. The straps sat close to my head too. That’s important as flappy straps aren’t going to do much for a helmet’s aerodynamics.</p><p>The Bullet 2.0 is well finished, with the shell plastic covering most of the EPS foam, which should make it less prone to gouges and bashes. There’s a tiny red blinkie powered by a couple of coin cells built into the rear dial adjuster to add a bit more road presence.</p><p><a href=\"https://www.freewheel.co.uk/lazer-bullet-2-0-helmet-varbullet2\" target=\"_blank\"><em><strong>Buy the Lazer Bullet 2.0 from Freewheel now for £99.99</strong></em></a></p><p>The helmet has other tricks up its sleeve too. It’s available with Mips as well as the non-Mips version I tested. You can also fit Lazer’s Lifebeam sensor that measures your heart rate from the pulse in your head and it fits Lazer’s head inclination sensor that lets you know if you’re not keeping your head at the optimal aero angle.</p><p>So the Lazer Bullet 2.0 has loads of features and options to fine-tune your setup. But the complexity makes for quite a weighty helmet. In size large it came in at just under 400g. The helmet feels quite heavy in the hand, although it’s not something I noticed once out riding.</p><p>Did the Lazer Bullet 2.0 give me an aero edge? I couldn’t say, but it looks the part and is comfortable to ride in.</p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"422ad47ad1175f91a697ffca7a00368f6566a61c8d31dcb732e3e1f8a0ff0b52","category":"Cycling"}