{"title":"Marianne Vos: ‘When you’re so close, it’s very sour’","link":"https://cyclingtips.com/2021/09/marianne-vos-when-youre-so-close-its-very-sour/","date":1632586630000,"content":"<div><div><p>Marianne Vos finished second behind 2021 road <a href=\"https://cyclingtips.com/2021/09/young-italian-elisa-balsamo-is-your-new-road-world-champion/\">world champion Elisa Balsamo</a>, winning the silver medal for the sixth time in her career.</p><p>“When you’re so close, it’s very sour.”</p><p>The three-time world champion was in tears after the finish, clearly devastated after coming so close to claiming a fourth title 15 years after her first.</p><p>“I couldn’t catch Elisa Balsamo,” Vos said after the race. “Then it’s painful meters, I just missed a little punch. I’ve been through this a few times before. I can handle it, but you don’t get opportunities like this every day.” </p><p>A large group approached the finish together after almost 60 km of aggressive racing, and the Italians took over at the front to prepare for the sprint. Elisa Longo Borghini had Balsamo on her wheel, and the lead-out was so powerful that they pulled away from the bunch, taking only Vos with them. The split held all the way to the line and the bunch was left fighting for third.</p><p>“I don’t know what went wrong,” Vos gave her assessment of the final sprint. “I was in the perfect wheel, that gap in the last meters was very beneficial for me. Balsamo simply had the fastest sprint.”</p><p>The incredibly strong Netherlands team, clear pre-race favourites, were active throughout the race, all eight riders helping write the day’s story.</p><p>“We wanted to be alert and not let anything go,” Vos explained. “There was always someone in orange at the front. They attacked and jumped across, as had been discussed beforehand. The course was just not selective enough. Just like a harmonica effect.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/GettyImages-1342450579-1340x893.jpg\"><figcaption>Marianne Vos (Netherlands) alongside 2021 world champion Elisa Balsamo (Italy) and bronze medal-winner Kasia Niewiadoma (Poland).</figcaption></figure></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"42ad91175253d67532f70b92b4fc2f29214ba0a42c1a4e49f70963a5a9cbe845","category":"Cycling"}