{"title":"Spotlight: Earshots magnetic Bluetooth headphones","link":"https://cyclingtips.com/2021/04/spotlight-earshots-magnetic-bluetooth-headphones/","date":1618185600000,"content":"<div><div><p>Earshots headphones were “forged in the mountains of New Zealand” and designed especially for cyclists and runners. The genesis of the idea came when company founder, James Bell-Booth, was training for the <a href=\"https://www.t42.co.nz/\" target=\"_blank\">T42 adventure race</a> in New Zealand and was getting increasingly frustrated with headphones that fell out and constantly needed adjusting. He started by trying to use magnets to keep his iPod shuffle headphones in. Years later, Earshots were born.</p><p>Like many other headphones, Earshots loop around the outside of the ear. Unlike other brands though, the headphones are kept in place by magnets in both the main unit (behind your ear) and in the earbuds themselves.</p><p>I found the Earshots a little fiddly to get in place the first few times, but before too long I wasn’t having any trouble. And once they’re in place, they definitely stay that way. I was very impressed with the firm hold on offer here – much better than the <a href=\"https://cyclingtips.com/2020/11/tech-round-up-12-new-gear-from-pro-wera-fizik-and-more/#earbuds\" target=\"_blank\">Skullcandy Push Ultras</a> I reviewed recently, for example.</p><p>The Earshots have all the usual features you’d expect from modern headphones. They connect easily to your smartphone (or other device) via Bluetooth, you can make and take phone calls from them, and you can use them in solo mode (i.e. only one headphone at a time).</p><p>And as with many rival offerings, the Earshots come in a self-charging case. A full charge of the headphones lasts a claimed four hours (the batteries are integrated and non-removable) while the case offers another 16 hours of charge. The Earshots have an <a href=\"https://en.wikipedia.org/wiki/IP_Code\" target=\"_blank\">IPX4 waterproof rating</a>, meaning water splashing against the enclosure from any direction shouldn’t have any negative effects. So sweat and a bit of rain is fine – I just wouldn’t recommend swimming in them.</p><p>I’ve found the audio quality of the Earshots to be fine without being spectacular. Bass response seems rather limited, and I found the sound to be a little thin overall. Note too that, by design, Earshots allow in quite a bit of ambient noise “to keep riders and runners aware of what’s around them.” Overall, the audio quality is fine for the intended use – these headphones are meant for cyclists and runners, not for audiophiles.</p><p>One of my only gripes with the Earshots is the button on each unit that’s used to turn the headphones on and off, play and pause audio, change tracks, and answer or end calls. It does all those things just fine, but the location of the button (behind your ear, often covered with a helmet strap) makes it a little hard to access. Plus the button itself is quite firm which, in my experience at least, means compressing your ear a little uncomfortably when you press it. I also found myself missing the volume control buttons found on other headphones – there’s just the one button on the Earshots.</p><p>On a more positive note, I’ve been impressed with the brand’s efforts to limit their environmental impact. The headphones ship in a 100%-recycled cardboard box containing only the Earshots in their case, and a Micro-USB charging cable. There’s no printed manual – that’s all <a href=\"https://earshots.com/pages/lockandload\" target=\"_blank\">online</a> with handy videos – in an attempt to reduce paper and ink usage. It’s a small thing, but I’d love to see more brands following suit.</p><p>Overall, I’ve been pretty impressed with the Earshots. I look forward to spending more time with them.</p><div><p><strong>Price: </strong>NZ$169.75 / AU$159 / US$122 / €103 (free shipping in New Zealand; NZ$10 flat rate shipping internationally)</p><p><strong>More information: </strong><a href=\"https://earshots.com/\" target=\"_blank\">earshots.com</a></p></div></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"42c359bfbfd650ce34d294ac586970a55e432d066bddc9c46ed5803ea70affa3","category":"Cycling"}