{"title":"Apple Confirms iMac Pro Will Be Discontinued When Supplies Run Out, Recommends 27-Inch iMac","link":"https://www.macrumors.com/2021/03/06/apple-confirms-imac-pro-will-be-discontinued/","date":1615044830000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/06/apple-confirms-imac-pro-will-be-discontinued/\"><p>Apple on late Friday evening <a href=\"https://www.macrumors.com/2021/03/06/imac-pro-while-supplies-last/\">added a \"while supplies last\" notice</a> to its iMac Pro product page worldwide, and removed all upgrade options for the computer, leaving only the standard configuration available to order for now.</p><p><img alt=\"Buy iMac Pro While Supplies Last Feature3\" width=\"2254\" height=\"1268\" src=\"https://images.macrumors.com/t/scnvDzjoE_qZDPCGrs8bte1r3tY=/400x0/filters:quality(90)/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg?lossy\" data-src=\"https://images.macrumors.com/t/scnvDzjoE_qZDPCGrs8bte1r3tY=/400x0/filters:quality(90)/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/scnvDzjoE_qZDPCGrs8bte1r3tY=/400x0/filters:quality(90)/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg?lossy 400w,https://images.macrumors.com/t/SqTmZcUq1Vn7f4lq3A6XkcNIMMc=/800x0/filters:quality(90)/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg?lossy 800w,https://images.macrumors.com/t/vA07LHGIwDEnt2ZVGQKPMT566BE=/1600x0/filters:quality(90)/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg 1600w,https://images.macrumors.com/t/l7rsSPWF76aoXseOnchiZF3DiBM=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/scnvDzjoE_qZDPCGrs8bte1r3tY=/400x0/filters:quality(90)/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg?lossy 400w,https://images.macrumors.com/t/SqTmZcUq1Vn7f4lq3A6XkcNIMMc=/800x0/filters:quality(90)/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg?lossy 800w,https://images.macrumors.com/t/vA07LHGIwDEnt2ZVGQKPMT566BE=/1600x0/filters:quality(90)/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg 1600w,https://images.macrumors.com/t/l7rsSPWF76aoXseOnchiZF3DiBM=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/Buy-iMac-Pro-While-Supplies-Last-Feature3.jpg 2500w\"><br>We've since confirmed with Apple that when supplies run out, the iMac Pro will no longer be available whatsoever. Apple says the <a href=\"https://www.macrumors.com/2020/08/04/new-27-inch-imac-10th-gen-intel/\">latest 27-inch iMac introduced in August</a> is the preferred choice for the vast majority of pro iMac users, and said customers who need even more performance and expandability can choose the Mac Pro.</p><p>The latest 27-inch iMac features a 5K display with True Tone and a nano-texture glass option, up to a 10-core 10th-generation Intel Core i9 processor, up to 128GB of RAM, up to 8TB of storage, up to AMD Radeon Pro 5700 graphics, a 10Gb Ethernet option, a higher-resolution 1080p camera, improved speakers and microphones, and more.</p><p>While the Intel-based 27-inch iMac is Apple's recommendation right now, rumors suggest that a redesigned iMac with a next-generation Apple silicon chip will be released later this year, so many customers may want to hold off.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/03/apple-transfer-icloud-photos-google-photos/\">Apple Launches Service for Transferring iCloud Photos and Videos to Google Photos</a></h3><p>Wednesday March 3, 2021 12:04 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple this week introduced a new service that's designed to make it quick and easy for iCloud users to transfer their stored photos and videos to Google Photos. As outlined in an Apple support document, you can go to Apple's privacy website and sign in to see the \"Transfer a copy of your data\" option. If you select this and go through all the steps, Apple will transfer your iCloud photos and ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/02/rosetta-macos-11-3-strings/\">Rosetta May Be Removed From M1 Macs in Some Regions on macOS 11.3</a></h3><p>Installing the upcoming macOS 11.3 software update on an M1 Mac may result in Rosetta 2 being removed in one or more regions around the world. In the third beta of macOS 11.3 seeded to developers for testing today, MacRumors contributor Steve Moser uncovered new strings in the beta's code indicating that \"Rosetta will be removed upon installing this update.\" Another new string reads \"Rosetta ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/03/apple-magsafe-charging-port-iphone-patent/\">MagSafe Charging Port for iPhone Appears in Apple Patent</a></h3><p>Wednesday March 3, 2021 1:30 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>In a newly granted patent, Apple envisions a type of connectivity port using an iteration of its magnetic MagSafe charger to charge an iPhone, potentially paving the way for a future without Lightning. Submitted to the United States Patent and Trademark Office on Tuesday (via Patently Apple), the patent outlines a three-pinned MagSafe charger, similar to the ones found in older MacBook...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/04/ipad-macbook-oled-displays-2022-rumor/\">iPad and MacBook Models With OLED Displays Rumored to Launch in 2022</a></h3><p>Apple plans to release new iPad and MacBook models with OLED displays in 2022, according to industry sources cited by Taiwanese supply chain publication DigiTimes. The information was shared in the site's paywalled \"Before Going to Press\" section, so there are no further details yet, but the full report should be released by tomorrow. Apple has gradually increased its adoption of OLED...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/03/sketchy-rumor-ipad-mini-pro-2h-2021/\">Sketchy Rumor Claims 'iPad Mini Pro' Launching in Second Half of 2021</a></h3><p>Wednesday March 3, 2021 3:04 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple is expected to launch a sixth-generation iPad mini in the first half of 2021, possibly as soon as this March, based on long-standing rumors. However, a new rumor out of Asia that has gained traction in the last 24 hours suggests an \"iPad mini Pro\" will arrive in the second half of this year. According to a post on Korean blog Naver, whose rumor track record is unknown, the device...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/04/whats-on-your-iphone-home-screen/\">What's on Your iPhone Home Screen?</a></h3><p>Thursday March 4, 2021 10:31 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Over on our YouTube channel, MacRumors videographer Dan has a new video up where he shares his Home Screen, wallpaper, and all of his current favorite widgets. Subscribe to the MacRumors YouTube channel for more videos. Check out Dan's video to see his setup, and then comment below and show us your own Home Screens. It's always fun to see other peoples' Home Screens, and with widgets and...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/03/new-apple-pencil-allegedly-leaks/\">New Apple Pencil Allegedly Leaks With Glossy Finish and Redesigned Tip</a></h3><p>Images supposedly depicting a third-generation Apple Pencil have been shared on Twitter by the leaker known as \"Mr. White.\" The purported new Apple Pencil appears to share a very similar design to the current, second-generation Apple Pencil, which is shorter than the previous version and charges inductively on the side of an iPad. The updated Apple Pencil appears to have a glossy...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/03/apple-watch-ecg-approval-australia/\">Apple Watch ECG Feature Gets Approved in Australia</a></h3><p>Wednesday March 3, 2021 2:07 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>The Australian government has approved ECG functionality on the Apple Watch, giving Apple the all-clear to launch the feature for Apple Watch users in the country, according to a regulatory document first spotted by The 8-Bit. Earlier last month, the Apple Watch's irregular heart rhythm notification received approval in Australia, although ECG did not. Irregular heart rhythm is a feature...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/02/nasa-mars-perseverance-rover-imac-powerpc/\">NASA Mars Perseverance Rover Uses Same PowerPC Chipset Found in 1998 G3 iMac</a></h3><p>Tuesday March 2, 2021 3:21 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>NASA's Perseverance rover, which recently made history landing on the surface of Mars, is powered by the same processor used in an iMac more than 23 years old. Image Credit: NASA As reported by NewScientist (via Gizmodo), the rover includes the PowerPC 750 processor, the same chip used in the G3 iMac in 1998. The main chipset is the same; however, there are differences between the...</p></div></div></div>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"43cec9d257695b3471a7bb9c88bffa054b67c025a32cca2c93ddf95f336bdc85","category":"Apple"}