{"title":"We now have new evidence that Richard III murdered the princes in the tower","link":"https://arstechnica.com/?p=1740324","date":1612906217000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Cold case files —</h4><h2 itemprop=\"description\">New research lends credence to the account of Sir Thomas More.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/princes2-800x533.jpg\" alt=\"Vintage engraving (1876) depicting the murderers of the &quot;Princes in the Tower&quot;:  King Edward V and his younger brother Prince Richard, Duke of York. New evidence has emerged that Richard III did indeed order the murders.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/princes2.jpg\" data-height=\"799\" data-width=\"1200\">Enlarge</a> <span>/</span> Vintage engraving (1876) depicting the murderers of the \"Princes in the Tower\": King Edward V and his younger brother Prince Richard, Duke of York. New evidence has emerged that Richard III did indeed order the murders.</p></figcaption></figure><p>England's <a href=\"https://en.wikipedia.org/wiki/Richard_III_of_England\">King Richard III</a> is at the center of one of the most famous assassination legends in history, immortalized in one of William Shakespeare's <a href=\"https://en.wikipedia.org/wiki/Richard_III_(play)\">greatest tragedies</a>. It's quite the tale: a power-hungry duke seizes the throne when his brother unexpectedly dies, and he orders his young nephews (one the rightful heir) murdered in the Tower of London to cement his claim to the throne. But was he really a murderer? The debate over Richard III's presumed guilt has continued for centuries. Now, a British historian has compiled additional evidence of that guilt, described in&nbsp;<a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/1468-229X.13100\">a recent paper</a> published in the journal History.</p><p>The so-called \"<a href=\"https://en.wikipedia.org/wiki/Princes_in_the_Tower#Richard_III\">princes in the Tower</a>\" were the sons (aged 12 and 9) of King Edward IV, who died unexpectedly in April 1483. Edward's elder son and heir (now technically <a href=\"https://en.wikipedia.org/wiki/Edward_V_of_England\">King Edward V</a>) and the younger sibling (<a href=\"https://en.wikipedia.org/wiki/Richard_of_Shrewsbury,_Duke_of_York\">Richard&nbsp;of Shrewsbury</a>, Duke of York) were originally brought to the Tower of London in May by their uncle, Richard, Duke of Gloucester, ostensibly to prepare for Edward's formal coronation. But the coronation was postponed until June 25 before being postponed indefinitely. Gloucester assumed the throne instead as King Richard III, and he had&nbsp;Parliament officially declare young Edward and his brother illegitimate the following year.</p><p>Although no bodies were produced at the time, historians largely agree that the princes were likely murdered in late summer of 1483. Two small human skeletons were found at the Tower of London in 1674, but there is no conclusive evidence that these were the princes, despite a perfunctory examination in 1933 concluding that the remains were those of children roughly the same ages. Two more bodies that may have been the princes were found in 1789 at Saint George's Chapel, Windsor Castle. Forensic scientists have been unable to gain royal permission to conduct DNA and other forensic analysis on either set of remains in order to make a proper identification.</p><p>Rumors began circulating almost immediately that the princes had been murdered by order of Richard III. Even today, Richard remains the most likely culprit, based on various accounts written in the ensuing years, including the only contemporary account (penned by an Italian friar named <a href=\"https://en.wikipedia.org/wiki/Dominic_Mancini\">Dominic Mancini</a>); the&nbsp;<em><a href=\"https://en.wikipedia.org/wiki/Croyland_Chronicle\">Croyland Chronicle</a>;</em>&nbsp;an account by French politician&nbsp;<a href=\"https://en.wikipedia.org/wiki/Philippe_de_Commines\">Philippe de Commines</a>; <a href=\"https://en.wikipedia.org/wiki/Thomas_More\">Thomas More</a>'s <em>The History of King Richard III</em>; and <a href=\"https://en.wikipedia.org/wiki/Holinshed%27s_Chronicles\"><em>Holinshed's Chronicles</em></a>—the latter written in the late 16th century, and one of Shakespeare's primary sources for his play.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/princes1.jpg\" data-height=\"801\" data-width=\"1200\" alt=\"The princes in the tower as envisioned by Paul Delaroche, circa 1831, in the painting <em>King Edward V and the Duke of York (Richard) in the Tower of London</em>.\"><img alt=\"The princes in the tower as envisioned by Paul Delaroche, circa 1831, in the painting <em>King Edward V and the Duke of York (Richard) in the Tower of London</em>.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/princes1-640x427.jpg\" width=\"640\" height=\"427\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/princes1.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/princes1.jpg\" data-height=\"801\" data-width=\"1200\">Enlarge</a> <span>/</span> The princes in the tower as envisioned by Paul Delaroche, circa 1831, in the painting <em>King Edward V and the Duke of York (Richard) in the Tower of London</em>.</p><p>The Print Collector/Print Collector/Getty Images</p></figcaption></figure><p>However, Richard III was never formally accused of the murders. His successor, <a href=\"https://en.wikipedia.org/wiki/Henry_VII_of_England\">Henry VII</a> (House of Tudor), made only general accusations of \"unnatural, mischievous and great perjuries, treasons, homicides, and murders, in shedding of infant's blood, with many other wrongs, odious offenses and abominations against God and man.\" Other possible culprits include <a href=\"https://en.wikipedia.org/wiki/Henry_Stafford,_2nd_Duke_of_Buckingham\">Henry Stafford, 2nd Duke of Buckingham</a> and Richard III's right-hand man, or Henry VII, supposedly to strengthen his claim to the throne. The case for Richard III's innocence was even memorably popularized in mystery writer Josephine Tey's classic 1951 novel&nbsp;<a href=\"https://en.wikipedia.org/wiki/The_Daughter_of_Time\"><em>The Daughter of Time</em></a>, which claims that the rumors were the result of highly effective Tudor propaganda. (It's a great read, but it hardly qualifies as a scholarly argument.)</p><p>But it's Thomas More's account that provides this latest evidence in favor of Richard III having ordered the princes killed, according to Tim Thornton, a historian at the&nbsp;University of Huddersfield. More specifically, the culprit is James Tyrell, an English knight who fought for the House of York and confessed under torture to the murders on the king's orders. Before he was executed, Tyrell also implicated two accomplices. More alleges that these two men were Miles Forest and John Dighton. Many of Richard III's defenders have dismissed More's account as mere Tudor propaganda, given More's clear Tudor loyalties; his account was also written many years after the disappearance of the princes.</p><p>Thornton begs to differ with that assessment, arguing in his new paper that More based his account on information gleaned from sources who, in More's words, \"much knew and had little cause to lye.\" Through painstaking research, Thornton has identified two of More's fellow courtiers between 1513 and 1519 as the sons of Forest—Edward and Miles—and he believes they are the sources that More refers to in his history. There is even mention of one of them in More's correspondence to <a href=\"https://en.wikipedia.org/wiki/Thomas_Wolsey\">Cardinal Thomas Wolsey</a>. This strengthens the credibility of More's account and the case for Richard III's guilt.</p><p>Ars sat down with Thornton to learn more.</p><p><strong>Ars Technica: What drew you to investigate this particular historical mystery? &nbsp;</strong></p><p><strong>Tim Thornton</strong>:&nbsp;&nbsp;I recognized that most people try to address this problem by trying to understand the disappearance of the princes by working back from its ending. For them, in a way, the story ends in July 1483. For me, that was when the story begins. So I decided to work my way forward, trying to look with fresh eyes at the accounts that began to be built up of the events of 1483. In More's case, I was trying to view his account as a great work of literature and of political thought and also as an attempt to create a narrative and a way of understanding a period of political crisis.</p><p>I think we haven't really fully understood the degree to which people in the early 16th century lacked a coherent narrative of that period in which, as so often [happens] in the aftermath of civil conflicts and civil war, generations were coming to terms with that legacy. It does often take many years to build a narrative. When I cast a fresh eye over More's account, I discovered that he was living and working with two men who were identifiable as the sons of a man he then identified as the chief murderer of the princes.&nbsp;So we're actually dealing with direct connections between the people that he lived with and the people who were at the very heart of the coup, and of the killing, that took place in 1483.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/princes4.jpg\" data-height=\"793\" data-width=\"1200\" alt=\"Late 16th century portrait of Richard III.\"><img alt=\"Late 16th century portrait of Richard III.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/princes4-640x423.jpg\" width=\"640\" height=\"423\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/princes4.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/princes4.jpg\" data-height=\"793\" data-width=\"1200\">Enlarge</a> <span>/</span> Late 16th century portrait of Richard III.</p></figcaption></figure><p><strong>Ars Technica: Several historians cite the \"Tudor propaganda machine\" as evidence&nbsp;for&nbsp;Richard III's&nbsp;possible evidence. What's your response to that aspect of the argument?</strong></p><p><strong>Tim Thornton</strong>: This is one of the fascinating areas of recent exploration in our understanding of Henry VII's reign in particular. I think there's been a rather glib solution that Henry came to the throne and launched a full-blown detailed propaganda effort to destroy Richard's reputation, and to do so on the basis of a minutely detailed account of what had happened in the period up to August 1485, when the&nbsp;<a title=\"Battle of Bosworth Field\" href=\"https://en.wikipedia.org/wiki/Battle_of_Bosworth_Field\">Battle of Bosworth Field</a>&nbsp;took place. That's the complete opposite of what took place.&nbsp;Henry avoided, quite deliberately, any presentation of the specifics of what occurred before he seized the throne. One of the reasons for that is because he inherited a political nation that had lived through extraordinary political turmoil, as king had succeeded king, regime had succeeded regime.</p><p>That was the wise thing to do in Henry's position. To attack in detail the previous regime would have meant attacking many of the people who were now increasingly prominent in his own regime. What he did was attack in a very abstract form the evils of the past, which were identified with a rather abstract personification of Richard. That was a very cunning approach.</p><p>But there was no detailed attempt to explain what had happened to the princes. There was a rather echoing silence that sounded across the land as to what might have&nbsp;happened to them.&nbsp;Richard was associated with the killing, but the detailed account that might have come forth about what had happened to them was singularly lacking.&nbsp;After 1485 in particular, I think in the popular mind, there is no question that people believed Richard was responsible in a rather general way for the death of the princes.</p><p><strong>Ars Technica: One of the things that makes More's account so compelling is that he includes many&nbsp;specific&nbsp;details, fashioning a convincing narrative out of his&nbsp;research. But he <em>was</em> a Tudor loyalist, and that bias is always an issue when assessing the various historical accounts.&nbsp;</strong></p><p><strong>Tim Thornton</strong>: There's no question. This is a man who was a protegé of [Archbishop of Canterbury] <a href=\"https://en.wikipedia.org/wiki/John_Morton_(cardinal)\">John Morton</a>. He is in awe of John Morton, when you read his descriptions of Morton in <em>Utopia</em>. Therefore you have to recognize the degree to which he's influenced by some of the architects of what we would now call the Tudor regime.</p><p>I guess I would just set against that the fact that there is evidence for the responsibility of [Tyrell accomplices] Miles Forest and John Dighton for the death of the princes. There is ample corroborating evidence to suggest that, for example, Miles Forest was responsible for their custody in the tower. There is ample corroborating evidence to suggest that Miles Forest came from <a href=\"https://en.wikipedia.org/wiki/Barnard_Castle\">Barnard Castle</a>, off in County Durham, where he was previously a servant of Richard, as Duke of Gloucester, prior to his seizure of the throne. It would be very hard to imagine that this was a piece of imagination that was constructed in order to blacken the reputation of Richard from a Tudor loyalist's perspective.</p><p><strong>Ars Technica: Can you elaborate a little on the evidence for your identification of the sons of Miles Forest as the More's sources with \"little reason to lye\"?</strong></p><p><strong>Tim Thornton</strong>: We know that there was a real Miles Forest who was potentially the chief murderer. We also know that he was dead by September 1484 and that he left a widow, Joan, and a son, Edward. It was then a matter of identifying Edward Forest, who appears as a servant of Henry VIII, and linking him as being plausibly the Edward who is that son of Miles Forest. Edward had a brother who was called Miles. Both of them have that strong connection back to <a href=\"https://en.wikipedia.org/wiki/Barnard_Castle\">Barnard Castle</a> and to other lordships in the North of England, principally Midland, which is so known for its links to Richard himself.</p><p>What struck me was the degree to which there were connections between those two men and More himself. Those connections are quite remarkable in the way that they coincide with the period when More was conceiving the ideas in the <em>History of Richard III</em>. There was a [July 5, 1519] letter More wrote to Wolsey that was my eureka moment. I looked at the letter and saw More's signature at the bottom and a reference to Miles Forest as the messenger between that embassy and the court. So More would have been talking to Miles Forest, and we now can be pretty confident that Miles Forest is the son of the man who was guarding the princes in the tower—and that Miles Forest is the man More says is the source for this story.</p><p><strong>Ars Technica: Your research helps solidify the accepted narrative over the years, that the princes were murdered by the order of&nbsp;Richard III. So where do you go from here?</strong></p><p><strong>Tim Thornton</strong>: I've only explored some of the evidence for the construction of these narratives in this paper. There is further to go. When you start to think about the way these narratives were created, the survivors of 1483, and the way that they are present in subsequent decades—the opportunities for the historian are really very exciting. That's the world that I'm exploring now.</p><p>DOI: History, 2021. <a href=\"http://dx.doi.org/10.1111/1468-229X.13100\">10.1111/1468-229X.13100</a> &nbsp;(<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div></div>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"447d57ea20e52b264b5412e1ef1cbc4cca1b308eafea056a736c3d4ec518deb4","category":"Tech"}