{"title":"Wahoo Systm training app: so much choice for indoor riding","link":"https://cyclingtips.com/2021/09/wahoo-systm-training-app-so-much-choice-for-indoor-riding/","date":1632841473000,"content":"<div><div><p>A little over two years ago, Wahoo acquired <a target=\"_blank\" href=\"https://cyclingtips.com/2019/07/wahoo-acquires-the-sufferfest-training-platform/\">The Sufferfest training platform</a>. In that pre-pandemic time, the indoor training market was already growing rapidly, but no one could have foreseen the indoor and online training lockdown boom.   </p><p>Back in 2019, Wahoo was tight-lipped about plans for The Sufferfest, stating, “there are no planned changes in The Sufferfest business offering or structure as a result of this acquisition.” Now, with another Northern Hemisphere winter looming and the return to indoor training for many, Wahoo has unveiled its new endurance training app, Systm. Wahoo says Systm is the new home for The Sufferfest but will also provide a much more comprehensive training platform with plans, workouts, video, knowledge, and even a podcast. </p><p>Wahoo’s goal is to create the world’s most comprehensive training app for endurance athletes to answer the age-old question, “what do I do today?” Wahoo says Systm incorporates sports science, objective and mood-based workout experiences, and personalised indoor and outdoor training plans to achieve this goal.</p><p>Those are the goals, the grand plan, so to speak. What Wahoo has launched today is not quite there yet, though. It’s more like the foundation upon which Systm will grow. Some of the features will roll out soon, and others seem further away. That said, Systm already provides an impressive list of features and includes everything The Sufferfest fans loved about that platform. </p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Systm-Library-1340x754.jpg\"><figcaption>Systm has a huge library of content to help make indoor riding a little more enjoyable.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Systm-Calendar-1340x754.jpg\"><figcaption>The calendar gives an overview of the training plan</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Systm-Home-1340x754.jpg\"><figcaption>The Systm home screen shows what is on the plan for today and tomorrow.</figcaption></figure></li></ul></div></figure><p>At the heart of Systm is a training plan builder with tailored and customisable plans featuring workouts designed by the Wahoo Sports Science Division, led by Neal Henderson, and cross-training options. Systm utilises the four-dimensional power (4DP) athlete profiling, as seen previously in The Sufferfest, to tailor workouts and plans to each athlete’s unique power profile. Rather than extrapolating training intensities from percentages of a single metric e.g. FTP derived from a 20min test, the 4DP test provides a four-dimensional power profile. This power profile is created using data from the 4DP test which features a series of max efforts to determine an athletes neuromuscular power (sprint ability), anaerobic capacity (short high-intensity efforts), maximal aerobic power (think sustained Vo2), and good old FTP.</p><p>Systm uses the 4DP test results to determine an athlete’s rider type. An athlete might be considered a sprinter if they have a high neuromuscular power relative to their sustained power, as our own editor in chief, Caley Fretz, found out when he tried <a target=\"_blank\" href=\"https://cyclingtips.com/2018/03/full-frontal-how-the-sufferfests-4d-power-profile-can-make-you-faster/\">The Sufferfest’s Full Frontal test</a> a few years back. This power-profile-style testing is now widely accepted to provide better athlete profiling for more individual specific training intensities and targets than a standard FTP test which looks solely at sustained power ability. </p><figure><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Systm-4DP-Athlete-Profile-1340x754.jpg\"><figcaption>Complete your testing and Systm will show your 4DP profile, rider type, and strengths and weaknesses.</figcaption></figure></li></ul></figure><p>Once testing is completed and a plan is selected, this is when Wahoo believes Systm can make training more enjoyable, motivating and immersive. Alongside all the pro race footage, soundtracks, and workouts from The Sufferfest, Systm also includes a host of new content libraries across a number of channels. The “Inspiration” channel includes more than 50 cycling films for longer endurance or recovery rides. Included in that library are The Outskirts films, Thereabouts one and two, and the iconic film A Sunday in Hell, to name but a few. </p><p>Wahoo partnered with the Col Collectives Mike Cotty for a series of “On Location” guided tours of some well-known cycling routes. </p><p>For those after some racing action, Wahoo has included “Pro Rides” race simulations. Using first-person camera footage from pro races scaled to each individual’s power profile, the Pro Rides feature puts the rider into a pro race for an achievable workout. Currently, riders can jump into stages of the Giro d’Italia Donne, Tour of Norway, and UAE Tour, as well as the classic Strade Bianche.  </p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Systm-Pro-Rides-1340x754.jpg\"><figcaption>Who doesn’t love a bike race, Systm lets you act out a bike race as a structured workout, just like The Sufferest did previously.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Systm-On-Location-1340x754.jpg\"><figcaption>Systm has added features such as the “On Location” guided tours, proceed with caution if you havn’t had a holiday in a while.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Systm-A-week-with-1340x754.jpg\"><figcaption>The week with feature offers six episodes to use over a week following Wahoo athletes.</figcaption></figure></li></ul></div></figure><p>Systm also features “A Week With” feature, which offers a behind the scenes look at a Wahoo athlete’s training and life off the bike. The app currently includes six episodes with Ian Boswell and Neal Henderson. </p><p>If that wasn’t enough, Systm also includes GCN’s instructor-led workouts, NoVid (video free) workouts options, and strength, yoga, and mental training libraries for cross-training options. In yet another option to get your cycling fix, Wahoo has included a link to the popular Sufferfest forum within the app and has more features planned for the future.</p><p>I don’t know about you but I am starting to feel overwhelmed with content. Bring back the brick wall and a fan, please.</p><p>Wahoo also plans to offer Wahoo Coaching packages to provide more customised plans with coach contact for a more personal approach.</p><p>Systm will sync with Wahoo devices through the Elemnt app and includes a calendar for an overview of past and future workouts. For those who enjoy a challenge, Wahoo has achievements badges to tick off as your training progresses, although currently, Systm doesn’t tell us exactly what each badge represents or how to achieve it. Wahoo says this will come as it builds on this foundation over the coming months and years.</p><figure><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Systm-Progress-1340x754.jpg\"><figcaption>Tick off your achievements and badges as your progress your training.</figcaption></figure></li></ul></figure><p>Wahoo has designed Systm to complement its hardware offerings, and the new app will sit in the centre of the Wahoo ecosystem. However, Systm is compatible with other manufacturers’ trainers, power meters, heart rate straps, etc. </p><p>In good news for Android Sufferfest fans, the new app finally means Android compatibility for the first time, in addition to the usual IOS, and Mac/PC options. </p><p>Systm retains the same pricing options as The Sufferfest at US$ 14.99/month and US$ 129/year. All current Sufferfest subscribers will automatically transfer to Systm, while new users have the option of a 14-day free trial.</p><p>I have had early access to the beta app for about a week now. Unfortunately, that time coincided with World’s week, so I haven’t got to test out any of the riding features. That said, the app has an impressive depth of content with plenty of interesting content and training options. </p><p>I did set up a training plan, which was a straightforward process. Just choose a discipline, what I want from the plan, type of plan, training volume, and progression rate. I then had the option to include strength training, yoga and mental training and select my start date. The training plan then populates the Systm calendar with workouts, and off I go. Well, not quite, as I have yet to get any actual training done. Check back for more thoughts.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Systm-Plan-builder-1340x754.jpg\"><figcaption>Setting up a training plan in Systm was very straightforward.</figcaption></figure><p>I did find it concerning that I couldn’t select an event date, which as a coach, seems like one of the essential data points for creating any plan. Wahoo says date entry will come in future as Systm grows. The lack of any AI or machine learning to adapt training plans à la Trainer Road’s Adaptive Training or Xert’s training platform seems like a missing feature for a new training app in 2021, but Wahoo has not ruled out adding this in the future. </p><p>While there are currently no training analytics or tracking features in Systm, Wahoo has said it plans to add basic analytics in the “near future”. While I am not personally a fan of automated training plans, I like self-coaching or working with a coach, such plans can be powerful guides and motivators for many people. Having seen many offerings down through the years, few were as comprehensive at launch as Systm is. Given that Wahoo claims today’s app is just the foundation for much more to come, Systm is at least on the road to achieving that “world’s most complete training app” goal. Will its mass of channels, libraries and features be enough to dethrone Zwift as the indoor training leader? possibly not, but what Systm might do is challenge that indoor and outdoor offering from the likes of TrainerRoad and Xert.</p></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"44d4d4062a3460315cc149aceb46996f52755107bbf740460bdf56b0a2fc0af5","category":"Cycling"}