{"title":"Woods wins stage 4 of the Tour de Romandie, Thomas crashes in the finale","link":"https://cyclingtips.com/2021/05/tour-de-romandie-woods-wins-stage-4-and-takes-the-lead-as-thomas-crashes-in-the-finale/","date":1619896818000,"content":"<div><p></p><h4>Mike Woods wins stage 4 of the Tour de Romandie.</h4><p></p><div><p>Mike Woods (Israel Start-Up Nation) powered to victory and the overall lead on stage 4 of the Tour de Romandie, which came to a dramatic close after officials neutralized the descent off the penultimate climb, and then Geraint Thomas (Ineos Grenadiers) crashed on the finishing straight.</p><p>On yet another rain-soaked day in Switzerland, the early break was still up the road when officials called for the neutralization of the race as riders descended from the first-category Suen climb in rain and fog. Racing then resumed in earnest, and the battle for the stage came down to the first-category final climb to the Thyon 2000 ski resort, 20.7 km in length at an average gradient of 7.6%.</p><p>Attacks flew out of the much-reduced pack as it closed in on the break on the slopes of the ascent. Woods followed moves and then soloed clear of the rest of the GC hopefuls, and then he caught and passed the last survivors of the break with a little more than 3 km to go. Thomas bridged up to him with a little more than 2 km to go, and then the pair pushed on together towards the finish. Woods and Thomas rode side-by-side into the last 200 meters, where Woods started to wind up to speed, but when Thomas got out of the saddle to put in his own surge, his hand slipped off of his handlebar. The former Tour de France winner lost his balance and hit the deck as Woods pulled away.</p><p>Woods nabbed the win and took over the GC lead from overnight leader Marc Soler (Movistar) while Ben O’Connor (AG2R Citroën) arrived to nab runner-up honors 17 seconds behind Woods. Thomas remounted in time to take third on the day, 21 seconds down. Soler finished ninth on the day, dropping to fourth overall.</p><p>Woods takes an 11-second GC advantage over Thomas into Sunday’s stage 5, an individual time trial.</p><div><div><p>Tour de Romandie (2.UWT) <span>Sion → Thyon 2000</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/fb/michael-woods-2021.jpeg\"></p></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"46127aed3640ed497889ccc9f939ebdaa8b20266833eb8e6f449ea3ab47057c8","category":"Cycling"}