{"title":"Eritrea’s first ever Road Worlds medal","link":"https://cyclingtips.com/2021/09/up-and-comer-biniam-girmay-takes-eritreas-first-ever-road-worlds-medal/","date":1632515993000,"content":"<div><div><p>Biniam Girmay (Eritrea) delivered a historic result on Friday at Flanders Worlds. Crossing the finish line two seconds behind winner Filippo Baroncini (Italy) in the under-23 men’s road race, the 21-year-old became the first Eritrean and the first Black African to secure a medal at the UCI Road World Championships.</p><p>“I’m very proud on what I just achieved, this silver medal means a lot to Eritrea, and also for Africa,” Girmay said afterwards. “I’m convinced that the future of my country is bright, because we have a great potential. We’re working hard for several years already to develop it and with some additional experience more results like this will follow.”</p><p>At the end of a 160.9 km race from Antwerp to Leuven, Girmay won the sprint for second ahead of Olav Kooij (Netherlands) in a reduced bunch to take runner-up honors.</p><p>“It was a nervous race from the start. I was attentive and tried to stay out of trouble as good as possible,” Girmay said. “I could rely on the support of my teammates and I want to thank them from the bottom of my heart. We realized that several nations took control of the peloton to organize a bunch sprint, so we chose to patiently wait for the final. We were confident for a sprint, because I performed well in this exercise the last couple of weeks. There was a tough positioning battle in the final kilometer, but I felt strong enough to keep calm and hide, taking the risk to be blocked.”</p><p>Obviously, that strategy worked out, and Girmay has since added a big achievement to his growing palmares.</p><figure></figure><p>Girmay has been steadily rising through the ranks as a prospect since making a big splash in 2018, when he won the African Continental junior titles in the road race and time trial and delivered a collection of other strong results in junior races, perhaps most notably besting Remco Evenepoel to win the opening stage of the Aube-Thimister-Stavelot stage race. He won stages at the Tropicale Amissa Bongo and the Tour of Rwanda the following year, and then joined second-division squad Nippo Delko One Provence for 2020, taking more wins at the Tropicale Amissa Bongo, riding to an impressive second at the Trofeo Laigueglia behind Giulio Ciccone, making his first WorldTour race start, and picking up other strong results.</p><p>After starting this season with the same team, he joined the WorldTour-level Intermarché-Wanty-Gobert Matériaux squad in August, and at the start of September, he took a one-day win ahead of some big names at the Classic Grand Besançon Doubs.</p><p>In short, Girmay’s U23 silver medal is just the latest in a string of consistently impressive performances over the past few years. It’s also a major result for Eritrean cycling, which has been on the rise in recent years. Daniel Teklehaimanot became the first Eritrean cyclist to race at the Olympics in 2012, and he and Merhawi Kudus were Eritrea’s first Tour de France starters in 2015, when Teklehaimanot became the first African to wear the polka dot jersey. In 2019, Kudus took Eritrea’s first GC podium in a WorldTour race at the Tour of Turkey.</p><p>Now, Eritrean fans can celebrate a rising star in Girmay, whose skillset could make him a rider to watch in one-day races, and who has already caught on with a Belgian WorldTour team.</p><p>“I’m looking towards the future with hope, it would be a dream to go to Rwanda in 2025 with the ambition of converting this silver medal in a rainbow jersey,” he said. “It is also an honor for me to achieve this result here, in Belgium, the home base of my team Intermarché-Wanty-Gobert. This structure offered me the opportunity to show myself on the highest level in international cycling. The team encouraged me and supported me from the first day. That’s why I also want to thank them.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"465d5bd2dd352c61cb2437bc81b5f57f317b9b824aaf4ee25d893ac569bb268f","category":"Cycling"}