{"title":"American Classic is reborn as a road and gravel tire brand focused on value","link":"https://cyclingtips.com/2021/09/american-classic-is-reborn-as-a-road-and-gravel-tire-brand-focused-on-value/","date":1631707204000,"content":"<div><div><p>Almost 40 years after the brand was originally founded — and almost <a href=\"https://www.bicycleretailer.com/industry-news/2018/01/05/american-classic-closes-factory-puts-ip-assets-sale\" target=\"_blank\">four years after it shut down</a> — American Classic has emerged from the ashes as a direct-to-consumer brand. Whereas the original AC focused on wheels, this new one is concentrating on tires, with eight models aimed at the road, urban, and gravel markets. </p><p>Interestingly enough, American Classic’s claim to fame this time around might just be value. Retail price for all of the tires is just US$30-35 each, and there’s even an extremely aggressive “Road Hazard Replacement Policy” where a customer can get a one-time 50% discount on a new tire if they ruin a tire while riding — clearly an effort to keep people on American Classic tires over the long haul.</p><p>At least for now, American Classic’s new tires will only be offered to US buyers either directly from the <a href=\"https://www.amclassic.com/collections/tires\" target=\"_blank\">brand’s website</a> or via a <a href=\"https://www.amazon.com/s?me=A2F5KGSJTTMDQ3&amp;marketplaceID=ATVPDKIKX0DER\" target=\"_blank\">dedicated Amazon store</a>. </p><h2>Model breakdown</h2><p>Timekeeper is the brand’s “premier road racing tire”, with a single synthetic rubber compound, a <a href=\"https://cyclingtips.com/2019/01/an-endless-faq-to-tubeless-bicycle-tyres/\">tubeless ready</a> 120 TPI nylon, and a lightweight puncture belt just under the tread cap to minimize any hit to rolling resistance. It’s offered in just 700×25 mm and 700×28 mm sizes, but in tube-type and tubeless ready fitments, as well as black, tan, and brown sidewalls depending on version. Weights range from 210-300 grams.</p><p>Torchbearer is more of an all-road model, featuring the same rubber compound and casing constructions as the Timekeeper, but with a slightly more pronounced file tread on the shoulders, bead-to-bead puncture protection instead of just something under the tread cap, and larger available sizes: 700×25 mm, 700×28 mm, and 700×32 mm, all in blackwall only. Claimed weights range from 270-415 g.</p><p>Rounding out American Classic’s selection of tarmac-specific tires is the more urban-focused Lamplighter. Offered in bigger 700×40 mm, 700×50 mm, and 650×47 mm sizes with a 60 TPI tube-type nylon casing, Lamplighter puts a heavier emphasis on durability with a bead-to-bead puncture-resistant belt and an additional 3 mm of rubber under the tread cap. Claimed weights range from 580-670 g.</p><p>Kimberlite is the first mixed-surface model in the new American Classic tire range. Aimed at tamer conditions like poor pavement or hard-packed dirt roads — or riders that just prioritize rolling speed over outright grip — Kimberlite features a center file pattern and progressively more knob as you move out toward the shoulder. Puncture protection consists of a “specially engineered microfiber composite tread compound” and an additional belt under the tread cap. Available sizes include 700×40 mm, 700×50 mm, and 650×47 mm, all exclusively in blackwall with tubeless-ready 120 TPI nylon casings. Claimed weights range from 565-660 g.</p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/American-Classic-Timekeeper-1-1340x754.jpg\"><figcaption>Looking for a traditional high-performance road tire at a super reasonable price? The TimeKeeper might be for you.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/American-Classic-Torchbearer-1-1340x754.jpg\"><figcaption>The Torchbearer looks like a good option for bad tarmac.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/American-Classic-Lamplighter-1-1340x754.jpg\"><figcaption>Lamplighter is designed for urban and commuter use with a thick tread cap and more heavily reinforced casing.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/American-Classic-Kimberlite-1-1340x754.jpg\"><figcaption>The American Classic Kimberlite likely isn’t as capable as those shoulder knobs would suggest. They’re too far down the casing to really be useful in most situations.</figcaption></figure></li></ul></div></figure><p>Aggregate is more of a true mixed-conditions tread with its array of small, low-profile hexagonal knobs, and featuring the same tread compound, puncture protection, available sizes, and casing construction as the Kimberlite (though with an additional tan sidewall option). Claimed weights range from 565-680 g.</p><p>Moving further off the beaten path is the Udden with a “micro chevron” center tread, dense array of mini-knobs in the transition region, and relatively stout-looking blocks further down the casing. Sizes, color options, and casing construction are the same as the Aggregate, with claimed weights from 565-680 g.</p><p>Wentworth goes knobbier still, with bigger tread blocks, more open spacing, and an even burlier-looking shoulder design. According to American Classic, it’s “suited for long days of aimless exploration and lining up on rainy race days where anything could be around the next corner.” Sizes, color options, and casing constructions are the same as the Aggregate and Udden, with claimed weights from 550-740 g.</p><p>Capping things off is the Krumbein, aimed at loose gravel and singletrack with its stout mountain bike-like shoulder knobs and more pronounced center and transition pattern. Center knobs are still ramped to help decrease rolling resistance, though. Sizes, color options, and casing construction are the same as the Aggregate, Udden, and Wentworth, and claimed weights range from 585-735 g.</p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/American-Classic-Aggregate-1-1340x754.jpg\"><figcaption>Differences between the similar-looking Schwalbe G-One and this American Classic Aggregate are admittedly more pronounced at this angle where the shape and height of the center knobs are more obvious.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/American-Classic-Udden-1-1340x754.jpg\"><figcaption>Yes, it kind of looks a lot like a Donnelly MSO, but seeing as how that’s one of my favorite gravel tires for mixed conditions (aside from mud), American Classic was smart to emulate that for the Udden design.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/American-Classic-Wentworth-1-1340x754.jpg\"><figcaption>The Wentworth has been excellent so far for typical Boulder gravel conditions: dry, hardpacked, fast, and loose.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/American-Classic-Krumbein-1-1340x754.jpg\"><figcaption>The Krumbein looks very fun – in the right conditions.</figcaption></figure></li></ul></div></figure><h2>Déjà vu?</h2><p>While long-time fans of the American Classic brand will undoubtedly be excited to see the company is back in business, it’s also hard not to notice how familiar many of these tread patterns are, particularly some of the gravel models. </p><p>At least to my eyes, that Udden looks an awful lot like a <a href=\"https://www.donnellycycling.com/collections/adventure/products/xplor-mso-folding-120-tpi?variant=724109033490\" target=\"_blank\">Donnelly MSO</a>. The Aggregate is a dead ringer for the <a href=\"https://www.schwalbetires.com/bike_tires/g-one-allround\" target=\"_blank\">Schwalbe G-One Allround</a>. The Kimberlite? Definitely an air of <a href=\"https://www.wtb.com/products/byway\" target=\"_blank\">WTB Byway</a> there. And the Krombein feels like a <a href=\"https://www.wtb.com/products/resolute\" target=\"_blank\">WTB Resolute</a> derivative. Heck, even the decorative patterning on the Timekeeper is reminiscent of how Continental dresses up its <a href=\"https://cyclingtips.com/2018/11/continental-goes-tubeless-with-new-grand-prix-5000-road-tire/\" target=\"_blank\">GP5000</a>. </p><p>Are these tires exact copies? Well no. Looking at the Aggregate, for example, American Classic points out that it has polygonal knobs as opposed to the Schwalbe G-One’s round ones, which supposedly improve braking performance. The center knobs also have a larger diameter and shorter height that American Classic says increases stability and reduces rolling resistance, and a more open spacing on the shoulder knobs produces “better bite and debris clearing.” </p><p>Even casual observers will say they’re still awfully close, but in fairness to American Classic, if you’re going to mimic the design of other tires, the company has at least cherry-picked a bunch of good ones to emulate.</p><p>I’ve been spending time over the last few weeks on the 700×40 mm Wentworth, for example, and it’s honestly been pretty impressive. The casing isn’t as supple as I usually prefer, but those thicker sidewalls will also likely hold up better to abrasion and cuts, which, for some riders, will be more important. Grip has also been good on my notoriously tricky loose-over-hardpack local conditions, and at least so far, the tread is wearing well.</p><p>Of course, American Classic’s extremely aggressive pricing structure can’t be ignored here. When viewed strictly through a performance lens, these tires don’t stand out as compared to top offerings from Schwalbe, Continental, WTB, Maxxis, and others. However, the difference in price is nothing short of vast, especially in terms of percentages. I can’t find anything else on the market that comes close to offering this sort of performance at that price point, and certainly not without such an intriguing replacement policy. In that context, American Classic might really be on to something here.</p><h2>Wheels in development</h2><p>As interesting as American Classic’s return is, there are two conspicuous absences. American Classic had long been primarily a wheel brand, not a tire one, and there’s little evidence of influence from the brand’s original founder, Bill Shook. A quick inquiry to American Classic’s PR agency provides some information on both of those, though.</p><p>“Bill is being leaned on as an outside consultant for design and engineering,” said Logan VonBokel of Hot Route Media. “Bill had little to do with the engineering of the tires, outside of test riding. Given his background and expertise in outside-the-box engineering, the team at American Classic is lucky to have him on the team for product engineering and development as the brand grows.”</p><p>As for the other hint, visitors to the American Classic website might notice a little teaser. Sitting there in plain sight under the Product tab is a section on tires, but there’s also a placeholder for wheels. If you’ve been bummed about the loss of American Classic wheels from the marketplace, it seems you won’t have to wait too long for Shook’s innovative ideas to return — and if they have anything remotely similar to the value-laden pricing of these tires, that’ll definitely be something to watch.</p><p>More information can be found at <a href=\"http://www.amclassic.com/\" target=\"_blank\">www.amclassic.com</a>.</p></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"473bdc380b1363add1422f67771123a8cf1cc3fde67383f97f2a954198c9be75","category":"Cycling"}