{"title":"Mark Cavendish’s Ghent Six ends on a stretcher","link":"https://cyclingtips.com/2021/11/mark-cavendishs-ghent-six-ends-on-a-stretcher/","date":1637521784000,"content":"<div><div><p>Mark Cavendish left the ’t Kuipke track on a stretcher after crashing hard early in the final race of the Ghent Six Day event. </p><p>The appearance of water on the track is thought to be the culprit, bringing down a few key riders. Mercifully, everyone got to their feet, including Cavendish who waved to the crowd before being settled on a stretcher as a precautionary measure.</p><p>The stalwart Six Day racer was sitting in fourth place overall alongside his partner Iljo Keisse before hitting the deck with leader Lasse Norman Hansen (paired up with his Olympic and World Championship-winning Madison partner Michael Mørkøv). Racing was neutralised while repairs were made to the track and medical assessments made. Hansen was cleared to continue but Keisse had to ride on without his Manx teammate.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/GettyImages-1353693322-1340x893.jpg\"><figcaption>Mark Cavendish and his partner Iljo Keisse in action during the Madison on day one of the Ghent Six.</figcaption></figure><p>“Stupid that it has to happen like this,” Jasper De Buyst told Sporza. The Belgian and his partner Roger Kluge (both vital components in Caleb Ewan’s sprint train at Lotto Soudal) were sitting third overall and narrowly missed the crash. “I had noticed the lap before that there was some water, but then I ran over it at a slower speed. The next lap it went completely wrong.” </p><p>A very stiff Hansen returned to the track with Mørkøv to race their beloved Madison, the last event of the 80th Lotto Ghent Six Day, but it was a forlorn finale.</p><p>In the end, it was veteran Kenny de Ketele and his partner Robbe Ghys who emerged victorious after battling with De Buyst and Kluge. It’s a slightly hollow victory for the Belgian track star who will retire at the end of this Six Day season.</p><p>“Things had been going well for us all afternoon,” conceded De Ketele. “We won everything and I also felt good in the team race. The finale was approaching, but it was unfortunate with the water on the track. We didn’t stand a chance. We flew in all directions. That was really anticlimactic.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/GettyImages-1354718153-1340x893.jpg\"><figcaption>Robbe Ghys and Kenny de Ketele win Ghent Six on a crash-marred final day.</figcaption></figure><p>This was not the Cav news we were expecting to cover this weekend. Saturday opened with the suggestion/hope that he and Deceuninck team boss Patrick Lefevere might finally come to an agreement over his 2022 contract while both were in Ghent. But Sunday closes with bitter disappointment, albeit of the precautionary variety.</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4764b8345641ae06359ec5cf065e5d4f7f59dead358f6983ad0f376053c0e9f0","category":"Cycling"}