{"title":"Preview: What’s going to happen (we think) at the Ceratizit Challenge by La Vuelta","link":"https://cyclingtips.com/2021/09/preview-whats-going-to-happen-we-think-at-the-ceratizit-challenge-by-la-vuelta/","date":1630509300000,"content":"<div><div><p>The Women’s WorldTour calendar, after a sparse summer, is in full swing with another four days of racing coming up in Spain. In every edition of the Ceratizit Challenge by La Vuelta, the race organizers have upped their game. From a one day sprinters dream in 2015 to three days of action in 2020, it’s a race that has grown slowly every year.</p><p>For the first time, the Ceratizit Challenge by La Vuelta will leave the Madrid area to take place in the northwestern corner of Spain. All four stages take place in the Galicia region, and the final red jersey will be awarded in Santiago de Compostela.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/8ef73-1340x1608.jpeg\"></figure><p>For the first time, the Ceratizit Challenge by La Vuelta also favours a climber. Once the race added a second stage, a time trial, in 2018, the overall was won by Ellen van Dijk. In 2019 and 2020 the race once again went to a time trial specialist with Lisa Brennauer. In 2020 the final day came down to the bonus seconds, with Brennauer nearly losing the jersey to Elisa Longo Borghini (Trek-Segafredo) in the closing kilometres.</p><p>With the change in parcourse for the 2021 edition of the women’s Vuelta the field has changed accordingly. Plus, with the Simac Ladies Tour and the GP de Plouay back to back a week before the Ceratizit Challenge by La Vuelta, teams are spread thin. It is also the end of the year when illness and injury tend to catch up with athletes. Some riders have also chosen to race the Tour Cycliste Féminin Internationale de l’Ardeche instead, a weeklong event in France.</p><p>As the final WorldTour race before the World Championships, we can expect some wild tactics as well as some hungry riders. For the remainder of this preview, I will be referring to the race as ‘The Ceratizit Challenge’ because I want to write Ceratizit Challenge by La Vuelta a billion times as much as you want to read Ceratizit Challenge by La Vuelta a billion times.</p><h2>The Stages</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/269fa.jpeg\"></figure><h3>Stage 1: Estación de Montaña de Manzaneda – A Rua (119 km) Thursday, September 2</h3><p>The downhill start is an interesting decision and will make for a fast kick-off to the race. The only categorized climb is a cat 1, and although it’s unlikely the terrain will decide the overall, the plateau after the climb means the pace will not let up once the climbing has ended. This will be the second most significant stage of the race (after the stage 2 time trial).</p><p>Even if a breakaway goes before the base of the climb, the chance of them getting enough of a gap to stay away on the climb is slim to none. The mountain goats know they’ll need to utilize the ascent to try and gain an edge on Annemiek van Vleuten and Anna van der Breggen.</p><p>A gutsy rider could go for it on the descent to the finish, or if Van Vleuten is feeling like she doesn’t want to ride the final downhill in the peloton, and has good legs, she might try to ride away from everyone with 60 km to go. It wouldn’t be the first time.</p><p>There will be an elite selection fighting for glory if it’s not a solo artist who takes it.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/a4515.jpeg\"></figure><h3>Stage 2 ITT: Cronoescalada Estación de Montaña de Manzaneda (7.3 km) Friday, September 3</h3><p>Odds are the 7.3 km uphill time trial will determine the overall. The stage 4 uphill time trial at the Giro Donne in July saw massive gaps, with Anna van der Breggen taking a minute from her teammate Demi Vollering.</p><p>Stage 2 of the Ceratizit Challenge will see significant time gaps. Tactics will be out the window as the women let their legs do the talking. Marlen Reusser, who nearly won the Simac Ladies Tour, was climbing very well at the Ladies Tour of Norway and cannot be dismissed to deliver a result here. Brennauer as well could be interesting. Longo Borghini is another potential factor. Cecilie Uttrup Ludwig and Kasia Niewiadoma are also possible game-changers.</p><p>The two that will be battling it out for stage honours, however, will be Van der Breggen and Van Vleuten, the current time trial World Champion and recent Olympic time trial champion.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/6cd23.jpeg\"></figure><h3>Stage 3: Estación de Montaña de Manzaneda – Pereiro de Aguiar (108 km) Saturday, September 4</h3><p>Another hilly day, and potentially a day for some general classification hopefuls to find the time. The climbs are smaller than on stage 1, but there is more going on on stage 3. More opportunities to make moves and make the race hard.</p><p>Women’s racing has been particularly exciting and unpredictable lately, between the multiple days stolen by loose breakaways at the Ladies Tour of Norway and Alison Jackson’s theft of stage 1 of the Simac Ladies Tour, and also the chaos of the general classification battle at the Simac Ladies Tour on stages 4 and 5. The terrain promises some kind of action; the question is whether it will be from a breakaway with no red jersey ambition or some top riders clawing back time.</p><p>Two people who will surely be seen attacking on stage 3 are Longo Borghini and Niewiadoma. Niewiadoma almost won the fourth stage of the Simac Ladies Tour with some aggressive moves and Longo Borghini basically made the GP de Plouay her own event on Monday.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/9702c.jpeg\"></figure><h3>Stage 4: As Pontes – Santiago de Compostela (107.5 km) Sunday, September 5</h3><p>The only day for the sprinters, but there is still a significant list of sprinters in attendance. Lonneke Uneken, who won stage 3 of the Simac Ladies Tour recently, Elisa Balsamo, Lotte Kopecky, and Coryn Rivera make the list, and there are more “second-tier” sprinters as well just to make things interesting.</p><p>By this stage, the general classification battle will be over. Barring disaster (knock on wood), the first three stages will have determined who will go home with the red jersey. That doesn’t mean the race won’t still get chaotic. The Ladies Tour of Norway and Simac Ladies Tour proved that.</p><p>There is a chance that teams will not take on the responsibility to pull back a breakaway and thus let the breakaway take stage 4, but you would think they learned from recent events, especially Team DSM, who have really dropped the ball in the last few races, as evidenced by their multiple second-place finishes recently.</p><h2>Predictions</h2><p>I already made a couple of predictions in the stage breakdown. For example, the time trial will have significant time gaps. There are some potential outcomes of the race that deserve a deeper dive, like who exactly will battle for the general classification, what will the proximity of the race to the Worlds mean for the startlist, and will breakaways continue to sneak away for the win.</p><p>Overall, this will be a very different race compared to the Ladies Tour of Norway and the Simac Ladies Tour. For one, the terrain is different. Also, where the race falls in the season will impact the outcome.</p><p>The Ladies Tour of Norway was too close to the Olympics to attract all the top riders. Van Vleuten was there, as were a few big names, but it was more a mixed bag of skillsets. The terrain in Spain is the opposite of what we saw at the Simac Ladies Tour. With significantly more climbing, the tactics in Spain will be of a different nature. More conservative, less sporadic.</p><p>So let us get into the good stuff. What’s going to happen at the Ceratzit Challenge?</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/GettyImages-1318667510-1340x891.jpg\"></figure><h3>The Anna van der Breggen vs Annemiek van Vleuten battle will be fierce</h3><p>This is the last time <strong>Anna van der Breggen</strong> and <strong>Annemiek van Vleuten</strong> will battle it out in a hilly stage race. The two might do the Women’s Tour in Great Britain in October, but it’s doubtful. Also, the Women’s Tour doesn’t feature the same big climbs.</p><p>Stage 1 will be a battle of the Dutch, make no mistake. With Van Vleuten’s current form it’s likely she will finish on top for the first time in 2021. Van der Breggen proved to be the stronger climber at the Vuelta a Burgos, but we’re seeing a very different Van Vleuten this late in the season. She peaked for the Olympics (spoiler alert, it worked), she was unbeatable on the race-winning climb in Norway, and she walked away with San Sebastian Klasikoa.</p><p>Van der Breggen on the other hand only returned to racing after the Games in Tokyo at the GP de Plouay. She didn’t look amazing, but she was only just coming off her first directing gig with her SD Worx team. Hours in a team car at the Simac Ladies Tour is not great prep for a hilly one-day WorldTour event.</p><p>Now that she will be fully back in racing mode let’s hope Van der Breggen can challenge Van Vleuten, if only because that battle will be fun to watch.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/GettyImages-1327105437-1340x893.jpg\"></figure><h3>Just because Van der Breggen and Van Vleuten are favourites doesn’t mean the GC won’t be on fire</h3><p>There’s a handful of women who should be in the general classification conversation. <strong>Kristen Faulkner</strong> came seemingly out of nowhere this year to take third overall in Norway and just sprinted to third at the GP de Plouay. <strong>Elisa Longo Borghini</strong> will finish on the podium. <strong>Team BikeExchange</strong> in theory has a couple of cards to play, but I’ll get to that in a minute. <strong>Kasia Niewiadoma</strong> showed good form at Simac Ladies Tour and has been known to deliver a strong uphill time trial. <strong>Marlen Reusser</strong> is riding very well at the moment, and her climbing is coming along as we saw in Norway. <strong>Marta Cavalli </strong>and <strong>Cecilie Uttrup Ludwig </strong>are back to racing together, and both are strong enough to make elite selections on the climbing stages. Two-time overall winner <strong>Lisa Brennauer </strong>is also a force to be reckoned will.</p><p>There’s a lot of potential GC players in the game, so the battle will not be just the two Dutch superstars.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/GettyImages-1337270329-1340x893.jpg\"></figure><h3>Trek-Segafredo could salvage its 2021 stage racing campaign</h3><p>The top team of 2020, Trek-Segafredo has had a rough go of stage racing in 2021. They were nowhere to be seen at the Vuelta a Burgos. The Giro Donne started well, with a team time trial victory, but took a turn when their only general classification option struggled with form.</p><p>Chloe Hosking won the final stage of the Ladies Tour of Norway, but again the team had bad luck at the Simac Ladies Tour. <strong>Ellen van Dijk </strong>finished third overall after a good time trial but suffered from multiple flats on stage 4 when Chantal van den Broek-Blaak won the general classification. As a result, when the winning move went, there wasn’t a single Trek-Segafredo rider in chase one.</p><p>So can the current form of Longo Borghini salvage the teams stage racing reputation? There is no doubt the Italian national champion will be with the top riders on stages 1 and 3 and have a decent time trial, but the possibility of her being isolated on both the climbing days is real.</p><p>Trek-Segafredo is fielding a team of strong riders with Van Dijk, <strong>Audrey Cordon-Ragot</strong>, <strong>Tayler Wiles</strong>, and <strong>Amalie Dideriksen</strong> but if the racing is full gas on the climbs, not all of them will hang on, and the chances are even lower that they would then be able to get to the front and claw anything back. To be fair, there hasn’t been a hilly stage race in a while and Cordon-Ragot and Van Dijk are riding well. Not all hope is lost for the American squad.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/GettyImages-1320513481-1340x893.jpg\"></figure><h3>We will see aggressive tactics on stages 1 and 3?</h3><p>Stages 1 and 3 are the really hilly stages of the Ceratizit Challenge. With a categorie one climb on day one, the race will kick off with a bang. There will definitely be attacks before the big climb, but it’s the racing on the ascent and afterwards, that is really going to be worth watching.</p><p>With 57 remaining to race once the climb has topped out it would take a huge effort to attack on the climb and ride all the way to the finish, but it’s not unlikely. Van Vleuten could do it, especially if the chase doesn’t organize once the climb is behind them.</p><p>If a selection of ten or so riders is together after A Veiga with 83.9 km to go the attacks will be relentless on the next uncategorized climb. After that, it’s a descent to the finish, and<strong> </strong>Niewiadoma and <strong>Anna Henderson</strong> are champing at the bit to get there first. If either of them hit the descent first, heaven help the chasing group.</p><p>The third stage will be a bit less of decisive but it should still be challenging. In particular, the second climb to Alto de A Lama. Just like stage 1, however, there are more than 43 km still to go after the ascent. A wider range of riders could win with a 50 km solo move, but it will depend on the time gaps from stage 4 and if anyone dangerous manages to slip away.</p><p>This stage will favour a team with options. SD Worx has Van der Breggen, <strong>Ashleigh Moolman Pasio</strong>, and <strong>Niamh Fisher-Black</strong>. Canyon-SRAM has Niewiadoma, <strong>Elise Chabbey</strong>, and <strong>Mikayla Harvey</strong>. Stage 3 will be a game of numbers.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/GettyImages-1320524886-1340x893.jpg\"></figure><h3>Breakaways will be less successful</h3><p>Breakaways have been stealing the show at the last two WorldTour stage races. Kristen Faulkner slipped away to win the opening stage of the Ladies Tour of Norway and Riejanne Markus did the same on stage 2. Alison Jackson then pulled off a similar move on stage 1 of the Simac Ladies Tour.</p><p>Is it the Anna Kiesenhofer effect or is the peloton tired after two really long seasons of racing? In a recent episode of the <a href=\"https://cyclingtips.com/2021/08/freewheeling-podcast-lizzie-deignan-on-mothering-the-olympics-and-staying-positive/\" target=\"_blank\">Freewheeling Podcast, Lizzie Deignan</a> said that the quick turnaround from the adjusted 2020 season to the regularly scheduled programming of 2021 caused underlying fatigue. She can’t be the only rider looking forward to the offseason.</p><p>Whatever is causing the shift in racing, it’s been very entertaining to watch, but I won’t be holding my breath for the breakaway in Spain. The courses are harder, there is less road for a breakaway to get significant time. The general classification battle will be too hot. And the big teams maybe won’t make the same mistake for the fifth time.</p><p>After the Olympics, there was a weird block where a good amount of riders sat out and those who didn’t get to represent in Tokyo or were not favourites for an Olympic medal got the chance to shine. The top riders are back. We are in full pre-Worlds mode. The racing will change accordingly.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/GettyImages-1284548538-1340x893.jpg\"></figure><h3>The sprinters are running out of chances to win</h3><p>The fourth and final stage will be a sprint finish. The course is flat; if anything, it goes downhill. There are some lumps, but nothing worth writing home about, so the handful of sprinters will be eyeing this stage for themselves.</p><p>The sprinters’ teams lost out on three chances for victory at the Ladies Tour of Norway and Simac Ladies Tour. Specifically, Team DSM who won the bunch sprint all three times. With <strong>Coryn Rivera</strong> at the race, hopefully, the team can figure out where the signals are getting crossed and deliver the American to the line. She’s had one heck of a comeback this season and is more than capable of winning the final stage in Spain.</p><p>Another rider who is returning to the peloton after the Olympic Games is <strong>Lotte Kopecky</strong>. She had a nasty crash on the track and ended up taking more time away than originally planned. Kopecky returns to racing in time to refocus on her home-country World Championships.</p><p><strong>Elisa Balsamo</strong>, who just announced her move to Trek-Segafredo in 2022, won the final stage of the Ceratizit Challenge last year and will be in the mix.</p><p>With limited sprints left in the season, the sprinters better hope the peloton is all together coming into the finish of stage 4.</p><h2>Where to watch</h2><p>As a WorldTour race, the Ceratizit Challenge will be available for live viewing on GCN+ in Europe. To watch in Canada, check out FloBikes, and for those in the United States, tune in to NBC Sports. Australian viewers will find coverage on SBS.</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4780392a5c155cb3778b40bb47591872efefdf0a88745fcdbd1d46d35b703b68","category":"Cycling"}