{"title":"Apple Launches 'Apple for Kids' Support Portal for Parents and Guardians","link":"https://www.macrumors.com/2021/03/04/apple-launches-apple-for-kids-support-page/","date":1614860760000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/04/apple-launches-apple-for-kids-support-page/\"><p>Apple today added a new \"<a href=\"https://support.apple.com/apple-for-kids\">Apple for Kids</a>\" portal to its support website, offering parents and guardians a one-stop hub for getting their children set up on Apple's devices, services, and platforms, and managing their usage.</p><p><img alt=\"apple for kids support portal\" width=\"1148\" height=\"1178\" src=\"https://images.macrumors.com/t/E6_MIt6sYYAXYYu3Oi4x0rhnWWI=/400x0/filters:quality(90)/article-new/2021/03/apple-for-kids-support-portal.jpg?lossy\" data-src=\"https://images.macrumors.com/t/E6_MIt6sYYAXYYu3Oi4x0rhnWWI=/400x0/filters:quality(90)/article-new/2021/03/apple-for-kids-support-portal.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/E6_MIt6sYYAXYYu3Oi4x0rhnWWI=/400x0/filters:quality(90)/article-new/2021/03/apple-for-kids-support-portal.jpg?lossy 400w,https://images.macrumors.com/t/FWGiZ6UOVtVH3wTHuS_LtkebmTo=/800x0/filters:quality(90)/article-new/2021/03/apple-for-kids-support-portal.jpg?lossy 800w,https://images.macrumors.com/t/pEfSzcumJjz7sQQd8euKypCL6mQ=/1600x0/filters:quality(90)/article-new/2021/03/apple-for-kids-support-portal.jpg 1600w,https://images.macrumors.com/t/eNZNZFU96dDqmgcdBHVhvS8aHsc=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/apple-for-kids-support-portal.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/E6_MIt6sYYAXYYu3Oi4x0rhnWWI=/400x0/filters:quality(90)/article-new/2021/03/apple-for-kids-support-portal.jpg?lossy 400w,https://images.macrumors.com/t/FWGiZ6UOVtVH3wTHuS_LtkebmTo=/800x0/filters:quality(90)/article-new/2021/03/apple-for-kids-support-portal.jpg?lossy 800w,https://images.macrumors.com/t/pEfSzcumJjz7sQQd8euKypCL6mQ=/1600x0/filters:quality(90)/article-new/2021/03/apple-for-kids-support-portal.jpg 1600w,https://images.macrumors.com/t/eNZNZFU96dDqmgcdBHVhvS8aHsc=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/apple-for-kids-support-portal.jpg 2500w\"><br>The section includes quick links at the top for managing your family group and resolving common issues, such as what to do if your child forgot their passcode, or if they bought something from Apple's stores or services by accident.</p><p>Further down the page is a set-up sub-section, pointing adults in the right direction if they want to set up Family Sharing or get a child set up on an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, <a href=\"https://www.macrumors.com/roundup/ipod-touch/\">iPod touch</a>, or Mac. Also included are details about how to set up an Apple Watch for a family member who doesn't have their own ‌iPhone‌, using <a href=\"https://www.macrumors.com/guide/family-setup/\">Family Setup</a>.</p><p>In the U.S., users over 13 can also find links showing them how to update their <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a> birth date. Apple advises that if a child is under 13 and their ‌Apple ID‌ birth date is wrong, a parent or guardian will need to contact Apple Support on their behalf. The age cut-off for both actions varies by country or region.</p><p>Further down the page, adults can learn how \"Ask to Buy\" works. With Ask to Buy enabled, kids get permission from the designated \"family organizer\" before making a purchase. There are also links explaining how to locate missing devices with <a href=\"https://www.macrumors.com/guide/find-my/\">Find My</a>, and how to send Apple Cash to your children so they can use <a href=\"https://www.macrumors.com/roundup/apple-pay/\">Apple Pay</a>.</p><p>The last sub-section introduces ways to prevent kids from making in-app purchases, set limits with Screen Time, and use parental controls on a child's device.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/01/iphone-lawsuit-programmed-obsolescence-portugal/\">Apple Faces Another iPhone Lawsuit Over 'Programmed Obsolescence'</a></h3><p>Monday March 1, 2021 6:44 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple faces a new class-action lawsuit that accuses it of deliberately releasing iOS updates that slowly reduce the performance of an iPhone, forcing customers to upgrade their devices. The lawsuit comes from the Portuguese Consumer Protection Agency, Deco Proteste (via Marketeer), which in a statement says that it will proceed with a case against the Cupertino tech giant because it...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/02/nasa-mars-perseverance-rover-imac-powerpc/\">NASA Mars Perseverance Rover Uses Same PowerPC Chipset Found in 1998 G3 iMac</a></h3><p>Tuesday March 2, 2021 3:21 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>NASA's Perseverance rover, which recently made history landing on the surface of Mars, is powered by the same processor used in an iMac more than 23 years old. Image Credit: NASA As reported by NewScientist (via Gizmodo), the rover includes the PowerPC 750 processor, the same chip used in the G3 iMac in 1998. The main chipset is the same; however, there are differences between the...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/01/prosser-iphone-12-magsafe-battery-reverse-charging/\">Prosser: iPhone 12 MagSafe Battery Pack to Feature Reverse Charging</a></h3><p>Monday March 1, 2021 1:18 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple is working on MagSafe-compatible battery packs that will be compatible with the iPhone 12 models, and leaker Jon Prosser today said on the Genius Bar podcast that one version of the battery pack will feature \"reverse charging.\" According to Prosser, Apple is working on two versions of the battery packs, one that's a standard version and one that's a premium version with reverse...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/02/rosetta-macos-11-3-strings/\">Rosetta May Be Removed From M1 Macs in Some Regions on macOS 11.3</a></h3><p>Installing the upcoming macOS 11.3 software update on an M1 Mac may result in Rosetta 2 being removed in one or more regions around the world. In the third beta of macOS 11.3 seeded to developers for testing today, MacRumors contributor Steve Moser uncovered new strings in the beta's code indicating that \"Rosetta will be removed upon installing this update.\" Another new string reads \"Rosetta ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/01/wedbush-iphone-13-1tb-storage-lidar/\">iPhone 13 to Include 1TB Storage Option and LiDAR Across the Board, Says Wedbush Analyst</a></h3><p>Apple's forthcoming iPhone 13 could include a 1TB storage option for some models and LiDAR Scanners across the entire lineup, according to a report from Wedbush analysts. In a new note to investors, seen by MacRumors, Wedbush analyst Daniel Ives said that initial Asian supply chain checks gave the firm \"increased confidence\" that Apple's 5G-driven product cycle would extend well into 2022,...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/02/iphone-keeping-lightning-no-usb-c/\">iPhone Sticking With Lightning Port Over USB-C for 'Foreseeable Future'</a></h3><p>Apple will retain the Lightning connector on the iPhone for the \"foreseeable future,\" with no intention of switching to USB-C, according to reliable analyst Ming-Chi Kuo. In spite of much of the industry moving toward USB-C, Apple will not be using it to replace the Lightning connector on the iPhone 13, or indeed on any iPhone model for the time being. In a note seen by MacRumors yesterday,...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/03/apple-magsafe-charging-port-iphone-patent/\">MagSafe Charging Port for iPhone Appears in Apple Patent</a></h3><p>Wednesday March 3, 2021 1:30 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>In a newly granted patent, Apple envisions a type of connectivity port using an iteration of its magnetic MagSafe charger to charge an iPhone, potentially paving the way for a future without Lightning. Submitted to the United States Patent and Trademark Office on Tuesday (via Patently Apple), the patent outlines a three-pinned MagSafe charger, similar to the ones found in older MacBook...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/03/apple-transfer-icloud-photos-google-photos/\">Apple Launches Service for Transferring iCloud Photos and Videos to Google Photos</a></h3><p>Wednesday March 3, 2021 12:04 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple this week introduced a new service that's designed to make it quick and easy for iCloud users to transfer their stored photos and videos to Google Photos. As outlined in an Apple support document, you can go to Apple's privacy website and sign in to see the \"Transfer a copy of your data\" option. If you select this and go through all the steps, Apple will transfer your iCloud photos and ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/01/kuo-some-2022-iphones-punch-hole-display/\">Kuo: Some 2022 iPhones to Abandon Notch in Favor of 'Punch-Hole' Display</a></h3><p>At least some 2022 iPhone models will abandon the notch and switch to a \"punch-hole display design\" instead, similar to Samsung's recent high-end Galaxy smartphones, analyst Ming-Chi Kuo said today in a research note obtained by MacRumors. Kuo said the hole-punch display design will be adopted by high-end 2022 iPhones at a minimum, and if production yields are good enough, all 2022 iPhone...</p></div></div></div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"483597f470cc06076fc4fe04d3d3cf14d0dc3e97d5e88ca1577dc21cbfaa926f","category":"Apple"}