{"title":"Why you should care about the new UCI Track Champions League","link":"https://cyclingtips.com/2021/11/why-you-should-care-about-the-new-uci-track-champions-league/","date":1636212191000,"content":"<div><div><p>The first round of the UCI Track Champions League arrives on our screens this weekend. This new series of condensed, end-of-season track events promises a lot, including some of the world’s most high-profile riders, disco lights, an exciting ‘new’ racing format and a gender equal prize fund – all features that the organisers hope will thrill and entice fans the world over.</p><p>“It will be a mind-blowing mix of entertainment and sport,” Francois Ribeiro, Head of Eurosport Events, told Reuters ahead of the launch.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/GettyImages-1332951045-1340x887.jpg\"><figcaption>The ever-popular elimination race is one of two events that riders in the endurance category will compete in.</figcaption></figure><h2>What’s it all about?</h2><p>The “mind-blowing mix of entertainment and sport” is part of an overall restructuring of the UCI track calendar. With the World Championships being pushed to later in the season, the <a href=\"https://ucitrackchampionsleague.com/uci-champions-league-a-mind-blowing-new-era-for-track-cycling/\">Track Champions League</a> was conceived as an extension of the year-end track hype, in place of (for now at least) the once stacked winter Six Day calendar, which is now a little thin on the ground.</p><p>“We believe the track discipline is one of the most exciting forms of cycle sport, but as the demands of audiences have evolved, there is an opportunity to present this in a new and highly compelling way,” said Ribeiro. “We’ve tapped into our unrivalled expertise in another high-adrenalin form of racing – motorsport – to refine the format and deliver an unprecedented on-event and on-screen experience to cycling fans.”</p><p>The World Championships now double up as a qualification event for the Track Champions League. There are no less than 63 freshly minted world titles shared among the 72 riders competing in Saturday’s first round in Palma, Mallorca.</p><p>“We want to create a window every year for track cycling to create a stronger narrative for the sport, to showcase the rivalries,” Ribeiro added. “We know that Spring is for the Giro, July for the Tour de France and now we want November/December to be the window for track cycling.”</p><p>While COVID-19 continues to restrict travel, the league’s first year will stay within Europe – after Mallorca, the next stop is Lithuania (November 27), then rounds three and four are in London (December 3-4), with the grand finale in Tel Aviv, Israel on December 11 – but the plan is for the UCI Track Champions League to be an international event in future.</p><p>This week saw the big reveal of the custom Champions League speedsuits, with every rider’s national flags worked into the same design template: colours wrapping the right sleeve and thigh, with a flag on the left shoulder and back. It’s a design that clearly responds to the aesthetics of track cycling – the flag always visible from inside of the velodrome and the banded sleeve always facing outwards.</p><p>Many of <a href=\"https://ucitrackchampionsleague.com/riders/\">the world’s top track cyclists</a> will pull on their brand new speedsuits this weekend, including “founding riders” Ed Clancy (Great Britain), Emma Hinze (Germany), Harrie Lavreysen (Netherlands), Mathilde Gros (France), Simona Krupeckaite (Lithuania) and Sebastian Mora (Spain). Lavreysen, recently crowned world champion in individual sprint and keirin, will wear the rainbow bands in both Sprint category events – until he takes the leader’s jersey…</p><p>The run-up to the first round has seen a whole host of vibrant social media content including interviews, race simulation and ‘sport explainers’. The organisers also promise to treat viewers to a range of innovative features including live rider data. These ‘innovative features’, along with a music and light show reminiscent of Six Day events, promise to bring the fans closer to the action.</p><p>“Track cycling is such a wonderful sport,” Chris Hoy said at the event’s press launch. “It’s a great sport for kids to get into, it’s great for elite level, it has everything. It has excitement, there are personalities in the sport, so I hope this will engage with a new audience but also create personalities within the sport.</p><h2>The ‘new’ racing format explained</h2><p>Put simply, the Champions League is a <a href=\"https://ucitrackchampionsleague.com/racing-format/\">points-based series</a> in which all the riders, split between Endurance and Sprint categories, rack up points across five rounds (a sixth had to be cancelled after the Paris velodrome extended its duty as vaccination centre).</p><p>18 riders can compete in each category, and points are scored by the top 15 in each event: 20 points for first place down to one for 15th. Leader’s jerseys will be awarded after each event, to be worn in the next, and at the end of the fifth and final round, four riders – two women, two men – will be crowned overall Endurance or Sprint champions.</p><p><strong>Endurance</strong></p><ul><li>Scratch race – 20 laps, 5 km. First rider to cross the line wins</li><li>Elimination race – one rider eliminated every two laps until only one remains</li></ul><p><strong>Sprint</strong></p><ul><li>Keirin – the two fastest riders in the heats qualify for the six-rider final</li><li>Sprint – three-rider heats (as opposed to the usual flying lap) build toward a head-to-head final</li></ul><p>All the riders compete for a gender-equal pot of prize money totalling €500,000 (as well as UCI points), which is awarded in every race and for the overall standings: prize money goes to the top 10 in each event; €1,000 to individual race winners; and the overall winner of each category taking €25,000.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/GettyImages-1054690956-1340x827.jpg\"><figcaption>Robert Forstemann (left) and Maximilian Levy (right) during the keirin final on day six of the 2018 Six Day Series at Lee Valley VeloPark, London.</figcaption></figure><h2>How to watch</h2><p>Every round of the UCI Track Champions League will be shown live around the world, with broadcast television options available in most regions and online streaming worldwide. </p><p>Round one takes place in Mallorca, Spain, starting at 7:00pm CET (5am AEDT, 6pm GMT, 12pm MDT).</p><ul><li>Worldwide – GCN+</li><li>Europe – Eurosport, Discovery+</li><li>Asia – Eurosport</li><li>Australia – SBS</li><li>New Zealand – Sky</li></ul><h2>So why should you care?</h2><p>The organisers have cherry-picked a small number of the most fan-friendly track events – with a few glaring omissions; we see you Madison – and managed to draw a truly stellar field. Each round will provide two-plus hours of fast and frantic riding-in-circles, all based around a fairly simple points system that should appeal to everyone from beginners to diehard fans.</p><p>And if none of that persuades you, simply consider it a chance to watch bike racing when there’s nothing else on…</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"485bf7b22b6b7ba38398a9c47f03bf2457dbeda2203adb0c73d1538e0c472566","category":"Cycling"}