{"title":"Ten years on, Wouter Weylandt lives in memory","link":"https://cyclingtips.com/2021/05/ten-years-on-wouter-weylandt-lives-in-memory/","date":1620618540000,"content":"<div><p></p><h4>Wouter Weylandt, 2008.</h4><p></p><div><p>On the technical descent of the Passo del Bocco, not far from the finish of the third stage of the 2011 Giro d’Italia, Wouter Weylandt took a glance over his shoulder at the riders trailing him. </p><p>That was the last choice the young Belgian made. At around 80 km/h, his foot hit a concrete guard rail, catapulting him to the opposite side of the road and into a wall. The race doctor, who was by his side within 20 seconds, said later that “he was already and clearly dead upon impact. I had never seen such a thing before, such a sudden death.” </p><p>For 45 minutes, medical staff tried to resuscitate Weylandt, but he was unable to be saved. A devastated peloton rode a neutralised stage the following day, with Weylandt’s teammates and friends crossing the line together in tears.</p><p>There’s little comfort to be found from a death so sudden and brutal, but perhaps there was some solace in a line from the autopsy released after Weylandt’s death: that he “did not suffer”. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/CORVOS_00017222-033-1340x803.jpg\"><figcaption>Wouter Weylandt’s teammates and friend Tyler Farrar cross the line together, the stage after his death.</figcaption></figure><p>At the start of the second stage of this year’s Giro, a decade since that terrible day, the peloton shared a minute’s silence. Weylandt’s race number – 108 – has never been used in the race since 2011, but was written across the road in Stupinigi.</p><p>179 km later, at the stage finish in Novara, Weylandt’s compatriot Tim Merlier sprinted to the stage victory. He crossed the line, his arms aloft, his thumbs and fingers forming a ‘W’. </p><p>A dwindling number of Weylandt’s colleagues still race, but he is not forgotten. One of his best friends, Iljo Keisse, is riding this year’s Giro d’Italia. Weylandt’s sister, Elke, works for Trek-Segafredo as the team’s operations manager. The memory of Wouter Weylandt is a sad, structural part of cycling’s story.</p><p>His partner, his family, his friends, the doctors that worked to save him, the racers that whooshed past his body, and the television audience that watched on – they all remember Wouter Weylandt.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/CORVOS_00033104-106-1340x892.jpg\"><figcaption>Tim Merlier wins stage two of the 2021 Giro d’Italia, dedicating the victory to Wouter Weylandt.</figcaption></figure><h2>A life without Wouter</h2><p>Weylandt’s partner, An-Sophie, was five months pregnant at the time of his death and has spent the 3,652 days that have passed raising the couple’s daughter, Alizée, without him. Her name was the only one they had agreed on prior to her birth.  </p><p>A childhood passes quickly and slowly: nights and days are long, months and years are short. But through the filter of grief, each instant of that journey bears a greater emotional burden. </p><p>In an interview with <a href=\"https://www.nieuwsblad.be/cnt/dmf20210507_97051130\">Het Nieuwsblad</a>, An-Sophie reflected on almost a decade with Alizée – and without Wouter – describing how she was able to rebuild her life after it was torn apart. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/CORVOS_00017279-002-1340x895.jpg\"><figcaption>An-Sofie at the funeral of her partner.</figcaption></figure><p>Alizée never met her father, so May 9 “is not a difficult day for her”, An-Sophie said. On the anniversary of Weylandt’s death – this year, cruelly, it fell on Mother’s Day – An-Sophie and Alizée planned to eat pastries.</p><p>Alizée is a joyful child, her mother says. “She got that cheerfulness from him.”</p><p>“My intention was precisely to make sure that she remained that happy child. That I didn’t bring up my daughter sadly, or pass the trauma on to her. And that works. She never felt what we felt, did she? But she knows who he is,” An-Sophie says.</p><p>“One day she came home and asked: Was my daddy well known? At school they say he was a bike racer and was on TV a lot. Then I explained that her daddy fell while abroad with a bicycle in a race and so died. She knows quite a bit, but asks few questions.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/CORVOS_00021305-009-1340x915.jpg\"><figcaption>Mark Cavendish holds up Wouter Weylandt’s race number in his memory at the 2013 Giro d’Italia.</figcaption></figure><p>An-Sophie made a conscious decision to move forward rather than look back, shifting her routines and building new patterns to create a joyful life for their daughter. “After her birth it was full of Wouter here in the house. Photos and stuff. Then it was really hard, and I made the click: I had to get on with my life, it hurt me too much to keep seeing everything,” An-Sophie explains. </p><p>“I redesigned everything. I stopped visiting him at the cemetery because I was always crying. I lived completely around those visits, before and after work. I don’t have to do this to myself, I thought. I still pass the cemetery every day for my work, but I can no longer find it in my heart to stop there. So I have not yet been to Wouter’s grave with Alizée. We will not go back until she wants to.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/CORVOS_00033104-014-1340x893.jpg\"><figcaption>The peloton takes a minute’s silence yesterday to remember Wouter Weylandt.</figcaption></figure><p>Alizée has only been to the cemetery with her grandparents – Wouter’s parents – who remain a major part of An-Sophie’s and Alizée’s life.</p><p>“It clearly stuck – recently we went to the playground next to the cemetery, and she proudly said to her friends: ‘Look, there is my daddy,’” An-Sophie says. </p><p>An-Sophie spent five years together with her “best friend”, and then he was gone. Now, she says, “[Alizée] is the love of my life.” Wouter’s daughter learnt how to ride before she was four years old, and An-Sophie surprised herself by being alright with that. “Strangely enough, I didn’t become an overprotective mama. If she’s going to fall, I can’t stop it, I realise. I’m not going to keep her especially far from the sport, either. The race was Wouter’s life,” she says.  </p><p>“There was a time he wanted to stop, and I told him that would be the stupidest thing he could do. Did I regret that afterwards? No, because he would have been unhappy. And isn’t that the most important thing? That Alizée later also does what she wants. That she will have a family, and never have to feel the same [as I did] at 27.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/CORVOS_00017279-035-1340x894.jpg\"><figcaption>Wouter Weylandt’s funeral was widely attended, and televised on Belgian TV.</figcaption></figure><h2>A decade of longing</h2><p>An-Sophie has found new love, and a decade on from unimaginable sorrow, says she has found her way back to happiness. But the loss will always be there – its sharpness has just been dulled by time. And, as Wouter’s sister Elke explains in an interview with <a href=\"https://sporza.be/nl/2021/05/09/elke-weylandt-herdenkt-wouter-10-jaar-klinkt-als-eeuwigheid-maar-voelt-zo-niet~1620547950524/\">Sporza</a>, time is elastic. </p><p>“The realisation that he hasn’t been around for 10 years makes it seem like an eternity, but it doesn’t feel like that at all. I still feel very close to my brother,” she says. </p><p>“There is no medicine for dizzyingly great sorrow. And even if it existed, I would not want to take it. I do not like to be sad, on the contrary. But mourning for someone also shows how great the love was or is.” </p><p>Each year, Elke writes a letter to her brother and publishes it on her blog. Ten snapshots of a year of grief and longing. Her <a href=\"https://michaelenelke.blogspot.com/2021/05/tien.html\">most recent letter</a> reflects on the latest milestone:</p><blockquote><p><em>“In recent weeks, some journalists have asked me what I would say to you if I could see you again …</em></p><p><em>I will never see you again. But imagine now. What if I found that little door to the parallel universe where you just kept living on, then … I wouldn’t have to say anything. I would just ‘pull you against my waistcoat’ and never let go. And you would look a little uncomfortable and roll your eyes but you would let me do it because you would feel my heart pounding and love flow through my veins.</em></p><p><em>After all these years without you, the feeling has been purified to its essence: I love to see you, little brother, and goddamn I would have loved to have you with me now.</em></p><p><em>I always carry you with me, in my head, in my heart, in every fibre of my body. “</em></p></blockquote><h2>Rebuilding and repairing</h2><p>The legacy of loss ripples outward in ways that are expected, and others that are not.</p><p>For some – like An-Sophie – it is something that needs to be compartmentalised to heal from. For others, like Elke Weylandt, it’s something that can be woven into life’s tapestry, to bring new perspectives from the past and add depth and nuance to the future. For Iljo Keisse, one of Wouter Weylandt’s great friends, some aspects of the entirety of that grief need to be put aside for a while, out of self-preservation.</p><p>On the side of the Passo del Bosco, at the spot where he died, there is a monument to Wouter Weylandt. There, visitors leave flowers in remembrance. Elke Weylandt has visited; An-Sophie went there before there was a monument – the day after her partner died, when there was still blood on the road. </p><p>Iljo Keisse, still contending with the risks of his profession, has to put aside that particular phase of his grieving for now.</p><p>“It’s something for after my cycling career,” he said. “It’s too difficult now that I’m still racing as a professional. Once I have stopped and can ride descents leisurely, I will do that – it can also be a part of the process that has never been completed. But as a rider who is facing the same dangers every day, going to that spot is not an option,” Keisse tells Het Laatste Nieuws.</p><p>“Ten years ago, I quickly decided not to dwell on it for too long. That is why I was able to keep racing. If you lose yourself too much in it, you have to stop. You cannot be constantly in your head with your best friend who died during a descent and at the same time take risks in a descent. That does not go together.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/CORVOS_00017222-067-1340x893.jpg\"></figure><h2>The legacy of a life</h2><p>Life goes on.</p><p>Alizée will soon turn ten. An-Sophie will keep moving forward with her life, moving purposefully toward a happiness that once seemed impossible. Elke Weylandt will keep turning up to the Giro d’Italia, boarding the team bus of the squad her brother once raced for and which she now works for, which always has “WW108” labelled on it as a homage. Iljo Keisse will race on – at 38 years old, maybe just for this year, or maybe several more – and when he retires, will finally be able to say goodbye at the place where everything changed. </p><p>On May 9, 2011, Wouter Weylandt died on an Italian roadside. Ten years on, Wouter Weylandt lives in memory. </p></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"48af77d51250b328ee0be41862c365332338006254b1ff624f78687ec452cb26","category":"Cycling"}