{"title":"Touch of gray: The Air Force can’t retire the Boeing 707","link":"https://arstechnica.com/?p=1748481","date":1615921943000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>I just can't quit you —</h4><h2 itemprop=\"description\">In this installment of SitRep, we look at the 707's longevity as a military workhorse.</h2></div><div itemprop=\"articleBody\"><figure><div id=\"ars-cne-vid-402482221\" crossorigin=\"anonymous\" playsinline=\"true\" webkit-playsinline=\"\" lang=\"en\" role=\"region\" aria-label=\"Video Player\" data-video-id=\"604b9ee038d06931f218aaca\" data-video-params=\"[]\" data-size=\"medium\"><video webkit-playsinline=\"\" playsinline=\"playsinline\" crossorigin=\"anonymous\" id=\"vjs_video_3_html5_api\" tabindex=\"-1\" preload=\"metadata\" src=\"https://dp8hsntg6do36.cloudfront.net/604b9ee038d06931f218aaca/cedf7f38-43bd-4577-8bd5-5a946fb08536high.mp4?videoIndex=0&amp;requester=oo\" poster=\"https://dwgyu36up6iuz.cloudfront.net/heru80fdn/image/upload/c_fill,d_placeholder_arstechnica.png,fl_progressive,g_face,h_450,q_80,w_800/v1615574323/arstechnica_sitrep-boeing-707.jpg\"><p>To view this video please enable JavaScript, and consider upgrading to a web browser that</p></video><div><h4>Our bad! It looks like we're experiencing playback issues.</h4></div><div dir=\"ltr\" aria-label=\"Video player controls\" role=\"group\"><p>Volume 100%</p><p><span>Current Time&nbsp;</span><span aria-live=\"off\">0:00</span></p><p><span>Duration&nbsp;</span><span aria-live=\"off\">0:00</span></p><p><span>Remaining Time&nbsp;</span><span aria-live=\"off\">-0:00</span></p></div><p><a href=\"https://www.arstechnica.com/video/watch/sitrep-boeing-707\" target=\"_blank\"><h2>Sitrep: Boeing 707</h2></a></p></div></figure><p>The Boeing B-52 Stratofortress may have a lock on the title for oldest active-duty US military aircraft. But it only has two years on the Air Force's <em>other</em> senior citizen, an aircraft that will likely keep flying for as long as the B-52: the venerable Boeing 707.</p><p>While the Air Force is working on phasing out the KC-135 refueling plane (which was developed alongside the 707 by Boeing in 1956), the 707 lives on in many other guises. There's the Air Force's <a href=\"https://en.wikipedia.org/wiki/Boeing_E-6_Mercury\">E-6 AWACS</a> and <a href=\"https://en.wikipedia.org/wiki/Northrop_Grumman_E-8_Joint_STARS\">E-8 JSTARS</a> command and control aircraft, as well as the US Navy's E-6B Mercury strategic command and control aircraft (also known as the \"doomsday plane\"), all based on the 707 airframe. And as much as the Air Force might want to send its 707-based aircraft off to the boneyard—most of those aircraft were delivered before most active service members were even born!—the US Congress recently made that goal more difficult to achieve.</p><p>The <a href=\"https://arstechnica.com/information-technology/2021/02/connected-battlespace-2/\">E-8 JSTARS and its associated ground stations</a> have been at the center of the Army and Air Force's joint surveillance, command, and control capabilities since the mid-1990s, after seeing early action during the 1991 Gulf War. Originally intended to serve as a flying command post with ground radar for tracking enemy armor, JSTARS added more sensors and capabilities over the past two decades as it evolved into an airborne reconnaissance, intelligence, and communications hub for joint operations, as well as linking troops on the ground with commanders and working with drones and other aircraft to find and fight insurgents.</p><p>While the 16 JSTARS aircraft in service have been useful in most of America's 21st-century conflicts, the 707 airframes they are based on are not getting any younger. The last commercial 707 was withdrawn from service in 2019, and maintenance isn't getting any less expensive. Additionally, the lumbering 707s are particularly tasty and vulnerable targets in combat involving an adversary with any sort of air defense capabilities to speak of.</p><p>Instead of replacing JSTARS and the other 707s with a new, purpose-built aircraft, the Air Force wants to replace them with a totally new concept: a battlefield \"Internet of Things\" called the Advanced Battle Management System, or ABMS. In ABMS, the sensor and command and control tasks of the JSTARS and AWACS aircraft could be replicated by other existing Air Force systems, including satellites, drones, and combat aircraft with ground target-tracking radar and electro-optical sensors, all tied into a larger network. The Air Force recently <a href=\"https://www.defense.gov/Newsroom/Contracts/Contract/Article/2529436/\">awarded a $9 million modification of the ABMS contract held by Folsom, California-based Valley Systems</a> to do all the integration work to turn sensors into nodes on the proposed ABMS IoT. But that work isn't anticipated to be done until 2022, and there are still bigger issues to resolve with the overall network. So, ABMS is still years away from being fully operational.</p><p>And that's why the 707 still has miles to fly before it sleeps. In the 2021 Defense authorization bill passed earlier this year, Congress dictated that the Air Force cannot retire JSTARS aircraft until ABMS can replicate the level of capability and coverage provided by all 16 current aircraft. So these upgraded passenger jets, the same type that heralded the start of the Jet Age in the 1950s, are likely to fly for at least another decade.</p><p><em>Listing image by <a href=\"https://www.istockphoto.com/\" rel=\"nofollow\">iStock / Getty Images</a></em></p></div></div>","author":"Sean Gallagher","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"48ba593d0aaca023630c377746f738ac099204d6b03878e8942dbfa326fc6927","category":"Tech"}