{"title":"Apple Watch Series 3 vs SE vs Series 6: Pick the right watch for your wrist","link":"https://www.macworld.com/article/3575413/apple-watch-series-3-vs-se-vs-series-6-display-size-features-sensors-performance-lte-colors-price.html#tk.rss_all","date":1615033860000,"content":"<div id=\"readability-page-1\" class=\"page\"><section role=\"main\" id=\"page-wrapper\"><article itemscope=\"\" itemtype=\"http://schema.org/Article\"><meta itemprop=\"keywords\" content=\"apple watch, wearables, consumer electronics, apple \"><header><ins data-ad-client=\"ca-pub-4268075595326305\" data-ad-slot=\"9945794902\" data-ad-format=\"link\" data-adsbygoogle-status=\"done\"><ins id=\"aswift_0_expand\" tabindex=\"0\" title=\"Advertisement\" aria-label=\"Advertisement\"><ins id=\"aswift_0_anchor\"></ins></ins></ins><section><h3 itemprop=\"description\">Know what to look for.</h3></section><div><p>Executive Editor, <span itemprop=\"publisher\" itemscope=\"\" itemtype=\"http://schema.org/Organization\"><span itemprop=\"name\">Macworld</span><meta itemprop=\"url\" content=\"https://www.macworld.com\"><meta itemprop=\"logo\" content=\"https://alt.idgesg.net/images/furniture/macworld/MW_logo_300x300.png\"></span><span>|</span> <span itemprop=\"datePublished\" content=\"2021-03-06T04:31-0800\"><span>Mar 6, 2021 4:31 am PST</span></span></p></div></header><div><div><figure id=\"page-lede\" kioskedhash_production=\"11429_1047689e2a385333192129c3f63e7e43\" data-kiosked-context-name=\"kskdUIContext_01f03sak7d19ys0enxme8xpxtv\"><div><p>For the first time since its launch in 2016, there are three Apple Watch models to choose from that all look very similar at first glance. But upon closer inspection, you’ll find that there are very distinct differences between them that go much...</p></div></figure></div></div><section><div id=\"drr-container\" itemprop=\"articleBody\"><p>Apple is selling three different Apple Watch models this year, and they all look kind of the same. But when you dive into what each delivers, you’ll find that there are very distinct differences between them that go much deeper than their price differences. Now that we've had a few months to use them all, here’s how the models stack up and which one you should buy.</p><div data-tracking-category=\"In-article TOC\"><legend>Table of Contents <i></i></legend><ul><li data-pagenum=\"1\" data-tocnum=\"1\"><a href=\"#toc-1\">Design and display</a></li><li data-pagenum=\"1\" data-tocnum=\"2\"><a href=\"#toc-2\">Colors and bands</a></li><li data-pagenum=\"1\" data-tocnum=\"3\"><a href=\"#toc-3\">Performance and chips</a></li><li data-pagenum=\"1\" data-tocnum=\"4\"><a href=\"#toc-4\">Connectivity and battery life</a></li><li data-pagenum=\"1\" data-tocnum=\"5\"><a href=\"#toc-5\">Sensors and features</a></li><li data-pagenum=\"1\" data-tocnum=\"6\"><a href=\"#toc-6\">Price</a></li><li data-pagenum=\"1\" data-tocnum=\"7\"><a href=\"#toc-7\">Conclusion</a></li></ul><p>Show More <i></i></p></div><h2 id=\"toc-1\">Design and display</h2><p>Apple hasn’t strayed very far from the original 2015 square design, so you're not going to notice a huge difference between the three watches, even though the Series 3 is slightly smaller than the SE and Series 6:</p><ul><li><strong>Series 3 (38mm):</strong> 38.6 x 33.3mm x 11.4mm</li><li><strong>Series 3 (42mm):</strong> 42.5 x 36.4 x 11.4mm</li><li><strong>SE/Series 6 (40mm):</strong> 40 x 34 x 10.7mm</li><li><strong>SE/Series 6 (44mm):</strong> 44 x 38 x 10.7mm</li></ul><p>The SE and Series 6 are also slightly heavier than the SE by about 3 grams, but your wrist really won’t notice the difference. Apple has the best and most recognizable watch design in the smartwatch industry, so any of the three will look and feel great on your wrist.</p><p>Where they differ, however, is with the display. The Series 3 has Apple’s older display, so it’s smaller (38mm model: 563 sq mm; 42mm model: 740 sq mm) and has square corners. The SE and Series 6 have larger displays (40mm model: 759 sq mm; 44mm model: 977 sq mm) with rounded corners to match the display body.</p><figure kioskedhash_production=\"11429_cdf3d7411af553cee5608ab61be26b06\" data-kiosked-context-name=\"kskdUIContext_01f03sak7d19ys0enxme8xpxtv\"><a href=\"https://images.idgesg.net/images/article/2020/09/apple-watch-se-faces-100857525-orig.jpg\" rel=\"nofollow\" title=\"<div class='credit'>Apple</div>\n<p>The Apple Watch SE has the same display as the Apple Watch Series 6.</p>\n\"><img alt=\"apple watch se faces\" width=\"1200\" height=\"800\" data-imageid=\"100857525\" data-license=\"Supplied Art\" data-original=\"https://images.idgesg.net/images/article/2020/09/apple-watch-se-faces-100857525-large.jpg\" loading=\"lazy\" src=\"https://images.idgesg.net/images/article/2020/09/apple-watch-se-faces-100857525-large.jpg\"></a><small>Apple</small><figcaption><p>The Apple Watch SE has the same display as the Apple Watch Series 6.</p></figcaption></figure><p>While the SE and Series 6 have identical display specs, only the Series 6 has an always-on option, which lets you see the time even when your wrist is lowered. Apple also says the always-on display is 2.5-times brighter than last year’s model, which will certainly help in bright light.</p><p><strong>Our pick:</strong> While the sizes and designs are very similar, the displays make all the difference with the Series 6 and SE. We'd go with the Series 6 and the always-on display, but if you don't mind raising your wrist to see the time, the SE's screen is just as good.&nbsp;</p><h2 id=\"toc-2\">Colors and bands</h2><p>While all three watches are available in silver and space gray aluminum like always, you have considerably more options as you go up the line. The Apple Watch SE adds a gold color, while the Series 6 has new blue and Product(Red) hues.</p><p>If you upgrade to one of the cellular models, you can get silver, graphite (DLC), or gold (PVD) stainless steel, or natural titanium or space black titanium. Additionally, the Series 6 and SE are available in Nike (silver and space gray aluminum) and the Series 6 offers a Hermes edition in silver and space black stainless steel.</p><div><p>Today's Best Tech Deals</p><p>Picked by Macworld's Editors</p></div><div><p>Top Deals On Great Products</p><p>Picked by Techconnect's Editors</p></div><p>Around the back, you’re getting a composite cover with the Series 3 and an upgraded ceramic and sapphire crystal back on the SE and Series 6.</p><p>For more important than the body color, however, is the band. All of the options Apple sells are compatible with both the SE and Series 6, but since the Series 3 is older, some newer options, such as the&nbsp;Solo Loop and Braided Solo Loop bands aren't compatible with the Series 3.</p><p><strong>Our pick:</strong> The new blue and red body on the Series 6 are very nice, but we wouldn't spring for the extra money just for the color. After all, you're not going to see all that much of the body anyway, but you'll want to make sure you get a band that suits your style.</p><blockquote><p><strong>Read more about the Apple Watch SE and Series 6</strong></p><p><a href=\"https://www.macworld.com/article/3575350/apple-watch-se-features-display-safety-sensors-price.html\">6 surprising reasons to buy Apple Watch SE</a></p><p><a href=\"https://www.macworld.com/article/3574947/apple-watch-series-6-features-design-sensors-faces-price.html\">The new Apple Watch Series 6 is a bigger upgrade than you think</a></p><p><a href=\"https://www.macworld.com/article/3584833/apple-watch-series-6-review.html\">Apple Watch Series 6 review</a></p><p><a href=\"https://www.macworld.com/article/3583930/apple-watch-se-review.html\">Apple Watch SE&nbsp;review</a></p><p><a href=\"https://www.macworld.com/article/3563915/watchos-7-faq-everything-you-need-to-know-about-the-new-features-coming-to-your-apple-watch.html\">watchOS 7 FAQ</a></p></blockquote><h2 id=\"toc-3\">Performance and chips</h2><p>Performance isn’t nearly as important on the Apple Watch as it is on the iPhone or iPad, but with so much going on inside your Apple Watch, speed does matter. And with each of these watches you’re getting different chips:</p><ul><li><strong>Series 3:</strong> S3</li><li><strong>SE:</strong> S5</li><li><strong>Series 6:</strong> S6</li></ul><p>As you might expect, the S6 is about 20 percent faster than the S5, which is about twice as fast as the S3. That’s because the S5 and S6 processors have a 64-bit dual-core architecture while the S3 is 32-bit. Additionally, you also get the newer W3 wireless chip, which brings support for Bluetooth 5.</p><figure kioskedhash_production=\"11429_23496de07083488ec82100d9c4712eb1\" data-kiosked-context-name=\"kskdUIContext_01f03sak7d19ys0enxme8xpxtv\"><a href=\"https://images.idgesg.net/images/article/2020/09/apple-watch-series-6-colors-100857508-orig.jpg\" rel=\"nofollow\" title=\"<div class='credit'>Apple</div>\n<p>The Series 6 Apple Watch is the fastest but the SE is no slouch.</p>\n\"><img alt=\"apple watch series 6 colors\" width=\"1200\" height=\"800\" data-imageid=\"100857508\" data-license=\"Supplied Art\" data-original=\"https://images.idgesg.net/images/article/2020/09/apple-watch-series-6-colors-100857508-large.jpg\" loading=\"lazy\" src=\"https://images.idgesg.net/images/article/2020/09/apple-watch-series-6-colors-100857508-large.jpg\"></a><small>Apple</small><figcaption><p>The Series 6 Apple Watch is the fastest but the SE is no slouch.</p></figcaption></figure><p>The Series 6 watch also brings Apple’s U1 Ultra wideband chip to the Apple Watch for the first time. First introduced in the iPhone 11 and iPhone 11 Pro, the chip allows for greater spatial awareness, which according to Apple allows the device to understand its precise location relative to other nearby U1‑equipped Apple devices. Right now that doesn’t mean a whole lot—especially since Apple Watch doesn’t do AirDrop yet—but once the long-rumored AppleTags make an appearance that will change.</p><p><strong>Our pick:</strong> If you want it all, the Series 6 is obviously the only choice, but we think the SE will be plenty fast for most people. The Series 3 will feel too pokey when trying to run anything outside of Apple's stock apps.</p><h2 id=\"toc-4\">Connectivity and battery life</h2><p>Apple might have launched the cellular LTE option with the Series 3 Apple Watch, but now it’s gone. If you want to use your watch outdoors and leave your phone behind, you’ll need to get either the Apple Watch SE or Series 6, both of which are available in either GPS or GPS+Cellular varieties. That’s particularly important if you plan on using Family Setup, which requires a cellular connection.</p><p>If you're using cellular a lot, your battery life will vary a bit, but for the most part, all three watches will get roughly 18 hours of battery life. That just enough to ensure you need to charge it once a day, which could be tricky if you want to track sleep.</p><p><strong>Our pick:</strong> We’ve never been huge fans of the $100 upcharge or the monthly carrier fee for the Apple Watch’s cellular connection, but the new Family Setup feature is intriguing, as is the SE's cheaper LTE price (see below). Plus carriers are charging less than just a couple of years ago, so cellular is becoming more intriguing. Whether you need it is up to whether you want to leave your phone behind or buy one for your kid, but we're definitely higher on cellular than we once were.</p><h2 id=\"toc-5\">Sensors and features</h2><p>Here’s where the watches really set themselves apart. First, let’s start with what all three watches have:</p><ul><li>GPS/GNSS</li><li>NFC</li><li>Altimeter</li><li>Gyroscope</li><li>Accelerometer</li><li>Optical heart sensor</li><li>Ambient light sensor</li><li>Microphone</li><li>GymKit</li><li>50M water resistance</li><li>Emergency SOS</li></ul><p>Notably, the SE and Series 6 have a second-gen heart sensor for greater accuracy as well as an always-in altimeter for all-day tracking. Additionally, the microphone will track decibels in the Noise app and the accelerometer is used to detect falls, both of which aren’t available on the Series 3 watch. You also get 32GB of storage on the SE and Series 6, versus just 8GB on the Series 3.</p><figure><a href=\"https://images.idgesg.net/images/article/2020/10/apple-watch-series-6-sp02-100860923-orig.jpg\" rel=\"nofollow\" title=\"<div class='credit'>Michael Simon/IDG</div>\n<p>The on-screen animation while taking blood-oxygen readings are very cool.</p>\n\"><img alt=\"apple watch series 6 sp02\" width=\"1200\" height=\"800\" data-imageid=\"100860923\" data-license=\"IDG\" data-original=\"https://images.idgesg.net/images/article/2020/10/apple-watch-series-6-sp02-100860923-large.jpg\" loading=\"lazy\" src=\"https://images.idgesg.net/images/article/2020/10/apple-watch-series-6-sp02-100860923-large.jpg\"></a><small>Michael Simon/IDG</small><figcaption><p>The on-screen animation while taking blood-oxygen readings are very cool.</p></figcaption></figure><p>If you upgrade to the SE, you’ll get a compass and international emergency calling, but to get the latest sensors you’ll need to spring for the Series 6. Most notably, it has a SpO2 blood oxygen sensor that works with a custom algorithm to use light to measure the oxygen saturation of blood both on-demand and throughout the day. Oxygen saturation can help manage heart failure and asthma, as well as early respiratory issues stemming from the flu or coronavirus. It’s also the only watch Apple sells that has the electrical heart sensor that was introduced with the Series 5 last year.</p><p>All three watches support watchOS 7, so you'll be able to use any model to <a href=\"https://www.macworld.com/article/3605528/ios-14-5-features-release-date-beta-how-to-install.html\">unlock your iPhone while wearing a mask in iOS 14.5</a>.</p><p><strong>Our pick:</strong> Health and fitness buffs will definitely want to spring for the Series 6 and the blood-oxygen sensor, but the SE has a healthy array of sensors and features for its price. The blood-oxygen sensor doesn't do all that much right now, but it likely will in the future. So if you want to future-proof your wrist, the Series 6 is your best investment.</p><h2 id=\"toc-6\">Price</h2><p>There’s a wide gap between the cheapest Apple Watch and the most expensive (that would be the $1,400 Hermes Silver Stainless Steel Case with Single Tour Deployment Buckle, but the starting prices aren’t nearly as outlandish:</p><ul><li><strong>Series 3:</strong> $199/$229</li><li><strong>SE:</strong> $279/$309</li><li><strong>Series 6:</strong> $399/$429</li></ul><p>Granted, the Series 6 costs twice as much as the Series 3 and $120 more than the SE, and it only goes up from there. Here are the prices for the cellular models:</p><ul><li><strong>SE:</strong> $329/$359</li><li><strong>Series 6:</strong> $499/$529</li></ul><p>Somehow, the cellular Apple Watch SE is an even greater value than the GPS-only model. With a $50 premium versus $100 on the Series 6, the cellular Apple Watch SE is only $30 more than last year’s Series 3, which has far fewer features.</p><p><strong>Our pick:</strong> This is basically a case of what you can afford. If your budget will allow you to spend $400 on the Series 6, it's well worth the price of admission. But if you're a little stretched the SE is a very good option, especially if you're going for LTE. We'd stay away from the Series 3, however, even if you get it on sale. You're better off waiting a few months and saving for something better.</p><h2 id=\"toc-7\">Conclusion</h2><p>Even if you only have $200 to spend, we can't recommend anyone buys the Series 3. The processor is old enough where it's lucky to get two more OS updates, and it's missing too many features.</p><p>So it comes down to whether you need the best features or not. The Series 6 offers a lot over the SE for $120 more—ECG, Sp02, always-on display—so if you can swing the price or get it on sale, you'll be very happy with your purchase for years to come.</p><figure><a href=\"https://images.idgesg.net/images/article/2020/09/apple-watch-se-california-100860175-orig.jpg\" rel=\"nofollow\" title=\"<div class='credit'>Michael Simon/IDG</div>\n<p>The Apple Watch SE looks just like the Series 6 when the screen is lit.</p>\n\"><img alt=\"apple watch se california\" width=\"1200\" height=\"800\" data-imageid=\"100860175\" data-license=\"IDG\" data-original=\"https://images.idgesg.net/images/article/2020/09/apple-watch-se-california-100860175-large.jpg\" loading=\"lazy\" src=\"https://images.idgesg.net/images/article/2020/09/apple-watch-se-california-100860175-large.jpg\"></a><small>Michael Simon/IDG</small><figcaption><p>The Apple Watch SE looks just like the Series 6 when the screen is lit.</p></figcaption></figure><p>Otherwise, we’d recommend the 40mm Apple Watch SE with LTE for $329 in our favorite color, gold (though if you want silver or space gray we won't complain). Yes, you're spending $130 more than the Series 3, but you’re getting so much more for your money: a bigger display, better sensors, faster chip, and more storage. Plus you’re obviously getting cellular connectivity, which is far more useful this year thanks to Family Setup.</p><p>Even buyers leaning toward the Series 6 might want to consider this model. It’s $160 cheaper than the comparable Series 6 watch and while you’re not getting next-gen blood-oxygen and ECG sensors, but the rest of the SE matches up extremely well with the flagship model at a fraction of the price.</p><p><strong>Update 3/6:</strong> <em>Updated throughout with new analysis and recommendations.</em></p><div><p>Note: When you purchase something after clicking links in our articles, we may earn a small commission. Read our <a href=\"https://www.macworld.com/about/affiliates.html\">affiliate link policy</a> for more details.</p></div></div><div><p>Michael Simon covers all things iPhone, iPad, Mac, and Apple Watch, with a little Android thrown in. You can usually find him with his nose buried in a screen. The best way to yell at him is on <a href=\"https://twitter.com/morlium?lang=en\">Twitter</a>.</p></div></section></article></section></div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"49225550b138875d79fd9c227204ec03bc312d7b37cb410e6e21c25f19915bd5","category":"Apple"}