{"title":"SpaceX Starlink opens preorders but slots are limited in each region","link":"https://arstechnica.com/?p=1741019","date":1612915232000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Starlink preorders: first-come, first-served —</h4><h2 itemprop=\"description\">A $99 deposit today gives you a chance at service in the second half of 2021.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/starlink-ordering-800x405.jpg\" alt=\"Screenshot from the SpaceX Starlink pre-order website.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/starlink-ordering.jpg\" data-height=\"845\" data-width=\"1669\">Enlarge</a> <span>/</span> Screenshot from the Starlink order page, with the street address blotted out.</p></figcaption></figure><p>SpaceX this week began accepting preorders for Starlink broadband, asking for $99 deposits for service that would be available in the second half of this year.</p><p>To start the process, you can go to <a href=\"https://www.starlink.com/\">Starlink's website</a> and enter your email and service address. The overall cost is $499 for hardware, $50 for shipping and handling, and $99 for monthly service, plus tax. These are the <a href=\"https://arstechnica.com/information-technology/2020/10/spacex-starlink-public-beta-begins-its-99-a-month-plus-500-up-front/\">same prices</a> charged in the ongoing beta, which is limited to parts of the northern United States and southern Canada.</p><p>\"Starlink is targeting coverage in your area in mid to late 2021,\" the preordering system says. \"Availability is limited. Orders will be fulfilled on a first-come, first-served basis. You will receive a notification once your Starlink is ready to ship.\"</p><p>We've gotten the same \"mid to late 2021\" timeframe for addresses in Arizona, California, Illinois, Massachusetts, North Carolina, Texas, Virginia, and Washington State. A <a href=\"https://www.cnbc.com/2021/02/09/spacexs-starlink-accepting-99-preorders-as-musk-considers-ipo.html\">CNBC report</a> said that preorders for some areas are showing availability in 2022 instead.</p><p>The $99 due upon preordering is fully refundable, and \"you can initiate a refund of your deposit by logging into the Customer Account Portal and requesting a refund,\" the website says. Unfortunately, placing a preorder does not guarantee that you will get Starlink.</p><p>\"Depending on location, some orders may take 6 months or more to fulfill. Placing a deposit does not guarantee service,\" the website said.</p><p>You'll get a message like this if you successfully place an order:</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/starlink-order-confirmation.jpg\" data-height=\"875\" data-width=\"1600\" alt=\"A Starlink order confirmation (we cut out the bottom part with the service address and number).\"><img alt=\"A Starlink order confirmation (we cut out the bottom part with the service address and number).\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/starlink-order-confirmation-980x536.jpg\" width=\"980\" height=\"536\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/starlink-order-confirmation.jpg\" data-height=\"875\" data-width=\"1600\">Enlarge</a> <span>/</span> A Starlink order confirmation (we cut out the bottom part with the service address and number).</p></figcaption></figure><h2>Customer limits</h2><p>SpaceX is setting limits on how many people can sign up in each geographic area, likely to ensure that it has enough <a href=\"https://arstechnica.com/tech-policy/2021/02/isps-step-up-fight-against-spacex-tell-fcc-that-starlink-will-be-too-slow/\">capacity</a> for each customer. \"Starlink is available to a limited number of users per coverage area at this time,\" the ordering website says.</p><p>While preorders appear to be for Starlink's general availability later this year, the company also seems to be expanding the number of slots in the beta.</p><p>\"Additional Starlink capacity is now available to a limited number of users per coverage area,\" SpaceX said yesterday in an email sent to people who had previously registered interest on the website. \"If service is not currently available in your area, you can place a deposit to hold your place in line for future service.\"</p><p>The email repeated SpaceX's previous guidance about the beta, which is that \"users can expect to see data speeds vary from 50Mbps to 150Mbps and latency from 20ms to 40ms in most locations over the next several months as we enhance the Starlink system. There will also be brief periods of no connectivity at all.\"</p><p>Presumably, service will be faster and more reliable once it's made available to people who submit preorders. \"Starlink is now delivering initial beta service both domestically and internationally, and will continue expansion to near global coverage of the populated world in 2021,\" the website says.</p><p>SpaceX CEO Elon Musk <a href=\"https://twitter.com/elonmusk/status/1359027355851841536\">said on Twitter</a> this week that SpaceX will do a Starlink IPO \"once we can predict cash flow reasonably well.\"</p></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4ad649e8321bb2cbdd5acfcc6470f8fadd5df36728e7d3ab88923033e138b1de","category":"Tech"}