{"title":"Reddiyo Dynamic Platform provides fine-tuned training for every rider","link":"https://bikerumor.com/2021/07/02/reddiyo-training/","date":1625229001000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>Training can be complicated. Chances are, meeting your goals of becoming a blazing fast rider on the road, gravel, or trail will require immensely different workouts to fine-tune your skills.</span></p><p><span><a href=\"https://reddiyo.com/\" target=\"_blank\" rel=\"noopener\">Reddiyo</a>, a new mobile, dynamic training app, hopes to give every rider the understanding they need to gain an edge in their training to reach new peaks on the bike.</span></p><h2>The Reddiyo System</h2><p><span><iframe width=\"696\" height=\"392\" data-ezsrc=\"https://www.youtube.com/embed/1j2OFGJ2az4?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\" ezoid=\"0.6016923144977724\"></iframe></span></p><p><span>Reddiyo uses rider-input to build custom-tailored plans to help riders get the most out of their training.</span></p><p><span>The app relies on riders to input data about their current fitness level and goals. It then uses algorithms to build out personalized workout plans that change with the rider. Rather than relying on a one-size-fits-all approach, Reddiyo tinkers with training plans based upon rider ability, goals, personal schedules, and stress levels to coach riders to stronger performance.</span></p><p><span>We all stumble from time to time during training. It can be disheartening to begin falling behind on weekly or monthly training plans, and the risk of injury can increase when riders begin working too hard to catch up to meet goals.</span></p><p><span>The dynamic nature of Reddiyo’s program means that a rider’s training schedule can adjust, and recommend changes based on progression, or missed workouts. For those who aren’t interested in having a ghost coach in the machine, or anti-algorithm athletes, Reddiyo also includes a catalog of workouts that can be cherry-picked and tackled however and whenever a rider wants.</span></p><h2>Compatability</h2><p><span>Users can upload data using fitness trackers, mobile apps, or cycling computers. Reddiyo can also pull data directly from Garmin, Wahoo, Suunto, or Polar devices, or via TCX and FIT files to gain a clear picture of a rider’s fitness levels and training needs.</span></p><p><span>The app is available in the Google Play and Apple App stores for $14.99 a month, after a free trial. While it is currently only tailored to cyclists, developers plan to expand to other endurance disciplines in the future. The app is also accepting inquiries from cycling coaches interested in helping develop an interface in which coaches can guide their riders.</span></p><p><span>“Athletes want a better understanding of how they are progressing and what they need to do to optimize performance. Not everyone wants to spend precious time researching the science and technology to support training at the highest levels,” said Craig Martin, Reddiyo’s CEO. “We developed Reddiyo to serve these riders.”</span></p><p><a href=\"https://reddiyo.com/\" target=\"_blank\" rel=\"noopener\"><em>reddiyo.com</em></a></p></div></div>","author":"Sean McCoy","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"4aeb1b1f29dbc1839f97a2344ceefc891b94799e936ab618874c1f5f918abbda","category":"Cycling"}