{"title":"Meet Red Walters, the Geoghegan Hart-funded stagiaire at Axeon","link":"https://cyclingtips.com/2021/08/meet-red-walters-the-geoghegan-hart-funded-stagiaire-at-axeon/","date":1628205307000,"content":"<div><div><p>Hagens Berman Axeon announced on Thursday that Red Walters is set to join the team as a stagiaire for the remainder of the season after he was awarded the spot on the team that <a href=\"https://cyclingtips.com/2021/06/tao-geoghegan-hart-invites-applications-for-the-axeon-roster-spot-he-is-funding/\" target=\"_blank\">Tao Geoghegan Hart is sponsoring</a> in an effort to increase diversity and inclusion in cycling.</p><p>Walters, 22, has raced at the club and Continental level so far in his young career. He has a strong kick and is hoping to continue to develop as a sprinter as he eyes a potential future in the pro ranks.</p><p>Based in the south of England, Walters is a dual British and Grenadian citizen, and he recently switched his UCI registration to Grenada. He is set to compete in the Pan-American Games next week before heading to Continental Europe to start racing with Hagens Berman Axeon. There, he will have several chances to race alongside both other promising youngsters as well as some of the sport’s top names in his final year as an under-23 racer.</p><p>“I think the number one thing, without a doubt, is just to get the experience and the amount of knowledge that I could accrue just from a handful of races will be really valuable,” Walters told CyclingTips on Thursday. “I just want to be like a sponge and soak up as much as possible.”</p><p>Walters took up cycling relatively late, at the age of 17. Since then, however, he has progressed rapidly as a racer with promising results on both the road and the track. He spent time at the Continental level with Vitus in 2019. He then rode with the Nopinz Symec Race Team for part of the 2020 season before joining the club team of the Black Cyclists Network.</p><p>“The whole thing with diversity in cycling being pretty minimal, their whole outlook is to help increase diversity, and I just thought it would be really awesome to do whatever I can to help promote diversity and inclusion in the sport,” he said. “I joined for the end of 2020, I did a few hill climbs, I won the regional hill climb championship, which is funny because I’m quite a heavy guy, so that was a bit of a joke with my friends. And then [this year] I stayed with Black Cyclists Network while I was in the UK.”</p><p>Working with the Black Cyclists Network, which works to promote cycling from Black and Minority Ethnic (BAME) backgrounds, will continue to be priority for Walters moving forward.</p><p>“My aim is to still be, I guess you could call it an ambassador, where I’m not racing for them but I’m definitely going to be connected with them and promoting each other, doing what I can to help,” he said.</p><p>Walters recently spent time with the French club-level CC Plancoet team, where he had an opportunity to get more experience racing in Europe. Alongside his progression on the road, he has also done some racing – and had success – on the track. He says he biggest moment so far in his young career was riding to second in the under-21 Madison event at the London Six-Day in 2019.</p><p>“That was the year of Vitus, I hadn’t had that many great results or opportunities, and we got second there,” he said. “We were actually the first team to take a lap. That moment of taking a lap, with the crowd, it was almost the full London Six-Day crowd, that was just probably the number one moment for me in the cycling career so far.”</p><p>Walters got the nod to join the Hagens Berman Axeon team after applying for a spot that was announced earlier this year. A friend told Walters about the post that Geoghegan Hart had written on social media, and Walters decided to reach out.</p><p>“I saw Tao saying that there’s a problem with diversity and him pledging to actually do something, which is awesome,” Walters said. “Regardless of me getting the spot, I think that’s massively commendable from him to actually take action when a lot of the elite side of cycling, there’s a lot being said, or even not a huge amount being said, but almost nothing being done, actions being taken. That’s, from my point of view, massive that he’s actually gone out of his way to actually commit to doing something. So I messaged him, I messaged Axel, and they were like, ‘Okay, send over your CV.’</p><p>“I put together what was – it was too long – I put together this email that was I can’t remember how many paragraphs. It probably would have taken five or 10 minutes to read through properly. It was a bit ridiculous and overkill but I was so keen and motivated, I sent everything about myself, basically a little biography. And a couple months later, keeping in touch about the racing I was doing, I still hadn’t raced <em>that</em> much over the last 12 months up to that point, so I was trying to tell them when I’d be able to get racing and stuff and giving them updates. And when I did eventually go over [to France], luckily I ended up winning the first few races I did, so I was able to show that as I’m over here, I’m racing, I’m winning straight away.”</p><p>Before long, Walters got word from Hagens Berman Axeon that he had been selected to join the team.</p><p>“I was over the moon. Especially because I’d tried so so hard at the end of last season to get a spot on a team that would have this sort of opportunity,” he said. “With UCI [racing], especially under-23, the big goal of mine was just to race at that level at some point this year, being my last year at under-23.</p><p>“I’d sent probably over 200 emails to various UCI Continental teams and elite level teams. I would say every single manager from a UCI Continental team in Europe and America will have at least one, probably three emails from me, at some point last yer. I was so keen. It was a tough pill to swallow that I wouldn’t actually be able to do any of those races this year. Coming back to now, when he told me that I actually <em>would</em> be able to do it, it was just so amazing. I can’t even explain. A lot of relief, but just so excited to actually be able to have that opportunity to do those kinds of races.”</p><p>After racing the Pan-American Games, Walters is hoping to get his start with Hagens Berman Axeon at the UCI 1.1-rated Druivenkoers-Overijse on August 24, assuming everything goes according to plan with travel amid the pandemic. The ProSeries Brussels Cycling Classic is also on his provisional calendar, as is the Flanders Tomorrow Tour, a stage race for U23 riders.</p><p>“I just want to see what I can do, see where I sit, and help out the team,” Walters said. “Learn as much as possible, and if I can be helpful to the team, that would be amazing. I hope I can. I’m at the best form I’ve ever been probably. I guess we’ll see what happens. Having never raced at that level, it’s difficult to say how it will be.”</p><p>Looking a bit further down the road, he is hopeful that he will have a chance to catch the attention of a ProTeam or a WorldTeam, with an eye towards his longer term goal of making it into the WorldTour ranks.</p><p>“Longterm, absolutely, I really want to get to being in a WorldTour position,” he said. “And I guess ideally, all things being great, I’d like to progress from a personal level to actually be able to compete in WorldTour races. Not just be in them, but doing well in them. That’s the longterm goal. From a progression point of view, I’m super, super stoked on progression. That’s always been my main determinant of how I’m going. I’m always looking at where I am now versus last year, and I’m still progressing at, I’d say, a pretty good rate year on year. Hopefully I can just keep it going as it has been really, and see where it takes me.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4b414c0d75f9621a4db88683ab8f956d5ea9b0c0d8c5ee29bcfc15456cfb8491","category":"Cycling"}