{"title":"Tirreno-Adriatico 2021 Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico-2021-preview","date":1614626639000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>Taking place in Italy, Tirreno-Adriatico is a WorldTour stage-race that usually&nbsp;takes place in March. This year's event will start on the 10th of March and end on the 16th, and will occur between the Tyrrhenian and Adriatic Seas. Therefore, Tirreno is often known as “The Race of the Two Seas”.</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><span></span><span>The 2020 edition was postponed due to the global pandemic meaning the race took place in September, just ahead of the Giro d’Italia which was also delayed. It was a British one-two on that occasion with Simon Yates and Geraint Thomas ahead of Rafal Majka in third.&nbsp;</span></p><p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related – The 2021 Men's Early Season: The Rouleur Racing Guide</a>&nbsp;<br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">Related –&nbsp;</a></strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\"><strong><span>The Women's 2021 Early Season: The Rouleur Racing Guide</span></strong></a></em></p><p><span>The winner of the race is handed a large trident as a trophy. This is in relation to Neptune, the God of the Seas, an ode to the race’s sea-to-sea format.</span></p><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032486-034_1024x1024.jpg?v=1614614146\" alt=\"Simon Yates\"><em>Simon Yates holding the trident trophy after winning Tirreno-Adriatico 2020&nbsp;</em></span><em><span>(Image credit: Robert Bettini/Cor Vos)</span></em></p><h4><span>Route</span></h4><p><span>The first stage of the race starts and ends in Lido di Camaiore. Despite three short climbs early on in the stage it is mostly flat and will be a sprint-finish. Stage two is over 225km in length and features the first uphill finish of the race to Chiusdino, a climb of 7.6km and 3.5%. Stage three, although also uphill to the line, is not quite as testing so could be won by a sprinter or puncher.</span></p><p><span>Stage four is undoubdtedly the queen stage in Italy. The riders first must conquer the Passo Caponelle (12.7km @ 4.6%), before running downhill to the foot of the Prati di Tivo. The race then heads up the climb for 15 kilometres at a gradient of 7%. This is the notable opportunity for the climbers to assert their dominance in the general classification.</span></p><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Stage4_1024x1024.png?v=1614614216\" alt=\"Stage 4 Tirreno Adriatico\"></span></p><p><i><span>Stage 4 of Tirreno-Adriatico 2021 (Credit: La Flamme Rouge)</span></i></p><p><span>Although stage four will serve the first major GC shake-up, stage five could well&nbsp;disrupt&nbsp;the field further. The riders will start in Castellalto before travelling up the coast of the Adriatic Sea. A finishing circuit in and around Castelfidardo is where the action will transpire. The main climb around the circuit, which will be taken on four occasions, is 1.6km @ 9.1% — short yet very, very steep. Anyone who has lost time to this point may look to blow up the stage early.</span></p><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Stage5_1024x1024.png?v=1614614245\" alt=\"Stage 5 Tirreno Adriatico 2021\"></span></p><p><i><span>Stage 5 of Tirreno-Adriatico 2021 (Credit: La Flamme Rouge)</span></i></p><p><span>Stage six includes just 1,600 vertical climbing meters, therefore a mass-sprint is the most likely outcome. Stage seven is the final stage and the only time-trial at Tirreno in 2021. Although only 11km, this could well swing the tide in the GC.</span></p><h4><span>Contenders</span></h4><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/WVA_1024x1024.jpg?v=1614614302\" alt=\"Thibaut Pinot \"></span><i><span>(Image credit: ASO/Alex Broadway/SWPix)</span></i></p><p><span>Tirreno-Adriatico is generally the first chance to see the Giro d’Italia contenders go up against one another. <span>Tao Geoghegan Hart</span>, the winner of the maglia rosa last year, will instead head to the Tour de France and therefore will not be at Tirreno either. Despite that, we will see a multitude of strong contenders on the startline.</span></p><p><span>The INEOS Grenadiers will arrive at both Tirreno and the Giro with Egan Bernal acting as their prime protagonist, backed-up by the very talented Pavel Sivakov. Filippo Ganna also starts for the Grenadiers, he will attempt to win yet another time-trial on stage seven.</span></p><p><span>Simon Yates won Tirreno-Adriatico last season and returns this year. This put him in good stead to challenge for the Giro d’Italia, however, a positive COVID-test put pay to his chances. Nonetheless, Yates is one of the best pure climbers in the world when on-form and will again enter as one of the major favourites to win the trident and blue jersey.</span></p><p><span>After a dismal 2020 Tour de France, Thibaut Pinot has instead turned his head to the Italian races for 2021. His calendar is headlined by the Giro d’Italia and Tirreno-Adriatico. Pinot slowly worked his way into the season at the Tour des Alpes Maritimes et du Var where he acted as a domestique throughout. But Pinot will be keen to demonstrate improved form ahead of the Giro. There is no better place to do so than Tirreno.</span></p><p><span>Tadej Pogačar&nbsp;</span><span>is set to ride Tirreno-Adriatico for the first time in his budding career. The reigning Tour de France champ, although&nbsp;returning to the Tour instead of the Giro, has already displayed fantastic form this season when he won the UAE Tour. He starts as a favourite with Rafal Majka and Davide Formolo&nbsp;riding in support.</span></p><p><span>The World Champion also starts in Italy. Whether Julian Alaphiliippe will look to go for the overall classification or not is questionable, but one thing can be certain — he will be one of the most active riders in the race. The stage four climb on the Prati di Tivo is the big question mark for the Frenchman, though his effort on Mont Ventoux at the Tour de la Provence says otherwise. We wait for news on Remco Evenepoel, who has returned to regular training riders after crashing at Il Lombardia last season. He still plans on being in-shape to challenge for the Giro.</span></p><p><span>After making his season debut at Strade Bianche, Wout Van Aert now has a genuine chance of winning Tirreno-Adriatico. Without Roglic, Kuss or Kruijswijk on the startline, WVA will be let off the leash to either chase stage wins or make a run at the GC. He’d have liked a longer time-trial, but that doesn’t mean he’s not a contender. His young teammate Tobias Foss could also be one to watch.</span></p><p><span>The strength in quality at Tirreno-Adriatico this year is bewildering. Other riders that could well have a chance include Jakob Fuglsang, Mikel Landa, Emanuel Buchmann, Vincenzo Nibali and two-time winner Nairo Quintana.</span></p><p><b>Favourites: </b><span>Egan Bernal, Tadej Pogacar, Simon Yates</span></p><p><b>Outsiders</b><span>: Pavel Sivakov, Wout van Aert, Emanuel Buchmann, Tobias Foss</span></p><p><i><span>Cover image: Tommaso Pelagalli/Bettini/Cor Vos</span></i></p></div></div>","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4bce31e9305fa020b2b9e063bedd728d774b3c249d1ba5b12769e4dc4a0f5c8a","category":"Cycling"}