{"title":"Opinion: SD Worx are cycling's new super squad","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/sd-worx-super-squad","date":1616678635000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>March 25, 2021</span></p><p><span>SD worx are on fire, and so far this season few teams have managed to put out their flames.</span></p></div><div><p><span>While much was made before the start of the season of the fact that the talent within the women’s peloton seemed to be spread evenly among the teams, a glance at the results so far would reveal an entirely different picture.&nbsp;</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><span>The Dutch-registered team SD Worx have won six races with as many riders including the first round of the Women’s World Tour at Strade Bianche with Chantal van den Broek-Blaak.</span></p><p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">Related – The women's racing season: The Rouleur Guide</a></strong></em></p><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Italy_Photo_Press_1015464_1024x1024.jpg?v=1615909349\" alt=\"\"></p><p><em><span>Chantal van den Broek-Blaak's winning move on the Santa Caterina climb at Strade Bianche</span></em></p><p><span>The first sign of any weakness from the team came last Sunday at Trofeo Alfredo Binda where they missed the crucial move when Trek-Segafredo’s tactics allowed Elisa Longo Borghini to solo to victory. However on the same day, at Omloop van de Westhoek in Belgium, Christine Majerus and Amy Pieters took the sting out with an impressive 1-2 from a breakaway.&nbsp;</span></p><p><span>Trek-Segafredo seem to be the only team able to come close to matching SD Worx’s strength in numbers. Last season, they clinched the Women’s World Tour team’s classification thanks to an impressive total of points </span><span>—</span><span> including three World Tour wins from Lizzie Deignan. Boels-Dolmans </span><span>—</span><span> as they were at the time </span><span>—</span><span> had to settle for second place for the first time since the classification’s inception in 2016.&nbsp;</span></p><p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/less-is-more-the-men-can-keep-their-clashing-calendar\"><em><strong>Related – Less is more: The men can keep their&nbsp;clashing&nbsp;calendar</strong></em></a></p><p><span>After the team’s contract with long-time title sponsors Boels Rentals and Dolmans Landscaping came to an end at the end of 2020, they have returned this season with new sponsors and a few new faces but with the same winning formula of years gone by.&nbsp;</span></p><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_9803_1024x1024.jpg?v=1616600105\" alt=\"\"></p><p><em><span>Photo credit: Alex Whitehead/<span>SWPix.com</span></span></em></p><p><span>Their tactics are no secret, the team use the fact that they are a squad composed of multi-talented athletes who are each capable of winning on any given day and send attack after attack off the front of the race. The key to thwarting this numbers game, however, is yet to be cracked by most teams who either don’t have the strength in numbers, or the coherence to match them.&nbsp;</span></p><p><span>But&nbsp;SD Worx are a force to be reckoned with&nbsp;not because&nbsp;of a bloated budget allowing them to buy up the best of the talent. Rather, the team’s edge lies in the unity between the riders. That they are capable of tempering the ambitions and egos of multiple current and former world and national champions on the same team is down to the shrewd tactical nous of lead Sports Director, Danny Stam. The Dutchman </span><span>manages to curate an environment within the squad where even world champions are willing to sacrifice themselves for a team result.</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Subscribe to our women's newsletter to receive</span></p><p><span>a weekly complement of racing, gear and cycling</span></p><p><span>culture focussed on women</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><span>The success of the team dates back as far as 2013. After a few years as a Dutch-only squad, Boels-Dolmans began to sign international talent that year, including a 25 year-old Lizzie Deignan. The following year, 2014, the team also signed the world time trial champion at the time, Ellen Van Dijk, who went on to win Flanders that season while Deignan took the World Cup (as it was at the time) overall.&nbsp;</span></p><p><span>For 2015 the team added even more fire power in the form of van den Broek-Blaak, Amalie Dideriksen and talented latecomer to the sport, Evelyn Stevens. That year, Deignan won both the British national championships and then world title in Richmond, Virginia. At the same world championships the team came second in the now-defunct World Team Time Trial Championships, a title they went on to win the following year.&nbsp;</span></p><p><em><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GA4R9874_1024x1024.jpg?v=1616599787\" alt=\"\"></span></em></p><p><em><span>Photo credit: Alex Whitehead/<span>SWPix.com</span></span></em></p><p><span>With a largely unchanged squad </span><span>— </span><span>barring a few departures </span><span>— </span><span>2016 was stronger still. Evelyn Stevens, in her final season,&nbsp;came second overall to an unstoppable Megan Guarnier at the Giro Rosa. While the rainbow jersey swapped from one&nbsp;</span><span>Boels-Dolmans</span> rider, Deignan, to another, 20 year-old Amalie Dideriksen. This marked the start of four years of successive world champions within the team, with van Den Broek-Blaak in 2017 and Anna van der Breggen in 2018.&nbsp;</p><p><span>Now, after a few fallow seasons </span><span>— by their standard —</span><span> between 2019 and 2020 plus a dominant start to 2021, the team appear to have picked up where they left off in 2018. The question remains for the rest of the peloton: how do you beat a squad like SD Worx?</span></p></div></div>","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4c388d8ecdf090fec3d40e2370d66b8bdfcae9d3bef494fab19daa2fb8659e96","category":"Cycling"}