{"title":"Wahoo Speedplay pedals: All you need to know","link":"https://www.cyclist.co.uk/wahoo/9360/wahoo-speedplay-pedals","date":1615375728000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Speedplay founder Richard Bryne is said to have such a passion for bicycle pedals that he has a personal collection of well over 300 pairs, none of which, however, look like the ones he actually designed and created back in the late 1980s.</p><p>Often referred to as the ‘lollipop pedals’, Speedplay launched in 1991, but the design wasn’t an instant hit.</p><p>Their form was based entirely on solving the cleat-pedal interface from an engineering standpoint, rather than paying lip service to trends and/or predisposition over how a pedal ‘ought’ to look.</p><h4>Watch: First look at the new Wahoo Speedplay pedals</h4><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/gwFekvNTzIg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe><p>But the pedal’s diminutive size raised questions over whether it could offer sufficient support, compared to the much larger platforms used by all its competitors.</p><p>Those doubts were quashed in the early 2000s thanks to Speedplay’s involvement with Team CSC and subsequently the Cervelo Test Team. Riders like Fabian Cancellara and Jens Voigt both achieved many great successes on the pedals which helped the ‘lollipops’ gain credibility.</p><p>The key to Bryne’s design was to turn the accepted norms for the pedal-cleat interface on their head. The Speedplay cleat is not just an arbitrary lump of plastic, but instead harbours all the working gubbins. The pedal, in this case, is the more inanimate object.</p><p>The design is characterised by its double sided entry, exceptionally low weight (from just 84g per pedal), low stack height and crucially too the fact it offers a vast range of adjustment potential (anywhere from 0-15° float, plus also variable axle lengths, cleat stack adjusters etc) – the latter making them a firm favourite with bike fitters.</p><p>US tech giant Wahoo purchased Speedplay in late 2019 and has recently relaunched the entire range.</p><p>‘The focus has been on keeping all the good stuff that Speedplay is renowned for, while enhancing reliability and durability, as well as simplifying the product choices,' says Product Leader, Cory Pittman.</p><p>Essentially that increased reliability and durability boils down to much improved bearing seal quality (thank goodness, all Speedplay users rejoice), plus more metal (stainless steel) being used in the redesigned pedal body, specifically in those areas where the cleats contacts, for increased resistance to wear.</p>&nbsp;<p>Another useful improvement is the move to an 8mm Allen key for pedal fitment, as the old Speedplay design required a 15mm spanner. Not only is this far more practical, it also allows the axle to look so much cleaner when the pedals butt up against the crank.</p><p>The choice of pedals has been made much simper by a more condensed range, with clearer differences between the models, plus the fact the cleat is now the same across the board, meaning there’s no longer any confusion over compatibility.</p><p>A neat touch is that the original Speedplay pedal had what the brand called ‘bow-ties’, the shaped metal plates used for the cleat engagement, and Wahoo has cleverly integrated this shape into the styling of the new pedals bodies too.</p><p>Look closely around the pro peloton and you’ll still see plenty of riders using Speedplays. As already mentioned they are incredibly light and can be used to solve a good number of fit-related issues.</p><p>Now Wahoo has taken the helm we can only assume we will see Speedplay gaining more traction again going forward and if we were to polish up our crystal ball, knowing what Wahoo is capable of in the high-tech smart trainer sector, we wouldn’t be surprised if it was planning a version of the pedal that houses a power meter somewhere down the line too.</p>&nbsp;<p>Currently the new range has four models, beginning with the Zero CroMoly (116g) version at £134.99. The 111g Zero Stainless (pictured here) costs £199.99, while a titanium axled Nano version weighing just 84g per pedal and costs £379.99.</p><p>Finally there’s a single-sided aero version (with a sculpted underside that forms a slick aero shape with the cleat) at £239.99. Replacement Speedplay Cleats cost £49.99</p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"4c9a45f5638668ca3f5af018583c24aae9dddb6b18ea06b83ecd6a325b170222","category":"Cycling"}