{"title":"Apple bent its rules for Russia—and other countries will take note","link":"https://arstechnica.com/?p=1750966","date":1616234743000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>What dictators like —</h4><h2 itemprop=\"description\">Russian iPhone buyers soon to see prompts to install software developed in Russia.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/iphone-apple-store-800x534.jpg\" alt=\"Apple bent its rules for Russia—and other countries will take note\"><figcaption><p>SOPA Images | Getty Images</p></figcaption></figure><p>Beginning in April, new <a href=\"https://www.wired.com/tag/iphone/\">iPhones</a> and other iOS devices sold in Russia will include an extra setup step. Alongside questions about language preference and whether to enable Siri, users will see a screen that prompts them to install a list of apps from Russian developers. It's not just a regional peculiarity. It's a concession Apple has made to legal pressure from Moscow—one that could have implications far beyond Russia's borders.</p><p>The law in question dates back to 2019, when Russia dictated that all computers, smartphones, smart TVs, and so on sold there must come preloaded with a selection of state-approved apps that includes browsers, messenger platforms, and even antivirus services. Apple has stopped short of that; the suggested apps aren't pre-installed, and users can opt not to download them. But the company's decision to bend its rules on pre-installs could inspire other repressive regimes to make similar demands—or even more invasive ones.</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/wired-logo.png\" width=\"218\" height=\"58\"></figure><p>“This comes within the context of years and years of mounting regulatory pressure on tech companies\" in Russia, says Adrian Shahbaz, director for democracy and technology at the human rights nonprofit Freedom House. The country has undertaken a massive effort to reshape its Internet toward <a href=\"https://www.wired.com/story/russia-Internet-control-disconnect-censorship/\">mechanisms for control</a>, <a href=\"https://www.wired.com/story/opinion-russias-failure-to-throttle-twitter-isnt-a-sign-of-weakness/\">censorship</a>, and <a href=\"https://www.wired.com/story/opinion-the-russian-doll-of-putins-Internet-clampdown/\">mass surveillance</a>. And the government has imposed increasingly strict regulations on domestic tech companies. “They must store data on local servers, provide security agencies with decryption keys, and remove content that violates Russian law,\" Shahbaz says, though not all companies do all of those things. \"And now they’re being forced to promote government-approved apps on their platforms.\"</p><p>The pre-installed apps law came to be <a href=\"https://thebell.io/zakon-protiv-apple-novye-ogranicheniya-mogut-zastavit-kompaniyu-ujti-iz-rossii\">known as</a> the \"law against Apple,\" because it essentially dared Apple to pull out of the Russian market entirely rather than change the rules in the company's controlled iPhone ecosystem. Instead, Apple has carved out an exception that others, including Android manufacturers, have not. Google, which develops the open source Android mobile operating system, doesn't manufacture most of that platform's hardware directly, and it doesn't control which apps come pre-installed on third-party devices. (Google does make the Pixel phone but doesn't sell it in Russia.)</p><p>Mikhail Klimarev, executive director of the Internet Protection Society, a Russian nongovernmental organization, says he believes the pre-installed apps law has a dual function for the Kremlin. It creates an opportunity to promote apps that the country can surveil and control, while also allowing the government to manipulate the tech market. The law will penalize and fine any vendor who sells noncompliant computers and smartphones rather than the manufacturers who made them—unless, of course, the company also sells their products directly in Russia, as Apple does.</p><p>“The fact is that the responsibility for the violation is imposed not on the vendor, but on the retailer,\" Klimarev says. “In this case, the law [will be used] to destroy small sellers. And then the big distributors will raise their prices. In Russia a lot of absurd laws have been adopted lately, which are technically impractical.”</p><p>The situation with Russia's mandatory apps is not the first time Apple has faced invasive legal requirements from an authoritarian government—nor the first time the company has conceded to these demands. Notably, to continue operating in China, Apple agreed to use a domestic cloud provider to store its Chinese customers' iCloud data and encryption keys. And Apple removes apps from its Chinese iOS App Store when the government demands. The accommodation for Russian apps during setup, though, is a new frontier in Apple's interactions with repressive governments.</p><p>“This is part of a broader trend we’ve seen in countries like Iran, Turkey, and India,” Freedom House's Shahbaz says. “Authorities are channeling frustration with popular foreign apps while promoting domestic equivalents where data and speech are more tightly controlled by the government. It’s a bait-and-switch.”</p><p>From both an economic and national security standpoint, it's understandable to a degree that governments would want to promote domestic software to their own citizens. But in practice, the Internet's growing balkanization is <a href=\"https://www.wired.com/story/Internet-freedom-covid-19-2020/\">eroding Internet freedom</a> worldwide and undermining the entire concept of a decentralized, global web.</p><p>Apple's plan still leaves multiple opportunities for users to remove government-imposed apps, but promoting them during setup will inevitably result in broader distribution of Russia's chosen software. The apps aren't specifically developed by the government, but the Kremlin, like many authoritarian governments, has extensive reach within its Internet ecosystem. Broader distribution of its favored apps could result in expanded government access to Russian user data and personal information, or even situations where the government tracks which devices are using certain apps and which have removed them.</p><p>Questions remain about whether <a href=\"https://www.wired.com/story/russia-Internet-control-disconnect-censorship/\">Russia's end goal is to completely isolate and disconnect its Internet</a> from the wider world or whether the government prefers a hybrid network. But from the Kremlin's perspective, the opportunity to promote certain apps on iOS is a boon either way.</p><p>Apple could have simply allowed Russia to pre-install whatever apps it wanted on iOS devices, but the company also could have taken a radical stand against such interference. Instead, it found a middle ground, one that other countries may well seize on to suit their own autocratic interests.</p><p><em>This story originally appeared on <a href=\"https://www.wired.com/story/apple-russia-iphone-apps-law/\">wired.com</a>.</em></p></div></div></div>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"4ccc362bf2b277e64cb48b4a57f1f6f4591c40237e2b9979d339d1bf692d9aba","category":"Tech"}