{"title":"Ambulance services not impeded by cycle lanes, research shows","link":"https://www.cyclist.co.uk/news/9237/ambulance-services-not-impeded-by-cycle-lanes-research-shows","date":1613140244000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Ambulance services do not believe they are impeded by new cycle lanes, research has shown.</p><p>A series of Freedom of Information requests to all ambulance trusts in England, Scotland and Wales by charity Cycling UK revealed none were against new cycle lanes and a third showed strong support because of the associated public health and road safety benefits.</p><p>It comes in response to claims by the <em>Daily Mail</em> and <em>The</em> <em>Telegraph</em> that new lanes had caused delays to ambulances on blue lights. Cycling UK's research found no evidence of this occuring.</p><p>Duncan Dollimore, head of campaigns for Cycling UK, said: 'Following our investigation and the positive responses we've received from the UK's ambulance trusts, I am both pleased and relieved to slay these myths.</p><p>'Survey after survey has shown the majority of the UK supports safer cycling and walking facilities, and Cycling UK would encourage councils to continue their good work and not let baseless allegations deter them from building a safer, healthier and greener future for us all.'</p><p>The investigation contacted 12 trusts, with three unable to respond. Only one, East of England Ambulance Trust, reported any concern which involved a barrier-controlled access to a pedestrian area in Cambridge. Upon further investigation the barrier was likely installed in 2018 for counter-terrorism purposes.</p><p>Four of the trusts expressed support for new cycling and walking infrastructure: South Central Ambulance Service, Yorkshire Ambulance Service, East Midlands Ambulance Service and London Ambulance Service.</p><p>'The trust does not support withdrawing funding for active travel measures,' the London Ambulance Service said.</p><p>'The trust also engages extensively with the boroughs and Transport for London to ensure changes and traffic schemes (to reduce traffic congestion, improve air quality and road safety, and promote active travel) reflect our operational needs as an ambulance service.'</p><p>For more information on Cycling UK, the national cycling charity, visit <a href=\"https://www.cyclinguk.org/\" target=\"_blank\">cyclinguk.org</a></p></div></div>","author":"wstrickson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"4cf5a541304dfa3442fd2414c3fab7f5d279ef452228d89f6fd5333f0f010a4e","category":"Cycling"}