{"title":"รมต. แรงงาน เผยเตรียมออกซิมแรงงาน ซิมเน็ตราคาถูกจาก NT ให้ใช้เรียนทักษะบนออนไลน์","link":"https://www.blognone.com/node/121815","date":1616405528000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/2000px-Flag_of_Thailand.svg_.png?itok=1gSHSqWY\"></p><div itemprop=\"description\"><p>จากประเด็น <a href=\"https://www.blognone.com/node/121814\">กรมพัฒนาฝีมือแรงงาน เตรียมนำคอร์สเรียนไมโครซอฟท์ฉบับแปลไทย 51 หัวข้อ มาให้เรียนออนไลน์ฟรี</a> ศาสตราจารย์ นฤมล ภิญโญสินวัฒน์ รัฐมนตรีช่วยว่าการกระทรวงแรงงาน ระบุเพิ่มเติมถึงแนวทางช่วยเหลือประชาชนให้เข้าถึงเนื้อหาเรียนออนไลน์ เป็นซิมแรงงาน ซิมอินเทอร์เน็ตราคาถูก โดยร่วมมือกับบริษัท <a href=\"https://www.blognone.com/node/120417\">National Telecom Public Company Limited หรือ NT ที่เกิดจากการควบรวมของ TOT และ CAT</a></p><p>ศาสตราจารย์ นฤมล ระบุว่า การเข้าถึงเนื้อหาออนไลน์จำเป็นต้องใช้อินเทอร์เน็ต ที่อาจเป็นภาระค่าใช้จ่ายกับประชาชน จึงร่วมมือกับ NT เตรียมออกซิมแรงงาน เบื้องต้นราคาวันละ 2 บาทให้ประชาชนใช้งาน โดยจะจัดแถลงข่าวให้ประชาชนทราบในช่วง 2 สัปดาห์นี้</p><p>ศาสตราจารย์ นฤมล ยังบอกด้วยว่า มีความคาดหวังที่จะได้เห็นแพลตฟอร์มกลางเชื่อมระบบไปยังหน่วยงานอื่นได้ โดยตอนนี้อยู่ระหว่างหารือกับ กรมจัดหางาน ประกันสังคม กรมอาชีวะศึกษา เป็นต้น เพื่อให้ทุกฝ่ายรับทราบข้อมูลเกี่ยวกับการหางาน และการเพิ่มทักษะวิชาชีพได้ในแพลตฟอร์มเดียวกัน เป็นบริการเพื่อแรงงานครบวงจร</p><p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/3bc0b2c96655f3683730c959193d0cdf.jpg\"><em>เรียงจากซ้าย นายธวัช เบญจาธิกุล อธิบดีกรมพัฒนาฝีมือแรงงาน, ศาสตราจารย์ นฤมล ภิญโญสินวัฒน์ รัฐมนตรีช่วยว่าการกระทรวงแรงงาน, นายธนวัฒน์ สุธรรมพันธ์ กรรมการผู้จัดการใหญ่ ไมโครซอฟท์ ประเทศไทย</em></p><p>ภาพจาก <a href=\"https://www.facebook.com/DrNarumonP/\">Facebook ศาสตราจารย์ นฤมล ภิญโญสินวัฒน์</a></p><p>ที่มา - งานแถลงข่าว</p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"4e4201200893207f270a91ea495c32e27ec9cd68b1ea2f48f8d08f221f3c1d85","category":"Thai"}