{"title":"Caleb Ewan will ride on with Lotto Soudal for a further three seasons","link":"https://cyclingtips.com/2021/08/caleb-ewan-will-ride-on-with-lotto-soudal-through-2024/","date":1628005038000,"content":"<div><p></p><h4>Caleb Ewan wins stage 3 of the Baloise Belgium Tour.</h4><p></p><div><p>Caleb Ewan will stick with Lotto Soudal for a further three seasons after signing a contract extension, the team announced on Tuesday.</p><p>The 27-year-old Australian joined Lotto Soudal in 2019 after coming over from Mitchelton-Scott, where he started his pro career. His new deal will keep him at Lotto Soudal through 2024.</p><p>Already a stage winner in the Vuelta a España and the Giro d’Italia prior to joining the Belgian WorldTour squad, Ewan has won five Tour de France stages – and four more Giro stages – during his time with Lotto Soudal.</p><p>“I feel very much at home at Lotto Soudal, it is a team I am proud to represent and together we have achieved some wonderful results but I am committed to ensuring this is only the beginning, we have some exciting times ahead,” Ewan said in a press release. “I believe we have much improvement within us and I am really looking forward to working with our sprint train of Jasper De Buyst, Roger Kluge, Harry Sweeny and Frederik Frison, as well as those that are soon to join our squad. I think we can achieve great things.”</p><p>Frison has also extended his contract to stick with Lotto Soudal through 2023, and the team has signed Rüdiger Selig – currently with Bora-Hansgrohe – on a two-year deal to further bolster Ewan’s lead-out train as well.</p><p>Ewan started this year’s Tour among the top favorites for the sprints, but crashed out of the race on stage 3, suffering a fractured collarbone. He has not yet raced again since the crash, but was slated to start the Vuelta prior to the incident.</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4f258c25b9448faa6b19368ac8d3888d5c7d3422344175690bb54fc76042685e","category":"Cycling"}