{"title":"mRNA Vaccine","link":"https://markpeak.net/mrna-vaccine/","date":1613840619000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"page\"><main id=\"content\" role=\"main\"><article id=\"post-2184\" itemscope=\"itemscope\" itemtype=\"http://schema.org/BlogPosting\" itemprop=\"blogPost\"><img width=\"700\" height=\"394\" src=\"https://markpeak.net/wp-content/uploads/2021/02/mrna-700x394.jpg\" alt=\"\" loading=\"lazy\" itemprop=\"image\" srcset=\"https://markpeak.net/wp-content/uploads/2021/02/mrna-700x394.jpg 700w, https://markpeak.net/wp-content/uploads/2021/02/mrna-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2021/02/mrna-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2021/02/mrna.jpg 900w\" sizes=\"(max-width: 700px) 100vw, 700px\"><div itemprop=\"mainContentOfPage\"><p><em>ภาพประกอบจาก BioNTech</em></p><p>ส่วนตัวแล้วมีความสามารถด้านชีวะน้อยมาก แต่คิดว่าความรู้พื้นฐานเรื่องชีววิทยา อย่างน้อยๆ คือเรื่องตัวไวรัส SARS-CoV-2 และการทำงานของวัคซีน กำลังกลายเป็นเรื่องสำคัญที่ “ควรรู้” ในยุคสมัยนี้ จึงต้องมาหาความรู้เพิ่ม</p><p>ประเด็นที่น่าสนใจที่สุดคงหนีไม่พ้น mRNA ซึ่งเป็นเทคโนโลยีวัคซีน “ใหม่ล่าสุด” ที่ให้ผล “ดีที่สุด” ซึ่งเราควรอธิบายหลักการพื้นฐานได้ว่ามันทำงานอย่างไร ต่างจากวัคซีนอื่นๆ อย่างไร</p><p>ลองค้นข้อมูลมาอ่านเยอะพอสมควร เจอแหล่งข้อมูลที่คิดว่าดีๆ เลยมาจดบันทึกไว้</p><h2><strong>คำศัพท์-แนวคิดพื้นฐานที่ควรรู้</strong></h2><ul><li><strong>Deoxyribonucleic acid (DNA)</strong> เป็นโมเลกุล “เกลียวคู่” (double helix) ที่อยู่ในเซลล์</li><li><strong>Ribonucleic acid (RNA)</strong> เป็นโมเลกุล “เกลียวเดี่ยว” (single strand) ที่อยู่ในเซลล์ เรียกว่าเป็นครึ่งเดียวของ DNA ก็ได้</li></ul><p>ทั้ง DNA และ RNA เก็บรหัสพันธุกรรมมาตรฐาน 4 ตัว (G/U/A/C) แต่การที่ RNA มีสายเดี่ยว เก็บข้อมูลได้น้อยกว่า มักมีสายสั้นกว่า ทำให้หน้าที่ของมันเป็นเหมือนคำสั่งสั้นๆ เฉพาะกิจ (operate) แทนการเก็บรักษาข้อมูล (store information) แบบ DNA</p><p>รูปแบบของ RNA มีหลากหลายมาก (<a href=\"https://en.wikipedia.org/wiki/List_of_RNAs\">รายชื่อ RNA ทั้งหมดบน Wikipedia</a>) แต่สิ่งที่เราสนใจคือ mRNA หรือ Messenger RNA ที่เป็นตัวขนส่ง (messenger) สำเนาคำสั่งการสร้างโปรตีนจาก DNA ที่อยู่ในนิวเคลียสของเซลล์ ไปให้ไรโบโซม (ribosome) ซึ่งเป็นส่วนหนึ่งของเซลล์แต่อยู่นอกนิวเคลียส อ่านค่าแล้วสร้างโปรตีนใหม่ขึ้นมา</p><p>คลิปของ Moderna (เข้าใจยากสักนิด)</p><p><span><iframe width=\"700\" height=\"394\" src=\"https://www.youtube.com/embed/Rn9sRkkqGT4?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"></iframe></span></p><p>การจะเข้าใจวัคซีนที่ใช้เทคโนโลยี mRNA ได้ ต้องเข้าใจวัคซีนประเภทอื่นๆ ที่เกิดขึ้นก่อนหน้านี้ก่อน ซึ่งในคลิปของ Vox Explained ทำไว้ดีมาก</p><p>แบบสรุปก็คือ</p><ul><li>วัคซีนคือการฉีด “อะไรสักอย่าง” เข้าไปในร่างกาย ให้ระบบภูมิคุ้มกันของร่างกายเรียนรู้ล่วงหน้า พอเจอไวรัสเข้ามาจริงๆ จะได้โต้ตอบได้เร็วกว่าเดิม (ภูมิคุ้มกันของร่างกายเรียนรู้ได้อยู่แล้วแต่ใช้เวลานาน สังเกตว่าเป็นหวัด 3-4 วันแรกๆ จะหนัก เพราะร่างกายยังเรียนรู้ไม่ทัน)</li><li>ในอดีต วัคซีนคือการฉีด “ไวรัสตายแล้ว” หรือ “ไวรัสอ่อนแรง” เข้ามาให้ร่างกายเรียนรู้ว่า อ๋อ ไวรัสหน้าตาเป็นแบบนี้ ต้องสู้มันแบบไหน พอเจอไวรัสตัวจริงๆ เข้ามาก็รู้แล้ว ขจัดได้ทันที</li><li>ปัญหาคือการฉีดไวรัสตายแล้ว-ไวรัสอ่อนแรงเข้าร่างกาย ต้องใช้การทดสอบแบบ trial-and-error กันนานว่าฉีดแบบไหนแล้วเวิร์ค เป็นการเดาสุ่มอยู่พอสมควร ในอดีต การคิดค้นวัคซีนจึงใช้เวลานานเป็นหลักสิบปี</li><li>เทคโนโลยี mRNA คือการอ่านค่า DNA ของไวรัสโดยตรงเลย แล้วลอก mRNA ของมันมา ฉีดเข้าไปให้ร่างกายอ่านค่า mRNA แล้วสร้างโปรตีนแบบที่ใช้ขจัดไวรัสออกมา</li></ul><p><span><iframe width=\"700\" height=\"394\" src=\"https://www.youtube.com/embed/mvA9gs5gxNY?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"></iframe></span></p><h2>ข้อดี-ข้อเสียของวัคซีนแบบ mRNA</h2><p>ข้อดีของ mRNA ในทางหลักการ จึงเป็นเรื่อง “แม่นกว่า” เพราะอ่านข้อมูลพันธุกรรมของไวรัสโดยตรง (เหมือนเขียนโปรแกรมแบบเห็นซอร์สโค้ด) และ “เร็วกว่า” เพราะรู้การทำงานของไวรัสทั้งหมด ไม่ต้องเดาสุ่มอีก</p><p>ตรงนี้จึงอธิบายได้ว่าทำไม Pfizer / Moderna พัฒนาวัคซีนได้เร็วมาก และได้ผลดีมากเมื่อเทียบกับวัคซีนแบบอื่นๆ</p><p>อย่างไรก็ตาม ข้อจำกัดของ mRNA Vaccine ก็มีอยู่บ้าง เช่น mRNA มันเสื่อมสภาพง่ายมาก จึงต้องเก็บรักษาวัคซีนในอุณหภูมิเย็นจัดมากๆ (เช่น -75 องศาแบบที่เราเห็นกันในข่าว)</p><p>นอกจากนี้ยังมีประเด็นเรื่อง การใส่ mRNA เข้าไปในร่างกายแล้วมี side-effect อยู่พอสมควร (เซลล์มองว่า mRNA ที่ใส่เข้ามานั้นแปลกปลอมเกินไป) ทำให้บริษัทที่พยายามทำยาด้วย mRNA ยุคก่อนหน้านี้ไม่ประสบความสำเร็จเท่าไร</p><p>ส่วนเรื่อง side-effect ในระยะยาวนั้นยังไม่มีข้อมูลชัดเจนนัก เพราะ mRNA เพิ่งเป็นเทคโนโลยีคิดค้นใหม่ในทศวรรษ 2010s และยังไม่เคยถูกใช้งานจริงในวงกว้างมาก่อน (วัคซีนของ Pfizer / Moderna เป็น 2 ตัวแรกที่ได้รับอนุญาตให้ใช้ในมนุษย์)</p><h2>ประวัติการคิดค้น mRNA Vaccine</h2><p><a href=\"https://www.matichonweekly.com/column/article_390014\">บทความนี้ในมติชนสุดสัปดาห์ เขียนโดยคุณ โชคชัย บุณยะกลัมพ</a> อธิบายได้ค่อนข้างละเอียด</p><div><p><a href=\"https://www.matichonweekly.com/column/article_390014\"><img src=\"https://www.matichonweekly.com/https://www.matichonweekly.com/wp-content/uploads/2021/01/%E0%B8%A7%E0%B8%B1%E0%B8%84%E0%B8%8B%E0%B8%B5%E0%B8%99.jpg\" alt=\"เทคโนโลยี 'mRNA' ความหวังคนทั้งโลก ต้านโควิด-19 / รายงานพิเศษ -โชคชัย บุณยะกลัมพ(ฉบับประจำวันที่ 15-21 มกราคม 2564 ฉบับที่ 2109)\"></a></p><p><img src=\"https://www.matichonweekly.com/wp-content/uploads/2016/08/favicon.png\" alt=\"มติชนสุดสัปดาห์\"> มติชนสุดสัปดาห์</p></div><p>จุดเริ่มต้นของ mRNA เริ่มช่วงปี 1990 โดยมาจากงานวิจัยของ University of Wisconsin ก่อน จากนั้นในทศวรรษ 90s ก็มีงานวิจัยอื่นๆ ตามมา</p><p>บุคคลสำคัญของโลก mRNA คือ Katalin Karikó นักชีวเคมีชาวฮังการี กับ Drew Weissman หัวหน้าแล็บ RNA ของ University of Pennsylvania ที่คิดค้นเทคนิคการใส่ mRNA เข้าไปในเซลล์แล้วร่างกายไม่ต่อต้าน งานวิจัยเผยแพร่ในปี 2005 และกลายเป็นรากฐานสำคัญของวงการวัคซีน mRNA</p><p><strong>Moderna</strong></p><p>Derrick Rossi นักวิจัยด้านสเตมเซลล์จาก Harvard อ่านงานของ Kariko-Weissman แล้วเห็นโอกาส เลยมาก่อตั้งบริษัท ModeRNA ในปี 2010 โดยได้เงินลงทุนจากกองทุน Flagship Ventures</p><p>ModeRNA ก่อตั้งได้ไม่นาน ทางกองทุน Flagship ก็ดึงเอา Stéphane Bancel ผู้บริหารบริษัทยาชาวฝรั่งเศสมาเป็น CEO และได้รับเงินลงทุนจาก AstraZeneca บริษัทยาสัญชาติอังกฤษ-สวีเดนด้วย</p><p>บริษัทเปลี่ยนชื่อเป็น Moderna ให้สะกดง่ายขึ้น และขายหุ้น IPO ในปี 2018 ใช้ตัวย่อ MRNA</p><p>คลิปที่ Bancel พูดขายฝันเรื่อง “วัคซีน mRNA” ที่งาน TEDx ในปี 2013 สมัยตั้งบริษัทใหม่ๆ (ซึ่งภายหลังก็ทำได้จริงๆ)</p><p><span><iframe width=\"700\" height=\"394\" src=\"https://www.youtube.com/embed/T4-DMKNT7xI?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"></iframe></span></p><p><strong>BioNTech</strong></p><p>ก่อตั้งในปี 2008 โดยคู่สามีภรรยาเชื้อสายตุรกี-เยอรมัน Uğur Şahin และ Özlem Türeci ที่มาจาก University of Mainz ในเยอรมนี เน้นไปที่การรักษาโรคด้วยการสร้างภูมิคุ้มกัน (immunotherapy) และเน้นโรคร้ายแรงอย่างมะเร็ง</p><p>BioNTech เป็นอีกแหล่งที่รวมนักวิจัยด้าน mRNA ทั้งสายเยอรมัน และ Katalin Karikó หนึ่งในผู้คิดค้นเทคนิค mRNA ก็เข้ามาทำงานกับ BioNTech ในปี 2013 ทำให้ในทศวรรษ 2010 บริษัทมีงานวิจัยด้าน mRNA ตีพิมพ์มากมาย และเซ็นสัญญาเป็นพาร์ทเนอร์กับ Pfizer ในปี 2018</p><p>สองผู้ก่อตั้ง BioNTech ลงปก TIME เดือนมกราคม 2021</p><p><strong>CureVac</strong></p><p>CureVac เป็นบริษัทเยอรมันอีกรายที่พัฒนาเทคนิค mRNA แต่เป็นอีกสายคือมาจากเมือง Tübingen</p><p>ก่อตั้งในปี 2000 โดยนักวิจัยชาวเยอรมัน Ingmar Hoerr ที่ทำปริญญาเอกเรื่อง mRNA ในตอนนั้น</p><p>วัคซีน CVnCoV ของ CureVac มาช้ากว่าอีก 2 รายเล็กน้อย (เพิ่งเริ่มมาช่วงต้นปี 2021) และใช้เทคนิคการฉีด mRNA แบบไม่ต้องแก้ไขดัดแปลง ซึ่งต่างจากของ Moderna / BioNTech ที่เป็นแบบดัดแปลง</p></div></article><div id=\"taglist\"><ul><li>Related Content by Tag</li><li><a href=\"https://markpeak.net/tag/biotech/\" rel=\"tag\">Biotech</a></li><li><a href=\"https://markpeak.net/tag/covid-19/\" rel=\"tag\">COVID-19</a></li><li><a href=\"https://markpeak.net/tag/science/\" rel=\"tag\">Science</a></li><li><a href=\"https://markpeak.net/tag/vaccine/\" rel=\"tag\">Vaccine</a></li></ul></div></main></div></div>","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"4f5fb3cc12eb5032f4e9558d955f87a6b905e5eed1c4e3b4868c4b2ea48dddae","category":"Thai"}