{"title":"Marianne Vos wins again in Rucphen after a thrilling finale","link":"https://cyclingtips.com/2021/12/marianne-vos-wins-again-in-rucphen-after-a-thrilling-finale/","date":1639835963000,"content":"<div><div><p>Marianne Vos (Jumbo-Visma) took a thrilling World Cup victory in Rucphen, her first on home soil this season after returning to competition at last weekend’s historic snowfest in Val di Sole.</p><p>Vos was quickest out of the blocks, and the Dutch rider – three-time winner on this course (so far) – led the race onto the dirt with Lucinda Brand (Baloise Trek Lions) on her wheel. By the first entry to the ‘carrousel’, a small group of four had already found a gap, Vos and Brand joined by Puck Pieterse (Alpecin-Fenix) and <a href=\"https://cyclingtips.com/2021/12/fem-van-empel-takes-a-spectacular-victory-in-snow-covered-val-di-sole/\">Val di Sole winner Fem van Empel</a> (Pauwels Sauzen-Bingoal).</p><p>Vos put her rivals to the test throughout the first lap, but she was never allowed much room and Brand in particular had a tight grip of her compatriot’s wheel. It was the world champion’s turn to put the hammer down on the second lap, but Vos was unshakeable and the two young riders were never far behind.</p><p>The leading quartet was joined by chasers Denise Betsema (Pauwels Sauzen-Bingoal) and Annemarie Worst (777) for the fourth of seven laps and the decisive shake-up didn’t come until the penultimate lap.</p><p>Betsema, Brand and Vos kept a close eye on one another, fighting over the lead of the race and gradually shedding the chasers as they went. The world champion led into the final lap and her pressure ultimately put an end to Betsema’s hopes, setting up a thrilling head-to-head finale. </p><p>Vos was at a disadvantage coming through the final corner, but the short finishing straight proved a little too long for Brand, and Vos celebrated a hard-fought fourth victory at Rucphen and a third World Cup win of the season. Second place for Brand strengthens her overall World Cup lead over Betsema, who came in a few seconds behind to complete the podium.</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"4fede5fe826b26ea553962a59b69631d3135c668d81d2356aadb962daf481a22","category":"Cycling"}