{"title":"iPhone SE vs iPhone 8: The only choice for home button lovers","link":"https://www.macworld.com/article/234078/iphone-se-2020-vs-iphone-8-design-display-specs-camera-battery-price.html","date":1616380878000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"link_wrapped_content\"><p>Apple’s updated <a rel=\"nofollow\" href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/iphone-se/&amp;subid1=1-1-234078-0-0-0&amp;subId3=xid:fr1616413551416ifj\" data-orig-url=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/iphone-se/&amp;subid1=1-1-234078-0-0-0\" data-ml-id=\"0\" data-ml=\"true\" data-xid=\"fr1616413551416ifj\">iPhone SE</a> is the only iPhone Apple sells that has a home button. Just like the <a href=\"https://www.macworld.com/article/3049962/iphone-se-review-its-a-pocket-size-powerhouse.html\">original iPhone SE</a>, which was a rebooted iPhone 5s, the 2020 iPhone SE is basically an iPhone 8 with new guts. But even if you can find a refurbished iPhone 8 for half the price of a $399 iPhone SE, here’s why you should spend extra—or hunt for a deal—on an iPhone SE.</p><h2 id=\"design-display-and-size\">Design, display, and size</h2><p>The iPhone SE and iPhone 8 are identical in size and shape (138.4 x 67.3 x 7.3mm) and both weigh 148 grams. They both have a single rear camera and vertically aligned flash along with a glass back. The only difference is the position of the Apple logo, which is slightly lower on the SE to match the iPhone 11. The SE also comes in a (Product) Red color, which replaces the iPhone 8’s gold hue.</p><p>The new iPhone SE has basically the same display as the iPhone 8, bringing a 4.7-inch Retina HD 1334×750 resolution at 326 ppi, along with True Tone, wide color, and 625 nits of max brightness. Below the display, you’ll find a Touch ID sensor on both. The only major difference is 3D Touch: the iPhone 8 has it and the iPhone SE doesn’t. In its place is Apple’s newer Haptic Touch system that was introduced with the iPhone 11. They’re not quite identical systems, but most users won’t notice the difference.</p><p>What you won’t find with the iPhone SE is a larger model. Where Apple offered a “Plus” variant to the iPhone 8 that bumped the display to 5.5 inches, the iPhone SE only comes in a single 4.8-inch flavor. And you might be waiting a while for a larger model to arrive. The latest rumors suggest that an iPhone SE 3 won’t launching in 2021 and we haven’t heard hide nor hair of a “Plus” model in months.</p><h2 id=\"performance-storage-and-battery\">Performance, storage, and battery</h2><p>Here’s where the iPhone SE starts to set itself apart from the iPhone 8. The SE has Apple’s A13 Bionic chip, while the iPhone 8 is powered by the A11 Bionic chip. That means the SE will be faster and smarter, thanks to its third-generation Neural Engine. Apple doesn’t divulge the amount of RAM inside its phones, but we know from teardowns that the iPhone SE has the same 2GB of RAM as the iPhone 8.</p><p>Both phones are IP67 rated for water and dust resistance, meaning you can dunk them in a meter of water for a half-hour. They also both have stereo speakers, Apple Pay support via NFC, and Bluetooth 5. Both the iPhone SE and iPhone 8 are available in 64GB and 128GB varieties, while the SE adds a 256GB tier. They also both have wireless charging capabilities, and fast charging with an 18W adapter or higher, which you’ll need to buy. Finally, the iPhone SE supports Wi-Fi 6 while the iPhone 8 has Wi-Fi 5.</p><p>Apple says the SE, “lasts about the same as iPhone 8,” but it actually has a smaller battery (1624 mAh vs 1,821mAh). In our rundown tests, however, the SE actually lasted a bit longer (3 hours and 37 minutes vs 3 hours and 17 minutes), but it’s still a far cry from the nearly six-hour battery life in the <a href=\"https://www.macworld.com/article/233317/iphone-11-review.html\">iPhone 11</a>.</p><div><figure><a href=\"https://images.idgesg.net/images/article/2020/04/iphone-se-2020-colors-100838687-orig.jpg\" rel=\"nofollow\"><img src=\"https://images.idgesg.net/images/article/2020/04/iphone-se-2020-colors-100838687-large.jpg\" alt=\"iphone se 2020 colors\"></a><figcaption><p>The iPhone SE comes in three colors, including a new Product Red version.</p></figcaption></figure></div><h2 id=\"camera\">Camera</h2><p>While the iPhone 8 and iPhone SE both have a single 12MP, f/1.8 wide camera with digital zoom up to 5x, the SE is far more advanced than the iPhone 8. Apple VP Phil Schiller says it’s Apple’s “best-ever single-camera system for great photos and videos,” meaning it’s similar but a little better than the one in the iPhone XR from last year.</p><p>Under the sapphire crystal lens cover (a feature not on the iPhone 8), you’re getting Portrait Mode (limited to people), Portrait Lighting, Smart HDR, and QuickTake video, all of which are not available on the iPhone 8. Additionally, you can also take portrait videos with the 7MP, f/2.2 selfie camera. And like the iPhone 8, you can record 4K video on the iPhone SE. So while it’s not quite as good as the main camera in Apple’s newer flagships—most notably, it’s missing night mode—the iPhone SE is one of the best camera phones for under $400.</p><h2 id=\"applecare\">AppleCare+</h2><p>Apple offers the same AppleCare+ coverage for the iPhone SE that it does for all of its iPhones, but it’s cheaper for the new model. Where Apple charged $129 for coverage on the iPhone 8, <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/support/products/iphone/&amp;subid1=1-1-234078-0-0-0&amp;subId3=xid:fr1616413551416gba\" rel=\"nofollow\" data-orig-url=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/support/products/iphone/&amp;subid1=1-1-234078-0-0-0\" data-ml-id=\"2\" data-ml=\"true\" data-xid=\"fr1616413551416gba\">AppleCare+ on the iPhone SE is just $79</a> for two years of service, a 40 percent decrease. Like the other models, it carries a deductible of $29 for screen repair and $99 for all other repairs, with a limit of two instances. You can also get a Theft &amp; Loss policy for $149 ($50 cheaper than before), which allows you to get a full SE replacement for a $149 deductible, a total price of at least $100 less than it would cost to buy a new one outright (or more depending on capacity).</p><h2 id=\"price-and-conclusion\">Price and conclusion</h2><p>Apple has undercut even the latest iPhone 8 prices with the iPhone SE, making it Apple’s cheapest iPhone since, well, the last iPhone SE:</p><p><strong>iPhone 8</strong><br><strong>64GB:</strong> $449<br><strong>128GB:</strong> $499</p><p><strong>iPhone SE 2020</strong><br><strong>64GB:</strong> $399<br><strong>128GB:</strong> $449<br><strong>256GB:</strong> $549</p><p>Apple has stopped selling the iPhone 8 on its website, but you can still find refurbished models. When available, Apple is selling&nbsp;<a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/FQ6K2LL/A/Refurbished-iPhone-8-64GB-Space-Gray&amp;subid1=1-1-234078-0-0-0&amp;subId3=xid:fr1616413551416ceg\" rel=\"nofollow\" data-orig-url=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/FQ6K2LL/A/Refurbished-iPhone-8-64GB-Space-Gray&amp;subid1=1-1-234078-0-0-0\" data-ml-id=\"3\" data-ml=\"true\" data-xid=\"fr1616413551416ceg\">the 64GB model is now $339</a> and <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/FQ6K2LL/A/Refurbished-iPhone-8-64GB-Space-Gray&amp;subid1=1-1-234078-0-0-0&amp;subId3=xid:fr1616413551416jej\" rel=\"nofollow\" data-orig-url=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/FQ6K2LL/A/Refurbished-iPhone-8-64GB-Space-Gray&amp;subid1=1-1-234078-0-0-0\" data-ml-id=\"4\" data-ml=\"true\" data-xid=\"fr1616413551416jej\">the 256GB model is $469</a>, which offers some savings over the iPhone SE. But we’d still recommend spending a few dollars more on the SE.</p><div><p></p><h3 id=\"iphone-se-2020\">iPhone SE (2020)</h3><p></p><div><p><img alt=\"iPhone SE (2020)\" src=\"https://images.idgesg.net/images/article/2020/04/apple_new-iphone-se-black-white-product-red-colors_04152020-100838680-orig.jpg?quality=50&amp;strip=all\" loading=\"lazy\"></p></div><p>Not Apple’s best iPhone, but its best value by a mile. The iPhone SE is a huge gift to those who can’t afford or don’t want to pay $700 or more for a new iPhone.</p><p><a href=\"https://www.macworld.com/article/234116/iphone-se-2020-review-everything-you-need-and-nothing-else.html\" target=\"_blank\">Read our full iPhone SE (2020) review</a></p></div></div><p><em>Note: When you purchase something after clicking links in our articles, we may earn a small commission. Read our</em> <a href=\"https://www.macworld.com/about/affiliate-link-policy\" target=\"_blank\"><em>affiliate link policy</em></a> <em>for more details.</em></p><p>Michael Simon has been covering Apple since the iPod was the iWalk. His obsession with technology goes back to his first PC—the IBM Thinkpad with the lift-up keyboard for swapping out the drive. He's still waiting for that to come back in style tbh.</p></div>","author":"Michael Simon","siteTitle":"Why the next iPad Pro will be closer than ever to a Mac","siteHash":"7b8e50ee24918aa4b0ece52f9db5bd351585151def14e1e810af7a8801e1e873","entryHash":"503364ccbb9aeaa99bed9a888a26bae178931411fc78351cf37cdb6b0275f209","category":"Apple"}