{"title":"Lachlan Morton has a 600 km buffer on the Tour peloton","link":"https://cyclingtips.com/2021/07/lachlan-morton-has-a-600-km-buffer-on-the-tour-peloton/","date":1625486951000,"content":"<div><div><p>Amidst the chaos and carnage of the <a href=\"http://www.cyclingtips.com/tag/tour-de-france\">Tour de France</a> it’s easy to forget that there is another race underway. </p><p>Lachlan Morton, an EF Education-Nippo rider from Australia who has long marched to the beat of his own drum, set off from Brest on the same day as the peloton with a bit of a bonkers plan: <a href=\"https://cyclingtips.com/2021/06/lachlan-morton-is-bikepacking-the-entire-tour-de-france-route-transfers-included/\">to ride the entire Tour route – plus all the transfers – entirely self-supported</a>, and beat the race to Paris. </p><p>The whole thing is a fundraising initiative for World Bicycle Relief, a charity that provides utilitarian bikes to people in the developing world, where a bike can make the difference between a child being able to get an education or not. EF Education-Nippo’s apparel sponsor, Rapha, and EF Education have each chipped in 500 bikes, and <a href=\"https://give.worldbicyclerelief.org/campaign/ef-rapha-for-wbr/c329966\">further donations are invited</a>.</p><p>So far, the Alt Tour has raised close to £200,000. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/DSC02233-1340x895.jpg\"></figure><p>As for Morton? He’s had some ups and downs – literal and metaphorical. <a href=\"https://cyclingtips.com/2021/06/lachlan-morton-just-rode-two-tour-stages-in-a-day-wearing-sandals/\">When we last checked in on our intrepid hero</a>, he was ailed by a bad knee. Deal-breaker? Not nearly. He’d bought some flat pedals at a small town bike shop, rode two stages in one day in a pair of Birkenstocks, and had a leisurely sleep in a field. </p><p>The good news: Morton is back in conventional cleated shoes. The bad news: his sandals “fell victim” to stages 8 and 9, which sounds ominous and looks even worse.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/4M4A1140-1340x893.jpg\"><figcaption>The end of an era.</figcaption></figure><p>That wasn’t the only obstacle facing the Australian on Friday: he took a wrong turn, went up an extra climb, had wet camping equipment and ran out of food. For breakfast, cold instant coffee.</p><p>No matter. He pushed through Saturday, completing the remaining parts of the climbing stages that the peloton has just finished, before continuing on his way to Provence and a looming double date with Mont Ventoux. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/4M4A1178-1340x893.jpg\"><figcaption>Just a guy going faster than anyone with a broken pair of sandals should go.</figcaption></figure><p>On the way toward Ventoux, Morton had several run ins with the puncture fairy, exhausting his supply of spare tubes and forcing an improvised fix with his inflatable mattress repair kit.</p><p>Fortunately he found an open bike shop, scored some spares and continued towards a Very Big Mountain. And then up it, for the first of two times. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/4M4A1823-1340x893.jpg\"><figcaption>Morton left a hat at the Tom Simpson memorial.</figcaption></figure><p>One ascent completed, Morton called it for the day. For dinner, he had tacos, steak and chips and chased it with a glass of red. </p><p>Nine days in, Morton has put in 114 hours in the saddle, covering 2,822 km and climbed 34,113 metres. That’s brought him to the halfway mark of the entire colossal 5,500 km challenge, giving him a 600 km buffer on the peloton.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/4M4A1920.jpg\"><figcaption>A well-earned dinner: both heated, and indoors.</figcaption></figure><p>He continues today with the second climb of Mont Ventoux and will complete stage 11, while the peloton has a breather after finishing stage 9.</p><p><em>Attentive dot-watchers can follow Morton’s progress across France <a href=\"http://rapha.cc/thealttour\">here</a>. You can, if so inclined, <a href=\"https://give.worldbicyclerelief.org/campaign/ef-rapha-for-wbr/c329966\">donate to World Bicycle Relief here</a>.</em></p></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"5042c0c85c6974b1e8ae7acfb0fb87897de33bb460aab5281ee526fce34c5054","category":"Cycling"}