{"title":"Apple alleges ex-MacBook Pro designer leaked secret details to reporter","link":"https://arstechnica.com/?p=1749184","date":1615569514000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Apple's \"complete secrecy\" —</h4><h2 itemprop=\"description\">Apple: Ex-employee leaked future hardware products, sought favors from reporter.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/MacBook-Pro-keyboard-800x533.jpg\" alt=\"A MacBook Pro keyboard\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/MacBook-Pro-keyboard.jpg\" data-height=\"960\" data-width=\"1440\">Enlarge</a> <span>/</span> The keyboard on the 2016 Touch Bar MacBook Pro.</p></figcaption></figure><p>Apple sued a former employee on Thursday, alleging that he leaked trade secrets to a reporter and sought favors from the reporter in exchange.</p><p>The <a href=\"https://www.courtlistener.com/recap/gov.uscourts.cand.374948/gov.uscourts.cand.374948.1.0.pdf\">lawsuit</a> was filed against Simon Lancaster in US District Court for the Northern District of California. Lancaster spent 11 years at Apple before taking a job as head of consumer products at Arris Composites in late 2019. Lancaster was advanced materials lead and product design architect at Apple, where he \"was instrumental in the development of the 13\"/15\" MacBook Pro with the touch bar, and the design of unreleased Apple products,\" an Arris Composites press release <a href=\"https://www.businesswire.com/news/home/20191122005108/en/Simon-Lancaster-Former-Advanced-Materials-Lead-at-Apple-Joins-Arris-Composites-to-Unlock-Future-of-Consumer-Products\">said</a> at the time.</p><p>Apple's lawsuit alleged:</p><blockquote><p>Despite over a decade of employment at Apple, Lancaster abused his position and trust within the company to systematically disseminate Apple's sensitive trade secret information in an effort to obtain personal benefits. He used his seniority to gain access to internal meetings and documents outside the scope of his job's responsibilities containing Apple's trade secrets, and he provided these trade secrets to his outside media correspondent. The Correspondent then published the stolen trade secrets in articles, citing a \"source\" at Apple. On multiple occasions, Lancaster proposed that the Correspondent give benefits to Lancaster in exchange for Apple's trade secrets. For example, Lancaster proposed that the Correspondent provide favorable coverage of a startup company in which Lancaster was an investor as a quid pro quo. Lancaster even recruited the Correspondent to serve as his personal investigator. In one instance, Lancaster requested that the Correspondent explore a rumor that could prove harmful to a company in which Lancaster had invested.</p></blockquote><p>Those last two sentences relate to an incident in spring 2019 in which Lancaster told the reporter of his \"displeasure with Apple\" due to \"a story&nbsp;published that day that reported a rumor that Apple would produce a new hardware product,\" the lawsuit said. \"Shortly thereafter, Lancaster asked the Correspondent to investigate the substance of that story because 'it could mean trouble for my [Lancaster's] startup.' The Correspondent replied, 'I'll see what I can find out.'\"</p><p>Lancaster subsequently \"communicated to a third party that the Correspondent had committed to publishing an article about Lancaster's startup if it obtained $1 million in funding,\" Apple said, alleging that \"the Correspondent agreed to publish that article in exchange for Lancaster's ongoing misappropriation of Apple trade secrets.\" When he left Apple for Arris Composites, Lancaster asked the reporter to \"write a story about a 12-year Apple Design Veteran leaving for an amazing startup,\" Apple said. Whether those stories proposed by Lancaster were published is not made clear in the lawsuit.</p><p>We contacted Lancaster about the lawsuit and will update this article if we get a response. The reporter was not named in the lawsuit. Apple said the leaks included \"unreleased Apple hardware products\" but did not say which ones.</p><h2>Apple trade secrets</h2><p>Apple's lawsuit alleged that Lancaster violated the federal Defend Trade Secrets Act and the California Uniform Trade Secret Act and breached a confidentiality and intellectual property agreement.</p><p>Apple alleged that Lancaster continued giving trade secrets to the reporter after he announced his resignation. \"Lancaster's role as the Correspondent's 'source' deepened even after he announced his resignation from his role at Apple,\" the lawsuit said. \"Indeed, Apple's internal investigation of the Apple-owned devices provided to Lancaster as part of his employment shows that after Lancaster announced his resignation, he communicated with the Correspondent regarding specific Apple trade secrets sought by the Correspondent and took specific steps to obtain additional Apple trade secrets.\"</p><p>Apple is famously secretive about its plans for future products, but details are often reported in advance of announcements because of leaks to journalists.</p><p>\"The trade secrets Lancaster stole and sent to the Correspondent for publication included details of unreleased Apple hardware products, unannounced feature changes to existing hardware products, and future product announcements, all of which Apple guards closely,\" Apple said in the lawsuit. \"Apple's product teams—innovators, designers, and builders—work in complete secrecy, often for many years, and at significant personal burden, all to surprise and delight Apple's customers with their creations. The deceitful and indefensible release of these product details enabled by Lancaster's misappropriation has undermined the morale of the teams that worked on the products and features in question.\"</p><p>Apple said that a \"forensic review\" of Lancaster's work devices show that \"Lancaster and the Correspondent coordinated to pilfer specific documents and product information from Apple. On numerous occasions, the Correspondent had requested Lancaster obtain specific Apple trade secret documents and information. On multiple occasions, Lancaster then sent the Correspondent certain of the requested confidential materials using Apple-owned devices. On other occasions, Lancaster met with the Correspondent in person to provide them with the requested confidential Apple information. The full extent of their conspiracy is presently unknown; however, Apple's investigation is ongoing.\"</p><h2>Apple security measures</h2><p>Apple said it \"takes all reasonable steps to maintain the confidentiality\" of its trade secrets, including physical security at buildings, monitoring of computer access, \"requir[ing] all employees to execute strict confidentiality agreements,\" and training employees on policies for treatment of confidential information. Apple said that Lancaster signed the company's confidentiality and intellectual property agreement in May 2008.</p><p>Lancaster was granted access to confidential information because he had a \"senior role\" that involved \"evaluating materials and prototyping innovations to enable future generations of products,\" Apple said.</p><p>While Apple didn't name <a href=\"https://arriscomposites.com/\">Arris Composites</a> directly in the lawsuit, the complaint said that Lancaster's new employer has a vendor service agreement with Apple. \"Portions of the trade secret information Lancaster misappropriated relate directly to his role at his new employer, and it is likely Lancaster's misuse of Apple's trade secrets continues to this day,\" Apple alleged. \"In fact, on his last day at Apple, Lancaster downloaded a substantial number of confidential Apple documents from Apple's corporate network onto his personal computer that would benefit his new company.\"</p><p>The vendor agreement with Apple includes a confidentiality agreement that Lancaster is subject to, Apple said. \"Apple therefore seeks the return of any and all copies of its [trade secrets] and to ensure that Lancaster no longer possesses such data and information and an injunction against any use of that information,\" the complaint said.</p><p>Arris Composites, founded in 2017,&nbsp;<a href=\"https://arriscomposites.com/arris-composites-additive-molding-carbon-fiber-truss-wins-red-dot-design-concept-2020/\">says</a> it makes \"carbon fiber composites that can be combined with other materials such as metals and even electronics.\"</p><p>In addition to requesting an \"injunction enjoining [Lancaster] from continuing to misappropriate Apple's trade secret information,\" Apple asked the court to make Lancaster pay damages, punitive damages, restitution, and attorneys' fees and costs.</p><h2>“Why I left Apple”</h2><p>Lancaster wrote favorably of his time at Apple in a November 2019 <a href=\"https://www.linkedin.com/pulse/why-i-left-apple-joined-arris-composites-simon-lancaster-/\" rel=\"nofollow\">post on LinkedIn</a> titled \"Why I left Apple and joined Arris Composites.\" At Apple, \"I was able to step up and help the engineering product design department take sketches off the drawing board and turn them into real products,\" he wrote. \"I fell in love with the magic of certain processes, like additive manufacturing and composites, and would stay on to become Apple's advanced materials lead.\"</p><p>Lancaster has <a href=\"https://patents.google.com/?inventor=simon+lancaster&amp;assignee=apple&amp;num=100\">a few dozen patents</a> from his time at Apple. As Lancaster became an angel investor in startups, \"I realized how much I missed the thrill of the unknown, the journey of exploration that many of these young founders were experiencing,\" he wrote.&nbsp;Apple, by contrast, was a \"well oiled machine\" that \"works so well it's hard to justify changing it.\" Lancaster wrote that Arris will \"show that composites manufacturing is not just something for space shuttles, but can change the products we carry in our pockets and cherish on our desks.\"</p></div></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5061bd9c8468f73d4120290e3ee72356106ef5458739137de8b5f2e580050cac","category":"Tech"}