{"title":"Argon 18 says its handlebar wasn’t responsible for Aussie team pursuit crash","link":"https://cyclingtips.com/2021/08/argon-18-says-its-handlebar-wasnt-responsible-for-aussie-team-pursuit-crash/","date":1627942107000,"content":"<div><div><p>Argon 18 has issued a statement about Alex Porter’s crash during Australia’s team pursuit qualifying round at the Tokyo Olympics. In the statement Martin Faubert, VP Product at Argon 18, spoke about the company’s relief that no one was seriously injured in the crash and applauded the Australian team’s quick return to the track.</p><p>Faubert went on to confirm a full review by the Australian Cycling Team is underway, with results of that review to follow, before making one crucial comment:</p><blockquote><p><em>We can confirm it was not an Argon 18 handlebar which experienced this failure.</em></p></blockquote><p>Faubert continued, “While Argon 18 has designed a handlebar for the bike, and provided that handlebar to the team, it was not our bar in use during this incident.” This statement will come with a huge sigh of relief for the many other teams and riders in the Olympic Games racing on the same frame and base bar as that which suffered the catastrophic failure on Monday.</p><p>However, this does open the question as to who did manufacture the bar in question. While trial by social media has attributed blame to several manufacturers, Faubert could not provide any clarity on the question at hand. “We unfortunately are unable to provide further detail on the manufacturer of the equipment nor why this particular bar was swapped out for the race”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/Alexander-Porter-Tokyo-2020-Olympic-team-pursuit-handlebar-crash-1-1340x754.jpg\"><figcaption>Porter crashed at 60 km/h when the integrated stem and handlebar on his Argon 18 failed. Argon 18 says it was not its bar.</figcaption></figure><p>As for the reasoning behind the switch, non-standard bars are nothing new. Many teams are now switching to custom-made, custom-fit and more aerodynamic bars for top riders and events to find every millisecond available.</p><p>Many brands now offer carbon custom and semi-custom aerodynamically profiled extensions for time trial and track riders. Such offerings are usually limited to just the extensions, but in a discipline where every watt matters, custom base bars are not unheard of.</p><p>We have looked at the Australian team pursuit squads bikes again, and there is perhaps a clue as to which riders are on custom base bars. Three out of the four-man starting lineup ran all-black base bars, while only one rider, Sam Welsford, is running green and yellow-painted bars (on the underside).</p><p>Alex Porter was one of those riders on all black bars. While this is not proof any or all of the riders were using custom bars, and all four bars do look very similar from the TV shots, it does at least suggest there is a possibility all the riders were not running the same bar. One thing for certain, all eyes will be on the Australian team bikes in the team pursuit round one to see if the squad opts for a different handlebar.</p><p>Faubert finished his statement by reiterating Argon 18’s commitment to the Australian team. “We remain committed to our partnership with the team and wish them the best of luck as they continue to compete at the highest level.”</p><p>CyclingTips is following several of lines of enquiry as to who made the failed bar. More to follow as we have it.</p></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"50cb8067ea9e5a5d3170d5e27286eb8546a99cf3c0c0c3140fb197ad8b45dc72","category":"Cycling"}