{"title":"Eight Riders to Watch in the Women’s Peloton in 2021","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/eight-riders-to-watch-in-the-women-s-peloton-in-2021","date":1611927283000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>The fun of following cycling, or indeed any sport, can only go so far if you're not familiar with the riders or teams involved. Due&nbsp;to the lack of coverage that women’s cycling suffers from, it can be difficult for fans to fully engage with the dynamics of the racing if they don’t know their van der Breggens from their van Vleutens, or Longo Borghinis from Uttrup Ludwigs.</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><span>Luckily, then, this guide will tell you all you need to know about the riders to look out for in the 2021 season.</span></p><meta charset=\"utf-8\"><h4><span>Anna van der Breggen (SD Worx)</span></h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Picture_by_Alex_Whitehead_SWpix.com_-_26_09_2020_1024x1024.jpg?v=1611849387\" width=\"1024x1024\" height=\"1024x1024\"></p><p><em>Photo Credit:&nbsp;Alex Whitehead/<span>SWpix.com</span>&nbsp;</em></p><p><span>The current road race and time trial World Champion is entering the final season of her pro career in 2021 and has been vocal in affirming that her retirement at the end of 2021 is concrete. After stepping away from racing, she will take up her new role as directeur sportif for the SD Worx team from 2022.</span></p><p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/seven-women-s-cycling-races-to-watch-in-2021\">Related – Women's cycling races to watch in 2021</a>&nbsp;<br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-guide-to-the-2021-women-s-worldtour-teams\">Related – A guide to the 2021 women's WorldTour teams</a></em></strong></p><p><span>The Dutch rider, who is also the current national champion in both road and TT, will naturally be aiming to end her career on a high. So no surprise the defending Olympic champion has named the Tokyo Olympic Games as a goal for 2021.&nbsp;</span></p><p><span>Also on the all-rounder’s radar will be the inaugural women’s Paris Roubaix, as well as other Classics such as Flèche Wallonne – a race she has now won every year since 2015. Of course, the ultimate way to round off an illustrious career is by winning the World Championships and van der Breggen must surely be hoping to take the third and final title of her career in Flanders in September.</span></p><meta charset=\"utf-8\"><h4>Annemiek van Vleuten (Movistar)</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Picture_by_Alex_Whitehead_SWpix.com_f2efc9e8-be29-4ffa-a64c-634003953a27_1024x1024.jpg?v=1611849798\" alt=\"\"></p><meta charset=\"utf-8\"><p><em>Photo Credit:&nbsp;Alex Whitehead/<span>SWpix.com</span>&nbsp;</em></p><p>A prolific force of nature who has been dominating women’s cycling for many seasons, Annemiek van Vleuten will be looking to avenge a fraught end to her 2020, while racing in her new colours as team leader at Movistar.</p><p><span>Riding as World Champion in 2020, van Vleuten appeared to be laughing in the face of the so-called ‘curse of the rainbow jersey,’ winning Omloop Het Nieuwsblad in February and coming back in July to take a further four wins in as many starts.</span></p><p><span>But a crash at the end of stage seven of the Giro Rosa (while leading the GC) saw her out of the race with a broken wrist – calling her ability to defend her rainbow stripes into question. Amazingly, van Vleuten recovered in time to ride in Imola, but came second on the day. That was an incredible result under the circumstances, but one which for van Vleuten will never be good enough.</span></p><p><span>The 38-year-old will also be looking to reverse her fortunes in the Olympic road race, which, like almost all riders in 2021, she will be targeting. Unlike most riders, however, the Dutchwoman will be hoping to put her horrific crash in Rio 2016 to rest by finally achieving the result that was within her grasp before she was left unconscious at the side of the road: a win.</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Subscribe to our women's newsletter,&nbsp;</span></p><p><span>produced in association with Rapha, to receive</span></p><p><span>a weekly complement of racing, gear and cycling</span></p><p><span>culture focussed on women</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><meta charset=\"utf-8\"><h4><span>Lizzie Deignan (Trek-Segrafredo)</span></h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/A.S.O._Thomas_Maheux_ASO_-_via_SWpix.com_1024x1024.jpg?v=1611849715\" alt=\"\"></p><p><em>Photo Credit: A.S.O./ Thomas Maheux ©ASO - via <span>SWpix.com</span></em>&nbsp;</p><p><span>The 2020 season presented fans with glimmers of the Lizzie Deignan who rode to victory at the world championships in Richmond in 2015. After giving birth to her daughter, the British rider took maternity leave in 2018 before returning to a reduced, but no less successful, 2019 season which she then built upon last year. She took three WorldTour wins to secure the overall Women’s WorldTour title.</span></p><p><span>Deignan had originally stated her intention to retire after the Tokyo Olympics but has now shelved her plans citing her renewed enjoyment of the sport. That’s in part thanks to her team, Trek Segafredo. But it’s also down to a new, relaxed, approach since becoming a mother as well as the increasing strength-in-depth of the women’s peloton keeping her on her toes.</span></p><p><span>The 31-year-old, who has made a name for herself in the Ardennes Classics, will be targeting the World Championships in Flanders which will perhaps be her best shot at a second rainbow jersey since Richmond.</span></p><p><span>Deignan will also be looking to upgrade her silver medal from London 2012 to gold in Tokyo on a tough course that shares characteristics with Liege-Bastogne-Liege which she won in 2020.</span></p><meta charset=\"utf-8\"><h4>Marianne Vos (Jumbo-Visma)</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Picture_by_Alex_Whitehead_SWpix.com_-_29_08_2020_-_Cycling_-_UCI_Women_s_World_Tour_-_2020_La_Course_By_Le_Tour_78867b25-f76f-45e8-a518-ce4046ec155a_1024x1024.jpg?v=1611850418\" alt=\"\"></p><meta charset=\"utf-8\"><p><em>Photo Credit:&nbsp;Alex Whitehead/<span>SWpix.com</span>&nbsp;</em></p><p><span>For the first time in her sixteen-year career, Marianne Vos has moved to a different team – Jumbo-Visma Women’s Team. After spending every season since 2006 racing for different iterations of the same team the 12-time world champion will be hoping that she can revitalise her career with the new Dutch squad.</span></p><p><span>One of the most recognisable names in cycling, the 33-year-old has taken some of the most prestigious titles, including two Olympic gold medals, and won some of the most coveted races on the calendar. However having signed a three-year deal with Jumbo-Visma, it’s clear that retirement is not on her radar. If there is one take-away from women’s cycling, it is: never underestimate Marianne Vos.</span></p><p><span>In keeping with the rest of the peloton Vos’s focus for the season will be the Tokyo Olympics, and with a strong Dutch team her chances are good. However she will be up against formidable compatriots Anna van der Breggen and Annemiek van Vleuten for the top spot. Regardless of team tactics, the hard course will force a select group and you can expect to see Vos in the mix.</span></p><p><span>After being given the freedom by her team to leave training camp early to compete in the cyclocross world championships, the multi-disciplinary Vos is also hoping enter the 2021 road season with a rainbow jersey under her belt.</span></p><meta charset=\"utf-8\"><h4>Elisa Longo Borghini (Trek-Segafredo)</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Picture_by_Alex_Whitehead_SWpix.com_-_26_09_2020_-_Cycling_-_2020_UCI_Road_World_Championships_1024x1024.jpg?v=1611850030\" alt=\"\"></p><p>&nbsp;<em>Photo Credit:&nbsp;Alex Whitehead/<span>SWpix.com</span>&nbsp;</em></p><p><span>Elisa Longo Borghini has always been one of the top riders in the women’s peloton, but in 2020 the Italian had one of her best seasons for a while in her second year with the formidable Trek-Segafredo squad.</span></p><p><span>The 29-year-old credited the mental resilience she felt she gained during the tough Italian lockdown for a consistent and successful 2020 season that saw her take both the road and time trial national championship titles as well as a third place at the Worlds road race in Imola. That earned her the position of second-ranked rider in the world by the end of the season.</span></p><p><span>Alongside teammate Lizzie Deignan, Longo Borghini made up half of an unstoppable duo who throughout the season repeatedly gave their rivals a lesson in team tactics as one or the other took a win or podium.</span></p><p><span>Supported by her fortified team, Longo Borghini will have her sights on the Giro Rosa this season after her podium finish and stage win at her ‘home race’ last year. The Giro Rosa will also serve as a form-finding build-up for the Olympic Games later the same month, where Longo Borghini will be hoping she can better her bronze medal from Rio 2016.</span></p><meta charset=\"utf-8\"><h4>Ashleigh Moolman Pasio (SD Worx)&nbsp;</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Picture_by_Alex_Whitehead_SWpix.com_3bf7f931-387c-4ae9-9ac8-f19053f9d5b8_1024x1024.jpg?v=1611850088\" alt=\"\"></p><meta charset=\"utf-8\"><p><em>Photo Credit:&nbsp;Alex Whitehead/<span>SWpix.com</span>&nbsp;</em></p><p><span>After becoming the first ever Esports World Champion in December, Ashleigh Moolman Pasio will now join her new SD Worx team mates in the real world to take on her eleventh season as a professional.</span></p><p><span>The South African had a tumultuous 2020 road season marred by crashes and bad luck. After two years on CCC-Liv, where she never seemed to truly gel, she will round off her career by joining Anna van der Breggen and the rest of the star-studded SD Worx squad until 2022.</span></p><p><span>Moolman Pasio will be hoping that having a strong team around her in 2021 will help her to take her first WorldTour victory. However, while she will benefit from elite trade team support, it will be a different story at the Olympics and World Championships. There she will be the lone female South African, left to fight for a result alone.</span></p><p><span>Nevertheless, the 35-year-old will undoubtedly be looking to better Rio’s 10th place and 12th place respectively at the road and time trial events in Tokyo and make her mark on a World Championships course that suits her.</span></p><meta charset=\"utf-8\"><h4>Cecilie Uttrup Ludwig (FDJ Nouvelle Aquitaine Futuroscope)</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Picture_by_Alex_Whitehead_SWpix.com_-_28_09_2019_-_Cycling_-_2019_UCI_Road_World_Championships_1024x1024.jpg?v=1611850174\" alt=\"\"></p><p>&nbsp;<em>Photo Credit:&nbsp;Alex Whitehead/<span>SWpix.com</span>&nbsp;</em></p><p><span>Cecilie Uttrup Ludwig announced her arrival by taking some big results as an U23 rider that promised great things in her future. The Danish rider, still only 25-years-old, has since come good on that promise. So confident in the young Dane’s future was her current team (FDJ Nouvelle Aquitaine Futuroscope), that they offered her a two-year contract extension without her even having raced for the team yet.</span></p><p><span>Having quickly become a fan-favourite thanks to some characterful interviews, and after building an illustrious palmares, one thing has eluded Uttrup Ludwig in her pro journey thus far: a WorldTour win. She scored numerous top-10 finishes in 2020 – including a fourth-place finish at the Giro Rosa which saw her top the mountains classification and eight at the world championships, But Uttrup Ludwig hasn’t quite been able to reach the top step at WorldTour level and will be hoping to remedy that in 2021.</span></p><p><span>Aside from searching for a WorldTour win, Uttrup Ludwig will be focusing on representing Denmark in Tokyo at what will be her first Olympic Games. As an all-rounder who has good form in tough one-day races Uttrup Ludwig has a good chance in the race if she can go toe-to-toe with some of the bigger nations in the race.</span></p><meta charset=\"utf-8\"><h4>Amanda Spratt (Team BikeExchange)</h4><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Picture_by_Zac_Williams_SWpix.com_1024x1024.jpg?v=1611850213\" alt=\"\"></p><p><em>Photo Credit:&nbsp;Zac Williams/<span>SWpix.com</span></em></p><p><span>Amanda Spratt faces the task of filling some big shoes in 2021. The Australian will be moving into the leadership role at team BikeExchange, a role previously held by the inimitable Annemiek van Vleuten.</span></p><p><span>The 33-year-old is more than capable, however. She has expressed her confidence in taking up the leadership mantle on the Australian team. After having to hold back or sacrifice herself in her former support role, Spratt will now be free to chase her own ambitions instead of chasing down breaks. An all-rounder who excels on climbs, Spratt has spent her entire career on the squad, formerly Mitchelton-Scott, which has had a change of title sponsor and bikes for 2021. While working for van Vleuten, Spratt is sure to have learned a thing or two from the dominant Dutchwoman and will be hoping to put that into practise this season.&nbsp;</span></p><p><span>Spratt has claimed two podium finishes at the world championships in the past three years but has yet to take a big WorldTour win, although likely due more to her support role than a lack of capability. Expect to see Spratt in her best form at the Olympic Games with the Australian national team as well as the World Championships which appear to suit the all-rounder. Elsewhere, though, look out for her finally unleashing her full potential in the Women’s WorldTour races.</span></p><h4>Look out for these names, too:</h4><p>Liane Lippert (Team DSM)</p><p>Kasia Niewiadoma (Canyon//SRAM)</p><p>Grace Brown (BikeExchange)</p><p>Niamh Fisher-Black (SD Worx)</p><p>Lorena Wiebes (Team DSM)&nbsp;</p><p>Demi Vollering (SD Worx)</p><p>Mavi Garcia (Alé BTC Ljubljana)</p><p>Ella Harris (Canyon//SRAM)</p><p>Lizzy Banks (Ceratizit-WNT)</p><p>Lotte Kopecky (Liv Racing)</p><p>Mikayla Harvey (Canyon//SRAM)</p><p>Lisa Brennauer (Ceratizit-WNT)</p></div></div>","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"5231e8641a2a8f65121792f1eeaa96f0c108bcfeebeadea9fbfaf31dedad57f3","category":"Cycling"}