{"title":"Mobile Ad Companies Form 'Post-IDFA Alliance' to Navigate Upcoming App Tracking Transparency Changes","link":"https://www.macrumors.com/2021/02/17/post-idea-alliance-app-tracking-changes-apple/","date":1613599338000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/17/post-idea-alliance-app-tracking-changes-apple/\"><p>A group of mobile advertising companies today announced the launch of the Post-IDFA Alliance, a partnership that's designed to help marketers and app developers adjust to the ad tracking changes that Apple is implementing with the launch of iOS 14.5, reports <em><a href=\"https://www.reuters.com/article/BigStory12/idUSKBN2AH2D9\">Reuters</a></em>.</p><p><img alt=\"post idfa alliance\" width=\"2000\" height=\"1099\" src=\"https://images.macrumors.com/t/7jQSN-8vRA7q1hEAChGEEl8w8kM=/400x0/filters:quality(90)/article-new/2021/02/post-idfa-alliance.jpg?lossy\" data-src=\"https://images.macrumors.com/t/7jQSN-8vRA7q1hEAChGEEl8w8kM=/400x0/filters:quality(90)/article-new/2021/02/post-idfa-alliance.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/7jQSN-8vRA7q1hEAChGEEl8w8kM=/400x0/filters:quality(90)/article-new/2021/02/post-idfa-alliance.jpg?lossy 400w,https://images.macrumors.com/t/J-rVchtMkwOGbqo-f-cgjClUztE=/800x0/filters:quality(90)/article-new/2021/02/post-idfa-alliance.jpg?lossy 800w,https://images.macrumors.com/t/R-RY7Gu7G3EtNp1R1YXHyE2uxeo=/1600x0/filters:quality(90)/article-new/2021/02/post-idfa-alliance.jpg 1600w,https://images.macrumors.com/t/g02YOIMmdzDuX3lyPvmqnr0L9m8=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/post-idfa-alliance.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/7jQSN-8vRA7q1hEAChGEEl8w8kM=/400x0/filters:quality(90)/article-new/2021/02/post-idfa-alliance.jpg?lossy 400w,https://images.macrumors.com/t/J-rVchtMkwOGbqo-f-cgjClUztE=/800x0/filters:quality(90)/article-new/2021/02/post-idfa-alliance.jpg?lossy 800w,https://images.macrumors.com/t/R-RY7Gu7G3EtNp1R1YXHyE2uxeo=/1600x0/filters:quality(90)/article-new/2021/02/post-idfa-alliance.jpg 1600w,https://images.macrumors.com/t/g02YOIMmdzDuX3lyPvmqnr0L9m8=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/post-idfa-alliance.jpg 2500w\"><br>The <a href=\"https://noidfanoproblem.com/\">Post-IDFA Alliance</a> will offer up tips that will help advertisers and developers get effective ads in front of customers and measure the efficiency of those ad campaigns. The group is planning to offer videos, webinars, and other materials to help advertisers understand how to use data in an \"Apple-friendly manner.\"</p><p>\"No IDFA? No Problem,\" reads the website, which also offers articles like \"What does the IDFA change mean? and \"How does SKAdNetwork work?\" SKAdNetwork is a privacy-focused ad platform that Apple is providing to developers as an alternative to current ad tracking measures.</p><p>The partnership includes Liftoff, Fyber, Chartboost, Singular, InMobi and Vungle, all of which are mobile advertising companies that will be impacted by Apple's upcoming changes.</p><p>Starting with the launch of iOS 14.5, Apple will begin enforcing App Tracking Transparency, a feature first announced when <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a> debuted following the Worldwide Developers Conference in June. Apple <a href=\"https://www.macrumors.com/2020/09/03/apple-delay-ad-anti-tracking-ios-14/\">delayed the implementation</a> of the feature to give developers extra time to adjust, but the delays are ending in early spring.</p><p>With App Tracking Transparency, developers are no longer able to access a user's IDFA or advertising identifier on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> without first obtaining express user permission. When access to the IDFA is declined, apps are also expected not to use workaround methods to track users against their wishes as well.</p><p>The IDFA is used by app developers and ad companies to track user behavior across apps and websites for ad targeting purposes, something that will no longer be possible when people begin declining to allow ad tracking functionality.</p><p>Users will be able to disable ad tracking on an app-by-app basis, with apps required to show a pop up that will ask users if they want to be tracked. Ad companies assume that the majority of people are going to decline this request, which will have a broad impact on advertising on iOS devices going forward.</p><p>Facebook has been the <a href=\"https://www.macrumors.com/2020/12/16/facebook-takes-out-full-page-ads-to-attack-apple/\">most vocally against</a> Apple's planned ad tracking changes because App Tracking Transparency will impact Facebook's ad revenue. Facebook has claimed that Apple is <a href=\"https://www.facebook.com/business/news/ios-14-apple-privacy-update-impacts-small-business-ads\">harming small businesses</a>, but Facebook's <a href=\"https://www.macrumors.com/2020/12/23/facebook-employees-criticize-apple-campaign/\">own employees</a> have criticized the anti-Apple campaign and the EFF <a href=\"https://www.macrumors.com/2020/12/19/eff-calls-facebook-criticism-of-apple-laughable/\">has called</a> Facebook's efforts to get Apple to drop the privacy changes \"laughable.\"</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/14/heart-month-activity-challenge/\">Apple's Heart Month Activity Challenge Requires 60 Minutes of Exercise on Valentine's Day</a></h3><p>Saturday February 13, 2021 10:15 pm PST by <a href=\"https://www.macrumors.com/author/frank-mcshan/\" rel=\"author\">Frank McShan</a></p><p>Today only, Apple Watch owners can complete a new Apple Watch activity challenge in celebration of Heart Month, which is aimed at promoting cardiovascular health. The challenge, which is listed in the Fitness app on the iPhone, tasks users with earning 60 minutes on their Exercise ring. Show your heart some love. Get this award by earning 60 minutes on your Exercise ring this Valentine's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/prosser-airtags-ipad-pro-next-month/\">Leaker Jon Prosser Claims AirTags and New iPad Pro to Be Announced Next Month</a></h3><p>Friday February 12, 2021 11:56 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple is slated to release a number of new products this year, and the first round of products could be just a few weeks away. YouTuber Jon Prosser, who has a mixed track record when it comes to reporting on Apple's plans, claims that AirTags and brand new iPad Pro models are set to be announced next month, presumably via a virtual event. Prosser, who runs the tech-news show \"Front Page...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/one-last-intel-mac/\">Apple Surprisingly Sticking With Intel Chips for One Last Mac</a></h3><p>Despite having begun the transition towards using its own custom silicon across the Mac product lineup, somewhat surprising recent rumors have suggested that Apple may continue to use Intel chips for one Mac model. Last year at WWDC, Apple announced plans to transition away from Intel chips to Macs built with its own Apple Silicon, such as the M1 chip, starting in late 2020. It set out its ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/13/zuckerberg-facebook-inflict-pain-on-apple-privacy/\">Mark Zuckerberg Reportedly Told Staff Facebook Needs to 'Inflict Pain' on Apple Over Privacy Dispute</a></h3><p>Saturday February 13, 2021 2:33 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple and Facebook have been in a very public spat over the course of the last few months as Apple dials up its pro-privacy stance. The two companies have long had tension, but more recently, Facebook is taking shots at an upcoming iOS and iPadOS feature that will require apps and data companies such as Facebook to ask for users' permission before tracking them across other sites and websites. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/ipad-2021-major-upgrade/\">Major Upgrades Coming to the iPad in 2021</a></h3><p>Apple is looking to launch an updated ninth-generation iPad with a larger display, the A13 Bionic chip, 4GB of RAM, and a thinner, lighter design in the first half of this year, according to recent reports. Reports from cnBeta and Mac Otakara, citing supply chain sources in China, have offered similar projections for the ninth-generation ‌iPad, explaining that the updated device will...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"52e162d5eb81a886f1d90c1cf604a0bf185788189a173ca85037f601b4245dc1","category":"Apple"}