{"title":"How Lizzie Deignan’s accidental all-or-nothing attack ended up making history","link":"https://cyclingtips.com/2021/10/how-lizzie-deignans-accidental-all-or-nothing-attack-ended-up-making-history/","date":1633192805000,"content":"<div><div><p>“When in doubt, lead it out,” is a popular saying when it comes to small group sprints or winning from a breakaway. Before the start of Paris-Roubaix Femmes the general consensus from riders, directors, news, everyone was that no one knew what was going to happen. Without anything to compare it to, predicting the outcome of Paris-Roubaix Femmes was near impossible.</p><p>In her post-race interview, Deignan said she knew she needed to hit the cobbles first, for her leaders. What she was not expecting was the immediate gap she managed to get when doing so.</p><p>“This was really not the plan,” she said. “I needed to be at the front in the first cobble section to protect my leaders. I was kind of the third rider today, actually. I looked behind after the first cobbles, there was a gap, and I thought, ‘well, at least, if I’m in the front, they have to chase me’, so I just kept going.”</p><p>With that uncertainty in mind, it makes complete sense that Lizzie Deignan would go for a long-range attack in the inaugural Paris-Roubaix for women. Even more so given that the course was wet.</p><p>Roubaix is about controlling the controllable, and with Paris-Roubaix little is controllable. Out front, a rider has control of their speed, their lines on the pavé, and they have a headstart on any mechanicals that may happen. There are no riders unexpectedly slipping on a cobble and taking you out, no one riding into you from behind. There was even one crazy moment where Lotte Kopecky was riding to the left side with her arm up, perhaps with a flat tire, and when she tried to get back onto the cobbles she rode straight across the road and t-boned another rider. Stuff like that doesn’t happen when you’re alone.</p><p>Deignan hit the first sector of cobbles, the Hornaing à Wandignies, with a few meters gap from the next rider. By the end of the 3.7 km section of pavé Deignan had half a minute lead on the peloton. Over the next few sectors of cobbles, Deignan’s lead grew while the peloton behind her shrunk. The number of riders who would be able to make an impact on this race was already small. Confidence on the bike made all the difference. By the third sector of cobbles, the peloton was already reduced to only 32 riders. By the first five star sector the Mon-en-Pévèle that group of 32 was blown apart.</p><p>Watching the women ride the Mon-en-Pévèle sector it was obvious that Deignan had the easiest ride over the mud that had eclipsed the cobbles. World Champion Elisa Balsamo couldn’t keep her bike upright in the mud, and neither could a handful of other riders in the chasing group. Deignan picked her line perfectly and sailed over the treacherous wet cobbles faster than those behind her. At one point her rear wheel fishtailed, but Deignan effortlessly held herself upright, something that would have been harder to accomplish with other people right behind or to the side of her.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Screen-Shot-2021-10-02-at-6.50.30-PM-1340x712.png\"></figure><p>Although the finale was unpredictable, the fact that the race would be chaotic was easy to call. And chaotic it was. Even if there had been enough chasers to bring Deignan’s advantage down, there is little space in between cobbled sections to do so. Other than Trek-Segafredo, only Jumbo-Visma and Movistar had more than three riders still in the race. With barely 6 km between sectors finding the space to organize a chase wasn’t easy. With 15 km to go the group shrunk further, a combination of Marianne Vos upping the pace and a patch of mud that eliminated Christine Majerus, Sarah Roy, and Ellen van Dijk from the fight.</p><p>Only the G.O.A.T. Vos could challenge Deignan, and her tactic was the same: go solo.</p><p>Deignan’s advantage in the final was the time she gained when the peloton behind her flailed in the mud. Her confidence and experience on a bike led to an advantage of over a minute with 9 km to go. Mathematically, there wasn’t enough road left in the race for Vos to catch Deignan. Even if the original move was an accident, the gamble to keep on going once she found herself with a gap won Deignan the race.</p><p>Behind Deignan, both Vos and Elisa Longo Borghini in third rode solo into the velodrome.</p><p>Deignan was a favourite for a handful of top races in 2021. From the spring Classics to the Olympic Games, her name was always on the list. But it wasn’t the season she was hoping for. She struggled in the spring due to illness, and at the Olympics, she didn’t have enough teammates to affect the outcome. She’s been close to wins all year but something always got in the way.</p><p>Now her name will grace the showers of the Roubaix velodrome. She will be remembered for years and years to come as the first woman, and first Brit, to win Paris-Roubaix.</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"52fa91dee78156a2fa2371bf5449fa746ec60c565654986adb27db4896bc7071","category":"Cycling"}