{"title":"White House signals coming antitrust push with Tim Wu appointment","link":"https://arstechnica.com/?p=1747383","date":1614967287000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>go big —</h4><h2 itemprop=\"description\">The nod indicates that the new administration isn't planning to go easy on tech.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1281976224-800x533.jpg\" alt=\"The White House South Lawn, which is unfortunately not the view most folks working for a presidential administration have. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1281976224.jpg\" data-height=\"3552\" data-width=\"5328\">Enlarge</a> <span>/</span> The White House South Lawn, which is unfortunately not the view most folks working for a presidential administration have.</p></figcaption></figure><p>Longtime tech critic Tim Wu is joining the Biden administration as an adviser on technology and competition, a signal that the White House is likely to push for policies that rein in Big Tech.</p><p>Wu will be serving on the National Economic Council as special assistant to the president for technology and competition policy, the <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/05/white-house-announces-additional-policy-staff/\">White House</a> said this morning. Wu confirmed the news <a href=\"https://twitter.com/superwuster/status/1367814526159253506\">in a tweet</a>.</p><p>Wu is best known in tech circles as the man who coined the term \"net neutrality\" in the early 2000s. He has held several positions at the federal level before, including advisory roles with both the Federal Trade Commission and the National Economic Council. He has also been a full professor at Columbia University law school since 2006, where he teaches <a href=\"https://arstechnica.com/tech-policy/2012/06/do-you-lose-free-speech-rights-if-you-speak-using-a-computer/\">First Amendment</a> and <a href=\"https://www.wired.com/story/tim-wu-says-us-must-enforce-antitrust-laws/\">antitrust</a> law.</p><p>His 2010 book <em><a href=\"https://arstechnica.com/tech-policy/2010/12/ars-book-review-the-master-switch-by-tim-wu/\">The Master Switch</a></em> argued that the open Internet as we knew it was barreling toward a closed-off, walled-garden future. In 2018 he published another book, <a href=\"https://www.publishersweekly.com/978-0-9997454-6-5\"><em>The Curse of Bignessem</em></a>, in which he argued that US regulators' failure to enforce antitrust laws had led to \"a new gilded age\" and all its attendant problems.</p><p>Several prominent progressive Democratic lawmakers applauded the move. \"Tim has been a longtime antitrust advocate, and he has pushed public officials to break up and rein in Big Tech,\" said Sen. Elizabeth Warren (D-Mass.), who <a href=\"https://arstechnica.com/tech-policy/2019/03/elizabeth-warren-proposes-breaking-up-amazon-google-and-facebook/\">called for Big Tech breakups</a> during her unsuccessful presidential primary run in 2019. \"I’m glad to see him in this role.\"</p><p>Sen. Amy Klobuchar (D-Minn.), who recently proposed a bill that would be <a href=\"https://arstechnica.com/tech-policy/2021/02/klobuchar-targets-big-tech-with-biggest-antitrust-overhaul-in-45-years/\">the biggest antitrust overhaul since 1976</a> if enacted, also issued a statement in support of Wu's new job. \"It is clear this administration is serious about promoting competition in the United States,\" Klobuchar said. \"America has a major monopoly problem that must be urgently addressed... I look forward to working with Tim to modernize antitrust enforcement, strengthen our economy, and protect workers and consumers.\"</p><p>Those who oppose his policy goals seem to worry about how seriously the White House may now be taking him. One industry lobbyist, critical of Wu, <a href=\"https://www.protocol.com/policy/tim-wu-appointment-big-tech\">told Protocol</a> that the appointment \"should not be hand-waved away... This could be dangerous.\"</p><p>All that said, Wu's new role does not put him in a position to come leaping in with a metaphorical sledgehammer and start smashing up companies. The White House can make all the suggestions it wants, but actual antitrust enforcement comes from the Department of Justice and the FTC, both of which are still waiting to have new leadership nominated or confirmed. (Wu's appointment to the NEC makes it clear he is not landing at either of those agencies, although the <a href=\"https://theintercept.com/2021/01/28/antitrust-facebook-merrick-garland/\">Washington rumor mill</a> had considered him a candidate for both.)</p><p>Both agencies, however, are already neck-deep in landmark cases against Big Tech Firms. The FTC and a coalition of 47 states&nbsp;<a href=\"https://arstechnica.com/tech-policy/2020/12/ftc-48-states-file-suits-to-break-up-instagram-and-whatsapp-from-facebook/\">filed antitrust suits in December seeking to break up Facebook</a>, arguing that its acquisitions of Instagram and WhatsApp were anticompetitive and should not have been allowed to happen.</p><p>Similarly, the DOJ and multiple groups of states have <a href=\"https://arstechnica.com/tech-policy/2020/10/what-we-know-about-the-dojs-antitrust-case-against-google-so-far/\">filed major cases against Google</a>, arguing that the search-advertising-phone-everything giant behaves anticompetitively. Although those suits, now mostly consolidated, do not explicitly seek a breakup of Google, they do stress that \"structural remedies\" may be necessary.</p></div></div>","author":"Kate Cox","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"538e02015228331d1bca66bb2e0567ad65248155e44e9fdefeddc361d05af0a8","category":"Tech"}