{"title":"We’re living on a planet of ants","link":"https://arstechnica.com/?p=1747602","date":1615042803000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>They're everywhere —</h4><h2 itemprop=\"description\">A new book looks at the amazing behaviors of ants and the people who study them.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-05-at-9.44.01-PM-800x807.png\" alt=\"We’re living on a planet of ants\"><figcaption></figcaption></figure><p><span>Susanne Foitzik is a proud myrmecologist: an entomologist who specializes in ants (it was a new vocab word for me, too). Her lab at the Ludwig Maximilian University of Munich studies the dynamics between slave-making ant species, which capture ants of other species and get them to work for them, and the host species they exploit. What genetic changes have turned a species of diligent worker ants like </span><i><span>Temnothorax longispinosus</span></i><span> into ravaging hordes of slave makers like </span><i><span>Temnothorax americanus</span></i><span>?</span></p><p><span>And what induces the enslaved ant workers to rise up in revolt, killing their oppressor’s pupae? (This is not metaphorical; it really happens). Ant eggs and larvae don’t yet make a species-specific scent, so the enslaved nursemaids caring for them think they’re rearing the young of their own colony. Once the babes hit the pupal stage, though, they start to stink like the slave-makers they are destined to become and their caretakers realize they’ve been duped. At that point they “bite the defenseless young insects to death, rip them to shreds, and throw them out of the nesting chamber.”</span></p><h2>A labor of love</h2><p><span>Dr. Foitzik&nbsp;really, really loves ants—even the slave-making kind. That love shines through on every page of her new book, <em><a href=\"https://amzn.to/3sNXa2M\">Empire of Ants: The Hidden Worlds and Extraordinary Lives of Earth's Tiny Conquerors</a></em>,&nbsp;co-authored with Olaf Fritsche. She loves them so much, in fact, that she's chosen to start each chapter with her charming drawings of different ant species engaged in their daily activities (see example above).&nbsp;</span></p><p><span>She writes that there are at least 16,000 known species of ants on Earth, and while she doesn’t introduce us to every single one, we meet plenty of standouts. There's&nbsp;</span><i><span>Anoplolepis gracilipes</span></i><span>, the yellow crazy ant, an invasive species that has taken over Christmas Island in the Indian Ocean and killed tens of millions of the native red Christmas Island crabs since the 1990s. Jaglavak is the driver ant that the Morfu people of Northern Cameroon refer to as the Prince of Insects and who they enlist to fight and expel any termites infiltrating the walls of their dwellings. And </span><i><span>Myrmelachista schumanni</span></i><span>&nbsp;make the monocultural “devil’s gardens” dotting the jungles of Peru and Brazil by killing any plant except for the single species they cultivate as hosts for their nests.&nbsp;</span></p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/IMG-0411-e1614983955743.jpg\" data-height=\"1500\" data-width=\"2000\" alt=\"The author lovingly introduces every chapter with her own hand-drawn images.\"><img alt=\"The author lovingly introduces every chapter with her own hand-drawn images.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/IMG-0411-300x225.jpg\" width=\"300\" height=\"225\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/IMG-0411-640x480.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/IMG-0411-e1614983955743.jpg\" data-height=\"1500\" data-width=\"2000\">Enlarge</a> <span>/</span> The author lovingly introduces every chapter with her own hand-drawn images.</p></figcaption></figure><p><span>Then there’s</span><i><span> Odontomachus bauri</span></i><span>, which has mandibles that snap together in 130 millionths of a second, at 143 miles per hour—”one of the fastest phenomena recorded in the animal world.” No prey can escape. These jaws are used for movement, too: When one of these ants points her jaws down at the ground and bites, the backlash catapults her through the air.</span></p><p><span>Ant societies are meticulously efficient and organized; every individual has a job which she performs without any question, discontent, or hesitation. The queens lay eggs. Different workers tend the larvae, build and maintain the nest, and scout out and forage food. The soldiers guard the entrance to the nest and find and kill prey. Older leafcutter ants go cut up leaves and bring them back for younger leafcutter ants to feed to the fungus that the colony farms as food.&nbsp;</span></p><p><span>Oh, and the males? “Male ants are little more than flying bundles of sperm and by far the most boring ants in a perfectly organized matriarchal state,” writes Dr. Foitzik. They develop from unfertilized eggs, and after one chance of delivering their sperm, they die and are eaten by whoever finds them, often their sisters.&nbsp;</span></p><h2>A first-person tale</h2><p><span>We characterize these ants with human labels: scouts, foragers, wet nurses, queens, soldiers, even farmers and shepherds. But as Dr. Foitzik points out, ants enact their assigned roles purely because of the workings of genetics and natural selection. They are little automatons. We have free will, and moral and rational reasoning. Ant roles are not human roles, and ant societies are not human societies. We just see them and describe them that way because it’s hard for us to imagine any other.</span></p><p><span>As seems to be the trend in poppy science books since </span><i><span>The Immortal Life of Henrietta Lacks</span></i><span>, this one is told from a first person perspective and very prominently features the author. We hear about all the trials and travails poor Dr. Foitzik and her fellow myrmecologists must undergo in their ant studies, both in the field and in the lab. They get all dirty; their research subjects bite them, sting them, and cause them to get detained by customs agents. Sometimes, to their chagrin, the ants even show up on menus.&nbsp;</span></p><p><span>The actual research isn’t easy, either. Apparently it can be really hard to tell individuals apart in the colony they’re studying. And extracting and dissecting the ants’ tiny brains can be technically quite challenging. This can be irksome reading because, presumably, the myrmecologists chose their path; no one forced them to crawl around digging up ant colonies, bring them home on planes, and cut them apart.&nbsp;</span></p><p><span>But overall <em>Empire of Ants</em>&nbsp;provides a great overview of ant life cycles, communication, and colony formation, sprinkled through with really fascinating depictions of some of the weirder species as outlined above. It ends by outlining the ways in which our world and society intersects with theirs. If bugs are your thing (and yes, I know that ants are not technically bugs), it’s worth checking out.&nbsp;&nbsp;&nbsp;</span></p></div></div></div>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"54097908af0549fbf7342a3518efa05cc5be4132c7a289c2cd8b535fbd784dca","category":"Tech"}