{"title":"Announcing a special collaboration in support of The Cyclists’ Alliance","link":"https://cyclingtips.com/2021/07/announcing-a-special-collaboration-in-support-of-the-cyclists-alliance/","date":1625633160000,"content":"<div><div><p>Facebook, Google, Instagram, and influencers have lowered the bar on journalism so much that it’s destroyed the traditional business model for those of us trying to provide quality, trustworthy, authoritative and original reporting for those of you who value it.</p><p>  When I say ‘journalism’ we’re well aware that CyclingTips is not a vital part of democracy and holding truth to power, but we are absolutely obsessed by this sport and want to make sure that we can continue calling BS when we smell it and not be a PR agency. Whether that means honest and uninfluenced product reviews, in-depth reporting on issues in the sport, showcasing the amazing things women are doing in cycling, offering diverse opinions on sensitive topics, and giving our megaphone to unrepresented communities, we proudly do this now, and our members make it possible.</p><p>  VeloClub is changing the game for us. Instead of us needing to bow to disingenuous marketers, press officers, and influential people within the sport and worry about losing an advertising dollar, we chose a different path. Of course we have many valuable advertising partners and we want that to continue. They offer many things that make CyclingTips a better publication for you including athlete access, product for review, tech expertise, and much more. If you see an advertiser on CyclingTips, it means that we believe in them and their product and that it’s in your interest to know about them.</p><p>  What do you get for becoming a member? We offer many things (outlined below) to keep you engaged and to add constant value. But what it comes down to is this: what you get for becoming a member is the knowledge and satisfaction that your contribution is helping us build a better CyclingTips for all to enjoy. We love this sport and want to infect every single person in the world with the same passion as we have for it, and that’s not going to happen with clickbait, advertorials, and all the nasty things the internet incentivises. There’s a reason this website isn’t littered with irrelevant ads, affiliate marketing, and tracking scripts selling your data. Our members keep it that way. We welcome you to be part of the community of thousands who have also joined us in our mission.</p><p>  – Wade Wallace, CyclingTips Founder</p></div></div>","author":"Andy van Bergen","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"55c25ec263b0d4d864f45a3519dd810cc243d325969a35ef0fb9e48ddcccecce","category":"Cycling"}