{"title":"Robinhood says GameStop volatility was a “1 in 3.5 million” black swan","link":"https://arstechnica.com/?p=1743729","date":1613695531000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>A rare bubble —</h4><h2 itemprop=\"description\">CEO Tenev tells House committee quicker trade settlements would prevent a repeat.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/robinhood-app-arrows-800x450.jpg\" alt=\"Ready, take aim, and let fly...\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/robinhood-app-arrows.jpg\" data-height=\"563\" data-width=\"1000\">Enlarge</a> <span>/</span> Ready, take aim, and let fly...</p><p>Aurich Lawson / Getty Images</p></figcaption></figure><p>Robinhood's move to <a href=\"https://arstechnica.com/gaming/2021/01/robinhoods-plan-to-democratize-finance-hit-a-gamestop-shaped-speed-bump/\">temporarily limit purchases of GameStop and other highly volatile stocks</a> in late January was the overwhelming focus of today's <a href=\"https://www.youtube.com/watch?v=RfEuNHVPc_k\">House Committee on Financial Services hearing</a>.</p><p>At the hearing, Robinhood CEO Vlad Tenev said that extreme stock volatility that led to Robinhood's restriction was a \"<a href=\"https://blogs.scientificamerican.com/observations/five-sigmawhats-that/\">five sigma</a>\" event with a \"1 in 3.5 million\" chance of happening. That made the situation practically impossible for the company to plan for, Tenev said. \"In the context of tens of thousands of days in the history of US stock market, a 1 in 3.5 million event is basically unmodelable.\"</p><p>As we've <a href=\"https://arstechnica.com/gaming/2021/01/robinhoods-plan-to-democratize-finance-hit-a-gamestop-shaped-speed-bump/\">covered previously</a>, the high volatility of GameStop and other so-called \"meme stocks\" last month meant Robinhood was suddenly forced to provide much more collateral to the stock clearing houses that actually process its trades. Tenev said Thursday that these collateral obligations increased tenfold between January 25 and January 28, as GameStop rose from $76 a share to over $347, then back down to $193.</p><p>\"Despite unprecedented conditions, what happened is unacceptable to us,\" Tenev said. \"To our customers, I'm sorry, and I apologize. We're doing everything in our power to make sure this won't happen again.\"</p><h2>Where’s the money?</h2><p>Tenev reiterated multiple times that Robinhood never had a liquidity issue in terms of covering its users' actual positions. But the company did lack immediate capital to cover those collateral requirements, which meant its only alternative was to temporarily limit sales of those stocks until it could raise more funds (or until the stocks became less volatile).</p><p>Some members of the House Financial Services Committee were not impressed with that quibbling over what \"liquidity\" means for Robinhood. \"Your customers wanted to buy the stock,\" Rep. Van Taylor (R-Texas) said at one point. \"You wouldn’t let them do it because you didn’t have the capital to allow them to do it.\"</p><p>Tenev was also taken to task for not clearly and quickly communicating the reasons behind those restrictions to customers. Rep. Carolyn Maloney (D-N.Y.) noted that Robinhood's <a href=\"https://blog.robinhood.com/news/2021/1/28/keeping-customers-informed-through-market-volatility\">initial January 28 blog post</a> announcing the restrictions contained \"no disclosures about capital requirements\" and only \"vague language about restricting trading.\" The initial impression, she implied, was that Robinhood was \"[making] up the rules as you go along.\"</p><p>Since it was forced to halt trading, Robinhood has attracted over $3.4 billion in additional investment that Tenev said \"cushions the firm from market volatility and further black swan events.\" And while he was apologetic, Tenev also said that \"other firms did similar things in restricting buying [of these volatile stocks], which suggests it is a systemic problem rather than a uniquely Robinhood problem.\"</p><p>But Rep. Alexandria&nbsp;Ocasio-Cortez (D-N.Y.) pointed out that \"when Robinhood prohibited it customers from purchasing additional shares of certain stocks, other brokerages merely adjusted margin requirements on these stocks.\" That, she suggests, might mean that \"the issue isn't clearinghouses but that you simply didn't manage your own margin rules or failed to manage your own internal risks.\"</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/robinhooderror.jpg\" data-height=\"465\" data-width=\"827\" alt=\"An example of an error message greeting Robinhood users trying to buy certain volatile stocks in late January.\"><img alt=\"An example of an error message greeting Robinhood users trying to buy certain volatile stocks in late January.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/robinhooderror-640x360.jpg\" width=\"640\" height=\"360\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/robinhooderror.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/robinhooderror.jpg\" data-height=\"465\" data-width=\"827\">Enlarge</a> <span>/</span> An example of an error message greeting Robinhood users trying to buy certain volatile stocks in late January.</p></figcaption></figure><p>Some on the committee also focused on Robinhood's business model, which generates a majority of its revenue by selling its \"order flow\" to market makers like Citadel (who then shave a little bit of profit off of the <a href=\"https://www.investopedia.com/terms/p/priceimprovement.asp\">price improvement</a> they can provide over the exchanges). \"When you're not paying for it, it's not free,\" Rep. Brad Sherman (D-Calif.) said regarding Robinhood's commission-free trades. \"You're the product, someone else [i.e., Citadel] is the customer.\"</p><p>\"If removing revenues from payment for order-flow would cause the removal of commission-free trade, doesn't that mean trading on Robinhood isn't actually free to begin with, because you're just hiding the cost?\" Ocasio-Cortez added in some pointed questioning.</p><h2>Deregulate or re-regulate?</h2><p>While Tenev was apologetic for the mistakes Robinhood made, he also placed some blame on what he called outdated and moribund trade settlement rules that place a lot of pressure on the system. Under <a href=\"https://www.schwab.com/resource-center/insights/content/stock-settlement-why-you-need-to-understand-t2-timeline\">the current T+2 timeline for stock settlement</a>, market makers actually have two full days to officially settle a trade (i.e., transfer the shares/cash) after it's made. When a stock's price is especially volatile, the clearinghouse needs more collateral to cover the potential price changes that could happen on either side of the trade in that two-day interval.</p><p>\"The existing two-day period to settle trade exposes investors and the industry to unnecessary risk,\" Tenev said. \"There is no reason why the greatest financial system in the world can not settle trades in real time.... If we had real-time settlement capability and infrastructure was modernized, we wouldn’t have seen similar problems.\"</p><p>Ken Griffin, CEO of Citadel, stopped short of asking for real-time trade settlement in his testimony to the committee. But he said that relaxing the rules to a one-day turnaround would \"reduce counter-party risk holistically.\" While instant or same-day clearing of trades would be nice, Griffin said it would essentially require \"all systems... to function at all times every day with no room for error.\"</p><p>Rep. Andy Barr (R-Ky.) pointed out through his questioning that the current capital requirements were put in place in <a href=\"https://en.wikipedia.org/wiki/Dodd%E2%80%93Frank_Wall_Street_Reform_and_Consumer_Protection_Act\">2010's Dodd-Frank Wall Street Reform bill</a>. \"If anyone has a problem with [Robinhood]'s decision, their frustration should be with federal regulations,\" he said. Rep. William Timmons (R-S.C.) added that Dodd-Frank is \"arguably to blame for this exorbitant capital requirement that you weren’t able to meet... Well-intentioned legislation is somewhat responsible.\"</p><p>Other House members, like Rep. Rashida Tlaib (D-Mich.) argued forcefully for a 0.1 percent financial transactions tax, which would discourage speculative betting on meme stocks and limit algorithm-driven high-frequency trading. She noted that Hong Kong implemented a financial transactions tax that's twice as large, limiting high-frequency trading without hurting that market's significant growth.</p><p>But Jennifer Schulp, director of Financial Regulation Studies at the free-market-focused Cato Institute, told the committee such taxes \"often fail to raise money and distort trading in a way that's unforeseen. A financial-transaction tax might seem like a small imposition, but it often hurts individual investors' long-term goals by affecting institutions that do the trading.\"</p><p>While Schulp allowed that a financial-transactions tax might decrease total volatility in the market, she added that she doesn't think it would have had that effect in the particular case of GameStop's recent stock moves, which were driven primarily by heavy buying.</p><h2>Diamond hands</h2><p>To represent the retail traders who helped drive the GameStop bubble, the committee heard from Keith Gill, aka DeepFuckingValue on Reddit. He first invested in GameStop in mid-2019 (when the stock was valued at under $10) and heavily hyped the stock's value on the WallStreetBets subreddit. \"The market was underestimating the prospects of GameStop's legacy business and overestimating the risks of bankruptcy,\" he said. \"I grew up playing video games and shopping at GameStop, and I plan to keep shopping there. GameStop stores provide real value to gamers and real revenue to GameStop.\"</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/dfv.png\" data-height=\"1098\" data-width=\"2170\" alt=\"In a WallStreetBets post from September 2019, Keith Gill shows off the value of the GameStop stock in his portfolio, well before its meteoric rise.\"><img alt=\"In a WallStreetBets post from September 2019, Keith Gill shows off the value of the GameStop stock in his portfolio, well before its meteoric rise.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/dfv-640x324.png\" width=\"640\" height=\"324\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/dfv-1280x648.png 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/dfv.png\" data-height=\"1098\" data-width=\"2170\">Enlarge</a> <span>/</span> In a WallStreetBets post from September 2019, Keith Gill shows off the value of the GameStop stock in his portfolio, well before its meteoric rise.</p></figcaption></figure><p>Gill, who has now made millions off an initial investment of about $50,000, said he still thinks GameStop is an attractive investment at its current price of about $40 a share. His optimism is thanks in large part to GameStop's potential to pivot to a more focused e-commerce strategy. \"As for me, I like the stock,\" he said. \"I'm as bullish as I've ever been on a potential turnaround, and I remain invested in the company.\"</p><p>Less represented at the hearing were the many other investors who bought into the stock at or near its peak in late January, only to see their investments crumble in days. Rep. Jim Himes (D-Conn.) brought up the case of Salvador Vergara, who took out a $20,000 personal loan to invest in GameStop only to see his stock's value go down 80 percent in days. \"We need to be thoughtful about this,\" Himes said, regarding how to deal with retail investors' access to the market.</p><p>The committee also heard from Reddit co-founder and CEO Steve Huffman, who said Reddit had found no evidence of bots or foreign agents playing a significant role in trying to unduly pump up any stock through the WallStreetBets subreddit. \"We will comply with requests from regulators, but we believe the community was well within bounds of our own policies,\" he said.</p><p>\"It's a real community,\" Huffman continued, regarding WallStreetBets. \"The self-deprecating jokes, memes, and crass at times language reflect that. There's a significant depth to the community based on the affinity users show for each other.\"</p></div></div>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5656fbaa786294bcf6229813eb97d27f4561f240912bfc38aa1cfccb9de96953","category":"Tech"}