{"title":"YouTube's iOS App Gets First Update in Two Months","link":"https://www.macrumors.com/2021/02/12/youtube-ios-update/","date":1613188770000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/12/youtube-ios-update/\"><p>Google today finally updated its <a href=\"https://apps.apple.com/us/app/-/id544007664\">YouTube iOS app</a> for the first time in over two months, becoming one of the highest-profile Google apps to see an update since early December when Apple began requiring that developers disclose privacy practices for each of their apps in order to have their updates approved.</p><p><img alt=\"youtube ios update\" width=\"1200\" height=\"675\" src=\"https://images.macrumors.com/t/SnPdl87vKgQwwHBoLAiytQ3S8OY=/400x0/filters:quality(90)/article-new/2021/02/youtube-ios-update.jpg?lossy\" data-src=\"https://images.macrumors.com/t/SnPdl87vKgQwwHBoLAiytQ3S8OY=/400x0/filters:quality(90)/article-new/2021/02/youtube-ios-update.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/SnPdl87vKgQwwHBoLAiytQ3S8OY=/400x0/filters:quality(90)/article-new/2021/02/youtube-ios-update.jpg?lossy 400w,https://images.macrumors.com/t/mPxvsF9OioVkc4IvEBvXpyWqTnc=/800x0/filters:quality(90)/article-new/2021/02/youtube-ios-update.jpg?lossy 800w,https://images.macrumors.com/t/748yoNmxqbKOMM5st_5SIM9FJyU=/1600x0/filters:quality(90)/article-new/2021/02/youtube-ios-update.jpg 1600w,https://images.macrumors.com/t/FPVxJdEV6j-tG5phcrXWx99eI0c=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/youtube-ios-update.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/SnPdl87vKgQwwHBoLAiytQ3S8OY=/400x0/filters:quality(90)/article-new/2021/02/youtube-ios-update.jpg?lossy 400w,https://images.macrumors.com/t/mPxvsF9OioVkc4IvEBvXpyWqTnc=/800x0/filters:quality(90)/article-new/2021/02/youtube-ios-update.jpg?lossy 800w,https://images.macrumors.com/t/748yoNmxqbKOMM5st_5SIM9FJyU=/1600x0/filters:quality(90)/article-new/2021/02/youtube-ios-update.jpg 1600w,https://images.macrumors.com/t/FPVxJdEV6j-tG5phcrXWx99eI0c=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/youtube-ios-update.jpg 2500w\"><br>Most of Google's apps <a href=\"https://www.macrumors.com/2021/01/20/google-ios-apps-still-no-privacy-labels/\">have yet to be updated</a> since the requirement went into effect, even though Google <a href=\"https://www.macrumors.com/2021/01/05/google-ios-apps-privacy-labels-update/\">said in early January</a> that it would be adding privacy data for its apps within the following week or so.</p><p>Google had actually already added privacy information for the YouTube app prior to today's update, as <a href=\"https://appleterm.com/2021/02/02/google-adds-privacy-labels-to-youtube-reveals-what-user-data-it-collects/\">noted earlier this month</a> by <em>Apple Terminal</em>. Still, it's notable that the app itself has seen its first update since December 7, as Google has typically pushed updates for the YouTube app every week or two.</p><p>Many other major Google apps like Google, Google Chrome, Gmail, Google Maps, and Google Meet have still not been updated and do not have privacy information displayed on their <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> listings. Google-owned Waze did finally update its iOS app a few days ago, adding privacy information as part of the update as required by Apple.</p><p>Google has denied that it is holding back iOS app updates in order to delay revealing its privacy practices, but many users have found that hard to believe considering the sudden slowing of app updates coinciding with Apple's disclosure deadline and continued updates for Google's various Android apps.</p><p>Earlier this week, the Gmail iOS app even <a href=\"https://www.macrumors.com/2021/02/10/gmail-ios-out-of-date-warning/\">began displaying \"out of date\" warnings</a> when trying to add a new account, even though there is no new version of the app available and there have been no updates to the Gmail iOS app since December 1.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/useful-mac-accessories-worth-checking-out/\">Useful Mac Accessories Worth Checking Out</a></h3><p>Wednesday February 10, 2021 1:21 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>If you recently picked up one of the new M1 Macs that Apple released in November, or received a new Mac for the holidays, you may be in search of useful accessories to go along with it. In our latest YouTube video, we rounded up some great Mac accessories that are worth checking out. Subscribe to the MacRumors YouTube channel for more videos. MacRumors videographer Dan has highlighted several ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/intel-anti-mac-ad-campaign/\">Intel's Anti-Mac Ad Campaign Highlights M1 Shortcomings</a></h3><p>Thursday February 11, 2021 5:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of the M1 Macs last November, Apple officially began its transition away from Intel's chips, and it's clear from Intel's latest advertising campaign that the company is feeling threatened by Apple's decision. In ads shared on Twitter, Intel has been highlighting the shortcomings of Apple's M1 Mac lineup. An ad this week, for example, points out the gaming capabilities of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/apple-privacy-chief-slams-north-dakota-bill/\">Apple Privacy Chief: North Dakota Bill 'Threatens to Destroy the iPhone as You Know It'</a></h3><p>Wednesday February 10, 2021 1:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>The North Dakota Senate this week introduced a new bill that would prevent Apple and Google from requiring developers to use their respective app stores and payment methods, paving the way for alternative app store options, reports The Bismarck Tribune. According to Senator Kyle Davison, who introduced Senate Bill 2333 yesterday, the legislation is designed to \"level the playing field\" for...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/2016-2017-macbook-pro-battery-charging-issue/\">Apple Offering Free Battery Replacements for 2016-2017 MacBook Pros That Can't Charge Past 1%</a></h3><p>Tuesday February 9, 2021 4:45 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today released macOS Big Sur 11.2.1 to address an issue that may prevent the battery from charging in some 2016 and 2017 MacBook Pro models, and the company has since shared a new support document with more details. Apple says a \"very small number of customers\" with 2016 and 2017 models of the 13-inch and 15-inch MacBook Pro have experienced an issue with the battery not charging past...</p></div></div></div>","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5736dc6b3a8992b3ab5b4fb5bc708370c0512758964ab9fa84d7b51295c427a4","category":"Apple"}