{"title":"Humanitarian airship seeks world’s most powerful hydrogen fuel cell","link":"https://arstechnica.com/?p=1746037","date":1614614681000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>helium for up, hydrogen for go —</h4><h2 itemprop=\"description\">LTA Research and Exploration is Sergey Brin's airship company.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/sergey-airships-800x450.jpg\" alt=\"Humanitarian airship seeks world’s most powerful hydrogen fuel cell\"><figcaption><p>Aurich Lawson / Getty Images</p></figcaption></figure><p>\"Ironic\" probably isn't the right word to describe the lack of public information about Sergey Brin's airship company. Who better to know the worth of staying private than one of the co-creators of a search engine that changed the world, after all. But to those who know where to look—like <a href=\"https://techcrunch.com/2021/02/25/sergey-brins-airship-will-use-worlds-biggest-mobile-hydrogen-fuel-cell/\">eagle-eyed journalist Mark Hughes</a>—some details about LTA's plans have made it out into the open. Hughes spotted <a href=\"https://www.ltaresearch.com/careers/hydrogen-program-manager/\">a rather revealing job opening</a> at the company for someone to manage a hydrogen fuel cell program.</p><p>The really interesting part of the job posting shows up in the list of primary responsibilities:</p><blockquote><p>Engineering hydrogen fuel cell propulsion system through configuration of 1.5MW airship propulsion system including H2 storage, fuel cells, H2O capture, batteries, stern drive, and smaller electric motors and gear trains and retrofit of 750KW fuel cell system on existing airship</p></blockquote><p>Yes, you did read that correctly, LTA is indeed working on configuring a 1.5 MW fuel cell system. For context, the hydrogen fuel cell that powers <a href=\"https://arstechnica.com/cars/2019/10/the-2021-toyota-mirai-hydrogen-fuel-cell-car-has-more-luxury-less-ugly/\">the Toyota Mirai was just bumped from 113 kW</a> to 128 kW in November, making it ten times less powerful than the system sought by LTA. Even the <a href=\"https://arstechnica.com/cars/2018/07/toyotas-heavy-duty-fuel-cell-truck-project-moves-from-alpha-to-beta/\">500 kW class-8 tractor-trailers</a> that Toyota is testing as drayage trucks at the Ports of LA and Long Beach only use a pair of Mirai fuel cell systems to generate power, and the most powerful hydrogen fuel cell that has taken to the air so far is a 250 kW fuel cell in the ZeroAvia ZA-600, a 20-seat plane with a range of 500 miles (800 km).</p><p>Typically, megawatt-range fuel cells have needed <a href=\"https://spectrum.ieee.org/green-tech/fuel-cells/fuel-cells-finally-find-a-killer-app-carbon-capture\">molten carbonate</a> or <a href=\"https://arstechnica.com/science/2010/02/bloom-energy-fuel-cell-claim-raises-hype-questions/\">solid oxide</a> electrolytes, but these run at extremely high temperatures (500˚C to 1,000˚C) and are much better suited to stationary applications. But LTA isn't the only aviation company that's trying to get to 1.5 MW with a hydrogen fuel cell. In January, the German Aerospace Center (<em>Deutsches Zentrum für Luft- und Raumfahrt</em>, or DLR) <a href=\"https://www.dlr.de/content/en/articles/news/2021/01/20210121_balis-project-funding.html\">was awarded a $31 million (26 million euro) grant</a> to develop a similar system, which it says \"would be enough to allow the development of a regional aircraft with 40 to 60 seats and a range of 1000 kilometres.\"</p><p>That certainly sounds useful if, like LTA, your plan is to build airships for humanitarian missions.</p></div></div>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"576d0ad42ccd63068ef5caa4d189ef4bd332f18f2009d6c0c29d1d0dbfaf64b8","category":"Tech"}