{"title":"Lone high-energy neutrino likely came from shredded star in distant galaxy","link":"https://arstechnica.com/?p=1744691","date":1614199065000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>From a galaxy far, far, away —</h4><h2 itemprop=\"description\">Provides evidence that tidal disruption events can also be cosmic particle accelerators.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/ghost1-800x532.jpg\" alt=\"The remains of a shredded star formed an accretion disk around the black hole whose powerful tidal forces ripped it apart. This created a cosmic particle accelerator spewing out fast subatomic particles.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/ghost1.jpg\" data-height=\"798\" data-width=\"1200\">Enlarge</a> <span>/</span> The remains of a shredded star formed an accretion disk around the black hole whose powerful tidal forces ripped it apart. This created a cosmic particle accelerator spewing out fast subatomic particles.</p></figcaption></figure><p>Roughly 700 million years ago, a tiny subatomic particle was born in a galaxy far, far away and began its journey across the vast expanses of our universe. That neutrino finally reached the Earth's South Pole last October, setting off detectors buried deep beneath the Antarctic ice. A few months earlier, a telescope in California had recorded a bright glow emanating from the friction of that same distant galaxy—evidence of a so-called \"<a href=\"https://en.wikipedia.org/wiki/Tidal_disruption_event\">tidal disruption event</a>\" (TDE), most likely the result of a star being shredded by a supermassive black hole.</p><p>According to two new papers (<a href=\"https://www.nature.com/articles/s41550-020-01295-8\" rel=\"nofollow\">here</a> and <a href=\"https://www.nature.com/articles/s41550-021-01305-3\" rel=\"nofollow\">here</a>) published in the journal Nature Astronomy, that lone neutrino was likely born from the TDE, which serves as a cosmic-scale particle accelerator near the center of the distant galaxy, spewing out high-energy subatomic particles as the star's matter is consumed by the black hole.&nbsp;This finding also sheds light on the origin of ultrahigh-energy cosmic rays, a question that has puzzled astronomers for decades.</p><p>\"The origin of cosmic high-energy neutrinos is unknown, primarily because they are notoriously hard to pin down,\" <a href=\"https://www.eurekalert.org/pub_releases/2021-02/nyu-sls021921.php\">said co-author Sjoert van Velzen</a>, a postdoc at New York University at the time of the discovery. \"This result would be only the second time high-energy neutrinos have been traced back to their source.\"</p><p><a href=\"https://www.scientificamerican.com/article/what-is-a-neutrino/\">Neutrinos</a>&nbsp;travel very near the speed of light. John Updike's 1959 poem, \"<a href=\"https://www.symmetrymagazine.org/article/february-2011/deconstruction-cosmic-gall\">Cosmic Gall</a>,\" pays tribute to the two most defining features of neutrinos: they have no charge and, for decades, physicists believed they had no mass (they actually have a teeny bit of mass). Neutrinos are the most abundant subatomic particle in the universe, but they very rarely interact with any type of matter. We are constantly being bombarded every second by millions of these tiny particles, yet they pass right through us without our even noticing. That's why Isaac Asimov dubbed them \"ghost particles.\"</p><p>That low rate of interaction makes neutrinos extremely difficult to detect, but because they are so light, they can escape unimpeded (and thus largely unchanged) by collisions with other particles of matter. This means they can provide valuable clues to astronomers about distant systems, further augmented by what can be learned with telescopes across the electromagnetic spectrum, as well as gravitational waves. Together, these difference sources of information have been dubbed \"multi-messenger\" astronomy.</p><p>The majority of neutrinos that reach the Earth come from our own Sun, but every now and then, neutrino detectors pick up the rare neutrino that hails from further afield. Such is the case with this latest detection: a neutrino that began its journey in a faraway, as yet-unnamed-galaxy in the constellation Delphinus, born from the death throes of a shredded star.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/ghost2.jpg\" data-height=\"798\" data-width=\"1200\" alt=\"A view of the accretion disc around the supermassive black hole, with jet-like structures flowing away from the disc. The extreme mass of the black hole bends spacetime, allowing the far side of the accretion disc to be seen as an image above and below the black hole.\"><img alt=\"A view of the accretion disc around the supermassive black hole, with jet-like structures flowing away from the disc. The extreme mass of the black hole bends spacetime, allowing the far side of the accretion disc to be seen as an image above and below the black hole.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/ghost2-640x426.jpg\" width=\"640\" height=\"426\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/ghost2.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/ghost2.jpg\" data-height=\"798\" data-width=\"1200\">Enlarge</a> <span>/</span> A view of the accretion disc around the supermassive black hole, with jet-like structures flowing away from the disc. The extreme mass of the black hole bends spacetime, allowing the far side of the accretion disc to be seen as an image above and below the black hole.</p><p>DESY, Science Communication Lab</p></figcaption></figure><p>As <a href=\"https://arstechnica.com/science/2020/10/death-by-black-hole-astronomers-spot-flare-from-spaghettification-of-star/\">we've reported</a> previously, it's a popular misconception that black holes behave&nbsp;<a href=\"https://www.forbes.com/sites/startswithabang/2019/06/19/no-black-holes-dont-suck-everything-into-them/#e9257c02b01b\">like cosmic vacuum cleaners</a>, ravenously sucking up any matter in their surroundings. In reality, only stuff that passes beyond the event horizon—including light—is swallowed up and can't escape, although black holes are also messy eaters. That means that part of an object's matter is actually ejected out in a powerful jet.&nbsp;If that object is a star, the process of being shredded (or \"spaghettified\") by the powerful gravitational forces of a black hole occurs outside the event horizon, and part of the star's original mass is ejected violently outward. This in turn can form&nbsp;<a href=\"https://www.nasa.gov/mission_pages/chandra/tidal-disruption.html\">a rotating ring of matter</a>&nbsp;(aka an <a href=\"https://en.wikipedia.org/wiki/Accretion_disk\">accretion disk</a>) around the black hole that emits powerful X-rays and visible light.&nbsp;</p><p>Tidal disruption describes the large forces created when a small body passes very close to a much larger one, like a star that strays too close to a supermassive black hole.&nbsp;\"The force of gravity gets stronger and stronger the closer you get to something. That means the black hole's gravity pulls the star's near side more strongly than the star's far side, leading to a stretching effect,\" <a href=\"https://www.eurekalert.org/pub_releases/2021-02/ded-gpf021821.php\">said co-author Robert Stein</a> of <a href=\"https://en.wikipedia.org/wiki/DESY\">DESY</a> in Germany. \"As the star gets closer, this stretching becomes more extreme. Eventually it rips the star apart, and then we call it a tidal disruption event. It's the same process that leads to ocean tides on Earth, but luckily for us, the moon doesn't pull hard enough to shred the Earth.\"</p><p>TDEs are likely quite common in our universe, even though only a few have been detected to date.&nbsp;For instance, in 2018, astronomers announced <a href=\"https://public.nrao.edu/news/black-hole-destroys-star/\">the first direct image</a> of the aftermath of a star being shredded by a black hole 20 million times more massive than our Sun, in a pair of colliding galaxies called Arp 299 about 150 million light years from Earth. And last fall, astronomers <a href=\"https://academic.oup.com/mnras/article/499/1/482/5920142\">recorded</a> the final death throes of a star <a href=\"https://arstechnica.com/science/2020/10/death-by-black-hole-astronomers-spot-flare-from-spaghettification-of-star/\">being shredded</a> by a supermassive black hole, publishing the discovery in&nbsp;<a href=\"https://www.nature.com/articles/s41550-020-01295-8\" rel=\"nofollow\">Nature Astronomy</a>.</p><p>The glow from this most recent TDE was first detected on April 9, 2019 by the <a href=\"https://en.wikipedia.org/wiki/Zwicky_Transient_Facility\">Zwicky Transient Facility</a> (ZTF) at California's Mount Palomar observatory, which has spotted more than 30 such events since it came online 2018. Nearly five months later, on October 1, 2019, the <a href=\"https://icecube.wisc.edu/science/icecube\">IceCube</a> neutrino observatory at the South Pole recorded the signal from a highly energetic neutrino originating from the same direction as the TDE. Just how energetic was it? Co-author Anna Franckowiak of DESY pegged the energy at over 100 teraelectronvolts (TEV), 10 times the maximum energy for subatomic particles that can be produced by the <a href=\"https://home.cern/science/accelerators/large-hadron-collider\">Large Hadron Collider</a>.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/icecube.jpg\" data-height=\"801\" data-width=\"1200\" alt=\"Artistic rendering of the IceCube lab at the South Pole. A distant source emits neutrinos that are then detected below the ice by IceCube sensors.\"><img alt=\"Artistic rendering of the IceCube lab at the South Pole. A distant source emits neutrinos that are then detected below the ice by IceCube sensors.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/icecube-640x427.jpg\" width=\"640\" height=\"427\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/icecube.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/icecube.jpg\" data-height=\"801\" data-width=\"1200\">Enlarge</a> <span>/</span> Artistic rendering of the IceCube lab at the South Pole. A distant source emits neutrinos that are then detected below the ice by IceCube sensors.</p><p>Ice Cube/NSF</p></figcaption></figure><p>The likelihood of detecting this solitary high-energy neutrino was just 1 in 500.&nbsp;\"This is the first neutrino linked to a tidal disruption event, and it brings us valuable evidence,\" <a href=\"https://www.desy.de/news/news_search/index_eng.html?openDirectAnchor=2030&amp;two_columns=1\">said Stein</a>. \"Tidal disruption events are not well understood. The detection of the neutrino points to the existence of a central, powerful engine near the accretion disc, spewing out fast particles. And the combined analysis of data from radio, optical and ultraviolet telescopes gives us additional evidence that the TDE acts as a gigantic particle accelerator.\"</p><p>It's yet one more example of all the new knowledge to be gained by combining multiple data sources to get different perspectives on the same celestial event. \"The combined observations demonstrate the power of multi-messenger astronomy,\" <a href=\"https://www.desy.de/news/news_search/index_eng.html?openDirectAnchor=2030&amp;two_columns=1\">said co-author Marek Kowalski</a> of DESY and Humboldt University in Berlin. \"Without the detection of the tidal disruption event, the neutrino would be just one of many. And without the neutrino, the observation of the tidal disruption event would be just one of many. Only through the combination could we find the accelerator and learn something new about the processes inside.\"</p><p>As for the future, \"We might only be seeing the tip of the iceberg here. In the future, we expect to find many more associations between high-energy neutrinos and their sources,\" <a href=\"https://www.desy.de/news/news_search/index_eng.html?openDirectAnchor=2030&amp;two_columns=1\">said Francis Halzen</a> of the University of Wisconsin-Madison, who was not directly involved in the study. \"There is a new generation of telescopes being built that will provide greater sensitivity to TDEs and other prospective neutrino sources. Even more essential is the planned extension of the IceCube neutrino detector that would increase the number of cosmic neutrino detections at least tenfold.\"</p><p>DOI: Nature Astronomy, 2021. <a href=\"http://dx.doi.org/10.1038/s41550-020-01295-8\">10.1038/s41550-020-01295-8</a></p><p>DOI: Nature Astronomy, 2021. <a href=\"http://dx.doi.org/10.1038/s41550-021-01305-3\">10.1038/s41550-021-01305-3</a> &nbsp;(<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div></div>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"588e9d174adbb667afb5f9f26d80887ea17ad908f6ba520cd0f3aa17ba31ee72","category":"Tech"}