{"title":"Outgoing DS José Luis Arrieta is considering legal action against Movistar","link":"https://cyclingtips.com/2021/10/outgoing-ds-jose-luis-arrieta-is-considering-legal-action-against-movistar/","date":1634494072000,"content":"<div><div><p>José Luis Arrieta is considering a legal challenge against Team Movistar after a rocky end to 2021 for he and the team, culminating in his departure.</p><p>Spanish newspaper AS indicated that Arrieta’s potential legal action is motivated by managerial shuffling within the team that ultimately led to the Spaniard’s ‘separation’. Around the time of the Vuelta a España, his duties as race director were taken over by the team’s head of performance Patxi Vila, leaving Arrieta somewhat obsolete.</p><p>This apparently came on top of earlier disputes that coincided with Vila’s arrival in 2020, which saw Arrieta’s role reshaped and his responsibility significantly reduced.</p><p>The former pro rider – and star of the <a href=\"https://cyclingtips.com/2020/04/is-the-movistar-documentary-on-netflix-worth-watching/\">Netflix show El Dia Menos Pensado</a> (The Least Expected Day) – has been on the directing staff of Team Movistar since 2011, an outfit he also raced for early in his career (as Banesto), before ending his professional years with AG2R. As a rider, his best results came secondhand as a respected and devoted domestique for Miguel Indurain.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/GettyImages-544910860-1340x893.jpg\"><figcaption>José Luis Arrieta and Nairo Quintana during the 2016 Tour de France.</figcaption></figure><p>In his decade in the team car, he enjoyed success with Nairo Quintana until the Colombian’s departure from the team in 2019, and developed a close working relationship with Alejandro Valverde among others. But in the past couple of seasons, things haven’t always been so rosy. </p><p>Of all the teams in the WorldTour, Movistar endures more political turmoil (and derision) than most, and Arrieta finds himself in the middle of the vortex. Although, it’s worth noting that he wasn’t in the team car for the <a href=\"https://cyclingtips.com/2021/09/after-missing-the-decisive-gc-move-lopez-left-the-vuelta-in-dramatic-fashion/\">Miguel Ángel López saga</a> at the end of the 2021 Vuelta.</p><p>One of the major dramas that unfolded (sort of) in <a href=\"https://cyclingtips.com/2021/06/is-season-two-of-movistars-netflix-doc-worth-watching-review/\">season 2 of the Netflix documentary</a> involved the wiping of GoPro memory cards at the 2020 Vuelta. In a particularly tricky tactical moment – read ‘disaster’ – coarse words were apparently exchanged between the riders and their director, and the team did not want the incident to see the light of day. In fact, there’s a good chance the public won’t get to enjoy future seasons of the show for fear that the team might not come across well…</p><p>It’s been a turbulent end to 2021 for Team Movistar with Miguel Ángel López’s untimely withdrawal from the Vuelta and subsequent <a href=\"https://cyclingtips.com/2021/10/miguel-angel-lopez-is-officially-headed-back-to-astana/\">return to Astana</a> after just one season. While the details of the potential legal action are unknown, Arrieta’s less than smooth departure is another in a series of unfortunate events for the Spanish team.</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"593bf119f720ede450d7857f5488da0192cc98463b1f4b0101f01a3d8e8dc6dc","category":"Cycling"}