{"title":"Lachlan Morton just rode two Tour stages in a day, wearing sandals","link":"https://cyclingtips.com/2021/06/lachlan-morton-just-rode-two-tour-stages-in-a-day-wearing-sandals/","date":1625029500000,"content":"<div><div><p>Late last week – before <a href=\"https://cyclingtips.com/2021/06/whos-out-of-the-tour-and-whos-riding-injured/\">every other rider in the peloton crashed</a>, before <a href=\"https://cyclingtips.com/2021/06/why-bahrain-victorious-revealed-and-then-destroyed-its-new-tour-de-france-kit/\">the NFT jerseys</a>, before the <a href=\"https://cyclingtips.com/2021/06/whats-the-story-behind-nexthash-team-qhubekas-mysterious-new-sponsor/\">eyebrow raising-sponsor announcements</a> –  Lachlan Morton set off on a merry little <a href=\"http://www.cyclingtips.com/tag/tour-de-france\">Tour de France</a> of his own to raise money for World Bicycle Relief. </p><p>Because he’s Lachlan Morton, <a href=\"https://cyclingtips.com/2021/06/lachlan-morton-is-bikepacking-the-entire-tour-de-france-route-transfers-included/\">his plan is to ride the entire thing, including transfers, entirely by himself and unsupported</a>. That means an extra 2,400 kilometres of distance, and an extra 15,000 metres of climbing.</p><p>And, if that isn’t enough, he plans to beat the peloton to Paris. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/4M4A0531.jpg\"><figcaption>“The way you can tell if it’s a good baguette is if you can eat it on its own,” Morton said.</figcaption></figure><p>Four days in, with both the race and Morton having crossed swathes of Brittany, I reckon it’s worth checking in on him. Don’t you? </p><hr><p>Morton started off strong, and by the end of the third day he was riding ahead of the race, ahead of his projected average speed. That meant that Morton had time to check in on a crashy stage finish, push on to the start of stage four, and still had time for his first hot meal since the weekend. Happy days!</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Screenshot-2021-06-28-at-21.49.13-1340x889.jpg\"></figure><p>Ah, but – the day three press release had an ominous note in it. Right after telling us that Morton had “picked up a tub of couscous and a couple of bags of nuts for dinner” came the real kicker: our protagonist had a bad knee, and had bought new pedals to allow a switch to flat shoes. </p><p>so on day four, Morton set off with his new pedals and covered both stage four and stage five of the actual Tour de France – in a pair of Birkenstocks. Despite his sensible sandals, Morton managed to average the same speeds as the day prior, getting through the time trial in 1:17. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/4M4A0460.jpg\"></figure><p>“It’s all ticking along pretty nicely, I’m having a good old time,” Morton said laconically afterward. “I’m in sandals today, which are a bit of a lifesaver for me.”</p><p>And then he rode off to camp in a field, 90 kilometres further on, having covered more than two stages in a day riding in Birkenstocks. Professional cyclists are a different breed, and Lachlan Morton is not like most pros.</p><p><em>You can follow Morton’s progress across France <a href=\"http://rapha.cc/thealttour\">here</a>, and <a href=\"https://give.worldbicyclerelief.org/campaign/ef-rapha-for-wbr/c329966\">donate to World Bicycle Relief here</a>.</em></p></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"594ec7d3ef628af1e90969344d2458f5723b107f9a3df9f617a2217f219a1b1a","category":"Cycling"}