{"title":"How does the brain interpret computer languages?","link":"https://arstechnica.com/?p=1749712","date":1615831081000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Math or language? —</h4><h2 itemprop=\"description\">Neuroscientists detect a distinct brain network that grows stronger with practice.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1230834386-800x600.jpg\" alt=\"Image of a pillar covered in lit ones and zeroes.\"><figcaption></figcaption></figure><p>In the US, a <a href=\"https://services.google.com/fh/files/misc/computer-science-education-in-us-k12schools-2020-report.pdf\">2016 Gallup poll</a> found that the majority of schools want to start teaching code, with 66 percent of K-12 school principals thinking that computer science learning should be incorporated into other subjects.<span>&nbsp;</span>Most countries in Europe have <a href=\"http://www.eun.org/resources/detail?publicationID=661\">added coding classes</a> and computer science to their school curricula, with France and Spain introducing theirs in 2015.&nbsp;This new generation of coders is expected to <a href=\"https://www.statista.com/statistics/627312/worldwide-developer-population/\">boost the worldwide developer population</a> from 23.9 million in 2019 to 28.7 million in 2024.</p><p>Despite all this effort, there’s still some confusion on how to teach coding. Is it more like a language, or more like math? Some new research may have settled this question by watching the brain’s activity while subjects read Python code.</p><h2>Two schools on schooling</h2><p>Right now, there are two schools of thought. The prevailing one is that coding is a type of language, with its own grammar rules and syntax that must be followed. After all, they’re called coding <i>languages</i> for a reason, right? This idea even has its own snazzy acronym: Coding as Another Language, or CAL.</p><p>Others think that it’s a bit like learning the logic found in math; formulas and algorithms to create output from input. There’s even a <a href=\"https://www.codebymath.com/\">free online course</a> to teach you both coding and math at the same time.</p><p>Which approach is more effective? The debate has been around since coding was first taught in schools, but it looks like the language argument is now winning. Laws in Texas, Oklahoma, and Georgia allow high school students to take computer science to fulfill their foreign language credits (the 2013 Texas law says this applies if the student has already taken a foreign language class and appears unlikely to advance).</p><p>The debate holds a special interest for neuroscientists; since computer programming has only been around for a few decades, the brain has not evolved any special region to handle it.<span>&nbsp;</span>It must be repurposing a region of the brain normally used for something else.</p><p>So late last year, neuroscientists in MIT tried to see what parts of the brain people use when dealing with computer programming. “The ability to interpret computer code is a remarkable cognitive skill that bears parallels to diverse cognitive domains, including general executive functions, math, logic, and language,” they wrote.</p><p>Since coding can be learned as an adult, they figured it must rely on some pre-existing cognitive system in our brains. Two brain systems seemed like likely candidates: either the brain’s language system, or the system that tackles complex cognitive tasks such as solving math problems or a crossword. The latter is known as the \"multiple demand network.\"</p><h2>Coding on the brain</h2><p>In their experiment, researchers asked participants already proficient at coding to lie in an fMRI machine to measure their brain activity. They were then asked to read a coding problem and asked to predict the output.</p><p>The two coding languages used in the study are known for their \"readability\"—Python and ScratchJr. The latter was specifically developed for children and is symbol-based so that children who have not yet learned to read can still use it.</p><p>The main task involved giving participants a person’s height and weight and asking them to calculate a person’s BMI. This problem was either presented as Python-style code or as a normal sentence. The same method was done for ScratchJr, but participants were asked to track the position of a kitten as it walked and jumped.</p><p>Control tasks involved memorizing a sequence of squares on a grid (to activate participants’ multiple demand system) and reading one normal and one nonsense sentence (to activate their language system).</p><p>Their results showed that the language part of the brain responded weakly when reading code (the paper’s authors think this might be because there was no speaking/listening involved). Instead, these tasks were mostly handled by the multiple demand network.</p><p>The multiple demand network is spread across the frontal and parietal (top) lobes of our brain, and it's responsible for intense mental tasks—the parts of our lives that make us think hard. The network can be roughly split between the left part (responsible for logic) and the right (more suited to abstract thinking). The MIT researchers found that reading Python code appears to activate both the left and right sides of the multiple demand network, and ScratchJr activated the right side slightly more than the left.</p><p>“We found that the language system does not respond consistently during code comprehension in spite of numerous similarities between code and natural languages,” they write.</p><p>Interestingly, code-solving activated parts of the multiple-demand network that are not activated when solving math problems. So the brain doesn’t tackle it as language or logic—it appears to be its own thing.</p><p>The distinct process involved in interpreting computer code was backed up by an experiment done by Japanese neuroscientists last year. This work showed snippets of code to novice, experienced, and expert programmers while they lay in an fMRI.&nbsp;The participants were asked to categorize them into one of four types of algorithms. As expected, the programmers with higher skills were better at categorizing the snippets. But the researchers also found that activity in brain regions associated with natural language processing, episodic memory retrieval, and attention control also strengthened with the skill level of the programmer.</p><p>So while coding may not be as similar to languages as we had thought, it looks like both benefit from starting young.</p><p><em>eLife</em>, 2020. DOI: <a href=\"http://dx.doi.org/10.7554/eLife.58906\">10.7554/eLife.58906</a> &nbsp;(<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p><p><span><i>Fintan is a freelance science journalist based in Hamburg, Germany. He has also written for The Irish Times, Horizon Magazine, and <a>SciDev.net</a> and covers European science policy, biology, health and bioethics.</i><br></span></p></div></div>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"59f30b758a5f8491e2046d8abef190c7ded12189bf4ae155bd42862f493d9f46","category":"Tech"}