{"title":"New Allied Echo 2-in-1 road and gravel bike features slick adjustable geo","link":"https://cyclingtips.com/2021/06/allied-echo-gravel-bike-adjustable-geometry-first-look/","date":1622732499000,"content":"<div><div><p>When Allied Cycle Works first opened its doors in 2017 (<a href=\"https://cyclingtips.com/2017/03/hia-velos-quest-durable-carbon-fiber/\" target=\"_blank\">as HIA Velo</a>), the Echo was a fully custom tube-to-tube carbon road frame that was essentially a legacy model inherited from Guru (the shuttered Canadian brand from whom Allied purchased much of its startup equipment). That nameplate has now been revived, only now as a convertible road and gravel bike. </p><p>Indeed, the Allied Echo is yet another so-called “quiver killer” — a single bike that could truly replace multiple ones. It’s an idea that has often been touted and rarely realized, but thanks to a super clever adjustable geometry setup, the new Echo might actually hit the mark.</p><div><h2>Story Highlights</h2><ul><li><strong>What it is:</strong>Allied Cycle Works’ take on the quiver killer drop-bar bike.</li><li><strong>Frame features:</strong>Made-in-Arkansas carbon fiber construction, well-engineered adjustable geometry, fully hidden cable routing, English-threaded bottom bracket, three bottle mounts, available custom paint.</li><li><strong>Weight:</strong> 750 g (claimed, Builders Edition medium frame only); 950 g (claimed, standard medium frame only); 380 g (claimed, fork only); 7.65 kg (16.87 lb, complete, with SRAM Force Wide, road configuration, without pedals or accessories, size small); 7.80 kg (17.20 lb, complete, with SRAM Force Wide, gravel configuration, without pedals or accessories, size small.</li><li><strong>Price:</strong> US$7,900 (complete, as tested, with single wheelset).<strong></strong></li><strong></strong></ul></div><h2>Flipping chips</h2><p>The idea of using aluminum dropout inserts to adjust frame geometry is hardly new — and in fact, it’s almost more common than not in the mountain bike world these days (<a href=\"https://www.pinkbike.com/news/opinion-hot-chips-gone-cold-flip-chips-dont-deliver.html\" target=\"_blank\">for better or worse</a>). The concept isn’t as widespread on drop-bar bikes, but brands such as Rondo, Otso, and Cervelo have been making a good go of it in recent years. Allied is now picking up that flip-chip torch for its new carbon fiber Echo, and the system is not only impressively thorough, but also very user-friendly.</p><p>Reversible aluminum inserts at both ends of the Echo allow the chainstay and fork length to be adjusted by 10 mm. In gravel mode, a medium Echo frame features 425 mm-long chainstays, a 72.5° head tube angle, and 75 mm of bottom bracket drop, with a maximum tire clearance of 700×40 mm. That same frame in road mode shortens the chainstays to 415 mm, the head tube angle steepens by 0.5°, the bottom bracket drop increases by 2.5 mm, and maximum tire clearance decreases to 700×30 mm. The riding position gets a bit more aggressive, too, with 5 mm less stack and 5 mm more reach.</p><p>As I mentioned, adjustable geometry isn’t entirely new in drop-bar bikes. What’s different here is how well Allied has done it.</p><p>Cervelo and Rondo both only feature adjustable geometry at the fork, and both also require you to completely remove, reinstall, and realign the front brake caliper in the process. Otso’s Tuning Chip design is much better in that respect since the dropout and brake mount are a single piece that move in unison, but it’s only used out back. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-8-1340x754.jpg\"><figcaption>What makes the Echo special is how Allied has integrated the brake mount with the adjustable dropout so that everything stays in alignment when you convert between road and gravel setups.</figcaption></figure><p>On the Echo, both ends are adjustable, and the brake mounts are integrated into the dropout. Assuming you have a second set of wheels at the ready (and with disc rotors that are already shimmed to match if needed), it’s designed to be as close to a plug-and-play arrangement as possible.</p><p>“In order to swap the geometry, the dropout and brake had to be connected in this manner,” said Allied’s director of product and engineering, Sam Pickman. “One huge benefit of this was the assurance that your brake and dropout will always be perfectly square. Our mechanics are in love. I don’t expect people to be swapping back and forth on a weekly basis, but I believe, and hope, that 80% of people who buy this bike will ride it in both modes. I predominantly ride it in the road position and believe that is where it performs best, but have spent a fair amount of time in gravel mode and was stunned at how capable it is.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-geometry-1-1340x475.jpg\"></figure><h2>Integration with less of the headache</h2><p>As you’d expect, the Echo features fully internal routing with no visible control lines, apart from brief appearances by the hydraulic hoses down by the disc brake calipers. It’s all very aesthetically clean and tidy, but in a massively welcome surprise, it’s also mechanic-friendly.</p><p>Brake hoses and drivetrain wires for the electronic-only Echo are routed inside the handlebar, popping out at a port on the backside of the clamp area. The lines then run alongside a channel on the top of the Allied-made CNC-machined aluminum stem before dropping straight into the middle of the conventional round and tapered carbon fiber steerer tube. The front brake hose travels down the steerer, through the hollow crown, and down the non-driveside fork blade, while the rear brake hose (and electronic wires if applicable) enter the inside of the down tube through a port on the backside of the steerer. Keeping all of this hidden away is an aluminum cover plate that doubles as the faceplate for the handlebar clamp.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-15-2-1340x754.jpg\"><figcaption>Allied’s take on fully hidden cable routing is quite clever.</figcaption></figure><p>“[The front brake hose path] is not guided, but routes very easily,” Pickman said. “Because we knew we were going to be routing in this manner, we changed the manufacturing technique to have a completely hollow crown. Most carbon forks are molded with two nylon bladders and have a rib down the center of the crown were they come together. Ours is molded with a custom latex bladder so the crown area is completely open.”</p><p>Stem swaps are refreshingly pain-free since all the lines rest on top of the stem instead of running through it, and also because hydraulic hoses can slide through the slightly wider steerer tube clamp slot. Headset adjustment is super easy, too, though it’s a tad quirky. Since the lines enter at the top of the steerer tube, there isn’t enough room for a conventional headset compression plug to set the bearing preload. Instead, headset adjustment is done by turning a threaded collar on the bottom of the stem with a 32 mm wrench (meaning your old Campagnolo wrench is finally useful again). Up top, a hollow aluminum plug provides crush resistance to the round carbon fiber steerer.</p><p>Allied even partnered with Abbey Bike Tools on a custom on-bike jig that allows you to trim the steerer tube without having to worry about nicking the hydraulic hoses or wires.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-12-1340x754.jpg\"><figcaption>The hydraulic lines and drivetrain wires rest along the top of the stem and are hidden beneath an aluminum cover plate.</figcaption></figure><p>The system isn’t without some downsides, though. </p><p>As is common practice these days, Allied equips the Echo with split headset spacers so you can add or remove them without messing with the control lines too much. However, the unique stem design doesn’t allow you to put spacers on top, and because the cover plate doubles as the handlebar clamps, you can’t try out a new position before trimming the steerer, either.</p><p>The CNC-machined aluminum stem is also a proprietary part, particularly given the threaded headset preload collar. But it’s no lead weight – it’s just 184 g for a 100 mm size, plus 13 g for the compression plug. It’s also offered in 90-130 mm lengths (in 10 mm increments, all in a -6° angle), and there’s a growing number of handlebar options with similar rear-exit cable ports if you prefer a particular bend.</p><p>“All in all, it adds about 30-50 grams from an Enve aero stem depending on the size,” Pickman said.</p><h2>Still part of the family</h2><p>Despite the unique features, the Echo is quite clearly an Allied, if only based on the now-trademark shape of the seat cluster with that distinctly flowing shape and the same wedge-type integrated seatpost binder found on the Alfa, <a href=\"https://cyclingtips.com/2018/06/allied-alfa-allroad-long-term-review-the-antidote-to-the-n1-rule/\" target=\"_blank\">Allroad</a>, and <a href=\"https://cyclingtips.com/2020/06/allied-able-gravel-frameset-review-looks-weird-goes-fast/\" target=\"_blank\">Able</a>. Other telltale cues include the very wide and rectangular-profile down tube, the broad and only modestly sloping top tube, the smooth tube transitions, and the comparatively even diameters of the chainstays and seatstays.</p><p>And although the Echo is supposedly only compatible with electronic drivetrains, there’s still the same bolt-on eagle emblem on the top of the down tube that’s normally used as an entry point for derailleur housing.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-20-1340x754.jpg\"><figcaption>The top tube is only modestly sloping for a more traditional profile, although it doesn’t do great things for standover height.</figcaption></figure><p>There’s also a conventional English-threaded bottom bracket shell, a totally normal 27.2 mm round seatpost, and three bottle mounts (with one underneath the down tube). There’s no mount on the top tube for a feed bag, however, and no fender mounts, either.</p><p>“We debated this a fair amount,” Pickman admitted. “We went through a lot of trouble including fender mounts on the Able, and in the end, I think we sold like 10 fender kits. I am just not convinced that our customer really values having fender capability.”</p><p>As with all Allieds to date, the Echo has nary a hint of aero shaping with the bulk of the design priorities focused on low weight, high structural efficiency, and a good ride quality. Claimed weight for standard medium frames is 950 g, plus 380 g for the matching fork (both of which, like all Allied framesets, are fully manufactured in-house in Bentonville, Arkansas). Allied also plans to soon release a special “Builders Edition” of the Echo that lops a whopping 200 g off the frame, although the exact date (and price) are still to be finalized. </p><h2>Models, pricing, and availability </h2><p>All of the DNA the Echo shares with other Allied models might cause some confusion, however, since it doesn’t take a very detailed inspection of the brand’s catalog to see there’s a fair bit of overlap. The Allroad accepts 700c tires up to 35 mm in width, the Able goes up to 43 mm, and now this Echo shoots the gap at 40 mm (while also, of course, offering that neat dual personality). But Allied seems to be making itself out to be an exclusive purveyor of high-performance drop-bar bikes, and is apparently perfectly ok with splitting hairs if it means a potential buyer gets exactly what they want instead of something more compromised.</p><p>“Alfa will remain in the line as our race bike and Allroad will also remain for those who still prefer mechanical drivetrains, but we expect Echo to pretty much take over a majority of the demand from these two,” Pickman said. “Because we make to order and don’t have to forecast out like other brands, it allows us to do this pretty easily.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-4-1340x754.jpg\"><figcaption>Any gravel bike can accept road-width tires. But what’s nice about the Echo is how both ends shrink down around those smaller tires, too.</figcaption></figure><p>Allied will offer the Echo in six sizes and just a single stock color to start — matte black with silver logos — but custom colors start at US$300. Complete builds start at US$6,430 with <a href=\"https://cyclingtips.com/2021/04/sram-rival-axs-review/\" target=\"_blank\">SRAM Rival AXS</a> and top out at US$10,575 with <a href=\"https://cyclingtips.com/2019/02/sram-red-etap-axs-review/\" target=\"_blank\">SRAM Red AXS</a>. Bare framesets are available for the DIYers, too. Retail prices for the frameset and international prices for the complete builds are all to be confirmed.</p><p>Bikes and frames will supposedly be available for sale immediately.</p><h2>The proof is in the pudding</h2><p>Allied sent a small-sized test sample over for review, complete with a SRAM Force Wide 2x wireless electronic groupset, Black Inc carbon finishing kit, an Ergon saddle with stainless steel rails, and two sets of Industry Nine carbon wheels: the UL 250 Carbon CX wrapped with 40 mm WTB Byway tires, and the i9 35 Carbon with 28 mm Vittoria Corsa Controls. Actual weight for the road setup is 7.65 kg (16.87 lb) without pedals or accessories, while the gravel setup is only slightly heavier at 7.80 kg (17.20 lb). </p><p>So how’s it all perform? Well, I unfortunately can’t say just yet since the bike didn’t arrive in time for me to get any rides in before the launch date and I’m currently waiting for a shorter stem to dial in my fit. Some of the geometry specifics give me pause in the meantime, such as the rather slack seat tube angle, the short front-center, and the fairly tall standover, but I’ll reserve final judgment until I’ve logged sufficient saddle time. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-19-1340x754.jpg\"><figcaption>This seat cluster shaping is unmistakably Allied, but hopefully the new Echo performs like some other Allieds I’ve ridden in the past, too.</figcaption></figure><p>I will say right now, however, that the conversion process is just as easy as claimed. With no practice beforehand, I timed the full swap at just eight minutes using only the tools that Allied provides (save for the 2.5 mm hex that isn’t on the Abbey four-way tool), and — hallelujah! — the brakes stayed in perfect alignment. And that included swapping pedals, too.</p><p>“I strongly believe that the Echo (or bikes like it) are the road bike of the future,” Pickman said. “I believe that it matches what people want out of a road bike: a performance machine with the capability to branch out and do more. I think this bike works best for riders who live in areas where access to good gravel riding is not that easy but they plan on doing some gravel riding or have a few gravel events circled on their calendar.”</p><p>I’ll hopefully have some time to get a thorough review of this done sooner than later, but things are looking promising so far and Allied hasn’t disappointed me too much yet (I ended up buying my Allroad test sample after I finished that review in 2018). Stay tuned.</p><p>More information can be found at <a href=\"https://alliedcycleworks.com/collections/echo\" target=\"_blank\">www.alliedcycleworks.com</a>.</p><figure><ul><div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-1-1340x754.jpg\"><figcaption>The Allied Echo takes aim at the “quiver killer” category of drop-bar bikes – and it might just be one of the most successful at accomplishing the task.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-3-1340x754.jpg\"><figcaption>Allied expects that as much as 80% of Echo buyers will keep a second set of wheels on hand for road and gravel duty.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-5-1340x754.jpg\"><figcaption>Visually, it’s also nice that the front and rear ends of the Echo essentially shrink around those smaller-diameter road wheels.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-6-1340x754.jpg\"><figcaption>Flip chips are hardly new to the bicycle industry – particularly in the mountain bike world – and while they’re already in use by brands like Cervelo, Rondo, and Otso, Allied’s solution is particularly elegant in its execution.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-7-1340x754.jpg\"><figcaption>A similar flip chip is used out back to tune the chainstay length.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-9-1340x754.jpg\"><figcaption>Assuming you’ve got two wheels fully adjusted and ready to go – and have a decent amount of mechanical aptitude – swapping between the two configurations should take you less than 10 minutes.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-10-1340x754.jpg\"><figcaption>Allied includes a four-way wrench from Abbey Bike Tools and a custom wrench for the dropouts and headset.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-11-1340x754.jpg\"><figcaption>Mechanics will curse a little less when dealing with Allied’s slick internal routing solution.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-13-1340x754.jpg\"><figcaption>Stem lengths can be swapped without disconnecting any wires or hoses since the steerer clamp slot is big enough for the hoses to pass through.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-14-1340x754.jpg\"><figcaption>The aluminum cover plate isn’t just cosmetic; it’s also the handlebar clamp faceplate.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-16-1340x754.jpg\"><figcaption>Headset adjustment is done via a threaded collar that’s integrated into the bottom of the stem.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-17-1340x754.jpg\"><figcaption>If you’re been holding on to those old 32 mm headset wrenches, now’s your chance to crack them out again. But if you’ve already gotten rid of them, Allied includes one with each Echo.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-18-1340x754.jpg\"><figcaption>The carbon fiber frame itself bears a lot of Allied design hallmarks, such as the very wide and squared-off down tube. Aerodynamic performance clearly wasn’t a priority here.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-20-1340x754.jpg\"><figcaption>The top tube is only modestly sloping for a more traditional profile, although it doesn’t do great things for standover height.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-21-1340x754.jpg\"><figcaption>Very pretty.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-22-1340x754.jpg\"><figcaption>The wedge-type seatpost binder is neatly incorporated into the seat cluster. Tool access could be better, though.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-23-1340x754.jpg\"><figcaption>Double dropped chainstays allow for 700×40 mm gravel tires to squeeze between chainstays that are just 425 mm long. That sort of shaping isn’t necessary when set up in road mode as shown here, but the flip chips help minimize that unneeded space.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-24-1340x754.jpg\"><figcaption>As with other Allied frames, the Echo’s tube shapes prioritize stiffness and ride quality.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-25-1340x754.jpg\"><figcaption>The seat tube flares slightly down by the bottom bracket.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-26-1340x754.jpg\"><figcaption>The English-threaded, 68 mm-wide bottom bracket doesn’t provide as much real estate as some of the press-fit options, but Allied makes use of every available millimeter here.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-27-1340x754.jpg\"><figcaption>Allied perhaps could have eked out a few more millimeters of tire clearance by going with a wide-format bottom bracket setup, but decided it was more advantageous to use a regular English-threaded one for serviceability. I’m not sure why the wide-format T47 system wasn’t considered, though.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-28-1340x754.jpg\"><figcaption>Allied says the Echo will handle 700×40 mm-wide tires in gravel mode, although that’s clearly a fairly conservative figure given how much room there is around these 40 mm-wide WTB Byways.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-29-1340x754.jpg\"><figcaption>I’ll be checking comfortable tire clearances in the weeks ahead, but based on the actual measurement of this WTB Byway, it seems like you should be able to fit a 700×42 mm gravel tire in there without too much trouble.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-30-1340x754.jpg\"><figcaption>The bow-legged fork has plenty of room at the crown. Note how low-profile the crown is, too.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-31-1340x754.jpg\"><figcaption>The chainstays have a bit of a bend to them, but they’re essentially straight.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-32-1340x754.jpg\"><figcaption>The matching fork has an admirably short axle-to-crown length considering the tire clearances.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-34-1340x754.jpg\"><figcaption>Both the frame and fork are molded in-house by Allied in Bentonville, Arkansas.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-34-2-1340x754.jpg\"><figcaption>Allied not only builds everything in-house – including molding the frames and forks, and machining aluminum parts – but the company also does its own testing. Photo: Allied Cycle Works.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-35-2-1340x754.jpg\"><figcaption>Carbon fiber painted to look like metal is always a crowd pleaser. Photo: Allied Cycle Works.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-35-1340x754.jpg\"><figcaption>Allied director of product and engineering Sam Pickman says the Echo is only compatible with electronic drivetrains. However, Allied still includes its trademark eagle swappable port on the down tube for some reason.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-36-1340x754.jpg\"><figcaption>Even more curious is why Allied bothers putting the cable exit port on the underside of the down tube if the frame is supposedly electronic-only.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-37-1340x754.jpg\"><figcaption>There’s only one position for the down tube water bottle, but two for the seat tube one.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-38-1340x754.jpg\"><figcaption>Although there’s no supplemental lower seal on the headset, the Chris King stainless bearings should be very durable long-term – as they’d better be since replacing one would require disconnecting both brake hoses.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-39-1340x754.jpg\"><figcaption>The WTB Byway is a decent choice for truly mixed terrain, but you’re definitely sacrificing off-road traction for on-road rolling smoothness.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-40-1340x754.jpg\"><figcaption>Allied’s use of 28 mm-wide Vittoria Corsa Control tubeless clinchers provides good indication of just how road-worthy the company thinks the Echo really is.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-41-1340x754.jpg\"><figcaption>Clear vinyl tape is pre-installed in strategic locations at the factory (although I think this one might have been installed upside-down).</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-42-1340x754.jpg\"><figcaption>You’d be surprised how many test bikes I receive that have no protection on the chainstay at all.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-43-1340x754.jpg\"><figcaption>Allied has partnered with Black Inc. for the Echo’s finishing kit.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-44-1340x754.jpg\"><figcaption>SRAM’s Force Wide drivetrain seems like a perfect fit for the Echo’s versatile personality.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-45-1340x754.jpg\"><figcaption>A 46-tooth outer chainring might seem strangely small, but when combined with the 10-tooth cassette sprocket, it’s the equivalent of a 50-11T.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-46-1340x754.jpg\"><figcaption>Alllied’s color schemes are very straightforward, but the color selection is solid. Photo: Allied Cycle Works.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-47-1340x754.jpg\"><figcaption>Sponsored rider Colin Strickland gets his own special finish, of course. Photo: Allied Cycle Works.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Allied-Echo-Colin-Strickland-1-1340x754.jpg\"><figcaption>While it’s arguably still nicer to have two completely separate bikes, the Echo is making a strong argument for one bike plus two wheelsets. Photo: Allied Cycle Works.</figcaption></figure></li></div></div></ul></figure></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"59f631ae7ae505685e23bbec6ed5bc90e6c0affc1bec29c3c1affedba86f3fbe","category":"Cycling"}