{"title":"Merck/J&J deal may help US get enough vaccine for all adults by end of May","link":"https://arstechnica.com/?p=1746636","date":1614739897000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>New deal —</h4><h2 itemprop=\"description\">Merck will dedicate two facilities to making the newly authorized J&amp;J vaccine.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1231478913-800x532.jpg\" alt=\"An older man in a suit speaks at a podium with a presidential seal.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1231478913.jpg\" data-height=\"3753\" data-width=\"5641\">Enlarge</a> <span>/</span> US President Joe Biden delivers remarks on the government's pandemic response, including the recently announced partnership between Johnson &amp; Johnson and Merck to produce more Johnson &amp; Johnson vaccine, as US Vice President Kamala Harris (L) looks on at the White House in Washington, DC on March 2, 2021.</p></figcaption></figure><p>With a White House-brokered deal, vaccine giant Merck has agreed to help Johnson &amp; Johnson boost its COVID-19 vaccine production, which is woefully behind on its manufacturing schedule.</p><p>President Joe Biden announced today that, with the new deal, the country is on track to have enough COVID-19 vaccine doses to vaccinate every adult in the country by the end of May—two months ahead of earlier plans.</p><p>“About three weeks ago, we were able to say that we’ll have enough vaccine supply for adults by the end of July,” the president said in an afternoon address. “And I’m pleased to announce today, as a consequence of the stepped-up process that I’ve ordered and just outlined, this country will have enough vaccine supply—I’ll say it again—for every adult in America by the end of May. By the end of May. That’s progress—important progress.”</p><p>Merck—a powerhouse in vaccine production, responsible for the MMR (measles, mumps, and rubella) vaccine among others—will dedicate two US facilities to making the Johnson &amp; Johnson COVID-19 vaccine. One facility will make the vaccine and the other will provide final-stage “fill and finish” services, involving aliquoting vaccine into vials and packaging them. The help from Merck stands to perhaps double J&amp;J’s manufacturing.</p><p>In his address Tuesday, Biden noted that his administration invoked the Defense Production Act to equip the two facilities “to the standards necessary to safely manufacture the J&amp;J vaccine.”</p><p>In an earlier press conference, White House Press Secretary Jen Psaki suggested that the invoking of the DPA helped seal a deal between the two companies, which had previously been in talks. “There’s a difference between conversations and it moving forward—and the use of the Defense Production Act,” Psaki said. “So I’m only conveying what got it across the finish line.”</p><h2>Big deal</h2><p>In <a href=\"https://www.hhs.gov/about/news/2020/08/05/hhs-dod-collaborate-with-johnson-and-johnson-to-produce-millions-of-covid-19-investigational-vaccine-doses.html\">a $1 billion contract</a> signed last year, J&amp;J had committed to providing the federal government 37 million doses by the end of March and 100 million by the end of June. But, more recently, the company said it would only be able to provide 20 million doses by the end of the month, much of it coming in the final weeks.</p><p>The vaccine—a nonreplicating adenovirus-based vaccine—was granted emergency authorization from the Food and Drug Administration last weekend.</p><p>Merck had been working on a COVID-19 vaccine of its own. But in late January, the company announced that it was <a href=\"https://www.merck.com/news/merck-discontinues-development-of-sars-cov-2-covid-19-vaccine-candidates-continues-development-of-two-investigational-therapeutic-candidates/\">abandoning development</a> after results from a Phase I trial suggested the shot resulted in immune responses weaker than those seen after natural infections.</p><p>Merck is just the latest example of a <a href=\"https://arstechnica.com/science/2021/02/gsk-eyes-next-gen-covid-vaccine-as-it-inks-deal-to-help-boost-current-supply/\">big pharmaceutical company helping rivals</a> in their effort to mass produce COVID-19 vaccine. Sanofi—another of the world’s leading vaccine makers—and Swiss drug maker Novartis each announced deals in January to help produce the mRNA COVID-19 vaccine developed by Pfizer and BioNTech. Sanofi has also said it will help with J&amp;J’s vaccine production in Europe.</p><p>Though the boosted supplies will aid the global immunization effort, getting shots in arms requires much more, and it’s unlikely that all American adults will be vaccinated by the end of May. Biden noted the administration’s efforts to recruit more vaccinators and set up more immunization sites. He also said he will direct states to prioritize vaccinating teachers to accelerate school reopening.</p></div></div>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5cc9fe241bd28d466ca072eba0865cb924e81cd268386bdfe249931a8dcbbce8","category":"Tech"}