{"title":"Gino Mäder wasn’t going to be denied again","link":"https://cyclingtips.com/2021/05/mader-all-i-could-think-about-was-paris-nice/","date":1620940033000,"content":"<div><p></p><h4>Gino Mäder in the king of the mountains jersey after stage 6 of the Giro d'Italia.</h4><p></p><div><p>Two months ago, Gino Mäder (Bahrain Victorious) came oh-so-close to his first ever WorldTour win. The Swiss up-and-comer was off the front solo and holding onto a slim lead into the final kilometer of stage 7 of Paris-Nice, and he made it to within sight of the finish line – only to be passed by Primoz Roglic (Jumbo-Visma) inside the last 25 meters of the day.</p><p>On Thursday, Mäder again found himself riding solo in the finale of a big race with plenty of big names closing in from behind. This time, however, Mäder held on all the way to the line to win stage 6 of the Giro d’Italia, taking not just his first WorldTour win, but a Grand Tour stage win, to boot.</p><p>“As soon as I was alone and the last survivor of the breakaway, everything I could think of was Paris-Nice. There was that doubt in my head that it was going to happen the same,” Mäder said after his win. “With just 100 meters to go I could finally celebrate and really enjoy the moment. Now it’s just such a sweet feeling.”</p><p>Those good emotions came on the heels of a very rough day for Mäder’s team. Bahrain Victorious came into the Giro hoping to support Mikel Landa’s quest for the pink jersey. The Basque climber looked strong on the first day for the climbers, stage 4, only to crash out of the race on stage 5.</p><p>Landa’s departure forced Bahrain Victorious to change tack. The squad wasted no time in turning its new approach into results, focusing on jumping into the breakaway on stage 6 and closing out the day with a rider celebrating at the finish line.</p><p>In addition to winning stage 6, Mäder also rode into the maglia azzurra, the Giro d’Italia’s blue king of the mountains jersey.</p><p>“Yesterday was such a sad day with losing Mikel. Today we just said we were going to ride in honor of Mikel’s lost GC ambitions or lost Giro,” Mäder said. “We put everything in the breakaway. Luckily my day was super super strong. It’s such a nice feeling after Paris-Nice, missing [by] so little. Now, being on the top step is super nice.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"5d4a185b6ddd0eddd93c32f071198ae6257d34ece7f693be4452a898808f01be","category":"Cycling"}