{"title":"Testing the HomePod Mini’s New U1 Handoff Functionality","link":"https://www.macrumors.com/2021/01/26/homepod-mini-14-4-u1-handoff/","date":1612377880000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/01/26/homepod-mini-14-4-u1-handoff/\"><p>Apple today <a href=\"https://www.macrumors.com/2021/01/26/apple-releases-ios-14-4/\">released iOS 14.4</a> and the <a href=\"https://www.macrumors.com/2021/01/26/apple-releases-homepod-mini-14-4-software-u1-chip/\">HomePod 14.4 software</a>, with these two updates introducing improved Handoff functionality between the <a href=\"https://www.macrumors.com/roundup/homepod-mini/\">HomePod mini</a> and the <a href=\"https://www.macrumors.com/roundup/iphone-11/\">iPhone 11</a> and <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> models. In our latest YouTube video, we tested out the new functionality to see just how it works.</p><p>The ‌HomePod mini‌, the ‌iPhone 11‌ models, and the ‌iPhone 12‌ models all have Apple's U1 Ultra Wideband chip, which allows the devices to more precisely locate and keep track of one another thanks to much improved indoor positioning and location capabilities.</p><p>When introducing the ‌HomePod mini‌ with U1 chip back in October, Apple explained that it would be used for more advanced Handoff features, with that technology now available. The <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> and ‌HomePod mini‌ have always been capable of transferring songs from the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> to the ‌HomePod‌ and vice versa, but now the ‌HomePod mini‌ does it just a bit better.</p><p>If you're listening to a song on your ‌iPhone 11‌ or ‌iPhone 12‌ and bring the phone near the ‌HomePod mini‌, there are now visual, audio, and haptic effects when the song transfers. As the ‌iPhone‌ gets closer to the ‌HomePod mini‌'s location, it begins a soft haptic touch rhythm that gets faster and faster as the ‌iPhone‌ continues to approach the ‌HomePod mini‌. Eventually, the song transfer interface options up, and the song transitions from the ‌iPhone‌ to the mini.</p><p>Transferring a song is quicker and more reliable with these visual and haptic-based transfer cues, and there are some other useful changes enabled by the U1 chip too. When an ‌iPhone‌ is held near a ‌HomePod mini‌, you'll see personalized listening suggestions and song recommendations.</p><p>More notably, when you hold an ‌iPhone‌ next to the ‌HomePod mini‌ the ‌iPhone‌ will display playback controls that you can access without unlocking your phone, giving you a quicker way to manually control content playing on the ‌HomePod mini‌.</p><p>This new U1 chip functionality is limited to the ‌HomePod mini‌ because the standard ‌HomePod‌ does not have a U1 chip inside it. Using this feature also requires an ‌iPhone‌ with a U1 chip, and that's limited to ‌iPhone 11‌ and ‌iPhone 12‌ models.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/useful-mac-accessories-worth-checking-out/\">Useful Mac Accessories Worth Checking Out</a></h3><p>Wednesday February 10, 2021 1:21 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>If you recently picked up one of the new M1 Macs that Apple released in November, or received a new Mac for the holidays, you may be in search of useful accessories to go along with it. In our latest YouTube video, we rounded up some great Mac accessories that are worth checking out. Subscribe to the MacRumors YouTube channel for more videos. MacRumors videographer Dan has highlighted several ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/intel-anti-mac-ad-campaign/\">Intel's Anti-Mac Ad Campaign Highlights M1 Shortcomings</a></h3><p>Thursday February 11, 2021 5:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of the M1 Macs last November, Apple officially began its transition away from Intel's chips, and it's clear from Intel's latest advertising campaign that the company is feeling threatened by Apple's decision. In ads shared on Twitter, Intel has been highlighting the shortcomings of Apple's M1 Mac lineup. An ad this week, for example, points out the gaming capabilities of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/apple-privacy-chief-slams-north-dakota-bill/\">Apple Privacy Chief: North Dakota Bill 'Threatens to Destroy the iPhone as You Know It'</a></h3><p>Wednesday February 10, 2021 1:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>The North Dakota Senate this week introduced a new bill that would prevent Apple and Google from requiring developers to use their respective app stores and payment methods, paving the way for alternative app store options, reports The Bismarck Tribune. According to Senator Kyle Davison, who introduced Senate Bill 2333 yesterday, the legislation is designed to \"level the playing field\" for...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/2016-2017-macbook-pro-battery-charging-issue/\">Apple Offering Free Battery Replacements for 2016-2017 MacBook Pros That Can't Charge Past 1%</a></h3><p>Tuesday February 9, 2021 4:45 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today released macOS Big Sur 11.2.1 to address an issue that may prevent the battery from charging in some 2016 and 2017 MacBook Pro models, and the company has since shared a new support document with more details. Apple says a \"very small number of customers\" with 2016 and 2017 models of the 13-inch and 15-inch MacBook Pro have experienced an issue with the battery not charging past...</p></div></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"5d72dc02f78a114ca9184ccaf1eb07cf35a17664eadb3164bd056e17ec26954b","category":"Tech"}