{"title":"Matt Goss's Milan-San Remo win - Romance on the Italian Riviera","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-sanremo-matt-goss-romance-on-the-italian-riviera","date":1616061600000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><meta charset=\"UTF-8\"><meta charset=\"UTF-8\"><p><span>Cavendish&nbsp;was a pre-race favourite, debuting an&nbsp;eye-catching&nbsp;aerodynamic bicycle, the&nbsp;Specialized Venge. They also gave one to his Australian team-mate, just in case. Just as well: able to get over the hills that day, the Tasmanian employed his&nbsp;devilish tactics. He boxed clever in the wheels and outsprinted Fabian Cancellara comfortably in an eight-man group.</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2021-preview\"></a></em></strong>The mix of men finishing behind Goss that day underlines&nbsp;the remarkable breadth of the Milan-San Remo contender bracket: rouleur Fabian Cancellara and puncheur Philippe Gilbert rounded off the podium, while&nbsp;Grand Tour contenders Michele Scarponi and Vincenzo Nibali finished at the back of the group.</p><p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2021-preview\">Related: Milan-San Remo 2021 Preview</a></em></strong></p><p>No matter what kind of rider you are, momentum matters at Milan-San Remo. Form and an injury-free winter are both crucial to success.</p><p></p><p><iframe width=\"840\" height=\"473\" src=\"https://www.youtube.com/embed/9qztlQoCh4k?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></p><p></p><p>“I targeted that race pretty much from November. To train towards it and get the result at the end was really rewarding,” Goss says.</p><p>“There was always a goal, it wasn’t really a surprise. It was a surprise <em>to win</em>, but it was planned to be the best I could there that day.”&nbsp;</p><p>Those desperately seeking condition and confidence don’t tend to magically discover it on the day itself. Only one man in the last 25 years has taken victory at Milan-San Remo without winning a race earlier in the same season: Filippo Pozzato in 2006.&nbsp;</p><p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related:&nbsp;The 2021 Men's Early Season: The Rouleur Racing Guide</a></em></strong></p><h4><strong>The readiness is all</strong></h4><p>What are the secrets to winning Milan-San Remo? “You’ve obviously got to have the kilometres in the legs, it’s a 300-kilometre bike race,” Goss says. “You’ve also got to have a bit of luck on your side.”&nbsp;</p><p>The race rolls out from&nbsp;Milan’s 15th-century Sforza Castle and heads south through the Piedmont valley and over its highpoint, the 532-metre Turchino.</p><p><em><span><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/fabian-cancellara-on-milan-sanremo-the-most-difficult-one-day-race\">Related : Fabian Cancellara on Milan-San Remo – the most difficult one day race</a></strong></span></em></p><p>Its opening half is usually uneventful, fodder for foolhardy breakaways to gain a&nbsp;sizeable lead. However, inclement conditions have turned even these opening hours into a key part of the survival process, as the 2013 and 2014 editions showed, where the <a href=\"https://www.rouleur.cc/blogs/desire-journal/castelli\">Castelli Gabba rose to prominence</a>.&nbsp;</p><p>Milan-San Remo hits the Ligurian coast at the race’s mid-point and heads west. The last 50 kilometres herald the start of the sharp <em>capi</em> climbs: Mele, Cervo and Berta. Each hill, though insignificant as a challenge in itself, has the potential to sap a favourite’s energy or take them out of the running altogether, caught behind a split or crash.</p><p>“You’ve just got to concentrate all day. I remember in 2011 when I won, right from the first kilometre, I was focusing,” Goss says. “The team was getting me bars all the time and I was always looking for my team-mates. There are lots of little things you can do over 300 kilometres, seven hours, that all add up in the end.</p><p>“There’s no one thing that’s gonna win Milan-San Remo. It’s a combination of the months of training, what you do on the day and about a thousand other little things.”</p><p>Having insider knowledge helps. The finale takes the bunch over the Cipressa and Poggio di Sanremo and, based in Monaco for most of his career, Goss had the bonus of being able to ride them in training.</p><p>“I couldn’t tell you how many times I’ve ridden the Cipressa and Poggio,” he says. “Obviously, it’s a lot nicer doing it in the race when there’s no traffic.”</p><p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-killer-smile-of-milan-sanremo-s-original-campionissimo\">Related: The first real superstar of Italian cycling: Costante Girardengo, six-time Milan-San Remo winner</a></em></strong></p><blockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/zxHZLUxLVF/?utm_source=ig_embed&amp;utm_medium=loading\" data-instgrm-version=\"12\" id=\"instagram-media-payload-0\"></blockquote><h4><strong>Fifteen frenetic minutes </strong></h4><p>&nbsp;Milan-San Remo’s final 15 minutes, from the foot of the Poggio to the finish line on the Via Roma, is professional cycling’s annual guarantee of excitement. The only way of winning for climbers and puncheurs is attacking on the hill, or&nbsp;all the way down into San Remo. Many fast men fancy their chances, but might lack enough team-mates to bring them back after 285 kilometres of racing.&nbsp;The pursuit is usually close and riveting.</p><p>The twisty descent&nbsp;of the Poggio should not be underestimated either. There’s no time to take in the view of the Mediterranean for the fatigued frontrunners: one slight miscalculation can easily be the difference between victory and defeat.</p><p>“You can lose the race if you crash there, which I’ve seen a lot of people do over the years,” Goss says. “But if you’re in the front there, you’re already in a good position for the race.”</p><p>The sprint is down to energy reserves and timing. In 2011, Goss not only outsprinted seven&nbsp;rivals but thoroughly outsmarted them. Without an HTC-Columbia team-mate in the finale, he hid in the wheels as his rivals wore themselves out with attacks, all the while fatally dragging the fast finisher onto the Via Roma.</p><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/MattGossMSR-Offside_1024x1024.jpg?v=1596633786\" alt=\"Matt Goss\">The 30-year-old&nbsp;retired in 2016&nbsp;after spells at MTN-Qhubeka and One Pro Cycling. But even before that, he&nbsp;had perspective on his San Remo success.</p><p>“It was the biggest win of my cycling career,” he says. “It was one of the races I always loved when I was younger. Before I even rode it, I always watched it and liked it. It was the race that suited me best, I could see myself having good results there. To realise that dream was pretty cool.”</p></div></div>","author":"AppHQ Collaborator","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"5dba13d470340c6913659a283777afd9c5118d18202660d210f173249235894f","category":"Cycling"}