{"title":"Scam iOS Apps Still Raking in Millions in Revenue on App Store","link":"https://www.macrumors.com/2021/02/09/scam-apps-ios-making-millions-revenue/","date":1612878056000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/09/scam-apps-ios-making-millions-revenue/\"><p>The problem of scam iOS apps has dogged Apple's App Store <a href=\"https://www.macrumors.com/2017/06/12/in-app-purchase-scams-app-store-ios/\">for some years now</a>, but over last two weeks the developer <a href=\"https://twitter.com/keleftheriou/status/1357938977748078594?s=20\">Kosta Eleftheriou</a> has taken to Twitter to highlight that the problem remains as big as ever in at least some app categories – and also offered iOS users a way to spot them.</p><p><img alt=\"app store safe secure\" width=\"1744\" height=\"818\" src=\"https://images.macrumors.com/t/LFmfO0oHsOnvCEU-fg7t6TJcHWc=/400x0/filters:quality(90)/article-new/2021/02/app-store-safe-secure.jpg?lossy\" data-src=\"https://images.macrumors.com/t/LFmfO0oHsOnvCEU-fg7t6TJcHWc=/400x0/filters:quality(90)/article-new/2021/02/app-store-safe-secure.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/LFmfO0oHsOnvCEU-fg7t6TJcHWc=/400x0/filters:quality(90)/article-new/2021/02/app-store-safe-secure.jpg?lossy 400w,https://images.macrumors.com/t/n_HfXMYekxgtYVFmV73VT9e3QWM=/800x0/filters:quality(90)/article-new/2021/02/app-store-safe-secure.jpg?lossy 800w,https://images.macrumors.com/t/wHDr69_ygIIUrx0OrPbmkZcQMC8=/1600x0/filters:quality(90)/article-new/2021/02/app-store-safe-secure.jpg 1600w,https://images.macrumors.com/t/woJ7Put5H-JrBVp1_rqg6DO97T8=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/app-store-safe-secure.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/LFmfO0oHsOnvCEU-fg7t6TJcHWc=/400x0/filters:quality(90)/article-new/2021/02/app-store-safe-secure.jpg?lossy 400w,https://images.macrumors.com/t/n_HfXMYekxgtYVFmV73VT9e3QWM=/800x0/filters:quality(90)/article-new/2021/02/app-store-safe-secure.jpg?lossy 800w,https://images.macrumors.com/t/wHDr69_ygIIUrx0OrPbmkZcQMC8=/1600x0/filters:quality(90)/article-new/2021/02/app-store-safe-secure.jpg 1600w,https://images.macrumors.com/t/woJ7Put5H-JrBVp1_rqg6DO97T8=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/app-store-safe-secure.jpg 2500w\"><br>Taking blatant rip-offs of his own popular FlickType Apple Watch keyboard app as an example of how scammers prey on and exploit the work of genuine app developers, Eleftheriou exposed some of the ways these scams work.<br></p><blockquote><p>Just a few months ago, I was way ahead of my competition. By the time they figured out just how hard autocorrect algorithms were, I was already rolling out the swipe version of my keyboard, quickly approaching iPhone typing speeds. So how did they beat me?</p><p>First, they made an app that appeared to fulfill the promise of a watch keyboard – but was practically unusable. Then, they started heavily advertising on FB &amp; Instagram, using my own promo video, of my own app, with my actual name on it.</p></blockquote><p>According to Eleftheriou, there are several clones of his FlickType app, but one of the most clear non-functional rip-offs was \"KeyWatch,\" which launched with a blank interface and an \"Unlock now\" button. Tapping the button prompted users to confirm an $8/week subscription for an app that doesn't do anything.</p><p>According to Eleftheriou, the scam achieved prominence in the App Store by gaming Apple's algorithmic ranking system through the purchase of fake ratings and glowing five-star reviews, which bumped it up to the top of its app category. It even advertised its software using his own promotional video, which includes his actual name.</p><div><blockquote><p lang=\"en\" dir=\"ltr\">Up to now, I've been in the \"Apple *wants* to do the right thing\" camp. My viewpoint is starting to change. How to spot a $5M/year scam on the <a href=\"https://twitter.com/AppStore?ref_src=twsrc%5Etfw\">@AppStore</a>, in 5 minutes flat:👇 — Kosta Eleftheriou (@keleftheriou) <a href=\"https://twitter.com/keleftheriou/status/1357938977748078594?ref_src=twsrc%5Etfw\">February 6, 2021</a></p></blockquote></div><p>Apple has since removed the fake app from the App Store, although the developer account responsible for multiple scam apps <a href=\"https://twitter.com/keleftheriou/status/1356725679102943232\">remains active</a>. Eleftheriou says that before KeyWatch was taken down, the developers had long benefited from what had become a $2 million-per-year scam that went largely unnoticed by Apple moderators until he personally exposed it.</p><p>Since that time, Eleftheriou has been on a Twitter crusade to expose more scam apps in the App Store, such as the so-called star gazing app that goes by the name \"Star Gazer+\" and basically uses the same time-proven strategy of masquerading as a genuine app that's barely functional and hoodwinks users into an exorbitant in-app weekly subscription fee.</p><p>As of writing, the scam app \"Star Gazer+\" is still listed on the App Store with 4.5 star average rating and over 80,000 reviews.</p><p>Eleftheriou's exposure of the rampant App Store scheme has led many more developers and <a href=\"https://twitter.com/dhh/status/1358822574243905538?s=20\">critics</a> to share their own experiences and hopefully put pressure on Apple to tighten up its app moderation and consider overhauling its billing interface and options, including the suggestion of <a href=\"https://twitter.com/marcoarment/status/1358089727962980356\">removing</a> the weekly subscription option altogether.</p><p>Apple has yet to comment on Eleftheriou's findings, but we'll be sure to update this article if we hear anything.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/intel-11th-gen-vs-apple-m1-chip-benchmarks/\">Intel Downplays Apple's M1 Chip With 'Carefully Crafted' Benchmarks</a></h3><p>Saturday February 6, 2021 3:17 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Nearly three months after the launch of Apple's rave-reviewed M1 Macs, Intel has fired back, but there are some asterisks involved. In a slideshow shared by PCWorld this week, Intel highlighted what PCWorld described as \"carefully crafted\" benchmarks in an attempt to prove that laptops with the latest 11th Generation Core processors are superior to those with Apple's custom-designed M1 chip. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-dtk-credit-for-developers-increased/\">Apple Ups DTK Mac Mini Return Credit to $500 After Developer Complaints</a></h3><p>Friday February 5, 2021 8:51 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Prior to the release of the M1 Macs, Apple offered developers a $500 Developer Transition Kit (DTK) that included a Mac mini equipped with an A12Z Bionic chip first used in the iPad Pro, 16GB RAM, a 512GB SSD, two USB-C ports, two USB-A ports, and an HDMI 2.0 port. The DTKs were available on a temporary basis, and earlier this week, Apple said that it would soon begin asking developers to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/01/imac-apple-silicon-redesign/\">iMac to Get a Whole New Look for Apple Silicon</a></h3><p>Apple's long-awaited iMac with Apple Silicon is expected to arrive this year featuring a complete redesign, according to a range of reports. According to Bloomberg's Mark Gurman, the redesigned iMac models will feature significantly slimmed down bezels around the display. The large aluminum \"chin\" segment, below the display of current iMacs, will be removed entirely for a design that...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/07/iphone-12-risk-magnets-pacemakers/\">Medical Doctors Underline Potential Risk of iPhone 12 Interference With Pacemakers</a></h3><p>Sunday February 7, 2021 4:11 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple's warning to keep the iPhone 12 away from cardiac devices due to electromagnetic interference was further underlined by U.S. cardiologists this week in a new report (via NBC25 News). Apple's iPhone 12 series includes an array of magnets that help align the phone on Apple's MagSafe charging accessory to maximize charging, and Apple already advises users with implanted pacemakers and...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/top-stories-ios-14-5-beta/\">Top Stories: iOS 14.5 Beta, macOS 11.2 Released, VR Headset and Apple Car Rumors</a></h3><p>It was a big week for software this week, with Apple kicking off a new round of betas for its operating systems with plenty of tweaks and changes in iOS 14.5 and related updates. We also saw the public release of macOS 11.2, which trailed last week's release of iOS 14.4. In other news, we got some significant new rumors about Apple's VR headset project and the Apple Car, while over on our...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-pauses-car-talks-hyundai-kia/\">Apple Pauses Electric Car Talks With Hyundai and Kia</a></h3><p>Friday February 5, 2021 2:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Multiple rumors over the course of the last week have suggested that Apple has been discussing Apple car manufacturing with Hyundai and Hyundai affiliate Kia, but those talks have paused recently, reports Bloomberg. Apple has also been discussing its Apple Car plans with other automobile manufacturers, so despite rumors suggesting Apple is considering a deal with Hyundai/Kia, Apple could...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/ios-14-5-beta-siri-default-music-service/\">Siri Setting in iOS 14.5 Beta Lets Users Select Default Music Streaming Service</a></h3><p>Monday February 8, 2021 4:09 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple last week released beta versions of upcoming iOS 14.5 and iPadOS 14.5 updates to developers and public beta testers, and among a number of new features, Apple has added the ability to set a default music streaming service when using Siri to play songs. Image via Reddit user matejamm1 First spotted by Reddit users, the first time you ask Siri to play a song in iOS 14.5, you are given the ...</p></div></div></div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"5e182152c7375ab25eaa9729d2641e67c4a71696431e255bac4674cbe5d91e93","category":"Apple"}