{"title":"Les Misérables","link":"https://neizod.github.io/2020/10/24/les-miserables.html","date":1603558424000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>เหยื่ออธรรม หรือที่ปัจจุบันมักเป็นที่รู้จักในนามต้นฉบับภาษาฝรั่งเศสว่า Les Misérables (เพื่อนฝรั่งเศสอ่าน เลอ-มี-เซอ-ฮา-เบล่อ) เป็นนิยายอิงประวัติศาสตร์จาก <a href=\"https://en.wikipedia.org/wiki/Victor_Hugo\">Victor Hugo</a> นักเขียนคนสำคัญจากฝรั่งเศส (ผลงานอื่น เช่น <a href=\"https://en.wikipedia.org/wiki/The_Hunchback_of_Notre-Dame\">คนค่อมแห่งน็อทร์-ดาม</a>) ตัวนิยายถูกเขียนขึ้นมาจากการสั่งสมประสบการณ์ของ Hugo ในปี 1862 ขณะที่เขาลี้ภัยการเมืองอยู่ต่างแดน เพื่อเล่าชนวนเหตุแห่งความแร้นแค้นตั้งแต่ปี 1815 จนนำพาไปสู่<a href=\"https://en.wikipedia.org/wiki/June_Rebellion\">กบฏฝรั่งเศสในปี 1832</a> ที่เหล่านักศึกษาพยายามโค้นล้มสถาบันกษัตริย์ของ Louis Philippe หลังขึ้นครองราชเพียงสองปี เพื่อนำฝรั่งเศสกลับไปสู่ยุคสาธารณรัฐอีกครั้ง แม้สุดท้ายจะจบลงด้วยความพ่ายแพ้ของเหล่านักศึกษาเพราะไม่สามารถปลุกระดมประชาชนทั่วไปให้ลุกฮือขึ้นมาร่วมต่อสู้ได้ แต่เหตุการณ์ดังกล่าวก็เป็นบทหนึ่งในประวัติศาสตร์การต่อสู้อันยาวนาน อันเป็นผลพวงจากเหตุการณ์ก่อนหน้าและนำพาไปสู่เหตุการณ์ถัดไป นับตั้งแต่การปฏิวัติฝรั่งเศสให้พ้นจากระบบกษัตริย์ของ Louis XVI ในปี <a href=\"https://en.wikipedia.org/wiki/French_Revolution\">1789</a> การก้าวขึ้นเป็นจักรพรรดิของ Napoleon I ในปี 1804 การย้อนกลับมาของระบบกษัตริย์ใต้รัฐธรรมนูญของ Louis XVIII ในปี 1815 การปฏิวัติโค่นระบบกษัตริย์จนหมดสิ้นในปี <a href=\"https://en.wikipedia.org/wiki/French_Revolution_of_1848\">1848</a> การย้อนกลับมาของระบบจักรพรรดิโดย Napoleon III ในปี 1851 จนวนกลับมาเป็นสาธารณรัฐที่สามในปี 1870</p><blockquote><p><img src=\"https://neizod.dev/images/poster/les-miserables.jpg\" alt=\"\"></p></blockquote><p>แม้งานเขียนชิ้นดังกล่าวจะขึ้นแท่นนิยายอันยิ่งใหญ่แห่งทศวรรษที่ 19 แต่มันก็เพิ่งจะถูกแปลงเป็นละครเพลงภาษาฝรั่งเศสครั่งแรกไปในปี 1980 นี้เอง ก่อนที่จะถูกดัดแปลงเป็นละครเพลงภาษาอังกฤษในปี 1985 โดยแสดงที่ West End ก่อนจะข้ามไปแสดงฝั่ง Broadway ในอีกสองปีให้หลังและคว้ารางวัล Tony ไปอย่างมากมาย</p><p>ซึ่งเพลงเด่นที่เรามักรู้จักกันดี คงหนีไม่พ้น I Dreamed a Dream เพลงเดียวจากตัวละครหญิงในองก์แรก ผู้รำพันถึงความฝันที่จะมีชีวิตอันหวานชื่น ที่ช่างขัดแย้งกับชีวิตจริงอันแสนขมขื่น และเพลง Do You Hear the People Sing? จากเหล่าตัวละครในองก์ที่สอง ผู้ไม่ยอมทนกับชีวิตอันแสนขื่นขมจากการโดนกดขี่อีกต่อไป</p><p>แต่ทั้งสองเพลงข้างต้นนั้นก็เป็นมุมมองจากคนสองเจนเนอเรชันที่ไม่เกี่ยวข้องกันโดยตรง ยังมีชุดเพลงสำคัญที่เรียงร้อยละครทั้งเรื่องเข้าด้วยกัน ซึ่งก็คือเพลงของ Valjean และ Javert บุคคลผู้อยู่มาอย่างยาวนานพอจะมองเห็นเหตุการณ์ทั้งสองยุคสมัย จุดที่น่าสนใจคือแม้ทั้งสองจะเป็นศัตรูคู่อริต่อกัน แต่เพลงธีมของพวกเขานั้นกลับใช้เมโลดี้เดียวกัน ดังจะเห็นได้จากคู่เพลง Valjean’s Soliloquy กับ Javert’s Suicide</p><p>และปฏิเสธไม่ได้ว่าการเผชิญหน้ากันในเพลง The Confrontation คือจุดไคลแมกซ์ในความสัมพันธ์ของทั้งคู่ เพลงนี้มีจุดเด่นที่การใช้เทคนิค counterpoint เมื่อตัวละครทั้งสองได้ร้องเพลงไปพร้อมๆ หากแต่ใช้เนื้อร้องแตกต่างกัน เราจะสัมผัสได้ถึงขาขึ้นและขาลงของตัวละครทั้งสองสลับไปมา จากนักโทษกลับใจที่ได้รับการช่วยเหลือจากโบสถ์จนอุทิตตนช่วยเหลือเพื่อนมนุษย์ของ Valjean และนายตำรวจผู้ปฏิบัติตามกฎหมายที่ตราขึ้นในนามพระเจ้าอย่างเคร่งครัดของ Javert แม้ภายนอกจะแตกต่างแต่ภายในกลับเหมือนกันอย่างแยกไม่ออก เปรียบได้ดังสองด้านของเหรียญเดียวกันไม่มีผิด</p><p>แล้วคุณหละ เป็น Valjean ผู้พร้อมแบ่งเบาความทุกข์ยากของเพื่อนมนุษย์แม้ต้องทำผิดกฎหมาย หรือเป็น Javert ผู้ยึดมั่นในความดีและความถูกต้องตามตัวอักษรอย่างยอมหักไม่ยอมงอ?</p><div><p><img src=\"https://neizod.dev/images/people/neizod.png\" width=\"72\" height=\"72\"></p></div></div></div>","author":"","siteTitle":"neizod's speculation","siteHash":"939338c5557b1743f2c128736c6006e145dcabc81da9970f1c0dc8ae2feb0830","entryHash":"5e2e48544d74041160d4ca0d0dd610a9922b8b12318ebe7118c8b96cbf807a43","category":"Thai"}