{"title":"Biden admin plans executive order to address chip-shortage woes","link":"https://arstechnica.com/?p=1744805","date":1614202268000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>homemade —</h4><h2 itemprop=\"description\">Semiconductor demand isn't going to drop, but supply has proven a problem.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1230841226-800x536.jpg\" alt=\"An older man in a suit speaks from the Resolute Desk.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1230841226.jpg\" data-height=\"3950\" data-width=\"5894\">Enlarge</a> <span>/</span> President Joe Biden signing a different executive order on January 28, 2021.</p></figcaption></figure><p>The White House is launching an effort today to ease the global semiconductor supply crunch affecting a wide array of other industries, but any boost the administration can provide is likely to be on the far side of many more months of shortages.</p><p>President Joe Biden plans to sign an executive order this afternoon aimed at \"securing America's critical supply chains.\" The order will address several challenges in the US supply chain, according to a <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/02/24/fact-sheet-securing-americas-critical-supply-chains/\">fact sheet</a> from the White House, with a particular focus on pharmaceuticals, mineral resources, semiconductors, and large-capacity batteries.</p><p>The order is a sort of combination of every US politicians' favorite rallying cry—\"more American jobs\"—and an acknowledgement that shortages and production challenges in critical supply chains really have had a profound effect on the nation, especially in the past year. It calls for an immediate 100-day review that will \"identify near-term steps the administration can take, including with Congress\" to identify where the vulnerabilities in these supply chains are and what regulators or legislators can do to increase US manufacturing of these critical components.</p><p>In addition to the short-term review, the order also calls for a yearlong examination of risks and vulnerabilities in six other US technology supply chains: defense, public health, information technology and communications, energy, transportation, and agricultural tech.</p><p>While the order is framed in practical terms, there is of course a political component as well. According to a <a href=\"https://www.cnbc.com/2021/02/18/biden-to-order-supply-chain-review-to-assess-us-reliance-on-overseas-semiconductors.html\">draft version</a> CNBC obtained last week, the executive order does not mention any other nations (such as China) by name. Instead, it specifically seeks to review places where the US supply chain interacts with \"nations that are or are likely to become unfriendly or unstable.\"</p><h2>Silicon woes</h2><p>The silicon chip shortage is indeed tied to the pandemic, according to <a href=\"https://www.semiconductors.org/semiconductor-shortage-highlights-need-to-strengthen-u-s-chip-manufacturing-research/\">industry group research</a>. Automotive demand dropped early in the pandemic, as people stopped going anywhere, but demand for other uses—such as devices used for virtual learning or telemedicine—went up. As every demand pattern around the world went topsy-turvy, the industry has struggled to keep up.</p><p>The shortages are beginning to affect all kinds of products. PC graphics cards are <a href=\"https://arstechnica.com/gadgets/2020/12/demand-will-probably-exceed-supply-nvidia-explains-rtx-30-shortages/\">legendarily in short supply</a>, and wafer shortages are a contributing factor. Companies are also expressing concern that shortages will affect the availability of <a href=\"https://arstechnica.com/gaming/2021/02/chip-shortage-may-threaten-playstation-5-supplies-at-christmas/\">gaming consoles</a> and <a href=\"https://arstechnica.com/gadgets/2021/01/samsung-says-auto-chip-shortage-could-hit-smartphones/\">smartphones</a> in the near future.</p><p>In both the US and worldwide, the auto industry is hit&nbsp;<a href=\"https://arstechnica.com/cars/2021/02/a-silicon-chip-shortage-is-causing-automakers-to-idle-their-factories/\">particularly hard</a>&nbsp;at the moment. Several automakers have had to slow or halt production at their factories due to a lack of chips to put into new cars.</p><p>The Biden administration hopes to help increase supply in the long run in part by increasing US manufacturing capacity. \"Over the years, we have underinvested in [semiconductor] production—hurting our innovative edge—while other countries have learned from our example and increased their investments in the industry,\" the White House said. \"Building resilient supply chains will protect the United States from facing shortages of critical products. It will also facilitate needed investments to maintain America's competitive edge and strengthen US national security.\"</p><p>Industry data backs up Biden's point, showing that while the US has the highest percentage of market share for chips—a little under half of all sales, globally, go to US-based firms—the vast majority of actual manufacturing takes place in Asia and is expected to continue to do so. About 79 percent of chips were made in Asia in 2019, according to a Semiconductor Industry Association report (<a href=\"https://www.semiconductors.org/wp-content/uploads/2020/06/2020-SIA-State-of-the-Industry-Report.pdf\">PDF</a>); by 2025, that number is projected to rise to about 82 percent. Only 10-12 percent of chip manufacturing takes place inside the US.</p></div></div>","author":"Kate Cox","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"5f17c1b72c9e88904f1299d233bea198b49642bcf0d084f47b132340070a4380","category":"Tech"}