{"title":"Sram Red eTap AXS Max 36T rear derailleur: Wider gear range now possible with Sram’s flagship component line","link":"https://www.cyclist.co.uk/sram/9200/sram-red-etap-axs-max-36t-rear-derailleur-wider-gear-range-now-possible-with-sram-s","date":1612438539000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Sram released <a href=\"https://www.cyclist.co.uk/reviews/8180/sram-force-etap-axs-wide-gearing\">a Max 36T rear derailleur in its second-tier Force eTap AXS groupset</a> last summer, and this year it’s the turn of the flagship Sram Red level components to receive the same update. The Sram Red eTap AXS equipped bikes can now have the option of wider gear ratios – crucially a sub-1:1 climbing gear – without needing to use mismatched components.</p><p>While it might look identical at first glance, the derailleur has a different body, slightly longer to accommodate the wider range.&nbsp;This enables the Sram Red eTap AXS 36T Max rear derailleur to be used with a 10-36T cassette, where previously the Red eTap AXS rear derailleur maxed out at 33T.</p>&nbsp;<p>It is still compatible with the smaller 10-28T and 10-33T cassettes, but no longer with 10-26T, although we would imagine that will not be of concern for many as there is likely very little demand for that cassette size in the modern era.</p><p>Other than the extended range, all the other features of the Sram Red eTap AXS mech are retained: The Orbit chain management, X-Sync pulleys, ceramic bearings and the new derailleur also uses the same battery.</p>&nbsp;<p>The new Red eTap AXS Max 36T mech is ideal to pair with a 1x drivetrain, although it is equally compatible with all of Sram’s 12-speed 2x chainsets.&nbsp;Now, when paired with a 10-36T cassette a 46/33T chainset will achieve a 502% gear range, with a sub 1:1 gear ratio (.92).</p><p>A 48/35T crankset equates to a 494% gear range, also with a sub 1:1 gear ratio (.97). In a nutshell, you should never find yourself wanting for more gears.</p><p><a href=\"https://www.sram.com/en/sram/models/rd-red-e-d1\" target=\"_blank\"><em><strong>Buy the Sram Red eTap AXS Max 36T rear derailleur now</strong></em></a></p><p>Sram recommends only its own Red and Force Flattop chains should be used with the 36T Max rear derailleur and 10-36T cassette.</p>&nbsp;<h3>Cassette</h3><p>There will not be a dedicated Red level cassette to pair with this new derailleur, instead Sram has updated its XG-1270 10-36T cassette, with a silver Nickel-Chrome finish, to suit both Red and Force level components.</p><h3>Pricing &amp; availability</h3><p>Sram Red eTap AXS Max 36T Rear Derailleur (battery not included) – £610.00&nbsp;&nbsp;<br>Cassette XG-1270 Silver 12-Speed 10-28T – £170.00&nbsp;&nbsp;<br>Cassette XG-1270 Silver 12-Speed 10-33T – £170.00&nbsp;&nbsp;<br>Cassette XG-1270 Silver 12-Speed 10-36T – £170.00</p><p><a href=\"https://www.sram.com/en/sram/models/rd-red-e-d1\" target=\"_blank\"><em>Available now</em></a></p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"5fc89db7ed88ae2c3a31fb5075e677f5d265c42aee2facc3a72556ca97bcb7e8","category":"Cycling"}