{"title":"Preview: Your stage-by-stage breakdown of the 2021 Giro d’Italia course","link":"https://cyclingtips.com/2021/05/preview-your-stage-by-stage-breakdown-of-the-2021-giro-ditalia-course/","date":1620094952000,"content":"<div><div><p>After last year’s Giro d’Italia was delayed until October due to COVID, Italy’s biggest race returns to its regular May timeslot this year for its 104th edition.</p><p>Starting in Torino in far north-west Italy on Saturday May 8, the race sweeps down Italy’s eastern coastline, reaching its southernmost point by stage 8. From there the riders will head north again, back towards the Alps for the final week. The race ends as it often does, in Milan, in the shadows of the spectacular Duomo di Milano.</p><p>Here’s your stage-by-stage breakdown of the 2021 Giro d’Italia, perfect to help you plan which stages you’ll watch, or which rider to assign to each stage in our fantasy competition (more on that soon). Stay posted to CyclingTips for a preview of the riders to watch, coming soon.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Giro2021_genereale_plan-2-1340x1567.jpg\"></figure><hr><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Giro2021_generale_alt-1340x555.jpg\"></figure><h2>Stage 1: Torino to Torino ITT (8.6 km) | Saturday May 8</h2><p>The Giro opens with an individual time trial but it’s not a particularly tough one. With just 50 metres of elevation gain over 8.6 km and very few tight corners this should just be a slugfest for the big, powerful riders (Filippo Ganna anyone?) The first maglia rosa awaits the stage winner.</p><p><strong>Who’s it for:</strong> The pure TT specialists.<br><strong>What to watch for:</strong> How the big GC contenders go relative to one another.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-1.jpeg\"></figure><h2>Stage 2: Stupinigi to Novara (179 km) | Sunday May 9</h2><p>Raced entirely in the Piedmont region of north-west Italy, this is a nice gentle introduction to the Giro’s road stages. With only 600 metres of climbing, this is a very flat day’s racing that should end in a bunch kick. With just one corner in the last 4 km, the run-in to the sprint should be pretty straightforward too.</p><p><strong>Who’s it for:</strong> The sprinters.<br><strong>What to watch for:</strong> There’ll be a battle to get in the breakaway and be first atop the day’s only climb. Whoever crosses that line first will wear the race’s first KOM jersey on stage 3.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-2.jpeg\"></figure><h2>Stage 3: Biella to Canale (190 km) | Monday May 10</h2><p>Four late climbs make this an interesting stage (note that the last, 3.5 km climb doesn’t offer points for the KOM competition, but it does have sprint points at the top – go figure). None of the climbs are particularly tough, but if the right riders are up for the fight, these climbs <em>could</em> be enough to force a selection late in the piece. Look for attacks on that last, uncategorised climb in particular, roughly 15 km from the finish.</p><p><strong>Who’s it for:</strong> The puncheurs.<br><strong>What to watch for:</strong> Plenty of aggression on the last few climbs.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-3.jpeg\"></figure><h2>Stage 4: Piacenza to Sestola (187 km) | Tuesday May 11</h2><p>There’s less climbing on this stage than on stage 3 (1,800 vs 2,100 metres) but this is a tougher stage, owing to the nature of that climbing. With two third-category climbs, a late uncategorised ascent of more than 5 km, and then a tough second-category climb that peaks 2.5 km from the line, this is a challenging day’s racing.</p><p>That final climb is only 4.3 km long, but with an average of 9.9% it’s quite steep. From there the riders will descend briefly before a lumpy approach to the line. This feels like a day for the breakaway, but we might still see the GC contenders throwing a few haymakers.</p><p><strong>Who’s it for:</strong> The breakaway?<br><strong>What to watch for:</strong> Our first chance to see which GC riders are climbing well.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-4.jpeg\"></figure><h2>Stage 5: Modena to Cattolica (177 km) | Wednesday May 12</h2><p>This is about as flat as bike racing gets. The riders will follow one road most of the way to the Adriatic coast, climbing just 200 metres in the process. Did I mention this stage is flat? The run-in to the finish in Cattolica is pretty straightforward too: after a few corners, the last 900 metres to the line is all straight.</p><p><strong>Who’s it for:</strong> The sprinters (obviously).<br><strong>What to watch for:</strong> If there are crosswinds around, this could get interesting.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-5.jpeg\"></figure><h2>Stage 6: Grotte di Frasassi to Ascoli Piceno (160 km) | Thursday May 13</h2><p>There’s barely a metre of flat road in this jaunt through the Marche region. With 3,400 metres of climbing, stage 6 also plays host to the race’s first proper uphill finish: a 15.5 km ascent at 6.1% that gets steeper closer to the top.</p><p><strong>Who’s it for:</strong> The GC contenders.<br><strong>What to watch for:</strong> Our first chance to see who’s <em>really </em>climbing well.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-6.jpeg\"></figure><h2>Stage 7: Notaresco to Termoli (181 km) | Friday May 14</h2><p>With just the one fourth-category climb, this race along the Adriatic coast <em>should </em>be a day for the sprinters. But that’s not a given – there’s a tantalisingly steep ramp just 1.7 km before the finish that could be a great launchpad for an ambitious rider. That ramp is only 200 metres long, but at 12% it could produce some fireworks. Note that there are six bends in the final 2 km and the finishing straight is uphill too. In short: this isn’t a regulation sprint finish.</p><p><strong>Who’s it for:</strong> The smaller sprinters.<br><strong>What to watch for:</strong> A late dig from a Classics-type rider to disrupt the fastmen.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-7.jpeg\"></figure><h2>Stage 8: Foggia to Guardia Sanframondi (170 km) | Saturday May 15</h2><p>This feels like it might be a day for the breakaway as well. There’s a big second-category climb in the final third of the race (18.9 km at 4.6%) but it’s the day’s final, fourth-category ascent that could be more decisive. Peaking just 500 metres from the line, it’s officially 2.5 km at 7.6% but the road tends upward for nearly 10 km before the designated climb begins.</p><p><strong>Who’s it for:</strong> Breakaway riders who are strong uphill.<br><strong>What to watch for:</strong> A punchy GC rider who might try to snag a few seconds on the final climb.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-8.jpeg\"></figure><h2>Stage 9: Castel di Sangro to Campo Felice (158 km) | Sunday May 16</h2><p>A short day in the Abruzzo region of central Italy but a tough one. As you can see below, the profile resembles something of a sawtooth. All up, the riders will amass 3,400 m of climbing.</p><p>That last climb is only 6 km at 6% but that includes 1.6 km on a gravel track that’s apparently a ski slope in winter. This is a tricky day that the GC riders will be happy to have behind them.</p><p><strong>Who’s it for:</strong> Probably the GC contenders.<br><strong>What to watch for:</strong> Uphill gravel sectors are always worth a watch.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-9.jpeg\"></figure><h2>Stage 10: L’Aquila to Foligno (139 km) | Monday May 17</h2><p>The shortest road stage of the Giro and a relatively easy one at that. The biggest challenge is a 6 km ascent that peaks with 39 km to go. From there it’s downhill then flat to the finish. It’ll probably be a bunch sprint that takes the riders into the first rest day, but there are a few twists and turns in the final 2 km that might make things interesting.</p><p><strong>Who’s it for:</strong> The sprinters.<br><strong>What to watch for:</strong> Which sprinters were able to get over the late climb? Who wasn’t?</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-10.jpeg\"></figure><h2>Stage 11: Perugia to Montalcino (162 km) | Wednesday May 19</h2><p>A mini Strade Bianche makes this a tough return to racing after the first rest day. There’s 2,300 metres on climbing on tap but harder than that will be the 35 km of gravel roads spread over four sectors. The first sector includes a technical downhill stretch, the second includes a third-category climb, and the last sector is part of a 13 km ascent at 3.6% that peaks just a few kilometres from the finish.</p><p>The descent into Montalcino is technical and narrow on stone-paved roads, before switching back to tarmac for the final 200 metres. This is going to be a must-watch stage. Check out <a href=\"https://www.youtube.com/watch?v=__WabDQY4Gc\" target=\"_blank\">Cadel Evans’ legendary, mud-splattered stage win into Montalcino</a> from the 2010 edition to get in the mood.</p><p><strong>Who’s it for:</strong> Who knows! (Maybe a small group?)<br><strong>What to watch for:</strong> All of it. Just about anything could happen. An ill-timed puncture could spell disaster for a GC contender.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-11.jpeg\"></figure><h2>Stage 12: Siena to Bagno di Romagna (212 km) | Thursday May 20</h2><p>Another tough day, with a particularly difficult back half. There are three big climbs for the riders to conquer: 17.1 km at 5.7%, 15.3 km at 5.5% and then 10.8 km at 5.1%. The last of those climbs has many changes in gradient and peaks about 11 km from the finish. From there it’s downhill and flat to the finish.</p><p><strong>Who’s it for:</strong> A breakaway of riders that saved themselves on the tough stage 11.<br><strong>What to watch for:</strong> GC riders who might be battling on the final climb after the tough stage previous.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-12.jpeg\"></figure><h2>Stage 13: Ravenna to Verona (198 km) | Friday May 21</h2><p>A regulation sprint stage with just 200 metres of climbing in 198 km. The final kilometres are on wide, straight, well-paved roads with only a few roundabouts to disrupt the lead-out trains.</p><p><strong>Who’s it for:</strong> The sprinters.<br><strong>What to watch for:</strong> If there are crosswinds this could be interesting.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-13.jpeg\"></figure><h2>Stage 14: Cittadella to Monte Zoncolan (205 km) | Saturday May 22</h2><p>According to Giro organisers this is one of only three days of five-star difficulty in this year’s race. It’s a doozy of a stage. After an early fourth-category climb and then the Forcella di Monte Rest climb (10.5 km at 5.9%) the riders will face the mighty Monte Zoncolan.</p><p>The race approaches from the Sutrio side this year, not from Ovaro as it often does, but this is still a fearsome climb. It’s 14.1 km at 8.5% all up, but the last 3 km ramps up at an average of 13% with a max gradient of 27% right near the finish. The last kilometre alone averages 18%. Recent winners on Monte Zoncolan include Ivan Basso (2010), Igor Anton (2011), Michael Rogers (2014), and Chris Froome (2018).</p><p><strong>Who’s it for:</strong> GC contenders.<br><strong>What to watch for:</strong> It’s easy to lose a lot of time in a flash on a finish as steep as this.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-14.jpeg\"></figure><h2>Stage 15: Grado to Gorizia (147 km) | Sunday May 23</h2><p>A short stage that brings with it the race’s first departure from Italy. The stage features a circuit in the closing kilometres that takes the riders into and out of neighbouring Slovenia a total of four times. The stage features three ascents of the fourth-category Gornje Cerovo climb (1.7 km at 8.5%), the last of which peaks 16.5 km from the finish.</p><p>The more interesting climb might be the uncategorised ramp that tops out just 3 km from the finish. It’s only 1 km at 5.9% but it could well be a perfect launch pad.</p><p><strong>Who’s it for:</strong> Sprinters or possibly the puncheurs, depending on how it’s raced.<br><strong>What to watch for:</strong> That final climb – can the sprinters hold on when the attacks come?</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-15.jpeg\"></figure><h2>Stage 16: Sacile to Cortina d’Ampezzo (212 km) | Monday May 24</h2><p>The queen stage of this year’s Giro is an absolute monster in the Dolomites. At 212 km it’s one of the longest days of the race, but it also happens to feature a massive 5,700 metres of climbing. All up there are four first-category climbs. The first (La Crosetta – 11.6 km at 7.1%) comes more or less straight after the start. The next is the Passo Fedaia (14 km at 7.6%) and has a tough final 5.5 km which averages 11%.</p><p>The Cima Coppi – the highest point of the Giro – will be reached on the Passo Pordio (11.8 km at 6.8%, to an elevation of 2,239 metres), and then it’s onto the Passo Giau (9.9 km at a tough 9.3%). From the top of that final climb it’s actually downhill for 17.5 km to the finish, apart from the last kilometre or so which is slightly uphill. In short: a brutal stage just before the second rest day.</p><p><strong>Who’s it for:</strong> Anyone who has hopes of winning the race overall.<br><strong>What to watch for:</strong> For the few sprinters keen to have a tilt at stage 18, this will be a day-long battle to stay inside the time cut.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-16.jpeg\"></figure><h2>Stage 17: Canazei to Sega di Ala (193 km) | Wednesday May 26</h2><p>The riders aren’t exactly eased back into the racing after the second rest day. This stage features two big first-category climbs towards the end: the Passo di San Valentino (14.8 km at 7.8%) and then the Sega di Ala (11.2 km at 9.8%) which takes the riders right to the finish line.</p><p><strong>Who’s it for:</strong> Probably the GC men (but maybe a breakaway if the top teams let one get away).<br><strong>What to watch for:</strong> The inconsistent gradient on the final climb – punchier climbers might fare better than diesels.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-17.jpeg\"></figure><h2>Stage 18: Rovereto to Stradella (231 km) | Thursday May 27</h2><p>The longest stage of the Giro but one of the easiest. With just 600 metres of climbing, this lengthy jaunt through wine country in north-central Italy should be something of an easy day ahead of the last few GC stages. As you can see there are a few ripples on the profile towards the end, but this <em>should</em> be a bunch sprint.</p><p><strong>Who’s it for:</strong> The sprinters.<br><strong>What to watch for:</strong> Some aggressive riders trying to thwart the sprinters on those late lumps.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-18.jpeg\"></figure><h2>Stage 19: Abbiategrasso to Alpe di Mera (176 km) | Friday May 28</h2><p>A tough day to begin the final trio of GC stages. The profile is punctuated by three sizeable climbs: the first-category Mottarone (15.4 km at 6.7%), the third-category Passo della Colma (7.5 km at 6.4%) and the stage-ending, first-category ascent of the Alpe di Mera (9.7 km at 9%). Note there’s barely any flat road for the entire stage – the roads between climbs are all either downhill, or false-flat drags. Tough one.</p><p><strong>Who’s it for:</strong> Possibly a breakway but important for GC either way.<br><strong>What to watch for:</strong> The descent off the Mottarone is quite technical.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-19.jpeg\"></figure><h2>Stage 20: Verbania to Alpe Motta (164 km) | Saturday May 29</h2><p>In the words of the Giro roadbook, this is “a colossal Alpine stage”. Much of the stage is held over the border in Switzerland and while it’s flat to begin with, the back half is anything but. Three first-category climbs run one after another: the Passo San Bernadino (23.7 km at 6.2% – the longest climb of the Giro), the Passo dello Spluga (8.9 km at 7.3%) and then the climb to the Alpe Motta ski resort (7.3 km at 7.6% with a flatter final kilometre). There’s a total of 4,200 metres of climbing on the day and fireworks are a near-certainty.</p><p><strong>Who’s it for:</strong> GC contenders.<br><strong>What to watch for:</strong> This is the last chance for the climbers among the GC contenders to make a difference.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-20.jpeg\"></figure><h2>Stage 21: Senago to Milan ITT (30.3 km) | Sunday May 30</h2><p>The Giro started with an individual time trial and it finishes with one too. There’s almost no climbing to speak of (100 metres in 30.3 km) and it’s not a terribly technical course either. There are three, 90º turns inside the final kilometre as riders approach the Duomo di Milano though, so riders will need to be a little careful, particularly GC contenders if they’re still fighting for seconds at that point.</p><p><strong>Who’s it for:</strong> TT specialists and strong TTers among the GC contenders.<br><strong>What to watch for:</strong> If it’s wet, the city centre course could get quite slippery.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/2021-giro-profile-stage-21.jpeg\"></figure><h2>Must-watch stages</h2><p>Not able to watch every single stage? Here are the eight we’d recommend tuning in for.</p><p><strong>Stage 4:</strong> Our first chance to see which GC riders are climbing well.<br><strong>Stage 6:</strong> The first big mountain-top finish.<br><strong>Stage 9:</strong> An uphill finish on gravel!<br><strong>Stage 11:</strong> Strade Bianche day.<br><strong>Stage 14:</strong> Monte Zoncolan. Enough said.<br><strong>Stage 16:</strong> The queen stage with 5,700 m of climbing.<br><strong>Stage 19:</strong> A big day of climbing and an uphill finish.<br><strong>Stage 20:</strong> The last mountain day.</p></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"5ffaf6f2865f8142d9ed3b3161682d3f90db59a48a1e2e21687fcc70304f0bf6","category":"Cycling"}