{"title":"France Pushes to Widen EU Regulations on Big Tech Companies","link":"https://www.macrumors.com/2021/02/15/france-pushes-to-widen-eu-regulations-on-big-tech/","date":1613401809000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/15/france-pushes-to-widen-eu-regulations-on-big-tech/\"><p>France is pushing for changes to the EU's upcoming regulations on big tech companies, including <a href=\"https://www.macrumors.com/2020/10/12/apple-reportedly-on-eu-hit-list-of-big-tech/\">Apple, Google, Amazon, and Facebook</a>, that would make it easier for governments to penalize bad behavior and widen controls on content, according to a new report by the <em><a href=\"https://www.ft.com/content/5e41d0cf-a83c-4817-997e-a353858137ab?shareType=nongift\">Financial Times</a></em>.</p><p><img alt=\"european parliament\" width=\"1920\" height=\"1132\" src=\"https://images.macrumors.com/t/-yn94VlgDqY3LqAZuV_XL1s2ODk=/400x0/filters:quality(90)/article-new/2020/11/european-parliament.jpg?lossy\" data-src=\"https://images.macrumors.com/t/-yn94VlgDqY3LqAZuV_XL1s2ODk=/400x0/filters:quality(90)/article-new/2020/11/european-parliament.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/-yn94VlgDqY3LqAZuV_XL1s2ODk=/400x0/filters:quality(90)/article-new/2020/11/european-parliament.jpg?lossy 400w,https://images.macrumors.com/t/fc-j7QsQN_wKedvUQWsAPDbKKRE=/800x0/filters:quality(90)/article-new/2020/11/european-parliament.jpg?lossy 800w,https://images.macrumors.com/t/2b9RTCdeS5aFBZBqLMMzMrJgAdQ=/1600x0/filters:quality(90)/article-new/2020/11/european-parliament.jpg 1600w,https://images.macrumors.com/t/V6NaK1VfVUjHtTnn8F9tFwvrmGQ=/2500x0/filters:no_upscale():quality(90)/article-new/2020/11/european-parliament.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/-yn94VlgDqY3LqAZuV_XL1s2ODk=/400x0/filters:quality(90)/article-new/2020/11/european-parliament.jpg?lossy 400w,https://images.macrumors.com/t/fc-j7QsQN_wKedvUQWsAPDbKKRE=/800x0/filters:quality(90)/article-new/2020/11/european-parliament.jpg?lossy 800w,https://images.macrumors.com/t/2b9RTCdeS5aFBZBqLMMzMrJgAdQ=/1600x0/filters:quality(90)/article-new/2020/11/european-parliament.jpg 1600w,https://images.macrumors.com/t/V6NaK1VfVUjHtTnn8F9tFwvrmGQ=/2500x0/filters:no_upscale():quality(90)/article-new/2020/11/european-parliament.jpg 2500w\"></p><p>The Digital Services Act, <a href=\"https://www.macrumors.com/2020/12/15/eu-introduces-strict-rules-on-big-tech-companies/\">presented in December 2020</a>, is designed to tackle illegal online content in the European Union by obliging big tech companies to quickly remove it, or face hefty fines.</p><p>France now wants to change the Digital Services Act by allowing every individual EU member state to have the right to fine big tech companies and force them to remove content on their platforms. Currently, only EU countries where tech companies are headquartered can enforce the EU's laws.</p><p>For example, Apple, Google, and Facebook have European headquarters in the Republic of Ireland. This means that, as it stands, only Ireland can sanction these companies or make requests for the removal of content. France's proposition would give all 27 EU member states the ability to punish or control big tech companies in the exact same way Ireland can.</p><p>There is, however, concern among EU officials that the French proposals would erode the EU's precious single market. The single market is an agreement designed to make it easy for people, goods, services, and money to move between EU member states, as though it is a single country. Under France's plans, big tech companies would be subject to 27 authorities, instead of just one.</p><p>France is also pushing for other changes to the Digital Services Act that would allow it to \"include other types of problematic content,\" including \"harmful content and disinformation,\" broadening the parameters of the \"illegal content\" that the Digital Services Act is proposing to control.</p><p>The Digital Services Act comes hand-in-hand with the <a href=\"https://www.macrumors.com/2020/10/01/eu-plan-ban-pre-installing-apps-force-data-sharing/\">Digital Markets Act</a>, which demands that big tech companies share metrics with competitors, ensure that all apps are uninstallable, and do not preference their own apps and services. Companies that fail to do so may face large fines, as high as ten percent of the company's worldwide annual turnover, or even forced disinvestment.</p><p>Apple has already gone some way to meeting the rules set out in the Digital Markets Act. For example, as of iOS 10, Apple has allowed users to <a href=\"https://www.macrumors.com/2016/06/13/delete-preinstalled-ios-apps/\">uninstall default apps</a>. Likewise, last year, Apple <a href=\"https://www.macrumors.com/2019/09/09/apple-adjusts-app-store-search-algorithm/\">adjusted its App Store search algorithm</a> so that fewer of its own apps appear at the top of search results. Nevertheless, Apple will be equally obligated to meet the demands of the legislation, including sharing its internal metrics and data, when the act comes into law.</p><p>In recent weeks, France's minister for the digital economy, Cedric O, has met with senior EU officials, including the European commissioner in charge of the upcoming big tech regulations, Thierry Breton, to make the case for these significant changes to the Digital Services Act.</p><p><small>Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our <a href=\"https://forums.macrumors.com/forums/political-news.218/\">Political News</a> forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.</small></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/13/zuckerberg-facebook-inflict-pain-on-apple-privacy/\">Mark Zuckerberg Reportedly Told Staff Facebook Needs to 'Inflict Pain' on Apple Over Privacy Dispute</a></h3><p>Saturday February 13, 2021 2:33 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple and Facebook have been in a very public spat over the course of the last few months as Apple dials up its pro-privacy stance. The two companies have long had tension, but more recently, Facebook is taking shots at an upcoming iOS and iPadOS feature that will require apps and data companies such as Facebook to ask for users' permission before tracking them across other sites and websites. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/prosser-airtags-ipad-pro-next-month/\">Leaker Jon Prosser Claims AirTags and New iPad Pro to Be Announced Next Month</a></h3><p>Friday February 12, 2021 11:56 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple is slated to release a number of new products this year, and the first round of products could be just a few weeks away. YouTuber Jon Prosser, who has a mixed track record when it comes to reporting on Apple's plans, claims that AirTags and brand new iPad Pro models are set to be announced next month, presumably via a virtual event. Prosser, who runs the tech-news show \"Front Page...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/one-last-intel-mac/\">Apple Surprisingly Sticking With Intel Chips for One Last Mac</a></h3><p>Despite having begun the transition towards using its own custom silicon across the Mac product lineup, somewhat surprising recent rumors have suggested that Apple may continue to use Intel chips for one Mac model. Last year at WWDC, Apple announced plans to transition away from Intel chips to Macs built with its own Apple Silicon, such as the M1 chip, starting in late 2020. It set out its ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/intel-anti-mac-ad-campaign/\">Intel's Anti-Mac Ad Campaign Highlights M1 Shortcomings</a></h3><p>Thursday February 11, 2021 5:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of the M1 Macs last November, Apple officially began its transition away from Intel's chips, and it's clear from Intel's latest advertising campaign that the company is feeling threatened by Apple's decision. In ads shared on Twitter, Intel has been highlighting the shortcomings of Apple's M1 Mac lineup. An ad this week, for example, points out the gaming capabilities of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/iphone-tips-february-2021/\">Useful iPhone Tips You Might Not Know</a></h3><p>Friday February 12, 2021 3:00 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>There seem to be an endless number of iPhone tips and tricks to share, and that's because Apple's smartphones are so feature rich that it's impossible to keep up with everything they're capable of. We've rounded up some useful tips and hacks in our latest video, so check them out to see if there's something you didn't know about. Subscribe to the MacRumors YouTube channel for more videos. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/apple-turn-off-activation-lock-page/\">Apple Launches Self-Serve Portal for Initiating Activation Lock Removal Requests</a></h3><p>Friday February 12, 2021 8:13 am PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today added a new \"Turn off Activation Lock\" page to its website that provides steps users can take to turn off the security feature on an iPhone, iPad, or iPod touch. As noted on Reddit, the page includes a link to start an Activation Lock support request in the United States, meaning that customers no longer have to contact an Apple support representative by phone, email, or online...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/ipad-2021-major-upgrade/\">Major Upgrades Coming to the iPad in 2021</a></h3><p>Apple is looking to launch an updated ninth-generation iPad with a larger display, the A13 Bionic chip, 4GB of RAM, and a thinner, lighter design in the first half of this year, according to recent reports. Reports from cnBeta and Mac Otakara, citing supply chain sources in China, have offered similar projections for the ninth-generation ‌iPad, explaining that the updated device will...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/14/heart-month-activity-challenge/\">Apple's Heart Month Activity Challenge Requires 60 Minutes of Exercise on Valentine's Day</a></h3><p>Saturday February 13, 2021 10:15 pm PST by <a href=\"https://www.macrumors.com/author/frank-mcshan/\" rel=\"author\">Frank McShan</a></p><p>Today only, Apple Watch owners can complete a new Apple Watch activity challenge in celebration of Heart Month, which is aimed at promoting cardiovascular health. The challenge, which is listed in the Fitness app on the iPhone, tasks users with earning 60 minutes on their Exercise ring. Show your heart some love. Get this award by earning 60 minutes on your Exercise ring this Valentine's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/foundation-showrunner-hopes-for-80-episodes/\">'Foundation' Showrunner Hopes for Unparalleled 80 Episodes on Apple TV+</a></h3><p>\"Foundation\" writer and showrunner David Goyer is ambitiously hoping to tell Isaac Asimov's science-fiction story over the course of eighty hours, which is as yet unheard of on Apple TV+. Foundation tells the story of \"a band of exiles on their monumental journey to save humanity and rebuild civilization amid the fall of the Galactic Empire,\" and is based on Isaac Asimov's science-fiction...</p></div></div></div>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"60f2e0252e3e0de96d3901707ffbbfb88d5f385c1e94db9c702f4fb0faafa37e","category":"Apple"}