{"title":"New –  VPC Reachability Analyzer","link":"https://aws.amazon.com/blogs/aws/new-vpc-insights-analyzes-reachability-and-visibility-in-vpcs/","date":1607617003000,"content":"<div id=\"readability-page-1\" class=\"page\"><section property=\"articleBody\"><div id=\"amazon-polly-audio-tab\"><p><a href=\"https://aws.amazon.com/polly/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://a0.awsstatic.com/aws-blog/images/Voiced_by_Amazon_Polly_EN.png\" width=\"554\" height=\"56\"></a></p></div><p>With <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Cloud</a> (VPC), you can launch a logically isolated customer-specific virtual network on the AWS Cloud. As customers expand their footprint on the cloud and deploy increasingly complex network architectures, it can take longer to resolve network connectivity issues caused by misconfiguration. Today, we are happy to announce <a href=\"https://docs.aws.amazon.com/vpc/latest/reachability/what-is-reachability-analyzer.html\">VPC Reachability Analyzer</a>, a network diagnostics tool that troubleshoots reachability between two endpoints in a VPC, or within multiple VPCs.</p><p><strong><u>Ensuring Your Network Configuration is as Intended</u></strong><br>You have full control over your virtual network environment, including choosing your own IP address range, creating <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Subnets.html\">subnets</a>, and configuring <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Route_Tables.html\">route tables</a> and network gateways. You can also easily customize the network configuration of your VPC. For example, you can create a public subnet for a web server that has access to the Internet with <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Internet_Gateway.html\">Internet Gateway</a>. Security-sensitive backend systems such as databases and application servers can be placed on private subnets that do not have internet access. You can use multiple layers of security, such as <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/VPC_SecurityGroups.html\">security groups</a> and <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/vpc-network-acls.html\">network access control list</a> (ACL), to control access to entities of each subnet by protocol, IP address, and port number.</p><p>You can also combine multiple VPCs via <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/vpc-peering.html\">VPC peering</a> or <a href=\"https://aws.amazon.com/transit-gateway/\">AWS Transit Gateway</a> for region-wide, or global network connections that can route traffic privately. You can also use <a href=\"https://docs.aws.amazon.com/vpn/latest/s2svpn/VPC_VPN.html\">VPN Gateway</a> to connect your site with your AWS account for secure communication. Many AWS services that reside outside the VPC, such as <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>, or <a href=\"https://aws.amazon.com/s3/\">Amazon S3</a>, support <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/vpc-endpoints.html\">VPC endpoints</a> or <a href=\"https://aws.amazon.com/privatelink/\">AWS PrivateLink</a> as entities inside the VPC and can communicate with those privately.</p><p>When you have such rich controls and feature set, it is not unusual to have unintended configuration that could lead to connectivity issues. Today, you can use VPC Reachability Analyzer for analyzing reachability between two endpoints without sending any packets. VPC Reachability analyzer looks at the configuration of all the resources in your VPCs and uses automated reasoning to determine what network flows are feasible. It analyzes all possible paths through your network without having to send any traffic on the wire. To learn more about how these algorithms work checkout this <a href=\"https://www.youtube.com/watch?v=6DX7p-OirGU\">re:Invent talk</a> or read <a href=\"https://d1.awsstatic.com/whitepapers/Security/Reachability_Analysis_for_AWS-based_Networks.pdf\">this paper</a>.</p><p><u><b>How VPC Reachability&nbsp;Analyzer Works</b></u><br>Let’s see how it works. Using VPC Reachability Analyzer is very easy, and you can test it with your current VPC. If you need an isolated VPC for test purposes, you can run the <a href=\"https://aws.amazon.com/cloudformation/\">AWS CloudFormation</a> YAML template at the bottom of this article. The template creates a VPC with 1 subnet, 2 security groups and 3 instances as A, B, and C. Instance A and B can communicate with each other, but those instances cannot communicate with instance C because the security group attached to instance C does not allow any incoming traffic.</p><p>You see <strong>Reachability Analyzer</strong>&nbsp;in the left navigation of the VPC Management Console.</p><p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/09/1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/09/1.png\" alt=\"\" width=\"273\" height=\"456\"></a></p><p>Click <strong>Reachability Analyzer</strong>, and also click <strong>Create and analyze path</strong> button, then you see new windows where you can specify a path between a source and destination, and start analysis.</p><p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/09/2.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/09/2.png\" alt=\"\" width=\"455\" height=\"352\"></a></p><p>You can specify any of the following endpoint types: VPN Gateways, Instances, Network Interfaces, Internet Gateways, VPC Endpoints, VPC Peering Connections, and Transit Gateways for your source and destination of communication. For example, we set instance A for source and the instance B for destination. You can choose to check for connectivity via either the TCP or UDP protocols. Optionally, you can also specify a port number, or source, or destination IP address.</p><p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/25/3-2.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/25/3-2-1024x672.png\" alt=\"Configuring test path\" width=\"1024\" height=\"672\"></a></p><p>Finally, click the<strong> Create and analyze path</strong> button to start the analysis. The analysis can take up to several minutes depending on the size and complexity of your VPCs, but it typically takes a few seconds.</p><p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/09/4.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/09/4.png\" alt=\"\" width=\"826\" height=\"92\"></a></p><p>You can now see the analysis result as <strong>Reachable</strong>. If you click the URL link of analysis id <strong>nip-xxxxxxxxxxxxxxxxx</strong>, you can see the route hop by hop.</p><p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/16/success.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/16/success.png\" alt=\"\" width=\"527\" height=\"560\"></a></p><p>The communication from instance A to instance C is not reachable because the security group attached to instance C does not allow any incoming traffic.</p><p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/09/6.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/09/6.png\" alt=\"\" width=\"819\" height=\"95\"></a></p><p>If you click <strong>nip-xxxxxxxxxxxxxxxxx </strong>for more detail, you can check the <strong>Explanations</strong>&nbsp;for details.</p><p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/25/7-2.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/25/7-2-1024x719.png\" alt=\"Result Detail\" width=\"1024\" height=\"719\"></a></p><p>Here we see the security group that blocked communication. When you click on the security group listed in the upper right corner, you can go directly to the security group editing window to change the security group rules. In this case adding a properly scoped ingress rule will allow the instances to communicate.<br><u></u></p><p><strong><u>Available Today</u></strong><br>This feature is available for all AWS commercial Regions except for <span title=\"\">China (Beijing)</span>, and <span title=\"\">China (Ningxia)</span> regions. More information is available in our <a href=\"https://docs.aws.amazon.com/vpc/latest/reachability/what-is-reachability-analyzer.html\">technical documentation</a>, and remember that to use this feature your IAM permissions need to be set up as <a href=\"https://docs.aws.amazon.com/vpc/latest/reachability/identity-access-management.html\">documented here</a>.</p><p>– Kame</p><h4>CloudFormation YAML template for test</h4></section></div>","author":"Harunobu Kameda","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"612242479bb7e3e709d247d058ee047377b04280f84c8461109ffbaa12174959","category":"Tech"}