{"title":"A curious observer’s guide to quantum mechanics, Pt. 6: Two quantum spooks","link":"https://arstechnica.com/?p=1699216","date":1613311215000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>entanglement and measurement order time —</h4><h2 itemprop=\"description\">Proof that the world can be much stranger than we expect.</h2></header><section><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/quantum-series-6-800x450.jpg\" alt=\"A curious observer’s guide to quantum mechanics, Pt. 6: Two quantum spooks\"><figcaption><p>Aurich Lawson / Getty Images</p></figcaption></figure><p><strong>One of the quietest revolutions</strong> of our current century has been the entry of quantum mechanics into our everyday technology. It used to be that quantum effects were confined to physics laboratories and delicate experiments. But modern technology increasingly relies on quantum mechanics for its basic operation, and the importance of quantum effects will only grow in the decades to come. As such, physicist Miguel F. Morales has taken on the herculean task of explaining quantum mechanics to laypeople in this seven-part series (no math, we promise). Below is the sixth story in the series, but you can always find <a href=\"https://arstechnica.com/science/2021/01/the-curious-observers-guide-to-quantum-mechanics/\">the starting story</a> plus a <a href=\"https://arstechnica.com/series/exploring-the-quantum-world/\">landing page for the entire series thus far</a> on site.</p><p>Throughout our quantum adventures to date, we’ve seen a bunch of interesting quantum effects. So for our last major excursion, let’s venture into a particularly creepy corner of the quantum wood: today, we’re going to see <em>entanglement</em> and <em>measurement order</em>.</p><p>Together, these two concepts create some of the most counterintuitive effects in quantum mechanics. They are so counterintuitive that this is probably a good time to re-emphasize that nothing in this series is speculative—everything we’ve seen is backed by hundreds of observations. Sometimes the world is much stranger than we expect it to be.</p><p>I’ve always considered the world of spies and espionage to be strange and spooky, so maybe it is fitting that one of the applications of what we are talking about today is cryptography. But there's a lot to go over before we get there.</p><h2>Playing in the sunlight</h2><p>After a long walk through an increasingly dark and gloomy forest, gnarled trees dripping with vines, we unexpectedly emerge into a meadow sparkling in bright sunshine. Blinking in the light, we pull out our polarized sunglasses.</p><p>The lenses in polarized sunglasses are polarized in the vertical direction, meaning that when worn normally, they will allow light polarized vertically to pass through but will completely block horizontally polarized light. This is advantageous, because light glinting off of water is mostly horizontally polarized; a lens that only allows vertically polarized light through will greatly reduce the reflected glare.</p><p>Being a little suspicious of the beautiful sunshine in our mysterious glade, we start looking through multiple pairs of sunglasses. Squinting through two or three pairs of sunglasses at the same time does make you look ridiculous, but such are the sacrifices we make for science. We’ll diagram the results you would see, but if you can scrounge together three pairs of polarized sunglasses, you can perform all of the experiments in this article at home.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Two-glasses-relative-rotation-fig1-v2.png\" data-height=\"621\" data-width=\"2088\" alt=\"What you see when looking through two polarized sunglasses. Each polarized lens only lets through light that’s polarized in the direction of the arrow on the temple. All of the lenses will let through half of the unpolarized light (the medium-gray tint). But when light has to pass through both glasses, the relative orientation of the glasses matters. On the left, both lenses are letting through vertically polarized light, so all of the light that makes it through the first lens also goes through the second lens. By contrast, on the right, the glasses in the back are rotated to only let through horizontally polarized light, which is entirely blocked by the front glasses. If you hold the glasses at a 45° angle with respect to one another, half of the light going through the first pair of glasses will make it through the second pair (1/2 x 1/2 = 1/4 of background light). \"><img alt=\"What you see when looking through two polarized sunglasses. Each polarized lens only lets through light that’s polarized in the direction of the arrow on the temple. All of the lenses will let through half of the unpolarized light (the medium-gray tint). But when light has to pass through both glasses, the relative orientation of the glasses matters. On the left, both lenses are letting through vertically polarized light, so all of the light that makes it through the first lens also goes through the second lens. By contrast, on the right, the glasses in the back are rotated to only let through horizontally polarized light, which is entirely blocked by the front glasses. If you hold the glasses at a 45° angle with respect to one another, half of the light going through the first pair of glasses will make it through the second pair (1/2 x 1/2 = 1/4 of background light). \" src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Two-glasses-relative-rotation-fig1-v2-640x190.png\" width=\"640\" height=\"190\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Two-glasses-relative-rotation-fig1-v2-1280x381.png 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Two-glasses-relative-rotation-fig1-v2.png\" data-height=\"621\" data-width=\"2088\">Enlarge</a> <span>/</span> What you see when looking through two polarized sunglasses. Each polarized lens only lets through light that’s polarized in the direction of the arrow on the temple. All of the lenses will let through half of the unpolarized light (the medium-gray tint). But when light has to pass through both glasses, the relative orientation of the glasses matters. On the left, both lenses are letting through vertically polarized light, so all of the light that makes it through the first lens also goes through the second lens. By contrast, on the right, the glasses in the back are rotated to only let through horizontally polarized light, which is entirely blocked by the front glasses. If you hold the glasses at a 45° angle with respect to one another, half of the light going through the first pair of glasses will make it through the second pair (1/2 x 1/2 = 1/4 of background light).</p><p>Miguel Morales</p></figcaption></figure><p>If you hold two pairs of the glasses in front of you and then rotate one of the pairs, you will notice that the amount of light passing through varies <i>dramatically</i>. When the glasses are at a 90° angle (e.g. one held normally, and the other pair sideways) almost no light will get through. The combined view through the lenses will look almost completely black—for really good polarized lenses, they will get almost welding-glass dark. Conversely, when held with the same orientation, they let almost the same amount of light through as one pair of glasses alone (with good polarizing lenses held in perfect alignment, this is exactly true).</p><p>This is fairly straightforward to understand. If both glasses are held vertically, the first pair of glasses only lets vertical light through. Since the second pair also lets vertical light through, it has nothing to block—all of the light that made it through the first pair will also make it past the second. Conversely, if we hold the first pair sideways so it passes only horizontal light and hold the second pair normally so it blocks horizontal light, then there is no light that can get through both. Together, they appear very dark. And if you hold the glasses at a 45° angle to each other, it's intermediate; half the light passing through the first pair of glasses gets through the second.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Crossed-glasses-absolute-rotation.png\" data-height=\"930\" data-width=\"2134\" alt=\"Only the orientation between the lenses matters, not how they're oriented relative to the environment.\"><img alt=\"Only the orientation between the lenses matters, not how they're oriented relative to the environment.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Crossed-glasses-absolute-rotation-640x279.png\" width=\"640\" height=\"279\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Crossed-glasses-absolute-rotation-1280x558.png 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Crossed-glasses-absolute-rotation.png\" data-height=\"930\" data-width=\"2134\">Enlarge</a> <span>/</span> Only the orientation between the lenses matters, not how they're oriented relative to the environment.</p><p>Miguel Morales</p></figcaption></figure><p>It’s only the angle between the lenses that matters. If we pick a relative orientation, such as crossed, and rotate both lenses together, we’ll see the opacity stays the same. The green-framed glasses on the right are held at ±45° to the vertical, but since the first pair lets through light polarized 45° left of vertical, all of the light is blocked.</p><p>This all seems to make sense. But then you remember this is quantum mechanics, and the ominous movie music starts to play in the background. Let’s add a third pair of glasses. And to help keep all the orientations straight, we will always use blue frames for the horizontal/vertical orientations and green frames for the ±45° orientations.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Fig-3.png\" data-height=\"973\" data-width=\"2134\" alt=\"Starting with crossed lenses, we add a diagonal lens behind them.\"><img alt=\"Starting with crossed lenses, we add a diagonal lens behind them.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Fig-3-640x292.png\" width=\"640\" height=\"292\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Fig-3-1280x584.png 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Fig-3.png\" data-height=\"973\" data-width=\"2134\">Enlarge</a> <span>/</span> Starting with crossed lenses, we add a diagonal lens behind them.</p><p>Miguel Morales</p></figcaption></figure><p>We will start with two crossed glasses, as shown on the left. We will then add a third lens oriented at a 45° <i>behind</i> the two we already had. On close examination, this behaves as we’d expect. Anywhere the original glasses block the light is still black. In the little corners where there’s not complete overlap, the light goes through the 45° lens and one of the other lenses and we get the slightly darker tint we saw back in Figure 1. If we look at what’s new, we see that the region where the light must pass through all three lenses is also black.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Figure-4.png\" data-height=\"957\" data-width=\"2134\" alt=\"Rearranging the order of the glasses makes a big difference. \"><img alt=\"Rearranging the order of the glasses makes a big difference. \" src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Figure-4-640x287.png\" width=\"640\" height=\"287\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Figure-4-1280x574.png 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/Figure-4.png\" data-height=\"957\" data-width=\"2134\">Enlarge</a> <span>/</span> Rearranging the order of the glasses makes a big difference.</p><p>Miguel Morales</p></figcaption></figure><p>But we see something remarkable if we reorder the glasses. We again start with crossed glasses, but now slide the 45° lens <i>between</i> them. When we do this, light gets through where all three lenses overlap. Where only two lenses overlap we get the expected results—black for crossed and tinted for 45° relative orientation. But even though the front and back lenses are crossed and would normally let no light through, if you interpose another lens with intermediate polarization, suddenly light can pass through.</p><p>This is weird. The <i>order</i> of the glasses matters. If you are following along at home, try flipping the order of the lenses. If crossed lenses are next to each other in the stack, almost no light gets through. But if you alternate between blue (horizontal/vertical) and green (±45°) frames, some light will get through.</p></div><nav>Page: <span>1 <a href=\"https://arstechnica.com/science/2021/02/a-curious-observers-guide-to-quantum-mechanics-pt-6-two-quantum-spooks/2/\">2</a> <a href=\"https://arstechnica.com/science/2021/02/a-curious-observers-guide-to-quantum-mechanics-pt-6-two-quantum-spooks/3/\">3</a> <a href=\"https://arstechnica.com/science/2021/02/a-curious-observers-guide-to-quantum-mechanics-pt-6-two-quantum-spooks/2/\"><span>Next <span>→</span></span></a></span></nav></section></div></div>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"61ba2e2afe94afad74727e84effb06c86c498d34c169d08d7040f8743401627c","category":"Tech"}