{"title":"DT Swiss announces Star Ratchet LN upgrade kit for lower-end hubs and wheels","link":"https://cyclingtips.com/2021/04/dt-swiss-announces-star-ratchet-ln-upgrade-kit-for-lower-end-hubs-and-wheels/","date":1618210856000,"content":"<div><div><p>If you have a DT Swiss rear hub that uses a traditional pawl-type driver mechanism (like a DT Swiss 370 hub and similar OEM wheels that use the same mechanism), the company now offers an official Ratchet LN upgrade kit that makes it easier to upgrade to the more durable star ratchet system. Granted, this swap has long been possible already, but for one key omission that’s finally been addressed.</p><p>It’s not typical that you can change the driver mechanism in a rear hub from one style to a completely different one, but DT Swiss’s modular hub design makes it surprisingly easy to do. Although both of those driver formats are very different in terms of the mechanism itself, the only major difference is the driver ring, and as far as the hub body is concerned, both of those thread in the same way and have the same thickness. </p><p>The upgrade kit includes a new drive ring, two star ratchets (solely in the slower-engaging 18-tooth variety, unfortunately), the necessary pair of conical springs, a bearing spacer for the axle, some special grease, and the freehub body itself. </p><p>As already mentioned, this upgrade has always been possible if you knew to ask (and also knew a good mechanic who was aware of it and had the necessary tools — it’s not exactly a straightforward home repair job). However, this official upgrade now takes care of the one oversight in the equation. While DT Swiss hubs with the star ratchet mechanism have a seal built into the hub shell, ones with pawl-type drivers have that seal built into the freehub body. In other words, if you did that upgrade in the past, you were left with no physical seal between the hub shell and freehub body, right where you needed it most. </p><p>With this new upgrade kit, DT Swiss has gone to the trouble of making a star ratchet freehub body with a built-in seal, so riders interested in the conversion no longer have to make that sacrifice in durability. DT Swiss is offering the special bodies for use with Shimano HG, Shimano Microspline, and SRAM XDR spline patterns, and in both the usual aluminum as well as stainless steel for riders who are willing to sacrifice a few grams for better durability.</p><p>Retail price for the kit ranges from US$92-131 / €70-100, which, all things considered, is impressively reasonable. So if you’ve been chewing through pawl parts on your midrange DT Swiss hubs (or another brand of wheelset that uses DT Swiss pawl-type internals), this might actually be something to think about.</p><p>More information can be found at <a href=\"https://www.dtswiss.com/en/wheels/wheels-technology/ratchet-ln\" target=\"_blank\">www.dtswiss.com</a>. </p></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"61ca359e0d491d041ea5fe1264d5a63277f4ef7479f5bb43e1e4a2a55afb3717","category":"Cycling"}