{"title":"Under intense pressure, WHO skips summary report on coronavirus origin","link":"https://arstechnica.com/?p=1747417","date":1614966081000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Beleaguered report —</h4><h2 itemprop=\"description\">The full report, however, is expected the week of March 15.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1231073883-800x499.jpg\" alt=\"Liang Wannian (2nd L) and Peter Ben Embarek (3rd R) both members of the WHO-China joint study team, shake hands after the WHO-China joint study press conference in Wuhan, central China's Hubei Province, on Feb. 9, 2021. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1231073883.jpg\" data-height=\"4931\" data-width=\"7913\">Enlarge</a> <span>/</span> Liang Wannian (2nd L) and Peter Ben Embarek (3rd R) both members of the WHO-China joint study team, shake hands after the WHO-China joint study press conference in Wuhan, central China's Hubei Province, on Feb. 9, 2021.</p></figcaption></figure><p>Facing <a href=\"https://arstechnica.com/science/2021/02/show-us-the-data-or-be-quiet-who-blasts-conspiracies-on-virus-origins/\">intense international pressure and criticism</a>, the World Health Organization has abandoned plans to release a summary report of its investigation into the possible origin of the pandemic coronavirus, SARS-CoV-2.</p><p>Instead, the health agency of the United Nations is skipping the summary report and plans to release a full report the week of March 15. The WHO had previously said it would release a summary report in mid-February.</p><p>“By definition, a summary report does not have all the details,” Dr. Ben Embarek, a WHO expert who led the investigation, <a href=\"https://www.wsj.com/articles/who-investigators-to-scrap-interim-report-on-probe-of-covid-19-origins-11614865067?reflink=desktopwebshare_twitter\">told the Wall Street Journal</a>. “So since there [is] so much interest in this report, a summary only would not satisfy the curiosity of the readers.”</p><p>In a press conference Friday, the executive director of the WHO’s emergencies program, Mike Ryan, echoed the thinking, saying that skipping right to the full report will facilitate discussion given the tremendous demand for the investigation’s findings.</p><p>The limited information about the investigation’s findings that has been released so far has already fueled intense criticism and ratcheted up tension between the US and China.</p><h2>Perilous probe</h2><p>The investigation was conducted by a team of international researchers and WHO experts between mid-January and early February in Wuhan, China, where the pandemic first mushroomed in December of 2019. The WHO team underwent a 14-day quarantine upon their arrival, then spent about 12 days doing field work around the city.</p><p>They visited places such as the infamous Huanan seafood market, where many of the first COVID-19 cases were linked, as well as the hospital where the first patients sought treatment. The team also made a trip to the Wuhan Institute of Virology, which has become the focus of rampant speculation that SARS-CoV-2 escaped from a lab—possibly after it was picked up in the course of research on coronaviruses in bats and/or purposely engineered to infect humans. Though virologists the world over have noted that this explanation is unlikely—a natural spillover event is seen as the most likely origin—they note that it’s impossible to rule it out without more information.</p><p>In a press conference from Wuhan on February 9, the WHO team all but said they had, indeed, ruled it out. Embarek called the lab origin hypothesis “<a href=\"https://arstechnica.com/science/2021/02/new-details-emerge-of-how-pandemic-began-who-team-still-eyes-animal-source/\">extremely unlikely</a>” and suggested there was no need to pursue the idea further. Instead, Embarek supported researchers' earlier thinking, calling the natural spillover hypothesis the “most likely pathway” SARS-CoV-2 took to humans. Chinese scientists, meanwhile, held up the possibility that the virus was imported into the country via frozen freight—an idea seen as unsupported by data and unlikely by international researchers.</p><p>When the WHO team members arrived back in their home countries, their conclusions appeared to soften. In a press briefing, WHO Director-General Dr. Tedros Adhanom Ghebreyesus seemed to <a href=\"https://arstechnica.com/science/2021/02/china-refused-to-hand-over-key-data-to-who-team-probing-pandemics-origin/\">walk back Embarek’s earlier comments</a> on the lab origin hypothesis. “Some questions have been raised as to whether some hypotheses have been discarded,” Tedros said. “Having spoken with some members of the team, I wish to confirm that all hypotheses remain open and require further analysis and studies. Some of that work may lie outside the remit and scope of this mission.”</p><h2>“Deep concerns”</h2><p>Other scientists and experts criticized the investigation and the comments, saying that the team was not given the necessary unfettered access to critical places and data to come to any conclusions. One of the team’s own members bolstered that criticism. In media interviews, WHO investigation team member Dominic Dwyer reported that Chinese officials withheld key raw data that the team requested on the very first COVID-19 cases identified in Wuhan.</p><p>US officials have also expressed skepticism of the integrity of WHO’s investigation. In a February 13 statement, National Security Advisor Jake Sullivan said, “We have deep concerns about the way in which the early findings of the COVID-19 investigation were communicated and questions about the process used to reach them. It is imperative that this report be independent, with expert findings free from intervention or alteration by the Chinese government.”</p><p>Likewise, in an interview on PBS this week, Secretary of State Antony Blinken said that “China has not been fully and effectively transparent either at the start of this crisis, when it mattered most, or even today as investigations are going forward trying to get to the bottom of what happened.”</p><p>In final comments in the press conference Friday, Tedros responded to the calls for transparency, saying that everything that happened during the team's trip to Wuhan will be presented in full in the forthcoming report.</p></div></div>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6262a44c73e1d4d142b6411013ee2c8d3cfe37618bc720eb97006ffa4f76b3fc","category":"Tech"}