{"title":"Instagram bans top anti-vaxxer Robert F. Kennedy Jr. over COVID falsehoods","link":"https://arstechnica.com/?p=1741467","date":1613062506000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>A start —</h4><h2 itemprop=\"description\">Kennedy has a long history of spreading dangerous misinformation on social media.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/01/rfk3-800x519.jpg\" alt=\"Robert Kennedy Jr. heads up to a meeting at Trump Tower on January 10, 2017 in New York City. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/01/rfk3.jpg\" data-height=\"1948\" data-width=\"3000\">Enlarge</a> <span>/</span> Robert Kennedy Jr. heads up to a meeting at Trump Tower on January 10, 2017 in New York City.</p><p>Spencer Platt/Getty Images</p></figcaption></figure><p>Instagram has permanently banned the account of Robert F. Kennedy Jr., an infamous and prolific peddler of dangerous anti-vaccine and COVID-19 misinformation.</p><p>The move will likely be cheered by public health advocates who have struggled to combat such harmful bunkum online during the devastating pandemic. However, Kennedy's account on Facebook—which owns Instagram—remained active Thursday and lists over 300,000 followers.</p><p>In an email to Ars, a Facebook spokesperson said Kennedy’s Instagram account was removed “for repeatedly sharing debunked claims about the coronavirus or vaccines.” The account had over 800,000 followers prior to its removal, <a href=\"https://www.wsj.com/articles/instagram-bans-robert-f-kennedy-jr-over-covid-19-vaccine-misinformation-11613029259\">according to The Wall Street Journal</a>.</p><p>The Facebook spokesperson declined to respond to Ars' question about whether Kennedy’s Facebook account would also be removed or otherwise penalized. The social-media behemoth <a href=\"https://www.nytimes.com/2021/02/11/us/robert-f-kennedy-jr-instagram-covid-vaccine.html\">told The New York Times</a>, however, that it has no plans to remove Kennedy from Facebook “at this time.”</p><p>In the email to Ars, the spokesperson noted Facebook's&nbsp;<a href=\"https://about.fb.com/news/2021/02/reaching-billions-of-people-with-covid-19-vaccine-information/\">updated policies</a> that involve “expanding our efforts to remove false claims on Facebook and Instagram about COVID-19, COVID-19 vaccines, and vaccines in general during the pandemic.” Facebook says it has already removed “more than 12 million pieces of content on Facebook and Instagram” deemed harmful misinformation. The spokesperson also listed eight other accounts that Facebook had recently removed, including those with URLs /virusesarenotcontagious, /vaxxed2, and /nofacemasks.</p><h2>Hazardous history</h2><p>Kennedy’s contentious relationship with Facebook began well before the pandemic, however. He and his anti-vaccine organizations—Children’s Health Defense and the World Mercury Project—were leading forces behind the misinformation campaigns fueling the resurgence of measles worldwide in recent years.</p><p>For instance, at the end of 2019, the government of Samoa was forced to shut down to deal with an explosive measles outbreak. The deadly surge of disease came after Kennedy’s organization spent months fear-mongering over vaccine safety and spreading falsehoods about an incident that led to the tragic deaths of two Samoan infants. An investigation determined that the babies were given lethal doses of muscle relaxant by negligent nurses who intended to immunize them. The nurses were each convicted and sentenced to five years in prison. Of course, none of that information was shared by Kennedy’s organizations.</p><p>Just a month before the outbreak exploded in Samoa, <a href=\"https://www.sciencedirect.com/science/article/pii/S0264410X1931446X?via%3Dihub#!\">a study appearing in the journal Vaccine</a> found that <a href=\"https://arstechnica.com/science/2019/11/robert-f-kennedy-jr-is-the-single-leading-source-of-anti-vax-ads-on-facebook/\">Kennedy’s World Mercury Project was the single largest source</a> of anti-vaccine advertisements on Facebook.</p><p>Though Facebook has tried—many times—to crack down on anti-vaccine misinformation, Kennedy has fought restrictions and continued to spread falsehoods. In August of 2020, Kennedy’s Children’s Health Defense <a href=\"https://arstechnica.com/tech-policy/2020/08/anti-vaccine-group-sues-facebook-claims-fact-checking-is-censorship/\">filed a lawsuit</a> alleging that Facebook's effort to fact-check vaccine misinformation was “censorship” that infringed on the organization's First and Fifth Amendment rights.</p></div></div>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"631bfc93db3a9076d4308e2b9febeff1ee50fc9d12ede69b8f246ba37ad53819","category":"Tech"}