{"title":"Announcing HCP Consul General Availability","link":"https://www.hashicorp.com/blog/announcing-hcp-consul-general-availability","date":1612281600000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><section><p>We are pleased to announce that HashiCorp Consul is now generally available as a fully managed service for AWS environments on the HashiCorp Cloud Platform (HCP). HCP Consul is the first fully managed service mesh solution operated and maintained by the experts who built the product. HCP Consul provides a simple service discovery tool and an easy path to adopt service mesh for both individuals and organizations while reducing the operational burden of running it in production. In this blog, we’ll review some of the capabilities of HCP Consul, talk about new features, and explain how pricing for this managed service works.</p><h2><a href=\"#getting-started\" aria-label=\"getting started permalink\">»</a><a id=\"getting-started\" aria-hidden=\"\"></a>Getting Started</h2><p>HCP Consul is designed to help minimize the steps necessary to use Consul within your AWS environments. At a high level, here are the four tasks that users need to accomplish in order to start using HCP Consul:</p><ul><li><strong>Create:</strong> First users must create a HCP login at portal.cloud.hashicorp.com. In order to create an account, users must have a GitHub account.</li><li><strong>Deploy:</strong> Next, users select HCP Consul from the dashboard. We have a guided quickstart deployment guide that will walk users through the process of creating their HashiCorp Virtual Network (HVN) and Consul cluster. Users will select region and cluster tier on this screen as well as any additional networking settings.</li><li><strong>Peer:</strong> Once users have deployed their HVN and cluster, the next step is to peer that network with their existing AWS environments. We have guides available to walk through the process of peering an HVN with both EKS and EC2 environments.</li><li><strong>Connect:</strong> After completing the previous steps, you are ready to use HCP Consul. Some of the tasks we recommend starting with include registering service instances to your Consul cluster, enabling Consul service mesh, and enabling TLS encryption.</li></ul><p>While these steps depict a basic workflow for getting started with HCP Consul, we recognize that they are slightly more intricate in practice. To help users get started, we have created a series of <a href=\"https://learn.hashicorp.com/collections/consul/cloud-get-started\">Learn guides</a> to help with some of these steps.</p><h2><a href=\"#the-new-terraform-provider-for-hcp\" aria-label=\"the new terraform provider for hcp permalink\">»</a><a id=\"the-new-terraform-provider-for-hcp\" aria-hidden=\"\"></a>The New Terraform Provider for HCP</h2><p>We are also pleased to announce the availability of a new HashiCorp Terraform provider for HCP. This provider gives users another way to quickly provision and manage their HCP Consul resources through a familiar workflow. Users can configure the HVN region, create organizations, and peer their VPCs through this process. Here’s an example of a new HCP HVN definition:</p></section><div><pre><code><span># Configure the HCP Provider</span>\n<span>provider<span> \"hcp\" </span></span><span>{</span>\n\n<span>}</span>\n\n<span>resource <span>\"hcp_hvn\"</span></span> <span>\"e2e\"</span> <span>{</span>\n  <span>hvn_id</span>            <span>=</span> <span>\"hvn-slug-id\"</span>\n  <span>cloud_provider</span>  <span>=</span> <span>\"aws\"</span>\n  <span>region</span>          <span>=</span> <span>\"us-west-2\"</span>\n  <span>cidr_block</span>        <span>=</span> <span>\"10.99.0.0/16\"</span>\n\n<span>}</span></code></pre></div><section><p>At this time the Terraform Provider for HCP only supports HCP Consul, but we plan to add support for HCP Vault (currently in <a href=\"https://cloud.hashicorp.com/\">public beta</a>) to the provider soon. To get started using the Terraform Provider for HCP, please follow this <a href=\"https://learn.hashicorp.com/tutorials/cloud/terraform-hcp-consul-provider\">learn guide</a>.</p><h2><a href=\"#pricing-and-aws-region-availability\" aria-label=\"pricing and aws region availability permalink\">»</a><a id=\"pricing-and-aws-region-availability\" aria-hidden=\"\"></a>Pricing and AWS Region Availability</h2><p>At launch, HCP Consul is currently generally available in AWS regions in the U.S. (Oregon and Virginia) and Europe (London, Frankfurt, and Ireland). We plan to add additional region options in the U.S. and Europe and expanding to other parts of the world in the near future.</p><p>For pricing, HCP Consul offers the following packages:</p><ul><li><strong>Development Cluster:</strong> This is the best way for new users to get started testing HCP Consul in their AWS environments. The Development Cluster is a non-production, single-node deployment of Consul billed by the hour. Prices for this cluster start at $0.027/hour. At launch, we are offering a free month to new users.</li><li><strong>Standard Cluster - Hourly (coming soon):</strong> In the near future, we will allow users to provision a production-ready cluster directly through the HCP dashboard. This will launch a three-node Consul deployment that is ready to handle production-grade workloads.</li><li><strong>Standard Cluster - Annual:</strong> Organizations that plan to run large production deployments on HCP Consul have the option of an annual agreement with us. Please reach out to our <a href=\"https://www.hashicorp.com/request-pricing\">sales team</a> directly or reach out to your HashiCorp representative if you are interested in annual HCP options.</li></ul><p>To review our pricing information, please visit our <a href=\"https://cloud.hashicorp.com/pricing/consul\">HCP Consul pricing page</a>.</p><h2><a href=\"#next-steps\" aria-label=\"next steps permalink\">»</a><a id=\"next-steps\" aria-hidden=\"\"></a>Next Steps</h2><p>For a more detailed dive into how to get started with HCP Consul, read <a href=\"https://www.hashicorp.com/blog/first-steps-with-hcp-consul-on-aws\">this blog</a>. We are very excited about making HCP Consul generally available to the public. We recommend creating an HCP account and trying HCP Consul for yourself. For more information about HCP Consul and pricing, please visit our product page or sign up through <a href=\"https://portal.cloud.hashicorp.com/\">the HCP portal</a> directly. To learn more about HCP Consul and Vault, <a href=\"https://www.hashicorp.com/events/webinars/cloud-service-networking-secrets-management\">join us for a webinar on February 9</a>.</p></section></div></div>","author":"Peter McCarron","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"6382e34eb88206c4707e85360cb03081eeece888861f22774edfe0a34f16e1be","category":"Tech"}