{"title":"Ancient massacre site yields its victims’ DNA","link":"https://arstechnica.com/?p=1749167","date":1615561650000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>humans are great but sometimes also terrible —</h4><h2 itemprop=\"description\">The ancient DNA study raises more questions than it answers.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/unnamed-800x847.jpg\" alt=\"Ancient massacre site yields its victims’ DNA\"><figcaption></figcaption></figure><p>Archaeologists working near the small Croatian village of Potočani made a grim discovery in 2007. In a shallow pit, just a meter deep and two meters wide, they found the jumbled bones of at least 41 people. Radiocarbon dating on several of the bones revealed that they’d been in the pit for around 6,200 years. The dead included men, women, and children, from toddlers to the elderly, and it was clear that they had died violently.</p><p>Thirteen of the 41 people in the pit had taken lethal blows to the sides or backs of their skulls from a mix of different weapons. Based on the shape of the injuries, these probably included stone hammers, wooden clubs, and copper axes.</p><p>“The position and morphology (appearance) of the wounds strongly suggest that these people didn't run from their attackers,” archaeologist Mario Novak, of Croatia’s Institute for Anthropological Research, told Ars, “but were most probably kneeling or lying with their hands tied.” That evidence, along with the presence of so many women and children in the group, told archaeologists that they hadn’t unearthed the aftermath of a battle, but a massacre.</p><p>Potočani is only one of several very similar massacre sites scattered across Neolithic and Copper Age Europe. So far, archaeologists have unearthed the remains of roughly half a dozen similar cases across the continent, all dating to between 7,500 and 6,000 years ago. Novak told Ars that more sites probably exist and are just waiting to be found and excavated.</p><p>At each of these sites, there’s a clear pattern: large numbers of victims from both sexes and all age groups, killed with several different types of weapon and apparently without putting up a fight, and hastily buried in a shallow pit or trench.</p><p>Novak and his colleagues recently sequenced ancient DNA from 38 of the 41 people in the mass grave at Potočani, hoping to learn more about who the victims were, how they were related to each other, and ultimately why they died.</p><h2>Identifying the victims</h2><p>A few fragments of pottery in the pit linked the victims to the Lasinja culture, a group of people who lived across a swath of modern-day Croatia, northern Bosnia, Slovenia, eastern Austria, and western Hungary during the Copper Age, from around 3200 to 2300 BCE. Archaeological evidence tells us that the Lasinja made their living mostly by herding cattle and by mining and working copper. The 41 people in the mass grave were probably part of a larger group.</p><p>“It is quite probable that these are the unlucky ones who didn't manage to escape,” Novak told Ars. “It is also possible in a few years that we might find another mass burial nearby containing the remains of other members of their community. You have to remember that the archaeological excavation was done on a very small area (basically this pit), so the neighboring plots might contain some similar, yet unstudied, archaeological features.”</p><p>DNA from the 38 Potočani victims showed that they all shared essentially the same ancestry, with their roots aligning mostly with the farmers from Anatolia who first brought agriculture into southern and central Europe around 8,000 to 7,000 years ago. They also owe about nine percent of their ancestry to the hunter-gatherer groups who lived in Europe before the Anatolian farmers arrived.</p><p>At the time of the massacre, these people were part of a population that seemed to be large and fairly stable. None of the victims’ DNA showed any signs of inbreeding, which suggests a small, isolated population. And mitochondrial DNA, which is passed directly from mother to child, showed at least 30 maternal lineages in the group, which also suggests a large, genetically diverse community.</p><p>The mass grave at Potočani might look like the result of conflict over territory; when one group moves into an area, the people who already live there might resort to violence to drive off the newcomers. And it’s easy to imagine that people who herded cattle for a living might come into conflict with more sedentary farmers. But because the DNA of the victims suggests a large, well-established population, it’s unlikely that they were recent migrants to the area.</p><p>Despite their shared heritage, most of the victims weren’t closely related to each other. Twenty-seven of the victims had no relatives in the mass grave with them. Novak and his colleagues identified a few small family groups: a young man with his two daughters and nephew, two infant sisters with a cousin or great-grandparent, a father and his son, and a young boy with his aunt or half-sister. Because the massacre victims were mostly not related to each other, we also can rule out the possibility that their attackers were targeting specific families for some reason.</p><h2>What happened in Neolithic Europe?</h2><p>The DNA analysis answered two out of four big questions about the ancient mass grave; archaeologists now know more about who the victims were and how they’re related to each other. We’re left with evidence that some group of people committed a terrible act of violence against others 6,200 years ago—but almost no evidence to tell us who or why.</p><p>“We also know almost nothing about the perpetrators of this gruesome act because we don't have any cultural (material) and/or biological (skeletal) remains at this site that we might associate with them,” Novak told Ars. “So again, we can only speculate based on the available data from Potočani and a few known similar sites from around Europe.”</p><p>Another unanswered question is why such inexplicable (at least to modern researchers) mass killings seem to have become more common in Neolithic Europe.&nbsp;“Why such a number of almost identical episodes/events occurred in continental Europe at that time is still not clear,” Novak told Ars. Some archaeologists have suggested that the population of Europe increased dramatically during the late Neolithic and early Copper Age, when agriculture would have made food more abundant and predictable—but around that time, shifts in the ancient climate brought drought, famine, and fighting for resources.</p><p>“At this point we cannot tell with certainty,” Novak told Ars.&nbsp;“So far, we don't have any evidence of adverse climate conditions in the region about 6,200 years ago. But this is a completely understudied topic, so we might get some new information in the near future.”</p><p><em>PLOS ONE</em>, 2021 DOI: <a href=\"https://doi.org/10.1371/journal.pone.0247332\">10.1371/journal.pone.0247332</a>&nbsp; (<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div></div>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6487a73ccbcf6ae4168808b2dc7860cea9a083a4ebdcb9d1301e1c89bf2e0cf5","category":"Tech"}