{"title":"“Please someone help me.” FaceTime users bombarded with group call spam","link":"https://arstechnica.com/?p=1749815","date":1615843063000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>BANG HEAD HERE. —</h4><h2 itemprop=\"description\">Apple doesn't provide tools that effectively ease a major headache for FaceTime users.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/apple-user-800x534.jpeg\" alt=\"A middle-aged woman sitting in the kitchen at the glass table\"><figcaption></figcaption></figure><p>FaceTime users are getting bombarded with group calls from numbers they’ve never seen before, often as many as 20 times in short succession during late hours of the night.</p><p>Griefers behind the pranks call as many as 31 numbers at a time. When a person receiving one of the calls hangs up, a different number will immediately call back. FaceTime doesn’t have the ability to accept only FaceTime calls coming from people in the user’s address book. It also requires all numbers in a group call must be manually blocked for the call to be stopped.</p><p>“I got my first facetime spam starting 4 days ago,” one user reported to an <a href=\"https://discussions.apple.com/thread/251234413\">Apple support forum</a> earlier this month. “It has been non-stop, over 300 numbers blocked so far. My 3 year old daughter has been accidentally answering them and going on video without a t-shirt on.”</p><p>The high volume of callbacks appears to be the result of other people receiving the call dialing everyone back when the initial call fails shortly after answering. As more and more people receive follow-on calls, they too begin making callbacks.</p><p>Apple provides surprisingly few ways for users to stop the nuisance calls. As noted earlier, users can block numbers, but this requires manually blocking each individual person on the group call. That’s not an effective solution for people receiving dozens of group calls, often to a different group of people in a short period of time, often in the wee hours.</p><h2>“Sick to death of it”</h2><p>A user can also turn off FaceTime in iOS settings or in the macOS app, but that prevents users from receiving wanted calls as well. Last, people can uncheck their phone number under the FaceTime setting “where you can be reached.” Once again, however, this will prevent wanted calls that are initiated using the user’s number.</p><p>As the Apple support thread above shows, the nuisance group calls date back at least to last year and have persisted nonstop since then.</p><p>“Sick to death of it,” one person <a href=\"https://discussions.apple.com/thread/251234413?answerId=251234413021#251234413021\">wrote</a> last June. “I answer one face time on it and was a young teenage girl. Other time random art on walls are creepy old men. Makes me feel sick. I do not want to be part in any of these scams or if they are trying out random numbers. But how can you stop it. Should I report to the police? How can I stop this? Please someone help me.”</p><p>A Reddit user also reported the same problem <a href=\"https://www.reddit.com/r/applehelp/comments/m1g0r5/getting_spam_group_facetimes_sometimes_from/\">last week</a>.</p><p>The disruptions caused by junk group calls could be minimized if Apple gave users the ability to block all numbers in a group call with a single tick of a box. Multiple thread participants also reported that FaceTime doesn't have the ability to take group calls only from numbers in the user's contacts. Ars asked Apple for comment, and this post will be updated if representatives provide an answer.</p><p>For now, people receiving spammed group calls have few options other than those listed above. Probably the most effective means is to turn off FaceTime and wait for the spam wave to die out. Users should not answer the calls or engage the callers.</p></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"64b35acd1157ba824cd36e0544122ab10e111e04dcf9796f6052c2ede0edca88","category":"Tech"}