{"title":"New iPad Pro and MacBook Models With Mini-LED Displays Again Rumored to Launch This Year","link":"https://www.macrumors.com/2021/02/23/mini-led-ipad-pro-macbooks-ennostar/","date":1614058369000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/02/23/mini-led-ipad-pro-macbooks-ennostar/\"><p>Taiwanese company Ennostar will begin production of Mini-LED backlight units for an upcoming 12.9-inch iPad Pro in the late first quarter or second quarter of this year, according to industry sources cited by <em><a href=\"https://www.digitimes.com/news/a20210223PD202.html\">DigiTimes</a></em>.</p><p><img alt=\"iPad Pro Mini LED\" width=\"1920\" height=\"1080\" src=\"https://images.macrumors.com/t/ZnBUINqE2OTnhijDsYlyC5HFyBs=/400x0/filters:quality(90)/article-new/2020/09/iPad-Pro-Mini-LED.jpg?lossy\" data-src=\"https://images.macrumors.com/t/ZnBUINqE2OTnhijDsYlyC5HFyBs=/400x0/filters:quality(90)/article-new/2020/09/iPad-Pro-Mini-LED.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/ZnBUINqE2OTnhijDsYlyC5HFyBs=/400x0/filters:quality(90)/article-new/2020/09/iPad-Pro-Mini-LED.jpg?lossy 400w,https://images.macrumors.com/t/Hpux_JRiXyDMTkOjaYBP1J-LBlE=/800x0/filters:quality(90)/article-new/2020/09/iPad-Pro-Mini-LED.jpg?lossy 800w,https://images.macrumors.com/t/vFbcVZCE7vuh56oRvQj9aGcwABo=/1600x0/filters:quality(90)/article-new/2020/09/iPad-Pro-Mini-LED.jpg 1600w,https://images.macrumors.com/t/95n9xwQ4dpyE5yF_-JCXUSv0MY8=/2500x0/filters:no_upscale():quality(90)/article-new/2020/09/iPad-Pro-Mini-LED.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/ZnBUINqE2OTnhijDsYlyC5HFyBs=/400x0/filters:quality(90)/article-new/2020/09/iPad-Pro-Mini-LED.jpg?lossy 400w,https://images.macrumors.com/t/Hpux_JRiXyDMTkOjaYBP1J-LBlE=/800x0/filters:quality(90)/article-new/2020/09/iPad-Pro-Mini-LED.jpg?lossy 800w,https://images.macrumors.com/t/vFbcVZCE7vuh56oRvQj9aGcwABo=/1600x0/filters:quality(90)/article-new/2020/09/iPad-Pro-Mini-LED.jpg 1600w,https://images.macrumors.com/t/95n9xwQ4dpyE5yF_-JCXUSv0MY8=/2500x0/filters:no_upscale():quality(90)/article-new/2020/09/iPad-Pro-Mini-LED.jpg 2500w\"><br>Ennostar is a holding company that was jointly established in January 2021 by LED-related manufacturers Epistar and Lextar Electronics.</p><p>Apple is expected to unveil the new 12.9-inch iPad Pro with Mini-LED backlighting in the first half of this year, with Epistar serving as the exclusive supplier of Mini-LED chips that will be packaged into backlight units by Lextar, the report claims. This timeframe has been rumored several times, with some reports <a href=\"https://www.macrumors.com/2020/12/27/ipad-pro-mini-led-first-quarter-2021/\">narrowing down a release to the first quarter</a>, so it is possible the new iPad Pro will be introduced in March.</p><p>The new 12.9-inch iPad Pro is also expected to feature a <a href=\"https://www.macrumors.com/2020/06/03/ipad-pro-5g-a14x-mini-led-2021-rumor/\">faster A14X chip and support for 5G networks</a> on models with cellular connectivity.</p><p>It's unclear if Apple plans to introduce a new 11-inch iPad Pro at the same time, as many rumors have only mentioned the 12.9-inch iPad Pro. One possibility is that Mini-LED backlighting will be limited to the 12.9-inch model, with the 11-inch model's key new features limited to the A14X chip and 5G support, but it is unclear.</p><p>Apple will likely also adopt Mini-LED backlighting for new MacBook models to be unveiled in the second half of this year, according to the report. Apple analyst Ming-Chi Kuo expects new 14-inch and 16-inch MacBook Pro models to launch in the second half of 2021 with a new design, the <a href=\"https://www.macrumors.com/2021/02/22/2021-macbook-pro-sd-hdmi-port-kuo/\">return of an HDMI port and SD card reader</a>, the <a href=\"https://www.macrumors.com/2021/01/15/new-macbook-pro-models-magsafe-ports/\">removal of the Touch Bar</a>, classic MagSafe charging with a breakaway power cable, and more.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/21/whatsapp-fate-of-accounts-privacy-policy/\">WhatsApp Reveals What Happens to Users Who Don't Agree to Upcoming Privacy Policy Changes</a></h3><p>Sunday February 21, 2021 1:11 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>WhatsApp has revealed how it will gradually limit the features available to accounts held by users who do not accept the platform's impending privacy policy changes, due to come into effect on May 15. WhatsApp's new banner explaining the privacy policy changes According to an email seen by TechCrunch to one of its merchant partners, WhatsApp said it will \"slowly ask\" users who have not yet...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/21/next-gen-airpods-image-leak/\">Alleged Leaked Image Claims to Show Third-Generation AirPods and Case</a></h3><p>Sunday February 21, 2021 2:49 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>A new image claims \u0010to offer our first real world look at Apple's next-generation AirPods. The image, shared by 52audio, showcases both AirPods and the charging case for what the site claims to be the third iteration of the wireless earbuds. 52audio has in the past shared images claiming to showcase different parts of the third-generation AirPods. Most notably, the site in November shared...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/20/apple-magsafe-wallet-long-term-review/\">Revisiting Apple's MagSafe Leather Wallet After 3 Months of Usage</a></h3><p>Saturday February 20, 2021 8:04 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Back in November when Apple's MagSafe-compatible Leather Wallet first launched, MacRumors videographer Dan took a look at the accessory and ended up disliking it because of the weak magnetic connection. Dan kept using the Leather Wallet despite its flaws, and after three months with the accessory, his opinion has changed and he wanted to share some new thoughts on it. Subscribe to the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/20/top-stories-ios-14-5-beta-2-changes/\">Top Stories: More iOS 14.5 Beta Changes, iPhone 13 Rumors, Apple Watch Charging Issue Fixed</a></h3><p>Apple is continuing to tweak things during the iOS 14.5 beta testing period, and it looks like there will be some nice changes coming in the update when it's released to the public in a month or so. This week also saw the release of a watchOS bug fix update for Series 5 and Series SE owners, addressing a serious issue where their watches may not charge after entering Power Reserve mode,...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/20/chrome-safari-ram-test/\">Chrome Used 10X More RAM Than Safari on macOS Big Sur in Recent Test [Updated]</a></h3><p>Saturday February 20, 2021 12:52 pm PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Under normal and lightweight web browsing, Google Chrome uses 10x more RAM than Safari on macOS Big Sur, according to a test conducted by Flotato creator Morten Just (via iMore). In a blog post, Just outlines that he put both browsers to the test in two scenarios on the latest version of macOS. The first test was conducted on a virtual machine, and the second on a 2019 16-inch MacBook Pro...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/19/no-apple-event-march-16/\">Gurman: No Apple Event Happening on March 16</a></h3><p>Friday February 19, 2021 5:42 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple does not have plans to hold an event on Tuesday, March 16, Bloomberg's Mark Gurman confirmed on Twitter this evening. Earlier this week, a report from Taiwanese site Economic Daily News suggested there would be a March 16 event, with the initial rumor picked up and circulated by a few other sites. Economic Daily News cited unverified and unsubstantiated content from Twitter accounts...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/22/apple-revokes-silver-sparrow-certificates/\">Apple Takes Step to Prevent Further Spread of 'Silver Sparrow' Malware on Macs</a></h3><p>Monday February 22, 2021 6:13 am PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Over the weekend, we reported on the second known piece of malware compiled to run natively on M1 Macs. Given the name \"Silver Sparrow,\" the malicious package is said to leverage the macOS Installer JavaScript API to execute suspicious commands. After observing the malware for over a week, however, security firm Red Canary did not observe any final payload, so the exact threat to users remains a...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/21/pink-squares-external-display-m1-mac-mini/\">Apple Investigating Issue With 'Pink Squares' Appearing on Displays Connected to M1 Mac Mini</a></h3><p>Sunday February 21, 2021 11:08 am PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>In an internal memo this week, obtained by MacRumors, Apple informed service providers that it is aware of and investigating an issue that may result in \"pink squares or pixels\" appearing on displays connected to an M1 Mac mini. Image via Twitter user @FatihVidyograf This issue has been reported by users across the Apple Support Communities, MacRumors Forums, and Reddit since the M1 Mac mini...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/20/m1-macs-silver-sparrow-malware/\">M1 Macs Targeted by Additional Malware, Exact Threat Remains a Mystery</a></h3><p>Saturday February 20, 2021 12:10 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>The second known piece of malware that has been compiled to run natively on M1 Macs has been discovered by security firm Red Canary. Given the name \"Silver Sparrow,\" the malicious package is said to leverage the macOS Installer JavaScript API to execute suspicious commands. After observing the malware for over a week, however, neither Red Canary nor its research partners observed a final...</p></div></div></div>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6565080e5569a99b6436e90eca70a8b18bab8e339b52399382880cc13589b647","category":"Apple"}