{"title":"eBay Is Delisting Dr. Seuss Books Taken Out of Print This Week","link":"https://www.wsj.com/articles/dr-seuss-books-deemed-offensive-will-be-delisted-from-ebay-11614884201","date":1614916899000,"content":"<div id=\"readability-page-1\" class=\"page\"><p>Online marketplace <a href=\"https://www.wsj.com/market-data/quotes/EBAY\">eBay</a><span> Inc.</span> <a href=\"https://www.wsj.com/market-data/quotes/EBAY?mod=chiclets\" data-channel=\"/zigman2/quotes/204653455/composite\" data-symbol=\"EBAY\" data-changepercent=\"-2.31\">EBAY <span>-2.31%</span> </a>said it is working to prevent the resale of six Dr. Seuss books that were <a href=\"https://www.wsj.com/articles/six-dr-seuss-books-are-dropped-after-review-finds-imagery-offensive-11614711623?mod=article_inline\" target=\"_blank\">pulled earlier this week</a> by the company in charge of the late author’s works because they contain offensive imagery.</p><p>“EBay is currently sweeping our marketplace to remove these items,” a spokeswoman for the company said in an email. New copies of the six books were no longer for sale online at major retailers such as Barnes &amp; Noble on Thursday afternoon, which put eBay among the most prominent platforms for the books to be sold.</p><div><p>Hundreds of listings for the six books could be found on the platform as of Thursday morning, though the number appeared to be lower than it was on Wednesday evening. The eBay spokeswoman said that it would take some time to review seller listings and that the company was monitoring newly published listings.</p><p>Retailers frequently make decisions to remove products from their platforms for a variety of reasons. The move made by eBay comes at a time when there is rising concern, especially in conservative quarters, <a href=\"https://www.wsj.com/articles/republican-senators-send-letter-to-jeff-bezos-asking-why-amazon-pulled-book-by-conservative-author-11614212331?mod=article_inline\" target=\"_blank\">about how major tech platforms decide which content is acceptable</a>. At the same time, others contend the platforms aren’t doing enough to police inappropriate content.</p><div data-campaign-id=\"4\" id=\"cx-article-inline-newsletter-tile\"><div><h5>WSJ Newsletter</h5><h3>Notes on the News</h3><p>The news of the week in context, with Tyler Blint-Welsh.</p><p><img width=\"100%\" src=\"https://content.cxpublic.com/creatives/eb1177f7b09806fe9ac34caec1cca4cb25bbafed.png\" alt=\"Notes on the News\" title=\"Notes on the News\"></p><p><img width=\"100%\" src=\"https://content.cxpublic.com/creatives/094b659bcb689a4ee9d663be638770a220dcacd7.png\" alt=\"Notes on the News\" title=\"Notes on the News\"></p></div><div><p><label for=\"cx-checkbox-offers\"><span><span></span></span> <span>I would also like to receive updates and special offers from Dow Jones and affiliates. I can unsubscribe at any time.</span></label> <label for=\"cx-checkbox-privacy\"><span><span></span></span> <span>I agree to the <a href=\"https://www.dowjones.com/privacy-policy/\" target=\"_blank\">Privacy Policy</a> and <a href=\"https://www.dowjones.com/cookie-notice/\" target=\"_blank\">Cookie Notice</a>.</span></label></p><p><label for=\"cx-email\">Enter your Email</label></p><a role=\"button\" id=\"cXLinkIdklvteo2739y2cppc\" href=\"https://www.wsj.com/newsletters?sub=401\"><span>Sign up</span></a></div><div><h5>Check Your Inbox</h5><p>Please verify your email address to start receiving Notes on the News</p></div><p><a data-alt-action=\"alt-close\" role=\"button\">Continue Reading</a></p></div><p>Dr. Seuss Enterprises LP, which oversees Dr. Seuss’s publishing interests and ancillary areas, Tuesday said it had decided that six of the famed author’s books—“And to Think That I Saw It on Mulberry Street”; “If I Ran the Zoo”; “McElligot’s Pool”; “On Beyond Zebra!”; “Scrambled Eggs Super!” and “The Cat’s Quizzer”—would no longer be published because they “portray people in ways that are hurtful and wrong.”</p><p>After the announcement, one woman said she listed two titles, “On Beyond Zebra!” and “McElligot’s Pool,” for sale on eBay on Wednesday. Later that day, she said, she received an email from eBay explaining that “On Beyond Zebra!” had been removed from sale because it violated eBay’s “offensive material policy.” The second title was pulled Thursday morning, she said.</p><p>“Dr. Seuss Enterprises has stopped publication of this book due to its negative portrayal of some ethnicities,” said the email message from eBay, which was reviewed by The Wall Street Journal. “As a courtesy, we have ended your item and refunded your selling fees, and as long as you do not relist the item, there will be no negative impact to your account.”</p><p>Plenty of controversial items—including Adolf Hitler’s “Mein Kampf” and “The Turner Diaries,” a novel popular with white-supremacist groups—were available on eBay as of Wednesday evening. When asked, the spokeswoman said these two books also fell in the “offensive material” category and would be removed. On Thursday afternoon it appeared that “The Turner Diaries” was no longer available on eBay.</p><p>With “millions of transactions happening every day on our platform across more than 190 markets, we are constantly evaluating and making improvements to ensure prohibited items remain off eBay,” the spokeswoman said.</p><p>The six discontinued Dr. Seuss books aren’t among the late author’s best-known works. Earlier this week, publisher Random House Books for Young Readers and several booksellers—including Barnes &amp; Noble—said Dr. Seuss’s best-known books would remain available to customers.</p><p>More than five million print copies of Dr. Seuss’s books were sold in the U.S. last year, according to data from NPD BookScan—led by “Oh, the Places You’ll Go!” and “Green Eggs and Ham,” which each sold by the hundreds of thousands. Of the now-discontinued books, the top seller last year was “If I Ran the Zoo,” with about 7,000 copies sold.</p><p>Some copies of all six discontinued titles remained available for sale from third-party sellers on <a href=\"https://www.wsj.com/market-data/quotes/AMZN\">Amazon.com</a><span> Inc.</span> A spokeswoman for Amazon declined to comment.</p><p>Amazon last week faced questions from Republican senators after it removed a book about transgender issues that had been on sale on the platform for about three years. Amazon didn’t comment on the senators’ letter but said it reserved the right not to sell certain titles based on its content guidelines for books.</p><p>A spokesman for Encounter Books, which published “When Harry Became Sally: Responding to the Transgender Moment,” by conservative scholar Ryan T. Anderson, said on Thursday that the publishing house still hasn’t received an explanation for why the book was removed from sale. Amazon on Thursday referred to its earlier statement.</p><p>“All retailers make decisions about what selection they choose to offer and we do not take selection decisions lightly,” Amazon said in a statement last week.</p><p><strong>Write to </strong>Jeffrey A. Trachtenberg at <a href=\"mailto:jeffrey.trachtenberg@wsj.com\" target=\"_blank\">jeffrey.trachtenberg@wsj.com</a></p></div><p>Copyright ©2020 Dow Jones &amp; Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8</p></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"65adccdca07a6b4c20b18e07b63f353b6301b83e0fbad8fbf2fe58c3e712af5d","category":"Tech"}