{"title":"Mark Cavendish sprints to victory on stage 10 of the Tour de France","link":"https://cyclingtips.com/2021/07/mark-cavendish-sprints-to-victory-on-stage-10-of-the-tour-de-france/","date":1625587561000,"content":"<div><div><p>Mark Cavendish (Deceuninck-QuickStep) pulled to within one victory of tying the legendary Eddy Merckx’s record for Tour de France stage wins in a career with a sprint triumph on Tuesday’s stage 10.</p><p>The 190.7 km trek from Albertville to Valence saw the peloton return to racing after Monday’s rest day, and crosswinds late in the stage provided at least a little bit of intrigue as a high pace in the pack helped force splits in the final 20 km of the day. Although race leader Tadej Pogačar (UAE Team Emirates) found himself towards the back of the bunch at one point, he and the rest of the GC contenders rolled into the last few kilometers with the peloton.</p><p>Deceuninck-QuickStep led the way into the finale, and then Cavendish launched with around 150 meters to go. Wout van Aert (Jumbo-Visma) tried to come around on Cavendish’s left with Jasper Philipsen (Alpecin-Fenix) going right, but neither rider could quite catch the 36-year-old Manxman, who held on to take his third victory so far this Tour.</p><p>He now counts 33 Tour stage wins on his career palmares, just one short of Eddy Merckx’s record.</p><p>The stage also saw Cavendish extend his lead in the points classification. Although green jersey hopeful Sonny Colbrelli (Bahrain Victorious) and Michael Matthews (BikeExchange) picked up a significant haul of points at the intermediate sprint behind breakaway riders Tosh van der Sande (Lotto Soudal) and Hugo Houle (Astana-Premier Tech), Cavendish now has 218 points to Matthews’s 159 and Colbrelli’s 136.</p><div><div><p>Tour de France (2.UWT) <span>Albertville → Valence</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/ea/mark-cavendish-2021.jpeg\"></p></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"65b45795d25c865d439fc1d718a7bc4e64549784e5e87479ceb3eb4feb9c3808","category":"Cycling"}