{"title":"Dropbox Expanding Its Password Manager to Free Users With Limitations","link":"https://www.macrumors.com/2021/03/16/dropbox-passwords-free-version/","date":1615901884000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/16/dropbox-passwords-free-version/\"><p>Dropbox today <a href=\"https://blog.dropbox.com/topics/product/dropbox-passwords-coming-soon-for-all-users\">announced</a> that it will be rolling out a limited version of its Dropbox Passwords password manager to users with a free Dropbox Basic account in early April. The feature <a href=\"https://www.macrumors.com/2020/08/12/dropbox-passwords-and-vault-now-available/\">launched last year for paying subscribers only</a>.</p><p><img alt=\"dropbox passwords\" width=\"1074\" height=\"720\" src=\"https://images.macrumors.com/t/UI8UcBGFu9mw2lmTVmaQtgeN9zE=/400x0/filters:quality(90)/article-new/2020/08/dropbox-passwords.jpg?lossy\" data-src=\"https://images.macrumors.com/t/UI8UcBGFu9mw2lmTVmaQtgeN9zE=/400x0/filters:quality(90)/article-new/2020/08/dropbox-passwords.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/UI8UcBGFu9mw2lmTVmaQtgeN9zE=/400x0/filters:quality(90)/article-new/2020/08/dropbox-passwords.jpg?lossy 400w,https://images.macrumors.com/t/8yll4QWxl8ZZU29XY-e-XhtrLdQ=/800x0/filters:quality(90)/article-new/2020/08/dropbox-passwords.jpg?lossy 800w,https://images.macrumors.com/t/PFMPIzgrZr8G--4KsHY-lLtTlaM=/1600x0/filters:quality(90)/article-new/2020/08/dropbox-passwords.jpg 1600w,https://images.macrumors.com/t/-cBAEGP3CWzgffuGOOk-hVVXxy0=/2500x0/filters:no_upscale():quality(90)/article-new/2020/08/dropbox-passwords.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/UI8UcBGFu9mw2lmTVmaQtgeN9zE=/400x0/filters:quality(90)/article-new/2020/08/dropbox-passwords.jpg?lossy 400w,https://images.macrumors.com/t/8yll4QWxl8ZZU29XY-e-XhtrLdQ=/800x0/filters:quality(90)/article-new/2020/08/dropbox-passwords.jpg?lossy 800w,https://images.macrumors.com/t/PFMPIzgrZr8G--4KsHY-lLtTlaM=/1600x0/filters:quality(90)/article-new/2020/08/dropbox-passwords.jpg 1600w,https://images.macrumors.com/t/-cBAEGP3CWzgffuGOOk-hVVXxy0=/2500x0/filters:no_upscale():quality(90)/article-new/2020/08/dropbox-passwords.jpg 2500w\"><br>Dropbox Basic users will be able to store up to 50 passwords, with automatic syncing on up to three devices. These limits are likely in place to incentivize users to start paying for a Dropbox Plus or Dropbox Professional plan, but as <em><a href=\"https://www.theverge.com/2021/3/16/22332829/dropbox-passwords-manager-added-free-basic-account\">The Verge</a></em> notes, <a href=\"https://bitwarden.com/\">Bitwarden</a> offers unlimited password storage and syncing for free.</p><p>Similar to 1Password, Dropbox Passwords is a password manager that allows you to save your account usernames and passwords and sync them across your devices, with autofilled or suggested passwords when you sign into websites and mobile apps. Dropbox Passwords is available as a desktop app on macOS and Windows, mobile app on iOS and Android, and browser extension across Safari, Chrome, Firefox, and Microsoft Edge.</p><p>Users can <a href=\"https://www.dropbox.com/passwordswaitlist\">sign up to be notified</a> when Dropbox Passwords is available.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/15/apple-shares-jump-airpods-pro-ad/\">Apple Shares 'Jump' AirPods Pro Ad</a></h3><p>Sunday March 14, 2021 9:09 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today shared a new AirPods Pro-focused ad called \"Jump\" on its YouTube channel, highlighting the Active Noise Cancellation and Transparency features of the earbuds in a creative way. In the spot, a man wearing AirPods Pro jump ropes through the city. It's set to the song \"Fallin' Apart\" by Young Franco, and it features the tagline \"Turn the world into your playground with AirPods Pro.\" ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/13/top-stories-apple-event-rumor-march-23/\">Top Stories: Apple Event Rumored for March 23, iMac Pro and HomePod Discontinued, and More</a></h3><p>Rumors about a potential Apple event are starting to heat up as we're getting close to the time of year when Apple frequently hosts an event, so stay tuned for more information on that front in the coming days and weeks. This week also saw Apple confirm it has discontinued both the iMac Pro and the original HomePod, while rumors are continuing to look forward to new Apple silicon MacBook Pro ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-discontinuing-homepod/\">Apple Discontinues Full-Sized HomePod to Focus on HomePod Mini</a></h3><p>Friday March 12, 2021 5:14 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple has discontinued the standard HomePod to focus exclusively on the HomePod mini, reports TechCrunch. First introduced four years ago, Apple's larger HomePod has never sold well because of its high price tag. Apple hoped that the HomePod's high-quality sound would give it an edge over competing products, but sales of the HomePod have always been lackluster with so many more affordable...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-silicon-mac-shipments-forecast/\">Next-Generation Apple Silicon MacBooks Expected to Drive Record-Breaking Mac Shipments This Year</a></h3><p>In a research note shared with MacRumors today, Barclays analysts said they expect Apple to report record Mac shipments in the 2021 fiscal year. Apple has seen strong demand for Macs driven by the COVID-19 pandemic and the release of Apple silicon Macs. With rumors indicating that Apple plans to release redesigned 14-inch and 16-inch MacBook Pro models with Apple silicon in the second half...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/iphone-13-touch-id-under-display/\">iPhone 13 Models Will 'Likely' Have Touch ID Under the Display</a></h3><p>iPhone 13 models slated for release later this year will \"likely\" feature a fingerprint scanner embedded under the display for authentication, in addition to Face ID, according to Barclays analyst Andrew Gardiner and three of his colleagues. In a research note shared with MacRumors today, the analysts added that iPhone 13 models will feature a smaller notch and that the LiDAR Scanner will...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/airpods-3-redesign-new-images/\">Upcoming AirPods 3 Redesign Shown Off in New Images</a></h3><p>Friday March 12, 2021 11:55 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the AirPods 3 rumored to be launching as soon as this month, we've been seeing an increasing number of leaks showing off the design of the new earbuds. Renders were shared yesterday, and today, 52audio has published a series of images said to feature the third-generation AirPods. As with prior leaks, the AirPods 3 have an AirPods Pro-like design with a shorter stem and a more rounded...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/13/iphone-12-cook-ad/\">Apple Promotes iPhone 12 'Ceramic Shield' Display In New 'Cook' Ad</a></h3><p>Saturday March 13, 2021 10:04 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>In a new ad on its YouTube channel, Apple is promoting the durability and water resistance of the iPhone 12 and the performance of the \"Ceramic Shield\" display. The ad, named \"Cook,\" showcases a chef putting an iPhone 12‌ through its paces by splashing it with liquids and flour, plus dropping it on its screen multiple times. The ad aims to highlight the \"Ceramic Shield\" display on the...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/airpods-3-mass-production-q3-2021/\">Kuo: AirPods 3 Mass Production to Start in Q3 2021</a></h3><p>Sunday March 14, 2021 11:55 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Mass production will begin on the third-generation AirPods in the third quarter of 2021, according to an investors note from analyst Ming-Chi Kuo that was seen by MacRumors. If mass production is not set to begin until the third quarter of 2021, it would mean that the AirPods 3 wouldn't ship until later in the year. Kuo previously said back in November that the AirPods 3 would launch in the ...</p></div></div></div>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6600d6e7a11532924f3e18dc117c994bb7a8ce07dc44916d17e283bb32a2701c","category":"Apple"}