{"title":"Samsung now updates Android for longer than Google does","link":"https://arstechnica.com/?p=1744388","date":1614097244000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"main\"><article itemscope=\"\" itemtype=\"http://schema.org/NewsArticle\"><div><header><h4>Apple is still better —</h4><h2 itemprop=\"description\">Galaxy devices going back to 2019 are now getting four years of security updates.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Samsung-Galaxy-S21-800x450.jpg\" alt=\"Samsung now updates Android for longer than Google does\"><figcaption><p>Ron Amadeo</p></figcaption></figure><p>Samsung is <a href=\"https://www.samsungmobilepress.com/pressreleases/samsung-takes-galaxy-security-to-the-next-level-by-extending-updates\">upping the ante</a> on Android updates and offering four years of security updates on many of its Android devices. The company's full update package is now three years of major OS updates and four years of security updates, besting even what Google offers on the Pixel line.</p><p>In the announcement, Samsung says, \"Over the past decade, Samsung has made significant progress in streamlining and speeding up its regular security updates. Samsung worked closely with its OS and chipset partners, as well as over 200 carriers around the world, to ensure that billions of Galaxy devices receive timely security patches.\" Samsung <a href=\"https://www.gizmochina.com/2021/01/25/samsung-galaxy-s8-s8-plus-gets-jan-2021-security-patch/\">has experimented</a> with bringing four years of updates to its own Exynos SoC devices, but now it looks like the company is getting Qualcomm models on board as well.</p><p>Keep in mind that these are not necessarily <em>monthly</em> security updates. Samsung says it's delivering four years of \"monthly or quarterly\" updates, depending on the age of the device. Samsung's current <a href=\"https://security.samsungmobile.com/workScope.smsb\">security bulletin page</a> has the Galaxy S9 (2018) on the monthly update plan, while the Galaxy S8 is on the quarterly plan. So it sounds like three years of monthly security updates and one more year of quarterly updates.</p><p>As for which phones are getting four years of security updates, the answer is \"a lot.\" It's not just flagships; a lot of mid-range devices and tablets going back to 2019 are included, making for \"over 130 models.\" Here's the full list.</p><blockquote><ul><li>Galaxy Foldable devices: Fold, Fold 5G, Z Fold2, Z Fold2 5G, Z Flip, Z Flip 5G</li><li>Galaxy S series: S10, S10+, S10e, S10 5G, S10 Lite, S20, S20 5G, S20+, S20+ 5G, S20 Ultra, S20 Ultra 5G, S20 FE, S20 FE 5G, S21 5G, S21+ 5G, S21 Ultra 5G</li><li>Galaxy Note series: Note10, Note10 5G, Note10+, Note10+ 5G, Note10 Lite, Note20, Note20 5G, Note20 Ultra, Note20 Ultra 5G</li><li>Galaxy A series: A10, A10e, A10s, A20, A20s, A30, A30s, A40, A50, A50s, A60, A70, A70s, A80, A90 5G, A11, A21, A21s, A31, A41, A51, A51 5G, A71, A71 5G, A02s, A12, A32 5G, A42 5G</li><li>Galaxy M series: M10s, M20, M30, M30s, M40, M11, M12, M21, M31, M31s, M51</li><li>Galaxy XCover series: XCover4s, XCover FieldPro, XCover Pro</li><li>Galaxy Tab series: Tab Active Pro, Tab Active3, Tab A 8 (2019), Tab A with S Pen, Tab A 8.4 (2020), Tab A7, Tab S5e, Tab S6, Tab S6 5G, Tab S6 Lite, Tab S7, Tab S7+</li></ul></blockquote><p>Samsung is offering longer Android security updates than anyone else, but the company is still one of the slower major OEMs when it comes to delivering Android OS updates. The company took <a href=\"https://arstechnica.com/gadgets/2020/12/samsung-finally-starts-its-android-11-rollout-three-months-after-release/\">three months</a> to start the Android 11 rollout, while Google, OnePlus, Oppo, and Xiaomi were all faster. Samsung still doesn't participate in Google's <a href=\"https://arstechnica.com/gadgets/2020/09/android-11-is-final-with-day-one-updates-from-google-oneplus-and-xiaomi/\">Android beta program,</a>&nbsp;which—surprise—is used by all the faster companies. Samsung also refuses to follow Android's best practices and add <a href=\"https://www.androidpolice.com/2021/01/24/samsungs-galaxy-s21-doesnt-support-seamless-updates/\">seamless update support</a>, which lets users apply all these updates without incurring significant phone downtime.</p><p>Samsung's new update plan is the best of any Android phone, but it still pales in comparison to Samsung's favorite competitor, Apple. iOS still offers the best update plan in the industry, with&nbsp;<a href=\"https://support.apple.com/guide/iphone/supported-iphone-models-iphe3fa5df43/ios\">iOS 14 support</a> going all the way back to the iPhone 6S, a phone released in 2015.</p><p>Google is now in the embarrassing position of not offering the best update plan for its own operating system, but it's hard to imagine the company not quickly upping the Pixel line to match Samsung. Google is, after all, where the majority of these patches are coming from, since it's the company that develops Android. The Android source code still gets monthly security updates covering the <a href=\"https://source.android.com/security/bulletin/2021-02-01\">newest four versions</a> of Android, going back to Android 8.1. If Google wanted to, it could do three years of major updates and then&nbsp;four&nbsp;<em>more </em>years of security updates after that. The code is out there.</p><p>There is still a lot of work to do, but kudos to Samsung for pushing the Android update envelope. Android's update situation is slowly <a href=\"https://arstechnica.com/gadgets/2020/07/android-10-has-the-fastest-update-rate-ever-hits-16-of-users-in-10-months/\">getting better</a>, one baby step at a time.</p></div></div><section><p><section><a href=\"https://arstechnica.com/author/ronamadeo\">Ron Amadeo</a> Ron is the Reviews Editor at Ars Technica, where he specializes in Android OS and Google products. He is always on the hunt for a new gadget and loves to rip things apart to see how they work.</section></p></section></article></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"661449ff5ff0118a31df42b6c7eed64921ebb9481fe95d39c8d085a8df864dfb","category":"Tech"}