{"title":"Riders protest race safety ahead of Tour de France stage 4","link":"https://cyclingtips.com/2021/06/rider-protest-race-safety-ahead-of-tour-de-france-stage-4/","date":1624967139000,"content":"<div><div><p>After the <a href=\"https://cyclingtips.com/2021/06/reactions-the-tour-peloton-had-plenty-to-say-about-the-finale-of-stage-3/\" target=\"_blank\">stressful and crash-heavy </a>three stages that kicked off the Tour de France, teams at the race planned to stage a protest prior to the start of stage 4. The peloton led by André Greipel stopped just after km 0, once the race had cleared the neutral section, and rode the first 10 km of the 150 km stage easy.</p><p>The Cyclistes Professionnels Associés, or CPA, released a statement on their Twitter that asked the Tour de France race organizers to show more respect for the riders and their safety.</p><p>“Following the crashes during Stage 3 of the TdF, CPA has been discussing with the riders about how they wish to proceed to show their dissatisfaction with safety measures and demand their concerns are taken seriously,” the statement read. “Their frustration about foreseeable and preventable action is enormous. They wish to stress their respect for their sponsors, their sports groups, the organizer, their international institutions.”</p><p>The statement continued, “In return, the riders of the Tour de France ask for the same respect – respect for their safety. For this reason they are asking the UCI to setup discussions with all race stakeholders to adapt the 3 km rule during stage races.”</p><p>Prior to the start of stage 3, the riders had asked the ASO to amend the 3 km rule that states if a rider crashes or has a mechanical issue within 3 km of the finish their time will be taken from the group they were in at the time of the accident. According to Tim Declercq riders asked the 3 km rule be extended to 8 km on stage 3 due to the dangerous roads. The ASO refused their request.</p><p>Stage 3 saw many of the race favourites <a href=\"https://cyclingtips.com/2021/06/whos-out-of-the-tour-and-whos-riding-injured/\" target=\"_blank\">forced out of the race</a> and crushed the dreams of some general classification hopefuls. <a href=\"https://cyclingtips.com/2021/06/jack-haig-out-of-the-tour-with-broken-collarbone-and-concussion/\" target=\"_blank\">Jack Haig</a>, who sat tenth on GC prior to stage 2, broke his collarbone and sustained a concussion. The injuries forced him to leave the race. Primož Roglič will start stage 4 heavily bandaged.</p><blockquote></blockquote><p>UCI president David Lappartient spoke out against the riders to Quest France, stating that the crashes were due to the riders themselves and not the course design. “Cycling is cycling, although I suffer when I see the riders fall. If [Marc Madiot] still wants races to reach city centres, it has to be accepted that it is a little more technical,” Lappartient said<em>.</em></p><p>Madiot was critical of the stage 3 finish, and the UCI for failing to recognize the dangers of the opening three stages.</p><p>Before stage 4 Madiot again expressed his concern over the effects the crashes have on fans viewing the races. “If you’re watching the television do you think your children want to ride a bike seeing what we’ve seen yesterday?” Madiot said. “My son doesn’t want to ride as a professional rider, because we don’t give a good picture of our sport. I love cycling. Cycling is not only about the GC ruined because of crashes.”</p><p>Still, teams, UCI, CPA, and ASO disagreed about the length and nature of the protest. Some riders proposed a 50 km easy ride, some just a minute before the racing got underway. But the majority agreed that the safety of the riders was in danger during the first three days of the Tour de France and a protest was in order.</p><p>“The bigger picture of all this, in my opinion, there is absolutely no unity in cycling,” said Brian Smith, race commentator for GCN+. “The biggest power is ASO, the race organizers, the UCI and then the riders union, CPA, and they cannot agree between them.”</p><p><em>This story is ongoing.</em></p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"66ad877a4b05a2e7af05a80fd751ef86b3bc0658596e498b0fa930f76cb96e96","category":"Cycling"}