{"title":"How To Optimize Progressive Web Apps: Going Beyond The Basics","link":"https://smashingmagazine.com/2020/12/progressive-web-apps/","date":1608717600000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"article__content\"><div><div><figure role=\"presentation\"><a href=\"https://www.smashingmagazine.com/author/gert-svaiko\"><p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5a813876-9a20-42b5-b97d-3d439c5b9276/gert-svaiko-200x200.jpg\" loading=\"eager\" width=\"100\" height=\"100\" alt=\"Gert Svaiko\"></p></a></figure></div><div id=\"author__desc\"><p>Gert Svaiko is a professional copywriter and mainly works with digital marketing companies in the US and EU. <a href=\"https://www.smashingmagazine.com/author/gert-svaiko\">More about Gert ↬</a></p></div></div><p><section aria-label=\"quick summary\">Progressive web applications are proven to raise user engagement and keep the costs down effectively. Building a modern PWA requires more than just the core setup to keep up with the user’s expectations. Therefore, let’s take a first-hand look at adding contemporary characteristics to PWAs, from functioning offline to user-friendly permission requests.</section></p><p>Progressive web applications (PWA) are still gathering popularity in 2020. It doesn’t come as a surprise, considering <a href=\"https://www.beezer.com/blog/important-pwa-statistics/\">the benefits</a> of higher conversion rates, customer engagement, decreased page loading speed, and lower costs on development and overhead.</p><p>We can see respected companies also enjoying <a href=\"https://www.pwastats.com/\">success with their PWAs</a>, such as Twitter, Uber, Tinder, Pinterest, and Forbes. And they all boast about massive benefits from implementing the progressive apps.</p><p>The good news is that developing a PWA isn’t something that only big-budget companies can afford. These applications serve small and average businesses equally and are not that complicated to create.</p><p>You can find a comprehensive <a href=\"https://www.smashingmagazine.com/2016/08/a-beginners-guide-to-progressive-web-apps/\">Beginner’s Guide To Progressive Web Apps</a> on Smashing Magazine that focuses on building the core of PWAs.</p><p>However, let’s take a step further and learn how to deploy modern qualities to PWAs, such as offline functionality, network-based optimizing, cross-device user experience, SEO capabilities, and non-intrusive notifications and requests. You’ll also find example code or references to more specific guides so you can implement these tips to your PWA.</p><h3 id=\"a-quick-overview-of-progressive-web-applications-pwa\">A Quick Overview Of Progressive Web Applications (PWA)</h3><p>Let’s not skip the basics and quickly go over the heart of PWAs.</p><h4 id=\"what-is-a-pwa\">What Is A PWA?</h4><blockquote>“Progressive Web Apps (PWA) are built and enhanced with modern APIs to deliver enhanced capabilities, reliability, and installability while reaching anyone, anywhere, on any device with a single codebase.”<p>— <a href=\"https://web.dev/what-are-pwas/\">Google’s developers</a></p></blockquote><p>In other words, PWAs are websites that users can use as stand-alone applications. They are different from native apps mainly because PWAs don’t require installation and can be used with various devices — native apps are primarily built for mobile devices.</p><h4 id=\"how-do-pwas-work\">How Do PWAs Work?</h4><p>The core of a PWA consists of three components: a web app manifest, service workers, and an application shell. You can find detailed instructions for building those in the <a href=\"https://www.smashingmagazine.com/2016/08/a-beginners-guide-to-progressive-web-apps/\">beginner’s guide</a> mentioned above.</p><p>Here’s what these components do.</p><h5 id=\"web-app-manifest\">Web App Manifest</h5><p>The web app manifest is the core for making a website run as a stand-alone application in full-screen mode. You can define how the PWA looks, optimize it for different devices, and assign an icon that’s displayed after the application’s installation.</p><h5 id=\"service-workers\">Service Workers</h5><p>The service workers enable the offline usage of the PWA by fetching cached data or informing the user about the absence of an Internet connection. The service workers also retrieve the latest data once the server connection is restored.</p><h5 id=\"application-shell-architecture\">Application shell architecture</h5><p>The application shell is what the users see when they access a PWA. It’s the minimum HTML, CSS, and JavaScript that’s required to power the user interface. When developing a PWA, you can cache the application shell’s resources and assets in the browser.</p><h3 id=\"deploying-modern-characteristics-to-your-pwa\">Deploying Modern Characteristics To Your PWA</h3><p>On top of the core features, modern PWAs embrace additional traits that further drive their users towards a more extraordinary user experience.</p><p>Let’s look at some specific modern characteristics of a PWA and learn about adding these to your PWA. The following qualities are considered great additions to the basic PWA by <a href=\"https://web.dev/pwa-checklist/\">Google developers</a>.</p><h4 id=\"the-application-works-offline-as-it-does-online\">The Application Works Offline As It Does Online</h4><p>When building your PWA, you can also develop a custom offline page as part of the core. However, it’s much <a href=\"https://www.smashingmagazine.com/2018/11/guide-pwa-progressive-web-applications/\">more user-friendly</a> if your PWA continues to function even without an Internet connection — up to a certain point where the connection becomes necessary. Otherwise, the user experience could be as frustrating as Ankita Masand’s ordeal with ordering a cake as she describes in her article about the <a href=\"https://www.smashingmagazine.com/2018/11/guide-pwa-progressive-web-applications/\">pain points of PWAs</a>.</p><p>You can achieve a more significant user experience by using cached content, background syncing, and skeleton screens. Let’s look at each one.</p><h5 id=\"cached-content-with-indexeddb\">Cached content with <code>IndexedDB</code></h5><p><code>IndexedDB</code> is an in-browser NoSQL storage system that you can use to cache and retrieve the required data to make your PWA work offline.</p><p>However, not all browsers support <code>IndexedDB</code>, so the first thing you want to do is check if the user’s browser supports it.</p><p>After this, you can create cached content with the IndexedDB API. Here’s <a href=\"https://developers.google.com/web/ilt/pwa/working-with-indexeddb\">an example</a> from Google developers of opening a database, adding an object store, and adding an item to this store.</p><h5 id=\"background-sync\">Background sync</h5><p>If your PWA syncs data in the background, the user can take actions while offline, which are then executed when the Internet connection restores. A simple example is a messaging app. A user can send a message when offline without the need to wait until it is sent — the background sync automatically sends the message when the connection restores.</p><p>Here’s an example of how to develop a background sync feature by <a href=\"https://developers.google.com/web/updates/2015/12/background-sync\">Jake Archibald</a>.</p><p>Then listen for the event in <code>/sw.js</code>:</p><h5 id=\"skeleton-screens\">Skeleton screens</h5><p>One of the main perks of using <a href=\"https://www.smashingmagazine.com/2020/04/skeleton-screens-react/\">skeleton screens</a> is that users perceive the application working rather than sitting idle. While the user doesn’t have a connection, the skeleton screen draws the interface out without content — which then fills once the connection restores.</p><p>Code My UI has some excellent <a href=\"https://codemyui.com/tag/skeleton-screens/\">code snippets</a> available that you can use to create a skeleton screen for your PWA.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1b828789-82d4-458f-9ef7-28445c1ca68d/skeleton-screen-examples.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1b828789-82d4-458f-9ef7-28445c1ca68d/skeleton-screen-examples.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1b828789-82d4-458f-9ef7-28445c1ca68d/skeleton-screen-examples.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1b828789-82d4-458f-9ef7-28445c1ca68d/skeleton-screen-examples.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1b828789-82d4-458f-9ef7-28445c1ca68d/skeleton-screen-examples.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1b828789-82d4-458f-9ef7-28445c1ca68d/skeleton-screen-examples.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1b828789-82d4-458f-9ef7-28445c1ca68d/skeleton-screen-examples.png\" sizes=\"100vw\" alt=\"Skeleton screen examples on Code My UI\"></a><figcaption>Skeleton screen examples on <a href=\"https://codemyui.com/tag/skeleton-screens/\">Code My UI</a>. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1b828789-82d4-458f-9ef7-28445c1ca68d/skeleton-screen-examples.png\">Large preview</a>)</figcaption></figure><h4 id=\"optimizing-based-on-network-usage\">Optimizing Based On Network Usage</h4><p>A central benefit of a PWA is that it provides a faster experience for users. You can further optimize the loading speed by having the PWA use cache-first networking, prioritizing resources, and use adaptive loading based on network quality.</p><p>Let’s look at how you can develop these to your PWA.</p><h5 id=\"cache-first-then-network\">Cache first, then network</h5><p>Using the cached content first further enables your PWA to function offline and paves the way for users to access the content even on low network coverage areas. You can do so by creating a service worker to cache the content and then fetching it.</p><p>Here’s an example from Jeff Posnick on <a href=\"https://developers.google.com/web/fundamentals/primers/service-workers/high-performance-loading\">caching static HTML</a> using service workers.</p><h5 id=\"prioritizing-resources\">Prioritizing resources</h5><p>By default, PWAs have greater performance over similar native apps due to their lite nature. Furthermore, since PWAs use the browser’s cache, it’s possible to indicate which resources take priority and need to be rendered even before they are used. This mainly works with static elements as dynamic content needs updating before it’s fetched.</p><p>You can specify the <a href=\"https://firt.dev/pwa-design-tips/#prioritizing-the-resources\">priority of elements</a> by using the <code>&lt;link&gt;</code> string in the HTML. You can also specify third-party server files by using <code>rel=”preconnect”</code> and <code>rel=”dns-prefetch.”</code></p><p>Maximiliano Firtman gives a simple example of this by prioritizing Web Fonts within the browser’s engine:</p><h5 id=\"implementing-adaptive-loading\">Implementing adaptive loading</h5><p>The Internet speeds of WiFi and 4G aren’t accessible everywhere, and users still get on the Internet with 2G and 3G connections. Since you want your PWA to be accessible by as many people as possible, you might want to optimize it to perform at lower Internet speeds as well.</p><p>You can achieve this by implementing adaptive loading, which loads the PWAs elements based on the connection type that the user has.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d7191281-ba50-439f-b409-4f3ab562913a/adaptive-loading-illustration.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d7191281-ba50-439f-b409-4f3ab562913a/adaptive-loading-illustration.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d7191281-ba50-439f-b409-4f3ab562913a/adaptive-loading-illustration.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d7191281-ba50-439f-b409-4f3ab562913a/adaptive-loading-illustration.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d7191281-ba50-439f-b409-4f3ab562913a/adaptive-loading-illustration.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d7191281-ba50-439f-b409-4f3ab562913a/adaptive-loading-illustration.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d7191281-ba50-439f-b409-4f3ab562913a/adaptive-loading-illustration.png\" sizes=\"100vw\" alt=\"Adaptive loading illustration by Google.\"></a><figcaption>Adaptive loading illustration by <a href=\"https://web.dev/adaptive-loading-with-service-workers/\">Google</a>. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d7191281-ba50-439f-b409-4f3ab562913a/adaptive-loading-illustration.png\">Large preview</a>)</figcaption></figure><p>The most straightforward way is to use <a href=\"https://developers.google.com/web/tools/workbox\">Google’s Workbox</a> tool, which includes numerous ready-made plugins for caching strategies.</p><p>Suppose you want to define a custom caching strategy. Here’s how you can do it as an <a href=\"https://web.dev/adaptive-loading-with-service-workers/\">example</a> from Demian Renzulli and Jeff Posnick:</p><p>Next, pass the plugin to a <code>cacheFirst</code> strategy containing a regular expression to match image URLs (e.g. <code>/img/</code>):</p><h4 id=\"excellent-user-experience-on-all-platforms\">Excellent User Experience On All Platforms</h4><p>An excellent PWA works seamlessly on browsers, mobile, and tablet. While using an Android device is the <a href=\"https://hostingfacts.com/news/internet-facts-stats/\">most popular</a> way (with a 38.9% market share) of accessing the Internet, optimizing your application for all platforms is part of developing the PWAs <a href=\"https://www.smashingmagazine.com/2016/08/a-beginners-guide-to-progressive-web-apps/\">core functions</a>.</p><p>You can take further steps to increase usability and offer a great user experience, such as reducing jumpiness when your PWA loads and making sure your PWA works with any input method.</p><p>Here’s how you can approach each of those aspects.</p><h5 id=\"reducing-jumpy-content-loading\">Reducing “jumpy” content loading</h5><p>Even with high-speed Internet, the site’s content can shift while loading because the site’s elements load in order. This effect is even worse with slower connection speeds and badly hurts the user’s experience.</p><p>The most common elements causing the content to shift while loading are images since these are generally larger and not a priority when loading content. You can tackle this issue with “lazy loading” by using smaller placeholder images that you can prioritize after the HTML structure is rendered.</p><p>Here’s <a href=\"https://developer.mozilla.org/en-US/docs/Web/Progressive_web_apps/Loading\">an example</a> by Mozilla’s developers on how you can add a lightweight image that’s loaded first before the actual image in JavaScript:</p><p>The <code>app.js</code> file processes the data-src attributes like so:</p><p>And then create a loop:</p><p>You can also check out a <a href=\"https://www.smashingmagazine.com/2016/08/ways-to-reduce-content-shifting-on-page-load/\">thorough guide</a> on Smashing Magazine about reducing content jumping with other elements.</p><h5 id=\"pwa-works-with-any-input-method\">PWA works with any input method</h5><p>We’ve covered how PWAs should work with a variety of different devices. To take a step further, you also need to account for other input methods the users can use on these devices, such as touch, mouse, and stylus.</p><p>Adding the Pointer Events API to your PWA mainly solves this question. Here’s how you can <a href=\"https://developers.google.com/web/updates/2016/10/pointer-events\">approach it</a> according to Google’s developers.</p><p>First, check if the browser supports the Pointer Events:</p><p>Next, you can define the actions various input methods can take:</p><p>Since most browsers already have touch-enabled features, you won’t need to add anything else.</p><h4 id=\"discoverable-through-search\">Discoverable Through Search</h4><p>One of PWAs key benefits over a native application is that the PWA is a website by nature and search engines can index them. This allows you to deploy SEO strategies to make your PWA content more discoverable.</p><p>You can start by ensuring that each URL in your PWA has a unique, descriptive title and meta description, which is the baseline of any SEO optimization activity.</p><p>Let’s look at some other steps you can take to make your PWA searchable.</p><h5 id=\"analyze-the-findability-of-your-pwa\">Analyze the findability of your PWA</h5><p>Google has an excellent tool in its <a href=\"https://search.google.com/search-console/about\">Search Console</a> that analyses your site (PWA) and reports the results. You can use it to run a basic scan of your site and uncover any weak spots that you can then start fixing.</p><p>Alternatively, you can use Lighthouse in the Chrome browser to run an SEO audit.</p><p>First, navigate to the target URL. Then Press <code>Control+Shift+J</code> (or <code>Command+Option+J</code> on Mac) that opens the developer’s tools menu. Choose the Lighthouse tab, tick the SEO category box, and generate the report.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a99d263e-2353-4ec8-8d55-16955e55a3c7/lighthouse-seo-report-screenshot.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a99d263e-2353-4ec8-8d55-16955e55a3c7/lighthouse-seo-report-screenshot.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a99d263e-2353-4ec8-8d55-16955e55a3c7/lighthouse-seo-report-screenshot.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a99d263e-2353-4ec8-8d55-16955e55a3c7/lighthouse-seo-report-screenshot.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a99d263e-2353-4ec8-8d55-16955e55a3c7/lighthouse-seo-report-screenshot.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a99d263e-2353-4ec8-8d55-16955e55a3c7/lighthouse-seo-report-screenshot.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a99d263e-2353-4ec8-8d55-16955e55a3c7/lighthouse-seo-report-screenshot.png\" sizes=\"100vw\" alt=\"Google Chrome browser Lighthouse developer tools category SEO screenshot.\"></a><figcaption>Google Chrome browser Lighthouse developer tools category SEO screenshot. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a99d263e-2353-4ec8-8d55-16955e55a3c7/lighthouse-seo-report-screenshot.png\">Large preview</a>)</figcaption></figure><h5 id=\"use-structured-data\">Use structured data</h5><p>Google’s search engine uses structured data to understand the content’s purpose on your webpage.</p><blockquote><p>Structured data is a standardized format for providing information about a page and classifying the page content; for example, on a recipe page, what are the ingredients, the cooking time and temperature, the calories, and so on.<br>— <a href=\"https://developers.google.com/search/docs/guides/intro-structured-data\">Google</a></p></blockquote><p>Before you start coding, Google has also put together a useful list of <a href=\"https://developers.google.com/search/docs/guides/prototype\">common structured data errors</a> and relevant guidelines to fix them. Studying this material should give you a good baseline of what to avoid.</p><p>Frederick O’Brien has written an excellent guide on Smashing Magazine, <a href=\"https://www.smashingmagazine.com/2020/04/structured-data-design-process/\"><em>Baking Structured Data Into The Design Process</em></a>, which describes how to build structured data from the start.</p><h4 id=\"user-friendly-notifications-and-permission-requests\">User-friendly Notifications And Permission Requests</h4><p>Last but not least, you can increase the user experience by optimizing the notifications and permission requests, so they serve your users — as opposed to just being confusing and annoying.</p><p>While you can generally rely on common sense, there are practical tips that you can implement as well, such as creating non-intrusive push notifications and giving the user an option to unsubscribe from messages.</p><h5 id=\"subtle-permission-requests-for-communication\">Subtle permission requests for communication</h5><p>There are two modern ways to automate the communication between a website and a user — chatbots and notifications.</p><p>In a PWAs context, the main perk of a chatbot is that it doesn’t require the user’s permission to interact with the user. However, depending on which chatbot application you use, the user might miss the subtle message. Notifications, on the other hand, require the user’s permission but are much more visible.</p><p>Since you can add a chatbot as a separate <a href=\"https://websitesetup.org/best-ai-chatbots/\">third-party application</a>, let’s focus on creating a user-friendly push notification. In case you need a guide on how to create a push notification in the first place, <a href=\"https://medium.com/better-programming/everything-you-need-to-know-about-pwas-push-notifications-e870bb54e14f\">here’s a great one</a> by Indrek Lasn.</p><p>The most straightforward way to create a non-intrusive permission request is by using a double request. This means that you include a custom interaction to your site on top of the default one from the user’s OS.</p><p>Matt Gaunt offers <a href=\"https://developers.google.com/web/fundamentals/push-notifications/permission-ux\">perfect illustrations</a> for this effect with the following images.</p><p>Here’s the default notification permission request that provides no context:</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4222e86e-7022-4bef-9e30-f2cee5e9db74/bad-ux-permission-request.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4222e86e-7022-4bef-9e30-f2cee5e9db74/bad-ux-permission-request.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4222e86e-7022-4bef-9e30-f2cee5e9db74/bad-ux-permission-request.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4222e86e-7022-4bef-9e30-f2cee5e9db74/bad-ux-permission-request.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4222e86e-7022-4bef-9e30-f2cee5e9db74/bad-ux-permission-request.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4222e86e-7022-4bef-9e30-f2cee5e9db74/bad-ux-permission-request.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4222e86e-7022-4bef-9e30-f2cee5e9db74/bad-ux-permission-request.png\" sizes=\"100vw\" alt=\"Bad UX permission request example\"></a><figcaption>Bad UX permission request example by <a href=\"https://developers.google.com/web/fundamentals/push-notifications/permission-ux\">Permission UX</a>. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4222e86e-7022-4bef-9e30-f2cee5e9db74/bad-ux-permission-request.png\">Large preview</a>)</figcaption></figure><p>And here’s the custom interaction added before the default notification permission described above:</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3df59d79-a8a9-4cc4-990e-01f9f548a55d/good-ux-permission-request.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3df59d79-a8a9-4cc4-990e-01f9f548a55d/good-ux-permission-request.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3df59d79-a8a9-4cc4-990e-01f9f548a55d/good-ux-permission-request.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3df59d79-a8a9-4cc4-990e-01f9f548a55d/good-ux-permission-request.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3df59d79-a8a9-4cc4-990e-01f9f548a55d/good-ux-permission-request.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3df59d79-a8a9-4cc4-990e-01f9f548a55d/good-ux-permission-request.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3df59d79-a8a9-4cc4-990e-01f9f548a55d/good-ux-permission-request.png\" sizes=\"100vw\" alt=\"Good UX permission request example\"></a><figcaption>Good UX permission request example by <a href=\"https://developers.google.com/web/fundamentals/push-notifications/permission-ux\">Permission UX</a>. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3df59d79-a8a9-4cc4-990e-01f9f548a55d/good-ux-permission-request.png\">Large preview</a>)</figcaption></figure><p>By adding a custom alert before the OS’s default one, you can describe the purpose of the notification more clearly to the user. This increases the chance of the user opting in for your site’s notifications.</p><h5 id=\"enable-the-user-to-opt-out-from-notifications\">Enable the user to opt-out from notifications</h5><p>For a user, disabling the push notifications of a site is quite annoying regardless of the device they’re using. Therefore, giving the user an option to opt-out from the messages goes a long way in terms of user experience.</p><p>Here’s <a href=\"https://developers.google.com/web/fundamentals/codelabs/push-notifications\">an example</a> from Matt Gaunt on how to implement an unsubscribing function into your code and UI:</p><p>First, define the <code>pushButton</code>’s click listener:</p><p>Then, add a new function:</p><p>Here’s how it looks in the console after successfully implementing the subscribe button to disable the notifications if the user chooses.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bbb7adce-b709-4d4d-8b7b-76392ec043ff/console-log-example-enable-disable-notifications.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bbb7adce-b709-4d4d-8b7b-76392ec043ff/console-log-example-enable-disable-notifications.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bbb7adce-b709-4d4d-8b7b-76392ec043ff/console-log-example-enable-disable-notifications.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bbb7adce-b709-4d4d-8b7b-76392ec043ff/console-log-example-enable-disable-notifications.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bbb7adce-b709-4d4d-8b7b-76392ec043ff/console-log-example-enable-disable-notifications.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bbb7adce-b709-4d4d-8b7b-76392ec043ff/console-log-example-enable-disable-notifications.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bbb7adce-b709-4d4d-8b7b-76392ec043ff/console-log-example-enable-disable-notifications.png\" sizes=\"100vw\" alt=\"Console.log example of a successful enable/disable notifications function\"></a><figcaption><code>Console.log</code> example of a successful enable/disable notifications function by <a href=\"https://developers.google.com/web/fundamentals/codelabs/push-notifications\">Matt Gaunt</a>. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bbb7adce-b709-4d4d-8b7b-76392ec043ff/console-log-example-enable-disable-notifications.png\">Large preview</a>)</figcaption></figure><h3 id=\"conclusion\">Conclusion</h3><p>PWAs can be mighty powerful for increasing your site’s traffic and expanding on user experience. To further optimize your PWA, you can use these modern solutions described in this article to enhance performance and functionality.</p><p>You also don’t need to implement everything at once. Feel free to cherry-pick the most relevant options since each of these suggestions helps you further your PWA.</p><h4 id=\"further-resources\">Further Resources</h4><ul><li><a href=\"https://developers.google.com/web/ilt/pwa\">Progressive Web Apps Training</a> by Google</li><li><a href=\"https://web.dev/progressive-web-apps/\">Progressive Web Apps</a> by web.dev</li><li><a href=\"https://developer.mozilla.org/en-US/docs/Web/Progressive_web_apps\">Progressive web apps (PWAs)</a> by Mozilla</li></ul><p><img src=\"https://www.smashingmagazine.com/images/logo/logo--red.png\" alt=\"Smashing Editorial\" width=\"35\" height=\"46\" loading=\"lazy\" decoding=\"async\"> <span>(ra, yk, il)</span></p></div></div>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"6718bdbc51424f1c7a0d2dfa4cecff1634d97fc1e9834684d3cff6fdc2a6f9e5","category":"Tech"}