{"title":"Vaughters: A cycling Super League could help teams, but it won’t happen","link":"https://cyclingtips.com/2021/04/vaughters-a-cycling-super-league-could-help-teams-but-it-wont-happen/","date":1619062227000,"content":"<div><div><p>The football (soccer) world was abuzz earlier this week with talk of several big teams breaking away from the current league setup to form their own <a href=\"https://www.bbc.com/sport/football/56795811\" target=\"_blank\">“Super League”</a>. The news prompted EF Education-Nippo manager Jonathan Vaughters to opine on Twitter this week that cycling teams should try something similar.</p><p>“Logic on ‘superleagues’ is really simple: If I was an investor w[ith] (X)B$ +wanted to purchase a sports property, I would not invest in one that had relegation,” Vaughters tweeted. “I wouldn’t invest in one that didn’t have hard financial equality rules. Both drive cost up and competitiveness down.”</p><p>While the football Super League already appears to be in <a href=\"https://www.bbc.com/sport/football/56823501\" target=\"_blank\">dire straits</a>, Vaughters’ tweets drew plenty of responses and raised interesting questions about the value of such a proposition in the cycling world. What would the draw of such a setup be? And could it happen?</p><p>CyclingTips reached out to Vaughters to see if he would expound on his thoughts this week. He obliged, albeit while stating emphatically that the starting point of the conversation should be that it just isn’t going to happen in this sport, where teams don’t have as much power.</p><p>“Cycling is so fragmented,” Vaughters said. “There is not a unifying force in cycling. The AIGCP <em>[the association of professional men’s teams – ed.]</em> is totally dysfunctional. Velon, for all intents and purposes, has sort of lost its bite. The sport is run by ASO and, to a lesser degree, the UCI. Neither one of them really see value in either financial fairness or in elimination of promotion or relegation.”</p><p>He certainly has a point. Efforts that teams (or riders, or really anyone that isn’t the ASO for that matter) have made to get organized over the years have generally come up short, and the other power players don’t have the same goals. But that doesn’t mean it’s not worth pondering what it is about the Super League concept that could be attractive to cycling.</p><p>For Vaughters, there are things about a potential move to a Super League system that could make cycling more competitive, completely removed from how the actual Super League system that was proposed in the football world would play out. He emphasized that he doesn’t closely follow football and that his thoughts on the applicability to cycling are just that: specific to his area of expertise; that of running a WorldTour cycling team.</p><p>“If you look at my Twitter feed, people are like, ‘This is greedy owners, you’re thinking about this from a greed perspective, and it’s only about making money. You’re not seeing this from a fan perspective, from an emotional perspective,'” Vaughters said. “But they’re right, I’m not seeing it from a fan’s perspective because I’m not a fan of football. I know nothing about football. I only know about the business side.”</p><p>The proposed Super League would have given certain big teams guaranteed spots in the league with no risk of relegation. It has also been reported that teams agreed to a salary cap system. For Vaughters, those are two great reasons to shake up the system in cycling.</p><p>Vaughters pointed out that the current team system in cycling is inherently risky for investors. Lower-budget teams don’t tend to perform as well as higher-budget teams, and although relegation is not a likelihood in the current team system, where only so many teams apply for WorldTour status each year while plenty of others are content at the ProTeam level, relegation is possible. When attendance at the Tour de France is not a sure thing, getting money to run a team is a much tougher sell.</p><p>Vaughters pointed to the NFL, which has been the most popular sports league in the United States for years, as a shining example of the success of a different model.</p><p>“What you have in the NFL is an environment where teams are neither promoted nor relegated,” he said. “Of course you have teams win and lose, you have teams that go to the Super Bowl and don’t, teams that win in the playoffs and teams that don’t. But nobody is kicked out of the league.</p><p>“What does that create? That creates investment value and consistent audience. If your team, as an NFL fan, got kicked out of the NFL and had to go play Triple A football or the Canadian Football League or something, you would lose interest. And if there was no salary cap, and so it was only the wealthiest teams that were consistently staying in the first division, or whatever we’re going to call it in the NFL, then only in those major markets that could afford a high payroll would you ever have winning teams.”</p><p>The proposed Super League system would work in a similar way for those big teams guaranteed spots. As Vaughters put it, each organization would get “the same number of chess pieces.”</p><p>For cycling, where teams can’t rely on the various revenue streams (ticket sales and television revenues, for instance) available to other major sports teams, that approach could have an even bigger impact on the viability of those teams.</p><p>“In football there’s actually all these safeguards in place. If your team gets relegated you get basically almost like a payout from all of the television revenue to help boost you back into the first division,” Vaughters said, referencing the system currently in place in the English Premier League. “There are lots of safety nets built into the promotion and relegation built into European football. In cycling there’s nothing. If you fall off the map, you fall off the map.”</p><p>Relegation also predicates promotion, of course, and as football (soccer) fans in the many cities left out of the Super League discussion have pointed out this week, a Super League would have negative consequences for all the rest of those teams. Translated to cycling terms: For ProTeams in the second division, the possibility of promotion is a promising draw. A Super League system in cycling would inherently keep any teams left out of the league from having the same level of exposure.</p><p>For teams like EF, however, it might at least provide firmer ground, particularly if a salary cap was in place. Vaughters sees that as the most important piece of the puzzle, noting that “if you had financial fairness, then you can make an argument that promotion and relegation is fair.” Without that, smaller teams face big risks.</p><p>“In cycling, there are zero salary caps,” Vaughters said. “If you spend the money, you win. We’ve seen this the past couple of years. Ineos, UAE, Jumbo-Visma – you spend you win. It’s a simple equation. It doesn’t take any sort of genius to figure that out.</p><p>“You have the same teams winning over and over again, which slowly pulls the audience numbers, raises them in certain players and lowers them in others, but the overall competitiveness, i.e. diversity of winners, decreases over time. Then you have the possibility of relegation, i.e. you get booted out. Let’s start looking at this from an investor’s perspective.</p><p>“Why would you invest in cycling if you had no assurance that you wouldn’t be in the top league, and that there was an understanding that all the teams had widely varying different payrolls, and then basically he who spends the most wins? If you’re an investor thinking of buying a team, does that seem like a good investment to you?”</p><p>Vaughters emphasized that although team owners might question the value of investment in cycling, at least the value proposition for sponsors in cycling is still a very good one in terms of return on investment in marketing exposure. Either way, Vaughters thinks team owners and sponsors alike would benefit from his proposed changes to the system.</p><p>Of course, nothing is likely to change any time soon, at least for the men’s peloton. The power balance in cycling is just too heavily skewed away from the teams. Vaughters doesn’t see the smaller teams coming together enough to make a change, nor does he see much impetus from other stakeholders in the sport to make changes that could help teams.</p><p>“To the ASO, it’s actually a net benefit if there’s instability amongst the team,” Vaughters said. “To them, that means there’s not a unification of the teams. If the teams are unified, then that actually poses a threat to their revenue sources and their ability to run the sport in the most profitable manner for them. To them, to make sure that the teams are consistently unstable and not unified is a net benefit.</p><p>“The UCI, I don’t know. It’s not an issue that is terribly important to the IOC and I think that their major focus is more on the IOC and the opinion of the IOC of cycling than it is on the professional arm of sport. It’s not that the UCI would say, ‘No, salary caps are a horrible idea.’ They’re not willing to spend the effort to make that happen.”</p><p>Vaughters pointed out that the situation could be a bit different for the women’s side of pro cycling.</p><p>“Women’s cycling – there’s not as many politically entrenched interests, 100-year-old this, 100-year-old that, this is the way it’s always been, bla bla bla – there’s not any 60 million dollar teams,” he said. “Women’s cycling: a strategic reinvent is possible.”</p><p>As far as his men’s WorldTour squad is concerned, though, Vaughters isn’t holding his breath for big structural changes any time soon. He says he is more interested in looking at ways to engage wider audiences of people coming into cycling recreationally as a way to boost the sport’s popularity and, therefore, potential investment.</p><p>At the end of the day, as Vaughters points out, pro sports are an industry within the entertainment sphere, which is an extremely competitive space. That’s why Vaughters often finds himself thinking of ways to boost investment, whatever the likelihood of those ideas coming to fruition may be.</p><p>“If we want to remain competitive, we’re going to require investment,” he said. “We’re going to require ownership groups that are willing to come in and take a risk on investing in a sport as opposed to buying billions of dollars in Google AdSense advertising or whatever. So I always look at it from a perspective of, ‘I would like to invite more investment dollars into sport because I think that’s what keeps it healthy. That’s what keeps the sport of cycling healthy.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"68ac818ea81383f1a6cf839f7736890c3bdbf3226fc02e5cd1124a3122b1e543","category":"Cycling"}