{"title":"Bikes of the Bunch: a personalised Cannondale SuperSix Evo Disc","link":"https://cyclingtips.com/2021/05/bikes-of-the-bunch-a-personalised-cannondale-supersix-evo-disc/","date":1621562724000,"content":"<div><div><p><em>In this <a href=\"https://cyclingtips.com/tag/bikes-of-the-bunch/\" target=\"_blank\">Bikes of the Bunch</a> long-time VeloClub member Jason de Puit shares how his unique and <a href=\"https://cyclingtips.com/2016/07/first-look-review-cannondale-supersix-evo-hi-mod-disc/\" target=\"_blank\">previous-gen Cannondale SuperSix Disc</a> came to be. And like with many personalised projects, the realisation of this bike was a process that took some time. </em></p><hr><p>On the surface a bike is just a bunch of components pulled together. Dig a little and you’ll find that your bike can be a reflection of yourself. I like it when I feel myself expressed through my bike. </p><p>So here’s a story that is mostly about a bike, but also a bit about me.</p><h2>The concept</h2><p>I founded the idea of building a new bike on three pillars. Jealousy, inner turmoil, and some available disposable income.</p><p>I’m somewhat frugal. I find it challenging to treat myself to fancy things unless they provide significant functional benefits. There’s nothing wrong with my seven-year-old S-Works Tarmac SL4 with alloy rims. It’s an amazing bike that I love to ride. Particularly up hills. Long and/or steep ones.</p><p>Despite that, I found myself wanting more. I was jealous of my friends with their fancy new bikes. Most had disc brakes. Some had electronic shifting and several included amazing custom paint. I was even jealous of cyclists I’ve never met. I’d see them riding around Melbourne on their newer, fancier bikes (at least 78% of which are also S-Works Tarmacs).</p><p>So I tried to quieten the “there’s nothing wrong with my current bike” voice and indulge myself a little.</p><p>My criteria were:</p><ul><li>Disc brakes</li><li>“Traditional” geometry including a horizontal top-tube and non-dropped stays</li><li>Internally routed cables</li><li>Something that was at least a little unique and that would make me go “oooh”.</li></ul><h2>The frame</h2><p>The frame was simultaneously the first thing I purchased, and yet, the last decision I made.</p><p>SuperSix (and CAAD12) framesets had always caught my eye. The traditional frame geometry makes me happy. With the release of the aero-focused SuperSix I snapped up an older 2019 model on clearance at the end of that year. </p><p>I was happy knowing I’d bought a top-tier frame at a top-notch price. The potential to add a matching Cannondale Hollowgram Spidering crankset was also a bonus. But it was matte black, the same as my Tarmac, and I knew I wanted to custom paint the frame. I wanted to mix it up and create something less generic.</p><p>Despite all that I had some reservations, and they stuck with me for a long time throughout the build. For starters the frame has a quick-release rear axle – a lowlight in every review I read and a possible source of strange noises. I don’t like strange noises. Plus the cable routing is only partially internal, with external mounts on the down tube. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-13-1340x754.jpg\"><figcaption>The 2019 Cannondale SuperSix Disc was one of the last frames on the market to move to a rear thru-axle.</figcaption></figure><p>The major concern was that I’d succumbed to my frugal brain. Was I settling on a mass-produced off-the-shelf frame that wasn’t really special?</p><p>Those doubts had me in a state of indecision for over a year. By January 2021 I had all the parts required to build the bike. And yet I had WhatsApp messages with mates in that same month where I was still questioning my original frame choice.</p><p>Throughout this time I looked into local Ritchey distributors (after watching Dave Everett’s <a href=\"https://cyclingtips.com/2020/11/an-unconventional-ritchey-logic-disc-review-shoddys-2020-vaccine/\" target=\"_blank\">Ritchey Logic Disc video review</a>). I scoured the internet for reviews of the Cinelli Nemo. I opened the Standert website more times than I’d like to admit. I also considered custom options from both local and international framebuilders.</p><p>Ultimately I can thank Specialized for helping to seal the deal with the launch of the <a href=\"https://cyclingtips.com/2020/10/specialized-s-works-aethos-shuns-aero-embraces-low-weight-and-ride-quality/\">Ae</a><a href=\"https://cyclingtips.com/2020/10/specialized-s-works-aethos-shuns-aero-embraces-low-weight-and-ride-quality/\" target=\"_blank\">t</a><a href=\"https://cyclingtips.com/2020/10/specialized-s-works-aethos-shuns-aero-embraces-low-weight-and-ride-quality/\">hos</a>. I found my eyes (and heart!) lighting up when I saw that bike. Modern touches with a classic look. Lightweight yet smooth. I wanted one. Then I realised I already had one, essentially. Better yet, mine had a proper horizontal top tube. </p><h2>The groupset</h2><p>I was very keen for some of those sweet Hollowgram cranks. I love the design and that they’re rare and specific to Cannondale. But I found it impossible to find the appropriate configuration at a reasonable price. They’re more rare than I anticipated! </p><p>To avoid using the external cable routing I decided on an electronic groupset. I sought quotes for Ultegra and Dura-Ace. My frugal brain struggled with the cost of Dura-Ace. And with Ultegra (mechanical) on my Tarmac, that wasn’t feeling like much of an upgrade.</p><p>I’m a nerd for a living and a happy SRAM user on my CX bike, so I explored eTap. I found wireless appealing from a technical perspective. I also liked the app-based management approach. Searches for “Force eTap AXS” saw me entering some pretty high costs into my bike spreadsheet. I found myself resigned to another bike with Ultegra. Curse you frugal brain! </p><p>This all changed when one of my searches revealed “Cannondale CAAD13 Force eTAP AXS” at Port Melbourne Cycles for a very reasonable price. I formed an idea to buy the CAAD13 and harvest it for parts before selling the frameset, stem and bars. Quick math revealed this to be a very cost-effective path. And it just so happened that a close friend was on the hunt for an alloy frame to replace his stolen Allez. I knew I’d likely be able to move the frameset on.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-15-1340x838.jpg\"><figcaption>Cannondale’s Hollowgram cranks proved a little too hard to find, but the end result is quite nice.</figcaption></figure><p>I struck a deal and suddenly had a complete new bike and a spare SuperSix frame in a box. I was still in turmoil about my frame choice at this point and the CAAD added fuel to the fire. </p><p>While it was sitting around the house I came to appreciate it. I was already a CAAD fan and although it had dropped seat stays, it did tick a lot of my boxes. I didn’t love the colour but I already had plans to paint my next bike. I rode it a few times and found it to be pretty fast and very fun!</p><p>At times I took the SuperSix frame out of the box and left it around the house. I was trying to remember why I liked it and visualise how it would look once complete. </p><p>In the end the weight of the CAAD and the aesthetics of the welds helped me decide. I stripped off all the parts and made my friend Eduard the happy owner of a new frame (he also copped the brunt of my frame-indecision on the regular – sorry!) And I was also the happy owner of a fancy new groupset; fancier than I’d been expecting!</p><h2>Wheels and tyres</h2><p>I was expecting to spend a lot of time figuring out which wheels to buy. I’d never owned carbon wheels before. Moving to disc brakes alleviated my previous concerns about braking performance. I was ready to dive into some heavy research and comparisons.</p><p>Then I bought the CAAD and took the Hollowgram wheels from that. Simple! I love the subtle graphics and appreciate the DT Swiss internals in the hubs. </p><p>The only complication was converting the rear wheel to work with quick-release dropouts. After questioning many people (mostly in the super helpful VeloClub Slack group) and doing a lot of research I identified the end-caps I needed. Yay! They were impossible to buy in Australia. Boo! Fortunately my recently-happy-due-to-a-new-CAAD13 friend had a contact in a bike shop in England. They were able to source and deliver what I needed. Please don’t ask me what that cost.</p><p>I didn’t love the feel of the Vittoria Rubino Pros that came with the CAAD13 so I swapped these out for some Continental GP5000s. The logo (flag) on the tyres bothered me but, on a tip from CyclingTips’ global tech editor James Huang, I sorted this out with a sharpie.</p><h2>Contact points</h2><p>Deciding on the various contact points was straightforward. Thanks to <a href=\"https://cyclingtips.com/2021/02/the-aussie-champs-tt-bike-6000-ti-bar-extensions-waxed-chain-and-a-58t/\" target=\"_blank\">Ken at Adaptive Human Performance</a> I had a very comfortable fit on my Tarmac. I was determined to copy it across to the SuperSix.</p><p>The pedals, saddle, bars and stem are all practically identical. I briefly considered an aero cockpit but decided it didn’t vibe with me, or the bike. I knew the stem was going to be painted so the only challenge was finding some Deda bars with minimal graphics.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-8-1340x754.jpg\"><figcaption>A traditional bar was selected.</figcaption></figure><p>For bar tape it’s difficult to look past <a href=\"https://burgh.cc/\" target=\"_blank\">Burgh</a>. A variety of great designs. Super comfortable, easy to wrap and easy to clean. Also from my home state of Tasmania. </p><h2>The paint</h2><p>I conceptualised the paint job and the amazing crew at <a href=\"https://www.velocraft.com.au/\" target=\"_blank\">Velocraft</a> brought it to life. I wouldn’t call myself creative but I have spent a lot of time on Instagram. My friend <a href=\"https://cyclingtips.com/2020/10/bikes-of-the-bunch-ritte-player-one-ace/\" target=\"_blank\">Kasper Voogt</a> helped me understand the design and painting process. I took note of bikes I appreciated, in whole and in parts. From this I distilled some key elements.</p><p>The basis was a bright coloured fade end-to-end across the frame. A flatter colour would overlay the fade with many small exposed sections to reveal the fade. Including the stem and seat post was an intentional step to make the bike look more integrated. </p><p>The fade colours are loosely based on some of the cracking sunsets we get in Melbourne in autumn and winter. Olive green is one of my favourite colours and a lighter/greyer shade helped the fade to pop. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-6-1340x838.jpg\"><figcaption>The fade that’s seen throughout the bike.</figcaption></figure><p>Ian Michelson from Velocraft helped me turn these ideas into a workable frame design. We experimented with different logos and variations on the number of rings. At one point the design had solid colours inside the forks.</p><p>Once finalised Steve painted it up in a couple of days and the results speak for themselves. I was anxious to see my concepts come to life but the result is amazing! </p><h2>Extras</h2><p>You can’t tell by looking at them but the Arundel Mandible cages have been on my Tarmac for many years. I was happy to carry them over to a new bike. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-14-1340x754.jpg\"><figcaption>Old cages that still look like new.</figcaption></figure><p>I saw the <a href=\"https://www.f3cycling.com/\">F3 Cycling</a> computer mount on Instagram a week before the build. I was pleasantly surprised to find an Aussie distributor who could have one sent to me in a couple of days. The ability to add a line of colour was a nice touch and a good match for the frame.</p><h2>The build</h2><p>I’d had Melbourne’s <a href=\"https://saintcloud.com.au/\">Saint Cloud</a> in mind for the build from very early in the process. They have a good relationship with Adaptive Human Performance. After my initial bike fit Saint Cloud helped with my Tarmac rebuild.</p><p>I knew my bike would be in safe hands. I handed everything over along with my fit data and a long email of considerations for the build. The build was completed in just a day and Nick from Saint Cloud then took photos of it for me. </p><h2>The ride</h2><p>At the time of writing I’ve ridden just over 200 km on the new bike. I’m starting to fall in love with it. </p><p>It was impossible not to draw comparisons to the Tarmac, which is a little lighter but also harsher. The 28 mm tyres on the SuperSix add a level of comfort that my brain interpreted as being slower. </p><p>The more I ride it the more I realise that isn’t true. The SuperSix feels slightly less agile than the Tarmac but it definitely isn’t slower. I’m just less exposed to the fight the bike has with the road to give me that speed. </p><p>Braking performance is phenomenal, as you’d expect. I’m loving the electronic shifting while being wary of front-derailleur shifts. SRAM seems to wait half a pedal stroke between the button(s) being pressed and executing the shift.</p><p>I’ve tackled some climbs and the bike is very capable! On the flat the bike rolls at speed along with a fun whoosh from the wheels. I’m looking forward to getting more comfortable and ripping into some descents.</p><p>I’m enjoying the ride and the bike is inspiring me to get out more. And that’s what really matters.</p><h2>Specs</h2><ul><li><strong>Frame:</strong> Cannondale SuperSix EVO, BallisTec Hi-MOD Carbon</li><li><strong>Fork:</strong> SuperSix EVO, SPEED SAVE, BallisTec Hi-MOD full Carbo</li><li><strong>Headset:</strong> SuperSix EVO,</li><li><strong>Wheelset:</strong> HollowGram 45 KNØT, Carbon with HollowGram KNØT hubs (DT Swiss internals)</li><li><strong>Shifters:</strong> SRAM Force eTap AXS</li><li><strong>Crankset:</strong> SRAM Force eTap AXS</li><li><strong>Bottom bracket:</strong> Wheels Manufacturing PF30A Outboard SRAM DUB</li><li><strong>Front derailleur:</strong> SRAM Force eTap AXS</li><li><strong>Rear derailleur:</strong> SRAM Force eTap AXS</li><li><strong>Cassette:</strong> SRAM Force eTap AXS 10-33 12-speed</li><li><strong>Chain:</strong> SRAM Force eTap AXS</li><li><strong>Brakes:</strong> SRAM Force eTap AXS, 160/160 mm Centerlock rotors</li><li><strong>Tyres:</strong> Continental GP5000 28 mm</li><li><strong>Handlebar:</strong> Deda Zero 1 RHM 42 cm</li><li><strong>Stem:</strong> Deda Zero 1 120 mm</li><li><strong>Seatpost:</strong> Cannondale SAVE Carbon </li><li><strong>Cages:</strong> Arundel Mandible</li><li><strong>Bar tape:</strong> Burgh Matter Stealth</li><li><strong>Saddle:</strong> Pro Stealth 142 mm</li><li><strong>Pedals:</strong> Look Keo 2 Max Carbon</li></ul><h2>Gallery</h2><figure><ul><div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-1-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-2-1340x838.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-3-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-4-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-5-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-6-1340x838.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-7-1340x838.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-9-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-10-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-11-1340x754.jpg\"></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Bikes-of-the-bunch-2019-Cannondale-Supersix-Jason-de-Puit-12-1340x754.jpg\"></figure></li></div></div></ul></figure></div></div>","author":"Jason de Puit","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"68ec10caef44fe25482dc8ef48cfe1752dbcdb873c161bab6e500e8b949537e6","category":"Cycling"}