{"title":"[ลือ] Nintendo Switch รุ่นใหม่ ใช้จอ OLED 7 นิ้วของ Samsung เตรียมส่งมอบจอกรกฎาคมนี้","link":"https://www.blognone.com/node/121512","date":1614830094000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/nintendo.png?itok=vmWZ1aub\"></p><div itemprop=\"description\"><p>Bloomberg รายงานข้อมูลเกี่ยวกับ Nintendo Switch รุ่นใหม่ที่น่าจะวางจำหน่ายภายในปีนี้ โดยอ้างแหล่งข่าวไม่เปิดเผยตัวตนที่เกี่ยวข้อง ว่าจะมาพร้อมกับหน้าจอ OLED ของ Samsung ขนาด 7 นิ้ว (จอรุ่นปัจจุบันเป็น LCD 6.2 นิ้ว) และตัวเครื่องจะมีขนาดเท่าเดิม แปลว่าอาจใช้การลดขนาดขอบจอแทน</p><p>หน้าจอ OLED จะประหยัดพลังงานมากขึ้น แปลว่าแบตเตอรี่ของ Switch รุ่นใหม่อาจอยู่ได้นานขึ้น มีคอนทราสต์สูงขึ้น อัตราการตอบสนองดีขึ้น ความละเอียด 720p แต่เมื่อต่อเข้าทีวี จะแสดงภาพได้ถึง 4K โดยยังไม่ระบุเทคนิคที่ใช้ แต่คาดว่าน่าจะเป็นการอัพสเกล ผนวกกับเทคนิค DLSS ของ Nvidia</p><p>Samsung เตรียมเริ่มผลิตหน้าจอให้ Nintendo Switch รุ่นใหม่ในเดือนมิถุนายน ตั้งเป้าไว้ที่เดือนละเกือบหนึ่งล้านยูนิต ก่อนจะเริ่มส่งมอบและประกอบภายในเดือนกรกฎาคมนี้ Bloomberg ติดต่อไปสอบถามทั้ง Samsung และ Nintendo แต่ไม่มีบริษัทไหนยอมให้ความเห็น</p><p>จากไทม์ไลน์ มีความเป็นไปได้ที่เราจะเห็น Nintendo Switch รุ่นใหม่วางจำหน่ายภายในปีนี้ แม้ Shuntaro Furukawa ประธาน Nintendo คนปัจจุบันจะเคยกล่าวไว้เมื่อเดือนที่แล้ว ว่า<a href=\"https://www.blognone.com/node/120951\">บริษัทยังไม่มีแผนเปิดตัว Nintendo Switch รุ่นใหม่</a> แต่ก็เป็นเรื่องปกติ เมื่อดูจากความพยายามปฏิเสธเพื่อปกปิดความลับของ Nintendo ในอดีตที่ผ่านๆ มา</p><p><img src=\"https://www.bloomberg.com/news/articles/2021-03-04/nintendo-plans-switch-model-with-bigger-samsung-oled-display\" alt=\"\"></p><p><img src=\"https://www.blognone.com/sites/default/files/externals/22e16726552947eb1fd18af93caf5b3b.jpg\" alt=\"\"></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"69e0ce285b17b0e56666cec36aca3237c74943c0c0e08b04c2b97311833145e3","category":"Thai"}