{"title":"Here’s what’s going to happen (we think) at the Tour de France","link":"https://cyclingtips.com/2021/06/heres-whats-going-to-happen-we-think-at-the-tour-de-france/","date":1624406959000,"content":"<div><p></p><h4>Tadej Pogacar and Primoz Roglic on stage 9 of the 2020 Tour de France.</h4><p></p><div><p>We don’t have long to wait now.</p><p>The <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">2021 Tour de France</a> is just days away from starting, and that means that many of the biggest teams in the world have already <a href=\"https://cyclingtips.com/startlist/?id=49507\" target=\"_blank\">announced their lineups</a> and are making their final preparations ahead of the Grand Départ.</p><p>With the cast of characters for the three-week racing saga now mostly set, it feels like the perfect time to make some bold predictions about what could go down at the race.</p><h2>What’s going to happen</h2><p>The way I see it, the ingredients are in place for a worthy edition of the sport’s biggest event.</p><p><a href=\"https://cyclingtips.com/2021/06/preview-your-stage-by-stage-breakdown-of-the-2021-tour-de-france-course/\">The route</a>, more traditional than last year, features a nice variety of challenges across three weeks. The GC battle is shaping up to be a pretty intriguing affair, with no overwhelming favorite but two top contenders that should be closely matched: Tadej Pogačar (UAE-Team Emirates) and Primož Roglič (Jumbo-Visma). There’s also a <a href=\"https://cyclingtips.com/2021/06/opinion-the-more-ineos-leaders-at-the-tour-the-better/\" target=\"_blank\">superbly strong Ineos Grenadiers squad</a> that has been vocal about its intentions to make things interesting, plus a few other big names with big hopes as well. The battles for stages should feature plenty of intrigue too, with a star-studded selection of sprinters and puncheurs in attendance.</p><p>It won’t be easy to foresee which of those big names will ride to glory this June and July in France – but that’s not going to stop me from telling you how I see things playing out at the upcoming Tour …</p><h3>Caleb Ewan will rule the sprints</h3><p>A month ago, Sam Bennett (Deceuninck-QuickStep) appeared on track to add more Tour de France stage wins to his palmares, and potentially make another run at green. As of Monday, however, things have changed: Bennett will not be at the 2021 Tour, leaving an opening atop the sprinting pecking order.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/ewan-1340x893.jpg\"><figcaption>Caleb Ewan after winning stage 7 of the Giro d’Italia.</figcaption></figure><p>With Bennett out, Caleb Ewan (Lotto-Soudal) should rule the proverbial roost in the fast finishes in France. Potential sprint rivals like Wout van Aert (Jumbo-Visma), Tim Merlier (Alpecin-Fenix), Peter Sagan (Bora-Hansgrohe), Arnaud Démare (Groupama-FDJ), Mark Cavendish (Deceuninck-QuickStep), and Michael Matthews (BikeExchange) won’t make things easy, but at his best, Ewan is on another level compared to this field.</p><p>There are a whopping eight potential sprint stages on the docket at this year’s Tour, which should give Ewan a chance to add several victories to his career count of five. For me, the big question is whether he can turn what I’d expect to be three or more stage wins into a bona fide run at the green jersey.</p><p>If you’re curious, Ewan is currently a slight favorite for green with the bookies, with Sagan and Démare right there as well. I think the 26-year-old Australian could do it this year.</p><p>For a long time, Sagan’s versatility allowed him to rack up points with strong finishes in the bunch kicks <em>and</em> the hillier stages where the pure sprinters wouldn’t factor, but there are so many sprint stages this year, and riders with Sagan’s versatility will have so much competition among themselves on the intermediate days (more on that in a moment) that an in-form Ewan could end up in green in Paris.</p><h3>The Classics stars will bring the fireworks</h3><p>Speaking of those hillier stages and the competition for wins, I can’t remember the last time the field has featured so many riders capable of putting on a show after a tough day on up-and-down roads.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/trio-1340x853.jpg\"><figcaption>Julian Alaphilippe beats Mathieu van der Poel and Wout van Aert on stage 2 of Tirreno-Adriatico.</figcaption></figure><p>I expect Tour debutant Mathieu van der Poel (Alpecin-Fenix) to shine in his first appearance at the race, coming off of a fine Tour de Suisse showing, but he’ll have his hands full with Sagan, Van Aert, Matthews, and Julian Alaphilippe (Deceuninck-QuickStep), to name only a few of the versatile stagehunters on the start list.</p><p>With two hilly stages to kick off the race, one of the aforementioned riders could spend some time in yellow before the race takes on its first serious climbs on stage 8, and even after that there are a few days with the potential for echelons or punchy finishes that will suit Classics stars.</p><h3>At least one big contender will see his GC hopes crumble long before the high mountains</h3><p>On the one hand, the Tour route is taking a traditional approach by waiting just over a week to throw the first serious mountain climbs at the peloton this year. On the other hand, the Tour route is a taking an unconventional approach by throwing not one but two hilly stages at the peloton to start off the race, with more to follow.</p><p>It’s not just the lumpy profiles either; the race is getting underway in the wonderfully green, historically rich Brittany region in northwestern France – where the weather can be treacherous. We’re still a bit too far out for reliable weather predictions but a healthy dose of wind and rain are currently in the longer-term forecast for the area.</p><p>The Pyrenees, much later in the race, should decide things in the GC battle at the 2021 Tour, but the conditions are in place for heartbreak in the opening week. Whatever happens, here’s hoping it won’t be as depressing as watching all those crashes on the rain-slicked opening stage of last year’s Tour.</p><h3>The Ineos Grenadiers won’t be quite as aggressive as they need to be to win the race</h3><p>Going back some time now, Dave Brailsford has been talking about a new approach to racing for the Ineos Grenadiers, who had won seven of eight Tours de France before last year’s race. And to his credit, the team did a great job of keeping things interesting at last year’s Tour even after Egan Bernal abandoned. Bernal himself rode an aggressive Giro d’Italia en route to the pink jersey this year.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/dauphine1-1340x881.jpg\"><figcaption>Geraint Thomas, Richie Porte, and Tao Geoghegan Hart at the Critérium du Dauphiné.</figcaption></figure><p>That said, I don’t see the Ineos Grenadiers being able to overthrow the Slovenian hegemony at this Tour with anything other than an <a href=\"https://cyclingtips.com/2021/06/opinion-the-more-ineos-leaders-at-the-tour-the-better/\" target=\"_blank\">all-out assault</a> in the high mountains – and I’m not sure that’s what we’ll get. It’s much easier to go on the attack when you’re either out of the GC battle altogether, as the team was last year, or far stronger than the competition, as Bernal was when he left everyone behind on stage 16 of the Giro, than when you’re more in the thick of things.</p><p>Basically, I expect Roglič and Pogačar to be too strong for a conservative Ineos Grenadiers team to beat them, and I don’t really expect Tao Geoghegan Hart, Richie Porte, Richard Carapaz, and Geraint Thomas to all be willing enough to lose that they’ll take the gambles necessary to win.</p><p>We have yet to see the Ineos Grenadiers try anything approaching a sustained, many-pronged attack in the Grand Tours. I’d love to be proven wrong on this one, but I don’t think Brailsford’s much-hyped new approach will be quite aggressive enough to pull off the victory.</p><h3>Primoz Roglič will take his first Tour de France title</h3><p>I’ve saved the big prediction for last. Before I go any further, I’ll point out here that I don’t often buck the bookies when it comes to naming my overall favorite. Tadej Pogačar currently has the shortest odds to win the 2021 Tour (he’s at about 17/10 right now depending on the oddsmaker), but I’m tapping Primož Roglič as my personal Tour favorite anyway.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/roglic_pogacar-1340x893.jpg\"><figcaption>Primož Roglič and Tadej Pogačar at the Itzulia Basque Country.</figcaption></figure><p>For starters, I definitely see Roglič and Pogačar as the two top favorites for yellow, with Thomas and Carapaz behind them and then a host of other more fringe contenders in the running. And Pogačar fans in particular have plenty of reasons to be confident in his chances of repeating, considering how impressive he has looked in 2021. He has won all but one stage race that he has started this year, and although it was Roglic who beat him there at the Itzulia Basque Country, Pogačar did look mighty strong riding in support of Brandon McNulty before switching gears and nabbing a spot on the podium.</p><p>What’s more, Roglič has not raced since April – and yes, that does make me nervous to stick my byline on a piece picking him as the race winner. But I’m doing it, just the same.</p><p>Here’s the thing. It’s really, really hard to defend a Tour title. Probably even more so when you are only 22 years old. Pogačar is an incredible climber and time trialist, but he was able to fly somewhat under the radar last year while all of us were focused on the battle between Jumbo-Visma and Ineos.</p><p>This year, his rivals will be watching his every move, and I expect him to be isolated more than he would like considering how strong Jumbo-Visma and the Ineos Grenadiers are compared to the solid but not spectacular UAE-Team Emirates lineup. Pogačar will need to be at his best basically throughout the race, and what’s more, I can’t see him performing quite as incredibly in the time trials against Roglič as he did in last year’s dramatic stage 20.</p><p>I see the Slovenian duo as being relatively evenly matched on both the climbs and against the clock, but when all is said and done, I expect Roglič’s huge engine, strong team, and experience to afford him multiple opportunities to put Pogačar in the rearview mirror and secure the win.</p><p>Only time will tell if I’m right on this, obviously, but here’s hoping that whatever happens, we get a thrilling battle for the yellow jersey – and the green jersey, and the polka dot jersey, and the white jersey, and all 21 stages.</p><p>All the action gets underway on Saturday …</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6a14cfeb71fd5239a3e7b4415b65f1a4118ad76f4eda03dd03a2e1ca06cec781","category":"Cycling"}