{"title":"North Dakota lawmakers jump into Apple/Epic fight with new app store bill","link":"https://arstechnica.com/?p=1742650","date":1613504902000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>(don't) take a bite —</h4><h2 itemprop=\"description\">ND bill would require Apple, Google to let you side-load apps and avoid the 30% cut.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1041998076-800x534.jpg\" alt=\"A wide lawn surrounds a 21-story Art Deco tower.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1041998076.jpg\" data-height=\"5165\" data-width=\"7744\">Enlarge</a> <span>/</span> North Dakota's capitol, in Bismarck, features convenient floral labeling.</p></figcaption></figure><p>The North Dakota state Senate is jumping into a simmering feud between Apple and iOS software developers with a bill that would make it illegal for device makers to require to use their app stores and payment systems.</p><p>The bill (<a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/21-1044-03000.pdf\">PDF</a>) has two main prongs. First, it would make it unlawful for companies such as Google and Apple to make their app stores the \"exclusive means\" of distributing apps on their platforms. Second, it would prohibit those providers from requiring third parties to use their digital transaction or in-app payment systems in their applications.</p><p>The proposed law applies to app stores for which gross sales receipts <em>to North Dakota residents</em> exceed $10 million in a calendar year. It applies to any \"general-purpose hardware,\" including tablets and smartphones, but it explicitly excludes \"special-purpose digital application distribution platforms\" such as gaming consoles, music players, and \"other special-purpose devices connected to the internet.\" Thread that needle, and you're left with a pretty firm arrow pointing directly at Google's and Apple's mobile app platforms. (It could also apply to the Mac OS and Windows app stores for laptop and desktop computers, but those platforms are already less restrictive.)</p><p>\"The purpose of the bill is to level the playing field for app developers in North Dakota and protect customers from devastating, monopolistic fees imposed by big tech companies,\" Republican state Sen. Kyle Davison said to local reporters when he introduced the bill, <a href=\"https://bismarcktribune.com/news/local/govt-and-politics/north-dakota-senate-bill-targets-monopolistic-app-stores/article_dc491c88-97e0-54cd-beb2-5a26044cb97c.html\">The Bismarck Tribune</a> reports.</p><h2>The targets</h2><p>Google does permit users to go around the built-in Android app store to side-load apps, which would probably put it in the clear as far as that part of the bill goes. Apple, however, <a href=\"https://arstechnica.com/tech-policy/2020/10/house-amazon-facebook-apple-google-have-monopoly-power-should-be-split/\">infamously does not</a>, and it is facing antitrust complaints about that restriction from the makers of several apps including <a href=\"https://arstechnica.com/tech-policy/2020/07/telegram-files-eu-antitrust-complaint-against-apples-app-store/\">Telegram</a>.</p><p>Even more under threat, however, is the 30 percent cut of sales that Apple and Google make from requiring apps on their respective platforms to use their own payment platforms. ProtonMail's founder and CEO last year <a href=\"https://arstechnica.com/tech-policy/2020/08/protonmail-founder-apple-uses-monopoly-to-hold-all-of-us-hostage/\">called Apple's cut</a> \"virtually indistinguishable from a protection racket.\" ProtonMail in this is in line with several other developers, such as <a href=\"https://arstechnica.com/tech-policy/2019/03/apples-in-app-purchase-rules-could-violate-european-competition-law/\">Spotify</a>, who have publicly complained that the fee amounts to a tax on non-Apple software that makes it harder to compete against Apple-native apps, because they either have to take a 30 percent hit to their revenue or pass the cost along to consumers and look more expensive in comparison.</p><p>If you're thinking this sounds familiar, you're right. The proposal is closely bound to the heated fight between <a href=\"https://arstechnica.com/series/epic-vs-apple-google/\">Epic and Apple</a> playing out right now in federal court.</p><h2>All of this has happened <strike>before</strike> right now...</h2><p>Back in August, Epic Games, maker of <em><a href=\"https://arstechnica.com/tag/fortnite/\">Fortnite</a></em>, <a href=\"https://arstechnica.com/tech-policy/2020/08/epic-gives-fortnite-players-discounts-for-skirting-apple-google-fees/\">picked a fight with Apple and Google</a> by launching an alternative payment system for in-app purchases inside of the game. Apple booted it from the iOS app store within hours, as predicted, and Epic immediately filed an antitrust suit against the company in federal court. That case is still <a href=\"https://arstechnica.com/gaming/2020/11/judge-dismisses-apples-theft-claims-in-epic-games-lawsuit/\">very much in progress</a> at the moment.</p><p>Last fall, in the midst of this dispute, Epic brought in 12 other companies to <a href=\"https://arstechnica.com/gadgets/2020/09/epic-spotify-and-others-take-on-apple-with-coalition-for-app-fairness/\">launch a lobbying group</a>, the Coalition for App Fairness, to fight back against Apple. Spotify, Bandcamp, and Protonmail, all of whom publicly took Apple to task for its App Store policies, were among the founders, alongside Epic; the group now has <a href=\"https://appfairness.org/members/\">more than 45</a> member businesses.</p><p>According to the <a href=\"https://www.nytimes.com/2021/02/14/technology/north-dakota-tech-apps.html\">New York Times</a>, the lobbyist who proposed the draft legislation to the state senator who sponsored it was working on behalf of both Epic Games and the Coalition.</p><p>North Dakota may be just one low-population state (it has fewer than 1 million residents), but it's not the only state where legislators are looking at taking action against the big international tech firms on their own. Arizona also has an <a href=\"https://legiscan.com/AZ/text/SB1642/2021\">extremely similar bill</a> under consideration in its state legislature at the moment.</p><p>In the absence of federal regulation states are acting on other facets of the digital economy, too. Virginia last week <a href=\"https://arstechnica.com/tech-policy/2021/02/virginia-is-about-to-get-a-major-california-style-data-privacy-law/\">became the second state</a>, after California, to pass a comprehensive digital privacy law, and Maryland last week became the first in the nation to <a href=\"https://arstechnica.com/tech-policy/2021/02/maryland-becomes-first-state-in-the-nation-to-tax-digital-advertising/\">impose a tax</a> on digital advertising revenue.</p></div></div>","author":"Kate Cox","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6b1a52dba17c418b19fcdea4786eb9c94684ff1a7b4bc7b4d737c236a7ca9bdd","category":"Tech"}