{"title":"Study finds 3-ft distancing in schools is enough—but debate is far from over","link":"https://arstechnica.com/?p=1750371","date":1616000821000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Distancing debate —</h4><h2 itemprop=\"description\">New study had a firm conclusion on 3 feet, but rather shaky data.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1267680343-800x553.jpeg\" alt=\"Spring Township, PA - August 21: A first grade classroom where the desks are spaced out for social distancing. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1267680343.jpeg\" data-height=\"3017\" data-width=\"4365\">Enlarge</a> <span>/</span> Spring Township, PA - August 21: A first grade classroom where the desks are spaced out for social distancing.</p></figcaption></figure><p>The most sensitive and heated topic of the entire pandemic is—without a doubt—the welfare of our children. How can we best protect them from this devastating virus? What role do they play in spreading it? How can we even come close to meeting all their health, developmental, educational, and social needs as we try to navigate our topsy-turvy reality?</p><p>The path to daycare and school might as well be rerouted through <a href=\"https://arstechnica.com/science/2020/08/opening-schools-in-a-pandemic-the-reasons-for-and-against/\">a minefield</a>. And the hazards don’t end when you reach the front doors. This nightmare has only been exacerbated by media reports of single studies that yanked parents, educators, and caretakers from one extreme to the other: Don’t worry, children are completely unaffected by the virus and don’t spread it! No, wait, they’re actually superspreaders, who can develop a deadly multisystem inflammatory syndrome!</p><p>More than a year into the pandemic, it’s very clear that the inflammatory syndrome (MIS-C) is rare. And although children can certainly catch and spread the virus, mounting studies continue to find that children generally have less severe disease than adults. Also, a consensus has emerged that schools do not tend to be hotbeds of virus transmission. While having schools open has been linked to higher community spread, studies have found <a href=\"https://arstechnica.com/science/2021/01/basic-pandemic-safety-limits-spread-in-schools/\">basic precautions can be effective at limiting spread within schools</a>.</p><p>But this last point has only opened up new controversies about which precautions schools should take when they have in-person learning. One of the thorniest particulars in this discussion is whether children should be spaced three feet apart or six feet apart in schools. At six feet, children <em>may</em> be safer. But school classrooms were not designed to give each child such a wide berth. Instituting six-feet policies means schools can accommodate few students, and in-classroom learning will remain dramatically altered. On the other hand, three-feet distancing is a lot easier to adjust for. But it <em>may</em> increase the risk of kids catching and spreading the virus to their teachers, school staff, and families back home.</p><h2>Distant debate</h2><p>Many health agencies, experts, and the US Centers for Disease Control and Prevention have so far recommended the six-feet spacing—for schools and for nearly all other settings. In making the recommendation, agencies cite decades of research and understanding of how respiratory pathogens, like the pandemic coronavirus, spread. Although six feet is not a magic distance at which risk from respiratory viruses falls off a cliff, it has become a routine threshold at which the risk is considered reduced <em>enough.</em></p><p>But not everyone toes the six-feet line. The World Health Organization and other experts say that only about three feet of distancing reduces risk <em>enough</em>. <a href=\"https://www.who.int/news-room/q-a-detail/coronavirus-disease-covid-19-schools\">The WHO’s guidance to schools</a> recommends “physical distancing of at least 1 meter (3.3 feet) between individuals, including spacing of desks.” In explaining its recommendation, the WHO often cites <a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)31142-9/fulltext\">a literature review published in The Lancet in June 2020</a>, which the United Nations health agency itself funded.</p><p>The review scraped together data from 172 studies looking at transmission of coronaviruses, such as SARS-CoV-2, SARS, and others, as well as the effectiveness of different mitigation strategies, such as distancing and masking. Without a doubt, the data suggested that physical distancing is effective at reducing transmission. However, the different studies in the review evaluated different distances, making it difficult to directly compare the risk levels of one meter versus two. For the most part, the review authors merely found that distancing was effective, and it seemed that more distance was better.</p><p>“We found evidence of moderate certainty that current policies of at least 1 m [meter] physical distancing are probably associated with a large reduction in infection, and that distances of 2 m might be more effective,” the authors concluded.</p><p>While the review was enough to convince the WHO that it could safely recommend <em>at least </em>one meter of distancing in its guidance, it has done little to end the three-vs-six-feet school debate.</p><h2>Fresh data</h2><p>Since that June review, there seemed to be little scientific movement on the issue. But that changed last week with a <a href=\"https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab230/6167856\">study published in the journal Clinical Infectious Diseases</a>, which concluded:</p><blockquote><p>Increasing physical distancing requirements from 3 to 6 feet in school settings is not associated with a reduction in SARS-CoV-2 cases among students or staff, provided other mitigation measures, such as universal masking, are implemented.</p></blockquote><p>The study was observational in nature, comparing rates of coronavirus cases in students and staff that attended in-person learning at Massachusetts Public Schools between September 24, 2020 and January 27, 2021. Of the 242 schools included in the primary analysis, 194 had policies for six-feet distancing, while the remaining 48 had three-feet distancing policies. Nearly 100 percent of the schools had universal mask policies. In the end, the rates of cases between the schools appeared statistically indistinguishable.</p><p>The study immediately made waves. In an interview this past Sunday, CNN anchor Jake Tapper asked top infectious disease expert Anthony Fauci, “Does this study suggest to you that three feet is good enough?”</p><p>Fauci responded, “It does indeed.”</p><p>But a closer look at the actual data in the study provides a much murkier answer. The study had many noteworthy limitations and the data is simply too noisy to draw any clear conclusions—despite the very clear conclusion the authors wrote. The authors found no significant difference between three-feet and six-feet distancing, but the uncertainty in the numbers was simply too wide to assess differences.</p><p>For instance, one of the authors' analyses—which accounted for levels of community spread and school district demographics—found that the rate of coronavirus cases in students attending schools with six-feet policies was 21 percent lower than that of schools with three-feet policies. But that estimate was considered not significant and had a notably large confidence interval (which provides the range of plausible estimates based on the raw data). The confidence interval for that 21 percent estimate ranged from -47 percent to 18 percent. That means that the six-feet of distancing could have decreased case rates as much as 47 percent compared with three-feet—which most parents and school staff would probably consider significant. But confusingly, six-feet distancing could have also <em>increased</em> case rates by as much as 18 percent.</p><p>The other calculations weren’t much better. Looking at case rates in school staff, the authors found rates were about 9 percent lower in schools with 6-feet policies, again adjusting for levels of community spread and demographics. But the confidence interval also spanned a wide range, from -33 percent to 25 percent, meaning that the 6-feet distancing could have plausibly reduced case rates in staff by 33 percent or increased them by 25 percent.</p><h2>More limits</h2><p>And these large ranges are added to many other complicating limitations. The study wasn’t able to include contact tracing data, so although the counted cases were among staff and students who recently attended in-person school, there’s no way to know how many of their infections happened while they were at school. Also, children tend to have asymptomatic or mild infections, and it’s not clear how many infections in students may have been missed. Notably, case rates in school staff closely tracked with case rates in the community, while student case rates tended to be much lower than both.</p><p>There’s more. The simple classifications of 6-feet vs 3-feet school policies are a little fuzzy. For instance, the study noted that “Districts that allowed ≥3 feet of physical distancing in their full re-opening plan but opened in a hybrid learning model with requirements of ≥6 feet in the hybrid model, were classified as requiring ≥6 feet of physical distancing.” The study also didn’t assess implementation of distancing, only official policies as written. Some schools opened with very low attendance—only five percent attendance was required to be included in the study. With so few students, written distancing policies may have been moot. For schools with higher attendance, 6-feet policies may have had lower compliance.</p><p>Lastly, the study also didn’t include detailed data on school closures and quarantine policies, which also may skew in-school transmission. “It is possible that districts with lower distancing requirements closed more frequently, or required more quarantines, due to how SARS-CoV-2 exposures are defined,” the authors note.</p><p>Overall, it’s difficult to make any firm conclusions from this study, and the debate over three-feet vs six-feet is likely to continue. In a press briefing Monday, CDC Director Rochelle Walensky was more equivocal about the study than Fauci.</p><p>“We are looking at these data carefully,” she said, noting that the agency is acutely aware of the distancing debate and is constantly reviewing the data. “The question actually prompted more studies to be done, so we know more are forthcoming. We're taking all of those data carefully and revisiting our guidances in that context.”</p></div></div></div>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6b8e68cccfd36ca28f8a96fb6b387dfc9c7406644c1d18da9a01a17ed86d98e6","category":"Tech"}