{"title":"State Of GDPR In 2021: Key Updates And What They Mean","link":"https://smashingmagazine.com/2021/02/state-gdpr-2021-key-updates/","date":1613998800000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"article__content\"><p><section aria-label=\"quick summary\">As digital practitioners, GDPR has impacted every facet of our professional and personal lives. Whether you’re addicted to Instagram, message your family on WhatsApp, buy products from Etsy or Google information, no one has escaped the rules that were introduced in 2018.</section></p><p>The EU’s directives have impacted virtually every digital professional as products and services are designed with GDPR in mind, regardless of whether you’re a web design company in Wisconsin or a marketer in Malta. The far-reaching <strong>implications of GDPR</strong> don’t just impact how data should be processed, how products should be built and how data is transferred securely within and between organisations. It defines international data transfer agreements like that between Europe and America.</p><p><a href=\"https://www.theguardian.com/technology/2010/oct/24/my-bright-idea-kevin-kelly\">Kevin Kelly</a>, one of the world’s brightest digital futurists, claims that ‘Technology is as great a force as nature’. What he means by that is that user data and information technology is causing one of the most profound periods in human history since the invention of language. Just look at what is happening as governments and the tech multinationals grapple to control the Internet.</p><p>Last week alone, as the Australian government moved to force platform owners to pay publishers for the content that’s shared on their platform, Facebook decided to <a href=\"https://www.wired.co.uk/article/facebook-australia-rupert-murdoch\">block news to Australian users</a> with a huge uproar from the Australian government.</p><p>And that’s in addition to previous controversies (the organisation of the <a href=\"https://www.cnbc.com/2021/01/11/sandberg-says-us-capitol-riot-was-not-organized-on-facebook.html\">U.S. Capitol riot</a>, the <a href=\"https://www.wired.com/story/cambridge-analytica-facebook-privacy-awakening/\">Cambridge Analytica scandal</a>) at the intersection where government and technology meet.</p><p>In this article, we’ll look at how GDPR has evolved since 2018. We’ll run through some updates from the EU, some key developments, and where GDPR is likely to evolve. We’ll explore <strong>what that means for us</strong>, as designers and developers. And we’ll look at what that means for companies both inside and outside the EU.</p><p>In the next article, we’ll focus on cookie consent and the paradox where marketers are heavily reliant on Google Analytics cookie data but need to comply with regulations. And then we’ll take a deep dive into first-party ad tracking as we start to see moves away from third-party cookies.</p><ul><li><strong>Part 1: GDPR, Key Updates And What They Mean</strong></li><li><a href=\"https://www.smashingmagazine.com/2021/03/state-gdpr-2021-cookie-consent-designers-developers/\">Part 2: Cookie Consent For Designers And Developers</a></li></ul><p>Let’s start by reminding ourselves what GDPR is. The GDPR became law within the EU on 25 May 2018. It’s based on 7 key <a href=\"https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/principles/\">principles</a>:</p><ol><li><strong>Lawfulness, fairness and transparency</strong><br>You must process data so that people understand what, how, and why you’re processing their data.</li><li><strong>Purpose limitation</strong><br>You should only collect data for clear, specified, and legitimate purposes. You can’t then process it in ways that are incompatible with your original purposes.</li><li><strong>Data minimization</strong><br>You should only collect the data you need.</li><li><strong>Accuracy</strong><br>Your data must be accurate and kept up to date. Inaccurate data should be erased or corrected.</li><li><strong>Storage limitation</strong><br>If data can be linked to individuals, you can only keep it for as long as you need to carry out the purposes you specified. (Caveats for scientific, statistical, or historical research use.)</li><li><strong>Integrity and confidentiality (i.e. security)</strong><br>You must ensure the personal data you hold is processed securely. You must protect it from unauthorized or unlawful processing and against accidental loss, destruction, or damage.</li><li><strong>Accountability</strong><br>You are now responsible for the data you hold and should be able to demonstrate your compliance with the GDPR.</li></ol><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bcf6e148-b2f3-48d5-b752-ad8a541841cc/gdpr-update-gdpr-diagram.jpg\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"539\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bcf6e148-b2f3-48d5-b752-ad8a541841cc/gdpr-update-gdpr-diagram.jpg 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bcf6e148-b2f3-48d5-b752-ad8a541841cc/gdpr-update-gdpr-diagram.jpg 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bcf6e148-b2f3-48d5-b752-ad8a541841cc/gdpr-update-gdpr-diagram.jpg 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bcf6e148-b2f3-48d5-b752-ad8a541841cc/gdpr-update-gdpr-diagram.jpg 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bcf6e148-b2f3-48d5-b752-ad8a541841cc/gdpr-update-gdpr-diagram.jpg 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bcf6e148-b2f3-48d5-b752-ad8a541841cc/gdpr-update-gdpr-diagram.jpg\" sizes=\"100vw\" alt=\"Diagram showing the seven principles of GDPR: lawfulness, integrity, storage and purpose limitations, data minimisation and accuracy, and accountability - overlaid with transparency, privacy and controls\"></a><figcaption>GDPR’s principles are based on transparency, privacy and user control. (Image credit: <a href=\"https://www.cyber-duck.co.uk/what-we-do/digital-optimisation/gdpr-compliance\">Cyber-Duck</a>) (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bcf6e148-b2f3-48d5-b752-ad8a541841cc/gdpr-update-gdpr-diagram.jpg\">Large preview</a>)</figcaption></figure><h4 id=\"some-definitions\">Some Definitions</h4><ul><li><strong>CJEU</strong><br><a href=\"https://europa.eu/european-union/about-eu/institutions-bodies/court-justice_en\">Court of Justice of the European Union</a>. This court’s decisions clarify EU laws like GDPR.</li><li><strong>DPAs</strong><br>National Data Protection Authorities. Each EU country has one. GDPR is enforced, and fines are issued, at the national level by these bodies. The UK equivalent is the Information Commissioner’s Office (<a href=\"https://ico.org.uk/\">ICO</a>). In the United States, GDPR-style data privacy is largely legislated by each state.</li><li><strong>European Commission</strong><br>The executive branch of the European Union (essentially the EU’s civil service). The European Commission drafts legislation including the <a href=\"https://https//europa.eu/european-union/about-eu/institutions-bodies/court-justice_enec.europa.eu/info/law/law-topic/data-protection/data-protection-eu_en\">GDPR</a>.</li><li><strong>GDPR</strong><br><a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A02016R0679-20160504&amp;qid=1532348683434\">The 2018 General Data Protection Regulation</a>.</li></ul><h3 id=\"key-updates-from-the-eu\">Key Updates From The EU</h3><p>GDPR hasn’t stood still since May 2018. Here’s a quick run-through of what’s happened since it came into effect.</p><h4 id=\"how-have-the-eu-and-its-member-states-implemented-gdpr\">How Have The EU And Its Member States Implemented GDPR?</h4><p>The European Commission <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A52020DC0264\">reports</a> that GDPR is almost fully implemented across the EU, though some countries — it namechecks Slovenia — have dragged their feet. However, the depth of implementation varies. The EU also says its member countries are, in its opinion, using their new powers fairly.</p><p>However, it has also expressed concern that some divergence and fragmentation are creeping in. GDPR can only work effectively across the EU’s single market <strong>if member states are aligned</strong>. If the laws diverge, it muddies the water.</p><p>We know the EU wants it to be easier for individuals to exercise their rights under GDPR. That means cross-border collaboration and <strong>class-action lawsuits</strong>. It wants to see data portability for consumers beyond banking and telecoms.</p><p>It also wants to make it easier for small and medium-sized enterprises (<em>SMEs</em>) to comply with GDPR. That’s likely to come in the form of extra support and tools such as more standard contractual clauses — essentially templated legalese that SMEs can copy/paste into contracts — as the EU isn’t keen to bend the rules for them.</p><h3 id=\"big-development-1-the-unexpectedly-broad-definition-of-joint-controller\">Big Development #1: The Unexpectedly Broad Definition Of ‘Joint Controller’</h3><p>Right, here’s the first big change since GDPR became law. In two test cases involving Facebook, the Court of Justice of the European Union has defined a far broader interpretation of ‘joint controller’ than expected.</p><p>A <strong>joint controller</strong> situation arises when two or more controllers both have responsibility for meeting the terms of the GDPR. (Here’s a good explainer from the ICO on <a href=\"https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/controllers-and-processors/what-does-it-mean-if-you-are-joint-controllers/\">joint controllers</a>.) Essentially:</p><ul><li>When you process customer data, you decide with your fellow joint controller(s) who will manage each step so you’re compliant with the GDPR.</li><li>However, you all have full <strong>responsibility to ensure the entire process is compliant</strong>. Each of you is fully accountable to the data protection authority in the country handling any complaints.</li><li>An individual can raise a complaint against each and all joint controllers.</li><li>You are all responsible for any damage caused — unless you can prove you have no connection to the event that’s caused the damage.</li><li>An individual can seek compensation from any joint controller. You may be able to reclaim some of that compensation from your fellow controllers.</li></ul><p>In the first Facebook case, the CJEU confirmed that <a href=\"https://panopticonblog.com/2018/06/05/the-facebook-fan-page-judgment-joint-data-controllers-cookies-and-targeted-advertising/\">a company that ran a Facebook fan page</a> counted as a joint controller alongside Facebook. In the second, the CJEU also confirmed that <a href=\"https://www.insideprivacy.com/international/european-union/cjeu-rules-that-facebook-and-website-operators-are-joint-controllers-if-the-website-embeds-facebooks-like-button/\">a company that embedded a Facebook Like button</a> onto its website held joint controller status with the social network.</p><p>These cases sent shockwaves through the privacy community, as essentially it makes social publishers, website operators, and fan page moderators responsible for user data alongside platforms like Facebook.</p><p>However, the CJEU also clarified that <strong>shared responsibility does not mean equal responsibility</strong>. In both cases, responsibility sat primarily with Facebook — only Facebook had access to the data and only Facebook could delete it. So the impact of this decision may be less severe than it sounds at first — but it’s still critically important.</p><p>And that might be why some sites — such as the website for <a href=\"https://www.eu2020.de/eu2020-en\">Germany’s 2020 presidency of the EU</a> — block embedded social content by default, until you’ve specifically opted in:</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6dd85278-fdf4-4fba-a955-2e196d00e998/gdpr-update-eu2020-social.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"466\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6dd85278-fdf4-4fba-a955-2e196d00e998/gdpr-update-eu2020-social.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6dd85278-fdf4-4fba-a955-2e196d00e998/gdpr-update-eu2020-social.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6dd85278-fdf4-4fba-a955-2e196d00e998/gdpr-update-eu2020-social.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6dd85278-fdf4-4fba-a955-2e196d00e998/gdpr-update-eu2020-social.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6dd85278-fdf4-4fba-a955-2e196d00e998/gdpr-update-eu2020-social.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6dd85278-fdf4-4fba-a955-2e196d00e998/gdpr-update-eu2020-social.png\" sizes=\"100vw\" alt=\"Screengrab of eu2020.de showing social feed content blocked until third-party tracking is switched on\"></a><figcaption>Some sites are starting to block embedded social feeds from appearing on their sites by default, offering users the choice to opt-in with tracking. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6dd85278-fdf4-4fba-a955-2e196d00e998/gdpr-update-eu2020-social.png\">Large preview</a>)</figcaption></figure><h3 id=\"big-development-2-bye-bye-privacy-shield-hello-cpra\">Big Development #2: Bye Bye Privacy Shield, Hello CPRA</h3><p>The second big change was more predictable: <strong>Privacy Shield</strong>, the mechanism that made it easier for American businesses to process European customer data, has been struck down by the courts.</p><p>Here’s why.</p><p>The EU wants to protect its citizens’ personal data. However, it also wants to encourage international trade, plus cross-border collaboration in areas like security.</p><blockquote><p><a aria-label=\"Share on Twitter\" href=\"http://twitter.com/share?text=The%20EU%20sees%20itself%20%e2%80%94%20quite%20rightly%20%e2%80%94%20as%20a%20pioneer%20in%20data%20protection.%20So%20it%e2%80%99s%20using%20its%20political%20muscle%20to%20encourage%20countries%20who%20want%20to%20trade%20with%20the%20bloc%20to%20match%20its%20data%20privacy%20standards.%0a&amp;url=https://smashingmagazine.com%2f2021%2f02%2fstate-gdpr-2021-key-updates%2f\">The EU sees itself — quite rightly — as a pioneer in data protection. So it’s using its political muscle to encourage countries who want to trade with the bloc to match its data privacy standards.</a></p></blockquote><p>Enter the United States. European and American philosophies around data privacy are <strong>diametrically opposed</strong>. (In essence, the European view is that personal data is private unless you give explicit permission. The American view is that your data is public unless you expressly request that it’s kept private.) But as the world’s two biggest consumer markets, they need to trade. So the EU and the US developed Privacy Shield.</p><p>Privacy Shield was designed to enable US companies to process EU citizens’ data, as long as those companies signed up to its higher privacy standards.</p><p>But under US law, the US government could still monitor that data. This was challenged in a case brought by Austrian privacy advocate Max Schrems. The CJEU sided with him: <a href=\"https://www.bbc.co.uk/news/technology-53418898\">Privacy Shield was struck down</a> and the 5,300 American SMEs who used Privacy Shield were given no choice but to adopt the EU’s prescribed Standard Contractual Clauses.</p><p>Obviously, it’s in everyone’s interests for Privacy Shield to be <em>replaced</em> — and it will be. But experts say that its replacement is likely to be struck down again in due course because European and American approaches to privacy are essentially incompatible.</p><p>Meanwhile, in California, 2018’s GDPR-inspired California Consumer Privacy Act (CCPA) was strengthened in November 2020 when the <a href=\"https://iapp.org/resources/article/the-california-privacy-rights-act-of-2020/\">California Privacy Rights Act (CPRA)</a> was passed.</p><h5 id=\"the-california-consumer-privacy-act-ccpa\">The California Consumer Privacy Act (CCPA)</h5><p>The CCPA, which came into effect in January 2020, gives California citizens the <strong>right to opt out of their data being sold</strong>. They can also ask for any data that’s been collected to be disclosed and they can ask for that data to be deleted. Unlike GDPR, the CCPA only applies to commercial companies:</p><ul><li>Who process the data of more than 50,000 California residents a year, OR</li><li>Who generate gross revenue of more than $25m a year, OR</li><li>Who make more than half of their annual revenue from selling California residents’ personal data</li></ul><h5 id=\"the-california-privacy-rights-act-cpra\">The California Privacy Rights Act (CPRA)</h5><p>The CPRA, which comes into force in January 2023, <strong>goes beyond the CCPA</strong>. Its key points include:</p><ul><li>It raises the bar to companies that process the data of 100,000 California residents a year</li><li>It gives more <strong>protection to Californians’ sensitive data</strong>, such as their race, religion, sexual orientation, and health data and government ID</li><li>It triples the fines for breaches of minors’ data</li><li>It gives Californians the right to request their data is corrected</li><li>It obliges companies to help with CPRA investigations</li><li>And it establishes a California Privacy Protection Agency to enforce the CPRA</li></ul><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/544a350a-6ae6-4d0b-8ddb-63f1b3d691e9/cpra-principles-2023.jpg\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"450\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/544a350a-6ae6-4d0b-8ddb-63f1b3d691e9/cpra-principles-2023.jpg 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/544a350a-6ae6-4d0b-8ddb-63f1b3d691e9/cpra-principles-2023.jpg 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/544a350a-6ae6-4d0b-8ddb-63f1b3d691e9/cpra-principles-2023.jpg 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/544a350a-6ae6-4d0b-8ddb-63f1b3d691e9/cpra-principles-2023.jpg 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/544a350a-6ae6-4d0b-8ddb-63f1b3d691e9/cpra-principles-2023.jpg 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/544a350a-6ae6-4d0b-8ddb-63f1b3d691e9/cpra-principles-2023.jpg\" sizes=\"100vw\" alt=\"Graphic summarising the CPRA\"></a><figcaption>California is tightening its privacy legislation with the CPRA, coming in 2023. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/544a350a-6ae6-4d0b-8ddb-63f1b3d691e9/cpra-principles-2023.jpg\">Large preview</a>)</figcaption></figure><p>Further pushes towards privacy laws are happening in other states, and together these may reinforce the need for federal privacy measures under the new Biden administration.</p><h3 id=\"big-development-3-cookie-consent\">Big Development #3: Cookie Consent</h3><p>In May 2020, <a href=\"https://edpb.europa.eu/sites/edpb/files/files/file1/edpb_guidelines_202005_consent_en.pdf\">the EU updated its GDPR guidance</a> to clarify several points, including two key points for cookie consent:</p><ul><li>Cookie walls do not offer users a genuine choice, because if you reject cookies you’re blocked from accessing content. It confirms that cookie walls should not be used.</li><li>Scrolling or swiping through web content <strong>does not equate to implied consent</strong>. The EU reiterates that consent must be explicit.</li></ul><p>I’ll be going deeper into this in the second article next week.</p><figure><a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/181a1f5a-0d6c-4dd9-84c3-62c0a8d1c171/cyber-duck-marketing-analytics-cookies.png\"><img loading=\"lazy\" decoding=\"async\" importance=\"low\" width=\"800\" height=\"383\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/181a1f5a-0d6c-4dd9-84c3-62c0a8d1c171/cyber-duck-marketing-analytics-cookies.png 400w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_800/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/181a1f5a-0d6c-4dd9-84c3-62c0a8d1c171/cyber-duck-marketing-analytics-cookies.png 800w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1200/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/181a1f5a-0d6c-4dd9-84c3-62c0a8d1c171/cyber-duck-marketing-analytics-cookies.png 1200w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_1600/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/181a1f5a-0d6c-4dd9-84c3-62c0a8d1c171/cyber-duck-marketing-analytics-cookies.png 1600w, https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_2000/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/181a1f5a-0d6c-4dd9-84c3-62c0a8d1c171/cyber-duck-marketing-analytics-cookies.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_auto/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/181a1f5a-0d6c-4dd9-84c3-62c0a8d1c171/cyber-duck-marketing-analytics-cookies.png\" sizes=\"100vw\" alt=\"Cyber-Duck cookie notice with ad tracking turned on by default\"></a><figcaption>The EU has updated its guidance on cookie consent. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/181a1f5a-0d6c-4dd9-84c3-62c0a8d1c171/cyber-duck-marketing-analytics-cookies.png\">Large preview</a>)</figcaption></figure><h3 id=\"big-development-4-google-and-apple-start-to-shift-from-third-party-tracking\">Big Development #4: Google And Apple Start To Shift From Third-Party Tracking</h3><p>As the big digital players figure out how to meet GDPR — and how to turn privacy legislation to their advantage — some have already come under fire.</p><p>Both <a href=\"https://www.reuters.com/article/us-google-britain-idUSKBN29D18Q\">Google</a> and <a href=\"https://www.reuters.com/article/apple-advertisting-france-idUSL1N2HJ237\">Apple</a> are <strong>facing antitrust lawsuits</strong>, following complaints from adtech companies and publishers.</p><p>In both cases, the complainants says the big tech companies are exploiting their dominant market position.</p><p>Again, more on this next time.</p><p>Of course, many organizations jumped to comply with GDPR because they feared the fines that regulators could apply. Those fines have started rolling in:</p><p>The French data regulator has slapped Google with a <a href=\"https://www.complianceweek.com/gdpr/french-court-upholds-googles-57m-gdpr-fine/29096.article\">€50m fine</a> for “lack of transparency, inadequate information and lack of valid consent regarding ads personalization”, saying users were “not sufficiently informed” about how and why Google collected their data.</p><p>Its UK equivalent, the ICO, has fined US hotel conglomerate Marriott International Inc. <a href=\"https://ico.org.uk/about-the-ico/news-and-events/news-and-blogs/2020/10/ico-fines-marriott-international-inc-184million-for-failing-to-keep-customers-personal-data-secure/#:~:text=The%20ICO%20has%20fined%20Marriott,of%20customers'%20personal%20data%20secure.\">£18.4m</a> for failing to keep 339 million guest records secure. The 2014 cyber-attack on Starwood Hotels and Resorts Worldwide, Inc., which Marriott acquired in 2016, wasn’t discovered until 2018.</p><p>The UK’s ICO has also fined British Airways a record <a href=\"https://www.bbc.co.uk/news/technology-54568784\">£20m for a 2018 data breach of 400,000 customers’ personal and credit card data</a>.</p><p>Then there’s my personal favorite, a shocking breach of employee trust by H&amp;M that led to a €35m penalty.</p><p>So that’s where we stand today.</p><h3 id=\"what-does-this-mean-for-you\">What Does This Mean For You?</h3><p>As designers and developers, GDPR has — and will continue to have — a big impact in the products we design and build, and the way that we design for data.</p><h4 id=\"here-s-what-we-as-designers-should-know\">Here’s What We, As Designers, Should Know</h4><ul><li>GDPR is critical for you because you’ll <strong>design the points at which users share their data</strong>, what data is collected, and how it’s processed.</li><li>Follow <a href=\"https://www.smashingmagazine.com/2017/07/privacy-by-design-framework/\">Privacy by Design best practices</a>. Don’t try to reinvent the wheel — if you’ve created a compliant cookie banner, use your proven design pattern.</li><li>Work with your compliance and development teams to ensure designs meet GDPR and can be implemented. Only ask for the data you need.</li><li>Finally, ask your users what data they’re comfortable sharing and how they’d like you to use it. If they find it creepy, revisit your approach.</li></ul><h4 id=\"here-s-what-we-as-developers-should-know\">Here’s What We, As Developers, Should Know</h4><ul><li>GDPR is critical for you because you <strong>enable data processing</strong>, sharing and integrations.</li><li>As a general rule with GDPR, take a <strong>need-to-access approach</strong>. Start by implementing everything with no access, then only give your team access to data as and when it’s necessary (e.g. giving developers access to the Google Analytics console). Audit and document as you go.</li><li>Follow <a href=\"https://www.smashingmagazine.com/2017/07/privacy-by-design-framework/\">privacy by design</a> and <a href=\"https://aws.amazon.com/compliance/security-by-design/\">security by design</a> principles. Robust, secure templates for implementing infrastructure are key.</li><li>Make sure you’re involved upfront about technical aspects e.g. cookie consent/tracking conversations, so what’s decided can be implemented.</li><li><strong>Process mapping</strong> shows where data is being shared with different parts of the business.</li><li>Automation offers secure data handling that cuts human error. It also helps prevent the wrong people accessing data.</li><li><strong>GDPR checklists</strong> and of course run books will help you manage your process. Again, audit and document as you go.</li></ul><p>Now let’s see how GDPR is going to evolve in the near future. We’ll focus on three areas.</p><p>First up, let’s see how GDPR will be further embedded in the legislative landscape.</p><p>The EU wants to <strong>keep its member states aligned</strong>, because that will make cross-border suits and international collaboration easier. So it has reinforced that countries should neither divert from, nor overstep the GDPR. Some member states, as I said, are paying lip service to the regulation. Others want to exceed GDPR’s standards.</p><p>In return for their alignment, the EU <strong>will enforce compliance</strong>, work to enable class action and cheaper cross-border suits, and also promote privacy and consistent standards outside the EU. In addition to extra support and tools for SMEs, we may also see certification for security and data protection by design.</p><p>Finally, this could raise some eyebrows in Silicon Valley: the EU has hinted that it might consider <strong>bans on data processing to encourage compliance</strong>. €50m fines aren’t the end of the world for Google and friends. But time out on the naughty step — and the resulting bad PR — is a very different thing.</p><p>GDPR was designed to be technology-neutral and to support, not hinder, innovation. That’s certainly been tested over the past 12 months, and the EU points to the <strong>rapid rollout of COVID-19 apps</strong> as proof that its legislation works.</p><p>We can expect to see <strong>codes of conduct for sensitive categories of data</strong> (health and scientific research). These will be welcomed.</p><p>However, they’re watching innovators closely. The EU has expressed concern about data privacy in video, IoT devices and blockchain. They are particularly concerned about facial (and presumably voice) recognition and developments in AI.</p><p>Most notably, the Commission is deeply concerned about what it calls “multinational technology companies”, “large digital platforms” and “online advertising and micro-targeting”. Yes, once again it’s looking at you, Facebook, Amazon, Google and friends.</p><h4 id=\"3-how-the-eu-is-promoting-gdpr-standards-beyond-the-eu\">3. How The EU Is Promoting GDPR Standards Beyond The EU</h4><p>Our digital economy is global, so GDPR’s impact ripples beyond the EU’s borders — and not just in terms of compliance. The EU is setting the bar for data protection legislation worldwide. Beyond California’s CCPA, see Brazil’s LGPD, plus developments in Canada, Australia, India and a clutch of American states.</p><p>Of course, it’s in the EU’s interests if other countries and trading blocs match their standards. So it’s <strong>promoting GDPR via several avenues</strong>:</p><ul><li>Through “mutual adequacy decisions” with Japan and shortly South Korea</li><li>Embedded into bilateral trade agreements e.g. with New Zealand, Australia, UK</li><li>Through fora like the OECD, ASEAN, the G7 and the G20</li><li>Through its Data Protection Academy for EU and international regulators</li></ul><p>It is particularly keen to empower innovation through <strong>trusted data flows</strong> and to enable international cooperation between law enforcement authorities and private operators.</p><blockquote><p><a aria-label=\"Share on Twitter\" href=\"http://twitter.com/share?text=The%20EU%20is%20leading%20the%20world%20in%20data%20protection.%20Where%20it%20goes,%20others%20will%20follow.%20So%20even%20if%20you%e2%80%99re%20not%20designing/developing%20for%20an%20EU%20audience,%20you%20need%20to%20be%20aware%20of%20what%e2%80%99s%20happening.%0a&amp;url=https://smashingmagazine.com%2f2021%2f02%2fstate-gdpr-2021-key-updates%2f\">The EU is leading the world in data protection. Where it goes, others will follow. So even if you’re not designing/developing for an EU audience, you need to be aware of what’s happening.</a></p></blockquote><h3 id=\"what-does-all-of-this-mean-for-companies-in-the-eu\">What Does All Of This Mean For Companies In The EU?</h3><p>Companies who operate in the EU <strong>need to comply with GDPR</strong> or risk being fined. Those fines can be pretty hefty, as we’ve seen. So you need to be able to demonstrate that you’re adhering to GDPR’s 7 principles and to specific guidance from your national Data Protection Authority.</p><p>However, that’s not as straightforward as it sounds, and you may choose to evaluate your risk in some cases. I’ll take you through an example of that next time.</p><h3 id=\"what-does-this-mean-for-companies-based-outside-the-eu\">What Does This Mean For Companies Based Outside The EU?</h3><p>The implications for companies based outside the EU are <strong>exactly the same as those for EU countries</strong>, if they process personal data from the EU. That’s because GDPR applies to the personal data of people based in the EU. If you want to process it, e.g. to sell to customers in the EU, you have to abide by the rules. Otherwise, you risk being fined, like Facebook and Google.</p><p><strong>Here’s how that’s enforced</strong>: If you have a presence in the EU, as many multinationals do, and you don’t pay a GDPR fine, your EU assets may be seized. If you don’t have a presence, you’re obliged under GDPR to appoint a representative in the EU. Any fines will be levied through that representative. Alternatively, you may face a <strong>complex and expensive international lawsuit</strong>.</p><p>And here’s where it gets complex for everyone:</p><p>If your customer base includes people in the EU and citizens of other places with privacy laws, such as the State of California, you have to comply <strong>both</strong> with the California Consumer Privacy Act (CCPA) and with GDPR. These batches of legislation generally align — but they don’t match.</p><p>Take cookies, for example. Under GDPR, you <strong>must get active consent</strong> from a user before you place a cookie on their device, bar those strictly needed for your site to function.</p><p>However, under the CCPA, you must disclose what data you’re collecting, and enable your customer to deny you permission to sell their data. But they don’t have to actively agree you can collect it.</p><p>That’s why the EU is pushing for international standards to simplify global compliance.</p><p><strong>N.B.</strong> <em>If you’re in the United States and eagerly awaiting the replacement to Privacy Shield, you might like to take a leaf from Microsoft’s book instead — they and others have stated they’ll comply with GDPR rather than depend on any bilateral mechanisms to enable data processing.</em></p><h3 id=\"what-lessons-can-web-designers-and-developers-learn-from-gdpr\">What Lessons Can Web Designers And Developers Learn From GDPR?</h3><p>Privacy regulation is here to stay and it affects all our priorities and workflows. Here are six lessons to remember as you work with customer data:</p><ol><li><strong>We had to sprint to comply with GDPR. Now it’s a marathon.</strong><br>We know that GDPR will continue to evolve alongside the technology it aims to regulate. That means the demands on us won’t remain the same. Not only that, but GDPR has inspired similar — but not identical — legislation around the world. These legal requirements are set to keep evolving.</li><li><strong>Compliance builds competitive advantage.</strong><br>While the first major GDPR fines have been eye-watering, it’s actually the negative publicity that many say is most damaging. Who benefits from a large data leak? The company’s competitors. On the other hand, if you embed GDPR compliance as you strengthen your design and development processes, you’ll be better able to adapt as the regulations evolve.</li><li><strong>GDPR compliance and better COVID-19 outcomes are linked by user-centred design.</strong><br>We know that companies who’d begun their digital transformation were better able to adapt to the COVID-19 crisis. User-centred design supports GDPR, too. It has the process and customer focus you need to build products that align with the idea that customer data is precious and must be protected. That will make it easier to evolve your products in line with future legislation.</li><li><strong>You can build compliance into your digital products.</strong><br>Privacy by design is here to stay. If you already use service design, you can include customer information as a data layer in your service blueprints. If you don’t, now’s a great time to start. Mapping where data is collected, processed and stored highlights weak points where potential breaches may occur. Automated compliance tools will help lessen the burden on companies, plus has the potential to make data processing more secure.</li><li><strong>GDPR supports innovation — if you do it right.</strong><br>Some warn that GDPR is suffocating innovation by restricting data flows and especially by deterring companies from innovating with data. Others point to opportunities to innovate with blockchain, IoT and AI in a way that’s secure and where data is protected. The truth? Yes, of course, you can innovate and be GDPR compliant. But ethics in AI is vital: you must respect your customers and their data.</li><li><strong>Keep an eye on your third-party partners.</strong><br>This goes back to the joint controllers decision above. Companies now share responsibility for customer data with any third parties who process it and that processing must be documented. You can expect third-party checks, monitoring and contractual obligations to be a priority for companies from now on.</li></ol><p>Phew. That’s a lot to take in. But looking ahead, here’s where I’m betting we’ll see change.</p><ol><li>GDPR will <strong>continue to evolve</strong>, with clarity coming from test cases and potentially further legislation including the ePrivacy Regulation.</li><li>The EU will continue to promote international adoption of data privacy law. We’ll see more countries embrace data protection, often baked into trade and security agreements.</li><li>If we’re lucky, we may start to see <strong>international convergence of data privacy legislation</strong> — especially if the US implements data privacy at the federal level.</li><li>But we’ll also see more clashes between the EU and the US, because of their opposite approaches to privacy.</li><li>As ‘data is the new oil’, we could see more situations where users receive free products and services by giving away data through cookies.</li><li>Businesses will <strong>shift away from third-party cookies</strong> and towards server-side tracking and automation, in order to stay compliant.</li><li>Businesses will adopt <em>Privacy by Design</em> (PdB) and service design tools and process, to help them stay compliant to multiple sets of privacy laws.</li><li>And finally — and this one’s a definite — we’ll see <strong>more and bigger privacy lawsuits</strong>. Who’ll emerge as the winners — big tech or privacy advocates? That I don’t know, but we can be certain of one thing: privacy lawyers will make a lot of money.</li></ol><h3 id=\"a-final-word-on-trust\">A Final Word On Trust</h3><p>The theme underpinning both the European Commission’s communications and the commentary from industry experts is <strong>trust</strong>. Digital agencies like ours now need to provide evidence of data security and <a href=\"https://www.cyber-duck.co.uk/what-we-do/digital-optimisation/gdpr-compliance\">GDPR compliance</a> — even down to staff training policies for data protection. That’s new. The EU’s priority is to support safe, secure data flows and innovation, both within the EU and outside. Standards compliance is their solution for this. And we, as designers and developers, have a crucial role to play.</p><ul><li><strong>Part 1: GDPR, Key Updates And What They Mean</strong></li><li><a href=\"https://www.smashingmagazine.com/2021/03/state-gdpr-2021-cookie-consent-designers-developers/\">Part 2: Cookie Consent For Designers And Developers</a></li></ul><h4 id=\"further-reading\">Further Reading</h4><ul><li><a href=\"lihttps://ec.europa.eu/info/law/law-topic/data-protection_ennk\">Data Protection</a>, the EU’s site</li><li>UK ICO’s <a href=\"https://ico.org.uk/for-organisations/guide-to-pecr/guidance-on-the-use-of-cookies-and-similar-technologies/how-do-we-comply-with-the-cookie-rules/#comply15\">Guidance On Cookies</a></li><li><a href=\"https://www.enforcementtracker.com/\">GDPR Enforcement Tracker</a>, logs fines applied under GDPR</li><li><a href=\"https://www.cyber-duck.co.uk/insights/resources/gdpr-checklist\">GDPR Checklist</a>, by Cyber-Duck (a great place to start)</li><li>Overview of <a href=\"https://iclg.com/practice-areas/data-protection-laws-and-regulations/usa\">Data Protection Law in the United States</a>, by ICLG</li><li><a href=\"https://fpf.org/wp-content/uploads/2018/11/GDPR_CCPA_Comparison-Guide.pdf\">GDPR &amp; CCPA Comparison Guide</a>, by DataGuidance and the Future of Privacy Forum</li><li><a href=\"https://iapp.org/news/a/cpra-analysis-the-good-and-bad-news-for-ccpa-regulated-businesses/\">CCPA vs CPRA</a>, from IAPP</li><li><a href=\"https://aws.amazon.com/compliance/security-by-design/\">Security By Design</a> (Amazon)</li><li><a href=\"https://www.smashingmagazine.com/2017/07/privacy-by-design-framework/\">How To Protect Your Users With The Privacy By Design Framework</a>, Heather Burns, Smashing Magazine</li></ul><p><img src=\"https://www.smashingmagazine.com/images/logo/logo--red.png\" alt=\"Smashing Editorial\" width=\"35\" height=\"46\" loading=\"lazy\" decoding=\"async\"> <span>(vf, il)</span></p></div></div>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"6bbd6fb4fd06c521ae6d11ddff2748fe1c8be1941e6ad77d1dfc6661c8753544","category":"Tech"}