{"title":"Tour du Haut Var 2021: Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-du-haut-var-2021-preview","date":1613730289000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>February 19, 2021</span></p><p><span>France’s early-season stage-race fest continues with the&nbsp;Tour du Haut Var, where we will see Nairo Quintana, Thibaut Pinot and Tao Geoghegan Hart in action.</span></p></div><div><p>Taking place from Friday to Sunday, this long weekend will provide the riders with absolutely no time off. All three stages are demanding and littered with climbs.</p><p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\"><em><strong>Read&nbsp;our full early season racing guide</strong></em></a></p><h4>Route</h4><p>The first stage features short, uncategorised climbs in the first 110km, before three ascents of the Col de Gourdon (14km @ 3.9%). The climb doesn’t seem too punishing, but features a nasty pitch to the finish in the final kilometre where the punchers will excel.</p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p>The second day features<span>&nbsp;</span><em>just</em><span>&nbsp;</span>3000m of climbing, but another very steep finish to Fayence (1.2km, 9.8%), which will help the punchers succeed again.</p><p>The final stage is short at 131km but do not be mistaken, it is brutal. The riders will face the Col Saint-Roch (5.8km @ 7.2%), followed by the Col de Braus (9.9km at 6.5%), then the Col de Castillon (6.2km @ 5.7%) with the Col de la Madone (11km at 6.9%) next. From here, the riders will descend into the finish in Blausasc, with the short Col de Nice the only interference.</p><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/download_3_1024x1024.png?v=1613663243\" alt=\"TOUR DU HAUT VAR - Stage 3\"></p><p><em>Stage three of the Tour du Haut Var (via La Flamme Rouge)</em></p><p>All three days are extremely difficult, with 10,000m climbing spread across the three days of racing. Nonetheless, the punchers are more suited to the first two stages and will look to take time here – even if only in the form of bonus seconds. However, the final day suits the pure climbers much more. This is where the GC could be decided as the stronger teams will likely blow up the race early on.</p><h4>Contenders</h4><p>Nairo Quintana continued his dominant early season form last year when he backed up his win at the Tour de la Provence with victory at the Tour du Haut Var. The diminutive Colombian missed the Tour de la Provence last week but will make his season debut here after an off-season crash setback his season.</p><p>With Nairoman unlikely to be back to his best, the INEOS Grenadiers could benefit. Pavel Sivakov, Tao Geoghegan Hart, Rohan Dennis, Jhonatan Narváez and Geraint Thomas headline their imposing squad, whilst Tom Pidcock makes his Grenadier debut. An exceptional team with many options, we think Pavel Sivakov could take the lead.</p><p>David Gaudu could be the man to watch for Groupama-FDJ as he begins his preparation for Paris-Nice and later, the Tour de France. Thibaut Pinot joins his younger teammate in France but has said he plans on acting as a domestique.</p><p>The Israel Start-Up duo of Dan Martin and Mike Woods will enjoy the uphill finish on stage one and two, they could form a dangerous partnership in the overall.</p><p>Jakob Fuglsang also starts his season for Astana-Premier Tech — the Dane plans on going for Olympic gold later this year — but will look at the parcours presented here with glee.</p><p>Giulio Ciccone returned with vengeance at the Tour de la Provence, proving that he has well and truly shaken off his poor 2020 campaign. Without a time-trial, the Italian starts as a GC favourite, whilst Bauke Mollema is another great option for Trek-Segafredo.</p><p><strong>Favourites:</strong><span>&nbsp;</span>Giulio Ciccone, Jakob Fuglsang, Pavel Sivakov, David Gaudu</p><p><strong>Outsiders:</strong><span>&nbsp;</span>Clément Champoussin, Xandro Meurisse, Simon Carr, Jesus Herrada,&nbsp;Tom Pidcock</p><h4>Prediction</h4><p>We are going with a <strong>Pavel Sivakov</strong> victory. The Russian isn't the punchiest so may not be at the top of the standings after two stages, but the INEOS Grenadiers will blow things up on stage three where Sivakov will ride to victory. Watch out for <span><strong>Clément Champoussin</strong>, though, the young Frenchman is a star in the making.</span></p><p><em>Cover image:&nbsp;<span>Alex Whitehead/SWpix</span></em></p></div></div>","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6bcde74ea3d52dff6b9455a51c39dcb5b9fb1735277730d2026463bf90e58eeb","category":"Cycling"}