{"title":"Fabio Jakobsen takes stage 8 victory at the Vuelta a España","link":"https://cyclingtips.com/2021/08/fabio-jakobsen-takes-stage-8-victory-at-the-vuelta-a-espana/","date":1629560917000,"content":"<div><div><p>Fabio Jakobsen (Deceuninck-QuickStep) won his second bunch sprint of the race on stage 8 of the Vuelta a España.</p><p>With not a classified climb in sight, the 173.7 km route from Santa Pola to La Manda del Mar Menor was a nailed-on sprint stage wedged between two days in the mountains. Three Spanish riders formed the early breakaway in short order, and it was fairly relaxed as the peloton headed into the Murcia region.</p><p>The wind was expected to play a role on the pan flat coastal roads, but it was never strong enough to cause any real trouble. With the breakaway in touching distance just inside 40 km to go, Astana-Premier Tech put the hammer down, stretching out the peloton and forcing a few splits, but all it achieved was to end the breakaway’s day out.</p><p>It was a classic sprint stage finale with a furious run into town on generous roads, before a late corner and a long finishing straight. With 2km to go, Jetse Bol (Burgos-BH) launched a short-lived attack, giving the sprint teams something to chase down. Deceuninck-QuickStep took charge under the flamme rouge and at the end of a scrappy sprint, no one could get round Fabio Jakobsen, who takes back the green jersey. A bike length behind him, Alberto Dainese (Team DSM) just edged out Jasper Philipsen (Alpecin-Fenix) in the lunge for second.</p><p>The GC standings stay the same going into stage 9’s mountain showdown.</p><div><div><p>La Vuelta ciclista a España (2.UWT) <span>Santa Pola → La Manga del Mar Menor</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/df/fabio-jakobsen-2021.jpeg\"></p></div></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6ca1cb0016c58761b263684aa8b0f6139bec6b8b08d227f6e1dd5de1cc665888","category":"Cycling"}