{"title":"Aussie track star Kell O’Brien joins Team BikeExchange","link":"https://cyclingtips.com/2021/10/aussie-track-star-kell-obrien-joins-team-bikeexchange/","date":1635377605000,"content":"<div><div><p>Olympic medalist Kelland O’Brien has signed with Team BikeExchange and will race with the Australian WorldTour team for the 2022 and 2023 seasons.</p><p>The 23-year-old is a long-time member of Australia’s track endurance squad, a world champion in the team pursuit, and recently helped his country to team pursuit bronze at the Tokyo Olympics. According to a <a href=\"http://greenedgecycling.com/2021/10/27/team-bikeexchange-add-more-australian-talent-with-olympic-track-medalist-kelland-obrien/(opens%20in%20a%20new%20tab)\" target=\"_blank\">BikeExchange press release</a>, O’Brien will now “turn his full attention to the road, stepping away from the track and into the WorldTour peloton”.</p><p>While O’Brien is best known for his exploits on the boards he’s also shown himself to be a promising talent on the road.</p><p>Earlier this year, racing for local team Inform TMX Make, O’Brien took bronze in the elite men’s time trial at the Australian Road Nationals. A few days later, in the <a href=\"https://cyclingtips.com/2021/02/cameron-meyer-takes-back-to-back-aussie-titles-in-incredible-sprint-finish/\" target=\"_blank\">Nationals road race</a>, O’Brien was in the early breakaway, put in numerous attacks, and looked to have the race won with a powerful sprint from a reduced group. In the end he had to settle for silver having been narrowly beaten by defending champion Cameron Meyer.</p><p>“For us at GreenEdge Cycling, it is always important to find young talent in Australia and we are confident that with Kelland we have found it,” said BikeExchange general manager Brent Copeland. “He proved it during the national championships this year and with the bronze medal during the recent Olympic Games in Tokyo he simply confirmed it. Now it is our turn to work with him and help him during his process of adaptation into WorldTour road cycling.</p><p>“He is young and he will need all the support he can get which we are confident in giving him, as this team has so much experience in this area. He will also be able to learn a lot from our current Australian riders who have made the same transition from track to road.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/GettyImages-1297181175-1340x894.jpeg\"><figcaption>O’Brien during a scratch race earlier this year.</figcaption></figure><p>O’Brien was understandably delighted to have signed with the team.</p><p>“I have been looking up to GreenEdge Cycling in the last few years as an Australian rider,” he said. “They are the team to be in and I am extremely excited to be joining them. I am glad that this opportunity has been given to me and it’s now my turn to take the most out of it and keep improving as a cyclist.”</p><p>O’Brien plans to move to Girona, Spain, one of Europe’s most popular bases for professional cyclists.</p><p>“This will help me a lot, to adapt to the new lifestyle and I am confident this will be facilitating my new adventure,” he said. “Of course, things won’t be easy, as joining a WorldTour team needs maximum effort and lots of sacrifices, but I am sure Team BikeExchange is the right choice for me.”</p></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6caca04fac4a198c58a0ddd1cb16a56f5482dad9d767591eb980673ea9d7e933","category":"Cycling"}