{"title":"With Trump gone, Huawei tells Biden it’s not a security threat","link":"https://arstechnica.com/?p=1741126","date":1612980675000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>So you're telling me there's a chance —</h4><h2 itemprop=\"description\">With a new president in town, Huawei CEO says he would welcome friendlier relations.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/huawei-sign-800x534.jpg\" alt=\"With Trump gone, Huawei tells Biden it’s not a security threat\"><figcaption><p>Bloomberg | Getty Images</p></figcaption></figure><p>The Trump administration spent the last two years going to war with Huawei, calling the company a national security risk due to its alleged ties with the Chinese government. An executive order barred companies (even <a href=\"https://arstechnica.com/gadgets/2019/06/huaweis-export-ban-is-wider-in-scope-than-most-people-imagine/\">international companies</a>) from selling Huawei hardware or software that contained US technology, and additional restrictions on trade with Huawei have made it extremely difficult for the company to keep building networking equipment and smartphones. It has been a tough few years for Huawei, but now that the Biden administration is in charge, will things be any different?</p><p>As&nbsp;<a href=\"https://www.wsj.com/articles/huawei-files-u-s-lawsuit-disputing-it-is-a-security-threat-11612880705\">The Wall Street Journal</a> reports, Huawei certainly seems to be sending out feelers now that President Biden has settled in. One of the tools used against Huawei was <a href=\"https://arstechnica.com/tech-policy/2020/07/small-isps-stunned-by-fcc-move-to-ban-huawei-zte-gear-during-pandemic/\">an&nbsp;FCC ruling last year</a> that declared Huawei a national security threat and barred US telecommunications companies from using government funding to buy Huawei gear.&nbsp;Huawei has filed a lawsuit in the&nbsp;US Court of Appeals for the 5th Circuit challenging the ruling, calling it&nbsp;“arbitrary, capricious, and an abuse of discretion, and not supported by substantial evidence.”</p><p>Xiaomi filed a similar lawsuit <a href=\"https://arstechnica.com/gadgets/2021/02/xiaomi-denies-ties-to-chinas-military-calls-us-ruling-unconstitutional/\">earlier this month</a> after, in one of its last acts in power, the Trump administration declared Xiaomi a&nbsp;“Communist Chinese military company\" and barred US citizens from owning Xiaomi stock. Xiaomi called the ruling&nbsp;“unlawful and unconstitutional,” arguing that it denied the company legal due process.</p><p>The FCC has <a href=\"https://arstechnica.com/tech-policy/2021/01/democrat-jessica-rosenworcel-replaces-ajit-pai-is-now-fcc-acting-chairwoman/\">new leadership</a>&nbsp;under Biden, but an FCC spokesperson signaled to The Wall Street Journal that it would stand behind the previous ruling against Huawei. \"Last year the FCC issued a final designation identifying Huawei as a national security threat based on a substantial body of evidence developed by the FCC and numerous US national security agencies,\" the spokesperson said, adding, \"We will continue to defend that decision.” The US' \"substantial body of evidence\" showing that Huawei spies for the Chinese government has never been made public.</p><p>The Biden administration is currently in the middle of a review of Trump's old policies, and it doesn't seem to have come to a conclusion on Huawei yet. The Department of Commerce is in charge of the Huawei export ban, and while incoming secretary Gina Raimondo said she would \"protect Americans and our network from Chinese interference,\" she <a href=\"https://www.wsj.com/articles/commerce-nominee-pledges-tough-china-stance-but-mum-on-huawei-blacklist-11611692857?mod=article_inline\">also declined</a> to promise to uphold the Huawei ban until a review could be completed.</p><p>Huawei started courting the Biden administration earlier this week when Huawei CEO Ren Zhengfei&nbsp;said he would \"welcome\" a phone call and open communication from the new president. “If Huawei’s production capacity can be expanded, that would mean more opportunities for US companies to supply, too,\" <a href=\"https://www.cnbc.com/2021/02/09/huawei-ceo-ren-zhengfei-welcome-phone-call-from-us-president-biden.html\">Ren told reporters</a>. \"I believe that’s going to be mutually beneficial. I believe that [the] new administration would bear in mind such business interests as they are about to decide their new policy.”</p></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6cae1f8af17e690c21f456bfbfe622b8550f7b389471907c935a4dd9479056fe","category":"Tech"}