{"title":"The Secret Pro: The dangers of Sagan and my Tour de France picks","link":"https://cyclingtips.com/2021/06/the-secret-pro-tour-de-france-sagan/","date":1624660626000,"content":"<div><div><p>Strap yourself in, you’re in for a long one. The past few weeks have thrown us more than enough to talk about. Plus, on top of that, there’s that big bike race about to start.</p><p>The Tour has come around quickly this year. It’s pretty understandable, that’s how time works. Last years race only feels like it wrapped up, and with this year being a few weeks early to accommodate the Tokyo Olympics, it feels like it’s here in record time because it is. I’m excited about it. </p><p>OK, time to kick things off. How about I delve into a few of my picks for that podium come Paris? </p><p>Unsurprisingly, I’m going with Ineos will being on the top step. It’s that simple, ain’t it?! When you turn up with a squad that’s basically made up of guys who could be on the podium, it’s hard to bet against them. They’ll have every other team guessing for a while who they’re working for, and when they do show their cards, they will ride like they have all season, with that winning intent. </p><p>We’ve heard in the press that the team are going into the race and letting the road dictate who’ll be the team leader, but I’m calling BS. They’re not bloody Movistar; this is a team with riders who know exactly what their job is and what they need to do. Yeah, sure, they may have a two-pronged plan, a Plan A and B if you like, but they aren’t letting the road dictate, not on your nelly. And if you think they’re going to ride like other years, where they suffocate the rest of the peloton by sitting on the front all day, forget it. They’ll be racing different; I’m expecting big surprises from them. It’ll be bedlam and fireworks on all the tough stages, and on some you wouldn’t expect.</p><p>As for the rider on the top podium, I’m going to say, Mr Porte. Richie is going great at the moment; he’s looking strong. Stronger than ever, and he’ll have that confidence and motivation from standing on the third rung of the podium last year and the top step of the Dauphine just a few weeks ago.</p><p>Sure there’s a lot of people in the peloton who aren’t Porte fans. If I’m honest and rubs a fair few folks up the wrong way, but I like him. I’d be happy to see him take the win. </p><p>Rounding out the podium, well, don’t be surprised if there’s another Ineos rider up there, let’s say Thomas, and then one of the Slovenians. It’s so hard to choose. Jumbo-Visma will try to ride like Ineos of old, but they just can’t, can they? We saw that last year; it all fell to pieces for them. Plus we’ve not seen Roglic in action since the Ardennes Classics. Pogačar and the UAE Team will have their work cut out this year; they’re not the underdogs anymore; people know what that young gun is capable of now.</p><p>On to the points jersey. The fastest man in the peloton is not in attendance, something which I’ll come back to in a moment. It’s down to the usual culprits plus that new lad who seems pretty handy in every damn discipline.</p><p>Sagan may be a household favourite, and the team will be fully behind him like usual, but I hope he doesn’t take it. I know that’s not a particularly mature thing to say, but hey, it’s kinder than what I’d like to write here about him and his personality! OK then, he’s an absolute arse (that’s still too kind). And I know I’m not alone in that train of thought. </p><p>I know he’s a fan favourite, good for the sport due to his flamboyant nature and character and is undoubtedly one of the true megastars that have graced the sport. But for us in the peloton, he’s a bloody nightmare, a rider you want to stay clear of. He’s just so damn dangerous.</p><p>Everyone sitting at home loves watching his “sick” skills, and he has them in abundance. He’s exceptionally talented and skilled on the bike, but he’s also, err, how do I put this, an absolute airhead and selfish! </p><p>His concentration skills definitely need some work, they’re nowhere near where his bike handling skills are, and that mix makes for a rider that causes an ungodly amount of crashes.</p><p>You watch any number of overhead shots from races and check out where he is in relation to crashes. He’s not always involved, obviously, but he’s well above average when compared to anyone else.</p><p>You can’t be like Sagan when on Sagan’s wheel. You have to be switched on, not for the reason of having to chase him down if he attacks (good luck with that), but because you need to watch out for the shit he isn’t watching out for. His looong lapses in concentration have him missing dangerous situations that could be avoided well in advance, but because he has excellent handling skills, he is able to avoid going down. The guys behind end up visiting the tarmac all because of his selfish ways; he looks after number one. He has zero care for anyone else and expects everyone else to have the same skills as he has. We don’t. It’s not possible for us all to be that talented.</p><p>Can you say anything to him? No, he’s Peter Sagan, three times World Champion and no one (normally) in the media talks bad about him. Even the UCI let shit get brushed under the carpet; just take this year’s Giro. He was fined for “intimidation and improper conduct against other riders.” Now I don’t know everything about this situation, but he can be a bloody bully. So I’ll leave it at that. No, I’ll leave it with this – if everyone rode like him, no one would finish a bike race, we’d all be on the deck.</p><p>Wout van Aert could win the jersey, but the Jumbo-Visma team are after that yellow one. And with Ineos rocking up with every hitter under the sun, you can’t expect them to go for both jerseys. By the middle of the race, Van Aert will be saving energy and not going for those intermediate sprints; he’ll lose it there. He will, though, be let off the lease a few times to go for a stage. You’d be stupid not to let him.</p><p>Van der Poel, he seems pretty handy on the bike (understatement of the year). What can you say? I wouldn’t be surprised if he’s in yellow after that first stage and does an Alaphilippe through to the first rest day.  People will love to see him win, he’ll have the fans hyped for a good performance. Finally, my final prediction, that spotted jersey. It’s always an afterthought, and I haven’t even given it that for this article, sorry.</p><p>Let us move on to a guy who everyone seems to be rooting for and one we didn’t expect to see at the race. Mark Cavendish. </p><p>The whole Cav/Bennett, whohaa! I honestly think it has been blown out of proportion, way, way out of proportion. I guess there’s actually zero beef between the two riders. They’re both professional athletes who know how the business and, more so, the politics of the sport are run. It’s not their doing that one is going, and the other isn’t; that’s how picking a team works. Sure, Sam will be disappointed, but that’s bike racing.</p><p>People, and that’s the fans and media, are reading far too much into the situation. Sure, that Patrick bloke who runs the team is an absolute shit-stirrer and loves to twist the knife into a rider when he knows they’re leaving the team. Still, the fact that Cav is heading to the Tour instead of Bennett isn’t down to Bennett’s end of season departure from Deceuninck, but his knee injury. It’s that simple. I’d happily put cold hard cash on that. </p><p>You want stage wins; you take the world’s fastest rider. But you don’t take him if he’s injured. You have to think about the team, and a rider who could more than likely leave the race after a few stages due to an injury you know about would be bad management. You take a guy who A: has a pretty good track record at the race, and B: has had five wins this season. </p><p>Any other rider on any other team who had the same amount of wins as Cav this season would be on a Tour team without a shadow of a doubt. I also guarantee you that 10 days ago, in his head, he wasn’t even contemplating being on the start line in Brest. But he’s just been a guy who rides his bike, has done his job to the best of his abilities, and that’s resulted in him getting picked. </p><p>Christ, how many other guys on that start line have five wins this season. Not many (you go and Google it, I can’t be bothered). He’ll do something for sure; as we all know, he’s one hell of a savvy rider. But I also predict he’ll be home before the second rest day. Why? He’s fit, but from watching him, I’d say he’s not a three-week-Grand-Tour fit. But come on, Cav, prove me wrong, it would make my day. Like most of the public, I’m a fan. He’s a legend of the sport. </p><p>As for Bennett, he’ll be back later this season with more wins, even after Lefevere’s slagging off. Everyone in the sport knows what Patrick is like. It’s his M.O to say shit; the press lap it up as its awesome sound bites, but it falls on deaf ears in the peloton. It is unprofessional and out of order. Sam deserves more respect than that, he’s won so much for the team. But Pat, well Pat’s is stuck in his old-timey ways! He won’t pay a rider their worth. Then if said rider finds a team that will and leaves, Lefevere gets all butt-hurt about it. I don’t even think he’d be happy to pay a rider their worth if he had a budget like Jumbo or Ineos.</p><p>Sticking with Cav, let me make a second prediction: come stage 11 and that double ascent of Ventoux, he’ll be lapped! Have you seen that finishing circuit!!</p><p>Na, I jest. It’s a bloody challenging stage and something we haven’t seen before in the Tour but also one that shouldn’t worry the gruppetto too much. The stage starts flat, so yes, there will be the usual madness that goes with the breakaway, but it’s the stages that just go straight up from the start and look like a shark’s open mouth that the gruppetto needs to worry about. A route like stage 11’s allows the gruppetto to stick together all day and not get blown to pieces.  Two big climbs that come at the end of the stage, though brutal, shouldn’t see anyone outside of the time gap. We have two descents where we can go hell-for-leather and make up some time.</p><p>Now on to a team who has impressed this season and had many questioning them recently. Yep, that’s right, Bahrain. They’ve had a nice string of success this season. I know they’re not to everyone’s liking, which I understand; that title sponsor puts people off straight away. It’s again questionable, like several others in the sport, but let’s give the team their due. It’s a solid squad, and in the WorldTour, no team has sub-par riders kicking around, no matter what. Their Giro result with Damiano Caruso coming home in second on GC is no fluke; he may not look much on paper, but he’s been around long enough to know when to step up to the plate, and that’s what he did. He’s knocked it out the park.</p><p>As for Mark Padun’s recent double back-to-back victories in the Dauphine, all I have to say is that everyone is always suspicious of a winner, especially if they haven’t had masses of previous. It’s just like last year at the Tour, I saw loads of questions being asked about Pogačar. If he came second, no one would have questioned his performance. A year on, and he’s shown he’s the real deal. I understand why people question it and take the time to look a bit deeper than just the result. </p><p>The first stage he won was impressive, but Ineos wasn’t going to worry much about him; he was away in a break, way down on GC, and why they would need to go after another stage victory. So they let him do his thing, it had zero influence on the GC, and they did their thing—simple but impressive performance. </p><p>I also would put some of it down to the fruits of last season. Rod Ellingworth, if you remember, jumped ship from Ineos to Bahrain midway through 2019, with the aim of making the team a Superteam. Yes, I know he was only there for 18 months or so, but he would have implemented a heck of a lot as head honcho. Sure, he’s not with the team now and back with Ineos, but he does have a good track record of getting the best out of riders he’s worked with. Everyone I know who’s worked with him has nothing but praise for his work. </p><p>Have the foundations of what he implemented last year been solid enough for them to carry over to this season? I don’t know but what I do know is that great results take time. </p><p>On to another “fan favourite” team: Astana and the departure of Vino. Yep, he’s finally got the boot. So it’s not quite #Vinoforever. First up, hats off to the team with the announcement. The timing was close to bang-on. They released on a busy news day; I’m sure they hoped it would quickly get buried under the deluge of other TDF news coming out of Brittany.</p><p>We need to see what happens with this situation; it’s early days, and he’s been given the boot previously by the team but returned. But he’s no worse than half the other managers and directors currently in the peloton. Don’t get me wrong, it would be good to see him gone. Very good.</p><p>I think that in the future, any rider caught should be given the old heave-ho for good. The UCI needs to stop handing out these 2-4 year suspensions; if you get caught, you’re out. Make it a blanket rule from the end of this season. There are enough riders who don’t dope in the peloton now who would make great directors and management once they retire. </p><p>Obviously, you can’t backdate a rule like that. There’s plenty of current staff on teams who were riders that doped but now are great at their job and don’t encourage doping. Times have changed, and we can keep them changing, or the UCI could. It’d take a while, but blanket suspensions would seriously help the sport in the long term.</p><p>Last but not least, let’s touch upon that Women’s Tour de France that should be going ahead next year. I say should because, as we all know, things can change quickly at the moment. But it’s great, isn’t it? And if the ASO and the riders put on one hell of a show, it should hopefully be a perfect platform to draw some more well-needed sponsors to the women’s peloton. Fingers crossed.</p><p>OK, that’s it from me this time around; we will see what happens over the next three weeks that’s worth talking about. I’m sure they’re going to be some fireworks. And if there’s any massive news, expect me to pop up here on CyclingTips with my view, but it needs to be really big to distract me from what I’ll be up to for the next few weeks. </p><p>Till then, ride safe and enjoy the Tour. </p></div></div>","author":"The Secret Pro","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6d2390e48e614193f11811627adbed9bbe9ee494dd63ab53722d0c6ca42289eb","category":"Cycling"}