{"title":"2022 Specialized Tarmac SL6 Sport review: Flagship performance, distilled","link":"https://cyclingtips.com/2021/12/2022-specialized-tarmac-sl6-sport-review/","date":1639142509000,"content":"<div><div><div><h2>Story Highlights</h2><ul><li><strong>What it is:</strong>Previous-generation Tarmac shaping combined with a more budget-friendly carbon blend and build kit.</li><li><strong>Frame features:</strong>FACT 9r carbon fiber construction, semi-aero tube shaping, semi-internal cable routing, threaded bottom bracket Brain 2.0 auto-lockout rear shock, single-pivot suspension, threaded bottom bracket.</li><li><strong>Weight:</strong>8.03 kg (17.70 lb, as tested, 56 cm size, without pedals or accessories).</li><li><strong>Price:</strong> US$3,200 / AU$4,500 / £2,950 / €3,300</li><li><strong>Highs:</strong>Excellent frame stiffness, good ride quality, trademark Tarmac handling, easy to service, good overall value.</li><li><strong>Lows:</strong>Wheels are a bit soft and cheap, bulky levers.</li></ul></div><p>The Tarmac has always been Specialized’s premier all-around bike for road racing, and in some sense, if you’ve ridden one, you’ve ridden them all — and that’s an excellent thing. In this case, the Tarmac SL6 Sport from Specialized may use a modified and more budget-friendly version of the old flagship <a href=\"https://cyclingtips.com/2018/03/specialized-s-works-tarmac-sl6-disc-review/\" target=\"_blank\">S-Works Tarmac SL6</a>, but it still feels an awful lot like its vastly more expensive and newer siblings, and for a fraction of the cost. </p><p>The ride quality is very similar to current halo models, the handling is the same, and it still looks like a bike that could’ve been introduced today instead of one that’s one generation old. Unless you absolutely have to have the latest-and-greatest in terms of weight and aerodynamics, this bike ticks all the boxes that most riders care about.</p><h2>Age is just a number</h2><p>The FACT 9r carbon fiber frame that Specialized uses here is nearly identical to the previous-generation S-Works Tarmac (we’re now in the seventh generation of the Tarmac SL, in case you’re wondering). You get the same semi-aero tube shaping throughout most of the frame, the same dropped seatstays, the same convertible internal routing port on top of the down tube. But Specialized uses a cheaper carbon fiber blend on the SL6 Sport than what was originally found on the S-Works Tarmac SL6, and the more aerodynamic D-shaped carbon fiber seatpost has been replaced with a conventional 27.2 mm-diameter round one.</p><p>And thankfully, the OSBB press-fit bottom bracket shell that Specialized once favored has given way to a conventional English-threaded one.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-12-1340x754.jpg\"><figcaption>There’s nothing crazy going on back here in terms of tube shaping. It’s about as conventional as it gets these days, but it still works very, very well.</figcaption></figure><p>Overall, the difference between the original S-Works Tarmac SL6 and this current Tarmac SL6 Sport is largely weight — a couple hundred grams, by our estimates, which should still keep the weight of a painted 56 cm sample just under the 1 kg mark. Sure, the S-Works Tarmac SL6 may also have been a little stiffer or more compliant on the testing jig, but in real-world conditions, you likely won’t notice. </p><h2>Up the hills and, well, up some more</h2><p>I tested the Tarmac SL6 Sport on some of the tough climbs just outside of Boulder, Colorado. Some pitches are absurdly steep, but many of them are just mellow and long. So I got a good taste for what the SL6 Sport can do in both situations. Perhaps more importantly, I was able to zip down some fast, twisty descents to get a feel for whether the SL6 Sport handles as brilliantly as its high-end sibling. </p><p>The answer is yes — mostly. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-6-1340x754.jpg\"><figcaption>The frame isn’t really trying that hard to be aero. Low weight and high stiffness are the main priorities here.</figcaption></figure><p>It’s clear straight away that the frame feels nearly identical to the S-Works version. It’s stiff underfoot, seems to keep its composure during hard cornering, and largely just feels like a premium bit of equipment. Overall, the SL6 Sport’s personality still mirrors that of the high-end models you’ll see under WorldTour racers, despite the more modest price. </p><p>Best of all, you’re getting the same handling as the top-shelf Tarmac. This is an aggressive racer, most at home underneath climbers. The low stack and long reach are the same as the S-Works Tarmac, and the combination fosters an aggressive riding position for efficiently putting down power and cutting through the air. Up front, the compact mid-50s trail dimension yields ultra-responsive steering and quick line changes. Complementing that agile and nimble feel is the tight wheelbase. All of this means toe overlap is a given, but at the speeds this bike is meant to be ridden at, it’s not an issue. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/Specialized-Tarmac-SL6-Sport-geometry-1340x709.jpg\"></figure><p>The seatpost, in conjunction with the dropped seatstays and some clever top tube shaping, allows enough fore-aft flex to create a comfortable rear end without feeling like you’re on a pogo stick. It’s not cushy like an endurance bike, but that’s not what most people want from a bike like this, anyway. Overall, the compliance hits a pleasant compromise as is, but if you still want a smoother ride, there’s room in the frame and fork to swap the stock 26 mm-wide tires for 30s.</p><h2>Build details</h2><p>Depending on the size of your wallet, the Tarmac SL6 Sport’s price may or may not scream “bargain” to you, and there are certainly other brands that offer similar spec for a lot less (especially direct-to-consumer brands like Canyon). But the Tarmac SL6 Sport still packs a lot of value — largely due to the previous generations of performance knowledge that’s baked into it — and for the everyday rider who’s less likely to spend much time racing, the SL6 Sport does everything you’ll need it to do. In other words, the ride quality and fun quotient far exceed the price tag. </p><p>So much of the difference between the SL6 Sport and the halo Tarmacs comes down to the build kit. The workhorse Shimano 105 groupset certainly impressed me on my test rides. It shifts wonderfully, and Specialized has included a wide-range 11-30T cassette and compact 50/34T chainrings that should provide most riders with sufficient gearing for the majority of longer and tougher climbs. The hydraulic disc brakes work great, too, with lots of power available with just a single finger’s worth of pressure, and easy control since the power doesn’t come on too quickly. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-20-1340x754.jpg\"><figcaption>It’s nice to see an actual Shimano 105 crankset here instead of a third-party model that won’t shift quite as well.</figcaption></figure><p>The levers are rather bulky, though, and of course, 105 is heavier than Ultegra and Dura-Ace. But 105 is otherwise nearly identical to those more expensive options in terms of functionality, so it’s hard to find too much fault. </p><p>DT Swiss calls the R470 wheels a jack-of-all-trades hoop. They’re aluminum, fairly light, very inexpensive, and low-profile to satisfy the climbing crowd. Overall, they should give you plenty of untroubled miles and easy service, and what they lack in wow factor and lateral stiffness, they make up for in fuggedaboudit simplicity and durability.</p><p>But while all of that may be true, the wheels were actually my least favorite part of the Tarmac SL6 Sport’s build. They felt fairly sloppy laterally, especially on big efforts out of the saddle. And on descents, I felt like I needed to account for that flex and pay more attention to lean on the bike in sharp corners.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-11-1340x754.jpg\"><figcaption>The DT Swiss R470 wheels aren’t bad, but they hardly stand out, either.</figcaption></figure><p>That said, my impression of the wheels likely stems from the fact that I’ve been riding super-stiff carbon wheels with deeper rim profiles for, well, a very long time. You may not notice any issues here, and if you did, you could certainly upgrade your wheels to suit your riding needs. The fact is, these wheels fit this build and will be perfect for the majority of riders. </p><p>Wisely, Specialized specs a two-piece bar and stem for plenty of adjustability, with cables and housing that are externally routed from the front of the bike into the down tube. It’s not the most aesthetically pleasing setup, but for home mechanics and those who don’t want to mess with complex cockpit routing, this is A-OK. </p><p>Finishing up the build is a Specialized Power saddle, mounted atop a round carbon fiber seatpost. The saddle stands out here as it’s one of the most popular models in recent years from any brand, and it’s good to see Specialized offer a race-ready model with firm padding and a good shape at this price point. The seatpost isn’t always the easiest to adjust (and if you upgrade to a carbon railed saddle, you’ll also have to switch cradle hardware), but it adds to the frame’s nice ride, it holds tight, and didn’t creak during testing.</p><h2>The thinking rider’s choice</h2><p>Ultimately, the gulf between the Tarmac SL6 Sport and the S-Works Tarmac SL7 is not all that wide. The S-Works Tarmac undoubtedly features a slew of refinements that will make real impacts for racers at the pointy end of competition. But the rest of the cycling population will be more than simply well-served by the SL6 Sport. </p><p>This bike does everything I wanted it to do, and did it well. While I found myself wishing for deeper-section wheels with a bit wider stance on top of that, there really wasn’t much to complain about. Overall, what you’re getting here is super-high-end performance without the super-high-end price tag. What’s better than that? </p><p>More information can be found at <a href=\"https://www.specialized.com/us/en/tarmac-sl6-sport/p/199469?color=321604-199469\" target=\"_blank\">www.specialized.com</a>.</p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-2-1340x754.jpg\"><figcaption>The Tarmac SL6 Sport from Specialized rides similarly to its vastly more expensive siblings. The build and carbon layup differences keep the price much lower.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-3-1340x754.jpg\"><figcaption>The general silhouette looks nearly identical to the S-Works Tarmac, but there are some notable differences. The seatpost, for instance, is a traditional round shape on the SL6 Sport, while the S-Works Tarmac’s seatpost is D-shaped.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-4-1340x754.jpg\"><figcaption>There’s just minimal aero shaping to be found here.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-5-1340x754.jpg\"><figcaption>The round seatpost may not be as fancy and aero as the D-shaped post on the higher-end models, but it offers plenty of fore-aft flex for comfort and options for upgrading or replacing it if you want to.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-7-1340x754.jpg\"><figcaption>The cables and housing route externally from the handlebar into the down tube. That may not look as cool, but it means everything at the front of your bike is easy to swap or adjust.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-8-1340x754.jpg\"><figcaption>Dropped seatstays, of course.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-9-1340x754.jpg\"><figcaption>The Tarmac SL6 Sport features the Fact Carbon 9R layup. Will you be able to tell the difference? Not unless you’ve been on Specialized’s higher-end layups for years, and even then, you still may not notice a difference.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-10-1340x754.jpg\"><figcaption>Behold the glory of the adjustable two-piece cockpit.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-13-1340x754.jpg\"><figcaption>Shimano’s 105 hydraulic disc brakes felt great. Modulation and power were both spot-on.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-14-1340x754.jpg\"><figcaption>Gone are the old press-fit cups, replaced by threaded ones.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-15-1340x754.jpg\"><figcaption>The dropouts are small and tidy, and the flush thru-axle lends a clean look.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-16-1340x754.jpg\"><figcaption>Guess what: the external seatpost binder held tight and didn’t creak!</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-17-1340x754.jpg\"><figcaption>The compact bar bend should be comfortable for most riders.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-18-1340x754.jpg\"><figcaption>Gets the job done.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-19-1340x754.jpg\"><figcaption>If you want to get into nitpicky details, the 105 brake hoods are certainly far chunkier than Ultegra or Dura-Ace hoods.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-21-1340x754.jpg\"><figcaption>Specialized uses the long-cage version of the 105 rear derailleur to handle the extra range.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-22-1340x754.jpg\"><figcaption>The bar tape has a nice fuzzy texture to it that works well with bare hands.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-23-1340x754.jpg\"><figcaption>The carbon fiber is visible through the minimal paint in many spots.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/2022-Specialized-Tarmac-SL6-Sport-review-24-1340x754.jpg\"><figcaption>The Specialized Power saddle is super comfy and a nice addition to a solid build.</figcaption></figure></li></ul></div></figure></div></div>","author":"Dan Cavallari","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6d79dcee4cae66ca309bd16e5491954439147939abf8d75423c32767ab88d94a","category":"Cycling"}