{"title":"Freddy Ovett turns to the gravel scene with L39ION of LA","link":"https://cyclingtips.com/2021/09/freddy-ovett-turns-to-the-gravel-scene-with-l39ion-of-la/","date":1632151637000,"content":"<div><div><p>Since EF Education First’s foray outside of the WorldTour calendar, a few road teams now operate so-called ‘alternative’ programmes. You could argue, however, that L39ION of Los Angeles has <em>always</em> done things an alternative way. </p><p>While the essence of the team is still in criterium racing with the Williams brothers leading the charge, 27-year-old Australian Freddy Ovett also represents L39ION in the gravel scene. In late August he returned to his home base of Girona after a seven-week block in the United States — which included the requisite crits but also his first big gravel hit out at Steamboat GRVL, where he finished 5th. </p><p>“I’d only done a handful of races at that point,” he reflects. “And coming against [Ian] Boswell, [Peter] Stetina, Colin Strickland – all these guys that I’ve watched the last few years dominate Unbound and put WorldTour pros easily to one side at these races. It was kind of like, ‘well, yeah, I can think I’m good at gravel, but these guys had proven themselves over and over. I’m not going to really know if I’m any good at this until I race against them.’”</p><p>As it transpired, Ovett was more than up to the task. “Once I got the race underway, I could tell quite early on that I was like, ‘okay, I think I can go pretty deep here with these guys,’” he says. He dropped from the front group in the final 10 kilometres, “but it was enough for me to go into next year confident that I can go for consistent podiums with these guys.” </p><blockquote></blockquote><p>Although the idea of a road team dabbling in gravel is not a new one, Ovett believes that this is a good move for L39ION “because it’s so cool. The gravel scene, it’s booming, and the amount of people and sponsors involved, it’s a great way for us to get some exposure in a different way.”</p><p>Gravel racing is a growing discipline, but it has been met with some resistance from purists who sneer at how seriously some riders take events such as Unbound and Steamboat GRVL. What is Ovett’s response to the naysayers? “I’ve experienced that with Zwift as well,” he says. “The thing is that you have to appreciate that every discipline is its own discipline, and should never be compared to another discipline.”</p><p>For him, the fact that gravel is not as po-faced as European road racing or as rigid in its structure is a good thing. “I think that is the issue with cycling,” he says. “And I think that is what L39ION are trying to change. Myself, Skylar Schneider, Ty Magner, Tyler Williams, we’ve all had experience with professional teams and we’ve all seen the ugly side of it. </p><p>“We’ve seen the life that people believe you have to lead in order to be at the top level. And all of us kind of got to the point where we were just like, ‘this is silly’, ‘this is not why we got into cycling, this is not why we think it’s cool to be a cyclist’ … We’re lucky that we found this home with L39ION who are trying to change the image of cycling.”</p><p>Ovett, who in the past spent time as a stagiaire for BMC and rode for Israel Cycling Academy for two seasons, reached out to L39ION for a ride because of the team’s personality and the promise of individuality. “I thought that this is somewhere that I can express who I am as a cyclist and as a person and they can benefit from me as well,” he says. “I think the reason why the culture is so good is because they’ve experienced such bad cultures elsewhere. And it’s more normal to have a strangely bad culture on professional teams than I think people believe,” said Ovett.</p><p>“I’ve never been on a team where I just feel so relaxed and not stressed about doing my job properly. And funnily enough, that’s the best environment to do your job properly. It’s just special, it really is. And I’m lucky to be a part of it really going forward.” </p><blockquote></blockquote><p>Ovett’s background is in running and for him, the mass participation structure of gravel races is reminiscent of the collective experience at running events. “Coming from a running background it gave me similar vibes,” he says. “Marathons and that, everyone lines up on the same start line — whether you’re going for the win or you’re just hoping to cross [off] your first marathon. I think it’s cool that gravel in particular is bringing everyone together, and it’s cool to be a part of that, because it’s still very much in its infancy.”</p><p>Given the fact that both the team and the majority of the races are based in the US, Ovett’s choice of a European base in Girona seems counterintuitive. He maintains, however, that it provides a necessary delineation between racing blocks and rest. “It’s super nice to be like the only guy in Europe kind of flying the L39ION flag and doing anything I can for the team over here,” he says.</p><p>Although he is “flying the flag” in Europe, the growth of gravel on the continent still pales in comparison to across the pond. “I can see in Europe the interest for gravel,” Ovett says, “but I think right now America is just doing it. They’ve done it for longer and they just know how to get races together quickly. They’ve got a lot of pros or ex-pros who know that to be the best in gravel you go to the US.” </p><p>“That’s not to say that Europe can’t continue to grow in terms of gravel, but it’s competing head to head with UCI racing, and that this is where obviously cycling is based. So I think a lot of people would say, ‘well, why would we watch a gravel race? Or, why would I do a gravel race when I could race on the road?’ But I think that will change as more people outside of the pro echelon get involved in gravel racing.”</p><blockquote></blockquote><p>As such, Ovett will be called back to the US for the last few races of the season, which for him include the Belgian Waffle Ride where he hopes to have “one more hit out against a few of the top guys before next year.” Then, the California state championships to help Corey Williams defend his title, and the Sea Otter Classic where the team will ”get involved with racing there and have a bit of fun.” </p><p>After that, it’s back to Girona to prepare for 2022, for which he has high hopes. “In terms of gravel, I’ve seen enough this year for any race that I go to that I can confidently say that I should be right up there.” But first, offseason: “I haven’t had a rest for a really long time. So yeah, I’m looking forward to that.”</p></div></div>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6dfd409e0803a5342da936d7c78a437ab6cdd445d42b5c33dc03d4c9d0a07e03","category":"Cycling"}