{"title":"‘The Bizarre Reaction to Facebook’s Decision to Get Out of the News Business in Australia’","link":"https://www.techdirt.com/articles/20210217/22383446265/bizarre-reaction-to-facebooks-decision-to-get-out-news-business-australia.shtml","date":1613706347000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h3>from the <i>it's-quite-reasonable</i> dept</h3><p>None of this should have been a surprise. Back in September we wrote about Facebook publicly saying that if Australia went forward with its ridiculous attack on the open internet, and instituted a \"news link tax\" on Facebook and Google, that it would <a href=\"https://www.techdirt.com/articles/20200831/21152645222/facebook-says-it-will-block-news-sharing-australia-if-murdochs-social-media-tax-becomes-law.shtml\">block news links on Facebook in Australia</a>... and basically everyone ignored it. So, yesterday, when Facebook announced that it was <a href=\"https://about.fb.com/news/2021/02/changes-to-sharing-and-viewing-news-on-facebook-in-australia/\" target=\"_blank\">no longer allowing news to be shared in Australia</a> (and relatedly, no longer allowing the sharing of Australian news services on Facebook), it should not have been a surprise.</p><p>And yet... it seemed to make tons of people freak out for all the wrong reasons. Almost everyone started blaming and attacking Facebook. And, look, I get it, Facebook is a terrible, terrible company and deserves <b>lots of blame</b> for <b>lots of bad things</b> that it does. But <b>this ain't it</b>. There are a lot of examples of this, but because he's the top member of the House of Representatives working on antitrust issues, I'll specifically call out Rep. David Cicilline's response:</p><p>That says:</p><blockquote><em><p>If it is not already clear, Facebook is not compatible with democracy.</p><p>Threatening to bring an entire country to its knees to agree to Facebook’s terms is the ultimate admission of monopoly power.</p></em></blockquote><p>But that's completely nonsensical. We can argue about whether or not Facebook is \"compatible with democracy\" but the simple facts of the situation are that Australia -- pushed heavily by Rupert Murdoch -- has decided to put in place a plan to <a href=\"https://www.techdirt.com/articles/20200420/09245744331/australia-gives-up-any-pretense-pushes-straight-up-tax-facebook-google-to-pay-news-orgs.shtml\">tax Google and Facebook</a> for any links to news. The bill has all sorts of problems, but there are two huge ones that should concern basically anyone who supports a free and open internet.</p><p>First is the link tax. This is fundamentally against the principles of an open internet. The government saying that you can't link to a news site unless you pay a tax should be seen as inherently problematic for a long list of reasons. At a most basic level, it's demanding payment <b>for traffic</b>. There are two entire industries out there based entirely around trying to get more traffic from these companies: \"search engine optimization\" and \"social media management.\" The reasons there are those industries is because <em>everyone else in the world</em> has figured out that having prominent links on search engines and social media <em>is valuable in its own right</em> and that it's up to the sites that get those links, and the corresponding traffic, to make use of it.</p><p>But here, a bunch of lazy newspaper execs who failed to adapt and to figure out better internet business models not only want the traffic, they <b>also want to get paid for it</b>.</p><p>This is like saying that not only should NBC have to run an advertisement for Techdirt, but it should have to pay me for it. If that seems totally nonsensical, that's because it is. The link tax makes no sense.</p><p>And, most importantly, as any economist will tell you, taxing something doesn't just bring in revenue, it decreases whatever you tax. This is why we have things like cigarette taxes and pollution taxes. It's a tool to get less of something. So, in this case, Australia is saying it wants to tax links to news on Facebook, and Facebook responds in the exact way any reasonable economist would predict: it says that's just not worth it and bans links. That's not incompatible with democracy. It's not bringing a country to its knees. The country said \"this is how much news links cost\" and Facebook said \"oh, that's too expensive, so we'll stop.\"</p><p>Contrary to the idea that this is an \"attack\" on journalism or news in Australia, it's not. The news still exists in Australia. News companies still have websites. People can still visit those websites.</p><p>Indeed, the people who are saying that this move by Facebook is somehow an \"attack\" on news or an attack on Australian sovereignty seem to be admitting more than they'd really like: that they think Facebook <b>must be a dominant source of news</b> in the country.</p><p>I mean, if Facebook is really such a problem, <b>shouldn't they all be celebrating</b>? This is Facebook saying \"okay, okay, we'll completely remove ourselves from the news business.\" Since everyone was complaining that Facebook was too much of a presence in the news business... isn't that... a victory?</p><p>And we haven't even gotten to the other problematic part of the law -- which is that it requires Facebook and Google to give newspapers heads up to algorithmic changes. This is completely disconnected from reality. Facebook and Google may make multiple algorithm changes every day, just to keep their services running. Having to tell newspapers (and them alone) about those changes with a few weeks notice is basically giving those news organizations the keys to the kingdom: it's telling them how to game the algorithms. If you think bogus clickbait is a problem now, just imagine what it's like when all of the Australian press get to know the secrets behind the algorithm, and get to prepare for any changes.</p><p>The whole story is absolutely ridiculous. And the most incredible thing is that <b>no matter what Facebook did here</b> it would have gotten yelled at. And the proof is not hard to find. Because just an hour or two before Facebook made this announcement, Google went the other way -- <a href=\"https://newscorp.com/2021/02/17/news-corp-and-google-agree-to-global-partnership-on-news/\" target=\"_blank\">coming to an agreement to pay Rupert Murdoch</a> for featuring Murdoch-owned news organizations content on Google. And <a href=\"https://twitter.com/slpng_giants/status/1362078900465983488\">people freaked out</a>, complaining about Google helping fund Rupert Murdoch's disinformation empire. Except... that's the whole point of the law? So it's a bit bizarre that the same people are mad about both Facebook's decision to <b>not</b> give free money to Rupert <b>and</b> Google caving to do exactly that:</p><p><a href=\"https://imgur.com/0uJAG6D\"><img src=\"https://i.imgur.com/0uJAG6D.png\" width=\"500\"></a><br><a href=\"https://imgur.com/5xotA4c\"><img src=\"https://i.imgur.com/5xotA4c.png\" width=\"500\"></a></p><p>So... it's bad to pay Murdoch. And it's bad not to pay Murdoch. There is no consistency or principle behind all this other than people so focused on \"Facebook and Google must be evil, so even when they do the exact opposite of each other, both are more evidence of evil.\"</p><p>This fight was not \"Facebook v. Australia.\" Or \"Facebook v. journalism\" even though some ignorant or dishonest people are making it out to be the case. This was <b>always</b> \"Rupert Murdoch v. the open web.\" We may not like Facebook in the role of the defender of the open web (and it's far from the best representative for the open web). But Facebook saying that it won't pay a link tax is a defense of the open web and against Rupert Murdoch. It's the right move, and whatever else you may think of Facebook, the company deserves credit for taking the right stand here.</p><div id=\"post_end\" name=\"post_end_plea\"><p><img src=\"https://ii.techdirt.com/s/t/i/topclose.png\" alt=\"Hide this\" title=\"Hide This\"></p><div><p>Thank you for reading this Techdirt post. With so many things competing for everyone’s attention these days, we really appreciate you giving us your time. We work hard every day to put quality content out there for our community.</p><p>Techdirt is one of the few remaining truly independent media outlets. We do not have a giant corporation behind us, and we rely heavily on our community to support us, in an age when advertisers are increasingly uninterested in sponsoring small, independent sites — especially a site like ours that is unwilling to pull punches in its reporting and analysis.</p><p>While other websites have resorted to paywalls, registration requirements, and increasingly annoying/intrusive advertising, we have always kept Techdirt open and available to anyone. But in order to continue doing so, <a href=\"https://www.techdirt.com/pages/support.php\">we need your support</a>. We offer a variety of ways for our readers to support us, from direct donations to special subscriptions and cool merchandise — and every little bit helps. Thank you.<br></p><p>–The Techdirt Team</p></div></div><p>Filed Under: <a href=\"https://www.techdirt.com/blog/?tag=australia\">australia</a>, <a href=\"https://www.techdirt.com/blog/?tag=link+tax\">link tax</a>, <a href=\"https://www.techdirt.com/blog/?tag=links\">links</a>, <a href=\"https://www.techdirt.com/blog/?tag=news\">news</a>, <a href=\"https://www.techdirt.com/blog/?tag=open+internet\">open internet</a>, <a href=\"https://www.techdirt.com/blog/?tag=rupert+murdoch\">rupert murdoch</a><br>Companies: <a href=\"https://www.techdirt.com/blog/?company=facebook\">facebook</a>, <a href=\"https://www.techdirt.com/blog/?company=google\">google</a>, <a href=\"https://www.techdirt.com/blog/?company=news+corp.\">news corp.</a></p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"6ed6f4c6f2abf0a46f66a8bf1b453dfbf33803d74d76fc6c23eab5a203692b71","category":"Tech"}