{"title":"Online fighting games during COVID: How rollback helps us connect","link":"https://arstechnica.com/?p=1742694","date":1613519694000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Rollback to the future —</h4><h2 itemprop=\"description\">We played <em>Guilty Gear Strive's</em> online beta to see how its netcode holds up</h2></header><section><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Guilty-Gear-Strive-Open-Beta_20210216125110-800x450.jpg\" alt=\"Sol Badguy faces off against Faust in <em>Guilty Gear Strive</em>, the latest entry in the long running fighting game series coming in April\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Guilty-Gear-Strive-Open-Beta_20210216125110.jpg\" data-height=\"1080\" data-width=\"1920\">Enlarge</a> <span>/</span> Sol Badguy faces off against Faust in <em>Guilty Gear Strive</em>, the latest entry in the long running fighting game series coming in April</p></figcaption></figure><p>As a huge fighting game fan I'm always excited when a new game comes out. No other genre captures my attention in the same way. The feeling of discovery, the community and competitive spirit—a good release means potentially thousands of hours of playing and learning, not to mention all the sharing and talking with fellow players.</p><p>This week I'm excited about <em>Guilty Gear Strive</em>, releasing <a href=\"https://www.guiltygear.com/ggst/en/\">April 9 on PS4, PS5, and PC</a>. There's an open beta this week, and Ars got early access to try it out, including the newly improved netcode.</p><p>I'm happy to report that the beta is already doing the right things to make an online game feel as much like an offline one as possible.</p><h2>The offline experience</h2><p>In pre-pandemic days, which already feel like years ago, I would host a weekly fighting-game night. People gathered in my garage to run friendly-but-competitive sets, help each other learn games, and just talk about life. Fighting games to us aren't just about competing—they're about community and connecting with people.</p><p>For me, there's just no purer gaming experience than playing against another human being. No CPU opponent or single-player narrative can bring that same feeling of give and take, testing your skills and reflexes but also your ability to adapt and dig into the psychology of your opponent.</p><p>If you're the better player? It's a chance to teach someone or test ideas against someone more forgiving. The moment when you see them avoid the setup they'd been walking into all night or challenge the move you'd been bullying them with can feel as good as you winning.</p><p>If the tables are turned, and you're the weaker one, it's a chance to learn, and that s much more satisfying when you finally take a match. One night, I ran a first-to-20 against a friend who's a much stronger player than me, I lost the set 3-20. Those three games I took? Best feeling in the world, even after getting my butt handed to me.</p><p>The real joy though is when you find an opponent you're roughly equal to. Trading games, constantly pushing yourself to find an advantage, adapting and watching them adapt back, that's when fighting games shine in a way few other games can. Could be a good friend, or a total stranger, but it's like having a conversation in another language.</p><p>A year ago, as COVID began to pop up in Los Angeles County, I had to cancel my night. All the other weeklies, the tournaments, friendly sets at your friend's house—they all dried up. Offline fighting games became an endangered species around the world, and the only way to get our fix was to play online.</p><figure><img alt=\"My garage in happier days, when we could play offline.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Night-Arcade-3.jpg\" width=\"1500\" height=\"1125\"><figcaption><p>My garage in happier days, when we could play offline.</p><p>Ryan Gan</p></figcaption></figure><h2>Fighting in an online world</h2><p>Fighting games, by their nature, are reliant on reflexes and being able to quickly assess data. We count frames, we look for things we know are unsafe we can punish, we watch for the telltale movements that might indicate an overhead attack is coming so we can shift our blocking to high. If someone is dashing up in your face, can you react fast enough?</p><p>In short, it's a crummy genre to cram through Internet tubes. Any lag can destroy the feeling of the game. Without offline play, reliant entirely on the Internet, what is a fighting game fan to do?</p><p>Luckily, there's a bit of clever networking tech, called rollback netcode, that can alleviate most of the disadvantages of distance and physics (doesn't matter how good your Internet connection is—there's no beating the speed of light).</p><p>Unfortunately, not every fighting game has rollback netcode, particularly ones from Japanese developers who are the titans of the genre but have been slow to adopt the technology. They've relied more on delay-based netcode, which provides a much less consistent or enjoyable experience. Or, in the case of <a href=\"https://arstechnica.com/gaming/2016/02/street-fighter-v-review-definitely-good-definitely-unfinished/\"><em>Street Fighter V</em></a>, half-baked rollback that provides as many frustrating online experiences as it offers good ones.</p><p>We've already published what is probably the most <a href=\"https://arstechnica.com/gaming/2019/10/explaining-how-fighting-games-use-delay-based-and-rollback-netcode/\">comprehensive explanation of fighting game netcode and how rollback works</a>.&nbsp;It's a deep dive, with both technical explanations and a lot of short video clips to demonstrate the concepts—I highly recommend it for the curious. Here's a quote from it that acts as a quick summary if you don't want to dig in:</p><blockquote><p>Since a game's choice of netcode can never magically change the distance between a player and their opponent or prevent networks from dropping or delaying information, you may wonder how one netcode strategy could be drastically better than any other. The key lies in how the netcode handles uncertainty.</p><p>When there is no information from the remote player, delay-based netcode needs to pause and wait, as described in detail on the previous page. Rollback's main strength is that it never waits for missing input from the opponent. Instead, rollback netcode continues to run the game normally. All inputs from the local player are processed immediately, as if it was offline. Then, when input from the remote player comes in a few frames later, rollback fixes its mistakes by correcting the past. It does this in such a clever way that the local player may not even notice a large percentage of network instability, and they can play through any remaining instances with confidence that their inputs are always handled consistently.</p></blockquote><p>In short, good rollback feels much more like offline. Your timing is the same as offline, and with reasonable ping, it's almost indistinguishable from sitting next to your opponent. Even matches played from California to New York, or across the ocean can be very playable, with minimal visual skipping.</p><h2>Enter <em>Guilty Gear</em></h2><p>Back in late 2019 <a href=\"https://arstechnica.com/gaming/2019/11/interview-with-guilty-gear-creator-daisuke-ishiwatari/\">I interviewed Daisuke Ishiwatari</a>, the creator of the <em>Guilty Gear</em> series, about the upcoming release of the latest version of his game. I didn't know the pandemic was just around the corner, but I did want to ask him about rollback netcode. The previous <em>Guilty Gear</em> games didn't have it, and their online experience suffered for it. Even in a world where offline play exists, it's much more convenient to hop online at home to play whenever you want. Did the designers intend to do the work to add rollback to the game?</p><p>Daisuke's response didn't engender a ton of confidence, but it did leave the door open for hope:</p><blockquote><p>Where we are right now at ArcSys, in terms of rollback netcode, is we haven't really arrived at the conclusion that we'll need a super programmer as much, as the engineering team is kind of divided, actually. There are some that say this would be really good and others that say, you know, implementing this wouldn't really work with the <em>Guilty Gear</em> system. And it makes sense for a game like <em>Street Fighter</em>, but how <em>Guilty Gear</em> is designed—this wouldn't really fit the bill. So we're actually right in the middle of investigating on the engineering team how that might look.</p></blockquote><p>His quote from my interview was <a href=\"https://twitter.com/aurich/status/1197276837191147520\">widely spread on Twitter</a> as part of an outcry from fans for the developers to take netcode seriously. It became difficult to find any discussions of the game that didn't include hopes about rollback. The question was, would the developers listen?</p><p>Turns out they did, and I was able to hop online and play some sets to get a hands -on feel for how both the game and netcode feel.</p></div><nav>Page: <span>1 <a href=\"https://arstechnica.com/gaming/2021/02/how-guilty-gear-saved-its-online-play-in-a-post-offline-world/2/\">2</a> <a href=\"https://arstechnica.com/gaming/2021/02/how-guilty-gear-saved-its-online-play-in-a-post-offline-world/2/\"><span>Next <span>→</span></span></a></span></nav></section></div></div>","author":"Aurich Lawson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6fbe40f96f5421e194f9bf6d2ede7319a474de6992f14826a50f878da02914f9","category":"Tech"}