{"title":"Useful iPhone Tips You Might Not Know","link":"https://www.macrumors.com/2021/02/12/iphone-tips-february-2021/","date":1613170829000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/12/iphone-tips-february-2021/\"><p>There seem to be an endless number of <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> tips and tricks to share, and that's because Apple's smartphones are so feature rich that it's impossible to keep up with everything they're capable of. We've rounded up some useful tips and hacks in our latest video, so check them out to see if there's something you didn't know about.</p><ul><li><strong>Swipe to Numbers with Keyboard</strong> - If you press and hold on the number key and then swipe up to type the number that you want, when you release a finger, it will go back to the main keyboard so there's no need to tap twice to get a number character.</li><li><strong>Create Perfect Shapes in Notes</strong> - If you draw a shape in Notes or anywhere else the Markup interface is available, it will morph into a perfect shape. So if you need a visual aid like a circle, draw a wonky version and the ‌iPhone‌ or <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> will fix it right up.</li><li><strong>Check your iPhone Warranty</strong> - Open up the Settings app, tap \"General,\" choose \"About,\" and then tap on the \"Warranty\" entry to see your warranty information for your device.</li><li><strong>Use Your Apple Watch as a Viewfinder</strong> - The Camera Remote app on the Apple Watch activates the front or rear camera of your ‌iPhone‌ so you can use your Apple Watch as a handy viewfinder. If you take your watch off and wrap it around your ‌iPhone‌, you can use the rear camera while also seeing yourself, which is useful for vlogging.</li><li><strong>Combine Images with a Shortcut</strong> - You can use an app to combine images, but it's easier to use a simple shortcut. Open Shortcuts and tap \"+\" to add a new one. Type in \"<a href=\"https://www.macrumors.com/guide/photos/\">Photos</a>\" and choose \"Select ‌Photos‌\" for the first action. For the second, search for \"Combine\" and select \"Combine Images.\" Change the details to say \"Combine ‌Photos‌\" and \"In a Grid.\" After that, search for \"Save\" and choose \"Save to Photo Album.\" You can make it fancier with extra steps, but this is all you need to select a series of photos and have them arranged in a grid formation, with the final result saved to the ‌Photos‌ app. There are also <a href=\"https://www.icloud.com/shortcuts/a80556f68cbb4d3d910b090836cc802b\">third-party shortcuts</a> that you can use.</li><li><strong>Auto Schedule Low Power Mode</strong> - You can create a quick shortcut for turning on Low Power Mode when the battery dips to a specific level. In the Shortcuts app, create a new Automation, and start out by choosing \"Battery Level.\" From there, select your desired percent. For the next action, search for and choose \"Low Power Mode.\" Deselect \"Ask Before Running,\" and the next time your ‌iPhone‌ battery drops to the target level, Low Power Mode will activate automatically.</li><li><strong>Find Out What Song is Playing</strong> - If you want to know what music is playing you can ask <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a>, but if you want to know what song is in a video on your ‌iPhone‌ or what song your device is playing, there's a Shazam Music Recognition option that you can add to Control Center.</li><li><strong>AirDrop to Any Device</strong> - If you use <a href=\"https://snapdrop.net/\">Snapdrop.net</a>, you can \"AirDrop\" a file from one device to another, even non-Apple devices. This isn't Apple's AirDrop, but it's basically the same thing and it allows for super quick data transfers even if you have a PC or Android phone. It's as simple as opening up the website on both devices and drag and drop the file.</li></ul><p>Have a favorite lesser-known ‌iPhone‌ trick that we didn't list here? Let us know in the comments.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/useful-mac-accessories-worth-checking-out/\">Useful Mac Accessories Worth Checking Out</a></h3><p>Wednesday February 10, 2021 1:21 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>If you recently picked up one of the new M1 Macs that Apple released in November, or received a new Mac for the holidays, you may be in search of useful accessories to go along with it. In our latest YouTube video, we rounded up some great Mac accessories that are worth checking out. Subscribe to the MacRumors YouTube channel for more videos. MacRumors videographer Dan has highlighted several ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/intel-anti-mac-ad-campaign/\">Intel's Anti-Mac Ad Campaign Highlights M1 Shortcomings</a></h3><p>Thursday February 11, 2021 5:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of the M1 Macs last November, Apple officially began its transition away from Intel's chips, and it's clear from Intel's latest advertising campaign that the company is feeling threatened by Apple's decision. In ads shared on Twitter, Intel has been highlighting the shortcomings of Apple's M1 Mac lineup. An ad this week, for example, points out the gaming capabilities of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/apple-privacy-chief-slams-north-dakota-bill/\">Apple Privacy Chief: North Dakota Bill 'Threatens to Destroy the iPhone as You Know It'</a></h3><p>Wednesday February 10, 2021 1:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>The North Dakota Senate this week introduced a new bill that would prevent Apple and Google from requiring developers to use their respective app stores and payment methods, paving the way for alternative app store options, reports The Bismarck Tribune. According to Senator Kyle Davison, who introduced Senate Bill 2333 yesterday, the legislation is designed to \"level the playing field\" for...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/2016-2017-macbook-pro-battery-charging-issue/\">Apple Offering Free Battery Replacements for 2016-2017 MacBook Pros That Can't Charge Past 1%</a></h3><p>Tuesday February 9, 2021 4:45 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today released macOS Big Sur 11.2.1 to address an issue that may prevent the battery from charging in some 2016 and 2017 MacBook Pro models, and the company has since shared a new support document with more details. Apple says a \"very small number of customers\" with 2016 and 2017 models of the 13-inch and 15-inch MacBook Pro have experienced an issue with the battery not charging past...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"704877caafcff756faba77743218b3723425141f0853b4279f3bb725f4092a0d","category":"Apple"}