{"title":"Cyclist’s 31 Inspirational Women No7: Cherie Pridham","link":"https://www.cyclist.co.uk/sponsored/9297/cyclist-s-31-inspirational-women-no7-cherie-pridham","date":1614710533000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><a href=\"https://www.cyclist.co.uk/tags/zwift-womens-history-month\"><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/02/31_inspirational_women_clickable_logo_new.jpg\" alt=\"Cyclist's 31 Inspirational Women\"></a></p><p><strong>To celebrate International Women's Month, we have partnered with Zwift to tell the stories of 31 inspirational women across 31 days</strong></p><p><strong>Words</strong>: Maria David</p><p>Since the announcement of her appointment as sports director at men’s WorldTour team Israel Start-Up Nation in December, it’s fair to say Cherie Pridham has received an unprecedented amount of interest.</p><p>The 49-year old from Derby takes it all in her stride. After all, managing men’s cycling teams is second nature to her by now, given that she’s done it since 2006 when she retired from riding herself.</p><p>From managing the Under-23 squad at Raleigh – a team that she later owned – to managing Vitus Pro Cycling, which included Ed Clancy and Scott Thwaites, and now Israel Start-Up Nation, Cherie has certainly earned her stripes over the years.&nbsp;</p><p>Despite the attention she has received, she doesn’t see the challenges of the sports director – or DS (directeur sportif) – role as being gender-specific, but purely job-specific. For Cherie, it is simply about putting in the time and effort to learn the ropes in what is a very demanding job.</p><p>The Israel Start-Up Nation DS summarises her take on the role:</p><p>‘My partner Eddie was a pro cyclist and a team manager while I was racing. He was the junior national road coach for British Cycling at the time, so I got to sit with him in the team car when he was driving and saw what was happening in the convoy.</p><blockquote><p>If you start to see yourself as different, in my mind you are already on the back foot. You need to see yourself as equal, first and foremost</p></blockquote><p>‘He also took me to team managers’ meetings, so I got a feel for the role even at a time when I didn’t realise that was the direction I would be going in.</p><p>‘When I was racing, I never saw DS as a role I wanted to have. I thought I was going to be a masseur or soigneur if I stayed in the sport.</p><p>‘I never gave it a thought until the back end of my career when I started coaching younger riders and realised I had a knack for doing it. The opportunity to take it further arose after a hit-and-run accident while I was out training, and things progressed from there.</p><p>‘Back then, I never really realised how iconic the position at Raleigh was. I can’t compare my Team Raleigh today with the iconic days of Team Raleigh in the 70s and 80s when riders were winning stages of the Tour de France – the Peter Post era – but no one can take away from me the fact that I was team manager, and owner, of Team Raleigh.</p><p>‘If there’s any kind of advice I could give, I’d say be yourself. If you start to see yourself as different, in my mind you are already on the back foot. You need to see yourself as equal, first and foremost.</p><p>‘And I think in anything you do you need to be able to do the job, be competent, and confident, and if you’re good enough for the job it doesn’t matter if you’re male, female or whatever. If you deserve the position that you’ve been entrusted with then just crack on.</p><p>‘I’ve had so many people reach out to me in the last two or three months – particularly 13 and 14-year old girls. They tell me they would never have thought they could be a DS, but after seeing me they had realised, ‘Well if she can do that, I would like to have a go’.</p><p>Not that being a DS is an easy job. ‘It’s extremely mentally taxing when we have to drive and race and deal with the tactics and all the pressures that there are.</p><p>‘You just have to be strong. You can’t learn it and become a DS overnight. It’s a progression and you have to learn the job over many years.</p><p>‘You have to put in the same level of dedication as you would with running a business or preparing for a competition. It’s what I call the three Ds – dedication, discipline and determination.</p><p><strong>Find the rest of <a href=\"https://www.cyclist.co.uk/tags/zwift-womens-history-month\"><em>Cyclist's 31 Inspirational Women</em></a> here</strong></p><p>‘Your gender doesn’t come into it. If you can do the job and you’re competent and confident, then off you go.</p><p>‘I don’t see myself as a trailblazer. To me, I’ve been performing the DS role in the UK for over a decade now. I was the only female DS in the UK at that level, and for a while the only one in Europe.</p><p>‘But I didn’t think about it really. I just got on with my jobs professionally at Team Raleigh and then at Vitus Pro Cycling, and now that I am at Israel Start-Up Nation I also just want to get going and get on with the season.</p><p>‘I love my job, and I see it as a hell of a privilege, to be able to do a job like this. It’s just mind-blowing.’</p><p><strong>For more from Zwift this International Women's Month</strong>,&nbsp;<a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5632921130&amp;iu=/359/impcount.co.uk\" target=\"_blank\">visit here</a>.</p></div></div>","author":"mjames","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"708b6ef31bacc388c3b6a43ab3b003ac627659ecba0a4d482c3e57e5cc7eb716","category":"Cycling"}