{"title":"Deep in the heart of Texas’ collapsing power grid","link":"https://arstechnica.com/?p=1743386","date":1613663825000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>The big freeze —</h4><h2 itemprop=\"description\">Everything in Texas went wrong at once.</h2></header><section><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/texas-power-disaster-800x450.jpg\" alt=\"Deep in the heart of Texas’ collapsing power grid\"><figcaption><p>Aurich Lawson / Getty Images</p></figcaption></figure><p>Texas is now entering its third day of widespread power outages and, although supplies of electricity are improving, they remain well short of demand. For now, the state's power authority suggests that, rather than restoring power, grid operators will try to shift from <em>complete</em> blackouts to <em>rolling</em> ones. Meanwhile, the state's cold weather is expected to continue for at least another day. How did this happen?</p><p>To understand what's going on in Texas, and how things got so bad, you need quite a bit of arcane knowledge—including everything from weather and history to the details of grid structure and how natural gas contracts are organized. We've gathered details on as much of this as possible, and we also talked to grid expert <a href=\"https://energyenvironment.pnnl.gov/staff/staff_info.asp?staff_num=1509\">Jeff Dagle</a> at Pacific Northwest National Lab (PNNL). What follows is an attempt to organize and understand an ongoing, and still somewhat chaotic, situation.</p><h2>Why is Texas so much worse off?</h2><p>While other states have seen customers lose power, Texas has been hit the hardest, with far more customers losing power for substantially longer.</p><p>One key reason for this is because Texas maintains its own power grid largely in isolation from those of its neighbor states. In North America, most customers are served by two major grids that operate on the same alternating current frequency—one serving the eastern half of the continent (including the US, Canada, and parts of Mexico) and the other serving the western half. However, Texas—along with Quebec—both maintain power grids that are largely separate from these larger networks.</p><p>So, while problems elsewhere in the Midwest were partly buffered by generating capacity elsewhere in the country, Texas was on its own. It does have interconnections with neighboring grids, but they don't offer much in the way of capacity—and they weren't built for importing power anyway. According to Jeff Dagle of PNNL, these interconnections were mostly built by utilities near the border between grids so that the utilities could use power from whatever source happened to be cheapest at the time. Only half a dozen of these interconnects exist, and they can only handle a few hundred Megawatts each. This is simply \"too small to matter,\" as Dagle put it.</p><p>Given that Texas and Quebec are both fierce defenders of their independence, it's tempting to view their insistence on maintaining their own grids as something of a caricature. But it's a caricature rooted in reality. Grids began to integrate because the easiest places to generate power—near large coal fields, for example—weren't necessarily close to large population centers. Texas remained relatively isolated during this buildout period because there weren't real advantages to integrating with its neighbors. Its grid ended up managed by ERCOT, the <a href=\"http://www.ercot.com/about\">Electric Reliability Council of Texas</a>, a nonprofit with a complicated state/private governance structure.</p><figure><img alt=\"The map of the areas served by ERCOT. By not extending across the borders to other states, Texas has limited the federal regulation of its grid.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/ercot-map.jpg\" width=\"602\" height=\"608\"><figcaption><p>The map of the areas served by ERCOT. By not extending across the borders to other states, Texas has limited the federal regulation of its grid.</p></figcaption></figure><p>Then, when some degree of national power grid regulation began, it was done under the federal government's constitutional ability to regulate \"interstate commerce.\" By purposely keeping its grid within the borders of Texas, the state limited the impact of federal standards and regulations. This deep-seated aversion to regulation recently prompted former US Energy secretary and Texas Governor <a href=\"https://www.republicanleader.gov/whats-up-in-texas/\">Rick Perry to quip</a>, \"Texans would be without electricity for longer than three days to keep the federal government out of their business.”</p><h2>How did a cold snap trigger this crisis?</h2><p>The typical power demand profile in Texas would show a big peak in the summer, when most of the state has to run air conditioning 24 hours a day to keep its inhabitants from melting. Because of this, power generators schedule needed maintenance and upgrades for the winter months, when demand is generally lower. As a result, the Texas grid is less able to match spikes in demand during the winter.</p><p>And the recent cold snap set off a huge spike in demand. Lots of buildings in Texas are heated by electricity, and the cold, which blanketed the entire state, sent demand for heating through the roof. Natural gas is typically used where electricity isn't, and its increased use also set off a competition for gas supplies, which quickly became limited for reasons we'll get back to in a moment.</p><p>Typically, grid managers have a set of reserve plants that can be brought online if demand spikes suddenly. In a competitive electricity market, prices will rise if demand threatens to exceed supply, inducing producers to activate idle plants. For some reason, this didn't work out in Texas. ERCOT places a cap of $9,000 per Megawatt-hour on the cost of power in its grid. At various times after the cuts began, however, prices were only $1,200 per Megawatt-hour, and the Public Utilities Commission of Texas <a href=\"https://www.puc.texas.gov/51617WinterERCOTOrder.pdf\">isn't sure why</a>.</p><p>But even if reserves and economics had all kicked in, Texas wouldn't have avoided problems, because generating sources were shutting down left and right.</p></div><nav>Page: <span>1 <a href=\"https://arstechnica.com/science/2021/02/even-power-disasters-are-bigger-in-texas-heres-why/2/\">2</a> <a href=\"https://arstechnica.com/science/2021/02/even-power-disasters-are-bigger-in-texas-heres-why/2/\"><span>Next <span>→</span></span></a></span></nav></section></div></div>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"70aabed35e05ac18a7256960826f014393080ad71f637af09c3b857d2ccc6358","category":"Tech"}