{"title":"E3 SaxoBank Classic implements new barriers","link":"https://cyclingtips.com/2021/03/e3-saxobank-classic-implements-new-barriers/","date":1615831655000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Roadside barriers at the 2020 BinckBank Tour.</h4><p></p><div><p>The E3 SaxoBank Classic, which takes place on 26 March, has introduced new roadside barriers alongside a robot that measures body temperature and instructs spectators to wear a mask.&nbsp;</p><p>The new barriers were produced to increase safety in sprint finishes, specifically to avoid spectators leaning in front of the oncoming race to take pictures.</p><p>“The Race Barrier” by Belgian company <a href=\"https://www.boplansport.com/en#nieuws\">BoPlan</a> is 1.40 metres high with 70-degree angle side panels. Each panel is two metres wide. They are made out of impact absorbing polymers and have no feet, which in the past have caused crashes in finishing sprints. The 70-degree angle is to prevent fans from hitting riders with phones when they try to capture the action from the roadside.</p><p>The barriers can be seamlessly connected with a tongue and groove system. This gives them continuous advertising space. They can also be filled with water to make them heavier, a necessity for windy Dutch finishes. The barriers used in the Tour of Poland that increased the damage of the incident with Fabio Jakobsen weren’t properly secured, when ridden into they came apart upon impact. The BoPlan website stated, “a few recent incidents in cycling have shown that more security during bike races is absolutely necessary.”</p><p>The organization of the E3 SaxoBank Classic also presented their newest staff members, Wielerflits reports. The Belgian company Zorabotics will provide four robots capable of counting how many people are present and measure their body temperature. The robots can even tell spectators to wear their mask properly.</p><p>The UCI recently launched an extensive safety plan to make road cycling safer. It does include recommendations on barrier use that will only come into effect in 2022 to enable organizers to buy or rent new barrier systems.&nbsp;</p><div><h5>Tags</h5></div></div></div>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"729975dcdd15c8bf9ac7ecc6063ad591bc42cb3361c7d3e019024c4f0000b9b3","category":"Cycling"}