{"title":"Gianni Moscon says his image ‘doesn’t correspond with the reality’","link":"https://cyclingtips.com/2021/12/gianni-moscon-says-his-image-doesnt-correspond-with-the-reality/","date":1639235364000,"content":"<div><div><p>Gianni Moscon is preparing for a new chapter with <a href=\"https://cyclingtips.com/2021/09/gianni-moscon-is-headed-to-astana/\">Astana Qazaqstan</a> after six turbulent years with the Ineos Grenadiers, a chapter that will be remembered more for controversy than racing results. </p><p>Since turning pro with then Team Sky in 2016, Moscon has developed into a punchy rider with a penchant for Spring Classics, and a valued teammate on flat and rolling terrain during Grand Tours and stage races.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/GettyImages-1313634937-1340x894.jpg\"><figcaption>Gianni Moscon celebrates a win from the breakaway on stage 3 of the 2021 Tour of the Alps.</figcaption></figure><p>But it’s <a href=\"https://cyclingtips.com/2020/03/gianni-moscon-bike-throw-kuurne-brussels-kuurne/\">Moscon’s controversies</a> that currently outweigh his palmarès. The 27-year-old was handed a six-week ban and a formal written warning from his team for racially abusing Kevin Reza (then FDJ) at the 2017 Tour of Romandie; he was expelled from the 2018 Tour de France for aiming a punch at Elie Gesbert; and disqualified during the 2020 Kuurne-Brussel-Kuurne for aiming a bike at Jens Debuscherre (B&amp;B Hotels) after getting caught up in a crash.</p><p>“I think that the people who really know me also know what I’m like,” Moscon told CyclingNews from his first training camp with Astana Qazaqstan this week. “Obviously, over the years, some episodes happened and they were presented in a certain way. And the context in which I found myself also contributed to creating an image of me that doesn’t correspond with the reality.”</p><p>Even while storms raged around him, the 27-year-old has remained fairly quiet off the bike, rarely ever weighing in on the conversation. And towards the end of this season, he was praised for his level-headedness following <a href=\"https://cyclingtips.com/2021/10/sonny-colbrelli-emerges-out-of-the-mud-victorious-at-paris-roubaix/\">this year’s Paris-Roubaix</a> where he suffered a double dose of bad luck while off the front, puncturing and then crashing after going solo with 50 km to go. Some consider the maturity he showed a sea-change in the rider’s character.</p><p>“Unfortunately, many times it’s difficult for journalists to understand what the situation really is,” Moscon said. “Everybody writes what they feel, and sometimes the situations were described in the wrong way. It was a series of things, but I never changed. The person you saw at Roubaix is who I am. Obviously I’ve matured, but fundamentally, I’m the same person.</p><p>“Maybe five years ago, I would have reacted differently to what happened at Roubaix, but in a situation like that, a puncture, there’s nobody to blame and there’s no point in getting angry, either with somebody else or with myself. I think there’s anger when the responsibility lies with somebody in particular. But if nobody is at fault, then it’s pointless. It happened like that and now I’m just thinking about the next Paris-Roubaix.”</p><p>Like most who wear the colours of the Ineos Grenadiers, Moscon was required to sacrifice many of his own aspirations for those of his teammates. As he’s progressed through the ranks, he’s exchanged a summer domestique role for a protected ride at one-day events and smaller stage races. But a move to Astana Qazaqstan will give him more authority over his season.</p><p>“I see them as six years that still gave me a lot. I felt good at Sky and then at Ineos,” said Moscon. “It’s just that the moment to change has come. </p><p>“In the past years, I didn’t collect much in terms of results, but I gained a lot of experience. I had some personal satisfactions, but obviously the team decided my role and I often had to ride in support of leaders, especially in the Grand Tours. I often built my season around those races, so the races that suited me were often sacrificed. But in any case, I’m happy with those six years.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/GettyImages-1320820647-1340x893.jpg\"><figcaption>Moscon and the Ineos Grenadiers celebrate Egan Bernal’s 2021 Giro d’Italia victory.</figcaption></figure><p>Moscon’s transfer got off to a worrying start thanks to a heart scare that reared its head during the World Championships in Leuven.</p><p>“My heart rate rose suddenly during a medium effort on the climb, and I realised it was a bit of an anomalous situation so I knocked off my effort straight away,” Moscon explained. “But the problem went away and my heart rate stayed stable for the rest of the race.”</p><p>He raced Paris-Roubaix the following weekend, and then during his off-season, he underwent testing in Ancona to make sure he wasn’t at risk. Moscon revealed that the episode during Worlds was the fourth or fifth of its kind throughout his career, and earlier tests had identified a minor genetic defect. With these new tests, he’s in the clear.</p><p>“The problem is already behind me,” Moscon said. “The tests proved the defect was minimal, so the ablation surgery wasn’t necessary. It was good to do all the tests just to be sure that everything will go well for the start of the new season.”</p><p>Moscon is yet to confirm his 2022 programme, but he’s expected to be given free rein as Classics leader, and he’ll be looking for a Paris-Roubaix ride that is free of misfortune.</p><p>“Long distances are what suit me. I’m an endurance athlete,” he said. “After five hours, I can be up there with the best. But I always say that the most beautiful race is the race that you win. It doesn’t matter which one: the important thing is to win something.”</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"73a7c2dad523a229ede8fec275e2510bb878b3e59c7d20da4e064dd37817e440","category":"Cycling"}