{"title":"From a shattered collarbone to Olympic glory in eight weeks","link":"https://cyclingtips.com/2021/07/from-a-shattered-collarbone-to-olympic-glory-in-eight-weeks/","date":1627353530000,"content":"<div><div><p>In early June, Tom Pidcock lay in a Girona hospital bed recovering from surgery, wondering whether his Olympic dream was dead in the water. </p><p>The Brit’s collarbone had just been reassembled after being shattered into five pieces in a training incident. The 21-year-old was descending at speed in Andorra, preparing for a start at the Tour de Suisse for Ineos Grenadiers, when the unthinkable happened.</p><p>“We don’t know what exactly happened, but Tom was hit from the side by a car,” said Kurt Bogaerts, Pidcock’s coach and mentor. On the road Pidcock’s Pinarello lay shattered into pieces, just like his collarbone. </p><p>You’d be forgiven for thinking that was game over for even starting an Olympic mountain bike race in July. But you’re not Tom Pidcock.</p><blockquote></blockquote><h2>A multidisciplinary master</h2><p>Pidcock is a staggering talent in a sport that’s currently filled with them, drifting between disciplines with ease.</p><p>Cyclocross? He’s been world junior and U23 champion, and got a silver medal behind another prodigy, Mathieu van der Poel, in his first year as a senior.</p><p>Road? Pidcock has medalled at the U23 Worlds, has won the Baby Giro and the Paris-Roubaix Espoirs. In 2021 he signed his first pro contract, and riding for Team Ineos, he podiumed at three one-day classics, was <a href=\"https://cyclingtips.com/2021/04/making-sense-of-the-controversial-photo-finish-at-amstel-gold/\">edged out at Amstel Gold by the tiniest of margins</a>, and won Brabantse Pijl.</p><p>Mountain bike? He’s won both World Cup rounds and U23 World Championships in a couple of different disciplines. </p><p>But with a collarbone in pieces and eight weeks to turn it around, Pidcock had his toughest battle ahead of him. </p><p>Seven days after surgery, <a href=\"https://cyclingtips.com/2021/06/tom-pidcock-is-astonishingly-back-on-the-bike/\">he was, astonishingly, back on the bike</a>. Pidcock posted video footage on Instagram of him riding out of the saddle, doing push-ups, and riding on the trainer.</p><blockquote></blockquote><p>“With normal training he will get ready for the Olympics just as well,” his coach told media at the time.</p><p>“It won’t be boring, it’s now just another road to Tokyo.”</p><h2>The end of that chapter</h2><p>That road to Tokyo reached its end yesterday: at the dusty, treacherous conditions of the Izu mountain bike course.</p><p>Pidcock was quick off the line, sitting within the top four for much of the first lap. He narrowly avoided getting brought down by a crashing Mathieu van der Poel at the Sakura Drop course feature, and by lap two he had moved up to second. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033345-019-1340x893.jpg\"><figcaption>The two cross-disciplinary prodigies of the men’s MTB race had very different experiences.</figcaption></figure><p>Pidcock’s first dig came on lap three, moving him to the lead although not shaking the pair of highly fancied Swiss hangers-on, Mathias Flueckiger and Nino Schurter. He went again on lap four, stretching them out until they snapped, and rode clean lines to the finish to claim Olympic gold. </p><p>It was a staggering display of craft from the young Brit, but it was all the more impressive considering the path he’d taken there. Ecstatic and a little stunned, Pidcock grasped to articulate it all. “I’ve trained really hard,” he said. “I knew I was in great shape, but there’s always doubt when I haven’t performed in a race.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033345-078-1340x893.jpg\"><figcaption>Pidcock leads Nino Schurter and Mathias Flueckiger on lap three. Schurter would miss the podium to finish fourth, while Flueckiger would end up with silver.</figcaption></figure><p>Pidcock’s recovery came down to the line, having initially received advice from the doctor about his collarbone that “in six weeks maybe it’ll be strong enough to ride mountain bikes. </p><p>“I think after four or five, I did a mountain bike race. In the back of my head, I thought ‘I’m going to get to the Olympics … I’m not going to be in my best shape, we’re just going to see how it is.’</p><p>“But the last week I knew I was in really good shape … there was always doubt in the back of my head because I haven’t raced … but once the race is going, it becomes routine really.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033345-068-1340x893.jpg\"><figcaption>An exhausted, elated Pidcock, draped in the Union Jack.</figcaption></figure><p>For now, it’s all just sinking in for Pidcock – that remarkable win and <em>that</em> recovery. From lying on the road in Andorra to a Tokyo podium; eight weeks to the day since his collarbone was shattered into five pieces.</p><p>He’s got races to ride – on road, off road, on the cyclocross track – and is eyeing off a possible start at the 2021 Vuelta a España. But for now, at least, there are other priorities.</p><p>“I’m first going to celebrate this and then see what’s possible later on,” he told the BBC. “I’ve got a gold bike to show off in mountain biking now, so we’ll have to sort that out.”</p></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"73ad7dec840364db919e4ebcdc346831c5a4c06ad18e5b28f6b92bcffdef3977","category":"Cycling"}