{"title":"Carjackings are up—and gig workers are getting victimized","link":"https://arstechnica.com/?p=1742084","date":1613221210000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>unfamiliar neighborhoods —</h4><h2 itemprop=\"description\">Opportunistic thieves lie in wait when drivers leave their cars running.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/doordash-800x534.jpg\" alt=\"A DoorDash Inc. delivery person arranges an order in the back of a vehicle outside of a DoorDash Kitchens location in Redwood City, California.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/doordash.jpg\" data-height=\"683\" data-width=\"1024\">Enlarge</a> <span>/</span> A DoorDash Inc. delivery person arranges an order in the back of a vehicle outside of a DoorDash Kitchens location in Redwood City, California.</p><p>Bloomberg | Getty Images</p></figcaption></figure><p>A DoorDash driver named Jeffrey Fang was returning to his minivan in San Francisco after completing a delivery last week when he <a href=\"https://www.washingtonpost.com/nation/2021/02/07/doordash-driver-kids-car/\">noticed a stranger in his car</a>. After a struggle, he told a <a href=\"https://sanfrancisco.cbslocal.com/2021/02/08/video-children-in-san-francisco-stolen-delivery-vehicle-found-safe-suspects-remain-at-large/\">local news outlet</a>, another person, an accomplice, got behind the wheel and drove away. Fang’s children, 4 and 1, were still buckled inside.</p><p>Four hours later, after a <a href=\"https://www.kqed.org/arts/13892479/san-francisco-jeffrey-fang-children-carjacking-kidnapping\">frantic search</a> by neighbors and law enforcement, the minivan was found in another San Francisco neighborhood, with the children safe and unhurt inside.</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/wired-logo.png\" width=\"218\" height=\"58\"></figure><p>Fang later <a href=\"https://www.nytimes.com/2021/02/10/us/doordash-children-van-missing.html\">told <em>The New York Times</em></a> that it was hard to find and pay for childcare during the peak dinnertime delivery hours, so he would often bring the kids along with him as he worked for DoorDash. “Most of the people in the gig economy, we’re trying to make it,” he said. “We’re doing what we can, but the odds are stacked against us. It’s not easy. Oftentimes, we have to balance between impossible choices.”</p><p>Similar horrifying scenes have played out elsewhere. In January, two Washington, DC, children were <a href=\"https://www.nbcwashington.com/news/local/vehicle-carjacked-with-two-children-inside-in-dc/2538129/\">kidnapped during a carjacking</a> when a parent left the vehicle to make an <a href=\"https://www.wired.com/tag/uber/\">Uber</a>Eats delivery. They were also found unhurt. Also in DC, a carjacker who had swiped the vehicle of an Uber Eats driver <a href=\"https://www.washingtonpost.com/local/public-safety/washingtondc-carjackings/2020/10/02/a755ef96-0404-11eb-b7ed-141dd88560ea_story.html\">struck the delivery worker</a> plus a woman and two children on a nearby sidewalk as he tried to drive away.</p><p>Across the country, local police departments say carjackings are up. So, too, are home deliveries amid the Covid pandemic. DoorDash <a href=\"https://www.wired.com/story/doordash-shows-delivery-profitable-pandemic/#:~:text=DoorDash%2C%20the%20biggest%20of%20the,than%20%24600%20million%20in%202019.&amp;text=Documents%20filed%20by%20DoorDash%20last,third%20quarter%2C%20totaling%20%2443%20million.\">announced its first quarterly profit</a>, and <a href=\"https://www.wired.com/story/why-instacart-laying-off-workers-deliveries-soar/\">Instacart</a>, <a href=\"https://www.wired.com/story/ubers-food-delivery-company-losing-money/\">Uber Eats</a>, Grubhub, and Amazon have all reported record business.</p><p>Inevitably, some of those carjackings involve delivery drivers, who sometimes leave their cars running while dropping off food or packages. “We’re seeing carjackings and thefts on the rise nationwide,” Danielle McDonald, a law enforcement liaison for Uber, told reporters at a DC press conference this week.</p><p>No one collects national data on carjackings; local departments often group carjackings with other auto thefts or violent crimes. Grubhub and Uber say they keep track of crimes targeting drivers, but they declined to share any details. Exact numbers, then, are difficult to come by.</p><h2>“Targets on our backs”</h2><p>But the local figures are dispiriting. Minneapolis police <a href=\"https://patch.com/minnesota/southwestminneapolis/ways-avoid-carjacking-minneapolis-police-provide-tips\">reported 405 carjackings in 2020</a>, more than three times the number in 2019. Police in Louisville, Kentucky, said they saw <a href=\"https://www.wdrb.com/news/federal-task-force-to-investigate-rash-of-violent-carjackings-in-louisville/article_f8eeba92-dd74-11ea-8a00-fbad73d49d58.html\">30 carjackings in July</a>, compared with four in the same month a year earlier. In Washington, DC, last year, carjackings rose 143 percent, according to local law enforcement. Neighboring Montgomery County, Maryland, issued a warning in January about an uptick in carjackings, many involving people who had left their vehicles running while picking up food deliveries. Oakland, California, police say <a href=\"https://www.facebook.com/oaklandpoliceca/posts/3733942786728458\">carjackings rose 38 percent</a> in the city last year, and victims included “delivery and ride-share drivers.”</p><p>Chicago carjackings rose by 135 percent in 2020, to 1,415. The Chicago Independent Drivers Guild, an advocacy group for ride-hail drivers, says dozens of Chicago ride-hail and delivery workers have been victimized by carjackers in the last few months. “We are driving around with targets on our backs,” Kevin Nelson, an IDG organizer and ride-hail driver, said in a statement.</p><p>Delivery workers are particularly vulnerable to carjacking, and especially right now, says Michael Cherbonneau, a professor of criminology and criminal justice at the University of North Florida who studies street crime. “They’re not from the area, they may not be familiar with it, they may leave their car running to go to drop off packages,” he says. The interruption of routines during the pandemic might make delivery drivers more vulnerable too. There may be fewer people on the street. And many people are <a href=\"https://www.wired.com/story/how-to-double-mask/\">wearing masks</a>, so drivers are less alert when a masked person approaches them, giving a potential thief the element of surprise.</p><p>The pandemic may also contribute to the rise in carjackings in other ways. Like other violent offenders, carjackers tend to be under 25, Cherbonneau says, and it’s possible that teens, out of in-person school, have more unsupervised time to commit crimes. Cherbonneau also notes the possible effect of <a href=\"https://www.wired.com/story/george-floyd-protest-photography/\">last summer’s social justice protests</a> after the killing of George Floyd, as some police departments <a href=\"https://www.propublica.org/article/what-can-mayors-do-when-the-police-stop-doing-their-jobs\">have appeared</a> <a href=\"https://www.wsj.com/articles/as-new-york-city-police-make-fewer-arrests-violent-crime-rises-11597600800\">to respond</a> with work slowdowns.</p><p>The effects of carjacking can last for a long time, even when authorities are able to recover the car. “This is a very traumatic event for a lot of victims. Most people consider their car a safe and sacred place, almost an extension of their house,” says Christopher Herrmann, an assistant professor at CUNY John Jay College of Criminal Justice and a former crime analyst supervisor with the New York City Police Department. “With the gig workers, I feel really bad for them because it’s also their workplace.”</p><p>Independent contractors working for app-based companies are generally not eligible for traditional worker’s compensation, even if they’re hurt while on the job. Many of the companies, including Uber, Lyft, and DoorDash, offer drivers insurance for injuries or damages sustained while driving passengers or delivering goods, at an additional cost.</p><p>In November, California voters <a href=\"https://www.wired.com/story/200-million-uber-lyft-write-own-labor-law/\">passed a ballot measure</a> requiring transportation and delivery companies to provide gig workers with limited accident insurance, up to $1 million. The state’s worker’s compensation laws, by contrast, have no ceiling. “There is compensation for injury,” says Orly Lobel, a professor of employment and labor law at the University of San Diego School of Law, “but it’s not as robust as worker compensation.”</p><p>Driver advocates say the smaller—or nonexistent—coverage is another way gig workers are penalized. “Any interruption to their ability to work can have lasting consequences,” the California-based group Gig Workers Rising said in a statement. “Whether that’s a car accident, illness, or a car break-in—any issue, no matter how small, can have devastating impacts on workers when every delivery or ride counts.”</p><p>App-based companies say they’re aware of the risks to the independent contractors who deliver packages or drive passengers. Uber says it has sent emails and in-app messages to drivers <a href=\"https://www.uber.com/blog/new-york/tips-to-help-you-stay-safe-developed-in-partnership-with-law-enforcement/\" rel=\"nofollow\">about the risks of carjacking</a>. In many cities, an emergency button on its drivers' app will automatically send information to 911. A spokesperson for Grubhub said the company “stands ready to support law enforcement investigations.” Neither Instacart nor Amazon responded to requests for comment.</p><p>In San Francisco, DoorDash CEO Tony Xu responded to last week’s kidnapping and carjacking in a statement, noting that the company has offered financial support to Jeffrey Fang. A <a href=\"https://www.gofundme.com/f/help-the-fang-family-after-children-abducted\">public GoFundMe page</a> has raised $146,000 for the family—<a href=\"https://www.sfchronicle.com/food/article/People-donated-100K-plus-to-a-DoorDash-driver-15938140.php\">well over what Fang usually</a> makes from gig work. DoorDash says it regularly communicates safety tips with those performing deliveries for the app, and that the company is always working to find ways to support delivery people in need of help.</p><p><em>This story originally appeared on <a href=\"https://www.wired.com/story/carjackings-up-gig-workers-victimized/\">wired.com</a>.</em></p></div></div></div>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"73fe22209088a0eab28243e917c9a84e7033abfd33f7b7052bad8ec3c8af5622","category":"Tech"}