{"title":"Baltimore Son: A Black cyclist in America","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/baltimore-son","date":1611147605000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><strong><i>“God painted me Black – thanks for that” Nas</i></strong></p><p><span>There was a ’90s Nike ad taped on my wall at college that inspired me. The backdrop: a lonely road. Late sun. The focus: a person running. Y</span><i><span>ou can run outside country clubs that aren’t built for you</span></i><span> was the poetic way the copy went. I always hated running, but I loved that ad.</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><span>It gave me the sense of doing the lonely work of dreams. It reminded me of the freedom that first unfolded for a ten-year old when my uncle gifted me his hand-me-down </span><span>racer</span><span>.&nbsp; I remember learning to use frame shifters and stopping at curbs because I was too short to put a foot down. Riding all over Baltimore until the street lights came on. But I learned the freedom that comes with riding and what seemed like the early rules of survival.</span></p><p><span>Baltimore is a city of contradictions. The narrative of it as a hard place – </span><span>blame <em>The Wire</em>, maybe</span><span> – is both true and false at the same time. It’s got a stubborn crime rate, yet it’s bucolic and park-filled. It’s a place where the charm of the American South and the industrial nature of the North meet.</span></p><p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/teniel-campbell-trinidads-trailblazer\"><em><strong>Read – Teniel Campbell: Trinidad's Trailblazer</strong></em></a></p><p><span>Baltimore is also deeply territorial and divided on race and racial outcomes. While it’s nestled 40 miles from Washington, DC, the city’s working-class ethic is a world apart. With a population of about 600,000 people, two-thirds of them black, the murder rate is reported to be around 14 times higher than New York City’s by density. Even </span><i><span>without</span></i><span> race on the table, people divide themselves based on what </span><span>neighbourhood</span><span> they come from. The city’s known for its historical redlining, the practice of segregating its housing by race, class and religion. Whites defended their traditionally white communities with racist policies.&nbsp;<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Rouleur_ChrisJ-12_1024x1024.jpg?v=1611147019\" alt=\"Chris Jones\"></span></p><p><span>As a kid in the 1980s, riding the whole city, I might have been chased out of anywhere, but I for sure got chased out of the all-white area, Hampden, on the basis of my</span><span> ethnicity</span><span> —or at least that’s what I understood when I heard “go home nigger!” And while there was no signage, I learned the score—</span><i><span>don’t go south of 41st Street.</span></i><span> I once had a white friend who played on the baseball team at Roosevelt Park, down on 36th. But after narrowly escaping some teens, I never dared to go see him play.&nbsp;</span></p><p><span>Nowadays, Hampden is one of Baltimore’s premier neighborhoods. The once hard-scrabble, working-class white neighborhood, has seemingly painted over its outwardly racist, exclusive past.</span><span> But the differences exist – and </span><span>I’m not disposed to just ride around an area I don’t know aimlessly without some prior knowledge. The historic “green book”, the segregation-era publication that told Black travellers where the people were friendly, no longer exists. </span><i><span>So, when a Black dude asks whether a place is okay, what we really want to know is “is it safe for Black folks?”</span></i></p><p><i><span>*</span></i> <i><span>*</span></i></p><p><span>As a Black man, I don’t always think about race. Like when I’m alone, I could be blue for all I know. When I’m suffering on a climb, I’m not sure who I am, much less what colo</span><span>u</span><span>r I am. But those careless moments wash away when I’m out there riding, I recognise it as second nature to approach all </span><span>areas</span><span> of life, like riding, differently than whites. Out of convention and necessity. Situations call for me to understand the coding that sees me as colo</span><span>u</span><span>r first, person second. Those roads weren’t built with me in mind.</span></p><p><span>There are things I must do to make getting along in the world smoother. But on any given day, feel free to invalidate any one of them. Because the fact is, there are no rules—the </span><span>last months reminded me that anything can happen anywhere</span><span>.</span></p><p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/arthritis-forces-ian-stannard-to-retire\">Read – Ian Stannard's Last Stand</a></strong></em></p><p><span>As bombastic and unforgiving as the George Floyd killing video is, Amy Cooper’s attempted weaponisation of the New York Police against a Black man who dared ask her to leash her dog in Central Park is equally pernicious. Moreover, there was the disturbing death of Ahmad Arbery, a jogger who was accosted by white men on the street and shot dead.</span></p><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Balitmore_Son_5.7_1024x1024.jpg?v=1611148596\" alt=\"\"></span></p><p><span>And so, white Americans began asking what’s happened with race. Whereas many black Americans (at least of my age) will have shrugged and thought: nothing's changed, it just you notice how repugnant this all is.</span></p><p><span>Racial abuse is </span><span>thankfully</span><span> rare these days. Exclusivity isn’t. Being talked down to is less photogenic, but equally as indelible as overt </span><span>threats</span><span>. I remember the back-handed compliment after my first ride with the school’s cycling club as a kid. The fact that I was one of the poorest at my mostly-white private high school was laid bare that day, when I rode up and just by instinct, we compared bikes.</span></p><p><span>My used-looking Power King had all the hallmarks of hard ownership. While it was a great bike, all my pride fell away when I saw my club-mate’s clean, celeste and chrome Bianchi. That was the first time I’d ever seen a Bianchi, cycling shoes, cycling shorts – or toe clips, for that matter. That first ride with them was unspectacular, I just remember this kid’s astonishment – which he was unable to hide – that I finished with the group.</span></p><p><span>Or, in another moment of long-simmered resentment, I recall the visit to an area bike shop in the mid-2000s, where in off-hand comments, I awakened to the notion that the sales guy presumed that I didn’t belong. Maybe it was a slip of the tongue, a small betrayal of thought.</span></p><p><i><span>But being Black has me constantly reading the curl on the ball.</span></i></p><p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Rouleur_ChrisJ-38_40803bb3-5278-4725-b925-e290e30fe504_1024x1024.jpg?v=1611147085\" alt=\"Chris Jones\"></span></i></p><p><span>Looking back, I don’t even remember exactly what was said, just how he said it – and</span><span> how it made me feel</span><span>. Maybe I should be thankful, because then, and even occasionally now, I rode thinking I had to prove myself to somebody. That errant </span><span>remark</span><span> may have been the fuel that sparked my cycling throughout the naughts.</span></p><p><span>I look at “The Rules” with the </span><span>same</span><span> bemusement. Rule #5 – yeah. And rule #9. But I’ll wear my glasses how I want, thanks very much. Save your turn-downs. Because I learned that respect is earned on the road. The road decides.</span></p><p><span>* *</span></p><p><span>In 2013, I was introduced to my current team through their Tuesday night time-trial, a free weekly event held in the summer. It’s a hilly route set against a pastoral backdrop about 20 miles north of Baltimore. When I finally did make it out, I can tell you then that I was welcomed handily by</span><span> the </span><span>team president and after busting my lungs, I put in a time somewhere short of distress. And it set me up for wanting to do it again, and again.&nbsp;</span></p><p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-podcast/rouleur-conversations-podcast-qhubeka-assos-2021-with-doug-ryder-plus-rouleurs-miles-and-ian?_pos=4&amp;_sid=a6784e2da&amp;_ss=r\">Read – Rouleur Conversations: Qhubeka Assos with Doug Ryder</a></strong></em></p><p><span>After years of being a solitary rider, I was welcomed into the team, learning their process of setting goals and working towards them. I went from “super-slow” to “slow” and then, “bit faster”. I was sometimes shown broad strokes of how to improve and I studied them. That process of improvement, which is the bedrock of a life on and off the bike.</span></p><p><span>Despite (or perhaps because of) being raised in white institutions of some sort all my life, I rarely discuss race with my team-mates or any white folks. Frankly, that’s the best way: </span><i><span>you can’t handle the truth. </span></i><span>So we pretend we all live in the same world until shit gets real. Subsequently, I’m occasionally left to asphyxiate in solitude when situations turn to the macabre as they invariably do. My sharing is not the nature of the relationship. </span><i><span>Because I meet them at their orientation of the world. Ultimately, inclusion is working to understand mine.&nbsp;</span></i></p><p><span>* *</span></p><p><span>My wife worries every time I ride. But I told her I can’t even imagine what kind of person I’d be if I ever stopped. The trope I think about is sure it’s safer to </span><i><span>not</span></i><span> ride, but dying on the sofa? That’s a horrible death. It’s taken me a while to get there – appreciating the riding for exactly what it is. Not proving anything to anybody. Being out there for me. I had that epiphany recently after being dropped on a training ride: </span><i><span>Competition is stupid – or at least worrying about it is. Focus on being better than you were yesterday. That’s the biggest competition of them all.</span></i></p><p><span>Whether it’s the pandemic, murderous racist cops, insane traffic, ill-advised politics, or what have you, it’s as if that stuff’s asking me to stop dreaming, stop doing. </span><span>To</span><span> surrender. </span><span>Stay worried. Keep listening to the radio, waiting for the next shoe to drop. </span><span>But even with all that going on, I still clip in. I need to. Because riding is that one of th</span><span>ose things I got to solve. </span><span>Doing so clears my mind to do the work of life—</span><i><span>whatever that is.&nbsp;</span></i></p><p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Rouleur_ChrisJ-42_1024x1024.jpg?v=1611147150\" alt=\"Chris Jones\"></span></i></p><p><span>So there I am, on that road, doing the lonely work of dreams in service of being a little bit better, threat of being in the “wrong” skin irrespective. That road – while maybe not built with me in mind – is not gonna intimidate me.</span></p><p><span>The best revenge is to be happy in the face of obstacles and unblinking in the face of cycling’s exclusivity. Appreciating the ride, and the process of riding, is more about myself than anyone else. What I’ve found is that in all of this is I’ve begun to fall in love with the problem. A problem that’s only sorted by doing the work. That way, riding is not only freedom, but rebellion.</span></p><p><i><span>Christopher Jones is a freelance designer from Baltimore. From Rouleur <a href=\"https://www.rouleur.cc/pages/subscribe\">issue 20.7</a></span></i></p></div></div>","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"74518d12b51e461e3339dfa096f7064f0ca9d49e3f4a694baf36cbfad1dc33bc","category":"Cycling"}