{"title":"Structure of Feelings","link":"https://markpeak.net/structure-of-feelings/","date":1611504800000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"page\"><main id=\"content\" role=\"main\"><article id=\"post-2126\" itemscope=\"itemscope\" itemtype=\"http://schema.org/BlogPosting\" itemprop=\"blogPost\"><img width=\"700\" height=\"387\" src=\"https://markpeak.net/wp-content/uploads/2021/01/igottafeeling-700x387.jpg\" alt=\"\" loading=\"lazy\" itemprop=\"image\" srcset=\"https://markpeak.net/wp-content/uploads/2021/01/igottafeeling-700x387.jpg 700w, https://markpeak.net/wp-content/uploads/2021/01/igottafeeling-300x166.jpg 300w, https://markpeak.net/wp-content/uploads/2021/01/igottafeeling-1024x566.jpg 1024w, https://markpeak.net/wp-content/uploads/2021/01/igottafeeling-768x425.jpg 768w, https://markpeak.net/wp-content/uploads/2021/01/igottafeeling.jpg 1381w\" sizes=\"(max-width: 700px) 100vw, 700px\"><div itemprop=\"mainContentOfPage\"><p>ได้อ่านบทความ <a href=\"https://www.matichonweekly.com/column/article_355246\">โครงสร้างความรู้สึกใหม่ : จิตใจเป็นเจ้าของชาติ</a> ของ อ.เกษียร เตชะพีระ ในมติชนสุดสัปดาห์ มีพูดถึงทฤษฎี “โครงสร้างความรู้สึก” (structure of feelings) ของ <a href=\"https://en.wikipedia.org/wiki/Raymond_Williams\">Raymond Williams</a> เป็นเรื่องที่สนใจอยู่แล้ว เลยมาจดเก็บไว้</p><div><p><a href=\"https://www.matichonweekly.com/column/article_355246\"><img src=\"https://www.matichonweekly.com/https://www.matichonweekly.com/wp-content/uploads/2020/10/%E0%B9%80%E0%B8%81%E0%B8%A9%E0%B8%B5%E0%B8%A2%E0%B8%A365660000.jpg\" alt=\"เกษียร เตชะพีระ | โครงสร้างความรู้สึกใหม่ : จิตใจเป็นเจ้าของชาติ\"></a></p><p><img src=\"https://www.matichonweekly.com/wp-content/uploads/2016/08/favicon.png\" alt=\"มติชนสุดสัปดาห์\"> มติชนสุดสัปดาห์</p></div><p>แนวคิดของ Williams คือการนำเรื่อง “ความรู้สึก” มาใช้อธิบายในเชิงการเมืองวัฒนธรรม ซึ่งการใช้คำว่า “ความรู้สึก” (feelings) สะท้อนถึงความไม่ชัดเจน มากกว่าคำว่า “ความคิด” ที่ตกผลึกชัดเจนแล้ว</p><blockquote><p>วิลเลียมส์เลือกใช้คำว่า “ความรู้สึก” แทนคำว่า “ความคิด” เพื่อบ่งชี้ว่าสิ่งที่กำลังปรากฏขึ้นนี้อาจยังไม่ทันเปล่งประกาศปรากฏออกมาอย่างชัดเจนเป็นระบบครบถ้วนกระบวนความ แต่ต้องขยายความเอาด้วยตรรกะเหตุผลให้เป็นข้อสรุปทั่วไปจากการอ่านความนัยระหว่างบรรทัด</p><p>นัยอันกำกวมคลุมเครือของวลี “โครงสร้างความรู้สึก” นี้จึงมุ่งสะท้อนสิ่งที่เอาเข้าจริงอาจอยู่ในสภาพเป็นแค่แนวโน้มหรือวิถีโคจร มากกว่าสิ่งที่สรุปลงตัวเป็นสูตรสำเร็จรูปเรียบร้อยสมบูรณ์แล้ว</p><p>สรุปกว้างๆ ได้ว่า โครงสร้างความรู้สึกมุ่งบรรยายสำนึกจริงที่ประสบรู้สึกกันอยู่ในวัฒนธรรมหนึ่งๆ ณ ช่วงจังหวะเฉพาะเจาะจงในประวัติศาสตร์ หรือในประสบการณ์ของคนรุ่นเฉพาะเจาะจงหนึ่ง</p></blockquote><p>ความรู้สึกนั้นมีอยู่จริง และเป็น “ความรู้สึกร่วม” กันของคนจำนวนมากในสังคม แต่ความไม่ชัดเจนของมันทำให้เราต้อง “ขุด” สิ่งที่แฝงเร้นออกมาอย่างแนบเนียน (เพราะคนที่แสดงความรู้สึกนั้นไม่รู้สึกตัวว่าแสดงออกอะไรออกมา)</p><blockquote><p>มันเป็นอาณาบริเวณที่ซึ่งจิตสำนึกทางการของยุคสมัยดังที่ประมวลไว้ในตัวบทกฎหมายและหลักลัทธิความเชื่อเข้าปฏิสัมพันธ์กับประสบการณ์ที่ผู้คนดำเนินชีวิตอยู่จริงของยุคสมัยดังกล่าว แล้วไปนิยามชุดความรับรู้และค่านิยมที่คนรุ่นหนึ่งมีกันทั่วไปอีกทีหนึ่ง</p><p>โครงสร้างความรู้สึกแห่งยุคสมัยหนึ่งดำเนินการอยู่ในอาณาบริเวณที่ละเอียดประณีตและแฝงนัยแนบเนียนที่สุดของกิจกรรมมนุษย์ อีกทั้งหาได้เป็นแบบแผนหนึ่งเดียวกันทั่วทั้งสังคมไม่ แต่จะเห็นได้ประจักษ์ชัดที่สุดในกลุ่มสังคมหลัก</p></blockquote><p>สิ่งที่ใช้สะท้อนความรู้สึกมันเป็นเรื่องวรรณกรรม (ที่ไม่ได้พูดความรู้สึกร่วมนั้นออกมาตรงๆ เพราะมีเจตนาพูดเรื่องอื่น เช่น โครงเรื่องหลัก แต่แทรกความรู้สึกของผู้เขียนมาในบทพูดหรือความคิดของตัวละครในเรื่อง) แต่ยุคสมัยนี้ โซเชียลมีเดียก็ตรงประเด็นกว่า</p><blockquote><p>พื้นที่เหมาะแก่การสำรวจศึกษาโครงสร้างความรู้สึกนั้นเดิมทีได้แก่ตัวบทวรรณกรรมและบทละครประดามี ทว่าในยุคเทคโนโลยีสารสนเทศปัจจุบัน มันย้ายไปอยู่ที่โซเชียลมีเดียทั้งหลายแหล่แทน ซึ่งสำแดงแบบแผน แรงกระตุ้นเร้าและน้ำเสียงร่วมกันออกมา โดยมิจำต้องเชื่อมโยงกันโดยตรงหรือรับส่งอิทธิพลซึ่งกันและกันแต่อย่างใด</p></blockquote><p>เกษียร นำทฤษฎี structure of feelings มาอธิบายบริบทการเมืองไทยในช่วงนั้น (ตุลาคม 2563 ที่เขียนบทความ) ที่ความเคลื่อนไหวของม็อบนักเรียน-นักศึกษา “ราษฎร 2563” กำลังพุ่งสูง โดยชี้ว่าในม็อบนั้นมี “ความรู้สึก” ร่วมกันอยู่</p><blockquote><p>โครงสร้างความรู้สึกจึงหมายถึงวิธีคิดแตกต่างนานาที่แข่งประชันกันผุดโผล่ปรากฏตัวขึ้นมา ณ กาละหนึ่งๆ ในประวัติศาสตร์</p><p>โดยมันจะผุดโผล่ขึ้นมาในช่องว่างของรอยปริแยกแตกอ้าออกระหว่าง 3 ปัจจัย ได้แก่ :</p><p>1. วาทกรรมนโยบายทางการ (เช่น ค่านิยมหลักคนไทย 12 ประการของ คสช.)</p><p>2. ปฏิกิริยาตอบโต้ของมหาชนต่อวาทกรรมทางการนั้น (เช่น ข้อความวิพากษ์วิจารณ์แนวนโยบายต่างๆ ของ คสช.ในโซเชียลมีเดีย โดยเฉพาะทวิตเตอร์ ซึ่งผู้สื่อสารแสดงออกตอบโต้อย่างใหม่สดร้อนเฉียบพลันจากประสบการณ์ตรงทันที) และ</p><p>3. การผนวกรับปฏิกิริยาตอบโต้ของมหาชนเข้าไปในตัวบทของงานวรรณกรรมและวัฒนธรรมอื่นๆ (เช่น เพลงประเทศกูมี ของวง RAP AGAINST DICTATORSHIP, เพลงผู้ใหญ่เอ๋ยผู้ใหญ่ดีต้องมีหน้าที่ 10 อย่างด้วยกัน ของกลุ่มนักเรียนเลว เป็นต้น)</p></blockquote><p>ส่วน “ความรู้สึกร่วม” เหล่านี้จะนำไปสู่อะไร เป็นสิ่งที่ต้องขบคิดกันต่อไป</p><div><p><a href=\"https://www.the101.world/interview-saichol-on-emotional-regimes-and-thai-conservative/\"><img src=\"https://www.the101.world/wp-content/uploads/2020/09/20200916-Somkid-banner.jpg\" alt=\"จากอารมณ์ความรู้สึกแห่งยุคสมัยถึงการถดถอยทางปัญญาของอนุรักษนิยมไทย สนทนากับสายชล สัตยานุรักษ์\"></a></p><p><img src=\"https://www.the101.world/wp-content/uploads/2018/06/cropped-the101world-logo-150x150.jpg\" alt=\"The 101 World\"> The 101 World</p></div><p>พออ่านเรื่องนี้แล้ว นึกถึง<a href=\"https://www.the101.world/interview-saichol-on-emotional-regimes-and-thai-conservative/\">อีกบทความหนึ่ง</a>ที่เคยเขียนถึงไปแล้ว (ในตอน <a href=\"https://markpeak.net/woman-and-thai-politics/\">ผู้หญิงกับการเมืองไทย</a>) ซึ่งเป็นงานวิจัยโดยคณะของ อ.สายชล สัตยานุรักษ์ คณะมนุษยศาสตร์ มหาวิทยาลัยเชียงใหม่ ที่มีธีมคล้ายๆ กันคือสนใจศึกษา “ระบบอารมณ์ความรู้สึก” (emotional regimes) ตามทฤษฎีของ William Reddy</p><blockquote><p>แนวคิดเรื่อง ‘ระบอบอารมณ์ความรู้สึก’ บุกเบิกโดยวิลเลียม เรดดี้ (William M. Reddy) ศาสตราจารย์ด้านประวัติศาสตร์และมานุษยวิทยาวัฒนธรรมแห่งมหาวิทยาลัยดุ๊ก (Duke University) โดยหมายถึง แบบแผนหรือมาตรฐานทางอารมณ์ที่เกิดขึ้นในช่วงเวลาและในบริบททางวัฒนธรรมหนึ่งๆ แนวคิดนี้เชื่อว่า อารมณ์ความรู้สึกที่เกิดขึ้นไม่ได้เป็นเรื่องของปัจเจกบุคคลที่เกิดขึ้นมาอย่างลอยๆ หรือเป็นแค่ปฏิกิริยาต่อสถานการณ์เฉพาะหน้า แต่มีมาตรฐานบางอย่างในสังคมและวัฒนธรรมกำกับอยู่ เราจะได้รับอนุญาตให้รัก เกลียด ภูมิใจ ดีใจ เสียใจ กับอะไร และอย่างไร ไม่ได้เป็นไปตามธรรมชาติของมนุษย์ แต่มีโครงสร้างอำนาจที่กำหนดแบบแผน มีการให้รางวัลหรือเกียรติยศ และมีการลงโทษต่างๆ แก่คนที่ละเมิดแบบแผนหรือมาตรฐานทางอารมณ์ความรู้สึกเหล่านั้น เรดดี้แสดงให้เห็นว่าระบอบอารมณ์ความรู้สึกหลักในสังคมทำให้เกิดความทุกข์ทนทางอารมณ์ความรู้สึก ระบอบอารมณ์ความรู้สึกใหม่ที่ก่อตัวและขยายออกไปสู่สังคมวงกว้างทำให้เกิดการปฏิวัติฝรั่งเศส และความผันแปรของระบอบอารมณ์ความรู้สึกหลังจากนั้น ก็ส่งผลต่อการเมืองของฝรั่งเศสอย่างลึกซึ้ง รวมทั้งการการประหารพระเจ้าหลุยส์ที่ 16 และโรเบสปิแอร์ ด้วยกิโยตินในเวลาต่อมา</p></blockquote><p>ส่วนตัวงานวิจัยก็น่าสนใจ เพราะนำเรื่องนี้มาใช้วิเคราะห์กับ “ชนชั้นกลางไทย”</p><blockquote><p>ขอมองผ่านงานวิจัยที่กำลังทำอยู่ในปัจจุบัน ทีมวิจัยกำลังศึกษาระบอบอารมณ์ความรู้สึก (emotional regimes)[1] ที่สัมพันธ์กับความคิด และระบบคุณค่าของชนชั้นกลางไทย แม้ว่าเป้าหมายหลักของโครงการจะไม่ใช่เรื่องการเมือง แต่ผลการวิจัยเท่าที่เราได้ทำกันมาตั้งแต่ปี 2561 ก็ช่วยให้เห็นพลวัตของการเมืองไทยได้ไม่น้อย เพราะได้เห็นทั้งส่วนที่มีลักษณะอนุรักษนิยม และส่วนที่เป็นระบอบอารมณ์ความรู้สึกใหม่ที่กำลังก่อตัวชัดเจนขึ้น จนน่าจะนำไปสู่ความเปลี่ยนแปลงครั้งใหญ่ของการเมืองไทยในอนาคตอันใกล้[2]</p><p>ทีมวิจัยสนใจระบอบอารมณ์ความรู้สึก ความคิด และระบบคุณค่า ที่สถาบันหลักๆ ในสังคมไทยสถาปนาขึ้น แล้วพยายามวิเคราะห์และอธิบายความเปลี่ยนแปลงที่หลากหลายอันเกิดจากพลังใหม่ๆ ในสังคม เช่น คุณอาสา คำภา ศึกษาพุทธศาสนาของชนชั้นกลาง อ.ณัฏฐพงษ์ สกุลเลี่ยว ศึกษาครอบครัวของชนชั้นกลาง อ.สิทธิเทพ เอกสิทธิพงษ์ ศึกษาจินตนาการชาติของชนชั้นกลางไทยเชื้อสายจีน และมีนักวิชาการอีกหลายคนช่วยศึกษาเรื่องอื่นๆ ที่ช่วยให้เข้าใจชนชั้นกลางไทยมากขึ้น คือ อ.ภิญญพันธุ์ พจนะลาวัณย์ ศึกษาอารมณ์ความรู้สึกเกี่ยวกับความงาม อ.กฤษณ์พชร โสมณวัตร ศึกษาอารมณ์ความรู้สึกเดือดร้อนรำคาญ อ.ปราการ กลิ่นฟุ้ง ศึกษาอารมณ์ความรู้สึกที่เกี่ยวกับการดูแลสุขภาพ ส่วน อ.เซนโจ นาไก (Senjo Nakai) ทำวิจัยเกี่ยวกับ ‘ความรู้สึกโหยหาอดีต’ (nostalgia) ของชนชั้นกลางญี่ปุ่น เพื่อเปรียบเทียบกับความรู้สึกโหยหาอดีตของชนชั้นกลางไทย</p><p>เรื่องระบอบอารมณ์ความรู้สึก ความคิด และระบบคุณค่าที่เราช่วยกันศึกษาอยู่นี้ ดูเผินๆ เหมือนจะไม่เกี่ยวอะไรกับการเมือง แต่ที่จริงแล้วช่วยให้เห็นทิศทางหรือแนวโน้มของความเปลี่ยนแปลงได้ไม่น้อย และที่สำคัญคือ เป็นเรื่องที่อยู่ในชีวิตประจำวันของชนชั้นกลาง ซึ่งในที่สุดแล้วส่งผลไปถึงการเมือง</p><p>ที่จริงแล้วระบอบอารมณ์ความรู้สึกกับอุดมการณ์สัมพันธ์กันมาก จะเห็นอารมณ์ความรู้สึกอยู่ในอุดมการณ์เสมอ เช่น คนต้อง ‘รักชาติ’ ‘ภาคภูมิใจในความเป็นไทย’ ฯลฯ เป็นอารมณ์ความรู้สึกที่มีอยู่ในอุดมการณ์ชาตินิยม ในปัจจุบันก็จะมีการโจมตีนักการเมืองบางกลุ่มและเยาวชนที่ออกมาเคลื่อนไหวทางการเมืองว่าเป็นพวก ‘ชังชาติ’ ก็เป็นการใช้คำแสดงอารมณ์ความรู้สึกที่มาจากอุดมการณ์ชาตินิยมเช่นกัน</p><p>พูดได้ว่า ในอุดมการณ์ต่างๆ มีทั้งส่วนที่เป็นความคิด ระบบคุณค่า และอารมณ์ความรู้สึก ซึ่งทั้งสามส่วนนี้สัมพันธ์เชื่อมโยงกัน ทีมวิจัยของเราจึงหวังว่าจะเข้าใจอุดมการณ์ของชนชั้นกลางอย่างซับซ้อนกว่าระดับที่เป็น ‘ความคิด’ โดยเฉพาะอย่างยิ่งเราอยากจะเข้าใจ ’ระบอบอารมณ์ความรู้สึก’ ของชนชั้นกลางซึ่งเรายังมีความรู้น้อยมาก และเราหวังว่าความเข้าใจนี้จะช่วยให้เราเข้าใจการเมืองไทยมากขึ้นด้วย &nbsp;มีคำกล่าวว่า “การปฏิวัติแท้ที่จริงแล้วเป็นห้วงจังหวะแห่งอารมณ์” (revolutions are deeply emotional moments) การทำความเข้าใจอารมณ์จึงสำคัญอย่างยิ่งในการทำความเข้าใจการเมือง</p></blockquote><p>ภาพประกอบจาก MV <a href=\"https://www.youtube.com/watch?v=uSD4vsh1zDA\">I Gotta Feeling ของ Black Eyed Peas</a></p></div></article><div id=\"taglist\"><ul><li>Related Content by Tag</li><li><a href=\"https://markpeak.net/tag/culture/\" rel=\"tag\">Culture</a></li><li><a href=\"https://markpeak.net/tag/political-science/\" rel=\"tag\">Political Science</a></li><li><a href=\"https://markpeak.net/tag/%e0%b9%80%e0%b8%81%e0%b8%a9%e0%b8%b5%e0%b8%a2%e0%b8%a3-%e0%b9%80%e0%b8%95%e0%b8%8a%e0%b8%b0%e0%b8%9e%e0%b8%b5%e0%b8%a3%e0%b8%b0/\" rel=\"tag\">เกษียร เตชะพีระ</a></li></ul></div></main></div></div>","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"74f6f0d20d6a564c980269d2176ff6e2acc02ac4372c6fdce703405a6ecad4b7","category":"Thai"}