{"title":"From Aqua to Catalina: The evolution of Mac OS X","link":"https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html","date":1616569200000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"link_wrapped_content\"><p>Mac OS X has been through a lot in 20-plus years. As someone who was sitting in the front row at Macworld Expo when then-CEO <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://youtu.be/QhhFQ-3w5tE&amp;xcust=1-1-340395-0-0-0|xid:fr1616592939928adi&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" rel=\"nofollow\" data-orig-url=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://youtu.be/QhhFQ-3w5tE&amp;xcust=1-1-340395-0-0-0&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" data-ml-id=\"0\" data-ml=\"true\" data-xid=\"fr1616592939928adi\">Gil Amelio brought Steve Jobs on stage</a> to celebrate Apple’s purchase of NeXT, it feels like I’ve been a witness to the whole story.</p><p>The macOS we use today is the result of iteration—sometimes rapid, sometimes painfully slow—over 16 major OS releases during those 20 years. Here are the highlights.</p><h2 id=\"before-there-was-mac-os-x-there-was-rhapsody\">Before there was Mac OS X, there was Rhapsody</h2><p>Before it was Mac OS X, the next-generation Mac OS was code-named Rhapsody. Software written for NextStep—what would become Cocoa—ran natively. Classic Mac OS apps ran in a compatibility window. Rhapsody aped Mac OS 8 in its design language, but that design would be thrown away before OS X finally shipped.</p><p>Most importantly, major Mac software developers were not willing to rewrite their apps for the “Yellow Box” of NextStep. Apple had to go back to the drawing board and come up with a more robust transition approach for developers, which led to the “Blue Box” that offered the ability to adapt classic Mac apps to run natively on the new operating system.</p><p>In 1999, Apple released Mac OS X Server 1.0, which was a weird fusion of NextStep and Mac OS, with interface quirks never seen before or since. It sort of looked like Mac OS, but if you used it for a minute you’d realize it was more liked a re-skinned version of NextStep.</p><p>After a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://archive.arstechnica.com/reviews/4q99/macos-x-dp2/m-macos-x-dp2-1.html&amp;xcust=1-1-340395-0-0-0|xid:fr1616592939928jgh&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" rel=\"nofollow\" data-orig-url=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://archive.arstechnica.com/reviews/4q99/macos-x-dp2/m-macos-x-dp2-1.html&amp;xcust=1-1-340395-0-0-0&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" data-ml-id=\"1\" data-ml=\"true\" data-xid=\"fr1616592939928jgh\">developer preview</a> version, Mac OS X Public Beta (internally it had the code name Kodiak) arrived in 2000, and while it was technically a beta version, Apple still charged $30 for the privilege of testing it. It still looked a lot like Mac OS 8 and had no Apple menu, but it did have a nonfunctional Apple logo parked dead center in the Mac menu bar. In his review for Ars Technica, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://archive.arstechnica.com/reviews/4q00/macosx-pb1/macos-x-beta-1.html&amp;xcust=1-1-340395-0-0-0|xid:fr1616592939928dei&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" rel=\"nofollow\" data-orig-url=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://archive.arstechnica.com/reviews/4q00/macosx-pb1/macos-x-beta-1.html&amp;xcust=1-1-340395-0-0-0&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" data-ml-id=\"2\" data-ml=\"true\" data-xid=\"fr1616592939928dei\">John Siracusa wrote</a>, “The Macintosh is defined by its interface, and any redefinition of that must be at least as good as what it’s replacing. Mac OS X Public Beta does not reach that goal.”</p><h2 id=\"os-x-early-days\">OS X early days</h2><p>In March 2001, Mac OS X 10.0 (internal code name Cheetah) was released. It was… <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://arstechnica.com/gadgets/2001/04/macos-x/&amp;xcust=1-1-340395-0-0-0|xid:fr1616592939928efj&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" rel=\"nofollow\" data-orig-url=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://arstechnica.com/gadgets/2001/04/macos-x/&amp;xcust=1-1-340395-0-0-0&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" data-ml-id=\"3\" data-ml=\"true\" data-xid=\"fr1616592939928efj\">not great</a>. The new Aqua interface, which Steve Jobs had unveiled to quite a bit of fanfare, was pretty, full of translucency and trendy 3-D effects. The core of Mac OS X was there, offering plenty for Apple and third-party developers to build on.</p><p>But that original version was terribly slow. Rebooting a Mac into Mac OS X—and in those days, nobody in their right mind was deleting their classic Mac OS partition and committing full time to OS X—would result in a perfectly speedy Mac feeling like it was dipped in molasses.</p><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/10-0-Cheetah-Classic-Booting.jpg?quality=50&amp;strip=all\" alt=\"MacOS X Classic Mode\"><figcaption>Mac OS X had a Classic Mode so users could run software designed for the previous operating system.</figcaption></figure><p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://512pixels.net/projects/aqua-screenshot-library/mac-os-x-10-0-cheetah/&amp;xcust=1-1-340395-0-0-0|xid:fr1616592939928hbd&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" target=\"_blank\" rel=\"nofollow\" data-orig-url=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://512pixels.net/projects/aqua-screenshot-library/mac-os-x-10-0-cheetah/&amp;xcust=1-1-340395-0-0-0&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" data-ml-id=\"4\" data-ml=\"true\" data-xid=\"fr1616592939928hbd\">512pixels.net</a></p></div><p>Apple knew it, and moved quickly to rectify the situation. Mac OS X 10.1 (internal code name Puma) was the first version that felt like it was actually ready for day-to-day work. On Macs with G4 processors, it was actually <em>faster</em> than Mac OS 9, which was quite a thing to see. It added back support for AppleTalk and AFP servers, which was a huge boost to compatibility in existing networks. And version 10.1 was the first version to run the new Microsoft Office X, a huge milestone in the acceptance of Mac OS X as a valid platform. In <a href=\"https://www.macworld.com/article/199938/osx-10-1.html\">my Macworld review</a> of OS X 10.1, I wrote, “This version combines much of OS 9’s functionality with a collection of improvements that make upgrading to OS X a serious possibility for even dyed-in-the-wool devotees of the classic Mac OS.”</p><p>Released in August 2002, Mac OS X 10.2 was the first version of Mac OS X to be generally referred to publicly by a “big cat” nickname—it was Jaguar. Jaguar saw Apple tone down some of the biggest design missteps of the Aqua interface, reducing transparency effects. In <a href=\"https://www.macworld.com/article/155417/jaguar-3.html\">my Macworld review</a>, I wrote, “Drop-down menus, while still slightly transparent, are much more opaque, making them more readable. A pop-up menu in the General preference pane lists four anti-aliasing algorithms, so you can choose the method of smoothing text that best fits your monitor and, even more important, that is easiest on your eyes.”</p><article aria-label=\"Article: The Mazda CX-30 Turbo: How I learned to love the crossover\" role=\"article\" tabindex=\"0\" id=\"ntv1124785-430739-89686\"><div><p><a href=\"https://ad.doubleclick.net/ddm/trackclk/N843334.1748112NATIVOINC/B24083865.297891438;dc_trk_aid=491080612;dc_trk_cid=131742883;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=;gdpr=0;gdpr_consent=;ltd=\" onmousedown=\"PostRelease.GetHrefUrl('https://jadserve.postrelease.com/trk?ntv_at=3&amp;ntv_ui=eae0f0c0-aff7-41cf-bdaa-eb2633ea5e0d&amp;ntv_a=k5IGAwiVLAsSkRA&amp;ntv_fl=7uDOAz88QViW5FhnhWWSVSZywurDveitzYf4Rsfgl3Dg8bh2oIX6kn9AJL45cgG0OZH19L5VZMbI1UiYs9DXFfg9L3lucOtElsSayy3mLxQVBfwuDnHhSMSZ8tvnrYbbimaLi0C5-Dlm0N5yJLpqs4gvmvrS_OUHZxpbbANTcGI=&amp;ord=305978416&amp;ntv_ht=KUBbYAA&amp;ntv_tad=16&amp;ntv_r=https://ad.doubleclick.net/ddm/trackclk/N843334.1748112NATIVOINC/B24083865.297891438;dc_trk_aid=491080612;dc_trk_cid=131742883;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=;gdpr=0;gdpr_consent=;ltd=', false, this, '1124785-430739');\" onclick=\"PostRelease.GetHrefUrl('https://jadserve.postrelease.com/trk?ntv_at=3&amp;ntv_ui=eae0f0c0-aff7-41cf-bdaa-eb2633ea5e0d&amp;ntv_a=k5IGAwiVLAsSkRA&amp;ntv_fl=7uDOAz88QViW5FhnhWWSVSZywurDveitzYf4Rsfgl3Dg8bh2oIX6kn9AJL45cgG0OZH19L5VZMbI1UiYs9DXFfg9L3lucOtElsSayy3mLxQVBfwuDnHhSMSZ8tvnrYbbimaLi0C5-Dlm0N5yJLpqs4gvmvrS_OUHZxpbbANTcGI=&amp;ord=305978416&amp;ntv_ht=KUBbYAA&amp;ntv_tad=16&amp;ntv_r=https://ad.doubleclick.net/ddm/trackclk/N843334.1748112NATIVOINC/B24083865.297891438;dc_trk_aid=491080612;dc_trk_cid=131742883;dc_lat=;dc_rdid=;tag_for_child_directed_treatment=;tfua=;gdpr=0;gdpr_consent=;ltd=', false, this, '1124785-430739');\" rel=\"nofollow\" target=\"_blank\" aria-label=\"3rd party ad, opens in a new window\"><img alt=\"\" src=\"https://ntvcld-a.akamaihd.net/image/upload/w_640,h_360,c_fill,g_auto:text,f_auto/assets/5477FC5A8A9E4E9F8845172B87AAC908.jpg\"></a></p></div></article><h2 id=\"cruise-control\">Cruise control</h2><p>Jaguar was probably the first version of Mac OS X that classic Mac OS holdouts adopted. It ended the era of Mac OS X’s most rapid development. After Jaguar, Apple’s OS X releases were a little more refined and focused, with one or two major feature additions and a raft of smaller tweaks. It was the beginning of a long cruise with what was now not just <em>a</em> Mac OS, but <em>the</em> Mac OS.</p><p><strong>Mac OS X 10.3 Panther</strong>: Arrived in the fall of 2003, Panther integrated Apple-branded cloud storage support for the first time, via iDisk. The Finder added a sidebar, which is a handy place to store familiar folders to this day, and colored labels for files. Open and Save dialog boxes also picked up the sidebar and let users display them as icons or a list, rather than using the multi-column, NeXT-style browser that was the only option in previous versions. Read <a href=\"https://www.macworld.com/article/168506/panther-6.html\">my Macworld review of Panther</a>.</p><p><strong>Mac OS X 10.4 Tiger:</strong> Appeared in the spring of 2005. Its banner feature was Spotlight, which—then as now—gave users a personal search engine for the files on their Mac for the first time. Automator also made its debut with Tiger, in the hope of bringing the joy of automation to users who were too overwhelmed by the idea of writing AppleScript scripts. Dashboard, a layer of JavaScript-based “widgets” full of glanceable information, also made its first appearance. In <a href=\"https://www.macworld.com/article/1044922/julyeic.html\">my Macworld editor’s column about Tiger</a>, I wrote, “It’s hard to tell whether [Tiger’s} changes are for the good or not—all you know is that they’re <em>different</em>. But then, slowly, you begin to form judgments about the new features, to appreciate small touches that originally escaped your notice.”</p><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/os-x-leopard-time-machine.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"OS X Leopard Time Machine\"><figcaption><p>Time Machine made its debut in Mac OS X 10.5 Leopard.</p></figcaption></figure><p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://512pixels.net/projects/aqua-screenshot-library/mac-os-x-10-5-leopard/&amp;xcust=1-1-340395-0-0-0|xid:fr1616592939928jde&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" target=\"_blank\" rel=\"nofollow\" data-orig-url=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://512pixels.net/projects/aqua-screenshot-library/mac-os-x-10-5-leopard/&amp;xcust=1-1-340395-0-0-0&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" data-ml-id=\"5\" data-ml=\"true\" data-xid=\"fr1616592939928jde\">512pixels.net</a></p></div><p><strong>Mac OS X 10.5 Leopard:</strong> Released in the fall of 2007. Apple highlighted the fact that it added 300 new features to OS X, including a simplified user interface (good!) and a semitransparent menu bar (bad!). The big new feature in Leopard was Time Machine, letting Mac users back up their computers by plugging in an external hard drive. Apple also introduced Spaces, which riffed on the existing Exposé feature to allow users to switch between multiple workspaces. And if you’ve ever pressed the space bar in Finder to preview a file, you’ve got Leopard to thank—it introduced Quick Look. In <a href=\"https://www.macworld.com/article/187875/leopard_review.html\">my Macworld review</a>, I wrote, “Quick Look itself is an impressive technology, if longtime users can retrain themselves to press space rather than double-clicking on a document to see what’s inside.”</p><p><strong>Mac OS X 10.6 Snow Leopard: </strong>Released in the summer of 2009. This was famously the “bug fix” edition of OS X, in which Apple focused on improving stability, boosting performance, reclaiming disk space, and adding support for 64-bit processors. Nothing says that your operating system has reached a comfortable, stable point than a bug-fix release. In <a href=\"https://www.macworld.com/article/1142423/snow-leopard-review.html\">my Macworld review</a>, I said that Snow Leopard was a “no-brainer of an upgrade.”</p><h2 id=\"middle-age-creeps-in\">Middle age creeps in</h2><p><strong>OS X 10.7 Lion:</strong> For all the comfort that Snow Leopard gave us, 2011’s Lion brought the pain—in <a href=\"https://www.macworld.com/article/1161026/osx_lion_review.html\">my Macworld review</a>, I said that Lion was “a shock to the system.” Lion broke a lot of software that had worked for years in OS X, including many apps that I used to record podcasts. It took years for replacements to emerge. Lion introduced “natural scrolling” and trackpad gestures, new auto-hiding scroll bars, full-screen apps, the iOS-style app launcher Launchpad, a very confusing new paradigm for auto-saving and versioning, and AirDrop for quick wireless file exchange between Macs.</p><p><strong>OS X 10.8 Mountain Lion: </strong>A surprise summer 2012 release—people didn’t expect a new Mac OS release only a year after the previous one, when Apple seemed to have settled into a once-every-two-years pace. In <a href=\"https://www.macworld.com/article/1167804/mountain_lion_apple_gets_its_operating_systems_in_sync.html\">my Macworld review</a> of Mountain Lion, I thought that the new release schedule was a sign of “more careful incremental updates (with fewer bugs) rather than great leaps (with more, nastier bugs).” Mountain Lion deeply integrated iCloud into OS X for the first time. Stalwart OS X apps—Address Book, iCal, and iChat—were renamed to match their iOS equivalents (Contacts, Calendar, and Messages). Reminders, Notes, and Game Center also made the move from iOS to OS X.</p><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/os-x-Mavericks-Notification-Center.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"OS X Mavericks Notification Center\"><figcaption>The Notification Center made its debut in OS X Mavericks.</figcaption></figure><p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://512pixels.net/projects/aqua-screenshot-library/os-x-10-9-mavericks/&amp;xcust=1-1-340395-0-0-0|xid:fr1616592939928iac&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" target=\"_blank\" rel=\"nofollow\" data-orig-url=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://512pixels.net/projects/aqua-screenshot-library/os-x-10-9-mavericks/&amp;xcust=1-1-340395-0-0-0&amp;sref=https://www.macworld.com/article/340395/from-aqua-to-catalina-the-evolution-of-the-mac-os-x-operating-system.html\" data-ml-id=\"6\" data-ml=\"true\" data-xid=\"fr1616592939928iac\">512pixels.net</a></p></div><p><strong>OS X 10.9 Mavericks:</strong> Arrived in the fall of 2013, ending the era of big cat names and putting Mac OS X on an annual release cycle that it continues to this day. Owing to changes in Apple’s business model and various financial regulations, Mavericks was the first release of OS X since version 10.1 to be given away for free. In <a href=\"https://www.macworld.com/article/2056882/os-x-mavericks-review-free-as-in-beer.html\">my Macworld review</a> of Mavericks, I called it a “grab bag of tweaks, simplifications, advances made in lockstep with iOS, and improvements under the hood.” Mavericks added tabs and tags to the Finder, Reading List to Safari, iCloud Keychain for storing passwords, an iOS-style Notification Center, and AirPlay mirroring.</p><p><strong>OS X 10.10 Yosemite:</strong> In the fall of 2014, Yosemite proved that Apple wasn’t going to move OS X to version 11.0 without a fight. Yosemite doubled down on iCloud Drive support, added Continuity and Handoff for more integration with other Apple devices, and upgraded AirDrop to work with iPhones and iPads. In <a href=\"https://www.macworld.com/article/2363162/hands-on-with-os-x-yosemite-design-changes.html\">my Macworld review</a>, I pointed out that Yosemite sets up the Mac operating system for a future with Retina displays.</p><p><strong>OS X 10.11 El Capitan:</strong> Released in 2015. It introduced pinned sites in Safari, more expansive Spotlight searches, and upgrades to Mission Control including a new Split View. In <a href=\"https://www.macworld.com/article/226467/os-x-el-capitan-review-mac-upgrade-thats-as-solid-as-a-rock.html\">my Macworld review</a> of El Capitan, I found that a few apps I relied on weren’t initially compatible with El Capitan, though new app versions eventually came.</p><p><strong>macOS 10.12 Sierra:</strong> In 2016, OS X became macOS. Sierra added Siri to the Mac. In <a href=\"https://www.macworld.com/article/228791/macos-sierra-review.html\">Roman Loyola’s Macworld review</a>, he wrote that Siri initially felt “like a luxury than a must-have,” but found Siri useful for tedious tasks. Sierra also introduced Apple Watch unlock and Apple Pay, and allowed the automatic syncing of your Desktop and Documents folders to iCloud Drive.</p><p><strong>macOS 10.13 High Sierra:</strong> Like Snow Leopard, it was a mostly under-the-hood update, released in 2017. It laid the groundwork for the future by introducing the new APFS filesystem and Metal 2 graphics framework. It was a pretty boring update, but sometimes boring is good. <a href=\"https://www.macworld.com/article/230509/macos-high-sierra-review.html\">Roman Loyola’s Macworld review</a> of High Sierra said that it, “lay[s] a foundation for better things to come.”</p><p><strong>macOS 10.14 Mojave:</strong> Introduced in 2018, it featured Dark Mode, new color accents, and a subtler interface more suited to Retina displays. More dramatically, four iOS apps—News, Stocks, Voice Memos, and Home—were brought over to the Mac directly from iOS via an early version of Apple’s Mac Catalyst technology. Here’s <a href=\"https://www.macworld.com/article/231900/5-reasons-why-you-should-upgrade-to-macos-mojave-right-now.html\">Roman Loyola’s Macworld review</a>.</p><h2 id=\"the-start-of-something-new\">The start of something new</h2><p>But change was in the air for macOS and the Mac in general. Something was on the horizon—the coming of Macs running Apple silicon.</p><p>The precursor to the big changes on the Mac was <strong>macOS 10.15 Catalina</strong>, released in the fall of 2019. It ended support for 32-bit apps, breaking compatibility with a lot of software we’d been using for years, if not decades. Mac Catalyst also appeared, allowing developers to bring their iPad apps to the Mac with only minor tweaks. iTunes became Music, and new TV, Podcast, and Find My apps arrived on the scene (via Mac Catalyst).</p><p>Which brings us to 2020 and the end of the old 10.x numbering system. <strong>macOS 11 Big Sur</strong> marks a new era for macOS, with a redesigned interface that brings to mind some of the excesses of the early days. A new Control Center arrived in the menu bar, and Mac Catalyst got a bunch of improvements. But the biggest feature of Big Sur is support for processors built by Apple—and Macs running those processors can even run iOS App Store apps unmodified.</p><p>20 years on, macOS doesn’t feel like it’s about to lay down and die. Instead, it feels reinvigorated, as Apple charts a new course into an Apple silicon-based future. Here’s to many macOS versions to come.</p></div><p><em>Note: When you purchase something after clicking links in our articles, we may earn a small commission. Read our</em> <a href=\"https://www.macworld.com/about/affiliate-link-policy\" target=\"_blank\"><em>affiliate link policy</em></a> <em>for more details.</em></p><p>Jason was lead editor at Macworld for more than a decade and now writes about Apple at <a href=\"https://sixcolors.com/\" rel=\"nofollow\">Six Colors</a> and podcasts at <a href=\"http://www.relay.fm/\" rel=\"nofollow\">Relay FM</a> and <a href=\"https://www.theincomparable.com/\" rel=\"nofollow\">The Incomparable</a>.</p></div>","author":"Jason Snell","siteTitle":"An act of desperation 20 years ago was the building block for the modern Mac","siteHash":"197a20b56933e2ffcf2c6764ca48a92fbe193cf3a4fba29e0dc62d3579495dbc","entryHash":"756b25aa0b26d9f45bb8c53d4de062e6dc2579b3d5c7ee7b0c8fe5bf6a5a4227","category":"Apple"}