{"title":"How the pros spend the off-season break","link":"https://www.cyclist.co.uk/in-depth/9151/how-the-pros-spend-the-off-season-break","date":1611327355000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Remember the good old days of Bjarne’s boot camp? You’d be enjoying your Christmas holidays, wondering what the pros had been up to since Lombardia, then you’d stumble across an online story with images of ‘General’ Riis in camo gear putting his CSC Saxo boys through a savage 48-hour survival test in the dank, dark woods of Denmark.</p><p>Tucking into a turkey sandwich, you’d wince on reading how landlubber superstar Ivan Basso had been thrown overboard a kilometre from the shore of the Baltic Sea, his teammates forced to tow their non-swimming captain safely to shore. You’d see some burly Danish squaddie submit this gaggle of spindly cyclists to various attack-and-hostage scenarios, or night-navigation ops in severe conditions.</p><p>A team of paratroopers would&nbsp;throw in some paintballing, potholing&nbsp;or abseiling; riders were forced to drive blind, climb walls or handle spiders and snakes. It was basically a mix between <em>SAS: Who Dares Wins</em> and <em>I’m A Celebrity</em>.</p><p>These military-style camps were both feared and revered. They were also unique as no other team took things to quite the same level. To provide a context, Jonathan Vaughters whisked his Garmin riders off sailing in the Caribbean – something even Basso could probably get on board with.</p><p>Once Oleg Tinkoff joined the Saxo ship the team hit the beaches of Gran Canaria instead. They hired a hotel, rode in the morning then played volleyball after lunch. Training in the Canaries, Mallorca, Calpe and the Spanish Sierras is all the rage now: anywhere with a bit of winter sun and altitude.</p><p>Usually this would also be the time for riders to visit the team’s host nation and meet new teammates. However, with such camps not taking place this year due to Covid, the likes of Chris Froome and his new Israel Start-Up teammates may well meet for the first time on the start line.</p><p>These PR exercises often dovetail with kit launches and riders trying out new gear. Already we’ve seen photos of Team BikeExchange’s Simon Yates taking his new Bianchi out for a spin in Andorra.</p><div id=\"file-42623\"><p><img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/01/felix_pros_off_season_2_israel_startup.jpg\" alt=\"\"></p></div><p>While on holiday, riders are left to their own devices. Some take training to whole new levels. Last year Victor Campenaerts set up a home altitude tent so he could, in his own words, ‘feel like a rider who took EPO’. In an extreme bid to legally boost his red-blood cell count, the Belgian slept at the equivalent of 4,700m and spent an hour a day at double that for a spot of casual intermittent hypoxic training.</p><p>‘It’s an experiment,’ he said. ‘I’m trying to be a pioneer.’ Zero wins in 2020 suggests, for all its lofty ideals, such trailblazing was a waste of time.</p><p>Others use more traditional means.&nbsp;James Knox goes fell running, Tao Geoghegan Hart, weeks after winning the Giro, posted a sub-50-minute 10k run and Edvald Boasson Hagen goes cross-country skiing. Incidentally Anton Palzer, Bora-Hansgrohe’s new recruit, is an avid ski mountaineer and mountain running champion.</p><p><a href=\"http://www.dennismags.co.uk/cyclist\"><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/01/clickable_subs_promo.jpg\" alt=\"click to subscribe\"></a></p><p>Perhaps the most effective means of training is far closer to home. Wout van Aert and Mathieu van der Poel’s cyclocross antics don’t seem to do them any harm. Likewise Ineos-bound British tyro Tom Pidcock.</p><p>Covid-19 and the truncated 2020 season means there’s an air of unorthodoxy about this winter, particularly with the cancellation of the Tour Down Under. The first WorldTour race is not until late February in the UAE.</p><p>Teams have reacted by devising more flexible, corona-safe training plans, while some will avoid meeting up entirely. Sunweb plans to hold a virtual team presentation, while Trek-Segafredo encouraged their riders to ‘de-train’ in November. Even Strava’s Festive 500 was tweaked to accept indoor turbos and Zwift, which kind of defeats the point.</p><p>Seven years on, Richie Porte and Cameron Wurf could only repeat their mythical 400km Tasmanian training ride from 2014 off the back of a 14-day quarantine. Given the world’s tallest mountain is now officially 0.86m taller, they may have to settle for a tweak of the Everesting challenge they did on&nbsp;the Col de la Madone in 2019. That, or last winter’s 310km loop of Mallorca.</p><p>For some teams, however, it’s business as usual. AG2R-Citroën are still heading on their annual skiing jaunt to Vaujany in the Alps. But with chairlifts and amenities in French ski resorts closed, the prospect of Greg Van Avermaet hiking up mountains lugging his food and skis would out-Riis even the most challenging Bjarne boot camps. Let’s hope they broadcast it on Zoom.</p><p><strong>Photography</strong>: Juan Trujillo Andrades/Noa Arnon</p></div></div>","author":"mjames","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"75d803c7acc89b5d3cdb192f2f6fdeb783ed35d90845967a26a4e11e784efc71","category":"Cycling"}