{"title":"Omloop Het Nieuwsblad 2021: Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad-2021-preview","date":1613066082000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><i><span>‘The season starts at Omloop!’</span></i></p><p><span>Ah, here we go again. Belgium's Opening Weekend will soon be upon us. For many, Omloop Het Nieuwsblad marks the traditional start of the cycling season.</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><span>This is the first opportunity for the cobble specialists to strut their stuff. Omloop is swiftly followed by Kuurne-Brussels-Kuurne the following day, which rounds out the Opening Weekend action.</span></p><p><span>Some of the sport’s biggest names have won Omloop Het Nieuwsblad, namely Eddy Merckx, Anna van der Breggen and Johan Museeuw.</span></p><p><span>The 2020 edition of Omloop het Nieuwsblad was one of the few races unaffected by the global pandemic, and took place in late February as originally planned.&nbsp;</span></p><p><span>In the men’s race, the selection at the front was reduced to three riders when Jasper Stuyven, Soren Kragh Andersen and Yves Lampaert went clear over the revered Kapelmuur. An attack from Lampaert dropped Kragh Andersen into the final kilometers, but Stuyven was the strongest in the sprint, claiming his first Omloop Het Nieuwsblad.</span></p><p><span>The women's race also saw a first-time winner.&nbsp;Annemiek van Vleuten won solo in the rainbow jersey after a decisive attack on the Kapelmuur, despite a mechanical issue earlier on. The result only added to her remarkable, evergrowing palmares.&nbsp;</span></p><h4><b>Route</b></h4><p><span>Last year's action clearly displayed that the Kapelmuur and Bosberg climbs are the pivotal points in the race. Pitching up to 19.8% at it’s steepest, the Muur in particular has the potential to swing the tide, despite being less than 500 meters in length.&nbsp;If you're not one of the riders passing the chapel at the summit in the lead, you have little chance of winning.</span></p><p><span>The exact details of the 2021 route for both the men’s and women’s race is yet to be revealed, but we will add details here as soon as the relevant information becomes available.</span></p><h4><b>The Contenders - Men</b></h4><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032615-238_1024x1024.jpg?v=1613043029\" alt=\"Van Aert, Van der Poel, Alaphilippe\"><i>Julian Alaphilippe, Mathieu van der Poel and Wout Van Aert (Image credit: </i><i>Nico Vereecken / PN / SWPix</i><i>)</i></span></p><p>Omloop is the first WorldTour one-day classic of the season. Therefore, all nineteen WorldTour teams will be in attendance. The ProTeams that have been given a wildcard are: Alpecin-Fenix, B&amp;B Hotels, Bingoal-Wallonie Bruxelles, Sport Vlaanderen,&nbsp;Arkéa-Samsic&nbsp;and Total Direct&nbsp;Énergie.</p><p>There are three names to look out for at the cobble classics in 2021: <strong>Wout Van Aert,</strong> <strong>Mathieu van der Poel</strong> and <strong>Deceuninck-Quick-Step</strong>.&nbsp;</p><p>However, Van Aert and Van der Poel will not ride Omloop this year, with Van Aert starting his season at Strade Bianche and Van der Poel at the UAE Tour.</p><p>That makes Deceuninck-Quick-Step the favourites. The team are synonymous with the cobble classics,&nbsp;and of course, Julian Alaphilippe was the only rider able to stay with Van Aert and Van der Poel at the Tour of Flanders last season. That is, until he collided with a moto, ending his chances and his season.</p><p>Essentially, Deceuninck-Quick-Step must make their presence known early on in proceedings. Although the start list for the 2021 edition is not yet official,&nbsp;<strong>Florian Sénéchal, Kasper Asgreen, Yves Lampaert, Julian Alaphilippe&nbsp;</strong>and&nbsp;<strong>Zdeněk Štybar</strong>&nbsp;are all set to start for the Belgian side. That makes at least five riders who could feasibly win the race -&nbsp;Štybar&nbsp;did in 2019.</p><p>By sending their riders up the road on the attack early and often, Deceuninck force the other teams into working hard early on, where they will burn through their domestiques. On paper, this means Deceuninck should have a numerical advantage in the latter stages.</p><p>This is precisely how Deceuninck have approached the classics of late.</p><p>With weather often playing a key factor, things rarely play out as they seemingly should in the Belgian classics, which is exactly why we love them!</p><p>AG2R Citroen have turned their attention to the cobble classics with their 2021 signings -&nbsp;two-time winner&nbsp;<strong>Greg Van Avermaet</strong>&nbsp;has joined and will partner up with&nbsp;<strong>Oliver Naesen</strong>.&nbsp;<strong>Sep Vanmarcke</strong>&nbsp;is another former winner, the 2012 victor has joined Israel Start-Up as their cobble leader.</p><p><strong>Tim Wellens</strong>&nbsp;and&nbsp;<strong>Philippe Gilbert&nbsp;</strong>will lead Lotto Soudal, but young starlet<strong>&nbsp;Florian Vermeersch</strong>&nbsp;could act as Lotto’s secret weapon.</p><p>It would be foolish not to mention last year's winner -&nbsp;<strong>Jasper Stuyven</strong>&nbsp;has now shown that he can win a cobble classic at WorldTour level, and alongside&nbsp;<strong>Mads Pedersen</strong>, Trek-Segafredo cannot be underestimated.&nbsp;</p><p><strong>Søren Kragh Andersen</strong>&nbsp;finished third last season, alongside the likes of&nbsp;<strong>Tiesj Benoot</strong>&nbsp;and&nbsp;<strong>Nils Eekhoff</strong>, Team DSM have a genuine chance.</p><p>Oh, we almost forgot, there is a&nbsp;rider named<strong>&nbsp;Peter Sagan</strong>&nbsp;in the peloton, heard of him? He didn’t race in Belgium in 2020 and was underwhelming in his 2019 classics campaign, but you can never write-off the Slovak. BORA’s new signing&nbsp;<strong>Nils Politt</strong>&nbsp;will act as his sidekick.</p><p>And finally, we are likely to see Britain’s&nbsp;<strong>Tom Pidcock</strong>&nbsp;in his first cobble classic for the Ineos Grenadiers.</p><p><b>The Contenders - Women</b></p><p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032619-003_1024x1024.jpg?v=1613043127\" alt=\"Annemiek van Vleuten\"></b><em>Annemiek van Vleuten</em><i><span><em>&nbsp;</em>won Omloop Het Nieuwsblad in 2020. (Image credit: </span></i><i><span>Tim van Wichelen / Cor Vos / SWPix</span></i><i><span>)</span></i></p><p><span>At this point, we know much less regarding the provisional women’s startlist, which makes it more difficult to pick potential winners. However, fifteen wildcard teams will join the nine Women's WorldTour teams, including Team Jumbo-Visma Women and Lotto Soudal Ladies.&nbsp;</span></p><p><b>Annemiek van Vleuten</b><span> will be back to defend her crown. The Dutchwoman has moved away from Mitchelton-Scott following a successful five-year spell to join Movistar. She has dominated an array of races in women’s cycling over the past decade, can she now continue that form with the Spanish outfit?</span></p><p><span><span>With the departure of Van Vleuten, we are likely to see&nbsp;</span><b>Sarah Roy</b><span>&nbsp;and</span><b><span>&nbsp;</span>Grace Brown</b><span>&nbsp;given a greater leadership opportunity for Team BikeExchange. The duo finished one-two at the Australian National Championships earlier this month.</span></span></p><p><span>Trek-Segafredo’s </span><b>Lizzie Deignan</b><span> returned to her very best in 2020, winning La Course, GP de Plouay and Liege-Bastogne-Liege. She has already won Omloop het Nieuwsblad in 2016, her previous entry at the race, and therefore is among the very top contenders. With&nbsp;</span><b>Elisa Longo Borghini</b> – who&nbsp;<span>had her best season yet in 2020 – alongside Deignan, Trek enter with a great chance.</span></p><p><b>Marta Bastianelli </b><span>has finished second at Omloop Het Nieuwsblad two years in a row. She’ll lead </span><b>Alé BTC Ljubljana</b><span>, can she make it third-time lucky?</span></p><p><em><span>Cover image:&nbsp;Pauline Ballet / SWpix</span></em></p></div></div>","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"760be1a4af2f91e7bc3151a78ca64e2ce76c3ae81bc8f729b2453a13eaf74088","category":"Cycling"}