{"title":"Tesla Admits to California DMV That Their ‘Full Self Driving’ Mode Is Not Capable of Autonomous Driving","link":"https://www.caranddriver.com/news/a35785277/tesla-fsd-california-self-driving/","date":1615398037000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><ul><li><strong>In a letter to the California DMV, <a href=\"https://www.caranddriver.com/tesla\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.caranddriver.com/tesla\">Tesla</a> admits that FSD is not full self-driving.</strong></li><li><strong>The correspondence between Tesla and the California DMV notes that FSD and Autopilot are both <a href=\"https://www.caranddriver.com/features/a15079828/autonomous-self-driving-car-levels-car-levels/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.caranddriver.com/features/a15079828/autonomous-self-driving-car-levels-car-levels/\">SAE Level 2 automation</a>.</strong></li><li><strong>The automaker does say that it is working toward deploying autonomous features to its vehicles.</strong></li></ul><ol></ol><p>Tesla CEO Elon Musk has been <a href=\"https://www.caranddriver.com/news/a33085479/tesla-rebuilding-autopilot-software/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.caranddriver.com/news/a33085479/tesla-rebuilding-autopilot-software/\">promising FSD (Full Self Driving) software</a> for years. For owners, opting for the chance to have their Tesla drive them to work and back mostly on its own has set them back to the <a href=\"https://www.caranddriver.com/news/a34452059/tesla-full-self-driving-price-hike/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.caranddriver.com/news/a34452059/tesla-full-self-driving-price-hike/\">tune of up to $10,000</a>. But according to a letter that Tesla sent to the California DMV about FSD’s capability, acquired by <a href=\"https://www.plainsite.org/documents/242a2g/california-dmv-tesla-robotaxi--fsd-emails/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.plainsite.org/documents/242a2g/california-dmv-tesla-robotaxi--fsd-emails/\">PlainSite via a public records request</a>, the dream of a self-driving car from the automaker this year might be just that, a dream.</p><p>The key correspondence comes from December 28, 2020, between Tesla’s associate general counsel Eric C. Williams and California DMV’s chief of the autonomous vehicles branch, Miguel D. Acosta. A letter details the capabilities of both Autopilot and FSD: “Currently neither Autopilot nor FSD Capability is an autonomous system, and currently no comprising feature, whether singularly or collectively, is autonomous or makes our vehicles autonomous,” Williams states.</p><p>This a departure from <a href=\"https://www.caranddriver.com/news/a33085479/tesla-rebuilding-autopilot-software/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.caranddriver.com/news/a33085479/tesla-rebuilding-autopilot-software/\">Musk's messaging</a> about FSD's capabilities. During a July 2020 video interview with the World Artificial Intelligence Conference, the CEO stated, \"I think at Tesla, I feel like we are very close to level 5 autonomy. I think I remain confident that we will have the basic functionality for level 5 autonomy complete this year.\"<br></p><p>But Williams paints a different picture of FSD’s capabilities in his letter to the California DMV. “As you know, Autopilot is an optional suite of driver-assistance features that are representative of SAE Level 2 automation (SAE L2). Features that comprise Autopilot are traffic-aware cruise control and autosteer. Full Self-Driving (FSD) capability is an additional optional suite of features that builds from Autopilot and is also representative of SAE L2.”</p><div data-align=\"center\" data-size=\"medium\"><div><picture><source data-srcset=\"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/j3016-levels-of-driving-automation-12-10-1594400316.jpg?resize=768:*\" media=\"(min-width: 61.25rem)\"><source data-srcset=\"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/j3016-levels-of-driving-automation-12-10-1594400316.jpg?resize=980:*\" media=\"(min-width: 48rem)\"><source data-srcset=\"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/j3016-levels-of-driving-automation-12-10-1594400316.jpg?resize=640:*\" media=\"(min-width: 30rem)\"><img alt=\"sae levels of driving automation\" title=\"\" data-src=\"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/j3016-levels-of-driving-automation-12-10-1594400316.jpg?resize=480:*\" src=\"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/j3016-levels-of-driving-automation-12-10-1594400316.jpg?resize=480:*\"></picture></div><p><span>SAE</span></p></div><p>The SAE (Society of Automotive Engineers) says that Level 5 autonomy technology \"can drive the vehicle under all conditions,\" and that it can drive everywhere. Level 2 provides steering, braking, and acceleration support for the driver but requires that the driver be constantly supervising the vehicle and features. It’s akin to what’s currently available on many new vehicles with advanced driver-assistance packages.</p><p>In the letter, Williams does leave open the possibility for the system to mature. “Please note that Tesla’s development of true autonomous features (SAE Levels 3+) will follow our iterative process (development, validation, early release, etc.) and any such features will not be released to the general public until we have fully validated them and received any required regulatory permits or approvals.”</p><p>But for now, Tesla says \"we do not expect significant enhancements\" to the system that would shift responsibility away from the driver, meaning that the final software release will be SAE Level 2.</p><p>That regulatory approval process is what started the entire conversation between Tesla and the California DMV. Acosta emailed Williams after seeing a tweet from CEO Elon Musk concerning the <a href=\"https://www.caranddriver.com/news/a35075187/tesla-holiday-firmware-fart/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.caranddriver.com/news/a35075187/tesla-holiday-firmware-fart/\">December 2020 holiday update</a> that Musk said <a href=\"https://twitter.com/elonmusk/status/1207865226604863488?s=20\" target=\"_blank\" data-vars-ga-outbound-link=\"https://twitter.com/elonmusk/status/1207865226604863488?s=20\">would have a FSD sneak peek</a>. Acosta informed Williams that deploying an autonomous vehicle on California roads requires a permit—a permit that Tesla did not have.</p><p>Tesla’s deployment of FSD has been mired in delays from the beginning. It was supposed to be deployed by the end of 2019 and then by the end of 2020. Now, in 2021, the claimed timeline has again shifted to the end of this year. Meanwhile, the automaker has pushed a beta of the system to a small group of privately owned vehicles. That collection of Tesla owners testing out FSD is likely to grow in the next two weeks according to Musk with a download button being deployed to supported vehicles likely by the end of March.</p><p>This content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.</p><p>Like previous beta releases of FSD, it’ll warn participants to keep their hands on the wheel and their eyes on the road. According to the letter sent to the state of California, Tesla owners should also expect that when the final software is deployed and they enable their $10,000 option, the car will give them the same warnings.</p><p>This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io</p><div><p>This commenting section is created and maintained by a third party, and imported onto this page. You may be able to find more information on their web site.</p></div></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7682a5ed77e5e214c3fd9d3c935546ac81a4f279ea80ed20cf40d961eb6ef40d","category":"Tech"}