{"title":"Android users now have an easy way to check the security of their passwords","link":"https://arstechnica.com/?p=1744701","date":1614171120000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>COMING TO A PHONE NEAR YOU —</h4><h2 itemprop=\"description\">Feature checks user credentials against a list of billions of compromised passwords.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/smartphone-computer-800x534.jpg\" alt=\"Android users now have an easy way to check the security of their passwords\"><figcaption><p>Getty Images</p></figcaption></figure><p>Google is adding its password checkup feature to Android, making the mobile OS the latest company offering to give users an easy way to check if the passcodes they’re using have been compromised.</p><p>Password Checkup works by checking credentials entered into apps against a list of billions of credentials compromised in the innumerable website breaches that have occurred in recent years. In the event there’s a match, users receive an alert, along with a prompt that can take them to Google’s <a href=\"https://passwords.google.com/\">password manager page</a>, which offers a way to review the security of all saved credentials.</p><p>Alerts look like this:</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/password-checkup-alert.gif\" width=\"1000\" height=\"600\"><figcaption><p>Google</p></figcaption></figure><p>Google introduced Password Checkup in <a href=\"https://arstechnica.com/information-technology/2019/02/google-releases-chrome-extension-that-alerts-to-breached-passwords/\">early 2019</a>, in the form of a Chrome extension. In October of that year, the feature made its way into the <a href=\"https://arstechnica.com/information-technology/2019/10/google-adds-password-checkup-into-web-account-password-manager/\">Google Password Manager</a>, a dashboard that examines Web passwords saved within Chrome that are synchronized using a Google account. Two months later, the company <a href=\"https://arstechnica.com/gadgets/2019/12/googles-password-checkup-goes-mainstream-is-built-into-chrome-79/\">added it to Chrome</a>.</p><p>Google’s Password Manager makes it easy for users to directly visit sites using bad passwords by clicking the \"Change Password\" button displayed next to each compromised or weak password. The password manager is accessible from any browser, but it works only when users sync credentials using their Google account password, rather than an optional standalone password.</p><p>The new password checkup was available as of Tuesday on Android 9 and above for users of <a href=\"https://support.google.com/chrome/answer/142893\">autofill with Android</a>, a feature that automatically adds passwords, addresses, payment details, and other information commonly entered into Web and app forms.</p><p>The Android autofill framework uses advanced encryption to ensure that passwords and other information are available only to authorized users. Google has access to user credentials only when users 1) have already saved a credential to their Google account and 2) were offered to save a new credential by the Android OS and chose to save it to their account.</p><p>When a user interacts with a password by either filling it into a form or saving it for the first time, Google uses the same encryption that powers the Privacy Checkup in Chrome to check if the credential is part of a list of known compromised passwords. The Web application interface sends only passwords that are cryptographically hashed using the Argon2 function to create a search key that’s encrypted with Elliptic Curve cryptography.</p><p>In a <a href=\"https://security.googleblog.com/2021/02/new-password-checkup-feature-coming-to.html\">post published Tuesday</a>, Google said that the implementation ensures that:</p><blockquote><ul><li>Only an encrypted hash of the credential leaves the device (the first two bytes of the hash are sent unencrypted to partition the database)</li><li>The server returns a list of encrypted hashes of known breached credentials that share the same prefix</li><li>The actual determination of whether the credential has been breached happens locally on the user’s device</li><li>The server (Google) does not have access to the unencrypted hash of the user’s password and the client (User) does not have access to the list of unencrypted hashes of potentially breached credentials</li></ul></blockquote><p>Google has written more about how the implementation works <a href=\"https://security.googleblog.com/2019/02/protect-your-accounts-from-data.html\">here</a>.</p><p>On most Android devices, autofill can be enabled by:</p><ol><li>Opening Settings</li><li>Tapping System &gt; Languages &amp; input &gt; Advanced</li><li>Tapping Autofill service</li><li>Tapping Google to make sure the setting is enabled</li></ol><p>Separately, Google on Tuesday reminded users of two other security features added to Android autofill last September. The first is a password generator that will automatically choose a strong and unique password and save it to users’ Google accounts. The generator can be accessed by long-pressing the password field and selecting Autofill in the pop-up menu.</p><p>Users can also configure the Android autofill to require biometric authentication before it will add credentials or payment information to an app or Web field. Biometric authentication can be enabled inside of the Autofill with Google settings.</p></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"76bb3e86c3d370009c1c07ac3ba17b45ec4f4b876784cb1815ce2620356a8257","category":"Tech"}