{"title":"The economics of covering California’s water system with solar panels","link":"https://arstechnica.com/?p=1750875","date":1616163736000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Cover up —</h4><h2 itemprop=\"description\">Renewable power, less evaporation, lower maintenance, and more.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/ca_aqueduct-800x533.jpg\" alt=\"Lots of California's water delivery system is exposed to the air.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/ca_aqueduct.jpg\" data-height=\"2048\" data-width=\"3072\">Enlarge</a> <span>/</span> Lots of California's water delivery system is exposed to the air.</p></figcaption></figure><p>A major factor driving the growth of solar power in the US has been the economics of large, utility-scale solar projects. The scale of plants ensures that their developers can buy components in bulk; use larger, more robust hardware; and install everything efficiently. That's in major contrast to most distributed installations, like rooftop solar.</p><p>But these installations do come with downsides. They often occur on undeveloped land, which can offset some of their positive contributions to climate change, especially if the land that has to be cleared was sequestering carbon. Ideally, it would be better to find a way to mix the best features of both—use previously developed sites, but on a scale that puts them on par with dedicated installations.</p><p>One of the solutions that has been floated (pun intended) is to put the panels on reservoirs. Reservoirs are large and already developed, and there's a side benefit of floating the panels onto the water: it cuts down on evaporation, potentially enhancing the value of the reservoir. Now, researchers have examined an alternative: covering all of California's open-air aqueducts, which supply one of the most productive agricultural regions on the planet, with photovoltaics.</p><h2>Multiple benefits</h2><p>The researchers here, based at the University of California branches in Merced and Santa Cruz, refer to California's water delivery system as canals because they're located at ground-level. But they carry no boat traffic, and the locals tend to call them aqueducts, given their focus on carrying water. They play a critical role in taking water from areas of the state where it accumulates (largely due to snowpack in the mountains) and delivering it to the agricultural regions in the state's Central Valley.</p><p>Regardless of how you describe it, there are over 6,000 kilometers of waterway involved in this system, with widths often running in the area of 30 meters. Put differently, the system can host a <em>lot</em> of solar panels.</p><p>But to function, the water in these canals has to move, delivering water to the locations that need it. So it's not a simple matter of floating a bunch of panels out into a reservoir. The researchers consider two different options for placing panels on the canal: either a solid truss that holds them above the surface or a cable anchored on each bank. The latter consistently produces better results, since it involves less raw material and is easier to construct, so we'll ignore the former option. Both options have been used in India, so there is some experience with their operation.</p><p>In this configuration, the researchers expect that there will be multiple benefits for a canal-based system. For one, the suspended panels will shade the canal and reduce evaporation, thus increasing the supply of the water. It will also lower the growth of any aquatic plants and algae that might otherwise make the canal their home, reducing the need for maintenance and cleaning. Finally, the relatively cool water in the canal will moderate the temperature of the panels themselves, which can improve the efficiency of some classes of solar panels. (The authors assume installing thin-film CadTel panels.)</p><p>The question was whether these additional benefits would balance out the added cost of suspending the panels over the canal. To find out, the researchers compared the economics of an install to that of a standard utility-scale install on neighboring terrain.</p><h2>Environment + econ</h2><p>Figuring this out was not an easy process. The canal system stretches throughout much of the length of the state, and panels at the northern end of it will have very different environmental conditions and capture less light than those in the south. These same factors will also influence evaporation, so the researchers incorporated an environmental model into their system. They also found several ways of estimating water loss in the literature, so they used these methods to create high- and low-end ranges of the expected savings from the evaporation.</p><p>Finally, all of this data was rolled into an economic calculation based on what's called a <a href=\"https://en.wikipedia.org/wiki/Net_present_value\">net present value</a>. This calculation incorporated the installation costs, the value of the water saved, the value of the electricity generated, and the value of the canal maintenance that can be avoided. All that was compared to the value generated by simply installing a standard utility-scale system that operated in the same climate and sunlight conditions.</p><p>Overall, as noted above, any system that used a solid truss to support the panel involved such large installation costs that, at best, it would lose money based on power generated in all but the sunniest areas of the state. The cable-supported systems did significantly better, generating power with a positive net present value in all circumstances.</p><p>The systems obviously weren't as profitable as installing the equivalent system on land. But once the lower canal maintenance and the increased efficiency of the panels due to the cooling effect of the water were considered, the systems significantly outperformed land-based panels in every location examined. In the grand scheme of things, the value of the water that stayed in the system thanks to the panels wasn't very significant; there was a single location in the south of the state where high water prices made it a bigger factor.</p><p>The researchers also calculated the <a href=\"https://en.wikipedia.org/wiki/Levelized_cost_of_energy\">levelized cost of energy</a> for each of the locations. But here, there wasn't much difference between the options, as the increased panel efficiency due to the cooling from nearby water ended up offsetting the added costs of the over-canal designs.</p><h2>Beyond costs</h2><p>Uncertainties about the evaporation rate leave a huge range of water savings estimates, from 40,000 cubic meters of water to 250 million cubic meters. That's anywhere from about a minute of flow from the Sacramento River in to the San Francisco Bay to a bit under five percent of the volume of the state's largest reservoir. It's not nothing, but it's not life-changing, either.</p><p>There are a number of things, however, that make these calculations more complicated than the economic analysis would suggest. For example, the cabling over the canals could potentially complicate maintenance, even if said maintenance wouldn't have to happen as often. And the canals aren't always located near sites that would be easy to connect to California's power grid. Unlike a more compact site, wiring up a long, stretched-out row of panels could add considerably to the cost.</p><p>But there are also offsetting factors. For example, during droughts, the price of water can grow considerably, so the extra water in the system would sporadically take on a much higher value. The water savings can also help limit the drawdown of groundwater in California, which has been <a href=\"https://arstechnica.com/science/2017/02/areas-of-california-sank-almost-2-feet-in-under-2-years-amid-drought/\">causing all sorts of problems</a> with the state's infrastructure, including the canals themselves. Finally, a lot of the irrigation pumps in the Central Valley are powered by diesel engines, which are highly polluting, so there's the possibility that solar mini-grids could work to cut pollution and fossil fuel use even if they're not hooked up to the grid.</p><p>In a lot of ways, however, the value of this work isn't necessarily specific to California. The model developed here is likely to be useful for any context where these sorts of installations are possible, allowing other locales to evaluate the potential—and the trade-offs—of this approach to solar.</p><p><em>Nature Sustainability</em>, 2021. DOI: <a href=\"http://dx.doi.org/10.1038/s41893-021-00693-8\">10.1038/s41893-021-00693-8</a> &nbsp;(<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div></div>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"76c3c6910b9eabfd9119fd527e490f2675bf7901574ef96630575500fbaf08cb","category":"Tech"}