{"title":"Past coronavirus infections don’t seem to help with SARS-CoV-2","link":"https://arstechnica.com/?p=1741036","date":1612967333000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Not to a T (or B) —</h4><h2 itemprop=\"description\">Neither T nor B cells seem to use memory of one virus to attack the other.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/20200123-coronavirus-800x799.jpg\" alt=\"Image of small blue spheres above a larger yellow surface.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/20200123-coronavirus.jpg\" data-height=\"1156\" data-width=\"1157\">Enlarge</a> <span>/</span> False color image of viruses attached to a cell's surface.</p></figcaption></figure><p>While the SARS-CoV-2 virus is new to humans, coronaviruses in general aren't. There have been earlier members of this group of viruses that have raised pandemic fears, while another group regularly circulates widely in humans, causing symptoms of the common cold.</p><p>Early on, there were some indications that prior exposure to cold-causing viruses could produce a degree of protection against COVID-19. But back in December, researchers published results indicating that any cross-reactivity against related viruses by T cells was likely to be ineffective. Now, additional results have been published that indicate antibodies raised against cold viruses fail to neutralize SARS-CoV-2.</p><h2>Memories</h2><p>The SARS-CoV-2 virus has a number of features that distinguish it from other coronaviruses that have circulated within humans. But it also has plenty of things in common, like its use of RNA as a genetic material and the general layout of its genome. Some of its genes have also picked up very few changes over the course of evolution. As a result, there are some stretches of genes that are identical in cold viruses and SARS-CoV-2.</p><p>This turned out to be relevant to a study <a href=\"https://arstechnica.com/science/2020/07/beyond-antibodies-the-immune-response-to-coronavirus-is-complicated/\">we covered last year</a>. In that work, researchers were looking at the response to SARS-CoV-2 within T cells, specialized immune cells that do things like assist antibody-producing cells or kill off cells that are already infected. T cells act by recognizing short pieces of foreign proteins, such as those made by viruses. And, as you'd expect, the number of T cells that respond to SARS-CoV-2 went up after infection.</p><p>The surprise was that they went up from a non-zero level. In other words, even before people were exposed to SARS-CoV-2, their immune system had T cells that could react to its proteins. This turned out to be mediated by short pieces of the viral proteins that were identical in both cold viruses and SARS-CoV-2. So, it's possible that these T cells could provide a small degree of immune protection against the new virus—which in turn could potentially help explain some of the differences in the severity of COVID-19 symptoms.</p><p>There was some evidence that this was the case. A study of medical records showed that patients who had previously had a positive PCR test for one of the cold viruses tended to have <a href=\"https://www.jci.org/articles/view/143380\">less severe COVID-19 symptoms</a> if they contracted it.</p><p>But then a paper <a href=\"https://www.cell.com/immunity/pdf/S1074-7613(20)30503-3.pdf\">published in December</a> looked at the T cell response in more detail. It found that most of the T cells that reacted to SARS-CoV-2 prior to exposure to the virus had poor affinity for its proteins, and in general weren't very specific; they tended to respond to several other viruses, not all of them from the coronavirus family. Following infection, T cells with the same sort of weak affinity for SARS-CoV-2 proteins were found at high levels in patients who had severe COVID-19 symptoms. By contrast, people who controlled the disease effectively tended to have T cells that were highly specific to SARS-CoV-2.</p><h2>If not T then B?</h2><p>But T cells obviously aren't the only part of the immune system that matters. Much of our focus in tracking immunity has been on the production of antibodies. And we've found a variety of antibodies that, at least in test situations, are able to block SARS-CoV-2 from attaching to cells and infecting them. So, it's possible that antibodies produced in response to cold viruses could also influence infection by SARS-CoV-2 or COVID-19.</p><p>But there are reasons to think this was less likely to be the case than T cell-based immunity. Antibodies are only produced against the proteins that are on the surface of the virus, while T cells can be generated to any viral protein. And the two main surface proteins of coronaviruses differ significantly between the common cold viruses and SARS-CoV-2. These differences include the sites where antibodies that neutralize the virus bind to it.</p><p>In any case, a paper released on Tuesday provides some clarity here. Its authors compared the antibodies present in blood samples prior to the onset of the pandemic and compared those to the ones found in patients who had been infected by SARS-CoV-2.</p><p>Overall, a bit over 4 percent of the pre-pandemic individuals had antibodies that reacted with the spike protein that's found on the surface of the SARS-CoV-2 virus. Of those, only 1 percent specifically targeted the region that the virus uses to attach to cells. By contrast, about 16 percent of these individuals had antibodies that recognized the protein that forms the virus's surface coating.</p><p>Even when antibodies that targeted SARS-CoV-2 were present in these individuals, few of them blocked the virus's ability to infect cells. That was in sharp contrast to the antibodies produced after SARS-CoV-2 infection, which were frequently able to block further infections. And the antibodies that existed before the pandemic didn't have any obvious impact on the progression of COVID-19 symptoms.</p><p>Obviously, our immune system's response to cold viruses seems to fade over time. So, the researchers redid their analysis using only those participants who had had a cold within the past year. This made no difference.</p><p>Despite the fact that these antibodies seemed to be ineffective in terms of blocking SARS-CoV-2, their numbers were boosted following a case of COVID-19. This isn't surprising, since they did in fact recognize the virus. But it seems like more of an accidental side effect of infection than a product of a robust immune response.</p><h2>One more reason to hate cold viruses</h2><p>So, overall, there's no evidence that either T cells or antibodies produced against cold viruses provide much in the way of protection against the virus. But the subject clearly needs to be examined further. Because of the nature of these detailed immunological studies, the number of patients examined is going to be relatively small. That's especially true in comparison to the study that saw a degree of protection provided by exposure to cold viruses; by simply scanning electronic health records, those researchers were able to look at the outcomes of over 12,000 people.</p><p>Of course, that was over 12,000 people who had severe enough respiratory symptoms before the pandemic that they'd undergone a panel screen for a large number of respiratory pathogens. And this suggests they're not likely to be an accurate sampling of what the typical COVID-19 population looks like.</p><p>So, while there's little indication of a beneficial effect of cold viruses at this point, it hasn't been completely ruled out yet, and more data will always be better. Unless it confuses things further.</p><p>Cell, 2021. DOI: <a href=\"http://dx.doi.org/10.1016/j.cell.2021.02.010\">10.1016/j.cell.2021.02.010</a> &nbsp;(<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7735df8bd9aa3ae64c6d62f35899b0034b2c3fcc86964e361557ce8943d56203","category":"Tech"}