{"title":"The day Strade Bianche finally became a Monument","link":"https://www.cyclist.co.uk/in-depth/9350/the-day-strade-bianche-finally-became-a-monument","date":1615220026000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><strong>I think we can all agree that after 2021's races, Strade Bianche really is a Monument of cycling</strong></p><p><strong>Words</strong>: Joe Robinson <strong>Photos</strong>: Offside</p><p>Saturday 6th March 2021, the day that Strade Bianche officially declared itself as a cycling Monument.</p><p>Milan-San Remo, the Tour of Flanders, <a href=\"https://www.cyclist.co.uk/tags/paris-roubaix\">Paris-Roubaix</a>, Liege-Bastogne-Liege, Il Lombardia and Strade Bianche? It can now sit at the top table with cycling’s great one-day races. At least that is what the internet agreed upon at the weekend.</p><p>After years of debate regarding whether this adventure through Tuscany’s white gravel roads could be given this heralded moniker, it felt like the overwhelming decision was that, as a race, it had earned its right.</p><p>Year on year, both the men’s and women’s Strade Bianche deliver in terms of spectacle, drama and excitement yet it felt as if on Saturday the race really stepped up to the pantheon of the greats.</p><p>For the women, their WorldTour calendar began like it had never stopped. From the moment live television pictures were beamed into our front rooms, we were greeted with a who’s who of female cyclists in the front group. Pretty much every pre-race contender was in contention of winning with 10km remaining, all giving it everything they had.</p><div id=\"file-43892\"><p><img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/03/italy_photo_press_1015445.jpg\" width=\"2953\" height=\"1937\" alt=\"\"></p></div><p>In the end, it took a piece of nailbiting tactical genius from the <a href=\"https://www.cyclist.co.uk/tags/sd-worx\">SD Worx</a> team, Chantal Van den Broek-Blaak playing the ‘I’ve got teammates behind’ card to <a href=\"https://www.cyclist.co.uk/tags/trek-segafredo\">Trek-Segafredo</a>’s Elisa Long Borghini, to get things done.</p><p>And as for the men, wow, that felt like a ‘do you remember where you were when’ moment, did it not? A lead group that contained seven elite <a href=\"https://www.cyclist.co.uk/tags/cyclocross\">cyclocross</a> World titles, two <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\">Tour de France</a> wins, a road race World title, countless age-group world titles and Michael Gogl, all swinging massive upper cuts at one another like rampaging heavyweight boxers for the final 60km of the race.</p><p>I don’t think any race will replicate that this year.</p><p>Eventually, it was <a href=\"https://www.cyclist.co.uk/tags/mathieu-van-der-poel\">Mathieu van der Poel</a> who landed the big knock-out blow on the final climb into Siena. <a href=\"https://www.cyclist.co.uk/news/9331/mathieu-van-der-poels-insane-strade-bianche-watts-revealed\">A burst of sheer power and speed</a> that saw jaws simultaneously drop to the floor around the world. ‘Did I really just witness that?’</p><p>After the race, you could see what it meant to Van der Poel to win Strade Bianche. Almost like it meant just as much as winning the <a href=\"https://www.cyclist.co.uk/tags/tour-of-flanders\">Tour of Flanders</a> last autumn.</p><p>Both men's and women's Strade Bianche races were won by riders at the absolute peak of their powers, albeit at very different ends of their careers, against a wealth of talent you would only ever really see at a Grand Tour or, you know, a Monument. And all those riders in both lead groups were taking full aim at the win on Saturday, no holding back, again almost like it was a Monument.</p><p>Plus, what is a Monument anyway? Traditionalists will tell you that to be a Monument of cycling, the race has to be the main Classic of one of the cycling superpower countries, be over 200km in length, have riders specifically build their seasons around the race and see the peloton pushed to the limits over six hours of racing – minimum. But this argument is so flawed.</p><p>For example, Belgian semi-Classic Gent-Wevelgem is 264.5km long, a full 800m longer than the <a href=\"https://www.cyclist.co.uk/tags/tour-of-flanders\">Tour of Flanders</a>, yet Flanders is a Monument and Wevelgem is not. Milano-Torino is 29 years the senior of Il Lombardia yet is only a semi-Classic. Then you’ve got Paris-Tours which is not only 250km but also 115 years old and has a roll call of winners among the very best, yet is hardly even mentioned in the same breath.</p><div id=\"file-43785\"><p><img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/03/strade_bianche_2021_italy_photo_press_1015460.jpg\" width=\"2953\" height=\"1937\" alt=\"\"></p></div><p>If we are going to stick to those rigid parameters, that means no female cyclist will have won a Monument either and I think we can all agree that’s not right?</p><p>Beyond part-time cycling statisticians, who actually cares what is a Monument and what is not? The only three people who can really take umbrage with Strade Bianche becoming the sixth Monument are Rik van Looy, Eddy Merckx and Roger de Vlaeminck and that’s only because they will no longer have won <em>all</em> the ‘Monuments’. And even then, I think it would only bother Mr De Vlaeminck.</p><p>And the irony of this entire argument is that the concept of a Monument was only brought to fruition in the mid-1990s by then UCI President Hein Verbruggen and certain race organisers as a marketing tool to better promote certain races. So the actual concept of what defines a ‘Monument’ has no real, tangible validity anyway.</p><p>So if we as cycling fans want Strade Bianche to be one, then so it shall be.</p></div></div>","author":"jrobinson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"77e3ff8ea0b3e47593d6252c0635916acac64f4eedf010c7c0f87d2945d41103","category":"Cycling"}