{"title":"Preview: What you need to know about stage 17 of the Vuelta a España","link":"https://cyclingtips.com/2021/08/preview-what-you-need-to-know-about-stage-17-of-the-vuelta-a-espana/","date":1630447120000,"content":"<div><div><p><strong>Date: </strong>Wednesday September 1<br><strong>Start: </strong>Unquera<br><strong>Finish: </strong>Lagos de Covadonga<br><strong>Distance: </strong>185.8 km</p><p>The profile for this stage looks like a zoomed-in photo of a chainring. There’s an early Cat 3 climb (5.3 km at 4.7%), then two ascents of La Collada Llomena (7.6 km at 9.3%), which top out at 98 and 56 km to go. There are bonus seconds available after the second of those ascents.</p><p>There’s a long downhill from there and then it’s into the final, stage-ending, HC climb to Lagos de Covadonga (12.5 km at 6.9%). The climb is tougher than that average gradient would suggest – it’s up and down at the end with some steep sections. There is a particularly steep stretch that reaches into the double digits midway up the climb.</p><p><strong>Who’s it for:</strong> This will be important for the GC regardless, but as ever, the breakaway will have a shot at the stage. We’ll see</p><p><strong>Dane Cash’s picks: </strong><em>I’d give the GC riders a very slight edge here as I do think some of the teams in the mix for red will try to set a tough pace throughout the day. Primoz Roglič will be the favorite out of the pack; he tends to do quite well atop tough climbs where the gradient eases late. Miguel Ángel López will be another favorite, and so will Enric Mas. If it comes to a break, keep an eye on the likes of Romain Bardet, Michael Storer, Rafal Majka, and Damiano Caruso.</em></p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/2021-vuelta-profile-stage17.jpeg\"></figure><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/stage17-1.jpeg\"></figure></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"782bb6d6a87c0ade6eb5efb599b9f775abebc392994455c686aab2707efd1fac","category":"Cycling"}