{"title":"As coronavirus variants spread, the US struggles to keep up","link":"https://arstechnica.com/?p=1743898","date":1613826031000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Out of sequence —</h4><h2 itemprop=\"description\">Without federal strategy or enough funding, US sequencing superpowers don't work.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/researchers-classroom-mask-800x533.jpg\" alt=\"As coronavirus variants spread, the US struggles to keep up\"><figcaption><p>Bing Guan | Bloomberg | Getty Images</p></figcaption></figure><p>Across the US, the coronavirus is in retreat. The pandemic is still raging, mind you, with more than 70,000 new cases still reported each day. But since the post-holiday peak in mid-January, the seven-day average of new cases has fallen <a href=\"https://abcnews.go.com/US/covid-19-cases-hospitalizations-continue-massive-drop-january/story?id=75896236\">by nearly 64 percent</a>. Hospitalizations have plunged too. And with <a href=\"https://www.latimes.com/politics/story/2021-02-17/biden-administration-claims-progress-in-covid-19-vaccination-drive\">vaccinations accelerating</a>, there is a glimmer of hope that this downward trend might be the start of Covid’s long slide toward containment, at least in the US and other wealthy countries that are <a href=\"https://www.wired.co.uk/article/coronavirus-vaccine-distribution\">hogging the shots</a>.</p><p>But retreat does not always mean defeat. And <a href=\"https://www.wired.com/story/worrisome-new-coronavirus-strains-are-emerging-why-now/\">the emergence of several worrisome new coronavirus variants</a> with new tricks for spreading faster or evading immune responses presents another possibility: that the current reprieve will only be temporary. Public health experts are urging governments to prepare for a possible new wave of infections driven by variants like B.1.1.7, which has already been identified in more than 1,200 US cases and in nearly every state, <a href=\"https://www.cdc.gov/coronavirus/2019-ncov/transmission/variant-cases.html\">according to data</a> from the US Centers for Disease Prevention and Control.</p><p>That’s more than double the number reported two weeks earlier. But the real number is likely far higher. How much higher? No one knows. That’s because the only way to tell which version of the coronavirus is causing an infection <a href=\"https://www.wired.com/story/microbe-mappers-are-tracking-covid-19s-invisible-traces/\">is to sequence its genome</a>. In this country, that should be easy enough—the US is a sequencing superpower. It has dozens of academic institutions and massive commercial labs with the capacity to crank out genomes at a rapid clip. But the federal government’s response through much of the pandemic didn’t include a plan to mobilize America’s DNA-mappers into a coordinated coronavirus-monitoring corps. SARS-CoV-2 surveillance, well, sucked.</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/wired-logo.png\" width=\"218\" height=\"58\"></figure><p>At the end of last year, the CDC finally got the green light <a href=\"https://www.wired.com/story/how-fast-can-scientists-find-the-new-coronavirus-strains/\">to roll out additional programs and funding</a> aimed at changing that. Since then, the US has boosted its sequencing from about 3,000 viral genomes per week to more than 7,000. But scientists say it’s still not close to enough. And we’re running out of time to catch up. Because while Congress debates a bill that could provide the necessary infusion of funds for building out the genomic surveillance system the US should have had all along, variants—both the ones scientists know to be worried about and the ones they haven’t discovered yet—are expanding their territory.</p><h2>Doubling up</h2><p>“Across the US right now, we’re seeing a doubling of B.1.1.7 every 10 days,” says Karthik Gangavarapu, a computational biologist at the Scripps Institute in La Jolla, California. He’s part of a team of researchers that has been tracking the rapid spread of the extra-contagious lineage, which is <a href=\"https://www.wired.com/story/all-these-mutant-virus-strains-need-new-code-names/\">still sometimes referred to as the “UK variant,”</a></p><p>In <a href=\"https://www.medrxiv.org/content/10.1101/2021.02.06.21251159v1\">a study</a> posted online earlier this month, the team analyzed more than 200 viral genomes of the B.1.1.7 lineage collected from around the country, and they found that the variant most likely arrived in the US in November, a month before it was first detected here. Then they calculated how fast the variant spread during the months of December and January: between 35 and 45 percent faster than existing US strains. Though it has not yet been published in a peer-reviewed journal, the data provides the first hard evidence bolstering <a href=\"https://www.cdc.gov/mmwr/volumes/70/wr/mm7003e2.htm?s_cid=mm7003e2_w\">a forecast</a> issued in January by the CDC, projecting that B.1.1.7 would become the dominant variant in the US by late March.</p><p>“What we’ve seen over the last few weeks is that things are basically trending the way we thought they would,” says William Lee, the vice president of science at Helix and a coauthor on the study. <a href=\"https://www.wired.com/story/helix-takes-clinical-genetic-testing-straight-to-consumers/\">Helix</a>, a lab testing company headquartered in San Diego, in partnership with its parent company, Illumina, is one of three commercial labs contracted by the CDC to conduct genomic surveillance of SARS-CoV-2. Technically, Illumina does the sequencing and Helix provides the viral material, recovered from nasal swabs the company uses to test for coronavirus. And because of a quirk in the test’s design, Helix can easily flag the samples most likely to contain B.1.1.7.</p><p>It’s not a unique quirk, <a href=\"https://www.wired.com/story/everything-you-need-to-know-about-coronavirus-testing/\">but like many other Covid-19 tests</a>, Helix’s hunts for three snippets of the virus’s genome. One of those snippets is on the S gene, which codes for the virus’s <a href=\"https://www.wired.com/story/to-beat-covid-19-scientists-try-to-see-the-invisible-enemy/\">infection-enabling spike protein</a>. The B.1.1.7 variant happens to have a six-letter deletion on that section of the S gene. So the test for a person infected with it still comes back positive, but missing the S gene signal. Scientists have dubbed it “S gene dropout” or “S gene target failure,” SGTF for short. It can be a useful shortcut for estimating how widely B.1.1.7 is circulating in an area, but because other innocuous variants also have the same deletion, the only way to know for sure is to sequence.</p><p>After the UK sounded the alarm over B.1.1.7 in late December, Helix began sending every SGTF sample off to Illumina for sequencing. Back then, they’d find about 100 instances of S gene dropout every day. And most of them didn’t turn out to be B.1.1.7. But now, says Lee, in places like Florida and Southern California, all the S gene dropouts are B.1.1.7. It’s no longer feasible to sequence them all, because there are just too many—at least in those two locations, which represent about 50 percent of the tests Helix conducts. “In Florida, we’re seeing B.1.1.7 now representing about 15 percent of all new Covid-19 cases,” says Lee. “Six weeks ago, it was less than 1 percent.”</p><p>The Florida Department of Health did not respond to WIRED’s questions. But the fate of that state over the next few weeks may be a bellwether of what’s to come for the rest of the US. According to the CDC, B.1.1.7 prevalence is still low—approaching 1 percent—across the country. But <a href=\"https://www.helix.com/pages/helix-covid-19-surveillance-dashboard\">Helix’s data</a> suggests other hot spots are beginning to emerge, including in Georgia, Texas, and Pennsylvania. That means the decisions government officials in those areas make in the coming days and weeks regarding reopening schools and businesses will be critical. Actions to slow the spread of more contagious variants are most effective during the earliest phases of circulation.</p><p>“Because we’ve detected this early, that gives us precious time to try to bring down current levels of transmission and vaccinate as many people as possible,” says Gangavarapu. Those two metrics, he says, are what will dictate whether or not the US sees a big spike due to the new lineages. “It’s a race against time,” he continues. “If we don’t do those things, an even bigger wave than what we saw this winter is possible. If you open up everything right now, that’s almost guaranteed to happen.”</p><p>Gangavarapu says his team of collaborators has found plenty of B.1.1.7 in circulation. But so far, their sequencing efforts haven’t captured either of the two variants that are suspected to be the best immune evasion artists—the B.1.351 and P.1 variants, discovered in South Africa and Brazil, respectively. According to CDC data, only a handful of those have been reported in the US so far, mostly in people who recently returned from traveling. But imports aren’t the only thing to worry about. There are homegrown variants too.</p><p>Jeremy Kamil is one of the people looking for them. A virologist at Louisiana State University Health Sciences Center Shreveport, Kamil normally studies the cytomegalovirus family, but starting last spring, he combined forces with Vaughn Cooper, the director of the Center for Evolutionary Biology and Medicine at the University of Michigan who runs a microbial sequencing startup, to set up genomic surveillance for SARS-CoV-2 in Louisiana. For months, they sequenced hundreds of samples from coronavirus tests randomly collected from around the state, watching for anything unusual. On January 27, Kamil noticed exactly that—a batch of samples that all contained a mutation he hadn’t seen before. When he looked closer, he saw that each of the mutant viruses were closely related—they all belonged to the same genetic lineage. And though that lineage was quite young, dating back only to the beginning of December in his data, it was growing more common every day.</p><p>Kamil uploaded the genomes to an online database called GISAID, used by researchers around the world. The next day, scientists at the University of New Mexico contacted him. They had found the same variant in their state. Meanwhile, Cooper was scouring the database looking for more viruses with the same mutation—a genetic alteration which changes the 677th amino acid in the coronavirus’s spike protein. He found more, and not just in Louisiana and New Mexico, but also North Carolina, Massachusetts, and eight other states. The researchers realized they needed a phylogenist to get their viral family tree in order, so they enlisted the help of Emma Hodcroft at the University of Bern in Switzerland. Within a week, her team had traced the emergence of seven new variants in the US, each of which had evolved the same mutation independently.</p><p>The researchers described this pattern as an example of “convergent evolution” <a href=\"https://www.medrxiv.org/content/10.1101/2021.02.12.21251658v2\">in a preprint</a> posted Sunday. “It’s a pretty strong indication of an adaptation, even if we don’t yet know what that adaptation is,” says Cooper, a coauthor of the study, which has not yet been peer-reviewed.</p><h2>Family business</h2><p>We tend to use the singular word “coronavirus” when referring to the bug that causes Covid-19. But a more accurate way to think about SARS-CoV-2 is as a population of viruses. And that population is in a state of constant flux—expanding and contracting, mutating, and evolving new lineages as it spreads from person to person. Genetic epidemiologists can track those minute changes, following them like the branches of a family tree <a href=\"https://www.wired.com/story/covid-19-was-here-earlier-than-most-americans-thought-now-what/\">to identify clusters of cases all linked to one another</a>. With enough viral genomes, they can also zoom out to compare how fast different branches are growing. If one branch starts to take off, it can indicate that the genetic changes those viruses have acquired provide some kind of competitive advantage. And if a bunch of different branches independently acquire the same mutation, and they all start to take off, well, that’s convergent evolution.</p><p>Though the seven variants identified by Cooper, Kamil, Hodcroft, and company appear to have become more common in recent months—accounting for up to 15 percent of the transmission in some places where they have been found—there’s still much the researchers don’t understand about them. Where did they first emerge? Are they spreading faster because the 677 mutation changes the virus’s behavior, as is the case with the other major variants of concern first detected abroad? Or did holiday travel and family gatherings in the US spread it farther and faster than other domestic strains? Even basic questions about the real prevalence of each new variant are hard to answer, because the nation is still so far behind on sequencing.</p><p>“What we’ve discovered is just the tip of the iceberg,” says Cooper. Currently the US has sequenced the genomes of just 0.4 percent of all coronavirus cases, according to a WIRED analysis of GISAID data. By comparison, the UK is doing about 10 percent. Denmark, the world leader, has surpassed the 50 percent mark.</p><p>The good news is that all the sequencing being done elsewhere in the world is finding that the virus keeps settling on the same genetic changes in its hunt for an advantage. That suggests it has chanced upon a run of good cards, but there might not be many better ones left in the deck. “In that sense,” says Cooper, “convergence is actually our friend here, because it limits the roster of mutations we have to pay attention to.” That’s not just good for surveillance and testing, but also for vaccine makers <a href=\"https://www.wired.com/story/what-will-it-take-to-make-covid-19-vaccines-variant-proof/\">trying to future-proof their shots</a>. Any constraints on the number and placement of useful mutations should make it easier to develop an arsenal of boosters that will be effective against whatever variants are yet to emerge.</p><p>But that doesn’t change the fact that the US is still disastrously unprepared to spot them when they do. <a href=\"https://www.wired.com/story/how-fast-can-scientists-find-the-new-coronavirus-strains/\">As WIRED has previously reported</a>, scaling up a national SARS-CoV-2 monitoring network involves coordinating a patchwork of players—academics like Kamil and Gangavarapu, industry players like Helix, and labs on the front lines, operated by public health departments and hospitals. Connecting sequencing facilities to patient samples and data requires coordination—both in terms of logistics and of agreeing to do things in a standardized way.</p><p>All of that takes time and money. Each viral sequence costs between $25 and $400 to generate. So far, the CDC has funded seven universities to the tune of $14.5 million; signed contracts with Illumina, Helix, and medical testing behemoths LabCorp and Quest Diagnostics for $12.5 million; and released a further $15 million to public health labs. But this week, the Biden administration <a href=\"https://www.hhs.gov/about/news/2021/02/17/biden-administration-announces-actions-expand-covid-19-testing.html\">announced</a> it is providing a much needed infusion of cash—almost $200 million—intended to ramp up the nation’s sequencing capacity from 7,000 to 25,000 samples per week. That would put the US on track to capture about 5 percent of new coronavirus cases, provided they continue to decline. It’s a threshold <a href=\"https://www.medrxiv.org/content/10.1101/2021.01.12.21249613v1\">scientists at Illumina estimate</a> the country needs to hit in order to detect a new variant before it grows to more than 1 percent of total cases.</p><p>A spokesperson for the CDC declined to say whether the agency was setting specific targets. “There is currently no consensus in the US or globally on the optimal rate for genomic surveillance,” she wrote in an email to WIRED. <a href=\"https://www.whitehouse.gov/briefing-room/press-briefings/2021/02/17/press-briefing-by-white-house-covid-19-response-team-and-public-health-officials-4/\">In a briefing Wednesday</a>, White House testing czar Carole Johnson described the funding as a “pilot” to tide the CDC over until Congress passes the proposed $1.9 trillion American Rescue Plan. The House version of that bill sets aside $1.75 billion for genomic surveillance.</p><p>“It’s really great that we have interest from Congress to invest in this,” says Lane Warmbrod, coauthor of <a href=\"https://www.centerforhealthsecurity.org/our-work/pubs_archive/pubs-pdfs/2021/20210216-covid19-variants.pdf\">a new report</a> from the Johns Hopkins Center for Health Security, outlining recommendations for what an effective SARS-CoV-2 surveillance program should look like. In the short term, she says, labs need money to buy reagents and sequencers, and to hire and train personnel to run them. That includes building up a bioinformatics workforce in public health labs—people who can sort, clean, and interpret the reams of genomic data produced by surveillance sequencing.</p><p>“The much bigger barrier is the informatics side,” says Warmbrod. In addition to people, that also means computational firepower. She and her colleagues suggest that CPU-strapped public health departments could partner with the Department of Energy, <a href=\"https://www.wired.com/story/the-us-again-has-worlds-most-powerful-supercomputer/\">which operates supercomputers</a> around the country, to process increasing loads of genomic data. “We have the capacity and the expertise in this country,” she says. “We just need to incentivize it and put resources where it’ll be most efficient.”</p><p>She and her colleagues recommend that funds should go toward coordinating the characterization of variants—which ones should be studied and what experiments scientists should perform. Right now, the old standards of science are still largely being applied. Whoever discovers a variant gets to hold onto it and study it. But when those discoveries could have such a huge effect on human health, Warmbrod argues, the government might want to step in to make sure studies are being done swiftly, safely, and in the public eye. In the longer term, she also believes the US should invest some of those congressional funds in <a href=\"https://www.wired.com/story/its-time-for-a-national-pandemic-prediction-agency/\">a national pandemic prediction agency</a> to safeguard against emerging threats even after the Covid crisis subsides.</p><p>But for now, building up sequencing capacity in whatever way gets it done the fastest should be the highest priority, says Warmbrod. “We know variants are here. We know they’re going to keep coming as long as there’s transmission. These variants could pop up anywhere,” she says. “And right now, in most places in the country, a new variant could be popping up in your backyard, and we’d have no idea because we can’t see it.”</p><p><em>This story originally appeared on <a href=\"https://www.wired.com/story/as-coronavirus-variants-spread-the-us-struggles-to-keep-up/\">wired.com</a>.</em></p></div></div></div>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"78575ad784bfecca4dfda17dd8555dc29fc19245b34a0c3f80519636d9fd109d","category":"Tech"}