{"title":"Race schedule updates for Van Aert, Alaphilippe, and Sagan: Daily News","link":"https://cyclingtips.com/2021/02/race-schedule-updates-for-van-aert-alaphilippe-and-sagan-daily-news/","date":1613418694000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Julian Alaphilippe of France attacks on the final climb on his way to winning Gold and the rainbow jersey in the Elite Men's Road Race at the UCI Road World Championships in Imola, Italy. Picture by Alex Whitehead submitted to the Mark Gunter Photographer of the Year Awards.</h4><p></p><div><p>Hello CyclingTips readers,&nbsp;</p><p>Racing is moving along as planned in Europe, which means the top riders are vocalizing their race schedules as well as their goals.</p><p>Read on for more.</p><p><em>Abby Mickey<br>Associate Editor</em></p><h2>What’s news?</h2><h3>Peter Sagan to miss Omloop Het Nieuwsblad and Kuurne – Brussels – Kuurne</h3><p>Peter Sagan is back on the road after testing positive for coronavirus, however, the former world champion will still miss the opening weekend of races in Belgium.</p><p>Sagan tested positive while in Gran Canaria for a team camp. His brother Juraj and teammate Erik Baska also tested positive. The three Bora-Hansgrohe riders quarantined for ten days, during which they were not permitted to ride outside. Now that his quarantine has finished, Sagan has remained in Gran Canaria to continue his training camp as planned.</p><p>After a rider tests positive for COVID-19 the UCI mandates they conduct a series of health checks, including heart and lung tests, to monitor for any lingering effects of COVID-19. It is unclear whether this is the reason Sagan will miss the Belgian races or if it is due to the missed training block.</p><p>Omloop Het Nieuwsblad is set to take place on February 27th, with Kuurne – Brussels – Kuurne scheduled for the following day.</p><h3>Wout van Aert to target Flanders World Championships</h3><p>The sky is blue, fire is hot, tyres should have air in them, and Wout van Aert plans to target the World Championships in Belgium this season.</p><p>In an interview with RTBF, a Belgian television channel, Van Aert described his ideal season.</p><p>“I’ll have three periods where I want to be in my best shape but if I have to choose one goal, I’d pick the World Championships in Belgium in Leuven,” said Van Aert. “I think it’s a classic course with small hills and cobblestones. So there are possibilities for me to do something. But I also want to win a Classic in the Spring and after that do a good Tour de France with the team. I think these are three big goals but if I have to choose, I would say the World Championships in Belgium.”</p><p>At the moment Van Aert is coming down from his cyclocross season and building into his road form. He will return to racing on the road at Strade Bianche on March 6th, a race he won in 2020.</p><p>In the interview, Van Aert also said that he would focus on the time trial at the Tokyo Olympics as opposed to the road race. “I think I’ll aim for the time trial at the Olympics rather than in the road race. The (road race) course is very hard, so I think the time trial is my best opportunity to win a medal.”</p><h3>Tour de la Provence was a good season opener for Julian Alaphilippe</h3><p>For Julian Alaphilippe the Tour de la Provence was a successful first step to his 2021 season. With an eye on the Ardennes at the end of April, every race is paramount, according to Alaphilippe.</p><p>In <a href=\"https://www.cyclismactu.net/news-tour-de-la-provence-julian-alaphilippe-a-commence-tr-s-bien-socialnetwork-98694.html\" target=\"_blank\" rel=\"noreferrer noopener\">an interview with Cyclism’actu</a> Alaphilippe stated “everything that happens now is going to be very important. I have a big program until Liège, there are only races that I like and where I am motivated, so I will give the maximum.”</p><p>The world champion finished second overall due to some spectacular climbing up Mont Ventoux on stage 3. After matching Egan Bernal on the climb to Chalet Reynard Alaphilippe finished third on the stage behind the overall race winner Iván Sosa and Bernal.</p><p>“I’m very happy with my form, very happy with the Tour de La Provence in general, we really enjoyed ourselves with some great victories, we tried again on the last day and we can be satisfied with our week,” said Alaphilippe.</p><p>The planned schedule for Alaphilippe includes Omloop Het Nieuwsblad, Strade Bianche, Tirreno-Adriatico, and Milan-Sanremo.</p><h3>Chris Froome pushes the limits of the new UCI rules</h3><p>While training in California Chris Froome tested the limits of the UCI’s new <a href=\"https://cyclingtips.com/2021/02/uci-reiterates-ban-on-invisible-aero-bars/\" target=\"_blank\" rel=\"noreferrer noopener\">ban</a> on invisible aero bars.</p><p>His makeshift aero position should pass the UCI’s rule and he has until April 1st to build up that pinky strength.</p><h2>In case you missed it…</h2><h3>Women’s WorldTour kits of 2021, ranked</h3><p>As we approach the start of the women’s road season, it’s time to take a look at <a href=\"https://cyclingtips.com/2021/02/womens-worldtour-kits-of-2021-ranked/\" target=\"_blank\" rel=\"noreferrer noopener\">the best and worst</a> of the 2021 Women’s WorldTour kits.</p><h3>Spotlight: Arundel shop inflator</h3><p>In the first of our Spotlight series, Dave Rome highlights the <a href=\"https://cyclingtips.com/2021/02/arundel-shop-inflator-review-spotlight/\" target=\"_blank\" rel=\"noreferrer noopener\">Arundel shop inflator</a>.</p><h3>Maxxis Receptor is a new gravel tyre featuring MTB tech and a tan sidewall</h3><p>Following the release of its updated High Road range, Maxxis has announced the <a href=\"https://cyclingtips.com/2021/02/maxxis-receptor-is-a-new-gravel-tyre-featuring-mtb-tech-and-a-tan-sidewall/\" target=\"_blank\" rel=\"noreferrer noopener\">Receptor tyre</a>, an entirely new addition to its gravel range.</p><h3>Brew Review: Scott Centric Plus helmet</h3><p>David Shoddy Everett reviews the new <a href=\"https://cyclingtips.com/2021/02/brew-review-scott-centric-plus-helmet/\" target=\"_blank\" rel=\"noreferrer noopener\">Scott Centric Plus helmet</a>, the first in his new video series “Brew Reviews”.</p><h3>E-bike act in congress would provide tax breaks for e-bike purchases. Will it help?</h3><p>The E-BIKE act proposes implementing a 30% consumer tax credit up to a maximum of $1,500, on purchases of new e-bikes costing less than $8,000.&nbsp; Learn more about it <a href=\"https://cyclingtips.com/2021/02/e-bike-act-in-congress-would-provide-tax-breaks-for-e-bike-purchases-will-it-help/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</p><div><h5>Tags</h5></div></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"795e11ec81018e7c5189eadb421d63f838ab11faa1f9d5199226161a40447a7c","category":"Cycling"}