{"title":"John Degenkolb signs three-year deal with Team DSM","link":"https://cyclingtips.com/2021/08/john-degenkolb-signs-three-year-deal-with-team-dsm/","date":1628170005000,"content":"<div><div><p>John Degenkolb will return to Team DSM in 2022 on a three-year deal. The German has riding been with Lotto Soudal for the past two seasons.</p><p>Degenkolb was part of Team DSM in 2012 when the team was Argos-Shimano, before it moved up to WorldTour ranking in 2013. He remained with Team DSM under various title-sponsorships for five years before he transferred to Trek-Segafredo only in 2017.</p><p>“I had a great time with the team previously and we have always remained good friends as I made my journey through the peloton,” Degenkolb said in Team DSM’s press release about the signing. “I’m really looking forward to re-immersing myself back into this culture, integrating into the sprint train and the classics block, and being part of the group that hunts stage results in a Grand Tour. Personally, I also have the ambition to grow into the role as a road captain and the team is the perfect place for me to do that.”</p><p>Degenkolb enjoyed some of the best years of his career while racing for the German team. He won Paris-Roubaix and Milano-Sanremo in 2015 as well as ten stages of the Vuelta a España between 2012 and 2015 and Gent-Wevelgem in 2014.</p><p>“We’re delighted to have John back in the team with us,” said head coach Rudi Kemna. “We really enjoyed our time together before and we’re looking forward to building on that in the coming years. Someone of John’s experience is crucial for both the hectic moments in a race, but also to help to push each other to be better outside of the race. As part of our sprint train and classics block, John will strengthen our capacity, guiding the team as we fight for results throughout the season.”</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"79f3c4e6959bda6a15d09c147ce84b437eb0d36102996dc27ebaf5385d450dc0","category":"Cycling"}