{"title":"Roglic and Pogacar are the world’s best stage racers, and it’s not close","link":"https://cyclingtips.com/2021/04/roglic-and-pogacar-are-the-best-stage-racers-in-the-world-and-its-not-close/","date":1618187209000,"content":"<div><div><p>Two weeks ago, the Ineos Grenadiers <a href=\"https://cyclingtips.com/2021/03/ineos-sweeps-the-volta-a-catalunya-gc-podium-as-yates-takes-the-overall/\" target=\"_blank\">swept the podium at the Volta a Catalunya</a>, reminding the cycling world how effective the British team can still be. Of course, cycling’s two Slovenian superstars were absent from that race, and this past week at the Itzulia Basque Country, Primoz Roglic and Tadej Pogacar provided yet another example – just in case you forgot – that they are the sport’s top stage racers right now.</p><p>At the moment, it doesn’t even seem all that close.</p><p>At the start of the Itzulia Basque Country, Primoz Roglic downplayed any talk of the race being all about him battling Tadej Pogacar. “There are really a lot of strong guys here,” he insisted.</p><p>Pogacar’s UAE-Team Emirates teammate Brandon McNulty, who spent a few days atop the overall standings, and Roglic’s Jumbo-Visma teammate Jonas Vingegaard, who ended up on the podium, worked hard to prove Roglic’s point this week. When all was said and done, however, it was hard to look past the performances that Roglic and Pogacar put in. Roglic finished the race atop the final standings with Vingegaard in second and Pogacar in third.</p><p>Roglic had successfully defended his title in the race with a complete performance, while Pogacar looked like a strong overall contender in the early goings before putting his form on display in a more supportive role for McNulty.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/CORVOS_00033032-055-1340x894.jpeg\"><figcaption>The final podium (from left to right): Pogacar (third), Roglic (first) and Vingegaard (second).</figcaption></figure><p>Roglic won the opening TT with Pogacar taking a solid fifth. On stage 3, Pogacar pushed the pace at the front of a dwindling pack up a double-digit finishing climb to Ermualde, while Roglic attacked here and there for good measure. After repeated attacks, they finally pulled clear to fight for the win between themselves. Pogacar took the win just ahead of Roglic.</p><p>McNulty took the race lead from Roglic with a savvy move on stage 4, but on the final stage, it was Roglic who made the most of a strong tactical setup when other teams helped force and maintain a split to McNulty. The reigning Vuelta champ went on to take a convincing overall win.</p><p>Pogacar, meanwhile, pulled for McNulty for what felt like an eternity, and then when McNulty faded, he pressed on for his own GC result and still managed to keep the gap to Roglic small, ultimately landing on the final podium despite all of his work for someone else.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/CORVOS_00033032-027-1340x791.jpeg\"><figcaption>Pogacar, in the red and white of KOM leader, riding for teammate and race leader Brandon McNulty on the final stage. Pogacar would go on to ride for his own result when the American was dropped.</figcaption></figure><p>On the most challenging climbs of the race, all eyes were on Roglic and Pogacar this week, just like they are in every stage race they start.</p><p>Roglic and Pogacar look to be head and shoulders above the competition in the sport’s biggest stage races right now, and there’s little reason to expect that to change any time soon. They’ve been so consistent so far.</p><p>Pogacar, coming off a Tour de France win, started his year with a dominant overall win at the UAE Tour before doing likewise at Tirreno-Adriatico. Roglic, coming off a runner-up ride at the Tour and his second straight Vuelta a España win, won three stages at Paris-Nice before crashing out of contention on the final stage. He followed that up with a stellar performance in the Basque Country, where he won the opening time trial and the overall.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/CORVOS_00033032-037-1340x894.jpeg\"><figcaption>Roglic secured another stage race win at the Tour of the Basque Country.</figcaption></figure><p>Fortunately for those who enjoy watching hard-fought battles between big stars, both riders are remarkably evenly matched, elite in TTs and climbs alike.</p><p>Pogacar may have won that <a href=\"https://cyclingtips.com/2020/09/tadej-pogacar-broke-all-the-rules/\" target=\"_blank\">decisive final TT in last year’s Tour</a>, but Roglic has a longer track record of TT success and has won multiple TT battles against his compatriot, including this week in the Basque Country. Pogacar may have a very slight advantage on the very steep stuff and is perhaps a hair more explosive, but Roglic boasts a more well-rounded team. For now, neither rider has the clear edge over the other at the start of a big stage race.</p><p>Meanwhile, the rest of the peloton appears to be playing catch-up. Paris-Nice, where Roglic looked untouchable until his crash-marred final day, is the only WorldTour stage race since before last year’s Tour where one or both of Pogacar and Roglic have started and one of them hasn’t taken the overall title. At this point, there’s enough evidence of their collective strength to expect Pogacar and Roglic to continue battling each other – while making short work of their rivals – as we get into the biggest stage race of the year this June.</p><p>Sure, Ineos has a star-packed roster. Maybe Geraint Thomas, Richard Carapaz, Adam Yates, Egan Bernal, or Tao Geoghegan Hart will be able to get involved in the Pogacar and Roglic battle royale we seem destined to get on the steep stuff at the Tour. Or maybe the challenge to the dominance of the Slovenians will come from somewhere a bit more unexpected. Perhaps Chris Froome will find his old form.</p><p>For now, however, it’s little wonder that Pogacar and Roglic are the bookies’ top two favorites for yellow this year with a big gap to the rest of the field. And until their rivals prove they can hang, that’s not likely to change any time soon.</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7a1d9200c1780f9555e709b50e65a891ff2844b61eefc176b368045f1a987517","category":"Cycling"}