{"title":"Brailsford: ‘we’re in unknown territory’","link":"https://cyclingtips.com/2021/07/brailsford-were-in-unknown-territory/","date":1625340249000,"content":"<div><p></p><h4>Richard Carapaz (Ineos Grenadiers) attacking on stage 7 of the Tour de France.</h4><p></p><div><p>The Ineos Grenadiers came into the Tour de France with what was considered the strongest team. Among them are the 2018 Tour de France champion, Geraint Thomas, two Giro d’Italia winners in Richard Carapaz and Tao Geoghegan Hart, and the recent Critérium du Dauphiné winner, Richie Porte. However, they were thought to be in a unique position, in that their number did not include the strongest rider in the race.</p><p>It’s fast becoming clear that the strongest rider by far is defending champion Tadej Pogačar of UAE Team Emirates. Having avoided the crashes that plagued the early stages this year before winning stage 5, Pogačar has steadily confirmed his status, not least during Saturday’s <a href=\"https://cyclingtips.com/2021/07/dylan-teuns-wins-stage-8-of-the-tour-de-france/\">stage 8</a>. His punishing attack on the penultimate climb, over 30 km from the finish, drew Carapaz out of the reduced bunch, but in no time he was flying solo.</p><p>Pogačar raced to fourth place on the stage, enough to put him in the <a href=\"https://cyclingtips.com/2021/07/pogacar-we-didnt-plan-for-me-to-hit-hard-today/\">yellow jersey</a> with a margin of 1:49 over second place Wout van Aert (Jumbo-Visma). The first Ineos Grenadiers rider home was Richard Carapaz, whose 13th on the stage saw him jump up to sixth overall, 5:01 behind Pogačar.</p><p>Ineos Grenadiers team boss, Dave Brailsford, spoke to a group of reporters at the end of stage 8, commenting on the exceptional talent of the young Slovenian.</p><p>“I think we’ve all watched cycling for a long time and it’s rare you see a performance like that and all credit to him,” Brailsford said. “He’s on a different level to everybody else. He was quite brave to go where he did and you can only stand back and admire that.</p><p>Brailsford has seen his team through various guises to no less than seven Tour de France victories, the last of them Egan Bernal’s 2019 win. However, the Ineos Grenadiers are now on the back foot.</p><p>“It’s the same as for everybody else. You’ve just got to keep fighting,” he told reporters. “I said before the race this was going to be about expecting the unexpected, and it’s been an incredible race, such a hard day today [stage 8] and yesterday. If everybody keeps racing at this intensity then who is going to be left standing in two and a half or three weeks time?”</p><p>It was hoped that the four potential leaders within the Ineos Grenadiers might be able to put Pogačar under pressure in the mountains, but they started to fall away as early as the <a href=\"https://cyclingtips.com/2021/06/after-one-tour-stage-only-two-ineos-riders-are-left-within-two-minutes-of-yellow/\">crash-marred stage 1</a>. Richie Porte and Tao Geoghegan Hart both dropped out of contention, and then Geraint Thomas <a href=\"https://cyclingtips.com/2021/06/nightmare-continues-for-ineos-grenadiers-at-the-tour-de-france/\">came down heavily in stage 3</a>, dislocating his shoulder. Though Thomas remained in touching distance of the top 10 <a href=\"https://cyclingtips.com/2021/07/geraint-thomass-gc-hopes-fade-on-the-tours-first-mountain-stage/\">until stage 8</a>, Carapaz was already more than laying claim to team leadership.</p><p>“He’s [Carapaz] riding the strongest at this moment in time and he’s brave,” Brailsford said. “He tried yesterday and tried again today and I like that. He’ll need to manage his effort but he has that attitude of going on the offensive and we’ll keep on doing that.</p><p>“It’s very exciting and it feels like we’re in unknown territory so we’ll keep our wits about us. That was a fantastic performance [by Pogačar] but you don’t know what’s round the next corner. You don’t drop your guard and you keep on challenging.”</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7a2835ea8860c2dffb98d5a890c9096d11f37c5d1efc7f1a9dc9e3d1ec197fe8","category":"Cycling"}