{"title":"Koksijde boxing match ends in victory for World Cup leader Eli Iserbyt","link":"https://cyclingtips.com/2021/11/koksijde-boxing-match-ends-in-victory-for-world-cup-leader-eli-iserbyt/","date":1637507423000,"content":"<div><div><p>Eli Iserbyt (Pauwels Sauzen-Bingoal) fought his way to a second victory of the weekend in round seven of the World Cup, extending his overall lead over the infamous dunes of Koksijde.</p><p>Since the <a href=\"https://cyclingtips.com/2021/11/annemarie-worst-returns-to-winning-ways-on-the-sand-dunes-of-koksijde/\">women’s elite race</a>, the sand had taken on a muddy brown hue and the tarmac was slick from the steadily falling rain, which splashed upwards in the furious sprint off the start line. Mercifully, the precipitation eased as the race got underway, but it was back to stay as the drama unfolded.</p><p>Round seven saw hot-blooded racing from the start, Iserbyt and Toon Aerts (Baloise Trek Lions) locking horns for the second time this weekend. There were about a dozen riders within ten seconds of the front of the race until around the halfway point when Aerts, Iserbyt, Quinten Hermans (Tormans Circus), Laurens Sweeck (Pauwels Sauzen-Bingoal), Corne van Kessel (Tormans Circus) and Lars van der Haar (Baloise Trek Lions) broke the elastic.</p><p>Iserbyt and Aerts forged ahead on lap five, the pair matched on pace, but each showing strengths on different sections. With Iserbyt landing blows on the climbs and punchy accelerations, his larger rival used his power through the hefty Herygers Dune.</p><p>It looked like the leading pair would duke it out for the victory, but they were rejoined on the penultimate lap by Hermans and Sweeck, Van der Haar chasing in fifth place.</p><p>With Iserbyt leading from the front as the group hit a sandy ramp, a moment of weakness for Aerts gifted the World Cup leader a few bike lengths and that was it. Iserbyt increased his advantage as he rode the final lap alone, ultimately taking victory ahead of his teammate Sweeck and Aerts in third.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033751-018-1340x905.jpg\"><figcaption>Iserbyt reaches out for victory on the Herygers Dune.</figcaption></figure></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7ae046c958b5a55eec936484656589ef0a616c874464101187c03a436c4c958c","category":"Cycling"}