{"title":"Bastion confirms its handlebar was responsible for Aussie team pursuit crash","link":"https://cyclingtips.com/2021/08/bastion-is-investigating-australias-broken-track-pursuit-handlebar/","date":1627961975000,"content":"<div><div><p>The cycling corner of the internet continues to be abuzz about last night’s men’s team pursuit qualifying in Tokyo. And while a new Olympic record was set by the Danish team, who seemingly all <a href=\"https://cyclingtips.com/2021/08/denmarks-pursuit-team-shin-tape-uci-rule-loophole-or-team-wide-shin-injury/\" target=\"_blank\">share the same shin injury</a>, much of the talk is related to the failed stem that saw <a href=\"https://cyclingtips.com/2021/08/australians-handlebar-snaps-during-olympic-team-pursuit-qualifying/\" target=\"_blank\">Australian Alex Porter painfully kiss the boards</a>. </p><p>Argon 18, the bicycle partner of the Australia Cycling Team, <a href=\"https://cyclingtips.com/2021/08/argon-18-says-its-handlebar-wasnt-responsible-for-aussie-team-pursuit-crash/\" target=\"_blank\">released a statement earlier today stating the failed product was not theirs</a>. And such a statement only added butane to the burning rumours suggesting that the failed pursuit base bar was manufactured by Australian 3D-printed titanium specialists Bastion Cycles. </p><p>Bastion has finally released a statement that suggests the failed component is indeed a Bastion part but offers little information beyond that.</p><p>Bastion’s response was simply too slow for the modern digital world and left the door wide open to unsubstantiated rumours.</p><p>Bastion’s full statement is included below. </p><blockquote><p><em>Our team is working with the Australian Olympic Team to understand the cause behind the failure of one of our handlebar units during the four-person, Australian pursuit challenge at the Tokyo Olympics overnight.</em></p><p><em>Bastion co-founder, Ben Schultz, said, “Our first concern was for Alex Porter and the entire team. We are in constant contact with the Australian Olympic cycling team and coaches, and give our assurances that we are using all means available to investigate why this occurred,</em></p><p><em>“Our focus at this time is to continue supporting the Australian cycling team for the remainder of the competition,” said Schultz.</em></p><p><em>Bastion has been providing custom-made components for elite athletes since 2016, using leading-edge composite and titanium 3D printed materials, and remains committed to supporting the Australian Olympic and Paralympic Team.</em></p></blockquote><blockquote></blockquote><p>AusCycling has released a statement of its own which falls closely in line with what Bastion has said. That statement is below:</p><blockquote><p><em>Last night’s incident in the heats of the men’s team pursuit was both a shock and disappointment for all involved in the Olympic program and for cycling fans across Australia.</em></p><p><em>AusCycling’s immediate concern is for the welfare of Alex Porter and his team-mates. The fact that Alex and the team were able to ride again to be in contention for a Bronze medal, was both inspirational and courageous.</em></p><p><em>Discussion concerning what caused the incident is understandable, but it is clear that it will take some time to establish exactly what happened.</em></p><p><em>A high performance bike is made up of many components. AusCycling can confirm that the part involved in last night’s incident was not manufactured by Argon 18, who supply bikes to the Australian Cycling Team.</em></p><p><em>While the immediate focus is on the success of the Australian Cycling Team across the remainder of the Olympic program, there will be a thorough investigation and review of the factors involved in the incident.</em></p><p><em>To ensure the fairness of this process, we will make no comment on the detail of the investigation until it is complete.</em></p></blockquote></div></div>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7b1aa9ac3d497cc277e4ded003d34f39b3b027d3925e56ec427e0a4f99078d68","category":"Cycling"}