{"title":"The work never stops for a Tour de France contender","link":"https://cyclingtips.com/2021/04/the-work-never-stops-for-a-tour-de-france-contender/","date":1618203900000,"content":"<div><div><p>You’d think a quiet Sunday would have been in order for Primoz Roglic (Jumbo-Visma). The Slovenian superstar had just spent six days racing the Itzulia Basque Country where he won a stage and, eventually, the race overall.</p><p>But less than 24 hours after claiming victory in the Basque Country, Roglic was already back on the tools, and in impressive fashion too.</p><p>On Sunday morning, a tweet from Jumbo-Visma coach Grischa Niermann showed Roglic riding reconnaissance of the stage 20 time trial for this year’s Tour de France. The pair had driven roughly four hours from Arrate in the Basque Country to Libourne in south-west France where the 31 km individual time trial will begin.</p><p>Later that day, Niermann tweeted another photo of Roglic on his time trial bike, this time seemingly on the route of the stage 5 ITT. That particular stage starts another four hours north of where Roglic had been checking out the stage 20 course that morning.</p><p>It’s hardly unusual for a top GC contender to ride reconnaissance of key Grand Tour stages ahead of time. But checking out two stages in one day, with a whole stack of driving in between, the day after winning a gruelling WorldTour stage race – that’s a little less common.</p><p>Regardless of what Roglic got out of his recon rides, Niermann’s tweets are a shot over the bow at the Slovenian’s rivals. They’re a very public sign that Roglic is giving it everything to be ready for the Tour; to avenge <a href=\"https://cyclingtips.com/2020/09/what-do-you-say-to-someone-who-just-lost-the-tour-de-france/\" target=\"_blank\">last year’s heartbreaking near-miss</a>.</p></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7b623a7f4f33c54b17e004d13864371cb9521d280938cf0de34f42b9b318b735","category":"Cycling"}