{"title":"W.H.O. Investigators to Scrap Plans for Interim Report on Probe of COVID-19 Origins","link":"https://www.wsj.com/articles/who-investigators-to-scrap-interim-report-on-probe-of-covid-19-origins-11614865067","date":1615069489000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>BEIJING—A World Health Organization team investigating the origins of Covid-19 is planning to scrap an interim report on its recent mission to China amid mounting tensions between Beijing and Washington over the investigation and an appeal from one international group of scientists for a new probe.</p><p>The group of two dozen scientists is calling <a href=\"https://s.wsj.net/public/resources/documents/COVID%20OPEN%20LETTER%20FINAL%20030421%20(1).pdf\" target=\"_blank\">in an open letter</a> on Thursday for a new international inquiry. They say the WHO team that last month completed <a href=\"https://www.wsj.com/articles/in-hunt-for-covid-19-origin-patient-zero-points-to-second-wuhan-market-11614335404?mod=article_inline\" target=\"_blank\">a mission to Wuhan</a>—the Chinese city where the first known cases were found—had insufficient access to adequately investigate possible sources of the new coronavirus, including whether it slipped from a laboratory.</p><p>Their appeal comes as the U.S.—which recently reversed a decision to leave the WHO—<a href=\"https://www.wsj.com/articles/u-s-expresses-deep-concerns-over-china-withholding-data-from-pandemic-investigators-11613235225?mod=article_inline\" target=\"_blank\">lobbies for greater transparency</a> in the investigation, saying it is waiting to scrutinize the report on the Wuhan mission, and urging China to release all relevant data, including on the first confirmed infections in December 2019, and <a href=\"https://www.wsj.com/articles/covid-19-was-spreading-in-china-before-first-confirmed-cases-fresh-evidence-suggests-11613730600?mod=article_inline\" target=\"_blank\">potential earlier ones</a>.</p><p>Beijing, meanwhile, is pressing for similar WHO-led missions to other countries, including the U.S., to investigate whether the virus could have originated outside China and spread to Wuhan <a href=\"https://www.wsj.com/articles/who-caught-between-china-and-west-on-frozen-food-coronavirus-transmission-11611324088?mod=article_inline\" target=\"_blank\">via frozen food packaging</a>.</p><p>WHO chief Tedros Adhanom Ghebreyesus<a href=\"https://www.wsj.com/articles/china-refuses-to-give-who-raw-data-on-early-covid-19-cases-11613150580?mod=article_inline\" target=\"_blank\">said on Feb. 12</a> that the team would release an interim report briefly summarizing the Wuhan mission, possibly the following week, with a full report coming weeks later. But that summary report has yet to be published and the WHO team is now scrapping that plan, said Peter Ben Embarek, the food-safety scientist who led the team. The WHO team plans to publish a summary along with the full, final report, he said. That final report “will be published in coming weeks and will include key findings,” a WHO spokesman said.</p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7d0d3558ec539547eb2291ee674921ace41c064b91e1ababb7abe253bda8d2a8","category":"Tech"}