{"title":"Your complete guide to buying a balance bike","link":"https://cyclingtips.com/2021/11/your-complete-guide-to-buying-a-balance-bike/","date":1638265389000,"content":"<div><div><p>Riding a bike. They say you never forget, but how do we learn in the first place? Most of us learned to ride with training wheels, aka stabilisers. However, balance is a key skill in riding a bike and stabilisers do little to foster little one’s balance development.</p><p>Balance bikes provide a fun way for children from as young as 18 months right up to six years of age develop these balance, coordination, and motor skills. In this article we’ll cover everything you need to know about balance bikes.</p><h2>What is a balance bike?</h2><p>In its simplest form, a balance bike is a bike with the drivetrain removed (i.e. pedals, cranks, chain, chainring, and sprocket, all gone). With the complication of pedalling removed, kids can walk, scoot, and run the bike rather than pedal. Crucially for children learning to ride, balance bikes don’t have stabilisers – instead they’re focused on developing the child’s balance and confidence by allowing them to keep both feet on the ground as they develop this vital skill. </p><p>The traditional learning-to-ride journey on bikes with training wheels first develops the child’s pedalling skill, before introducing the balance skill later. Balance bikes flip that approach on its head, by first developing balance and later introducing pedalling. In my experience, children find the progression on a balance bike more intuitive than trying to adapt to a regular pedal bike with training wheels. A child’s confidence also grows as they progress on a balance bike, building another key component for when the time comes to pedal off unassisted.</p><p>Having previously worked with <a href=\"https://www.sustrans.org.uk/\" target=\"_blank\">Sustrans</a> as an Active School Travel officer, leading countless school sessions where stabilisers were ditched, and now with a little rascal in our own house, I have plenty of balance bike experience. Starting with a balance bike (or adapted pedal bike – more on this later), and focusing first on developing a child’s balance, we would see success rates of 80-90% with a single 45-minute session in schools. Unsurprisingly then, I am now firmly in the pro-balance bike camp.</p><p>Here are some of the key considerations when selecting a balance bike for your little one.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/balance-bike-buyers-guide-group-test-1340x754.jpg\"></figure><h2>Benefits of balance bikes</h2><p>With minimal components and smaller wheels, balance bikes are usually lower, lighter, and more agile than regular pedal bikes. This combination helps children feel comfortable with the bike, move and steer the bike, and develop those all-important skills. Using a balance bike, a child can start by simply walking the bike, then progress to quicker steps, scooting, and gliding as they gain confidence and skill. </p><p>As the child’s confidence and balance progress, they will naturally start pushing faster and exploring further. This is great for their confidence and fitness. Without the limitation of stabilisers, the child can also develop their cornering skill, learning to lean and shift their weight as the bike moves beneath them.</p><p>Balance bikes inherently have fewer parts and, as such, require relatively little maintenance. A good balance bike with durable parts and materials should provide years of use for many children. </p><blockquote><p><em>“Using a balance bike teaches a child how to balance and control their bike, which is fundamental in regards to their safety and as a foundation for development of further skills. A balance bike allows a child to progress at their own pace and gives them a sense of independence and pride from the very beginning.”</em></p><cite><em>Beth Harding, Active School Travel Coordinator schools, </em><a href=\"https://www.sustrans.org.uk/our-blog/projects/2019/northern-ireland/active-school-travel-in-northern-ireland/\" target=\"_blank\">Sustrans NI</a></cite></blockquote><h2>Balance bike or stabilisers</h2><p>The time to pedal on a regular bike will eventually come, though, and as such, balance bikes should be seen as a stepping stone rather than a bike for years to come. This coupled with the child’s age will determine the type of balance bike you choose, or even if a balance bike is the best option for some older children.</p><p>While trikes, tricycles, and stabilisers provided most of us with a successful development path, the very nature of these supported, three and four-wheel designs means the child does not require the same balance to ride. Furthermore, the child can become reliant on the assistance these supported designs offer, potentially delaying their development. By opting for a balance bike, the child can focus on enjoying all the fun a bike can offer while also developing these essential skills.</p><blockquote><p><em>“Speaking from work experience (teaching children to ride bikes and to develop a love of bikes from an early age in my role with Sustrans) and speaking from personal experience (as a mother of a free-wheeling three-year old), I wholeheartedly recommend balance bikes for young children as the best way for them to learn core skills and to experience the exciting feeling of freedom on two wheels. Each to their own, but I would encourage families to avoid using stabilisers altogether.”</em></p><cite>Beth Harding, Sustrans</cite></blockquote><h2>Balance bike buyer’s guide</h2><p>So you have decided on a balance bike, but which bike is right for your child? As with any purchase, many factors will play a role in deciding the right option. We have listed our balance bike buyer’s guide checklist below in the order of importance we recommend. </p><h3>Age</h3><p>Many sites and manufacturers will list age ranges from 18 months to anywhere from four to six years as suitable balance bike ages. Once a child can walk, they can start with a balance bike, initially just getting accustomed and comfortable with the bike. However, how much use a balance bike will see largely depends on the child’s age and how many children might use the bike. </p><p>While a balance bike is suitable for most children learning to ride, an adapted pedal bike might provide a more suitable longer-term option for older children. From the age of five, a balance bike will likely only play a very short part in the process of learning to ride a normal bike.</p><p>I have seen countless kids in this age group go from having no riding ability to riding unassisted and confidently in as little as 45 minutes. If available, balance bikes can still play a fantastic role here, but purchasing a balance bike specifically for children in this age group might not be the most efficient option. Instead, consider a regular pedal bike, perhaps putting the money saved on a balance bike into a lighter pedal bike. Then, by removing the pedals and dropping the saddle, this regular bike is transformed into a balance bike to help with the initial confidence and skill development phase of learning to ride.</p><p>As the child progresses, they can build up to using both pedals. Once cycling a regular bike the child is unlikely to want to go back to a balance bike. This is the basic process we used for countless successful <a href=\"https://www.youtube.com/watch?v=p6SNCvIN4EI&amp;t=1s\" target=\"_blank\">Sustrans Ditch the Stabilisers</a> sessions.</p><h3>Price</h3><p>As with any purchase, price will likely be a key factor. Balance bikes prices can range from £30 all the way up to an eye-watering £1,000 (US$40-$1,330 / AU$55-1,850). Thankfully, most balance bikes will fall towards the lower end of this price range. Set your price range based on what is affordable for you and the likely usage duration for the bike.</p><p>Lower-priced bikes can sometimes be just as fun for the child and even lower weight but lack the durability or serviceability of higher-priced bikes. More on this later. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/HotwalkCarbon_Ortiz-0919_FINAL-1340x894.jpg\"><figcaption>The HotWalk Carbon sure looks fun, but it’s by far the highest-price bike we tested. (Photo: Specialized)</figcaption></figure><h3>Size</h3><p>Tyre size is the most common metric used to designate the sizing of traditional kids’ pedal bikes (e.g. 16″ or 18″). While most brands note wheel size for balance bikes, saddle height range is equally important.</p><p>A good first step in deciding on the right balance bike is to measure the child’s inseam with shoes on, standing on a flat surface. Compare this inseam measurement to the minimum and maximum saddle height for a given balance bike. If the inseam measurement is less than the minimum stated saddle height, this bike is currently too big for your child. Likewise, if the maximum saddle height is smaller than the child’s inseam, that bike may be too small, although this is slightly less of an issue. A bike that is too big or too small can result in a negative experience for the child.</p><p>A good starting point for saddle height is to subtract 5 cm (2″) from the child’s inseam measurement. For a well-sized bike, check that this saddle height measurement sits within the saddle height minimum to maximum range. Having checked saddle height suitability, it is also advisable to have the child stand over the bike. The child should be able to comfortably stand over the bike with both feet on the ground and easily reach the handlebars. </p><p>Unfortunately, many manufacturers do not publish geometry charts for balance bikes. Of the bikes we have on test LittleBigBikes, Vitus and Specialized are notable exceptions in an otherwise geometry free zone.</p><h3>Weight</h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Vitus-Nippy-weight-2-1340x754.jpg\"></figure><p>Once sized correctly, a bike’s weight is the next biggest factor in how easily a child can manoeuvre and enjoy that bike. Despite having relatively few parts, some balance bikes can be incredibly heavy. A child may struggle to lift and move a heavier bike, which can be off-putting for the child. </p><p>So what is too heavy? From experience, I would suggest any bike in the 3-4 kg (6.6-8.8 pound) range will be a good weight for most children. In percentage terms aim for a bike somewhere between 20-25% of your child’s weight. The lighter the better, but less than 3 kg (6.6 lbs) usually comes with an increased price or decreased spec level. More on this later.</p><p>The number one factor in a balance bike’s weight is the frame material.  </p><h3>Frame material </h3><p>Balance bikes may appear largely similar – two-wheeled, pedal-less mini-bikes – but the materials used in the manufacturing from one bike to the next can differ entirely, determining how the bike rides and how much it costs. </p><p>Balance bike frames are typically manufactured with steel, alloy, wood, plastic, and even carbon fibre. While steel is the most robust of these materials – an important factor in withstanding the rigours of playtime – steel bikes will be amongst the heaviest options and typically sit at the pricier end of the spectrum. Steel bikes are also prone to rust if left outside or uncared for. </p><p>Aluminium is another of the pricier materials but can often make for a lighter bike. Bonus rustproof and durability points for aluminium, making it a more suitable material if the bike is likely to lie outside or you are planning on multiple children. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/DSCF6636-1340x754.jpg\"><figcaption>The steel Chillafish Fixie feels very robust mostly thanks to its 4.66 kg weight.</figcaption></figure><p>Plastic bikes are generally less durable (there are exceptions) but they’re typically lighter as well, making them easier for the child to use. They’re also cheaper than most other materials. There are obvious concerns over a plastic bike’s environmental impact. That said, some plastic bikes are amongst the most durable on the market. More on this later. </p><p>Wooden bikes can offer a more environmentally friendly option in a lightweight bike and buckets of style with the same fun experience for the child. Wooden-frame balance bikes quite often lack adjustability and, when uncared for, durability. Left out in the elements, wooden bikes can quickly deteriorate. For more on this, see the sustainability section below.</p><p>Carbon is relatively new and seldom seen in the balance bike world. While certainly far from the most practical balance bike frame material, carbon frames can contribute to much lighter bikes when built with comparable components (e.g. pneumatic tyres, spoked wheels, and cartridge bearing headsets and hubs.)</p><p>Carbon is typically more fragile – not ideal for a bike that is almost guaranteed to suffer a few falls and spend most of its life lying on a floor waiting to trip an unsuspecting adult. There is also the price – expect to pay a premium for carbon-framed balance bikes. Still, there is there cool factor for the (cycling fan) parent having mini-me on a mini carbon bike. </p><h3>Sustainability</h3><p>Wood is undoubtedly the most sustainable material used in balance bike manufacturing, and that alone should put it near the top of any wish list. That said, and as mentioned earlier, wood is typically more susceptible to the elements if left out in the rain or extreme heat. A bike left outside or uncared for can quickly deteriorate and break down.</p><p>Consideration should also be given to the bike’s components and general durability. A good quality and durable balance bike that can stand the test of time, handed down from one child to the next, will minimise the ecological impact. Less durable bikes that need replacing more often tend to find their way into landfill and have an increased environmental impact regardless of the material.</p><p>Kids will ultimately grow out of whichever balance bike they get. As such it is easy to fall into the disposable balance bike trap. Again, regardless of the frame material you choose, target well-made and durable bikes that can be kept for the next child or sold/donated to another family.</p><h3>Leasing</h3><p>If you are concerned about the sustainability of your choice and perhaps do not have the option to hand a balance bike down to other children, there are now options to lease kids bikes and balance bikes. These will vary depending on where you are in the world.</p><p>In the UK, Hope Technology (yes, that Hope of <a href=\"https://cyclingtips.com/2019/11/a-deep-dive-into-team-gbs-radical-new-track-bike-all-in-for-2/\" target=\"_blank\">Hope components and track bike</a> fame) has the <a target=\"_blank\" href=\"https://www.hopeacademyuk.com/bikes\">Hope Academy</a> kids bike leasing scheme and the <a target=\"_blank\" href=\"https://bikeclub.com/collections/balance?rfsn=4791325.146099c&amp;utm_source=refersion&amp;utm_medium=affiliate&amp;utm_campaign=4791325.146099c\">Bike Club</a> also offers a range of kids and balance bikes. Leasing might not always work out to be the cheapest option, depending on how long you wish to keep it or how often you wish to change a bike, but in some cases, it could save a bike from otherwise going to landfill when a toddler grows out of it. </p><h3>Wheels</h3><p>Just like frames, balance bike tyres come in a range of different forms and materials. Most bikes feature either pneumatic tyres with an inner tube or solid foam tyres. However, it is not uncommon to find hard plastic versions and tyres made from other materials.   </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Vitus-Nippy-balance-bike-plastic-tyres-1-1340x754.jpg\"><figcaption>The Vitus Nippy is the lightest bike on test and features plastic tyres.</figcaption></figure><p>Solid foam or plastic tyres offer many benefits, including being puncture-proof, lightweight, cheaper than pneumatic tyres, and the fact they require low or zero maintenance, Specifically, due to the lower cost, foam tyres are often found on lower-priced bikes. While keeping the price down, foam tyres also have the added benefit of keeping the weight of these lower-priced bikes down. In fact, the lightest bike on test, the Vitus Nippy, features foam tyres and is also the lowest-priced of all the bikes on test. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Hornit-Airo-pneumatic-tyre-1340x754.jpg\"><figcaption>The Hornit Airo features pneumatic tyres with an inner tube.</figcaption></figure><p>However, solid foam tyres lack the grip and ride quality of a pneumatic tyre. Inflated correctly, a pneumatic tyre can absorb bumps and vibrations to soften the ride while also providing improved grip. Furthermore, pneumatic tyres are available in different tread patterns for tarmac surfaces or off-road dirt-riding options.</p><p>Chunky and knobbly tread patterns are great for off-road loose and dirt surfaces, while smoother tyres will roll easier on hard, paved surfaces. Where possible, consider where your child will ride most and match the tread pattern to that surface.  </p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Littlebigbike-balance-bike-review-axle-nuts-1340x754.jpg\"><figcaption>Exposed, sharp-edge axle nuts can hurt little legs and wooden floors.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Specialized-Hotwalk-axle-covers-1340x754.jpg\"><figcaption>Some manufacturers provide plastic covers.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Specialized-Hotwalk-carbon-balance-bike-review-rounded-axle-nuts-1340x754.jpg\"><figcaption>While some bikes are equipped with rounded …</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Hornit-Airo-Balance-bike-review-recessed-nuts--1340x754.jpg\"><figcaption>… or recessed nuts.</figcaption></figure></li></ul></div></figure><p>The wheels those tyres are wrapped on can also differ. Some bikes will feature plastic moulded wheels and bushings rather than bearings in the hubs. This type of wheel helps keep costs and weight down. Other bikes will come equipped with spoked wheels and cartridge bearing hubs. These setups typically produce a smoother-rolling wheel with increased levels of serviceability and durability. However, expect to pay more for such higher-spec wheel setups usually only found on higher spec bikes.</p><p>The last thing of note on the wheels is the first thing you will notice if you need to remove a wheel: the axle bolts. While easy to overlook when considering a bike, large or exposed axle bolts can create a safety hazard for both your child and your flooring. Sharp edges on exposed bolts can cause injury in the event of a fall or even just if your child catches a leg on them. Some manufacturers equip balance bikes with plastic covers for exposed bolts, or they have rounded bolts, or, best of all, recessed bolts that sit flush with the frame and fork for a safe, smooth finish.</p><h3>Serviceability</h3><p>Hopefully, if you have got this far, you will have noticed the importance we put on a bike’s life span. Key to this life span is the bike’s durability and serviceability. While undoubtedly costing more, bikes that resemble adults bikes and manufactured with recognisable bike parts are almost always longer-lasting and more serviceable than bikes treading the line between balance bike and toy.</p><p>Toy-esque bikes will provide all the fun and balance-developing challenges your child will ever need. However, durability is unlikely to match that of the bike with more traditional and serviceable parts. </p><p>While kids will enjoy balance bikes at either end of the price scale, consider how long the child will use the bike, how many children will use the bike, and the cost/benefit of a more durable and serviceable bike before making a purchase.</p><h3>Headset </h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Specialized-Hotwalk-Carbon-headset-1340x754.jpg\"><figcaption>The Specialized Hot Walk Carbon features a cartridge bearing headset. Similar setups are available on bikes across various price points.</figcaption></figure><p>Balance bikes typically feature either ball bearing, cartridge bearing headsets, or plastic bushings. The ball bearing or cartridge bearing headsets will provide a much smoother and unrestricted steering feel and are easily serviceable by any bike shop. Bushings may be much stickier, giving a more rigid and uninspiring steering feel. Bushings also tend to be much less durable, and it can be difficult to find replacements.   </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Y-Velo-Junior-balance-bike-plastic-headset-1340x754.jpg\"><figcaption>The Y Velo Junior balance bike features a plastic bushing headset</figcaption></figure><h3>Warranty</h3><p>Thankfully, with fewer parts, there is less to go wrong on a balance bike, but that doesn’t mean you should disregard the warranty. Just as you would with an adult’s bike, check what the warranty covers before making a final selection. Many bikes will have separate warranty cover for the frame and components. Needless to say, the warranty cover will be a significant factor if you are investing in a bike to last several years or to hand down to multiple children.</p><h3>Brakes</h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/LittleBigBikes-balance-bike-brakes-1340x754.jpg\"><figcaption>If the bike has brakes, just make sure they are kid-friendly.</figcaption></figure><p>Brakes are very much an optional extra on balance bikes. With the lower ride height and speeds, kids can rely on their feet to slow and stop the bike. However, what you save on brakes you may lose on shoe wear. </p><p>Hornit, creators of the Airo balance bike we have on test, says “Brakes are a divisive issue” and claims brakes are alien to younger (18-month to three-year-old) riders. This certainly makes sense, and my daughter never once asked how to stop her bike. Using her feet to slow was very intuitive.</p><p>Hornit also questions if brakes are in fact less safe: “We debated at length whether to have one [brake] (essentially to make the parents feel better), but resisted because it gives parents a false sense of security. Ideally balance bikes should not be used anywhere brakes are needed and not having a brake makes that more likely.”</p><p>Many manufacturers do include brakes on their balance bikes. While perhaps overlooked by the youngest children, having brakes as an option might help foster good habits from an early age. Still, not all brakes are equal. Check the brake lever reach and pull stiffness. Often brakes with poor reach or difficulty to pull can be worse than no brakes.</p><p>Older children or quick learners may reach higher speeds, and so brakes will be more important if considering a balance bike for these types. Again, the primary consideration should be ensuring a good experience for the child, which means a safe and enjoyable bike suitable for their age and speed.</p><h3>Footrests</h3><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Hornit-Airo-balance-bike-review-foot-rests-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Specialized-Hotwalk-Footrests-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/Vitus-Nippy-Balance-bike-foot-rests-1340x754.jpg\"></figure></li></ul></div><figcaption>Footrests come in many shapes and sizes and even not at all.</figcaption></figure><p>Footrests on balance bikes are a contentious issue. Ask any number of parents and you will probably find close to a 50:50 split on pro- or anti-foot rest. </p><p>One thing’s for sure: footrests are not essential. Footrests can be fun for the child and offer a place to rest their feet when they get up to speed. Resting their feet up and out of the way, the child can coast, corner, and slalom to their heart’s content. However, oversized and/or poorly positioned footrests can get in the way and obstruct the child’s stride.</p><p>Regardless of whether you are pro or anti footrests, so long as they are not obstructing the child’s natural stride, they can be an optional extra. My rule of thumb is so long as the child doesn’t notice the footrests when walking, they are probably OK. Whether or not the footrests ever get used is an entirely separate matter.</p><h3>Turning limiters</h3><p>Turning limiters are a less divisive feature but, again, far from essential. Turn limiters do as the name suggest and limit how far the handlebars can rotate. Because they prevent the handlebars and front wheel from rotating fully or jackknifing, sharp steering is less likely to cause the child to fall.</p><p>Turning limiters also prevent the child from getting pinched between the handlebars and frame. If the bike you are considering does feature a turning limiter, check it is unobtrusive, only limits steering at the outer edges of the normal steering range and, ideally, is detachable or removable.</p><h2>Where to buy</h2><p>Balance bikes transcend the bike industry and traditional local bike shops. Walk into any toy, catalogue, or outdoor store, and you’re likely to find some form of balance bike. Likewise, many big brand names in the cycling industry feature at least one balance bike offering in their range.</p><p>While the checklist in this guide should be the main consideration for which bike you choose, we recommend purchasing from a dedicated cycling retailer who can assemble and guarantee the bike. Too often in my days teaching cycling in schools, we would work on bikes with loose wheels, reversed handlebars/forks, or faulty brakes (sometimes all of the above). Trained mechanics in local bike shops can correctly assemble a bike, preventing any safety concerns.</p><h2>What to buy</h2><p>So, now that you know what you’re looking for in a balance bike, which one should you buy? As noted, we’ve recently had a whole bunch of balance bikes on test. Stay posted for a separate article in which we go into depths on all seven bikes …</p></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7e210f4021dcb4548314af544f731903cb20d5763aaab8992a9db27d9d6f2a4d","category":"Cycling"}