{"title":"Big Tech opens wallet for publishers as Australian news code looms","link":"https://arstechnica.com/?p=1743021","date":1613573075000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Pay to play —</h4><h2 itemprop=\"description\">Google and Facebook strike deals in effort to stymie rules on paying for content.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/google-facebook-800x450.jpg\" alt=\"Close-up photography\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/google-facebook.jpg\" data-height=\"1299\" data-width=\"2309\">Enlarge</a> <span>/</span> Close-up photography</p><p>John Lamb | Getty Images</p></figcaption></figure><p>Google and Facebook are rushing to agree to deals with Australian publishers, offering them the most generous licensing terms in the world in an attempt to persuade Canberra not to apply rules forcing tech groups to pay for news.</p><p>MPs began debating legislation on Wednesday to enact the news media bargaining code, which the EU, UK, and Canada are considering as a model for similar regulations to support publishers in their own jurisdictions.</p><p>While Google has multi-million-dollar licensing deals with publishers in almost a dozen countries, people involved in negotiations told the Financial Times the sums now under discussion in Australia were “multiple times” the size of those agreements.</p><p>The developments in Australia are being closely watched in Europe and the US for evidence the tougher approach will reset the balance between publishers and tech platforms. Among the code’s features is an arbitration system that would make binding decisions on the fees Facebook and Google would have to pay news providers if commercial negotiations fail.</p><p>Google signed a letter of intent on Wednesday with Nine Entertainment, one of Australia’s largest media groups, that outlines a draft agreement to use content from its newspaper, television, and Internet assets, according to a person directly familiar with the deal.</p><p>The tech group said on Wednesday it had also struck a deal with Junkee Media to curate the small online publisher’s content on its recently launched News Showcase service.</p><p>Those followed a similar agreement Monday with Seven West Media, a group with TV, newspaper, and digital assets that is reported by Australian media to be worth A$10m to A$30m ($7.7 million to $23 million) per year. By comparison, Google’s recent framework agreement in France with more than 100 publishers is worth about €22 million ($26.5 million) a year in total, according to people familiar with the deal.</p><p>Rupert Murdoch’s News Corp and Google are also in talks over a potential global content deal, according to people with knowledge of the negotiations.</p><p>Experts said the tie-ups reflected Google’s desire to ensure Canberra did not apply the toughest elements of the code to its core search function, which the US group has warned it could be forced to close down in Australia.</p><p>“Google is desperate to not pay for news delivered through their search engine. It looks like they are paying over and above market value to secure deals that specifically exclude Google Search,” said James Meese, a lecturer in communications at RMIT University in Melbourne.</p><p>Canberra and Google could be coming to some sort of a “tacit agreement,” he added, whereby the government would not apply the code to the tech giant’s search function if it signed enough deals with publishers.</p><p>Josh Frydenberg, Australia’s treasurer, said none of the commercial deals would have been struck without the code, which had ushered in a “historic moment” for news businesses. The legislation would be enacted through parliament but the government would decide if it was enforced against Google’s search service or Facebook, he said.</p><p>“With respect to the designation of Google Search or Facebook, they are decisions that I would make after receiving the advice” of Australia’s competition regulator, he told Sky. “But if there are commercial deals in place then that becomes a different equation for me.”</p><p>Google and Facebook have not released details on how much its deals with publishers are worth, but they are not expected to reach the AU$1 billion a year that News Corp signaled the tech groups owed Australian media owners.</p><p>Google last year pledged $1 billion&nbsp;over three years to pay global publishers and has said it reached terms with 450 “news partners.”</p><p>Facebook has made less progress in signing deals with publishers, although it remains in negotiations, said people directly familiar with the matter.</p><p>The Sydney Morning Herald, the Nine-owned newspaper that first reported the draft deal between Google and its parent, said it would be worth more than AU$30 million a year.</p><p><em>Additional reporting by Richard Waters in San Francisco and Alex Barker in London.</em></p><p><em><a href=\"https://www.ft.com/\">© 2021 The Financial Times Ltd</a>. <a href=\"https://www.ft.com/\">All rights reserved</a> Not to be redistributed, copied, or modified in any way.</em></p></div></div>","author":"Financial Times","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7e2762d846d13b89b1cfc26605b5af2c4875324158b66483cb19e8ed73d24dc2","category":"Tech"}