{"title":"Vinokourov ousted from leadership at Astana","link":"https://cyclingtips.com/2021/06/vinokourov-ousted-from-leadership-at-astana/","date":1624538320000,"content":"<div><div><p>Astana team founder and longtime principal Alexandre Vinokourov has been removed from his position at the head of the Kazakh team with immediate effect. Staff and riders were informed via email at midnight and awoke to the news Thursday.</p><p>The news, first <a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Alexandre-vinokourov-ecarte-de-l-equipe-de-cyclisme-astana-a-quelques-jours-du-tour-de-france/1265517\">reported by L’Equipe</a>, was later confirmed by a statement released by the team. He was fired for ‘personal reasons,’ according to L’Equipe, which Vinokourov refutes. His legal team is reportedly already working towards his reinstatement.</p><p>Giuseppe Martinelli and Steve Bauer will assume responsibility for the Team Principal role that Vinokourov has held since 2013, when he created the team out of the ashes of Liberty Seguros.</p><p>The departure comes just days before the start of the 2021 Tour de France.</p><p>Astana’s statement reads:</p><blockquote><p>Despite the current decision, which has come from the team’s Board of Directors, Vinokurov will remain a valued member of Astana – Premier Tech but relinquish his management responsibilities for the time being.<br>Giuseppe Martinelli and Steve Bauer will assume responsibility for the Sports Team Principal role for the foreseeable future, working alongside Managing Director Yana Seel to coordinate the team’s day to day sporting operations.</p><cite>Astana’s official statement on Vinkourov’s departure.</cite></blockquote><blockquote><p><em>“We can confirm that Alexandr Vinokurov will not be present at the Tour de France this year as he will step down as Sports Team Principal. Alexandr still remains part of the team but he will not be in charge of the team’s sporting operations at the moment and will move into another role. I hope that during this period Giuseppe Martinelli and Steve Bauer will work well together to lead the team from a performance standpoint and guide our riders to success, starting here at the Tour de France where Steve will work alongside Dmitry Fofonov and Stefano Zanini.”</em></p><cite>Yana Seel, Astana – Premier Tech Managing Director.</cite></blockquote><p><em>This story is developing, check back for more.</em></p></div></div>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7eb5d833ed5bbb914da5bd7f6dac4d78463479ebd62e82670fe606f888c76a11","category":"Cycling"}