{"title":"Mäder wins stage 6 of the Giro d’Italia as Valter takes over the pink jersey","link":"https://cyclingtips.com/2021/05/mader-wins-stage-6-of-the-giro-ditalia-as-valter-takes-over-the-pink-jersey/","date":1620922342000,"content":"<div><div><p>Gino Mäder (Bahrain Victorious) won stage 6 of the Giro d’Italia on Thursday after a long day in the break, while the overall standings saw some changes as Attila Valter (Groupama-FDJ) took over the pink jersey and Egan Bernal (Ineos Grenadiers), Remco Evenepoel (Deceuninck-QuickStep), and a few others gained time on their rivals.</p><p>Mäder was part of the main breakaway on the 160 km stage from Grotte di Frasassi to Ascoli Piceno, and he soloed away from the rest of the remaining escapees on the final climb of what was a very wet and windy day in Italy. Behind, crosswinds had helped split the peloton, leaving overnight leader Alessandro De Marchi behind the main selection of GC riders. As that reduced peloton was making its way up the San Giacomo finishing climb, Pieter Serry (Deceuncink-QuickStep) was <a href=\"https://cyclingtips.com/2021/05/team-car-driver-hits-pieter-serry-from-behind/\" target=\"_blank\">hit from behind</a> by the driver of the BikeExchange team car. Fortunately, he remounted and was able to finish the stage.</p><p>The pack swept up one breakaway rider after another on the slopes of the final ascent, but Mäder would not be caught, and he would hold on to take his first Grand Tour stage victory by 12 seconds. Behind Mäder, Bernal, Evenepoel, Dan Martin (Israel Start-Up Nation) and Giulio Ciccone (Trek-Segafredo) opened up a gap on the rest of the GC hopefuls. Bernal took second on the day just ahead of Martin, with Evenepoel in fourth on the same time and Ciccone in fifth a further two seconds back.</p><p>Attila Valter, who had picked up a significant amount of time on stage 4 when he finished sixth on the day out of the early break, arrived 29 seconds down on Mäder (and 17 seconds behind Bernal) in a group that included Simon Yates (BikeExchange). That was enough to propel Valter into the overall race lead, with Evenepoel now second overall at 11 seconds back.</p><div><div><p>Giro d'Italia (2.UWT) <span>Grotte di Frasassi → Ascoli Piceno (San Giacomo)</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/bc/gino-mader-2021.jpeg\"></p></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7f9383836002d4fdbb41bb7c1c277cf9a0439f65a4f2673e14d34c76b42a3cfe","category":"Cycling"}