{"title":"EVOC Bike Packing Collection for 2021","link":"https://cyclingtips.com/2021/07/evoc-bike-packing-collection-for-2021/","date":1626388623000,"content":"<div><div><p>Carrying a bunch of stuff on a ride can be a tricky proposition. And depending on the intended duration, the amount of food, tools, gear, etc. can easily turn into more than anyone can possibly squeeze into their jersey pockets. So how do you make it all fit?</p><p>How to pack all that stuff is a dilemma as old as cycling itself. Vintage images of cyclists wearing spare tires like shoulder harnesses and brandishing wine bottles illustrate the historic need for on-bike carrying solutions. Since that bygone era though, cycling has benefitted from no small amount of ingenuity and ever advancing technology to answer the call.</p><p>Today we have modern bike packing bags made to accommodate all your gear on your bike. Why on your bike? Strapping weight and awkward items to the bike spares you from having to carry it on your person. This keeps the weight off you and alleviates unnecessary strain on your upper body and backside. And it leaves your jersey pockets free for other important things like gummy bears…uh, ‘nutrition’.</p><p>As you might expect, people have vastly different preferences and needs when it comes to packing things on their bikes. Correspondingly, we’ve developed a whole line of on-bike bags to accommodate the person who might only want a convenient way to stow a spare tube and tool, all the way up to the long-haul bike packer who needs to carry everything for an extended tour.</p><p>Here is the rundown:</p><p><img src=\"https://cyclingtips.com/%22https://cdn.shopify.com/s/files/1/0534/2321/0695/products/721299-01_1_1800x1800.jpg?v=1615928428\\%22\"></p><p><strong>Handlebar Pack BOA® (L &amp; M) 5L, 2.5L</strong></p><p>This is the mother of all handlebar bags. The BOA® fixation mechanism provides quick and secure mounting, while the spacious, waterproof bag can be accessed from either end via the dual dry bag style roll and buckle closures.</p><p>-BOA® system for easy and secure fixation<br>-Quick access from both sides<br>-Adjustable capacity due to roll-top closure<br>-Durable and waterproof<br>-For road, gravel, and mountain bikes</p><p><img src=\"https://cyclingtips.com/%22https://cdn.shopify.com/s/files/1/0534/2321/0695/products/EVOC-frame-pack-721371-02_3_1800x1800.jpg?v=1621628226\\%22\"></p><p><strong>Frame Pack 3.5L</strong></p><p>This stalwart frame pack offers up plenty of extra storage for your next adventure. It’s easy to attach securely onto your frame and it’s got space enough to stow essential clothing, tools, and whatever you’ll need on your ride.</p><p>-Easy to attach to the top tube via the 5-point fixture<br>-Frame protection stickers to prevent scratching<br>-Durable, abrasion-resistant and waterproof material<br>-Two compartments with partition for smaller parts<br>-Two full length zipper pockets, left side pocket with three mesh compartments</p><p><img src=\"https://cyclingtips.com/%22https://cdn.shopify.com/s/files/1/0534/2321/0695/products/721313-01_1_1800x1800.jpg?v=1615928468\\%22\"></p><p><strong>Multi Frame Pack (M &amp; S) 1L, 0.7L</strong></p><p>Super versatile and water repellent, this pack offers additional storage on your bike with multiple fixation options.</p><p>-Works on most types of bikes<br>-Water repellent YKK-zipper (FGP)<br>-Adjustable velcro fixation system<br>-Including frame protection stickers</p><p><img src=\"https://cyclingtips.com/%22https://cdn.shopify.com/s/files/1/0534/2321/0695/products/EVOC-top-tube-pack-721311-02_2_1800x1800.jpg?v=1621631053\\%22\"></p><p><strong>Top Tube Pack 0.5L</strong></p><p>Keep extra snacks or tools handy with this water repellent, easy to reach pack for extra storage on your top tube.</p><p>-Water repellent YKK-zipper (FGP)<br>-Additional mesh pockets<br>-Including frame protection stickers</p><p><img src=\"https://cyclingtips.com/%22https://cdn.shopify.com/s/files/1/0534/2321/0695/products/EVOC-seat-pack-boa-l-721297-01_2_1800x1800.jpg?v=1621631563\\%22\"></p><p><strong>Seat Pack BOA® (L, M &amp; S) 3L, 2L, 1L</strong></p><p>This is no ordinary seat pack. The BOA® ensures it is snugly affixed to the seat post and the roll-top dry bag construction allows you to stuff it full of gear or lower the volume when carrying a lighter load.</p><p>-Adjustable capacity due to roll-top closure<br>-Dropper post compatible<br>-Soft TPE seatpost protection<br>-Flexible main compartment closure that adjusts to bag size</p><p><img src=\"https://cyclingtips.com/%22https://cdn.shopify.com/s/files/1/0534/2321/0695/products/721294-01_1_1800x1800.jpg?v=1615928410\\%22\"></p><p><strong>Seat Bag Tour (L &amp; M) 1L, 0.5L</strong></p><p>This lightweight saddlebag made of highly water-repellent material is easily attached to any regular seatpost with velcro fasteners and offers enough space for tools and a spare inner tube.</p><p>-Very durable and water repellent material<br>-Water repellent Zipper<br>-Seatpost protection from Hypalon reinforced front<br>-Fits multitool and spare MTB tube (SIZE L)</p><p><img src=\"https://cyclingtips.com/%22https://cdn.shopify.com/s/files/1/0534/2321/0695/products/721292-02_1_1800x1800.jpg?v=1615928404\\%22\"></p><p><strong>Seat Bag (M &amp; S) 0.5L, 0.3L</strong></p><p>For light duty, this saddlebag provides enough storage for outings when you need little more than a road bike tube and repair kit.</p><p>-Pocket (mesh)<br>-Better visibility thanks to reflective accents<br>-Fixation buckle</p><h2>Key Details</h2><ul><li>EVOC products are now available in the United States at <a href=\"https://cyclingtips.com/%22https://evocsports.us//%22\">evocsports.us</a></li><li>See the new website for all these bike packing products as well as a large assortment of bike travel bags, luggage, tailgate pads, and backpacks with a huge range of back protector, hydration, and liter capacity options.</li><li>EVOC stands for evolution and the concept of high-quality. Founded and based in Germany.</li></ul></div></div>","author":"EVOC","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7fc0f8106237da730b00844cc1e15e5fcbe8ece61a829bfd5b8d2e1a9a766ef2","category":"Cycling"}