{"title":"Two visionaries: Marie Curie forged a friendship with dancer Loïe Fuller","link":"https://arstechnica.com/?p=1741723","date":1613562315000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>A friendship forged in light —</h4><h2 itemprop=\"description\">Liz Heinecke on her new book <em>Radiant</em>, a parallel biography of two extraordinary women.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant-book-review-collage-800x450.jpg\" alt=\"Poster from the Belle Epoque joins together two black-and-white photographs of women.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant-book-review-collage.jpg\" data-height=\"1126\" data-width=\"2000\">Enlarge</a> <span>/</span> <em>Radiant: The Scientist, the Dancer, and a Friendship Forged in Light</em> explores the lives of Marie Curie and Loïe&nbsp;Fuller.</p></figcaption></figure><p>Both the arts and the sciences flourished in Paris during the years of the so-called&nbsp;Belle Époque at the dawn of the 20th century. This was when Nobel Prize-winning physicist <a href=\"https://en.wikipedia.org/wiki/Marie_Curie\">Marie Curie</a> and her husband, Pierre, made their breakthrough discoveries in radioactivity, discovering two new elements. At the same time, a modern dancer and pioneer in theatrical lighting named <a href=\"https://en.wikipedia.org/wiki/Loie_Fuller\">Loïe&nbsp;Fuller</a>, who was all the rage in Paris, dreamed of incorporating radium into her stage act. Science writer and communicator Liz Heinecke brings the live of these two visionary women together in an illuminating new biography,&nbsp;<em>Radiant: The Scientist, the Dancer, and a Friendship Forged in Light</em>.</p><p>The details of <a href=\"https://history.aip.org/history/exhibits/curie/\">Marie Curie's life</a> are very well-documented and well-known. She left her native Poland and moved to Paris at 14 to pursue a degree in science, living in abject poverty while studying and conducting research. She met a chemist named Pierre Curie, and they began collaborating, eventually falling in love and getting married in 1895. The Curies had been married for six months when&nbsp;<a title=\"Wilhelm Roentgen\" href=\"https://en.wikipedia.org/wiki/Wilhelm_Roentgen\">Wilhelm Roentgen</a>&nbsp;discovered X-rays (winning the very first Nobel Prize in physics in 1901). Soon after,&nbsp;<a href=\"https://en.wikipedia.org/wiki/Henri_Becquerel\">Henri Becquerel</a>&nbsp;published his insight that uranium salts emitted rays that would fog a photographic plate in early 1896. Becquerel's uranium rays so fascinated Marie that she made them the focus of her own research.&nbsp;</p><p>With Pierre, she uncovered evidence of two new elements they dubbed polonium and radium. The couple shared the 1903 Nobel Prize in Physics with Becquerel for their work developing a theory of radioactivity—she was the first woman to be so honored. After Pierre's tragic death in a 1906 street accident, Marie developed new techniques for isolating radioactive isotopes from pitchblende and&nbsp;eventually succeeded in isolating radium in 1910. She won a second Nobel Prize (this time in chemistry) in 1911 for the discovery of polonium and radium. She remains the only woman to win the Nobel Prize twice and the only person to do so in two different scientific fields.</p><h2>People who know people</h2><p>Loïe Fuller, on the other hand, has been largely relegated to the footnotes of history, although there has been a resurgence of interest in her career and influence in recent years—most notably in a featured segment during Taylor Swift's 2018 Reputation Tour, and the work of choreographer <a href=\"https://en.wikipedia.org/wiki/Jody_Sperling\">Jody Sperling</a>. Born in the Chicago suburbs in 1862, she was a child actress who later began choreographing and performing her own dances, usually in burlesque, vaudeville, and circus venues. She started experimenting with a long skirt, moving it in different ways to explore how it reflected light, and by 1891, she had figured out how to illuminate her silk costumes during performances with lights of different colors to create striking visual effects. She was something of a self-taught chemist, eventually patenting the use of various chemical compounds and salts to create color gel and luminescent lighting.</p><p>Fuller achieved notoriety and rave reviews with her signature&nbsp;\"<a href=\"https://en.wikipedia.org/wiki/Serpentine_dance\">Serpentine Dance</a>\" (<a href=\"https://en.wikipedia.org/wiki/File:Loie_Fuller_(1901).ogv\">captured on film</a> by the <a title=\"Auguste and Louis Lumière\" href=\"https://en.wikipedia.org/wiki/Auguste_and_Louis_Lumi%C3%A8re\">Lumière</a>&nbsp;brothers in 1897, although Fuller was not the dancer featured). According to dance historian Jack Anderson, \"The costume for her <em>Serpentine Dance</em> consisted of hundreds of yards of China silk which she let billow around her while lighting effects suggested that it was catching fire and taking shapes reminiscent of flowers, clouds, birds, and butterflies.\"</p><p>Alas, other, lesser dancers soon appropriated her work for their own performances, prompting a frustrated Fuller to tour Europe in hopes of gaining more recognition for her art. Her performance at the&nbsp;<a href=\"https://en.wikipedia.org/wiki/Folies_Berg%C3%A8re\">Folies Bergère</a>&nbsp;in Paris was a smashing success, and she became a regular there, performing her \"Fire Dance\" as well as the \"Serpentine Dance.\" She was a fixture of the local <a href=\"https://en.wikipedia.org/wiki/Art_Nouveau\">Art Nouveau</a> scene, hanging out with such luminaries as Henri de Toulouse-Lautrec, Auguste Rodin,&nbsp;Stéphane Mallarmé, and many others contemporary artists and writers. She was also a mentor and friend to American dancer <a href=\"https://en.wikipedia.org/wiki/Isadora_Duncan\">Isadora Duncan</a> and weathered public criticism over her decision to live openly with her lesbian partner.</p><p>Pierre and Marie Curie attended one of Fuller's performances at the Folies Bergère&nbsp;and were greatly impressed. The admiration was mutual: Fuller was so captivated by the Curies' radium experiments that she wrote to them in 1905, asking about the possibility of making a costume out of radium (she was unaware of just how limited a supply was in existence). Marie politely advised against it, although she herself liked to carry around vials of radium and enjoyed visiting the lab at night because \"the glowing tubes looked like fairy lights.\" Undeterred, Fuller worked fluorescent salts into a black gauze dress that she wore to perform her \"<a href=\"http://www.scienceandfilm.org/articles/2862/loe-fullers-radium-dance\">Radium Dance</a>,\" creating the illusion of twinkling stars or ghostly lights surrounding her as she swirled on a darkened stage.</p><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant1-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant1.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant1-980x1307.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant1.jpg 2560\" data-sub-html=\"#caption-1742858\"><figure><figcaption id=\"caption-1742858\"><span></span><p>Folies Bergère poster by Jules Cheret (1836-1932) advertising a performance by Loïe Fuller.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant2-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant2.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant2-980x1174.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant2.jpg 2560\" data-sub-html=\"#caption-1742859\"><figure><figcaption id=\"caption-1742859\"><span></span><p>Woman in motion: Loïe Fuller wears one of her trademark long, flowing costumes to perform the \"Serpentine Dance.\"</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant3-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant3.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant3-980x771.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant3.jpg 2560\" data-sub-html=\"#caption-1742860\"><figure><figcaption id=\"caption-1742860\"><span></span><p>Pierre and Marie Curie with their bicycles circa 1896.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant4-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant4.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant4-980x657.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant4.jpg 2560\" data-sub-html=\"#caption-1742861\"><figure><figcaption id=\"caption-1742861\"><span></span><p>Marie Curie sitting in her laboratory in the 1900s.</p></figcaption></figure></li></ul></div><p>At first glance, the two women don't seem to have much in common, but with <em>Radiant</em>, Heinecke has teased out some intriguing parallels between them as they transformed their respective fields and forged an unlikely friendship.&nbsp;Ars sat down with Heinecke to learn more.</p><p><strong>Ars Technica: Marie Curie is practically a household name, but Loïe&nbsp;Fuller is not. So I'm curious what drove you to bring these two women together in a single book?</strong></p><p><strong>Liz Heinecke</strong>: I was reading Eve Curie's biography of her mother and ran across Loïe&nbsp;Fuller's name. I was an art major in college. My daughter is a theater kid, and I love watching dance, although I'm not a dancer myself.&nbsp;I googled Loïe&nbsp;Fuller and was fascinated right away. Eventually, I found the New York Public Library of Performing Arts database and discovered they had a little bit of her writing available to look at online. And I discovered that she was interested in radioactivity, that she had met Thomas Edison, that she was a friend of Auguste Rodin.&nbsp;She knew all these interesting people, and I hadn't ever heard of her. She basically pioneered modern stage lighting. When I discovered that Marie and Loïe&nbsp;were born and died within five years of each other, I decided to write about the two of them together and have their stories intersect in parallel narratives.</p><p><strong>Ars Technica: Marie Curie and Loïe&nbsp;Fuller met in person at least once, but what do you see as the binding connection between them?</strong></p><p><strong>Liz Heinecke</strong>: Curiosity. Loïe&nbsp;was an extremely curious person. Ultimately Loïe&nbsp;was probably the driving force in staying connected to Pierre and Marie because she really loved science. She wasn't well-educated, but she was very smart and knew that technology was the thing that made her stand out. She went to Marie and Pierre's labs because she was very curious about radium and radioactivity. I think Marie was curious about Loie's world too. We know that Marie and Pierre enjoyed art and theater and that Loïe&nbsp;took them to Rodin's studio to see his work.</p><p>Both of them were far from perfect. Marie made mistakes in her life, but she was a more serious, careful person, and Loïe&nbsp;was just kind of out there.&nbsp;But I love that contrast, and I wrote them that way. I mean, if you read what Loïe&nbsp;wrote about Marie, she always felt she would never gossip about Marie. She always wrote, \"Marie is very private. I want to respect her.\"&nbsp;She did not care as much what people thought about her, as long as people came to her shows.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant1A.jpg\" data-height=\"800\" data-width=\"1200\" alt=\"(left) Portrait of Marie Curie, circa 1890. (right) Formal portrait of Loïe&nbsp;Fuller.\"><img alt=\"(left) Portrait of Marie Curie, circa 1890. (right) Formal portrait of Loïe&nbsp;Fuller.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant1A-640x427.jpg\" width=\"640\" height=\"427\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant1A.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiant1A.jpg\" data-height=\"800\" data-width=\"1200\">Enlarge</a> <span>/</span> (left) Portrait of Marie Curie, circa 1890. (right) Formal portrait of Loïe&nbsp;Fuller.</p><p>ullstein bild, Hulton-Deutsch Collection/CORBIS/Corbis, via Getty</p></figcaption></figure><p><strong>Ars Technica: You chose to write <em>Radiant</em> very much in the&nbsp;style of a novel, even though it is&nbsp;technically nonfiction. Why is that?&nbsp;</strong></p><p><strong>Liz Heinecke</strong>: I love a good nonfiction narrative, particularly about science. When I started thinking about the story, Loïe&nbsp;in particular, it's so visual. I imagined Loïe&nbsp;dancing on stage. I could picture Marie and Pierre in their lab surrounded by tubes of glowing radium. So I really wanted to write it so it read more like fiction. I felt like I would be able to reach a different audience, writing a book that read more like a novel rather than a straight science narrative or a straight biography.</p><p>I state in the beginning of the book that the dialogue is invented, both internal and external. I wrote dialogue based on what I had learned about the two women. After a year reading every document I could find, I felt I almost knew them.&nbsp;I knew that Loïe&nbsp;drank black coffee and Marie drank tea, what they ate at different parts of their lives, and what they worried about. But I tried to base all the dialogue on the facts that I had uncovered. Certainly all of the scenes are based on factual events in their lives that actually happened. For instance, even if you read about Loïe&nbsp;Fuller, no one really talks about the fact that she danced on top of the Eiffel Tower during the summer solstice. There's so much science involved in the Eiffel Tower, I could have written a whole book just about that one night and all the interesting people that were there.</p><p><strong>Ars Technica: I did not know that Loïe&nbsp;Fuller had met with Thomas Edison. It makes sense because he was involved in cutting-edge sound and lighting as well as moving pictures, and she was interested the scientific aspects of her art. We have had this notion that there are <a href=\"https://en.wikipedia.org/wiki/The_Two_Cultures\">two cultures</a> ever since C.P. Snow coined the term in 1959. But&nbsp;fundamentally, science is culture, and&nbsp;vice versa. Loïe&nbsp;Fuller kind of encapsulates that.</strong></p><p><strong>Liz Heinecke</strong>: She does. She was so good at bringing different technologies together and creating something new. You could almost write a parallel story about Loïe&nbsp;and Edison. Neither of them was very well-educated, but they were both the predecessors of today's most popular people on social media. They were both extremely good at self-promotion. They both cultivated their images very carefully. They strike me as being very similar.</p><p>I love when different disciplines come together. I feel like society today has become so compartmentalized, and in Paris in 1900, it was sort of that way, too. The scientists mostly hung out with the scientists. I thought it was so cool that Marie Curie opened herself and her world up to this dancer—someone completely outside of her sphere. It really enriched both of their lives. I feel like that's when you see huge explosions of creativity—when people move outside of their own spheres.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiantAUTHOR.jpg\" data-height=\"800\" data-width=\"1200\" alt=\"Liz Heinecke is the author of <em>Radiant</em>, a parallel biography of physicist Marie Curie and groundbreaking dancer Loïe&nbsp;Fuller.\"><img alt=\"Liz Heinecke is the author of <em>Radiant</em>, a parallel biography of physicist Marie Curie and groundbreaking dancer Loïe&nbsp;Fuller.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiantAUTHOR-640x427.jpg\" width=\"640\" height=\"427\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiantAUTHOR.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/radiantAUTHOR.jpg\" data-height=\"800\" data-width=\"1200\">Enlarge</a> <span>/</span> Liz Heinecke is the author of <em>Radiant</em>, a parallel biography of physicist Marie Curie and groundbreaking dancer Loïe&nbsp;Fuller.</p><p>Grand Central Publishing</p></figcaption></figure><p><strong>Ars Technica: Has&nbsp;writing this book inspired you to try to recapture some of that Belle Époque interdisciplinary spirit?</strong></p><p><strong>Liz Heinecke</strong>: There's nothing more fun than going to the library and reading through old documents, trying to find something new that no one has discovered yet. And there are so many scientific experiments you could try at home. I'm currently writing a physics books for kids, and there's one lab that's about creating thin layers on glass. And I thought, \"Cool, let's try to put thin layers of gelatin on glass and color it and see if we can make slides that you could hold up [to the light],\" like Loïe's multi-colored lighting.</p><p>It's also easy to make an electroscope, the foundational concept of the equipment that the Curies used to measure radioactivity, which gives off an electrical charge. They used a version of an electroscope to spin a mirror that would let them measure how radioactive different materials were. That's what allowed Marie to make the first real measurements of radioactivity.</p><p>I love how people from that era were able to see things very close-up with microscopes and very far away with telescopes for the first time. They could recognize that certain things under a microscope might look like a celestial object. Loïe&nbsp;would take things that she had seen in a scientist's lab or under a microscope and project it on a stage. Artists are still doing that. There's gorgeous art that modern scientists make with their microscopes and telescopes today.</p></div></div></div>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"80188a66fe1c998cb10fe001aefd87897826df7056bc60c8b1bb4b5b38c0fa22","category":"Tech"}