{"title":"Google’s older Pixel cameras are failing at an accelerating rate","link":"https://arstechnica.com/?p=1743126","date":1613595320000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Pixel problems —</h4><h2 itemprop=\"description\">Users of the Pixel 2, 3, and 4 are reporting nonfunctional cameras.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/10/Pixel-2-15-800x600.jpg\" alt=\"The Pixel 2 XL. \"><figcaption><div><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/10/Pixel-2-15.jpg\" data-height=\"1920\" data-width=\"2560\">Enlarge</a> <span>/</span> The Pixel 2 XL.</p></div><p>Ron Amadeo</p></figcaption></figure><p>Does the Pixel camera have a hardware problem? <a href=\"https://www.androidpolice.com/2021/02/16/hardware-failures-may-be-to-blame-for-increase-in-reports-of-pixel-camera-issues/\">Android Police</a> has tracked down numerous reports of broken cameras on the Pixel 2 and Pixel 3, and the Pixel-exclusive Google Camera app has been getting review-bombed with tons of <a href=\"https://play.google.com/store/apps/details?id=com.google.android.GoogleCamera&amp;hl=en_US&amp;gl=US&amp;showAllReviews=true\">1-star reviews</a> from users saying their cameras no longer work. Google told the site it doesn't know of any software issues, suggesting that all these people are experiencing a hardware failure.</p><p>The problems range from the camera app instantly crashing when it is opened, displaying a black screen, or showing an error message that reads \"Something went wrong. Close and open the camera app again.\" Claims for what exactly is causing the issues are all over the place, but it seems hard to blame a software bug since both the Google camera and third-party apps are affected, and uninstalling updates and factory resets don't fix the problem.</p><p>The main complaint thread on the Pixel Help forums is up to almost <a href=\"https://support.google.com/pixelphone/thread/3317373?hl=en\">900 replies</a> now. The oldest device, the Pixel 2 seems to be the most affected, but reports for the Pixel 3, 3a, and 4 are out there. Every Pixel camera from the Pixel 2 to the Pixel 5 has the same camera sensor (a Sony IMX363/IMX362), so it's possible they are all affected.</p><p>Android Police got in touch with Google, saying \"the company offered hardware failures as a potential explanation—either due to wear and tear over time, or abuse such as physical damage or drops.\" The site continues \"The company invites those affected to contact Google's customer support to explore their options.\"</p><p>Previously, many of Google's Nexus phones were caught in a hardware problem due to defective flash memory. These phones would eventually stop working, which led to <a href=\"https://arstechnica.com/tech-policy/2017/04/lg-bootloop-defect-lawsuit-expands-to-cover-g5-v20-and-nexus-5x-devices/\">a series</a> of <a href=\"https://arstechnica.com/tech-policy/2017/04/another-android-flagship-the-nexus-6p-hit-with-class-action-lawsuit/\">class-action lawsuits</a>. Most of the Nexus phones were manufactured by LG, with the Nexus 6P being the single Huawei device. The Pixel 2 <a href=\"https://arstechnica.com/gadgets/2017/10/pixel-2-and-2-xl-review-the-best-android-phone-you-can-buy/\">was built</a> with the help of LG, while the Pixel 2 XL was made with HTC. After the Pixel 2, Google <a href=\"https://arstechnica.com/gadgets/2018/01/google-closes-1-1-billion-deal-for-half-of-htcs-smartphone-rd-team/\">bought the team</a> it was working with from HTC and started manufacturing devices <a href=\"https://arstechnica.com/gadgets/2018/05/google-pixel-3-will-reportedly-be-built-by-foxconn-have-a-massive-notch/\">at Foxconn</a>.</p></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8067a6cfee16e7cf4d11eab5dc5517094145b6f5197f050fe702a8aa693c4976","category":"Tech"}