{"title":"Global chip shortage worsens, forces production cuts at GM, Hyundai","link":"https://arstechnica.com/?p=1751978","date":1616605011000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>no chips causes production dips —</h4><h2 itemprop=\"description\">And a fire at a Renesas factory in Japan just made it even worse.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/cars-computer-chips-tire-800x450.jpg\" alt=\"Global chip shortage worsens, forces production cuts at GM, Hyundai\"><figcaption><p>Aurich Lawson | Getty Images</p></figcaption></figure><p>The auto industry continues to suffer the effects of a worldwide shortage of silicon chips. <a href=\"https://www.cnbc.com/2021/03/24/gm-forced-to-cut-production-of-mid-size-pickups-due-to-chip-shortage.html\">General Motors will idle production</a> of midsize pickup trucks at a factory in Missouri until April 12 and extend the shutdown of another factory in Michigan. In South Korea, Hyundai Motor Group, which had been unaffected so far, <a href=\"https://www.ft.com/content/8f48ea84-ec31-479a-a3c0-f4a231299ce2\">now says it expects to have production problems in April</a> due to the shortage. And if that wasn't enough, <a href=\"https://www.wsj.com/articles/renesas-chip-plant-fire-spreads-concerns-about-global-auto-production-11616414181\">a fire at a factory in Japan</a> will further exacerbate the problem.</p><p>The chip shortage got started with the COVID-19 pandemic. As countries around the world went into lockdown in 2020 to combat the virus's spread, many automakers <a href=\"https://arstechnica.com/cars/2020/05/plunging-car-sales-made-tesla-aprils-top-selling-car-in-the-uk/\">saw their sales evaporate</a> at the same time as public health measures <a href=\"https://arstechnica.com/cars/2020/03/tesla-says-it-will-shut-down-its-fremont-factory-next-monday/\">forced the closure of some factories</a>. Consequently, some of these companies cancelled pending orders for chips, which resulted in the foundries switching to fulfilling other orders. But as demand for new vehicles started to pick up, the OEMs discovered that it would be some time before their chip suppliers could meet these new orders, as the chip factories had no spare capacity.</p><p>In February, GM said it had to halt production at factories in Kansas, Canada, Mexico, Brazil, and South Korea as it prioritized more profitable product lines. Some of those plant closures will continue until April, the company now says. It will now also idle a factory in Missouri that currently builds GMC Canyon and Chevrolet Colorado midsize pickups, until April 12 at the earliest. And another GM factory in Michigan will idle two weeks earlier than planned in late May. And while it is keeping its full-size truck production steady, some of the pickups <a href=\"https://www.reuters.com/article/us-gm-semiconductors/gm-builds-pickups-without-certain-modules-due-to-global-chip-shortage-hurting-fuel-economy-idUSKBN2B71P5\">are leaving the production line without a chip</a> that enables their 5.3 L V8 engines to <a href=\"https://arstechnica.com/cars/2018/02/dynamic-skip-fire-cleverly-silences-pistons-boosts-mileage-by-15/\">deactivate certain cylinders for better fuel efficiency</a>.</p><p>Until now, Hyundai had managed to avoid manufacturing disruption, as it had not cancelled any of its chip orders. But it, too, is expecting to encounter shortages of silicon chips in April as its stockpiles run low, and the company is tweaking its output to prioritize popular vehicles (which is bad news for the <a href=\"https://arstechnica.com/cars/2020/07/hyundais-super-efficient-2020-sonata-hybrid-sedan-is-best-in-class/\">excellent Sonata sedan</a>).</p><p>Other automakers have also been prioritizing their more popular (and more profitable) full-size pickups and SUVs, but some are also now running into shortages. Last week, Ford revealed that it is building F-150 pickups and Edge SUVs with missing chips and will store them while it waits for fresh silicon to arrive, at which point it will complete the vehicles and send them to dealerships. Ford is also reducing shifts at its plant in Louisville, Kentucky, and extending a shutdown at its factory in Cologne, Germany.</p><p>Stellantis also revealed plans to build Ram 1500 Classic pickups in Michigan and Mexico without some electronic components. Like Ford, it will store these trucks and complete them once it has enough parts inventory.</p><p>To further complicate matters, a Japanese semiconductor factory belonging to automotive supplier Renesas <a href=\"https://arstechnica.com/tech-policy/2021/03/taiwan-drought-japanese-fab-fires-snarl-semiconductor-supply-chain/\">was gutted by fire last Friday</a>. Two-thirds of this factory's output was destined for the auto industry. That may well result in production delays for Toyota, which until now had managed to avoid disruption.</p></div></div>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"80736a5bff713d5e06e37acb84a14d4a5b12188f656aa4121df79647d0de6214","category":"Tech"}