{"title":"[ลือ] Qualcomm กำลังพัฒนาเครื่องเกมคล้าย Nintendo Switch รัน Android 12","link":"https://www.blognone.com/node/121858","date":1616570600000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/qualcomm.png?itok=hfw1eZbg\"></p><div itemprop=\"description\"><p>Android Police รายงานแหล่งข่าวไม่เปิดเผยที่คุ้นเคยกับ Qualcomm ว่าบริษัทเตรียมออกเครื่องเกมในรูปแบบคล้ายกับ Nintendo Switch เพื่อชูประสิทธิภาพของซีพียูตระกูล Snapdragon ในการเล่นเกม โดยจะเป็นเครื่องเกมที่มีจอยสองข้างถอดได้ และผลิตโดยบริษัทผลิตคอนโทรลเลอร์ชั้นนำแห่งหนึ่ง</p><p>ตัวเครื่องจะคล้ายกับสมาร์ทโฟนที่หนากว่าปกติ เพื่อเพิ่มพื้นที่ระบายความร้อนให้ชิป Snapdragon รุ่นใหม่ที่จะออกในปี 2022 ซึ่งยังไม่ชัดว่าจะเป็นรุ่นพิเศษ หรือเป็นรุ่นเรือธงแบบเดียวกับในมือถือ ภายในมีแบตเตอรี่ 6,000 mAh รองรับ Quick Charge หน่วยความจำภายในยังไม่เปิดเผย แต่จะรองรับ SD Card และรัน Android 12 ครอบทับด้วย Launcher คัสตอมแบบพิเศษ</p><p>ในด้านการเชื่อมต่อ เครื่องเกมนี้จะรองรับ 5G โดยใช้ชิป X55 รุ่นเก่า (ไม่มีคำอธิบายว่าทำไมจึงใช้ชิปโมเด็มรุ่นนี้) และยังไม่แน่ชัดว่าจะมีรุ่น Wi-Fi หรือไม่ แต่จะไม่มีฟีเจอร์ในการโทรออกโทรเข้าต่างๆ นอกจากนี้ยังสามารถส่งภาพออกทีวีได้ แต่ยังไม่แน่ชัดว่าจะมีพอร์ต HDMI แยก หรือใช้ USB-C แค่พอร์ตเดียว</p><p>Marshal Rahman หัวหน้าบรรณาธิการ XDA Developers <a href=\"https://twitter.com/MishaalRahman/status/1374447532756004879\">ทวิตเพิ่มเติม</a>ระบุถึงข้อมูลที่เขาได้รับมา ว่าหน้าจอของเครื่องนี้อาจมีขนาด 6.65 นิ้ว ความละเอียด Full HD+ และมีพัดลมในตัว</p><p><img src=\"https://www.blognone.com/sites/default/files/externals/1fea155cd6344fa3564166cc62237948.jpg\" alt=\"\"></p><p>Qualcomm วางแผนจำหน่ายเครื่องเกมนี้ภายในไตรมาสแรกของปี 2022 ในราคา 300 ดอลลาร์ (ราว 9,400 บาท) และจะรองรับ Google Play Store แอป Google ต่างๆ และแอป Epic Games Store ตั้งแต่วางจำหน่าย เพื่อเล่นเกมอย่าง Fortnite และเกม Android อื่นๆ จาก Epic Games โดยตรง รวมถึงอาจทำสโตร์วางจำหน่ายคอนเทนต์ของตัวเองควบคู่ไปด้วย</p><p>การสร้างเครื่องเกมนี้ ไม่น่าจะเป็นการกระโดดมาแข่งในตลาดเกมคอนโซล แต่ Qualcomm คงใช้เครื่องนี้เป็นเหมือนเครื่องอ้างอิง (reference device) เพื่อให้ผู้ผลิตรายอื่น เห็นประสิทธิภาพของชิป Snapdragon ในการเล่นเกมอย่างเต็มที่ และเพื่อให้เกิดอุปกรณ์ที่มีฟอร์มแฟกเตอร์ใหม่ๆ ขยายตลาดชิป Snapdragon ต่อไป</p><p>ที่มา - <a href=\"https://www.androidpolice.com/2021/03/23/exclusive-qualcomm-is-planning-an-android-powered-nintendo-switch-knockoff/\">Android Police</a></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"80b45414c282397e954bdee657396ef61487df5dc92a379eb3c686b2e4445ce7","category":"Thai"}