{"title":"Checkmate: How one rider turned two seemingly doomed attacks into a victory at E3","link":"https://cyclingtips.com/2021/03/checkmate-how-one-rider-turned-two-seemingly-doomed-attacks-into-a-victory-at-e3/","date":1616787810000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Kasper Asgreen on the attack at E3.</h4><p></p><div><p>Kasper Asgreen put on a dominant display to win the E3 Saxo Bank Classic on Friday, making two solo attacks in the final 70km of the World Tour race named after a motorway. Along the way, he showed how a single rider can put in two seemingly doomed moves to secure a big victory.</p><p>Deceuninck-QuickStep signaled its intentions early in the race, splitting the peloton with a seven-man lead out on the flat roads leading to the Taaienberg setting up an attack from Stybar, Asgreen, Senechal, and Lampert on the climb itself. This move saw a group of the strongest riders in the peloton pull clear. That was until Van Aert punctured and had his teammates drag him and the remainder of the peloton back into contention.</p><p>As the lead group hit the Boigneberg with 67km remaining, and just as the Jumbo-Visma-led peloton appeared into view, Asgreen made an attack that ultimately led to him spending the next 50+ km solo, with rarely anything more than 30-second advantage.</p><p>All the while, the race behind was exploding, with attacks from some of the best Classics riders in the world. How, then, can one rider stay clear with so little advantage?</p><p>The answer is numbers. Not watts, although Asgreen does have an abundance of wattage, but rather numbers of teammates. Deceuninck had several riders in contention throughout the race. The obvious impact of this is a blue jersey policing every attack and every group that went clear.</p><p>The not-so-immediately obvious impact of this strength in numbers is its effect on other riders’ willingness to chase. With one rider away, it seems logical chasing groups will reel him in at their will. However, with Asgreen’s teammates benefitting from a free ride, the others are stuck in a Catch-22 situation: Chase Asgreen and leave themselves open to counter attacks from his teammates, or let Asgreen go, and with him, the race.</p><p>Various iterations of the QuickStep team have employed this tactic to great success over the last number of years. Niki Terpstra at Paris-Roubaix, Philippe Gilbert at the Tour of Flanders, Terpstra again at Flanders, time and time again its often a race between the QuickStep team riders to be the first on the attack, knowing that their teammates will then act/be forced to act in a policing role in the chasing groups.</p><p>As Asgreen (or insert other Deceuninck rider names here where applicable) powers along at a steadily ridiculous pace solo off the front, others are chasing and attacking in fits and starts, marked by Deceuninck riders every time, resulting in stalls and dips in the speed of the chasing groups.</p><p>You will see the same Deceuninck riders drift to the front of the chasing groups, not to contribute to the chase but to break up the rhythm, drop the speed even further, going through corners and generally disrupting the chase. All playing to the lone leader’s advantage.</p><p>You may question why the Deceuninck riders in the chase group accept their fate as police officers for the remainder of the race, but in reality, this scenario favours their chances as well. Every kilometre Asgreen spends solo off the front is another kilometre closer to the finish that his teammates get with fresher legs. While all the other riders in the chasing group expend energy, the Deceuninck riders can save energy. If the race does come back together, they can win with the freshest legs from the chasing group’s riders.</p><p>Here lies the secret that the self-styled Wolfpack: they understand that they improve everyone’s chances by improving one rider’s chances. It’s unlikely Asgreen was thinking of soloing to victory when he attacked with 66km to go, but he understood by opening up the race and putting himself on the front foot, he was putting other teams in difficulty, his teammates in a great situation, and also giving himself a chance to go for the win.</p><p>The astonishing thing about Asgreen’s ride today is the manner in which he eventually won the race. After he rode 50+ km solo and gave his teammates that free ride in the chasing groups, he was caught by a group of seven chasers, and it appeared his chances for the win must be gone. However, Asgreen and Deceuninck had one last card to play.</p><p>When the seven-rider lead group entered the final five kilometers with a comfortable lead on a fading chasing group, Van Der Poel was the favourite for the sprint. Sénéchal has a speedy finish and could potentially challenge for the win, but it would help if Van der Poel was somewhat weakened ahead of that sprint. That’s where Asgreen came in again.</p><p>While the leaders assumed Asgreen was exhausted and didn’t force him to contribute with the pulling, the Dane was recovering and waiting. A perfectly timed move on the far side of a traffic island, while Van der Poel was at the head of the group, gave Asgreen his launchpad. It was a launchpad for a move that most assumed was intended to put Van der Poel on the defensive, forcing him to chase. But Asgreen’s lead grew with each passing kilometre while his Deceuninck teammates again reverted to policing duties behind. Playing the team role again, the Danish champion had put himself back in contention for what was just minutes earlier a very unlikely win.</p><p>Had Asgreen been caught by the attacks from Greg Van Avermaet, Oliver Naesen, or Mathieu van der Poel, then Zdenek Stybar would have been able to counter-attack. Had that not succeeded, then Senechal would have his chance in the sprint.</p><p>Ultimately, Asgreen held on through the final five kilometres and took the win. He was massively fatigued given his earlier efforts; line the seven-man leading group up for a drag race and he would undoubtedly have struggled, but therein lies the beauty of cycling. Yes, Asgreen is super strong, and he couldn’t have spent so much time solo on Friday if he wasn’t – but with the right move, at the right time, with teammates willing to police for him, Asgreen effectively checkmated much stronger riders, twice in the one race and seemingly pulled off the impossible.</p><p>Thirty-two seconds later, Sénéchal sprinted to second, beating Van Der Poel, who had expended immeasurable amounts of extra energy over the previous 70 kilometers than the Deceuninck riders alongside him.</p><p>If this makes it all sound too simple, it can’t go without saying that this tactic works for Deceuninck because they have the talented riders who can consistently be present in that front group. And more than just numbers, the team has also shown so many times over the past few seasons that it has the collective mindset and the buy-in from the riders to leverage those numbers toward big results. Despite not having the biggest budget in the World Tour, Tom Steels and Wilfried Pieters galvanise several individuals into a collective force time and time again.</p><div><h5>Tags</h5></div></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"80da44a9fb96365996f719019494ea1dd92244c774000b313a0a37db764c79f8","category":"Cycling"}