{"title":"Sony announces new PSVR hardware for PlayStation 5","link":"https://arstechnica.com/?p=1744495","date":1614100749000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>PSfiVeR —</h4><h2 itemprop=\"description\">New headset coming after 2021 will have higher resolution and new controllers.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/ps5-psvr-listing-800x449.jpg\" alt=\"You probably want to put the PlayStation VR headset on your head, not on top of a new PlayStation 5, for an ideal use case. But, hey, you do you.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/ps5-psvr-listing.jpg\" data-height=\"3368\" data-width=\"6000\">Enlarge</a> <span>/</span> You probably want to put the PlayStation VR headset on your head, not on top of a new PlayStation 5, for an ideal use case. But, hey, you do you.</p><p>Sam Machkovech</p></figcaption></figure><p>A new generation of PlayStation VR hardware, including a new controller designed specifically for VR, will be coming to the PlayStation 5 sometime after this year,&nbsp;Sony announced today.</p><p>The <a href=\"https://blog.playstation.com/2021/02/23/introducing-the-next-generation-of-vr-on-playstation/\">short announcement</a> is light on details and doesn't include any photos or prototypes of the new headset or controller. But it does mention that the next PlayStation VR will include a higher resolution and field of view than <a href=\"https://arstechnica.com/gaming/2016/10/playstation-vr-provides-a-lot-of-bang-for-your-virtual-reality-buck/\">the 2016 original</a>, which is stuck at a somewhat dated 1920x1080 resolution.</p><p>For context, <a href=\"https://arstechnica.com/gaming/2020/09/review-we-do-not-recommend-the-299-oculus-quest-2-as-your-next-vr-system/\">last year's $299 Oculus Quest 2</a> came in at a total resolution of 3664x1600, and that's for an untethered standalone headset with much less horsepower than the PS5. <a href=\"https://arstechnica.com/gaming/2019/05/one-week-with-the-valve-index-a-vr-game-changer-with-a-few-question-marks/\">Valve's high-end Index headset</a>, meanwhile, sports a 135 degree field of view, much wider than the ~100 degrees on PSVR (cheaper modern headsets generally have closer to 90 to 100 degree view fields, though).</p><p>Besides redesigned ergonomics, Sony says the next PSVR controller \"will incorporate some of the key features found in the DualSense wireless controller.\" Those could include the precise haptics, variable-resistance triggers, and crisp built-in speakers that have already <a href=\"https://arstechnica.com/gaming/2020/10/hands-on-with-the-ps5s-synesthetic-dualsense-controller/\">been used to great effect in some standard PS5 games</a>.</p><p>That would represent a big step up from the PlayStation Move controllers that many PSVR games currently use for hand-tracking. Those were <a href=\"https://arstechnica.com/gaming/2010/03/playstation-move/\">originally launched in 2010</a>, well before consumer-grade VR was a concern, and they are&nbsp;<a href=\"https://arstechnica.com/gaming/2010/08/why-sonys-move-offers-gamers-more-than-microsofts-kinectwhy-sonys-move-offers-gamers-more-than-microsofts-kinect/\">generally seen as</a> a more precise answer to the hand-wavey controls of the Nintendo Wii and Xbox Kinect for flat-screen gaming. A controller specifically built for VR could improve the fidelity or even eliminate the need for an external camera for tracking.</p><p>Existing PlayStation VR owners can currently use the headset and controllers with the PlayStation 5, but doing so requires a special adapter to connect the aging PS4 camera (the PS5's own \"PlayStation HD camera\" is not compatible with the current PlayStation VR). <a href=\"https://arstechnica.com/gaming/2020/11/playstation-vr-tested-on-ps5-it-works-fine-but-maybe-keep-your-ps4/\">Ars' own testing at the system's launch</a> also found that PSVR games generally hadn't gotten a noticeable bump in fidelity on the PS5, as some other backward-compatible games had.</p><p>Before today, Sony was unwilling to comment very directly on the future of virtual reality hardware on the PS5. PlayStation CEO Jim Ryan <a href=\"https://www.washingtonpost.com/video-games/2020/10/29/ps5-jim-ryan-interview/\">told The Washington Post back in October</a> that \"PlayStation believes in VR. Sony believes in VR, and we definitely believe at some point in the future, VR will represent a meaningful component of interactive entertainment. Will it be this year? No. Will it be next year? No. But will it come at some stage? We believe that.\"</p><p>Sony has sold over 5 million PlayStation VR headsets since 2016, after <a href=\"https://arstechnica.com/gaming/2019/03/putting-sonys-4-2-million-psvr-sales-in-context/\">passing 4.2 million sales in early 2019</a>. That makes PSVR one of the best-selling VR headsets overall thus far, though in recent months, the aging hardware has been heavily outsold by Oculus' standalone Quest headset, according to estimates from analysis firm Superdata.</p></div></div>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"825e4c9b399af389533253bcca5f3c4242aa0843f8745f4c5690a0eeb8e4fbf6","category":"Tech"}