{"title":"Listen to haunting notes from an 18,000-year-old conch shell trumpet","link":"https://arstechnica.com/?p=1741749","date":1613145468000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>A blast from the past —</h4><h2 itemprop=\"description\">Archaeologists in 1931 assumed the shell was only a broken drinking cup.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz1HR-800x534.jpg\" alt=\"Color photo of a person with a conch shell raised to their mouth, silhouetted against a red-painted cave wall.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz1HR.jpg\" data-height=\"2500\" data-width=\"3748\">Enlarge</a> <span>/</span> Archaeologists in 1931 found the conch shell near the entrance of Marsoulas Cave. This is a reconstruction of where and how the shell might have been played.</p><p>G. Tosello</p></figcaption></figure><p>After 18,000 years of silence, an ancient musical instrument played its first notes. The last time anyone heard a sound from the conch shell trumpet, thick sheets of ice still covered most of Europe.</p><p>University of Toulouse archaeologist Carole Fritz and her colleagues recently recognized the shell as a musical instrument. To understand more about how ancient people crafted a trumpet from a 31cm (1 foot) long conch shell, the archaeologists used high-resolution CT scans to examine the shell’s inner structure: delicate-looking whorls of shell and open chambers, coiled around a central axis, or columella. A series of overlapping photographs and careful measurements became a full-color, 3D digital model of the shell, and image enhancement software helped reveal how Magdalenian people had decorated the instrument with red ocher dots.</p><p>And in a lab at the University of Toulouse, a horn player and musicology researcher became the first person in 18,000 years to play the conch shell. The musician blew into the broken tip, or apex, of the shell and vibrated his lips as if he were playing a trumpet or trombone. Very carefully, he coaxed three loud, clear, resonant notes from the ancient instrument:</p><figure></figure><p>The three notes you hear are at 256Hz, 265Hz, and 285Hz, approximately a C, a C-sharp, and a D in modern terms. Wind instruments work because the air inside them vibrates, producing sound waves. At the right frequency, called a natural or resonant frequency, this causes the body of the instrument to vibrate, which amplifies the sound waves and makes the sounds we recognize as music. The three notes in the recording are the sound of the shell vibrating at its resonant frequencies.</p><p>Because the cavity of the conch shell forms a spiral, Fritz and her colleagues say its acoustics are pretty similar to an instrument with a conical chamber, like a French horn.</p><p>What’s less apparent in the recording is how loud the shell trumpet is. At 1 meter (3 feet) away from the shell, the volume of the notes measured about 100 decibels. The result was powerful in more ways than one.&nbsp;\"It was, for me, a big emotion,” said Fritz. “For me, this sound is a direct link with Magdalenian people.”</p><h2>A second look at an old discovery</h2><p>The&nbsp;Magdalenian people were hunter gatherers, and they occupied the&nbsp;Marsoulas Cave near Toulouse, France, where archaeologists found the shell in 1931. Fritz and co-author Gilles Tosello, also an archaeologist at the University of Toulouse, were studying artifacts from the cave when they found the conch shell in the collection of the Natural History Museum of Toulouse.</p><p>They had been looking for tools related to the paintings on the cave walls, but they decided to give the conch shell a closer look. The archaeologists who originally unearthed the artifact in 1931 decided it had probably been used as a ceremonial drinking cup, and its apex (the pointy tip of the shell) had broken off naturally. But Fritz and Tosello noticed that the shell actually seemed to have been carefully crafted into a musical instrument.</p><p>“Some people already thought that it was a music instrument, but it is because we can also demonstrate that this shell was strongly modified, according to what is usually done for a music instrument made with a conch shell, that we can continue with this idea,” said co-author Philippe Walter, a chemist at CNRS and Sorbonne University.</p><p>According to malacologists—biologists who study mollusks like conchs—the apex of a large conch shell would be too thick and sturdy to break accidentally; ocean waves and seafloor impacts might crack other parts of the shell, but not the 0.8 centimeter (0.3 inch) thick walls of calcium carbonate that form the apex.</p><h2>Stradivarius for the Stone Age</h2><p>The CT images enabled Fritz and her colleagues to look more closely for small, subtle evidence that the shell had been worked with tools rather than battered by time and chance. They found a series of small impact marks in a ring around the broken edge, as if a tool had been used to strike the shell and break it at just that spot. The result was a 3.5 centimeter (1.4 inch) wide hole at the end of the conch shell, leading into the shell’s spiraling inner chambers. The hole would have been the first step in turning the shell into a wind instrument; it allowed the player to blow air into the shell.</p><p>A thin brownish residue on the inner and outer surfaces of the apex might once have helped hold a mouthpiece in place, say Fritz and her colleagues. Other cultures around the world use resin or wax to attach mouthpieces to their seashell trumpets. Not enough of the material survived to identify, said Tosello.</p><p>“During the experiment, the musician remarked that the apex in its current chipped form is not functional because it could injure the lips of the instrumentalist,” wrote Fritz and her colleagues. “He proposed the hypothesis that a mouthpiece was present when it was used during the Magdalenian Period.”</p><p>Fritz also carefully inserted a tiny medical camera into the shell, where she found a small hole in the columella, connecting the broken apex to the shell’s interior spaces. In the CT images, the hole was marked with striations from the tool that had been used to drill or file it.</p><p>“It's really a complex technical operation,” said Tosello. “The broken part of the apex is very narrow, and the hole inside is really perfectly round with a regular edge that indicates probably there was a sort of drill used, but with a stick probably to direct the action from the outside. It's a pretty elaborate technique.\"</p><p>Most wind instruments also have some way to change how air flows through the instrument: holes to cover, buttons to press, or a slide to move. Modern shell trumpet players often place their hands into the mouth of the shell to modulate the sound. Fritz and her colleagues found a series of regular impact points along the outer edge of the shell—a curled liplike structure called the labrum—which they think made it smoother and easier to use.</p><h2>Hearing the sea in a landlocked cave</h2><p>People around the world have made music with conch shells for thousands of years, and many groups still do, in places as far apart as Oceania, New Guinea, Japan, India, Tibet, and Greece—and even an ancient example in Syria. Today, many people associate conch shell trumpets with more tropical cultures, especially around the Pacific Ocean, so it’s strange to imagine a conch shell instrument played in France in the midst of an Ice Age, observed Tosello.</p><p>That’s especially true because Marsoulas Cave is roughly 80km (50 miles) from the coast. The conch species <em>Charenia lampas </em>(the original inhabitant of the shell) lives in the northern Atlantic and North Sea, in chilly waters up to 80 meters deep, so its presence in France isn’t such a shock, but it shows us that people at Marsoulas must have had far-flung trade connections with people on the coast. We can also see those links in the form of a whale-bone spear point and at least two other seashells unearthed from the cave.</p><p>“We know now that some Magdalenian people, who lived in this region, have a very important link with the Atlantic coast and especially with the Cantabrian region in Spain,” said Fritz. “It's one more element for understanding this link between ocean and land, and it's very important because you have the ocean in the cave with this artifact, and it's very symbolic for the sound, I think.”</p><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz5HR-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz5HR.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz5HR-980x1470.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz5HR.jpg 2560\" data-sub-html=\"#caption-1741755\"><figure><figcaption id=\"caption-1741755\"><span></span><p>Archaeologists originally interpreted this conch shell as a broken drinking cup.</p><p><span></span> Fritz et al. 2021</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz8HR-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz8HR.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz8HR-980x1547.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz8HR-1440x2273.jpg 2560\" data-sub-html=\"#caption-1741759\"><figure><figcaption id=\"caption-1741759\"><span></span><p>This illustration shows where someone knocked the outer lip off the shell with a series of strokes, then destroyed the apex.</p><p><span></span> Fritz et al. 2021</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz7HR-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz7HR.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz7HR-980x1480.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz7HR.jpg 2560\" data-sub-html=\"#caption-1741758\"><figure><figcaption id=\"caption-1741758\"><span></span><p>This conch trumpet from New Zealand has a bone tube mouthpiece.</p><p><span></span> usée du Quai Branly, Jacques Chirac</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz6HR-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz6HR.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz6HR.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz6HR.jpg 2560\" data-sub-html=\"#caption-1741757\"><figure><figcaption id=\"caption-1741757\"><span></span><p>This opening was made by chipping off the solid apex of the shell to create a hole for air to flow in through.</p><p><span></span> C. Fritz, G. Tosello, Muséum d'Histoire naturelle de Toulouse</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz2HR-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz2HR.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz2HR-980x654.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz2HR-1440x961.jpg 2560\" data-sub-html=\"#caption-1741752\"><figure><figcaption id=\"caption-1741752\"><span></span><p>Archaeologists study one of the many paintings on the walls of Marsoulas Cave.</p><p><span></span> R. Apajou</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz3HR-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz3HR.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz3HR-980x642.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz3HR-1440x944.jpg 2560\" data-sub-html=\"#caption-1741753\"><figure><figcaption id=\"caption-1741753\"><span></span><p>This is one of the many painted panels on the walls of Marsoulas Cave, decorated with red ocher pigment in a style similar to the dotted pattern on the conch shell.</p><p><span></span> C. Fritz</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz1HR-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz1HR.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz1HR-980x654.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/fritz1HR-1440x961.jpg 2560\" data-sub-html=\"#caption-1741751\"><figure><figcaption id=\"caption-1741751\"><span></span><p>Archaeologists in 1931 found the conch shell near the entrance of Marsoulas Cave. This is a reconstruction of where and how the shell might have been played.</p><p><span></span> G. Tosello</p></figcaption></figure></li></ul></div><h2>The Paleolithic soundscape</h2><p>When they came across the shell, Fritz and Tosello were looking for tools associated with the paintings in Marsoulas Cave, which included a large bison stippled with 300 red fingerprint-sized dots. And it turns out that the seashell may have been very connected to the art on the walls of the cave.</p><p>Fritz and her colleagues could see tiny traces of red pigment still clinging to the inner surface of the shell, but when they enhanced the digital images of the shell’s surface using software called DStretch, those tiny traces became the outline of round, fingertip-sized dots.</p><p>“It reminded us of the red dots made with fingertips on the walls of the cave, and we are supposing that the shell was decorated with the same pattern that is used in the cave art of Marsoulas,” said Tosello. “That to our knowledge is the first time that we can see and put in evidence of such a relationship between music and cave art in European prehistory.”</p><p>Portable X-ray fluorescence revealed that the pigment was ocher, a favorite pigment of cultures all over the world for tens of thousands of years. Ocher was also the material of choice for the cave paintings, but there wasn’t enough on the shell to tell if it came from the same deposit.</p><p>And the connection probably wasn’t just visual. Some anthropologists who study Paleolithic cultures have focused on the acoustics of caves, trying to understand what the distant past sounded like and how those sounds were woven into people’s lives. Fritz and her colleagues hope to find out what the conch shell trumpet sounds like inside the cave, or right at the entrance, where it sat for 18,000 years.</p><p>“For me, it is beautiful to think about the possibility to have such strong sounds in the Pyrenees, in the mountains, inside the cave, so maybe it is also something that we can try to help produce in the future,” said Walter. That might be as close as we can get to the soundscape of Paleolithic life.</p><h2>We haven’t heard the last of this</h2><p>Three haunting notes from the 18,000-year-old shell trumpet offer a hint of what the distant past sounded like, but they can’t resurrect the songs ancient musicians might have played—or their meaning. The notes are like building blocks, but the blueprints have been lost to time. Experiments like Fritz and her colleagues’ can only suggest possibilities.</p><p>But Walter wants to see what modern musicians can make of those possibilities. Photogrammetry and the CT data produced a 3D digital model of the shell, and at a press conference on Tuesday, Fritz held up a 3D-printed model that had been fitted with a duck bone mouthpiece. Fritz and her colleagues plan to use digital and 3D-printed models to tinker with different mouthpiece materials to see how ancient craftspeople might have put the instrument together. They also want to digitally model the airflow and sound inside the shell.</p><p>Walter hopes to offer the digital model to modern musicians and ask them to compose their own music with the ancient instrument.&nbsp;“It will be far away from the original sounds during the Magdalenian period, but it will be very interesting to try to make a link between this very ancient musical instrument, 18,000 years old, and modern music,” he said.</p><p><em>Science Advances</em>, 2021 DOI: <a href=\"https://doi.org/10.1126/sciadv.abe9510\">sciadv.abe9510</a>&nbsp; (<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div></div>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"828c037d9f22919b8aacc58195989a9bc5246c2e0654906ab02c5448280fa9ed","category":"Tech"}