{"title":"Colbrelli tops Bevin to win stage 2 of the Tour de Romandie","link":"https://cyclingtips.com/2021/04/colbrelli-tops-bevin-to-win-stage-2-of-the-tour-de-romandie/","date":1619729963000,"content":"<div><p></p><h4>Sonny Colbrelli wins stage 2 of the Tour de Romandie.</h4><p></p><div><p>Hello again, CyclingTips readers,</p><p>The Tour de Romandie continued on Thursday with a stage 2 that saw Sonny Colbrelli best Patrick Bevin in a reduced sprint.</p><p>Read on for the latest from the world of cycling.</p><p><em>Dane Cash<br>News Editor</em></p><h2>What’s news?</h2><h3>Colbrelli wins stage 2 of the Tour de Romandie</h3><p><strong>Sonny Colbrelli</strong> nabbed his first victory of the season on Thursday’s stage 2 at the <strong>Tour de Romandie</strong>.</p><p>The challenging 165.7 km stage from La Neuveville to Saint-Imier came down to a reduced group after numerous riders were dropped going over the final climb of the day. Although there were attacks on the climb, an Ineos Grenadiers-led pack reeled in any dangerous moves, with race leader <strong>Rohan Dennis</strong> putting in much of the work himself.</p><p><strong>Ben O’Connor</strong> tried to get clear in the finale, but he was brought back. As was the case on Wednesday’s stage 1, Bahrain Victorious then took to the front for Colbrelli as the line approached. The 30-year-old Italian launched with around 300 meters to go, and despite the best efforts of <strong>Patrick Bevin</strong>, Colbrelli held on to take a close win at the line. Bevin took second with <strong>Marc Hirschi</strong> nabbing third on the day, while Dennis finished safely with the lead group to retain his overall race lead.</p><div><div><p>Tour de Romandie (2.UWT) <span>La Neuveville → Saint-Imier</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/ca/sonny-colbrelli-2021.jpeg\"></p></div><h3>Dan Martin ahead of Giro campaign: ‘I’m stronger than I’ve ever been’</h3><p><strong>Israel Start-Up Nation</strong> unveiled its lineup for the upcoming <strong>Giro d’Italia</strong> on Wednesday, with <strong>Dan Martin</strong> set to lead the way for the team. This year’s race will mark his third career appearance in the race; he made his first Giro start in 2010, and then made his second start in 2014, when he crashed out on the opening stage in Belfast.</p><p>In a press release from the team, Martin said that he was feeling good ahead of the race.</p><p>“At the end of last season, I decided it was time for a new challenge and I was really excited to do the Giro d’Italia. This is a course that really suits me,” Martin said. “I know that I’m stronger than I’ve ever been right now – both mentally and physically. My fourth place overall in the Vuelta last year was a big stepping stone to becoming more confident in doing well in the GC. Obviously, winning a stage is also a big goal. I have two in the Tour de France and two in the Vuelta a España and to complete the set of Grand Tour victories is a big ambition of mine.”</p><p>Martin will be joined by <strong>Patrick Bevin</strong>, <strong>Matthias Brändle</strong>, <strong>Davide Cimolai</strong>, <strong>Alessandro De Marchi</strong>, <strong>Alex Dowsett</strong>, <strong>Krists Neilands</strong>, and <strong>Guy Niv</strong> in the Italian Grand Tour.</p><h3>Tour of Utah set to return in 2022</h3><p><strong>Tour of Utah</strong> will return in 2022 with <strong>Medalist Sports</strong> managing the event, the race announced on Thursday.</p><p>The Tour of Utah was called off for both 2020 and 2021 due to the coronavirus pandemic. For 2022, Medalist Sports has reached a licensing agreement with the Larry H. Miller Group, which owns the race, to operate the event.’</p><h3>Cavendish: Getting back to winning ‘something special’</h3><p>Having picked up his first, second, third, and fourth victories of the year at the recent <strong>Tour of Turkey</strong>, <strong>Mark Cavendish</strong> has described the feeling of getting back to winning in a blog post at the <strong>Deceuninck-QuickStep</strong> website on Wednesday. Cavendish’s stage 2 win at the Tour of Turkey earlier this month marked his first victory since 2018.</p><p>“I have so much to say thank you for. The Tour of Turkey is not the Tour de France, but just to win again after some years of physical and psychological difficulties is something special,” Cavendish said. “To be able to do it with The Wolfpack is a dream come true. Raising my hands is super emotional, as I felt a lot of people had just given up on me over the last years. But Patrick [Lefevere, team manager] believed in me, I owe him so much. He is my hero.”</p><h3>Wiggle could reportedly be targeted for buyout</h3><p><a href=\"https://www.bloomberg.com/news/articles/2021-04-08/ron-burkle-s-spac-said-in-talks-for-4-billion-signa-sports-deal\" target=\"_blank\">Bloomberg</a> reports that <strong>Wiggle</strong> could be bought out as part of the German online retailer <strong>Signa Sports United</strong> going public.</p><p>Signa Sports United has reportedly been in talks with the Yucaipa Acquisition Corp regarding a merger that could precipitate a buyout of online cycling retailer Wiggle. Should talks with Yucaipa Acquisition Corp not work out, Signa Sports United will reportedly continue to talk to other acquisition companies.</p><h2>In case you missed it …</h2><ul><li><strong>New Motion Labs</strong> is at it again with a <a href=\"https://cyclingtips.com/2021/04/exclusive-newmotionlabs-new-sprocket-creates-dual-engagement-on-a-standard-chain/\" target=\"_blank\">redesigned sprocket</a>.</li><li>Ronan Mc Laughlin takes <a href=\"https://cyclingtips.com/2021/04/spotted-a-new-cannondale-time-trial-bike/\" target=\"_blank\">a closer look</a> at the <strong>Cannondale</strong> that <strong>Stefan Bissegger</strong> was riding at the <strong>Tour de Romandie</strong>.</li><li><strong>Zwift Insider</strong> has <a href=\"https://cyclingtips.com/2021/04/zwifthub-lives-on-last-minute-acquisition-saves-the-zwift-app/\" target=\"_blank\">acquired</a> <strong>ZwiftHub</strong>.</li><li>Abby, Loren, and Amy talk <strong>Liège-Bastogne-Liège</strong> in the latest edition of the <a href=\"https://cyclingtips.com/2021/04/freewheeling-podcast-we-are-fans-of-anna-van-der-breggen/\" target=\"_blank\">Freewheeling Podcast</a>.</li><li>As Matt de Neef writes, there’s reason to be <a href=\"https://cyclingtips.com/2021/04/the-ski-mountaineer-who-climbed-straight-into-cyclings-worldtour/\" target=\"_blank\">excited about what the future might hold</a> for <strong>Anton Palzer</strong>.</li><li><strong>Cracked Earth</strong> <a href=\"https://cyclingtips.com/2021/04/cracked-earth-is-a-cycling-film-that-deserves-your-funding/\" target=\"_blank\">documents</a> the lives of cyclists in vulnerable areas around the globe where climate change is a daily threat.</li><li>The <a href=\"https://cyclingtips.com/2021/04/the-bunnyhop-episode-2-teniel-campbell-and-sophie-wright/\" target=\"_blank\">second episode</a> of <strong>The Bunnyhop</strong> features <strong>Teniel Campbell</strong> and <strong>Sophie Wright</strong>.</li></ul></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"82b0b9379481bd09c25a7627e50f337e9070e89c02315fda594820db589df545","category":"Cycling"}