{"title":"Comcast hides upload speeds deep inside its infuriating ordering system","link":"https://arstechnica.com/?p=1746817","date":1614809383000,"content":"<div id=\"readability-page-1\" class=\"page\"><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/comcast-peacock-hiding-800x450.jpg\" alt=\"An NBC peacock logo is on the loose and hiding behind the corner of a brick building.\"><figcaption></figcaption></figure><p>Comcast just released a 2020 <a href=\"https://corporate.comcast.com/press/releases/comcast-2020-network-performance-data\">Network Performance Data report</a> with stats on how much Internet usage rose during the pandemic, and it said that upload use is growing faster than download use. \"Peak downstream traffic in 2020 increased approximately 38 percent over 2019 levels and peak upstream traffic increased approximately 56 percent over 2019 levels,\" Comcast said.</p><p>But while upload use on Comcast's network quickly grows—driven largely by videoconferencing among people working and learning at home—the nation's largest home-Internet provider with over 30 million customers advertises its speed tiers as if uploading doesn't exist. Comcast's 56 percent increase in upstream traffic made me wonder if the company will increase upload speeds any time soon, so I&nbsp;checked out the Xfinity website today to see the current upload speeds. Getting that information was even more difficult than I expected.</p><p>The Xfinity website advertises cable-Internet plans with download speeds starting at 25Mbps without mentioning that upstream speeds are just a fraction of the downstream ones. I went through Comcast's online ordering system today and found no mention of upload speeds anywhere. Even clicking \"pricing &amp; other info\" and \"view plan details\" links to read the fine print on various Internet plans didn't reveal upload speeds.</p><p>Even after adding a plan to the cart and going through most of the checkout process, I could not find any mention of upload speeds. I got to the point where you have to enter credit card information to continue, so I initially stopped there. I later confirmed that Comcast's ordering system will show upload speeds after it checks whether your credit card is valid, in the final page where you submit an order.</p><h2>Deliberately keeping customers in the dark</h2><p>I've long known that it's difficult to find upload speeds on Comcast's website, but I'm not sure exactly when it became virtually impossible. There were complaints about this very problem on Comcast's customer support forums in <a href=\"https://forums.xfinity.com/t5/Your-Home-Network/How-do-I-find-upload-speeds-of-my-plan-or-any-other-plans/td-p/3362852\">2020</a> and in <a href=\"https://forums.xfinity.com/t5/Your-Home-Network/Extreme-Pro-Internet-Upload-Speed/td-p/3274903\">2019</a>, though. \"What is my upload speed now? No where in the world can I find documentation,\" one customer asked. The answer was that existing customers can find upload speeds for their own plan in their account settings after logging in and navigating to the correct section.</p><p>But that does not help people who are signing up for service and want to find out what upload speeds they'll get or compare upload speeds of different plans. Even the Xfinity.com <em>comparison tool</em> that lets you compare details of different plans doesn't reveal their upload speeds. The absence of upload speeds from Comcast's website is so thorough that it is clearly a deliberate attempt to keep customers in the dark. This gallery shows how the Comcast Xfinity website displays Internet plans without mentioning upload speeds and continues that tactic through nearly the entire checkout process:</p><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/xfinity-main-page-offers-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/xfinity-main-page-offers.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/xfinity-main-page-offers-980x637.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/xfinity-main-page-offers-1440x936.png 2560\" data-sub-html=\"#caption-1746850\"><figure><figcaption id=\"caption-1746850\"><span></span><p>Comcast's website displays these Internet offers in my location without stating upload speeds.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/xfinity-comparison-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/xfinity-comparison.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/xfinity-comparison-980x821.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/xfinity-comparison-1440x1206.png 2560\" data-sub-html=\"#caption-1746841\"><figure><figcaption id=\"caption-1746841\"><span></span><p>Comcast has a tool that lets you compare two plans—but it doesn't show the plans' different upload speeds.</p><p><span></span> Comcast</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-first-page-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-first-page.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-first-page-980x800.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-first-page-1440x1176.png 2560\" data-sub-html=\"#caption-1746840\"><figure><figcaption id=\"caption-1746840\"><span></span><p>After adding a plan to the cart, you can start the checkout process. No upload speeds are in sight.</p><p><span></span> Comcast</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-2-flex-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-2-flex.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-2-flex-980x807.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-2-flex-1440x1186.png 2560\" data-sub-html=\"#caption-1746837\"><figure><figcaption id=\"caption-1746837\"><span></span><p>We still don't know what the upload speeds are, but Comcast tells us about its \"Flex\" streaming box.</p><p><span></span> Comcast</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-3-install-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-3-install.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-3-install-980x794.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-3-install-1440x1166.png 2560\" data-sub-html=\"#caption-1746838\"><figure><figcaption id=\"caption-1746838\"><span></span><p>Now we can select an installation date and time, but upload speeds still are not revealed.</p><p><span></span> Comcast</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-credit-card-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-credit-card.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-credit-card-980x773.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/checkout-credit-card-1440x1137.png 2560\" data-sub-html=\"#caption-1746839\"><figure><figcaption id=\"caption-1746839\"><span></span><p>Now you have to enter your credit card information—only after doing so will Comcast let you see the 300Mbps download plan's 10Mbps upload speeds.</p><p><span></span> Comcast</p></figcaption></figure></li></ul></div><p>Thankfully, the third-party website <a href=\"https://www.cabletv.com/xfinity/internet\">CableTV.com</a> lists both download and upload speeds, showing that Comcast's 25Mbps download plan comes with 3Mbps uploads; the 100Mbps and 200Mbps download plans both have 5Mbps uploads; the 300Mbps download plan has 10Mbps uploads; the 600Mbps plan has 15Mbps uploads; and the 1Gbps download (1.2Gbps in some areas) comes with 35Mbps:</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/comcast-speeds.png\" data-height=\"1568\" data-width=\"1982\" alt=\"Comcast speeds and prices, no thanks to Comcast's website.\"><img alt=\"Comcast speeds and prices, no thanks to Comcast's website.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/comcast-speeds-980x775.png\" width=\"980\" height=\"775\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/comcast-speeds.png\" data-height=\"1568\" data-width=\"1982\">Enlarge</a> <span>/</span> Comcast speeds and prices, no thanks to Comcast's website.</p></figcaption></figure><p>Comcast's website does list the 35Mbps upload speeds for the gigabit plan at this <a href=\"https://www.xfinity.com/support/articles/get-most-from-xfinity-gigabit-internet-service\" rel=\"nofollow\">page</a>, but I couldn't find anything similar for Comcast's other cable-Internet plans. Comcast also offers a fiber-to-the-home service with 2Gbps speeds both downstream and upstream. But Comcast's residential fiber requires installation charges of up to $500, and the service costs $300 a month, which is more than three times as much as the gigabit-cable plan that has 35Mbps downloads.</p><h2>Comcast, why did you make this so hard?</h2><p>I contacted Comcast today with two primary questions: is there <em>any</em> way to find upload speeds on Comcast's website before submitting an order for Internet service, and does Comcast have any plans to raise its cable upload speeds?</p><p>Comcast's answer on where to find upstream speeds was as follows:</p><blockquote><p>Our network report shows that, despite the growth in upstream traffic in 2020, patterns remain highly asymmetrical as downstream volumes were 14x higher than upstream throughout 2020. Our website reflects the way customers use the Internet with downstream overwhelmingly dominating usage, but upstream speeds are included in your cart and are visible upon check out when you submit your order.</p></blockquote><p>Despite Comcast claiming that \"upstream speeds are included in your cart,\" I could find no evidence of this. Adding a Comcast Internet plan to the cart and then clicking the cart icon brought me to an ordering page that does not mention upload speeds. I confirmed this behavior on Xfinity.com in both Chrome and Safari.</p><p>I circled back to the Comcast spokesperson and asked what exact steps I need to take to make upload speeds show up in the cart. It turns out the upload speeds never show up in the cart at all unless you define \"cart\" to include the entire ordering process. Comcast told us the upload speeds will finally appear \"when you are at the step when you review your order.\"</p><p>Despite my earlier reluctance to enter my credit card information for service I am not ordering, I finally did so to check whether this is accurate. I submitted my address, phone number, and credit card information, and I clicked \"Next.\" This triggered a step in which Comcast's system checked to see whether I had entered a valid credit card. I accidentally entered a recently expired card number, so Comcast's system \"declined\" my card and made me re-enter it. After I entered a card number that Comcast could charge, I finally got to this page, where the 300Mbps download-plan's 10Mbps upload speeds are shown:</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/comcast-order-review.png\" data-height=\"1108\" data-width=\"1526\" alt=\"The last page in Comcast's ordering system.\"><img alt=\"The last page in Comcast's ordering system.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/comcast-order-review-980x712.png\" width=\"980\" height=\"712\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/comcast-order-review.png\" data-height=\"1108\" data-width=\"1526\">Enlarge</a> <span>/</span> The last page in Comcast's ordering system.</p><p>Xfinity.com</p></figcaption></figure><p>At this page, with Comcast having already verified your card, you can view upload speeds and decide whether to submit the order or exit the ordering system.&nbsp;The part of Comcast's statement that upload speeds are \"visible upon check out when you submit your order\" is thus accurate. But refusing to tell a prospective customer what they're paying for until after they submit credit card information is simply ridiculous. You can probably get upload speeds earlier by asking a Comcast rep in an online chat or phone call, but that shouldn't be necessary.</p></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"84ff6fda7100810f10532d2cfb762a21028045de7fb320b57b6dd164d9292a37","category":"Tech"}