{"title":"Nissan Denies Reports of Apple Car Partnership Discussions","link":"https://www.macrumors.com/2021/02/15/nissan-denies-talks-apple-car-partnership/","date":1613377826000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/15/nissan-denies-talks-apple-car-partnership/\"><p>Apple is expected to partner with a third-party car maker to build its rumored self-driving car. In January, reports surfaced that Apple was eyeing Hyundai to be the official partner for <a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a>, and subsequent reports suggest Apple is actively pursuing all of its options.</p><p><img alt=\"Apple car wheel icon feature triad\" width=\"2500\" height=\"1406\" src=\"https://images.macrumors.com/t/bhkyJA_mFqdNmIfdkmrTw2G3yV0=/400x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg?lossy\" data-src=\"https://images.macrumors.com/t/bhkyJA_mFqdNmIfdkmrTw2G3yV0=/400x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/bhkyJA_mFqdNmIfdkmrTw2G3yV0=/400x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg?lossy 400w,https://images.macrumors.com/t/eW-5YiE3wb9dDbVnZJHLDN_tRLk=/800x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg?lossy 800w,https://images.macrumors.com/t/hiI0bzxHHRVRKFxXTNfAQJIYyXs=/1600x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg 1600w,https://images.macrumors.com/t/OrGEwTUHBPLW_qmRqe9mORDEZVM=/2500x0/filters:no_upscale():quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/bhkyJA_mFqdNmIfdkmrTw2G3yV0=/400x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg?lossy 400w,https://images.macrumors.com/t/eW-5YiE3wb9dDbVnZJHLDN_tRLk=/800x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg?lossy 800w,https://images.macrumors.com/t/hiI0bzxHHRVRKFxXTNfAQJIYyXs=/1600x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg 1600w,https://images.macrumors.com/t/OrGEwTUHBPLW_qmRqe9mORDEZVM=/2500x0/filters:no_upscale():quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg 2500w\"></p><p>In the latest round of speculation, Apple reportedly approached Nissan in the last few months about a potential partnership for a self-driving car, according to a paywalled <em><a href=\"https://www.ft.com/content/29d4aa6b-fba5-4a53-876e-3f097fdef1d2\">Financial Times</a></em> report. The report states that negotiations between the two companies were \"brief\" and that discussions did not make their way to higher executive or leadership levels in either company due to disagreements over the specifics of the ‌Apple Car‌.</p><p>It's worth noting that an older report by <em><a href=\"https://www.bloomberg.com/news/articles/2021-02-05/japan-carmakers-jump-after-nikkei-report-on-apple-ev-development\">Nikkei Asia</a></em> cited Nissan as at least one of six Japanese automakers that Apple is eyeing for the ‌Apple Car‌. The report however didn't provide specific details as to the progress of any talks, or if Apple is ultimately siding with one carmaker more than others.</p><p>Nissan and Apple reportedly clashed over how a partnership would actually playout. Nissan reportedly was concerned that a deal with Apple would downgrade it to simply a \"hardware supplier.\" The ‌Apple Car‌ is expected to be fully branded by Apple, including Apple software, and design. While Apple holds the in-house ability to design its own software and hardware, it's not positioned to build the actual hardware at a mass scale, which is why a partnership is considered to be a hallmark of the project itself.</p><p>During an earnings presentation, Nissan's COO Ashwani Gupta stated that Nissan is open to partnerships, but only if the opposite party adapts to Nissan's services, not vice versa. The COO said that Nissan has its own customer base to satisfy and that it will not \"change the way\" it makes cars.</p><p>Earlier in the year following reports of a potential tie-up with Apple, Hyundai's shares surged by more than 25% but remained volatile after negotiations came to a standstill. Attempting to veer away from a similar scenario, Nissan quickly and unequivocally <a href=\"https://www.reuters.com/article/us-autos-tech-apple-nissan-idUSKBN2AF02N\">confirmed in a statement</a> that it's \"not in talks\" with Apple but remains opens to working with other companies.</p><p>Apple remains a tightly secretive company that never confirms the existence of unreleased products and projects. The statement by Hyundai earlier in the year confirming it's in negotiations with the tech giant likely upset executives as it was seen as a confirmation that Apple is pursuing a partnership for a potential self-driving car. The statement was quickly reworded to remove mention of Apple. Soon after, talks between the two <a href=\"https://www.macrumors.com/2021/02/05/apple-pauses-car-talks-hyundai-kia/\">came to a screeching halt</a>.</p><p>Despite the plentiful amount of reports about Apple's self-driving car, sources suggest that we won't be seeing it on the road until at least 2026. <em>Bloomberg</em> reports that the ‌Apple Car‌ is \"nowhere near production stage,\" and that a release is <a href=\"https://www.macrumors.com/2021/01/07/apple-car-launch-5-to-7-years-away/\">at least half a decade away</a>. Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a>, one of the most reputable analysts for Apple, <a href=\"https://www.macrumors.com/2021/02/02/kuo-apple-car-use-hyundai-e-gmp-platform/\">still believes</a> that despite Hyundai's mishap, Apple will ultimately side with the carmaker as the official partner for its self-driving car ambitions.<br></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/13/zuckerberg-facebook-inflict-pain-on-apple-privacy/\">Mark Zuckerberg Reportedly Told Staff Facebook Needs to 'Inflict Pain' on Apple Over Privacy Dispute</a></h3><p>Saturday February 13, 2021 2:33 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple and Facebook have been in a very public spat over the course of the last few months as Apple dials up its pro-privacy stance. The two companies have long had tension, but more recently, Facebook is taking shots at an upcoming iOS and iPadOS feature that will require apps and data companies such as Facebook to ask for users' permission before tracking them across other sites and websites. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/prosser-airtags-ipad-pro-next-month/\">Leaker Jon Prosser Claims AirTags and New iPad Pro to Be Announced Next Month</a></h3><p>Friday February 12, 2021 11:56 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple is slated to release a number of new products this year, and the first round of products could be just a few weeks away. YouTuber Jon Prosser, who has a mixed track record when it comes to reporting on Apple's plans, claims that AirTags and brand new iPad Pro models are set to be announced next month, presumably via a virtual event. Prosser, who runs the tech-news show \"Front Page...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/one-last-intel-mac/\">Apple Surprisingly Sticking With Intel Chips for One Last Mac</a></h3><p>Despite having begun the transition towards using its own custom silicon across the Mac product lineup, somewhat surprising recent rumors have suggested that Apple may continue to use Intel chips for one Mac model. Last year at WWDC, Apple announced plans to transition away from Intel chips to Macs built with its own Apple Silicon, such as the M1 chip, starting in late 2020. It set out its ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/intel-anti-mac-ad-campaign/\">Intel's Anti-Mac Ad Campaign Highlights M1 Shortcomings</a></h3><p>Thursday February 11, 2021 5:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of the M1 Macs last November, Apple officially began its transition away from Intel's chips, and it's clear from Intel's latest advertising campaign that the company is feeling threatened by Apple's decision. In ads shared on Twitter, Intel has been highlighting the shortcomings of Apple's M1 Mac lineup. An ad this week, for example, points out the gaming capabilities of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/iphone-tips-february-2021/\">Useful iPhone Tips You Might Not Know</a></h3><p>Friday February 12, 2021 3:00 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>There seem to be an endless number of iPhone tips and tricks to share, and that's because Apple's smartphones are so feature rich that it's impossible to keep up with everything they're capable of. We've rounded up some useful tips and hacks in our latest video, so check them out to see if there's something you didn't know about. Subscribe to the MacRumors YouTube channel for more videos. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/apple-turn-off-activation-lock-page/\">Apple Launches Self-Serve Portal for Initiating Activation Lock Removal Requests</a></h3><p>Friday February 12, 2021 8:13 am PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today added a new \"Turn off Activation Lock\" page to its website that provides steps users can take to turn off the security feature on an iPhone, iPad, or iPod touch. As noted on Reddit, the page includes a link to start an Activation Lock support request in the United States, meaning that customers no longer have to contact an Apple support representative by phone, email, or online...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/ipad-2021-major-upgrade/\">Major Upgrades Coming to the iPad in 2021</a></h3><p>Apple is looking to launch an updated ninth-generation iPad with a larger display, the A13 Bionic chip, 4GB of RAM, and a thinner, lighter design in the first half of this year, according to recent reports. Reports from cnBeta and Mac Otakara, citing supply chain sources in China, have offered similar projections for the ninth-generation ‌iPad, explaining that the updated device will...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/14/heart-month-activity-challenge/\">Apple's Heart Month Activity Challenge Requires 60 Minutes of Exercise on Valentine's Day</a></h3><p>Saturday February 13, 2021 10:15 pm PST by <a href=\"https://www.macrumors.com/author/frank-mcshan/\" rel=\"author\">Frank McShan</a></p><p>Today only, Apple Watch owners can complete a new Apple Watch activity challenge in celebration of Heart Month, which is aimed at promoting cardiovascular health. The challenge, which is listed in the Fitness app on the iPhone, tasks users with earning 60 minutes on their Exercise ring. Show your heart some love. Get this award by earning 60 minutes on your Exercise ring this Valentine's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/foundation-showrunner-hopes-for-80-episodes/\">'Foundation' Showrunner Hopes for Unparalleled 80 Episodes on Apple TV+</a></h3><p>\"Foundation\" writer and showrunner David Goyer is ambitiously hoping to tell Isaac Asimov's science-fiction story over the course of eighty hours, which is as yet unheard of on Apple TV+. Foundation tells the story of \"a band of exiles on their monumental journey to save humanity and rebuild civilization amid the fall of the Galactic Empire,\" and is based on Isaac Asimov's science-fiction...</p></div></div></div>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"861ce4673043ec6ca08d6d8b5e97e092cb9917e9b21fa15903157f3387e3677b","category":"Apple"}