{"title":"Sigma เปิดตัว fp L กล้อง mirrorless เซนเซอร์ฟูลเฟรม 61 ล้านพิกเซล, ออโต้โฟกัสปรับปรุงใหม่, ขนาดเล็กเหมือนเดิม","link":"https://www.blognone.com/node/121896","date":1616761799000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><div itemprop=\"description\"><p>Sigma เปิดตัวกล้อง mirrorless เซนเซอร์ฟูลเฟรมรุ่นใหม่ fp L โดยยังคงขนาดกะทัดรัดเหมือนกับ <a href=\"https://www.blognone.com/node/110822\">Sigma fp</a></p><p>Sigma fp L ใช้เซนเซอร์ 61 ล้านพิกเซล (9,520 x 6,328 พิกเซล) ถ่ายวิดีโอ 4K ได้ 30 เฟรมต่อวินาที พร้อมระบบเอาท์พุตรองรับสูงสุดถึง 12-bit Cinema DNG Raw ออกไปยัง SSD นอกตัวกล้อง หรือจะเอาท์พุตเป็น Raw ผ่านทาง HDMI และ encode เป็น ProRes RAW หรือ Blackmagic RAW ก็ได้ (ขึ้นกับ recorder ที่ใช้งาน) รวมถึงรองรับการถ่ายวิดีโอ Full HD ที่ 120 เฟรมต่อวินาที (ในโหมดครอป)</p><p>ฟีเจอร์ที่น่าสนใจของตัวกล้องคือระบบ Crop Zoom ที่ฟีเจอร์ซูมของตัวกล้องจะใช้การครอปภาพ ใช้ได้ทั้งการถ่ายภาพและวิดีโอ ซึ่ง Sigma ระบุว่าฟีเจอร์นี้ใช้การครอปตรง ๆ ไม่มีการปรับผ่านระบบดิจิทัลใด ๆ ภาพจึงไม่เสียรายละเอียด แม้จะซูม 5 เท่าก็ยังได้คุณภาพ Full HD และวิธีใช้ฟีเจอร์นี้ก็ง่ายมาก เพียงถ่างหรือหุบนิ้วบนจอสัมผัสหลังกล้องเท่านั้น</p><p>ส่วนระบบโฟกัสที่แต่เดิมของ fp เป็น contrast-detection มาในรุ่น fp L ทาง Sigma ใส่ระบบโฟกัสแบบไฮบริดมาให้แทน ซึ่งเป็นระบบที่ Sigma นำระบบ contrast-detection และ phase-detection มารวมกันจนได้ระบบโฟกัสที่แม่นยำกว่าเดิม สามารถใช้ออโต้โฟกัสเพื่อติดตามวัตถุได้ทั้งระบบภาพนิ่งและวิดีโอ</p><p>ตัวกล้อง Sigmal fp L มีช่องเสียบ USB-C พร้อมรองรับการชาร์จแบตเตอรี่ขณะที่กล้องเปิดใช้งานอยู่ (เท่ากับว่าเสียบแบตสำรองไปด้วยได้เหมือนโทรศัพท์มือถือ หรือจะใช้เป็นเว็บแคมโดยเสียบไฟกับพีซีก็ได้) ซึ่ง Sigma fp L ยังคงความเล็กของตัวกล้องใกล้เคียงรุ่นเดิม มิติของตัวกล้องอยู่ที่ 113 x 70 x 45 มิลลิเมตร และน้ำหนัก 417 กรัม</p><p>Sigma fp L ไม่มีช่องมองภาพติดมากับตัวกล้องเหมือนรุ่นเดิม แต่ Sigma ได้ทำอุปกรณ์เสริมออกมาขายเป็น EVF-11 เป็นช่องมองภาพอิเล็กทรอนิกส์ OLED 0.5 นิ้ว 3.68 ล้านจุด ซึ่งในอนาคตจะรองรับ fp ด้วย</p><p>ที่มา - <a href=\"https://petapixel.com/2021/03/25/sigma-fp-l-unveiled-tiny-size-full-frame-61mp-sensor-hybrid-af/\">PetaPixel</a>, <a href=\"https://www.dpreview.com/news/1024716225/sigma-announces-ultra-compact-61-megapixel-fp-l-and-electronic-viewfinder\">PetaPixel</a></p><p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/810a26f3abe574ca3b5edb8cd18a44f0.jpg\"></p><p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c3e90696e68929397ca1c896697b6b64.jpg\"></p><p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b25751c98fcab76b20119318ed148c1b.jpg\"></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"862292151694e267ec1df8c926803d032125c6a2b58ba8b17aac46e3efe31e1d","category":"Thai"}