{"title":"Pogačar: ‘we didn’t plan for me to hit hard today’","link":"https://cyclingtips.com/2021/07/pogacar-we-didnt-plan-for-me-to-hit-hard-today/","date":1625331544000,"content":"<div><p></p><h4>Tadej Pogačar in the yellow jersey after stage 8 of the Tour de France.</h4><p></p><div><p>The Tour de France entered the mountains for the first time on <a href=\"https://cyclingtips.com/2021/07/dylan-teuns-wins-stage-8-of-the-tour-de-france/\">stage 8</a>. The race from Oyonnax to Le Grand-Bornand put a few GC riders under strain early in the day, with <a href=\"https://cyclingtips.com/2021/07/geraint-thomass-gc-hopes-fade-on-the-tours-first-mountain-stage/\">Geraint Thomas</a> (Ineos Grenadiers) and Primož Roglič (Jumbo-Visma) both dropping off the pace. Defending champion Tadej Pogačar (UAE Team Emirates), however, was in the mix from the very start. Then, with the breakaway up the road to contest the win, the white jersey-wearer launched a devastating attack on the penultimate climb.</p><p>Pogačar flew over the last two first-category climbs, overtaking the early attackers and eating into the advantage of eventual stage winner Dylan Teuns (Bahrain-Victorious). In the end, he finished in fourth, 49 seconds behind the Belgian, and putting a further 3:25 into his GC rivals.</p><p>“In the morning we didn’t plan for me to hit hard today,” Pogačar said after the podium ceremony. “We were rather thinking of waiting to see how the stage went. The start was super hard, very hectic, and I was even in the mix of a break. I feel great in this weather and, before the last three climbs, I told my teammates we were going to try and smash the race because I saw everybody was suffering. [Davide] Formolo, Rui [Costa] and Brandon [McNulty] did a super job for me to take off and go full gas all the way to the finish. I’m happy.”</p><p>Pogačar’s dominant ride comes a day after his team was put under immense pressure on Friday’s <a href=\"https://cyclingtips.com/2021/07/mohoric-wins-stage-7-of-the-tour-amid-big-changes-to-the-gc-picture/\">stage 7</a> to Le Creusot.</p><p>“The rivals thought they could break us as a team, but they have seen we can do a great work. I guess many riders paid the effort from yesterday. We will see day by day who my biggest rival is. For now, we have taken the yellow jersey and we have proven we have a super strong team.”</p><p>The 2021 Tour de France hasn’t even reached the first rest day yet, but after Saturday’s stage 8, the general classification picture is already looking pretty clear. Wout van Aert (Jumbo-Visma) remains in second overall 1:48 back after his breakaway efforts on stage 7, and third-place Alexey Lutsenko (Astana-Premier Tech) is the first in a cluster of GC riders around five minutes down. </p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"862f3d256511975b97df30739d2c57eba54aae3f4c37518963ea693288fa4b76","category":"Cycling"}