{"title":"Fem van Empel takes a spectacular victory in snow-covered Val di Sole","link":"https://cyclingtips.com/2021/12/fem-van-empel-takes-a-spectacular-victory-in-snow-covered-val-di-sole/","date":1639316837000,"content":"<div><div><p>Fem van Empel (Pauwels Sauzen-Bingoal) took a historic World Cup victory in the snow of Val di Sole, her first elite victory and only second ever after the 2021 U23 World Championships.</p><p>Val di Sole is a name that will be familiar to anyone who follows pro mountain biking, or indeed alpine skiing, but it’s the first time the mountain resort has hosted a major cyclocross event. World Cup organisers hope to prove cyclocross could be a winter Olympic discipline; a sport must be held predominantly on snow and/or ice to qualify…obviously.</p><p>The hard-packed snow and ice proved a new challenge for the riders, and though it wasn’t an especially technical course, every corner, climb and descent represented a huge test of skill and patience.</p><p>Van Empel looked equal to the challenge from the gun, as did Canadian national champion Maghalie Rochette. Marianne Vos (Jumbo-Visma) joined them at the front of the race in the opening lap while others paid for lack of momentum with inevitable slipping and sliding. Denise Betsema (Pauwels Sauzen-Bingoal) was one of the first to come off, but she was soon back up and chasing up to the top three on course.</p><p>On the second lap, Vos powered to the front in her first race since a successful US campaign, but even she could not escape bad luck. A mechanical held her up after just moments in the lead, and she lost almost a whole minute to new leader Van Empel, Betsema and Rochette chasing.</p><p>Van Empel’s lead had shrunk to around ten seconds going into the final lap, Vos now up to second having surged from seventh place. It looked like being a huge upset for the young phenom as Vos joined her 19-year-old compatriot in the finale, but the veteran came down hard after hitting a fence pole on one of the last corners, leaving Van Empel to regain the front and sprint up the clear tarmac to take victory.</p><p>A resigned Vos crossed the line second and Rochette held on for third.</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"867c7a04390899bb85db344aa24d00832228e60afa77a9e488dc25531f045cbf","category":"Cycling"}