{"title":"Donald Trump is one of 15,000 Gab users whose account just got hacked","link":"https://arstechnica.com/?p=1746241","date":1614640461000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>TROVE —</h4><h2 itemprop=\"description\">GabLeaks includes 70,000 messages in more than 19,000 chats by over 15,000 users.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/gab-800x450.png\" alt=\"Promotional image for social media site Gab says \" get=\"\" on=\"\" gab=\"\" and=\"\" speak=\"\" freely.=\"\"><figcaption></figcaption></figure><p>The founder of the far-right social media platform Gab said that the private account of former President Donald Trump was among the data stolen and publicly released by hackers who recently breached the site.</p><p>In a statement on Sunday, founder Andrew Torba used a transphobic slur to refer to Emma Best, the co-founder of Distributed Denial of Secrets. The statement confirmed claims the WikiLeaks-style group <a href=\"https://ddosecrets.substack.com/p/release-gableaks-70gb\">made on Monday</a> that it obtained 70GB of passwords, private posts, and more from Gab and was making them available to select researchers and journalists. The data, Best said, was provided by an unidentified hacker who breached Gab by exploiting a SQL-injection vulnerability in its code.</p><p>\"My account and Trump's account were compromised, of course as Trump is about to go on stage and speak,\" Torba wrote on Sunday as Trump was about to speak at the CPAC conference in Florida. \"The entire company is all hands investigating what happened and working to trace and patch the problem.\"</p><h2>An important data set</h2><p>GabLeaks, as DDoSecrets is calling the leak, comes almost eight weeks after pro-Trump insurrectionists stormed the US Capitol. The rioters took hundreds of thousands of videos and photos of the siege and posted them online. Mainstream social media sites removed much of the content because it violated their terms of service.</p><p>\"The Gab data is an important, but complicated dataset,\" DDoSecrets personnel <a href=\"https://ddosecrets.com/wiki/GabLeaks\">wrote in a post</a> on Monday morning. \"In addition to being a corpus of the public discourse on Gab, it includes every private post and many private messages, as well. In a simpler or more ordinary time, it'd be an important sociological resource. In 2021, it's also a record of the culture and the exact statements surrounding not only an increase in extremist views and actions, but an attempted coup.\"</p><p>Gab and a competing site called Parler were some of the last refuges that allowed much of the content to remain publicly available. Amazon and web hosting providers later cited a lack of adequate content moderation in suspending service to Parler.</p><p>Shortly before the shuttering, however, somebody found a way to use Parler's publicly available programming interfaces to <a href=\"https://arstechnica.com/information-technology/2021/01/parlers-amateur-coding-could-come-back-to-haunt-capitol-hill-rioters/\">scrape about 99 percent of the user content from the site</a> and subsequently make it publicly available.</p><p>While law enforcement groups likely had other ways to obtain the Parler data, its public availability enabled a much wider body of people to do their own research and investigations. The leak was especially valuable because materials contained metadata that's usually stripped out before users can download videos and images. The metadata gave people the ability to track the precise timelines and locations of filmed participants.</p><p>DDoSecrets said that the 70GB GabLeaks contains over 70,000 plaintext messages in more than 19,000 chats by over 15,000 users. The dump also shows passwords that are \"hashed,\" a cryptographic process that converts plaintext into unintelligible characters. While hashes can't be converted back into plaintext, cracking them can be trivial when websites choose weak hashing schemes. (Best told Ars they didn't know what hashing scheme was used.) The leak also includes plaintext passwords for user groups.</p><h2>Hate-speech haven</h2><p>Gab has long been criticized as a haven for hate speech. In 2018, <a href=\"https://arstechnica.com/tech-policy/2017/08/gab-the-right-wing-twitter-rival-just-got-its-app-banned-by-google/\">Google banned the Gab app</a> from its Play Store for terms of service violations. A year later, web host GoDaddy terminated service to Gab after one of its users took to the site to criticize the Hebrew Immigrant Aid Society shortly before killing 11 people in a Pittsburgh synagogue.</p><p>Gab has also been <a href=\"https://arstechnica.com/tech-policy/2018/11/gab-cries-foul-as-pennsylvania-attorney-general-subpoenas-dns-provider/%22\">investigated by Pennsylvania's attorney general</a>. In January, the Anti-Defamation League called on the US Justice Department to <a href=\"https://www.adl.org/news/open-letter-to-the-us-department-of-justice-adl-calls-for-a-criminal-investigation-of-gab\">investigate Gab</a> for its role in the insurrectionist attack on the capitol.</p><p>Attempts to reach Torba for comment didn't succeed.</p><p>Best said that DDoSecrets is making GabLeaks available only to journalists and researchers with a documented history of covering leaks. People can use <a href=\"https://ddosecrets.com/wiki/Contact\">this link</a> to request access.</p></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"86aadcaa68b50987853725f832e05e81083458576b4ea7e488e4918a26131d12","category":"Tech"}