{"title":"Comcast reluctantly drops data-cap enforcement in 12 states for rest of 2021","link":"https://arstechnica.com/?p=1743804","date":1613755604000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Data cap delay —</h4><h2 itemprop=\"description\">ISP grants reprieve in 12 states but still caps users in most of its US territory.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/04/comcast-van-800x533.jpg\" alt=\"The back of a Comcast van driving along a street in Sunnyvale, California.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/04/comcast-van.jpg\" data-height=\"1796\" data-width=\"2695\">Enlarge</a> <span>/</span> A Comcast van in Sunnyvale, California, in November 2018.</p></figcaption></figure><p>Comcast is delaying a plan to enforce its 1.2TB data cap and overage fees in the Northeast US until 2022 after <a href=\"https://arstechnica.com/tech-policy/2021/01/comcast-data-cap-blasted-by-lawmakers-as-it-expands-into-12-more-states/\">pressure</a> from customers and lawmakers in multiple states.</p><p>\"[W]e are delaying implementation of our new data plan in our Northeast markets until 2022,\" Comcast said in an <a href=\"https://corporate.comcast.com/stories/were-giving-our-northeast-customers-more-time\">announcement yesterday</a>. \"We recognize that our data plan was new for our customers in the Northeast, and while only a very small percentage of customers need additional data, we are providing them with more time to become familiar with the new plan.\"</p><p>Comcast has enforced the data cap in 27 of the 39 states in which it operates&nbsp;<a href=\"https://arstechnica.com/information-technology/2016/11/comcast-suspends-data-caps-but-only-in-maine/\">since 2016</a>, but not in the Northeast states where Comcast faces competition from Verizon's un-capped FiOS fiber-to-the-home service. In November 2020, <a href=\"https://arstechnica.com/information-technology/2020/11/comcasts-data-cap-finally-goes-nationwide-in-expansion-to-12-more-states/\">Comcast announced</a> it would bring the cap to the other 12 states and the District of Columbia starting in January 2021. But with yesterday's announcement, no one in those 12 states and DC will be charged overage fees by Comcast in all of 2021.</p><p>\"Delaying this ill-timed data cap until at least 2022 is the right call,\" Connecticut Attorney General William Tong <a href=\"https://portal.ct.gov/AG/Press-Releases/2021-Press-Releases/Attorney-General-Tong-Welcomes-Comcast-Decision-to-Postpone-Data-Cap-Rate-Hike-Until-2022\">said yesterday</a>. \"I have heard from families across Connecticut who easily exceeded this cap while studying and working remotely. Far from so-called super users, these were stories from typical Connecticut families merely trying to stay employed and educate their children during a global pandemic. To raise rates on these families at the very moment they were most reliant on broadband access and least able to pay more was simply unconscionable.\"</p><p>The delay applies to Connecticut, Delaware, Massachusetts, Maryland, Maine, New Hampshire, New Jersey, North Carolina, New York, Pennsylvania, Vermont, West Virginia, and the District of Columbia.</p><h2>Comcast vague on plans for 2022</h2><p>Comcast's original plan for the Northeast imposed the cap in January 2021 while providing courtesy months in which newly capped customers can exceed 1.2TB without penalty, resulting in the first overage charges being assessed for data usage in the April 2021 billing period. That plan drew condemnation from lawmakers, including <a href=\"https://arstechnica.com/tech-policy/2021/01/state-reps-try-to-ban-comcast-data-cap-and-price-hikes-until-pandemic-is-over/\">legislation in Massachusetts</a> that would ban data caps and price hikes until the pandemic is over.</p><p>Comcast responded in late January by delaying overage charges until the July billing period, but the extra few months didn't quiet the controversy. Yesterday's announcement of a delay until 2022 did not specify which month of 2022 the first overage charges will appear. We asked Comcast if it plans to impose the caps on the Northeast in January 2022 or sometime later but didn't get an answer.</p><h2>Unlucky customers in 27 other states</h2><p>Comcast did tell us that there are no changes in the other 27 states, where customers will continue to face caps and overage fees. Comcast's insistence on continuing to charge overage fees in most of its territory maintains the unequal status quo in which a customer's state of residence determines whether they have to deal with Comcast's most unpopular policy.&nbsp;Comcast's overage charges are $10 for each additional block of 50GB, up to a maximum of $100 each month. Customers can avoid overage charges by spending an extra $30 a month on unlimited data or $25 for the \"xFi Complete\" plan that includes unlimited data and the rental cost for Comcast's xFi gateway modem and router.</p><p>Though Comcast claims the 1.2TB cap only affects \"super users,\" the percentage of Internet users hitting that mark is always increasing, and broadband usage has risen more than usual during the pandemic. OpenVault research found that over 14 percent of US-based subscribers used over 1TB a month in Q4 2020, up from 8.8 percent of subscribers in Q3 2020, as we <a href=\"https://arstechnica.com/information-technology/2021/02/internet-use-soared-throughout-2020-helping-isps-cash-in-on-data-caps/\">reported last week</a>. The percentage of customers using over 2TB a month more than doubled to 2.2 percent in the same time period. Median monthly usage in Q4 2020 was 293.8GB and average usage was 482.6GB.</p><p>\"The explosion in data consumption during 2020 has established a new normal of bandwidth usage that is especially visible when compared with pre-pandemic time periods,\" OpenVault said.</p><h2>Network capacity not a “valid excuse”</h2><p>Data-overage fees boost Comcast's revenue, but limiting monthly data usage regardless of when in the month that usage occurs is not an effective tool for preventing network congestion in real time. Comcast has boasted of its network's strong performance in the pandemic, once again showing that data caps are a <a href=\"https://arstechnica.com/tech-policy/2020/03/comcast-waiving-data-cap-hasnt-hurt-its-network-why-not-make-it-permanent/\">profit play rather than a necessity</a>.</p><p>Tong told Comcast in a <a href=\"https://portal.ct.gov/-/media/AG/Letter-to-Comcast-from-AG-Tong-2321.pdf\">letter</a> earlier this month that \"[b]roadband Internet access is an essential public service, particularly during the ongoing pandemic... The last thing our residents need to worry about at this time is whether they will run afoul of data caps, or incur significant unanticipated expense in order to remain connected.\"</p><p>\"Network capacity is not an issue for Comcast or a valid excuse to charge customers more,\" 71 Massachusetts lawmakers told Comcast in a <a href=\"https://twitter.com/RepAndyVargas/status/1344620339079368709\">letter</a> in late December. \"Comcast itself claims it has plenty of capacity across its network, including areas where no caps are currently imposed... It is inconceivable that Comcast would choose to impose this 'cap and fee' plan during a pandemic, when many Massachusetts residents are forced to work and attend school from home via the Internet.\"</p></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"88a08cb930bf765fc5e0e3e032eb33de7d1550acdcaab17aebb4784261fbbac0","category":"Tech"}