{"title":"Electric vans are all the rage at DHL, UPS—maybe even USPS, too","link":"https://arstechnica.com/?p=1752142","date":1616690327000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>more van time —</h4><h2 itemprop=\"description\">Lightning eMotors gets more orders, and UK-based Arrival lists on the NASDAQ.</h2></header><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/DSC_3235-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/DSC_3235.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/DSC_3235-980x654.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/DSC_3235-1440x961.jpg 2560\" data-sub-html=\"#caption-1752145\"><figure><figcaption id=\"caption-1752145\"><span></span><p>By year's end, 99 of these electric Transit vans will be delivering packages for DHL Express in California and New York.</p><p><span></span> Lighting eMotors</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/VAN_UPS_select-5-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/VAN_UPS_select-5.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/VAN_UPS_select-5-980x667.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/VAN_UPS_select-5-1440x981.jpg 2560\" data-sub-html=\"#caption-1752144\"><figure><figcaption id=\"caption-1752144\"><span></span><p>Arrival has 16,000 orders for its electric van, including 10,000 from UPS. That no doubt helped propel it to a valuation of almost $14 billion.</p><p><span></span> Arrival</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/suburb2_9-scaled-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/suburb2_9-scaled.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/suburb2_9-scaled-980x670.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/suburb2_9-scaled-1440x984.jpg 2560\" data-sub-html=\"#caption-1744817\"><figure><figcaption id=\"caption-1744817\"><span></span><p>No, this isn't a rendering from a Pixar film; it's what the new USPS mail delivery vehicle will look like.</p><p><span></span> USPS</p></figcaption></figure></li></ul></div><p>Electrifying commercial fleets of vehicles makes even more sense than trying to persuade individual private citizens to switch to electric vehicles. After all, if you convince your neighbor to buy an EV, that's one more EV on the road, but a single decision to electrify a commercial fleet can replace dozens, hundreds, or even thousands of internal combustion engine-powered vehicles.</p><p>Take DHL Express, for example. After a successful trial of nine electric Transit 350HD vans from Lightning eMotors, this week the courier company announced it will deploy another 89 electric vans to New York and California this year.</p><p>\"We're aiming to improve the lives of people where they live and work, using clean pickup and delivery solutions—such as electric vehicles and cargo cycles—for our first- and last-mile services,\" said DHL Express US CEO Greg Hewitt. \"With the successful deployment of the first nine pilot vehicles, we are excited to expand our electric delivery van footprint and continue to drive forward our corporate roadmap to decarbonization.\"</p><p><a href=\"https://arstechnica.com/cars/2020/03/ford-readies-an-all-electric-transit-van-for-us-sales-starting-2022/\">Ford is bringing its own class 2 electrified Transit van to the US in 2022</a>. But Colorado-based Lightning eMotors has been developing an electrified class 3 Transit van—which is rated for heavier loads—since 2017. Earlier this month, Lightning and Proterra announced that the electric Transits would use Proterra-made battery packs, with production reaching an anticipated 3,000 vans in 2023.</p><p>\"Proterra’s batteries are premium technology for premium vehicles,\" said Tim Reeser, CEO of Lightning eMotors. \"We are very pleased to be able offer their batteries on our industry-leading Lightning Electric vehicles. We've delivered more zero-emission medium-duty commercial EVs than any other manufacturer in North America, and Proterra's batteries will allow us to give our customers even more range, power, and features on our purpose-built vehicles at the price they need to scale up their electric fleets.\"</p><p>Meanwhile, UPS is thinking even bigger than DHL Express. Last year, it ordered 10,000 electric vans from a UK startup called Arrival for delivery between 2021 and 2024, with an option for another 10,000. On Thursday, Arrival arrived on the NASDAQ exchange after completing a merger with a special-purpose acquisition company, earning the company a valuation of $13.6 billion and making the listing the <a href=\"https://www.ft.com/content/fb516262-1a03-4ac9-ac14-e34d1d18197b\">largest ever by a British company</a>.</p><p>There's even a chance that the United States Postal Service might boost its electric fleet, too. In February, <a href=\"https://arstechnica.com/cars/2021/02/usps-picks-a-new-mail-truck-and-no-they-wont-all-be-electric/\">the USPS made up its mind about its next delivery vehicle</a>, announcing plans to order 50,000 to 165,000 Next Generation Delivery Vehicles from Oshkosh Defense. The NGDV has been designed to be powertrain-agnostic, but we were saddened to learn that USPS only planned to order 10 percent of the delivery vehicles with EV powertrains. However, the agency has since told lawmakers that <a href=\"https://federalnewsnetwork.com/management/2021/03/usps-offers-to-buy-more-electric-delivery-vehicles-if-congress-puts-up-billions/\">it could make that number 50 percent</a> as long as Congress appropriates the money to do so—a fine reason to write to your senators and representatives.</p><p><em>Listing image by Lighting eMotors</em></p></div></div></div>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"88aac792d25825d74e8d105b4b01eb0faf3f21ce3b75e6d60560d404e7e70611","category":"Tech"}