{"title":"Van den Broek-Blaak wins Simac Ladies Tour as Vos takes stage 5 victory","link":"https://cyclingtips.com/2021/08/van-den-broek-blaak-wins-simac-ladies-tour-as-vos-takes-stage-5-victory/","date":1630240061000,"content":"<div><div><p>Marianne Vos (Jumbo-Visma) took her third victory of the week on stage 5 of the Simac Ladies Tour, as Chantal van den Broek-Blaak (SD Worx) crossed the line safely to win the race overall.</p><p>The final stage of the Simac Ladies Tour took place over 19 laps of a lumpy course in the outskirts of Arnhem – 149 km of busy racing in steady rain and a stiff breeze. It took almost 90 km for the day’s breakaway to be established, while earlier in the race Jumbo-Visma worked hard to put Anouska Koster ahead of Alison Jackson (Liv Racing) in the mountains competition.</p><p>The day’s QOM served as a great launchpad for repeated attacks, but the six riders to make it stick with 60 km to go were Ella Harris (Canyon-SRAM), Teniel Campbell (BikeExchange), Nina Buijsman (Parkhotel Valkenberg), Trixi Worrack (Trek-Segafredo) and Teuntje Beekhuis (Jumbo-Visma) and Jeanne Korevaar (Liv Racing). The SD Worx-led peloton let the group stretch their advantage to a maximum of around two minutes before hauling them back to around the minute mark.</p><p>The rain was falling even harder as the race reached the last few laps, and with the gap around 30 seconds at 23 km to go, the breakaway started to test each other just as attacks fired from the peloton. By the start of the penultimate lap, there were four riders at the front – Campbell dropped and Buijsman disqualified for an ‘incorrect bike change’ – with Janneke Ensing (BikeExchange) chasing them down.</p><p>Eugenie Duval (FDJ Nouvelle Aquitaine Futuroscope), Silke Smulders (Lotto Soudal) and Mischa Bredewold (Parkhotel Valkenberg) brought some fresh legs to the front as others dropped away before the final lap. The three newcomers tried to get away in the closing kilometres, but the sprint teams were now eating hungrily into their tumbling advantage. </p><p>The catch was made with 3 km to go and the pace was fierce on the run-in. Trek-Segafredo worked hard for the advantage going into the finishing straight, but Vos positioned herself perfectly on the wheel of Amalie Dideriksen (Trek-Segafredo) before launching her unstoppable sprint, winning yet again in the green jersey. Alice Barnes rewarded her Canyon-SRAM teammates for their hard work all day with second, while Amy Pieters (SD Worx) took third.</p><div><div><p>Simac Ladies Tour (2.WWT) <span>Arnhem → Arnhem</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/ae/marianne-vos-2021.jpg\"></p><div><p>VAN DEN BROEK-BLAAK Chantal</p></div></div></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"88de8a23a649b7afeab63611c9b81628cfb10962577c831a91f2e589336198fd","category":"Cycling"}