{"title":"Welcome to the new CT Community Forum!","link":"https://cyclingtips.com/2021/09/welcome-to-the-new-ct-community-forum/","date":1630628967000,"content":"<div><div><p>A forum, you ask? Isn’t that something that existed in the 1990s during Web 1.0?</p><p>Well, you’re not wrong. But I always loved forums and found them very useful. If I wanted a question answered, or if someone else already answered the same question, it was the go-to place for that. Same with general information, updates, and a way to connect with likeminded people.</p><p>Forum software didn’t progress much over the decades and it was overtaken by Facebook groups and other social media platforms, but I always found those to be a cacophony of messages, topics, and toxic behavior that social media encourages rather than suppresses.</p><p>At CyclingTips we have an incredibly knowledgeable and respectful community that we don’t give enough of a voice to. Our comments section is limited to the articles that our editors publish and your collective knowledge is far far greater that what we could ever come up with.</p><p>This is why today we’re launching a new CyclingTips Forum where you can have your say on pretty much anything to do with cycling. <a href=\"http://forum.cyclingtips.com/\" target=\"_blank\">Go and check it out</a>. If you already have a login to comment on CyclingTips, you’re good to go – just use the same login. If you don’t, it’s easy to create one and get started.</p><p>We’ve chosen a platform that is simple to use, but far more feature-rich than the 1990s forums you might be used to. Conversations are easy to follow and the navigation format is extremely simple. As users become trusted regulars over time, they earn abilities to help maintain the community.</p><p><a href=\"https://cyclingtips.com/signup/\" target=\"_blank\">VeloClub members</a> have access to the VeloClub Lounge where they can connect, share the best rides in their area of the globe, coordinate meet-ups, talk about racing and tech with our journalists, take part in Ask Me Anything (AMA) sessions, etc. The thriving VeloClub Slack group will still exist, but it will be focused on more fleeting, real-time conversation topics with our members.</p><p>We hope you like the new forum we’ve created for you and the features and organisation that exists within it. As always, our <a href=\"https://cyclingtips.com/termsandconditions/\" target=\"_blank\">rules around conduct</a> still apply and if someone keeps breaking these rules our community moderators and ranking system will swiftly and politely ask them to leave.</p><p>I’m excited to see what the CT community does with this and how it takes shape.</p><p>Have a question? Post it on the <a href=\"http://forum.cyclingtips.com/\" target=\"_blank\">forum</a>!</p></div></div>","author":"Wade Wallace","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8a9155a986b0aaac80cf79f41d93576b743eca756397d61a94cd312d77f59d17","category":"Cycling"}