{"title":"I want you to love crit racing like I love crit racing","link":"https://cyclingtips.com/2021/06/i-want-you-to-love-crit-racing-like-i-love-crit-racing/","date":1623338005000,"content":"<div><div><p>A single line from a conversation I had with L39ION’s Justin Williams a year ago still regularly runs through my head. “We failed the fixie kids,” he said. </p><p>A decade ago, there were thousands, tens of thousands, of kids on fixed gears in cities across the world. Black and brown and white and gay and straight and fast and slow, they loved bikes, loved the culture, and were looking for ways to become bike racers. And we didn’t really give them a chance. </p><p>That trend has waned somewhat, but the core of that failure remains. The most approachable, accessible, coolest type of bike racing is one that gets largely ignored by media outlets like this one and by the industry as a whole. Crit racing. It was the avenue in, but we didn’t open our arms wide enough. </p><p>So what are we gonna do about it? We need to cover it. That’s what we do. So we’re going to reboot Manual for Speed.</p><p>That will evoke immediate nostalgia in some of you. If you know, you know. You know the flashbulbs and wide eyes and beer handups and screaming fans; you know that nobody captures what crit racing really is, what if feels like, like the Manual for Speed crew. If you don’t know, you’re about to find out. </p><p>This is <a href=\"http://vengavengavenga.fans/\">VENGA VENGA VENGA</a>.</p><p>A Cannondale project made by Manual for Speed.</p><p>Found on CyclingTips. </p><p>It’s coming. </p><p>We’re going to start simple. We’ll have a crew on the ground at Tulsa Tough this weekend. The bulk of immediate coverage will be on our social platforms. You can find us there and at <a href=\"http://vengavengavenga.fans/\">vengavengavenga.fans</a>. There will be video, there will be photos. There will be T-shirts and stickers, if you’re lucky enough to get one. You’ll meet characters, winners and losers, crash victims and first timers. </p><p>Tulsa Tulsa Tulsa Tulsa Tulsa. That’s the first. </p><p>The motto is Do Racing. Just go ahead and do it. What’s stopping us? </p><p>Why crits? And why now? I</p><p>I’d be lying if I said this wasn’t personal. These races – Tulsa included – are a big part of why I’m writing this right now as the editor of this bike website. I want you to love them like I love them. </p><p>If you break bike racing down to its constituent parts, lay them out on a table, pick out the most exciting bits, and then put those bits back together, what do you get? I think you get crit racing. </p><p>If you want to bring bike racing to the people, specifically to people who haven’t seen it before, to downtowns and past rows of bars on a Friday night, what do you need? You need crit racing. </p><p>It’s not for everyone. Maybe it’s not even for most. But for a lot of us, crits were and are at the core of our love of bikes. </p><p>Crits have been an undervalued racing scene for years. Gravel takes most of the media attention and much of the bike industry’s marketing spend these days – just look at Unbound last weekend. And while gravel is in some ways incredibly accessible, in others it’s quite the opposite. Big gravel races don’t work so well in most big cities. That’s a lot of people missing out. </p><p>Plus, we think we can walk and chew gum at the same time. Give gravel its due, but also turn our attention elsewhere. </p><p>So keep an eye out. Head over to <a href=\"http://vengavengavenga.fans/\">vengavengavenga.fans</a> for a taste. </p><p><em>Caley Fretz</em></p><p><em>Editor-in-Chief, CyclingTips</em></p></div></div>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8b4d1936889f0dc910ffdd7ef1f1690fc69afa723e6388081bbe1c32246ca25a","category":"Cycling"}