{"title":"Apple pushes iOS 14.4.2, iPadOS 14.4.2, and watchOS 7.3.3 to supported devices","link":"https://arstechnica.com/?p=1752496","date":1616794809000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Security update —</h4><h2 itemprop=\"description\">There are no new features in these updates, just a security fix.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/ipad-air-listing-800x539.jpg\" alt=\"Apple's 2020 iPad Air.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/ipad-air-listing.jpg\" data-height=\"971\" data-width=\"1440\">Enlarge</a> <span>/</span> Apple's 2020 iPad Air.</p><p>Samuel Axon</p></figcaption></figure><p>Today, Apple began rolling out iOS 14.4.2, iPadOS 14.4.2, and watchOS 7.3.3, and the company issued an advisory to users to upgrade as soon as possible. Like iOS/iPadOS 14.4.1 before it, this update addresses a security flaw.</p><p>Additionally, Apple released a similar security update—12.5.2—for older devices like the iPhone 5S or 6 that cannot run iOS 14.</p><p>The release notes for iOS 14.4.2 and iPadOS 14.4.2 are minimal, simply stating:</p><blockquote><p>This update provides important security updates and is recommended for all users.</p><p>For information on the security content of Apple software updates, please visit the website: https://support.apple.com/kb/HT201222</p></blockquote><p>It's that security link that contains the <a href=\"https://support.apple.com/en-us/HT212256\">real information</a>. Here's what Apple's security support page says:</p><blockquote><p><strong>WebKit</strong></p><p>Available for: iPhone 6s and later, iPad Pro (all models), iPad Air 2 and later, iPad 5th generation and later, iPad mini 4 and later, and iPod touch (7th generation)</p><p>Impact: Processing maliciously crafted web content may lead to universal cross site scripting. Apple is aware of a report that this issue may have been actively exploited.</p><p>Description: This issue was addressed by improved management of object lifetimes.</p><p>CVE-2021-1879: Clement Lecigne of Google Threat Analysis Group and Billy Leonard of Google Threat Analysis Group</p></blockquote><p>The same goes for the watchOS update. All four software updates (iOS 14.4.2, iPadOs 14.4.2, iOS 12.5.2, and watchOS 7.3.3) should already be available to all users of supported devices right now.&nbsp;This is the second update since the release of iOS/iPadOS 14.4 and watchOS 7.3 in late January.</p><p>The update immediately preceding this one was also an urgent fix for a security vulnerability.</p><p><a href=\"https://arstechnica.com/gadgets/2021/01/ios-14-4-and-ipados-14-4-adds-new-camera-features-fixes-bunches-of-bugs/\">iOS 14.4</a> was a feature update, not just a security update or bug fix one, but the features added were relatively modest. They included the ability for the camera to read smaller QR codes than before, an option to manually classify Bluetooth devices to ensure desired behavior, and notifications to let users know if the camera is \"unable to be verified as a new, genuine Apple camera.\"</p></div></div>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8b7fd61414b58f7f127c128665081a78b49a2099daae911504b87a9e08227a11","category":"Tech"}