{"title":"Wout van Aert took his versatility to a new level at the 2021 Tour","link":"https://cyclingtips.com/2021/07/wout-van-aert-took-his-versatility-to-a-new-level-at-the-2021-tour/","date":1626674250000,"content":"<div><p></p><h4>Wout van Aert wins stage 21 of the Tour de France.</h4><p></p><div><p>After delivering on the hype as the favorite for Saturday’s <a href=\"https://cyclingtips.com/2021/07/wout-van-aert-wins-the-stage-20-time-trial-at-the-tour-de-france/\" target=\"_blank\">stage 20</a> of the <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a>, Wout Van Aert (Jumbo-Visma) could have packed it in and enjoyed a more relaxed finale in Paris with his Olympic goals looming.</p><p>He decided to do something else instead.</p><p>Having already won a <a href=\"https://cyclingtips.com/2021/07/van-aert-maybe-its-my-best-victory-ever/\" target=\"_blank\">high-mountain stage</a> and a time trial stage at this Tour, the 26-year-old Belgian took a bunch kick win in the most stylish way possible on Sunday, <a href=\"https://cyclingtips.com/2021/07/van-aert-wins-a-magical-third-tour-de-france-stage-as-pogacar-wins-overall/\" target=\"_blank\">on sprinting’s biggest stage</a>. Not a bad way to cap off his third career Tour appearance, one that saw his team lose its pre-race GC leader only to regroup and rally around Jonas Vingegaard, who went on to finish second overall, while Van Aert nabbed his three huge stage wins and Sepp Kuss added another for good measure.</p><p>“This Tour has just been amazing,” Van Aert said Sunday. “It’s been such a roller coaster but to finish off with a weekend like this, it’s beyond expectations.”</p><p>Indeed, winning one Tour stage after two trips up and over Mont Ventoux, another stage on his TT bike, and a final stage in a bunch kick against a resurgent Mark Cavendish (Deceuninck-QuickStep) exceeded expectations even for the supremely talented Van Aert.</p><p>Sunday’s 21st and final stage of the 2021 Tour de France marked the first time that a rider had won a high-mountain stage, a TT, and a bunch sprint since Bernard Hinault did it in 1979. Before that, it was the sort of thing Eddy Merckx did, and so it’s to be expected that Merckx’s name would come up when Van Aert was interviewed after stage 21.</p><p>Van Aert wasn’t about to put himself on the same level as Merckx, which is hardly a surprise. As a Monument winner and three-time world cyclocross champ, the savvy Van Aert is a longtime veteran of press conferences in which people have asked about how he compares to legends of the sport.</p><p>“I guess it’s the same comparison that journalists made to Cavendish when he won number 34,” Van Aert said, according to <a href=\"https://www.cyclingnews.com/news/wout-van-aert-im-just-a-little-cyclist-compared-with-eddy-merckx/\" target=\"_blank\">Cyclingnews</a>. “It’s impossible: Eddy Merckx won the GC of the Tour five times and he won basically every race in the world of cycling. I’m just a really little cyclist compared with Eddy. I’m just proud of my own performances.”</p><p>Comparisons to all-time greats aside, Van Aert’s accomplishments and the talents that have allowed him to achieve them stand out in the hyper-specialized world of modern cycling.</p><p>The sport has seen its fair share of versatile talents in recent years, with Alejandro Valverde, Peter Sagan, and Michal Kwiatkowski all making the grade as riders with strong climbing abilities, big engines, and fast finishes, but Van Aert achieved something at this Tour that has not been seen in pro cycling for more than generation.</p><p>Right now, it kind of feels like the deciding factor in whether Van Aert achieves something great is simply whether he decides to take on the challenge at all. During this very Tour, for instance, there were several sprint stages that he might have been able to win, but he opted to save his strength for other objectives.</p><p>On Sunday, he decided to try his luck on the Champs-Élysées. It worked out pretty well.</p><p>“It’s definitely not a pity that I went for it today, because a victory like this is priceless,” he said afterward.</p><p>Not a pity indeed.</p><p>Next up on his docket is the Olympics, where he will be a favorite for the time trial and the road race too.</p><p>“I guess I’ll try to win both, but of course it’s going to be really difficult,” Van Aert said on Sunday.</p><p>And beyond that? Again, it really feels like it’s up to Van Aert as to where he wants to focus his efforts. With his versatility, almost anything seems possible right now. He already has one Monument win under his belt at Milan-San Remo, and he will likely be a contender at the Tour of Flanders and Paris-Roubaix for years to come. His sprint speed and time trial prowess probably aren’t going anywhere either.</p><p>Whether he will one day make a GC bid at a Grand Tour remains to be seen. For now, Van Aert is downplaying talk of targeting the overall at a three-week race. He may have ridden to second overall at Tirreno-Adriatico this year and finished inside the top 20 in the past two Tours while riding in a support role, but a GC campaign at a Grand Tour would require a pretty significant overhaul to his approach. What’s more, as amazing as Van Aert is, climbing with the likes of Tadej Pogacar and Egan Bernal would be a new level of amazing entirely.</p><p>He’d also have to find opportunities for leadership in a team that is crowded with GC talents like Primož Roglič and Jonas Vingegaard, which would be a challenge.</p><p>In the short term, there may be other Grand Tour jerseys that suit him better than yellow, particularly one that was designed to reward riders who consistently shine stage-after-stage across the race. Even with a system in place to favor the purer sprinters, the points classification at the Tour de France has Van Aert’s name all over it, if he just decides to give it a try one of these years.</p><p>Apparently, he’s thought about it already, as he confirmed on Sunday when asked what his ambitions for future Tours might be.</p><p>“I want to come back one day and go for the green jersey,” he said. “I think that’s what’s next on my mind.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8c26eaf16c8887427133687ada904daf459e5a00e58cd38cba397de5e6aabe22","category":"Cycling"}