{"title":"Encrypted Messaging App Signal Stops Working in China","link":"https://www.macrumors.com/2021/03/16/signal-messaging-app-banned-china/","date":1615890312000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/16/signal-messaging-app-banned-china/\"><p><img alt=\"signal icon\" width=\"243\" height=\"242\" src=\"https://images.macrumors.com/t/qa8iaouoPIRNlyBl9Z0mw1c1qwc=/400x0/filters:quality(90)/article-new/2020/12/signal-icon.jpg?lossy\" data-src=\"https://images.macrumors.com/t/qa8iaouoPIRNlyBl9Z0mw1c1qwc=/400x0/filters:quality(90)/article-new/2020/12/signal-icon.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/qa8iaouoPIRNlyBl9Z0mw1c1qwc=/400x0/filters:quality(90)/article-new/2020/12/signal-icon.jpg?lossy 400w,https://images.macrumors.com/t/rdrPFEytUBZJPP58XjXZRhNkNZQ=/800x0/filters:quality(90)/article-new/2020/12/signal-icon.jpg?lossy 800w,https://images.macrumors.com/t/Qqzj92JiTfgnY96V-PcZ8oDcGXI=/1600x0/filters:quality(90)/article-new/2020/12/signal-icon.jpg 1600w,https://images.macrumors.com/t/AUoavmRfTbniMH-EHI-Gq48F2tw=/2500x0/filters:no_upscale():quality(90)/article-new/2020/12/signal-icon.jpg 2500w\" data-sizes=\"auto\" sizes=\"243px\" srcset=\"https://images.macrumors.com/t/qa8iaouoPIRNlyBl9Z0mw1c1qwc=/400x0/filters:quality(90)/article-new/2020/12/signal-icon.jpg?lossy 400w,https://images.macrumors.com/t/rdrPFEytUBZJPP58XjXZRhNkNZQ=/800x0/filters:quality(90)/article-new/2020/12/signal-icon.jpg?lossy 800w,https://images.macrumors.com/t/Qqzj92JiTfgnY96V-PcZ8oDcGXI=/1600x0/filters:quality(90)/article-new/2020/12/signal-icon.jpg 1600w,https://images.macrumors.com/t/AUoavmRfTbniMH-EHI-Gq48F2tw=/2500x0/filters:no_upscale():quality(90)/article-new/2020/12/signal-icon.jpg 2500w\">Encrypted messaging app <a href=\"https://signal.org/\">Signal</a> appears to have been banned in China, reports <em><a href=\"https://techcrunch.com/2021/03/15/signal-is-down-in-china/?guccounter=1\">TechCrunch</a></em>. While the app remains available in the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, the service is no longer operational in mainland China, according to the censorship tracking website <a href=\"https://en.greatfire.org/\">Greatfire.org</a>.</p><p>Western-run social networks like Facebook, Twitter, and Instagram have been unavailable in the country for some time, but Signal has largely flown under the radar of China's authorities until now. Signal has yet to comment on the issue.</p><p>It's unclear what has caused the country's government to act and whether the ban is permanent, however Signal and rival service Telegram have both recently experienced a <a href=\"https://www.macrumors.com/2021/01/08/messaging-app-signal-sees-surge-signups/\">significant uptick in users</a> following WhatsApp's bungled PR campaign explaining its upcoming <a href=\"https://www.macrumors.com/2021/01/06/whatsapp-privacy-policy-data-sharing-facebook/\">privacy policy update</a>.</p><p>Like Signal, Telegram and WhatsApp are still listed on the China ‌App Store‌, although access to the services requires the use of VPNs – another category of apps that local authorities have <a href=\"https://www.macrumors.com/2017/07/03/popular-mobile-vpn-services-shut-down-in-china/\">cracked down on in recent years</a>.</p><p>VPNs circumvent China's \"Great Firewall\" by routing and encrypting internet traffic to servers outside of the country, making them popular with privacy-conscious users who have limited access to online content because of government restrictions.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/15/apple-shares-jump-airpods-pro-ad/\">Apple Shares 'Jump' AirPods Pro Ad</a></h3><p>Sunday March 14, 2021 9:09 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today shared a new AirPods Pro-focused ad called \"Jump\" on its YouTube channel, highlighting the Active Noise Cancellation and Transparency features of the earbuds in a creative way. In the spot, a man wearing AirPods Pro jump ropes through the city. It's set to the song \"Fallin' Apart\" by Young Franco, and it features the tagline \"Turn the world into your playground with AirPods Pro.\" ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/13/top-stories-apple-event-rumor-march-23/\">Top Stories: Apple Event Rumored for March 23, iMac Pro and HomePod Discontinued, and More</a></h3><p>Rumors about a potential Apple event are starting to heat up as we're getting close to the time of year when Apple frequently hosts an event, so stay tuned for more information on that front in the coming days and weeks. This week also saw Apple confirm it has discontinued both the iMac Pro and the original HomePod, while rumors are continuing to look forward to new Apple silicon MacBook Pro ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-discontinuing-homepod/\">Apple Discontinues Full-Sized HomePod to Focus on HomePod Mini</a></h3><p>Friday March 12, 2021 5:14 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple has discontinued the standard HomePod to focus exclusively on the HomePod mini, reports TechCrunch. First introduced four years ago, Apple's larger HomePod has never sold well because of its high price tag. Apple hoped that the HomePod's high-quality sound would give it an edge over competing products, but sales of the HomePod have always been lackluster with so many more affordable...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-silicon-mac-shipments-forecast/\">Next-Generation Apple Silicon MacBooks Expected to Drive Record-Breaking Mac Shipments This Year</a></h3><p>In a research note shared with MacRumors today, Barclays analysts said they expect Apple to report record Mac shipments in the 2021 fiscal year. Apple has seen strong demand for Macs driven by the COVID-19 pandemic and the release of Apple silicon Macs. With rumors indicating that Apple plans to release redesigned 14-inch and 16-inch MacBook Pro models with Apple silicon in the second half...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/iphone-13-touch-id-under-display/\">iPhone 13 Models Will 'Likely' Have Touch ID Under the Display</a></h3><p>iPhone 13 models slated for release later this year will \"likely\" feature a fingerprint scanner embedded under the display for authentication, in addition to Face ID, according to Barclays analyst Andrew Gardiner and three of his colleagues. In a research note shared with MacRumors today, the analysts added that iPhone 13 models will feature a smaller notch and that the LiDAR Scanner will...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/airpods-3-redesign-new-images/\">Upcoming AirPods 3 Redesign Shown Off in New Images</a></h3><p>Friday March 12, 2021 11:55 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the AirPods 3 rumored to be launching as soon as this month, we've been seeing an increasing number of leaks showing off the design of the new earbuds. Renders were shared yesterday, and today, 52audio has published a series of images said to feature the third-generation AirPods. As with prior leaks, the AirPods 3 have an AirPods Pro-like design with a shorter stem and a more rounded...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/13/iphone-12-cook-ad/\">Apple Promotes iPhone 12 'Ceramic Shield' Display In New 'Cook' Ad</a></h3><p>Saturday March 13, 2021 10:04 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>In a new ad on its YouTube channel, Apple is promoting the durability and water resistance of the iPhone 12 and the performance of the \"Ceramic Shield\" display. The ad, named \"Cook,\" showcases a chef putting an iPhone 12‌ through its paces by splashing it with liquids and flour, plus dropping it on its screen multiple times. The ad aims to highlight the \"Ceramic Shield\" display on the...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/airpods-3-mass-production-q3-2021/\">Kuo: AirPods 3 Mass Production to Start in Q3 2021</a></h3><p>Sunday March 14, 2021 11:55 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Mass production will begin on the third-generation AirPods in the third quarter of 2021, according to an investors note from analyst Ming-Chi Kuo that was seen by MacRumors. If mass production is not set to begin until the third quarter of 2021, it would mean that the AirPods 3 wouldn't ship until later in the year. Kuo previously said back in November that the AirPods 3 would launch in the ...</p></div></div></div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8ca5fb96d23fd01ac2c172931220ede466303cabeaa5f6166d42fd0af1586490","category":"Apple"}