{"title":"The anticlimactic tale of the car in the ditch","link":"https://cyclingtips.com/2021/09/the-anticlimactic-tale-of-the-car-in-the-ditch/","date":1631769692000,"content":"<div><div><p>We’ve all been there. Driving along in a Belgian bike race, providing support for an Irish Continental Team, when all of a sudden – BAM! – your Mercedes station wagon is sliding into a ditch at the <a href=\"https://cyclingtips.com/2021/09/gallery-van-der-poel-tames-the-gravel-at-the-antwerp-port-epic/\">Antwerp Port Epic</a>.</p><p>But how did we end up here? A directeur sportif getting a bit 2 Fast 2 Furious? A sideswipe from a rival team? All of the above?</p><p>Alas, no. As EvoPro Racing explains it on <a href=\"https://www.instagram.com/p/CT2GCX4syg5/\">their Instagram page</a>, it’s all much more mundane: “A series of unfortunate events for the team all in the space of 3km, that’s what.”</p><p>The fateful moments went thus:</p><p><strong>Step 1. </strong>Brendan Rhim crashes. Team car stops to get him going again.</p><p><strong>Step 2.</strong> Michael Van Staeyen has a flat. Brendan forges ahead to reclaim his destiny, and team car stops to get Michael going again.</p><p><strong>Step 3.</strong> Michael’s got a new wheel and everything’s going great! Happy days for EvoPro Racing!</p><p><strong>Step 4.</strong> Ah. Brendan’s got a flat tyre.</p><p><strong>Step 5.</strong> There are couple of other cars blocking the road, so EvoPro’s DS mooches over toward the side of the road to seek a path through.</p><p><strong>Step 6.</strong> Another team’s mechanic jumps out, blocking the road in front of EvoPro’s car, forcing the Mercedes in question to move further over to allow the riders behind through. And then…</p><p><strong>Step 7. </strong>“Put 2 wheels on the hard stand beside the cobbles and it slips away. The car slipped silently effortlessly into the ditch. So much so that the wing mirror did not even fold in.”</p><p>Sounds almost graceful. Who knows when the bale of hay came into the equation, but I think we can agree that it’s the little touches that add the most.</p><p>In conclusion: a dramatic photo, but “not a mark on the car and definitely no one hurt. Just a non event, but a great picture to stir the spot.”</p><p>And as for the race? Mathieu van der Poel monstered his way to victory. Brendan Rhim and Michael Van Staeyen DNFed. The team car was fished out by a tow truck, and everyone lived to fight another day.</p><p>To quote EvoPro’s parting hashtag: #thereyago</p></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8cb3cee49df42ec72fb3842e773629571813cbce6234386ad39ecc8927cec18b","category":"Cycling"}