{"title":"Best password managers: Reviews of the top products","link":"https://www.pcworld.com/article/3207185/best-password-managers-reviews-and-buying-advice.html#tk.rss_all","date":1613673000000,"content":"<div id=\"readability-page-1\" class=\"page\"><section role=\"main\" id=\"page-wrapper\"><article itemscope=\"\" itemtype=\"http://schema.org/Article\"><meta itemprop=\"keywords\" content=\"productivity software,  \"><header><ins data-ad-client=\"ca-pub-4268075595326305\" data-ad-slot=\"9945794902\" data-ad-format=\"link\" data-adsbygoogle-status=\"done\"><ins id=\"aswift_0_expand\" tabindex=\"0\" title=\"Advertisement\" aria-label=\"Advertisement\"><ins id=\"aswift_0_anchor\"></ins></ins></ins><p>Updated</p><section><h3 itemprop=\"description\">If you're still using your dog's name to log in to your bank, you are courting disaster.</h3></section><div><p>Freelance contributor, <span itemprop=\"publisher\" itemscope=\"\" itemtype=\"http://schema.org/Organization\"><span itemprop=\"name\">PCWorld</span><meta itemprop=\"url\" content=\"https://www.pcworld.com\"><meta itemprop=\"logo\" content=\"https://alt.idgesg.net/images/furniture/pcworld/PCW_logo_300x300.png\"></span><span>|</span> <span itemprop=\"datePublished\" content=\"2021-02-18T10:30-0800\"><span>Feb 18, 2021 10:30 am PST</span></span></p></div></header><div><div><figure itemprop=\"image\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"><meta itemprop=\"representativeOfPage\" content=\"1\"><meta itemprop=\"height\" content=\"675\"><meta itemprop=\"width\" content=\"1200\"><meta itemprop=\"url\" content=\"https://images.idgesg.net/images/article/2021/02/pw-manager-hub-2021-100877338-large.jpg\"><img data-original=\"https://images.idgesg.net/images/article/2021/02/pw-manager-hub-2021-100877338-large.jpg\" loading=\"lazy\" alt=\"pw manager hub 2021\" itemprop=\"contentUrl\" onload=\"try {performance.clearMarks('mark_primary_img_rendered'); performance.mark('mark_primary_img_rendered');}catch(e) {console.log('Error saving performance mark -- this function may not be supported in this browser');}\" src=\"https://images.idgesg.net/images/article/2021/02/pw-manager-hub-2021-100877338-large.jpg\"><figcaption kioskedhash_production=\"11429_b38de844e3e89cd14d39a75a3995ebee\" data-kiosked-context-name=\"kskdUIContext_01eyv767tsgqaq9ze51vq9v5yg\"><span itemprop=\"copyrightHolder\">Rob Schultz / IDG</span></figcaption></figure></div></div><section><div id=\"drr-container\" itemprop=\"articleBody\"><p>We are terrible at passwords. We <a href=\"https://www.usatoday.com/story/tech/news/2016/01/19/study-finds-were-still-terrible-passwords/79003044/\" rel=\"nofollow\">suck at creating </a>them (the top two most popular remain “123456” and “password”), we <a href=\"https://www.inc.com/will-yakowicz/infographic-95-percent-share-6-passwords-with-friends.html\" rel=\"nofollow\">share them way too freely</a>, and we <a href=\"https://www.buzzfeed.com/josephbernstein/survey-says-people-have-way-too-many-passwords-to-remember?utm_term=.vdGQ9Na78#.uhJPQyBO6\" rel=\"nofollow\">forget them all the time</a>. Indeed, the very thing that can ensure our online security has become our biggest obstacle to it. This is what makes a good password manager essential.</p><p>A password manager relieves the burden of thinking up and memorizing unique, complex logins—the hallmark of a secure password. It allows you to safely share those logins with others when necessary. And because these tools encrypt your login info in a virtual vault—either locally or in the cloud—and lock it with a single master password, they protect the passwords themselves. If you’re looking to up your security game, a password manager is the way to go. Yes, web browsers are starting to offer password management features, <a href=\"https://www.pcworld.com/article/3604671/why-your-browsers-password-manager-isnt-good-enough.html\">but they’re not good enough</a>.&nbsp;</p><p>But password managers vary widely in their capabilities and cost, so we compared several of the most popular. All support Windows Mac OS, Android, and iOS, as well as the major browsers. And all will let you sync your data across multiple devices, though you may have pay extra for the privilege.</p><p>Here are our top two picks, followed by tips on what to look for when shopping for a password manager and links to full reviews of all the products.</p><p><em><strong>Updated 2/18/21</strong> to add our review of Roboform Everywhere, and link to our roundup of the best free password managers.&nbsp;</em></p><div data-tracking-category=\"In-article TOC\"><legend>Table of Contents <i></i></legend><ul><li data-pagenum=\"1\" data-tocnum=\"1\"><a href=\"#toc-1\">Best overall password manager</a></li><li data-pagenum=\"1\" data-tocnum=\"2\"><a href=\"#toc-2\">What to look for in a password manager</a></li><li data-pagenum=\"1\" data-tocnum=\"3\"><a href=\"#toc-3\">All of our reviews</a></li></ul><p>Show More <i></i></p></div><h3 id=\"toc-1\">Best overall password manager</h3><p><a href=\"https://www.pcworld.com/article/3205868/lastpass-review-this-virtual-vault-makes-password-protection-effortless\">LastPass</a> ticks all the boxes on our password manager want list. It makes it a breeze to create unique, complex passwords; capture and manage login credentials; sync them across multiple devices; and share them with others you trust. Its password auditing and updating features let you identify and eliminate weak or duplicate passwords with just a mouse click or two. It also stores credit card numbers and other personal data to autofill web forms when you’re making a purchase, signing up for a service, or paying a bill.</p><p>LastPass also supports a range of multi-factor authentication options for protecting your vault, including app-based authenticators like Symantec VIP and Google Authenticator, hardware tokens like YubiKey, and fingerprint readers.</p><h3>Runner-up</h3><p><a href=\"http://www.pcworld.com/article/3205901/security/dashlane-review-this-password-manager-makes-you-smarter-about-security.html\">Dashlane</a> is the strongest contender for LastPass’s crown. It has a beautiful interface, is easy to use, and is stocked with features to help you strengthen your online security. Chief among these is a stellar security dashboard that grades your passwords and suggests actions for boosting your score and your protection. Dashlane is free for a single device, but if you want syncing across multiple devices you’ll need a Premium plan, which has a&nbsp;<a href=\"http://www.kqzyfj.com/click-8200811-12302791?sid=xid-fr1613673736852fhd\" rel=\"nofollow\" data-orig-url=\"http://www.kqzyfj.com/click-8200811-12302791\" data-ml-id=\"3\" data-ml=\"true\" data-xid=\"fr1613673736852fhd\">$60 price tag</a>—the highest in our roundup. This is the only thing that slightly dampens are enthusiasm for this fantastic password manager.</p><div><p>Today's Best Tech Deals</p><p>Picked by PCWorld's Editors</p></div><div><p>Top Deals On Great Products</p><p>Picked by Techconnect's Editors</p></div><h3 id=\"toc-2\">What to look for in a password manager</h3><p>At their most basic, password managers capture your username and password—usually via a browser plugin—when you log in to a website, and then automatically fill in your credentials when you return to that site. They store all your passwords in an encrypted database, often referred to as a “vault,” which you protect with a single master password.</p><p>Of course, most password managers do much more than this and many extend protection beyond your login credentials to other types of personal data. We narrowed it down to a few essential features that we looked for and you should too:</p><ul><li><strong>Password generation:</strong> You’ve been reminded ad nauseam that the strongest passwords are long, random strings of characters, and that you should use a different one for each site you access. That’s a tall order. This is what makes password generation—the ability to create complex passwords out of letters, numbers, and special characters—an indispensable feature of any good password manager. The best password managers will also be able to analyze your existing passwords for weaknesses and upgrade them with a click.</li><li><strong>Autofill and auto-login:</strong> Most password managers can autofill your login credentials whenever you visit a site and even log you in automatically. Thus, the master password is the only one you ever have to enter. This is controversial, though, as browser autofill has long been a security concern, so the best managers will also let you toggle off this feature if you feel the risk outweighs the convenience.</li><li><strong>Secure sharing:</strong> Sometimes you need to share a password with a family member or coworker. A password manager should let you do so without compromising your security.</li><li><strong>Two-factor authentication:</strong> To an enterprising cybercriminal, your password manager’s master password is as hackable as any other password. Increasingly, password managers support multi-factor authentication—using a second method such as a PIN, a fingerprint, or another “trusted device” for additional verification—to mitigate this risk. Choose one that does.</li><li><strong>Protection for other personal data:</strong> Because of how frequently we use them online, credit card and bank account numbers, our addresses, and other personal data can be securely stored in many password managers and automatically filled into web forms when we’re shopping or registering an account.</li></ul><p>No online security measure is 100 percent foolproof, though, as we were reminded when LastPass, one of the most reputable password managers, recently <a href=\"http://www.pcworld.com/article/3185731/security/lastpass-is-scrambling-to-fix-another-serious-vulnerability.html\">scrambled to fix a pair of vulnerabilities</a> that could have compromised users’ passwords and their computers. And just last month, <a href=\"https://krebsonsecurity.com/2017/06/onelogin-breach-exposed-ability-to-decrypt-data/\" rel=\"nofollow\">OneLogin </a>was victim of a breach that compromised customer data, including the ability to decrypt data.</p><p>Still, most <a href=\"http://www.telegraph.co.uk/technology/0/safe-use-password-manager/\" rel=\"nofollow\">security experts </a>agree that password managers are still the safest way for people to manage their myriad logins, and we agree that the benefits far outweigh the risks. Just choose your password manager carefully after researching all the options starting with the guide. We also have a guide to <a href=\"https://www.pcworld.com/article/3607714/best-free-password-managers.html\">the best free password managers</a>.</p><h3 id=\"toc-3\">All of our reviews</h3><p>If you’re curious to see what other options exist outside our top picks, we’ve listed them all below. We’ve started with six password managers to kick off our guide, but we’ll continue to evaluate more as time goes on—as well as re-evaluate services we’ve already reviewed.</p><p><i><strong>Editor’s note:</strong>&nbsp;Because online services are often iterative, gaining new features and performance improvements over time, our reviews are subject to change in order to accurately reflect the current state of the services.</i></p><div><p>Note: When you purchase something after clicking links in our articles, we may earn a small commission. Read our <a href=\"https://www.pcworld.com/about/affiliates.html\">affiliate link policy</a> for more details.</p></div></div><div><p>Michael Ansaldo is a veteran consumer and small-business technology journalist. He contributes regularly to TechHive and writes the Max Productivity column for PCWorld.</p></div></section><div><h3>Coupon Codes</h3><ul><li><a href=\"https://www.pcworld.com/couponcodes/target\"><h4>Target Promo Code</h4><h5>Target promo code - Up to 45% off</h5></a></li><li><a href=\"https://www.pcworld.com/couponcodes/walgreens\"><h4>Walgreens coupon</h4><h5>Walgreens coupon code for $5 off pickup orders of $25 or more</h5></a></li><li><a href=\"https://www.pcworld.com/couponcodes/sams-club\"><h4>Sam's Club Coupons</h4><h5>Sam's Club promo - 40% off 1-year membership</h5></a></li><li><a href=\"https://www.pcworld.com/couponcodes/backcountry\"><h4>Backcountry Coupon</h4><h5>Up to 60% off women's accessories - Backcountry Deals</h5></a></li><li><a href=\"https://www.pcworld.com/couponcodes/skinstore\"><h4>Skinstore Coupon</h4><h5>27% off First Aid Beauty - SkinStore coupon</h5></a></li><li><a href=\"https://www.pcworld.com/couponcodes/gnc\"><h4>GNC coupons</h4><h5>20% off with this GNC coupon</h5></a></li></ul></div></article></section></div>","author":"Michael Ansaldo","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8cbe1299e6dfd176d77133028c2efedc410d4545924db0db1e782b49e11983a0","category":"Apple"}