{"title":"Canyon issues 'stop riding' notice on latest Aeroad","link":"https://www.cyclist.co.uk/canyon/9326/canyon-issues-stop-riding-notice-on-latest-aeroad","date":1614850769000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>German bike giant Canyon has issued a 'stop riding' order on its latest Aeroad bike following <a href=\"https://www.cyclist.co.uk/tags/mathieu-van-der-poel\">Mathieu van der Poel</a>'s broken handlebar incident at Le Samyn earlier this week.</p><p>The Dutch star stole the show at the Belgian semi-Classic, not through his racing prowess as we've come to expect, but by finishing the race with a set of snapped handlebars. Van der Poel later confirmed that the bars broke on a section of cobblestones earlier in the race.</p><p>Pictures of the broken bars quickly circulated on the internet in the immediate aftermath and there was plenty of speculation as to why the bars failed â particularly around Canyon's new adjustable width handlebar. On Wednesday evening, Canyon issued a 'stop riding' notice to all those riding its CP0018 and CP0015 cockpits, found on the current Aeroad CF SLX and CFR models.</p><p>In a press release, Canyon stated that 'experts from the Canyon development and quality management departments immediately began analysis and testing to understand the cause of this issue.'</p><p>Founder of Canyon, Roman Arnold, then added: 'Mathieu, fortunately, did not fall. We want to ensure with absolute certainty that no one comes to harm before we have fully understood the root cause.</p><p>'We are doing everything we can to equip the affected Aeroad models as quickly as possible with a cockpit that meets both our and our customersâ demands for total quality and safety.'</p><p>It then called for all affected Aeroad customers 'to stop using their bike for the time being'. Additionally, it confirmed that all of the brand's professional teams would be switching to older versions of the Aeroad or the current Ultimate bike.</p><p>This is another headache for Canyon around its latest Aeroad after a number of customers reported issues around the bike's seatpost and damage for heavier riders or those riding with more post exposed.</p></div></div>","author":"jrobinson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"8d903a4223bc9b4708f50cc3e884ec08acfefff78da4120a6cc6e457c3a08569","category":"Cycling"}