{"title":"Inside the stunning Black mythos of Drexciya and its Afrofuturist ’90s techno","link":"https://arstechnica.com/?p=1743849","date":1614517248000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>The journey home (Future) —</h4><h2 itemprop=\"description\">The history of an experimental music-and-mythos project with Black Diaspora at its core.</h2></header><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/123967033_1006833369818184_1685689956853637813_n-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/123967033_1006833369818184_1685689956853637813_n.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/123967033_1006833369818184_1685689956853637813_n-980x1539.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/123967033_1006833369818184_1685689956853637813_n.png 2560\" data-sub-html=\"#caption-1745530\"><figure><figcaption id=\"caption-1745530\"><span></span><p>Art inspired by the Drexciyan mythos, as provided by the artist from his book <em>1989–2014: 25 Years of Techno Art</em>.</p><p><span></span> Abdul Qadim Haqq</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/123799071_290366262117777_2933356756350610711_n-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/123799071_290366262117777_2933356756350610711_n.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/123799071_290366262117777_2933356756350610711_n-980x1447.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/123799071_290366262117777_2933356756350610711_n.jpg 2560\" data-sub-html=\"#caption-1745529\"><figure><figcaption id=\"caption-1745529\"><span></span><p>Art inspired by the Drexciyan mythos, as provided by the artist from his book <em>1989–2014: 25 Years of Techno Art</em>.</p><p><span></span> Abdul Qadim Haqq</p></figcaption></figure></li></ul></div><p>“ARE DREXCIYANS WATER-BREATHING, AQUATICALLY MUTATED DESCENDANTS OF THOSE UNFORTUNATE VICTIMS OF HUMAN GREED? ... DID THEY MIGRATE FROM THE GULF OF MEXICO TO THE MISSISSIPPI RIVER BASIN AND ON TO THE GREAT LAKES OF MICHIGAN? DO THEY WALK AMONG US? ARE THEY MORE ADVANCED THAN US, AND WHY DO THEY MAKE THEIR STRANGE MUSIC? WHAT IS THEIR QUEST?”</p><p>With those all-caps words, musician and writer James Stinson wrote the constitution for the mythic, rhythmic nation of <a href=\"https://www.discogs.com/artist/1172-Drexciya\">Drexciya</a>—a world that he and partner Gerald Donald created in the liner notes of their experimental music project. Their combined work, in the form of five EPs of cutting-edge techno music, did not necessarily <em>sound</em> so politically or culturally charged. Because Stinson and Donald did not participate in interviews or widely tour in support of their albums, Drexciya's listeners were left to look at the stories and questions that covered the liner notes and artwork printed on the releases' vinyl and CD versions.</p><p>Should you merely pull up Drexciya on your favorite streaming service, you won't hear those messages in the beats. So to understand this innovative group, it's crucial to ask the above questions about the fictional Drexciyan quest. And in asking them, Stinson blurred a line between fiction and Black reality—and spoke to a quest of his own.</p><p>Up until his death in 2002, Stinson strived to make a case for his original vision of artistic production. As a complete package of mythology and sound, Drexciya’s music remains authentic. It is challenging, elusive, and a towering exponent of Black authorial agency. Sonically, Drexciya joins the lines between the four-to-the-floor electro enterprise forged by forebears like Afrika Bambaataa and jazz-inflected avant-garde explorations of space and time like Sun Ra.</p><p>But Stinson’s music, compelling as it was, didn’t come from records or CDs in isolation. It came from a place called Drexciya.</p><h2>The centrality of Afrocentric world-building</h2><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Aquatic-Invasion-vinyl-collage-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Aquatic-Invasion-vinyl-collage.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Aquatic-Invasion-vinyl-collage-980x483.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Aquatic-Invasion-vinyl-collage.png 2560\" data-sub-html=\"#caption-1745546\"><figure><figcaption id=\"caption-1745546\"><span></span><p>Drexciya’s 1995 <em>Aquatic Invasion</em> EP further fleshes out elements of the Drexciyan myth.</p><p><span></span> Discogs</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/The-Quest-liner-notes-collage-1-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/The-Quest-liner-notes-collage-1.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/The-Quest-liner-notes-collage-1-980x440.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/The-Quest-liner-notes-collage-1.png 2560\" data-sub-html=\"#caption-1745547\"><figure><figcaption id=\"caption-1745547\"><span></span><p><em>The Quest</em>’s liner notes recapitulate a sonic Great Migration.</p><p><span></span> Discogs</p></figcaption></figure></li></ul></div><p>Stinson’s allusion to the Great Lakes and Michigan amid a re-simulated Great Migration puts the fictional Drexciya closer to real-life Detroit. Though from <a href=\"https://www.shimajournal.org/issues/v10n2/h.-Gaskins-Shima-v10n2.pdf\">what we understand about Stinson's views</a>, Drexciya—and its recapitulation of the electro sound—transcended the geographical limits of Motown. Hence, Stinson drew a specific through-line in his mythology, an alternate Black history, to the depths of the Atlantic, one beginning <em>in medias res</em> amid the Middle Passage.</p><p>“DURING THE GREATEST HOLOCAUST THE WORLD HAS EVER KNOWN, PREGNANT AMERICA-BOUND AFRICAN SLAVES WERE THROWN OVERBOARD BY THE THOUSANDS DURING LABOR... IS IT POSSIBLE THAT THEY COULD HAVE GIVEN BIRTH AT SEA TO BABIES THAT NEVER NEEDED AIR?”</p><p>Those liner notes for Drexciya’s 1997 compilation&nbsp;<em>The Quest&nbsp;</em>spell out the centrality of Afrocentric world-building to Stinson’s music and cultural project. Like <em>Agharta</em> and “Planet Rock” before it, Drexciya explored new states of political being and aesthetic production, all uncompromising in their Black subjectivity. And their albums have, at least in some corners of the musicology world, galvanized conversations about the originary Blackness of techno. In other words, the eventual mainstream explosion of electronic music often (and unfortunately) failed to mention&nbsp;<a href=\"https://www.okayafrica.com/black-electronic-music-artists-pioneers/\">the genre's seeds planted by Black pioneers</a>.</p><p>Stinson would release three more albums as part of Drexciya—among them the equally seminal <em>Neptune’s Lair</em> in 1999 and <em>Harnessed the Storm</em> in 2002—before dying suddenly of a heart condition shortly after.</p><h2>Erasure of art, erasure of maps</h2><p>Much else about Stinson and Donald’s subaquatic sonic world has remained opaque—largely uncharted by popular media, as neither creator did interviews or joined promotional efforts. If you're looking for discussions specifically about the group's music and how it sounds compared to its apparent inspirations, <a href=\"https://daily.bandcamp.com/lists/drexciya-album-guide\">those retrospectives</a> aren't hard to find.</p><p>But while much of the duo’s catalog has seen reissue, repackages and retrospective laurels tell only part of a broader narrative. As Drexciya’s music has been made more accessible, the conceptual project upon which the music rests has been elided, becoming less provincial, less literary, and, perhaps above all, less Black. Only in recent years have we seen more Black artists speak out about a complex media process—not restricted to the example of Drexciya—that <a href=\"https://www.jstor.org/stable/j.ctv1131bwx\">often appears to revise Black authorship on consumer-cultural terms</a>.</p><p>In 2012, Drexciya’s early EPs for various labels (Rephlex, Submerge, Underground Resistance) received a combined re-release from Dutch label Clone Classic Cuts, part of the latter’s new anthology series <a href=\"https://cloneclassiccuts.bandcamp.com/album/journey-of-the-deep-sea-dweller-i\"><em>Journey of the Deep Sea Dweller I-IV</em></a>. But you won’t find this article’s quoted, all-caps passages in those re-releases, nor any other liner notes, album art, or, truly, any of Stinson’s radical touches that made the work equal parts universal and unique. Without apparent irony or self-consciousness, Clone chose to render their new collection’s album art completely white—forgoing the evocative, sub-aquatic sleeve designs that added depth, character, and Blackness to Drexciya’s enigmatic image.</p><p><em>The Quest</em>’s original album art, as one example, features a blackened Mollweide projection—a map well-suited for accurate depictions of continental proportions—that depicts the movement of the Black Diaspora in a purple hue. The repackaged&nbsp;<em>Journey of the Deep Sea Dweller I-IV</em>, on the other hand, is hardly recognizable at a glance as a Drexciya release, were it not for the lone Drexciyan Wavejumper icon—borrowed from the <em>Aquatic Invasion</em> EP—adorning its cover.</p><figure><p><iframe type=\"text/html\" width=\"640\" height=\"480\" src=\"https://www.youtube.com/embed/nmS6AyYUbqs?start=0&amp;wmode=transparent\" frameborder=\"0\" allowfullscreen=\"\"></iframe></p><figcaption><p>Drexciya: \"Sea Quake\" (1992)</p></figcaption></figure><p>The album description for <em>Journey of the Deep Sea Dweller I</em> on Clone’s official Bandcamp page makes passing mention of the Drexciyan myth, but with all the passion of a vapid advertisement. (“First part of the Drexciya reissue series! Drexciya might need an introduction for some...”) While <em>The Quest</em>’s liner notes and visuals outline Stinson’s vision of a future “Greater” Migration—what he called the “JOURNEY HOME” in a map drawn by Frankie C. Fultz—<em>Journey of the Deep Sea Dweller I-IV</em> is silent on Drexciya’s reclamatory and futurist aspects.</p><p>Most egregiously, Clone doesn’t acknowledge James Stinson or Gerald Donald by name. The album’s description on Bandcamp, in however stilted prose, explicitly clarifies the label’s decision to de-contextualize Drexciya—partly by rearranging track listings—on the flimsy pretense of being unable to “recreate the magic of the originals.”</p><h2>When mythology is turned into mere burlesque</h2><p>The Clone reissues are just the most obvious example of how certain actors have elided crucial cultural context from Drexciya’s legacy. Clone’s actions resemble the all-too-common media practice of editing Black music for so-called commercial viability—rendering it palatable for audiences who, it is assumed, don’t care about the history of Black music. The pop-criticism ecosystem hasn’t helped matters.</p><p>In <a href=\"https://pitchfork.com/reviews/albums/16678-journey-of-the-deep-sea-dweller-ii/\">a 2012 Pitchfork review</a> carrying a much-vaunted “Best New Reissue” marker, the reviewer Andrew Garig both ironically and unironically wrote, “My favorite part about Drexciya’s <em>Journey of the Deep Sea Dweller II</em> is how little it teaches me about modern dance music.” Within a narrow prism of paradoxically lazy and contrived formalism, Drexciya becomes mere burlesque: the stereotyped image of two Black discontents in bandanas and futureshades going ape on some Rolands somewhere in a decaying Detroit. Drexciya’s post-biographical and world-building significance is reduced to mere footnotes.</p><p>In his lifetime, Stinson wasn’t just aware of this phenomenon; he was unapologetically vocal about it. In <a href=\"https://drexciyaresearchlab.blogspot.com/2016/10/drexciya-interview-melody-maker-january.html\">a rare interview</a> published after 1995’s <em>Journey Home</em> EP, he decried the efforts of agents of what he called the “Caucasian Persuasion” amid the wider elision of Black techno music. \"A lot of people making so-called techno don’t understand where it came from and what it’s all about. I’ve been with the real deal... since this shit was born out the womb,” he said, recapitulating and reinforcing Drexciya’s ontogenetic focus. “Ever since the blues and early jazz, Black music has been stolen and exploited. And it’s happened here [Detroit], too, and it pisses me off ‘cause we let it happen.”</p><p>Those who have worked with Drexciya express similar sentiments. In an email interview with Ars Technica, illustrator Abu Qadim Haqq said of the Clone reissues, “[They reflect] a complete lack of concern or empathy for the underlying and background stories... These record companies are content with selling the music over the decades but have never done anything more to broaden the understanding of this group or their background story. It laid dormant for decades.\"</p><p>Others who have written about Drexciya agree. The theorist and artist DeForrest Brown, Jr. suggests an understanding of Black music as a “multi-century, generational epic\" of which Drexciya is one component. The work recalls and updates Sun Ra’s Myth-Science Orchestra and <em>It’s Nation Time</em>, as well as Amiri Baraka’s album of “African Visionary Music” for the Motown sub-label Black Forum. Brown argues that this history is removed by the Clone reissues.</p><h2>The multivalent state of Black identity</h2><figure><img alt=\"The album cover of&nbsp;<em>The Quest</em>, whose purple tracing appears to spell out the Black Diaspora.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/The-Quest-1997-comp.-cover.jpg\" width=\"600\" height=\"600\"><figcaption><p>The album cover of&nbsp;<em>The Quest</em>, whose purple tracing appears to spell out the Black Diaspora.</p><p>Discogs</p></figcaption></figure><p>Black artists are entitled to shape their cultural products any way they see fit—and certainly more so than any cultural actor eager to rewrite their efforts. Black artists should be free to imagine the worlds they wish to envision, without concern that their art will be compartmentalized, stereotyped, or reduced to caricature.</p><p>Currently, there’s increasing talk about Blackness in techno. A growing chorus of voices, including those of Haqq and Brown, has elevated some of the online world's techno-history discussion by exploring Drexciya's interpretations of the Black experience, particularly as relating to Stinson's home of Detroit. <a href=\"https://dwellerforever.blog/2021/02/16/running-out-of-space/\">R.C Clarke writes about this</a> while (in admittedly academic fashion) suggesting that this musical history has a lot in common with Diasporic forms:</p><blockquote><p>Drexciya proposes the delineation of pre and post-modernity’s ending-beginning with the Middle Passage. The ends of society being a recursion, not reversion, of blackness’ role in the ends of time.</p><p>Detroit’s post-1968 industrial collapse is the context for identifying Black people’s role in the man-machine dynamics towards a path forward. This melding of identity into not just the idea of Drexicya but to actively search for a lack of identity is powerful in its own rite <em>[sic]</em>.</p></blockquote><p><em>The Quest</em>’s ebony-bodied illustrations foreground what Paul Gilroy, an apparent inspiration for Stinson, <a href=\"https://muse.jhu.edu/article/48294\">called the “Black Atlantic”</a>—the multivalent, almost fluid state of Black identity, as marked by the very trauma of the Black Diaspora. In line with that, Drexciya blotted themselves out as identifiable people whenever possible. In their time, Drexciya furthermore forswore media attention, eschewing most interviews and other conventional forms of press. When they performed live, they wore masks to obscure their identities—a convention continued by their Underground Resistance counterparts, also largely from Detroit.</p><p>It was as if by rejecting the presence of the media—which, as he claimed in that rare 1996 interview, was fixated on a \"Caucasian Persuasion\" before acknowledging Black forces in artistic scenes—that Stinson rejected the trappings of a mere mortal world. In effect, he courted the presence of another reality, one within the limits of his own eternal mind and imagination. In doing so, Drexciya confronted North America’s past, and in creating their own future-myth—one belonging to no nation—they sought to look beyond it.</p><p><em>Listing image by Abdul Qadim Haqq</em></p></div></div></div>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8d9155f37de556690afb4689861a91b43b77e3aba415c39a017282da3ded6c4a","category":"Tech"}