{"title":"เฟซบุ๊กตอบโต้กฎใหม่ด้วยการปิดกั้นคนออสเตรเลียจากการมองเห็นและแชร์ข่าว เผยตัวเองไม่มีทางเลือก","link":"https://www.blognone.com/node/121247","date":1613612557000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p></p><h2 itemprop=\"name\"><a href=\"https://www.blognone.com/node/121247\" title=\"เฟซบุ๊กตอบโต้กฎใหม่ด้วยการปิดกั้นคนออสเตรเลียจากการมองเห็นและแชร์ข่าว เผยตัวเองไม่มีทางเลือก\">เฟซบุ๊กตอบโต้กฎใหม่ด้วยการปิดกั้นคนออสเตรเลียจากการมองเห็นและแชร์ข่าว เผยตัวเองไม่มีทางเลือก</a></h2><p></p><div><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/fb-round.png?itok=YSp1yq-I\"></p><div itemprop=\"description\"><p>จากประเด็นกฎหมายใหม่ออสเตรเลีย News Media Bargaining Code บังคับแพลตฟอร์มออนไลน์จ่ายเงินให้สำนักข่าว ทำให้เฟซบุ๊กต้องออกมาตอบโต้ด้วยการประกาศปิดกั้นสื่อและผู้ใช้งานในออสเตรเลียจากการการมองเห็นและแชร์ข่าวเสียเลย</p><p>เฟซบุ๊กบอกด้วยว่า เดิมทีกฎหมายนี้เข้าใจความสัมพันธ์ระหว่างแพลตฟอร์มและสำนักข่าวผิดตั้งแต่แรกอยู่แล้ว โดยเฟซบุ๊กมีสองทางเลือกคือ ทำตามกฎหมายแต่โดยดี โดยละเลยความเสี่ยงที่จะเกิดขึ้น หรือหยุดเสนอเนื้อหาข่าวในออสเตรเลียไปเสียเลย ซึ่งเฟซบุ๊กเลือกอย่างหลัง</p><p>ผู้ผลิตเนื้อหาและสำนักข่าวในออสเตรเลีย จะถูกจำกัดไม่ให้แบ่งปันหรือโพสต์เนื้อหาใดๆ บนเพจ โดยแอดมินยังใช้งานเครื่องมือหลังบ้านของเฟซบุ๊กได้ทั้ง Page insights, Creator Studio, CrowdTangle ส่วนสำนักข่าวในต่างประเทศนั้น พวกเขายังสามารถเผยแพร่เนื้อหาข่าวบนเฟซบุ๊กต่อไปได้ แต่ผู้ใช้งานชาวออสเตรเลียจะไม่สามารถดูหรือแชร์ลิงก์และโพสต์ข่าวได้ นอกจากนี้ ผู้ใช้งานในประเทศอื่นๆ ก็จะไม่สามารถมองเห็นข่าวสารในออสเตรเลียผ่านเฟซบุ๊กได้</p><p><img src=\"https://www.blognone.com/sites/default/files/externals/6e600c14c74a022921e4a9d4c1b4d5db.jpg\"></p><p>เฟซบุ๊กบอกด้วยว่า สิ่งนี้จะเป็นผลเสีย เพราะปีที่ผ่านมา เฟซบุ๊กได้สร้างการอ้างอิงถึงผู้เผยแพร่โฆษณาในออสเตรเลียฟรีประมาณ 5.1 พันล้านคน มูลค่าประมาณ 407 ล้านเหรียญออสเตรเลีย ส่วนกำไรทางธุรกิจจากข่าวสารก็มีน้อยมาก น้อยกว่า 4% จากที่ผู้คนเห็นใน News Feed การรับข่าวสารเป็นส่วนสำคัญในสังคมประชาธิปไตย นั่นจึงเป็นเหตุผลที่ เฟซบุ๊กสร้างเครื่องมือฟรีเพื่อสนับสนุนองค์กรข่าวทั่วโลกในการสร้างสรรค์เนื้อหา</p><p>ด้านผู้ใช้งานออสเตรเลีย ก็พบว่าตัวเองเข้าถึงเนื้อหาข่าว และเนื้อหาสำคัญอื่นๆ อย่างเพจข่าวและหน่วยงานสุขภาพบนเฟซบุ๊กไม่ได้ รัฐบาลออสเตรเลียบอกว่าท่าทีเช่นนี้ของเฟซบุ๊ก กำลังบั่นทอนความน่าเชื่อถือของตัวบริษัทเอง Paul Fletcher รัฐมนตรีว่าการกระทรวงการสื่อสาร กล่าวว่า เฟซบุ๊กต้องคิดอย่างรอบคอบว่าสิ่งนี้มีผลต่อชื่อเสียงและจุดยืนของตัวเองอย่างไรบ้าง</p><p>เรียกได้ว่าท่าทีของเฟซบุ๊กอยู่ตรงข่ามกับกูเกิลชัดเจน โดยกูเกิลมีท่าทียอมผ่อนปรนกับกฎหมายมากกว่า และเริ่มมีการทำข้อตกลงกับสำนักข่าวในออสเตรเลียแล้ว</p><p>ที่มา - <a href=\"https://about.fb.com/news/2021/02/changes-to-sharing-and-viewing-news-on-facebook-in-australia/\">เฟซบุ๊ก</a>, <a href=\"https://www.bbc.com/news/world-australia-56099523\">BBC</a></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8dd54c84d79eddd0c183dd8f1eb8c21da90e3c81c4dd147926262e069bdfb2c1","category":"Thai"}