{"title":"Climate Change Action for Cyclists: Part I – Climate Change, the Cycling Experience, and Why We Care","link":"https://theradavist.com/2021/03/climate-change-action-for-cyclists-part-i-climate-change-the-cycling-experience-and-why-we-care/?utm_source=rss&utm_medium=rss&utm_campaign=climate-change-action-for-cyclists-part-i-climate-change-the-cycling-experience-and-why-we-care","date":1616424034000,"content":"<div id=\"readability-page-1\" class=\"page\"><section><article id=\"article-207372\"><div><p><img src=\"https://media.theradavist.com/uploads/2021/03/Refsnider-Bradshaw-Canyons-2.jpg?w=1400&amp;quality=75\" alt=\"Climate Change Action for Cyclists: Part I – Climate Change, the Cycling Experience, and Why We Care\" srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider-Bradshaw-Canyons-2.jpg?w=650&amp;quality=75 640w,https://media.theradavist.com/uploads/2021/03/Refsnider-Bradshaw-Canyons-2.jpg?w=1400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/03/Refsnider-Bradshaw-Canyons-2.jpg?w=2000&amp;quality=75\" data-base-url=\"https://radavist-static-production.s3.amazonaws.com/uploads/2021/03/Refsnider-Bradshaw-Canyons-2.jpg\" data-base-quality=\"75\" data-alt-srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider-Bradshaw-Canyons-2.jpg?w=650&amp;quality=75 640w,https://media.theradavist.com/uploads/2021/03/Refsnider-Bradshaw-Canyons-2.jpg?w=1400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/03/Refsnider-Bradshaw-Canyons-2.jpg?w=2000&amp;quality=75\"></p></div><header><h4>Radar</h4></header><div><p><i>This is the first of a two-part series on how human-caused climate change is affecting the cycling experience, why we as cyclists should care about those impacts, and what we can do as individuals and as a community to combat those impacts. Part I of this series connects cyclists to a few examples of the realities of climate change, and Part II will outline what changes we as cyclists and the cycling community can make to improve the future of our pursuit in a changing climate. </i><b><span>&nbsp;</span></b><span id=\"more-207372\"></span></p><p>In the summer of 2020, cyclists once again experienced firsthand the impacts of a changing climate on where we ride as record-breaking wildfires shuttered access to National Forests and threatened or destroyed communities across the West. Smoke drifted so far east that my brother in New Hampshire witnessed hazy sunrises, while riders across the Intermountain West became glued to wind forecasts and air quality apps. In the areas across the West that escaped major wildfires this past year, the air quality was so low due to wildfire smoke that cyclists like myself regularly didn’t ride, or we timed easy rides to when the air quality was acceptably marginal. Our local NICA practices in southern Idaho were regularly canceled due to smoke. In Arizona, another record-setting wildfire season scorched nearly one million acres, including more than 100 miles of Arizona Trail, closing many sections of trail to all users for the entirety of the season due to dangerous conditions. By the time November rolled around, fires were out and a record-breaking number of hurricanes in the Southeast had passed, but Americans had not forgotten the impacts of climate on their lives. Among voters across both major parties, climate change was at its highest-ever level of concern heading into election season.<span>&nbsp;</span></p><p><img src=\"https://media.theradavist.com/uploads/2021/03/LionHead_Med_Will_Stubblefield-2406.jpg?w=1400&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2021/03/LionHead_Med_Will_Stubblefield-2406.jpg?w=650&amp;quality=75 640w, https://media.theradavist.com/uploads/2021/03/LionHead_Med_Will_Stubblefield-2406.jpg?w=1400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/03/LionHead_Med_Will_Stubblefield-2406.jpg?w=2000&amp;quality=75\" data-base-url=\"https://media.theradavist.com/uploads/2021/03/LionHead_Med_Will_Stubblefield-2406.jpg\" data-base-quality=\"75\" data-alt-srcset=\"https://media.theradavist.com/uploads/2021/03/LionHead_Med_Will_Stubblefield-2406.jpg?w=650&amp;quality=75 640w, https://media.theradavist.com/uploads/2021/03/LionHead_Med_Will_Stubblefield-2406.jpg?w=1400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/03/LionHead_Med_Will_Stubblefield-2406.jpg?w=2000&amp;quality=75\"></p><p>The impacts of a changing climate are widely agreed upon within the scientific community – rising sea level, loss of biodiversity, extreme weather events, more frequent and devastating droughts, longer and more severe wildfire seasons, more frequent and energetic hurricanes, and much more. And it is understood that for most people, the compelling factor for choosing to take action to combat these changes is <i>when we weigh the problem or threat against our own lifestyle, career, passion, and/or identity</i>. Through seeing the impact of climate change on what matters to us, we can choose to take action for climate change out of passion for our sport. This article is dedicated to identifying how climate change will impact the cycling experience (generally through the lens of riding on dirt) and what we as cyclists can do about it. This article is not going to demonstrate that human-caused climate change is real (it is, and there is ample research to affirm this), nor is it to debate that we as humans are responsible for this change over the past 150 years (we are, and again, there is ample research to back this). This article also won’t make arguments about who, from a global perspective, is responsible for fixing this problem. Instead, this article is meant to serve as a call to action for cyclists to recognize the opportunity we have to collectively support the future of our sport as we know and love it and to protect the health and future of the landscapes upon which we ride.<span>&nbsp;</span></p><p><img src=\"https://media.theradavist.com/uploads/2021/03/Refsnider_blownouttrail.jpg?w=1400&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider_blownouttrail.jpg?w=650&amp;quality=75 640w, https://media.theradavist.com/uploads/2021/03/Refsnider_blownouttrail.jpg?w=1400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/03/Refsnider_blownouttrail.jpg?w=2000&amp;quality=75\" data-base-url=\"https://media.theradavist.com/uploads/2021/03/Refsnider_blownouttrail.jpg\" data-base-quality=\"75\" data-alt-srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider_blownouttrail.jpg?w=650&amp;quality=75 640w, https://media.theradavist.com/uploads/2021/03/Refsnider_blownouttrail.jpg?w=1400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/03/Refsnider_blownouttrail.jpg?w=2000&amp;quality=75\"></p><p><b>The impacts of climate change on cycling: <i>Why we care</i>.<span>&nbsp;</span></b></p><p>The forecast for climate changes varies across the globe. Some places will become hotter and drier while others will become warmer and wetter. Weather patterns will become more inconsistent and extreme (note that <i>weather</i> refers to seasonal events and patterns, whereas <i>climate</i> refers to longer-term decadal weather patterns). There are a few general implications of climate change that will undoubtedly continue to impact the landscapes that we ride: wildfire, drought, and flooding. And because the weather doesn’t exist in a vacuum, one of these implications will often lead to the worsening of another. Drought and warmer winters support beetle infestations, which in turn can kill forests, which increases the susceptibility of the forest to wildfire and further accelerates flooding and erosion.<span>&nbsp;</span></p><p>Areas in the western U.S. are already experiencing sufficient warming to support widespread bark beetle infestations in the forests. When winters are not cold enough to kill beetle populations, beetle-kill sweeps through the forests leaving hundreds to millions of acres of standing dead trees. Within just a season or two, the dead forests are dry and pose a threat to all recreationalists, and can easily close long stretches of trails in just a single wind event – if fire doesn’t torch the snags first. But even in the absence of beetle infestations, the fate of Western forests looks grim as more frequent prolonged drought primes these forests for wildfires. Wildfires fell trees across trails and scorch trees that were stabilizing slopes and soils, accelerating erosion. (Forests also provide a huge climate service through carbon sequestration, so with each forest burned due to a warming climate, there is that much less acreage of forest to sequester carbon from the atmosphere). Drought, particularly in the more arid climates, dries up water sources upon which wildlife and backcountry cyclists alike rely. And when it does rain, freak, extreme rain events that fall on drought-hardened soil run off more rapidly causing flash flooding and more rapid deterioration of trails. Such intense flash flooding is predicted across the Southwest as the behavior of the summer monsoons changes.<span>&nbsp;</span></p><p><img src=\"https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-43.jpg?w=1400&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-43.jpg?w=650&amp;quality=75 640w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-43.jpg?w=1400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-43.jpg?w=2000&amp;quality=75\" data-base-url=\"https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-43.jpg\" data-base-quality=\"75\" data-alt-srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-43.jpg?w=650&amp;quality=75 640w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-43.jpg?w=1400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-43.jpg?w=2000&amp;quality=75\"></p><p>In response to prolonged fire season and the catastrophic impacts of fires on communities, it is becoming far more common for National Forest-wide closures to public use and access during times of high wildfire risk. In places where this is becoming more common, such as northern Arizona, communities like Flagstaff are faced with the hard reality that the safest measure for their homes is a complete forest closure. With those closures come the loss of access to all trails and shaded outdoor reprieve from summer heat until the wildfire risk reduces. The closures also drastically affect tourism revenue in communities with economies supported by local public lands.<span>&nbsp;</span></p><p>Kurt Refsnider, the Executive Director of Bikepacking Roots and a Ph.D. geologist with expertise in glacial climate evolution offers his experience, observations, and knowledge to ground us as cyclists. “I live in Arizona, and some cities in the state have been breaking record after record for the warmest year on record, the driest year on record, the most days above 110°F, and so on. All across the Southwest, ponderosa pines are turning brown and dying due to recurring droughts. As these forests die, they don’t return – they’re replaced by chaparral brush that can grow as much as 2 feet in a single summer, choking trails closed with highly flammable fuel for future fires. More frequent and destructive wildfires have been burning these same forests and places so many of us live <i>and</i> love to ride. Droughts are natural. Heatwaves are natural. Wildfires are natural. But the frequency and scale at which all these are occurring are not within the range of what’s been experienced over the past few centuries (or even millennia!). Those are the changes close to home. Farther removed from where most of us live or travel, the Arctic is warming at rates 3 times or greater than the globe as a whole. That rapid warming will (and already is) resulting in powerful positive feedbacks that will only serve to accelerate the rates of change elsewhere on the globe. We’re <i>really</i> going to feel that in the next 50 years. That’s going to have a dramatic effect on what summers feel like in the Southwest, on how short and dry winters will become in the Rocky Mountains, and on how much coastline gets flooded by rising seas. If you’re a mountain biker, a winter sports enthusiast, a paddler – this <i>will</i> impact your experiences in dramatic ways.”</p><p><img src=\"https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-49.jpg?w=1400&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-49.jpg?w=650&amp;quality=75 640w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-49.jpg?w=1400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-49.jpg?w=2000&amp;quality=75\" data-base-url=\"https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-49.jpg\" data-base-quality=\"75\" data-alt-srcset=\"https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-49.jpg?w=650&amp;quality=75 640w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-49.jpg?w=1400&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/03/Refsnider_WyomingRange_reduced-49.jpg?w=2000&amp;quality=75\"></p><p>Mountain bikers and the places we ride are not immune to the current realities of and future threats from climate change. The health of the landscape is changing, and the acres of rideable singletrack in forested areas will decrease as burns and beetle kill continue. The shape and quality of trails will change under pressure from fire and flood-driven erosion, and access to public lands will become tenuous as the Forest Service and other agencies continue to face the challenge of managing public lands that are primed for community-threatening wildfire and are mandated to continue to protect the ever-growing list of endangered species.<span>&nbsp;</span></p><p><b>So yes, the challenges we face are great. But no one has ever told me that cycling is easy – whether you’re a freestyle flyer, downhill ripper, enduro charger, cross-country machine, gravel grinder, or bikepacking adventurer – your sport takes will, discipline, and courage. If you’re a cyclist, you have the necessary tools to make positive contributions to the climate crisis. And Part II of this piece will help guide you in that. . .<span>&nbsp;</span></b></p></div><nav><h4>Related</h4></nav></article></section></div>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"8e255d2ae40c450a260b5df656ffaee277802877eedc29c2d51254063c883e36","category":"Cycling"}