{"title":"ABL Space tapped to launch the first orbital rocket from Britain","link":"https://arstechnica.com/?p=1740153","date":1612742417000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>US ABL TO UK —</h4><h2 itemprop=\"description\">“The ABL system is relatively easy, quick, and cost-effective to deploy.\"</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/10/Ek8Ue6tWMAE8RiS-800x560.jpg\" alt=\"Hot fire test of integrated second stage for ABL Space System's RS1 rocket in the fall of 2020.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/10/Ek8Ue6tWMAE8RiS.jpg\" data-height=\"1401\" data-width=\"2000\">Enlarge</a> <span>/</span> Hot fire test of integrated second stage for ABL Space System's RS1 rocket in the fall of 2020.</p><p>ABL Space Systems</p></figcaption></figure><p>Lockheed Martin says it has selected United States-based ABL Space Systems to launch the first orbital rocket from the United Kingdom—a mission that is expected to take place from Scotland in 2022.</p><p>The launch is part of an agreement between the United Kingdom government and Lockheed to foster a commercial small satellite launch industry in the country. No rockets have ever launched into orbit from UK soil, but now the government is seeking to become both a launch center of Europe and a small satellite manufacturer.</p><p>In choosing ABL Space, Lockheed has chosen a company that has not yet launched a rocket, although its RS1 vehicle is expected to make its debut during the second quarter of this year. Lockheed is an investor in the El Segundo, California-based ABL Space and believes it is on track to succeed.</p><p>“The ABL system is relatively easy, quick and cost-effective to deploy, with fantastic performance, an important capability for many of our future customers,\" said Randy DeRosa, Lockheed Martin’s program manager for the company’s UK Pathfinder Launch program.</p><p>ABL is developing a ship-and-shoot capability for its RS1 rocket, which is expected to have a lift capacity of 1.2 tons to low-Earth orbit. The goal is to box the rocket into a few cargo containers, ship it to a launch site, assemble it, and send it into orbit. The company's base price for a launch is $12 million.</p><p>Although ABL Space has largely operated under the radar during the last three years, it appears to be well capitalized and has hired well. Last summer, for example, ABL revealed that it had received two US Air Force contracts worth $44.5 million and secured $49 million in new private funding. An ABL official said the launch from the United Kingdom is approximately the fifth mission on its current manifest and that ABL&nbsp;hopes to establish a regular launch cadence from Shetland Space Center, allowing it to better serve the European satellite market.</p><p>The UK Space Agency announced its domestic launch initiative in July 2018. At the time, it awarded $31 million to Lockheed Martin to develop and demonstrate a vertical launch site in Sutherland, Scotland. In addition, $7 million was granted to a Britain-based company, Orbex, which is developing its own rocket. It was thought then that a launch company chosen by Lockheed, as well as Orbex, would launch from the Sutherland site in the Scottish highlands.</p><p>However, last fall,&nbsp;<a href=\"https://spacenews.com/lockheed-martin-shifts-u-k-launch-site/\">Lockheed said</a> it was moving to another site in Scotland,&nbsp;the Shetland Space Centre in the Shetland Islands, in the northernmost part of the country. In explaining the move, Lockheed said it ended up having different technical requirements for launch than Orbex. British officials approved the move at the time, saying it would be beneficial to have two complementary vertical launch sites in the United Kingdom. (<a href=\"https://arstechnica.com/science/2020/12/orbex-raises-24-million-in-new-funding-can-now-scale-up-for-orbital-launch/\">Orbex says</a> it is still targeting a 2022 launch date as well, but this seems questionable.)</p><p>Now, Lockheed and ABL are locked in on the Shetland site and preparations for a launch next year. For this first mission, ABL Space Systems’ RS1 rocket will launch a small orbital maneuvering vehicle, built by MOOG, which is capable of carrying and deploying up to six 6U CubeSats.&nbsp;Two of the CubeSats launched by the maneuvering vehicle will be Lockheed Martin technology demonstrators.</p></div></div>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8e462862a2a02265d649a6437b6d9d1da6f7d373e00eeaeb4af8531988dba655","category":"Tech"}