{"title":"How the pros prepare for the Tour: Mountain-stage recon with AG2R Citroën","link":"https://cyclingtips.com/2021/06/how-the-pros-prepare-for-the-tour-mountain-stage-recon-with-ag2r-citroen/","date":1623958903000,"content":"<div><div><p>During the hallowed offseason that professional riders cherish so much, they are often interrupted by team camps. They’re dragged away by their respective teams for all-important get-togethers, a few weeks away from the comfort of home spent getting to know new teammates, cramming the miles in, having a multitude of tests, and generally preparing for the upcoming season.</p><p>But that doesn’t just happen in the offseason. During the year riders are again shipped off to team camps – multiple smaller jaunts away, slotted in between what could very well be a heavy racing schedule. That’s right, not just one, but multiple. Weeks away from home, where the daily distractions of home life don’t exist; where instead, energy can be ploughed into achieving that all-important form.</p><p>Back in late May, an email dropped into my inbox from the AG2R Citroën Team. It was an invitation: would I like to tag along on one of those upcoming camps for a day? Silly question, really. Heck, why not!</p><p>The fact that it was also being held in the Alpine commune in the eastern French department of Haute-Savoie, made it a no-brainer. A perfectly lovely location, great riding, and on top of all this, it was just a short drive from my home in Annecy.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/P1090380.jpg\"><figcaption>Sun shining, journalists in attendance, team car loaded with food – must be recon day.</figcaption></figure><p>Even though Le Grand-Bornand is a popular skiing destination, it’s not quite ideal if you’re after a location for altitude training. At “only” 1,300 metres, it sits a good 900 m below the height where all those gains from being at altitude kick in. But I tell you, it sure makes for a very picturesque, challenging, destination for a training camp. Scenic, quiet at this time of the year, and usually sunny.</p><p>Unfortunately for the small group of riders in attendance – including Benoit Cosnefroy, Oliver Naesen, Greg Van Avermaet, Michaël Schär, Clément Venturini, and Dorian Godon – the weather for most of the week’s camp didn’t deliver the sun that was expected. Instead, storms, rain and snow greeted the riders each morning – winter coats and rain jackets were well in use. That was until the final day, which just happened to be the day I turned up.</p><p>Sunshine cut through the morning mist sitting on the mountain tops, winter tights were left packed away in suitcases, rain jackets were stashed in the following team car, and smiles were present for the final day of camp. The route for the day’s training: the challenging climbs in the decisive final 90 km of stage 8 of the upcoming Tour de France.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/P1090463.jpg\"><figcaption>Sprint training, even on a mountain stage recon.</figcaption></figure><p>I can hear some of you thinking “these guys must know half of France’s good roads by now, especially the riders with multiple Tours in their legs. Why recon roads they’ve tackled probably multiple times, especially a stage that finishes in a town which saw new recruit Greg Van Avermaet arrive in yellow, way back in the good old pre-COVID days of 2018?” Ahh, the memories!</p><p>Well, I put this to them. I could quite easily tell you here in the article that they told me a good pro is like a good boy scout – well prepared – and that it’s never a bad thing to refresh your memory and legs as to where and when the road tilts, where the good opportunities are to take on vital fuel, and where to sit in. Instead, I’ll force you to watch the video and find out that bit …</p><p>Oh, bugger, I just realised what I’ve done there …</p><p>Either way, please delve into the video above. The day with the team was enlightening and spending time chatting (with masks on) with GVA and the rest of the team gave me a bit more insight into what goes on behind the scenes for those all-important Tour stages.</p></div></div>","author":"Dave Everett","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8fa5633619e945ee0c021a2795743a26b451eaf7e228933601488b7129dd4ebe","category":"Cycling"}