{"title":"Not just Facebook: Snap, Unity warn Apple’s tracking change threatens business","link":"https://arstechnica.com/?p=1740030","date":1612548697000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>IDFA —</h4><h2 itemprop=\"description\">Snap shares fell even as company assured investors it will weather the change.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2015/09/snapchat-640x427.jpg\" alt=\"Snapchat on an iPhone.\"><figcaption><p>Snapchat on an iPhone.</p></figcaption></figure><p>Social media company Snap (which runs Snapchat) and game development software company Unity have joined Facebook in warning their investors that Apple's imminent ad-tracking change will negatively impact their businesses.</p><p>As previously reported, Apple plans to use the next iOS update (iOS 14.5, due out in early spring) to implement a requirement that all apps on the platform gain user opt in to track users with IDFA (ID for Advertisers) tags. IDFA tags are used to track what users do across multiple apps in order to target advertising more effectively.</p><p>Social media giant Facebook has told its own investors that the coming change to Apple's operating system could very negatively impact its advertising revenue, because this kind of tracking-based ad targeting is one of Facebook's main ingredients for success.</p><p>It has also taken out full-page newspaper ads claiming that one effect of targeted advertising becoming less effective as a result of this change is that small and local businesses that rely on Facebook advertising will see higher costs to reach users, negatively impacting those businesses as well.</p><p>Unity made a similar case, in a way. Unity runs a mobile app advertising platform, earning much of its revenue from game and app developers on platforms like iOS. The company's leadership said in yesterday's earnings call that the change will affect app and game developers' ability to efficiently gain new customers and optimize their lifetime value. The company predicts its revenues will fall $30 million in 2021 as a result of the change. However, that is estimated to be just 3 percent of the company's overall annual revenue.</p><p>For its part, Snap (which offers many sophisticated ad products) warned investors of the effects the change could have but tried to strike a more confident tone. \"We admire Apple and believe they are trying to do the right thing for customers,\" said Chief Business Officer Jeremi Gorman. She said she believes Snap is well-positioned to prepare advertisers for the change, even as the potential impact was acknowledged.</p><p>As a result of concern about the Apple change, Snap shares fell 7 percent in after-hours trading despite an otherwise positive business picture, including a 22 percent increase in daily active users year over year. The stock rose back above its previous levels during today's trading, however.</p><p>When The Information <a href=\"https://www.theinformation.com/articles/facebook-looks-to-take-its-fight-with-apple-to-court\">reported</a> that Facebook leadership was consulting with outside legal counsel for a potential lawsuit against Apple, it also said that many Facebook employees were opposed to the move because they did not see Facebook as \"a compelling victim.\" While Snap and Unity have not orchestrated PR or legal battles against Apple like Facebook has, the public might find Snap and Unity more sympathetic.</p><p>Snap is popular, but it does not dominate in the same way Facebook does, and it has been less embroiled in controversies over the spread of misinformation or privacy scandals. And Unity's stated cause for concern is that it will miss out on revenue because its customers—game and app developers big and small—will see their own revenue fall.</p><p>Nonetheless, the companies plan to comply with Apple's required changes, and those changes are expected to roll out this spring. Apple has already <a href=\"https://arstechnica.com/gadgets/2021/02/apple-updates-app-store-guidelines-with-tracking-opt-in-requirement-and-more/\">updated</a> its app review guidelines to reflect the new policy.</p></div></div>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"908893f191544785f0e31da57ae387da586190040a8f4a533b68aba5544210a2","category":"Tech"}