{"title":"Intel hit with $2.2 billion patent judgment","link":"https://arstechnica.com/?p=1746490","date":1614724392000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Billion with a B —</h4><h2 itemprop=\"headline\">Jury finds Intel infringed two chip patents, owes $2.2 billion</h2><h2 itemprop=\"description\">Patents claim methods of varying voltages and clock frequencies to save power.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1230712029-800x534.jpg\" alt=\"A multistory building with an Intel logo on the wall of its top floor.\"><figcaption></figcaption></figure><p>A Texas jury has <a href=\"https://patentlyo.com/patent/2021/03/billion-albrights-courtroom.html\">ordered</a> Intel to pay $2.18 billion in damages for infringing two patents. The lawsuit was filed by VLSI Technology LLC, a 4-year-old firm that Intel says has no products and no sources of revenue besides patent litigation.</p><p>The patents at issue in the case previously belonged to NXP Semiconductors, a Dutch company that spun off from&nbsp;Philips in 2006. NXP acquired the patents when it bought Freescale Semiconductor (itself a spinoff of Motorola) in 2015. Intel's lawyer <a href=\"https://www.bloomberg.com/news/articles/2021-03-02/intel-told-to-pay-2-18-billion-after-losing-texas-patent-trial\">told jurors</a> that NXP would get a portion of the proceeds from the lawsuit.</p><p>The two patents focus on methods for minimizing the power consumption of computing chips. One way to do this is by varying the system voltage: setting a higher voltage when high performance is needed, then lowering the voltage to conserve power afterwards.&nbsp;One&nbsp;<a href=\"https://patents.google.com/patent/US7523373B2/en\">patent</a> claims the concept of storing information about a memory chip's minimum voltage in nonvolatile memory so the system can ensure that the memory circuit has a high-enough voltage.</p><p>VLSI's <a href=\"https://patents.google.com/patent/US7725759B2/en\">other patent</a> focuses on altering clock frequencies as a power-saving technique. Once again, raising the clock frequency of an electrical bus can increase system performance but consume more power. NXP's <a href=\"https://patents.google.com/patent/US7725759B2/en\">second patent</a> is based on the idea that a device on a bus can a change to the clock frequency when it needs faster performance.</p><p>At trial, Intel argued that it hadn't copied these techniques from NXP or Freescale and that, in fact, Intel had invented its own, more sophisticated, techniques to accomplish these objectives. But a jury in Waco, Texas, wasn't convinced.</p><p>Intel had <a href=\"https://www.law.com/texaslawyer/2021/01/21/federal-circuit-wont-block-albright-from-february-patent-showdown/?slreturn=20210202160336\">tried to get the trial postponed</a>, arguing to a federal appeals court that COVID-19 rates in the Waco area were too high to hold the trial safely. The company also argued that it would be better to hold the trial in Austin, where Intel has a campus. But with the Austin courtroom closed, Judge Alan Albright decided to hold the case in Waco. In January, the Federal Circuit Appeals Court gave the green light.</p><p>The case isn't over. Intel may ask the judge to find the jury misapplied the law. If that fails, Intel will then have the opportunity to appeal the case. If the ruling is upheld, it would be one of the largest patent judgments in US history.</p></div></div>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"930a0f3eba5c6bc19a9ceeb6041f309181d5c80a33909e700cd115a4f27e3d87","category":"Tech"}