{"title":"Castelli Goccia jacket review","link":"https://www.cyclist.co.uk/castelli/9338/castelli-goccia-jacket-review","date":1615205348000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Listen up, language fans. The Castelli Goccia (pronounced ‘goch-ya’) jacket does not take its name from a Noel Edmonds prank, instead being named for the Italian word for a ‘drop’ or ‘bead’ of water.</p><p>It’s an ideal label to slap on this rain jacket, given that it employs Castelli Tempesta fabric to simply bead water off its surface. That said, it would have been a delight if someone at Castelli R&amp;D was a huge Noel’s House Party fan, and is simply toying with us…</p><p>The Castelli Goccia jacket proves that there is more than one way to approach the packable jacket quandary, and it excels in many areas.</p>&nbsp;<h3>Simple is best</h3><p>Given that the Castelli Goccia jacket is designed to be thrown over a jersey when you’re caught in a downpour, it keeps things simple and functional. There are no external pockets – it’s designed to function simply as a rain shell.</p><p>It fits the bill very well indeed in this respect, with Castelli Tempesta Stretch fabric offering assured waterproofing at the same time as allowing freedom of movement from its four-way stretch construction.</p><p>A storm flap covers the full-length zipper, where I might have liked to find a fully waterproof zipper, especially given the £160 asking price.</p>&nbsp;<p>A single flap-covered vent at the nape of the neck is there to ferry away the worst of any heat build-up, but if you’re looking for the ultimate in breathability you won’t find it here.</p><p><a href=\"https://www.tredz.co.uk/.Castelli-Goccia-Jacket_231371.htm\" target=\"_blank\"><em><strong>Buy the Castelli Goccia jacket from Tredz now</strong></em></a></p><p>Even Castelli is quick to acknowledge the compromise, stating that, ‘compared to more expensive Gore-Tex Idro jackets, you give up the best-in-class breathability and extreme packability, but you gain stretch fit and increased durability.’</p>&nbsp;<h3>Stow away</h3><p>That packability is a major consideration, since the Castelli Goccia jacket is not designed to be worn for the entire ride. Thankfully, it does roll up into a compact enough bundle to be stuffed into a jersey pocket, but it will fill it, and you might find yourself reaching back to check it’s still securely packed away whilst riding.</p><p>In use, its tail could be even longer to protect your behind from road spray, but its fit at the rear will depend largely upon whether your pockets are bursting at the seams with other essentials.</p><h3>Comfort</h3><p>You can’t knock the Castelli Goccia jacket for its comfort provision. It’s effectively a stretchy second skin which fits closely over your jersey.</p><p>There are no intrusive seams, with taped panels being the order of the day, to provide the necessary waterproofing. The cuffs are secured very snugly so wind can’t get up your sleeves.</p><p><a href=\"https://www.tredz.co.uk/.Castelli-Goccia-Jacket_231371.htm\" target=\"_blank\"><em><strong>Buy the Castelli Goccia jacket from Tredz now</strong></em></a></p><p>It’s not for colder climes, though – Castelli recommends that the rain jacket it best used between 5° and 14°C… sounds like perfect April showers territory to me. And if you do happen to be out and about and get caught in fading light, there’s a very effective reflective strip down the hem, too.</p><p>Factor in the 182g weight of a size S example, and you’ve a lightweight, dependable, simple, stylish three-season jacket – if you can handle the price.</p><p><a href=\"https://www.cyclist.co.uk/cyclist-reviews-policy\" target=\"_blank\"><em>All reviews are fully independent and no payments have been made by companies featured in reviews</em></a></p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"931687df2bdb510bb25ffe75297adbdabecfb890e838b44cedb04e89dae18ba8","category":"Cycling"}