{"title":"Five key things to watch out for as the Tour reaches the Alps","link":"https://cyclingtips.com/2021/07/five-key-things-to-watch-out-for-as-the-tour-reaches-the-alps/","date":1625275515000,"content":"<div><div><p>The first chapter of the 2021 <a href=\"https://cyclingtips.com/tag/tour-de-france\" target=\"_blank\">Tour de France </a>is now complete and what a chapter it was. We had seven days packed with aggressive racing, big crashes, <a href=\"https://cyclingtips.com/2021/06/julian-alaphilippe-wins-stage-1-of-the-tour-de-france/\" target=\"_blank\">swashbuckling solo wins</a>, <a href=\"https://cyclingtips.com/2021/06/all-mark-cavendish-needed-was-one-more-chance/\" target=\"_blank\">heartwarming comebacks</a>, and a <a href=\"https://cyclingtips.com/2021/07/mohoric-wins-stage-7-of-the-tour-amid-big-changes-to-the-gc-picture/\" target=\"_blank\">whole lot of tears</a>. So many tears.</p><p>Now, with stage 8 on the horizon, the next phase of the Tour is about to begin.</p><p>Over the next few stages the riders will trade the flatlands and rolling hills of central France for the properly mountainous slopes of the Alps. Here are the key things you should watch out for as the Tour heads into its first real mountains.</p><h2>How long can the Classics specialists hold on?</h2><p>After a remarkable stage 7 featuring a massive, star-studded breakaway, the Tour is being led by two of the sport’s biggest Classics stars: Mathieu van der Poel (Alpecin-Fenix) and Wout van Aert (Jumbo-Visma, +0:30). There’s a whole lot of climbing left to come in the Tour and, on balance, the climbers should easily overtake the multi-discipline stars that lead the race, likely before they leave the Alps. But …</p><p>Remember the 2019 Tour? Remember how everyone thought Julian Alaphilippe would lose yellow as soon as the race reached the Pyrenees? Remember how he not only held on through the Pyrenees, but managed to finish second on the Col du Tourmalet, then made it to the Alps before sliding down the GC? It’s not out of the question to see similar from Van der Poel and/or Van Aert over the next few days.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033268-139-1340x894.jpeg\"><figcaption>Inseparable.</figcaption></figure><p>We saw last year just how good Van Aert is uphill. When he wasn’t winning bunch sprints he was playing super-domestique in the mountains and dropping much more fancied climbers, seemingly with ease. With his team leader Primož Roglič now out of GC contention, what’s Van Aert capable of if he fights for yellow? That’s an tantalising prospect.</p><p>And as for Van der Poel, well, this is an entirely new scenario for him. This is his first Grand Tour, remember. He’s got zero experience racing in the mountains of a three-week race, let alone <em>leading</em> a three-week race into the mountains. On paper, he’s just as good as Van Aert uphill, so who knows what might happen. Hopefully for his sake he’s recovered from a <a href=\"https://twitter.com/CyclingCentral/status/1410974671068008450\" target=\"_blank\">very taxing stage 7</a>.</p><p>Stage 8 should be instructive. It doesn’t have a big uphill finish but it has enough climbing to put Van Aert and Van der Poel to the test. Maybe they both slide way down the GC on stage 8. Maybe they don’t. Whatever happens, both are tenacious riders who aren’t scared of a fight. It’s going to be fascinating to watch.</p><h2>How is Tadej Pogačar going to approach the Alps?</h2><p>After being ambushed on stage 7, the defending champion is now 3:43 behind the overall lead. But that’s not as bad as it could be – he’s still the highest-placed among the GC men. The question is, how soon will he start trying to claw back that deficit?</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033265-100-1340x956.jpeg\"><figcaption>He’s still best-placed among the GC contenders, put Pogačar’s got some work to do.</figcaption></figure><p>Will Pogačar be on the move as early as stage 8? Will he bide his time, knowing that he’s got a bunch of mountainous stages ahead and he doesn’t need to do anything rash? That would be the conservative route, but the 22-year-old isn’t exactly known for sitting back and watching the race happen around him.</p><p>On that note: it’s worth mentioning Pogačar’s team. The Slovenian might be the strongest rider in the race, but he certainly <a href=\"https://cyclingtips.com/2021/07/the-tour-is-a-lot-better-when-the-best-rider-isnt-on-the-best-team/\" target=\"_blank\">doesn’t have the strongest team</a> around him. He was caught out on stage 7 and you can bet he’ll be wary of being isolated again as the race unfolds. A good way to prevent that? Race aggressively where possible.</p><h2>How is Vincenzo Nibali going?</h2><p>The 36-year-old was in the winning break on stage 7 and for a time looked to be the biggest winner among those who got up the road. By the end of the day he’d slipped down the hierarchy to finish 13th on the stage, 2:57 behind stage winner Matej Mohorič (Bahrain Victorious).</p><p>Still, when it comes to GC rivals, Nibali (Trek-Segafredo) now only has Pogačar ahead of him (by 29 seconds). Behind him: Rigoberto Uran (EF Education-Nippo, +0:52), Richard Carapaz (Ineos Grenadiers, +1:07), Geraint Thomas (Ineos Grenadiers, + 1:17) and plenty more.</p><p>Nibali is clearly past his best – Nibali of five years ago might well have turned yesterday’s breakaway into overall victory there and then. Over the next couple weeks most of his GC rivals will take time on him in the Alps and also in the Pyrenees. But, he is in a strong position coming into the first mountainous stages of the Tour. What can he do from here?</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033268-030-1340x894.jpeg\"><figcaption>Nibali (second from left) driving the breakaway on stage 7.</figcaption></figure><p>From where Nibali is now, it’s not hard to imagine him finishing on the podium at this year’s Tour. Has he got what it takes to minimise his losses over the next few days? Or will he haemorrhage time and be back in the GC wilderness? That’s going to be interesting to watch.</p><h2>Who’s looking strongest among the other GC riders?</h2><p>It’s not just Nibali we’ll be keeping an eye on. Carapaz was aggressive on stage 7 but ultimately put in a lot of effort for no reward. Thomas is riding injured and doesn’t look great. Wilco Kelderman (Bora-Hansgrohe), Enric Mas (Movistar) and Jakob Fuglsang (Astana-Premier Tech) are all thereabouts but none seem likely to climb with the absolute best. But we don’t really know. The Alps will be give us more information.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033263-176-1340x894.jpeg\"><figcaption>Could Uran surprise us all again?</figcaption></figure><p>Uran will be particularly worth keeping an eye on. At only 1:21 behind Pogačar, and with Pogačar and Nibali the only GC men ahead of him, Uran is nicely placed. Remember 2017 when the Colombian rode his way to a Tour podium, defying many people’s expectations? That’s not out of the question again, particularly with pre-race favourites like Roglič and Thomas seemingly out of the picture.</p><h2>Stage 11 is going to be something very special.</h2><p>Stage 8 is a mountainous day with the first three Cat 1 climbs of the Tour. Stage 9 features the first HC climb and the first real uphill finish. Stage 10 is one for the sprinters. Stage 11 though – that’s going to be amazing.</p><p>You can argue whether or not Mont Ventoux is part of the Alps (technically it is) but for the purposes of the Tour this year, it’s very much part of the race’s Alpine leg. And on stage 11, the riders will climb the ‘Giant of Provence’ from two sides.</p><p>That’s two big, tough climbs, both of which including the legendary moonscape section at the top. And just as importantly, the stage also features two descents from the top of Ventoux into Malaucène – a very fast descent that could well have a bearing on the outcome of the stage (if not the race overall), particularly given the second descent takes riders right to the line.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/TDF21_PROFILS-ETAPES-SANS-RAVITO_ETP11.jpeg\"></figure><p>This will be an absolute must-watch stage, not just because of the spectacle of two visits to one of the Tour’s great climbs, but because it’s likely to have a real impact on the GC. Don’t miss it.</p></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"936addd9a8f6885fa38ca5af83617ce2672a4d63b980ded65e73d5e4f6f37545","category":"Cycling"}