{"title":"Federal investigators blast Tesla, call for stricter safety standards","link":"https://arstechnica.com/?p=1749436","date":1615649732000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Auto safety —</h4><h2 itemprop=\"description\">NTSB blames NHTSA and Tesla for a deadly 2019 Autopilot crash in Florida.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-668940744-1-800x533.jpg\" alt=\"Trees blur behind a sleek black crossover as it speeds down a highway.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-668940744-1.jpg\" data-height=\"4000\" data-width=\"6000\">Enlarge</a> <span>/</span> A Tesla Model X on a highway.</p></figcaption></figure><p>The National Transportation Safety Board has <a href=\"https://www.regulations.gov/comment/NHTSA-2020-0106-0617\">filed comments</a>&nbsp;blasting the National Highway Traffic Safety Administration for its permissive regulation of driver-assistance systems. The letter was dated February 1 but was only <a href=\"https://www.cnbc.com/2021/03/12/tesla-is-using-customers-to-test-av-tech-on-public-roads-ntsb.html\">spotted</a>&nbsp;by CNBC's Lora Kolodny on Friday. The letter repeatedly calls out Tesla's Autopilot for its lax safety practices and calls on NHTSA to establish minimum standards for the industry.</p><p>The dispute between federal agencies is the result of Congress dividing responsibility for transportation safety among multiple agencies. NHTSA is the main regulator for highway safety: every car and light truck must comply with rules established by NHTSA. NTSB is a separate agency that just does safety investigations. When there's a high-profile highway crash, NTSB investigators travel to the scene to figure out what happened and how to prevent it from happening again. NTSB also does plane crashes and train wrecks, allowing it to apply lessons from one mode of transportation to others.</p><p>This separation of responsibilities has contributed to a culture gap between the agencies. As the agency responsible for writing regulations, NHTSA has to trade safety off against other considerations like economic costs, the lobbying clout of automakers, and the risk of consumer backlash. In contrast, NTSB's rulings are purely advisory, which frees the agency to doggedly advocate strong safety measures.</p><p>Under then-President Donald Trump, NHTSA largely let automakers do what they liked when it came to advanced driver-assistance systems (ADAS) and prototype driverless vehicles. NHTSA has generally waited until safety problems cropped up with ADAS system and dealt with them after the fact. NTSB argues NHTSA should be more proactive, and it put Tesla and Autopilot at the center of its argument.</p><h2>NTSB thinks minimum ADAS safety standards are overdue</h2><p>NTSB thinks NHTSA has been too slow to develop safety standards for driver-assistance systems and too slow to mandate their use in every vehicle.&nbsp;A growing number of cars have automatic emergency braking systems, but these systems are not yet mandatory, and different AEB systems have different capabilities.</p><p>\"It is important that the agency prioritize the development of minimum performance standards for collision-avoidance technologies and require the systems as standard equipment in all new vehicles,\" the NTSB wrote.</p><p>The NTSB also calls for NHTSA to require driver-monitoring systems to ensure drivers are paying attention to the road while driver-assistance systems are active.</p><p>\"Because driver attention is an integral component of lower-level automation systems, a driver-monitoring system must be able to assess whether and to what degree the driver is performing the role of automation supervisor,\" NTSB argued. \"No minimum performance standards exist for the appropriate timing of alerts, the type of alert, or the use of redundant monitoring sensors to ensure driver engagement.\"</p><p>A lot of driver-assistance systems on the road today use steering wheel torque sensors as a crude way to tell if drivers have their hands on the wheel. More recently, some manufacturers have used eye-tracking cameras to monitor driver attention. They are a more effective way to be sure users are actually looking at the road—though some drivers may find them intrusive or annoying.</p><p>Finally, NTSB argues that NHTSA should require automakers to limit use of driver-assistance systems to the type of roads they're designed for. For example, some ADAS systems are designed to only work on limited-access freeways. Yet few cars actually enforce such limitations. Many systems can be activated on roads the systems weren't designed for.</p><h2>NTSB repeatedly singles out Tesla</h2><p>The NTSB mentions Tesla 16 times in the report—far more than any other automaker. This is partly because Tesla vehicles have figured so prominently in the NTSB's work. NTSB says it has investigated six crashes involving driver-assistance or self-driving systems between May 2016 and March 2019. Four of those were fatal. One of these four was the 2018 <a href=\"https://arstechnica.com/cars/2019/11/how-terrible-software-design-decisions-led-to-ubers-deadly-2018-crash/\">death of Elaine Herzberg</a> after she was hit by an Uber self-driving prototype. The other three were Tesla owners who relied too much on Autopilot and it cost them their lives.</p><p>In one section, NTSB points to the <a href=\"https://arstechnica.com/cars/2017/09/ntsb-teslas-autopilot-ux-a-major-role-in-fatal-model-s-crash/\">2016 death</a> of Tesla owner Josh Brown. The Autopilot software on Brown's car failed to recognize a semi trailer crossing in front of the vehicle. Brown's Model S slid under the trailer, shearing off the top of the car and killing Brown instantly.</p><p>In its report on the crash, NTSB noted that, at the time of the crash, Autopilot software was only designed for use on controlled-access freeways—not rural highways where cars and trucks can enter the highway directly from driveways and side streets. NTSB pointed out that its report on the Brown crash \"recommended that NHTSA develop a method to verify\" that companies selling driver-assistance systems like Autopilot have safeguards to prevent customers from using the systems on roads they aren't designed for. Such a system might have prevented&nbsp;Brown from activating Autopilot on the day of his death.</p><p>NHTSA didn't follow the NTSB's suggestion. In its February letter, NTSB doesn't let NHTSA forget it: NTSB suggests that this policy choice may have led to another deadly crash.</p><p>\"In March 2019, because of Tesla's lack of appropriate safeguards and NHTSA's inaction, another fatal crash occurred in Delray Beach, Florida, under circumstances very similar\" to Brown's death, the agency wrote. And NTSB worries that lax rules could lead to more deaths in the future.</p><p>\"The NTSB remains concerned about NHTSA's continued failure to recognize the importance of ensuring that acceptable safeguards are in place so the vehicles do not operate outside of their operational design domains and beyond the capabilities of their system designs,\" the agency wrote. \"Because NHTSA has put in place no requirements, manufacturers can operate and test vehicles virtually anywhere, even if the location exceeds the AV control system's limitations.\"</p><p>NTSB then called out Tesla again, specifically criticizing the decision to release its \"full self-driving beta\" software to a few dozen customers.</p><p>\"Tesla recently released a beta version of its Level 2 Autopilot system, described as having full self-driving capability,\" NTSB wrote. \"By releasing the system, Tesla is testing on public roads a highly automated AV technology but with limited oversight and reporting requirements.\"</p><p>Since the NTSB letter, Elon Musk has announced plans to&nbsp;<a href=\"https://www.theverge.com/2021/3/7/22318155/elon-musk-tesla-expanding-full-self-driving-beta#:~:text=Tesla%20is%20expanding%20its%20%E2%80%9CFull,the%20number%20of%20participants%20tenfold.&amp;text=He%20said%20Saturday%20that%20Tesla,to%20high%20levels%20of%20demand.%E2%80%9D\">expand</a>&nbsp;the FSD beta to more customers.</p><p>The NTSB letter came at a crucial time—just as President Joe Biden was staffing the senior positions at NHTSA and the broader Department of Transportation. Under Donald Trump, NHTSA took a strongly hands-off posture toward regulation of driver-assistance systems and self-driving technology. It seems likely that the Biden team will do more in this area, but it remains to be seen how aggressive they will be.</p></div></div>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9384ab19de03bb2d64fe7548999f6096fee21b800fd1e73f189310035aaa41be","category":"Tech"}