{"title":"Jeep asked to change name of its SUV by the Cherokee Nation","link":"https://arstechnica.com/?p=1744465","date":1614095979000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>time for a change —</h4><h2 itemprop=\"description\">The Jeep Cherokee name \"does not honor us,\" says Cherokee Nation Chief Hoskin.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/JP021_008CHts2nnihh2n2rsg1rrkfeabtvir-800x533.jpg\" alt=\"The SUV currently known as a Jeep Cherokee. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/JP021_008CHts2nnihh2n2rsg1rrkfeabtvir.jpg\" data-height=\"2000\" data-width=\"3000\">Enlarge</a> <span>/</span> The SUV currently known as a Jeep Cherokee.</p><p>Jeep</p></figcaption></figure><p>It's time for Jeep to reconsider calling its SUVs \"the Cherokee\" and \"Grand Cherokee,\" says Cherokee Nation Chief Chuck Hoskin, Jr. This marks the first time the Cherokee Nation has directly asked Jeep to stop using its name for vehicles, something the brand has done for the past 45 years.</p><p>Although the Cherokee Nation has commented on the name in the past, this time, the debate was <a href=\"https://www.caranddriver.com/news/a35568468/cherokee-nation-jeep-stop-using-name/\">reignited by Car and Driver</a>, which reached out to Chief Hoskin for comment on the topic.</p><blockquote><p>\"I'm sure this comes from a place that is well-intended, but it does not honor us by having our name plastered on the side of a car. The best way to honor us is to learn about our sovereign government, our role in this country, our history, culture, and language and have meaningful dialogue with federally recognized tribes on cultural appropriateness. I think we're in a day and age in this country where it’s time for both corporations and team sports to retire the use of Native American names, images and mascots from their products, team jerseys, and sports in general,\" he told the publication.</p></blockquote><p>The first Jeep Cherokee arrived in model year 1974, and although the nameplate was retired in favor of the Jeep Liberty between 2002 and 2014, Jeep continued to sell a Grand Cherokee model throughout that time. In fact, the Grand Cherokee is Jeep's best seller, with nearly 210,000 finding homes in the US in 2020.</p><p>As Ars has previously covered, <a href=\"https://arstechnica.com/tech-policy/2017/06/supreme-court-rules-offensive-trademarks-must-be-allowed/\">in 2017 the US Supreme Court ruled that offensive trademarks are A-OK under American law</a>. But 2020 saw a renewed awareness of racial justice in the US. The Washington, DC-area NFL team <a href=\"https://www.washingtonpost.com/sports/2020/07/13/redskins-change-name-announcement/\">finally stopped using its offensive name that July</a>, and in December,&nbsp;<a href=\"https://www.nytimes.com/2020/12/13/sports/baseball/cleveland-indians-baseball-name-change.html\">Cleveland's MLB team binned</a> both its name and racist mascot.</p><p>For its part, Jeep—<a href=\"https://arstechnica.com/cars/2021/01/the-fiat-chrysler-peugeot-merger-gets-the-ok-from-shareholders/\">now part of Stellantis</a>—told Car and Driver that \"our vehicle names have been carefully chosen and nurtured over the years to honor and celebrate Native American people for their nobility, prowess, and pride. We are, more than ever, committed to a respectful and open dialogue with Cherokee Nation Principal Chief Chuck Hoskin, Jr.\"</p></div></div></div>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9436fa9d289373f6a4238c6f9af258af43a1dd5ae1afe259b681ea10dd706c09","category":"Tech"}