{"title":"Lezyne Micro Drive Pro 800XL front light review","link":"https://www.cyclist.co.uk/lezyne/9161/lezyne-micro-drive-pro-800xl-front-light-review","date":1611656392000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Great design is worthless if the product doesn’t do the job it sets out to. Thankfully, the Lezyne Micro Drive Pro 800XL front light manages to combine the two qualities, presenting the year-round road rider with a very keenly priced, easily operated option for lighting the road ahead – or simply being seen.</p>&nbsp;<h3>Strap yourselves down</h3><p>The ease with which the Lezyne Micro Drive Pro 800XL is fitted to most bikes it a welcome surprise, with just the rotation of the head unit on its fixed mount needed in order to extend the very stretchy rubber strap around the thickest portion of any rounded-top bar tops (it might be particularly malleable but it’s not going to reach all the way round an aero bar top).</p>&nbsp;<h3>Charging the light brigade</h3><p>Of course, given that it’s a fixed mount, you will need to remove the whole contraption from your bike in order to charge it, unless you use your own micro-USB cable; the charging cable provided is barely 30cm long.</p><p><a href=\"https://www.leisurelakesbikes.com/accessories/lights/lezyne-micro-drive-pro-800xl-front-light-black-hi-gloss__327445\" target=\"_blank\"><em><strong>Buy the Lezyne Micro Drive Pro 800XL front light from Leisure Lakes Bikes now</strong></em></a></p><p>And, since the 800-lumen full power output mode gives only 90 minutes (as opposed to the claimed 105 minutes) of use, if you’re employing the Lezyne Micro Drive Pro 800XL for night rides, you’d better make sure they’re not <em>all</em> night.</p>&nbsp;<h3>A la mode</h3><p>As is the fashion when it comes to front lights, the Lezyne Micro Drive Pro 800XL features a literally dazzling array of modes, ranging from the practically pointless 15 lumens ‘femto’ option, which emits a steady light akin to holding a candle in front of your handlebars, all the way up to the alarmingly good 800 lumens ‘overdrive’.</p><p>I’ve settled on ‘enduro’ for the majority of rides, as a suit-all approach to both day and night cycling. With a constant 250 lumens output, it certainly allows you to be seen while amply illuminating the road ahead.</p><p>It gives five and a half hours of lighting, too, making it a decent trade-off between battery usage and light provision. However, when the going gets dark and rural, there’s no substitute for the overdrive mode.</p>&nbsp;<h3>On rotation</h3><p>One of the simple pleasures of the Lezyne Micro Drive Pro 800XL is that these modes are so easy to toggle through, even when wearing full winter gloves, thanks to the tactile rubberised button atop the unit.</p><p>I don’t see the need for so many modes, though, and this does mean you’re potentially seven presses of that button away from the next mode you’ll need.</p><p><a href=\"https://www.leisurelakesbikes.com/accessories/lights/lezyne-micro-drive-pro-800xl-front-light-black-hi-gloss__327445\" target=\"_blank\"><em><strong>Buy the Lezyne Micro Drive Pro 800XL front light from Leisure Lakes Bikes now</strong></em></a></p><p>Talking of rotation, the other practical bonus of the setup is that it’s easily adjusted on the fly. If you find you’re not illuminating as much of the roadside as you thought you were when you left the house, you can simply swivel the unit to angle the wide beam accordingly.</p><p>And, if you find you’re getting more than your fair share of flashes from oncoming traffic, the rubber strap – although secure and well damped in normal use – allows you to angle the whole unit downwards to keep from blinding other commuters.</p>&nbsp;<h3>Built to last</h3><p>The stylish Lezyne Micro Drive Pro 800XL is fabricated from CNC-machined alloy, and gives the impression it would survive some serious abuse.</p><p>I’d certainly back it to bounce back from any kind of collision or garage floor mishap that would otherwise crack a plastic-cased front light.</p><p>Considering its £60 price tag, it’s punching well above its weight in the rechargeable front light market. Slim down the mode options, and this truly would be the light at the end of the tunnel for anyone blinded by the current choice of high-power headlights.</p><p><a href=\"https://www.cyclist.co.uk/cyclist-reviews-policy\" target=\"_blank\"><em>All reviews are fully independent and no payments have been made by companies featured in reviews</em></a></p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"9437e657159035fe2dd55a43c6651e521ba5f6bb81fca748852d0cdad25ab1f2","category":"Cycling"}