{"title":"Microsoft begins removing paid Xbox Live requirement for free-to-play games","link":"https://arstechnica.com/?p=1752198","date":1616702017000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>truly free to play —</h4><h2 itemprop=\"description\">Move will bring Xbox in line with PlayStation and Switch's online subscriptions.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/03/xbl-640x360.jpg\" alt=\"Xbox Live gamers will soon have a new reason to rejoice.\"><figcaption><p>Xbox Live gamers will soon have a new reason to rejoice.</p></figcaption></figure><p>Xbox owners soon won't need to pay for an Xbox Live Gold subscription to enjoy otherwise free-to-play games on their consoles. <a href=\"https://news.xbox.com/en-us/2021/03/24/xbox-insider-release-notes-alpha-2104-210323-0000/\">Wednesday's update</a> to the Xbox Alpha Insiders Update Preview program (version 2104.210323-0000) notes that \"Multiplayer in Free-to-play games, Looking 4 Groups and Party Chat on Xbox no longer requires an Xbox Live Gold membership.\" These features are being tested with Insiders \"ahead of general availability,\" according to the update.</p><p>Microsoft first announced this move <a href=\"https://arstechnica.com/gaming/2021/01/xbox-live-price-increase-sets-a-new-10-month-floor-for-online-access/\">back in January</a> as the company was busy rolling back a controversial planned increase in Xbox Live Gold prices. Back then, Microsoft said the free-to-play change was coming \"as soon as possible in the coming months,\" but the rollout to Insiders suggests it will be reaching all Xbox players imminently.</p><p>Microsoft's decision here brings the service in line with its major console competitors. When Sony <a href=\"https://blog.playstation.com/2013/10/30/ps4-the-ultimate-faq-north-america/#sect8\">started charging for multiplayer gameplay on PlayStation Network in 2014</a>, it included a specific carve-out for \"a selection of free-to-play multiplayer titles [that] will be available without a PS Plus membership.\" Nintendo included a similar carve-out for free-to-play titles like <a href=\"https://arstechnica.com/tag/fortnite/\"><em>Fortnite</em></a> when it <a href=\"https://arstechnica.com/gaming/2018/09/nintendos-first-ever-paid-online-service-launches-on-switch-sept-18/\">started charging for its Switch Online service in 2018</a>.</p><p>But Microsoft has required a paid Xbox Live Gold subscription for access to console multiplayer games since the days of the Xbox 360. In fact, users needed an Xbox Live Gold subscription to access streaming media apps like Netflix and Hulu on Xbox consoles (on top of the subscription fees for those services) <a href=\"https://www.extremetech.com/gaming/182310-desperate-microsoft-finally-removes-xbox-live-gold-paywall-for-netflix-hulu\">until 2014</a>.</p><p>Back in July, Microsoft <a href=\"https://arstechnica.com/gaming/2020/07/retail-listing-points-to-free-to-play-multiplayer-for-halo-infinite/\">announced</a> that the upcoming <a href=\"https://arstechnica.com/gaming/2020/07/we-should-talk-about-halo-infinites-not-quite-next-gen-premiere/\"><em>Halo Infinite</em></a> would include a free-to-play multiplayer component in addition to the standard, paid single-player campaign. But in August, the company <a href=\"https://www.theverge.com/2020/8/5/21355756/microsoft-xbox-live-rename-gold-free-rumors\">swatted down rumors</a> that it was getting rid of Xbox Live Gold or making the service free. \"We have no plans to discontinue Xbox Live Gold at this time,\" the company said. \"It is an important part of gaming on Xbox today and will continue to be in the future.\"</p><p>Still, the basic $5/month Xbox Live Gold online service has seemed like less of a focus for Microsoft in recent years, eclipsed by Xbox Game Pass and its massive selection of downloadable and streaming games. <a href=\"https://arstechnica.com/gaming/2019/06/psa-upgrade-three-years-of-xbox-live-to-game-pass-ultimate-for-just-1/\">Since 2019</a>, Microsoft has <a href=\"https://arstechnica.com/staff/2019/09/dealmaster-you-can-still-convert-3-years-of-xbox-live-to-game-pass-ultimate-for-1/\">periodically</a> offered to let users convert up to three years of Xbox Live Gold subscription time to Xbox Game Pass Ultimate (which also includes all the features for Xbox Live Gold) for just $1. That suggests Microsoft is eager to get current Xbox Live subscribers on board with the more expansive $15/month Game Pass Ultimate plan in the long term.</p></div></div>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"94ccfd78b2487144a6348024ad8c5bed2b5094147687f6a89deceff9e66c6231","category":"Tech"}