{"title":"10 products I loved in 2021: Matt de Neef","link":"https://cyclingtips.com/2021/12/10-products-i-loved-in-2021-matt-de-neef/","date":1639352882000,"content":"<div><div><p>Here at CyclingTips we’ve been publishing “10 products I loved” end-of-year wrap-up articles since 2017, but this is the first time I’ve thrown my hat in the ring. That’s partly because I don’t review much new tech as part of my role, but I’m also not one to go out and buy much new bike gear myself. As my colleagues will confirm (likely with a disappointed shake of the head) I’ve more or less ridden the same bike, with the same shoes and same helmet, for the past few years. “If it ain’t broke …” and all that.</p><p>But this year I actually found my cycling habits changing a bit and as a result I actually felt like I had something to share with one of these posts. So here goes: my first crack at a “10 products I loved” article. Be nice.</p><hr><h2>Panaracer GravelKing 28 mm tyres</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/IMG_2045-1340x1005.jpg\"></figure><p>I bought a Cannondale Synapse a few years back after <a href=\"https://cyclingtips.com/2017/07/cannondale-synapse-hi-mod-red-etap-2018-first-ride-review/\" target=\"_blank\">reviewing one in Italy for CT</a> (those were the days – when travel was a thing that people did). But after buying the bike I never really rode it as much as I should have. It’s noticeably heavier than my CAAD10 so whenever I’d head out for a climby ride – most of my rides – I’d usually just reach for my CAAD.</p><p>But earlier this year I finally decided it was time to spend more time riding the Synapse. To do that, I’d turn it into a pseudo-gravel bike, great for hitting up the many gravel tracks and roads near me. When he heard of my plan, my colleague <a href=\"https://cyclingtips.com/2021/12/10-products-i-loved-in-2021-iain-treloar/\" target=\"_blank\">Iain Treloar</a> was good enough to give me a pair of old GravelKings he wasn’t using, and that was basically it.</p><p>The GravelKings have been amazing. They’ve inspired me to explore more, to ride more gravel, and, as planned, to ride the Synapse more, which I’ve loved. The tyres were a tiny bit worn when I got them, but they’ve held up wonderfully despite the fact I’ve ridden them in places they were absolutely not meant to be ridden.</p><p>I’ve always enjoyed a bit of underbiking (<a href=\"https://youtu.be/gBcG-5C1v9o?t=134\" target=\"_blank\">I blame my colleague Andy van Bergen for that</a>) and these tyres have allowed me plenty of that. I’m talking 20%-gradient descents on loose, rutted-out fire access tracks, with rocks twice as thick as the tyres. Gnarly stuff.</p><p>Despite this sort of punishment, I’m yet to get a single flat. When the tyres finally do pack it in, I’ll be getting some more, probably in a 32 mm width.</p><p>(An honourable mention should also go to the <a href=\"https://eu.ritcheylogic.com/eu_en/bike/wheels/wcs-zeta-disc-wheels\" target=\"_blank\">Ritchey Zeta WCS Disc wheels</a> the GravelKings have been mounted on. They’ve also proven bombproof and I’ve been impressed so far. Thanks <a href=\"https://cyclingtips.com/2021/11/10-products-i-loved-in-2021-dave-rome/\" target=\"_blank\">Davey Dome</a> for the hook-up.)</p><p><strong>Price: </strong>US$50 / AU$64 per tyre<br><strong>More information:</strong> <a href=\"https://www.panaracerusa.com/collections/gravel/products/gravelking-slick-folding-gravel-tires?variant=34825709355170\" target=\"_blank\">Panaracerusa.com</a> </p><h2>Wandrer.earth</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/Screen-Shot-2021-03-22-at-2.05.12-pm.png\"></figure><p>Speaking of exploration and riding off the beaten track, 2021 has really been <a href=\"https://cyclingtips.com/2021/03/the-app-that-adds-adventure-to-your-everyday-cycling/\" target=\"_blank\">the year of Wandrer</a> for me. In the numerous lockdowns Melbourne has endured, Wandrer has been a godsend, helping me find new places to ride, and rewarding me with points when I do so. I’m a sucker for a bit of gamification in my riding, and if that means exploring a bunch more, I’m in.</p><p>Thanks to Wandrer, I’ve had plenty of rides this year feature at least a little bit of hike-a-bike up some unrideable rocky wall, but those moments always felt like an adventure rather than a drag. Thanks to Wandrer I’ve also had a bunch of spirited battles with other riders this year, trying to see who could ride the most unique kilometres in a given area in one month (and therefore earn bonus Wandrer points). It’s been great.</p><p>In short, if you like exploring by bike, and you haven’t checked out Wandrer yet, you really should.</p><p><strong>Price: </strong>Free to get started with a handful of Strava activities; US$30 per year for full access.<br><strong>More information:</strong> <a href=\"https://wandrer.earth/\" target=\"_blank\">Wandrer.earth</a></p><h2>Strava Routes</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/Screen-Shot-2021-12-08-at-1.41.42-pm-1340x757.jpg\"><figcaption>The Wandrer overlay in Strava Routes, showing where I haven’t ridden.</figcaption></figure><p>There’s a bunch of ways you can design routes for your rides, but Strava Routes has been my go-to this year, especially when I’ve used Wandrer. It’s sleek and well designed, but I particularly love that there’s a Wandrer Overlay plugin for Google Chrome that shows, in Strava Routes, which roads (or gnarly gravel tracks) in a given area you have and haven’t ridden. It’s perfect for designing a ride to maximise your Wandrer points! (Note: the overlay works in other route builders too, like Ride With GPS).</p><p>I also love that the routes I create in Strava Routes on my computer are available on the smartphone app. All year I’ve been creating routes in Strava Routes, then opening them up on my phone to follow when I head out and ride.</p><p><strong>Price: </strong>Free with a Strava account.<br><strong>More information:</strong> <a href=\"https://www.strava.com/routes/new\" target=\"_blank\">Strava.com/routes</a></p><h2>Quad Lock phone mounts</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/IMG_9759.jpg\"></figure><p>I always knew <a href=\"https://cyclingtips.com/2020/10/quad-lock-mobile-phone-mount-review-solid-and-secure/\" target=\"_blank\">Quad Lock</a> made great mounts, but it was in 2021 that I got the chance to really test them for myself. I got my hands on a couple mounts for <a href=\"https://cyclingtips.com/2021/03/the-app-that-adds-adventure-to-your-everyday-cycling/\" target=\"_blank\">a piece I was writing about Wandrer</a> and put one on my CAAD and one on my Synapse. They’re both still there and I use them every ride.</p><p>Just having my iPhone 12 out front gives me so much more screen real estate to play with than any cycling GPS would. And given I’m looking at Strava Routes quite frequently – and often trying to find small roads I haven’t taken before – that larger screen is a real boon.</p><p>The mounts are easy to set up, rock solid once they’re installed, and getting the phone in and out is a breeze. I particularly like the outfront mount – I find the tab that disengages the phone to be much nicer than the equivalent mechanism on the stem mount.</p><p><strong>Price: </strong>From AU$70 for full kit (phone case and mount).<br><strong>More information:</strong> <a href=\"https://www.quadlockcase.com.au/\" target=\"_blank\">QuadLockcase.com.au</a></p><h2>Garmin Forerunner 920XT sports watch</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/920XT-4.jpg\"><figcaption>Image: Matt Wikstrom</figcaption></figure><p>You might have noticed that quite a few CT staff have sport watches on their <a href=\"https://cyclingtips.com/tag/most-loved-2021/\" target=\"_blank\">“10 products I loved in 2021” list</a>. I’m not quite sure what to make of that. Does it herald a trend in the cycling scene more broadly? Who knows. Either way, I too have a multi-sport watch on my list this year.</p><p>I’ve had the Forerunner 920XT since 2015 and ever since then I’ve used it whenever I go running (or sometimes even swimming). I occasionally used it for cycling in the past, but ever since my Lezyne GPS packed up after I did an Everesting in February (a form of protest, I assume), I’ve used the Forerunner watch almost exclusively when riding (bar the occasional short ride recorded with my phone).</p><p>Why? It’s probably a convenience thing. I couldn’t be bothered paying for a new GPS after the Lezyne died, and I already had the watch. I started using the watch, and it proved more than fine for my needs. And given my phone was doing a better job of mapping than any GPS would, and I had the QuadLock mounts, <em>and</em> I didn’t feel a burning desire to be staring at data all ride long, it made sense to keep the watch as my recording device of choice.</p><p>It captures everything I need it to – power data when I’m riding my CAAD, heartrate data when I’m riding or running, and overall it’s just been very solid. And given I’m doing a bunch of running these days I like that I only need one device to track whatever exercise I’m doing. Honestly, I can’t see myself buying a new cycling GPS anytime soon.</p><p><strong>Price: </strong>Seems to be discontinued (<a href=\"https://www.garmin.com/en-AU/p/621922\" target=\"_blank\">Forerunner 945</a> is the current model).<br><strong>More information:</strong> <a href=\"https://www.garmin.com/en-AU/p/137024\" target=\"_blank\">Garmin.com</a></p><h2>Bontrager Aeolus Comp saddle</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/IMG_2056-1340x894.jpg\"></figure><p>It was in 2020 that I first got my backside on an Aeolus Comp, but it was this year that I became really impressed with it. Enough that when I was turning my Synapse into a gravel-going bike, and I wanted a new saddle, the Aeolus Comp was a no-brainer.</p><p>I won’t really ride anything without a cut-out these days and the Aeolus Comp’s cutout is massive. So that’s a tick. The short-nose design works well for me, and the saddle is also the perfect mix of just soft enough, without being too spongy. Plus, at around AU$120, the price seems pretty reasonable to me. I’m a fan.</p><p><strong>Price: </strong>AU$120 / US$90<br><strong>More information:</strong> <a href=\"https://www.trekbikes.com/au/en_AU/equipment/cycling-components/bike-saddles/aero-and-tt-bike-saddles/bontrager-aeolus-comp-bike-saddle/p/27101/\" target=\"_blank\">Trekbikes.com.au</a></p><h2>Cyclone Invisigrip Tough Gardening Gloves</h2><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/IMG_1852-1340x894.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/IMG_2064-1340x894.jpg\"></figure></li></ul></div></figure><p>Earlier this year I was looking for some new, full-finger gloves for chilly winter morning rides and I figured I’d try something a bit different. Rather than spending $30 or more on proper cycling gloves, I decided to try out a cheaper option from Bunnings Warehouse, Australia’s biggest home hardware chain. They’ve been nothing short of excellent.</p><p>They’re not waterproof (but few gloves truly are, right?), and they don’t do <em>all</em> that much on super-frigid days. But on those cool mornings where you just need something to take away the chill, these have been perfect.</p><p>They’ve got mesh on the back of the hands, which make them nice and breathable, and the rubberised surface on the palm makes these super grippy, which I love. But my favourite feature is how stretchy these are and how well they conform to the hand. Pulling them on always just feels nice.</p><p>For $8, these are steal.</p><p><strong>Price: </strong>AU$7.98<br><strong>More information:</strong> <a href=\"https://www.bunnings.com.au/cyclone-invisigrip-tough-gardening-gloves-large_p2970731\" target=\"_blank\">Bunnings.com.au</a></p><h2>Earshots headphones</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/earshots-headphones-1.jpg\"></figure><p>I tested a few different headphones in 2021, but the <a href=\"https://cyclingtips.com/2021/04/spotlight-earshots-magnetic-bluetooth-headphones/\" target=\"_blank\">Earshots</a> out of New Zealand have become my go-to. They just do everything I need them to.</p><p>They’re easy to connect to my phone with Bluetooth, the magnets keep them attached to my ears really nicely, and they’re comfortable. I like that they’re designed to allow some road noise in too, which makes me feel like I’m not sacrificing spatial awareness, even if it does mean I often have to pause the headphones whenever I’m descending (assuming I actually want to hear what I’m listening to).</p><p>As I wrote in <a href=\"https://cyclingtips.com/2021/04/spotlight-earshots-magnetic-bluetooth-headphones/\" target=\"_blank\">my review</a>, I find the pause/play button to be a little too firm, and the audio quality isn’t <em>amazing</em> if you’re listening to music, but overall these are great. There’s a new version in the works too. I’m excited to check them out when they land.</p><p><strong>Price: </strong>NZ$169.75 / AU$159 / US$122 / €103 (free shipping in New Zealand; NZ$10 flat rate shipping internationally)<br><strong>More information:</strong> <a href=\"https://earshots.com/#home\" target=\"_blank\">earshots.com</a></p><h2>Limited Resources podcast</h2><figure><p></p></figure><p>Cycling hasn’t just been a great escape throughout another tough year (thanks COVID), it’s also been the only time I’ve listened to podcasts. My colleagues here at CT make <a href=\"https://cyclingtips.com/category/podcasts/\" target=\"_blank\">some excellent podcasts</a> that are absolutely worth your time, but personally, I tend to spend more of my rides listening to shows about my other hobbies.</p><p>Sometimes I’m listening to music-related podcasts, like Song Exploder or the recent <a href=\"https://open.spotify.com/show/73Ed659YIeD2ehM3gw1Nf7\" target=\"_blank\">Daniel Johns podcast</a> (oh look, a gratuitous link to <a href=\"https://soundcloud.com/mattdeneef\" target=\"_blank\">some music <em>I’ve</em> made</a>), but most of the time I’m listening to podcasts about <a href=\"https://www.youtube.com/watch?v=RZyXU1L3JXk\" target=\"_blank\">Magic: The Gathering</a> – the best collectible card game ever made.</p><p>For those that aren’t familiar, it’s frightfully nerdy – dragons, knights, combat, a lot of maths – I love it. It’s a game that’s relatively easy to get into, but incredibly hard to master, and I really love the mental stimulation it provides. And that’s to say nothing of the game’s social joys (playing with mates or in local tournaments) and the creativity it inspires (building and tweaking decks).</p><p><a href=\"https://lrcast.com/\" target=\"_blank\">Limited Resources</a> is one of the biggest and best podcasts about Magic: The Gathering. I’ve spent many an afternoon this year out on the bike, riding quiet local roads, listening to a new episode of LR. I imagine I’ll be doing the same for quite some time to come.</p><p><strong>Price: </strong>Free (or a couple bucks a month to support it via Patreon).<br><strong>More information: </strong><a href=\"http://lrcast.com/\" target=\"_blank\">LRcast.com</a></p><h2>My Everesting book</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/everesting-cover-1340x1034.jpg\"></figure><p>I couldn’t not include this. Throughout last year and into early 2021 I wrote my first book. It’s all about <a href=\"https://cyclingtips.com/tag/everesting\" target=\"_blank\">Everesting</a> – where it came from, how it grew, what’s involved in doing one, and much more.</p><p>Do I think you’ll enjoy reading it? I do. Do I think it’ll make for a great Christmas present for the cyclist in your life (or for yourself)? Yep, that too. But it’s not on my list for those reasons.</p><p>For me, getting this book in my hands after more than a year spent working on it was easily one of the highlights of my year. Writing a book is such a lengthy process, and one that occurs almost entirely on a screen. To finally hold the book in real life, to flick through it, to see how well it turned out – I’m very proud.</p><p><strong>Price: </strong>AU$29 (hardback); AU$11 (e-book)<br><strong>More information:</strong> <a href=\"https://smarturl.it/everesting\">Amazon</a> (or better still, your local bookshop).</p></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"954a7cc21ee7bac89c95455075c9cc303c6ebfa70879970e32d5767424a7acef","category":"Cycling"}