{"title":"Jakobsen sprints to victory on stage 4 of the Vuelta a España","link":"https://cyclingtips.com/2021/08/jakobsen-sprints-to-victory-on-stage-4-of-the-vuelta-a-espana/","date":1629216482000,"content":"<div><div><p>A little over a year after the scary crash at the Tour of Poland that left him seriously injured, Fabio Jakobsen (Deceuninck-QuickStep) won Tuesday’s stage 4 of the Vuelta a España. The 24-year-old Dutchman timed his sprint to perfection in an uphill kick in Molina de Aragón, surging past Arnaud Démare (Groupama-FDJ) inside the closing meters to take the victory.</p><p>With no categorized climbs on the profile of the 163.9 km stage from El Burgo de Osma, the sprinters’ teams worked to keep the early breakaway’s advantage manageable. The gap topped out at around five minutes before the pack gradually reeled the escapees back in, and the catch was made with around 13 km to go.</p><p>A number of teams took to the front to push the pace inside the last few kilometers, while midway back in the peloton, race leader Rein Taaramaë hit the deck with around 2 km to go. He remounted quickly and headed for the finish with a teammate, and as the crash occurred inside the last 3 km of the stage, he was ultimately given the same finishing time as the bunch.</p><p>Groupama-FDJ led the way into the last 500 meters, and then Sacha Modolo (Alpecin-Fenix) surged past the team in a long-range push for the line. He led into the last 200 meters but then was swarmed by the hard-charging sprinters, with Démare leading the way. Jakobsen, however, was on the Frenchman’s wheel. He pulled past inside the last hundred meters and took a convincing victory at the line. Démare settled for second with Magnus Cort Nielsen (EF Education-Nippo) taking third on the day.</p><div><div><p>La Vuelta ciclista a España (2.UWT) <span>El Burgo de Osma → Molina de Aragón</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/df/fabio-jakobsen-2021.jpeg\"></p></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"95c9afc3c0391e85c427e24694a987bcd5cece5919ac34cbe2f5489125575a32","category":"Cycling"}