{"title":"Specialized Torch 3.0 cycling shoes review","link":"https://www.cyclist.co.uk/specialized/9226/specialized-torch-30-cycling-shoes-review","date":1612888425000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>At £220 the Specialized Torch 3.0 shoes are hardly cheap. But in a range of Specialized road shoes going up to £450, they’re a half-price bargain.</p><p>The Torch shoe range runs from the £95 Torch 1.0 <a href=\"https://www.cyclist.co.uk/reviews/7690/specialized-torch-20-cycling-shoes-review\">via the £165 Torch 2.0</a> up to these Torch 3.0 cycling shoes. Even the Torch 1.0 now gets a Boa closure and the Torch 3.0 ups that to two per shoe.</p>&nbsp;<p>That makes for precise adjustability of the hold over the top of the foot and the mid-foot, with each pair of wires crossing the top of the shoe once and sliding through an anchor on the other side of the shoe. There’s a third Velcro strap closure at the forefoot, but as is often the case, this doesn’t add much to adjustability.</p><p>The upper has a quality feel to it, with bonded rather than sewn seams, different materials used in different areas to reinforce or add ventilation and plenty of venting holes across the forefoot and mid-foot.</p><p><a href=\"https://www.tredz.co.uk/.Specialized-Torch-3-0-Road-Shoes_113967.htm\" target=\"_blank\"><em><strong>Buy the Specialized Torch 3.0 shoes now from Tredz</strong></em></a></p><p>It’s quite stiff though. Whereas the trend is to softer woven uppers, the Torch 3.0’s don’t have much give in them. Despite this, they’re comfortable and I didn’t find any hotspots or rubbing as I rode.</p>&nbsp;<p>I needed to position the tongue carefully though to prevent it being uncomfortable where it met the toe box. On one ride, that meant stopping to adjust it after a couple of miles as it was digging into my foot. Getting in and out of the shoes is slightly tricky too, needing the Boas to be backed off significantly to slip the foot in place.</p><p>Specialized rates the Torch 3.0’s carbon sole as stiffness 8.5 on its scale that goes up to 15. What does that mean? I could bend the sole slightly over my knee, but for actually riding it felt plenty stiff enough. A pair of ribs under the midfoot help to keep the sole from twisting.</p>&nbsp;<p>There’s a mesh vent in the sole under the toes, but otherwise it’s fully enclosed. Specialized adds heel and toe bumpers to protect the sole unit, although they’re not replaceable.</p><p>The rigidity of the uppers and soles is likely to be good for power delivery in warmer conditions, but without wriggle room I found that my feet tended to get a little cold riding in the winter even under overshoes.</p><p>Specialized’s footwear majors on its Body Geometry system. This slopes the sole slightly lower on the outside than the inside edge and includes a pronounced bump in the insole to help splay the bones in your midfoot. It says that these features improve leg alignment and improve pedalling efficiency.</p><p><a href=\"https://www.tredz.co.uk/.Specialized-Torch-3-0-Road-Shoes_113967.htm\" target=\"_blank\"><em><strong>Buy the Specialized Torch 3.0 shoes now from Tredz</strong></em></a></p><p>Coming from shoes without these features, the tendons in the back of my knee felt a little sore on my first few rides. But this soon stopped and the foot alignment did feel more natural and comfortable in the Torch 3.0 shoes.</p><p>At 536g a pair in size 42.5, the Specialized Torch 3.0 cycling shoes are pretty much on the mark weight-wise for their price. Yes, you can pay a lot more for flashier, lighter footwear, but the Torch 3.0 shoes work well and their construction suggests they should be durable.</p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"96e1ee8faf75b4648f7006f6550157947d35eb5d3237f589ec0ab06240814d22","category":"Cycling"}