{"title":"Sarah Roy solos to Australian road race title","link":"https://cyclingtips.com/2021/02/sarah-roy-solos-to-australian-road-race-title/","date":1612659789000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>BUNINYONG, Australia (CT) – Sarah Roy (BikeExchange) will wear the green and gold bands for the next 12 months after riding to a strong solo victory at the Australian Road National Championships.</p><p>Roy had been part of an early break that splintered as the day went on, leaving the 34-year-old to ride the last 30 km of the race on her own. Grace Brown (BikeExchange) took the silver medal following an impressive late surge, while Lauretta Hanson (Trek-Segafredo) took bronze from the same early break as Roy.</p><p>“I just didn’t expect this today,” Roy said. “I didn’t come here to do this. It wasn’t my plan. I had no consideration of this whatsoever,” she added, laughing. “But I think that’s what makes it more exciting and makes you more emotional.</p><p>“I think although the course … people don’t think it suits me, I think it can suit me if I’m really in good shape for it. And I wasn’t today! To win when you’re not in awesome form is just mind-blowing.”</p><p>On a cold and drizzly morning Roy made her way into a strong early break of six riders. Roy, Hanson, 2015 champion Peta Mullens (Roxsolt Liv SRAM), Matilda Raynolds (Specialized Women’s Racing), Georgia Baker, and Kathryn McInerney got clear on the first of nine ascents of Mt. Buninyong, building a lead that grew to more than four minutes as the laps ticked by.</p><figure><p><iframe title=\"2021 Australia Road National Champions - Women's Elite Highlights\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Qn2TJt5vxQ8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></p></figure><p>It was a powerful group, but looking around, Roy realised that not all of her companions were at full strength. Raynolds, Mullens and Baker all appeared to be suffering after crashing earlier in the week.</p><p>“I had a look around and there was some good, strong, riders, a lot of sprinters,” Roy said. “I think a few of them were struggling a little bit with previous injuries from the crashes in the criterium a few days ago. So I didn’t feel confident that they’d be able to get around the course together.”</p><p>Backing herself, Roy made her first decisive move on the fifth of nine ascents of the Mt. Buninyong climb.</p><p>“When I heard that there was a group of chasers coming across about one and a half minutes behind us, I thought ‘I’m just going to push this out as far as I can’ and I went for it and whoever could come came,” Roy said. “And that was good. And then I just went again after I don’t know when was it about four laps to go or something.”</p><p>When the dust settled in the back half of lap 5, Roy had just Hanson and Raynolds for company. Raynolds was dropped the next time up the climb and Hanson suffered the same fate on lap 7 of nine. With 32 km to go, Roy was on her own and charging to the finish.</p><p>“I felt really strong on the climb today, surprisingly – I haven’t really trained for anything like this,” Roy said. “I’m really happy to just feel like I had some good legs out there and I said ‘I’m just going to give it a go and just be brave.’ Luke Durbridge’s quote of the last couple of weeks has been ‘be brave’. And he said that to me the other day and I thought ‘I’m just going to give it a crack’.”</p><p>Roy faded a little over the last two laps but had enough of a buffer to cross the line more than a minute clear.</p><p>Behind Roy, her teammate Brown was riding her way to the silver medal. Brown attacked from a heavily reduced peloton on the final lap and bridged to a small chase group inside the final 5 km. In that group: Hanson, still riding strongly after being dropped by Roy, plus Amber Pate and Emily Watts, both of whom had attacked a few laps earlier.</p><p>It came down to Brown and Hanson for the silver medal with Brown opening a two-second gap by the finish. Hanson held on for the bronze medal while Pate and Watts took fourth and fifth respectively. Watts’ impressive ride saw her take out the U23 title.</p><p>Pre-race favourite Sarah Gigante (Tibco-SVB) put in numerous surges from the peloton throughout the race but was heavily marked from the outset. She managed to get clear with fellow U23 rider Neve Bradbury (Canyon-SRAM) in the final lap but Bradbury beat her on the line, taking the U23 silver medal. A disappointed Gigante was left to settle for bronze.</p><p>As for Roy, today’s gold medal comes two years after taking bronze medal in the same event. She was part of the winning break that day as well, before Gigante attacked and rode to a solo victory. Today’s win is Roy’s second elite national title on the road after her 2015 criterium title.</p><p>She’ll now head over to Europe where a year in the national champion’s jersey awaits.</p><p><em>Follow the link for full <a href=\"http://grace%20brown%20%28bikeexchange%29%20took%20the%20silver%20medal%20following%20an%20impressive%20late%20surge%2C%20while%20lauretta%20hanson%20%28trek-segafredo%29%20took%20bronze./\" target=\"_blank\" rel=\"noreferrer noopener\">results from the elite and U23 women’s road race</a>.</em></p><figure><img loading=\"lazy\" width=\"536\" height=\"445\" src=\"data:image/image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABAAAAANCAAAAACF0LH4AAAAn0lEQVQI10XBQYKDIAwAwPz/lbUScFtFBQQSEtLjzoD9a7magQ7ujURE5PMKakDP7dzRiYi+oahB7zXg+1JVLadOg1pOXJclE9G9kxpQiyFsrKpaok6Dlnfv8GFmvg9Wg1bj5txfF5F8yjRo9UC3+D7GSDurQa8RcfUnj5HiUIP2RESPB4ukS6ZBzV9061ZK5yuyGvS0B/92uBZNUaf9AAc6xjfBaQ0nAAAAAElFTkSuQmCC\" data-src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-07-at-11.57.38-am.png\" alt=\"\" data-srcset=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-07-at-11.57.38-am.png 536w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-07-at-11.57.38-am-190x158.png 190w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/02/Screen-Shot-2021-02-07-at-11.57.38-am-16x13.png 16w\" sizes=\"(max-width: 536px) 100vw, 536px\"></figure><div><h5>Tags</h5></div></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"98e517e23370ec406fef5220499fba9f3ba99194566256c4407de3a802ed2c6d","category":"Cycling"}