{"title":"João Almeida to join UAE Team Emirates in 2022","link":"https://cyclingtips.com/2021/08/joao-almeida-to-join-uae-team-emirates-in-2022/","date":1628240469000,"content":"<div><div><p>João Almeida has inked a 5-year contract with UAE Team Emirates, starting in 2022. Almeida joins the team that won the 2020 and 2021 Tour de France with impressive palmares, including 15 days in the pink jersey and fourth overall at the 2020 Giro d’Italia and sixth overall at the 2021 Giro d’Italia.</p><p>Almeida has been representing Deceuninck-Quick Step for two seasons, before 2020 he rode for the top WorldTour feeder team in the game Hagens Berman Axeon.</p><p>“I am really looking forward to this new chapter in my career and in my life,” Almeida said in a UAE Team Emirates press release. “I feel like the move to UAE Team Emirates is coming at the right time and I’m sure I will be happy on this new adventure. The team is growing every year and I can’t wait to be a part of it. I am quite a thoughtful person by nature and I find myself already dreaming and visualising about the future and I’m super excited about it.”</p><p>UAE Team Emirates has been bolstering their roster with riders capable of assisting Tadej Pogačar in the Tour de France, and with Almeida’s Grand Tour experience he is a strong addition to the team. The length of Almeida’s contract also shows a lot of belief in the Portuguese rider, and he is not the only rider on such a lengthy contract, Pogačar will ride for UAE Team Emirates through 2027 as well.</p><p>“Almeida is a rider we’ve known for many years since he was a junior and we are delighted to welcome him to UAE Team Emirates,” said Joxean Matxin Fernandez, UAE Team Emirates team manager. “TomJoão is a cyclist of great quality and we have no doubt that he will be a strong pillar in the team. He’s a hugely talented and versatile rider and I’m sure we’ll enjoy many great successes together with him in our squad. Our aim is to strengthen the team year by year and we have full confidence that João will bring great things to the group, both as an athlete and as a person.”</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9997043134745ed3b2dfdee2a7ac8c1b87009d27a6c94a98aab82270fde62791","category":"Cycling"}