{"title":"Kiel Reijnen retiring from road racing to focus on gravel at the end of 2021","link":"https://cyclingtips.com/2021/09/kiel-reijnen-will-retire-from-road-racing-to-focus-on-gravel-at-the-end-of-2021/","date":1631124255000,"content":"<div><div><p>Kiel Reijnen will retire from road racing at the end of the 2021 season to “focus full-time on racing a gravel program” next year, Trek-Segafredo has announced.</p><p>The 35-year-old American will close out the season with a handful of one-day races in France and Belgium before calling it a pro road career.</p><p>“It will be a nice way to finish things out because Belgium is the heart of cycling. It’s also where it all started [for me] as a young kid going over to Belgium to get my feet wet,” Reijnen said. “That’s how you sort of decide whether or not this is what you want to do. And I think finishing there, sort of completes the circle. I’ve been a part of that Classics team now for quite a few years, half a decade, and it feels right to finish things out with those guys at those races. I think the race that will always stand out in my mind will be Flanders.”</p><p>Reijnen started his career with the Jelly Belly team before jumping up to the Pro Continental level with Team Type 1, and then moving over to UnitedHealthcare. He went WorldTour with Trek-Segafredo in 2016, and has ridden there ever since. Over the course of his career, he racked up some strong results in American events, taking back-to-back wins at the Philadelphia Cycling Classic in 2013 and 2014, and two stages each at the USA Pro Challenge and the Tour of Utah.</p><p>Recently, he has added off-road events Gravel to his calendar, racing the past two editions of Unbound Gravel (and running 18 miles in his socks at this year’s race after a mechanical). Following the conclusion of the 2021 season, he will make the off-road events his primary focus.</p><p>“I am really glad my career took the trajectory that it did because it allowed me to have a host of different experiences instead of one role for my whole career. And I did relish certain things about being in a leadership role. There’s a part of me that’s excited about gravel racing because I’ll get to push myself for results again because it’s been a while. And I think especially at my age it might be the kick in the butt you need to try and step up another level or train just a little bit harder, give a little bit more of yourself and make that extra sacrifice,” Reijnen said.</p><p>“I’m not here to change gravel or to put my stamp on it. I just want to be enthusiastic about it and make other people enthusiastic about it. Getting more people on bikes, at the end of the day, is always a positive, and that’s why I’ve always been pro e-bikes and pro gravel bikes. I’m pro any version of bikes because the more people that get out and experience it, the better.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9999881568608d51e905dfa7498b7675e5b95d4326957db34692630bd065da8f","category":"Cycling"}