{"title":"Modern flat-bar gravel bikes are basically just old mountain bikes","link":"https://cyclingtips.com/2021/10/modern-flat-bar-gravel-bikes-are-basically-just-old-mountain-bikes/","date":1634086275000,"content":"<div><div><p>An emerging trend in gravel bikes right now is using flat handlebars in place of the usual drop bars. The claimed benefits are what you’d expect: with more leverage for your hands, you’ve got more control when things get particularly rowdy, and the bikes are more fun to ride as a result. </p><p>Adding bar width sounds like an easy win in those situations, and mountain bikers will attest that even a few millimeters can make a big difference in terms of how much you can toss a bike around on a trail. However, swapping a drop bar for a flat one brings with it downsides as well as upsides, namely in terms of reach. Most modern drop bars have reach dimensions around 65-80 mm, but almost all flat bars have some degree of rearward sweep, which means just trading one for the other without altering the frame geometry to compensate can suddenly make a bike feel very short front-to-back.</p><p>You know what other bikes featured flat handlebars, short reach dimensions, and cramped cockpits? Old mountain bikes.</p><p>Back in the mid-to-late 1990s when I was doing an awful lot of cross-country riding, most of the frames I rode featured effective top tube lengths of about 600 mm (23.5″). Translated into more modern frame metrics, that roughly equates to a reach dimension just over 400 mm. Today, many flat-bar gravel bikes use the same frame geometry as their drop-bar cousins. In my size, that means even-shorter reach dimensions that hover somewhere around 370-390 mm, and that’s with shorter stems than we all used to run back in the day, too.</p><p>Head tube angles have admittedly slackened a bit — one or two degrees, typically — but all in all, things haven’t changed that much.</p><p>Another similarity is tire size. </p><p>Back in the 26″ days, it was common for mountain bikes to be equipped with 1.9-2.1″-wide tires (my old 2.35″ Ritchey Z-Maxes were considered cartoonishly big then). Translated into metric, we’re talking 48-53 mm, which is – you guessed it – about the maximum size you see approved for most modern gravel bikes. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Specialized-Diverge-Expert-E5-Evo-1-1340x754.jpg\"><figcaption>Is this a new-school flat-bar gravel bike, or an old-school mountain bike?</figcaption></figure><p>So essentially what the bike industry is now recreating is old mountain bikes under the guise of “flat bar gravel bikes.” That’s all well and good in some sense, but why ignore all of the knowledge we’ve gained about trail bikes in the past two decades? Admittedly, those old mountain bikes were fun, but more in a sketchy holy-cow-I-can’t-believe-I-didn’t-die-just-then kind of way. I remember those early days fondly, but I don’t necessarily want to recreate them, either.</p><p>There’s some hope from what we can tell, though. The norm right now with flat-bar gravel bikes is to simply slap a flat handlebar on the same frameset used on standard drop-bar variants, which, as I mentioned earlier, is decidedly problematic. However, both the Marin DSX 2 and the Specialized Diverge Comp E5 Evo we tested are built around dedicated frames with longer front-centers that were specifically designed from the outset with flat handlebars in mind. </p><p>The Marin unfortunately was still way too short, but the Specialized was a lot closer to where we wanted things to be, and it paid big dividends on the trail. Tire traction on both bikes was still lacking relative to a modern trail bike, and the Specialized’s rudimentary FutureShock cartridge paled in comparison to even an old Manitou Mach 4 in terms of travel and capability. Nevertheless, we hooped and hollered while riding the thing much like we did on those older bikes, sketchiness and all. </p><p>Make no mistake: flat-bar gravel bikes still strike us as a little silly. But they’re a legitimate breed with a distinctive feel that nevertheless brings a smile to our faces — provided they’re done right, and too many brands are doing them wrong right now.</p><hr><p><em>Our Field Test group bike tests are by no means paid events, but they’re still only possible with some outside support. CyclingTips would like to thank the following sponsors for this round of the Field Test:</em></p><ul><li><em><a href=\"https://www.rudyproject.com/\" target=\"_blank\">Rudy Project</a></em></li><li><em><a href=\"https://www.pearlizumi.com/\" target=\"_blank\">Pearl Izumi</a></em></li><li><em><a href=\"https://sierranevada.com/\" target=\"_blank\">Sierra Nevada Brewing Company</a></em></li><li><em><a href=\"https://leadoutgear.com/\" target=\"_blank\">Lead Out Gear</a></em></li><li><em><a href=\"https://www.parktool.com/\" target=\"_blank\">Park Tool</a></em></li></ul></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"99d9c1a545c72294d6d305ead70655ae69c60bf36342cda06235ac92126acbbb","category":"Cycling"}