{"title":"‘GameStop Nihilism’","link":"https://flickerfusion.com/2021/01/25/gamestop-nihilism/","date":1611801180000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"single\"><article><header><h2>Posted on <time datetime=\"2021-01-25\">January 25, 2021 at 11:15pm</time></h2></header><p>Matt Levine’s excellent “Money Stuff” column on <a href=\"https://www.bloomberg.com/opinion/articles/2021-01-25/the-game-never-stops\">the internet sociopaths that drove a dying video game retailer into a stratospheric valuation</a>.</p><blockquote><p>That’s cool but it’s also a terrifying proof of concept. If pure collective will can create a valuable financial asset, without any reference to cash flows or fundamentals, then all you need is a collective and some will. Just hop on Reddit and create value out of nothing. If it works for Bitcoin, why not … anything? Why not Dogecoin? Why not Signal Advance? Tesla Inc.? GameStop?</p></blockquote><p>When I saw today that GameStop, the stalwart of every American mall and employer of bored teenagers, was in the news, I was certain it would be their inevitable, Blockbuster Video-like finale. Which would put me square on the side of “rational” investors and Wall Street traders and in direct opposition to the maneuvering of <a href=\"https://www.reddit.com/r/wallstreetbets/\">r/wallstreetbets</a>.</p><p>_Bloomberg_’s Brandon Kochkodin has <a href=\"https://www.bloomberg.com/news/articles/2021-01-25/how-wallstreetbets-pushed-gamestop-shares-to-the-moon\">the full details</a> of how this all came to pass, with a more <a href=\"https://www.garbageday.email/p/happy-birthday-guy-fieri\">condensed take</a> from Ryan Broderick’s wonderful Garbage Day newsletter :</p><blockquote><p>This isn’t the first time r/WallStreetBets has deployed a large-scale 4chan-style astro turfing campaign on the stock market. The U.S. Securities and Exchange Commission <a href=\"https://www.reddit.com/r/wallstreetbets/comments/76j88b/whats_going_on_with_sec_in_here/\" title=\"investigated\">investigated</a> the subreddit over insider trading allegations in 2017. The subreddit’s users have basically figured out how to work together as a community to rearrange the raw source code of capitalism into a shitty video game. The result is a cascade of <a href=\"https://finance.yahoo.com/news/wall-street-bets-making-waves-194707983.html\" title=\"speculation bubbles\">speculation bubbles</a> on random nonsense.</p></blockquote><p>There is, suffice to say, a lot to unpack here. Once again, the real and virtual worlds are blurred beyond recognition. “<a href=\"https://www.urbandictionary.com/define.php?term=jokerfied\">Jokerfied</a>”, pandemic-bored redditors moving markets for the lulz, or because they hate bankers and other “globalists”, possibly making millions of dollars on a joke. GameStop’s stock halted several times over the past few days given its “<a href=\"https://decrypt.co/55113/redditors-pump-gamestop-trading-halted-for-bitcoin-like-volatility\">bitcoin-like volatility</a>”. On the one hand, that’s mildly horrifying, on the other, it’s a more democratic, for lack of a better word, form of what the hated bankers do to the world every single day.</p><p>And there’s a throughline that runs from r/wallstreetbets to r/thedonald to Gamergate and 4chan. There’s a shared aesthetic happening here but also a common worldview, the nihilism that Levine talks about that comes from some combination of boredom, lack of purpose (shared or individual), and a disintermediated, hyperconnected network that brings together enough individual sociopaths to create something that resembles a community.</p><p>I’ve been thinking a bit about Eric Hoffer, a decidedly 20th Century writer and philosopher who theorized about mass movements and what makes people commit themselves to, say, fascism or communism, ultimately arguing the mechanics are the same even when the ethos undergirding those movements are diametrically opposed. The trends and mechanisms he identified sixty years ago are almost certainly more relevant today.</p><p>In an essay published in <em><a href=\"https://bookshop.org/books/the-ordeal-of-change/9781933435107\">The Ordeal of Change</a></em>, Hoffer wrote “people with a sense of fulfillment think it is a good world and would like to conserve it as it is, while the frustrated favor radical change.” I think that obviously describes a lot of the angst we see here in the early 21st Century, particularly in relatively rich or westernized places, where most folks’ daily needs are met but their sense of purpose is not. Francis Fukuyama <a href=\"https://stratechery.com/2021/internet-3-0-and-the-beginning-of-tech-history/\">made a similar point</a> in his seminal <em>The End of History</em>.</p><p>Hoffer also wrote “In times of change, learners inherit the earth, while the learned find themselves beautifully equipped to deal with a world that no longer exists.” The trolls of r/wallstreetbets may be nihilists or just your run-of-the-mill day traders taking advantage of cracks in the system. A question for the rest of us is whether we’re doomed to fix ourselves to a world that no longer exists.</p><p>And if all this doom’s got you down, rest assured: <a href=\"https://www.reddit.com/r/wallstreetbets/comments/l0dfrp/the_tendieman_lyrics_and_video_by_uquigonshin/\">there’s a shanty</a>.</p></article></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"9a4949aa3912c8f7a16a598e910a0cc70d5a47ba33015f131b15d9aa6226bf87","category":"Tech"}