{"title":"Jake Stewart broke his hand when Bouhanni drove him into the barriers","link":"https://cyclingtips.com/2021/03/jake-stewart-broke-his-hand-when-bouhanni-drove-him-into-the-barriers/","date":1617118343000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Jake Stewart at the Omloop Het Nieuwsblad.</h4><p></p><div><p>Groupama-FDJ said on Tuesday that Jake Stewart will miss the upcoming Tour of Flanders due to a broken hand, which he sustained when Nacer Bouhanni drove him into the barriers at Cholet-Pays de la Loire on Sunday.</p><p>“We thought and was hoping that it was just superficial, but this morning[‘]s x-ray showed a fractured second metacarpal after Sundays Cholet Pays de la Loire,” Stewart said on Twitter. “Gutted to say the least to be missing De Ronde this week, but full focus now for recovering and getting back on the bike.”</p><p>This coming Sunday would have marked Stewart’s debut at the Tour of Flanders.</p><p>The injury occurred this weekend in the finale of Cholet-Pays de la Loire, a UCI 1.1-rated event in France. Stewart was riding behind Elia Viviani, who would go on to win the race, as Viviani wound up to speed, when Bouhanni came across from Stewart’s right. Bouhanni leaned into the 21-year-old Brit and <a href=\"https://cyclingtips.com/2021/03/nacer-bouhanni-is-still-a-terror/\" target=\"_blank\" rel=\"noreferrer noopener\">drove him into the barriers</a>. Stewart managed to stay upright, but his hopes for the sprint were dashed, and apparently, he broke his hand as well.</p><p>Bouhanni was disqualified for the incident, and Stewart criticized him on Twitter later that day.</p><p>On Monday, the UCI said it had <a href=\"https://cyclingtips.com/2021/03/uci-refers-bouhannis-sprint-shove-to-disciplinary-commission-for-additional-punishment/\" target=\"_blank\" rel=\"noreferrer noopener\">referred Bouhanni’s case to its Disciplinary Commission</a>.</p><div><h5>Tags</h5></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9a5e4f8d74068f9bf668bbfc6a9e3b4d9cb7500f6c29d5afc78756729e437587","category":"Cycling"}