{"title":"$200 Puro Pro hybrid over-the-ear headphones are almost perfect","link":"https://arstechnica.com/?p=1739493","date":1614085224000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>worth every penny —</h4><h2 itemprop=\"description\">These full-featured, flagship Bluetooth headphones impressed us mightily.</h2></header><section><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/000_Puro-unopened-box-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/000_Puro-unopened-box.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/000_Puro-unopened-box-980x735.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/000_Puro-unopened-box.jpg 2560\" data-sub-html=\"#caption-1739762\"><figure><figcaption id=\"caption-1739762\"><span></span><p>Puro Pro comes in an attractive bamboo box with brass clasp, reminiscent of a good cigar box.</p><p><span></span> Jim Salter</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/001_Puro-box-opened-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/001_Puro-box-opened.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/001_Puro-box-opened-980x735.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/001_Puro-box-opened.jpg 2560\" data-sub-html=\"#caption-1739763\"><figure><figcaption id=\"caption-1739763\"><span></span><p>Inside the display box, the headphones and cables are packed in a posh travel case, which will keep things organized and undamaged when you cram the whole thing in a backpack like the techno-troglodyte you are.</p><p><span></span> Jim Salter</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/002_Puro-inside-travel-case-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/002_Puro-inside-travel-case.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/002_Puro-inside-travel-case-980x734.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/002_Puro-inside-travel-case.jpg 2560\" data-sub-html=\"#caption-1739764\"><figure><figcaption id=\"caption-1739764\"><span></span><p>The travel case has a netted section sufficient to hold the (included) USB Micro-B charge cable and 3.5mm audio cable and maybe a USB thumb drive or two if necessary.</p><p><span></span> Jim Salter</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/004_Puro-on-flowerpot-lol-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/004_Puro-on-flowerpot-lol.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/004_Puro-on-flowerpot-lol.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/004_Puro-on-flowerpot-lol.jpg 2560\" data-sub-html=\"#caption-1739765\"><figure><figcaption id=\"caption-1739765\"><span></span><p>These violas are enjoying high-quality streaming audio from YouTube music. Also, they're holding up the phones so you can see the Puro logo on the top, which is their only visible branding.</p><p><span></span> Jim Salter</p></figcaption></figure></li></ul></div><p>Last December, a representative for <a href=\"https://purosound.com/\" target=\"_blank\" rel=\"noopener\">Puro Sound Labs</a> offered me a review sample of the company's flagship Bluetooth hybrid headphones. Her timing couldn't have been better—I had surgery scheduled for January 8 that would put me on the couch all day, every day, for two weeks straight with nothing to do but watch movies and television (ideally without driving my wife and kids insane).</p><p>The <a href=\"https://fave.co/39PnFhP\" target=\"_blank\" rel=\"noopener\">Puro Pro</a> is an over-the-ear design, which can be connected to audio sources via Bluetooth 5.0 pairing or a simple headphone cord. It offers just about any feature you might dream up for a pair of headphones: safety volume limiting (configurable for either 85dBA or 95dBA), 30+ hour battery life, content control via buttons on the left can, active noise cancellation, and even an inline mic for phone calls.</p><p>At $200, the Puro Pro costs more than I'd normally spend on a pair of headphones for watching late-night TV and flying on the occasional airplane (my two primary use cases). But after spending several hours per day with the Puro Pro for a couple of months, I would drop the cash in a heartbeat.</p><h2>How I tested</h2><div><p>(Ars Technica may earn compensation for sales from links on this post through <a href=\"https://arstechnica.com/affiliate-link-policy/\">affiliate programs</a>.)</p></div><p>The majority of the time I spent with the Puro Pro was on my couch, watching content from YouTube Music, Amazon, Hulu, and Netflix, along with some locally stored TV and movies. Both my <a href=\"https://amzn.to/3oOwQDm\" target=\"_blank\" rel=\"noopener\">Roku Premiere+</a> 4K UHD media player (for streaming content) and my custom-built HTPC (for local content) are connected to my Denon AVR-S510BT receiver and from the Denon's headphone jack to a Boltune low-latency Bluetooth 5.0 <a href=\"https://amzn.to/39OhWc9\" target=\"_blank\" rel=\"noopener\">transceiver</a>.</p><p>This setup was my most important test scenario for the headphones, but I also gave them more demanding tests of musical accuracy by connecting them (wired) to the <a href=\"https://amzn.to/3rlAM07\" target=\"_blank\" rel=\"noopener\">Scarlett Solo preamp</a> I use in my podcasting studio. The Scarlett Solo is connected to my workstation; its major \"work\" function is providing an XLR input for my <a href=\"https://amzn.to/3ro8JNG\" target=\"_blank\" rel=\"noopener\">RE230 mic</a>, but it does double duty as my system's main audio output interface, via its 1/4\" headphone jack—normally connected to a pair of <a href=\"https://amzn.to/3tu1Vje\" target=\"_blank\" rel=\"noopener\">Sennheiser HD 280 Pro</a> studio headphones.</p><p>I should be very clear that my testing is <em>subjective</em>—I actually used the headphones and compared them to several sets of reference gear, and I'm sharing my impressions here. With that said, I'm a fairly demanding listener; I grew up with a broadcast engineer for a dad, and I've spent the last 30 years trying to buy personal audio equipment that straddles the line between \"this is some of the best you can buy\" and \"this is wallet-draining audiophile nonsense.\"</p><h2>The competition</h2><p>I'm a night owl, but my wife is an early riser, so quiet late-night movie and TV watching is essential at the Salter household. Wireless earbuds turned out to be a no-go for me. I tried several models that I liked the sound of, but—while I found them comfortable initially—all led to repeated ear infections after long-term, daily use. Battery life was also less than ideal—the <a href=\"https://amzn.to/3rkCoXY\" target=\"_blank\" rel=\"noopener\">LG Tone HBS-510</a> earbuds I used the most only got about eight to 10 hours of play time, with similar results for a variety of lesser-known brands.</p><p>Next, I tried a set of <a href=\"https://amzn.to/2MQG1WG\" target=\"_blank\" rel=\"noopener\">Monodeal on-ear Bluetooth headphones</a>—at $35, they're an incredible value, and I ended up getting a second pair for my wife (who also loved them). But I still had comfort issues; after several TV episodes in a row, the on-ear design would get a bit ouchy. The battery life also left something to be desired, at around eight hours—not bad for the price, but not long enough to get you through cross-continent plane trips without careful husbanding.</p><p>Finally, I used a $200 pair of <a href=\"https://amzn.to/2O1SF5D\" target=\"_blank\" rel=\"noopener\">JBL Live 650BTNC</a> over-the-ear Bluetooth headphones. Their over-the-ear design was far more comfortable for long-term use than the Monodeal pair, and the playtime of 20+ hours was a huge improvement. The audio quality was also a little better than the Monodeal. They still weren't 100 percent comfortable for long-term use, though, due to weight, balance issues, and the combination of very firm padding and significant clamping pressure on my head.</p><p>Although the JBL headphones weren't perfect, they were workable enough that I wasn't really in the market for a replacement.</p><h2>Evaluating Puro Pro</h2><p>For my major use case—watching TV and movies late at night on the couch without disturbing my wife—the Puro Pro headphones are far and away the best thing I've tried. I also found them excellent for listening to a wide variety of musical genres, including classical, acoustic, a capella, and hip-hop.</p><p>The only flaw I could find with them—aside from the charge port not being USB-C—is an annoying background buzz artifact produced when the headphone volume is at max and a staccato sound (for example, the \"click\" when moving focus on the Roku interface from one item to another) is produced. That flaw is easily worked around: just turn the headphone volume down a single click and no more buzz.</p><h3>Comfort</h3><p>The padding is extremely soft and comfortable, and the headphones provide just enough clamping pressure to stay firm without getting ouchy after a few hours.</p><p>Although the weight of the JBL and Puro headphones is similar, the balance is different. This isn't something I notice instantly when putting either set of headphones on—but after several hour-long episodes of a binged show (or one <em>Lord of the Rings</em> movie), the JBL phones leave my neck feeling a little strained, while the Puro Pro phones do not.</p><p>The lighter clamping pressure and softer padding on the Puro Pro headphones also leaves me with significantly less \"sweaty ear\" feeling after several hours of extended use than I got from the JBL headphones—or, for that matter, from my Sennheiser HD 280 Pro studio phones after recording a podcast.</p></div><nav>Page: <span>1 <a href=\"https://arstechnica.com/gadgets/2021/02/200-puro-pro-hybrid-over-the-ear-headphones-are-almost-perfect/2/\">2</a> <a href=\"https://arstechnica.com/gadgets/2021/02/200-puro-pro-hybrid-over-the-ear-headphones-are-almost-perfect/3/\">3</a> <a href=\"https://arstechnica.com/gadgets/2021/02/200-puro-pro-hybrid-over-the-ear-headphones-are-almost-perfect/2/\"><span>Next <span>→</span></span></a></span></nav></section></div></div>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9a7f06f143d56d96b00976e071def1b0bc9769cb98a692785908fd87bf45d047","category":"Tech"}