{"title":"Chinese hackers targeted SolarWinds customers in parallel with Russian op","link":"https://arstechnica.com/?p=1748111","date":1615250216000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>COME ONE, COME ALL —</h4><h2 itemprop=\"description\">New data suggests that Russia wasn't the only nation state hacking customers.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/solarwinds-800x534.jpg\" alt=\"Chinese hackers targeted SolarWinds customers in parallel with Russian op\"><figcaption><p>Getty Images</p></figcaption></figure><p>By now, most people know that hackers tied to the Russian government compromised the SolarWinds software build system and used it to push a malicious update to some 18,000 of the company’s customers. On Monday, researchers published evidence that hackers from China also targeted SolarWinds customers in what security analysts have said was a distinctly different operation.</p><p>The parallel hack campaigns have been public knowledge since December, when researchers revealed that, in addition to the supply chain attack, hackers exploited a vulnerability in SolarWinds software called Orion. Hackers in the latter campaign used the exploit to install a malicious web shell dubbed Supernova on the network of a customer who used the network management tool. Researchers, however, had few if any clues as to who carried out that attack.</p><p>On Monday, researchers said the attack was likely carried out by a China-based hacking group they’ve dubbed “Spiral.” The finding, laid out in a <a href=\"https://www.secureworks.com/blog/supernova-web-shell-deployment-linked-to-spiral-threat-group\">report</a> published on Monday by Secureworks’ Counter Threat Unit, is based on techniques, tactics, and procedures in the hack that were either identical or very similar to an earlier compromise the researchers discovered in the same network.</p><h2>Pummeled on more than one front</h2><p>The finding comes on the heels of word that China-based hackers dubbed Hafnium are one of at least five clusters of hackers behind attacks that installed malicious web shells on <a href=\"https://arstechnica.com/gadgets/2021/03/tens-of-thousands-of-us-organizations-hit-in-ongoing-microsoft-exchange-hack/\">tens of thousands of Microsoft Exchange servers</a>. Monday’s report shows that there’s no shortage of APTs—shorthand for advanced persistent threat hackers—determined to target a wide swath of US-based organizations.</p><p>“At a time when everyone is hunting for HAFNIUM webshells because of the Exchange zero-days we learned about last week, SPIRAL's activity is a reminder that enterprises are getting pummeled on more than one front,” Juan Andres Guerrero-Saade, principal threat researcher at security firm SentinelOne, said in a direct message. The report is “a reminder of the diversity and breadth of the APT ecosystem.”</p><p>Counter Threat Unit researchers said they encountered Supernova in November as they responded to the hack of a customer’s network. Like other malicious web shells, Supernova got installed after the attackers had successfully gained the ability to execute malicious code on the target’s systems. The attackers then used Supernova to send commands that stole passwords and other data that gave access to other parts of the network.</p><p>Secureworks CTU researchers already believed that the speed and surgical precision of the movement inside the target’s network suggested that Spiral had prior experience inside it. Then, the researchers noticed similarities between the November hack and one the researchers had uncovered in August, 2020. The attackers in the earlier hack likely gained initial access as early as 2018 by exploiting a vulnerability in a product known as the <a href=\"https://www.manageengine.com/products/service-desk/?index\">ManageEngine ServiceDesk</a>, the researchers said.</p><p>“CTU researchers were initially unable to attribute the August activity to any known threat groups,” the researchers wrote. “However, the following similarities to the SPIRAL intrusion in late 2020 suggest that the SPIRAL threat group was responsible for both intrusions:”</p><blockquote><ul><li>The threat actors used identical commands to dump the LSASS process via comsvcs.dll and used the same output file path (see Figure 6).<figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/figure-6.png\" data-height=\"96\" data-width=\"852\" alt=\"LSASS process dump from August 2020 using an identical command to the November 2020 incident.\"><img alt=\"LSASS process dump from August 2020 using an identical command to the November 2020 incident.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/figure-6-640x72.png\" width=\"640\" height=\"72\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/figure-6.png 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/figure-6.png\" data-height=\"96\" data-width=\"852\">Enlarge</a> <span>/</span> LSASS process dump from August 2020 using an identical command to the November 2020 incident.</p><p>Secureworks</p></figcaption></figure></li><li>The same two servers were accessed: a domain controller and a server that could provide access to sensitive business data.</li><li>The same ‘c:userspublic’ path (all lowercase) was used as a working directory.</li><li>Three compromised administrator accounts were used in both intrusions.</li></ul></blockquote><p>The CTU researchers already knew that Chinese hackers had been exploiting MangeEngine servers to gain long-term access to networks of interest. But that alone wasn’t enough to determine Spiral had its origins in China. The researchers became more confident in the connection after noticing that the hackers in the August incident accidentally exposed one of their IP addresses. It was geolocated to China.</p><p>The hackers exposed their IP address when they stole the endpoint detection software Sercureworks had sold to the hacked customer. For reasons that aren’t clear, the hackers then ran the security product on one of their computers, at which point it exposed its IP address as it reached out to a Secureworks server.</p><p>The naming convention of the hackers’ computer was the same as a different computer that the hackers had used when connecting to the network through a VPN. Taken together, the evidence collected by CTU researchers gave them the confidence that both hacks were done by the same group and that the group was based in China.</p><p>“Similarities between SUPERNOVA-related activity in November and activity that CTU researchers analyzed in August suggest that the SPIRAL threat group was responsible for both intrusions,” CTU researchers wrote. “Characteristics of these intrusions indicate a possible connection to China.”</p></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9bc86de15192dfca1fae4d2f6eade761a54836c9140edf5fcc1d3deb08a9e7c3","category":"Tech"}