{"title":"All the little things that add up to make iPadOS productivity a pain","link":"https://arstechnica.com/?p=1744614","date":1614524411000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>iPadOS —</h4><h2 itemprop=\"description\">Apple did a good job with the big stuff, but myriad little things undermine that.</h2></div><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-Magic-Trackpad-150x150.jpeg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-Magic-Trackpad.jpeg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-Magic-Trackpad-980x735.jpeg 1080, https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-Magic-Trackpad-1440x1080.jpeg 2560\" data-sub-html=\"#caption-1663247\"><figure><figcaption id=\"caption-1663247\"><span></span><p>The 12.9-inch 2020 iPad Pro with the Smart Keyboard and Magic Trackpad peripherals.</p><p><span></span> Samuel Axon</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-camera-held-150x150.jpeg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-camera-held.jpeg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-camera-held-980x628.jpeg 1080, https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-camera-held-1440x923.jpeg 2560\" data-sub-html=\"#caption-1663244\"><figure><figcaption id=\"caption-1663244\"><span></span><p>The camera and sensor array on the 2020 iPad Pro includes two lenses and a lidar sensor.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-volume-150x150.jpeg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-volume.jpeg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-volume-980x475.jpeg 1080, https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-volume-1440x698.jpeg 2560\" data-sub-html=\"#caption-1663241\"><figure><figcaption id=\"caption-1663241\"><span></span><p>It's still as thin as before, but that camera bump is a change.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-flat-150x150.jpeg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-flat.jpeg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-flat-980x553.jpeg 1080, https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-flat-1440x813.jpeg 2560\" data-sub-html=\"#caption-1663243\"><figure><figcaption id=\"caption-1663243\"><span></span><p>The design hasn't changed at all beyond that camera bump.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-back-150x150.jpeg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-back.jpeg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-back-980x671.jpeg 1080, https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-back-1440x985.jpeg 2560\" data-sub-html=\"#caption-1663240\"><figure><figcaption id=\"caption-1663240\"><span></span><p>Here's the back.</p></figcaption></figure></li></ul></div><p><a href=\"https://www.bloomberg.com/news/articles/2020-04-13/apple-plans-ipad-like-design-for-next-iphone-smaller-homepod\">Rumor has it</a> a new iPad Pro is around the corner, which means Apple is about to make another big pitch for the iPad as a productivity and content-creation device.</p><p>But while we've found in our <a href=\"https://arstechnica.com/gadgets/2019/10/ipados-review-the-ipad-is-dead-long-live-the-ipad/\">iPadOS reviews</a> that Apple has done a marvelous job with the big-picture changes to the OS aimed at making it real-work-friendly, there are still a bunch of minor annoyances or \"nope, you can't do that\" limitations that sabotage Apple's intentions.</p><p>For that reason, it makes sense to preempt that upcoming marketing push with a few key caveats—especially since Apple likely won't announce a major iPadOS software update alongside new hardware in March. Significant new OS changes probably won't be discussed until the company's developer conference in June, and said updates probably won't reach the public until September or October.</p><p>Most of these are tiny problems, but they add up. iPads won't be a real laptop replacement for everyone until most of these issues are addressed.</p><h2>Webcams and multitasking</h2><p>It won't take you long in current computing use cases to notice this one: the front-facing camera on the iPad shuts off when you swipe away from whatever app is using it, Zoom included. Reviewers have brought this up again and again when reviewing recent iPads—us included. But 12 iPadOS updates later, it's still an issue.</p><p>Granted, some applications will show your camera view in a small, picture-in-picture window over other apps when you switch spaces. But you don't always want to see that—screen real estate is at a serious premium on iPads—and not every app does it.</p><p>Where third-party apps don't support the picture-in-picture view, Apple needs to find a way to incentivize them to do so. But better yet: allow users to enable background video capture on a per-app basis in Settings.</p><p>A lot of people are spending a great deal of time on video calls these days, for obvious reasons. It'd be great if Apple's flagship mainstream dedicated computing product actually did that well.</p><h2>Audio-source management</h2><p>Obviously, the iPad does support background audio. Apps like Apple Music or Spotify can play in the background, as can some (but not all) video apps. The problem is that it's all too easy for the currently active app to silence the one in the background, because two audio sources usually cannot play at the same time.</p><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/iPad-video-before-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/iPad-video-before.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/iPad-video-before-980x681.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/iPad-video-before-1440x1001.png 2560\" data-sub-html=\"#caption-1745852\"><figure><figcaption id=\"caption-1745852\"><span></span><p>Apps like Twitch will keep playing video when you swipe over to another app, and they'll keep playing the audio, too.</p><p><span></span> Samuel Axon</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/iPad-video-after-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/iPad-video-after.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/iPad-video-after-980x681.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/iPad-video-after-1440x1001.png 2560\" data-sub-html=\"#caption-1745851\"><figure><figcaption id=\"caption-1745851\"><span></span><p>You can minimize them to the side to get a better view while still listening to the audio, too.</p><p><span></span> Samuel Axon</p></figcaption></figure></li></ul></div><p>So for example, if you are watching a Twitch stream in the background but an autoplaying video with audio comes up on a webpage, your Twitch stream will stop. You'll have to stop the video on the Web, then go back to the Twitch app to start it up again. And sometimes, websites or apps take over your audio even if they aren't apparently making any sound at present.</p><p>At a minimum, the iPad should either not stop the first audio source when this happens or at least resume playing whatever was playing in the background once the new audio sources starts. But the ideal situation would be a panel for managing multiple audio sources at once by app, including their levels.</p><h2>External monitors</h2><p>When Apple first announced that the iPad Pro would be able to work with external monitors via USB-C as part of an overall pitch of the Pro as a heavy-duty productivity and content-creation device, many users expected something very different than what they got.</p><p>Yes, you can hook your iPad Pro up to an external USB-C monitor. But typically, all it does is mirror the iPad's display. It doesn't give you more spaces for apps, and it doesn't even adopt the aspect ratio of the screen you're sending the image to.</p><p>There is a very small number of iPad apps, like iMovie, that let you use the external monitor a little differently. But the vast majority don't, making external monitor support essentially useless on Apple's tablet.</p><h2>The limitations of the USB-C port</h2><p>The move to USB-C from Lightning in recent iPads is a welcome one, even if it means some people had to buy some new cables. The ecosystem of USB-C accessories—like external storage devices, monitors, music production tools, and so on—is quite robust compared to what we get on Lightning.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-USB-C.jpeg\" data-height=\"2017\" data-width=\"3903\" alt=\"The iPad Pro has USB-C instead of Lightning as its one port.\"><img alt=\"The iPad Pro has USB-C instead of Lightning as its one port.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-USB-C-640x331.jpeg\" width=\"640\" height=\"331\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-USB-C-1280x661.jpeg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/03/iPad-Pro-2020-USB-C.jpeg\" data-height=\"2017\" data-width=\"3903\">Enlarge</a> <span>/</span> The iPad Pro has USB-C instead of Lightning as its one port.</p></figcaption></figure><p>So we're not knocking USB-C here. We're knocking how many USB-C ports there are. The iPad Pro only has one, and all too often, it doesn't play nicely with external USB-C hubs that you might normally use with a Mac. Users complain of constant disconnects and inconsistent behavior. Some hubs just don't work at all.</p><p>If Apple can't rely on other companies like CalDigit to do this well, and if it really must insist on not adding at least one more port, then it needs to release its own USB-C dock that is guaranteed to work smoothly with the iPad.</p><p>It certainly didn't help that Apple removed the headphone jack from recent iPads. Some of the advertising around the iPad Pro centered on music production, but good luck producing music when you can't easily connect both an instrument and headphones at the same time.</p><p>You'll need a dongle, which is expensive and a hassle, and a whole lot of them don't work well.</p><h2>Pro app support</h2><p>A computer is only as good as the apps it can run, of course. And while the iPad has many excellent apps for consumers of content, many good productivity apps, and several good tools for hobbyists in various creative disciplines, users of apps that are popular in certain professional contexts face a significant gap between iPadOS and either macOS or Windows.</p><p>And it's not just from third parties. Apple's own Final Cut, Logic, and Xcode are not available on the iPad. There aren't a ton of great options from other companies either. Yes, Adobe has been working on fairly robust versions of both Photoshop and Illustrator for the iPad. But we haven't heard a word about Premiere, for example.</p><p>And there are numerous widely used pro apps from other companies that aren't available. There's no Maya, no Blender, no Unity, no Visual Studio. There is an AutoCAD app, but it's minimally functional compared to the desktop version.</p><p>If Apple is going to keep calling the iPad a device for professional content creators, it needs to convince these third parties to release more functional iPad apps. And at least as importantly, it needs to adapt its own software for the device.</p><h2>How likely are we to see these changes?</h2><p>For years, Apple has moved further away from the idea of more ports, large feature sets, and so on—particularly on mobile devices like the iPad. So in the past, we wouldn't have expected most of these things to actually happen.</p><p>However, the world of Apple devices looks noticeably different in the wake of reliable reports that new MacBook Pro laptops later this year will include SD cards or HDMI ports. Apple seems to be changing course to better court high-end and certain pro use-case customers. Well, at least as far as the Mac is concerned.</p><p>The company <em>has</em> also moved aggressively in other ways on the iPad front, at least in terms of software—just maybe not as fast as everyone would like. It seems plausible to us that multitasking issues (like those with webcams and audio sources) may be fixed in the future. And at this point, never say never to iPad versions of Logic or Final Cut.</p><p>We're less bullish on the idea of a multiport iPad Pro, though, and there's only so much Apple can do to attract third parties to make more robust apps for the platform.</p><p>Apple is expected to announce a new iPad Pro before the end of March, so we'll have a hint at what's to come soon enough.</p><p><em>Listing image by Samuel Axon</em></p></div></div>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9d138a46de73d153d3da78f0285f1c9d70b60a8de82c1be8b0d5ba9435f41714","category":"Tech"}