{"title":"Mike Woods commits to a carbon-neutral race season","link":"https://cyclingtips.com/2021/03/mike-woods-commits-to-a-carbon-neutral-race-season/","date":1615981070000,"content":"<div id=\"readability-page-1\" class=\"page\"><div data-block-name=\"block-author\"><p><a href=\"https://cyclingtips.com/author/caleyfretz/\"><img width=\"75\" height=\"75\" src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/01/FB-Profile-2-aspect-ratio-75-75.jpeg\" alt=\"\" loading=\"lazy\" srcset=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/01/FB-Profile-2-aspect-ratio-75-75.jpeg 75w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/01/FB-Profile-2-aspect-ratio-75-75-16x16.jpeg 16w\" sizes=\"(max-width: 75px) 100vw, 75px\"></a></p></div><div><p>Mike Woods (Israel Start-Up Nation) has committed to a carbon-neutral race season, he announced on Wednesday, dedicating himself to decreasing his own emissions and environmental impact and purchasing purchasing carbon offsets for the parts of his impact that are unavoidable.</p><p>“This is a hugely important and complex issue with no quick fix but my goal is to educate myself, take responsibility for my lifestyle, and to inspire my fans, partners and fellow pros along the way,” Woods said.</p><p>The initiative was spurred by a conversation with former pro Christian Meier, who owns The Service Course in Girona, which led to Woods investigate his own carbon impact via the World Wildlife Fund’s <a href=\"https://footprint.wwf.org.uk/#/\">environmental footprint calculator.</a> His footprint as a pro cyclist, he discovered, was more than twice that of the average person living in his adopted region of Catalonia, reaching 60 tons of CO2, 33 tons of which came from his race-related travel.</p><p>“I fly to races regularly and have a convoy of cars and trucks following my every move,” Woods said. “I sit on a massive bus at the end of each stage, and go through countless plastic bottles and packaged goods. I consume vast volumes of food, including large quantities of meat, and go through far more clothing than the average person.</p><p>“I love my job, but it’s hard to deny that the cost of my performance, and the impact it has on the planet, is significant.”</p><p>Woods is a two-time Vuelta a Espana stage winner, has finished on the podium at the world championships, and is the only athlete in history to have <a href=\"https://cyclingtips.com/2019/07/mike-woods-the-first-man-to-run-a-sub-4-minute-mile-and-finish-the-tour-de-france/\">completed a Tour de France run a sub 4-minute mile.</a></p><p>Woods will purchase carbon offsets from GoldStandard.org, as well as take other steps in his daily life to decrease his environmental impact.</p><p>“From simple things such as taking a permanent knife, fork, cup and bowl with me on the road so that I am no longer using plastic utensils and plates during our post race meals, to rethinking how I eat, and travel, and paying to offset all of the carbon that I emit, for 2021 I am pledging to make this a carbon neutral season,” Woods said.</p><div><h5>Tags</h5></div></div></div>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9d58f8480a084b5abe58a2e5278b329f8c3a69898164c9c5b150afd1bda44483","category":"Cycling"}