{"title":"Crowdfunding nets extra €15k+ for women’s Strade Bianche prize money","link":"https://cyclingtips.com/2021/03/crowdfunding-nets-extra-e15k-for-womens-strade-bianche-prize-money/","date":1614905820000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Organisers of Saturday’s Strade Bianche had planned on handing out a little over €6,200 to the top five finishers in the <a href=\"https://cyclingtips.com/2021/03/preview-what-you-should-know-about-the-2021-womens-strade-bianche/\" target=\"_blank\" rel=\"noreferrer noopener\">women’s race</a>. That’s compared to more than €31,000 set aside for the top five in the <a href=\"https://cyclingtips.com/2021/03/preview-what-you-should-know-about-the-2021-mens-strade-bianche/\" target=\"_blank\" rel=\"noreferrer noopener\">men’s race</a>.</p><p>But now, thanks to a crowdfunding campaign set up by one exasperated cycling fan, the prize purses of the two WorldTour races are much closer together than they would have been.</p><p>For years Dutchman Cem Tanyeri had been frustrated by the disparity in prize money between men’s and women’s races. This Monday, he was spurred into action by discussions about prize purses at last weekend’s Omloop Het Nieuwsblad where men’s winner Davide Ballerini took home €16,000 while women’s winner Anna van der Breggen only netted €930.</p><blockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/CL1jDUKFH8Q/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"13\" id=\"instagram-media-payload-0\"></blockquote><p>Tanyeri created a <a href=\"https://www.gofundme.com/f/equal-prize-money-for-the-womens-peloton\" target=\"_blank\" rel=\"noreferrer noopener\">GoFundMe campaign</a> entitled “Equal prize money for the women’s peloton”, with the proceedings going to the top finishers in the women’s Strade Bianche.</p><p>“The women’s peloton has ridden more than enough kilometres without a fair prize money compensation,” Tanyeri wrote on the campaign’s page. “Where it seems that the UCI and race organizers are too busy with banning the super tuck or aero position, real issues in the sport such as a fair compensation of the female peloton are not being addressed.&nbsp;</p><p>“Please help us in recognizing the outstanding athletic performance these athletes are displaying by donating an amount which will be awarded as prize money to the top 5 of the upcoming 2021 Strade Bianche.</p><p>“By raising a large amount we would like to show that there is great recognition and appreciation of the female pro field and as such they should be awarded equally to the men’s field.”</p><p>Tanyeri started his campaign with the goal of raising €5,000. At the time of writing, that campaign has now raised more than €15,000, putting the total prize money for the top five at more than €21,000 – an increase of over 250%.</p><p>“It’s a shame that we need to do it as fans, but on the other hand we’re just going to prove the monetary value of this sport,” Tanyeri told <a href=\"https://www.velonews.com/news/womens-strade-bianche-prize-money-crowdfunding-campaign-inches-toward-e11000/\" target=\"_blank\" rel=\"noreferrer noopener\">VeloNews</a>. “The financial contribution by fans shows that there should be more willingness to show these races, to equalize prize money, but also to have more people in the right places who can make these changes, structural changes that can break this very traditional fortress that is called pro cycling.”</p><p>As CyclingTips writer and Eurosport/GCN commentator José Been noted in a <a href=\"https://twitter.com/TourDeJose/status/1366635422823165955\" target=\"_blank\" rel=\"noreferrer noopener\">Twitter thread</a>, the issue of prize money is only one facet of the inequality problem for pro women’s cycling. She suggested that increased prize money only benefits the top riders; riders who are likely already the best off. Spending money on live broadcasting instead can help benefit the whole peloton.</p><p>The sport’s foremost advocacy group for female professional cyclists, The Cyclists’ Alliance (TCA), has agreed to help Tanyeri get the funds to the top finishers at the women’s Strade Bianche. Tanyeri and the TCA will also discuss how best to capitalise on the momentum that his crowdfunding campaign has generated.</p><p>Meanwhile, organisers of the Healthy Ageing Tour in the Netherlands are currently <a href=\"https://www.gofundme.com/f/healthy-ageing-tour-livestream?memberId=8918348&amp;utm_campaign=p_cp+share-sheet&amp;utm_medium=copy_link_all&amp;utm_source=customer\" target=\"_blank\" rel=\"noreferrer noopener\">crowdfunding a livestream</a> for their event starting on March 10.</p><div><h5>Tags</h5></div></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9d6b145a2f7e97759cccc7d1ac1ac6cdeb28d4ed3377be81ebe3725c82713a90","category":"Cycling"}