{"title":"iPhone 13 Front Glass Reveals Smaller Notch With Earpiece Relocated to Top Bezel","link":"https://www.macrumors.com/2021/03/23/alleged-iphone-13-front-glass-photo/","date":1616517276000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/23/alleged-iphone-13-front-glass-photo/\"><p><a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> models are widely expected to feature a smaller notch, and we are able to share a first look at the potential design.</p><p><img alt=\"iphone 13 front glass\" width=\"2862\" height=\"1976\" src=\"https://images.macrumors.com/t/5UC2BNyJOff78e5b4PSt-ADAY6E=/400x0/filters:quality(90)/article-new/2021/03/iphone-13-front-glass.jpg?lossy\" data-src=\"https://images.macrumors.com/t/5UC2BNyJOff78e5b4PSt-ADAY6E=/400x0/filters:quality(90)/article-new/2021/03/iphone-13-front-glass.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/5UC2BNyJOff78e5b4PSt-ADAY6E=/400x0/filters:quality(90)/article-new/2021/03/iphone-13-front-glass.jpg?lossy 400w,https://images.macrumors.com/t/hu3FbokTsfikU51K7JpD_Bzd4tg=/800x0/filters:quality(90)/article-new/2021/03/iphone-13-front-glass.jpg?lossy 800w,https://images.macrumors.com/t/yiC2b8jVN2NQu0v9_3QcCB8GiqE=/1600x0/filters:quality(90)/article-new/2021/03/iphone-13-front-glass.jpg 1600w,https://images.macrumors.com/t/AVqLPFOTBDkpr-fa2z3bDw99XE8=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/iphone-13-front-glass.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/5UC2BNyJOff78e5b4PSt-ADAY6E=/400x0/filters:quality(90)/article-new/2021/03/iphone-13-front-glass.jpg?lossy 400w,https://images.macrumors.com/t/hu3FbokTsfikU51K7JpD_Bzd4tg=/800x0/filters:quality(90)/article-new/2021/03/iphone-13-front-glass.jpg?lossy 800w,https://images.macrumors.com/t/yiC2b8jVN2NQu0v9_3QcCB8GiqE=/1600x0/filters:quality(90)/article-new/2021/03/iphone-13-front-glass.jpg 1600w,https://images.macrumors.com/t/AVqLPFOTBDkpr-fa2z3bDw99XE8=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/iphone-13-front-glass.jpg 2500w\"><br><a href=\"https://irepair.gr/\">Greek repair provider iRepair</a> has provided MacRumors with an alleged photo of front glass panels for iPhone 13 models, with the same three 5.4-inch, 6.1-inch, and 6.7-inch display sizes as the iPhone 12 lineup. The notch on each iPhone is visibly smaller as a result of the earpiece speaker being moved up into the top bezel, a design choice that was <a href=\"https://www.macrumors.com/2020/04/20/leaked-iphone-12-schematics-smaller-notch/\">first rumored for iPhone 12 models</a> last year but failed to materialize.</p><p>Apple analyst Ming-Chi Kuo and a few other sources previously claimed that a few Face ID components will be consolidated in iPhone 13 models, <a href=\"https://www.macrumors.com/2021/03/01/iphone-13-pro-120hz-kuo/\">resulting in a smaller notch</a>, but they did not mention the earpiece being repositioned.</p><p>The notch's design has gone unchanged since it debuted on the iPhone X in 2017. After shrinking the notch this year, Kuo said that Apple plans to <a href=\"https://www.macrumors.com/2021/03/01/kuo-some-2022-iphones-punch-hole-display/\">switch to a hole-punch display design for at least some 2022 iPhone models</a>, similar to Samsung's Galaxy S21 and other recent smartphones, followed by an iPhone with a true all-screen design without a notch or holes and an under-display fingerprint scanner as early as 2023.</p><p>Beyond the notch, iPhone 13 models are expected to have a virtually identical design as iPhone 12 models, with key new features rumored to include a 120Hz display on Pro models, larger batteries, a faster A15 chip, and camera improvements. Apple is expected to unveil the iPhone 13 lineup in September, marking a return to its usual launch timeframe.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/19/apple-stops-signing-ios-14-4-1/\">Apple Stops Signing iOS 14.4 Following Release of iOS 14.4.1</a></h3><p>Friday March 19, 2021 1:23 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Following the release of iOS 14.4.1 on March 8, Apple has stopped signing iOS 14.4, the previous version of iOS 14. With the software no longer being signed, it is no longer possible to downgrade from iOS 14.4.1 to iOS 14.4 if you've already upgraded your iPhone or iPad. Apple routinely stops signing older versions of software updates after new releases come out in order to encourage...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/19/handy-iphone-shortcuts/\">Handy iPhone and iPad Shortcuts You Should Check Out</a></h3><p>Friday March 19, 2021 12:31 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of iOS 13, Apple introduced Shortcuts support and the Shortcuts app, adding a whole range of new functionality to the iPhone. Shortcuts have continued to be popular since their debut, and in iOS 14, the addition of Home screen widgets made it even easier to get to your Shortcuts, so we thought we'd round up some of our most useful Shortcut options for iPhone and iPad. Subscribe ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/20/apple-brazil-fine-iphone-charger/\">Apple Fined $2 Million in Brazil for Selling iPhones Without Chargers</a></h3><p>Saturday March 20, 2021 8:04 am PDT by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple has been slapped with a near $2 million fine in the Brazilian state of São Paulo over violations of the Consumer Law Code due to the lack of a charger in the box for newer iPhones, Brazilian tech news outlet Tilt reports. Procon-SP, São Paulo's consumer protection agency, decided to fine Apple following intense scrutiny over the decision to remove the power adapter from the boxes of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/20/top-stories-thunderbolt-ipad-pro/\">Top Stories: iPad Pro With Thunderbolt?, Intel Mocks M1 Macs, iMac Pro Officially Discontinued</a></h3><p>We're past the halfway point of March with no sign of an Apple media event, but that doesn't mean we won't be seeing an event or simply some product launches via press release in the coming weeks, as rumors of upcoming products continue to circulate. Subscribe to the MacRumors YouTube channel for more videos. Perhaps the biggest news topic this week was Justin Long of Apple's \"Get a Mac\" ad...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/20/512gb-1tb-ssd-imac-21-discontinued/\">Apple Discontinues 512GB and 1TB SSD Configurations of 4K 21.5-inch iMac</a></h3><p>Saturday March 20, 2021 8:15 am PDT by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Just hours after officially discontinuing the iMac Pro, Apple has also discontinued the 512GB and 1TB SSD configurations of the 4K 21.5-inch iMac. Last month, both options became unavailable for purchase, although it was unclear at the time whether it was a temporary issue due to a component supply problem or if it was a permanent decision to no longer offer the options. Apple has now...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/22/apple-speakers-with-screens-and-cameras-report/\">Apple Developing New 'HomePod' Models With Screens and Cameras</a></h3><p>In a report today focused on an unactivated temperature/humidity sensor in the HomePod mini, Bloomberg's Mark Gurman briefly mentioned that Apple has \"been developing new speakers with screens and cameras.\" This reporting suggests that Apple could be at least exploring the idea of new HomePod models with a display and camera to compete with the likes of Google's Nest Hub Max, Amazon's Echo...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/22/apple-tvos-homepod-facetime-framework/\">Apple Adds FaceTime Framework to Apple TV/HomePod Amid Speaker With Screen Rumors</a></h3><p>Bloomberg's Mark Gurman today revealed that Apple has been developing new speakers that are equipped with \"screens and cameras,\" suggesting we could see a future HomePod-like device that has a built-in display and camera feature for FaceTiming and other functions. Ahead of these rumors, MacRumors contributor Steve Moser was combing through the tvOS 14.5 beta code and found that Apple has...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/18/apple-event-april-rumor-recap/\">Apple Event in April? Recapping the Latest iPad Pro, AirPods, and AirTags Rumors</a></h3><p>It's been a whirlwind of a month for Apple rumors. First, we heard from leaker Jon Prosser that an Apple Event was planned for March 16, but that was ruled out by Bloomberg's Mark Gurman. Once that date passed, Prosser and other leakers then suggested there would be an Apple Event on March 23, which is seemingly not happening either. With attention now shifting to April, we've put together...</p></div></div></div>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9e00e6fd79eee98a7c7e028027bde67d8a2a2e1e406ac82b13668fcd0ec4b755","category":"Apple"}