{"title":"Retro gallery: The Gavia Pass turns a peloton to ice","link":"https://cyclingtips.com/2021/11/retro-gallery-the-gavia-pass-turns-a-peloton-to-ice/","date":1637884860000,"content":"<div><p></p><h4>Stage winner Eric Breukinck.</h4><p></p><div><p><em>Over the course of the pandemic, veteran Dutch cycling photographer Cor Vos has been steadily digitising his deep archive of old race photos. This week, it was the iconic Gavia stage of the 1988 Giro d’Italia that made the selection.</em></p><hr><p>With the passage of time, the stages and years of a Grand Tour blur in memory until one is much like another. But there are exceptions – wins so moving, scenes so vivid, weather so wild that events become permanently seared into cycling mythology.</p><p>The 14th stage of the 1988 Giro d’Italia was one such stage.</p><p>With dark clouds billowing over the Alps, the peloton had a date with the 2,600-metre Gavia Pass. The night before, a huge amount of snow had been dumped on the pass, and race organisers had scrambled to clear the road. The Giro would proceed as planned – riding straight into some of the most grisly conditions in the history of the sport.</p><p>Twenty-six-year-old American, Andy Hampsten (7 Eleven), attacked at the base of the Gavia. The snow built into flurries and then a deluge, and the muddy roads became progressively whiter. Hampsten rode onward, trailed by young Dutchman Erik Breukink.</p><p>The stage is now synonymous with Hampsten, but it was Breukink who was the winner on the day. He caught his American rival 7 km from the summit, before the race plunged back down from the heights to Bormio in the valley beneath. Breukink won the stage by seven seconds, but Hampsten took the maglia rosa.</p><p>He’d go on to be the first (and only) US rider to win the Giro. Later in his career Hampsten won a stage of the Tour de France and finished in the top 10 of six Grand Tours, but the Gavia in the ’88 Giro was where he entered cycling folklore.</p><p>More than 33 years later, all of this is, obviously, not fresh news. There’s no tie-in to current events – no anniversary, no route announcement to go with this gallery. But as I was looking through a photographic archive this week for another story, I came across this collection of photos and they stopped me in my tracks.</p><p>Not snow-and-static flecked TV footage, but crisp images of big helmets and friction shifters, from a time when Delta was a brake rather than a virus. Cor Vos has no finish line shots to tell a complete story of the stage; just a handful of snapshots of a moment in time on the Gavia, where big men in iconic jerseys were reduced to shivering wrecks by a historic day’s racing.</p><figure><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-001-1340x888.jpg\"><figcaption>Johan van der Velde was leading off the front in short sleeves, having attacked before the Gavia, but by the summit he was bitterly cold, and too terrified to begin the descent. He’d lose 43 minutes by the end of the stage.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-016-1340x1010.jpg\"><figcaption>Early on the Gavia, Hampsten ramps up the speed from a dwindling peloton, with race leader Franco Chioccioli (Del Tongo) tenaciously hanging onto his rear wheel.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-010-1340x889.jpg\"><figcaption>Franco Chioccioli couldn’t hold on. Ahead of him, Hampsten rode away – and into the maglia rosa.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-004-1340x1629.jpg\"><figcaption>Breukink was also up front, and went clear of Hampsten late in the climb.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-008-1340x886.jpg\"><figcaption>More arm-warmer than man.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-007-1340x901.jpg\"><figcaption>A lonely Breukink rides through a winter wonderland.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-009.jpg\"><figcaption>Chioccioli was behind the leading duo, and would finish third on the stage. He’d finish the ’88 Giro in fifth, but would win it outright in 1991.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-006-1340x862.jpg\"><figcaption>A miserable-looking Angelo Canzonieri (Pepsi) gets dressed for the descent.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-012-1340x913.jpg\"><figcaption>Franco Vona nears the summit, past competitors getting dressed.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-013-1340x893.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-014-1340x894.jpg\"><figcaption>Breukink climbs through the snowstorm …</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-015.jpg\"><figcaption>… on a slippery, muddy, ice-rink.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033743-011.jpg\"><figcaption>Pedro Delgado (Reynolds) was a wreck by the finish line. He’d finish 14th overall.</figcaption></figure></li></ul></figure></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9e4549c594a6d586dc07cc7383939ffbb2597b4fe7195f007d1f24f27f20c18b","category":"Cycling"}