{"title":"Damiano Caruso wins stage 20 of the Giro d’Italia","link":"https://cyclingtips.com/2021/05/damiano-caruso-wins-stage-20-of-the-giro-ditalia/","date":1622302551000,"content":"<div><div><p>Damiano Caruso (Bahrain-Victorious) went from domestique to stage winner on stage 20 of the 2021 Giro d’Italia.</p><p>The stage began with a lengthy ride up Lake Maggiore from Verbania on mostly flat roads. Nearly all 4,200 m of vertical gain would wait until the second half of the stage where three climbs awaited the peloton, all first-category and two out of three over 2,000 m.</p><p>A nine-man breakaway formed out of the expected mayhem early in the stage, but they were never given much breathing room. The cohesion in the breakaway fragmented on the lower slopes of the 23 km-long Passo San Bernardino, and just five riders led the race over the first snowy summit with barely 50 seconds to the Team DSM-led peloton.</p><p>Three Team DSM riders including Romain Bardet were the first to catch the breakaway after gapping the peloton on the first descent, and second overall Damiano Caruso joined them a few seconds later along with teammate Pello Bilbao. The group carried a slender advantage onto the Splügenpass where they were able to increase the gap after shedding a few of the early escapers. Leaders Bardet, Storer, Caruso and Bilbao began the descent with 43 seconds in hand, an advantage they maintained more or less until the final climb.</p><p>First Storer then Bilbao emptied themselves for their respective leaders on the last climb of the 2021 Giro d’Italia, before Caruso took over at 6.5 km to go, Bardet apparently unable to ride. Dani Martinez (Ineos Grenadiers) set a fierce pace in what was left of the pink jersey group, but Caruso managed to hold on to take an enormously popular victory atop the Alpe Motte, his first ever at WorldTour level.</p><p>After all the work of his team, Bardet just missed out on a podium finish on the stage, second and third going to Egan Bernal and Martinez respectively. Bernal goes into the stage 21 time trial with 1:59 over stage winner Caruso and 3:23 to Simon Yates of BikeExchange.</p><div><div><p>Giro d'Italia (2.UWT) <span>Verbania → Valle Spluga-Alpe Motta</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/fd/damiano-caruso-2021.jpeg\"></p></div></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9eba3a345856e9da982e5a800a60d0178fbc9f5be651d039e3b695a87ec29cf9","category":"Cycling"}