{"title":"Doltcini-Van Eyck director Marc Bracke is not welcome at Flanders Classics events, organizer says","link":"https://cyclingtips.com/2021/04/flanders-classics-requests-that-doltcini-van-eyck-director-marc-bracke-not-attend-their-events/","date":1617543148000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>The organizer of the Tour of Flanders, Flanders Classics, has requested that Doltcini-Van Eyck director Marc Bracke not attend its events amid UCI Code of Ethics violation proceedings.</p><p>Bracke was found guilty of violating the UCI Code of Ethics in October, although, the UCI Disciplinary Commission has not yet imposed a suspension. In the meantime, the CEO of Flanders Classics Tomas van den Spiegel has confirmed the organization’s request that Bracke not direct the team for any Flanders Classics events.</p><p>“We have requested him not to attend and were surprised to hear of his presence,” Van Den Spiegel told&nbsp;Cyclingnews.</p><p>Liesbeth De Vocht will take Bracke’s place in the car at the Tour of Flanders alongside Shana Van Glabbeke. A representative of the team told Cyclingnews, “This does not mean that we agree with Flanders Classics’ request. We just don’t want to spoil one of the most beautiful days of the year in our sport.”</p><p>Belgian Cycling and Flanders Classics does not have the authority to keeping Bracke away from the races, although the team representative has said he will not attend races until the UCI Disciplinary Commission proceedings have concluded.</p><p>The investigation into Bracke’s behaviour <a href=\"https://cyclingtips.com/2020/03/uci-investigates-doltcini-van-eyck-sport-womens-team-after-sexual-abuse-allegations/\" target=\"_blank\" rel=\"noreferrer noopener\">began</a> in March of 2020 after 24-year old Sarah Youmans filed a report stating that Bracke had requested inappropriate photos of her during contract negotiations. The text in question read, “send me a picture of you in a bikini, don’t be shy … It’s the start of a relationship of trust.” Bracke later confirmed he had asked for photos of Youmans, “for professional reasons.”</p><p>This is the second instance this year that has <a href=\"https://cyclingtips.com/2021/02/with-van-gansens-slap-on-the-wrist-the-uci-has-failed-the-entire-womens-peloton/\" target=\"_blank\" rel=\"noreferrer noopener\">brought into question the UCI’s ability to handle cases of sexual assault and abuse</a>. In February of 2021, the UCI Disciplinary Commission <a href=\"https://cyclingtips.com/2021/02/patrick-van-gansen-receives-suspension-following-uci-code-of-ethics-violations/\" target=\"_blank\" rel=\"noreferrer noopener\">suspended Patrick van Gansen</a> from participating in cycling until the end of 2022 after finding him guilty in April of 2020. In between the guilty verdict and the announcement of a suspension Van Gansen could have continued to work for Health Mate-Cyclelive, had the sponsors not stepped in.</p><p>Bracke has continued to hold his position within the Doltcini-Van Eyck team through the proceedings.</p><div><h5>Tags</h5></div></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9f423fcbdbeb339f0271115f115ef10fb0a88858719f6570d6bc9e40d4027d40","category":"Cycling"}