{"title":"Porte: ‘The Dauphiné is always won on the last day’","link":"https://cyclingtips.com/2021/06/porte-the-dauphine-is-always-won-on-the-last-day/","date":1622907693000,"content":"<div><p></p><h4>Richie Porte accelerates during stage 7 of the 2021 Critérium du Dauphiné</h4><p></p><div><p>Richie Porte is the third Ineos Grenadiers rider in as many days to take a result at the Critérium du Dauphiné. First was Geraint Thomas who surged to stage 5 victory after a bit of a hiccup in Wednesday’s time trial, then Tao Geoghegan Hart showed his strength with second on stage 6. Porte’s runner-up finish on the penultimate stage, propelling him into the race lead, was the next in a series of events that should come as no surprise given his team’s enormous strength.</p><p>“When Movistar came and set the pace, they didn’t really have that many guys left,” Porte said after stage 7. “Then Geraint [Thomas] said, ‘Off you go’. It was the plan this morning that I attack, I’ve been thereabouts this year but was never really able to stretch the legs. We had the numbers, Tao’s been brilliant, G also. It’s great to be back in this team and I’m enjoying riding my bike.”</p><p>Porte has been in this position before, although in rather different circumstances. Eighteen months after leaving Team Sky for the BMC Racing Team, he was leading the 2017 Critérium du Dauphiné only to fall victim to ambush by superior teams on the last day. In the end, he finished second overall by just 10 seconds behind Jakob Fuglsang (Astana).</p><p>“I’ve been here before in the penultimate stage wearing the yellow jersey,” Porte said. “I’m under no illusions, it’s not going to be easy tomorrow, the Dauphiné is always won on the last day. But to be here in the yellow jersey, with a new team, I’m over the moon.”</p><p>The Ineos Grenadiers came into the race with 2018 Dauphiné and Tour de France champion Geraint Thomas as team leader. However, as is always the case with the British outfit, they had options in their domestiques who are also proven winners, one of them a former Giro d’Italia champion.</p><p>Geoghegan Hart finished second on Friday’s stage 6 having played a support role for Thomas, and later described his team as having an “embarrassment of riches”. While they would not be the first to boast such wealth, the Ineos Grenadiers do seem to have cracked the formula where others have not.</p><p>“It can be [complicated], but it’s one of the reasons that we’re here, with the Tour in mind,” Geoghegan Hart said of his team’s immense strength. “You try to build a team so that you don’t always need to communicate; you know what to do.”</p><p>The Ineos Grenadiers head into stage 8 with first, third and 11th on GC, all within 1:24. Sunday is by far the hardest stage of the Dauphiné with no less than six categorised climbs, including the hors-category Col de Joux-Plane, which they crest 17km from the finish.</p><p>“The Joux-Plane is a climb you have nightmares about, it’s one of the most solid climbs in world cycling,” Porte said. “Whatever happens tomorrow, we’ll give it our all and I’m motivated to try and bring this jersey home.”</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a0a78d2f410bc87833c89c5844b24a15660a58adbe72674c5b69d0fad5021759","category":"Cycling"}