{"title":"Colbrelli and Mohorič both sign ‘multi-year deals’ to stay with Bahrain Victorious","link":"https://cyclingtips.com/2021/10/colbrelli-and-mohoric-both-sign-multi-year-deals-to-stick-with-bahrain-victorious/","date":1634065530000,"content":"<div><div><p>Sonny Colbrelli and Matej Mohorič, two of the Bahrain Victorious team’s top performers on the season, have both renewed their contracts with the squad.</p><p>According to a press release, both riders have signed “multi-year deals.”</p><p>Colbrelli has been with the team since its inception, and he had a especially strong season this year. The 31-year-old Italian won stages at the Tour de Romandie and the Critérium du Dauphiné, the Italian national road title, a stage and the overall title at the Benelux Tour, the European Continental road title, and the Memorial Marco Pantani before delivering the biggest result of his career: a Monument win at Paris-Roubaix.</p><p>“I’m happy to continue and stay in a team that is like a family to me,” he said. “I’m one of the few riders wearing this jersey since 2017, the very first season, debuting in the WorldTour with Bahrain and arriving up to this stunning season. I can say I grew up with this group, and I must be more than thankful.”</p><p>Mohorič has been with the team since 2018, enjoying most of the biggest results of his career during his time with the squad, and his 2021 campaign was also particularly impressive. A former under-23 world champion, the 26-year-old Slovenian won his national road title in June, and he went on to take two Tour de France stage wins in July, the first of which made him a stage winner across all three Grand Tours. He then rode to second overall at the Tour de Pologne and a stage win and second overall at the Benelux Tour.</p><p>“I’ve been a long-standing rider with this team and always trusted the project. This year I think we finally proved that we are one of the best teams in the world,” Mohorič said.</p><p>“We have definitely got great support as a group of riders from all the staff, and we work hard to be here. After a great year, It’s never crossed my mind to change the environment I work in, and I’m very happy with the team and feels like a second family to me. It takes hard work to get to the level we performed at this season, and I’m confident we can continue this in the future and try and win bike races.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a0f4776eb5a2a0b99fee09d10e3e299d4065c3de34ebd4d27bf6cb340b74713e","category":"Cycling"}