{"title":"After Sunday’s launch, SpaceX is on the cusp of a historic reuse milestone","link":"https://arstechnica.com/?p=1749503","date":1615813712000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>An accelerating steamroller —</h4><h2 itemprop=\"description\">“For those that know rockets, this is a ridiculously hard thing.\"</h2></div><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945097_bdc3b79eaa_k-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945097_bdc3b79eaa_k.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945097_bdc3b79eaa_k-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945097_bdc3b79eaa_k-1440x960.jpg 2560\" data-sub-html=\"#caption-1749534\"><figure><figcaption id=\"caption-1749534\"><span></span><p>SpaceX launched its 21st batch of operational Starlink satellites on Sunday morning.</p><p><span></span> SpaceX</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945067_1353bd8828_k-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945067_1353bd8828_k.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945067_1353bd8828_k-980x1470.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945067_1353bd8828_k.jpg 2560\" data-sub-html=\"#caption-1749535\"><figure><figcaption id=\"caption-1749535\"><span></span><p>This was the ninth flight by this first stage of the Falcon 9 rocket.</p><p><span></span> SpaceX</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945027_07817535dc_k-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945027_07817535dc_k.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945027_07817535dc_k-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945027_07817535dc_k-1440x960.jpg 2560\" data-sub-html=\"#caption-1749537\"><figure><figcaption id=\"caption-1749537\"><span></span><p>This booster could fly its 10th mission in a month or two.</p><p><span></span> SpaceX</p></figcaption></figure></li></ul></div><p>SpaceX launched another batch of Starlink satellites early on Sunday morning and, in doing so, came close to a substantial rocket reuse milestone. The first stage of the Falcon 9 rocket that lofted this payload toward orbit, Booster no. 1051, was making its ninth flight. It successfully landed on the <em>Of Course I Still Love You</em> droneship.</p><p>As this is the first Falcon 9 rocket to launch nine missions, it raises the prospect of a first stage making a tenth flight in the near future, probably within a month or two. Reaching ten flights would accomplish one of the main goals set by SpaceX with the Falcon 9 rocket, after optimizing the vehicle for reuse about three years ago.</p><p>The company <a href=\"https://arstechnica.com/science/2018/05/block-5-rocket-launch-marks-the-end-of-the-beginning-for-spacex/\">debuted its \"Block 5\" version</a> of the Falcon 9 rocket in May 2018, and since then this vehicle has flown 55 missions, all of which have successfully delivered their payloads to orbit. More importantly, the changes SpaceX engineers incorporated into this new rocket to ensure its robustness for reuse, such as strengthening its \"Octaweb\" engine bay, have largely been validated.</p><p>“For those that know rockets, this is a ridiculously hard thing,” SpaceX founder Elon Musk said <a href=\"https://arstechnica.com/science/2018/05/spacexs-block-5-rocket-passes-its-first-test-but-final-exams-remain/\">during a teleconference</a> with reporters in 2018 to discuss the Block 5 upgrades. “It has taken us since, man, since 2002. Sixteen years of extreme effort and many, many iterations, and thousands of small but important development changes to get to where we think this is even possible.” He paused for a second, and then added, “Crazy hard.”</p><p>At the time, Musk set two primary goals for the Falcon 9 rocket's first stage. He wanted to fly each vehicle 10 times before needing significant maintenance. And he hoped to reach the point at which a Falcon 9 rocket could be turned around and re-flown within 24 hours.</p><p>SpaceX appears to have made good progress toward the first goal. Although the company has not disclosed how much maintenance it does to Falcon 9 first stages between launches, or how often a Merlin engine is replaced, the cores have proven to be reliable and robust. Numerous Falcon 9 first stages have now flown more than five times.</p><p>The company remains a ways from a 24-hour turnaround. Although it has trimmed the initial inspection and refurbishment time between flights from around six months to the current record of 27 days, it seems probable that SpaceX will not reach its 24-hour turnaround goal with the Falcon 9. Most likely, the company will take what it has learned from flying and reusing the Falcon 9, and transfer this aspiration for ultra-rapid reuse to the Starship vehicle SpaceX is currently developing in South Texas.</p><p>This ability to rapidly reuse the Falcon 9 rocket has allowed SpaceX to achieve a high cadence of launches in recent months with <a href=\"https://old.reddit.com/r/spacex/comments/m2yc36/spacexs_flightworthy_boosters_as_of_mar_11_2021/\">a fleet</a> of fewer than 10 active boosters. So far in 2021, the company is averaging a launch every nine days, a remarkable cadence for a large orbital rocket. Another Falcon 9 launch may come as soon as this weekend.</p><p>SpaceX's need to put thousands of Starlink Internet satellites into orbit—Sunday's flight was the 21st launch of operational Starlink satellites—is driving the company's manifest. Six of the company's eight launches so far in 2021 have carried 60 Starlink satellites each.</p><p>Astronomers have raised concerns about the effect of these satellites on the night sky, and satellite experts worry about collisions between so many vehicles in low-Earth orbit. However there can be no doubt that the engineering required to get so many satellites into orbit so quickly is impressive. Musk <a href=\"https://twitter.com/elonmusk/status/1371256869705109504\">noted on Twitter</a> this weekend that SpaceX delivered twice as much payload into orbit in 2020 than the rest of the world combined and may lap the world three or even four times in 2021.</p><p><em>Listing image by SpaceX</em></p></div></div>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a12f548d956436458227848c41f5bf55899aef9d5caf61d9719f734716c6dac4","category":"Tech"}