{"title":"Bettiol wins stage 18 of the Giro d’Italia from the breakaway","link":"https://cyclingtips.com/2021/05/bettiol-wins-stage-18-of-the-giro-ditalia-from-the-breakaway/","date":1622129994000,"content":"<div><div><p>Alberto Bettiol (EF Education-Nippo) won Thursday’s stage 18 of the Giro d’Italia, making it into the day’s breakaway and following the attacks in the last 35 km before riding the last 6 km solo. The peloton had a comparatively uneventful day, finishing over 23 minutes behind the stage winner.</p><p>Bettiol was part of a 23-rider breakaway that took on the longest stage of the 2021 Giro d’Italia ahead of a cruising peloton. It was a mostly flat 231 km from Rovereto to Stradella until the last 35 km, which were punctuated by a quartet of short climbs.</p><p>The breakaway began to fragment as the attacks started on the first ramp, and Rémi Cavagna’s was the first to stick, going solo with 25 km to go. The Frenchman earned himself a decent gap but DSM’s Nicolas Roche and Bettiol were on his case. The Italian proved the strongest, leaving Roche and then Cavagna in his wake, to celebrate a long-awaited home victory. Simone Consonni (Cofidis) took runner-up honors ahead of Roche in third 17 seconds later.</p><p>Back in the peloton, it was a very different day out. There was a bit of stress early on for Peter Sagan’s Bora-Hansgrohe team, but with 23 riders up the road competing for the win, they’d successfully protected Sagan’s 22-point lead over Davide Cimolai (Israel Start-Up Nation) in the points competition. The peloton settled into a long but relatively stress-free ride to Stradella, and the GC battle remains unchanged going into the final three stages.</p><div><div><p>Giro d'Italia (2.UWT) <span>Rovereto → Stradella</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/ea/alberto-bettiol-2021.jpeg\"></p></div></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a1a377efec5af4e68a3e19980f91711a15eb9d709884646752a313255a723879","category":"Cycling"}