{"title":"A Falcon 9 rocket making an uncontrolled reentry looked like an alien armada","link":"https://arstechnica.com/?p=1752372","date":1616761236000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>No, it's not aliens —</h4><h2 itemprop=\"description\">Typically, a Falcon 9 rocket makes a more controlled return to Earth.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51004598196_1267ee6ba6_k-800x533.jpg\" alt=\"A Falcon 9 rocket launches from Kennedy Space Center on March 4, 2021. Its second stage returned to Earth three weeks later.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51004598196_1267ee6ba6_k.jpg\" data-height=\"1365\" data-width=\"2048\">Enlarge</a> <span>/</span> A Falcon 9 rocket launches from Kennedy Space Center on March 4, 2021. Its second stage returned to Earth three weeks later.</p><p>SpaceX</p></figcaption></figure><p>A little more than three weeks ago a Falcon 9 rocket launched from Florida's Kennedy Space Center, carrying a payload of 60 Starlink satellites into low-Earth orbit. It was the first of four such missions flown this month by SpaceX.</p><p>The entire mission was nominal, except for a problem with the rocket's second stage. Typically, within an orbit or two of launching, the Falcon 9 rocket's Merlin vacuum engine will relight and nudge the second stage downward so that it harmlessly reenters Earth's atmosphere into the Pacific Ocean.</p><p>However, after this launch there was not enough propellant to ignite the Merlin engine and complete this burn. So the propellant was vented into space and the second stage set to make a more uncontrolled reentry into the atmosphere. In this case, the Falcon 9 upper stage still comes back, because, when it released the Starlink satellites, the vehicle was orbiting Earth at an average altitude of about 250 km. This high above the Earth it was still susceptible to drag from the thin wisps of our planet's upper atmosphere.</p><p>On Thursday night, three weeks after launching, this second stage reentered the thicker part of Earth's atmosphere and, in doing so over populated areas, provided some spectacular views for the Portland and Washington state region. Videos shared on various social media networks showed what appeared to be an invasion by an alien armada.</p><p>This was, however, simply the Falcon 9 rocket's second stage—which weighs about four metric tons unfueled—breaking apart in the atmosphere and burning up. <a href=\"https://twitter.com/planet4589/status/1375301028514500615\">It is likely</a> that the second stage completely broke apart over the Rocky Mountains near the United States and Canadian border.</p><p>Did any pieces make it to the ground? It's possible that some of the more dense components of the rocket, such as pieces of the Merlin engine or composite overwrap pressure vessels, withstood reentry and landed on the ground in the Rockies. There were no immediate reports of any injuries.</p><p>Historically, when rockets deployed their payloads at higher orbits, these spent second stages were often just left in space for decades. Today, they're a big contributor to the problem of orbital debris, so there is pressure on rocket companies to \"dispose\" of their second stages, either by deorbiting them or sending them into heliocentric orbits. SpaceX hopes to address this problem with its Starship vehicle by making the entire vehicle reusable, with both the Super Heavy rocket and Starship upper stage returning to Earth for reuse.</p></div></div>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a1b6f135341f894b89395716ff18f17d98c0786270e37fa520b71089ee0c37b9","category":"Tech"}