{"title":"Morphing bodywork among Lotus’ ideas for a future electric race car","link":"https://arstechnica.com/?p=1742641","date":1613492951000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>EEEARRNINE —</h4><h2 itemprop=\"description\">The firm has extrapolated current technology out to 2030.</h2></div><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_1--150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_1-.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_1--980x745.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_1--1440x1094.jpg 2560\" data-sub-html=\"#caption-1742643\"><figure><figcaption id=\"caption-1742643\"><span></span><p>This is the Lotus E-R9, an interpretation of what an electric endurance race car might look like in 2030.</p><p><span></span> Lotus</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_2-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_2.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_2-980x745.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_2-1440x1094.jpg 2560\" data-sub-html=\"#caption-1742644\"><figure><figcaption id=\"caption-1742644\"><span></span><p>The E-R9 uses an electric motor for each wheel and morphing bodywork that can change the car's aerodynamic profile as needed.</p><p><span></span> Lotus</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_3-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_3.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_3-980x745.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_3-1440x1094.jpg 2560\" data-sub-html=\"#caption-1742645\"><figure><figcaption id=\"caption-1742645\"><span></span><p>The lack of an internal combustion engine to package means the E-R9 is incredibly tight-waisted.</p><p><span></span> Lotus</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_4-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_4.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_4-980x745.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus-endurance-racer-2030_4-1440x1094.jpg 2560\" data-sub-html=\"#caption-1742646\"><figure><figcaption id=\"caption-1742646\"><span></span><p>When seen from the top, you can see the influence of the Deltawing race car.</p><p><span></span> Lotus</p></figcaption></figure></li></ul></div><p>Regular readers will know that we're pretty enthusiastic about the future of Lotus, the UK-based maker of lightweight sports cars. Beset by financial troubles for much of its existence, Lotus Group is now owned by Geely, the Chinese company that was responsible for Volvo's renaissance. The company has an all-new road car in development—a relatively attainable one called the Type 131 that's in addition to the <a href=\"https://arstechnica.com/cars/2019/07/the-first-all-new-lotus-in-years-will-be-a-1971hp-electric-car/\">1,971hp (2MW) limited-run Evija electric car</a>.</p><p>We'll have to wait a while before the Type 131 breaks cover, probably later this summer. In the meantime, Lotus Engineering (an engineering consultancy that's part of Lotus Group, alongside Lotus Cars) has released some images of one of its latest projects. It's an electric endurance racer called the E-R9, and as you might guess, it's like catnip for those of us who think of ourselves as EV enthusiasts as well as racing fans.</p><p>\"What we’ve tried to do is to push the boundaries of where we are technically today and extrapolate into the future. The Lotus E-R9 incorporates technologies which we fully expect to develop and be practical. Lotus has an amazing history of developing unique solutions, and we’ve done it many times in motorsport and with our road cars,\" said Richard Hill, Lotus' chief aerodynamicist.</p><p>For starters, the car is fully electric, with a motor for each individual wheel—a development that Lotus designed for the Evija hypercar.</p><p>The E-R9 isn't designed for a current racing ruleset. Instead, it's Lotus' idea for an endurance racer (for events like the 24 Hours of Le Mans) for the year 2030. Battery tech has only really advanced to the point where it makes sense for shorter (~45 min) races, as in Formula E, but Lotus reckons that problem will be solved before too long.</p><p>\"Battery energy density and power density are developing significantly year on year. Before 2030, we’ll have mixed cell chemistry batteries that give the best of both worlds, as well as the ability to ‘hot-swap’ batteries during pitstops,\" said Louis Kerr, principal platform engineer for the Evija and another member of the E-R9 development team.</p><p>The E-R9 also features a lot of active aerodynamic devices—features that are mostly banned from professional racing series, with the exception of things like F1's drag-reduction system. For the electric endurance Lotus, this means \"morphing\" body panels to alter airflow, either by the driver's command or automatically. These would lower drag on the straights (to increase top speed) and increase downforce in the corners. Vertical control surfaces at the rear of the car help it turn independently of the rear tires' mechanical grip. And it also looks pretty darn cool, with a <a href=\"https://arstechnica.com/cars/2015/03/half-the-power-half-the-weight-all-the-fun-deltawing-road-cars-ahoy/\">deltawing</a> shape that's one more reason the car doesn't need a traditional rear wing.</p><p>We don't believe there are any plans to build the E-R9, but as yet another&nbsp;appetite-whetter for the Type 131, it's doing the job.</p><p><em>Listing image by Lotus</em></p></div></div>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a22c77d792c5e4e574e82d895d6050ce67331ab8b3c123c580b9e67165deeaf1","category":"Tech"}