{"title":"Trek’s new Boone is still a dedicated cyclocross race bike","link":"https://cyclingtips.com/2021/09/treks-new-boone-is-still-a-dedicated-cyclocross-race-bike/","date":1631665380000,"content":"<div><div><p>As used by the likes of cyclocross world champion Lucinda Brand and rising star <a href=\"https://cyclingtips.com/2021/01/sven-and-thibau-nys-the-past-and-future-of-cyclocross/\" target=\"_blank\">Thibau Nys</a>, the Trek Boone has long been a narrowly focussed race machine. Now Trek has overhauled the model, and it’s rather obvious that the <a href=\"https://cyclingtips.com/2020/06/2021-trek-emonda-review/\" target=\"_blank\">Emonda road bike</a> was the inspiration. </p><h2>Focussed on CX</h2><p>While some brands have muddied the waters by combining their gravel and cyclocross platforms, Trek continues to offer distinctly different platforms for the different disciplines. The Boone remains a dedicated cyclocross race machine, and Trek isn’t shy about the fact that if you want an all-road machine then you should look at the Domane, and if you want to do gravel, then you should get the Checkpoint. </p><p>By contrast, the new Boone is quoted as only having clearance to match the UCI’s 33 mm tyre limit. However, given the provided mud clearance, we suspect something closer to 40 mm rubber should fit. Similarly, the only mounts on the new Boone are for two bottle cages within the main triangle. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-12-1340x754.jpg\"><figcaption>There’s plenty of room to avoid thick mud from building up, and therefore there’s plenty of room for going wider than a 33.</figcaption></figure><p>And then there’s the unchanged geometry that offers a shorter wheelbase and taller bottom bracket height when compared to the gravel-going Checkpoint. Trek continues to offer the Boone in six sizes, all of which feature 425 mm chainstays and a bottom bracket drop that sits somewhere between 70-65 mm depending on size. </p><div><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-2022-geometry-650x393.jpg\"><figcaption>No changes here.</figcaption></figure></div><h2>More like an Emonda </h2><p>The new Boone now looks a whole lot like the <a href=\"https://cyclingtips.com/2020/06/2021-trek-emonda-review/\" target=\"_blank\">current generation Emonda road bike</a>. Here, Trek has given the frame tubes an aero overhaul with similarly curvaceous truncated airfoil shapes seen throughout. </p><p>Similarly, the Emonda’s method of guiding the cables and brake hoses in from the front of the head tube carries over, giving a cleaner aesthetic to the bike, but one that may prove a maintenance nuisance after a season of pressure washing.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-6-1340x754.jpg\"><figcaption>The cables now enter at the top of the head tube and run through the upper headset bearing, just like on the Emonda. Time will tell if this opening proves problematic with constant mud and washing.</figcaption></figure><p>While the Boone is intended to be raced at the top level, Trek has elected to make the frame with its OCLV 600-level carbon fibre layup versus its truly top-end materials. This surely makes the Boone a more affordable option, but in turn, it’s likely to carry a slight weight penalty. Still, the new Boone frameset manages to save approximately 270 grams compared to the previous version, with a 56 cm frameset quoted at about 1,500 g. We’re waiting on confirmation from Trek on more specific figures. </p><p>A big part of that weight saving is likely the result of the new Boone dropping the IsoSpeed decoupler from the front end. The Boone’s front end now returns to a standard head tube system, while the back still features Trek’s unique IsoSpeed concept that allows the carbon seat tube to more freely flex by pivoting at the top tube. This IsoSpeed system continues to use Trek’s reversed seat tube design with a topper seatpost head. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-10-1340x754.jpg\"><figcaption>Trek’s well-proven IsoSpeed remains at the seat tube.</figcaption></figure><p>The other big news is that the Boone now features a T47 threaded bottom bracket. Any regular T47 bottom bracket can be fitted to the frame.</p><h2>One model </h2><p>Trek will only be offering the new Boone in a single complete bike model or as a frameset (US$2,700 / £2,400). Each is available in stylized black or a neat red, navy, and teal fade. The Boone 6 Disc bike (US$4,000 / £3,450) features a Shimano RX810 groupset in a 1×11 configuration, Bontrager Paradigm Comp wheels, and Bontrager finishing kit. Trek’s 3S chain guide is fitted as stock. </p><p>You can find more information at <a href=\"https://www.trekbikes.com/us/en_US/bikes/road-bikes/cyclocross-bikes/boone/boone-6-disc/p/35337/?colorCode=grey_greydark\" target=\"_blank\">trekbikes.com</a>.</p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-5-1340x754.jpg\"><figcaption>The new Boone is available in black, too.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-3-1340x754.jpg\"><figcaption>2020 cyclocross world champion Lucinda Brand will start her season on the new Boone.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-15-1340x754.jpg\"><figcaption>Brand’s Boone gets a paint scheme you can’t buy. Trek apparently won’t be offering the Boone as part of its Project One custom program.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-2-1340x754.jpg\"><figcaption>Thibau Nys’s dad, Sven, apparently had a hand in the design of the new Boone.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-14-1340x754.jpg\"><figcaption>Boone in action.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-11-1340x754.jpg\"><figcaption>The new Boone has a number of frame parts in common with the Emonda.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-9-1340x754.jpg\"><figcaption>Trek’s only model of the Boone features Shimano GRX mechanical shifting.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-8-1340x754.jpg\"><figcaption>The Boone looks a whole lot like the Emonda from this angle, except for the 33 mm treaded rubber that is.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Trek-Boone-6-cyclo-cross-2022-release-4-1340x754.jpg\"><figcaption>Digging this fade.</figcaption></figure></li></ul></div></figure></div></div>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a32adeb8e2d69fea0199c99cde653db90a1b6ef2dd459f183efd633c18ab03e1","category":"Cycling"}