{"title":"Giro Agilis Mips helmet review","link":"https://www.cyclist.co.uk/giro/9159/giro-agilis-mips-helmet-review","date":1611655998000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>I owned the first ever iPhone – it was expensive, glitchy and would automatically hang up on calls after five minutes of talking. My newer generation phone is essentially a laptop in my pocket, has never let me down, and sets me back the equivalent of a large Domino’s pizza each month.</p><p>Trickle-down technology is a win-win situation, and it’s the same when it comes to the Giro Agilis Mips helmet. Adopting safety, design and details from the Californian company’s top end lids, this £89.99 example makes a compelling case for being the only helmet you’ll need.</p>&nbsp;<h3>If the cap fits…</h3><p>There’s something particularly welcoming and familiar to the fit of the Giro Agilis Mips – it’s identical in feel to every other helmet I’ve worn from the American brand.</p><p>No surprises, just order the same trusty size M I’ve worn in a Giro Synthe, Cinder and Foray over the years. Adjustment at the rear is by way of the firm’s Roc Loc 5 system (also used on the higher-end helmets in the Giro range), which tensions the lightweight plastic strips around the skull.</p>&nbsp;<p>Speaking of weight, the Agilis Mips weighs in at 280g – lighter than the £135 Giro Cinder which I tend to use as my everyday helmet.</p><p><a href=\"https://www.chainreactioncycles.com/giro-agilis-mips-helmet-2020/rp-prod194514\" target=\"_blank\"><em><strong>Buy the Giro Agilis Mips helmet from Chain Reaction Cycles now</strong></em></a></p><p>Internal padding at the forehead and temples provides comfortable cushioning and ample sweat absorption, certainly for springtime rides. The overall fit wraps more around the head than sitting atop it, which only adds to the feeling of security.</p>&nbsp;<h3>Seasons change</h3><p>Perhaps the most noticeable difference between the Giro Agilis Mips and my Cinder is that the venting is even more efficient on the cheaper of the two helmets.</p><p>For starters, there are six extra air channels on the Agilis Mips (32 holes in total), but the frontal area of those air vents is greater, which allows it to swallow more cooling air.</p><p>Admittedly, this is a bonus in high summer, but such is the efficiency with which it flows air across the head, a skull cap or peaked cycling cap for colder rides is a good idea. The time Giro spent in the wind tunnel perfecting this array of ports and exhaust channels has really paid off.</p>&nbsp;<h3>Crash protection</h3><p>Although assessing a helmet’s crash protection without actually hitting the deck whilst wearing it always seems a little peculiar, I have had the misfortune to smack my head on the ground in other Mips-equipped lids, and can attest to its effectiveness.</p><p><a href=\"https://www.chainreactioncycles.com/giro-agilis-mips-helmet-2020/rp-prod194514\" target=\"_blank\"><em><strong>Buy the Giro Agilis Mips helmet from Chain Reaction Cycles now</strong></em></a></p><p>The system employs an internal slip plane to reduce the amount of rotational force applied to the rider’s head on impact. Crucially, apart from some noticeable extra movement on your skull when you tug on the helmet, you’d never know it was there.</p>&nbsp;<h3>Refinement</h3><p>There is only so much you can do with a polycarbonate shell designed to wrap around the head and prevent injury, but still some manufacturers try to gild the lily.</p><p>The Giro Agilis Mips uses a two-piece shell with internal Mips system to give a familiar, cosseting, comfortable fit, allowing it to make a solid claim to being the only road helmet you need.</p><p>It gives little, if anything, away in weight to lids costing three times the amount, shares the performance-bred Giro road helmet family resemblance, is superbly vented, child’s play to adjust, and will probably save you from serious injury.</p><p>OK, there’s no dedicated sunglasses port to slot the arms of your sunnies into, but that’s the very worst there is to say about it…</p><p><a href=\"https://www.cyclist.co.uk/cyclist-reviews-policy\" target=\"_blank\"><em>All reviews are fully independent and no payments have been made by companies featured in reviews</em></a></p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"a3a92459e7fc2c87130c1b80ce4f2c09f0d1f54bb563bada84a806fcae248249","category":"Cycling"}