{"title":"How to build your perfect pain cave: Part one – indoor trainers","link":"https://cyclingtips.com/2021/12/how-to-build-your-perfect-pain-cave-part-one-indoor-trainers/","date":1638838004000,"content":"<div><div><p>Indoor training has come an incredibly long way in the past decade. Thankfully, the days of staring at brick walls and trying to make it to 60 minutes without losing all love of bikes are long gone. In their place are a host of virtual-world software options, smart trainers, and a list of accessories long enough you could likely try something new for every training day of the year.  </p><p>In this time, cyclists have gone from shuddering at the idea of doing a single turbo session to embracing indoor training as a much-loved standalone discipline. As a mark of how far indoor training has come not only are brick walls no longer enough, but riders are now curating dream indoor setups with all manner of trainers, accessories, and displays.</p><h2>What is a pain cave?</h2><p><em><strong>pain</strong>/peɪn/noun – A highly unpleasant physical sensation caused by illness or injury (e.g. “She’s in great pain.”)</em></p><p><em><strong>cave</strong>/keɪv/noun – A natural underground chamber in a hillside or cliff (e.g. “The narrow gorge contains a series of prehistoric caves.”)</em></p><p>Thankfully we are not talking about some self-inflicted highly unpleasant physical sensation deep in a remote underground chamber. The term ‘pain cave’ is at least a little nicer than the individual words and is commonly used to describe indoor training setups.</p><p>So what makes the perfect pain cave? That largely depends on what you want to get from your indoor training and what budget you have to spend. We decided to look at the best pain cave setups across a range of price points. We will unveil these ideal setups across the coming weeks, but before we get into each of them, let’s look first at how to curate the perfect cave for your goals and budget, starting with the centrepiece of any setup: the ideal trainer.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/Tacx-Flux-2-direct-drive-v-wheelon-v-smart-bike-indoor-turbo-trainer-2-1340x754.jpg\"></figure><h2>How to choose a smart trainer</h2><p>There are a few essentials for any pain cave. You obviously will need a trainer of some sort. Otherwise, the most painful thing in your cave might be boredom. Which trainer you choose will likely come down to budget. If you are lucky enough to have an open budget, you might lean towards one of the very top-end trainers. For many of us, the trainer will eat up a hefty chunk of whatever budget you have, and as such, you want to ensure you get the best option for you. </p><p>Decide first on what your indoor riding goals are. Do you want to race week in and week out on Zwift? Then spending more where possible to get a highly accurate trainer will serve you well. On the other hand, if your indoor setup is purely a means to an end on the worst winter days, opting for a lower-end trainer and saving part of your budget to invest in accessories for improving the experience, may be the way to go. </p><h2>Smart or ‘dumb’ trainer?</h2><p>To answer this question, we first need to establish what makes a trainer smart. When we refer to a smart trainer, we most often mean a trainer with a built-in power meter and one which interacts with a training platform (be that Zwift, Systm, TrainerRoad etc) to provide automated resistance control in response to road gradient changes in a virtual world or workout intervals.</p><p>Some non-interactive smart trainers do measure power and communicate to these software training platforms, even controlling your Zwift avatar, but the communication is one-way. The training platform cannot communicate back to the trainer and control the resistance and as such, the trainer is not interactive. Smart trainers usually require an external power source, although some can now run on the watts you create in pedalling.</p><p>In comparison, a so-called “dumb trainer” or “classic trainer”, will have no communication with training platforms in either direction. These trainers typically do not include a power meter (although some do, and others can calculate power), and resistance control is either absent or a manual process with a handlebar-mounted resistance control unit. On the plus side, these classic trainers usually require no external power source, they’re much lighter, and more easily transported for warm up pre-event etc.</p><p>Nevertheless, any classic trainer can still allow a user to engage with an online training platform provided the bike in use includes a crank, pedal, or hub-based power meter, and you don’t mind adjusting resistance manually.</p><p>So how do you choose which one is right for you? Again, budget is the major factor here, but try to look past just the trainer and think of your complete setup. Think of trainer selection like an event training plan: find out where you ideally want to get to and work backwards from there.</p><p>Are you planning to build out your dream cave with a series of investments over a couple of winter seasons? If so, ensure the trainer you purchase now is compatible with whatever accessories, platforms, and devices you wish to use in future. For example, do you fancy a gradient simulator? Ensure the trainer you purchase now is compatible with the Kickr Climb or Elite Rizer.</p><p>From there, consider the type of training you will do. If you envisage a winter full of Zwifting, then an interactive smart trainer is the way to go. Again, if racing floats your boat, you’ll need to hone in on the trainer’s power accuracy. Perhaps you prefer TrainerRoad or the Wahoo Systm offerings, and already have a power meter on the bike you will use. In this scenario, it is best to use the power meter on the bike for consistency across indoor and outdoor training. As such, trainer accuracy is less crucial as these platforms can control your trainer from your power meter.</p><p>Non-interactive trainers are less common now but may work for you if you want to keep trainer spend down, do not have a power meter on your bike, and you care little for virtual works or simulated courses.</p><h2>Direct-drive, smart bike or wheel-on trainer? </h2><p>So now we have established the differing smarts of the indoor trainer market, what about the many shapes, sizes, resistance levels, and all that wheel in, wheel out hokey pokey? What is the difference between a wheel-on trainer, wheel-off direct-drive trainer, and wheelless smart bike?</p><h3>Direct-drive</h3><p>Direct-drive trainers replace the rear wheel of a bike with a direct-drive setup and are fast becoming the most popular and desirable option on the market. The bike mounts directly to the trainer via the same quick-release or thru-axle setup as your regular rear wheel, supporting the bike at the frame dropouts. A cassette on the trainer replaces the cassette on your rear wheel, meaning the only change to your bike is the removal of the rear wheel.</p><p>From there things are very similar to a normal bike operation, the only difference being when the chain drives the cassette (sprocket cluster) on the trainer, the bike doesn’t actually move.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/direct-drive-v-wheelon-v-smart-bike-indoor-turbo-trainer-2-7-1340x754.jpg\"></figure><p>Direct-drive trainers often offer a quieter and more stable indoor training setup, often with greater power accuracy and increased resistance or simulated gradient range. Flywheels help mimic the feeling of inertia we know from cycling outdoors. While not essential, and not as simple as “bigger is better”, think of flywheels as creating that smooth, round pedalling feel we know from outdoors instead of choppy pedalling you might find on an <a target=\"_blank\" href=\"https://www.amazon.co.uk/Lightweight-Bi-Pedaler-Exercise-System/dp/B0195BKU90/ref=asc_df_B0195BKU90/?tag=googshopuk-21&amp;linkCode=df0&amp;hvadid=399635225192&amp;hvpos=&amp;hvnetw=g&amp;hvrand=173822215180383220&amp;hvpone=&amp;hvptwo=&amp;hvqmt=&amp;hvdev=c&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=1007284&amp;hvtargid=pla-748578871898&amp;psc=1&amp;tag=&amp;ref=&amp;adgrpid=88836928047&amp;hvpone=&amp;hvptwo=&amp;hvadid=399635225192&amp;hvpos=&amp;hvnetw=g&amp;hvrand=173822215180383220&amp;hvqmt=&amp;hvdev=c&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=1007284&amp;hvtargid=pla-748578871898\">arms and legs keep-fit machine</a>.</p><p>Direct-drive trainers tend to feature heavier flywheels, or a virtual flywheel as found on Tacx trainers, for a smoother “real-world feel” (more on this in a moment). This increased weight provides a more stable platform but can also mean a more cumbersome trainer to move and stow when not in use; a not-insignificant issue if you store your trainer between rides.</p><p>For some, the removal and replacement of the rear wheel will be an easier transition from outdoor to indoor riding. For others who are less mechanically confident, removing the rear wheel may add an extra layer of complication. However, when it comes to riding, direct-drive trainers will provide a smoother ride with zero slippage.</p><p>Many direct-drive trainers come with claims of a more realistic real-world ride feel. While some trainers undoubtedly provide a smoother experience, I feel it is important to point out none can provide anything like that actual real-world feel. That’s not a criticism of the trainers: bikes locked into trainers, going nowhere, requiring zero balance and steering, will inevitably feel very different. I believe we need to embrace the differences rather than try to achieve some mythical real-world feel.  </p><p>Without wheel slippages and variances in roller tension from one ride to another, direct-drive trainers tend to offer more accurate power measurement than wheel-on trainers. It’s also worth noting that the power measurement from a direct-drive trainer is taken at the rear axle, and hence further down the drivetrain stream than the pedal- and crank-based power meters many of us use outdoors. As such, expect to see a slight decrease in readings as watts are lost to your drivetrain.</p><p>Algorithms used by some trainers account for these losses and boost the reading slightly to compensate. While generally accurate, any time a power reading is based on a predicated calculation, inaccuracies can creep in. As a rule of thumb, if accuracy is important to you, I suggest using the same power meter indoors and out where possible.</p><h3>Wheel-on trainers</h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/direct-drive-v-wheel-on-v-smart-bike-indoor-turbo-trainer_-3-1340x754.jpg\"><figcaption>Wheel-on trainers, as the name suggests, keep the rear wheel on the bike.</figcaption></figure><p>With all we just learned about direct-drive trainers, there are no prizes for guessing what a wheel-on trainer is. As the name suggests, with a wheel-on trainer, the rear wheel remains in the bike and engages with a roller on the resistance unit of the trainer.</p><p>In contrast to direct-drive trainers which sit inside the rear triangle supporting the bike at the dropouts and clamp the frame similar to a wheel, wheel-on trainers sit entirely outside the frame and support the bike with a clamp and a specifically designed skewer or thru-axle adapter.</p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/direct-drive-v-wheel-on-v-smart-bike-indoor-turbo-trainer_-10-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/direct-drive-v-wheel-on-v-smart-bike-indoor-turbo-trainer_-14-1340x754.jpg\"></figure></li></ul></div></figure><p>Wheel-on trainers once dominated the market. As direct-drive trainers have become more accessible in recent years, classic wheel-on trainers have retreated into a smaller segment of the trainer market. But great wheel-on options do still exist.</p><p>Although less desirable now than their rear wheel-less siblings, wheel-on trainers will still put you through your paces, pump your legs full of lactate, and sting your wallet (albiet slightly less) for the privilege. Wheel-on smart trainers typically offer the lowest-priced entry into the smart trainer market, making them an attractive option for many working on a budget.</p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/direct-drive-v-wheel-on-v-smart-bike-indoor-turbo-trainer_-6-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/direct-drive-v-wheel-on-v-smart-bike-indoor-turbo-trainer_-5-1340x754.jpg\"></figure></li></ul></div></figure><p>So what are you missing with a wheel-on trainer? Due to the rear tyre and trainer roller interface, wheel-on trainers tend to be louder than many direct-drive smart trainers. Secondly, even the smart/interactive wheel-on options offer less resistance than many direct-drive trainers.</p><p>Look at the maximum wattage and incline range for wheel-on smart trainers and you will often see limits lower than those found on direct-drive trainers. For example, the Wahoo Kickr Snap wheel-on trainer offers up to 1,500 watts of resistance and a 12% incline, while its direct-drive bigger sibling offers 2,200 W and 20% gradients. More on just how much resistance we need later.</p><p>There is also the rear wheel conundrum. While you can take your bike straight from a road ride and mount it on a wheel-on trainer, using an indoor specific tyre is advisable. Standard outdoors tyres are not designed to withstand the increased heat and wear stresses of indoor training and can also carry dirt and grit, which may damage the roller on the trainer’s resistance unit. Indoor tyres are designed to withstand these forces making them harder-wearing, smoother-running, and restricted to indoor use only means no roller damaging dirt.</p><p>But who wants to change tyres multiple times per week? Many riders will opt to mount the indoor tyre on an older rear wheel and use that exclusively for indoor training. While this provides a quick and easy solution to the rear wheel problem, it does bring wheel-on trainers into the wheel-swapping territory of direct-drive trainers that less mechanically confident riders may be wishing to avoid.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/direct-drive-v-wheel-on-v-smart-bike-indoor-turbo-trainer_-13-1340x754.jpg\"><figcaption>Best to have a dedicated indoor wheel unless you really enjoy swapping tyres or plan to ride only indoors for longer periods.</figcaption></figure><p>Wheel-on smart trainers undoubtedly provide a more budget-friendly entry into virtual training world, offering many of the interactive features of more expensive direct-drive options. In return for that lower price, expect to encounter a little extra faff changing wheels, adjusting roller tension, a bit of extra noise, and less steep virtual climbs. If those are non-issues for you, wheel-on smart trainers might be perfect for your pain cave.</p><h3>Smart bikes</h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/Wattbike-Atom-1-direct-drive-v-wheelon-v-smart-bike-indoor-turbo-trainer-2-3-1340x754.jpg\"><figcaption>Wattbike? The smart bike.</figcaption></figure><p>What is a smart bike trainer? AI robot bikes destined to overthrow humanity and take over the planet? Or even worse, spin bikes? Thankfully neither.</p><p>Smart bikes offer the interactive features of smart trainers built into a complete, one-piece trainer and bike package. Where direct-drive and wheel-on trainers both require a traditional bike, smart bike trainers include the trainer in a bike-shaped object with saddle, cranks, and handlebars similar (sometimes identical) to those found on standard bikes.</p><p>Smart bikes aim to offer direct-drive trainer levels of interactive features in an always-ready package with a setup and feel similar to your outdoor bike. Better yet, with an all-in-one trainer and bike setup, your outdoor bike and components will be sparred the wear and tear of sweaty indoor training rides.</p><p>So far, so good, so what’s the catch? Pricing is still the major barrier to entry to the smart bike playground. With prices ranging from £1,900 to £3,000 (US$2,500-$4,000) to for the most popular smart bikes, they are significantly pricier than even the most high-end direct-drive smart trainers.</p><p>One of the claimed benefits of a smart-bike is the smaller footprint it offers. While this is generally true – most smart bikes are at least shorter overall than a road bike on a trainer – a smart bike’s design and weight mean it is must almost certainly remain permanently in-situ. In contrast, a trainer and bike can separate for storage. Whether this works for you will depend on whether you have the space for a smaller permanent footprint, or need the disappearing act a bike and trainer can offer.</p><p>Smart bikes offer an always-ready indoor training option for those with a budget to match the higher price tags and space to house them permanently. As the newest comer to the smart trainer segment, the smart bike will surely grow in popularity in years to come with the next generations’ models hopefully bringing design advancements and lower price points.</p><h2>How much smart trainer resistance do I need?</h2><p>It’s the 1,000 W question: how much resistance do I need in my trainer? Unfortunately, there’s no simple answer here. The amount of resistance you require will depend on the type of rider you are, how many watts you’re pushing, and the type of training you plan to “enjoy”.</p><p>Smart trainers offer varying levels of maximum wattage and incline resistance capabilities. This resistance is created by the trainer effectively applying the brakes as the virtual road kicks up, to simulate steeper gradients, or by applying extra resistance to help you hit the wattage target on your next interval using ERG or resistance mode.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/direct-drive-v-wheel-on-v-smart-bike-indoor-turbo-trainer_-7-1340x754.jpg\"><figcaption>Crank up the resistance. Wheel-on trainers can provide the resistance required for many riders, but those with big sprints or looking to replicate the steepest gradients might need to look elsewhere.</figcaption></figure><p>Of the trainers we have on test, the claimed resistance figures range from 1,500 W and 12% on the Kickr Snap right up to 2,500 W and 25% incline on the Wattbike. Obviously, as a stationary trainer designed for pedalling on the spot indoors, the maximum incline is a simulation of what that incline might feel like outdoors. This gives a hint as to how these maximum capabilities actually work.</p><p>Close your eyes and imagine (oh wait – open one eye to keep reading) riding outdoors with Nairo Quintana on a 15% climb. Unless you are Egan Bernal, chances are you will ride slower up that climb than Nairo, because power-to-weight matters on steep climbs. Nairo is a pure climber and built as such. Thanks to an incredible power-to-weight ratio, he climbs fast!</p><p>Now let’s take a non-climbing specialist to the same climb on a Wednesday evening after work. We can call him John. John is 25 kg heavier than Nairo and has 100 W less to dance with. With a significantly reduced power-to-weight ratio, John will be slower on the climb.</p><p>If we move that same climb indoors onto a smart trainer in “simulation mode” (which can recreate a route from outdoors, replicating gradients through the trainer’s resistance unit) the trainer will apply brake force in different proportions to replicate the climb for both Nairo and John. Simulation mode, Zwift, Rouvy and RGT etc. all use rider weight and power (amongst other factors) to simulate climbing speed. As Nairo blasts out more power with less weight, he will climb faster, and the trainer must apply more brake force to simulate the same gradient. Likewise for John – although climbing much slower, John’s increased weight and slower speed mean the trainer must apply significant brake force to simulate the same gradient.</p><p>Imagine hauling a 25 kg bag of spuds (potatoes) up a 15% climb. You will be heavier, and as such slower for the same power output. Worst of all, you will feel it burn in your legs. That 15% might feel like 25%. Think of the trainer’s resistance as a bag of spuds. As the pitches increase, more and more potatoes are added to your bag. Although the speed is not as high, the trainer works just as hard to replicate steep, stinging gradients.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/direct-drive-v-wheelon-v-smart-bike-indoor-turbo-trainer-2-6-1340x754.jpg\"><figcaption>The Wattbike Atom hides a 25% climb in here somewhere.</figcaption></figure><p>Bringing this back to the question at hand, how much resistance do we actually need? If you want to replicate the steepest road on the planet in your garage, you will probably find that difficult regardless of the trainer you choose. However, if, like most, you simply want to enjoy a virtual world or follow a structured training plan, you are unlikely ever to hit the upper ranges of these resistance limits.</p><p>On the wattage side, only the very best of sprinters will hit the 1,500 W limit even the Kickr Snap is said to handle. A max power of 1,500 W is right up there with Grand Tour stage-winning sprint capabilities. Factor in a natural decrease in power associated with riding indoors, and this 1,500 W limit is even tougher to hit.</p><p>We spoke to former Zwift world number one and <a href=\"https://cyclingtips.com/2020/12/weights-straps-and-fans-the-pain-cave-of-a-zwift-world-championships-rider/\" target=\"_blank\">E-sports world championship rider Chris McGlinchey</a>, who has one of the strongest sprints in the Zwift peloton. He said “I have never come close to the max wattage on my trainer. Fair play to anyone who can hit close to 1,800-2,000 W on a trainer and not either snap something or fall over.”</p><p>Furthermore, when it comes to climbing, Zwift sets trainer difficulty at 50% by default. Think of trainer difficulty as Zwift’s way of making climbing more enjoyable. At 50% trainer difficulty, 10% gradients on Zwift will feel like 5%. There are no prizes for enduring a 100%-difficulty ride. Increasing or decreasing the difficulty setting will have no impact on how fast your avatar rides, which is still dependent on the wattage you produce.</p><p>Remember, training should be enjoyable and provide a fitness progression. It doesn’t need to be 100% horrible to give you a great workout. If you are riding at anything less than 100% trainer difficulty, the maximum gradient the trainer can replicate effectively increases, giving even more range.</p><p>For those who want a more definitive example, I recently rode the Radio Tower climb on Zwift with a Kickr Snap wheel-on trainer and Zwift trainer difficulty set to 100%. While a time of 5:12 hardly set the world alight, at 4.85 W/kg and 60 rpm the Snap provided all the resistance I needed/wanted, and perhaps a bit more. In fact, riding the same climb on a Wahoo Kickr, Tacx Flux, and Wattbike Atom over the past week, that ride on the Snap was the second quickest, missing out on top spot by one second, confirming it is effort rather than resistance that determines virtual VAM.</p><p>Being overly critical for a moment, my gear selection on the Snap was higher than I would ride on a 13% climb outdoors with pitches of 18 and 19% – 39/19 on the trainer vs 39/25 or 28 outdoors. This bigger gear trend continued on the higher-resistance Flux 2 and Kickr, although these were slightly closer to the outdoor gearing.</p><p>All things being equal, more resistance range is better. Whatever slim chance we have of maxing out a trainer will be lower on a trainer with a greater range. However, with the increased capability usually comes an increased price, so many of us will want to explore whether a lower-priced option might provide all the resistance we need.</p><p>I have developed the following questionnaire to help with trainer selection. If you answer yes to any of the following, you may benefit from a trainer with top-end resistance. Answer no to all the questions, and even the lower end trainers will provide all the resistance you require.</p><ul><li>Are you <a href=\"https://www.instagram.com/harrielavreysen/?hl=en\" target=\"_blank\">Harrie Lavreysen</a>?</li><li>Can you exceed/sustain 1,500 W in a max indoor sprint?</li><li>Do you plan to train your sprint indoors?</li><li>Do any of your training rides include intervals at 1,500 W?</li><li>Do you plan to either legitimately, or by cheating, steal Zwift KOM crowns? (PS: you will need to cheat)</li></ul><h2>Budget, mid-range, or high-end?</h2><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/12/direct-drive-v-wheelon-v-smart-bike-indoor-turbo-trainer-2-8-1340x754.jpg\"><figcaption>Mid-to-upper range trainers (by today’s pricing) like this Tacx Flux 2, offer ample training options.</figcaption></figure><p>As mentioned already, your budget will be the deciding factor here. If money is no object, then you might want to treat yourself to the highest-spec trainer or smart bike and accessories. I know I would. However, if your budget doesn’t stretch quite that far, which trainer should you choose?</p><p>Bad news first: if you are a track or high-level road sprinter and are committed to doing your sprint training indoors, you will need to invest in one of the top-end trainers. In better news for us mere mortals of the sprinting world, mid-range direct-drive smart trainers will likely provide all the resistance you ever need. Better yet, on those rare occasions when a mid-range trainers is maxed out, you might actually be thankful for the excuse to make the suffering end.</p><p>In even better news for those looking at the wheel-on smart trainer price point a) there are often sales on the lower-spec direct-drives that bring those trainers close to the wheel-on price category, and b) having recently ridden a wheel-on smart trainer for the first time I was pleasantly surprised with the trainer’s ability. The quality of training I could achieve with the wheel-on trainer was undiminished, even if easy setup, comfort (sound levels), and hence enjoyment did drop a little.</p><p>This training quality point brings me on to my closing thoughts on choosing a trainer. If you are bringing the outdoors inside for the winter, your indoor riding will be your only vice for the next few months, and enjoying the virtual world is the number-one factor in motivating you to train, then the quietest and smoothest trainer will be vital. Aim for a mid- to high-end direct-drive trainer and pump any spare budget into fans, desks, and widescreen displays.</p><p>If you plan on racing or following structured plans and do not have a power meter indoors, accuracy is vital. If the budget is tight I would forego extra incline or wattage in a heartbeat in return for that more complete setup. Furthermore, if you already have a reliable power meter on your bike, I would lean on its power readings, meaning you can also forego some absolute trainer accuracy, only required for those without a power meter or those who plan to enjoy some virtual racing.</p><p>If, on the other hand, you have a limited budget, are preparing for the upcoming race season or a specific event, and the indoor trainer is more of a means to an end rather than something to be enjoyed, a wheel-on smart trainer is unlikely to hold you back. Think “getting the job done” rather than “cruisy enjoyable virtual bike ride”.</p><p>The extra faff changing wheels or tyres, question marks on power accuracy, and increased noise are not ideal, but with an on-bike power meter and a set plan to follow, it is unlikely to affect the fitness you can achieve. If the money saved means you can invest in a better fan (or fans) this will make a much more positive impact on your training quality.</p><p>Join us next time for part two in this series where we look at the essential and not-so-essential accessories for indoor training.</p></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a407784acb29fbb8da2e5bd77ad83f70c272efa704d8add98acc46f4522f939c","category":"Cycling"}