{"title":"Deals: M1 512GB Mac mini Hits New Low Price of $829 ($70 Off)","link":"https://www.macrumors.com/2021/02/08/deals-m1-512gb-mac-mini/","date":1612797908000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><div><p><time datetime=\"2021-02-08T07:25:08-08:00\">Monday February 8, 2021 7:25 AM PST</time> by</p></div><div><article><div data-io-article-url=\"/2021/02/08/deals-m1-512gb-mac-mini/\"><p>B&amp;H Photo is discounting Apple's newest Mac mini (512GB) to <a href=\"https://www.bhphotovideo.com/c/product/1604800-REG/apple_mgnt3ll_a_mac_mini.html/kw/APMGNT3LLA/BI/2696/KBID/3612\"><strong>$829.00</strong></a>, down from $899.00. This is the lowest price that we've tracked to date for this model of the Mac mini, which was refreshed in late 2020 with the new M1 chip.</p><p><img src=\"https://images.macrumors.com/t/xWZX12Be_fOVl9kZOE26CnybEuY=/400x0/filters:quality(90)/article-new/2021/02/mac-mini-sale.jpg?lossy\" srcset=\"https://images.macrumors.com/t/xWZX12Be_fOVl9kZOE26CnybEuY=/400x0/filters:quality(90)/article-new/2021/02/mac-mini-sale.jpg?lossy 400w,https://images.macrumors.com/t/G6uGvcTnc35Ao7qzmrmLJBCmemI=/800x0/filters:quality(90)/article-new/2021/02/mac-mini-sale.jpg?lossy 800w,https://images.macrumors.com/t/hDKfuqUdcP_ue3Fbtb-GAPt-8Qs=/1600x0/filters:quality(90)/article-new/2021/02/mac-mini-sale.jpg 1600w,https://images.macrumors.com/t/7lZUUfU0ZEQb7u5Q8G34PdY-zxI=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/mac-mini-sale.jpg 2500w\" sizes=\"(max-width: 900px) 100vw, 729px\" alt=\"mac mini sale\" width=\"1600\" height=\"494\"><em><small>Note: MacRumors is an affiliate partner with B&amp;H Photo. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.</small></em></p><p>The 256GB Mac mini is also on sale and is available for <a href=\"https://www.bhphotovideo.com/c/product/1604799-REG/apple_mgnr3ll_a_mac_mini.html/kw/APMGNR3LLA/BI/2696/KBID/3612\"><strong>$649.00</strong></a>, down from $699.00. This price has been more consistent than the 512GB Mac mini, and we've seen it go slightly lower in past sales. It's still among the best online this week compared to other Apple resellers.</p><p>The M1 chip in the Mac mini is Apple's first System on a Chip for Mac, integrating GPU, CPU, RAM, and other components for improved performance and efficiency. The M1 in the Mac mini has an 8-core CPU with four high-efficiency cores and four high-performance cores along with an integrated GPU that has 8 cores.</p><p>In the Mac mini, the M1 chip's CPU offers 3x faster performance than the previous-generation entry-level model and the GPU offers 6x better graphics performance. Machine learning workloads are up to 15x faster thanks to the 16-core Neural Engine, and the Mac mini is 5x faster than the best-selling Windows desktop in its price range.</p><p>If you're on the hunt for more discounts, be sure to visit our <a href=\"https://www.macrumors.com/roundup/best-apple-deals/\">Apple Deals</a> roundup where we recap the best Apple-related bargains of the past week.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/intel-11th-gen-vs-apple-m1-chip-benchmarks/\">Intel Downplays Apple's M1 Chip With 'Carefully Crafted' Benchmarks</a></h3><p>Saturday February 6, 2021 3:17 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Nearly three months after the launch of Apple's rave-reviewed M1 Macs, Intel has fired back, but there are some asterisks involved. In a slideshow shared by PCWorld this week, Intel highlighted what PCWorld described as \"carefully crafted\" benchmarks in an attempt to prove that laptops with the latest 11th Generation Core processors are superior to those with Apple's custom-designed M1 chip. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-dtk-credit-for-developers-increased/\">Apple Ups DTK Mac Mini Return Credit to $500 After Developer Complaints</a></h3><p>Friday February 5, 2021 8:51 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Prior to the release of the M1 Macs, Apple offered developers a $500 Developer Transition Kit (DTK) that included a Mac mini equipped with an A12Z Bionic chip first used in the iPad Pro, 16GB RAM, a 512GB SSD, two USB-C ports, two USB-A ports, and an HDMI 2.0 port. The DTKs were available on a temporary basis, and earlier this week, Apple said that it would soon begin asking developers to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-pauses-car-talks-hyundai-kia/\">Apple Pauses Electric Car Talks With Hyundai and Kia</a></h3><p>Friday February 5, 2021 2:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Multiple rumors over the course of the last week have suggested that Apple has been discussing Apple car manufacturing with Hyundai and Hyundai affiliate Kia, but those talks have paused recently, reports Bloomberg. Apple has also been discussing its Apple Car plans with other automobile manufacturers, so despite rumors suggesting Apple is considering a deal with Hyundai/Kia, Apple could...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/04/apple-watchos-7-4-public-beta/\">Apple Releases First watchOS 7.4 Public Beta With iPhone Unlocking Feature</a></h3><p>Thursday February 4, 2021 2:51 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today seeded the first beta of an upcoming watchOS 7.4 update to public beta testers, with the new beta coming a few days after the release of the first developer beta. The ‌watchOS 7‌.4 update can be downloaded after upgrading your iPhone to the public beta version of iOS 14.5. After installing iOS 14.5, the watchOS 7.4 software should show up as long as you have the Apple Watch...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/top-stories-ios-14-5-beta/\">Top Stories: iOS 14.5 Beta, macOS 11.2 Released, VR Headset and Apple Car Rumors</a></h3><p>It was a big week for software this week, with Apple kicking off a new round of betas for its operating systems with plenty of tweaks and changes in iOS 14.5 and related updates. We also saw the public release of macOS 11.2, which trailed last week's release of iOS 14.4. In other news, we got some significant new rumors about Apple's VR headset project and the Apple Car, while over on our...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/01/imac-apple-silicon-redesign/\">iMac to Get a Whole New Look for Apple Silicon</a></h3><p>Apple's long-awaited iMac with Apple Silicon is expected to arrive this year featuring a complete redesign, according to a range of reports. According to Bloomberg's Mark Gurman, the redesigned iMac models will feature significantly slimmed down bezels around the display. The large aluminum \"chin\" segment, below the display of current iMacs, will be removed entirely for a design that...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/07/iphone-12-risk-magnets-pacemakers/\">Medical Doctors Underline Potential Risk of iPhone 12 Interference With Pacemakers</a></h3><p>Sunday February 7, 2021 4:11 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple's warning to keep the iPhone 12 away from cardiac devices due to electromagnetic interference was further underlined by U.S. cardiologists this week in a new report (via NBC25 News). Apple's iPhone 12 series includes an array of magnets that help align the phone on Apple's MagSafe charging accessory to maximize charging, and Apple already advises users with implanted pacemakers and...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/03/camera-comparison-iphone-12-samsung-galaxy-s21/\">Blind Camera Comparison Video: iPhone 12 Pro Max vs. Samsung Galaxy S21 Ultra</a></h3><p>Wednesday February 3, 2021 12:55 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Samsung in January debuted its latest flagship smartphone lineup, which includes the Galaxy S21 Ultra, a direct competitor to the iPhone 12 Pro Max that Apple introduced in October. In our latest YouTube video, we pitted the two smartphones against one another for a blind camera comparison. Subscribe to the MacRumors YouTube channel for more videos. In the video up above and the photos in...</p></div></div></div></div>","author":"Mitchel Broussard","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a5f862d86632fc77012da1ed209033d7acb94afccb3324ee0cec187e75a5e740","category":"Apple"}