{"title":"Adobe Photoshop now runs natively on M1 Macs","link":"https://arstechnica.com/?p=1748550","date":1615414251000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Apple Silicon —</h4><h2 itemprop=\"description\">Other M1-native apps that hit this week include 1Password and DaVinci Resolve.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Photoshop-mac-800x442.png\" alt=\"Adobe Photoshop in macOS Big Sur.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Photoshop-mac.png\" data-height=\"1593\" data-width=\"2885\">Enlarge</a> <span>/</span> Adobe Photoshop in macOS Big Sur.</p><p>Samuel Axon</p></figcaption></figure><p>After a multimonth beta period, software company Adobe has publicly released a version of its Photoshop image-editing software that runs natively on M1 Macs like the late 2020 models of the MacBook Air, Mac mini, and 13-inch MacBook Pro.</p><p>In a <a href=\"https://blog.adobe.com/en/publish/2021/03/10/adobe-photoshop-ships-on-macs-with-apple-silicon-gains-speedier-selections-filters-and-performance-boosts.html#gs.v8o1o7\">blog post</a> announcing the release, Adobe's Pam Clark claims that Photoshop will now run \"significantly\" faster on M1 Macs. Here's a snippet:</p><blockquote><p>Our internal tests show a wide range of features running an average of 1.5X the speed of similarly configured previous generation systems. Our tests covered a broad scope of activities, including opening and saving files, running filters, and compute-heavy operations like Content-Aware Fill and Select Subject, which all feel noticeably faster. Our early benchmarking also shows that some operations are substantially faster with the new chip.</p></blockquote><p>Adobe says it plans to continue optimizing and improving the Apple Silicon version of Photoshop, naturally. And to that point, the blog post notes a couple of features that didn't make it to this initial public release for the architecture: Invite to Edit Cloud Documents and Present Syncing. There are a few others that aren't named in the post, but the post does point out that they're mostly features that were only recently added to other Photoshop builds.</p><p>The announcement about M1/Apple Silicon support was accompanied by the introduction of an entirely new feature that&nbsp;<em>is</em> available on this platform, though: the Camera Raw plugin will get \"Super Resolution,\" which is basically a machine-learning-driven version of the oft-mocked \"enhance!\" functionality seem in TV crime procedurals and sci-fi films. Trained on a large data set, Super Resolution attempts to double both the vertical and horizontal resolutions of an image. It improves on similar features that were already available in Photoshop but which had more limitations.</p><p>(On a related note, Adobe also says it has added two new features to Photoshop for iPad: \"Cloud Documents Version History,\" and \"Make Cloud Documents Available Offline.\")</p><p>Adobe had already brought its Lightroom photo-editing and management application to Macs running on Apple's new chips, and it is working on others as well.</p><p>All told, this has been a relatively eventful week for M1 software support. Microsoft's <a href=\"https://arstechnica.com/gadgets/2021/03/visual-studio-code-now-runs-natively-on-m1-macs/\">Visual Studio Code</a> received a widely available M1 version for the first time a few days ago, and we've also seen Apple Silicon-native versions of CorelDRAW, Octane X, DaVinci Resolve, and 1Password roll out this week.</p></div></div>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a62b84708acb1879ffe33ae545a2575646ef1ad3b55d511dc0e14960da484b5e","category":"Tech"}