{"title":"Garmin launches new Rally power pedals for all types of riding","link":"https://www.cyclist.co.uk/reviews/9404/garmin-rally-power-pedals","date":1616509990000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Garmin has launched the new Rally power pedals which are purpose-built units that measure total power, cadence and what the brand calls 'advanced cycling dynamics' – including left/right balance, power phase and more on any ride.</p><p>Key to the launch is that the family of pedals can now be used for all types of riding from road to mountain to gravel and more.</p><p>However, arguably the biggest news is that the new type of pedals – the RS – is compatible with Shimano SPD-SL cleats. Combined with the SPD option elsewhere in the family of pedals this is something of a coup for Garmin.</p><p>Until now, the only way to use a Shimano SPD-SL compatible pedal-based power meter was to buy a retro fit kit for the Garmin Vector 2 power pedals, which plugged into Ultegra pedal bodies.</p><p>Shimano is known for being protective about licensing its cleat system, so it really is a boon that Garmin has been able to produce the new Rally RS pedals to be compatible with SPD-SL cleats.</p>&nbsp;<h3>Spindle versatility</h3><p>The Garmin Rally power meter pedals have been designed with the sensors housed in the pedals on a removable spindle, the idea being that every ride can now be measured and used for training – should that appeal to riders.</p><p>Garmin says that 'the Rally power meters deliver reliable, accurate data on every training session'.</p><p>Beyond a raw power figure, the dual-sided option of the new Rally pedals will give cyclists right and left-side data metrics independently while also measuring cadence, total power and those aforementioned 'advanced dynamics'.</p><p>A further metric, which isn't something I've measured before but would be interested to see some numbers on, is the ability to gauge time spent seated or standing.</p><p>As someone with a habit of tackling every climb in my local area out of the saddle and then having to make a conscious effort to stay seated when riding longer climbs on Mallorca or in the Alps, I'll benefit from a motivation to sit and spin on the short climbs of the Surrey Hills.</p><p>The purpose of this, Garmin says, is to allow 'the dual-sensing pedals to track time spent seated versus standing so riders can gauge position effectiveness and where power is applied on the pedal to ensure proper cleat position'.</p><p>The new product range also includes lower-priced, single-sensing options. These single-sided versions of the&nbsp;Rally RK100, Rally RS100 and Rally XC100 use the forces detected on the left pedal to measure both cadence and power. Garmin assures us that these 'can easily be upgraded later to the dual-sensing system'.</p><p>'We know cyclists are out there training to improve their performance every day, and we have created a power meter that they can depend on to help them achieve their goals,' says Dan Bartel, Garmin vice-president of worldwide sales.</p><p>'These Rally pedals have undergone rigorous testing to ensure we are not only providing cyclists with a superior pedal design, but with a power meter that riders can rely on to take their training to the next level.'</p><p><a href=\"https://www.garmin.com/en-GB/search/?query=Rally\" target=\"_blank\"><em><strong>Shop the full range of Garmin Rally pedals</strong></em></a></p><h3>Types of Garmin Rally pedals</h3><p>The new Garmin Rally power meter pedals are available in single- and dual-sensing pedal options. However, it's the expansion of the range to cover different riding terrains as well as cleat types that makes the new range of Garmin Rally power pedals suitable for all types of riding.</p><h4>Gamin Rally RK100 and Rally RK200</h4>&nbsp;<p>These have been made for road cyclists and continue the trend of previous Garmin power pedals due to their compatibility with Look Keo cleats.</p><p><em><strong>Buy Garmin Rally <a href=\"https://buy.garmin.com/en-GB/GB/p/699230/pn/010-02388-01\" target=\"_blank\">RK100</a> or <a href=\"https://buy.garmin.com/en-GB/GB/p/699171/pn/010-02388-00\" target=\"_blank\">RK200</a> pedals</strong></em></p><h4>Garmin Rally RS100 and Rally RS200</h4>&nbsp;<p>These are also for road cyclists but come with new compatibility with Shimano SPD-SL cleats.</p><p><em><strong>Buy Garmin Rally&nbsp;<a href=\"https://buy.garmin.com/en-GB/GB/p/658661/pn/010-02388-03\" target=\"_blank\">RS100</a>&nbsp;or&nbsp;<a href=\"https://buy.garmin.com/en-GB/GB/p/658593/pn/010-02388-02\" target=\"_blank\">RS200</a>&nbsp;pedals</strong></em></p><h4>Garmin Rally XC100 and Rally XC200</h4>&nbsp;<p>These are arguably the most versatile offering due to the versatility of riding that this style of pedal is applied to: gravel, mountain biking, cyclocross, touring, commuting.</p><p>The Rally XC pedals are compatible with Shimano SPD cleats for all types of riding away from pure road cycling.</p><p><em><strong>Buy Garmin Rally <a href=\"https://buy.garmin.com/en-GB/GB/p/658586/pn/010-02388-05\" target=\"_blank\">XC100</a>&nbsp;or&nbsp;<a href=\"https://buy.garmin.com/en-GB/GB/p/658594/pn/010-02388-04\" target=\"_blank\">XC200</a>&nbsp;pedals</strong></em></p><h3>Spindle cross-compatibility</h3>&nbsp;<p>For those riding a range of disciplines – perhaps racing cyclocross in the winter or planning a touring trip when we can travel again – it's possible to switch between pedal types with a single Garmin power meter spindle.</p><p>Garmin offers 'conversion kits' (pedal housings) into which the power spindle can be switched.</p><p>While presenting the new products, Garmin gave no definitive expectation as to how often it would be practical to change pedals so this is likely to come down to personal preference and each rider's bicycle maintanence ability.</p><h3>Pricing</h3><p>The new Garmin Rally power pedals are vailable now across a range of price points.</p><p>The dual-sensing pedals range in price from £969.99 to £1,059.99, the single-sensing pedals range in price from £569.99 to £619.99, the optional upgrade pedals range in price from £489.99 to £529.99, and the conversion kits range in price from £179.99 to £219.99.</p><p><a href=\"https://www.garmin.com/en-GB/search/?query=Rally\" target=\"_blank\"><em><strong>Shop the full range of Garmin Rally pedals</strong></em></a></p><h3>Full review to follow</h3><p>We're now in possession of a pair of the Garmin Rally RK200 power pedals, with a full review to follow on <a href=\"https://www.cyclist.co.uk/reviews\">cyclist.co.uk/reviews</a> in the coming weeks.</p><p>Garmin pushes the pedals' compatibility with its own head units, naturally, but this review will be done with them connected to a Wahoo Elemnt Roam – which could add a dimension to the analysis.</p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"a6437155082d9521f18a376599dfc10dbabdd6d430ac47b40cf99eaf647e4747","category":"Cycling"}