{"title":"Quite the Turnaround","link":"https://finance.yahoo.com/news/robinhood-ceo-retail-investors-have-felt-like-they-have-been-talked-down-to-are-now-empowered-214947293.html","date":1611858650000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>InvestorPlace</span></p><h4><a data-uuid=\"be215c36-3ad6-3000-884f-1f8d1f970709\" href=\"https://finance.yahoo.com/news/7-growth-stocks-won-t-174943675.html\" data-ylk=\"elm:hdln;itc:0;pos:1;sec:strm;subsec:moreforyou;cpos:3;ct:story;g:be215c36-3ad6-3000-884f-1f8d1f970709\" data-hosted-type=\"HOSTED\" data-wf-caas-prefetch=\"1\" data-wf-caas-uuid=\"be215c36-3ad6-3000-884f-1f8d1f970709\" data-rapid_p=\"3\" data-v9y=\"0\">7 Growth Stocks That Won’t Be Stopped in 2021</a></h4><p>Investors typically love growth stocks with exciting stories. That’s because they promise powerful upside potentials and can increase revenue and earnings faster than their peers. So, the prospect of investing in these kinds of picks should appeal to many investors. However, above-market growth potential also suggests higher-than-average risk. In fact, recent research by scholars at the University of Akron highlighted,“Growth stocks are expected to be currently trading at prices higher than their intrinsic value because of the growth potential.” Similarly, researchers at Rowan University note that “growth stocks have a greater sensitivity to most major stock market declines.” In other words, there’s little safety margin for investors if a business fails to grow as quickly as expected. Growth stocks are priced for perfect execution, without much room for error. A stock can easily plummet if the company fails to meet expectations.InvestorPlace - Stock Market News, Stock Advice &amp; Trading Tips But broader markets and growth names have shown significant momentum in the past year. As a result, market participants find it challenging to balance the predictability of future returns and the high valuation levels we’re currently seeing. Therefore, it’s crucial to find the right picks to maximize your odds of success in the long-run. Some may carry less risk than others, based on their competitive advantages, market positioning or size. 8 Biometric Stocks to Consider as We Eye a Return to Normal With that in mind, the following stocks carry a certain business momentum and long-term potential into 2021: Blackrock Future Innovators ETF (NYSEARCA:BFTR) Cloudera (NYSE:CLDR) Crowdstrike (NASDAQ:CRWD) Direxion Work From Home ETF (NYSEARCA:WFH) iShares Expanded Tech-Software Sector ETF (BATS:IGV) Ørsted (OTCMKTS:DNNGY) Upwork (NASDAQ:UPWK) Growth Stocks to Buy: BlackRock Future Innovators ETF (BFTR) Source: Shutterstock 52-Week Range: $35.22 — $53.67Expense Ratio: 0.8%, or $80 on a $10,000 investment First on my list of growth stocks is actually an exchange-traded fund (ETF), the Blackrock Future Innovators ETF. This fund seeks long-term capital appreciation by holding innovative companies. Its focus is small-cap and mid-cap businesses. As an actively managed fund, its managers also target industries they believe could impact the future of the global economy. BFTR stock — which has 62 holdings — tracks the Russell 2500 Growth Index. As a new fund, it started trading in late September and currently has about $11.3 million under management. The Information Technology and Health Care sectors have the highest weighting in the ETF, each with a little over 30%. They’re followed by Consumer Discretionary stocks at 16.51%, Industrials at 10.74% and Consumer Staples at 5.4%. The fund’s holdings include companies like law enforcement technology solutions provider Axon (NASDAQ:AXON), the online car-buying platform Vroom (NASDAQ:VRM) and the patient-intake software solutions provider Phreesia (NYSE:PHR). BFTR returned close to 40% in the last three months. In other words, $1,000 invested in the fund before that period would now be worth around $1,400. So far this year, the ETF has returned about 14% year-to-date (YTD). As the busy earnings season marches on, investors should be ready for increased volatility. While the fund’s investment proposition is solid, this ETF could also come under pressure in the short-run. Any decline of 5% to 7% from the current levels would improve the margins of safety for long-term investors. Cloudera (CLDR) Source: Shutterstock 52-Week Range: $4.76 — $16.19 Cloudera provides enterprise software for cloud platforms that can be used for data management and analytics. Back in early December, the company released its third-quarter results. Revenue was $217.9 million, representing an increase of 10%. Non-GAAP net income came at $47.7 million, compared to the non-GAAP net loss of $7.9 million in the prior year. That means non-GAAP net income per share came in at 15 cents, compared to a net loss of 3 cents per share in Q3 last year. Finally, cash and equivalents were $567.5 million. In the company’s report, CEO Rob Bearden said: “We believe that Cloudera has never been better-positioned to capture more of the rapidly growing data management and analytics market opportunity for hybrid multi-cloud solutions. As a result, we have announced today that the board has authorized the repurchase of an additional $500 million in shares of our stock.” 7 Blue Chip Stocks to Help Prepare For Your Retirement CLDR stock’s forward price-to-earnings and price-sales ratios are 40.64 and 5.56, respectively. So far, in the past 12 months, the stock is up over 58%. For this pick of the growth stocks, investors can see potential dips as buying opportunities. I believe there is more upside potential on the table. Crowdstrike (CRWD) Source: VDB Photos / Shutterstock.com 52-Week Range: $31.95 — $238.54 If you’re looking for a stock that returned triple-digit gains in 2020, CRWD stock should be on your radar. The company is a cloud-based cybersecurity provider. For the past one year, it’s up over 250%, pushing its market capitalization to $49.4 billion. As companies rush to secure their online presence, cybersecurity firms like Crowdstrike benefit. Many Fortune 500 businesses currently trust the company for preventing security breaches online, relying on its Falcon cloud platform which uses machine learnings (ML) and artificial intelligence (AI). Crowdstrike released strong Q3 earnings at the start of December. Revenue was $232.5 million, a jump of 86% from the prior year. The firm also netted 1,186 new subscription customers, bringing its total customers to almost 8,500. Annual recurring revenue also went up by 81% YOY, growing to $907.4 million. Finally, non-GAAP net income was $18.6 million, translating into a diluted net income per share of 8 cents. A year ago, the metrics had been a $13.4 million loss, or a loss of 7 cents per share. However, CRWD stock’s current forward price-earnings and price-sales ratios — 769.23 and 60.74, respectively — indicate a frothy share price. So, interested investors should watch this one of the growth stocks carefully. A decline toward $200 would make its price much more attractive for the long run. Direxion Work From Home ETF (WFH) Source: Shutterstock 52-Week Range: $49.20 — $74.08Expense Ratio: 0.45% My next pick on this list of growth stocks is another exchange-traded fund, the Direxion Work From Home ETF. This fund provides exposure to businesses that are likely to benefit from a flexible approach to the work environment. Its holdings focus on cybersecurity, cloud technology, remote communications and online project management. Since Direxion’s inception in late June, net assets have grown to nearly $174 million. WFH stock — which represents some 40 holdings — tracks the returns of the Solactive Remote Work Index. Its top ten holdings comprise around 33% of the roster and include Plantronics (NYSE:PLT), FireEye (NASDAQ:FEYE) and Palo Alto Networks (NYSE:PANW) among others, the last of which InvestorPlace’s Josh Enomoto named one of the best stocks in the technology sector. The Top 7 Hot Stocks to Buy for 2021’s Biggest Trends WFH started trading at an opening price of around $50 but this past year saw the fund hit record highs. Currently, it’s hovering around $73 and has returned close to 30% in the last three months. So, long-term investors who believe the work-from-home trend has legs in the new year should consider investing, especially if the price dips toward $65. iShares Expanded Tech-Software Sector ETF (IGV) Source: Shutterstock 52-Week Range: $176.23 — $376Expense Ratio: 0.46% The pandemic has provided tailwinds for digitalization trends. As a result, many software shares have powered ahead. And the iShares Expanded Tech-Software Sector ETF is no exception to those results, mainly investing in interactive media software companies, technology and communication services. IGV stock — which represents 116 holdings — tracks the S&amp;P North American Expanded Technology Software Index. It began trading in July of 2001 and has over $5.9 billion in net assets. As far as sector allocations are concerned, Application Software leads the fund with almost 62.6%, followed by Systems Software at 28.6% and Interactive Home at 6.3%. The fund is equally weighted and rebalances semi-annually. More than half of the fund is invested in its top ten holdings. These include businesses like tech giant Microsoft (NASDAQ:MSFT), customer relationship management (CRM) enterprise software provider Salesforce.com (NYSE:CRM) and Adobe (NASDAQ:ADBE), which is well-known for its multimedia and creativity software products. In the past one year, the ETF returned nearly 45%, hitting a record high in late December and then another today, on Feb. 5. Right now, though, its valuation is on the frothy side. So, investors who expect this one of the growth stocks to give up its recent gains in the coming weeks could find a better long-term value around $345. Options are also available on the fund. That means experienced investors can devise more complex strategies with this name, too. Ørsted (DNGGY) Source: Shutterstock 52-Week Range: $27.31 — $76.47 Our next stock on this list of growth stocks comes from overseas. Denmark-based Ørsted is a leading energy company in Northwestern Europe. It operates through three segments: Wind Power, Bioenergy and Thermal Power and finally Distribution and Customer Solutions. Ørsted is one of the leading names in the global offshore wind market. So, if you believe the new decade will see increased growth in the alternative energy space, DNGGY stock needs your attention. According to the company’s most recent earnings report, total revenue decreased 35% to 10 billion DKK (about $1.62 billion), down from 15.5 billion DKK ($2.5 billion) a year ago. Operating profit (EBITDA) for the first nine months of the year was 3.4 billion DKK ($550 million). The company’s management highlighted: “In August, we completed the divestment of our Danish power distribution (Radius), residential customer and city light businesses to SEAS-NVE. The divestment marks an important strategic milestone for Ørsted, and completes our portfolio transformation into a global renewable energy company.” 7 Safe Stocks to Buy for Solid Returns in Tumultuous Times For the past one year, DNGGY stock is up about 74%. The stock’s forward price-earnings and forward price-sales ratios are 42.73 and 8.92. In other words, from a historical valuation standpoint, the shares are rich. So, potential investors who are interested in the growth of green energy in Europe should wait for a drop below $60. Upwork (UPWK) Source: Sundry Photography / Shutterstock.com 52-Week Range: $5.14 — $51.21 The last stock one this list of growth stocks is Upwork, a freelancing platform. Last year provided a tailwind for the global work-from-home trend. So, the upcoming quarters will possibly witness more upside for freelancing projects, contract-based work and the gig economy. Upwork went public back in 2018 and released its most recent Q3 metrics this past November. The company showed revenue of $96.7 million, up 24% year-over-year. Analysts were also pleased to see the gross margin increase to 73%, up by two percentage points. Finally, Upwork’s non-GAAP net income was $5 million or 4 cents per share, compared to $1.1 million or 1 cent per share in the year-ago period. On the report, CEO Hayden Brown noted: “As the world’s largest work marketplace that connects businesses with independent talent, as measured by gross services volume, we have been building capabilities and tools for a world now increasingly ready to use them.” Over the past year, UPWK stock is up nearly 450%. It’s price-book and forward price-sales ratios are 21.34 and 16.49, respectively. Like other stocks on this list, that makes its valuation frothy. So, a potential decline toward $40 or even below that would improve the margin of safety. On the date of publication, Tezcan Gecgil did not have (either directly or indirectly) any positions in the securities mentioned in this article. Tezcan Gecgil has worked in investment management for over two decades in the U.S. and U.K. In addition to formal higher education in the field, she has also completed all 3 levels of the Chartered Market Technician (CMT) examination. Her passion is for options trading based on technical analysis of fundamentally strong companies. She especially enjoys setting up weekly covered calls for income generation. More From InvestorPlace Why Everyone Is Investing in 5G All WRONG Top Stock Picker Reveals His Next Potential Winner It doesn’t matter if you have $500 in savings or $5 million. Do this now. #1 Stock for the Green Energy Boom The post 7 Growth Stocks That Wonât Be Stopped in 2021 appeared first on InvestorPlace.</p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"a71165320da80237cc2c22b7b407e70bb4e9fa7e7279d0d56bb55cace67aad8c","category":"Tech"}