{"title":"2011 / 2554","link":"https://iannnnn.com/2020/2697","date":1578593193000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"content\"><main id=\"main\" role=\"main\"><article id=\"post-2697\"><div><p>ทำไปทำมาก็ดองจนได้ นี่ไงล่ะ ยุคบล็อกตายแล้ว 5555 โอเคเล่าต่อเลยละกันครับ</p><ul><li>อายุ 29 ปี เรียกว่าเป็นช่วงสุดท้ายของวัย(ที่คิดว่าตัวเองยัง)รุ่นแล้วมั้ง</li><li>ยุคทองของเว็บฟอนต์สิ้นสุดลงแล้ว เพราะการมาของเฟซบุ๊ก ตอนนี้กลุ่มเพื่อนกลุ่มใหญ่ที่เคยนัดไปไหนมาไหนได้ทีละเยอะๆ เริ่มห่างๆ กัน เราก็ไม่ได้ต่างจากใคร เหลือไปมาหาสู่กันจริงๆ แค่ไม่กี่คน (ส่วนใหญ่ไปกลิ้งแถวๆ คอนโดผัวเมียเมืองทอง)</li><li>แน่นอนว่าเราเข้าใจและทำนายปรากฏการณ์นี้มาหลายปีแล้ว นอกจากวิถีโซเชียลที่เริ่มเปลี่ยนไปแล้ว ภาระหน้าที่และชีวิตแต่ละคนที่เติบโตขึ้น บางคนมีครอบครัว บ้างก็มีการงานที่ทำให้เวลาว่างพร้อมกันเยอะๆ มาสังสรรค์เฮฮาโพนยางคำแบบเมื่อก่อน ค่อยๆ ลดน้อยลง</li><li>แต่ก็ยังอุตส่าห์มีมีตติ้งต่างจังหวัดกันได้อยู่นะ ได้แก่การไปเที่ยวแพเมืองกาญจน์ + ไปสวนผึ้ง ซึ่งน่าจะเป็นครั้งท้ายๆ แล้วที่ยกขบวนกันไปเยอะมาก นอกนั้นจะเป็นงานมีตติ้งที่บ้าน เอาของกินมาแชร์กัน หรือจัดงานฟอนต์แคมป์ (เลียนแบบ BarCamp ที่แต่ละคนออกไปพูดแชร์นั่นนี่ ถึงแม้จะเป็นวงปิด แต่ก็ทำกันหลายครั้ง อย่างจริงจังด้วยนะ แล้วได้อะไรเยอะมากจริง)</li><li>ตอนนั้นที่ทำเว็บฟอนต์แล้วมีตังค์ค่าโฆษณาเข้ามา ก็ประกาศชัดเจนว่านอกจากจะเอาไปบริจาคโรงเรียนต่างจังหวัดแล้ว ก็มีเอามาเที่ยวหรือกินอะไรกันนี่แหละ (ทำไมวัตถุประสงค์เหมือนกับการทำพอดแคสต์ในทุกวันนี้เลยวะ 5555 แสดงว่าโมเดลนี้เราแฮปปี้จริง)</li><li>ช่วงนั้นเว็บเฟลกำลังไปถึงจุดสูงสุด เราใช้ชีวิตหลังเลิกงานมานั่งใส่หมวกเฟลาธิการ นั่งคัดแยกขยะ เปิดอีเมล พิจารณา ขยำมุกทิ้ง อันไหนผ่านก็โพสต์ขึ้นหน้าเว็บแบบตั้งเวลาไว้ วันละ 7 โพสต์ ทำคนเดียวแบบแมนวลนี่แหละ</li><li>ที่ประทับใจคือปีนั้นมีหนังเรื่อง “SuckSeed ห่วยขั้นเทพ” ทีมหนังเขาถึงกับเอาเว็บเฟลไป x ด้วย มีเสื้อลิมิเต็ดเอดิชันรูปเป็ดเหลืองด้วย แถมน้องพีชก็บอกเราว่าเป็นติ่ง 555 เออเหมือนคนแก่รำลึกความหลังดี ตอนนี้น้องแม่งไม่มีทางจำได้แล้วล่ะ</li><li>วงการฟอนต์ไทยก็ผ่านพ้นยุคคลำทาง มีหลายๆ คนเปิด Foundry ของตัวเอง มีการประกวดออกแบบฟอนต์ (เราเป็นหนึ่งในคณะกรรมการ) พวกความรู้ต่างๆ เริ่มขยับมาสู่โลกออนไลน์อย่างแข็งขัน เรียกว่าไม่ต้องงมกันอีกต่อไป</li><li>แต่น่าเสียใจที่เราดันห่างจากการทำฟอนต์ไปเลย เรียกว่าเลิกเลยก็ว่าได้ เพราะดันไปสนใจเรื่องอื่นอีกมากมายที่ประเดประดังเข้ามาในชีวิตช่วงที่รู้สึกว่าตัวเองบันเทิงกับการโอบรับสิ่งต่างๆ เข้ามา</li><li>ใช้มือถือ <a rel=\"noreferrer noopener\" aria-label=\"Nokia 1280 (opens in a new tab)\" href=\"https://en.wikipedia.org/wiki/Nokia_1280\" target=\"_blank\">Nokia 1280</a> ใช่แล้ว เป็นมือถือกากๆ ราคาแค่ไม่ถึงพัน ไม่มีจอสีหรือแอนดรอยด์ แต่นั่นแหละ มือถือเอาไว้โทรหาเมียอย่างเดียว คือจะโชว์ว่าตัวเองเป็นคนคูล แต่ไม่น่าจะอยู่นานนะเท่าที่จำได้</li><li>จริงด้วย หลังจากนั้นก็ใช้ HTC Legend (มือสอง) ซึ่งเรายังรักในดีไซน์ของมันมาจนทุกวันนี้</li><li>เออ หลังๆ ไม่ค่อยได้เล่าว่าตัวเองเป็นคนชอบถ่ายรูป คงเพราะสไตล์ภาพมันเก่าไปแล้วเมื่อเทียบกับวิถีอินสตาแกรม (เราไปทางนั้นไม่ได้เลยจริงๆ) ซึ่งตอนนั้นใช้กล้อง GF1 แล้วเพิ่งซื้อเลนส์ไวด์ 9-18mm มาใช้ เพื่อจะตกหลุมรักมันอย่างจัง ชอบถ่ายไวด์จังโว้ย</li><li>นอกนั้นก็ยังซื้อกล้องฟูจิที่กันน้ำได้ด้วยมาอีกอัน เออ มานึกดูก็ซื้อเลื่อนเปื้อนเหมือนกันนะ ถ้าเป็นเดี๋ยวนี้คงไม่ซื้อหรอก คงเพราะตอนนั้นลูกก็ยังไม่มี บ้านก็ผ่อนอย่างรวดเร็ว กิจการก็ไปได้ดี งานประจำก็ทำเงินโอเค ผ่านการไต่เต้ามาจากปีก่อนที่ยังจนอยู่เลย มาปีนี้กลายเป็นคนที่ซื้อของเล่นเยอะๆ ได้แล้ว</li><li>มีแกดเจ็ตอะไรเล่นอีกหว่า อ้อ คินเดิล รุ่นแรกๆ เลยมั้ง ตั้งแต่ยังไม่มีไฟในจอน่ะ ถือว่าคุ้มค่าและสนุกดี เป็นช่วงเวลาสั้นๆ ที่ซื้อของ Amazon มาใช้ แล้วก็ประทับใจที่มันต่อเน็ตฟรีโดยไม่ต้องใช้อะไรเลย แต่หน้าเว็บเป็นสีขาวดำ รีเฟรชเรตต่ำสุดเพราะเป็น E-ink น่ะนะ 5555</li><li>เฮ้ย บ้าจริง เพิ่งนึกได้ เราซื้อไอแพดใช้ด้วย! (iPad 2) จำได้ว่าบัดซบมาก โคตรไม่ประทับใจใดๆ ไม่ถูกจริตอย่างสิ้นเชิง ใช้ไปได้แค่สักพักก็ขายทิ้งไป</li><li>ตอนนั้นไม่รู้ไปตกอยู่ในหลุมอะไร มีคนชวนไปงานเปิดตัวมือถือบ่อยๆ สารภาพว่าเราไม่ชอบบรรยากาศเลยสักงาน คือเราเนิร์ดและไม่ค่อยสันทัดการพบปะผู้คนที่ไม่รู้จัก หรือเคมีไม่ตรงกัน และนำพาสู่บรรยากาศปาร์ตี้แบบนั้น แต่ด้วยความอยากเห็นอยากเล่นของเล่นก่อนใคร ก็เลยไป 5555 แล้วยืมมือถือเขามาเขียนรีวิวด้วยนะ เห็นเราเป็นสื่อเหรอ ได้</li><li>นอกจากของเล่นแล้วก็ยังมีของกินนี่แหละ ก่อนหน้านี้ไม่เคยได้กินอาหารญี่ปุ่น (อย่างมากคือเนื้อย่าง หมูกระทะ) แต่พอมาถึงยุคที่ร้านอาหารญี่ปุ่นมันเบ่งบานในเมืองกรุง แล้วเราก็พร้อมจ่าย ดังนั้นกลุ่มเพื่อนเก่าใหม่ก็เลยนัดกันไปโจ้อยู่บ่อยๆ ในอัลบั้มภาพมีแต่แซลมอนนอนเรียงในจานน้ำแข็ง</li><li>นี่พูดเรื่องฐานะการเงินอันสามล้อถูกหวยมาหลายบรรทัด คือจะบอกว่า หลังจากนั้นมันไม่สวยหรูเหมือนเดิมละ ฝากติดตามอ่านของปีถัดๆ ไปจ้า</li><li>มาเรื่องงานกันบ้าง หลังจากอิ่มตัวสุดขีด เราจึงลาออกจากการทำงานบริหาร กะว่าออกมาเป็นฟรีแลนซ์เหมือนเดิม ซึ่งเป็นเซฟโซนของเรา (ของคนอื่นอาจจะเป็นงานประจำ แต่เราไม่ งานประจำเรามองเป็นโปรเจกต์ใหญ่ก่อนนึงเท่านั้นเอง สำหรับงานที่ผ่านมาใช้เวลาทำเกือบๆ สองปี กินเวลานอนเราไปพอสมควร)</li><li>เป็นฟรีแลนซ์ได้ไม่นานอย่างที่คิด พี่เม่นที่เคารพรักจากวงการเวิร์ดเพรสก็มาชวนไปเสริมทัพในดิจิทัลเอเจนซีที่จะเปิดตัวใหม่ ตอนนั้นคิดว่าถ้าพี่เม่นชวนทำโปรเจกต์สักอย่างมันก็ควรสนุกแหละ แต่ขอดูท่าทีก่อน ถ้าไงยื่นข้อเสนองี่เง่าไป (เช่นขอใส่รองเท้าแตะ) แล้วเขาไม่รับ ก็จะไม่เอา</li><li>ปรากฏว่าเขาเอา แล้วเราเลยไปเป็นกราฟิกควบๆ อาร์ตไดอยู่ที่บริษัทนี้ยาวเลย สองปี ไหนล่ะชีวิตฟรีแลนซ์อันแสนสุขของกู</li><li>แต่เมียที่ลาออกมาจากที่เก่าด้วยกันนั้น เลือกอยู่บ้าน สานต่อกิจการ<a rel=\"noreferrer noopener\" aria-label=\"สกรีนเสื้อ (opens in a new tab)\" href=\"https://monamafia.com/\" target=\"_blank\">สกรีนเสื้อ</a> และ<a rel=\"noreferrer noopener\" aria-label=\"ตัดเย็บเสื้อผ้าผู้หญิงขาย (opens in a new tab)\" href=\"https://nalinfa.com/\" target=\"_blank\">ตัดเย็บเสื้อผ้าผู้หญิง</a>ขาย</li><li>เนี่ย เพิ่งมานึกได้ตอนพิมพ์เนี่ยแหละว่าที่ผ่านมาเป็นสิบๆ ปีมานี้ เราสองคนก็ผ่านความปากกัดตีนถีบ ทำงาน 3-4 อาชีพ รวมถึงงานพ่อค้าแม่ขายมานานมากแล้วเหมือนกัน ไม่เคยมีช่วงไหนเลยที่จับแค่อาชีพเดียวเลยนี่หว่า นี่ล่ะมั้งเลยทำให้รู้สึกว่าเรามีเซฟโซนของตัวเองอยู่แล้ว และระบบที่วางไว้ทั้งหมดก็เพื่อจะให้งานในแต่ละวันไม่ต้องใช้พลังเยอะ คือเหลือเวลาเยอะๆ มาชิลเยอะๆ</li><li>แต่เราก็เสือกเริ่มต้นชีวิตพนักงานบริษัทอีกครั้งจนได้…</li><li>ปีนั้นมีงานเปิดตัวสำนักพิมพ์ใหม่คือแซลมอน เราไปดูเพื่อนแชมป์เปิดตัวหนังสือของตัวเอง บรรยากาศแปลกประหลาดดี คือที่ผ่านมาจะไปงานฝั่ง Dev ซะมาก มันก็จะเนิร์ดๆ แต่อันนี้ไม่ ดูน้องๆ ในย่านนั้นมีสไตล์เป็นอีกแบบ อธิบายไม่ถูก (ในกาลต่อมาเราเรียกอะไรแบบนี้เล่นๆ ว่าเป็นบรรยากาศแบบแซลมอนๆ)</li><li>ปีนั้นการเมืองคลายความดุเดือดหลังจากผ่านปี 53 มาสักพัก ด้วยรสนิยมเราไม่ได้อะไรกับฝั่งไหนเป็นพิเศษ คือเป็นคนไม่อินอยู่แล้ว (ซึ่งก็มีคำว่าไทยเฉยบ้าง ignorant บ้าง ไว้จัดประเภทคนแบบเรา คือเลวตลอดแหละ) แต่ก่อนหน้านี้ตั้งแต่สมัยเรียนเสพ Open มาตลอด แล้วเขาด่าทักษิณ ไอ้ความทักษิณเลวมันก็ยังเหลือๆ ฝังอยู่ในสมอง ก็เรียกตัวเองว่าสลิ่มนะ (ตอนนั้นคำนี้ยังไม่แรงเป็นยักษ์มารอย่างทุกวันนี้) แต่สุเทพก็เหี้ยไง… พอเลือกตั้ง จำได้ว่าสุดท้ายก็ไม่ได้เลือกใคร เพราะรักไม่ลงจริงๆ</li><li>อย่างน้อยลูกค้าโมนามาเฟียคนนึงก็คือพานทองแท้ สั่งสกรีนเสื้อบ่อยมาก 5555</li><li>เมียท้อง!</li></ul><figure></figure><ul><li>การที่เมียท้องนี่คือเปลี่ยนโลกไปทั้งใบจริงๆ ครับ คือมันใหญ่มากจริงๆ จนเรียกว่าหยุดวิถีชีวิตที่เคยเป็นมา ตัดลอกคราบ-เปลือกเดิม แล้วขยับเข้าสู่ตัวตนใหม่เลย เปลี่ยนชีวิตไปเลย เรื่องนี้เล่าไว้อย่างละเอียดมากๆ ในหนังสือ<a href=\"https://iannnnn.com/2013/1050\">คือป๊ะป๋าครองพิภพ</a>ที่เขียนในปีถัดไป</li><li>ปลายปีนี้น้ำท่วม เราตื่นเต้นและสนุกสนานกับประสบการณ์อันมีค่าระดับนี้อยู่แล้ว ก็เลยขี่จักรยานแม่บ้านลุยน้ำเน่าเพื่อ<a rel=\"noreferrer noopener\" aria-label=\"รายงานสถานการณ์น้ำท่วมทุกวัน (opens in a new tab)\" href=\"https://iannnnn.com/2011/505\" target=\"_blank\">รายงานสถานการณ์น้ำท่วมทุกวัน</a> จะว่าไป นั่นคือ VLOG ในยุคแรกๆ เลยแหละ และภูมิใจในโปรเจกต์นี้มากจริงๆ คือไม่ได้ดังหรือมีคนพูดถึงหรอก ไม่ใช่ประเด็น เพียงแต่มันตอบโจทย์ความอะไรสักอย่างที่ตัวเองมีและเป็นได้อย่างหมดจด คือมันไม่ใช่สถานการณ์ปกติ และเราก็ลงไปขลุกอยู่กับสถานการณ์นั้นได้อย่างที่ไม่มีอะไรเป็นรูทีนสักนิด ก็จดไว้ละกันว่าชอบแบบนี้ เพราะมานึกดูแล้วเหตุการณ์ที่แล้วๆ มา ไม่ว่าจะการไปร่วมม็อบ หรือเกาะติดสถานการณ์ Exclusive สักอย่าง มันก็มีฮอร์โมนประเภทนี้ขับเคลื่อนอยู่ทั้งนั้น เออคือความเสือกนั่นแหละ</li><li>ได้รู้จักเพื่อนใหม่ชื่อหนุงหนิง :) ที่มาพร้อมกับงานสกรีนเสื้อล็อตใหญ่มาก ในโครงการชื่อน้ำใจท่วม หรือประมาณนี้ 5555 เพื่อนำรายได้ส่วนหนึ่งไปสมทบกองทุนช่วยเหลือผู้ประสบภัยน้ำท่วม เรียกว่าปีนั้นร้านสกรีนเสื้อเล็กๆ อย่างโมนามาเฟียไม่ต้องรับงานจากลูกค้าอื่นอีกแล้ว แค่งานนี้ก็หน้ามืดไปหลายตลบ</li><li>ปีนี้ส่งท้ายปีหลังน้ำลดด้วยการกลับไปเป็นมนุษย์เงินเดือนอีกครั้ง เพราะตอนน้ำท่วม ทางบริษัทให้ทำงานที่บ้านได้ แต่พอกลับสู่สภาพปกติ มันก็จะเหี่ยวๆ หน่อย ว่ากันตรงๆ คือ ไลฟ์สไตล์ที่ต้องตื่นเช้า ออกจากบ้านไปทำงาน เย็นกลับบ้านมากินข้าวกับเมีย ซ้ำๆ ทุกวันแบบนี้ไม่ใช่แนวเราเลย ธรรมเนียมอันรุงรังในการที่จะได้ “งาน” มันไม่ใช่วิถีชีวิตแบบที่เป็นเราสักนิด รู้สึกมานานแล้วตั้งแต่ออฟฟิศเก่า พอมาที่ใหม่ ถึงจะได้ทำงานที่ชอบ และมีบรรยากาศที่ดี แต่เมฆฝนก้อนเล็กๆ ก็กำลังตั้งเค้า…</li></ul><p>พบกันใหม่ปีหน้าจ้ะ แม่งกว่าจะเขียนได้แต่ละปี จะครบทศวรรษเมื่อไหร่กัน</p><p><strong>ของปีอื่นๆ:</strong><br><a href=\"https://iannnnn.com/2020/2691\">2010</a> / <a href=\"https://iannnnn.com/2020/2697\">2011</a></p></div></article></main></div></div>","author":"iannnnn","siteTitle":"iannnnn.com","siteHash":"a633e1d87162133e28114b6caf1c887bfa26aadefce69cc40a9feea913e71870","entryHash":"a90da9a8f1b5b48f432aabdec4d26bbc10f801dff17c87f9b268d55816685034","category":"Thai"}