{"title":"Video: New pro kits, bikes, and gear of 2021","link":"https://cyclingtips.com/2021/02/video-new-pro-kits-bikes-and-gear-of-2021/","date":1612811132000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>The season is in full swing, and that means that we now have all the team kits out on the open roads, at the races and in full view for us to pick to pieces.</p><p>Now, I know that that damn Iain here at CyclingTips <a href=\"https://cyclingtips.com/2021/02/mens-worldtour-kits-of-2021-the-good-the-bad-and-the-ugly/\">covered a load of the team kits last week</a>. He was quick of the mark, I’ll give him that. I’ll even give it to him that (as usual) he did a pretty wonderful job at taking apart the peloton’s skintight suits. But let us be honest, really honest! He did it in the old fashioned way, by using stationery images and text. Come on mate, this is 2021.</p><p>What he should have done was switch on the camera, pointed it to the corner of his living room that he attempted to make look like a studio and then let loose on the kits that have delighted his eyeballs and the ones that will abuse his retinas through 2021. He could have even delved a little into the new bits and bobs that several teams are using for this season, helmets, sunnies, groupsets and bikes. That would have been a great little vid.</p><p>Well, as chance would have it, that is exactly what I’ve done.</p><p>There are some great team kits this year, a few teams have upped their style game. On the flip side, others have let themselves down badly. It does make you wonder at times who’s in charge of design choices. I’m guessing someone who really either don’t care or has trouble seeing.</p><p>In this video, you’ll be happy to hear that I’ve not covered every team and their kit choices, for starters I wouldn’t want to bore you too much. Instead, I’ve reined in my choices, I’ve left out the teams that have been unimaginative and done sod-all with the jersey design for a new year and instead handpicked a few stand out examples of the good, the grim, and the downright shoddy.</p><div><h5>Tags</h5></div></div></div>","author":"Dave Everett","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a987f66352a55cb6b97d279959ab75ae70dbc54c56e7ba98f6234ccac32a9e99","category":"Cycling"}