{"title":"Meet Richard Carapaz’s new gold-ish bike","link":"https://cyclingtips.com/2021/08/carapaz-to-ride-a-gold-ish-bike/","date":1628797221000,"content":"<div><div><p>Here’s how it goes: win Olympic Games road race, bite the medal, turn everything gold for four years, or five for GVA, and potentially only three for Richard Carapaz.</p><p>No surprises then that Richard Carapaz will have a freshly painted Pinarello Dogma F for the Vuleta Espana, his first race since winning gold at the ‘Games.</p><p>When Pinarello posted a photo of three gold-painted Dogma F frames in the paint booth last week, everything seemed on track.</p><blockquote></blockquote><p>Fast forward to today and the big reveal to Carapaz of the bike and colour he will see everywhere for the next three years.</p><p>Oh no! Something isn’t quite right. Did someone in the paint room think Carapaz finished third? Or has someone gone ham-fisted at the Instagram filters?</p><blockquote></blockquote><p>The Ineos Grenadiers posted this video of that big reveal on Instagram earlier today, and like a lot of their followers, it left us with questions. Questions like, “is that really gold?” Where did the gold from the paint booth go? This could be a camera trick, but the bike certainly appears more bronze (read Wilier Ramato) than gold.</p><p>No doubting it, the bike is a beauty, and 57,769 people (at the time of counting) seemingly agree, smashing that heart button to vote with their thumbs. But it just ain’t gold, at least in this light.</p><p>A far cry from Greg Van Avermaet’s gold BMC for his first races post-Rio gold, Pinarello has struck an almost perfect balance of “gold” to not-gold ratio with Carapaz’s new bike. The black lower half of the frame with the Grenadiers, Pinarello, and Shimano logos, balances the chrome gold that runs from seat stays, up the seat post, along the top tube, and down the head tube and forks. Perhaps the bike could have benefitted from not having the “GRENADIERS” text along the top tube, and the red Grenadiers logos make the frame a little busy, but they do have three years to perfect these minor details.</p><p>The build is identical to that which Carapaz, and the rest of the Grenadiers, rode before his Tokyo win. Shimano provides the Dura-Ace Di2 groupset, wheels, and pedals. The integrated stem and handlebar is from Pinarello’s components brand, Most. While Fizik, Continental, and Elite provide the saddle, tyres, and bottle cages.</p><p>There is no news yet on how much gold bling Carapaz will have to endure, sorry enjoy, across his kit and helmet.</p></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a9a1f760aaa26b9995a6afc0be2ad77dcadea06aa1fc9f5c219a595c1d874a33","category":"Cycling"}