{"title":"Letter from the Editor: The Women's Issue","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/letter-from-the-editor-the-womens-issue","date":1611766271000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"shopify-section-article-template-editorial\"><article data-section-id=\"article-template-editorial\" data-section-type=\"article\"><div><header><p><span>January 27, 2021</span></p><p></p><meta charset=\"utf-8\"><span>What did you think when you looked at the front cover of this women’s issue?</span><p></p></header><div><p><span>What did you think when you looked at the front cover of this women’s issue? A woman’s mouth, we are told by society, is sensual, sexual. It is there to be consumed, it is </span><span>an</span><span> object. It is the accepted narrative of advertisers, film-makers, storytellers.&nbsp;</span></p><p><span>But a woman’s mouth is also the means through which they tell their stories. It is the gateway through which we women find our voice, a source of our strength, our power, our literal expressions of joy, love and anger. I chose the cover for this issue partly because I wanted to invite us all to look at what we perceive to be fact, the cultural norm, and question how much of it has been shaped, without our agreement or even conscious knowledge, by the male narrative. I wanted to show that the very same world we see around us can be looked at in a different way through female eyes. It’s the same but subtly, or profoundly different, depending on your starting point.</span></p><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Rouleur_FrontCover_Issue101_3000_1024x1024.jpg?v=1611750791\" alt=\"\"></span></p><meta charset=\"utf-8\"><p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/people-will-say-whens-the-mens-issue-then-orla-chennaoui-on-editing-rouleur-s-women-s-issue\"><em><strong>Related – Behind Rouleur's women's Issue</strong></em></a></p><p>The stories you read in this issue are all written with women as the primary focus, but not all by women or even exclusively for women. Men are just as qualified to write and read about women, as women are men. This is not confrontation, but invitation; it is celebration. At a time of intense loneliness and isolation, my wish is to open up this beautiful sport of ours, to be shared as widely and joyfully as possible, whatever your gender, colour or background. From the bottom of my heart, I truly hope you enjoy what we’ve put together.</p><p><a href=\"https://twitter.com/SportsOrla?\" target=\"_blank\" rel=\"noopener noreferrer\">Orla Chennaoui</a></p></div></div></article></div><div data-section-id=\"shop-now\" data-section-type=\"shop-now\" id=\"shopify-section-shop-now\"><div><h2>Shop now</h2></div><div><p>The Desire Emporium was built by cyclists to bring together the coolest cycling brands under one roof. From curated clothing capsules, to exceptional lifestyle products and perfect gifts.</p><p><a href=\"https://www.rouleur.cc/pages/rouleur-desire-emporium\" title=\"Rouleur Emporium - presented by Desire\">Shop now</a></p></div></div></div>","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"ab0b22f6c38d4037c713c9d0aba8d3d1d0ac8b8d063ad1b8e8df4bd660b5a578","category":"Cycling"}