{"title":"Rocket Report: China debuts new booster, SpaceX eyeing Indonesia launch site?","link":"https://arstechnica.com/?p=1749067","date":1615550441000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>We have liftoff! —</h4><h2 itemprop=\"description\">\"This is a game-changer for South African space science.\"</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/ns14-launch-drone-800x524.jpg\" alt=\"Aerial-view of a rocket launch.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/ns14-launch-drone.jpg\" data-height=\"2045\" data-width=\"3122\">Enlarge</a> <span>/</span> Drone's eye view of a New Shepard Launch.</p></figcaption></figure><p>Welcome to Edition 3.36 of the Rocket Report! This week we have plenty of news with small-, medium-, and heavy-lift rockets. I was perhaps most intrigued to learn that Blue Origin has figured out a way to use its New Shepard suborbital launch system to simulate lunar gravity for several minutes. This will help test a lot of tech for Artemis and seems like a shrewd move by Blue.</p><p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" width=\"560\" height=\"81\"></figure><p><strong>Vega rocket preparing for its return-to-flight mission</strong>. Italian rocket maker Avio's small Vega rocket is set to return to flight in April following a failure late last year. Avio spokesperson Francesco De Lorenzo <a href=\"https://spacenews.com/vega-rocket-passes-readiness-review-for-april-return-to-flight/\" target=\"_blank\" rel=\"noopener\">told SpaceNews</a> the rocket was cleared for the upcoming Vega VV18 mission during a flight-readiness review conducted by Avio, launch partner Arianespace, and the European Space Agency. Vega is slated to launch on April 20 from the Guiana Space Centre, carrying the 750-kilogram Pléiades-Neo 1 Earth-observation satellite.</p><p><em>Needs to get back on track</em> ... Vega's upcoming return to flight follows a string of two failures in its last three launch attempts. The first, in July 2019, resulted in the destruction of the United Arab Emirates' FalconEye1 Earth-observation satellite. The most recent failure occurred November 16 when Vega's upper stage malfunctioned eight minutes after liftoff from Europe's French Guiana spaceport. Two European satellites were destroyed. (submitted by playkurtic and Ken the Bin)</p><p><strong>New Shepard will simulate lunar gravity</strong>. NASA says that it expects to be able to fly on board Blue Origin's suborbital New Shepard vehicle for tests in lunar gravity. \"New Shepard's upgrades will allow the vehicle to use its reaction control system to impart a rotation on the capsule. As a result, the entire capsule essentially acts as a large centrifuge to create artificial gravity environments for the payloads inside,\" <a href=\"https://www.nasa.gov/centers/armstrong/features/nasa-blue-origin-to-bring-lunar-gravity-conditions-closer-to-earth.html\" target=\"_blank\" rel=\"noopener\">the space agency said</a> in a news release.</p><p><em>Spin me to the Moon</em> ... Blue Origin's first flight of this capability will target 11 rotations per minute to provide more than two minutes of continuous lunar gravity, exposing the technologies to this challenging but difficult-to-test condition. These lunar gravity simulations will enable the agency to test and de-risk innovations critical to achieving the goals of the Artemis Program, NASA said. (submitted by EllPeaTea and platykurtic)</p><div data-list-id=\"248910\"><p>The easiest way to keep up with Eric Berger's space reporting is to sign up for his newsletter, we'll collect his stories in your inbox.</p></div><p><strong>Rocket Factory Augsburg nets ESA study grant</strong>. As part of a program to glean insights into long-term trends and potential evolutions in the launch industry, <a href=\"https://www.esa.int/Enabling_Support/Space_Transportation/ESA_defines_elements_of_future_European_space_transportation_solutions#.YEnRZi04jtc.link\" target=\"_blank\" rel=\"noopener\">the European Space Agency has issued</a> study contracts worth 500,000 euros to ArianeGroup, Avio, and Germany-based Rocket Factory Augsburg (RFA). The grants will enable these companies to identify and recommend preliminary elements for future space-transportation solutions during the period 2030 to 2050.</p><p><em>Concepts of the future</em> ... RFA, which seeks to develop a low-cost, small satellite rocket, stands out as a truly commercial launch company alongside the more institutional ArianeGroup and Avio firms. (Think Rocket Lab, compared to Lockheed Martin and Boeing in the United States). \"These system concept studies will include services that prioritize the future needs of Europe's space programs but also allow us to address global market needs,\" said Daniel Neuenschwander, ESA Director of Space Transportation. It's good to see Europe considering more purely commercial launch options.</p><p><strong>African rocket sets new altitude record</strong>. A hybrid rocket built by the Aerospace Systems Research Group of the University of KwaZulu-Natal, South Africa, launched on March 8, reaching an altitude of 17.9 km. The Phoenix-1B Mk2 rocket, using a fuel mix of paraffin and Nitrous oxide, set a record for an altitude achieved by a hybrid rocket launched from Africa.</p><p><em>A game-changer?</em> ... The successful launch has been lauded as an \"historic moment for South African space science\" by the Minister of Higher Education, Science and Innovation, Blade Nzimande, <a href=\"https://www.businessinsider.co.za/watch-sa-rocket-launches-almost-18km-into-the-air-setting-a-new-african-record-2021-3\" target=\"_blank\" rel=\"noopener\">Business Insider South Africa reported</a>. \"This is a game-changer for South African space science and positions the country to take the lead on the continent in the development of rocket launch capabilities,\" Nzimande said. (submitted by Ochre_face)</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/mediuml.png\" width=\"560\" height=\"81\"></figure><p><strong>Rocket Lab to challenge SpaceX dominance in medium-lift</strong>. After Rocket Lab's announcement of plans to build its Neutron rocket, with a lift capacity of 8 tons to low Earth orbit, Ars caught up with CEO Peter Beck to discuss why the company selected that size. Beck said he believes the future of the launch industry lies in constellations, be it megaconstellations or smaller clusters of satellites. \"The really successful commercial launch vehicles of today are never full,\" Beck added.</p><p><em>Big, but not too big</em> ... Beck and his engineering team settled on an 8-ton rocket design that hits the sweet spot between affordable launch and just enough—but not too much—carrying capacity. This new rocket could make its debut launch as early as 2024. Beck would not disclose pricing, but purchasing a launch on the reusable Neutron rocket will almost certainly cost less than the $60 million price of a Falcon 9. In response to this article, SpaceX founder <a href=\"https://twitter.com/elonmusk/status/1369918893771395078\" target=\"_blank\" rel=\"noopener\">Elon Musk said on Twitter</a>, \"Falcon 9 is almost always at max capacity. When it has 'spare' performance, it flies back to land, which costs much less than using a droneship.\"</p><p><strong>China successfully launches Long March 7A</strong>. China successfully flew its new, medium-lift Long March 7A rocket for the first time on Thursday, sending a classified, experimental payload into geosynchronous transfer orbit. Liftoff from the coastal Wenchang Satellite Launch Center occurred at 12:51 pm EST, <a href=\"https://spacenews.com/china-successfully-launches-new-long-march-7a-on-second-attempt/\" target=\"_blank\" rel=\"noopener\">SpaceNews reports</a>.</p><p><em>Cleaner-burning rockets</em> ... The first launch of the Long March 7A failed in March 2020. A loss of pressure occurred after first-stage separation, which led to engine malfunction. After China relied on hypergolic fueled rockets for decades, the Long March 7A is one of a number of new-generation kerolox and hydrolox rockets developed by China. The company plans to fly the booster about three to five times a year. (submitted by Ken the Bin)</p><p><strong>Space Force awards new launch contracts to ULA, SpaceX</strong>. The US Space Force has awarded United Launch Alliance and SpaceX contracts for four National Security Space Launch Phase 2 missions scheduled for 2023, <a href=\"https://spacenews.com/space-force-awards-ula-spacex-contracts-for-four-national-security-missions/\" target=\"_blank\" rel=\"noopener\">SpaceNews reports</a>. Last year, the Space Force selected the two launch providers for services from 2022 to 2027. ULA won 60 percent and SpaceX 40 percent of the estimated 30 to 35 launches.</p><p><em>Why the discrepancy in price?</em> ... ULA received $224. 2 million for two missions named USSF-112 and USSF-87. SpaceX got $159.7 million for USSF-36 and NROL-69. The SpaceX contract for the NROL-69 National Reconnaissance Office mission only includes basic launch services. The NRO will fund its mission integration separately. (submitted by Ken the Bin and platykurtic)</p><p><strong>SpaceX eyes Indonesian launch site</strong>. In December, <a href=\"https://amp.theguardian.com/world/2021/mar/10/anger-after-indonesia-offers-elon-musk-papuan-island-for-spacex-launchpad\" target=\"_blank\" rel=\"noopener\">The Guardian reports</a>, SpaceX was offered part of a small island in Papua to use as a launch site. Indonesian President Joko Widodo made the offer for the use of the small island of Biak, which lies just 1 degree south of the equator. Roscosmos is also considering using space on the island for orbital launches, the publication stated.</p><p><em>This is not without controversy</em> ... Biak is part of Papua province, where a secessionist campaign has run for decades against Indonesian rule. Opponents argue that a launch site will drive deforestation, increase Indonesian military presence, and threaten their future on the island. A tribal chief on the island, Manfun Sroyer, said he feared Papuans will be forced from their homes: \"This spaceport will cost us our traditional hunting grounds, damaging the nature our way of life depends on. But, if we protest, we'll be arrested immediately.\"</p><p><strong>What causes orbital launch delays?</strong> A new report on the cause of US rocket launch delays—which considered the Northrop Grumman Antares, Rocket Lab Electron SpaceX Falcon 9, ULA Atlas V, and ULA Delta IV vehicles—finds that weather was the most frequent cause during the last 12 months. Vandenberg Air Force Base in California was found to be the least likely to scrub a launch due to weather, the report <a href=\"https://www.astralytical.com/blog/2021/3/10/new-report-recent-us-orbital-launch-delays\" target=\"_blank\" rel=\"noopener\">by Astralytical</a> finds.</p><p><em>Persevering through the pandemic</em> ... The three other major orbital launch sites—Mahia Launch Complex in New Zealand, Mid-Atlantic Regional Spaceport in Virginia, and Cape Canaveral Spaceport in Florida—are all equally as likely to experience weather delays. Other common causes of delays include issues with the rocket itself, the payload, and ground-systems issues. Notably, only 6 percent of recent US orbital launch delays were due to COVID-19 restrictions.</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/heavyl.png\" width=\"560\" height=\"81\"></figure><p><strong>SpaceX reveals the extent of South Texas plans</strong>. As part of a federal review process for its plans in South Texas, details of SpaceX's proposed spaceport have been made public, <a href=\"https://arstechnica.com/science/2021/03/spacex-reveals-the-grand-extent-of-its-starport-plans-in-south-texas/\" target=\"_blank\" rel=\"noopener\">Ars reports</a>. Most notably, the new documents include a detailed architectural drawing of the multi-acre site at the southern tip of Texas, along the Gulf of Mexico. The major hardware that exists or will be built include two orbital launch pads, two suborbital launch pads, and an extensive new \"tank farm\" to support launches.</p><p><em>Pads aplenty</em> ... These detailed plans also provide more evidence that company founder Elon Musk is all in on Texas for the future of SpaceX. These four launch pads, in conjunction with the acquisition of two oil rigs named Phobos and Deimos, provide some sense of the company's operational capabilities. The plan is likely to conduct launches from South Texas and land vehicles on these modified platforms and to fly Starships on suborbital hops from South Texas to these platforms for orbital launches. This effectively provides the Starship Launch System with four orbital launch pads.</p><p><strong>NASA targets March 18 for SLS hot fire test</strong>. <a href=\"https://blogs.nasa.gov/artemis/2021/03/10/green-run-update-nasa-targets-march-18-for-sls-hot-fire-test/\" target=\"_blank\" rel=\"noopener\">NASA said</a> it will seek to fire up its Space Launch System core stage for a second time on March 18, at NASA's Stennis Space Center near Bay St. Louis, Mississippi. The goal is to fire the rocket's four main engines (which were first used on the space shuttle) for a minimum of four minutes and a maximum of eight minutes. Less than that would not constitute a successful test, officials with the SLS program have said.</p><p><em>Final preparations under way</em> ... This second firing comes about two months after an initial \"Green Run\" test of the core stage shut down after just 67.1 seconds. As preparations for this second test continue, this week the team will power up the core stage again and do a final check of all its systems. Then, on March 16, two days before the test, the team will power up the stage, starting the clock for the second hot fire. (submitted by Ken the Bin and platykurtic)</p><p><strong>Delta IV Heavy readying for launch</strong>. United Launch Alliance recently raised a Delta 4-Heavy rocket (one of four left in the company's backlog) vertically on its launch pad at Vandenberg Air Force Base in California, <a href=\"https://spaceflightnow.com/2021/03/08/delta-4-heavy-rocket-erected-on-vandenberg-launch-pad/\" target=\"_blank\" rel=\"noopener\">Spaceflight Now reports</a>. These rollout efforts came in preparation for liftoff with a top-secret US government spy satellite next month.</p><p><em>First launch of 2021</em> ... The NROL-82 mission is scheduled to launch at the \"end of April,\" said Col. David Rickards, director of staff at the 30th Space Wing at Vandenberg. National Reconnaissance Office and ULA officials have not announced the target launch date, but the mission is expected to be ULA's first mission of the year. This comes after delays in the launch from Cape Canaveral of Boeing's Starliner crew capsule on an unpiloted test flight. (submitted by Ken the Bin)</p><h2>Next three launches</h2><p><strong>March 14</strong>: Falcon 9 | Starlink-21 | Kennedy Space Center, Florida | 09:44 UTC</p><p><strong>March 20</strong>: Soyuz 2.1a | Ride-share mission including Astroscale ELSA-d mission | Baikonur Cosmodrome, Kazahkstan | 06:07</p><p><strong>March 25</strong>: Soyuz | OneWeb-5 | Vostochny Cosmodrome, Russia | TBD</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/rocket.png\" width=\"120\" height=\"120\"></figure></div></div></div>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ab52e63adc91cc5ee4622540f1e4d85bc7e3b04eaa6177dd7c1fd308c0ee8b7d","category":"Tech"}