{"title":"Watch: How to clean a road bike in the time it takes to make a cup of tea","link":"https://www.cyclist.co.uk/tutorials/9191/watch-how-to-clean-a-road-bike-in-the-time-it-takes-to-make-a-cup-of-tea","date":1612355071000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/GSXWekuOvuo?autoplay=1&amp;mute=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe><p>As with most things in life, giving your bike a quick clean on a regular basis is the best approach to avoid a situation where you end up with a monumental task on your hands.</p><p>If you clean your bike after each ride (ideally) but at the very least every few rides, you will find it much easier to keep on top of your cleaning regime, plus the drivetrain components will last a <em>lot</em> longer if they are regularly cleaned and re-lubricated.</p><p>Be prepared beforehand with the following:</p><ul><li>Bucket of <strong>hot</strong> soapy water (Fairy Liquid, or similar, is ideal)</li><li>Durable sponge</li><li>Microfibre cloth</li><li>Chain cleaning device</li><li>Water soluble degreaser</li><li>General all-purpose bike cleaner</li><li>Selection of bike specific brushes e.g. long bristled stiff brush, large soft brush, hub brush.</li></ul><h4><em>Top tip</em></h4><p><em>Clean the bike as soon as you get home from a grubby ride – the dirt and grime will wash off much more easily than if it’s left a few days to dry on and this will also reduce the chance of products succumbing to further corrosion</em></p><h3>Process</h3><p>Start with degreasing the chain – using a chain cleaning device will make this effortless. It’s important to do this before you get busy with the hosepipe or soapy water as this will only dilute the degreaser and reduce its effectiveness. Spinning through 30-40 pedal revolutions through the chain cleaner should be enough to get the chain sparkling clean.</p><p>Use the remaining degreaser from the chain cleaner on a stiff brush to scrub the rest of the drivetrain. Long bristles are best to reach in between sprockets and between chainrings etc. Don’t worry about making everything really messy at this stage.</p><h4><em>Top tip</em></h4><p><em>The process of rinsing everything off once you're finished cleaning is another reason why it’s important to use a good quality water soluble degreaser (and not products like diesel or paraffin or Turpentine solutions etc which cannot be washed away)</em></p><p>Focus on cleaning the sprockets and jockey wheels thoroughly.</p><p>Now coat the bike in a generous amount of the general purpose bike cleaner spray (many of these exist on the market). Focus on the hard to clean areas, such as hubs and disc brake callipers (if you have them). Give it a little time to do its work and begin to break down grime (around 30 seconds to a minute)</p><p>Now using the sponge and hot soapy water, begin to work systematically around the bike, starting from the top and working down.</p><h4><em>Top tip</em></h4><p><em>Buy high-quality sponges, not cheap ones, as poor quality sponges simply fall apart in no time. A good example is sponges for tile grouting, as these are much tougher and more resilient to tearing.</em></p><p>Use specific brushes to help to scrub those hard to reach areas. A good example of this is the hubs, where a purpose designed brush can access the middle of the wheel, between spokes, and allow you to effortlessly clean around the hub shell and spokes, where dirt often gathers.</p><p>Finish off by soaking the drivetrain in soapy water, to flush away as much of the degreaser as possible. Run the chain through the sponge a few times too. Note: If you’ve done a good job of cleaning your chain the sponge should be left quite clean, and <em>not</em>&nbsp;coated with black grime after this process.</p><h4><em>Top tip</em></h4><p><em>If you are short on time, focus on where the money is. By that I mean, focus on the moving parts that will cost you more to replace if left. A dirty drivetrain is a soon-to-be worn out drive train. It will save you a fortune in the long run if you keep these components clean, lubricated and well-maintained.</em></p><p>The final step is the rinse, and this should only require the hosepipe on a low pressure. If you do not have a hosepipe, you can do this fine with a bucket of fresh water and the sponge, or even just a watering can will suffice.</p><p>Be sure to dry the bike as much as possible, paying particular attention to the chain. Bouncing the bike on the ground lightly helps to shake water out of all the nooks and crannies.</p><p>Now, go to our video on <a href=\"https://youtu.be/vov7DZ7v22M\" target=\"_blank\">post-cleaning lubrication and protection</a> to find out what to do next.</p></div></div>","author":"sbowers","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"ab52e31c633cd2b052f99b5ef49e8a1e26ec154fb55030474fe2cb7886430c93","category":"Cycling"}