{"title":"TikTok wants to keep tracking iPhone users with state-backed workaround","link":"https://arstechnica.com/?p=1749913","date":1615903906000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>They don't want to stop tracking you —</h4><h2 itemprop=\"description\">They want to keep tracking iPhone users with solution created by state-backed group.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/08/GettyImages-1227945804-800x533.jpg\" alt=\"TikTok wants to keep tracking iPhone users with state-backed workaround\"><figcaption></figcaption></figure><p>Some of China’s biggest technology companies, including ByteDance and Tencent, are testing a tool to bypass Apple’s new privacy rules and continue tracking iPhone users without their consent to serve them targeted mobile advertisements.</p><p>Apple is expected in the coming weeks to roll out changes it announced last June to iPhones that it says will give users more privacy. Until now, apps have been able to rely on Apple’s IDFA system to see who clicks on ads and which apps are downloaded.</p><p>In the future, they will have to ask permission to gather tracking data, a change that is expected to deal a multibillion-dollar bombshell to the online advertising industry and has been fought by Facebook, since most users are expected to decline to be tracked.</p><p>In response, the state-backed China Advertising Association, which has 2,000 members, has launched a new way to track and identify iPhone users called CAID, which is being widely tested by tech companies and advertisers in the country.</p><p>ByteDance, the owner of the social video app TikTok, referred to CAID in an 11-page guide to app developers obtained by the Financial Times, suggesting that advertisers “can use the CAID as a substitute if the user’s IDFA is unavailable.”</p><p>People close to Tencent and ByteDance confirmed the companies were testing the system, but both companies declined to comment.</p><p>Several efforts are under way to get around Apple’s rules, but CAID is the biggest challenge to them yet, and the iPhone maker declined to comment directly on it. But in a move that sets the stage for a major confrontation, Apple denied that it would grant any exceptions.</p><p>“The App Store terms and guidelines apply equally to all developers around the world, including Apple,” the company said. “We believe strongly that users should be asked for their permission before being tracked. Apps that are found to disregard the user’s choice will be rejected.”</p><p>One person familiar with the situation said Apple would be able to detect which apps use the new tool and block them from its App Store in China if it wanted to.</p><p>But Zach Edwards, founder of Victory Medium, a tech consultancy, said: “They can’t ban every app in China. If they did it would effectively trigger a series of actions that would get Apple kicked out of China.”</p><p>Three people with knowledge of briefings between Apple and developers also said the Cupertino, California-based company would be wary of taking strong action, despite a clear violation of its stated rules, if CAID has the support of China’s tech giants as well as its government agencies.</p><figure><img alt=\"An excerpt from Apple’s new rules on mobile tracking.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/screenshot.png\" width=\"437\" height=\"238\"><figcaption><p>An excerpt from Apple’s new rules on mobile tracking.</p><p>Apple via Financial Times</p></figcaption></figure><p>Rich Bishop, chief executive of AppInChina, a leading publisher of international software in China, suggested that Apple might “make an exception for China” because tech companies and the government are “so closely aligned.”</p><p>Meanwhile, Yang Congan, chief executive of Digital Union, a Beijing-based data privacy company, suggested that CAID had been designed to get around Apple’s rules because its tracking methods might not “uniquely” identify the user. “This is the room that the industry has left to explore,” said Yang, who suggested this gray area was intentional.</p><p>The CAA said the CAID solution “does not stand in opposition to Apple’s privacy policy” and that the association “is currently actively communicating with Apple, and the [CAID] solution has not yet been formally implemented.”</p><p>CAID has been in a free demo phase for select companies in recent months. Two people briefed on the issue say Apple is aware of the tool and seems to have so far turned a blind eye to its use.</p><p>The system is intended for use by local app developers in China, but at least one French gaming group has been encouraged to apply to use it and several foreign advertising companies have already applied on behalf of their Chinese divisions, two people familiar with the matter said. CAID is scheduled to be publicly released as soon as this week, according to a person briefed on the plan.</p><p>Dina Srinivasan, a US-based antitrust scholar, said the issue highlighted how Apple’s policies alone could not solve glaring privacy issues.</p><p>“The big picture is that there is simply too much money at stake,” she said. “There will always be an arms race to track consumers. Only legislation can make it stop.”</p><p><em><a href=\"https://www.ft.com/\">© 2021 The Financial Times Ltd</a>. <a href=\"https://www.ft.com/\">All rights reserved</a> Not to be redistributed, copied, or modified in any way.</em></p></div></div>","author":"Financial Times","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ab619f2a15567dbdba9f2055b4b126896017dd0b75df475564f7527651e2d287","category":"Tech"}