{"title":"Hannah Barnes signs two year deal with new women’s Uno-X team","link":"https://cyclingtips.com/2021/08/hannah-barnes-signs-two-year-deal-with-new-womens-uno-x-team/","date":1628528323000,"content":"<div><div><p>Former British national champion Hannah Barnes will join the new women’s Uno-X team in 2022 for two seasons. An accomplished sprinter and team captain, Barnes has won stages at the Giro Rosa, the OVO Energy Women’s Tour, and Setmana Ciclista Valenciana. She also won the overall of Setmana Ciclista Valenciana in 2017.</p><p>“This is a very exciting time for Uno-X and I am thrilled to be part of the women’s team from the beginning,” Barnes said of the move. “I look forward to sharing my experiences and knowledge with my new teammates and contribute to a successful introduction to the women’s peloton.”</p><p>Barnes joins a roster of young riders including Anne Dorthe Ysland and Amalie Lutro of Norway and Anniina Ahtosalo of Finland. Hannah Ludwig (Germany) will also make the jump to Uno-X in 2022 from Canyon-SRAM.</p><p>“Hannah [Barnes] is an international star,” said general manager Jens Haugland. “Her palmares is widely recognized and I think Uno-X will be good for her. Of course, she will be one of our captains and I expect her to play a very important part of our history in 2022.”</p><p>Uno-X announced their intentions of starting a women’s WorldTeam in June of 2021 after the UCI changed the rule about newly formed teams applying for top tier status. Prior to 2021, a new team had to spend one year as Continental before making the jump to WorldTeam. Jumbo-Visma’s women’s team did just that. However, with Cofidis and Uno-X starting women’s teams in 2022 and 15 available licenses for WorldTeams on the women’s side the UCI will allow new teams to apply.</p><p>The Norwegian team also picked up former professional male rider Lars Bak to lead the women in their first season.</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ab7890911cb8f6dd2dd96524f480e7e52cdd9324a51bdcb0d67fbcba29b87dae","category":"Cycling"}