{"title":"Mark Zuckerberg Reportedly Told Staff Facebook Needs to 'Inflict Pain' on Apple Over Privacy Dispute","link":"https://www.macrumors.com/2021/02/13/zuckerberg-facebook-inflict-pain-on-apple-privacy/","date":1613212384000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/13/zuckerberg-facebook-inflict-pain-on-apple-privacy/\"><p>Apple and Facebook have been in a very public spat over the course of the last few months as Apple dials up its pro-privacy stance. The two companies have long had tension, more recently however Facebook is taking shots at an <a href=\"https://www.macrumors.com/2021/01/28/app-tracking-transparency-required-soon/\">upcoming iOS and iPadOS feature</a> that will require apps and data companies such as Facebook to ask for users' permission before tracking them across other sites and websites.</p><p><img alt=\"tim cook mark zuckerberg\" width=\"800\" height=\"449\" src=\"https://images.macrumors.com/t/aMYufjQaGumqVw8Xnd8iQW_7hKg=/400x0/filters:quality(90)/article-new/2018/04/tim-cook-mark-zuckerberg.jpg?lossy\" data-src=\"https://images.macrumors.com/t/aMYufjQaGumqVw8Xnd8iQW_7hKg=/400x0/filters:quality(90)/article-new/2018/04/tim-cook-mark-zuckerberg.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/aMYufjQaGumqVw8Xnd8iQW_7hKg=/400x0/filters:quality(90)/article-new/2018/04/tim-cook-mark-zuckerberg.jpg?lossy 400w,https://images.macrumors.com/t/AUp1oTjzq6xJ6iesKlZW94hEQWQ=/800x0/filters:quality(90)/article-new/2018/04/tim-cook-mark-zuckerberg.jpg?lossy 800w,https://images.macrumors.com/t/k1RHkbTngBi0eG7ZVlalJzZSXiI=/1600x0/filters:quality(90)/article-new/2018/04/tim-cook-mark-zuckerberg.jpg 1600w,https://images.macrumors.com/t/FprQUsHjxJkZIVn0VUaHuhgWEZM=/2500x0/filters:no_upscale():quality(90)/article-new/2018/04/tim-cook-mark-zuckerberg.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/aMYufjQaGumqVw8Xnd8iQW_7hKg=/400x0/filters:quality(90)/article-new/2018/04/tim-cook-mark-zuckerberg.jpg?lossy 400w,https://images.macrumors.com/t/AUp1oTjzq6xJ6iesKlZW94hEQWQ=/800x0/filters:quality(90)/article-new/2018/04/tim-cook-mark-zuckerberg.jpg?lossy 800w,https://images.macrumors.com/t/k1RHkbTngBi0eG7ZVlalJzZSXiI=/1600x0/filters:quality(90)/article-new/2018/04/tim-cook-mark-zuckerberg.jpg 1600w,https://images.macrumors.com/t/FprQUsHjxJkZIVn0VUaHuhgWEZM=/2500x0/filters:no_upscale():quality(90)/article-new/2018/04/tim-cook-mark-zuckerberg.jpg 2500w\"><br>While for the most part, the war of words between the tech titans has remained professional, Mark Zuckerberg and <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> have also shared a barrage of attacks towards each other. During an interview in 2018 in the midst of Facebook's notorious Cambridge Analytica scandal, Cook was asked how he would lead Apple if it were to face a similar crisis. Cook <a href=\"https://www.msnbc.com/msnbc/watch/tim-cook-slams-facebook-s-zuckerberg-i-wouldn-t-be-in-this-situation-1197130819683\">responded</a> by ruling the hypothetical situation out of the question, saying Apple would not be in the situation Facebook was in, thanks to its differing stance on privacy and user data. Zuckerberg shot back, calling Cook's comments on TV \"extremely glib\" and \"not at all aligned with the truth.\"</p><p>Zuckerberg, outraged by Cook's comments and public influence on Facebook's reputation, reportedly told internal aides and team members that Facebook needs to \"inflict pain\" on Apple, according to sources who spoke on anonymity to <em><a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\">The Wall Street Journal</a></em>. Last month, during the company's earnings, call Zuckerberg <a href=\"https://www.macrumors.com/2021/01/27/apple-privacy-changes-anti-competitive-facebook/\">called</a> Apple an increasingly bigger threat to Facebook and accused the Cupertino tech giant of using its platforms to interfere with how Facebook operates its own apps.</p><p>The day after the public comments, Cook responded indirectly in a <a href=\"https://www.macrumors.com/2021/01/28/tim-cook-speaks-at-data-protection-conference/\">speech</a> during the Computers, Privacy, and Data Protection conference where he condemned Facebook and implied that its business model of maximizing engagement leads to division and violence. During the same speech, Cook censured Facebook's potential role in the January 6 Capitol riot, blaming the social media company's algorithms for spreading conspiracy theories.</p><p>In December, Facebook <a href=\"https://www.macrumors.com/2020/12/16/facebook-takes-out-full-page-ads-to-attack-apple/\">ran full-page ads</a> attacking Apple's up-and-coming ATT or App Tracking Transparency requirement that will force apps to ask for the user's permission before tracking them across apps and the internet. Facebook is attacking Apple from the standpoint that ATT <a href=\"https://www.macrumors.com/2020/12/17/facebook-runs-apple-vs-free-internet-ad/\">will hurt small businesses</a> who rely on personalized ads derived from effective tracking. In response, Cook directly weighed in on Twitter, stating that Apple simply wants to <a href=\"https://twitter.com/tim_cook/status/1339720611313065984?s=20\">give users a choice</a> about whether they wish to be tracked or not.</p><p>Despite the personal jabs and attacks, in a statement given to <em>The Wall Street Journal</em>, Facebook spokeswoman Dani Lever refuted the idea that the tension between the two is personal, suggesting instead that it was \"about the future of the free internet.\" Facebook states that choosing between tracking users for personalized ads and protecting their privacy is a \"false-trade off,\" claiming that it believes it can provide both. The spokeswoman reiterated <a href=\"https://www.macrumors.com/2020/12/16/facebook-responds-to-ios-14-anti-tracking/\">past remarks</a> by Facebook stating that Apple's privacy features are not meant to preserve user privacy, but are instead about increasing profit, and that Facebook will join others to highlight Apple's \"self-preferencing, anticompetitive behavior.\"</p><p>Apple declined to comment on the report.</p><p>Facebook is <a href=\"https://www.macrumors.com/2021/01/28/facebook-preparing-antitrust-lawsuit-against-apple/\">reportedly</a> planning to take its disapproval with Apple to court as it's allegedly been preparing to file an antitrust lawsuit against the Cupertino-based tech-company over its \"unfair\" approach to privacy with ATT and iMessage. As part of its lawsuit, Facebook is considering partnering with other companies such as <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, which is already embroiled in a massive legal battle with Apple to propel its antitrust case forward. Facebook may however scrap its plans to bring forward any form of legal action against Apple.</p><p>Senator Mike Lee of Utah, who leads the Republican's effort in the Senate antitrust subcommittee, told <em>The Wall Street Journal</em> that the feud between Apple and Facebook sits at the \"nexus of privacy and antitrust,\" and that he doesn't want to \"impose regulation that just ends up protecting incumbents and entrenching monopolies.\"</p><p>Apple has <a href=\"https://www.macrumors.com/2021/01/28/app-tracking-transparency-required-soon/\">committed</a> to launching ATT with iOS and iPadOS 14.5 in the \"early spring\" and Facebook has seemingly admitted defeat in its failed attempt to stop the new requirement from going into action. Apps have the freedom to customize the prompt that users will receive asking for their permission to be tracked across other apps and the web, and <a href=\"https://www.macrumors.com/2021/02/01/facebooks-will-encourage-users-to-accept-tracking/\">screenshots of Facebook's prompt</a> for its iOS app pleads with users to opt-in to tracking in order to receive \"a better ads experience.\"</p><p><small>Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our <a href=\"https://forums.macrumors.com/forums/political-news.218/\">Political News</a> forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.</small></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/useful-mac-accessories-worth-checking-out/\">Useful Mac Accessories Worth Checking Out</a></h3><p>Wednesday February 10, 2021 1:21 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>If you recently picked up one of the new M1 Macs that Apple released in November, or received a new Mac for the holidays, you may be in search of useful accessories to go along with it. In our latest YouTube video, we rounded up some great Mac accessories that are worth checking out. Subscribe to the MacRumors YouTube channel for more videos. MacRumors videographer Dan has highlighted several ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/intel-anti-mac-ad-campaign/\">Intel's Anti-Mac Ad Campaign Highlights M1 Shortcomings</a></h3><p>Thursday February 11, 2021 5:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of the M1 Macs last November, Apple officially began its transition away from Intel's chips, and it's clear from Intel's latest advertising campaign that the company is feeling threatened by Apple's decision. In ads shared on Twitter, Intel has been highlighting the shortcomings of Apple's M1 Mac lineup. An ad this week, for example, points out the gaming capabilities of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/apple-privacy-chief-slams-north-dakota-bill/\">Apple Privacy Chief: North Dakota Bill 'Threatens to Destroy the iPhone as You Know It'</a></h3><p>Wednesday February 10, 2021 1:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>The North Dakota Senate this week introduced a new bill that would prevent Apple and Google from requiring developers to use their respective app stores and payment methods, paving the way for alternative app store options, reports The Bismarck Tribune. According to Senator Kyle Davison, who introduced Senate Bill 2333 yesterday, the legislation is designed to \"level the playing field\" for...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/2016-2017-macbook-pro-battery-charging-issue/\">Apple Offering Free Battery Replacements for 2016-2017 MacBook Pros That Can't Charge Past 1%</a></h3><p>Tuesday February 9, 2021 4:45 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today released macOS Big Sur 11.2.1 to address an issue that may prevent the battery from charging in some 2016 and 2017 MacBook Pro models, and the company has since shared a new support document with more details. Apple says a \"very small number of customers\" with 2016 and 2017 models of the 13-inch and 15-inch MacBook Pro have experienced an issue with the battery not charging past...</p></div></div></div>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"abaf1aac7a3368a25d710814920e2ee55a6324bd758f84c2904ce954e6637f01","category":"Apple"}