{"title":"EF won’t fire Craddock for riding the wrong bike either","link":"https://cyclingtips.com/2021/11/ef-wont-fire-craddock-for-riding-the-wrong-bike-either/","date":1636590427000,"content":"<div><div><p>EF Education-Nippo has come to ‘an amicable agreement’ with another outgoing rider who recently rode on non-sponsor-correct equipment.</p><p>Only a few days after news emerged that Sergio Higuita had <a href=\"https://cyclingtips.com/2021/11/sergio-higuita-has-been-fired-for-riding-the-wrong-bike/\" target=\"_blank\">received a termination notice</a> – and had then come to an <a href=\"https://cyclingtips.com/2021/11/sergio-higuita-hasnt-been-fired-after-all/\" target=\"_blank\">arrangement</a> with the team – after being seen on a Specialized bike instead of a Cannondale at an event in Colombia, <a href=\"https://www.cyclingnews.com/news/lawson-craddock-also-sent-contract-termination-letter-after-bike-breach/\" target=\"_blank\">Cyclingnews</a> reported that Lawson Craddock posted photos of himself riding a Giant bike at an event in Texas. He has since deleted the photos from social media.</p><p>Craddock is <a href=\"https://cyclingtips.com/2021/11/lawson-craddock-is-on-the-move-a-qa-with-the-us-time-trial-champion/\" target=\"_blank\">headed to BikeExchange next season</a> after six years with EF. Reports have connected the Australian WorldTour squad to a possible switch from Bianchi bikes to Giant in 2022.</p><p>As Cyclingnews first reported, EF initially sent Craddock a termination notice this week but both parties were working towards a resolution, much as had been the case for the team and Higuita.</p><p>EF confirmed the news to CyclingTips, and then followed that up with a confirmation that a resolution had indeed been reached and that Craddock had not been fired.</p><p>“The team has come to an amicable agreement with Lawson Craddock regarding his riding of a non-team bike at a recent public event, and Craddock has reached out to our partner Cannondale and the team to apologize,” the team said in a statement. “We look back on our six seasons with Lawson fondly and wish him the best in the future.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ac98d6b21103c19390db438edf3f5e9a91c1a9403f53c2fbfaf85ee41b463932","category":"Cycling"}