{"title":"British Cycling announces roster for Road Worlds","link":"https://cyclingtips.com/2021/09/british-cycling-announces-roster-for-road-worlds/","date":1631547733000,"content":"<div><div><p>British Cycling has unveiled the British squad for the upcoming UCI Road World Championships in Flanders with some big names in the lineup.</p><p>On the women’s side, former world road champ Lizzie Deignan (Trek-Segafredo) headlines a well-rounded team for the elite road race that also includes Alice Barnes (Canyon-SRAM), Georgi Pfeiffer (DSM), Anna Henderson (Jumbo-Visma), Joss Lowden (Drops-Le Col), and Anna Shackley (SD Worx).</p><p>Pfeiffer and Lowden will represent the squad in the elite individual time trial.</p><p>On the men’s side, Olympic mountain bike champ Tom Pidcock (Ineos Grenadiers), former road world champ Mark Cavendish (Deceuninck-QuickStep), and up-and-comer Ethan Hayter (Ineos Grenadiers) are among the eight riders set to start the road race with the elites. Jake Stewart (Groupama-FDJ), Luke Rowe (Ineos Grenadiers), Ben Swift (Ineos Grenadiers), Connor Swift (Arkéa-Samsic), and Fred Wright (Bahrain Victorious) round out the team.</p><p>Hayter and Dan Bigham (Ribble Weldtite) will start the elite ITT.</p><p>Lowden, Barnes, Henderson, Bigham, John Archibald (Eolo-Kometa), and Alex Dowsett (Israel Start-up Nation) will join forces for the mixed team time trial.</p><p>“I’m really looking forward to the road world championships this year, as we have some serious medal contenders within the squad in every category,” said performance director Stephen Park via a British Cycling press release.</p><p>“The Road World Championships are a key feature for the Great Britain Cycling Team’s road squad, and for me, personally, it will be great to see the likes of Mark and Lizzie bring their form and experience into a team keen to do the jersey proud and bring back medals.</p><p>Racing at Flanders Worlds will commence this coming Sunday with the elite men’s ITT, and will run through the following Sunday, concluding with the elite men’s road race.</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"acc9e72809011f1b98474abe2053bfe0198dc3d5d8f524546bd40301c258cd48","category":"Cycling"}