{"title":"Huawei to Negotiate Royalties From Apple and Samsung for 5G Technology","link":"https://www.macrumors.com/2021/03/16/huawei-royalties-from-apple-samsung-for-5g/","date":1615894642000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/16/huawei-royalties-from-apple-samsung-for-5g/\"><p>Huawei will begin negotiating for royalties from Apple and Samsung for access to its portfolio of patents on 5G technology (via <em><a href=\"https://www.bloomberg.com/news/articles/2021-03-16/huawei-to-start-demanding-5g-royalties-from-smartphone-giants?srnd=premium-europe\">Bloomberg</a></em>).</p><p><img alt=\"Huawei Logo\" width=\"1920\" height=\"1080\" src=\"https://images.macrumors.com/t/dl4-SRp3GgazVWLKu3gR6pHfN2Y=/400x0/filters:quality(90)/article-new/2021/03/Huawei-Logo.jpg?lossy\" data-src=\"https://images.macrumors.com/t/dl4-SRp3GgazVWLKu3gR6pHfN2Y=/400x0/filters:quality(90)/article-new/2021/03/Huawei-Logo.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/dl4-SRp3GgazVWLKu3gR6pHfN2Y=/400x0/filters:quality(90)/article-new/2021/03/Huawei-Logo.jpg?lossy 400w,https://images.macrumors.com/t/DHTHNwqSYgDKZfSl9EHFSlwhZdc=/800x0/filters:quality(90)/article-new/2021/03/Huawei-Logo.jpg?lossy 800w,https://images.macrumors.com/t/tSVd0IzMiTkRdGZge6PEqJgg4UQ=/1600x0/filters:quality(90)/article-new/2021/03/Huawei-Logo.jpg 1600w,https://images.macrumors.com/t/JRn0TpZ6zsgQAxoDZZzgxlpLvp4=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/Huawei-Logo.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/dl4-SRp3GgazVWLKu3gR6pHfN2Y=/400x0/filters:quality(90)/article-new/2021/03/Huawei-Logo.jpg?lossy 400w,https://images.macrumors.com/t/DHTHNwqSYgDKZfSl9EHFSlwhZdc=/800x0/filters:quality(90)/article-new/2021/03/Huawei-Logo.jpg?lossy 800w,https://images.macrumors.com/t/tSVd0IzMiTkRdGZge6PEqJgg4UQ=/1600x0/filters:quality(90)/article-new/2021/03/Huawei-Logo.jpg 1600w,https://images.macrumors.com/t/JRn0TpZ6zsgQAxoDZZzgxlpLvp4=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/Huawei-Logo.jpg 2500w\"></p><p>Huawei is the owner of the world's largest collection of 5G patents and is seeking to charge other large tech companies a \"reasonable\" fee for access to them, creating a substantial new source of revenue.</p><p>Huawei's Chief Legal Officer, Song Liuping, explained earlier today that the company will negotiate rates and comprehensive cross-licensing agreements with Apple and Samsung, promising to charge lower rates than competitors such as Qualcomm, Ericsson, and Nokia. \"It's natural\" for Huawei to capitalize on its patents, Song said.</p><p>Per-phone royalties will be capped at $2.50, which is markedly less than Qualcomm's $7.50 rate that led to a <a href=\"https://www.macrumors.com/2017/01/20/apple-qualcomm-1-billion-lawsuit/\">legal battle with Apple</a> over supposedly unfair pricing.</p><p>While Apple is currently reliant on <a href=\"https://www.macrumors.com/2020/10/21/iphone-12-qualcomm-x55-modem/\">Qualcomm</a> and <a href=\"https://www.macrumors.com/2021/02/24/iphone-13-snapdragon-x60-5g-modem/\">expected to</a> stick with external suppliers for its 5G technology until 2022, the company is <a href=\"https://www.macrumors.com/2020/12/18/apple-working-on-high-end-mmwave-modem/\">rumored</a> to be <a href=\"https://www.macrumors.com/2021/03/11/apple-designed-5g-modem-2023-iphones-rumor/\">developing its own 5G modem</a> for introduction on the 2023 <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> models. Apple is also <a href=\"https://www.macrumors.com/2021/02/18/apple-seeking-engineers-work-on-6g/\">believed to</a> have begun work on next-generation 6G wireless technologies.</p><p>With Apple seeking to <a href=\"https://www.macrumors.com/2020/12/10/apple-developing-modem-in-house/\">move away</a> from reliance on other companies for wireless technologies, it is unclear how a deal with Huawei may pan out. Though Apple could take advantage of Huawei's expansive portfolio of 5G patents to develop its own wireless technologies, the company's apparent desire for independence in this area may mire the chances of a sustainable long-term agreement.</p><p><small>Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our <a href=\"https://forums.macrumors.com/forums/political-news.218/\">Political News</a> forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.</small></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/15/apple-shares-jump-airpods-pro-ad/\">Apple Shares 'Jump' AirPods Pro Ad</a></h3><p>Sunday March 14, 2021 9:09 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today shared a new AirPods Pro-focused ad called \"Jump\" on its YouTube channel, highlighting the Active Noise Cancellation and Transparency features of the earbuds in a creative way. In the spot, a man wearing AirPods Pro jump ropes through the city. It's set to the song \"Fallin' Apart\" by Young Franco, and it features the tagline \"Turn the world into your playground with AirPods Pro.\" ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/13/top-stories-apple-event-rumor-march-23/\">Top Stories: Apple Event Rumored for March 23, iMac Pro and HomePod Discontinued, and More</a></h3><p>Rumors about a potential Apple event are starting to heat up as we're getting close to the time of year when Apple frequently hosts an event, so stay tuned for more information on that front in the coming days and weeks. This week also saw Apple confirm it has discontinued both the iMac Pro and the original HomePod, while rumors are continuing to look forward to new Apple silicon MacBook Pro ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-discontinuing-homepod/\">Apple Discontinues Full-Sized HomePod to Focus on HomePod Mini</a></h3><p>Friday March 12, 2021 5:14 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple has discontinued the standard HomePod to focus exclusively on the HomePod mini, reports TechCrunch. First introduced four years ago, Apple's larger HomePod has never sold well because of its high price tag. Apple hoped that the HomePod's high-quality sound would give it an edge over competing products, but sales of the HomePod have always been lackluster with so many more affordable...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-silicon-mac-shipments-forecast/\">Next-Generation Apple Silicon MacBooks Expected to Drive Record-Breaking Mac Shipments This Year</a></h3><p>In a research note shared with MacRumors today, Barclays analysts said they expect Apple to report record Mac shipments in the 2021 fiscal year. Apple has seen strong demand for Macs driven by the COVID-19 pandemic and the release of Apple silicon Macs. With rumors indicating that Apple plans to release redesigned 14-inch and 16-inch MacBook Pro models with Apple silicon in the second half...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/iphone-13-touch-id-under-display/\">iPhone 13 Models Will 'Likely' Have Touch ID Under the Display</a></h3><p>iPhone 13 models slated for release later this year will \"likely\" feature a fingerprint scanner embedded under the display for authentication, in addition to Face ID, according to Barclays analyst Andrew Gardiner and three of his colleagues. In a research note shared with MacRumors today, the analysts added that iPhone 13 models will feature a smaller notch and that the LiDAR Scanner will...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/airpods-3-redesign-new-images/\">Upcoming AirPods 3 Redesign Shown Off in New Images</a></h3><p>Friday March 12, 2021 11:55 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the AirPods 3 rumored to be launching as soon as this month, we've been seeing an increasing number of leaks showing off the design of the new earbuds. Renders were shared yesterday, and today, 52audio has published a series of images said to feature the third-generation AirPods. As with prior leaks, the AirPods 3 have an AirPods Pro-like design with a shorter stem and a more rounded...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/13/iphone-12-cook-ad/\">Apple Promotes iPhone 12 'Ceramic Shield' Display In New 'Cook' Ad</a></h3><p>Saturday March 13, 2021 10:04 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>In a new ad on its YouTube channel, Apple is promoting the durability and water resistance of the iPhone 12 and the performance of the \"Ceramic Shield\" display. The ad, named \"Cook,\" showcases a chef putting an iPhone 12‌ through its paces by splashing it with liquids and flour, plus dropping it on its screen multiple times. The ad aims to highlight the \"Ceramic Shield\" display on the...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/airpods-3-mass-production-q3-2021/\">Kuo: AirPods 3 Mass Production to Start in Q3 2021</a></h3><p>Sunday March 14, 2021 11:55 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Mass production will begin on the third-generation AirPods in the third quarter of 2021, according to an investors note from analyst Ming-Chi Kuo that was seen by MacRumors. If mass production is not set to begin until the third quarter of 2021, it would mean that the AirPods 3 wouldn't ship until later in the year. Kuo previously said back in November that the AirPods 3 would launch in the ...</p></div></div></div>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ad97cf81393efaa95eaa45005b95fb02ba54649bdc4f53ab6905f7bdbff1cc03","category":"Apple"}