{"title":"Apple Privacy Chief: North Dakota Bill 'Threatens to Destroy the iPhone as You Know It'","link":"https://www.macrumors.com/2021/02/10/apple-privacy-chief-slams-north-dakota-bill/","date":1612990947000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/10/apple-privacy-chief-slams-north-dakota-bill/\"><p>The North Dakota Senate this week introduced a new bill that would prevent Apple and Google from requiring developers to use their respective app stores and payment methods, paving the way for alternative app store options, reports <em><a href=\"https://bismarcktribune.com/news/local/govt-and-politics/north-dakota-senate-bill-targets-monopolistic-app-stores/article_dc491c88-97e0-54cd-beb2-5a26044cb97c.html\">The Bismarck Tribune</a></em> (via <em><a href=\"https://www.theverge.com/2021/2/10/22276511/north-dakota-senate-bill-2333-apple-google-app-store-antitrust-monopoly\">The Verge</a></em>).</p><p><img alt=\"appstore\" width=\"2000\" height=\"1032\" src=\"https://images.macrumors.com/t/XyvRcZPIoWZcqWJKshyWw9crqn8=/400x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy\" data-src=\"https://images.macrumors.com/t/XyvRcZPIoWZcqWJKshyWw9crqn8=/400x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/XyvRcZPIoWZcqWJKshyWw9crqn8=/400x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy 400w,https://images.macrumors.com/t/9wSP_e8gFBBM8r9pbfvocpUDcRs=/800x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy 800w,https://images.macrumors.com/t/87-geFpXfhycYKNU8cs1hNWvxOs=/1600x0/filters:quality(90)/article-new/2020/03/appstore.jpg 1600w,https://images.macrumors.com/t/gZWZEY0g2uffob2DbUaMBLOcnPw=/2500x0/filters:no_upscale():quality(90)/article-new/2020/03/appstore.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/XyvRcZPIoWZcqWJKshyWw9crqn8=/400x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy 400w,https://images.macrumors.com/t/9wSP_e8gFBBM8r9pbfvocpUDcRs=/800x0/filters:quality(90)/article-new/2020/03/appstore.jpg?lossy 800w,https://images.macrumors.com/t/87-geFpXfhycYKNU8cs1hNWvxOs=/1600x0/filters:quality(90)/article-new/2020/03/appstore.jpg 1600w,https://images.macrumors.com/t/gZWZEY0g2uffob2DbUaMBLOcnPw=/2500x0/filters:no_upscale():quality(90)/article-new/2020/03/appstore.jpg 2500w\"><br>According to Senator Kyle Davison, who introduced <a href=\"https://www.legis.nd.gov/assembly/67-2021/documents/21-1044-01000.pdf\">Senate Bill 2333</a> yesterday, the legislation is designed to \"level the playing field\" for app developers in North Dakota and shield customers from \"devastating, monopolistic fees imposed by big tech companies,\" which refers to the cut that Apple and Google take from developers.</p><p>Specifically, the bill would prevent Apple from requiring a developer to use a digital application distribution platform as the exclusive mode of distributing a digital product, and it would keep the company from requiring developers to use in-app purchases as the exclusive mode of accepting payment from a user. There's also wording preventing Apple from retaliating against developers who choose alternate distribution and payment methods.</p><p>Apple Chief Privacy Engineer Erik Neuenschwander spoke out against the bill, saying that it \"threatens to destroy the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> as you know it\" by requiring changes that would \"undermine the privacy, security, safety, and performance\" of the ‌iPhone‌.</p><p>Neuenschwander said that Apple \"works hard\" to keep bad apps from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, and North Dakota's bill would \"require us to let them in.\"</p><p>Apple does not allow apps to be installed on iOS devices outside of the ‌App Store‌ and there are no alternate app store options that are available. Apple reviews every app that is made available for its customers to download, something that would not happen with a third-party app store option.</p><p>Apple also does not let app developers accept payments through methods other than in-app purchase except in select situations, a policy that has led to Apple's <a href=\"https://www.macrumors.com/guide/fortnite/\">legal fight</a> with <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>. ‌Epic Games‌ added an alternate payment method to Fortnite last year, leading the app to be banned from the ‌App Store‌.</p><p>Basecamp co-founder David Heinemeier Hansson, who was also embroiled in a legal fight with Apple over email app \"HEY\" last year, testified in favor of SB 2333 and said that it gives him hope that \"tech monopolies aren't going to rule the world forever.\"</p><div><blockquote><p lang=\"en\" dir=\"ltr\">North Dakota's SB 2333 is the first real, concrete legislative proposal I've seen that actually gives me hope that tech monopolies aren't going to rule the world forever. Fargo or Bismarck sound like wonderful places to set up shop under a shield against abuse 😂😍 — DHH (@dhh) <a href=\"https://twitter.com/dhh/status/1359203441827078145?ref_src=twsrc%5Etfw\">February 9, 2021</a></p></blockquote></div><p>In 2020, Apple faced a <a href=\"https://www.macrumors.com/2019/07/23/doj-tech-company-antitrust-review/\">U.S. antitrust inquiry</a> into its ‌App Store‌ fees and policies, which resulted in <a href=\"https://www.macrumors.com/2020/10/06/us-antitrust-report-apple-recommendations/\">a 450 page report</a> calling for new antitrust laws focused on promoting fair competition in digital markets, strengthening laws related to mergers and monopolization, and restoring vigorous oversight and enforcement of antitrust law.</p><p>No federal legislation has been introduced as of yet, and the North Dakota Senate committee did not take action on the bill. Senator Jerry Klein said that there's \"still some mulling to be done\" in reference to the bill.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/intel-11th-gen-vs-apple-m1-chip-benchmarks/\">Intel Downplays Apple's M1 Chip With 'Carefully Crafted' Benchmarks</a></h3><p>Saturday February 6, 2021 3:17 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Nearly three months after the launch of Apple's rave-reviewed M1 Macs, Intel has fired back, but there are some asterisks involved. In a slideshow shared by PCWorld this week, Intel highlighted what PCWorld described as \"carefully crafted\" benchmarks in an attempt to prove that laptops with the latest 11th Generation Core processors are superior to those with Apple's custom-designed M1 chip. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/01/imac-apple-silicon-redesign/\">iMac to Get a Whole New Look for Apple Silicon</a></h3><p>Apple's long-awaited iMac with Apple Silicon is expected to arrive this year featuring a complete redesign, according to a range of reports. According to Bloomberg's Mark Gurman, the redesigned iMac models will feature significantly slimmed down bezels around the display. The large aluminum \"chin\" segment, below the display of current iMacs, will be removed entirely for a design that...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/07/iphone-12-risk-magnets-pacemakers/\">Medical Doctors Underline Potential Risk of iPhone 12 Interference With Pacemakers</a></h3><p>Sunday February 7, 2021 4:11 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple's warning to keep the iPhone 12 away from cardiac devices due to electromagnetic interference was further underlined by U.S. cardiologists this week in a new report (via NBC25 News). Apple's iPhone 12 series includes an array of magnets that help align the phone on Apple's MagSafe charging accessory to maximize charging, and Apple already advises users with implanted pacemakers and...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/ios-14-5-beta-siri-default-music-service/\">Siri Setting in iOS 14.5 Beta Lets Users Select Default Music Streaming Service</a></h3><p>Monday February 8, 2021 4:09 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple last week released beta versions of upcoming iOS 14.5 and iPadOS 14.5 updates to developers and public beta testers, and among a number of new features, Apple has added the ability to set a default music streaming service when using Siri to play songs. Image via Reddit user matejamm1 First spotted by Reddit users, the first time you ask Siri to play a song in iOS 14.5, you are given the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-releases-macos-big-sur-11-2-1/\">Apple Releases macOS Big Sur 11.2.1 With Fix for MacBook Pro Charging Issue [Updated]</a></h3><p>Tuesday February 9, 2021 10:13 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today released macOS Big Sur 11.2.1, the third update to the macOS Big Sur operating system that launched in November. macOS Big Sur‌ 11.2.1 comes a little over a week after the release of macOS 11.2. The new ‌‌‌macOS Big Sur‌‌ 11.2.1‌ update can be downloaded for free on all eligible Macs using the Software Update section of System Preferences. According to Apple's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-dtk-credit-for-developers-increased/\">Apple Ups DTK Mac Mini Return Credit to $500 After Developer Complaints</a></h3><p>Friday February 5, 2021 8:51 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Prior to the release of the M1 Macs, Apple offered developers a $500 Developer Transition Kit (DTK) that included a Mac mini equipped with an A12Z Bionic chip first used in the iPad Pro, 16GB RAM, a 512GB SSD, two USB-C ports, two USB-A ports, and an HDMI 2.0 port. The DTKs were available on a temporary basis, and earlier this week, Apple said that it would soon begin asking developers to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-health-app-data-crime-investigation/\">Apple Health App Data Helps Send a Man to Prison for His Wife's Death</a></h3><p>Tuesday February 9, 2021 1:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>A man who claimed to be innocent following the death of his wife was found to be guilty after police used evidence sourced from the Apple Health app on his iPhone to convict him. As outlined by The Birmingham News (via Cult of Mac), Kat West, Jeff West's wife, was found dead in January 2018 after suffering a blow to the head. Jeff West claimed that she was drunk and fell while he was asleep...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/bloomberg-apple-success-under-tim-cook/\">Bloomberg Story Breaks Down Apple's Unrivaled Success Under Tim Cook's Leadership</a></h3><p>Tuesday February 9, 2021 3:24 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Bloomberg has published an in-depth piece by journalists Austin Carr and Mark Gurman about the rise of Apple under Tim Cook's leadership, covering several attributes of the CEO that took over from Steve Jobs, including his diplomatic acumen, operational prowess, eye for detail, and manifest success in making Apple one of the biggest companies in the history of modern business. The story...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"adc70f4150a66f8662e18be7add0cfec46df751809dff635d24a4e3973c42dff","category":"Apple"}