{"title":"Spotted: new SRAM wireless AXS Blip shifters","link":"https://cyclingtips.com/2021/07/spotted-new-sram-wireless-axs-blip-shifters/","date":1625600581000,"content":"<div><div><p>My two time trial tech galleries from this year’s <a target=\"_blank\" href=\"https://cyclingtips.com/tag/tour-de-france/\">Tour de France</a> have already been chock-full of go-fast gear. The <a target=\"_blank\" href=\"https://cyclingtips.com/2021/07/gallery-tour-de-france-time-trial-tech-part-one/\">first</a> mainly included bikes and wheels, and the <a target=\"_blank\" href=\"https://cyclingtips.com/2021/07/gallerytour-de-france-time-trial-tech-part-two/\">second part</a> featured several new and unannounced tech items. But one new item I had spotted but did not include in those galleries while I tried to gather some further information was a set of new wireless SRAM Blip remote shifters on the custom extensions of Bauke Mollema’s Trek Speed Concept. SRAM currently has both Blip and Clic remotes for TT aero bar extensions, but the ones on Mollema’s bike are of a vastly different design. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/P1160397.jpg\"><figcaption>The current wired eTap Blips</figcaption></figure><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/Wireless-SRAM-Blips-1-1340x619.jpg\"><figcaption>Mollema’s new wireless AXS Blips look very different.</figcaption></figure><p>SRAM’s current Blip options are smaller and rounder, while the shifters spotted on Mollema’s bike are larger and feature a much more pronounced button. </p><p>SRAM global road PR manager Michael Zellmann would only provide minimal information, but he did confirm that these are, in fact, new wireless AXS Blips, although he stressed they’re still very much under development. </p><p>“These are new wireless Blips, still under development, and not yet even certain to make it through development and testing,” he said. “Bauke Mollema is the only rider at the Tour with the new Blips, and only for his TT bike.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/Wireless-SRAM-Blips-4-1340x619.jpg\"><figcaption>Another view of those new AXS Blips.</figcaption></figure><p>While Zellmann was reluctant to give any further information on a product not even certain to make it to market, he did at least give some insight into what the wireless Blips might offer. </p><p>Zellmann confirmed that while Mollema is only testing the new wireless Blips on his TT bike, they are compatible with any AXS-equipped bike.</p><p>Placement options for SRAM’s current satellite shifters (and Shimano’s, for that matter) are limited to wire length, and those wires also need to routed under bar tape or internally through the handlebars. A wireless Blip could be placed just about anywhere, and would not only be easier to install, but also easier to move to dial in the positioning. One such example Zellmann suggested was for riders with disabilities and adapted needs.</p><p>“The wireless Blip gives us a unique shifting solution,” Zellmann said. “Where current iterations of the Blips wire straight into the shifter lever, these new Blips offer a much-simplified install and open up many more possibilities.”</p><p>Presumably, the new wireless Blips could also open up the option of Blip button shifting on SRAM Rival AXS groupsets, which is especially interesting since the Rival AXS levers have no ports for wire remotes. </p><p>Zellmann also explained the new wireless Blips currently feature an integrated, non-replaceable, and non-rechargeable battery. Zellmann did say SRAM is targeting life expectancy of at least two years and the easy recycling of Blips that have run out of power. </p><p>Zellmann could not provide any pricing or availability details, again advising this product is as of yet unconfirmed and still very much in testing. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/Wireless-SRAM-Blips-2-1340x619.jpg\"></figure></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"add5767f8c02f00ae151fbfba93b90581476febcc81632ca4cc7e199f7364710","category":"Cycling"}