{"title":"Apple Car Latest: Kia Talks With Potential Partners About Vehicle Assembly in Georgia, While Apple Seeks Supply Deals With Japanese Automakers","link":"https://www.macrumors.com/2021/02/05/apple-car-kia-talks-georgia-assembly/","date":1612516885000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/05/apple-car-kia-talks-georgia-assembly/\"><p><a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a> rumors continued to surface on Friday, with reports that Hyundai Group affiliate Kia has approached potential partners about a plan to assemble Apple's autonomous electric vehicle at its West Point plant in the U.S. state of Georgia (via <em><a href=\"https://www.wsj.com/articles/kia-is-preparing-to-build-apple-cars-in-the-u-s-11612498065\">The Wall Street Journal</a></em>).</p><p><img src=\"https://images.macrumors.com/t/C9l5Ui0woKg3AN-Q9nokb7TI0YI=/400x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg?lossy\" srcset=\"https://images.macrumors.com/t/C9l5Ui0woKg3AN-Q9nokb7TI0YI=/400x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg?lossy 400w,https://images.macrumors.com/t/By6cIvJuWFrpONk0oBaQvcRQM7s=/800x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg?lossy 800w,https://images.macrumors.com/t/2CK7ugyZUmxjlMTkqumygZbFfQY=/1600x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg 1600w,https://images.macrumors.com/t/DOhsDJk6wzuB0DYDCqFwunRV2pQ=/2500x0/filters:no_upscale():quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg 2500w\" sizes=\"(max-width: 900px) 100vw, 697px\" alt=\"Apple car wheel icon feature purple\" width=\"2500\" height=\"1406\" data-old-src=\"https://images.macrumors.com/images-new/1x1.trans.gif\" data-src=\"https://images.macrumors.com/t/C9l5Ui0woKg3AN-Q9nokb7TI0YI=/400x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/C9l5Ui0woKg3AN-Q9nokb7TI0YI=/400x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg?lossy 400w,https://images.macrumors.com/t/By6cIvJuWFrpONk0oBaQvcRQM7s=/800x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg?lossy 800w,https://images.macrumors.com/t/2CK7ugyZUmxjlMTkqumygZbFfQY=/1600x0/filters:quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg 1600w,https://images.macrumors.com/t/DOhsDJk6wzuB0DYDCqFwunRV2pQ=/2500x0/filters:no_upscale():quality(90)/article-new/2020/12/Apple-car-wheel-icon-feature-purple.jpg 2500w\"></p><blockquote><p>Kia Corp. has approached potential partners about a plan to assemble Apple Inc.'s long-awaited electric car in Georgia, according to people familiar with the matter. The proposal would involve a multibillion-dollar investment, according to people familiar with the matter, who stress that a deal hasn’t been completed.</p><p>Hyundai has talked to Apple about investing more than $3 billion in a deal that would see its subsidiary Kia begin building cars under the tech company’s brand as soon as 2024, a person familiar with the matter said. Under such an agreement, up to 100,000 vehicles could be assembled in the first year in Georgia, where Kia has a factory, the person said.</p></blockquote><p>Meanwhile, in Asia, <em>Nikkei</em> reports that Apple is in discussions with at least six Japanese automakers over supply partnerships and manufacturing contributions (via <em><a href=\"https://www.bloomberg.com/news/articles/2021-02-05/japan-carmakers-jump-after-nikkei-report-on-apple-ev-development\">Bloomberg</a></em>). Honda and Mazda said they couldn't comment on rumors that they had been approached by Apple, while Mitsubishi said it had not been contacted and Nissan declined to comment.</p><p>According to Tatsuo Yoshida, a senior Bloomberg Intelligence analyst, Japanese automakers are usually too busy with their own development, manufacturing, sales and customer service to take on a task like working with Apple. However, Nissan or Mitsubishi \"don’t have much work, and are somewhat idle, so they might sign up,\" he said.</p><p>‌Apple Car‌ rumors have swirled for weeks now, with Apple said to be aiming to have a vehicle‌ in production in 2024, though it's possible that timeline will be delayed as work on the ‌‌Apple Car‌‌ is still in the early stages. <em>Bloomberg</em> <a href=\"https://www.macrumors.com/2021/01/07/apple-car-launch-5-to-7-years-away/\">recently said</a> it would be five to seven years before an ‌‌Apple Car‌‌ is ready to launch, while Apple analyst Ming-Chu Kuo said this week that he expects to see the ‌‌Apple Car‌‌ in 2025 <a href=\"https://www.macrumors.com/2021/02/02/kuo-apple-car-use-hyundai-e-gmp-platform/\">at the earliest</a>.</p><p>Earlier this week it was <a href=\"https://www.macrumors.com/2021/02/03/first-apple-car-no-driver-fully-autonomous/\">reported</a> that the first ‌Apple Car‌ to be released will not be designed to operate with a driver and could be marketed for food delivery operations and firms that incorporate robotaxis.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/03/camera-comparison-iphone-12-samsung-galaxy-s21/\">Blind Camera Comparison Video: iPhone 12 Pro Max vs. Samsung Galaxy S21 Ultra</a></h3><p>Wednesday February 3, 2021 12:55 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Samsung in January debuted its latest flagship smartphone lineup, which includes the Galaxy S21 Ultra, a direct competitor to the iPhone 12 Pro Max that Apple introduced in October. In our latest YouTube video, we pitted the two smartphones against one another for a blind camera comparison. Subscribe to the MacRumors YouTube channel for more videos. In the video up above and the photos in...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/03/apple-car-kia-investment/\">Apple to Invest $3.6 Billion in Kia Motors for Apple Car Production</a></h3><p>Tuesday February 2, 2021 9:46 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple is rumored to be planning to invest 4 trillion won ($3.6 billion) in Kia Motors as part of a planned manufacturing partnership between the two companies, according to Korean site DongA Ilbo (via Bloomberg). Apple and Kia (an affiliate of Hyundai) are said to be establishing a production relationship that will see Kia build Apple Cars at its U.S. facility located in Georgia. Apple...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/03/apple-asks-developers-to-return-dtk/\">Apple Asks Developers to Return DTK Mac Minis in Exchange for $200 Credit Toward M1 Mac</a></h3><p>Wednesday February 3, 2021 4:48 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Ahead of the release of the M1 Macs, Apple provided developers with a Developer Transition Kit that included a Mac mini equipped with an A12Z Bionic chip first used in the iPad Pro, 16GB RAM, a 512GB SSD, two USB-C ports, two USB-A ports, and an HDMI 2.0 port. Image via Axel Roest These DTKs were offered up on a temporary basis to developers who paid $500 for access, and were aimed at giving...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-dtk-credit-for-developers-increased/\">Apple Ups DTK Mac Mini Return Credit to $500 After Developer Complaints</a></h3><p>Friday February 5, 2021 8:51 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Prior to the release of the M1 Macs, Apple offered developers a $500 Developer Transition Kit (DTK) that included a Mac mini equipped with an A12Z Bionic chip first used in the iPad Pro, 16GB RAM, a 512GB SSD, two USB-C ports, two USB-A ports, and an HDMI 2.0 port. The DTKs were available on a temporary basis, and earlier this week, Apple said that it would soon begin asking developers to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/04/apple-watchos-7-4-public-beta/\">Apple Releases First watchOS 7.4 Public Beta With iPhone Unlocking Feature</a></h3><p>Thursday February 4, 2021 2:51 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today seeded the first beta of an upcoming watchOS 7.4 update to public beta testers, with the new beta coming a few days after the release of the first developer beta. The ‌watchOS 7‌.4 update can be downloaded after upgrading your iPhone to the public beta version of iOS 14.5. After installing iOS 14.5, the watchOS 7.4 software should show up as long as you have the Apple Watch...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/03/apple-watch-swiss-clone-mechanical-loading-wheel/\">Swiss Watch Maker Debuts $30,800 Apple Watch Clone With Mechanical Loading Wheel</a></h3><p>Wednesday February 3, 2021 10:16 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Back in 2016 when the Apple Watch was still a relatively new device, Swiss watch maker H. Moser &amp; Cie came out with a high-end mechanical Apple Watch clone called the Swiss Alp Watch, featuring a rectangular watch face with curved, round edges, a crown at the side, and Apple Watch style lugs. H. Moser &amp; Cie today debuted a followup to the original Swiss Alp Watch, introducing the $30,800...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-pauses-car-talks-hyundai-kia/\">Apple Pauses Electric Car Talks With Hyundai and Kia</a></h3><p>Friday February 5, 2021 2:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Multiple rumors over the course of the last week have suggested that Apple has been discussing Apple car manufacturing with Hyundai and Hyundai affiliate Kia, but those talks have paused recently, reports Bloomberg. Apple has also been discussing its Apple Car plans with other automobile manufacturers, so despite rumors suggesting Apple is considering a deal with Hyundai/Kia, Apple could...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/03/ipad-mini-6-could-disappoint/\">Upcoming iPad Mini 6 Could Disappoint Fans</a></h3><p>Fan-favorite small tablet, the iPad mini, may disappoint some users with its sixth-generation model, which is expected to arrive as soon as March. The iPad mini most recently got a refreshed design in 2015 with its fourth iteration. While the device did receive a minor update in 2019 with the A12 Bionic chip, a True Tone display, Bluetooth 5.0, and Apple Pencil support, the iPad mini...</p></div></div></div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ae29cce850dd99a10b749db1c62942632c24efa43224ec12fbc82d864048a5c4","category":"Apple"}