{"title":"Shredding at the School of Rocks: Women helping women enjoy off-road riding","link":"https://cyclingtips.com/2021/11/shredding-at-the-school-of-rocks-women-helping-women-enjoy-off-road-riding/","date":1637311585000,"content":"<div><div><p>Eleanor Jaskowska quit her job last year, but she didn’t stop working. A passionate cyclist, she was frustrated with seeing her female roadie friends struggle to get to grips with off-road riding and she wanted to change that.</p><p>“[They] were buying second-hand cyclocross bikes or hardtail mountain bikes and they’d go on like one or two rides and not really love it,” she says. “Maybe they would go on a trail that was really muddy and awful, or they’d go down something that was way too steep for what they expected and they’d just scare themselves and just be like, ‘not for me, I don’t really like that.’”</p><p>Jaskowska felt there must be a better way for her friends to make the most out of riding off-road. “My experience of getting into off-road riding had been my partner taking me riding and getting into it that way,” she says. “And I was like, ‘well hang on a minute, if the pace of change is we’re just waiting for partners and friends to gradually build up off-road riding, then we’re going to be waiting around a long time for this sport to become 50/50’.”</p><p>“So I thought: ‘Is there a way that I can break down all of these scary things and deliver them in little chunks for my friends?’”</p><p>With that, the School of Rocks was born.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/MdGPhotography-IRIS-wtr19-078-1340x893.jpg\"></figure><p>Jaskowska devised a ‘curriculum’ spanning six weeks and covering the basics of riding off-road. “The idea is that over the six weeks you start off on a route that is not challenging,” she says. “None of the surfaces or gradients or anything are challenging. And then you gradually introduce features.</p><p>“It doesn’t always have to be a route; it can also be riding somewhere and sessioning something or going and having an evening at a pump track — but by the end of the six weeks [we] have basically introduced loads of different elements and experiences so that the riders are doing something that they would never in a million years have considered riding at the beginning.”</p><p>Jaskowska set up the original School of Rocks in her home city of Bristol, UK, however after posting about it on social media she soon discovered that women from all over were crying out for a similar programme. With the support of retired pro and The Cyclists’ Alliance founder, Iris Slappendel, via her cycling apparel brand, I-RIS, the School of Rocks was expanded. Now, there are iterations in most major UK cities as well as in Slappendel’s home of The Netherlands — each led by their respective ‘ROCKstars’.</p><p>The support that Slappendel and the I-RIS brand brings, Jaskowska says, “was essentially the push that I think I needed because I was like ‘well I think this is a great idea’ but I have a habit of overthinking things or just getting a little bit scared. Then just having Iris come in and support it meant that it was obviously not a rubbish idea” </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/beach-cruise-40-1340x893.jpg\"></figure><p>Slappendel and I-RIS head of marketing, Lexi Brown, knew that this was an initiative that perfectly reflected the ethos of the brand.  “When I started the brand four years ago I really did it because I just wanted to create very good quality comfortable and nice looking cycling apparel for women and for myself at that point because I couldn’t find it,” reflects Slappendel. </p><p>“When women come here to fit something or want to buy something, it’s always the same: they’re so insecure about how they look, if they can wear it, if they’re good enough to wear expensive — or reasonably priced — cycling kit. There’s so much insecurity around women to start riding, or to ride with other people, or to ride with guys, or other women, or go off-road, or do something different.”</p><p>Being supported by a cycling clothing brand, however, doesn’t mean that attending the School of Rocks comes with a requisite dress code. “One thing that we talked about really early on was not wanting a ‘uniform’ for the women coming along and not wanting to push looking a certain way, or dressing a certain way, and they were totally on board with that,” Jaskowska explains.</p><p>“I’ve never been really driven by selling lots,” says Slappendel. “I just wanted to make really nice stuff. There’s no external investors or whatever so there’s no pressure to make huge profits — that’s also something I really like about the way the brand is set up. And that’s why the School of Rocks completely fitted with what I was noticing, what I was feeling, and what I would like to give, not just my customers, but also the community itself.</p><p>“Because it doesn’t matter, as long as they start riding and have fun together I think that’s really the most important [thing].” </p><p>Indeed there is no material requisite for joining a School of Rocks apart from whatever bike you might own. “People turn up wearing shorts and T-shirts and on hybrid bikes, and old retro mountain bikes, gravel bikes, and even road bikes,” says Jaskowska. “And that, to me, has been really nice because that’s what the vision was — it doesn’t matter what bike you ride, it doesn’t matter what you’re wearing, if you want to come for a ride then you come for a ride.“</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/NorthLakes-SOR-Group-1340x1005.jpg\"></figure><p>The idea of transforming a potentially intimidating experience into a supportive, female-led safe space is at the heart of the project and is a shared goal of both Jaskowska, and Slappendel and her team. </p><p>“To generalise, I think women have a tendency to think about what could go wrong, rather than how cool it would be if it went right,” Jaskowska says. “And I think when you’re in that environment, and it’s like, ‘well, what’s the worst thing that happens? I fall off, and we all have a bit of a giggle.’ It stops being about embarrassment and shame.</p><p>“I think probably quite deliberately, but without realising it — if that makes sense — we’ve removed shame from that environment because everybody here is a beginner or they’re here as a more experienced rider to help out. And there’s no snobbery or nobody takes themselves too seriously.</p><p>“We take that male default and we say ‘that doesn’t work for us, that’s not fun, that’s not enjoyable.’ And we build a space, and we design that space how we want it to feel, which is to feel valued and not feel shame and to take ourselves a bit less seriously because it’s fun, it’s a hobby. We can take the riding seriously and we can be there with the intention to have fun and have a good time but that doesn’t mean taking yourself seriously. The two are definitely mutually exclusive.” </p><p>The first term of the School of Rocks might be out until spring but those who are still keen to learn can follow a series of online workshops which are being run every Tuesday. For details go to the <a href=\"https://www.instagram.com/theschoolofrocks/\" target=\"_blank\">group’s Instagram</a> where the workshops are advertised (using the brilliant hashtag #shredthecurriculum.)</p></div></div>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"aeef8fdb42439d8fb38903a849d5f21b326d28a310dcdd1eb0db2739387b0d4b","category":"Cycling"}