{"title":"ไม่ใช่แค่หาของ, ซัมซุงเผย Galaxy SmartTag ใช้คุมสมาร์ทโฮมบน SmartThings ได้ด้วย","link":"https://www.blognone.com/node/121072","date":1612757129000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/j8u2rhG1.jpg?itok=NFRGxKyD\"></p><div itemprop=\"description\"><p>Samsung เปิดตัว <a href=\"https://www.blognone.com/node/120613\">Galaxy SmartTag และ SmartTag+</a> ไปเมื่อกลางเดือนที่แล้ว รุ่นธรรมดาใช้งาน bluetooth low energy เพื่อเชื่อมกับเครือข่ายมือถือ Galaxy ระบุตำแหน่งอุปกรณ์ผ่าน SmartThings Find ส่วนรุ่นพลัสใช้คลื่น ultra wide-band เพื่อหาของด้วย AR ในพื้นที่จริงได้ แต่ Samsung กล่าวในการให้สัมภาษณ์กับเว็บไซต์ <a href=\"https://www.fastcompany.com/90600578/samsung-smarttags-smartthings-airtags\">Fast Company</a> ว่า SmartTag ทำได้มากกว่านั้น</p><p>Jaeyeon Jung รองประธาน Samsung และหัวหน้าทีม SmatThings ให้สัมภาษณ์ว่า SmartTags และ SmartTags+ จะเป็นส่วนหนึ่งของ SmartThings นอกจากใช้หาของหายแล้ว ยังสามารถใช้เป็นปุ่มกดเพื่อสั่งการระบบ Automation บน SmartThings ได้ เช่น เปิด-ปิดไฟ เมื่อออกจากบ้าน, เปิดประตูโรงรถ เปิดไฟ และเครื่องปรับอากาศเมื่อถึงบ้าน และอื่นๆ</p><p>Jung ยังระบุว่านอกจากการใช้งานในผู้บริโภคทั่วไปแล้ว Samsung อาจมีการขาย SmartTag ให้กับธุรกิจแบบ B2B พร้อมยกตัวอย่างว่าตอนนี้ Samsung ก็ใช้ SmartTag เพื่อระบุตำแหน่งรถขนของว่าอยู่บริเวณไหนของบริษัท พร้อมแอบแง้มไว้เพิ่มเติมว่า SmartThings Find อาจเข้าไปเป็นส่วนหนึ่งของระบบปฏิบัติการ Android ในอนาคต แต่ไม่ได้ให้รายละเอียดอื่น</p><p><img src=\"https://www.blognone.com/sites/default/files/externals/1d5292aec1a857d520c9797ff56be689.jpg\" alt=\"\"></p><p>การที่ Samsung มีธุรกิจ B2B ที่แข็งแรง ผนวกกับระบบความปลอดภัย Samsung Knox และความพร้อมที่จะปรับแต่งและออกแบบโซลูชั่นสำหรับธุรกิจอื่นๆ อาจเป็นโอกาสดีที่ของ Galaxy SmartTag ที่จะถูกนำไปใช้งานได้หลากหลาย แตกต่างจาก AirTags ที่ทำงานได้แค่บนระบบของ Apple เท่านั้น</p><p>น่าสนใจว่าแม้ AirTags ของ Apple จะยังไม่เปิดตัว แต่ Samsung ก็พยายามแสดงถึงความแตกต่าง พร้อมข้อดีที่เหนือกว่าให้เห็น ผ่านระบบที่เป็นส่วนหนึ่งของ SmartThings แล้ว คงต้องติดตามกันต่อไปว่า AirTags จะสามารถใช้งานในรูปแบบไหนได้บ้าง เมื่อถึงเวลาเปิดตัวจริง</p><p>ที่มา - <a href=\"https://www.fastcompany.com/90600578/samsung-smarttags-smartthings-airtags\">Fast Company</a></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"aff6c9f39cdc7548d1a3abb4c295208eaef4b9acb2b73ef03b95fe05e744ec03","category":"Thai"}