{"title":"Pro introduces curved version of the Stealth saddle, overhauls the original","link":"https://cyclingtips.com/2021/06/pro-bike-gear-stealth-curved-saddle-news/","date":1624405500000,"content":"<div><div><p>Shimano’s accessory and cockpit component division, Pro Bike Gear, has just announced a revamp of its massively popular Stealth short-nose saddle range. There’s a new version with a shape that’s more curved than before, while the original Stealth has earned a facelift and structural change to bring it in line with <a href=\"https://cyclingtips.com/2020/10/pro-bike-gear-introduces-lower-priced-stealth-saddle-and-new-alloy-handlebars/\" target=\"_blank\">Pro’s other recently updated saddles</a>. </p><h2>Stealth Curved: A new shape </h2><p>The original Stealth was Pro’s answer to the modern short-nose-style saddle, a trend kicked off by the Specialized Power saddle in 2015. This non-gender-specific style of shortened saddle has since become a common offering from all major saddle brands, and most new performance bikes come with such things fitted, too. </p><p>While the <a href=\"https://cyclingtips.com/2017/10/specialized-power-vs-pro-stealth-stub-nose-saddle-comparison-review/\" target=\"_blank\">original Pro Stealth saddle shares similar principles with the Specialized Power</a>, the overall approach to shaping has always been quite different. Notably, the Stealth offers a far flatter shape across the width and a vastly wider nose section.</p><p>And that’s where the new Stealth Curved comes in. It’s a saddle that offers a notable curve along its width, not unlike the Specialized Power. According to Pro, the new Curved option is better suited for riders who tend to move side to side on the saddle.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Pro-Bike-Gear-Stealth-versus-Stealth-Curved-saddle-release-2-1340x754.jpg\"><figcaption>The new Stealth Curved (bottom) offers a more shapely profile than the regular Stealth (top).</figcaption></figure><p>“The curved profile gives riders more of a supported cradle to prevent excess side-to-side movement,” said Pro’s product development manager Mark Kikkert. The company already offered the Griffon saddle for such rider needs, but the new Stealth Curved is intended for those seeking similar support while holding an aerodynamic riding position. “The short nose of the Stealth saddles provides riders with increased comfort and fewer pressure points in a deep aerodynamic position.”</p><p>Compared to the original Stealth, the new Stealth Curved also offers a subtly narrower nose. The Stealth Curved retains the large central recess that’s reinforced with Pro’s “triple bridge” shell design. </p><p>Pro will offer the Stealth Curve in both Team (carbon fibre rails) and Performance (stainless steel rails) versions, weighing a claimed 161 and 204 grams respectively. Both will be is available in a choice of 142 and 152 mm widths. </p><h2>The Stealth gets a facelift </h2><p>The original Stealth remains in the line-up but has received a few tweaks to bring it in line with Pro’s recently updated Falcon, Turnix, and Griffon saddles. </p><p>The updated saddles are said to retain the same contact points and riding feel as before, but do so with a new carbon fibre reinforced base construction and a central opening that’s now 12% larger for further pressure relief. The saddles also appear to feature far more subtle branding than before. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/2022-Pro-Bike-Gear-Stealth-and-Stealth-Curved-saddle-release-6-1340x754.jpg\"><figcaption>The updated Stealth should retain a familiar feel, but does so with a slightly lower weight, a bigger centre channel, and less polarising aesthetics.</figcaption></figure><p>According to Pro, the Team version (carbon fibre rails) of the saddle is said to weigh 161 g which is an 11-gram saving over the old. Like the new Curved saddle, this updated model is available in Team and Performance versions, and with a choice between 142 and 152 mm widths. Pricing in most countries should be unchanged, with the Team version set at US$TBC / AU$349, and the Performance version at US$TBC / AU$220.</p><p>The relatively new budget-minded option of the range, <a href=\"https://cyclingtips.com/2020/10/pro-bike-gear-introduces-lower-priced-stealth-saddle-and-new-alloy-handlebars/\" target=\"_blank\">Stealth Sport</a>, remains unchanged.  </p></div></div>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b0334b4eb033917b2eae63bdb95b64311ce498f8bf3739c02bf4df44a59b332c","category":"Cycling"}