{"title":"André Greipel’s long drought is over","link":"https://cyclingtips.com/2021/05/andre-greipels-long-drought-is-over/","date":1621215443000,"content":"<div><div><p>One of the peloton’s most beloved riders, German sprinter André Greipel, got the gorilla off his back with a win at the Challenge Mallorca on Sunday. </p><p>Like his longtime rival, Mark Cavendish – who won four stages at the Tour of Turkey last month – Greipel didn’t break his winless streak on cycling’s biggest stage. But when you’re a sprinter in the twilight of your career, you take what you can get, and a minor result takes on a greater symbolic significance. </p><p>The life cycle of a top sprinter is a fickle thing. To be at the top of the game requires blistering speed, bravery, and tactical smarts, along with a committed lead-out train. When a rider discovers that magical formula, it can look effortless. When they don’t, the gap between wins can seem interminable. </p><p>The last time André Greipel won a race was in late January 2019, half a world away on the west coast of Africa at the UCI 2.1-rated Tropicale Amissa Bongo. The German veteran had just been dropped by Lotto-Soudal, and just started what would be a one-year stint with Arkea Samsic.</p><blockquote></blockquote><p>Arkea Samsic management was clearly hopeful that Greipel would deliver great things, but Amissa Bongo was one of the few bright spots in one of his quietest-ever seasons. At that year’s Tour de France – one of Greipel’s happy hunting grounds – he only cracked the top 10 on a single occasion, finishing sixth on the Champs-Elysees. </p><p>At the end of that year, Greipel signed a three year contract with Israel Start-Up Nation, a cushy gig that would see him through to retirement. In a torrid 2020 season that was disrupted by COVID-19 calendar interruptions, Greipel’s most prominent result was, again, sixth on a stage at the Tour de France. At the Tour Down Under, where Greipel has won a colossal 18 stages over his long career, he went winless.</p><p>Which brings us to 2021, the island of Mallorca and the 1.1-rated one-day Trofeo Alcudia-Port d’Alcudia, part of the Challenge Mallorca. On a largely flat parcours in the Spanish sun, the race came down to a bunch sprint. </p><p>Two veterans, André Greipel and Alexander Kristoff – a gorilla and a stallion – went to the line together, moving left toward the barriers in lockstep. As the line approached, Greipel was holding Kristoff off by half a bike length. </p><p>A sprinter’s professional cycling career is defined by milliseconds and millimetres, but when you stretch those tiny measurements out across a decade, they add up. As Greipel crossed the line first to take his 157th win, his trademark smile stretched across his face.</p><p>Greipel’s storied career has included 22 Grand Tour stage wins, alongside other results big and small. This one wasn’t one of the big ones.</p><p>But in the moment, you get the sense that it was one that mattered. </p></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b09c6a09562d1cc52976dafc043e689113cc78c22febb804fb73de9adc870385","category":"Cycling"}