{"title":"Twitter Expands Support for DM Voice Messages on iOS and Android to India","link":"https://www.macrumors.com/2021/02/17/twitter-dm-voice-messages-india/","date":1613591798000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/17/twitter-dm-voice-messages-india/\"><p>Starting today, Twitter users in India will have the ability to send voice messages in their Twitter DMs that are up to 140 seconds long, the company announced (<a href=\"https://www.thehindu.com/news/national/twitter-to-pilot-voice-dms-in-india/article33853323.ece\">via <em>The Hindu</em></a>).</p><p><img alt=\"twitter voice message dm\" width=\"1600\" height=\"1099\" src=\"https://images.macrumors.com/t/7-WEfNQRGlHJCKfr9IFKhXW1MpM=/400x0/filters:quality(90)/article-new/2021/02/twitter-voice-message-dm.jpg?lossy\" data-src=\"https://images.macrumors.com/t/7-WEfNQRGlHJCKfr9IFKhXW1MpM=/400x0/filters:quality(90)/article-new/2021/02/twitter-voice-message-dm.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/7-WEfNQRGlHJCKfr9IFKhXW1MpM=/400x0/filters:quality(90)/article-new/2021/02/twitter-voice-message-dm.jpg?lossy 400w,https://images.macrumors.com/t/Yt-x-9oZAKD3biacC1JmxAab9Ak=/800x0/filters:quality(90)/article-new/2021/02/twitter-voice-message-dm.jpg?lossy 800w,https://images.macrumors.com/t/Ze__hUaKBker0yGJR2putC89-Og=/1600x0/filters:quality(90)/article-new/2021/02/twitter-voice-message-dm.jpg 1600w,https://images.macrumors.com/t/U6LyV87bNnhIxUn9NWZYc4_3I04=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/twitter-voice-message-dm.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/7-WEfNQRGlHJCKfr9IFKhXW1MpM=/400x0/filters:quality(90)/article-new/2021/02/twitter-voice-message-dm.jpg?lossy 400w,https://images.macrumors.com/t/Yt-x-9oZAKD3biacC1JmxAab9Ak=/800x0/filters:quality(90)/article-new/2021/02/twitter-voice-message-dm.jpg?lossy 800w,https://images.macrumors.com/t/Ze__hUaKBker0yGJR2putC89-Og=/1600x0/filters:quality(90)/article-new/2021/02/twitter-voice-message-dm.jpg 1600w,https://images.macrumors.com/t/U6LyV87bNnhIxUn9NWZYc4_3I04=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/twitter-voice-message-dm.jpg 2500w\"><br>Twitter says the rollout in India will be conducted in phases, so not all users will see the feature straight away. For users who do, there’ll be a new icon that replaces the typical \"Send\" button within existing or new chats on iOS and Android that starts the recording. Once you begin recording, Twitter starts a countdown from 140 seconds until you press stop, or the time runs out. Before you send the audio message, Twitter does offer you the ability to listen to the recording.</p><p>The ability to record and send messages is currently only available on iOS and Android, while users on the web can only so far listen to recordings. With the rollout in India today, Android Central reports the feature is now available in three countries: India, Brazil, and Japan.</p><p>Twitter announced plans to bring voice messages to chat last year as part of its effort to offer users more options to \"express themselves in conversations.\" Support for voice messages follows the rollout of audio tweets in June, and recent testing of audio group room chats called \"Spaces.\"</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/14/heart-month-activity-challenge/\">Apple's Heart Month Activity Challenge Requires 60 Minutes of Exercise on Valentine's Day</a></h3><p>Saturday February 13, 2021 10:15 pm PST by <a href=\"https://www.macrumors.com/author/frank-mcshan/\" rel=\"author\">Frank McShan</a></p><p>Today only, Apple Watch owners can complete a new Apple Watch activity challenge in celebration of Heart Month, which is aimed at promoting cardiovascular health. The challenge, which is listed in the Fitness app on the iPhone, tasks users with earning 60 minutes on their Exercise ring. Show your heart some love. Get this award by earning 60 minutes on your Exercise ring this Valentine's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/prosser-airtags-ipad-pro-next-month/\">Leaker Jon Prosser Claims AirTags and New iPad Pro to Be Announced Next Month</a></h3><p>Friday February 12, 2021 11:56 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple is slated to release a number of new products this year, and the first round of products could be just a few weeks away. YouTuber Jon Prosser, who has a mixed track record when it comes to reporting on Apple's plans, claims that AirTags and brand new iPad Pro models are set to be announced next month, presumably via a virtual event. Prosser, who runs the tech-news show \"Front Page...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/one-last-intel-mac/\">Apple Surprisingly Sticking With Intel Chips for One Last Mac</a></h3><p>Despite having begun the transition towards using its own custom silicon across the Mac product lineup, somewhat surprising recent rumors have suggested that Apple may continue to use Intel chips for one Mac model. Last year at WWDC, Apple announced plans to transition away from Intel chips to Macs built with its own Apple Silicon, such as the M1 chip, starting in late 2020. It set out its ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/13/zuckerberg-facebook-inflict-pain-on-apple-privacy/\">Mark Zuckerberg Reportedly Told Staff Facebook Needs to 'Inflict Pain' on Apple Over Privacy Dispute</a></h3><p>Saturday February 13, 2021 2:33 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple and Facebook have been in a very public spat over the course of the last few months as Apple dials up its pro-privacy stance. The two companies have long had tension, but more recently, Facebook is taking shots at an upcoming iOS and iPadOS feature that will require apps and data companies such as Facebook to ask for users' permission before tracking them across other sites and websites. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/ipad-2021-major-upgrade/\">Major Upgrades Coming to the iPad in 2021</a></h3><p>Apple is looking to launch an updated ninth-generation iPad with a larger display, the A13 Bionic chip, 4GB of RAM, and a thinner, lighter design in the first half of this year, according to recent reports. Reports from cnBeta and Mac Otakara, citing supply chain sources in China, have offered similar projections for the ninth-generation ‌iPad, explaining that the updated device will...</p></div></div></div>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b0d990fa4f0953b551e76688d499963667d577f7ff0c9c3b688cbffdb4001b4b","category":"Apple"}