{"title":"Rapha Women’s Classic Winter Gore-Tex Jacket review","link":"https://www.cyclist.co.uk/rapha/9192/rapha-women-s-classic-winter-gore-tex-jacket-review","date":1612363049000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>I’m always interested in kit that carves out a new niche for itself. After some initial scepticism, I’ve become a firm convert to gravel bikes, 1x chainrings on road bikes and touring without panniers.</p><p>(I chuckle when I recall my first meeting with Apidura founder Tori. She explained the new-fangled concept of ‘bikepacking’, and I replied that it probably wasn’t for me, and wished her luck with the company she was setting up. The rest is history...)</p><p>But a winter jacket that isn’t waterproof…? I really wasn’t sure about this one.</p><p>Rapha’s new Classic Winter jacket is made from Gore-Tex Infinium, a three-layer technical fabric designed to make garments 'durably windproof, water resistant and highly breathable.'</p><p>Gore explains that it was designed for 'when comfort and performance take priority over waterproofness,' and give the examples of 'blue-skied mountaineering' and 'windy 10-mile cycle rides.' A far cry from the drizzly mud-fest that is your typical British winter, and the all-day outings with which I like to entertain myself.</p><p>But the jacket, when it arrived, was seductively lovely. It feels cosy and robust, it looks great, and it has all of Rapha’s abundant attention to detail. There are double-layered ‘storm cuffs’, designed to form a waterproof seal around your gloves (perhaps ironically, they work less well with Rapha’s Deep Winter gloves, which have a double-layered cuff of their own), and the stretchy fabric of the inner layer has the added bonus of being exquisitely comfy against the wrists.</p>&nbsp;<p>The same can be said for the fleece lining on the collar – it goes further than simply protecting you from zip scratches, encasing your neck in comfort whenever the jacket is fully zipped up. The two-way zip (why are all zips not two-way?) is chunky enough that it will stand up to frantic wrenching with numb or gloved hands.</p><p><a href=\"https://www.rapha.cc/gb/en/shop/womens-classic-winter-gore-tex-jacket/product/WJA01XX\"><em><strong>Buy the Rapha Women's Classic Winter Gore-Tex Jacket now</strong></em></a></p><p>The practicalities of the jacket had me slightly less convinced. The two rear pockets are shallower than usual, and only lightly elasticated. My phone protruded slightly and moved around as I rode, though to be fair it never actually fell out, and on winter rides I’m less likely to be reaching for it every few minutes, so keeping it in an inner pocket isn’t such a problem.</p><p>I’ve always ended up wearing a jersey under the jacket, so I keep my valuables in its pockets instead, and have come to see these larger outer ones more as back-up food pouches. They have small holes for drainage, though I’m not sure how necessary this is on a garment that isn’t sold as waterproof.</p>&nbsp;<p>There’s a zipped pocket in the front of the jacket – too small for most phones, but just right for keys and a bank card. Some riders might be bothered by this extra bulk between their midriff and quads; I didn’t really notice it.</p><p><a href=\"https://www.rapha.cc/gb/en/shop/womens-classic-winter-gore-tex-jacket/product/WJA01XX\"><em><strong>Buy the Rapha Women's Classic Winter Gore-Tex Jacket now</strong></em></a></p><p>I went for the orange version of the jacket (it also comes in dark navy), and was pleased with its visibility. The colour stands out on dull days, and the white stripes are reflective. The trade-off is that it’s almost impossible to keep clean. I suspect the mud spatters and grey-brown tide marks around the collar and tail are now permanent features. But it’s hard to stay immaculate in winter, and muddy roads aren’t the jacket’s fault.</p>&nbsp;<p>As for what it’s like to cycle in – it took me quite a while to figure out when the jacket was in its element, and what exactly that element might be. I excitedly put it on for some early November rides, only to have to take it off because I got too hot. And since the jacket is a little too bulky to fit into a jersey pocket without careful folding and a bit of a struggle, I quickly resolved to wear it only when I could reasonably expect to keep it on for the entire ride.</p><p>The trouble is, knowing that the jacket isn’t fully waterproof limited the number of rides I was willing to risk taking it on. It has been a pretty rainy winter here in the South West, and not knowing at what point the jacket would start to let water in meant that I only wore it on shorter rides, or when the forecast was 100% guaranteed to be dry.</p><p>As a result, I’ve found that it makes an unexpectedly good commuting jacket. It’s cosy, visible and roomy enough to wear over civilian attire – though with a pricetag of £270, possibly in the realm of overkill, unless your commute is a particularly gnarly one.</p><p>It’s also the perfect choice for those crisp, bright winter days when the roads are dry and the temperature hovers just above zero – but so far we’ve only had a couple of those this year, again making it difficult to justify the pricetag.</p><p>The downpours I have ridden through have so far failed to penetrate the jacket’s taped seams and triple-layered fabric, so it is quite possibly closer to waterproof than sceptics might fear.</p><p><a href=\"https://www.rapha.cc/gb/en/shop/womens-classic-winter-gore-tex-jacket/product/WJA01XX\"><em><strong>Buy the Rapha Women's Classic Winter Gore-Tex Jacket now</strong></em></a></p><p>So I’d say Gore-Tex Infinium's water-resistance is bang on the stated capabilities of the jacket. You could get away with it in damp conditions, and it’ll cope with the odd flurry of raindrops, but it’s not going to stand up to a sustained downpour.</p><p>Whether this will work for you probably depends on where you live, the conditions you ride in and your appetite for risk. If wardrobe and wallet are limited, you’ll probably want to pick a more versatile outer layer that can be combined and adapted to work in a wider range of conditions.</p><p>The ultimate question, I suppose, is – would I buy it? And I have to admit, the answer is mostly a no. I can’t justify spending the best part of £300 on a jacket I won’t wear on every ride and whose qualities I can effectively improve on by wearing a breathable waterproof and the right combination of base layers.</p><p>That said, if I lived somewhere where winters were colder and drier, my answer would probably be different. The design and quality of the jacket can’t be faulted. Whether you’ll find it works for you depends very much on the conditions you’ll be riding in.</p><p><a href=\"https://www.cyclist.co.uk/cyclist-reviews-policy\" target=\"_blank\"><em>All reviews are fully independent and no payments have been made by companies featured in reviews</em></a></p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"b0ee4da2dbfb46415c6fbfdb55b9333f3ea65e1bd71820e8074fd45cf685a473","category":"Cycling"}