{"title":"Pfizer vaccine doesn’t need ultra-cold storage after all, company says","link":"https://arstechnica.com/?p=1743921","date":1613771271000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Good news —</h4><h2 itemprop=\"description\">The pharma giant and partner BioNTech have asked FDA to revise the vaccine's label.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/GettyImages-1230596189-800x533.jpg\" alt=\"A picture taken on January 15, 2021 shows a pharmacist holding with gloved hands a vial of the undiluted Pfizer-BioNTech vaccine for COVID-19.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/GettyImages-1230596189.jpg\" data-height=\"3166\" data-width=\"4748\">Enlarge</a> <span>/</span> A picture taken on January 15, 2021 shows a pharmacist holding with gloved hands a vial of the undiluted Pfizer-BioNTech vaccine for COVID-19.</p></figcaption></figure><p>In a bit of good news, Pfizer and BioNTech announced today that their highly effective COVID-19 vaccine <a href=\"https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-submit-covid-19-vaccine-stability-0\">does not require ultra-cold storage conditions after all</a> and can be kept stable at standard freezer temperatures for two weeks.</p><p>The companies have submitted data to the US Food and Drug Administration demonstrating the warmer stability in a bid for regulatory approval to relax storage requirements and labeling for the vaccine.</p><p>If the FDA greenlights the change, the warmer storage conditions could dramatically ease vaccine distribution, allowing doses to be sent to non-specialized vaccine administration sites. The change would also make it much easier to distribute the vaccine to low-income countries.</p><p>“We have been continuously performing stability studies to support the production of the vaccine at commercial scale, with the goal of making the vaccine as accessible as possible for healthcare providers and people across the US and around the world,” Pfizer CEO Albert Bourla said in a statement. “If approved, this new storage option would offer pharmacies and vaccination centers greater flexibility in how they manage their vaccine supply.”</p><h2>Balmy future</h2><p>Currently, the vaccine is labeled as requiring storage between -80°C and -60°C (-112°F to ‑76°F) for up to six months. But it can also be refrigerated for up to five days at standard refrigerator temperature (2⁰C and 8⁰C (36⁰F and 46⁰F)). The ultra-cold requirement cooled enthusiasm for the vaccine when the FDA first granted it emergency authorization for use. Only specialized facilities, such as hospitals and research labs, tend to have freezers equipped to maintain such cold temperatures, raising concerns about how easily it would be to get the vaccine into people’s arms.</p><p>Prior to the vaccine’s rollout, Pfizer and BioNTech tried to ease those anxieties, emphasizing their expertise and existing cold-chain infrastructure. The two companies developed specially designed, temperature-controlled thermal shippers filled with dry ice to maintain a temperature of -70°C ± 10°C. The containers included GPS-enabled thermal sensor to track the location and temperature of each vaccine shipment as they made their way to distribution sites. Vaccine doses could be kept in the thermal containers for up to 30 days if the dry ice was refilled every five days.</p><p>If approved, the new storage conditions would allow the vaccine to be kept at a mere -25°C to -15°C (-13°F to 5°F)—a temperature range any standard freezer can handle—for up to two weeks. And the vaccine doses can then be kept at standard refrigerator temperatures of 2⁰C to 8⁰C &nbsp;for five days on top of that.</p><p>The companies report that as they continue testing the limits of the vaccine, they expect the expiration dates could be extended as well.</p></div></div>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b104b00c72222caee09f6dae7a711024aa8cc1ac822a352728e9e5a0aa3adf9f","category":"Tech"}