{"title":"The UCI will run a Gravel World Series and World Championships in 2022","link":"https://cyclingtips.com/2021/09/the-uci-will-run-a-gravel-world-series-and-gravel-world-championships-in-2022/","date":1632324571000,"content":"<div><div><p>After a few years of hinting at the possibility, the UCI will take a big step into the gravel racing scene in 2022. In a press release on Wednesday that touched on a wide variety of topics, the governing body said that next year would see the launch of “a UCI Gravel World Series consisting of events enabling athletes to qualify for the UCI Gravel World Championships.”</p><p>In other words, the UCI has announced both a pro gravel race series and a World Championships for the discipline. The events will be run in partnership with organizer Golazo.</p><p>Amid a major boom time for gravel racing – whose best known events fall outside the purview of the UCI – UCI President David Lappartient said in 2020 that the organization was looking into the possibility of a gravel world championships. While plenty of road events already feature gravel sections, the events announced this week for 2022 will mark the first UCI-sanctioned racing circuit and Worlds specifically for gravel racing.</p><p>The announcement of the Gravel World Series and Gravel Worlds was just one part of a wide-ranging press release from the UCI. In other off-road news, the UCI is set to roll out a world ranking for cross-country short track mountain bike racing, a test event for cyclocross team relay will be held at the upcoming Cyclocross Worlds in Fayetteville, Arkansas, and the UCI is apparently looking into organization both a World Cup series and a World Championships for the snow bike discipline.</p><p>In road racing news, the UCI announced that a women’s Tour de Romandie will join the WorldTour next year, and that the minimum salary requirements for female pros have been updated for the 2023, 2024, and 2025 seasons. In 2023, the minimum salary for women’s WorldTour riders will match the amount for riders on ProTeams on the men’s side, and “It will then continue to increase for UCI Women’s WorldTeams, with the objective that this minimum salary be identical for UCI Women’s WorldTeams and UCI WorldTeams as quickly as possible.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b2297deff5a03b7c8f677fa29e44b6eca9eaf86208f947f542322b67c5fdfb01","category":"Cycling"}