{"title":"Tony Martin makes an impassioned plea to roadside fans at the Tour","link":"https://cyclingtips.com/2021/06/tony-martin-makes-an-impassioned-plea-to-roadside-fans-at-the-tour/","date":1624824624000,"content":"<div><div><p>Fans have made a welcome return to the Tour de France in 2021 now that the worst of the coronavirus pandemic is behind us (we hope), and while the atmosphere at the race seems greatly improved, it’s not all been smooth sailing. A day after the <a href=\"https://cyclingtips.com/2021/06/julian-alaphilippe-wins-stage-1-of-the-tour-de-france/\">carnage of stage 1</a>, Jumbo-Visma’s Tony Martin has delivered a passionate plea to the race-going public.</p><blockquote></blockquote><p>Martin was a leading character in the first – and more controversial – <a href=\"https://cyclingtips.com/2021/06/fan-causes-a-huge-crash-on-stage-1-of-the-tour-de-france/\">pileup</a> of stage 1 when a ‘fan’ stepped into the road and caused him to hit the deck, most of the peloton coming down like skittles behind him. A second high speed crash happened inside the last 10 km, this one <a href=\"https://cyclingtips.com/2021/06/who-lost-time-on-stage-1-of-the-tour-de-france/\">changing the face of the Tour</a> for many key contenders. All in all, there were at least <a href=\"https://cyclingtips.com/2021/06/21-riders-were-injured-on-stage-1-of-the-tour-de-france/\">21 riders injured</a> during the stage and four were forced to abandon the race entirely.</p><p>There were plenty of spiky <a href=\"https://cyclingtips.com/2021/06/peloton-reacts-to-chaotic-opening-day-of-the-tour/\">reactions</a> from the Tour peloton after the stage, but Martin, who arrived at the start in Perros-Guirec heavily bandaged, left it until the end of stage 2 to offer his perspective via Instagram. His eloquently expressed request is as sensible and business-like as you’d expect from the German TT specialist.</p><p>“To all the people next to the road who think that the Tour de France is a circus, to people who risc [sic] everything for a selfie with a 50 km/h fast peloton, to people who think it’s nice to show their naked butt, to drunken people who push us sideways on the climbs, to people who think that it is a good idea to hold a sign into the road while the peloton is passing. I want to ask [these] people forcefully: please respect the riders and the Tour de France! Use your head or stay home! We don’t want you here. You risc [sic] our life and our dreams for what we work so hard!”</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b39815d25510b97c130c4978aa056c65edc720339331cbc216c06c2624d25cb4","category":"Cycling"}