{"title":"From the Top: Building jmX0.5 Trainer Coach – A.K.A Zwift","link":"https://cyclingtips.com/2021/10/from-the-top-building-jmx0-5-trainer-coach-a-k-a-zwift/","date":1634155845000,"content":"<div><div><p>Indoor training has been around for longer than I can remember, but it was in 2014 when Zwift came along that it changed this market forever. It came into the world with bold ambitions, reimagined the space and what it could become, and has grown the market to a size that nobody could have imagined.</p><p>Some of the earliest pioneers in the indoor virtual world space were the likes of Computrainer and Tacx back in the late 90’s, early 2000’s. But they never really delivered on the promise making indoor training much more enjoyable. They can’t be blamed for lack of vision or not trying – the technology wasn’t even there at the time. Social networks didn’t exist, multi player online games weren’t around, broadband speeds were slow and wireless protocols such as ANT+ and BTLE hadn’t been invented yet. </p><p>But, in 2010 when a gaming software developer in Southern California named Jon Mayfield began tinkering with his kinetic trainer and finding ways for it to communicate with a virtual world he built, he had no idea how big this would become.</p><p><em>Thank you to Malcolm Bloedel for producing this episode and Ashley de Neef for composing the music.</em></p><h2>Show notes:</h2><h2><strong>Jon Mayfield’s first post on <a href=\"https://forum.slowtwitch.com/forum/?post=3880939#p3880939\">Slowtwitch:</a></strong></h2><p>“<em>Being in SoCal I don’t get to use my trainer that much, but when I do it sucks. Over the last 2 winters I spent a little time writing a 3d program to make training less dull, and I’ve logged quite a few hours on it over the last 2 winters. I figured it’d be worth showing, since it’s kinda neat and I think this crowd would get a kick out of it.</em></p><p><em>First, the overview: Its fully ANT+ Compatible (reads heartrate, cadence, powertap), it saves out standard Garmin .FIT files for WKO+/TrainingPeaks/Whatever, if you don’t have a powermeter it’ll save out a fit file with power by estimating your watts using standard trainer speed-&gt;power equations, it runs on MAC or PC, and PC has full 5.1 surround sound support. There are AI racers of various speeds you can try to pass, there are special interval modes (you program in a whole workout, or just ride around the scenery, or both) with voice prompts telling you when to start/stop the interval, and I built a from-scratch PC/MAC joystick for the front wheel to sit on so you can steer around the world. It also has a video playback mode where it plays most non-DRM’d videos but still has the interval prompts and graph overlays, but that is a bit flaky at the moment and its PC only (no MAC video yet).</em></p><p><em>Anyway, here’s some screens of it in action (All screens taken at 1920×1080 with 4xAA)</em></p><figure><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Screen-Shot-2021-10-13-at-3.02.56-pm-1.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Screen-Shot-2021-10-13-at-3.02.52-pm-1.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Screen-Shot-2021-10-13-at-3.02.12-pm-1.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Screen-Shot-2021-10-13-at-3.03.12-pm-1.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Screen-Shot-2021-10-13-at-3.03.07-pm-1.jpg\"></figure></li></ul></figure><p><em>I should probably turn this thing into a product, but for now, it’s just used by me. There’s some more details on the webpage I made for it a while back: <a href=\"https://web.archive.org/web/20111107142744/https://jmtc.ls1howto.com/\" target=\"_blank\">http://jmtc.ls1howto.com/</a></em></p><p><em>Lemme know what you guys think, and suggestions for things you’d like to see would be interesting to hear too.</em>” –Jon Mayfield (username ‘jmX’) April 14, 2012</p><p>Be sure to check out Jon’s <a href=\"https://web.archive.org/web/20111107142744/https://jmtc.ls1howto.com/\" target=\"_blank\">original website</a>: <strong>jmX Trainer Coach 0.5: <em>aka How to make riding on a trainer suck less</em>.</strong> It’s fascinating to see all these years later.</p><h2><strong>Zwift’s statement around layoffs in 2020, hardware ambitions</strong> <strong>and e-sports</strong></h2><p>Zwift made its hardware intentions known through DC Rainmaker <a href=\"https://www.dcrainmaker.com/2019/11/positions-building-indoor.html\" target=\"_blank\">spotting job postings</a> for hardware engineers. Several reliable sources tell me the particular <a href=\"https://cyclingtips.com/2020/03/zwift-layoff-senior-staff-says-its-a-strategic-restructure/\" target=\"_blank\">lay-offs in March 2020 </a>indicated their focus on making their own hardware as well putting aside activities such as running and creating an ambitious e-sports vision. All of this was as they were closing their $450 million funding round, which they needed to show their dedication to hardware manufacturing.</p><p>Zwift says this is incorrect and that they are still committed to working with hardware partners, and are still committed to e-sports:</p><p><em>“Third party hardware remains a focus for us – both in terms of e-commerce and game integration. The changes were made to restructure the business to support the continued growth and development of the software business. We still retail third party hardware on Zwift.com, and will continue to do so. We also continue to have a Commercial Director, who manages our partner relations – both in terms of in-game activations but also in terms of integrations with the software experience. This team has actually been growing over the summer to better support third-party hardware manufacturers on the platform.</em></p><p><em>Esports was restructured and now sits across multiple departments including content programming and marketing. We want to build esports from the ground up – racing was born from the community and so esports needs to come from the community as well. This is why the Zwift Racing League was born – to provide a league structure that stems from the grass routes, all the way to esports (ZRL Premier Division) competition. We are also continuing to work with the UCI, to develop cycling esports and will be hosting the second UCI Cycling Esports World Championships in Feb 2022.”</em></p><p><strong><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/c74257e0-deda-49fc-b2ea-551819ac9483.gif\">     SUBSCRIBE TO THE ‘FROM THE TOP’ PODCAST</strong><br>Never miss an episode. Subscribe to our new ‘From the Top’ podcast on <strong><a href=\"https://podcasts.apple.com/podcast/from-the-top/id1503581934\">iTunes</a>, <a href=\"https://open.spotify.com/show/1jA29mWjW6Lb1Y9eiz6G5q\">Spotify</a>,  <a href=\"https://play.google.com/music/m/Iikwqfil36mmyxssdhqfx4rrxtm?t=From_The_Top\">Google Play</a></strong> or wherever you get your podcasts.</p></div></div>","author":"Wade Wallace","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b3ea2b11696dfda067981563736b2ec5902b915c5c921cc87cb2ecf28901e8a9","category":"Cycling"}