{"title":"100Mbps uploads and downloads should be US broadband standard, senators say","link":"https://arstechnica.com/?p=1747140","date":1614886933000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>US broadband is too slow —</h4><h2 itemprop=\"description\">Pandemic showed that \"upload speeds far greater than 3Mbps are critical.\"</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/07/getty-fiber-800x556.jpg\" alt=\"Illustration of fiber-optic cables.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/07/getty-fiber.jpg\" data-height=\"1444\" data-width=\"2076\">Enlarge</a> <span>/</span> Illustration of fiber-optic cables.</p></figcaption></figure><p>Four US senators called on the Biden administration Thursday to establish a \"21st century definition of high-speed broadband\" of 100Mbps both upstream and downstream. This would be a big upgrade over the Federal Communications Commission broadband standard of 25Mbps downstream and 3Mbps upstream, which was <a href=\"https://arstechnica.com/information-technology/2015/01/fcc-chairman-mocks-industry-claims-that-customers-dont-need-faster-internet/\">established in 2015</a> and <a href=\"https://arstechnica.com/tech-policy/2021/01/3mbps-uploads-still-fast-enough-for-us-homes-ajit-pai-says-in-final-report/\">never updated</a> by former President Trump's FCC chair, Ajit Pai.</p><p><a href=\"https://www.bennet.senate.gov/public/index.cfm/press-releases?id=2C769043-69ED-426B-B30A-57981A4BA333\">Today's letter</a> was sent to FCC Acting Chairwoman Jessica Rosenworcel and other federal officials by two Democrats, one independent who caucuses with Democrats, and one Republican. Noting that \"the pandemic&nbsp;has reinforced the importance of high-speed broadband and underscored the cost of the persistent digital divide in our country,\" they wrote:</p><blockquote><p>Going forward, we should make every effort to spend limited federal dollars on broadband networks capable of providing sufficient download and upload speeds and quality, including low latency, high reliability, and low network jitter, for modern and emerging uses, like two-way videoconferencing, telehealth, remote learning, health IoT, and smart grid applications. Our goal for new deployment should be symmetrical speeds of 100 megabits per second (Mbps), allowing for limited variation when dictated by geography, topography, or unreasonable cost.</p></blockquote><p>\"We should also insist that new networks supported with federal funds meet this higher standard, with limited exceptions for truly hard-to-reach locations,\" the senators wrote later in the letter. \"For years, we have seen billions in taxpayer dollars subsidize network deployments that are outdated as soon as they are complete, lacking in capacity and failing to replace inadequate broadband infrastructure.\"</p><p>The letter was written by Sens. Michael Bennet (D-Colo.), Angus King (I-Maine), Rob Portman (R-Ohio), and Joe Manchin (D-W.Va.). In addition to Rosenworcel, it was sent to Secretary of Commerce Gina Raimondo, Secretary of Agriculture Tom Vilsack, and Director of the National Economic Council Brian Deese.</p><p>\"Ask any senior who connects with their physician via telemedicine, any farmer hoping to unlock the benefits of precision agriculture, any student who receives livestreamed instruction, or any family where both parents telework and multiple children are remote learning, and they will tell you that many networks fail to come close to 'high-speed' in the year 2021,\" they wrote. \"For any of these functions, upload speeds far greater than 3Mbps are particularly critical. These challenges will not end with the pandemic.\"</p><h2>Rosenworcel pushed for higher speeds</h2><p>Rosenworcel already supports a standard above the FCC's current one. \"With so many of our nation's providers rolling out gigabit service, it's time for the FCC to adjust its baseline upward, too,\" she <a href=\"https://docs.fcc.gov/public/attachments/FCC-20-50A5.pdf\">said</a> in April 2020, calling for a 100Mbps download standard and an upload standard that's higher than 3Mbps. \"At present, our standard [for uploads] is 3 megabits per second,\" she said at the time. \"But this asymmetrical approach is dated. We need to recognize that with extraordinary changes in data processing and cloud storage, upload speeds should be rethought.\"</p><p>The FCC standard is important for the commission's <a href=\"https://arstechnica.com/tech-policy/2020/04/ajit-pai-uses-bad-data-to-claim-isps-are-deploying-broadband-to-everyone/\">annual broadband deployment report</a> that determines how many Americans are \"unserved\" and grades the country's progress toward universal availability. Adopting a higher speed standard would make it more likely that the FCC will find that broadband deployment is not happening fast enough and take more aggressive action to speed up deployment.</p><p>The FCC isn't as active as it could be right now because there is a 2-2 split between Democrats and Republicans. President Joe Biden can fix that by nominating a new Democratic commissioner, but he hasn't done so yet.</p><h2>100Mbps a big upgrade for uploads</h2><p>Going from 25/3Mbps to 100/100Mbps would be an especially large upgrade on the upload side. Today's offerings from cable companies would not meet the 100Mbps threshold for uploads, as even gigabit-download cable plans from Comcast and Charter come with only 35Mbps <a href=\"https://arstechnica.com/tech-policy/2021/03/comcast-hides-upload-speeds-deep-inside-its-infuriating-ordering-system/\">upload speeds</a>. The cable industry for years has been promising faster upload speeds powered by upgrades to DOCSIS, the Data Over Cable Service Interface Specification. But cable's speeds are still unbalanced, providing much greater download speeds than upload speeds.</p><p>By contrast, AT&amp;T and Verizon's fastest fiber plans come with 940Mbps download speeds and 880Mbps upload speeds.&nbsp;Even the cheaper, lower-tier plans offered by fiber-to-the-home ISPs meet the senators' proposed 100/100Mbps standard.</p><p>Cable is far more widespread than fiber in the US. The eight biggest cable companies combined have 72.8 million Internet subscribers, <a href=\"https://www.leichtmanresearch.com/about-4860000-added-broadband-from-top-providers-in-2020/\">according to Leichtman Research Group</a>. The top eight wireline phone companies have 33 million Internet subscribers, but that includes both fiber-to-the-home and DSL, and those copper-line DSL networks are <a href=\"https://arstechnica.com/tech-policy/2020/10/life-in-atts-slow-lane-millions-left-without-fiber-as-company-kills-dsl/\">severely outdated</a> and <a href=\"https://arstechnica.com/tech-policy/2021/02/att-raised-phone-prices-153-as-service-got-steadily-worse-report-finds/\">poorly maintained</a>.</p><p>A serious commitment to symmetrical 100Mbps broadband may require a lot more fiber construction across the US. The senators' letter didn't quite take a fiber-or-bust stand, but they do want federal funding in rural areas to support higher upload speeds than what you normally get with cable:</p><blockquote><p>While we recognize that in truly hard-to-reach areas, we need to be flexible in order to reach unserved Americans, we should strive to ensure that all members of a typical family can use these applications simultaneously. There is no reason federal funding to rural areas should not support the type of speeds used by households in typical well-served urban and suburban areas (e.g., according to <a href=\"https://www.speedtest.net/global-index/united-states#fixed\">speedtest.net's January 2021 analysis</a>, average service is currently 180Mbps download/65Mbps upload with 24 millisecond latency.</p></blockquote><p>The senators are also frustrated by differing standards across agencies. \"We now have multiple definitions across federal agencies for what constitutes an area as served with broadband, resulting in a patchwork without one consistent standard for broadband,\" they wrote. \"For example, the FCC defines high-speed broadband as download speeds of up to 25 megabits per second and upload speeds of up to 3 megabits per second (25/3Mbps). Alternatively, the US Department of Agriculture (USDA) defines it as just 10/1Mbps.\"</p><h2>FCC deployment data</h2><p>The FCC is already supporting networks faster than the 25/3Mbps standard. The commission's Rural Digital Opportunity Fund (RDOF) tentatively <a href=\"https://arstechnica.com/tech-policy/2020/12/spacex-gets-886-million-from-fcc-to-subsidize-starlink-in-35-states/\">awarded</a> $9.2 billion over 10 years to 180 entities to deploy broadband to 5.2 million unserved homes and businesses. The FCC said that \"99.7 percent of these locations will be receiving broadband with speeds of at least 100/20Mbps, with an overwhelming majority (over 85 percent) getting gigabit-speed broadband.\" The funding is going to a mix of cable, fiber, and fixed wireless providers, plus SpaceX's Starlink satellite network.</p><p>The <a href=\"https://www.fcc.gov/reports-research/reports/broadband-progress-reports/fourteenth-broadband-deployment-report\">most recent FCC broadband deployment report</a> said that, as of year-end 2019, 95.6 percent of Americans had access to fixed broadband with speeds of at least 25Mbps downstream and 3Mbps upstream. Deployment at higher speeds is more limited, especially in rural and tribal areas. For example, the report <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/fcc-deployment-data.png\">said</a> that 250/25Mbps speeds are available to 87.2 percent of people nationwide, 55.6 percent of people in rural areas, and 49.6 percent of tribal residents.</p><p>Those data points <a href=\"https://arstechnica.com/tech-policy/2020/02/fcc-data-fails-to-count-21-million-people-without-broadband-study-finds/\">likely undercount</a> the number of unserved Americans because the FCC lets ISPs count an entire census block as served even if it can serve just one home in the block.&nbsp;The commission plans to <a href=\"https://arstechnica.com/tech-policy/2019/08/the-fccs-horrible-broadband-mapping-system-is-finally-getting-an-upgrade/\">collect geospatial maps</a> from ISPs to make the data more accurate.</p></div></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b5f2c411525981909c4f80cdf391e4343d4366582f6275af595a0d6b35f5a8b5","category":"Tech"}