{"title":"Trek’s new Chroma Project One Icon paint jobs turn carbon into metal","link":"https://cyclingtips.com/2021/06/treks-new-chroma-project-one-icon-paint-jobs-turn-carbon-into-metal/","date":1624570431000,"content":"<div><div><p>Trek’s latest Chroma custom paint options are particularly stunning thanks to a “unique, proprietary method that showcases the master craftsmanship of the artists in Trek’s Project One paint booth.” Put in simpler terms, it’s an ultra-shiny paint finish that makes carbon fiber look like polished metal.</p><p>Trek is offering Chroma in just two hues to start — Ruby Chroma and Sapphire Chroma — which rather convincingly look like red anodized and blue anodized aluminum. At least for now, those two new paint schemes will be limited to just the Madone and Emonda road bikes with enormous white Trek logos on the down tube (and Trek-Segafredo logos on the top tube), along with select mountain bikes like the enduro-focused Slash. All are available exclusively through Trek’s premium Project One Icon custom program. </p><p>Not surprisingly, the Trek-Segafredo team riders will be showcasing these new colors at the upcoming Tour de France and La Course.</p><p>Depending on the popularity of the those two colors, presumably Trek will add more shades in the future, and hopefully additional models. The price will hopefully come down at some point, too. As it stands currently, the Chroma colors look fantastic, but you really, really have to want them given the hefty US$2,000 upcharge.</p><p>“There is a ton of complexity and time in the Chroma process, and the by-product of that is extra cost,” explained Trek road product marketing manager Anders Ahlberg. “The logo on Chroma isn’t customizable, unless you were to spring for Project One Ultimate, in which case, we can do anything.”</p><p>More information can be found at <a href=\"https://projectone.trekbikes.com/\" target=\"_blank\">projectone.trekbikes.com</a>. </p></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b61c170c10c4587a87367004b9a6cf0050412595a303a141f2256427d31a5e9d","category":"Cycling"}