{"title":"Spotlight: Granite Design Cricket Bell review","link":"https://cyclingtips.com/2021/06/spotlight-granite-design-cricket-bell-review/","date":1623373333000,"content":"<div><div><p>Regular readers of CyclingTips know that I’m a big proponent of bike bells. They’re super helpful on multi-use paths for giving slower-moving users some advance notice, and also great on singletrack when you don’t have excellent line-of-sight. I’ve long been a fan of the <a href=\"https://cyclingtips.com/2016/12/spurcycle-vs-knog-oi-review/\" target=\"_blank\">Spurcycle bell</a> for its loud and piercing tone, but my wife loves her Timber bell, which can be set to an “always on” position for constant dinging on trails.</p><p>Granite Design’s new Cricket bell, however, is a hybrid of both.</p><p>On the one hand, it has a manual hammer (with a design very similar to the Spurcycle, in fact) so you can ding it at will. But if you pull the bell dome downward into “cowbell mode”, the clapper is then free to swing around so the Cricket can constantly make noise as you’re smashing down the trail. </p><p>Granite Design uses a mix of materials for the Cricket’s construction, with dome and clapper made of a brass/zinc alloy, the hammer from spring steel with a machined aluminum hammer, and the clamp and main body made of some kind of reinforced plastic. Shims are included to fit 35 mm, 31.8 mm, or 22.2 mm handlebar diameters. Actual weight is 44 g with the 31.8 mm shim, and retail price is quite reasonable (US$21 / AU$33 / £20 / €20).</p><p>I love the idea of this thing. </p><p>As much as I’m repeatedly wowed by the Spurcycle’s unique ability to pierce through chatter and earbuds, I’m not always comfortable (especially when riding my mountain bikes) compromising my grip to find the hammer. And conversely, while the constant dinging of the Timber requires no thought or action whatsoever, I don’t want to be making noise <em>all </em>the time, either.</p><p>The Cricket is small and unobtrusive, the hammer is perfectly positioned for your thumb, and I like the attention to detail, such as how the shims are keyed in the clamp for easier installation. And as far as bells go, it looks pretty good.</p><p>But in practice, the Cricket leaves plenty of room for improvement. </p><blockquote></blockquote><p>The biggest issue is it’s just not that loud. The sound is pleasant enough, and in a fairly quiet environment or if you’re pretty close to someone, it gets the job done. But it doesn’t have anywhere near the bite of the Spurcycle to attract attention from a reasonable distance — and certainly not if that person is in the middle of a conversation or using earbuds. In cowbell mode, the clapper doesn’t seem to have enough weight to create as much of a racket when on trails as the Timber, either. </p><p>I also don’t love the plastic body and clamp, although that sort of construction is to be expected at this price point (the Cricket is well under half the price of the Spurcycle, in case you’re wondering). And if I really want to get nitpicky, because the dome of the Cricket Bell has to hang straight down, it brushes up against most handlebar bags so it no longer makes any noise.</p><p>Granite Design’s catalog of clever cycling accessories feels like it’s growing by the day, and includes some solid options like the <a href=\"https://cyclingtips.com/2020/08/granite-design-stash-rcx-multi-tool-review-hidden-in-a-carbon-steerer/\" target=\"_blank\">Stash RCX hidden multi-tool</a> and the <a href=\"https://cyclingtips.com/2021/03/granite-design-aux-bottle-cage-review/\" target=\"_blank\">Aux bottle cage</a>. Overall, I think the concept of the Cricket Bell is spot-on. However, the execution is sufficiently lacking that I’d have a hard time wholeheartedly recommending one if you actually need to be heard.</p><p><strong>Price: </strong>US$21 / AU$33 / £20 / €20</p><p><strong>Weight: </strong>44 g</p><p><strong>More information:</strong> <a href=\"https://granite-design.com/products/cricket-bell\" target=\"_blank\">www.granite-design.com</a></p><div><p><em>Follow the link to see previous products we’ve reviewed in our <a href=\"https://cyclingtips.com/tag/spotlight/%E2%80%9D\" target=\"“_blank”\">Spotlight series</a>.</em></p></div></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b678b20388498ed4473db26bea58f42a24b70381e4f95123c50de6ff45a5823c","category":"Cycling"}