{"title":"Etoile de Besseges 2021: Debrief","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/etoile-de-besseges-2021","date":1612807075000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>The first stage-race of the 2021 cycling season is in the books. Étoile de Bessèges is a five-day event, taking place shortly after Grand Prix Marseillaise, which opens the French cycling calendar.&nbsp;</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><span>Without any lengthy climbs, on paper, the race looked like it would be decided in the time-trial to </span><span>Alès</span><span>, making Filippo Ganna the clear favourite to win the GC. However, we saw numerous riders stand out from the bunch across the five days of racing.</span></p><p><span>Here’s what we learnt from the 2021 edition of Étoile de Bessèges.</span></p><p><span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\"><strong><em>Related – The women's early season 2021: The Rouleur Race Guide</em></strong></a><br></span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\"><em><strong>Related – The&nbsp;men's early season 2021: The Rouleur Race Guide&nbsp;</strong></em></a></p><h4><b>Tim Wellens remains unstoppable early in the season</b></h4><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_583567_cycle-552400_1024x1024.jpg?v=1612793343\" alt=\"Tim Wellens Marseillaise\"><i>Tim Wellens on the attack at the Grand Prix Marseillaise, 2021. (Image credit: Presse Sports / Offside)</i></span></p><p><span>Tim Wellens has gained a reputation for starting the season in red-hot form. Before the season began, speaking from the Lotto Soudal training camp in Spain, Wellens said, \"In 2020, I tried to be better later in the year, but because of Algarve I got sick, meaning I could not start Paris-Nice. I’m not sure if it worked, but this year I will do it like I did in previous years - trying to be good early on and win races if possible.\"</span></p><p><span>After failing to win Marseillaise despite numerous attacks, it seemed only a matter of time&nbsp;before Wellens made his mark on the 2021 season.</span></p><p><span>The Belgian waited until the third stage, where a super-breakaway formed on the early climbs of the day. Greg Van Avermaet, Michał Kwiatkowski, Nils Politt&nbsp;were amongst&nbsp;the group.</span></p><p><span>On the final short climb and descent into </span><span>Gagnières</span><span>, Wellens forced an attack and continued to the line after some support from Stefano Oldani. Descending is one of Wellens’ strengths - a downhill attack helped him win stage 14 of La Vuelta last season.</span></p><p><span>Wellens’ gap to the group behind only expanded until he reached the finish in Bessèges, where he had gained a 40-second lead which would be decisive in the GC.</span></p><p><span>Four days of racing. That’s all Wellens’ required to claim his first victory in 2021. It comes as no surprise, he’d already won a race at this point in 2017, 2018 and 2019.</span></p><p><span>If there’s one thing you can’t take away from Tim Wellens, he remains one of the most dominant riders in January and February. As others grow into the season, Wellens will remain in top form for Tour de la Provence this week and later in the month, <span>Omloop Het Nieuwsblad</span>.</span></p><p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/etoile-de-besseges\"><em><strong>Related – A history of Étoile de Bessèges</strong></em></a></p><h4><b>Filippo Ganna&nbsp;is so much more than a time-trialist</b></h4><p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Ganna_1024x1024.jpg?v=1612793432\" alt=\"Filippo Ganna\"><i><span>Filippo Ganna after winning the opening time-trial of the 2020 Giro d’Italia. (Image credit: Cor Vos / SWPix)</span></i></b></p><p><span>Filippo Ganna rapidly developed into one of cycling’s outstanding talents in 2020, when he won four stages of the Giro d’Italia - his home grand tour - on his race debut. The 24-year-old entered Étoile de Bessèges as the favourite to win the race due to the stage 5 time-trial. He’d won his previous five time-trials.</span></p><p><span>However, Ganna didn’t join the stage three breakaway, which essentially meant he was removed from the conversation to win overall. That didn’t deter Ganna though, not one bit.</span></p><p><span>The very next day, Ganna decided to join the early breakaway. Initially, it seemed an ambitious yet puzzling move. With the time-trial to follow the next day, why did Ganna need to spend excess energy in the breakaway&nbsp;instead of conserving his legs to be in top shape for the&nbsp;TT?</span></p><p><span>It turned out to be a decision brimming with brilliance.</span></p><p><span>With just over 10km remaining, the breakaway&nbsp;was still together with a slender 20-second lead over the fast-chasing peloton. It didn’t deter the Italian, he powered away in an attempt to solo to victory. One time-trial at Bessèges clearly wasn’t enough for ‘Top Ganna'.</span></p><p><span>As Ganna started churning out some monstrous watts, his breakaway companions could only muster the energy to look at one another, desperately hoping someone else had the strength to close the ever-growing gap. It was breathtaking to watch.</span></p><p><span>The peloton never looked to threaten Ganna, who won the stage solo to Saint-Siffret.</span></p><p><span>It almost goes without saying, but the Italian still had the legs to win the time-trial the very next day, beating Benjamin Thomas by ten seconds.&nbsp;</span></p><p><span>Quantifying exactly what Ganna can achieve in his career is very difficult. There has been talk of him developing into a Grand Tour GC rider one-day, following the path that has been paved by Tom Dumoulin. More likely in the near future, though, Ganna could be challenging for one-day classics such as Paris-Roubaix or Milan-San Remo.</span></p><p><span>His accomplishments off the time-trial bike only further prove his considerable talent.</span></p><h4><b>Meet Jake Stewart, the best rider you’ve never heard of</b></h4><p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PB2_0845_1024x1024.jpg?v=1612793758\" alt=\"Jake Stewart\"></b></p><p><i><span>Jake Stewart of Groupama-FDJ. (Image credit: Pauline Ballet / SWPix)</span></i></p><p><span>Now to a rider you may not be overly-familiar with, yet.&nbsp;</span></p><p><span>Meet Jake Stewart – a name popular only among the most hardcore pro-cycling aficionados. The Brit is just 21-years-old and made his debut with Groupama-FDJ in the latter stages of last season.</span></p><p><span>He displayed numerous impressive results in that short period, finishing second twice at the Tour du Limousin and in the top-20 at </span><span>Scheldeprijs</span><span>.</span></p><p><span>Stewart’s worst result over the five-days at Bessèges was 24th. He was able to join the decisive breakaway on stage 3, where he finished 7th. He’s proven his sprinting ability before, so he’d have perhaps been disappointed not to finish on the podium.</span></p><p><span>His most impressive result came on the final day, where he managed a top-10 in the </span><span>Alès</span><span> time-trial. The Brit had shown nothing like this type of ability on the time-trial bike before, even surprising himself.</span></p><p><span>‘F*ck, maybe I can time trial after all’, said Stewart on Twitter following the stage.</span></p><p><span>In the end, Stewart finished 4th overall, just three seconds behind Nils Politt. He also won the young-rider classification.</span></p><p><span>Stewart is surprising everyone else as much as he is himself. He is set to start </span><span>Omloop Het Nieuwsblad</span><span> and Kuurne-Brussels-Kuurne later this month, and if he continues to develop at this rate who knows what he could achieve in Belgium.</span></p><h4><span><b>Philippe Gilbert is finding form earlier than anticipated</b></span></h4><p><span><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_5539_1024x1024.jpg?v=1612794394\" alt=\"Philippe Gilbert\"></b><i>Philippe Gilbert, riding for Deceuninck Quick-Step in 2019. (Image credit: Alex Broadway / ASO / SWpix)</i></span></p><p><span>Philippe Gilbert was coy on his ambitions ahead of the 2021 season.</span></p><p><span>When speaking from the Lotto Soudal pre-season training camp, he explained how he had endured a difficult recovery from the second fractured patella of his career. ‘I can almost pedal without pain, it’s an important step. The condition is hard to say’.</span></p><p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/philippe-gilbert-the-road-to-recovery-dreaming-of-san-remo\">Related –&nbsp;Philippe Gilbert: The Road to Recovery, Dreaming of San Remo</a></strong></em></p><p><span>However, the 38-year-old has clearly come a long way in his road to full fitness.</span></p><p><span>He was able to join the breakaway on stage three, and although Wellens was the strongest of the group, Gilbert looked to be progressing well. He sprinted to fifth-place at the line and also finished in the top-15 on the challenging stage four to Saint-Siffret.</span></p><p><span>The time-trial discipline has never been Gilbert’s forte, and stage five saw him tumble out of the top-10 in the overall classification. Nonetheless, Gilbert has seemingly displaced the niggling knee issues he was suffering from just weeks ago.</span></p><p><span>The major objective for Gilbert remains Milan-San Remo in March. Should he win, he’ll become the fourth rider to find glory in all five of cycling’s monuments. And following Étoile de Bessèges, it’s clear he is on track to mount a genuine challenge.</span></p><h4><b>INEOS cannot afford to underestimate Ethan Hayter</b></h4><p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_3336_1024x1024.jpg?v=1612794610\" alt=\"Ethan Hayter\"><i><span>Ethan Hayter competing for Great Britain at the 2020 World Championships. (Image credit: Alex Whitehead / SWPix)</span></i></b></p><p><span>Most of the buzz around British youngsters as of late has been focused around Tom Pidcock’s move to the INEOS Grenadiers. However, the British outfit already possess one of cycling’s young stars in the form of Ethan Hayter.</span></p><p><span>Hayter&nbsp;showed what he could do last year at the Giro dell'Appennino, where he defeated fellow youngsters Alessandro Covi and Rob Stannard in an uphill sprint.</span></p><p><span>Hayter would be unfortunate to crash on stage one at Bessèges, but didn’t suffer any serious injuries. Like Stewart, Hayter surprised everyone on the </span><span>Alès</span><span> TT. He was one of the early starters, and set a lightning early benchmark which would hold the lead until Benjamin Thomas crossed the line.&nbsp;</span>Ganna and Thomas would be the only riders to surpass Hayter’s time, though, meaning the Brit finished in a fantastic third place.&nbsp;</p><p><span>His programme for 2021 is yet to be announced, but he could be acting as a leader for the Grenadiers sooner rather than later.</span></p><p><em><span>Cover photo: <span>Pauline Ballet / SWpix</span></span></em></p></div></div>","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"b6fd692caab6673521886b5a4d09cd0707900875b351597aee394bc8228e3af5","category":"Cycling"}