{"title":"Researchers build a swimming robot that works in the Mariana Trench","link":"https://arstechnica.com/?p=1746922","date":1614814703000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>In deep —</h4><h2 itemprop=\"description\">New muscles and electronics setup were needed for the crushing pressures.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-03-at-6.14.10-PM-800x423.png\" alt=\"Researchers build a swimming robot that works in the Mariana Trench\"><figcaption></figcaption></figure><p>Remotely operated vehicles have changed how we explore and exploit the ocean. They can operate for far longer than human-occupied vehicles, go into areas where risk would dictate people avoid, and reach depths where very few craft can take a human. But even so, a lot of the hardware gets taken up by an enclosure that's capable of protecting things like batteries and electronics from the pressures of the deep.</p><p>But that may not be entirely necessary, based on a report in today's Nature. In it, a team of Chinese researchers describe adapting hardware so that it could operate a soft-bodied robot in the deep ocean. The researchers then gave the robot a ride 10 kilometers down in the Mariana Trench and showed that it worked.</p><h2>Going soft</h2><p>Mention robots, and for many people, the first thing that comes to mind are the collections of metal and cabling that make up things like <a href=\"https://www.youtube.com/watch?v=fn3KWM1kuAw\">the dancing Atlases</a> from Boston Robotics. But over the last decade, plenty of researchers have demonstrated that all that rigid hardware isn't strictly necessary. Soft-bodied robots work, too, and can do interesting things like <a href=\"https://arstechnica.com/science/2011/11/robot-without-a-skeleton-inspired-by-squid-crawls-on-land/\">squeeze through tight spaces</a> or <a href=\"https://arstechnica.com/science/2016/07/robot-made-to-swim-using-light-activated-heart-muscle-cells/\">incorporate living cells</a> into their structure.</p><p>The lines between the biology and robotics can get blurry in other ways, too, with the shape and behavior of these robots often being <a href=\"https://arstechnica.com/science/2016/08/meet-the-octobot-a-fully-autonomous-soft-bodied-robot/\">directly inspired by biology</a>.</p><p>That seems to be what has happened with the new piece in Nature. The researchers say they've been inspired by species of snailfish that have been found in deep-ocean trenches over eight kilometers from the surface. The snailfish appear to have an unusual adaptation to the crushing pressures found there: their skulls don't close off entirely. With less rigid material to be crushed, the fish seems to be able to adapt better to the conditions in the deeps.</p><p>A soft-bodied robot would seem to enable precisely this sort of flexibility. But robots require things like power sources, actuators, control electronics, and other solid hardware. While some soft-bodied versions keep all of the rigid material externally and just send power and control signals into the robot, the researchers here were trying to create something self-contained—something closer to a remotely operated vehicle. This requires rethinking how the hardware portion of a soft-bodied robot is put together.</p><h2>Making adjustments</h2><p>Apparently, lithium batteries have no special issues with pressure. But that's not true for electronics. We've generally been putting everything needed—processors, power converters, control hardware, and so on—on a single circuit board. Testing one of these boards under pressure showed that hardware failures were common, and those failures tended to occur at the junction between components on the board.</p><p>So, the researchers split the board up as much as was possible. They put different components on separate boards, put them in different locations in the robot's body, and connected them with flexible wires. And, for components that can't be put on separate boards, the researchers designed larger boards to allow the components to have more space between them. Overall, this cut the stresses on the board by a factor of six.</p><p>The other thing that needed some revision was the actuator, which acts as the muscles of the soft robot, causing it to flap its fins. As in a number of other soft robots, these are made with a flexible polymer that expands and contracts in response to an applied current. A typical material used for this will respond to currents with a contraction of nearly 20 percent of its length. Unfortunately, placing the same material in the high pressure and low temperatures typical of the deep ocean, and that figure drops to under 3 percent, which is not sufficient to actually drive the robot's fins.</p><p>The researchers found a related material that doesn't operate as efficiently normally (its strain response is only 13 percent). But that response doesn't drop nearly so much in a cold, high-pressure environment, settling in at 7 percent. While not great, it's still sufficient to drive the robot's fins.</p><h2>Testing, testing</h2><p>Overall, the design has all of the electronics in the body of the robot, which has a tail extending behind it that's about as long as the body is. Each side has two large fins that can flex up and down; a thin, flexible membrane attached to the fin helps it provide propulsion. Overall, the robot is about 22 cm long, and is 28 cm side from fin-tip to fin-tip. The \"muscle\" of the fish is placed at the junction between the body and the fin; its contraction will cause the fin to be pulled downward relative to the body.</p><p>You can watch it in action in the video below. While it's not exactly rocketing through the water, it's clearly moving away from the point where it was released.</p><figure><p><iframe type=\"text/html\" width=\"980\" height=\"550\" src=\"https://www.youtube.com/embed/2hVjTG4aYyE?start=0&amp;wmode=transparent\" frameborder=\"0\" allowfullscreen=\"\"></iframe></p><figcaption><p>The robot glides through a lake.</p></figcaption></figure><p>That test was done about 70 meters down in a lake; most of the initial testing was done there or in a high-pressure tank at a university. But once it passed those, the robot was taken 3 km down into the South China Sea and allowed to demonstrate its swimming abilities there. Then, in the ultimate stress test, the robot rode an equipment sled to the bottom of the Mariana Trench, over 10 km from the ocean's surface. While the researchers didn't risk releasing it for free-swimming, they did demonstrate that the actuators worked as expected, and the fins flapped in a way that would have provided propulsion if it were released.</p><p>This is nowhere close to replacing some of the solid, pressure-resistant hardware we currently have roaming the oceans. For one, the robot's onboard battery doesn't even support an hour of operations. And, so far at least, the control circuitry hasn't been asked to do anything more complicated than getting it to swim in circles (which can be done simply by flapping one of the fins more often than the other). Finally, the researchers haven't put in any capabilities for controlling the depth of the robot.</p><p>Still, it works, and it's a demonstration that a soft body doesn't mean these robots have to be limited to moderate environments.</p><p>Nature, 2021. DOI: <a href=\"http://dx.doi.org/10.1038/s41586-020-03153-z\">10.1038/s41586-020-03153-z</a> (<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div></div>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b705077182a22a43864ac089524d12452fb6d2312fd1330eb6b3e35ec2ab894f","category":"Tech"}