{"title":"Volkswagen Group wants six new European battery factories by 2030","link":"https://arstechnica.com/?p=1749809","date":1615839570000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>POWER DAY —</h4><h2 itemprop=\"description\">It's moving to a single prismatic cell design in 2023 to drive down costs.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/DB2021AL00263_large-800x533.jpg\" alt=\"A man in an open-collared suit stands in front of a large power charger mockup.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/DB2021AL00263_large.jpg\" data-height=\"2175\" data-width=\"3262\">Enlarge</a> <span>/</span> Thomas Schmall, Member of the Board of Management of Volkswagen Group for Technology, and CEO of Volkswagen Group Components.</p></figcaption></figure><p>Volkswagen Group is planning six new European lithium-ion battery factories with a total yearly output of 240 GWh once they're all operational in 2030. It made the announcement on Monday at an online \"Power Day\" event, where it laid out the latest update to <a href=\"https://arstechnica.com/cars/2017/09/volkswagen-group-will-electrify-all-12-brands-by-2030-needs-gigafactories/\">its electrification plan</a>. In addition to the new factories, it will be moving to a common prismatic cell design in 2023 to drive down battery costs and is upping its investment in DC fast-charging infrastructure.</p><p>\"E-mobility has become core business for us. We are now systematically integrating additional stages in the value chain. We secure a long-term pole position in the race for the best battery and best customer experience in the age of zero emission mobility,\" said VW Group chairman Herbert Diess.</p><p>Some of battery factories will be owned by VW Group, like the one in Salzgitter, Germany, that in 2025 will start churning out a single design of prismatic cells for high-volume EVs built on VW Group's MEB platform. Others will be operated by suppliers; on Monday, Northvolt and VW Group signed a $14 billion order for battery cells for premium EVs, which Northvolt will begin producing in 2023 at its factory in Skellefteå, Sweden. Both factories will reach annual capacities of 40 GWh by 2030. (VW is also increasing its ownership stake in Northvolt, and Northvolt will sell its share of the Salzgitter factory to VW Group.)</p><h2>A common cell design</h2><p>VW's move to a single cell design for the vast majority of its battery EVs should significantly drive down costs, the company said. Up to 80 percent of its BEVs will use the common cell design by 2030, and VW wants to reduce the cost of an entry-level car's battery by 50 percent and the cost of a battery in the volume segment by 30 percent.&nbsp;Currently, VW is using LG Chem pouch cells for its <a href=\"https://arstechnica.com/cars/2021/02/two-days-with-a-volkswagen-id-4-heres-what-we-learned/\">ID.4 crossover</a>, although its factory in Chattanooga, Tennessee, will use locally made SK Innovation cells when US ID.4 production begins in 2022.</p><p>\"We will use our economies of scale to the benefit of our customers when it comes to the battery too. On average, we will drive down the cost of battery systems to significantly below €100 per kilowatt-hour. This will finally make e-mobility affordable and the dominant drive technology,\" said Thomas Schmall, VW board member for technology.</p><p>In order to charge all these new batteries, VW Group is investing $477 million (400 million euros) to build out new fast chargers in Europe. It's going to work with BP to install 8,000 150 kW chargers at BP and ARAL gas stations, mostly in the UK and Germany. In Spain, it will work with Iberdrola to build out a fast-charging network along major traffic routes and will partner with Enel in Italy to do something similar along highways but also in cities.</p><p>Here in the US, Electrify America says it is on track to have 3,500 fast chargers online by the end of 2021—as of November 2020, Electrify America had more than 2,200 DC fast chargers operational. And in China, <a href=\"https://www.electrive.com/2019/07/15/vw-founds-charging-joint-venture-in-china/\">a joint venture with a pair of local companies</a> aims to have 17,000 fast chargers up and running by 2025.</p><p>Finally, VW Group's MEB electric vehicle architecture will support vehicle-to-grid bidirectional charging in 2022, so its cars can be used to power homes or as grid storage capacity for renewable energy.</p></div></div>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b7a1d527bb836cfd98a214a66e236fe64f9a80b6f7834d3f7237a11d190289ea","category":"Tech"}