{"title":"Apple hardware chief Dan Riccio stepped down to focus on AR/VR","link":"https://arstechnica.com/?p=1740631","date":1612827599000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Executive Shuffle —</h4><h2 itemprop=\"description\">Also from the report: Apple may make its own displays for Macs, iPhones.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/Apple_dan-riccio-begins-a-new-chapter-at-apple_01252020-800x556.jpg\" alt=\"Dan Riccio\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/Apple_dan-riccio-begins-a-new-chapter-at-apple_01252020.jpg\" data-height=\"1362\" data-width=\"1960\">Enlarge</a> <span>/</span> Former Apple hardware engineering leader Dan Riccio.</p></figcaption></figure><p>A couple of weeks ago, Apple announced that longtime hardware engineering chief Dan Riccio <a href=\"https://arstechnica.com/gadgets/2021/01/apple-hardware-engineering-chief-dan-riccio-leaves-role-for-new-project/\">will step down</a> from his role to focus entirely on a \"new project\" within the company. According to <a href=\"https://www.bloomberg.com/news/articles/2021-02-08/apple-s-riccio-shifts-from-hardware-chief-to-ar-vr-headsets\">yet another report</a> at Bloomberg based on sources with knowledge of Apple's plans today, the project Riccio has focused his energies on is Apple's upcoming augmented reality, virtual reality, or mixed reality headset.</p><p>Development of an AR headset at Apple seems to have hit a snag or two under current project lead Mike Rockwell, though the report does not outline exactly which obstacles have emerged. While Rockwell will remain in charge of day-to-day work on the project, Riccio will have \"ultimate oversight\" over the company's AR/VR efforts, which are said to involve \"well over a thousand engineers.\"</p><p>Riccio had already handed top-level management of most current consumer products like the iPhone to an executive named John Ternus.&nbsp;Apple announced Ternus&nbsp;will replace Riccio as the head of hardware engineering overall. The latest news indicates that he has also handed development of new camera and display technology to Johny Srouji, the executive who spearheaded the <a href=\"site:arstechnica.com%20srouji\">design and engineering of Apple Silicon</a>.</p><p>Apple is reportedly working on doing the same thing with displays that it did with processors: developing its own high-quality components that would replace those that Apple purchases from other suppliers like LG or Samsung.</p><p>But despite these other moving parts, AR is a top priority in terms of new product development. Apple CEO Tim Cook has previously said he believes AR has the potential to be a watershed moment akin to the iPhone for Apple, and an expected rivalry with Facebook in that space has been an undercurrent of the recent feud over privacy between the two tech giants.</p><p>Last week, The Information cited several sources close to Apple to <a href=\"https://arstechnica.com/gadgets/2021/02/new-report-on-apples-vr-headset-8k-in-each-eye-potential-3000-price-tag/\">claim</a> that Apple is working on <a href=\"https://arstechnica.com/gadgets/2021/02/new-report-on-apples-vr-headset-8k-in-each-eye-potential-3000-price-tag/\">an ultra-high end, 8K VR headset</a> that could be $3,000. To date, most of Apple's publicly visible work on XR has been on AR, not VR. Cupertino has been steadily building out ARKit, a developer API that enables creation of AR experiences using the cameras and sensors on iPhones and iPads.</p><p>Apple has occasionally talked about VR as well. While Cook says he believes AR is the more transformative technology, there have been developer talks and documents about supporting VR in the company's Metal graphics API, and the company worked with Valve to add support for SteamVR headsets to Macs <a href=\"https://arstechnica.com/gadgets/2018/03/everything-a-vr-studio-had-to-do-to-port-to-the-mac/\">around the launch of the iMac Pro</a>.</p><p>It's too early to say what the first headset from Apple could be like. While The Information called it a VR headset, it also supports high-quality recording of the surrounding world and showing it to the user, so AR is likely still a part of the plan. It's possible that Apple will lean on some evolution of its SteamVR support as it builds out tools for developers to make VR experiences as well, and it's also possible that this high-priced headset is intended primarily for use by developers and professionals.</p><p>In any case, Riccio is now in charge of getting future XR projects out of the lab and into users' homes. The report on the VR headset said we might see that first model sometime in 2022.</p></div></div>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b7dc9cb596f5e851fdee3395dec8e7f3a81e661f3fecb352c232c04725d0357d","category":"Tech"}