{"title":"Samsung will soon ship Micro LED TVs, but Mini LED still leads the lineup","link":"https://arstechnica.com/?p=1746388","date":1614720738000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Nano QLED OLED LED LCD MiniLED Micro LED Jabberwocky —</h4><h2 itemprop=\"description\">Plus, a rundown of the wacky buzzwords you have to know to shop for these TVs.</h2></header><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Micro-LED_Lifestyle_01-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Micro-LED_Lifestyle_01.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Micro-LED_Lifestyle_01-980x566.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Micro-LED_Lifestyle_01.jpg 2560\" data-sub-html=\"#caption-1746514\"><figure><figcaption id=\"caption-1746514\"><span></span><p>A Samsung Micro LED TV in suitably swanky digs.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Unbox-and-Discover-PR_DL2-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Unbox-and-Discover-PR_DL2.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Unbox-and-Discover-PR_DL2-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Unbox-and-Discover-PR_DL2-1440x960.jpg 2560\" data-sub-html=\"#caption-1746515\"><figure><figcaption id=\"caption-1746515\"><span></span><p>Here's a product render of said Micro LED TV.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Neo-QLED_3-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Neo-QLED_3.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Neo-QLED_3-980x654.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Neo-QLED_3.png 2560\" data-sub-html=\"#caption-1746517\"><figure><figcaption id=\"caption-1746517\"><span></span><p>Here's a product render of the 8K flagship.</p></figcaption></figure></li></ul></div><p>It's that time of year when many TV manufacturers begin announcing prices for and shipping their annual product refreshes. We took a look at <a href=\"https://arstechnica.com/gadgets/2021/03/sonys-brighter-a90j-oled-tv-makes-its-way-to-living-rooms-this-month/\">Sony's OLED lineup</a> yesterday, and today we're turning our attention to Samsung, which just announced imminent availability (most models will start shipping this month) for its high-end <a href=\"https://fave.co/3805u7K\" target=\"_blank\" rel=\"noopener\">Micro LED and Mini LED TV lineup</a>.</p><p>We'll get to Micro LED in a minute, but let's start with the mainstream high end, which comprises the Mini LED TVs. Samsung is giving these a proprietary \"Neo QLED\" label.</p><p>The <a href=\"https://fave.co/3b9SVJa\" target=\"_blank\" rel=\"noopener\">top-end QN900A</a> is the most tricked-out 8K option, with 65-inch ($5,000), 75-inch ($7,000), and 85-inch options ($9,000). One step down while keeping the 8K banner flying is <a href=\"https://fave.co/38lssGP\" target=\"_blank\" rel=\"noopener\">the QN800A</a>, offered in the same sizes but at $3,500, $4,700, and $6,500, respectively.</p><p>Since there's hardly any 8K content out there to enjoy, most people who aren't just looking for bragging rights will want to opt for the 4K models. The flagship there is <a href=\"https://fave.co/3e1NsG0\" target=\"_blank\" rel=\"noopener\">the QN90A</a>, at 55 inches ($1,800), 65 inches ($2,600), 75 inches ($3,500), and 85 inches ($5,000).</p><p>One step down gets you <a href=\"https://fave.co/2MDx7Mm\" target=\"_blank\" rel=\"noopener\">the QN85A</a>, which comes in the same sizes as the QN90A at $1,600, $2,200, $3,000, and $4,500.</p><p>Across the new TVs offered, we're looking at the usual specs for high-end TVs in 2021 regardless of manufacturer, including&nbsp;<a href=\"https://arstechnica.com/gadgets/2017/01/10k-video-object-based-sound-and-more-whats-new-in-hdmi-2-1/\">HDMI 2.1</a> with all the features you expect to come with it, like VRR, 4K120, ALLM, and eARC. There's also <a href=\"https://arstechnica.com/gadgets/2019/08/film-tv-makers-debut-new-feature-to-end-the-soap-opera-effect-scourge/\">Filmmaker Mode</a>, and a one-stop pop-up menu for accessing HDMI 2.1 and gaming-related features like VRR. (LG introduced something similar in its 2021 TVs.)</p><p>And as usual, Samsung isn't playing ball with Dolby, so there's no support for Dolby Vision HDR (or Atmos, for that matter). Rather, you'll have to lean on either the just-as-good-in-most-cases-but-inferior-in-some-situations HDR-10 standard, as well as <a href=\"https://arstechnica.com/gadgets/2018/08/hdr10-is-coming-to-samsung-and-panasonic-tvs-but-good-luck-finding-content/\">HDR-10+</a>, which remains a little light on content.</p><p>And of course, like every other big 2021 TV, the new Mini LED sets will feature an improved AI processor that does video and audio processing to maximize the wow factor.</p><p>The other big news with the 2021 TVs is that Samsung is (sort of) walking back a widely criticized move it made to its lineup in 2020. That was when the company actually downgraded the number of dimming zones and some other features in its 4K TVs relative to their 2019 predecessors in favor of pushing the envelope in its 8K portfolio instead.</p><p>The 8K TVs still have more dimming zones, but we're not looking at a huge year-over-year drop like last time. That's because Samsung's new 4K models will also feature Mini LED tech just like the 8K TVs—which wasn't a forgone conclusion, given what happened last year.</p><h2>Explaining Micro LED and Samsung’s OLED-busting strategy</h2><p>Samsung says its less expensive TVs will launch later in the year, and it didn't provide any information that we didn't already see at the Consumer Electronics Show in January.</p><p>While much of the hype in the world of TVs is currently focused on OLED, Samsung's LCD TVs remain the bestselling TVs in many regions, and in-depth technical reviewers like <a href=\"https://www.rtings.com/tv/reviews/best/tvs-on-the-market\">Rtings</a> pretty consistently name Samsung's sets as the best non-OLED ones available in terms of picture quality, albeit not always in bang-for-buck. Samsung doesn't even make OLED TVs, though it produces OLED panels for other products.</p><p>And to potentially battle OLED in the long term, Samsung is relying on Micro LED technology, which has individually emissive pixels just like OLED does. That means Micro LED matches OLED's chief advantage, which is that pixels of maximum brightness appear right next to pixels that are completely black. But Samsung claims the burn-in risk associated with OLED is not a factor in the same way with Micro LED.</p><p>Plus, OLED TVs have been knocked for not matching the HDR peak brightness of the best traditional LED TVs. Micro LED is said to combine the best of both worlds: perfect blacks with very high peak brightness and all the granularity you'd expect in between.</p><p>Micro LED TVs have been talked up as the future TV tech for years, and they've been commercially available in very limited contexts before, but this year marks Samsung's first quasi-mainstream attempt to sell a bunch of them.</p><p>They still won't be for everyone, though. They're sure to be colossally expensive for one thing, but they'll also only come in 110- and 99-inch sizes to start. Later, we'll get 88- and 76-inch sizes, but even those are bigger than most people's living rooms can accommodate.</p><p>So for its more mainstream flagship TVs, Samsung is leaning on Mini LED, which is not the same as similarly named Micro LED. Mini LED TVs are still fundamentally the same technology as any other LCD TV the company has sold for years, but with a new approach that allows much more granular backlighting to reduce blooming around bright objects and other problems associated with LCD TVs while still delivering strong peak brightness.</p><p>Expect to see the term Mini LED popping up a lot in the very near future, while Micro LED will probably stay out of the mainstream for a while yet. Other companies, like Apple, are bullish on Mini LED and are poised to roll it out in all sorts of products like laptops and tablets in the coming months.</p><p>As if the stew of terms like \"OLED,\" \"LED,\" \"LCD,\" \"Mini LED,\" and \"Micro LED\" wasn't confusing enough, Samsung has opted to brand its Mini LED sets \"Neo QLED\" TVs, which essentially means nothing, except that Samsung wants to claim it's the only company making \"Neo QLED\" TVs.</p><p>The company called its previous high-end LED TVs \"QLED\" TVs because of an optimization dubbed quantum dot technology, which was the previous big push to make LCD TVs more competitive with OLED before Mini LED came along. \"QLED\" will remain the label for the company's midrange LCD sets.</p><p><em>Listing image by <a href=\"https://www.samsung.com/us/\" rel=\"nofollow\">Samsung</a></em></p></div></div></div>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b80dcf212d1c5d984c9dc05135d0760f1b5e5539675e39b5531f90e907e66ffe","category":"Tech"}