{"title":"Richie Porte wins the Critérium du Dauphiné","link":"https://cyclingtips.com/2021/06/padun-takes-stage-8-victory-as-porte-wins-the-criterium-du-dauphine/","date":1622985761000,"content":"<div><div><p>Richie Porte secured the overall win at the Critérium du Dauphiné on Sunday, finishing safely on the final stage as Mark Padun (Bahrain-Victorious) took back-to-back stage victories. The young Ukrainian was the most active rider in the day’s breakaway, also winning the KOM classification. About two minutes after he crossed the line solo, Jonas Vingegaard (Jumbo-Visma) beat Patrick Konrad (Bora-Hansgrohe) to second place.</p><p>The top three finishers on the stage were the only survivors from the large breakaway that escaped early in the day. With six classified climbs including the first-category Col de la Colombière and hors-category Col de Joux Plane, stage 7 winner Padun’s first goal was to gather KOM points before going on the attack early in the last climb. By the finish, he’d earned almost two minutes’ advantage and was able to enjoy his victory in the last few kilometers.</p><p>The margins separating the GC favourites were small at the beginning of stage 8, and there were several probing attacks in the last 30 km, but the Ineos Grenadiers were able to stay in control. There were a couple of hiccups on the last descent, with Porte briefly caught out behind a split and then a crash for Geraint Thomas, but both finished in the GC group to seal first and third overall. Lutsenko also rode a great stage to join them on the final podium.</p><div><div><p>Critérium du Dauphiné (2.UWT) <span>La Léchère-Les-Bains → Les Gets</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/dc/mark-padun-2021.jpeg\"></p></div></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b851a01c8967c6b2c2e71af95b436de988b987571818c9b258a7f62a1b52e597","category":"Cycling"}