{"title":"Asgreen and Van Vleuten power to Flanders victories: Daily News","link":"https://cyclingtips.com/2021/04/asgreen-and-van-vleuten-power-to-flanders-victories-daily-news/","date":1617572712000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Mathieu van der Poel and Kasper Asgreen leaving Wout van Aert behind.</h4><p></p><div><p>Hello again, CyclingTips readers,</p><p>The stars of the Classics took on the Tour of Flanders on Sunday, and when all was said and done, a first-time Monument winner had taken the men’s victory and a previous champion had gone on to nab her second Flanders title in 10 years in the women’s race.</p><p>Read on for the latest from the world of cycling.</p><p><em>Dane Cash<br>News Editor</em></p><h2>What’s news?</h2><h3>Asgreen tops Van der Poel to take first Tour of Flanders title</h3><p><strong>Kasper Asgreen</strong> <a href=\"https://cyclingtips.com/2021/04/kasper-asgreen-out-sprints-mathieu-van-der-poel-to-win-the-tour-of-flanders/\" target=\"_blank\" rel=\"noreferrer noopener\">nabbed his first ever Monument</a> on Sunday at the <strong>Tour of Flanders</strong> after besting <strong>Mathieu van der Poel</strong> in a two-rider sprint in Oudenaarde. <strong>Greg Van Avermaet</strong> nabbed the final spot on the podium.</p><p>Asgreen and Van der Poel had joined a select group off the front inside the last 30 km and then they powered away with <strong>Wout van Aert</strong> on the Kruisberg. Van der Poel then put in a big surge on the Oude Kwaremont that initially saw him briefly solo clear, but Asgreen caught back on and the pair powered into the finale together, while Van Aert was eventually caught by a group of chasers.</p><p>Van der Poel led Asgreen on the finishing straight, and then both riders launched with around 250 meters to go. Van der Poel held on for a few moments before Asgreen surged past to take a convincing victory at the line.</p><p>Behind, Van Avermaet and <strong>Jasper Stuyven</strong> jumped from the chasing group to battle for third, with Van Avermaet out-sprinting Stuyven on the finishing straight.</p><p><strong>Top 10</strong></p><p>1 ASGREEN Kasper (Deceuninck-QuickStep) 6:02:12<br>2 VAN DER POEL Mathieu (Alpecin-Fenix)<br>3 VAN AVERMAET Greg (AG2R Citroën) 0:32<br>4 STUYVEN Jasper (Trek-Segafredo) 0:33<br>5 VANMARCKE Sep (Israel Start-Up Nation) 0:47<br>6 VAN AERT Wout (Jumbo-Visma)<br>7 VERMEERSCH Gianni (Alpecin-Fenix)<br>8 TURGIS Anthony (Total Direct Energie)<br>9 SÉNÉCHAL Florian (Deceuninck-QuickStep)<br>10 VAN BAARLE Dylan (Ineos Grenadiers)</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/nwXR72XbT4I\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></p><h3>Van Vleuten takes her second career Tour of Flanders victory</h3><p><strong>Annemiek van Vleuten</strong> <a href=\"https://cyclingtips.com/2021/04/annemiek-van-vleuten-solos-to-victory-at-the-tour-of-flanders/\" target=\"_blank\" rel=\"noreferrer noopener\">soloed to her second career Tour of Flanders victory</a> on Sunday, 10 years after she took the 2011 title. <strong>Lisa Brennauer</strong> and <strong>Grace Brown</strong> rounded out the podium.</p><p>Van Vleuten spent much of an aggressive final 50 km near the front of the pack, and she was part of an elite lead group that hung on as Anna van der Breggen forced a split over the Oude Kwaremont. That select group hit the Paterberg together with around 14 km to go, where Van Vleuten powered to the front.</p><p>On the steep slopes of the final climb of the race, she put in a big turn, and gradually pulled away from her rivals.</p><p>Behind, the chasing group behind featured plenty of big names, but there was little cohesion as the kilometers ticked down with Van Vleuten continuing to power on ahead solo. The 2011 winner rode into Oudenaarde with a sizable gap and held on to secure the victory. Behind, Brennauer won the sprint for second ahead of Brown.</p><p><strong>Top 10</strong></p><p>1 VAN VLEUTEN Annemiek (Movistar) 4:01:11<br>2 BRENNAUER Lisa (Ceratizit-WNT) 0:26<br>3 BROWN Grace (BikeExchange)<br>4 LONGO BORGHINI Elisa (Trek-Segafredo)<br>5 VOLLERING Demi (SD Worx)<br>6 CAVALLI Marta (FDJ Nouvelle Aquitaine Futuroscope)<br>7 LUDWIG Cecilie Uttrup (FDJ Nouvelle Aquitaine Futuroscope) 0:28<br>8 VAN DER BREGGEN Anna (SD Worx) 0:35<br>9 BUJAK Eugenia (Alé BTC Ljubljana) 0:51<br>10 FAULKNER Kristen (Team TIBCO – SVB) 0:55</p><p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/ZMnVIQzOROg\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></p><h3>Two riders kicked out of the Tour of Flanders after early scuffle</h3><p><strong>Yevgeniy Fedorov</strong> and <strong>Otto Vergaerde</strong> were <a href=\"https://cyclingtips.com/2021/04/two-riders-kicked-out-of-the-tour-of-flanders-after-early-scuffle/\" target=\"_blank\" rel=\"noreferrer noopener\">disqualified</a> from the <strong>Tour of Flanders</strong> after an on-bike incident that occurred only some 15 km into the race.</p><p>Riding at the front of the peloton after the day’s break had gotten clear, Fedorov tapped his brakes with Vergaerde behind him. Vergaerde then pulled up alongside Fedorov&nbsp;and shouldered him. Fedorov stayed upright, and then a few moments later, he veered into Vergaerde’s direction, although no contact was made.</p><p>Within thirty minutes, both riders were ejected from the race.</p><h3>Schär disqualified from the Tour of Flanders for throwing away a bottle in a non-designated zone</h3><p>Remarkably, Fedorov and Vergaerde were not the only riders disqualified from the <strong>Tour of Flanders</strong> on Sunday. <strong>Michael Schär</strong> was <a href=\"https://cyclingtips.com/2021/04/michael-schar-dqed-from-flanders-for-littering/\" target=\"_blank\" rel=\"noreferrer noopener\">disqualified</a> after throwing away a bottle in a non-designated zone.</p><p>Schär’s disqualification came three days after new UCI rules went into effect on April 1 requiring water bottles to be disposed of in specific areas along the course, with riders in one-day races facing potential disqualification for breaking the rules. Schär was off the back after a mechanical when he tossed a bottle to a group of spectators with around 110 km to go. He spent the next few minutes working his way back to the group he had been in, but then he was disqualified from the race altogether.</p><h3>Flanders Classics has requested that Doltcini-Van Eyck director Marc Bracke not attend its events</h3><p><strong>Flanders Classics</strong>, which organizers the <strong>Tour of Flanders</strong> and several other major one-day events, has requested that <strong>Doltcini-Van Eyck</strong> director <strong>Marc Bracke</strong> <a href=\"https://cyclingtips.com/2021/04/flanders-classics-requests-that-doltcini-van-eyck-director-marc-bracke-not-attend-their-events/\" target=\"_blank\" rel=\"noreferrer noopener\">not attend its events</a>, <a href=\"https://www.cyclingnews.com/news/flanders-classics-request-doltcini-van-eyck-director-bracke-not-attend-tour-of-flanders/\" target=\"_blank\" rel=\"noreferrer noopener\">Cyclingnews</a> reports.</p><p>Bracke was found guilty of violating the UCI Code of Ethics in October and his case is currently being evaluated by the UCI Disciplinary Commission. The Commission has not yet imposed sanctions.</p><p><strong>Liesbeth De Vocht</strong> took Bracke’s place in the Doltcini-Van Eyck team car at the Tour of Flanders alongside <strong>Shana Van Glabbeke</strong>. According to Cyclingnews, a team representative said, “This does not mean that we agree with Flanders Classics’ request. We just don’t want to spoil one of the most beautiful days of the year in our sport.”</p><h3>Démare wins La Roue Tourangelle</h3><p><strong>Arnaud Démare</strong> powered to his first win of the season on Sunday at <strong>La Roue Tourangelle Centre Val de Loire</strong>.</p><p>The UCI 1.1-rated one-day in the Loire Valley region of France came down a bunch kick in Tours, where Démare out-sprinted <strong>Nacer Bouhanni</strong> and <strong>Marc Sarreau</strong> to top an all-French podium.</p><h3>Life Time announces The ‘Rad Dirt Fest</h3><p>Life Time, which organizes <strong>Unbound Gravel</strong> and the <strong>Leadville Race Series</strong>, will launch a new event in Trinidad, Colorado, in 2021: <strong>The ‘Rad Dirt Fest</strong>.</p><p>The inaugural edition of The ‘Rad will feature three gravel cycling distances and two trail-run distances and covering trails in and around Trinidad. The most demanding of the cycling races will traverse 162 miles with 10,800 feet of elevation gain, with 38-mile and 90-mile options for cyclists as well.</p><p>Registration will open on April 13 at 9 am MT.</p><h2>In case you missed it …</h2><ul><li>As Caley Fretz writes, <strong>Kasper Asgreen</strong> won the <strong>Tour of Flanders</strong> on <a href=\"https://cyclingtips.com/2021/04/the-tour-of-flanders-was-won-on-tubed-clinchers/\" target=\"_blank\" rel=\"noreferrer noopener\">tubed clinchers</a>.</li></ul><div><h5>Tags</h5></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"b8ccce298b96ef09a878fd3c6ea680a611050b364986606f1473b05c127c87dd","category":"Cycling"}