{"title":"AWS ประกาศตั้ง Adam Selipsky เป็นซีอีโอคนใหม่ ปัจจุบันเป็นซีอีโอ Tableau","link":"https://www.blognone.com/node/121859","date":1616572832000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/aws_0.png?itok=H56byXKp\"></p><div itemprop=\"description\"><p>เมื่อเดือนกุมภาพันธ์ที่ผ่านมา <a href=\"https://www.blognone.com/node/120979\">Jeff Bezos ประกาศลงจากตำแหน่งซีอีโอของ Amazon</a> และให้ Andy Jassy มารับตำแหน่งต่อ ซึ่งเดิม Andy ดำรงตำแหน่งซีอีโอของ AWS ที่เป็นบริษัทคลาวด์ของ Amazon ทำให้ตำแหน่งนี้ว่างลงและต้องหาคนมารับตำแหน่งต่อด้วย</p><p>ล่าสุด AWS ประกาศว่าจะแต่งตั้ง Adam Selipsky มาเป็นซีอีโอของ AWS ต่อจาก Andy Jassy ซึ่ง Adam ก็ไม่ใช่คนหน้าใหม่แต่อย่างใด เพราะเคยเป็น Vice President ที่ AWS ในปี 2005 ดูแลหลายงานทั้งฝ่ายขาย, การตลาด และซัพพอร์ตนานถึง 11 ปี ก่อนจะลาออกไปเป็นซีอีโอของ Tableau บริษัทซอฟต์แวร์ด้าน Data Visualization ชื่อดังที่โดน <a href=\"https://www.blognone.com/node/110252\">Salesforce ซื้อกิจการไปในปี 2019</a> ซึ่ง Adam ก็เข้าไปนั่งเป็นผู้บริหารของ Salesforce ด้วย</p><p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/181c1bd104baeb920d835296e231b3a6.jpg\"><em>Adam Selipsky (ขวามือ) | ภาพโดย Tableau</em></p><p>AWS ระบุว่าภายใต้การนำของ Adam ทำให้ Tableau ประสบความสำเร็จอย่างมาก มูลค่าบริษัทเพิ่มขึ้นถึงสี่เท่าในเวลาไม่กี่ปี และเปลี่ยนโมเดลการขายไลเซนส์ซอฟต์แวร์จากแบบซื้อขาดเป็น subscription อีกทั้งเขายังเคยทำงานในตำแหน่งผู้บริหารระดับสูงของ AWS มา 11 ปีทำให้เขาคุ้นเคยกับวัฒนธรรมและธุรกิจของ AWS เป็นอย่างดี</p><p>Adam Selipsky จะออกจาก Tableau และ Salesforce กลับมาทำงานกับ AWS ในกลางเดือนพฤษภาคมนี้ และรับถ่ายทอดงานร่วมกับ Andy Jassy โดยจะมีการเปลี่ยนแปลงตัวผู้บริหารในช่วงไตรมาสที่ 3 ปีนี้ ตรงกับช่วงที่ Andy ขึ้นรับตำแหน่งซีอีโอของ Amazon พอดี</p><p>ที่มา - <a href=\"https://www.aboutamazon.com/news/company-news/aws-announces-next-ceo\">Amazon</a></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"b8e48a53ca39f9ad2d750e02fdeed5ccd8a3759af3a5b2a42fbcb0720abd317c","category":"Thai"}