{"title":"Apple TV+ Show 'Ted Lasso' Nominated for Additional Awards","link":"https://www.macrumors.com/2021/03/08/ted-lasso-apple-tv-plus-more-awards/","date":1615247093000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/08/ted-lasso-apple-tv-plus-more-awards/\"><p>Just after winning the Critics Choice Award for <a href=\"https://www.macrumors.com/2021/03/07/ted-lasso-wins-critics-choice-award/\">best comedy series</a>, <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a> series \"Ted Lasso\" has been nominated for additional awards from the <a href=\"https://www.dga.org/News/PressReleases/2021/2100308-73rd-Annual-DGA-Awards-Television-Nominees-Announced.aspx\">Director's Guide of America (DGA)</a> and the <a href=\"https://variety.com/2021/awards/awards/producers-guild-awards-nominations-2021-borat-judas-ma-rainey-1234924858/\">Producer's Guild of America (PGA)</a>.</p><p><img alt=\"ted lasso\" width=\"1960\" height=\"1102\" src=\"https://images.macrumors.com/t/ibz9xObeEImtNoC0F4joC8jlh04=/400x0/filters:quality(90)/article-new/2020/10/tedlasso.jpg?lossy\" data-src=\"https://images.macrumors.com/t/ibz9xObeEImtNoC0F4joC8jlh04=/400x0/filters:quality(90)/article-new/2020/10/tedlasso.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/ibz9xObeEImtNoC0F4joC8jlh04=/400x0/filters:quality(90)/article-new/2020/10/tedlasso.jpg?lossy 400w,https://images.macrumors.com/t/9dB8p9BX4FNuLM8tETFaPmJ4ojc=/800x0/filters:quality(90)/article-new/2020/10/tedlasso.jpg?lossy 800w,https://images.macrumors.com/t/5odiPJd2rt7E9wXPh-J6_u2tx8s=/1600x0/filters:quality(90)/article-new/2020/10/tedlasso.jpg 1600w,https://images.macrumors.com/t/lwciRIEo_s_W3p5cMusZ8EYR9rI=/2500x0/filters:no_upscale():quality(90)/article-new/2020/10/tedlasso.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/ibz9xObeEImtNoC0F4joC8jlh04=/400x0/filters:quality(90)/article-new/2020/10/tedlasso.jpg?lossy 400w,https://images.macrumors.com/t/9dB8p9BX4FNuLM8tETFaPmJ4ojc=/800x0/filters:quality(90)/article-new/2020/10/tedlasso.jpg?lossy 800w,https://images.macrumors.com/t/5odiPJd2rt7E9wXPh-J6_u2tx8s=/1600x0/filters:quality(90)/article-new/2020/10/tedlasso.jpg 1600w,https://images.macrumors.com/t/lwciRIEo_s_W3p5cMusZ8EYR9rI=/2500x0/filters:no_upscale():quality(90)/article-new/2020/10/tedlasso.jpg 2500w\"><br>Zach Braff and MJ Delaney, who directed Ted Lasso episodes \"Biscuits\" and \"The Hope That Kills You,\" respectively, have both been nominated for Outstanding Directional Achievement in Comedy Series awards.</p><p>\"Ted Lasso\" will be competing against \"The Flight Attendant,\" and \"Curb Your Enthusiasm\" in the category.</p><p>The series has also been nominated for an award for Outstanding Producer of Episodic Television Comedy by the Producer's Guild of America, where it will be competing with \"The Flight Attendant,\" \"Curb Your Enthusiasm,\" \"Schitt's Creek,\" and \"What We Do in the Shadows.\"</p><p>\"Ted Lasso\" star Jason Sudeikis <a href=\"https://www.macrumors.com/2021/02/28/jason-sudeikis-wins-golden-globe-award/\">previously won</a> a Golden Globe Award for Best Performance by an Actor in a Television Series (Musical or Comedy category). The show <a href=\"https://www.goldenglobes.com/winners-nominees\">was nominated</a> for best musical/comedy series, but lost out to \"Schitt's Creek.\"</p><p>‌Apple TV+‌ animated movie \"Wolfwalkers\" has also been nominated for Outstanding Producer of Animated Theatrical Motion Pictures by the PGA. Earlier this week, \"Wolfwalkers\" was nominated for <a href=\"https://annieawards.org/nominations\">10 Annie Awards</a>, which are accolades awarded by the Los Angeles branch of the International Animated Film Association.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/05/apple-watch-series-7-breakthrough-health-feature/\">Apple Watch Series 7 to Gain Breakthrough New Health Feature</a></h3><p>Apple is reportedly planning to bring a new, first-of-its-kind health technology to the Apple Watch Series 7, in what could be a breakthrough for managing conditions such as diabetes more easily. According to a recent report from ETNews, the Apple Watch Series 7 will feature blood glucose monitoring via a non-invasive optical sensor. Measuring blood glucose levels, also known as blood...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/apple-confirms-imac-pro-will-be-discontinued/\">Apple Confirms iMac Pro Will Be Discontinued When Supplies Run Out, Recommends 27-Inch iMac</a></h3><p>Apple on late Friday evening added a \"while supplies last\" notice to its iMac Pro product page worldwide, and removed all upgrade options for the computer, leaving only the standard configuration available to order for now. We've since confirmed with Apple that when supplies run out, the iMac Pro will no longer be available whatsoever. Apple says the latest 27-inch iMac introduced in August...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/top-stories-iphone-13-oled-ipads-macs/\">Top Stories: iPhone 13 Leaks, OLED iPads and Macs, New AirTags Evidence</a></h3><p>iPhone rumors are heating up, with noted analyst Ming-Chi Kuo this week releasing a wide-ranging report outlining his expectations for the iPhone lineup over the next three years. This week also saw rumors about OLED displays potentially coming to iPad and Mac starting next year, increasing signs of AirTags functionality in iOS 14.5 betas, and more, so check out all of the details below! i...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/08/apple-event-march-23-kang/\">Leaker Suggests Apple Event to Be Held on March 23</a></h3><p>Monday March 8, 2021 2:25 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple will hold its first event of the year on March 23, according to information provided by a reputable Chinese leaker (via DuanRui). Apple is expected to launch AirTags, new iPads, and possibly updated AirPods at a spring event, and leaker \"Kang\" believes that date will be March 23. Initial speculation pointed to an event happening on March 16; however, Bloomberg's Mark Gurman shot down...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/08/apple-releases-ios-14-4-1/\">Apple Releases iOS and iPadOS 14.4.1 With Security Fixes</a></h3><p>Monday March 8, 2021 10:01 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today released iOS and iPadOS 14.4.1, minor security updates that comes more than a month after the release of the iOS 14.4 update. The iOS and iPadOS 14.4.1 updates can be downloaded for free and the software is available on all eligible devices over-the-air in the Settings app. To access the new software, go to Settings &gt; General &gt; Software Update. According to Apple's release...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/imac-pro-while-supplies-last/\">iMac Pro No Longer Custom Configurable, Available 'While Supplies Last'</a></h3><p>Friday March 5, 2021 10:14 pm PST by <a href=\"https://www.macrumors.com/author/eric-slivka/\" rel=\"author\">Eric Slivka</a></p><p>Apple appears to be on the verge of discontinuing the iMac Pro, with the store page for the high-end all-in-one Mac including a \"While supplies last\" tagline and only the base model with no custom configurations available for purchase. The iMac Pro launched in December 2017, and while there have been a few tweaks to the available configurations over the years, it has received no substantial...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/07/kuo-apple-mixed-reality-headset-2022/\">Kuo: Apple to Launch Mixed Reality Headset in Mid 2022 and Augmented Reality Glasses by 2025</a></h3><p>Apple plans to release its long-rumored mixed reality headset \"in mid-2022,\" followed by augmented reality glasses by 2025, well-regarded analyst Ming-Chi Kuo said today in a research note with TF International Securities, obtained by MacRumors. \"We predict that Apple's MR/AR product roadmap includes three phases: helmet type by 2022, glasses type by 2025, and contact lens type by...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/07/kuo-apple-ar-contact-lenses-2030s/\">Kuo: Apple May Release Augmented Reality Contact Lenses in 2030s</a></h3><p>In a research note shared with MacRumors, analyst Ming-Chi Kuo today predicted that Apple will release augmented reality \"contact lenses\" in the 2030s. Kuo said the lenses will bring electronics from the era of \"visible computing\" to \"invisible computing.\" Mojo Vision smart contact lens Kuo said the lenses are \"unlikely to have independent computing power and storage,\" suggesting that they...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"b8f5f8177c7ae6e6c78267d06ca39fb577f59104e19a01e0a2573c41abdc7821","category":"Apple"}