{"title":"Mathieu van der Poel wants a stage win at the Tour de France","link":"https://cyclingtips.com/2021/06/mathieu-van-der-poel-wants-a-stage-win-at-the-tour-de-france/","date":1622596957000,"content":"<div><div><p>After a two-month break from road racing, Mathieu van der Poel (Alpecin-Fenix) is about to rejoin the peloton. The 26-year-old Dutchman has some big targets ahead.</p><p>The first of those is the Tour de France, which starts on June 26. Van der Poel will go there with the hope of taking a stage win.</p><p>“I haven’t really looked at the stages yet [but] for sure I will pick some and try to get a stage win there,” the Dutchman said from an altitude training camp in La Plagne, France. “It’s the first time ever I’m doing a Grand Tour, so it would already be a success if I can win a stage.”</p><p>Van der Poel has already indicated that he might not finish the Tour, if doing so would hamper an even bigger goal: the Tokyo Olympics. There Van der Poel will represent the Netherlands in the cross country MTB event.</p><p>“It’s the biggest goal of the summer for me,” Van der Poel said of the Olympics. “It’s a goal I’ve been working toward for a couple of years now so that will hopefully be the highlight of the summer.”</p><p>The 26-year-old is coming off a short stint of MTB racing which included two XCO World Cup races. He was seventh at the first in Albstadt in Germany before taking second in Nove Mesto, Czech Republic, following a battle with <a href=\"https://cyclingtips.com/2021/05/pidcock-beats-van-der-poel-to-win-his-first-elite-mtb-world-cup/\" target=\"_blank\">a rampaging Tom Pidcock</a>.</p><p>“It was really good to be back on the mountain bike,” Van der Poel said. “The level I had was acceptable. I did some good results. Of course the preparation was a bit short. Now we are at altitude in La Plagne to prepare the second half of the season during summer. Then I’ll have a good preparation for all the goals that are coming.”</p><p>Before those goals, Van der Poel will sharpen his road racing form at the Tour de Suisse, which starts this Sunday.</p><p>“I haven’t seen the roadbook yet but it will be the same story as the Tour de France,” Van der Poel said. “I’ll see which stage suits me best and then try to get the victory there.”</p></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ba01ee859574c8b2cb528498cef5a45d6be73aa82f0f0854538f7ed96d3d1385","category":"Cycling"}