{"title":"All Rogue Amoeba Apps Now Have Official Support for the New M1 Macs and Big Sur","link":"https://weblog.rogueamoeba.com/2020/12/17/all-rogue-amoeba-apps-now-have-official-support-for-the-new-m1-macs/","date":1612402446000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"post-8078\"><p><span>Posted By Paul Kafasis <span>on</span> December 17th, 2020</span></p><p><img src=\"https://weblog.rogueamoeba.com/wp-content/uploads/20201217-m1-official/m1-banner.png\" srcset=\"https://weblog.rogueamoeba.com/wp-content/uploads/20201217-m1-official/m1-banner@2x.png 2x\" alt=\"\"></p><p>As of today, our entire product line now has support for Apple’s newest M chip-based Macs. The latest versions of our software now run natively on the new Apple Silicon-powered machines, to provide the best possible performance on this impressive new hardware. If you’ve already got an M chip-based Mac, just download the latest versions of our products and you should be all set.</p><p>We do suggest that those with critical setups take things slow in moving to a new Mac, as we’re still watching for any unexpected edge cases. Just as it’s smart to wait to update your OS, switching to brand-new hardware should be done with some amount of caution, especially when it comes to production environments.</p><h4>A Note on Getting ACE Authorized for M1 Chip-Based Macs</h4><p><img src=\"https://weblog.rogueamoeba.com/wp-content/uploads/20201217-m1-official/gear.png\" srcset=\"https://weblog.rogueamoeba.com/wp-content/uploads/20201217-m1-official/gear@2x.png 2x\" alt=\"\"></p><p>As we noted in previous posts, a bit more setup is required to install our audio handling extension “ACE”, used by <a href=\"https://rogueamoeba.com/airfoil/\">Airfoil</a>, <a href=\"https://rogueamoeba.com/audiohijack/\">Audio Hijack</a>, <a href=\"https://rogueamoeba.com/loopback/\">Loopback</a>, <a href=\"https://rogueamoeba.com/piezo/\">Piezo</a>, and <a href=\"https://rogueamoeba.com/soundsource/\">SoundSource</a>. Those apps will guide you through the necessary steps to get up and running, but if you need more assistance, we have a <a href=\"https://rogueamoeba.com/support/knowledgebase/?showArticle=ACE-BigSur#mchipinstructions\">comprehensive step-by-step guide</a> as well.</p><p>Fortunately, this process is quick, and it only needs to be done once. After you’ve authorized ACE on your Mac, future updates will be lightning-fast.</p><h3>Full Big Sur Compatibility on Intel-Based Macs</h3><p><img src=\"https://weblog.rogueamoeba.com/wp-content/uploads/20201217-m1-official/bigsur-check.png\" srcset=\"https://weblog.rogueamoeba.com/wp-content/uploads/20201217-m1-official/bigsur-check@2x.png 2x\" alt=\"\"></p><p>In addition to providing initial support for M chip-based Macs, our latest updates also have full support for Intel-based Macs running MacOS 11 (Big Sur). We first unveiled Big Sur-compatible updates in early November, prior to Apple’s official release, to ensure that early adopters could continue to make use of our tools. However, we always want to perform extensive testing and vetting before we recommend a new OS for widespread usage.</p><p>Having now had the time to do that, we’re confident in recommending our apps for all users running Big Sur, including those in production environments. If you’re ready to update your Mac to Big Sur, our software is ready for you.</p><h3>A Strenuous Season of Releases</h3><p><img src=\"https://weblog.rogueamoeba.com/wp-content/uploads/20201217-m1-official/updates.png\" srcset=\"https://weblog.rogueamoeba.com/wp-content/uploads/20201217-m1-official/updates@2x.png 2x\" alt=\"\"></p><p>Since fall began less than three months ago, we’ve released an astonishing <em>49 updates</em> across our product line. That’s actually more new versions than we shipped in the entire year of 2019. These updates added features, squashed bugs, and most importantly, brought support for both Apple’s new operating system and their new Mac hardware. Worth noting, every single one of those updates was free for current customers.</p><p>We’re now looking forward to a well-deserved break as 2020 ends, and to getting back to a more reasonable update schedule after that. Rest assured, however, we remain hard at work adding new functionality and fixing bugs. We’ll have plenty more to announce in 2021, so stay tuned.</p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ba13df499f0169706034d9779897edee8da69724d8dded68ed21a40e06bc7a52","category":"Tech"}