{"title":"Google Play Store Drops Commissions to 15 Percent for First $1M in Revenue","link":"https://techcrunch.com/2021/03/16/google-play-drops-commissions-to-15-from-30-following-apples-move-last-year/","date":1615940065000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p id=\"speakable-summary\">Google will lower its Play commissions globally for developers that sell in-app digital goods and services on its marquee store, the company said, following a <a href=\"https://techcrunch.com/2020/11/18/apple-to-reduce-app-store-fees-for-small-businesses-with-under-1-million-in-revenues/\">similar move by rival Apple</a> late last year.</p><p>The Android-maker said on Tuesday that starting July 1, it is reducing the service fee for Google Play to 15% — down from 30% — for the first $1 million of revenue developers earn using Play billing system each year. The company will levy a 30% cut on every dollar developers generate through Google Play beyond the first $1 million in a year, it said.</p><p>Citing its own estimates, Google said 99% of developers that sell goods and services with Play will see a 50% reduction in fees, and that 97% of apps globally do not sell digital goods or pay any service fee.</p><p>Google’s new approach is slightly different from Apple, which last year said it would collect 15% rather than 30% of App Store sales from companies that generate no more than $1 million in revenue through the company’s platform. That drop doesn’t apply to iOS apps if a developer’s revenue on Apple platform exceeds $1 million.</p><p>“We’ve heard from our partners making $2 million, $5 million and even $10 million a year that their services are still on a path to self-sustaining orbit,” wrote Sameer Samat, VP of Android and Google Play, in a blog post.</p><p>“This is why we are making this reduced fee on the first $1 million of total revenue earned each year available to every Play developer that uses the Play billing system, regardless of size. We believe this is a fair approach that aligns with Google’s broader mission to help all developers succeed.”</p><p>The move comes months after changes in Google billing system charges <a href=\"https://techcrunch.com/2020/09/30/indian-startups-explore-forming-an-alliance-and-alternative-app-store-to-fight-googles-monopoly/\">rattled many startups in India</a>. More than 150 startups banded together last year after Google said it will collect as high as a 30% cut on in-app purchases in a range of categories made by Android apps.</p><p>Following the backlash, Google delayed mandating the planned Play Store payments rule in India&nbsp;<a href=\"https://techcrunch.com/2020/10/04/google-policy-cut-india-paytm-mini-app-store/\">to April 2022</a> and had reached out to several firms in recent months in the country to better understand their concerns, people familiar with the matter told TechCrunch.</p><p>Vijay Shekhar Sharma, founder and chief executive of mobile payments provider Paytm, India’s <a href=\"https://techcrunch.com/2019/11/24/paytm-1-billion/\">most valuable startup</a>, dismissed Google’s move today as a “PR stunt.”</p><p>In an interview with TechCrunch, Sharma said established firms will still have to pay an exorbitant amount of fees to Google. Today’s announcement by Google, he said, further raises the question whether Google plans to address concerns raised by serious internet firms at all. (Paytm’s app doesn’t sell digital goods using Play Store billing.)</p><p>The biggest concern firms face today is the inability to use a third-party payments service for billing, he said.&nbsp;“They are basically saying that as soon as you build a business larger than $1 million — which is a very low bar — you are going to pay a 30% fee, which after taxes, becomes 44%,” said Sharma, whose Paytm app competes with Google Pay in India.</p><p>A 30% sales cut and the inability to use third-party billing systems have been points of contention between many developers and app store operators — Apple and Google — and led to a lawsuit by <a href=\"https://techcrunch.com/2020/08/13/epic-games-launches-a-campaign-and-lawsuit-against-apples-app-store/\">Fortnite-maker Epic Games against the iPhone-maker last year</a>. Epic CEO Tim Sweeney had alleged that Apple’s move to lower the App Store fee for smaller developers was orchestrated to sow division among app creators.</p><p>“While a reduction in the Google app tax may alleviate a small part of the financial burden developers have been shouldering, this does not address the root of the issue. Whether it’s 15% or 30%, for apps obtained through the Google Play Store, developers are forced to use Google’s in-app payment services. Android needs to be fully open to competition, with a genuinely level playing field among platform companies, app creators and service providers. Competition in payment processing and app distribution is the only path to a fair app marketplace,” said a representative of Epic Games in a statement.</p><p>Sharma said he was hopeful that Google will address other concerns, especially because in a country like India “we don’t have any other operating system or distribution platform. They effectively control the destiny of every app developer in the country.”</p><p>Android commands 99% of the smartphone market in India, according to research firm Counterpoint. “Earlier India was powered by Android, then we became dependent on Android, and now it is controlled by Android,” said Sharma.</p><p>Google’s Samat said,”We look forward to seeing more businesses scale to new heights on Android, and to further discussions with the Indian developer community to find new ways to support them technically and economically as they build their businesses.”</p><p>“Once developers confirm some basic information to help us understand any associated accounts they have and ensure we apply the 15% properly, this discount will automatically renew each year,” he wrote. (For Apple’s program, too, developers are required to apply.)</p><hr><p><em><a href=\"https://techcrunch.com/2021/02/26/techcrunch-early-stage-is-the-startup-bootcamp-youve-always-needed/?tpcc=ECTW2020\">Early Stage</a> is the premier “how-to” event for startup entrepreneurs and investors. You’ll hear firsthand how some of the most successful founders and VCs build their businesses, raise money and manage their portfolios. We’ll cover every aspect of company building: Fundraising, recruiting, sales, product-market fit, PR, marketing and brand building. Each session also has audience participation built in — there’s ample time included for audience questions and discussion. Use code “TCARTICLE at checkout to get <a href=\"http://techcrunch.com/events/tc-early-stage-2021-part-1?promo=tcarticle&amp;display=true\">20% off tickets right here</a>.</em></p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ba5ee9ac881ff619cb52adefd767040f3032f181e93ac6e42b214a01c24a1b7b","category":"Tech"}