{"title":"André Greipel announces his retirement","link":"https://cyclingtips.com/2021/07/andre-greipel-announces-his-retirement/","date":1626523593000,"content":"<div><div><p>André Greipel of Israel Start-Up Nation has announced he will retire at the end of 2021.</p><p>“Tomorrow’s stage will be definitely my last stage in the Tour de France, and also after 2021 I’m going to retire,” Greipel said in a video posted on his team’s twitter feed. “I’m super happy with everything I achieved together with my teammates, together with the staff. I always was happy to get all this support and of course without my teammates, the staff, and of course my family, I wouldn’t achieve everything I did.”</p><blockquote><p>‘The Gorilla’ is retiring at the end of the season. <a href=\"https://twitter.com/hashtag/TDF2021?src=hash&amp;ref_src=twsrc%5Etfw\">#TDF2021</a><a href=\"https://t.co/bgBtAIgC6a\">pic.twitter.com/bgBtAIgC6a</a></p>— CyclingTips (@cyclingtips) <a href=\"https://twitter.com/cyclingtips/status/1416354817979555845?ref_src=twsrc%5Etfw\">July 17, 2021</a></blockquote><p>The announcement came on the morning of stage 20 of the Tour de France, the day after Greipel celebrated his 39th birthday, and at the end of a career spanning almost two decades.</p><p>Greipel, fondly nicknamed ‘the Gorilla’, was part of a stellar generation of sprinters, racking up a huge 158 victories including 22 Grand Tour stages and 18 at the Tour Down Under.</p><p>“I’m not looking back in anger, I’m really looking to the future with a lot of happiness because I can do what I want, I can suffer when I want, and of course spend a lot of time with my family now.”</p><p>The German sprinter has enjoyed success with a handful of different outfits since entering the peloton in 2005, most notably Lotto Soudal from 2011 to 2018. He then spent a year with Team Arkéa Samsic before joining Israel Start-Up Nation for the 2020 season on a multi-year contract.</p><p>Though Greipel is calling time on his career as a professional cyclist, he hopes to stay in the sport.</p><p>“I wish everybody a good time in the pro peloton and of course I won’t be away from cycling. I hope somehow to stay in cycling and to everybody who supported me as well throughout my career – my family of course, my trainers, and everybody who was part of my career – I’m really thankful.”</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bab43977eed97e161e70b581883abfe7e1034f0c57f3fe3630fb324131e022f2","category":"Cycling"}