{"title":"Intel and AMD Ask for Government Incentives While Apple Supplier TSMC Expands to Meet Unprecedented Demand","link":"https://www.macrumors.com/2021/02/11/intel-amd-ask-for-incentives-while-tsmc-expands/","date":1613053093000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/11/intel-amd-ask-for-incentives-while-tsmc-expands/\"><p>A group of U.S. chip companies, including Intel, Qualcomm, Micron, and AMD, have today sent a letter to President Joe Biden to request \"funding for incentives,\" while <a href=\"https://www.macrumors.com/2020/11/18/tsmc-apple-5nm-plus-4nm-chips/\">Apple supplier</a> <a href=\"https://www.macrumors.com/guide/tsmc/\">TSMC</a> is undertaking a considerable expansion as chip demand outstrips supply (via <em><a href=\"https://www.reuters.com/article/us-usa-semiconductors/u-s-chip-industry-calls-on-biden-administration-to-fund-factories-idUSKBN2AB11H\">Reuters</a></em>).</p><p><img alt=\"tsmc semiconductor chip inspection 678x452\" width=\"678\" height=\"449\" src=\"https://images.macrumors.com/t/kuQTr3gKtZIyVjG82Hb7tE1N6cU=/400x0/filters:quality(90)/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg?lossy\" data-src=\"https://images.macrumors.com/t/kuQTr3gKtZIyVjG82Hb7tE1N6cU=/400x0/filters:quality(90)/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/kuQTr3gKtZIyVjG82Hb7tE1N6cU=/400x0/filters:quality(90)/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg?lossy 400w,https://images.macrumors.com/t/1yJv96H6YM3Ow6wNavkmWCIRh64=/800x0/filters:quality(90)/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg?lossy 800w,https://images.macrumors.com/t/Hf5Gid_6S4AkzTvEeqoVG1aEyXs=/1600x0/filters:quality(90)/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg 1600w,https://images.macrumors.com/t/sIdp81__fIU6G_upKhmkoxjEnCc=/2500x0/filters:no_upscale():quality(90)/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg 2500w\" data-sizes=\"auto\" srcset=\"https://images.macrumors.com/t/kuQTr3gKtZIyVjG82Hb7tE1N6cU=/400x0/filters:quality(90)/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg?lossy 400w,https://images.macrumors.com/t/1yJv96H6YM3Ow6wNavkmWCIRh64=/800x0/filters:quality(90)/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg?lossy 800w,https://images.macrumors.com/t/Hf5Gid_6S4AkzTvEeqoVG1aEyXs=/1600x0/filters:quality(90)/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg 1600w,https://images.macrumors.com/t/sIdp81__fIU6G_upKhmkoxjEnCc=/2500x0/filters:no_upscale():quality(90)/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg 2500w\"></p><p>The letter to the President asked for \"substantial funding for incentives for semiconductor manufacturing\" to be included in his economic recovery and infrastructure plans. The letter from the U.S. firms noted that the U.S. share of semiconductor manufacturing has dropped from 37 percent in 1990 to 12 percent today.</p><blockquote><p>This is largely because the governments of our global competitors offer significant incentives and subsidies to attract new semiconductor manufacturing facilities, while the U.S. does not.</p><p>Working with Congress, your administration now has a historic opportunity to fund these initiatives to make them a reality. We believe bold action is needed to address the challenges we face. The costs of inaction are high.</p></blockquote><p>Intel, in particular, has suffered from a myriad of problems. With major client Apple dropping Intel for <a href=\"https://www.macrumors.com/guide/apple-silicon/\">its own custom silicon</a>, and Microsoft expected to follow suit in the near future, Intel has struggled to deliver technological innovations. This is after the company has repeatedly <a href=\"https://www.macrumors.com/2020/07/23/intel-7nm-chips-delayed-6-months/\">reported delays</a> with its latest processors, while its main competitor, AMD, has proceeded to capture valuable market share. After a <a href=\"https://www.macrumors.com/2020/12/30/intel-urged-to-take-immediate-action-amid-threats/\">major investor</a> pushed Intel to shake up its entire business model, the company is <a href=\"https://www.macrumors.com/2021/01/13/intel-ceo-to-step-down-in-february/\">hoping</a> that <a href=\"https://www.macrumors.com/2021/01/15/intel-ceo-apple-m1/\">new CEO Pat Gelsinger</a> will help it to find its way.</p><p>While subsidies for chip manufacturing and semiconductor research have been authorized by Congress, the quantity of funding has yet to be decided. The association of companies hopes to receive significant funding in the form of grants or tax credits to claw back market share.</p><p>The formal request comes amid a global <a href=\"https://www.macrumors.com/2020/11/05/iphone-12-facing-power-management-chip-shortage/\">shortage of chips</a>, which have hampered the automotive industry and popular games consoles in particular. The majority of the supply of the constrained chips comes from Taiwan and Korea, which have come to dominate the industry in recent years.</p><p><a href=\"https://www.eetimes.com/tsmc-to-raise-9-billion-for-expansion-amid-shortages/\"><em>EETimes</em></a> is today reporting that unlike the U.S. firms, TSMC, Apple's main chip supplier, is raising $9 billion from bonds to expand production. The company has approved the establishment of a $186 million subsidiary in Japan to expand research on materials for three-dimensional chips, following unconfirmed reports that TSMC plans to open its first overseas chip-packaging facility in Japan. TSMC also plans to combat U.S. chip makers on home territory this year by <a href=\"https://www.macrumors.com/2020/05/15/tsmc-announces-arizona-factory-plan/\">opening a new manufacturing facility</a> in the U.S. state of Arizona.</p><p>TSMC is currently trying to meet unprecedented demand that exceeds its production capacity as global demand for secure supplies of chips skyrockets, boosting component prices by as much as 15 percent in the past two financial quarters. The chip shortage has not severely affected Apple since TSMC gives it priority over other clients such as Microsoft, Sony, Volkswagen, and Toyota because it holds much larger orders.</p><p><small>Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our <a href=\"https://forums.macrumors.com/forums/political-news.218/\">Political News</a> forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.</small></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-health-app-data-crime-investigation/\">Apple Health App Data Helps Send a Man to Prison for His Wife's Death</a></h3><p>Tuesday February 9, 2021 1:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>A man who claimed to be innocent following the death of his wife was found to be guilty after police used evidence sourced from the Apple Health app on his iPhone to convict him. As outlined by The Birmingham News (via Cult of Mac), Kat West, Jeff West's wife, was found dead in January 2018 after suffering a blow to the head. Jeff West claimed that she was drunk and fell while he was asleep...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-releases-macos-big-sur-11-2-1/\">Apple Releases macOS Big Sur 11.2.1 With Fix for MacBook Pro Charging Issue [Updated]</a></h3><p>Tuesday February 9, 2021 10:13 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today released macOS Big Sur 11.2.1, the third update to the macOS Big Sur operating system that launched in November. macOS Big Sur‌ 11.2.1 comes a little over a week after the release of macOS 11.2. The new ‌‌‌macOS Big Sur‌‌ 11.2.1‌ update can be downloaded for free on all eligible Macs using the Software Update section of System Preferences. According to Apple's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/01/imac-apple-silicon-redesign/\">iMac to Get a Whole New Look for Apple Silicon</a></h3><p>Apple's long-awaited iMac with Apple Silicon is expected to arrive this year featuring a complete redesign, according to a range of reports. According to Bloomberg's Mark Gurman, the redesigned iMac models will feature significantly slimmed down bezels around the display. The large aluminum \"chin\" segment, below the display of current iMacs, will be removed entirely for a design that...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/2016-2017-macbook-pro-battery-charging-issue/\">Apple Offering Free Battery Replacements for 2016-2017 MacBook Pros That Can't Charge Past 1%</a></h3><p>Tuesday February 9, 2021 4:45 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today released macOS Big Sur 11.2.1 to address an issue that may prevent the battery from charging in some 2016 and 2017 MacBook Pro models, and the company has since shared a new support document with more details. Apple says a \"very small number of customers\" with 2016 and 2017 models of the 13-inch and 15-inch MacBook Pro have experienced an issue with the battery not charging past...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/ios-14-5-beta-siri-default-music-service/\">Siri Setting in iOS 14.5 Beta Lets Users Select Default Music Streaming Service</a></h3><p>Monday February 8, 2021 4:09 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple last week released beta versions of upcoming iOS 14.5 and iPadOS 14.5 updates to developers and public beta testers, and among a number of new features, Apple has added the ability to set a default music streaming service when using Siri to play songs. Image via Reddit user matejamm1 First spotted by Reddit users, the first time you ask Siri to play a song in iOS 14.5, you are given the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div></div></div>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"bc5d3659527f9b011d7758ba5e745f4c29301c476a4a6cb62735204cd4e75c42","category":"Apple"}