{"title":"Facebook goes nuclear, banning all news posts in Australia","link":"https://arstechnica.com/?p=1743159","date":1613598199000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Taking their ball home —</h4><h2 itemprop=\"description\">Facebook says Australia \"fundamentally misunderstands\" its relationship to news.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1200868272-800x510.jpg\" alt=\"A man in a suit seems concerned.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1200868272.jpg\" data-height=\"3468\" data-width=\"5444\">Enlarge</a> <span>/</span> Mark Zuckerberg speaks at the Munich Security Conference in 2020.</p></figcaption></figure><p>Facebook has gone nuclear in its long-running battle with the Australian government over news content. Australia is considering legislation that would require Facebook to pay to link to Australian news stories. In response, Facebook <a href=\"https://about.fb.com/news/2021/02/changes-to-sharing-and-viewing-news-on-facebook-in-australia/\">has announced</a> a wide-ranging ban on users linking Australian news content.</p><p>The ban means that Facebook users in Australia can no longer make posts that link to news articles—either in the Australian media or internationally. Meanwhile, users outside of Australia can't post links to Australian news sources. The ban has already gone into effect, as I discovered when I tried to post a link to The Sydney Morning Herald on Facebook:</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Screen-Shot-2021-02-17-at-3.34.45-PM.png\" width=\"561\" height=\"251\"></figure><p>Facebook says that Australian news publishers will be blocked from sharing or posting content to their Facebook pages. Posts by news publishers outside of Australia won't be available to Australian users.</p><p>Under the Australian law, Facebook and Google would be required to negotiate \"in good faith\" with Australian news sites for licenses to link to their content—something they currently do for free. Nondiscrimination rules would require Google and Facebook to treat sites the same whether they have to pay a site for links or not. If negotiations broke down, the disputes would be settled by baseball-style arbitration, where each side puts an offer on the table and a neutral party decides which offer is more reasonable.</p><p>In short, Facebook and Google will be required to pay Australian news sites when they send them traffic—and the Internet titans are not allowed to stop linking to Australian news sites to avoid paying.</p><p>In a&nbsp;<a href=\"https://about.fb.com/news/2021/02/changes-to-sharing-and-viewing-news-on-facebook-in-australia/\">blog post</a>,&nbsp;Facebook argued that this proposal \"fundamentally misunderstands the relationship between our platform and publishers who use it to share news content.\" Facebook argues news sites benefit from the traffic Facebook sends them far more than Facebook benefits by linking to news sites. Facebook says that last year it sent 5.1 billion free referrals to Australian publishers—traffic the company estimates is worth AU$407 million ($315 million).</p><p>Facebook also sought to distinguish itself from Google, the other technology giant targeted by the proposed Australian law.</p><p>\"Google Search is inextricably intertwined with news and publishers do not voluntarily provide their content,\" Facebook claimed. \"On the other hand, publishers willingly choose to post news on Facebook, as it allows them to sell more subscriptions, grow their audiences, and increase advertising revenue.\"</p><p>Last month, Google <a href=\"https://arstechnica.com/tech-policy/2021/01/google-threatens-to-shut-down-australian-search-over-link-tax-proposal/\">issued its own threat</a> that it would shut down its Australian search engine before paying for news sites. But since then, the search giant seems to have softened its stance. It recently <a href=\"https://arstechnica.com/tech-policy/2021/02/report-google-will-pay-76m-over-three-years-to-link-to-french-news-sites/\">signed a deal</a> with French publishers to feature their articles in search results. And more recently, it has begun <a href=\"https://www.nytimes.com/2021/02/17/business/media/australia-google-pay-for-news.html\">signing deals</a> with Australian publishers, including a deal with News Corp., which was founded by Australian native Rupert Murdoch and owns a number of Australian newspapers.</p></div></div>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bc8e91a9e2ff4c225aec2b114e1e26998a7c31d0ff17212055fc482065fd941a","category":"Tech"}