{"title":"Self-driving startups are becoming an endangered species","link":"https://arstechnica.com/?p=1747139","date":1614895817000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Shakeout —</h4><h2 itemprop=\"description\">Commercializing self-driving technology is taking longer than many expected.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Voyage-at-The-Villages-1-800x449.jpg\" alt=\"A Voyage vehicle at the Villages in Florida.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Voyage-at-The-Villages-1.jpg\" data-height=\"1964\" data-width=\"3500\">Enlarge</a> <span>/</span> A Voyage vehicle at the Villages in Florida.</p><p>Voyage</p></figcaption></figure><p>Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2021-03-02/gm-backed-cruise-is-said-to-be-in-talks-to-buy-startup-voyage\">reports</a> that Cruise, a self-driving company jointly owned by GM and Honda, is in talks to acquire the startup Voyage. Founded four years ago, Voyage is working to <a href=\"https://arstechnica.com/cars/2018/06/how-startups-are-building-driverless-cars-without-googles-billions/\">launch a self-driving taxi service</a> at the Villages, a massive retirement community in Florida.</p><p>Bloomberg says that \"no deal is imminent,\" and I don't have any inside information. But such a deal would be consistent with an <a href=\"https://arstechnica.com/cars/2020/07/slow-progress-on-self-driving-is-putting-startups-in-a-bind/\">ongoing trend</a>: it's becoming harder and harder for self-driving startups to remain independent.</p><p>Voyage was part of a wave of self-driving startups that were founded between 2013 and 2018. Cruise itself was one of the earliest of these companies; it was co-founded in 2013 by its current CEO Kyle Vogt. Others included nuTonomy in 2013, Zoox in 2014, Drive.ai, Optimus Ride, and TuSimple in 2015, Starsky Robotics, Nuro and Udelv in 2016, Voyage, Aurora, and May Mobility in 2017, and Ike and Kodiak Robotics in 2018.</p><p>But over the last three years, these companies have suffered a high attrition rate. Cruise was <a href=\"https://arstechnica.com/cars/2016/03/gm-toyota-make-big-investmentslike-1-billion-big-in-autonomous-car-startups/\">acquired by GM</a> in 2016. This early acquisition was a sign of confidence in Cruise, and GM has since poured billions of dollars into the startup. Similarly, auto parts maker Aptiv acquired NuTonomy in 2017 and has made its CEO the leader of Motional, a joint venture with Hyundai.</p><p>Other startups didn't have such happy exits.&nbsp;<a href=\"https://www.theverge.com/2019/6/25/18758820/drive-ai-self-driving-startup-shutting-down-apple\">Apple acquired Drive.ai</a> in 2019 as the firm was on the verge of shutting down. Trucking startup Starsky <a href=\"https://medium.com/starsky-robotics-blog/the-end-of-starsky-robotics-acb8a6a8a5f5\">shut down last year</a>, and Amazon <a href=\"https://arstechnica.com/cars/2020/06/amazon-pays-1-2-billion-for-self-driving-startup-zoox/\">bought Zoox</a> for a bargain price. Ike <a href=\"https://techcrunch.com/2020/12/23/nuro-acquires-autonomous-trucking-startup-ike/\">sold to its larger startup rival Nuro</a> in late 2020.</p><p>That leaves several companies still in the field, including trucking startups Kodiak and TuSimple, delivery ventures Udelv and Nuro, and passenger firms Optimus Ride, Voyage, Aurora, and May Mobility. But they're all facing the same basic problem: getting to market is taking a lot longer than most of them expected.</p><h2>The slow transition to driverless</h2><p>In early 2019, for example, Nuro CEO Dave Ferguson told Ars that the company hoped to stop using chase cars—cars with human drivers following behind the robots—by the middle of 2019. Nuro finally <a href=\"https://medium.com/nuro/r2-on-the-road-295dedacebeb\">announced</a> it had begun testing its robots without chase cars more than a year later, in October 2020. Nuro also&nbsp;<a href=\"https://medium.com/nuro/california-dmv-grants-nuro-first-ever-av-deployment-permit-ca424ebd2\">got approval</a> to begin commercial operations in California in December. But since then the company hasn't said much about its commercialization plans.</p><p>And Nuro seems to be closer to large-scale commercialization than most of the other startups. I recently took a ride on a <a href=\"https://www.masstransitmag.com/alt-mobility/autonomous-vehicles/press-release/21210815/optimus-ride-optimus-ride-launches-electric-mobility-service-in-dc-at-brookfield-properties-the-yards-connecting-tenants-and-residents-to-capitol-hill-and-barracks-row\">new shuttle service</a> being set up by Optimus Ride at the Yards, a large commercial development on the Washington DC waterfront. This is one of several locations where Optimus ride is testing its technology. The company told me that it had just begun to roll out the service and hadn't finished mapping the full route—a process that will take a few more months. All of its vehicles have safety drivers behind the wheel, and the company declined to give a target to start driverless operation.</p><p>The story is similar for most of the other startups. All of them need to transition to fully driverless operations for their services to be profitable. Most lack a clear timeline for when that might happen. The longer it takes, the more money they need to raise from investors—and the more reluctant investors are going to get.</p><p>Five years ago, many people envisioned self-driving startups disrupting the automotive industry. But if the testing and commercialization process drags on for much longer, all of these firms could be forced into shotgun marriages with incumbent auto or technology companies. The high cost of developing and commercializing self-driving technology could cement the dominance of incumbents—either tech giants like Amazon and Google or major automakers—rather than undermining it.</p><p>Of course, it's also possible that some of these startups just started up too early. There are plenty of historical examples where early startups failed, but other startups learned from their mistakes and went on to become wildly successful. Think of Friendster and MySpace paving the way for Facebook, or Lycos and Altavista paving the way for Google.</p><p>But there are other cases where it takes the deep pockets of an incumbent to bring a complex new technology to market—think, for example, of iOS and Android's dominance of the smartphone business. Right now, a self-driving car seems more like a smartphone than a search engine or a social network.</p></div></div>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bd2c7549bdd388e8441a7b1c022f90c4af7dbd78750276cd11fc7d7bd3824f38","category":"Tech"}