{"title":"Cricut backs off plan to add subscription fee to millions of devices [Updated]","link":"https://arstechnica.com/?p=1749942","date":1615927011000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>the terms have changed —</h4><h2 itemprop=\"description\">Cricut's not the first to pull this—and won't be the last, unless regulators catch up.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/cricut-altering-the-deal-800x450.jpg\" alt=\"Star Wars characters Darth Vader and Boba Fett.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/cricut-altering-the-deal.jpg\" data-height=\"563\" data-width=\"1000\">Enlarge</a> <span>/</span> Cricut is neither the first nor last internet-connected device to alter the deal after the fact and tell you to pray it doesn't alter it further.</p></figcaption></figure><p><strong>Update, 5:24 pm EDT:</strong> After several days of public blowback, Cricut CEO Ashish Arora announced the company was walking back the retroactive need for existing customers to start subscribing to the platform.</p><p>\"We will continue to allow an unlimited number of personal image and pattern uploads for members with a Cricut account registered and activated with a cutting machine before December 31, 2021,\" Arora wrote in <a href=\"https://inspiration.cricut.com/a-letter-to-the-cricut-community-from-ashish-arora-cricut-ceo/\">an open letter to consumers</a>. \"If a machine is resold or transferred to a new user, the new user must set up their own Cricut account.\"</p><p>Arora added that the company is exploring \"affordable ways for our future users\" who register after the end of this year also to upload an unlimited number of patterns.</p><p><strong>Original story, 4:36 pm EDT:&nbsp;</strong>Yet another company that makes Internet-connected devices is drawing the wrath of customers by demanding a monthly subscription fee long after users have already sunk hundreds of dollars into its products. This time around, the company is Cricut, which just told customers they'll lose the ability to upload more than a few patterns per month unless they start paying up.</p><h2>What’s Cricut?</h2><p>Cricut makes crafting machines that make precise detail work possible for millions of users. It's like the inverse of a printer: instead of putting your design onto paper, it slices your design into paper, card stock, vinyl, fabric, or other materials. The devices and accessory kits are sold far and wide in specialty craft and fabric stores such as Michaels or Jo-Ann, as well by mainstream retailers such as Walmart, Target, and Amazon. The devices sell at base prices of $179 and up, <a href=\"https://gizmodo.com/this-printer-cuts-doodles-and-makes-craft-time-easier-1842759775\">not counting the costs</a> of required tools, accessories, and refills.</p><p>You control the machines by using a program called Design Space on your phone or computer. The principle hasn't changed since home desktop publishing software hit in the 1990s. You put a pattern in Design Space and the Cricut cuts the pattern into the material you've loaded into it. Users can access a vast library of patterns and templates through Design Space; some are free, while others cost anywhere from a few cents to several dollars each.</p><p>Owners can also design their own patterns if they feel particularly creative or ambitious, or they can purchase what they're looking for from other members of the crafting community on platforms such as <a href=\"https://www.etsy.com/search?q=cricut%20pattern\" rel=\"nofollow\">Etsy</a>. You just upload the custom design to Design Space—which is, again, software you have installed on your own computer, tablet, or phone—and you're good to go.</p><p>Until now, anyway.</p><h2>What’s happening?</h2><p>Cricut <a href=\"https://inspiration.cricut.com/new-features-and-updates-coming-to-design-space/\">dropped a major change</a> into a feature update announcement last Friday: Any Cricut device owner who does <em>not</em> subscribe to the Cricut Access cloud platform will be limited to no more than 20 uploads/imports per month to Design Space. (Designs made using elements Cricut sells through Design Space do not count against the limit.) The change applies not only to new users but also to existing owners.</p><p>The company can do this because, as it turns out, you don't actually import a JPEG pattern you've created or downloaded into the software on your PC but, instead, into the cloud. The product descriptions on Cricut devices, however, do not make the cloud connection requirement explicit. From <a href=\"https://www.michaels.com/cricut-joy-machine/D236069S.html\" rel=\"nofollow\">Michaels</a>, for example:</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/cricut_joy_description.jpg\" data-height=\"698\" data-width=\"1052\" alt=\"The cutter comes with a trial membership—but the listing says nowhere that you'll lose functionality without one.\"><img alt=\"The cutter comes with a trial membership—but the listing says nowhere that you'll lose functionality without one.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/cricut_joy_description-640x425.jpg\" width=\"640\" height=\"425\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/cricut_joy_description.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/cricut_joy_description.jpg\" data-height=\"698\" data-width=\"1052\">Enlarge</a> <span>/</span> The cutter comes with a trial membership—but the listing says nowhere that you'll lose functionality without one.</p></figcaption></figure><p>Many customers, as you would expect, <a href=\"https://hackaday.com/2021/03/15/cricut-decides-to-charge-rent-for-people-to-use-the-cutting-machines-they-already-own/\">are furious</a> that they are now being told to pony up a subscription fee of at least $7.99 per month <a href=\"https://gizmodo.com/cricut-now-wants-users-to-pay-extra-for-unlimited-use-o-1846477745\">to use a device they already own</a>, particularly as the company <a href=\"https://www.globenewswire.com/news-release/2021/03/16/2193705/0/en/Cricut-Announces-Launch-of-Initial-Public-Offering.html\">also said</a> it plans to file for an initial public offering of stock. A quick glance at <a href=\"https://www.facebook.com/OfficialCricut/\">Facebook comments</a> and <a href=\"https://twitter.com/search?q=(to%3Aofficialcricut)&amp;src=typed_query&amp;f=live\">tweets to</a> the company shows an endless litany of users expressing their fury and threatening to switch to competing products.</p><h2>This sounds depressingly familiar...</h2><p>As the 21st century has given us a bounty of Internet-connected devices, so too has it given us plentiful opportunities to see businesses change the terms on customers who have already bought a product, leaving users sitting on piles of junk they paid big money for.</p><p>Last year, for example, smart home hub Wink <a href=\"https://arstechnica.com/information-technology/2020/05/wink-smart-hub-users-get-one-weeks-notice-to-pay-up-or-lose-access/\">gave customers only one week's warning</a> they would have to start paying a subscription fee or entirely lose access to the hardware they'd already been using for several years.</p><p>At least Wink stayed in operation. More commonly, companies shutter the servers powering products from <a href=\"https://consumerist.com/2016/08/19/tcp-disconnects-smart-lightbulb-servers-leaves-buyers-in-the-dark/\">light bulbs</a> to <a href=\"https://arstechnica.com/information-technology/2020/01/smart-scale-goes-dumb-as-under-armour-pulls-the-plug-on-connected-tech/\">bathroom scales</a> or <a href=\"https://arstechnica.com/information-technology/2020/07/petnet-charges-new-30-annual-fee-for-a-service-that-still-doesnt-work/\">pet feeders</a>, transforming expensive electronics into useless bricks.</p><p>Unfortunately, the <a href=\"https://cricut.com/en_us/legal#eula\" rel=\"nofollow\">user license agreements</a> for all of Cricut's products include an all-too-common provision allowing the business (its parent company, Provo Crafts) to update the EULA to \"reflect changes in business practices\" whenever they want. The consumer recourse? Stop using the thing.</p><h2>Is this kind of thing even legal? Why?</h2><p>The answer, for now, is unsatisfying: things are only illegal when there are laws addressing them, and this space so far doesn't really have specific ones. That may change, however.</p><p>There are absolutely state and federal laws against unfair and deceptive consumer practices—what most folks think of as \"false advertising,\" although actual statutes cover territory both more broad and more specific than that. At the national level, the Federal Trade Commission enforces those regulations. At the state level, it generally falls to consumer protection divisions in the offices of states attorneys general. Consumer Reports' Justin Brookman, who formerly worked for the Federal Trade Commission, <a href=\"https://twitter.com/JustinBrookman/status/1371554195774521347\">speculated on Twitter</a> that an after-the-fact change such as the one made by Cricut may violate laws against unfair and deceptive acts and practices.</p><p>That said, connected devices are still pretty new territory in terms of regulation. When the FTC has taken up complaints against a smart device company alleging unfair or deceptive practices, the complaints usually center on issues of <a href=\"https://www.ftc.gov/news-events/press-releases/2018/09/ftc-gives-final-approval-settlement-phone-maker-blu\">consumer data privacy</a>, focusing on times in which users' personal information was <a href=\"https://www.ftc.gov/news-events/press-releases/2013/09/marketer-internet-connected-home-security-video-cameras-settles\">poorly secured</a> or <a href=\"https://www.ftc.gov/news-events/press-releases/2017/02/vizio-pay-22-million-ftc-state-new-jersey-settle-charges-it\">secretly shared</a>. Broadly speaking, as long as a company discloses what it's doing in its license agreement, privacy policy, and/or terms of service, it can legally do that thing, even if it's consumer-hostile. (There are some <a href=\"https://consumerist.com/2016/09/20/how-much-control-do-you-actually-have-over-your-private-data/\">specific and important</a> exceptions.)</p><p>The FTC is beginning to look at <a href=\"https://www.ftc.gov/news-events/events-calendar/bringing-dark-patterns-light-ftc-workshop\">dark patterns</a> on websites and apps that deceptively push consumers into making certain disadvantageous decisions. Perhaps some kind of \"dark subscription\" analysis could follow. In the meantime, that leaves consumers where consumers usually end up: seeking redress in civil court.</p><p>Three smart hub users last year filed a lawsuit against Wink, seeking class-action status. In the complaint (<a href=\"https://www.courtlistener.com/recap/gov.uscourts.ilnd.375919/gov.uscourts.ilnd.375919.13.0.pdf\">PDF</a>), they argue that Wink's addition of the monthly fee comprises a \"fraudulent bait-and-switch pricing scheme\" in violation of both federal and state laws against misleading or deceptive business practices. Wink's <a href=\"https://www.wink.com/legal/\">terms of service</a>, however, include a mandatory binding arbitration clause that <a href=\"https://www.consumerreports.org/mandatory-binding-arbitration/forced-arbitration-clause-for-concern/\">precludes customers' rights to sue</a>. Some courts in recent months <a href=\"https://arstechnica.com/tech-policy/2021/01/court-says-uber-cant-hold-users-to-terms-they-probably-didnt-read/\">have questioned the validity</a> of similar clauses by other companies, but how a judge might rule in any particular case is anyone's guess.</p></div></div></div>","author":"Kate Cox","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bd8fff8c725fd0f46f051b065bca54fea24fc81bf9f306d5bb643a62945ea8b5","category":"Tech"}