{"title":"Vos and Van Aert victorious at the Amstel Gold Race: Daily News","link":"https://cyclingtips.com/2021/04/vos-and-van-aert-victorious-at-the-amstel-gold-race-daily-news/","date":1618786098000,"content":"<div><div><p>Hello CyclingTips readers,</p><p>As we head into a new week, there’s plenty to get across in the world of bike racing. Sunday played host to the women’s and men’s Amstel Gold Race – with one team winning both races – the final stage of the Tour of Turkey, and the final stage of the Volta a la Comunitat Valenciana.</p><p>Read on for these stories and more as we dive deeper into Ardennes Week.</p><p><em>Matt de Neef<br>Managing Editor</em></p><h2>What’s news?</h2><h3>Marianne Vos wins Amstel Gold Race for the first time</h3><p>There aren’t many top races that Marianne Vos (Jumbo-Visma) hasn’t won, and as of Sunday evening that list is now even shorter.</p><p>Vos sprinted to her first Amstel Gold Race victory from a small group of favourites after a late move from Kasia Niewiadoma (Canyon-SRAM) and Elisa Longo Borghini (Trek-Segafredo) faltered. Vos sat up early to celebrate and was very nearly beaten on the line by fellow Dutchwoman Demi Vollering (SD Worx). European champion Annemiek van Vleuten (Movistar) was third to complete a Dutch 1-2-3 in the country’s biggest one-day race.</p><p>“I expected a hard race, but it was even harder than I expected,” Vos said after the finish. “On the final lap, Grace Brown had a good opportunity, then the two were in front on the final time up the Cauberg, but when there was a final sprint, you have that little bit of energy left for the last few hundred metres. Demi came really close in the end, but I still had a little advantage.”</p><p><strong>Top 10</strong></p><p>1 VOS Marianne (Team Jumbo-Visma) 3:00:20<br>2 VOLLERING Demi (SD Worx) st<br>3 VAN VLEUTEN Annemiek (Movistar) st<br>4 SPRATT Amanda (Team BikeExchange) st<br>5 PALADIN Soraya (Liv Racing) st<br>6 GARCIA Mavi (Alé BTC Ljubljana) st<br>7 LUDWIG Cecilie Uttrup (FDJ Nouvelle Aquitaine Futuroscope) st<br>8 LONGO BORGHINI Elisa (Trek-Segafredo) st<br>9 MOOLMAN PASIO Ashleigh (SD Worx) st<br>10 NIEWIADOMA Kasia (Canyon-SRAM) st</p><p><em>Follow the link to <a href=\"https://cyclingtips.com/2021/04/marianne-vos-sprints-to-victory-at-the-amstel-gold-race/?mc_cid=d301148093&amp;mc_eid=UNIQID\" target=\"_blank\">read more at CyclingTips</a>.</em></p><h3>Wout van Aert takes narrow sprint win at Amstel Gold Race</h3><p>A few hours later, in the men’s Amstel Gold Race, Wout van Aert (Jumbo-Visma) narrowly out-lunged Thomas Pidcock (Ineos Grenadiers) to claim victory. The two were part of a three-rider move with Maximillian Schachmann (Bora-Hansgrohe) that got away on the final lap of the race.</p><p>It took several minutes for a photo finish to show that Van Aert had won by mere millimetres. Michael Matthews (BikeExchange) won the sprint for fourth in the chase group, almost catching Schachmann on the line.</p><p>“They say I won, but actually I don’t believe it,” Van Aert said. “It was apparently quite close but a few minutes ago the jury came to tell me that I won. Normally a long sprint is in my favour, I thought. I had maybe the worst position to start the sprint <em>[from the front – ed]</em>; I thought it was better to launch early and apparently it was just enough.”</p><figure><p></p></figure><p><strong>Top 10</strong></p><p>1 VAN AERT Wout (Jumbo-Visma) 5:03:27<br>2 PIDCOCK Thomas (Ineos Grenadiers) st<br>3 SCHACHMANN Maximillian (Bora-Hansgrohe) +0:02<br>4 MATTHEWS Michael (Team BikeExchange) st<br>5 VALVERDE Alejandro (Movistar) st<br>6 ALAPHILIPPE Julian (Deceuninck-Quick Step) st<br>7 SBARAGLI Kristian (Alpecin-Fenix) st<br>8 MOHORIC Matej (Bahrain-Victorious) st<br>9 KWIATKOWSKI Michal (Ineos Grenadiers) st<br>10 VAN DER SANDE Tosh (Lotto Soudal) st</p><p><em>Follow the link to <a href=\"https://cyclingtips.com/2021/04/wout-van-aert-narrowly-wins-amstel-gold-race/?mc_cid=d301148093&amp;mc_eid=UNIQID\" target=\"_blank\">read more at CyclingTips</a>.</em></p><h3>Mark Cavendish wins fourth Tour of Turkey sprint, Diaz claims overall</h3><p>Mark Cavendish (Deceuninck-QuickStep) concluded the Tour of Turkey in perfect fashion on Sunday, claiming his fourth sprint victory of the eight-stage race.</p><p>In a nervous, technical finale Cavendish came off the wheel of race-long rival Jasper Philipsen (Alpecin-Fenix) and narrowly beat him on the line. It was Philipsen’s fourth runner-up finish for the week, adding to his two stage wins. Kristoffer Halvorsen (Uno-X) completed the podium.</p><figure><p></p></figure><p>Meanwhile in the GC battle Spaniard Jose Manuel Diaz (Delko) was able to hang on to his one-second lead over Australia’s Jay Vine (Alpecin-Fenix) in the final stage, despite Vine’s efforts to take bonus seconds on the final stage. Vine also crashed in the closing kilometres of the stage, which ultimately didn’t affect his GC result, given the incident occurred inside the final 3 km.</p><p>For 26-year-old Diaz, the win is his first stage-race victory since joining the pro ranks in 2017.</p><p><strong>Final GC</strong></p><p>1 DÍAZ José Manuel (Delko) 29:19:40<br>2 VINE Jay (Alpecin-Fenix) +0:01<br>3 SEPÚLVEDA Eduardo (Androni Giocattoli – Sidermec) +0:06<br>4 GARCÍA Jhojan (Caja Rural – Seguros RGA) +0:25<br>5 KUDUS Merhawi (Astana – Premier Tech) +0:28<br>6 CHARMIG Anthon (Uno-X Pro Cycling Team) +0:30<br>7 FERNÁNDEZ Delio    (Delko) +0:33<br>8 NYCH Artem (Gazprom – RusVelo) +0:52<br>9 JOHANNESSEN Anders Halland (Uno-X Pro Cycling Team) +0:55<br>10 BRAVO Garikoitz (Euskaltel – Euskadi) +1:01</p><h3>Stefan Küng wins the Volta a la Comunitat Valenciana</h3><p>Swiss time-trial specialist Stefan Küng (Groupama-FDJ) has turned a stage victory at the Volta a la Comunitat Valenciana into overall victory in the five-stage Spanish race.</p><p>Küng won the stage 4 individual time trial to take the GC lead from local rider Enric Mas (Movistar), before holding on to his six-second advantage through the final stage. That final stage was won in a bunch sprint by Küng’s Groupama-FDJ teammate Arnaud Demare, who bested Jon Aberasturi (Caja Rural-Seguros) and Timothy Dupont (Bingoal Pauwels Sauces WB) in the dash into Valencia.</p><p>For 27-year-old Küng, it’s the first time in his seven-year pro career that he’s won a stage race.</p><figure><p></p></figure><p><strong>GC top 10</strong></p><p>1 KÜNG Stefan (Groupama – FDJ) 14:49:50<br>2 OLIVEIRA Nelson (Movistar) +0:06<br>3 MAS Enric (Movistar) +0:36<br>4 LAFAY Victor (Cofidis, Solutions Crédits) +0:45<br>5 GESBERT Élie (Arkéa Samsic) +1:01<br>6 MATÉ Luis Ángel (Euskaltel – Euskadi) +1:37<br>7 MERTZ Rémy (Bingoal Pauwels Sauces) +1:53<br>8 ROCHAS Rémy (Cofidis, Solutions Crédits) +2:03<br>9 SCOTSON Miles (Groupama – FDJ) +2:26<br>10 LOUVEL Matis (Arkéa Samsic) +2:43</p><h3>Philippe Gilbert to retire at the end of 2022</h3><p>Former world champion Philippe Gilbert (Lotto-Soudal) has revealed that he plans to retire at the end of the 2022 season, when his contract with Lotto-Soudal expires.</p><p>“At some point, you have to stop,” Gilbert said from the sidelines of Sunday’s Amstel Gold Race, according to <a href=\"https://www.dhnet.be/sports/cyclisme/philippe-gilbert-annonce-sa-prochaine-fin-de-carriere-en-direct-il-n-y-a-pas-que-le-cyclisme-dans-la-vie-607c439e7b50a654b5152cf3?mc_cid=d301148093&amp;mc_eid=UNIQID\" target=\"_blank\">Belgian news outlet DH</a>. “That will make my career 20 years long. You have to say to yourself that there is not only cycling in life; there is also family. I have sacrificed a lot in my life and it is time to enjoy it.”</p><p>Gilbert is currently taking a “physical and mental break” from racing, but is expected to return at Wednesday’s Fleche Wallonne. He will be 40 years old by the time he retires at the end of next season.</p><h2>In case you missed it …</h2><ul><li>James Huang reviewed <a href=\"https://cyclingtips.com/2021/04/sram-rival-axs-review/\" target=\"_blank\">SRAM’s new Rival AXS groupset</a>.</li><li>José Been <a href=\"https://cyclingtips.com/2021/04/simon-carr-is-flying-under-the-radar-for-now/\" target=\"_blank\">caught up</a> with Simon Carr, who may not be flying under the radar for long.</li><li>Everesting world-record-holder (and CT staffer) Ronan Mc Laughlin went deep on the science of Everesting in <a href=\"https://cyclingtips.com/2021/04/nerd-alert-podcast-the-science-of-everesting/\" target=\"_blank\">the latest Nerd Alert podcast</a>.</li></ul></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bda6486d79cf174daf700bcc7c16ebf57110dce1cc14975a8d6778051697fb44","category":"Cycling"}