{"title":"Android 12 leak appears to show major redesign with color-changing UI","link":"https://arstechnica.com/?p=1740758","date":1612898052000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Maybe the \"S\" in \"Androids S\" is for \"Sepia?\" —</h4><h2 itemprop=\"description\">It looks like the entire UI picks colors from your wallpaper.</h2></header><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/31-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/31.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/31-980x1069.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/31.jpg 2560\" data-sub-html=\"#caption-1740862\"><figure><figcaption id=\"caption-1740862\"><span></span><p>Check out these colors! It looks like they are all driven by the wallpaper selection. A beige-colored wallpaper leads to a beige notification panel, widgets, icons, and more.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/30-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/30.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/30.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/30.jpg 2560\" data-sub-html=\"#caption-1740866\"><figure><figcaption id=\"caption-1740866\"><span></span><p>The privacy screen shows kill switches for the camera and microphone. It looks like we're also getting a new design for the settings page, with big top headers.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/32-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/32.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/32-980x997.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/32.jpg 2560\" data-sub-html=\"#caption-1740868\"><figure><figcaption id=\"caption-1740868\"><span></span><p>That green privacy chip in the top-right shows when apps are using the camera, microphone, or location data.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/33-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/33.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/33-980x1007.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/33.jpg 2560\" data-sub-html=\"#caption-1740871\"><figure><figcaption id=\"caption-1740871\"><span></span><p>New widgets. As the widget screen on the right explains, these show \"recent messages, missed calls, and activity status\" from a contact.</p></figcaption></figure></li></ul></div><p>The final version of Android 12 should be released sometime in September, but the first developer preview is expected any day now. Our first hint of what Google's new release might have in store comes to us from&nbsp;<a href=\"https://www.xda-developers.com/android-12-first-look-screenshots/\">XDA Developers</a>' Mishaal Rahman, who has some pictures of what looks like a major UI overhaul for Android 12.&nbsp;According to the report, these images represent mockups, not screenshots, of Android 12. The mockups appear in a document describing the new features of Android 12, and the document is being passed around to partners as a heads-up before the public rollout.</p><p>The first thing that jumps out to me is the weird sepia-tone color scheme, like someone left night mode on permanently. This color scheme looks like a huge change compared to the all-white color scheme of Android 11, but it's probably completely up to the user. A recent report from <a href=\"https://9to5google.com/2021/01/27/android-12-working-on-in-depth-theming-system-that-can-even-recolor-apps/\">9to5Google</a> claimed that Google would launch an in-depth theming system in Android 12 that would let the system and third-party apps recolor themselves based on a user's preferences. One line of the report says, \"Interestingly, your Android 12 theme colors should also be able to be chosen automatically based on your current wallpaper. When you change your wallpaper, Android should be able to seamlessly swap to new colors similar to your wallpaper’s color palette.\"</p><p>It looks like that's what's going on here. The UI colors match the wallpaper very well because they are probably&nbsp;<em>from</em> the wallpaper. A beige-colored wallpaper leads to a beige-colored notification panel, icons, settings, widgets, and more. Even the camera app becomes beige. Android has had unused code for a theming engine for a <a href=\"https://github.com/deadman96385/RRO-WIKI/wiki/About-RRO\">very long time</a>. Automatic UI color picking launched all the way back in <a href=\"https://arstechnica.com/gadgets/2014/11/android-5-0-lollipop-thoroughly-reviewed/2/#h4\">Android 5</a> with the Palette API, when Google started kicking around the idea of using it for a music app. It looks like these things are finally being put to use.</p><p>Even if we ignore the colors, the notification panel is still pretty different, which is totally on brand for Android, as the notification panel gets revamped in every release. Starting at the top, the weird black status bar is gone, replaced with a single sheet that serves as a notification background. It's not transparent here, but that could just be a mockup inaccuracy. The time and date have swapped places, with the date on top now. The quick settings are no longer in a box, and they've been cut down to four instead of six (booo!). The Quick Settings shapes have been configurable in the past, but it now looks like there's a mix of shapes, with disabled settings having a square background and enabled settings getting a circle.</p><p>The rest of the notification panel doesn't look too different other than the rounder rounded corners. One oddity in this mockup is the visible rounded corners. This was <a href=\"https://arstechnica.com/gadgets/2019/03/android-q-hands-on-notification-panel-tweaks-new-settings-and-privacy-controls/\">briefly a real thing</a> during the Android 10 developer preview but never hit a final release. I think it's just a mockup inaccuracy. Other mockups even show a round front camera cutout in the UI, which normally doesn't show up on screenshots.</p><p>A lot of the mockups detail the return of the privacy chip notification in the top-right corner of the status bar, which alerts you when an app pings the camera, microphone, or location permissions. We first saw this feature in <a href=\"https://arstechnica.com/gadgets/2019/01/leaked-android-q-build-shows-off-dark-mode-improved-privacy-controls/\">pre-release Android 10 builds</a>&nbsp;all the way back in 2019, but it never hit a final release. The idea back then was that these alerts would pop up when an app was actively using sensitive permissions, and tapping on the chip would identify the app. One mockup shows what the pop-up UI would look like; it identifies not only apps that are currently using the camera, microphone, or location, but also apps that have used the permission \"recently.\" Each line in the privacy popup has a settings gear next to it, which would presumably let you block settings for that individual app.</p><p>There's also a new \"Privacy\" settings screen, which gives you what looks like systemwide kill switches for the camera, microphone, and location. None of these switches <a href=\"https://www.androidpolice.com/2019/05/08/android-q-lets-you-quickly-disable-your-phones-sensors/\">is new</a>, but you get easy, more obvious access to them now. This privacy screen also seems to show a new design for the settings. In addition to the new color scheme, it looks like Google is taking after Samsung and some other Android OEMs in designing settings screens with reachability in mind. There's a huge \"Privacy\" banner at the top, with lots of white space above it, pushing the start of the list down from the very top of the phone. Most good implementations of this feature&nbsp;shrink the top banner once you start scrolling.</p><p>The final new item in the mockups is a \"conversations\" widget. This seems to show a person or group chat and recent messages or calls from that person. It appears to combine messages from multiple apps into a single widget, which would be possible through the existing notification APIs. Incoming notifications are already associated with a contact for priority messaging purposes, so pooling all those messages together under a single person widget would work fine. It's strange that the mockups show the conversations widget in different shapes.</p><p>They seem to all be different states of the conversation widget, but some are rounded rectangles and some are&nbsp;pill-shaped. Why?&nbsp;More love for widgets in Android 12 is a good bet after the feature was finally copied by Apple in <a href=\"https://arstechnica.com/gadgets/2020/09/ios-and-ipados-14-review-iphone-transformation-ipad-iteration/#h6\">iOS 14</a>. Android launched with widgets in version 1, but those have been neglected over the years. If Google wants to copy Apple back, iOS now lets you stack widgets and scroll through them, which would be nice to see in Android. Apple's widgets are also generally more modern and cohesive, as they just launched. Android's widgets could really use a general revamp.</p><p>The first Android 11 Developer Preview launched last year on February 19, so we'll probably see working Android 12 builds this month.</p></div></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bdbda77ed3c1d6c982c165fe823f82ae6dd192fa0c657604278b710b67194c8f","category":"Tech"}