{"title":"Silca moves to 3D-printed titanium with mega-premium Mensola computer mount","link":"https://cyclingtips.com/2021/05/silca-mensola-computer-mount/","date":1621350003000,"content":"<div><div><p>Silca has made something of a habit of incorporating next-generation technologies into its increasingly broad range of cycling products, such as the latest crop of friction-reducing ingredients in its Synergetic wet chain lube, <a href=\"https://cyclingtips.com/2019/02/silca-introduces-viaggio-bluetooth-enabled-travel-pump/\" target=\"_blank\">Bluetooth pressure sensors in some of its pumps</a>, and the laser-welded joints on its Sicuro bottle cage. Now, Silca has incorporated 3D titanium printing with its latest product, the Mensola out-front computer mount.</p><p>The Mensola is being produced in-house on one of Silca’s two 3D printers, and features the sort of sculpted shape and funky internal latticework we’ve come to expect from the construction technique. Silca is dressing up the Mensola a bit further yet with a semi-polished finish.</p><p>Actual weight for the Mensola is just 33 g, which puts it a single gram heavier than the K-Edge Race mount. However, Silca claims the Mensola’s truss-like titanium structure is “six to ten times stronger” than the more common CNC-machined aluminum construction, while also resulting in much less waste (Silca is claiming just 3-4% powder waste by weight per production run). </p><p>That sort of robustness would seem to naturally lend itself to adding accessories like an under-mount daytime running light or camera. However, there are unfortunately no mounting holes on the underside of the Mensola so that additional strength seems to be mostly for bragging rights.</p><p>Instead of a standard clamp format to work with 31.8 mm-diameter round handlebars, Silca is going with a center-mount style using the lower two stem faceplate holes for a cleaner and more symmetrical appearance. Nine different hole spacings (plus a dedicated one for the Black Inc. one-piece cockpits) will be offered initially to accommodate a wide variety of stems, and extra-long 6/4 titanium bolts are included. Inserts for Garmin and Wahoo computer heads will be available at first, with more models added later depending on demand.</p><p>“We are working on other spacings and integrated offerings and will be bringing them to market as quickly as possible,” said Silca owner Josh Poertner. “The beauty here is that all of the ‘tooling’ is really in the CAD work, so even with the integrated ones, we bring in the bar or the existing mount, 3D scan it, and then build a CAD model around that. From there on, we can print parts to order. The vision over time is to have all the possible options and let the consumer or dealer just choose the model they want from a database, and three days later, one comes out of the machine.”</p><p>As for the retail price, well … the Mensola is about as expensive as you might assume: US$175 / AU$265 / £175 / €210. Before you throw your hands up in outrage though, let’s at least remember that 3D titanium printers aren’t exactly cheap, nor is the raw titanium powder required to make this stuff. Nevertheless, the value argument for the Mensola is pretty darn weak, but if you’ve got the cash to burn and this sort of thing appeals to you, then that’s probably all the justification you need.</p><p>More information can be found at <a href=\"http://www.silca.cc/\" target=\"_blank\">www.silca.cc</a>.</p></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"be22c4d158152c203b5650ade23e37ee91143bb3d877bbdc0ca352a8666f6b18","category":"Cycling"}