{"title":"LOL Garamond sux, say federal judges","link":"https://arstechnica.com/?p=1750923","date":1616173758000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>FONT WARS —</h4><h2 itemprop=\"description\">Garamond—it's just too small for the DC Circuit.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/garamond-not-wanted-courthouse-800x450.jpg\" alt=\"Keep your Garamond out of your briefs!\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/garamond-not-wanted-courthouse.jpg\" data-height=\"844\" data-width=\"1500\">Enlarge</a> <span>/</span> Keep your Garamond out of your briefs!</p><p>Aurich Lawson | Getty Images</p></figcaption></figure><p>Let me bury the lede for a moment to tell you a story. Long ago, in a magical realm called Academe, professors grew wise to the old student tricks of futzing with both margins and text spacing to make their essays fit a prescribed page limit. Triple spacing and two-inch margins could no longer save you from the effects of a debauched evening spent drinking on Franklin Street when you should have been in the library reading \"Aurora Lee\" instead.</p><p>But for a few shining years, professors didn't mandate font choices—and they wouldn't deploy the Red Pen of Shame unless you headlined your takedown of Barthes' <em>S/Z</em> in, say, Comic Sans.</p><p>As someone intent on being a Serious Writer™, I felt it my duty to write papers that would fully showcase my genius. Papers that might, in the strictest sense, exceed the given page count. And when I was really wordsmithing the hell out of my analysis of the court sermons of Lancelot Andrewes, it was always Garamond that came to my rescue.</p><p>Ah, Garamond—how you saved me from doing the hard, boring, necessary work of editing! How you squeezed those extra paragraphs back onto page five instead of letting them lie there, bloated and obscene, atop the forbidden page six! How you offered that electric tingle of sophistication as I avoided the plebian, pedestrian, pathetic use of Times New Roman!</p><p>Well. Apparently I was not the only one who played this game. My professors got tired of reading papers that were longer than desired. They began mandating (O ye gods!) 12-point Times New Roman, double-spaced, with one-inch margins—or you'd get a big fat zero.</p><h3>NO YUO</h3><p>Fast-forward to this week, when the DC Circuit Court of Appeals came to the same realization that lawyers use Garamond to cram more than is strictly allowed into their legal briefs. <a href=\"https://www.law.cornell.edu/rules/frap/rule_32\">Federal Rule of Appellate Procedure 32(a)(5)</a> says only that \"a proportionally spaced face must include serifs\" and must \"be 14-point or larger.\" But the rules don't say what proportional fonts can be used in legal filings.</p><p>As lawyer John Elwood <a href=\"https://twitter.com/johnpelwood/status/1372021931965317122\">pointed out on Twitter</a>, \"Garamond is more compact than most fonts. For most appellate filings, its use will shave several pages off a brief. For that reason, it's long been a last resort for page-limited filings.\"</p><p>As a smaller font, it's also just harder to read at the same size as fonts like Times New Roman. And the court has had just about enough of it.</p><p>\"The court has determined that certain typefaces, such as Century and Times New Roman, are more legible than others, particularly Garamond, which appears smaller than the other two typefaces,\" the DC Circuit <a href=\"https://www.cadc.uscourts.gov/internet/home.nsf/Content/Announcement+-+Notice+-+Preferred+Typefaces+for+Briefs/%24FILE/noticePreferredTypefacesForBriefs.pdf\">announced this week</a>. The court, it said, wants to \"discourage use of Garamond.\"</p><p>This led to the unusual prospect of legal media running multiple <a href=\"https://www.law.com/nationallawjournal/2021/03/18/questioning-my-existence-dc-circuits-dumping-on-garamond-divides-lawyers/\">pieces</a> about <a href=\"https://www.law.com/nationallawjournal/2021/03/17/dc-circuit-shuns-garamond-setting-lawyers-abuzz-over-favorite-fonts/?slreturn=20210219111840\">font choice</a> <a href=\"https://abovethelaw.com/2021/03/d-c-circuit-takes-bold-stance-against-a-font/?rf=1\">this week</a> as lawyers argued over the merits of Baskerville and Gill Sans.</p><p>The DC Circuit's animus against Garamond has not yet spread to the broader appellate system. Typeface policies in the <a href=\"http://www.ca5.uscourts.gov/docs/default-source/forms-and-documents---clerks-office/rules/brchecklist.pdf\">Fifth</a> and <a href=\"https://www2.ca3.uscourts.gov/legacyfiles/2011_LAR_Final.pdf\">Third</a> Circuits are, essentially, just the standard Federal Rules of Procedure. But now that judges in an influential appellate circuit have shown their pro-Times New Roman bias, WILL GARAMOND TOO BECOME A VICTIM OF CANCEL CULTURE?</p></div></div>","author":"Nate Anderson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"be83e11af2cf4d75e8f4d7d39ae75b96b9ff5b695e36cfa1e345ebcc8cedd92d","category":"Tech"}