{"title":"SD Worx adds Kata Blanka Vas to their roster","link":"https://cyclingtips.com/2021/04/sd-worx-adds-kata-blanka-vas-to-their-roster/","date":1618306843000,"content":"<div><p></p><h4>Kata Vas racing Jaarmarktcross Niel in 2020 ©kramon</h4><p></p><div><p>Team SD Worx has added cyclocross rider Kata Blanka Vas to their 2021 roster. Vas will represent the team in cyclocross, cross country mountain biking, and road racing as of June 1st on a two-year deal.</p><p>On the cyclocross side, Vas has been delivering results for a couple of years, finishing second at the U23 world championships in 2020 and third in 2021. She races against the elite women throughout the cyclocross season and finished fifth overall at the end of the 2020/2021 season.</p><p>Vas also races on the mountain bike, she was second at the U23 world championships in 2020. By adding Vas to their team, SD Worx is hoping to be more visible in all aspects of cycling, according to team manager Danny Stam.</p><p>“With Kata Blanka Vas we can profile ourselves in cyclocross in the winter months,” Stam said in a press release. “In addition, she has already achieved good results on the road, given her age. That makes her a good fit for the team. Finally, she is also seen as one of the greatest talents in mountain bike. This way she can qualify for the Olympic Games in Tokyo this year. This discipline is important to our material sponsor Specialized. As a result, we are open to her continuing to develop in these three areas.”</p><p>Vas has raced on the road for the last two years, although not as frequently as on dirt. In 2020 she won the Hungarian national championship road race and finished second in the time trial. She was also the women’s junior national champion on the road in 2019.</p><p>Joining SD Worx will be a massive asset when it comes to the Hungarian rider’s goal of attending the Tokyo Olympics. SD Worx has Specialized on their side, so Vas will have ample resources for both cross and mountain biking. On the road, she will be surrounded by the best players in the game with Anna van der Breggen and Chantal van den Broek-Blaak as teammates and future directors.</p><p>“The team gives me the freedom to combine the three disciplines,” Vas said. “I don’t know yet whether cyclocross, mountain bike or the road suits me best. I hope to discover that in the coming years. In that respect, Mathieu van der Poel is a good example for me. He shows that up to a certain age you can combine these three disciplines and thus develop yourself further and grow to the top of the world. It feels like an honor to me that great champions like Anna van der Breggen and Chantal Blaak, among others, will soon be my teammates.”</p><p>Vas has been competing for the Belgian team Doltcini-Van Eyck for the last three years.</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bee89ca0b06acf86f84cfff6853635862378d0d55bac8212cf90eaf59e2f7990","category":"Cycling"}