{"title":"Matej Mohoric announces MM Foundation to support young Slovenian cyclists","link":"https://cyclingtips.com/2021/12/matej-mohoric-announces-mm-foundation-to-support-young-slovenian-cyclists/","date":1638483124000,"content":"<div><div><p>On Thursday Matej Mohoric announced <a href=\"https://twitter.com/matmohoric/status/1466480244668436484?s=20\" target=\"_blank\">via Twitter </a>a foundation to help the development of cycling in his home country of Slovenia. The MM Foundation is aimed at providing the Slovenian national team, as well as younger riders, with the tools to become better cyclists.</p><p>“Today, at the Grof Hotel in Vransko, we presented the vision of my foundation, which will bring cycling closer to children, and provide the youth national team with conditions for top results, both financially and with knowledge and experience, which opens the door to professional cycling,” Mohoric said.</p><blockquote><p>MM foundation will support both slovenian junior national team and cycling for younger categories on a more local level. The goal is to bring children closer to the sport and create environment in which they can excel. 1/2</p>— Matej Mohoric (@matmohoric) <a href=\"https://twitter.com/matmohoric/status/1466495416225120259?ref_src=twsrc%5Etfw\">December 2, 2021</a></blockquote><p>Mohoric’s foundation has been a long time coming, according to his Bahrain-Victorious team.</p><p>One of his goals is to get “as many kids as possible to start cycling” at the local level by hosting events for kids and providing financial support for those who need it. The MM Foundation will also support the Slovenian junior national team.</p><p>“Not all of them will become future champions, but cycling can be a passion and a mean of healthy lifestyle for them for the rest of their lives,” Mohoric said.</p><p>Mohoric is coming off of a very impressive season with Bahrain-Victorious. After winning the points classification at the Tour of Slovenia he went on to take the national road title and two Tour de France stages. Near the end of his 2021 campaign, he nearly won the Benelux Tour, eventually settling for second behind his teammate Sonny Colbrelli.</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bf2efab3cbde353c614c3a66caee10ac5dbea2fe3b3d4393222d8b03cce02af3","category":"Cycling"}