{"title":"Richard Carapaz wins Olympic gold in men’s road race","link":"https://cyclingtips.com/2021/07/richard-carapaz-wins-olympic-gold-in-mens-road-race/","date":1627116560000,"content":"<div><p></p><h4>Richard Carapaz wins Olympic Gold in Tokyo.</h4><p></p><div><p>Richard Carapaz (Ecuador) has won the Men’s Road Race at the <a href=\"http://www.cyclingtips.com/tag/2020-tokyo-olympics\">202<s>0</s>1 Tokyo Olympics</a>, having escaped late in the hard, hot and attritional race. The Ecuadorian – who finished third at the Tour de France last week – finished 1:07 ahead of a select chasing group after more than six hours in the saddle.</p><p>In the sprint for the minor placings, Wout Van Aert (Belgium) narrowly held on for silver ahead of a fast-closing Tadej Pogačar (Slovenia).</p><h2>How it happened</h2><p>The men’s road race fell on the first day of the COVID-delayed Olympics, with the peloton tackling a punishing course of 234 km with more than 5,000 m of climbing, in oppressive heat and humidity. </p><p>The intrigue began before the flag even fell, with the late scratchings of Simon Geschke (Germany) and Michal Schlegl (Czech Republic) due to positive COVID tests. Spain had some nervous moments, too, with a soigneur testing positive yesterday, but were ultimately allowed to compete after its riders returned negative rapid tests. </p><p>After all that, it was 130 riders that set off from the western suburbs of Tokyo toward the monolithic Mount Fuji, and from there to Fuji International Speedway.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033338-041-1340x893.jpg\"></figure><p>The traditional early breakaway snuck free – a mix of known names from the WorldTour like Nic Dlamini (South Africa) and Juraj ‘The Other’ Sagan (Slovakia), joined by less familiar companions from powerhouse countries: Michael Kukrle (Czech Republic), Polychronis Tzortzakis (Greece), Eduard-Michael Grosu (Romania), Aular Sanabria (Venezuela), Paul Daumont (Burkina Faso) and Elchin Asadov (Azerbaijan). </p><p>In the Olympic spirit (or something) that group worked well to establish a lead that at one point exceeded 20 minutes. Meanwhile, reigning Olympic Champion Greg van Avermaet (Belgium) and Jan Tratnik (Slovenia) were among the names on the front of the peloton policing the gaps. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033338-042-1340x893.jpg\"><figcaption>The peloton approaches Mount Fuji.</figcaption></figure><p>Great Britain’s Tao Geoghegan Hart and Geraint Thomas (no, <a href=\"https://cyclingtips.com/2021/06/exclusive-a-mid-tour-de-france-interview-with-geraint-thomas/\">not that one</a>) came down in a crash on the Doushi Road climb at 155 km to go, while the leading group dwindled to five riders. </p><p>The race continued toward its date with Fuji Sanroku – 14.4 kilometres of verty hurty at an average gradient of 6%. That ascent saw some big names struggling to keep contact – among them Alejandro Valverde – before the long descent provided some succour. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033338-027-1340x893.jpg\"><figcaption>The day’s big breakaway in the early goings of the race.</figcaption></figure><p>The gap to the remnants of the breakaway – Dlamini, Kukrle, Sagan, Tzortzakis and Aular Sanabria – continued to dwindle on the approach to the Fuji International Speedway, where the riders would get a taste of the finishing circuit for a couple of laps before heading back out into the wild and toward the looming Mikuni Pass (6.5 km at 10.6%). A couple of big hitters – Caruso, Kelderman and Evenepoel among them – stretched their legs but it was all together as the race reached its punishing climax.</p><p>Peaking at 34 km from the finish, Mikuni Pass was predestined to be the decisive moment of the race, and it was the Belgians, the Italians and the Slovenians that massed at the front, stretching the shrinking peloton into a long, diminishing line up the steep slope. Pre-race favourite Tadej Pogačar was looking calm on the climb – less so Remco Evenepoel, who slipped off the back. </p><p>At 37.4 km to go, Pogačar made his move, joined by Michael Woods (Canada) and Brandon McNulty (USA), with Wout Van Aert leading the chase from a select group behind. That group came back together around 34 km to go, just in time for Woods to make a stinging attack over the crest of Mikuni Pass. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033338-068-1340x911.jpg\"><figcaption>Wout Van Aert on the attack.</figcaption></figure><p>Woods held a modest advantage on the descent but it was brought back together to a select group of 13 riders on the approach to Kagosaka Pass – just in time for McNulty to drop some watt bombs and get joined by Richard Carapaz (Ecuador).</p><p>The duo built an advantage of around 30 seconds into the descent, chased by Tadej Pogačar (Slovenia), Alberto Bettiol (Italy), Rigoberto Uran (Colombia) Max Schachmann (Germany), Michal Kwiatkowski (Poland), Wout van Aert (Belgium), David Gaudu (France), Bauke Mollema (Nederlands), Rigoberto Uran (Colombia), Jakob Fuglsang (Denmark) and Adam Yates (Great Britain).</p><p>McNulty and Carapaz’s lead ebbed and flowed on the approach to Fuji International speedway, until Wout Van Aert ignited the pursuit, closing the gap to 13 seconds at 7.7 km to go.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033338-069-1-1340x893.jpg\"><figcaption>Carapaz goes it alone, dropping breakaway companion Brandon McNulty in the closing kilometres.</figcaption></figure><p>At 5.9 km to go, Carapaz went it alone, dropping a tiring McNulty and committing fully for the win.</p><p>The Ecuadorian emptied himself on the smooth, wide tarmac of the racetrack, crossing the line with arms raised to win gold, more than a minute ahead of his pursuers.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033338-075-1340x595.jpg\"><figcaption>It was Van Aert by a rim-width ahead of Pogačar for silver.</figcaption></figure><hr><div><div><p>Olympic Games Road Race (Olympics) <span>Musashinonomori Park → Fuji International Speedway</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/aa/richard-carapaz-2021.jpeg\"></p></div></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"bfcc2f4de90ccefe28ac99a10a1a57881b5984bf3c7477e12040d4a254b0ed66","category":"Cycling"}