{"title":"2021 Sea Otter Australia postponed","link":"https://cyclingtips.com/2021/07/2021-sea-otter-australia-postponed/","date":1626928264000,"content":"<div><div><p>The Sea Otter team would like to update you on some developments around the 2021 event as we are now at the 12 week mark prior to the event.</p><p>After reviewing the impact that the new Delta variant of COVID is having on communities across the country and the now normalised “go fast-go hard lockdown” response from state and territory governments, it’s clear that a Sea Otter event unaffected by COVID in the coming 12 weeks is highly unlikely.</p><p>The safety and welfare of our Sea Otter family is paramount, as is our desire to ensure that we deliver excellent value for the investments made by exhibitors, riders, sponsors and spectators alike. Unfortunately, we are no longer confident that this is realistic as a result of the new COVID variants.</p><p>Consequently, we have decided to postpone the 2021 delivery of Sea Otter Australia to the weekend of September 29 – October 3, 2022.</p><p>Naturally, for riders that have registered and paid to be a part of the 2021 event, the option to transfer bookings to next year is available, as is a refund if preferred.</p><p>In order for us to manage your booking, please visit our website and provide us with your preferred option <a href=\"https://seaotteraustralia.com.au/2021-postponement/\" target=\"_blank\">here</a>.</p><p>We do apologise for the inconvenience this decision will no doubt cause but felt an early determination of the risks surrounding this year would minimise the costs of planning your attendance.</p><p>The good work and legacy programs that we have started will continue. The KRUSH Grassroots Scholarships will now be awarded at the 2022 event with the application period has been extended to 1 October 2022. To review the full application criteria and register <a href=\"https://seaotteraustralia.com.au/legacy/grassroots-scholarship/\" target=\"_blank\">CLICK HERE</a>.</p><p>Thanks again and see you in 2022!</p><h2>Key Details</h2><ul><li>After reviewing the impact that the new Delta variant of COVID is having on communities across the country and the now normalised “go fast-go hard lockdown” response from state and territory governments, it’s clear that a Sea Otter event unaffected by COVID in the coming 12 weeks is highly unlikely.</li><li>The safety and welfare of our Sea Otter family is paramount, as is our desire to ensure that we deliver excellent value for the investments made by exhibitors, riders, sponsors and spectators alike. Unfortunately, we are no longer confident that this is realistic as a result of the new COVID variants.</li><li>Consequently, we have decided to postpone the 2021 delivery of Sea Otter Australia to the weekend of September 29 – October 3, 2022.</li></ul><div><h2>WHAT IS ‘FROM THE SOURCE’?</h2><p>When you see an article containing ‘From the source’ label on the homepage or with the headline in blue, note that this is content directly from the brand and it has been vetted by our Editors and deemed worthy of your attention.</p><p>This is not paid or sponsored content but rather a way to bring you news worth sharing while freeing up our Editors to spend their time adding value where where their expertise lays. Follow the <a href=\"https://cyclingtips.com/what-is-from-the-source/\">link</a> to learn more about this type of content and our related publishing guidelines.</p></div></div></div>","author":"Sea Otter Australia","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c080d1f5bff0d5443aac57e925b0a7bd95dba85c0be9f32fcb6abfdcac06f62b","category":"Cycling"}