{"title":"Wahoo Relaunches Speedplay, Announces Power Meter Plans (POWRLINK Zero)","link":"https://www.dcrainmaker.com/2021/03/wahoo-speedplay-powrlink-zero-power-meter-announcement.html","date":1615896028000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/03/SpeedplayLifestyle-08.png\"><img title=\"SpeedplayLifestyle-08\" src=\"https://media.dcrainmaker.com/images/2021/03/SpeedplayLifestyle-08_thumb.png\" alt=\"SpeedplayLifestyle-08\" width=\"720\" height=\"480\" data-ll-status=\"loaded\"></a></p><p>It’s been roughly 18 months since Wahoo announced the acquisition of Speedplay. Since then the company reduced some 50 different SKUs down to 4 core models, moved factory locations, shut down factories, moved factory locations again, and started building a Speedplay power meter. More astoundingly though, no vowels were harmed during the process. Well, at least until they announced their upcoming power meter pedals, which sacrificed one vowel to the Wahoo phonetic gods.</p><p>And thus the final resultant is five products, four of which we get details on today, while the power meter (the 5th product) we only get some limited details. The complete launching of that is slated for summer, assuming things go well. In fact, if you want a quick dive into all the power meter analysis based on what we know so far, hit the play button below:</p><div data-id=\"hTC6IHWMcOY\" data-query=\"\" data-src=\"https://www.youtube.com/embed/hTC6IHWMcOY\"><p><img loading=\"lazy\" data-lazy-src=\"https://i.ytimg.com/vi/hTC6IHWMcOY/hqdefault.jpg\" alt=\"\" width=\"480\" height=\"360\" src=\"https://i.ytimg.com/vi/hTC6IHWMcOY/hqdefault.jpg\"></p></div><p>So let’s dive into the two announcements. First, the non-tech pedal bits, followed by a deep dive into the power meter side.</p><h3 data-test=\"1/3\" id=\"the-pedal-lineup-non-power\"><span>The Pedal Lineup (non-power):</span></h3><p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/03/image-46.png\"><img title=\"image\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20713%20240'%3E%3C/svg%3E\" alt=\"image\" width=\"713\" height=\"240\" data-lazy-src=\"https://media.dcrainmaker.com/images/2021/03/image_thumb-46.png\"></a></p><p>I’m not going to focus much on the non-power meter bits too much here. Largely, because I don’t care about them. There are others that can talk for days about pedals without electronics in them. But that’s not my jam. Whereas for power meters…you better get yourself a cup of coffee or two.</p><p>Still, I’m going to very briefly cover the main news here.</p><p>Essentially, Wahoo has distilled the Speedplay lineup down to four main pedals:</p><p><strong>– Nano (Titanium):</strong> 168g per set &amp; $449USD<br><strong>– Zero (Stainless Steel):</strong> 222g per set $229USD<br><strong>– Comp (Chromoly):</strong> 232g per set &amp; $149<br><strong>– Aero (Stainless Steel):</strong> 224g per set &amp; $279</p><p>When it comes to the pedals themselves, there’s been some changes to match the Wahoo industrial design styling, such as the look of the spindle. But also changes to a few minor internal bits. They noted that you should no longer have to grease your pedals, because the new Speedplay pedals actually have a properly designed custom seal (o-ring) in them, versus what was basically an off-the-shelf one that didn’t fit perfectly previously.</p><p>Now I’ll take prettier pictures of the Speedplay Zero pedals once mine get untangled in shipping. They’re somewhere, but somewhere is not currently in my hands. Such is life. However, here’s the Wahoo gallery of images, for those that want to poke around:</p><p>And because I love charts, here’s a simple chart from Wahoo that shows all these options:</p><p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/03/image-47.png\"><img title=\"image\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20722%20340'%3E%3C/svg%3E\" alt=\"image\" width=\"722\" height=\"340\" data-lazy-src=\"https://media.dcrainmaker.com/images/2021/03/image_thumb-47.png\"></a></p><p>Now, out of curiosity I looked up pricing for the Speedplay Zero online here in Europe, and previously, the original Speedplay zero is *currently* selling for 149EUR across the board from most shops here. Versus now Wahoo is saying it’ll be 229EUR. I asked Wahoo about this, and they said that the list pricing should remain the same, however, the previous pricing that I’m seeing is basically the discounted pricing by bike shops. Here in Europe, that’s often quite substantial.</p><p>Now while European law doesn’t allow companies like Wahoo to set prices for retailers directly (in fact, there are huge fines for doing so), they can do so indirectly by only providing inventory through their specific dealer network. In other words, from my discussions with Wahoo, fully expect those discounts to evaporate, because if there’s anything we know about Wahoo – it’s that they’re sticklers on discounting.</p><p>Next, as noted by Wahoo in the chart above, Speedplay production has been moved to Wahoo’s manufacturing facilities in Vietnam. Previously Speedplay was based (and made) in San Diego. Then Wahoo moved production to Raleigh for a while, before now moving it to Vietnam.</p><p>Finally, I’ll leave you with a <a href=\"https://www.dcrainmaker.com/2019/09/wahoo-acquires-speedplay-hints-at-power-meter-pedal-future.html\">quote from Wahoo CEO Chip Hawkins</a> when Wahoo announced the acquisition of Speedplay, saying: “We can do cross pedals, and mountain pedals… and there’s lots of opportunity. I’m just excited, I love the mechanical gadgetry stuff!” – in my chat with them yesterday, it sounds like that quote is still very valid.</p><h3 data-test=\"2/3\" id=\"powrlink-zero\"><span>POWRLINK ZERO:</span></h3><p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/03/image-48.png\"><img title=\"image\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20714%20480'%3E%3C/svg%3E\" alt=\"image\" width=\"714\" height=\"480\" data-lazy-src=\"https://media.dcrainmaker.com/images/2021/03/image_thumb-48.png\"></a></p><p>Now, most of you here are interested in power meter details. And, that’s where things get a bit thin a bit quick. But fear not, if there’s anything I’m good at, it’s coloring outside the lines without breaking the lines.</p><p>First up, officially, Wahoo isn’t releasing much here. They’re basically giving us the official name, the rough season, and the fact that they’ll be dual-sensing pedals. Also, we get the weight of the pedals. All of that is consolidated quite easily as follows:</p><p><strong>Pedal body:</strong> Based on Speedplay Zero<br><strong>Pedal spindle:</strong> Remains stainless steal<br><strong>Weight of power meter:</strong> 276g total (138g per pedal)<br><strong>Architecture:</strong>&nbsp;Dual-sensing pedal set (both left &amp; right sides have power meters)<br><strong>Shipping:</strong> Summer 2021<br><strong>Price:</strong> To be announced</p><p>And officially, the above single silhouette image is the only thing that Wahoo has released as part of today’s announcements, in terms of the power meter specifically.</p><p>Unrelated to that, officially, I monthly pay for Adobe Lightroom. Which officially, makes the following exposé quite easy:</p><p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/03/image-49.png\"><img title=\"image\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20720%20410'%3E%3C/svg%3E\" alt=\"image\" width=\"720\" height=\"410\" data-lazy-src=\"https://media.dcrainmaker.com/images/2021/03/image_thumb-49.png\"></a></p><p>You’re welcome.</p><p><img src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20717%20478'%3E%3C/svg%3E\" alt=\"\" width=\"717\" height=\"478\" data-lazy-srcset=\"https://media.dcrainmaker.com/images/2021/03/wahooPedalpods.jpg 717w, https://media.dcrainmaker.com/images/2021/03/wahooPedalpods-124x82.jpg 124w, https://media.dcrainmaker.com/images/2021/03/wahooPedalpods-200x132.jpg 200w, https://media.dcrainmaker.com/images/2021/03/wahooPedalpods-300x200.jpg 300w, https://media.dcrainmaker.com/images/2021/03/wahooPedalpods-278x185.jpg 278w, https://media.dcrainmaker.com/images/2021/03/wahooPedalpods-125x83.jpg 125w\" data-lazy-sizes=\"(max-width: 717px) 100vw, 717px\" data-lazy-src=\"https://media.dcrainmaker.com/images/2021/03/wahooPedalpods.jpg\"></p><p>Of course, we could first see that a pod was there, but now it’s far more obvious. Pods are hardly new to the power meter game. After all, the Favero Assioma (and Favero BePro pedals before that) had pods. As did Garmin Vector 1 &amp; Vector 2. And the Look/Keo System, and others that never quite made the light of day. So in effect, it’s these two stuck together:</p><p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/03/DSC_3696.jpg\"><img title=\"DSC_3696\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20720%20480'%3E%3C/svg%3E\" alt=\"DSC_3696\" width=\"720\" height=\"480\" data-lazy-src=\"https://media.dcrainmaker.com/images/2021/03/DSC_3696_thumb.jpg\"></a></p><p>The reason Wahoo is likely going with a pod is that the key ‘selling’ feature of a Speedplay pedal is the reduced stack height, which in turn means that the reduced space in the spindle and pedal for electronics. It’s tiny in comparison to a Vector 3, Favero, or SRM pedal. That said, Garmin said years ago they believed they could stick it in a Speedplay pedal spindle/body. Whether or not that’s the same today after years of learnings – who knows.</p><p>Undoubtedly a pod-based design leans heavily towards being a rechargeable design versus a coin cell one. And that’s probably a wise move. While that’s historically meant less battery life for the likes of Favero compared to Garmin with coin cell, at least they wouldn’t have to deal with coin cell hell as seen on Vector 3.</p><p>In terms of aspects like ANT+ &amp; Bluetooth Smart, I’d expect it’d follow the same specs as their recent TICKR heart rate straps. Which is to say it’ll offer unlimited ANT+ connections, while also doing dual-Bluetooth Smart connections. That’s been the norm for them on trainers for a couple of years now, so I wouldn’t think it would be any different. However, it’ll be interesting to see how they handle/tackle the dual-sensing pedal challenge on Bluetooth Smart. Some companies like Favero &amp; SRM offer ‘single-channeling’ the Bluetooth broadcast, so that apps like Zwift don’t get all confused. Whereas Garmin does some Bluetooth Black Magic that just makes it work somehow without user intervention. The choices they make here have implications for other watches and apps. For example, Polar watches don’t work (still) with PowerTap pedals.</p><p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/03/image-50.png\"><img title=\"image\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20722%20237'%3E%3C/svg%3E\" alt=\"image\" width=\"722\" height=\"237\" data-lazy-src=\"https://media.dcrainmaker.com/images/2021/03/image_thumb-50.png\"></a></p><p>Before we get into some of the technical Q&amp;A analysis, it’s worthwhile pointing out that I asked Wahoo whether or not any pro riders or pro teams were currently using the Speedplay POWRLINK Zero (the power meter). They said no, not yet. It sounds like that’s relatively near-term, but it’s not there yet. I do suspect there are probably a few either lower level or off-season pros that might be helping Wahoo test it (people that are out of the public eye), plus of course Wahoo’s much more expansive beta testing group of employees of others outside the company.</p><p>However, there are a multitude of questions that are left on the table, along with some of my analysis on these questions:</p><p data-test=\"4/3\" id=\"a-whats-the-real-world-accuracy-like\"><strong>A) What’s the real-world accuracy like?</strong></p><p>I’m not talking about claimed spec here (e.g. +/- 2%), I’m talking about Day 1 accuracy. This is unquestionably the elephant in the room. Power meters are hard, and pedal power meters are incredibly hard. For most companies in this segment trying to make a V1 pedal based power meter, their development phase is 2-3 years long. No doubt Wahoo has engineering talent in power meter related technology and systems. So this isn’t totally brand new space, but it’s still significant new ground to cover. Wahoo’s current power sensing related products don’t physically move anywhere. They don’t have to deal with wonky forces, moving grounds, and rain/heat/humidity/etc. I can’t stress enough how long this road is for most companies.</p><p data-test=\"5/3\" id=\"b-whats-the-price\"><strong>B) What’s the price?</strong></p><p>I’d say smart money is they match Garmin Vector 3 in pricing – so roughly $999USD. They could try and undershoot that a bit, but honestly, there’s little reason to. Sure, Favero is down at $719, but there’s also zero business reason for them to be there. They make a solid product that could at this point compete with Garmin’s product at or just slightly below price. Wahoo meanwhile, is a so-called ‘premium brand’, and thus, there’s no reason to undersell itself to gain market share. Assuming of course its accurate.</p><p data-test=\"6/3\" id=\"c-whats-the-battery-life\"><strong>C) What’s the battery life?</strong></p><p>The Favero Assioma pedals, also with pods &amp; rechargeable batteries, have a claimed battery life of 50 hours. Vector 3, sans-pods with coin cell battery have a claimed battery life of 120-150 hours, and SRM’s X-Power units have a 30-40 hour battery life (rechargeable). Since we know they’re going with pods, and likely with recharging tech, I’m going to guess in that 50 hour range, maybe a touch higher. Favero’s units are based on pretty old battery and component tech at this point. Not in a bad way, just a ‘time moves on’ kind of way. Just like with SRM’s recent internal battery updates for their pedals, they’re looking at basically doubling the battery life as a result of minor internal components. So again, my bet for Wahoo is 50-75 hours once the product is stabilized (most companies focus on battery life optimizations last).</p><p data-test=\"7/3\" id=\"d-will-there-be-any-form-of-cycling-dynamics\"><strong>D) Will there be any form of Cycling Dynamics?</strong></p><p>Both Garmin &amp; <a href=\"https://www.dcrainmaker.com/2019/07/favero-assioma-cycling-dynamics-released.html\">Favero have Cycling Dynamics</a>. Garmin has a few more metrics in it, but both are based on the same <a href=\"https://www.dcrainmaker.com/2017/10/garmin-opens-up-cycling-dynamics-to-other-companies.html\">ANT+ Cycling Dynamics device profile</a>. At present, Wahoo doesn’t support that. However, <a href=\"https://www.dcrainmaker.com/2018/09/wahoo-fitness-adds-pioneers-advanced-pedaling-metrics-to-elemnt-bolt.html\">Wahoo did have a partnership with Pioneer a few years back</a> before <a href=\"https://www.dcrainmaker.com/2020/02/pioneer-exits-power-meter-business-as-shimano-buys-their-cycling-business.html\">Shimano bought Pioneer</a>, and that partnership did include Pioneer’s variant of advanced pedaling metrics. In many ways, the metrics were very similar to Cycling Dynamics.</p><p>I could see this being a toss-up. While I suspect long-term Wahoo will undoubtedly adopt the Cycling Dynamics standard, short term I’m less sure. Back in the early days of Wahoo, they often led the charge on adopting industry standards for protocols – in fact, even leading those efforts on both ANT+ &amp; Bluetooth Smart. However in the last 3-4 years, they’ve mostly dragged their feet. Whether it was Bluetooth FTMS (*FINALLY* just added to the KICKR last month, after years of being in the market), or Running Dynamics (also implemented in the TICKR 2020 years after promising it), or even support for ANT+ radar years later.</p><p>Of course, I’d argue that Cycling Dynamics is still more marketing than useful to the average person, but in the competitive pedal-based power meter space, Wahoo may prioritize that sooner rather than later. Keeping in mind though, Wahoo wouldn’t likely roll this out till they properly rolled out Cycling Dynamics standard support for their ELEMNT/BOLT/ROAM/RIVAL units though.</p><p data-test=\"8/3\" id=\"e-other-random-technical-nuances\"><strong>E) Other random technical nuances:</strong></p><p>There’s still a slate of things to consider. Will they support auto-zero (or, turning it off), will it support manual calibration with a static weight test, will it properly send out a low battery warning, does it have active or passive temperature compensation, and so on. Most of these only matter when a company screws up something else. For example – I don’t really care if you have active or passive temp compensation, as long as it’s compensating properly.</p><p>In the same way that I don’t really care about turning off auto-zero as long as the auto-zero doesn’t screw up. The low-battery warning is an important one, but most companies do it properly now.</p><p data-test=\"9/3\" id=\"f-will-wahoo-license-speedplay-to-other-power-meter-companies\"><strong>F) Will Wahoo license Speedplay to other power meter companies?</strong></p><p>For readers playing the long game at home, back when <a href=\"https://www.dcrainmaker.com/2019/09/wahoo-acquires-speedplay-hints-at-power-meter-pedal-future.html\">Wahoo first announced the Speedplay acquisition</a>, I asked whether or not Wahoo would be open to licensing Speedplay to 3rd party companies, namely power meter companies, if they wanted to utilize their pedal design (prior to the acquisition, Speedplay as a company under the previous owners was considered lawsuit trigger happy).</p><p>Back then, Wahoo’s founder and CEO said: “We have a ton of patents that cover every aspect of that pedal and that fashion. But I think we’ll be more open with others, and we won’t be considered litigious…we won’t be hard to work with.” He went on to say that he wouldn’t be opposed to working with other companies, in the same way Wahoo today works with numerous other partners on a variety of projects.</p><p>So last I asked again, fast-forwarding 18 months and now announcing their own power meter on Speedplay, did that quote still hold water. And sure enough, it still does. He replied, “I wouldn’t say I would turn it down”, but noted that the complexities are much tougher because the spindles are so much higher. But ultimately noted that “I would entertain it, if someone came to us” with a request. Obviously, the business and technical realities may not combine to make that work, but I found it notable it’s still an option on the table.</p><h3 data-test=\"3/3\" id=\"looking-forward\"><span>Looking forward:</span></h3><p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/03/image-51.png\"><img title=\"image\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20720%20486'%3E%3C/svg%3E\" alt=\"image\" width=\"720\" height=\"486\" data-lazy-src=\"https://media.dcrainmaker.com/images/2021/03/image_thumb-51.png\"></a></p><p>One of the largely unmentioned quirks of COVID-19 on professional cycling is that there’s virtually no meaningful gear spy-shots type coverage of new devices. At present, there are boatloads of unannounced pre-release products in the pro peloton that nobody is getting coverage of, because nobody can get coverage of it. Sure, there’s TV shots as racers fly along at 50KPH, but that’s not when you get interesting coverage.</p><p>That coverage comes from having media folks <a href=\"https://www.dcrainmaker.com/2020/01/computers-worldtour-peloton.html\">pre-race closely inspecting bikes</a> on <a href=\"https://www.dcrainmaker.com/2016/04/paris-roubaix-2016-spectating.html#tech-items-of-note\">bike racks outside team buses</a>, or chatting it up with mechanics on the rest day. None of that exists today. For the most part, the pre-race zones at any major race is sealed and besides – most reporters can’t travel to the race anyways.</p><p>My point here is that while Wahoo has stated no pros are currently riding the system (and I mostly believe them), I think that 2021 will be a strong power meter announcement year for consumers. Virtually every brand is past or at their typical refresh cycle, from Favero to Garmin to Shimano to SRAM/PowerTap, and more. I’m gonna be spending a lot of time on my saddle with lots of head units on my handlebars.</p><p>Undoubtedly, if you’re only looking at Speedplay power meter pedals, then frankly, Wahoo will be your only option. They haven’t licensed anything yet to other players, so, the only company building a Speedplay pedal-based power meter will be Wahoo. Nonetheless, more competition is good – not just for pricing, but also for helping to mature the market even more in terms of product stability and features.</p><p>With that – thanks for reading!</p></div></div>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"c10126f6a0ec28b673e9d4bd62662be999f07e1e378cf2ec5d1d5f0fb523e9ad","category":"Cycling"}