{"title":"Real-world Supercross tracks have been influenced by the sport’s video game","link":"https://arstechnica.com/?p=1750679","date":1616103992000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>superangry? no, supercross —</h4><h2 itemprop=\"description\">Ars talks to the sport's senior director of operations to learn about the whoops.</h2></header><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-5-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-5.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-5-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-5-1440x960.jpg 2560\" data-sub-html=\"#caption-1750685\"><figure><figcaption id=\"caption-1750685\"><span></span><p>An average Supercross track uses 5,500 cubic feet (155 m<sup>3</sup>) of dirt, which is built into a track inside an existing stadium.</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-4-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-4.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-4-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-4-1440x960.jpg 2560\" data-sub-html=\"#caption-1750687\"><figure><figcaption id=\"caption-1750687\"><span></span><p>Each track will be different based on the particular nature of the stadium, plus the locally sourced dirt. This is a view of the layout used in Houston.</p><p><span></span> Monster Energy Supercross</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Indianapolis-1-2021-3-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Indianapolis-1-2021-3.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Indianapolis-1-2021-3-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Indianapolis-1-2021-3-1440x960.jpg 2560\" data-sub-html=\"#caption-1750688\"><figure><figcaption id=\"caption-1750688\"><span></span><p>This is the Indianapolis Supercross track.</p><p><span></span> Monster Energy Supercross</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-3-2021-1-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-3-2021-1.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-3-2021-1-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-3-2021-1-1440x960.jpg 2560\" data-sub-html=\"#caption-1750684\"><figure><figcaption id=\"caption-1750684\"><span></span><p>Supercross involves a lot more jumps than other forms of racing.</p><p><span></span> Monster Energy Supercross</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-2-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-2.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-2-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Houston-1-2021-2-1440x960.jpg 2560\" data-sub-html=\"#caption-1750686\"><figure><figcaption id=\"caption-1750686\"><span></span><p>A worker sprays down the newly built Supercross track.</p><p><span></span> Monster Energy Supercross</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Indianapolis-1-2021-5-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Indianapolis-1-2021-5.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Indianapolis-1-2021-5-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Indianapolis-1-2021-5-1440x960.jpg 2560\" data-sub-html=\"#caption-1750683\"><figure><figcaption id=\"caption-1750683\"><span></span><p>Ruts line the way up to a jump.</p><p><span></span> Monster Energy Supercross</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/HighresScreenshot00113-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/HighresScreenshot00113.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/HighresScreenshot00113-980x551.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/HighresScreenshot00113-1440x810.png 2560\" data-sub-html=\"#caption-1750682\"><figure><figcaption id=\"caption-1750682\"><span></span><p>A screenshot from <em>Monster Energy Supercross 4</em>, the official game for the sport.</p><p><span></span> Milestone</p></figcaption></figure></li></ul></div><p>When it comes to racing games, do you prefer digital replicas of real-world racetracks? Obviously, it depends on the game. Few will complain that <a href=\"https://arstechnica.com/tag/mario-kart/\"><em>Mario Kart</em></a>'s Rainbow Road is unrealistic as they shoot red shells at a gorilla on wheels, but a boring street circuit with too many 90-degree turns that only exists to show off a NYC skyline is another matter.</p><p>Done well, a made-up sequence of twists and turns can make a game; there's a reason we cheered so hard when we found out <a href=\"https://arstechnica.com/gaming/2020/06/grand-theft-auto-v-is-getting-expanded-and-enhanced-for-ps5-next-year/\">Trial Mountain will return with <em>Gran Turismo 7</em></a>. On the other hand, developers are <a href=\"https://arstechnica.com/gaming/2011/09/forza-4-interview-turn-10-talks-ugc-strain-and-hints-at-tracks/\">constantly asked</a> about <a href=\"https://arstechnica.com/gaming/2014/02/forza-motorsport-5-revisited-ars-talks-to-turn-10/\">adding real-world racetracks</a> to their <a href=\"https://arstechnica.com/gaming/2014/10/a-trip-to-turn-10-the-forza-studio-merging-car-culture-with-games/\">games</a>. And the presence of a decently digitized Spa or Nürburgring Nordschleife may well tempt a wavering gamer into a purchase.</p><p>It's the kind of thing I think about, which might just mean I'm a bit weird. But it also explains why I said \"yes\" when someone asked if I'd like to talk to Mike Muye, senior director of operations for Monster Energy Supercross, about this very topic. I agreed even though I don't really know much about Supercross, an evolution of motocross in which off-road motorcycles race each other on dirt tracks constructed specially for the occasion. (<em>Monster Energy Supercross 4</em> went on sale earlier this month for both Playstation and Xbox platforms, hence the offer of a chat.)</p><p>Muye's job means that he's intimately involved in the design and construction of the real tracks for actual Supercross races, and he works&nbsp;with the various sanctioning bodies to make sure everything is safe and up to spec. And as someone who games in his spare time, he's well-equipped to speak to the similarities or differences.</p><h2>That’s a lot of dirt</h2><p>Again, I know very little about Supercross, so I asked Muye to tell me more about how the sport builds the tracks for each event. After all, it must require some care to make sure the earthworks stand up to a day's racing.</p><p>\"A neat tidbit about Monster Energy Supercross and Feld Entertainment is that we own all the dirt used at our Supercross events,\" he told me. \"The dirt is both sourced and stored locally so we can reuse it for both Supercross and Monster Jam.\" For one thing, the cost of shipping tons and tons of dirt from city to city would be prohibitive. \"Another reason is that the dirt itself provides a unique obstacle as riders need to adjust their riding style and bike setups to the different types of soil used in each city,\" he said.</p><p>The particulars of each stadium on the calendar also affect track design. \"Some stadiums have natural grass fields, and it's easy to build the track right on top of it, while others have artificial turf and/or the technology to remove the field completely, which allows us to build the track on the foundational layer of concrete,\" Muye told me.</p><p>\"Each requires a slightly different technique to build, but the overarching process is to place a layer of sheet plastic across the entire field, then place one to two layers of heavy-duty plywood across the entire floor to protect the surface underneath,\" he said. \"After the plywood has been placed, we put a base layer of dirt across the field and pack it in as tightly as possible. This tightly packed base layer becomes the foundation on which the track is built. Oftentimes, the base layer is made of crushed asphalt grindings, which gives us a solid base to work from, which is especially important if we run into any weather challenges. On top of the foundational base, we then construct the actual track surface and jumps beginning with the outside lanes first and working towards the center of the stadium floor.\"</p><h2>The whoops are crucial</h2><p>But there are common elements to a good track, according to Muye. These include the start, bowl turns, long lanes, and something called the \"whoops.\"</p><p>Given the short nature of a Supercross race—20 minutes plus a lap for the more powerful 450cc bikes—making the most of the race start is essential. A 90-foot-wide starting gate for 22 racers funnels down to about 20 feet wide. \"That is why the first turn is so chaotic and should always be a sweeper type turn so the athletes don't bunch up on one another but instead have the opportunity to flow through the first turn and start racing each other. You would not want to have a tight 180-degree turn following the start as it would slow the racers down and create unnecessary havoc,\" Muye explained.</p><p>Bowl turns are also 180-degree bends, but unlike a hairpin, they have a large embankment which often means more than one racing line will work. And where there's more than one line, there's overtaking. \"Multiple bowl turns in a track layout have historically created great racing as they provide the athletes with an opportunity to block pass their competitors. Block passing is a maneuver where a rider comes up to another racer and takes a sharper angle into the turn, which allows him/her to subsequently block the other rider by taking away their line and momentum,\" he told Ars.</p><p>\"Whoops are often a separator between riders,\" Muye said, referring to the series of moguls or small hills that are also known as whoop-de-dos and often found immediately after a bowl turn. \"When done this way, it gives the rider the ability to leverage the bowl turn by banking off of it, which creates drive (speed) and allows the racer to get on top of the whoops and ideally skip across the top of them. If a block pass is performed by another racer right before this, it can be detrimental to the rider being passed, as they may not have the drive to get through the whoops section,\" he said.</p><p>Finally, there are the long lanes, which have the potential to ruin good racing if not laid out properly. \"Lanes with only two to three obstacles do not work well in Supercross, as they tend to become one-lined. One-lined tracks end up creating very boring racing, as the riders cannot pass one another. Our team always strives to create a minimum of five obstacles in a lane as it has proven to be the right formula over the years,\" Muye told me.</p><h2>In a game, no one gets hurt</h2><p>Maybe the biggest difference between designing a real Supercross track and one for a video game is that real people can get really hurt.</p><p>\"In the game, you can try anything, but in real life, you always must factor in safety for the athletes,\" Muye said. But the track editor in the Monster Energy Supercross games can give Muye and his colleagues some ideas. \"Users can create their own tracks, and it is fun to race those and imagine what they would be like in real life. Oftentimes, these 'game tracks' can be very inspiring for real life obstacles that keeps us on our creative toes to try and integrate into real Supercross track design,\" he explained.</p><p>As for our opening debate, Muye comes down in favor of games using real-world layouts. \"I prefer a replica track, as I like it to be authentic to the real-life experience,\" he said. \"It is fun for me to see how the professional riders raced the track and then attempt to duplicate it and try to gain speed in certain areas. I also prefer the controls of the game to be as realistic as possible. In Supercross racing, utilizing the clutch is a very key component to racing. A rider will fan the clutch on the motorcycle to keep the engine RPMs high when in a turn, then fully release the clutch to give a burst of power to the rear wheels to clear large obstacles. <em>Monster Energy Supercross 4</em> has done a great job of replicating this.\"</p><p><em>Listing image by <a href=\"https://www.supercrosslive.com/\">Monster Energy Supercross</a></em></p></div></div></div>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c351e1cba300aec93c5f1c0c980614ef7faf37626dfec27fa96d6985d164f958","category":"Tech"}