{"title":"App Store Supports Over 830,000 Jobs in UK, Germany, and France, Says Apple","link":"https://www.macrumors.com/2021/03/15/app-store-uk-jobs-2020-breakthrough-year/","date":1615798410000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/15/app-store-uk-jobs-2020-breakthrough-year/\"><p>Apple says its <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> now supports <a href=\"https://www.apple.com/uk/newsroom/2021/03/uk-ios-app-economy-has-a-breakthrough-year-grows-to-support-330000-jobs/\">more than 330,000 jobs in the U.K.</a>, a 10% increase over the past year, despite the pressures of the global health crisis on the nation's economy.</p><p><img alt=\"Apple UK iOS app economy has a breakthrough year 031421 big\" width=\"980\" height=\"727\" src=\"https://images.macrumors.com/t/MnfJI-sX51pemfWFxC2PN4816-4=/400x0/filters:quality(90)/article-new/2021/03/Apple_UK-iOS-app-economy-has-a-breakthrough-year_031421_big.jpg.large_.jpg?lossy\" data-src=\"https://images.macrumors.com/t/MnfJI-sX51pemfWFxC2PN4816-4=/400x0/filters:quality(90)/article-new/2021/03/Apple_UK-iOS-app-economy-has-a-breakthrough-year_031421_big.jpg.large_.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/MnfJI-sX51pemfWFxC2PN4816-4=/400x0/filters:quality(90)/article-new/2021/03/Apple_UK-iOS-app-economy-has-a-breakthrough-year_031421_big.jpg.large_.jpg?lossy 400w,https://images.macrumors.com/t/9RiQNFWP8hGsH4mnrVQlJo1oemk=/800x0/filters:quality(90)/article-new/2021/03/Apple_UK-iOS-app-economy-has-a-breakthrough-year_031421_big.jpg.large_.jpg?lossy 800w,https://images.macrumors.com/t/KhPYROdw_pXFUMrm7POq7gF1E0Y=/1600x0/filters:quality(90)/article-new/2021/03/Apple_UK-iOS-app-economy-has-a-breakthrough-year_031421_big.jpg.large_.jpg 1600w,https://images.macrumors.com/t/a-P9GvHaz4JG6UxGZdIDR11DnBE=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/Apple_UK-iOS-app-economy-has-a-breakthrough-year_031421_big.jpg.large_.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/MnfJI-sX51pemfWFxC2PN4816-4=/400x0/filters:quality(90)/article-new/2021/03/Apple_UK-iOS-app-economy-has-a-breakthrough-year_031421_big.jpg.large_.jpg?lossy 400w,https://images.macrumors.com/t/9RiQNFWP8hGsH4mnrVQlJo1oemk=/800x0/filters:quality(90)/article-new/2021/03/Apple_UK-iOS-app-economy-has-a-breakthrough-year_031421_big.jpg.large_.jpg?lossy 800w,https://images.macrumors.com/t/KhPYROdw_pXFUMrm7POq7gF1E0Y=/1600x0/filters:quality(90)/article-new/2021/03/Apple_UK-iOS-app-economy-has-a-breakthrough-year_031421_big.jpg.large_.jpg 1600w,https://images.macrumors.com/t/a-P9GvHaz4JG6UxGZdIDR11DnBE=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/Apple_UK-iOS-app-economy-has-a-breakthrough-year_031421_big.jpg.large_.jpg 2500w\"><br>According to Apple, 2020 was a \"breakthrough year\" for the iOS app economy, with developers in the U.K. generating more than £3.6 billion in total earnings, which represents 22% in growth compared to the previous year. The company says a similar trend was reflected in Europe, where the iOS app economy has grown to support 1.7 million jobs – a 7% percent increase since 2019. Apple published similar press releases in <a href=\"https://www.apple.com/de/newsroom/2021/03/germanys-ios-app-economy-supports-more-than-a-quarter-of-a-million-jobs/\">Germany</a> and <a href=\"https://www.apple.com/fr/newsroom/2021/03/frances-ios-app-economy-hits-milestone-supporting-over-a-quarter-million-jobs/\">France</a>, claiming that the ‌App Store‌ supports over a quarter of a million jobs in each of those two countries.</p><blockquote><p>Growth in the UK was driven by the innovations and breakthrough success of UK developers, whose apps users relied on for learning, working out, keeping track of their health, or finding ways to stay connected and entertained. During the pandemic, people turned to UK workout apps like One You Couch to 5K, fitness plan app Fiit, and sleep support app Sleepiest Sleep Sounds Stories. UK developer Moshi, a sleep and mindfulness app for children, has seen a rapid growth in downloads and subscriptions over the last year, leading to a 50 percent expansion of its team with 10 new hires.</p><p>\"In a year like no other, the UK has remained a vibrant a<br>and innovative hub for entrepreneurs and app developers,\" said Christopher Moser, senior director of the ‌App Store‌. \"More people in the UK than ever before are working as part of the iOS app ecosystem, creating exciting apps enjoyed by people all over the world.\"</p></blockquote><p>In its UK press release, Apple highlighted a few ‌App Store‌ success stories from U.K. developers in 2020. These include Digital Workroom, which develops productivity apps like Noted and aids businesses trying to create their own branded apps, the online language learning community Busuu, and Hutch Games – creator of free-to-play titles like the popular <em>F1 Manager</em>, <em>Top Drives</em>, and <em>Rebel Racing</em>.</p><p>Apple says that U.K. developers have benefitted from its ‌App Store‌ Small Business Program, which <a href=\"https://www.macrumors.com/2020/11/18/apple-drops-app-store-fees/\">launched</a> earlier this year and introduced a 15% reduced commission rates for developers who earned under $1 million in 2020. Apple takes 30 percent commission from developers making over one million dollars per year.</p><p>The Small Business Program has received praise from many developers, however some larger developers such as Spotify and <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> – both of which accuse Apple of anti-competitive behavior – have since <a href=\"https://www.macrumors.com/2020/11/18/app-store-fee-cut-criticized-by-major-developers/\">criticized</a> the program, saying it undermines the ‌‌App Store‌‌'s rules.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/12/iphone-13-touch-id-under-display/\">iPhone 13 Models Will 'Likely' Have Touch ID Under the Display</a></h3><p>iPhone 13 models slated for release later this year will \"likely\" feature a fingerprint scanner embedded under the display for authentication, in addition to Face ID, according to Barclays analyst Andrew Gardiner and three of his colleagues. In a research note shared with MacRumors today, the analysts added that iPhone 13 models will feature a smaller notch and that the LiDAR Scanner will...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/13/top-stories-apple-event-rumor-march-23/\">Top Stories: Apple Event Rumored for March 23, iMac Pro and HomePod Discontinued, and More</a></h3><p>Rumors about a potential Apple event are starting to heat up as we're getting close to the time of year when Apple frequently hosts an event, so stay tuned for more information on that front in the coming days and weeks. This week also saw Apple confirm it has discontinued both the iMac Pro and the original HomePod, while rumors are continuing to look forward to new Apple silicon MacBook Pro ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-discontinuing-homepod/\">Apple Discontinues Full-Sized HomePod to Focus on HomePod Mini</a></h3><p>Friday March 12, 2021 5:14 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple has discontinued the standard HomePod to focus exclusively on the HomePod mini, reports TechCrunch. First introduced four years ago, Apple's larger HomePod has never sold well because of its high price tag. Apple hoped that the HomePod's high-quality sound would give it an edge over competing products, but sales of the HomePod have always been lackluster with so many more affordable...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-silicon-mac-shipments-forecast/\">Next-Generation Apple Silicon MacBooks Expected to Drive Record-Breaking Mac Shipments This Year</a></h3><p>In a research note shared with MacRumors today, Barclays analysts said they expect Apple to report record Mac shipments in the 2021 fiscal year. Apple has seen strong demand for Macs driven by the COVID-19 pandemic and the release of Apple silicon Macs. With rumors indicating that Apple plans to release redesigned 14-inch and 16-inch MacBook Pro models with Apple silicon in the second half...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/airpods-3-redesign-new-images/\">Upcoming AirPods 3 Redesign Shown Off in New Images</a></h3><p>Friday March 12, 2021 11:55 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the AirPods 3 rumored to be launching as soon as this month, we've been seeing an increasing number of leaks showing off the design of the new earbuds. Renders were shared yesterday, and today, 52audio has published a series of images said to feature the third-generation AirPods. As with prior leaks, the AirPods 3 have an AirPods Pro-like design with a shorter stem and a more rounded...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/disney-magicband-support-iphone-apple-watch/\">Disney World MagicBand Support Coming to iPhone and Apple Watch</a></h3><p>Disney today announced MagicBand support for iPhone and Apple Watch in a service called \"Disney MagicMobile,\" which uses the Wallet app. Disney's MagicBand is a colorful wristband that guests can wear at Walt Disney World to enter the theme parks, unlock their hotel room, and buy food and merchandise. MagicMobile brings a contactless way to access many MagicBand features using only an...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-prototyped-jet-black-iphone-x/\">Apple Prototyped a Jet Black iPhone X</a></h3><p>Friday March 12, 2021 12:18 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of the iPhone 7 in 2016, Apple debuted a new \"Jet Black\" color, which was a glossy, shiny finish that was a departure from the standard brushed aluminum finishes of the iPhones that preceded it. Jet Black was unique because of how dark it was in comparison to other \"black\" and \"space gray\" finishes at the time. Apple hasn't used the same Jet Black finish for another phone to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/google-touts-chrome-89-memory-savings-mac/\">Google Touts Chrome 89 Memory Savings That 'Keep Your Mac Cooler' While Browsing</a></h3><p>Friday March 12, 2021 2:28 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Google's Chrome browser has been criticized for years for being a system resource hog, but Chromium developers are making some loud claims about how much smarter the latest version is at using and freeing up memory on macOS. According to a new post on Google's Chromium blog, Chrome developers recently managed to shrink the memory footprint of background tabs on Mac by up to 8%, or just over...</p></div></div></div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c36f782476ca3dcae17fe33e15146e23cfd99eac0733305c78fce6c6e97b2e2e","category":"Apple"}