{"title":"No pink and no ducks – EF’s new Giro swap-out kit","link":"https://cyclingtips.com/2021/05/no-pink-and-no-ducks-efs-new-giro-swap-out-kit/","date":1620313765000,"content":"<div><div><p>EF Education-Nippo and Rapha have today unveiled a new kit design the team will wear for the upcoming Giro d’Italia starting on Saturday. </p><p>The <a target=\"_blank\" href=\"https://cyclingtips.com/2021/01/rules-are-made-to-be-obeyed-ef-education-nippo-unveil-new-uci-compliant-kit/\">standard 2021 team kit</a> is a pretty fetching solid pink design claimed to be “the most compliant kit ever”. However, that large block of pink clashes with the Grio’s pink leader’s jersey, and so the team is required to change the jersey colour for the three-week jaunt around Italy.   </p><p>The 2020 Giro was postponed until October thanks to the Covid-19 pandemic, but EF Education ensured the wait was worth it when the team rocked up to the start in Palermo in a <a target=\"_blank\" href=\"https://cyclingtips.com/2020/10/check-out-efs-wild-palace-kit-for-the-giro-ditalia/\">new kit designed</a> in collaboration with skate brand Palace.</p><p>While the official reasoning for that kit change was to avoid that clash with the Giro’s race leaders pink jersey, the result was an opinion dividing design featuring ducks, a hefty UCI fine, and an unprecedented clamour among fans for the limited edition jersey.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Ef-Education-Nippo-Giro-2021-Euphoria-Kit-4-1340x754.jpg\"><figcaption>This is not the first time a team has had to change its jersey for a grand tour, but where other teams have simply changed the colour, EF is not one to follow tradition</figcaption></figure><p>Fast forward to 2021, and the rules on the clash of pink jerseys have not gone away, so EF is at it again with another limited edition jersey. As you might expect, though, this is not just a simple colour change. </p><p>Like the <a target=\"_blank\" href=\"https://cyclingtips.com/2021/04/compliance-for-the-masses-ef-educations-2021-kit-goes-on-sale/\">regular 2021 kit</a> the designers at Rapha have taken the rules quite literally in designing a jersey that is said to include “every colour but one”. Rapha has not elaborated on which colour, but one would assume the colour to drop is pink. However, pink does still feature on the jersey, so we are awaiting clarification on this.  </p><p>With this new, mainly black kit featuring blocks of colour, EF should avoid clashing with anyone, except perhaps the UCI. Rapha is calling this new design its “Euphoria collection” and describes it as “a kaleidoscopic creation, designed to celebrate people from different backgrounds and nations coming together in pursuit of a common goal.”</p><p>EF’s duck inspired Palace kit backfired (read: went entirely to plan) last year when the UCI fined the team for breaching UCI regulation 1.12.007/1.4, which relates to “Non-compliant clothing during podium obligations”. </p><p>Time will tell if the team has followed the exact protocol for introducing a jersey design change this year or if the American squad will face a similar fine.</p><p>The four days of Dunkerque, which is actually six days long, also has a pink leaders jersey, but with the event cancelled for 2021, we will have to wait until 2022 to see any EF Education – Nippo limited edition swap out kit for the French race.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Ef-Education-Nippo-Giro-2021-Euphoria-Kit-1-1340x754.jpg\"><figcaption>It appears the riders also get matching Whoop sleep monitors</figcaption></figure><p>The EF riders at the Giro will also have a new skinsuit to go with the new design. Rapha has created what it claims is its fastest ever TT aero suit. Despite taking two years to develop, including wind tunnel testing for over 40 skinsuits, and a claimed 12.4 watts saving at 55kph, and 1° yaw angle, the new suit is not available to the public, team issue only here. </p><p>The Euphoria collection will be available at <a target=\"_blank\" href=\"https://www.rapha.cc/gb/en/\">Rapha.cc</a> from the end of May, but if last years Palace kit is anything to go by, stocks will be limited, demand will be high, and the kit will quickly appear on Ebay at exorbitant prices.</p><p>Let us know your thoughts on this swap out kit. Do you love it? Hate it? Or feel Rapha has peaked too soon, and nothing will ever compare to the ducks?</p><figure><ul><div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Ef-Education-Nippo-Giro-2021-Euphoria-Kit-5-1340x754.jpg\"><figcaption>Matching Cannondales for the new kit</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Ef-Education-Nippo-Giro-2021-Euphoria-Kit-2-1340x754.jpg\"><figcaption>Each of the sponsors logos appear to get a colour all to themselves</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/Ef-Education-Nippo-Giro-2021-Euphoria-Kit-6-1340x754.jpg\"><figcaption>No kit would be complete without matching shorts</figcaption></figure></li></div></div></ul></figure></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c3c28fc27e0ad10078829a14e61261939d451c97fc95ef178caddc3990810589","category":"Cycling"}