{"title":"Tech gallery: 2021 Sea Otter Classic, day five","link":"https://cyclingtips.com/2021/10/tech-gallery-2021-sea-otter-classic-day-five/","date":1634115960000,"content":"<div><div><p>Alright, it’s time to wrap up our coverage from the 2021 Sea Otter Classic, and it’s all about parts and accessories this time around.</p><p>Just in time for the northern hemisphere to transition into the shorter days of autumn and winter, Niterider showed off its latest Lumina Max headlights with up to 2,500 lumens of brightness to stretch those rides that little bit longer. Bar Fly — the originators of the out-front computer mount — showed off a whole bunch of new computer mounts that also move the company into die-cast aluminum instead of just injection molded plastic and machining. </p><p>Looking for a lower-priced torque wrench? Park Tool has brought back its beam-style wrenches, and also teased an intriguing new development for its bottom bracket tools. And if you’re one of those riders who won’t let a little rain (and maybe snow?) get in the way of your next trail ride, you’ll want to check out POC’s new weatherproof overalls — yes, overalls!</p><p>There are a bunch of other tidbits to share in this gallery, too, but you’ll have to keep scrolling down to see them all. See you again in six months, Sea Otter!</p><hr><figure><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Rudy-Project-Deltabeat-1-1340x754.jpg\"><figcaption>Rudy Project’s new Deltabeat sunglasses offer extra-tall coverage in a two-lens format, along with a distinctly Euro look. Photo: Trevor Lyden.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Rudy-Project-Deltabeat-2-1340x754.jpg\"><figcaption>Rudy Project is offering the Deltabeat in a wide range of colors (as usual), but this black-and-silver setup looks pretty classy. Photo: Trevor Lyden.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Rudy-Project-Deltabeat-3-1340x754.jpg\"><figcaption>Lenses are interchangeable, and the nosepiece is bendable for a tunable fit. Rudy Project also says the frame is made of a “bio-based polyamide”, which at least suggests it’s more sustainable than oil-based plastics. Photo: Trevor Lyden.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Ergon-SR-Allroad-saddle-1-1340x754.jpg\"><figcaption>Ergon’s new SR Allroad Core saddles feature an extra layer of “Infinergy” foam, similar to what’s found in high-end running shoes. According to Ergon, the special foam adds a lot of comfort and vibration damping without a lot of extra thickness or weight. Even with chromoly rails and in the larger of the two available sizes, the actual weight is a modest 268 g. Retail price is US$130 / €130.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Kenda-gravel-tires-1-1340x754.jpg\"><figcaption>Kenda isn’t often the first brand name people think of when it comes to gravel tires, but the company actually has a pretty decent array of tread options and sizes.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Niterider-Lumina-1-1340x754.jpg\"><figcaption>Niterider’s revised headlight bodies now use a more intuitive dual-button format for changing power settings.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Niterider-Lumina-2-1340x754.jpg\"><figcaption>New from Niterider (and yes, it was dusty at Sea Otter!) is the new Lumina Max series, with up to 2,500 lumens of light on tap from the compact all-in-one format. Claimed run time on the highest setting is just 30 minutes, but even Niterider says it’s not really designed to be operated at full blast all the time. The second-highest setting still churns out 900 lumens with a claimed run time of 1:30. Retail price is US$250.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Niterider-Lumina-3-1340x754.jpg\"><figcaption>See that little symbol below the buttons? The headlight can be wirelessly paired to a taillight so that you can turn on both with a single button press. It’s not something Niterider invented, but it’s a neat feature nonetheless.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Bar-Fly-computer-mounts-1-1340x754.jpg\"><figcaption>Bar Fly has beefed up its direct-mount computer mounts with a new die-cast aluminum body instead of the old machined ones. According to Bar Fly, this now makes the new Prime Direct 1 compatible with heavier cameras and lights in addition to the usual GPS computers, while the dual-position interface provides for more positioning options, too.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Bar-Fly-computer-mounts-2-1340x754.jpg\"><figcaption>Got a 3T Apto stem? Bar Fly has the new Flipper computer mount with an angle-adjustable base, interchangeable inserts, and camera/light compatibility for US$80.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Bar-Fly-computer-mounts-3-1340x754.jpg\"><figcaption>One of the keys to boosting the weight capacity of Bar Fly’s direct-mount Prime Direct 1 computer mount was switching from aluminum to brass for the sled nut.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Bar-Fly-computer-mounts-4-1340x754.jpg\"><figcaption>Bar Fly’s new MTB computer mount is features a die-cast hinged aluminum body. The mounting clamp also moved to the left side of the bar in case you’re running a Shimano Di2 or STEPS system. There’s also an extension underneath for a camera or light. Retail price is US$60.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Aftershokz-headphones-1-1340x754.jpg\"><figcaption>The Aftershokz Aeropex headphones use bone conduction technology to pipe music straight into your inner ear, leaving standard channels open for things like traffic and trail noise. I haven’t tried this latest model, but sound quality on other Aftershokz headphones I’ve used in the past has actually been pretty good. Wind noise is still an issue, though. Claimed run time is eight hours, and retail price is US$160.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Park-Tool-BB-tools-1-1340x754.jpg\"><figcaption>Park Tool’s new bottom bracket tools look awfully nice with their knurled edges and machined aluminum construction, but what’s really intriguing is the threaded fitting in the middle. Park Tool wouldn’t say explicitly what they’re for, but it seems the company is about to debut a way to securely hold the tools on to the bottom bracket cups to prevent slipping.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Park-Tool-TW-2.2-1-1340x754.jpg\"><figcaption>They’re back! Park Tool has resurrected its beam-type torque wrenches for home mechanics that want a simpler and less expensive way to properly tighten various hardware.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Park-Tool-TW-2.2-2-1340x754.jpg\"><figcaption>The beam-type torque wrench format is easy to read and doesn’t require calibration.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Park-Tool-spoke-holder-1-1340x754.jpg\"><figcaption>The new Park Tool CSH-1 provides an easy way to hold on to spokes so they don’t rotate when you turn the nipple.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Park-Tool-MTB-5-1-1340x754.jpg\"><figcaption>The Park Tool MTB-5 multi-tool offers an inexpensive way to have all the essential tools on hand for your next mountain bike ride.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/POC-overalls-1-1340x754.jpg\"><figcaption>POC’s new “Consort MTB Dungarees” are essentially fancy weatherproof overalls. They’re outrageously expensive at US$500, but they also look to be supremely protective if the conditions are truly ugly. And, truth be told, POC really seems to have nailed the styling.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/POC-overalls-2-1340x754.jpg\"><figcaption>Big vents, big pockets.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/POC-overalls-3-1340x754.jpg\"><figcaption>May as well put a pocket up here, too, right?</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/POC-overalls-4-1340x754.jpg\"><figcaption>A cinch strap keeps things snug over your butt and around your waist.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Saris-thru-axle-adapter-1-1340x754.jpg\"><figcaption>This ingenious thru-axle fork mount from Saris accommodates virtually every standard on the market. If you need to switch things up, just loosen up a couple of nuts (or bolts, depending on your particular setup), rotate the block to wherever it needs to go, and you’re all set.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Stompump-1-1340x754.jpg\"><figcaption>Foot-operated tire pumps are hardly a new idea, but this Stompump pump is certainly the nicest take on the concept I’ve seen.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Stompump-2-1340x754.jpg\"><figcaption>The machined aluminum construction is lightweight and compact, and it’s certainly easier to use than a hand-operated mini-pump. Maximum pressure is 60 psi, making it better suited to mountain bikes or gravel bikes than road applications. Retail price is US$70.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Vittoria-Syerra-1-1340x754.jpg\"><figcaption>Vittoria’s new Syerra is a “downcountry” mountain bike tire designed to be burlier than a true XC model, but faster-rolling and lighter than a trail/enduro one. Center knob heights are lower than the brand’s meatier Mazza and Martello, but the shoulder tread isn’t all that dramatically different. Vittoria builds these with a middle-of-the-road single-ply 60 TPI nylon casing and graphene-enhanced four-compound tread rubber. Claimed weight for the single 29×2.4″ size is 830 g.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WTB-Vigilante-2.5-tire-2-1340x754.jpg\"><figcaption>The original Vigilante 2.5 was already pretty squared-off, but it became even more so as rim widths ballooned in recent years. This profile looks much more amenable.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WTB-Vigilante-2.5-tire-1-1340x754.jpg\"><figcaption>WTB has redesigned its Vigilante mountain bike tire with a slightly more rounded profile and more heavily reinforced shoulder knobs for more predictable cornering.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WTB-Verdict-2.5-tire-3-1340x754.jpg\"><figcaption>WTB’s latest SG2 layer adds bead-to-bead puncture protection without totally killing the weight or rolling characteristics of the tire.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Maxxis-Minion-DHF-anniversary-tire-1-1340x754.jpg\"><figcaption>It’s true; the Maxxis Minion DH F really has been around for twenty years! That makes me feel old, but it’s also a testament to how well this tire still works after all this time. It’s perhaps not the absolute best in any particular category, but it’s almost never the wrong choice.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Evoc-Hydro-Pro-vest-1-1340x754.jpg\"><figcaption>Looking to go a little more minimal for your next epic ride? Evoc’s new Hydro Pro vest offers plenty of storage for fluids and food, but in a very lightweight package.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Evoc-Hydro-Pro-vest-2-1340x754.jpg\"><figcaption>Evoc is offering the Hydro Pro vest in 1.5 L and 3 L sizes (total capacity), with prices ranging from US$115-125 / €100-110.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Fix-Eflator-1-1340x754.jpg\"><figcaption>Battery-operated tire pumps are suddenly becoming quite popular. The Fix Eflator has a digital gauge and will automatically shut off once the target pressure is achieved.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Handlebar-Jack-1-1340x754.jpg\"><figcaption>Sea Otter is always good for off-the-beaten-path products, and the Handlebar Jack definitely falls into that category. It’s essentially a pair of handlebar-mounted tripods that allows your bike to stably rest upside-down for basic repairs.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Handlebar-Jack-2-1340x754.jpg\"><figcaption>The two Handlebar Jack tripods next within each other for a compact package that’s intended to be portable. Retail price is US$30.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/Enduro-Bites-recovery-protein-1-1340x754.jpg\"><figcaption>Enduro Bites recently added a recovery mix to its catalog of energy bars and supplements. It’s pea-based, so it shouldn’t be a problem for anyone who’s lactose-intolerant or vegetarian.</figcaption></figure></li></ul></figure><div><p>Looking for more coverage from the 2021 Sea Otter Classic? Click <a href=\"https://cyclingtips.com/tag/2021-sea-otter-classic/\" target=\"_blank\">here</a> for the full collection.</p></div></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c3e8e614ccea5e22dcf0e281678165509d74cbaba89827bb8024c8d3415db520","category":"Cycling"}