{"title":"One-K unveils a 930-gram disc brake wheelset","link":"https://cyclingtips.com/2021/09/one-k-unveils-a-930-gram-disc-brake-wheelset/","date":1630983740000,"content":"<div><div><p>In years past <a target=\"_blank\" href=\"https://cyclingtips.com/tag/eurobike\">Eurobike</a> was a hotbed for finding new tech from long-standing brands and startup companies alike. Those startups often had the most exciting tech, with Eurobike offering the first opportunity for inventors to introduce their creations to the cycling world. While new road tech was thin on the ground at this year’s Eurobike, one new set of wheels caught the attention of both <a target=\"_blank\" href=\"https://cyclingtips.com/2021/09/video-eurobike-day-two-top-trumps/\">myself and Dave Everett</a>. </p><p>The 930-gram claimed weight for a disc brake road wheelset was enough to catch our eye, but the spoke construction and hub design on the One-K wheels is even more interesting. One-K is using wet filament winding to construct the composite spokes that are key in achieving the wheels’ low weight.  </p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-930g-wheels-5-1340x754.jpg\"><figcaption>One-K uses a one-piece, continuous fibre composite spoke plate manufactured using a wet filament winding process and with six spokes on each plate.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-wheels-11-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-wheels-4-1340x754.jpg\"><figcaption>That centre piece slots onto anchors in the specifically designed hub.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-wheels-6-1340x754.jpg\"><figcaption>A loop on the end of each spoke attaches to a titanium nipple.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-930g-wheelset-14-1340x730.jpg\"><figcaption>This 25 mm rim wheelset weighs in at a claimed 930 g.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-wheels-9-1340x754.jpg\"><figcaption>Eye-catching weight.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-wheels-10-1340x754.jpg\"><figcaption>The titanium nipple threads onto a bolt inside the rim.</figcaption></figure></li></ul></div></figure><p>The composite spokes are anything but standard. The 24 spokes in each wheel are actually just two plates of one-piece, continuous fibre spokes on each side of the wheel. Each plate contains six spokes in a series of triangles that meet in the centre to create a star-like shape. One-K claims this design is 60% lighter than premium steel spokes and reduces a wheelset weight by 20%. </p><p>One-K offsets two plates of spokes on each side of the hub to create a 24-spoke wheel. Each spoke weighs in at 2.2 g, including the proprietary mounting system, with the plate of six spokes weighing just 6 g (minus the mounting system). A loop at the end of each spoke attaches to a titanium nipple. One-K claims this spoke design creates a wheel with high stiffness and responsiveness with spokes highly resistant to impact despite the incredibly low weight.</p><p>One-K worked with a fellow German brand, Nonplus Components, to create a hub compatible with this new spoke design. Nonplus offers a range of more standard hub designs and created a new flange design for its hubs to work specifically with the One-K design. The hub features six protrusions or knobs on the flange, which anchor the two spoke plates. The centre of the spoke plates anchor against the knobs and lock into position when the spokes are in tension. </p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-wheels-2-1340x754.jpg\"><figcaption>Fellow German brand Nonplus Components provides the hub with a specifically designed flange to anchor the One-K spoke design.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-wheels-1-1340x754.jpg\"></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-930g-wheelset-8-1340x754.jpg\"><figcaption>The hub features One-K’s spoke anchors, and a drive mechanism with some lofty claims.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/One-K-930g-wheelset-5-1340x754.jpg\"></figure></li></ul></div></figure><p>The hubs feature Nonplus’s unique freewheel system with a claimed 400% greater contact surface than a conventional ratchet system. This increased contact area is said to provide improved power transfer and reduced wear. Nonplus use a conical shaped mechanism to maintain engagement even under axle flex, combined with a 1:1 tooth count with 45 defined locking positions to achieve this increased contact area and improved power transfer. Nonplus says its “special, very elaborately manufactured tooth backs, reduce the abrasion many times over”, with a hard anodizing to increase durability.</p><p>The Nonplus hubs even feature a “ventilation system”, said to prevent negative pressure due to temperature fluctuations in the hub. Nonplus claims this prevents water suck into the bearings, thereby increasing durability. The hubs certainly score highly in attention to detail, with Nonplus claiming the hubs offer “the elimination of disruptive factors such as flex, vacuum effect, spoke tears and tolerances, through the highest precision in material selection, manufacturing process, and quality assurance”</p><p>The astounding 930 g claimed weight is with a 25 mm rim, but One-K will also offer deeper rim profiles. Naturally, this will increase the weight. One-K uses a standard rim with no alterations for its new spoke design. In fact, providing the rim has a matching spoke hole profile, One-K claims its hub and spoke system is compatible with any rim from any manufacturer. </p><p>The One-K wheel system is currently in the final stages of development – the wheel on display at Eurobike is a prototype. This particular wheel was completely untensioned and as such unrideable, suggesting One-K still has a way to go with its wheel design. Despite that, the company is planning for a spring 2022 launch of its innovative wheel design.</p><p>The company currently has a landing page at <a target=\"_blank\" href=\"https://www.one-k-wheels.com/\">One-K-Wheels.com</a> where those interested in the wheels can register for updates. </p></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c478223900d6942d361cfd4da5e03fff29902c17d0fb8dedcacea38e4d99d21b","category":"Cycling"}