{"title":"Lorena Wiebes and Team DSM dominate at the Ronde van Drenthe","link":"https://cyclingtips.com/2021/10/lorena-wiebes-and-team-dsm-dominate-at-the-ronde-van-drenthe/","date":1634999228000,"content":"<div><div><p>Lorena Wiebes (Team DSM) took victory in the last Women’s WorldTour race of the season, winning from a small group after a long and aggressive race.</p><p>The re-scheduled Ronde van Drenthe covered 159.1 km from Assen to Hoogeveen. The mostly pan-flat terrain of the northern Netherlands was punctuated by a few cobbled sectors and four ascents of the VAM-berg, the last coming 15 km before the flat finish.</p><p>The early break of Lieke Nooijen (Parkhotel Valkenberg) and Janneke Ensing (BikeExchange) – the latter racing on home roads for the <a href=\"https://twitter.com/JannekeEnsing/status/1451167931149295622?s=20\">last time before retirement</a> – led the field over the cobbled sectors in the first half of the race before being brought back at around the halfway mark.</p><p>Attackers Kirstie van Haaften (Parkhotel Valkenberg) and Margaux Vigie (Valcar-Travel &amp; Service) carried a small lead onto the first ascent of the VAM-berg, but the pair were neutralised by the top of the climb as the race began to heat up.</p><p>Attacks persisted in the last 60 km as the non-sprinters and smaller teams attempted to avoid the traditional bunch sprint. The British pairing of newly crowned national champion Pfeiffer Georgi (Team DSM) and Alice Barnes (Canyon-SRAM) established a 25-second gap on the way to the second VAM-berg circuit. Their advantage yo-yoed ahead of the strung out peloton until they reached the foot of the infamous man-made climb for the final ascent.</p><p>A trio of attackers – Elena Cecchini (SD Worx), Elise Chabbey (Canyon-SRAM) and Floortje Mackaij (Team DSM) – earned a gap over the last climb and they were joined for the last 10 km by a dangerous four-rider chase group that was stacked with Team DSM riders, including Wiebes.</p><p>The DSM riders drove the pace into the closing kilometres, keeping what was left of the peloton at bay and perfectly setting up their sprinter. Wiebes won with a few bike lengths to spare, with Cecchini in second and Eleanora Gasparrini (Valcar-Travel &amp; Service) crossing the line in third.</p><div><div><p>UCI Women's WorldTour Ronde van Drenthe (1.WWT) <span>Assen → Hoogeveen</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/ff/lorena-wiebes-2021.jpeg\"></p></div></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c48e8599829c131e6dbc307e86d50a2026f16d1f8f31ca53d81b39b760cd131a","category":"Cycling"}