{"title":"Nvidia wants to buy CPU designer Arm—Qualcomm is not happy about it","link":"https://arstechnica.com/?p=1742010","date":1613168763000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>strong-arm tactics —</h4><h2 itemprop=\"description\">The proposed deal creates a nest of potential conflicts of interest.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/toxic-nvidia-logo-800x450.jpg\" alt=\"Some current Arm licensees view the proposed acquisition as highly toxic.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/toxic-nvidia-logo.jpg\" data-height=\"563\" data-width=\"1000\">Enlarge</a> <span>/</span> Some current Arm licensees view the proposed acquisition as highly toxic.</p><p>Aurich Lawson / Nvidia</p></figcaption></figure><p>In September 2020, Nvidia <a href=\"https://arstechnica.com/gadgets/2020/09/after-40-billion-deal-nvidia-says-arm-will-keep-a-neutral-business-model/\">announced</a>&nbsp;its intention to buy Arm, the&nbsp;<a href=\"https://www.arm.com/products/silicon-ip-cpu\">license holder</a>&nbsp;for the CPU technology that powers the vast majority of mobile and high-powered embedded systems around the world.</p><p>Nvidia's proposed deal would acquire Arm from Japanese conglomerate <a href=\"https://en.wikipedia.org/wiki/SoftBank_Group\">SoftBank</a>&nbsp;for $40 billion—a number which is difficult to put into perspective. Forty billion dollars would represent one of the largest tech acquisitions of all time, but <a href=\"https://arstechnica.com/gadgets/2012/04/facebook-buying-instagram-for-1-billion/\">40 Instagrams</a> or so doesn't seem like that much to pay for control of the architecture supporting every well-known smartphone in the world, plus a staggering array of embedded controllers, network routers, automobiles, and other devices.</p><h2>Today’s Arm doesn’t sell hardware</h2><p>Arm's business model is fairly unusual in the hardware space, particularly from a consumer or small business perspective. Arm's customers—including hardware giants such as Apple, Qualcomm, and Samsung—aren't buying CPUs the way you'd buy an Intel Xeon or AMD Ryzen. Instead, they're purchasing the license to design and/or manufacture CPUs based on Arm's intellectual property. This typically means selecting one or more reference core designs, putting several of them in one system on chip (SoC), and tying them all together with the necessary cache and other peripherals.</p><p>Arm has multiple licensing models for differently sized customers, with various amounts of permission (or lack of permission) to innovate upon their original reference designs. How much it costs to buy one of those licenses—up front or per manufactured device—is a confidential question we've asked many vendors, with no hard answers.</p><h2>What does buying Arm get you, exactly?</h2><p>If Nvidia acquires Arm, the first and most obvious benefit is the design company's licensing revenue stream—and it wouldn't need to pay IP licensing fees itself. This, however, is probably the least important facet of the deal.</p><p>Owning Arm outright would also allow Nvidia much greater leeway to innovate upon the design. We've spoken to several vendors who described the sort of innovation that the RISC-V architecture allows as effectively impossible with Arm; the vendors have said \"they just won't let you\" make changes, like adjustments to the instruction set.</p><p>If Nvidia owns Arm, it will no longer face such restrictions. This could make it easier for the GPU manufacturer to innovate on the CPU side and free it from the necessary alliance it has had with Intel in the manufacture of world-leading supercomputers... which likely looks increasingly important, since Intel is encroaching deeper and deeper into Nvidia's territory with its <a href=\"https://arstechnica.com/gadgets/2020/08/intel-is-getting-serious-about-xe-gpus-laptop-desktop-and-datacenter/\">Xe GPUs</a> and its&nbsp;<a href=\"https://arstechnica.com/gadgets/2019/11/intels-oneapi-aims-to-unify-ai-code-efforts-across-disparate-hardware/\">oneAPI</a> initiative, which aims to decouple GPU-based machine from the underlying GPU hardware.</p><p>So far, so good—and in fact, Nvidia describes its acquisition in just such terms, referring to it as \"creating [the] world's premier computing company for the age of AI.\" But it also potentially offers Nvidia leverage over the entire mobile computing industry, which is currently wedded to the Arm instruction set architecture (ISA).</p><h2>Objections abound</h2><p>There's no specific reason to think that Nvidia wants to get into the smartphone market—but if it did, Arm ownership would potentially allow it to innovate with its own designs in ways that Qualcomm and other manufacturers who are subject to strict licensing requirements could not. The company might also choose to outright block companies from access to Arm licenses—either on its own recognizance or as the result of pressure from the US government.</p><p><a href=\"https://www.cnbc.com/2021/02/12/qualcomm-objects-to-nvidias-40-billion-arm-acquisition.html\">According</a> to CNBC, Qualcomm is one of many Arm licensees who continues to object to the acquisition. Although Qualcomm has so far refused to comment publicly, CNBC's sources say it believes Nvidia cannot complete the acquisition without \"crossing certain lines that people are worried about\"—most likely, the anti-competitive lines we discussed above.</p><p>Tech investors Nathan Benaich and Ian Hogarth clearly agree; their 2020 \"State of AI\" <a href=\"https://docs.google.com/presentation/d/1ZUimafgXCBSLsgbacd6-a-dqO7yLyzIl1ZJbiCBUUT4/\">report</a>&nbsp;cites founding Arm investor <a href=\"https://en.wikipedia.org/wiki/Hermann_Hauser\">Hermann Hauser</a>&nbsp;describing the acquisition as leading to significant job losses and adding the company to the USA's \"trade arsenal\"—making it possible for the US government to block specific companies from access to Arm designs. The UK's Labour Party also has strong reservations and has urged the UK government to <a href=\"https://www.theguardian.com/business/2020/sep/10/labour-calls-for-uk-jobs-guarantee-in-potential-arm-sale-to-nvidia\">intervene</a>.</p><p>Chinese tech firms such as Huawei object to the deal for the same reasons—not unreasonably, having already been subjected to <a href=\"https://arstechnica.com/gadgets/2018/04/googles-us-android-go-launch-derailed-by-zte-ban/\">several</a> heavy-handed <a href=\"https://arstechnica.com/tech-policy/2019/05/trump-tries-to-shut-huawei-out-of-us-market-with-executive-order/\">efforts</a>&nbsp;to block it and other Chinese firms from the use of what the Trump administration saw as \"US technology.\"</p></div></div>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c4afc80cdd9f80926bdb808468f5360121d009b45188239e4da3983a7a817ba9","category":"Tech"}