{"title":"Tech Tidbits: Garmin GPS Offsets Again and PowerTap Units Discontinued","link":"https://www.dcrainmaker.com/2021/02/tech-tidbits-garmin-gps-offsets-again-and-powertap-units-discontinued.html","date":1612987448000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>As we round out Wednesday, there’s a few tidbits of news that are definitely worth mentioning – especially this first one as a heads up for Garmin users to ensure you don’t get any wonky GPS tracks over the next day or so. Plus, a notable discontinuation of a power meter product set…at least for now.</p><h3 data-test=\"1/2\" id=\"garmin-gps-offsets-show-up-again\"><span>Garmin GPS Offsets Show up Again:</span></h3><p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/GPSOffsets.png\"><img width=\"722\" height=\"487\" title=\"GPSOffsets\" alt=\"GPSOffsets\" src=\"https://media.dcrainmaker.com/images/2021/02/GPSOffsets_thumb.png\" data-ll-status=\"loaded\"></a></p><p>This morning readers started contacting me about GPS offsets for their Garmin devices, specifically the Sony GPS chipset based ones (e.g. Forerunner 45/245/945, Fenix 6, and a host of other newer units), showing the dreaded GPS offsets that <a href=\"https://www.dcrainmaker.com/2021/01/gps-accuracy-impacting-devices.html\">we saw across numerous watch makers back the first week of January</a>. You’ll remember that’s when GPS tracks were offset by sometimes hundreds of meters (or more) to one side or the other – as if they were shifted entirely. The problem ended up being a bad satellite cache file from Sony, which was then propagated down to GPS watches from Garmin, Suunto, Polar, Wahoo, and others. It was compounded by an unrelated so-called Week 52 bug, and then the whole thing was sent into the inferno over a holiday weekend.</p><p>In any case, comments started coming in this morning with folks reporting the same. I actually had a number of tests on Garmin watches this morning, but didn’t see the issue myself. Like before, this was/is more of a specific file retrieval timing issue – hence why it’s not as bad as previous.</p><p>I checked with Garmin, and they confirmed the issue has popped up again, saying (bolding mine):</p><blockquote><p>“We are aware of the issue and <strong>already have the fix</strong> <strong>implemented </strong>(new file on server). Users should see <strong>this problem resolve on its own</strong> (no action necessary) <strong>within the next 24 hours</strong>.&nbsp; Until the new file gets downloaded, u<strong>sers can wait a little longer (~5 minutes) when acquiring satellites to get a better fix</strong>.&nbsp; We regret any inconvenience this has caused for our customers, and we are actively working on the changes necessary to eliminate this from happening again in the future.”</p></blockquote><p>In checking back again with them, there’s no way to know whether or not your device has a good file or a bad file. Unlike back in January when you could roughly figure it out by the CPE status, they said this time that’ll stay the same either way. Thus, your best bet is simply to stick that watch in the window or on your doorstep and turning on GPS before heading out into the cold. Or, if you live in Australia, then simply enjoy an extra five minutes of sun. Your watch will automatically grab the correct file behind the scenes via it’s near-constant Bluetooth sync with the phone, or, syncs via WiFi or USB when it connects.</p><p>Again – like before, this is largely solved by letting the watch maintain an active GPS connection for a period of time, where it then updates the cache information it has about the satellites. You can easily do this by just sticking your watch outside and letting it record a 15-20 minute workout of nothingness. Then delete it afterwards.</p><p>I don’t know at this point whether or not this impacts other vendors that use the Sony chipset (Garmin did confirm this only impacts the Sony chipset watches). Like with January, due to the pure numbers of Garmin devices out there compared to Polar/Suunto/Wahoo (roughly in the 40-50:1 range these days), it’ll take a bit longer for those other complaints to pop up (if at all). I didn’t see the issue on my Polar Grit X this morning (just as I didn’t see it on my Garmin watches).</p><h3 data-test=\"2/2\" id=\"powertap-hub-pedals-discontinued\"><span>PowerTap Hub &amp; Pedals Discontinued:</span></h3><p><img width=\"720\" height=\"480\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20720%20480'%3E%3C/svg%3E\" data-lazy-src=\"https://media.dcrainmaker.com/images/2019/03/DSC_4743.jpg\"></p><p>Last week a DCR reader brought to my attention that the SRAM/Quarq website had quietly stopped selling PowerTap hubs and pedals. These would be the PowerTap G3 series wheel hubs, and <a href=\"https://www.dcrainmaker.com/2019/03/powertap-pedals-review.html\">PowerTap P2 Pedals</a>. You’ll remember that <a href=\"https://www.dcrainmaker.com/2019/04/sram-acquires-powertap-what-it-means-for-both-brands-and-consumers.html\">SRAM/Quarq acquired the PowerTap brand from Saris</a> almost two years ago, but planned to continue to sell the hubs and pedal lineups. And indeed, they did continue to both manufacturer and sell them, as well as of course support them. They selected not to continue the <a href=\"https://www.dcrainmaker.com/2015/12/powertap-chainring-review.html\">C1 chainring lineup</a>, since that sold relatively poorly (even before the acquisition).</p><p>I checked with Quarq (under SRAM, where the acquisition took place) about this, and sure enough they have indeed discontinued selling of the G3 line and P2 pedal line. They will however continue to fulfill existing orders placed prior to shutting off the order spout, as well as continue to support all existing G3 &amp; P2 customers (just as they’ve been doing for the last nearly two years).</p><p>In fact, you may remember a year ago when <a href=\"https://www.dcrainmaker.com/2020/03/sram-axs-website-finally-exits-beta-but-what-is-it.html\">SRAM updated their AXS app</a> to actually support the existing PowerTap products for things like calibration and firmware updates. In fact, I still use my PowerTap P1 and P2 pedal sets nearly daily on two different indoor bikes for accuracy testing.</p><p>In checking with Quarq’s co-founder James Meyer he noted that while they could have continued to make minor tweaks to those products to keep them in production, but that they decided to use those engineering hours to instead make “steps forward to a next generation of what those power meter technologies should be.”</p><p>We don’t know exactly what those new technologies will be yet (or if they’ll retain the PowerTap branding), but keep in mind that Quarq has reiterated numerous times that they didn’t buy PowerTap to kill it. In fact, they noted the reason they bought PowerTap was to continue those products and make future editions of them, with specifically calling out interest in both the pedal and hub based product lines and building atop them. You can read my <a href=\"https://www.dcrainmaker.com/2019/04/sram-acquires-powertap-what-it-means-for-both-brands-and-consumers.html\">original interview back then about it</a>.</p><p>Either way, given Quarq and SRAM often announce products as a one-two punch between the first week of February, followed by what used to be the Sea Otter timeframe, and given it’s been a few years, and given that they <a href=\"https://cyclingtips.com/2021/02/new-sram-red-etap-axs-max-rear-derailleur-goes-bigger-on-range/\">did the first punch last week</a>…it might not be long till that second punch.</p><p>With that – thanks for reading!</p></div></div>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"c5455c0ba5836e5a05732b655549b9a8bef84541d8d7fc6337cdce98a91301c6","category":"Cycling"}