{"title":"Exchange servers first compromised by Chinese hackers hit with ransomware","link":"https://arstechnica.com/?p=1749428","date":1615593791000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>DOUBLE WHAMMY —</h4><h2 itemprop=\"description\">As if Exchange users didn't already have enough to worry about, they have this.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/skull-ones-zeros-800x636.jpeg\" alt=\"Exchange servers first compromised by Chinese hackers hit with ransomware\"><figcaption><p>Getty Images</p></figcaption></figure><p>Now organizations using Microsoft Exchange have a new security headache: never-before seen ransomware that’s being installed on servers that were already infected by state-sponsored hackers in China.</p><p>Microsoft <a href=\"https://twitter.com/MsftSecIntel/status/1370236539427459076\">reported</a> the new family of ransomware deployment late Thursday, saying that it was being deployed after the initial compromise of servers. Microsoft’s name for the new family is Ransom:Win32/DoejoCrypt.A. The more common name is DearCry.</p><h2>Piggybacking off Hafnium</h2><p>Security firm Kryptos Logic <a href=\"https://twitter.com/kryptoslogic/status/1370478455817637895\">said</a> Friday afternoon that it has detected Hafnium-compromised Exchange servers that were later infected with ransomware. Kryptos Logic security researcher Marcus Hutchins told Ars that the ransomware is DearCry.</p><p>“We've just discovered 6970 exposed webshells which are publicly exposed and were placed by actors exploiting the Exchange vulnerability,” Kryptos Logic said. “These shells are being used to deploy ransomware.” Webshells are backdoors that allow attackers to use a browser-based interface to run commands and execute malicious code on infected servers.</p><p>Anyone who knows the URL to one of these public webshells can gain complete control over the compromised server. The DearCry hackers are using these shells to deploy their ransomware. The webshells were initially installed by Hafnium, the name Microsoft has given to a state-sponsored threat actor operating out of China.</p><p>Hutchins that that the attacks are \"human operated,\" meaning a hacker manually installs ransomware on one Exchange server at a time. Not all of the nearly 7,000 servers have been hit by DearCry.</p><p>“Basically we’re starting to see criminal actors using shells left behind by Hafnium to get a foothold into networks,” Hutchins explained.</p><p>The deployment of ransomware, which security experts have said was inevitable, underscores a key aspect about the ongoing response to secure servers exploited by ProxyLogon. It’s not enough to simply install the patches. Without removing the webshells left behind, servers remain open to intrusion, either by the hackers who originally installed the backdoors, or by other fellow hackers who figure out how to gain access to them.</p><p>Little is known about DearCry. Security firm Sophos <a href=\"https://twitter.com/SophosLabs/status/1370477406696271875\">said</a> that it’s based on a public-key cryptosystem, with the public key embedded in the file that installs the ransomware. That allows files to be encrypted without the need to first connect to a command-and-control server. To decrypt the data, victims’ must obtain the private key that’s known only to the attackers.</p><p>Among the first to discover DearCry was Mark Gillespie, a security expert who runs a service that helps researchers <a href=\"https://id-ransomware.malwarehunterteam.com/\">identify malware strains</a>. On Thursday, he <a href=\"https://twitter.com/demonslay335/status/1370125343571509250\">reported</a> that beginning on Tuesday he started receiving queries from Exchange servers in the US, Canada, and Australia for malware that had the string “DEARCRY.”</p><p>He later <a href=\"https://twitter.com/demonslay335/status/1370125647964692483\">found someone posting to a user forum</a> on Bleeping Computer saying the ransomware was being installed on servers that had first been exploited by Hafnium. Bleeping Computer soon <a href=\"https://www.bleepingcomputer.com/news/security/ransomware-now-attacks-microsoft-exchange-servers-with-proxylogon-exploits/\">confirmed the hunch</a>.</p><p>John Hultquist, a vice president at security firm Mandiant, said piggy backing on the hackers who installed the webshells can be a faster and more efficient means to deploy malware on unpatched servers than exploiting the ProxyLogon vulnerabilities. And as already mentioned, even if servers are patched, ransomware operators can still compromise the machines when webshells haven’t been removed.</p><p>“We are anticipating more exploitation of the exchange vulnerabilities by ransomware actors in the near term,” Hultquist wrote in an email. “Though many of the still unpatched organizations may have been exploited by cyber espionage actors, criminal ransomware operations may pose a greater risk as they disrupt organizations and even extort victims by releasing stolen emails.”</p><p><em>Post updated to remove \"7,000\" from the headline and to make clear not all of them have been infected with ransomware.</em></p></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c5a3a129454c33a316abb9f8c955cf19bc9c8fab7c2902e1761356a793cb72d9","category":"Tech"}