{"title":"Kuo: Apple May Release Augmented Reality Contact Lenses in 2030s","link":"https://www.macrumors.com/2021/03/07/kuo-apple-ar-contact-lenses-2030s/","date":1615138445000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/07/kuo-apple-ar-contact-lenses-2030s/\"><p>In a research note shared with MacRumors, analyst Ming-Chi Kuo today predicted that Apple will release augmented reality \"contact lenses\" in the 2030s. Kuo said the lenses will bring electronics from the era of \"visible computing\" to \"invisible computing.\"</p><p><img alt=\"smart contact lens\" width=\"1600\" height=\"900\" src=\"https://images.macrumors.com/t/qdnrCJYuKkoBakb4IY6ddWtvCqo=/400x0/filters:quality(90)/article-new/2021/03/smart-contact-lens.jpeg?lossy\" data-src=\"https://images.macrumors.com/t/qdnrCJYuKkoBakb4IY6ddWtvCqo=/400x0/filters:quality(90)/article-new/2021/03/smart-contact-lens.jpeg?lossy\" data-srcset=\"https://images.macrumors.com/t/qdnrCJYuKkoBakb4IY6ddWtvCqo=/400x0/filters:quality(90)/article-new/2021/03/smart-contact-lens.jpeg?lossy 400w,https://images.macrumors.com/t/gwgKsglXzBZsPXqxvML3T1V1-rc=/800x0/filters:quality(90)/article-new/2021/03/smart-contact-lens.jpeg?lossy 800w,https://images.macrumors.com/t/NohpMRkJVUzDHNNKsRNeyFUXAoU=/1600x0/filters:quality(90)/article-new/2021/03/smart-contact-lens.jpeg 1600w,https://images.macrumors.com/t/SDHYXBpJAOPHjwg94kajoFO006k=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/smart-contact-lens.jpeg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/qdnrCJYuKkoBakb4IY6ddWtvCqo=/400x0/filters:quality(90)/article-new/2021/03/smart-contact-lens.jpeg?lossy 400w,https://images.macrumors.com/t/gwgKsglXzBZsPXqxvML3T1V1-rc=/800x0/filters:quality(90)/article-new/2021/03/smart-contact-lens.jpeg?lossy 800w,https://images.macrumors.com/t/NohpMRkJVUzDHNNKsRNeyFUXAoU=/1600x0/filters:quality(90)/article-new/2021/03/smart-contact-lens.jpeg 1600w,https://images.macrumors.com/t/SDHYXBpJAOPHjwg94kajoFO006k=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/smart-contact-lens.jpeg 2500w\"></p><p><em>Mojo Vision smart contact lens</em></p><p>Kuo said the lenses are \"unlikely to have independent computing power and storage,\" suggesting that they might rely on a connection to an iPhone or other device, but he did not offer any further details. Kuo said there is \"no visibility\" for this product currently, so this sounds more like a moonshot prediction rather than a guaranteed product.</p><p>Apple's contact lenses could provide a lightweight augmented reality experience without the need to wear glasses or a headset. In simple terms, augmented reality overlays digital information over a real-world view; for example, a person walking in an outdoor shopping plaza could see store names labeled, and perhaps their hours of operation.</p><p>In the more immediate future, Kuo said Apple plans to release its long-rumored mixed reality headset \"in mid-2022,\" followed by augmented reality glasses by 2025. For more details about these products, <a href=\"https://www.macrumors.com/2021/03/07/kuo-apple-mixed-reality-headset-2022/\">read our earlier coverage</a>.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/05/apple-watch-series-7-breakthrough-health-feature/\">Apple Watch Series 7 to Gain Breakthrough New Health Feature</a></h3><p>Apple is reportedly planning to bring a new, first-of-its-kind health technology to the Apple Watch Series 7, in what could be a breakthrough for managing conditions such as diabetes more easily. According to a recent report from ETNews, the Apple Watch Series 7 will feature blood glucose monitoring via a non-invasive optical sensor. Measuring blood glucose levels, also known as blood...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/03/apple-transfer-icloud-photos-google-photos/\">Apple Launches Service for Transferring iCloud Photos and Videos to Google Photos</a></h3><p>Wednesday March 3, 2021 12:04 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple this week introduced a new service that's designed to make it quick and easy for iCloud users to transfer their stored photos and videos to Google Photos. As outlined in an Apple support document, you can go to Apple's privacy website and sign in to see the \"Transfer a copy of your data\" option. If you select this and go through all the steps, Apple will transfer your iCloud photos and ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/apple-confirms-imac-pro-will-be-discontinued/\">Apple Confirms iMac Pro Will Be Discontinued When Supplies Run Out, Recommends 27-Inch iMac</a></h3><p>Apple on late Friday evening added a \"while supplies last\" notice to its iMac Pro product page worldwide, and removed all upgrade options for the computer, leaving only the standard configuration available to order for now. We've since confirmed with Apple that when supplies run out, the iMac Pro will no longer be available whatsoever. Apple says the latest 27-inch iMac introduced in August...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/04/whats-on-your-iphone-home-screen/\">What's on Your iPhone Home Screen?</a></h3><p>Thursday March 4, 2021 10:31 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Over on our YouTube channel, MacRumors videographer Dan has a new video up where he shares his Home Screen, wallpaper, and all of his current favorite widgets. Subscribe to the MacRumors YouTube channel for more videos. Check out Dan's video to see his setup, and then comment below and show us your own Home Screens. It's always fun to see other peoples' Home Screens, and with widgets and...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/04/ipad-macbook-oled-displays-2022-rumor/\">iPad and MacBook Models With OLED Displays Rumored to Launch in 2022</a></h3><p>Apple plans to release new iPad and MacBook models with OLED displays in 2022, according to industry sources cited by Taiwanese supply chain publication DigiTimes. The information was shared in the site's paywalled \"Before Going to Press\" section, so there are no further details yet, but the full report should be released by tomorrow. Apple has gradually increased its adoption of OLED...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/top-stories-iphone-13-oled-ipads-macs/\">Top Stories: iPhone 13 Leaks, OLED iPads and Macs, New AirTags Evidence</a></h3><p>iPhone rumors are heating up, with noted analyst Ming-Chi Kuo this week releasing a wide-ranging report outlining his expectations for the iPhone lineup over the next three years. This week also saw rumors about OLED displays potentially coming to iPad and Mac starting next year, increasing signs of AirTags functionality in iOS 14.5 betas, and more, so check out all of the details below! i...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/imac-pro-while-supplies-last/\">iMac Pro No Longer Custom Configurable, Available 'While Supplies Last'</a></h3><p>Friday March 5, 2021 10:14 pm PST by <a href=\"https://www.macrumors.com/author/eric-slivka/\" rel=\"author\">Eric Slivka</a></p><p>Apple appears to be on the verge of discontinuing the iMac Pro, with the store page for the high-end all-in-one Mac including a \"While supplies last\" tagline and only the base model with no custom configurations available for purchase. The iMac Pro launched in December 2017, and while there have been a few tweaks to the available configurations over the years, it has received no substantial...</p></div></div></div>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c6ccb0eb3a293a57789ff4b38fc2fad9443b2a7fa7cda79814d3103b044cd756","category":"Apple"}