{"title":"What will it take to get a giant cargo ship unstuck from the Suez Canal?","link":"https://arstechnica.com/?p=1752552","date":1616841038000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Traffic jam —</h4><h2 itemprop=\"description\">Tugboats, excavators, and cranes all may be enlisted to help the <em>Ever Given</em>.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/evergiven-800x600.jpg\" alt=\"Maxars WorldView-2 collected new high-resolution satellite imagery of the Suez canal and the container ship <em>Ever Given</em> that remains stuck in the canal north of the city of Suez, Egypt.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/evergiven.jpg\" data-height=\"768\" data-width=\"1024\">Enlarge</a> <span>/</span> Maxars WorldView-2 collected new high-resolution satellite imagery of the Suez canal and the container ship <em>Ever Given</em> that remains stuck in the canal north of the city of Suez, Egypt.</p><p>Satellite image (c) 2020 Maxar Technologies</p></figcaption></figure><p>Every day, some 50 ships pass through the Suez Canal, the waterway slashed between the Mediterranean and the Red Sea. These are big ships: Some 10 percent of the world’s maritime trade traverses the Suez. But not Wednesday.</p><p>That’s because a ship called the <em>Ever Given</em>, en route to Rotterdam, Netherlands, from China, is wedged between the canal’s sandy banks. The vessel, operated by Taiwan-based Evergreen Group, is one of the biggest in the world: as long as four football fields, as wide as the wingspan of a Boeing 747, and, thanks to the 200,000 tons of containers stacked on board, as tall as a 12-story building.</p><p>It might be there a while. It’s not easy to unstick a gigantic shipping vessel, experts say. The Suez Canal Authority, the Egypt-owned body that owns and operates the canal, has not yet said when it expects traffic to resume.</p><p>Meanwhile, at least 34 ships carrying 379,000 20-foot containers of stuff couldn’t move through the canal in either direction as of Wednesday afternoon, according to the logistics software company Project44. “It’s a pretty major deal” for global trade, says Henry Byers, a maritime and global trade analyst at the logistics data company FreightWaves.</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/wired-logo.png\" width=\"218\" height=\"58\"></figure><p>It’s very unusual—even unheard of—for ships to get wedged in the Suez Canal like this, says Captain Morgan McManus, who is the master of the training ship at State University of New York Maritime College and has traveled through the canal at least half a dozen times. In the rare event that a ship loses power or control in the canal, it gets laid on the sandy bank, where it’s inspected or repaired. In the meantime, other, smaller ships might be able to pass by.</p><p>Not the <em>Ever Given</em>. BSM, the ship’s technical manager, said Wednesday “strong winds” had pushed the ship perpendicular to the canal’s banks, with the towering stacks of containers on board acting as a giant sail. Official reports outlining the causes of the incident likely won’t be available for weeks, perhaps even a year, but BSM says no one was hurt. Photos from the scene show the <em>Ever Given</em>’s bow wedged into the sand, while an excavator—dwarfed by the container ship towering above it—attempts to dig it out. “That’s like shooting a BB-gun at a freight train,” says McManus.</p><p>The rescue of the <em>Ever Given</em> will likely include more motors. Cargo ships have huge ballast tanks, compartments that are filled with water to keep the ships stable. Crews will probably move water into the bow, says Captain John Konrad, the founder of the shipping trade publication <a href=\"http://gcaptain.com/\">gCaptain.com</a>. Then, at high tide, high-powered tug boats will attempt to push or pull the ship out of its position. <a href=\"https://www.reuters.com/article/us-egypt-suezcanal-ship/container-ship-runs-aground-in-suez-canal-blocks-traffic-idUSKBN2BG0BG\">At least 10 tugs</a> were involved in rescue operations Wednesday.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/ever-given-2.jpg\" data-height=\"766\" data-width=\"1024\" alt=\"The Taiwan-owned MV Ever Given lodged sideways and impeding all traffic across the waterway of Egypt's Suez Canal.\"><img alt=\"The Taiwan-owned MV Ever Given lodged sideways and impeding all traffic across the waterway of Egypt's Suez Canal.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/ever-given-2-640x479.jpg\" width=\"640\" height=\"479\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/ever-given-2.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/ever-given-2.jpg\" data-height=\"766\" data-width=\"1024\">Enlarge</a> <span>/</span> The Taiwan-owned MV Ever Given lodged sideways and impeding all traffic across the waterway of Egypt's Suez Canal.</p><p>Suez Canal | Handout | AFP | Getty Images</p></figcaption></figure><p>If <em>that</em> doesn’t work, it’s time for cranes. A barge crane could pull containers off the 200,000-ton vessel to help lighten the load and make it easier to maneuver. But photos suggest there may be few places on the bank to safely place a crane or the off-loaded containers. “That would be very challenging to do,” says McManus. “As they always say: Things happen in the worst possible places, and this is pretty bad.”</p><p>BSM said late Wednesday that it had deployed dredging equipment to clear sand and mud from around the <em>Ever Given</em>. In 2016 a <a href=\"https://gcaptain.com/watch-video-captures-refloating-of-cscl-indian-ocean/\">Chinese container ship</a> got wedged in the Elbe River while approaching the port in Hamburg, Germany. It took six days, 12 tug boats, two dredgers, and a well-timed spring tide to free it.</p><p>In the meantime, crews will have to watch for cracks in the ship’s hull, which can happen when the ship rubs against or is punctured by rocks. Attempts to free the ship also could damage it. “The ship is designed to be floating in water, not on land, so different pressure points on different parts of the vessel could damage the bow,” says McManus. One of the worst possible outcomes: Fuel could leak from the ship into the canal, leading to a lengthy and costly cleanup.</p><p>Whatever happens during the rescue effort, the <em>Ever Given</em> will have to be hauled elsewhere, anchored, and inspected by divers before it’s cleared to continue on its journey to northern Europe. Byers, the analyst, says that booking records detail some of the ship’s cargo: baby clothes, men’s and boys’ tracksuits, pneumatic tires, electrical appliances, and … ginger.</p><p>The incident could raise new questions about the container shipping industry, which moves 90 percent of the world’s goods, and its increasingly gigantic ships. Demand for shipping goods by sea has surged during the <a href=\"https://www.wired.com/tag/covid-19/\">Covid-19</a> pandemic, with spot prices for empty containers moving from China to northern Europe rising by more than 400 percent. In response, shipping lines have loaded gigantic vessels like the <em>Ever Given</em> with record numbers of containers. Ships have run into some trouble. The industry has <a href=\"https://www.wired.com/story/where-shoes-ordered-check-ocean-floor/\">lost more cargo into the sea</a> in late 2020 and early 2021 than in prior years. “We’re going to get to a point where the ships are so large, it becomes a burden,” says Byers.</p><p>For now, though, the <em>Ever Given</em> needs to get free. “I’m glad I’m not stuck in the canal right now,” says McManus.</p><p><em>This story originally appeared on <a href=\"https://www.wired.com/story/what-take-cargo-ship-un-stuck-suez-canal/\">wired.com</a>.</em></p></div></div></div>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c70d24f021e9969b6e87acb74dfd3e6a2ef75029854eea68ade7531ee347338b","category":"Tech"}