{"title":"BC Bike Race Gravel Explorer – Day 3 race report","link":"https://cyclingtips.com/2021/09/bc-bike-race-gravel-explorer-day-3-race-report/","date":1633036156000,"content":"<div><div><p><strong>Presented By Easton<br>Location – Penticton to Kelowna<br>Distance – 98km<br>Vertical – 1416 meters<br><a href=\"https://racedaytiming.ca/bc-bike-gravel-series/2021\" target=\"_blank\">Stage Three Results</a></strong></p><p>After two days of intense technical gravel riding, it was time to stretch the legs and cover some distance. Penticton to Kelowna is no mean feat. By the time you add in the warm-up and the commute to the start line, most riders will be pushed well over 100km’s today, while that’s not a huge number, we must remember these are cumulative miles in an overall stage race.</p><p>The Queen Stage, the halfway point between the start and the finish, the largest day or hump-day, is always a significant moment in any race and today’s experience for the riders was of quintessential importance for any race. From the perspective of the racers, the race leaders, the flavour had significantly shifted, from gnar to pedal, from vertical to distance, and in today’s case from warm to cool, as in the weather was the greatest force in today’s challenge.</p><p>Summer racing sets racers up for a mindset of ‘jersey and shorts’ and as we all know the optimism of athletes is infectious, or unanimous, the racers left the start line at 7:30am at about 7 degrees with minimal gear and headed into the mountains. Well, in summer this is fine, in the fall, mmmm. As the temperature finally climbed on the higher plateaus of the Southern Okanagan from 1 degree to a blistering 6 degrees and the sun began to warm racers, the majority had reached the aid station and the sustained long descent home was in hand. But when the weather decides to stay down-right ornery and not continue its planned trajectory, cold hands don’t warm and knees begin to ache, and just as the energies of excitement have begun to wane the majority of the field was descending into Kelowna and the survival of the most amazing stage was in the rearview mirror.</p><p>The day started on a steady vertical ascent and pretty quickly the stage was set, Alexander Fraser-Maraun attacked and left no doubt what his intentions were – winning!! Cory Wallace defending his jersey chased hard alone with Karsten Madsen also alone just behind. Declan Kelly was in arrears as the shattered field behind sought solace in companionship.</p><p>It wasn’t long after they crested the start climb that thoughtful things began to materialize, Cory waited for Karsten to form a chase team and while Declan almost bridged to confound the temporary truce, the newly form co-op worked hard to exclude Alexander’s teammate.</p><p>Eventually, Cory and Karsten bridged to Alexander, and they re-formed their alliance to include all parties, as there were nearly 70km’s of solid riding ahead.</p><p>Behind the lead trio a few groups had formed, most of them with solidarity to soldier through the ordeal together and make the most of the fantastic views, incredible road surfaces, and adventure ahead. Though Amity Rockwell nearly connected with the small group Sammi Runnels had started with, it was not meant to be, she dangled in limbo, alone for the majority of the day. This was the modus operandi for the day with some solid groups and equally a large number of people that spent the entire day cruising along stoically and solo in a meditative state of nirvana.</p><p>The lead group eventually settled into a workable pace and hit cruise control for a short while before the hand of destiny reared its ugly head and threw a few curveballs. Between dropped chains, some lack of timely nutrition, and perhaps just more experience, Cory Wallace once again triumphed over his companions, Alexander Fraser-Maraun took second and Karsten Madsen third. Perhaps the overall lead has slipped away but the battle for vice-champion is very much on.</p><p>Jesse Sholtz is fighting hard to maintain his solid lead in the men’s 30+ and mixing in with the top contenders. Jodi Merckx is continuing to establish an unassailable lead in the 50+ women, but there are so many stories to tell here. Mark Bennett is leading the 60+ men and showing skill at both technical and distance as are all the riders. Anselmo Rossiello had a mishap in the morning warming up and injured his wrist, he continued through the day but lost his overall 50+ jersey to Drew Hemingson, there are still two more days to go.</p><p>John Ramsden has brought most of his cycling family here to enjoy the camaraderie of sharing a unique experience. His daughter Jocelyn is enjoying success and more importantly a great week of riding in the Solo Open Women’s as is his son, Blake, in the Open Men’s Solo. I hope my kids one day have this amount of strength and courage.</p><p>There are so many stories here of amazing people, we wish we could tell them all, but in the end, they are their own stories that they will take home and treasure forever because they did the work, they rode the miles, and they are the ones who overcame the challenge “everywhere a gravel bike can go”.</p><p>With 2 days to go and the veritable routes that have been presented, this Adventure Ride, this Gravel Experience is far from over, and it is in truth the stories of the individuals within the context of a race that will truly live on forever.</p><p><em>Photo Credit: Chris Stenberg</em></p><h2>Key Details</h2><ul><li>The Queen Stage, the halfway point between the start and the finish and the largest day</li><li>Cory Wallace once again triumphed over his companions</li><li>Jesse Sholtz is fighting hard to maintain his solid lead in the men’s 30+</li><li>Jodi Merckx is continuing to establish an unassailable lead in the 50+ women</li></ul><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Fall-in-the-Okanagan-stenberg-web-0701.jpg\"><figcaption></figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Jon-Bula-and-partner-Graham-Fox-stenberg-web-04616.jpg\"><figcaption></figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Fall-colours-great-riding-stenberg-web-04797.jpg\"><figcaption></figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Amity-Rockwell-in-the-pain-cave-stenberg-web-04386.jpg\"><figcaption></figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/stenberg-web-04634.jpg\"><figcaption></figcaption></figure></li></ul></div></figure><div><h2>WHAT IS ‘FROM THE SOURCE’?</h2><p>When you see an article containing ‘From the source’ label on the homepage or with the headline in blue, note that this is content directly from the brand and it has been vetted by our Editors and deemed worthy of your attention. This is not paid or sponsored content but rather a way to bring you news worth sharing while freeing up our Editors to spend their time adding value where where their expertise lays. Follow the <a href=\"https://cyclingtips.com/what-is-from-the-source/\">link</a> to learn more about this type of content and our related publishing guidelines.</p></div></div></div>","author":"BCBRGravel","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c7e8478a0b45c2a7cd449c0125bedeb3c606aee298308c79367eb73ccbf70cc0","category":"Cycling"}