{"title":"WhatsApp Still Working on Password-Protected Encrypted iCloud Backups","link":"https://www.macrumors.com/2021/03/08/whatsapp-working-on-encrypted-icloud-backups/","date":1615202863000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/08/whatsapp-working-on-encrypted-icloud-backups/\"><p>WhatsApp is working on a way to secure users' chat backups in <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> using password-protected encryption, according to a new report from forthcoming-feature specialist <a href=\"https://twitter.com/WABetaInfo/status/1368839686102384640?s=20\">WABetaInfo</a>.</p><p><img alt=\"Whatsapp Feature\" width=\"2250\" height=\"1266\" src=\"https://images.macrumors.com/t/9K34z4BsT2T4-_CaCc-dkAFZGnU=/400x0/filters:quality(90)/article-new/2021/03/Whatsapp-Feature.jpg?lossy\" data-src=\"https://images.macrumors.com/t/9K34z4BsT2T4-_CaCc-dkAFZGnU=/400x0/filters:quality(90)/article-new/2021/03/Whatsapp-Feature.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/9K34z4BsT2T4-_CaCc-dkAFZGnU=/400x0/filters:quality(90)/article-new/2021/03/Whatsapp-Feature.jpg?lossy 400w,https://images.macrumors.com/t/7jSEuT_vbUEyzQlN3juvECzjDGk=/800x0/filters:quality(90)/article-new/2021/03/Whatsapp-Feature.jpg?lossy 800w,https://images.macrumors.com/t/ZSps4c2F1xsHUZgK_iAARZySnZg=/1600x0/filters:quality(90)/article-new/2021/03/Whatsapp-Feature.jpg 1600w,https://images.macrumors.com/t/uFTJZYmr_pnUWdD1_zSCgNQ8EKE=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/Whatsapp-Feature.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/9K34z4BsT2T4-_CaCc-dkAFZGnU=/400x0/filters:quality(90)/article-new/2021/03/Whatsapp-Feature.jpg?lossy 400w,https://images.macrumors.com/t/7jSEuT_vbUEyzQlN3juvECzjDGk=/800x0/filters:quality(90)/article-new/2021/03/Whatsapp-Feature.jpg?lossy 800w,https://images.macrumors.com/t/ZSps4c2F1xsHUZgK_iAARZySnZg=/1600x0/filters:quality(90)/article-new/2021/03/Whatsapp-Feature.jpg 1600w,https://images.macrumors.com/t/uFTJZYmr_pnUWdD1_zSCgNQ8EKE=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/Whatsapp-Feature.jpg 2500w\"><br>The Facebook-owned chat platform began early work on the security feature back in <a href=\"https://www.macrumors.com/2020/03/05/whatsapp-tests-secure-chat-backups/\">March 2020</a>. Currently, WhatsApp on <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> lets users back up their chat history to ‌iCloud‌, but messages and media that users back up are not protected by WhatsApp's end-to-end encryption while in ‌‌iCloud‌.</p><p>Apple holds the encryption keys to ‌iCloud‌, and does provide backed-up data to authorities when lawfully requested, as outlined in its semiannual <a href=\"https://www.apple.com/legal/transparency/\">Transparency Reports</a>. The new WhatsApp feature, should it see the light of day, would resolve that security hole by allowing users to encrypt and password-protect their chat history before uploading it to Apple's cloud-based platform.</p><p>In screenshots <a href=\"https://twitter.com/WABetaInfo/status/1368839686102384640?s=20\">posted</a> by WABetaInfo, WhatsApp describes the password-protection like so:<br></p><blockquote><p>\"To prevent unauthorized access to your <a href=\"https://www.macrumors.com/guide/icloud-drive/\">iCloud Drive</a> backup, you can set a password that will be used to encrypt future backups. This password will be required when you restore from the backup.\"</p></blockquote><p>The user is then asked to confirm their phone number and select a password of at least eight characters in length. Another screenshot forewarns users that \"WhatsApp will not be able to help recover forgotten passwords.\"</p><p>It's unclear when the security feature will go live, but after the recent exodus from WhatsApp prompted by the service's poorly explained <a href=\"https://www.macrumors.com/2021/01/06/whatsapp-privacy-policy-data-sharing-facebook/\">privacy policy update</a>, sooner would be better than later.</p><p>Rival encrypted messaging services Telegram and Signal have both experienced a <a href=\"https://www.macrumors.com/2021/01/08/messaging-app-signal-sees-surge-signups/\">surge in signups</a> following the controversy, which led WhatsApp to <a href=\"https://www.macrumors.com/2021/01/15/whatsapp-privacy-policy-delay/\">delay</a> the privacy policy update until May while it attempts to <a href=\"https://www.macrumors.com/2021/01/12/whatsapp-affirms-user-privacy-following-backlash/\">deal with the fallout</a> and clarify to users that the changes won't affect the privacy of their conversations.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/06/apple-confirms-imac-pro-will-be-discontinued/\">Apple Confirms iMac Pro Will Be Discontinued When Supplies Run Out, Recommends 27-Inch iMac</a></h3><p>Apple on late Friday evening added a \"while supplies last\" notice to its iMac Pro product page worldwide, and removed all upgrade options for the computer, leaving only the standard configuration available to order for now. We've since confirmed with Apple that when supplies run out, the iMac Pro will no longer be available whatsoever. Apple says the latest 27-inch iMac introduced in August...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/05/apple-watch-series-7-breakthrough-health-feature/\">Apple Watch Series 7 to Gain Breakthrough New Health Feature</a></h3><p>Apple is reportedly planning to bring a new, first-of-its-kind health technology to the Apple Watch Series 7, in what could be a breakthrough for managing conditions such as diabetes more easily. According to a recent report from ETNews, the Apple Watch Series 7 will feature blood glucose monitoring via a non-invasive optical sensor. Measuring blood glucose levels, also known as blood...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/top-stories-iphone-13-oled-ipads-macs/\">Top Stories: iPhone 13 Leaks, OLED iPads and Macs, New AirTags Evidence</a></h3><p>iPhone rumors are heating up, with noted analyst Ming-Chi Kuo this week releasing a wide-ranging report outlining his expectations for the iPhone lineup over the next three years. This week also saw rumors about OLED displays potentially coming to iPad and Mac starting next year, increasing signs of AirTags functionality in iOS 14.5 betas, and more, so check out all of the details below! i...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/imac-pro-while-supplies-last/\">iMac Pro No Longer Custom Configurable, Available 'While Supplies Last'</a></h3><p>Friday March 5, 2021 10:14 pm PST by <a href=\"https://www.macrumors.com/author/eric-slivka/\" rel=\"author\">Eric Slivka</a></p><p>Apple appears to be on the verge of discontinuing the iMac Pro, with the store page for the high-end all-in-one Mac including a \"While supplies last\" tagline and only the base model with no custom configurations available for purchase. The iMac Pro launched in December 2017, and while there have been a few tweaks to the available configurations over the years, it has received no substantial...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/05/apple-fitness-plus-studio-tour/\">A Look Inside Apple's 23,000 Square-Foot Fitness+ Studio</a></h3><p>Friday March 5, 2021 10:59 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple Fitness+, the latest service to join the Apple family, integrates tightly with the Apple Watch to offer a comprehensive and growing selection of workout and exercise videos made by a team of professional trainers. Apple Fitness+ Studio (via Men's Health) Apple curates and records all of the videos at a location in Santa Monica, California, and each video features a similar background...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/04/whats-on-your-iphone-home-screen/\">What's on Your iPhone Home Screen?</a></h3><p>Thursday March 4, 2021 10:31 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Over on our YouTube channel, MacRumors videographer Dan has a new video up where he shares his Home Screen, wallpaper, and all of his current favorite widgets. Subscribe to the MacRumors YouTube channel for more videos. Check out Dan's video to see his setup, and then comment below and show us your own Home Screens. It's always fun to see other peoples' Home Screens, and with widgets and...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/05/microsoft-edge-89-for-mac-vertical-tabs/\">Microsoft Edge 89 Brings Vertical Tabs and New History View</a></h3><p>Microsoft has officially released version 89 of its popular Chromium-based Edge browser, bringing its long-trialed vertical tabs feature to Mac for the first time. Vertical tabs are intended to make more efficient use of screen space, and should prove a welcome addition for users browsing on 16:9 ratio displays in particular. Users can click vertical tabs to switch between them and...</p></div></div></div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c87e5614ec4aca0010a426d48a7c7a775c424e9ba56f62ce7f0a8dcb9f0eef2e","category":"Apple"}