{"title":"iPhone 13 Rumored to Include Always-On Display With 120Hz ProMotion, Astrophotography Capabilities, Stronger MagSafe, and More","link":"https://www.macrumors.com/2021/02/15/iphone-13-always-on-display-stronger-magesafe/","date":1613386038000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/15/iphone-13-always-on-display-stronger-magesafe/\"><p>This year's <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> lineup will include an always-on display with a 120hz refresh rate, improved camera capabilities for astrophotography, stronger <a href=\"https://www.macrumors.com/guide/magsafe/\">MagSafe</a> magnets, and a finer matte finish on the back, according to leaker Max Weinbach (via YouTube channel <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\">EverythingApplePro</a>).</p><p><img alt=\"eap always on display 2\" width=\"1700\" height=\"956\" src=\"https://images.macrumors.com/t/zeNoYRjan3BdyuOVaBsW4XHT5pQ=/400x0/filters:quality(90)/article-new/2021/02/eap-always-on-display-2.jpeg?lossy\" data-src=\"https://images.macrumors.com/t/zeNoYRjan3BdyuOVaBsW4XHT5pQ=/400x0/filters:quality(90)/article-new/2021/02/eap-always-on-display-2.jpeg?lossy\" data-srcset=\"https://images.macrumors.com/t/zeNoYRjan3BdyuOVaBsW4XHT5pQ=/400x0/filters:quality(90)/article-new/2021/02/eap-always-on-display-2.jpeg?lossy 400w,https://images.macrumors.com/t/W4wdc8-r76dZW0SCOfQEFUGXtAI=/800x0/filters:quality(90)/article-new/2021/02/eap-always-on-display-2.jpeg?lossy 800w,https://images.macrumors.com/t/3scELvBDbfBLMD421NRjj2QN49Q=/1600x0/filters:quality(90)/article-new/2021/02/eap-always-on-display-2.jpeg 1600w,https://images.macrumors.com/t/ZOEgxEW1vSqCmTOq6LvT_vkIuCQ=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/eap-always-on-display-2.jpeg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/zeNoYRjan3BdyuOVaBsW4XHT5pQ=/400x0/filters:quality(90)/article-new/2021/02/eap-always-on-display-2.jpeg?lossy 400w,https://images.macrumors.com/t/W4wdc8-r76dZW0SCOfQEFUGXtAI=/800x0/filters:quality(90)/article-new/2021/02/eap-always-on-display-2.jpeg?lossy 800w,https://images.macrumors.com/t/3scELvBDbfBLMD421NRjj2QN49Q=/1600x0/filters:quality(90)/article-new/2021/02/eap-always-on-display-2.jpeg 1600w,https://images.macrumors.com/t/ZOEgxEW1vSqCmTOq6LvT_vkIuCQ=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/eap-always-on-display-2.jpeg 2500w\"></p><p>Weinbach is a well-known leaker and has shared information via the YouTube channel in the past regarding the 2020 <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> lineup, some of which came true. Regardless, take the following with a grain of salt. According to their sources, Apple is planning to include an always-on display in the ‌iPhone 13‌ series, with the technology being similar to the always-on display in the Apple Watch Series 5 and later.</p><p>Always-on displays are typical in most flagship Android smartphones, and it allows users to see information on their screen at all times, without having to power on or unlock the device. Ever since the <a href=\"https://www.macrumors.com/2017/09/12/apple-iphone-x-super-retina-oled-display/\">iPhone X</a>, which was the first <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> to feature an OLED display, many have speculated Apple will bring this feature to ‌iPhone‌ users.</p><p>OLED displays use less power than LCD displays, since each pixel is individually controlled, unlike LCD panels which use backlight and light up all pixels, even if it's just to show a small piece of information on the screen. With OLED displays, Apple is able to only light up the pixels needed to show users the time, battery, or some form of indicator for app notifications, without using a significant amount of battery power.</p><p>Weinbach claims that the always-on display will look like a \"toned down lockscreen,\" where the clock and battery charge are always visible, and past notifications are shown through \"a bar and icons.\" When users receive a notification, the notification will \"pop up normally except that the screen will not entirely light up.\" Instead, \"it will display it just like you're used to right now, except dimmed down and only temporarily,\" according to the leaker.</p><p>The leaker also \"confirms\" that a 120hz ProMotion refresh rate is happening on the 2021 Pro ‌iPhone‌ models, a feature that was <a href=\"https://www.macrumors.com/2020/08/24/iphone-12-pro-to-ship-with-60hz-but-delay-possible/\">widely rumored</a> to appear on the ‌iPhone 12‌. An always-on and ProMotion display would not require a change in physical design, and that yields to the fact that Weinbach reports there will be no change to the actual chassis on the ‌iPhone 13‌ compared to the ‌iPhone 12‌ lineup. The only possible hardware change will be a matte back with a \"grippier, more comfortable\" feeling, similar to the finishing on the back of the Google Pixel series.</p><p>Internally, ‌MagSafe‌ will be getting \"considerably\" stronger, according to the leak. The ‌iPhone 12‌ features ‌MagSafe‌ on the back that allows users to magnetically attach different accessories and offers an alternative way to charge the device, however, the magnets have been criticized by some for being weak. Apple's looking to alleviate those concerns by adding stronger magnets, although the addition is not expected to be the sole reason for a <a href=\"https://www.macrumors.com/2021/01/08/iphone-13-thinner-notch/\">rumored increase in device thickness</a>. As for the cameras, Weinbach reports that Apple is increasing its efforts in astrophotography.</p><p>Astrophotography, the photography of astronomy, typically requires complicated camera setups to proficiently capture the night times dark sky. The integration of the ability into the ‌iPhone‌ is expected to be seamless, with the leak claiming the ‌iPhone‌ will automatically switch to the mode when it registers a user pointing to the sky. The mode will allow the phone to detect different artifacts such as the moon and stars and adjusts settings such as exposure accordingly. Corroborating Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a>, the leak says the ultra-wide camera across the entire lineup will be getting an <a href=\"https://www.macrumors.com/2021/02/04/kuo-iphone-13-better-ultrawide-camera/\">improved sensor and lens</a>.</p><p>The newest information from the leaks points towards the ability to take portrait videos on this year's ‌iPhone‌. Users have been able to take portrait photos since the launch of the ‌iPhone‌ 7 Plus, but it has remained entirely limited to photos. Portrait mode adds a depth feel to your photos, blurring the background and keeping the center subject fully in focus. With videos, the task becomes much harder since the subject is actively moving, making it harder to add a depth effect in real-time.</p><p>The new information joins an already long list of features we're expecting for the 2021 ‌iPhone‌. A <em>Bloomberg</em> report suggests that the biggest headlining feature of the lineup will be the <a href=\"https://www.macrumors.com/2021/01/15/iphone-13-in-display-fingerprint-sensor/\">reintroduction of Touch ID on the iPhone</a>. According to that report, Apple is testing burying the <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a> sensor below the display, allowing users to unlock their device if Face ID is deemed unusable, such as when you're wearing a mask. Unlike the ‌iPhone 12‌ which saw delays due to the COVID-19 pandemic, the ‌iPhone 13‌ is expected to launch <a href=\"https://www.macrumors.com/2020/12/12/kuo-expects-iphone-13-mass-production-on-time/\">on time in September</a>.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/13/zuckerberg-facebook-inflict-pain-on-apple-privacy/\">Mark Zuckerberg Reportedly Told Staff Facebook Needs to 'Inflict Pain' on Apple Over Privacy Dispute</a></h3><p>Saturday February 13, 2021 2:33 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple and Facebook have been in a very public spat over the course of the last few months as Apple dials up its pro-privacy stance. The two companies have long had tension, but more recently, Facebook is taking shots at an upcoming iOS and iPadOS feature that will require apps and data companies such as Facebook to ask for users' permission before tracking them across other sites and websites. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/prosser-airtags-ipad-pro-next-month/\">Leaker Jon Prosser Claims AirTags and New iPad Pro to Be Announced Next Month</a></h3><p>Friday February 12, 2021 11:56 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple is slated to release a number of new products this year, and the first round of products could be just a few weeks away. YouTuber Jon Prosser, who has a mixed track record when it comes to reporting on Apple's plans, claims that AirTags and brand new iPad Pro models are set to be announced next month, presumably via a virtual event. Prosser, who runs the tech-news show \"Front Page...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/one-last-intel-mac/\">Apple Surprisingly Sticking With Intel Chips for One Last Mac</a></h3><p>Despite having begun the transition towards using its own custom silicon across the Mac product lineup, somewhat surprising recent rumors have suggested that Apple may continue to use Intel chips for one Mac model. Last year at WWDC, Apple announced plans to transition away from Intel chips to Macs built with its own Apple Silicon, such as the M1 chip, starting in late 2020. It set out its ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/intel-anti-mac-ad-campaign/\">Intel's Anti-Mac Ad Campaign Highlights M1 Shortcomings</a></h3><p>Thursday February 11, 2021 5:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of the M1 Macs last November, Apple officially began its transition away from Intel's chips, and it's clear from Intel's latest advertising campaign that the company is feeling threatened by Apple's decision. In ads shared on Twitter, Intel has been highlighting the shortcomings of Apple's M1 Mac lineup. An ad this week, for example, points out the gaming capabilities of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/iphone-tips-february-2021/\">Useful iPhone Tips You Might Not Know</a></h3><p>Friday February 12, 2021 3:00 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>There seem to be an endless number of iPhone tips and tricks to share, and that's because Apple's smartphones are so feature rich that it's impossible to keep up with everything they're capable of. We've rounded up some useful tips and hacks in our latest video, so check them out to see if there's something you didn't know about. Subscribe to the MacRumors YouTube channel for more videos. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/apple-turn-off-activation-lock-page/\">Apple Launches Self-Serve Portal for Initiating Activation Lock Removal Requests</a></h3><p>Friday February 12, 2021 8:13 am PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today added a new \"Turn off Activation Lock\" page to its website that provides steps users can take to turn off the security feature on an iPhone, iPad, or iPod touch. As noted on Reddit, the page includes a link to start an Activation Lock support request in the United States, meaning that customers no longer have to contact an Apple support representative by phone, email, or online...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/ipad-2021-major-upgrade/\">Major Upgrades Coming to the iPad in 2021</a></h3><p>Apple is looking to launch an updated ninth-generation iPad with a larger display, the A13 Bionic chip, 4GB of RAM, and a thinner, lighter design in the first half of this year, according to recent reports. Reports from cnBeta and Mac Otakara, citing supply chain sources in China, have offered similar projections for the ninth-generation ‌iPad, explaining that the updated device will...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/14/heart-month-activity-challenge/\">Apple's Heart Month Activity Challenge Requires 60 Minutes of Exercise on Valentine's Day</a></h3><p>Saturday February 13, 2021 10:15 pm PST by <a href=\"https://www.macrumors.com/author/frank-mcshan/\" rel=\"author\">Frank McShan</a></p><p>Today only, Apple Watch owners can complete a new Apple Watch activity challenge in celebration of Heart Month, which is aimed at promoting cardiovascular health. The challenge, which is listed in the Fitness app on the iPhone, tasks users with earning 60 minutes on their Exercise ring. Show your heart some love. Get this award by earning 60 minutes on your Exercise ring this Valentine's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/foundation-showrunner-hopes-for-80-episodes/\">'Foundation' Showrunner Hopes for Unparalleled 80 Episodes on Apple TV+</a></h3><p>\"Foundation\" writer and showrunner David Goyer is ambitiously hoping to tell Isaac Asimov's science-fiction story over the course of eighty hours, which is as yet unheard of on Apple TV+. Foundation tells the story of \"a band of exiles on their monumental journey to save humanity and rebuild civilization amid the fall of the Galactic Empire,\" and is based on Isaac Asimov's science-fiction...</p></div></div></div>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c924e3f9e49d974e4f879ecc9c4db8fb4563fe6e860a8cfdae48c1d79abc2537","category":"Apple"}