{"title":"French Regulator to Probe Apple's Upcoming Anti-Tracking Feature [Updated]","link":"https://www.macrumors.com/2021/03/17/french-regulator-probe-apple-anti-tracking/","date":1615978284000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/17/french-regulator-probe-apple-anti-tracking/\"><p>Apple will face a French antitrust probe into its upcoming App Tracking Transparency feature, following a complaint from advertisers in the country that the planned changes are anticompetitive.</p><p><img alt=\"app tracking pop up ios 14\" width=\"800\" height=\"448\" src=\"https://images.macrumors.com/t/VKwGYL_E9N_QBSRE5yIgse6kDeo=/400x0/filters:quality(90)/article-new/2020/07/app-tracking-pop-up-ios-14.jpg?lossy\" data-src=\"https://images.macrumors.com/t/VKwGYL_E9N_QBSRE5yIgse6kDeo=/400x0/filters:quality(90)/article-new/2020/07/app-tracking-pop-up-ios-14.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/VKwGYL_E9N_QBSRE5yIgse6kDeo=/400x0/filters:quality(90)/article-new/2020/07/app-tracking-pop-up-ios-14.jpg?lossy 400w,https://images.macrumors.com/t/hjH2S-eQ0tCsjqq_CScV_MYQoLg=/800x0/filters:quality(90)/article-new/2020/07/app-tracking-pop-up-ios-14.jpg?lossy 800w,https://images.macrumors.com/t/w3SZqjcAbeONjD8cItg-6I8a5vs=/1600x0/filters:quality(90)/article-new/2020/07/app-tracking-pop-up-ios-14.jpg 1600w,https://images.macrumors.com/t/GLW8XLmIQrVK1FAxn9zwFYLIPQw=/2500x0/filters:no_upscale():quality(90)/article-new/2020/07/app-tracking-pop-up-ios-14.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/VKwGYL_E9N_QBSRE5yIgse6kDeo=/400x0/filters:quality(90)/article-new/2020/07/app-tracking-pop-up-ios-14.jpg?lossy 400w,https://images.macrumors.com/t/hjH2S-eQ0tCsjqq_CScV_MYQoLg=/800x0/filters:quality(90)/article-new/2020/07/app-tracking-pop-up-ios-14.jpg?lossy 800w,https://images.macrumors.com/t/w3SZqjcAbeONjD8cItg-6I8a5vs=/1600x0/filters:quality(90)/article-new/2020/07/app-tracking-pop-up-ios-14.jpg 1600w,https://images.macrumors.com/t/GLW8XLmIQrVK1FAxn9zwFYLIPQw=/2500x0/filters:no_upscale():quality(90)/article-new/2020/07/app-tracking-pop-up-ios-14.jpg 2500w\"><br>Starting in iOS 14.5, Apple will require apps to get opt-in permission from users to collect their random advertising identifier, which advertisers use to deliver personalized ads and track how effective their campaigns were.</p><p>In light of the planned changes, a group of advertising companies and publishers filed a complaint in France <a href=\"https://www.macrumors.com/2020/10/28/ios-14-anti-tracking-prompt-antitrust-complaint/\">last year</a> alleging that the wording of Apple's permission prompt will lead most users to decline tracking of their device's advertising identifier, which could result in lost revenue.</p><p>On Wednesday, France's competition regulator rejected a plea from the group to block Apple's plan to restrict tracking of users' app usage, on the grounds that obtaining consent \"doesn't appear to be abusive.\" Instead, the probe will scrutinize whether Apple is being consistent in applying the same rules to itself.</p><p>Via <em><a href=\"https://www.bloomberg.com/news/articles/2021-03-17/apple-faces-french-antitrust-probe-into-ios-14-ad-changes\">Bloomberg</a></em>:<br></p><blockquote><p>The investigation will \"look closely\" at whether Apple applied less stringent rules to itself than to other services as it makes privacy changes to curb online tracking in its forthcoming <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a> software update, the authority's chief, Isabelle de Silva told reporters at a Paris press conference on Wednesday. The case shows the need for fast antitrust action into technical issues, she said, promising a final ruling by early 2022 at the latest.</p></blockquote><p>Apple's planned rollout of its new App Tracking Transparency feature has been controversial among advertisers from the off, with the upcoming feature drawing criticism from the likes of Facebook, which is <a href=\"https://www.macrumors.com/2020/08/26/facebook-ios-14-anti-tracking-ad-revenue-drop/\">concerned</a> that many users will not consent to being tracked across apps for ad personalization purposes.</p><p>App Tracking Transparency is different from Apple's own personalized advertising system, which the regulator is likely to scrutinize as part of its probe. Apple's ads system doesn't track users across apps and doesn't identify users to target its ads. Instead, it relies on the anonymous grouping of users' shared characteristics such as apps downloaded, age, country or city of residence, and gender.</p><p>In a statement given to <em>Bloomberg</em>, Apple said it was \"grateful\" to the authority for \"recognizing that app tracking transparency in ‌iOS 14‌ is in the best interest of French iOS users,\" and said it looked forward to working with regulators on user privacy and competition.</p><p><strong>Update:</strong> Apple issued the following statement to <em>MacRumors</em> in response to the French Competition Authority:</p><blockquote><p>We're grateful to the French Competition Authority for recognizing that App Tracking Transparency in ‌iOS 14‌ is in the best interest of French iOS users. ATT will provide a powerful user privacy benefit by requiring developers to ask users' permission before sharing their data with other companies for the purposes of advertising, or with data brokers. We firmly believe that users' data belongs to them, and that they should control when that data is shared, and with whom. We look forward to further engagement with the FCA on this critical matter of user privacy and competition.</p></blockquote><p><small>Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our <a href=\"https://forums.macrumors.com/forums/political-news.218/\">Political News</a> forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.</small></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/15/apple-shares-jump-airpods-pro-ad/\">Apple Shares 'Jump' AirPods Pro Ad</a></h3><p>Sunday March 14, 2021 9:09 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today shared a new AirPods Pro-focused ad called \"Jump\" on its YouTube channel, highlighting the Active Noise Cancellation and Transparency features of the earbuds in a creative way. In the spot, a man wearing AirPods Pro jump ropes through the city. It's set to the song \"Fallin' Apart\" by Young Franco, and it features the tagline \"Turn the world into your playground with AirPods Pro.\" ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/13/top-stories-apple-event-rumor-march-23/\">Top Stories: Apple Event Rumored for March 23, iMac Pro and HomePod Discontinued, and More</a></h3><p>Rumors about a potential Apple event are starting to heat up as we're getting close to the time of year when Apple frequently hosts an event, so stay tuned for more information on that front in the coming days and weeks. This week also saw Apple confirm it has discontinued both the iMac Pro and the original HomePod, while rumors are continuing to look forward to new Apple silicon MacBook Pro ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/duckduckgo-google-search-spying-on-users/\">DuckDuckGo Calls Out Google Search for 'Spying' on Users After Privacy Labels Go Live</a></h3><p>Monday March 15, 2021 12:06 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Over the course of the last several weeks, Google has been adding App Privacy labels to its iOS apps in accordance with Apple's App Store rules, but it took Google multiple months to begin sharing the information. There was speculation that Google's delay meant that it had something to hide, which DuckDuckGo is leaning into with a new tweet that highlights Google's data collection and calls...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/march-23-apple-event-rumored-ipad-airpods-airtags/\">March 23 Apple Event Rumored to Unveil New iPad Pro, AirPods 3, and AirTags</a></h3><p>Apple will hold its first event of 2021 on March 23 to reveal new products, according to a reliable Chinese leaker known as \"Kang.\" The event could see the unveiling of new iPad Pro models, updated AirPods, and the long-awaited AirTags item trackers. Kang has said Apple's March event will be held on the same date as the OnePlus 9 reveal, which is scheduled for Tuesday, March 23, opening up...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/iphone-12-aluminum-color-issues/\">Some iPhone 11 and iPhone 12 Models Losing Color From Aluminum Body</a></h3><p>Monday March 15, 2021 10:02 am PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Some iPhone 12 models have been losing color from their aluminum chassis, according to a new report from Svetapple.sk, which includes photos of a PRODUCT(RED) iPhone 12 model that has been noticeably leached of color. The side of the iPhone 12 near the power button has faded to an orange shade and there's a clear delineation where the red coloring has worn off. Svetapple.sk says that the...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/apple-maps-live-crowd-data-testing/\">iOS 14.5: Apple Maps Could Feature Real-Time Crowd Data for Points of Interest</a></h3><p>Monday March 15, 2021 5:02 am PDT by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>With iOS and iPadOS 14.5 scheduled for an early spring release, Apple has begun testing a new feature that could provide Apple Maps users with real-time crowd data for points of interest, similar to Google Maps. In the iOS and iPadOS 14.5 beta, an updated section in the \"Location Services\" menu of Apple's Privacy settings states that Apple will collect data from users, such as when a...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/airpods-3-mass-production-q3-2021/\">Kuo: AirPods 3 Mass Production to Start in Q3 2021</a></h3><p>Sunday March 14, 2021 11:55 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Mass production will begin on the third-generation AirPods in the third quarter of 2021, according to an investors note from analyst Ming-Chi Kuo that was seen by MacRumors. If mass production is not set to begin until the third quarter of 2021, it would mean that the AirPods 3 wouldn't ship until later in the year. Kuo previously said back in November that the AirPods 3 would launch in the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-silicon-mac-shipments-forecast/\">Next-Generation Apple Silicon MacBooks Expected to Drive Record-Breaking Mac Shipments This Year</a></h3><p>In a research note shared with MacRumors today, Barclays analysts said they expect Apple to report record Mac shipments in the 2021 fiscal year. Apple has seen strong demand for Macs driven by the COVID-19 pandemic and the release of Apple silicon Macs. With rumors indicating that Apple plans to release redesigned 14-inch and 16-inch MacBook Pro models with Apple silicon in the second half...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/13/iphone-12-cook-ad/\">Apple Promotes iPhone 12 'Ceramic Shield' Display In New 'Cook' Ad</a></h3><p>Saturday March 13, 2021 10:04 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>In a new ad on its YouTube channel, Apple is promoting the durability and water resistance of the iPhone 12 and the performance of the \"Ceramic Shield\" display. The ad, named \"Cook,\" showcases a chef putting an iPhone 12‌ through its paces by splashing it with liquids and flour, plus dropping it on its screen multiple times. The ad aims to highlight the \"Ceramic Shield\" display on the...</p></div></div></div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"c95f5a8adc6d6b9c63c2a4e09960120b74987dcfb83e71aee63a418e1f38a3db","category":"Apple"}