{"title":"Met Manta Mips: aero helmet upgraded and streamlined","link":"https://www.cyclist.co.uk/news/9246/met-manta-mips-aero-helmet-upgraded-and-streamlined","date":1613411568000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Met has launched the Manta Mips, an update to its aero helmet, which the brand says adds protection and saves even more watts than its predecessor.</p><p>The previous Manta, sold as 'one of the most competitive sprinter's helmets in the game', saw Met brand focus on cutting weight and watts while ensuring enough ventilation and safety features.</p><p>This upgrade sees Met pair the strengths of the original Manta with important upgrades in safety, fit and aerodynamics.</p>&nbsp;<h3>Catching rays</h3><p>It maintains the minimalist design of the Manta, with the same NACA Vent on the crown that Met says ensures enough air gets in to cool the rider but without increasing drag.</p><p>What the Manta didn't have though was Mips. The slip-plane liner technology allows the helmet to move independently of the rider's head in the event of an impact, potentially reducing the rotational violence experienced by the brain.</p>&nbsp;<p>Changes have been made for better comfort too, with the helmet's inner shape taking inspiration from the Trenta 3K Carbon sported by the like of Tadej Pogačar and UAE-Team Emirates.&nbsp;Also new is the 360° head belt that spreads pressure evenly around the head for extra comfort and can be adjusted for a better fit vertically and at the back of the head.</p><p>The Manta's performance characterisitics have been updated too. Met says the lower profile and tube shape of the Manta Mips saves on average four watts on both the previous model and its competitors when wind-tunnel-tested at 33kmh to 80kmh.</p><p>Met are also keen to stress that the Manta Mips also has sunglasses ports, presumably for the portion of your ride that doesn't require an aerodynamic edge.</p>&nbsp;<h3>Specs, price and weight</h3><p>The Met Manta Mips is available in six colourways including a metallic red and matt black option inspired by UAE Team Emirates's colours.</p><p>Met says a size M weighs in at 250g, with small and large falling 20g either side of that, which is slightly more than the old Manta which ranged from 200-230g.</p><p>It's a touch more expensive too, coming in at £220.</p>&nbsp;<table><tbody><tr><td><strong>Specifications</strong></td></tr><tr><td>In-mould polycarbonate shell with EPS liner</td></tr><tr><td>Mips-C2 Brain Protection System</td></tr><tr><td>Sunglasses ports</td></tr><tr><td>Fidlock magnetic buckle</td></tr><tr><td>Safe-T Orbital Fit System</td></tr><tr><td>360° head belt, vertical and occipital adjustment</td></tr><tr><td>Ponytail compatible</td></tr><tr><td>Hand washable comfort pads</td></tr><tr><td>Air Lite straps with anchors embedded into liner</td></tr><tr><td>Adjustable cam divider</td></tr><tr><td>Reflective rear decals</td></tr><tr><td>15 vents, internal air channeling</td></tr><tr><td>Helmet soft bag</td></tr></tbody></table></div></div>","author":"wstrickson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"c968eabbd11083d5bb776fd2d858f302914599c51328e73b0b16396a236272e2","category":"Cycling"}