{"title":"Preview: What you need to know about stage 2 of the 2021 Tour de France","link":"https://cyclingtips.com/2021/06/preview-what-you-need-to-know-about-stage-2-of-the-2021-tour-de-france/","date":1624742482000,"content":"<div><div><p><strong>Date: </strong>Sunday June 27<br><strong>Start: </strong>Perros-Guirec<br><strong>Finish: </strong>Mûr-de-Bretagne<br><strong>Distance: </strong>183.5 km</p><p>Another tough day on the heels of a chaotic and challenging opening stage! Just like stage 1, this stage features four fourth-category climbs and two third-category climbs. And just like stage 1, the last of those climbs takes riders to the finish line.</p><p>Those last two climbs are both on the famous Mûr-de-Bretagne. The riders will hit the top for the first time with 17.5 km to go, then do a loop before hitting the climb once more. From this approach the Mûr-de-Bretagne is 2 km at 6.9% but 10% for the first kilometre. It gets a little easier from there.</p><p>Note there are time bonuses available at the top of the first ascent of the Mûr-de-Bretagne (eight, five and two seconds). Could this have a bearing on the GC early in the race?</p><p><strong>What to watch for:</strong> The first 115 km runs along the Atlantic coast so it could be windy.<br><strong>Who’s it for:</strong> Probably the puncheurs again, but expect some climbers and GC men in the mix.<br><strong>Dane Cash’s picks:</strong> <em>The rider in yellow looks like a great bet to double up on stage wins at this Tour de France – Julian Alaphilippe has the perfect skill set for the Mûr-de-Bretagne and he’s clearly in great form. Mathieu van der Poel will again be a potential contender as well. Primož Roglič and Tadej Pogačar, who both got involved in the action on the final climb of stage 1, could also be in the mix again on Sunday.</em></p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/TDF21_ET02_carte-1340x1895.jpeg\"></figure></div></div>","author":"CyclingTips","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"cb31123b14ea0c5277b054c99e9e26cf05e0edaae7dfb101e4ed74b46d824d4d","category":"Cycling"}