{"title":"Sony acquires world’s largest fighting-game tourney series","link":"https://arstechnica.com/?p=1750715","date":1616102422000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>new finisher: signing a contract —</h4><h2 itemprop=\"description\">Next online event, coincidentally, will only include PlayStation games.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/evo-arena-2017-800x450.jpg\" alt=\"A video game plays on giant screens over a packed arena.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/evo-arena-2017.jpg\" data-height=\"576\" data-width=\"1024\">Enlarge</a> <span>/</span> <em>Street Fighter V</em>'s top-eight world finals tournament at EVO 2017, held at the Mandalay Bay casino arena in Las Vegas, Nevada.</p></figcaption></figure><p>When it comes to acquisitions in the gaming industry, headlines usually revolve around big-ticket video games or backend software. Some news from Sony on Wednesday saw a major acquisition come in a much different form: the EVO gaming tournament series.</p><p>When it comes to fighting-game tournaments, none has proven larger or more long-lasting than EVO, which grew from a grassroots community effort in the '90s to a formal physical-event series in 2002. It expanded to include a Japanese variant, EVO Japan, in 2018, and it hosted over 14,000 players in 2019 to compete for a prize pool of over $200,000.</p><p>However, after its 2020 tournaments were transformed into an online-only, pandemic-era series, EVO co-founder Joey Cuellar was accused of sexual assaulting minors—and he confirmed the allegations in a public statement (<a href=\"https://twitter.com/MrWiz/status/1278846403716866048\">since removed from Twitter</a>). Shortly afterward, <a href=\"https://arstechnica.com/gaming/2020/07/major-games-players-depart-evo-tourney-citing-allegations-against-founder/\">EVO removed Cuellar from all operational duties and canceled its EVO 2020 plans</a>.</p><h2>Going online, (somewhat) rolling back</h2><p>Sony Interactive Entertainment didn't mention the 2020 cancellation in its Wednesday announcement. Instead, the industry behemoth is jumping ahead to confirm that it would move forward with a wholly online EVO 2021 tournament series. Fans who want to compete will have to wait for details on \"online qualifier\" events, while the official finals will be held over the span of two weekends,&nbsp;August 6-8 and August 13-15.</p><p>In a break from EVO tradition, this event will be wholly free to sign up for and compete in. Prior EVO tournaments have determined their prize pools in part by number of paying participants; how prize money pools will change for EVO 2021 remains to be seen.</p><p>The announced games for EVO 2021 include <a href=\"https://arstechnica.com/gaming/2017/06/tekken-7-review-get-ready-for-the-next-good-pc-fighting-game/\"><em>Tekken 7</em></a>, <em>Street Fighter V: Champion Edition</em>, <a href=\"https://arstechnica.com/gaming/2019/01/mortal-kombat-11-gameplay-as-seen-by-a-1990s-arcade-rat/\"><em>Mortal Kombat 11 Ultimate</em></a>, and the upcoming <a href=\"https://arstechnica.com/gaming/2021/02/how-guilty-gear-saved-its-online-play-in-a-post-offline-world/\"><em>Guilty Gear Strive</em></a>. Coincidentally, all of those games are available on PlayStation, and two of those series are currently PlayStation console exclusives.</p><p><a href=\"https://twitter.com/MarkMan23/status/1372640707492519941?s=20\">On Twitter</a>, EVO business development relations rep Mark Julio announced that \"EVO is still open to all platforms\" and that PlayStation's leadership is \"enabling us to continue working with our community to support fighting games.\" Whether that means we'll see longtime EVO series, particularly Nintendo's <a href=\"https://arstechnica.com/tag/super-smash-bros/\"><em>Smash Bros.</em></a>, appear at future EVO events remains to be seen—but for EVO's online-only 2021 edition, the focus on PlayStation-only games does stand out.</p><p>For fighting-series diehards keeping track, only two of those announced games (<em>MK11</em>, <em>GGS</em>) include wholly functional&nbsp;<a href=\"https://arstechnica.com/gaming/2019/10/explaining-how-fighting-games-use-delay-based-and-rollback-netcode/\">delay-based rollback netcode</a>, thus guaranteeing a smoother connection in cases where opponents face off in wildly different regions and face the inherent limits of latency. (Devs for <em>Tekken</em> and <em>Street Fighter</em> allege that they have implemented similar systems as well, but real-world performance doesn't add up.)&nbsp;<a href=\"https://arstechnica.com/gaming/2021/02/how-guilty-gear-saved-its-online-play-in-a-post-offline-world/\">We're pretty bullish about wanting more rollback</a>, and in a dream world, Sony's new relationship with EVO could prioritize such netcode in fighting games going forward.</p></div></div>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cb6f9f70bcc838ea91d9e2bfe68cc629bccec13fd9ed23832451fecce060277b","category":"Tech"}