{"title":"Arizona House advances bill targeting Apple, Google mobile app stores","link":"https://arstechnica.com/?p=1747066","date":1614892230000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>epic fight —</h4><h2 itemprop=\"description\">The Arizona bill has already gotten farther than a similar one in ND did.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1190825943-800x533.jpg\" alt=\"The Arizona State Capitol museum, flanked by the House of Representatives building (R) and a cactus (L). \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1190825943.jpg\" data-height=\"3648\" data-width=\"5472\">Enlarge</a> <span>/</span> The Arizona State Capitol museum, flanked by the House of Representatives building (R) and a cactus (L).</p></figcaption></figure><p>The Arizona state House of Representatives this week passed a landmark bill that would, if adopted, require Google and Apple to allow Arizona-based app developers to choose their own alternate payment systems.</p><p>The House voted 31-29 in favor of the bill (<a href=\"https://www.azleg.gov/legtext/55leg/1R/proposed/H.2005COBB.pdf\">PDF</a>), which does not directly mention either major mobile platform but nonetheless squarely targets both, as the text specifically applies to any \"digital application distribution platform\" that has more than 1 million cumulative downloads in a calendar year <em>from Arizona users</em>.</p><p>The text prohibits those platforms from locking either Arizona-based developers <em>or</em> Arizona-based users into using proprietary first-party in-app payment systems. It also prohibits platforms from retaliating against Arizona consumers or developers for opting into using a payment system \"that is not owned by, operated by or affiliated with the provider.\"</p><p>The bill, just like <a href=\"https://arstechnica.com/tech-policy/2021/02/north-dakota-lawmakers-jump-into-apple-epic-fight-with-new-app-store-bill/\">North Dakota's before it</a>, applies to app stores and payment processing services on \"general-purpose hardware,\" such as tablets, smartphones, computers, and other similar devices, but explicitly excludes \"special-purpose digital application distribution platforms\" such as gaming consoles and music players. In short, it's a narrow window that means \"Google and Apple\" without actually having to mention either. (As written, the bill could also apply to the Mac OS and Windows app stores, but those platforms already do not restrict developers or users the same way Android or iOS do.)</p><h2>This sounds familiar...</h2><p>The North Dakota state Senate last month <a href=\"https://arstechnica.com/tech-policy/2021/02/north-dakota-lawmakers-jump-into-apple-epic-fight-with-new-app-store-bill/\">discussed an extremely similar bill</a>, but ultimately voted 36-11 against adopting the measure. Both bills are so similar largely because they're being promoted by the same organization: the <a href=\"https://arstechnica.com/gadgets/2020/09/epic-spotify-and-others-take-on-apple-with-coalition-for-app-fairness/\">Coalition for App Fairness</a>.</p><p>Back in August, <em>Fortnite</em> developer Epic Games <a href=\"https://arstechnica.com/tech-policy/2020/08/epic-gives-fortnite-players-discounts-for-skirting-apple-google-fees/\">deliberately baited Apple</a> by launching a short-lived alternative in-app payment system for iOS <em>Fortnite</em> players. Apple responded within hours by booting <em>Fortnite</em> off the platform, and Epic was ready. The two are now embroiled in a <a href=\"https://arstechnica.com/gaming/2020/11/judge-dismisses-apples-theft-claims-in-epic-games-lawsuit/\">high profile, high-stakes antitrust suit</a>.</p><p>Epic is far from the only firm to complain about Apple's app store practices in recent months, and a dozen other firms including <a href=\"https://arstechnica.com/tech-policy/2019/03/apples-in-app-purchase-rules-could-violate-european-competition-law/\">Spotify</a>, <a href=\"https://arstechnica.com/gadgets/2020/06/why-one-email-app-went-to-war-with-apple-and-why-neither-one-is-right/\">Basecamp</a>, and <a href=\"https://arstechnica.com/tech-policy/2020/08/protonmail-founder-apple-uses-monopoly-to-hold-all-of-us-hostage/\">Protonmail</a> joined it to launch the coalition in September. The lobbying group, which now boasts more than 45 members, has proposed similar legislation in several other states; Arizona is the first where either legislative chamber has advanced a bill.</p><p>Both Apple and Google <a href=\"https://www.protocol.com/policy/apple-google-lobbyists-arizona-bill\">sent their own lobbyists to Arizona</a> to try and halt the bill. \"This bill tells Apple it cannot use its own checkout lane and collect a commission in the store we built,\" Apple executive Kyle Andeer told Arizona lawmakers in a February hearing.\"</p><p>Support for the bill in the Arizona House <a href=\"https://legiscan.com/AZ/rollcall/HB2005/id/1020665\">did not break down</a> along the party lines in the way one might expect for an antitrust-related bill. While antitrust reform at the federal level is currently <a href=\"https://arstechnica.com/tech-policy/2021/02/klobuchar-targets-big-tech-with-biggest-antitrust-overhaul-in-45-years/\">more likely to come from Democrats</a>, most of the support for the Arizona bill came from Republicans. Of the 31 votes in favor, 27 came from Republican representatives and 4 from Democrats. The tally was almost exactly inverted among the 29 \"nay\" votes, where 25 came from Democrats and 4 from Republicans.</p><p>\"I think they have a monopoly on the market right now,\" said Rep. Regina Cobb, a Republican who sponsored the bill. \"There isn’t anybody in here that doesn’t have a Google Android or Apple phone, I guarantee it.\"</p><p>Alternatively, \"Arizona does not have an interest in this fight,\" Democratic Rep. Diego Rodriguez said. \"We don’t have a dog in this fight, what we need to do is be focused on policies that are protecting consumers. This bill does not protect consumers, it protects a $1 billion company from another billion-dollar company.\"</p></div></div>","author":"Kate Cox","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cb74b50923e4463f257649086faf37494b0b96c9862f4ba3e945409ab6daf2f3","category":"Tech"}