{"title":"Interview: Kirsten Wild retires from road racing","link":"https://cyclingtips.com/2021/08/interview-kirsten-wild-retires-from-road-racing/","date":1630178431000,"content":"<div><div><p>Kirsten Wild rode her last road race on Friday, but it was not really the way she’d planned it. The Simac Ladies Tour was always going to be her last road race, but a positive COVID-19 case in the team meant that the entire Ceratizit-WNT team had to withdraw from the race with two stages to go.</p><p>“This is not the way I would have planned it but on the other hand it’s fitting for the past one and a half years where we hardly did any track tournaments due to the pandemic,” Wild told CyclingTips. “I got COVID myself and missed the Spring Classics in autumn of 2020, and again this spring. It was a period in which I had to fight really hard. That it ends now with something corona-related again is fitting.” </p><p>Her last ever road stage was the third stage of her home race – also fitting. Due to a massive crash, there wasn’t the bunch sprint she’d looked forward to, and Wild herself also hit the deck. </p><p>“When we heard about the positive test yesterday, I thought I was fine with how this ended because the stages on Saturday and Sunday didn’t and don’t suit me, but this morning it was different and it was harder than I thought,” Wild said. “That moment I put away my bike on Friday was the last time ever, and I would have liked to have experienced that moment more consciously.</p><p>“Cycling has been a part of me for over 20 years. It hit a nerve more than I thought,” she continued in a soft voice.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/CORVOS_00033444-059-1-1340x893.jpg\"><figcaption>Kirsten Wild during the Simac Ladies Tour prologue</figcaption></figure><p>Wild started her career 20 years ago and remembers that very first win vividly – the first of 109. It was a sprint, of course.</p><p>“The [AA Drink] team said they would ride for me and I was surprised because we had better riders on the team,” Wild recalled. “We rode towards a breakaway in a race called Omloop door Middag-Humsterland, through the Dutch wind. I won the sprint from a reduced group and I remember it was the first time I thought: ‘yeah, I can do this.’”</p><p>The now 38-year-old rider from Zwolle, in the northeast of the Netherlands, specialized in racing in windy conditions at races like the Healthy Ageing Tour, Simac Ladies Tour, Chongming Island and the Tour of Qatar, where she won 10 sprint stages.</p><p>“I loved the racing in Qatar where the wind was always a factor and we played those tactical games on the bike,” Wild recalled fondly. “There was this one stage where I got back a group on my own and won the stage. Later you think: ‘oh, that was really cool’. I also loved winning the prologue in the Giro [in 2009] and wearing that pink jersey. That’s a thing I would advise my younger self now: ‘enjoy the moment more’. I really enjoyed the racing and still do but it’s usually going on and on. There is not always a moment to stand still and reflect. In hindsight I would have done that more.” </p><p>Wild was prolific in both road and track racing. On the velodrome, she won no less than eight world titles, three of those on her home track in Apeldoorn. </p><p>“I think that’s the absolute highlight of my career. Winning a world title is always amazing but to do it with family and friends present is something that can’t be topped. Well, that’s what I say now because who knows what I will say in ten years’ time,” she laughed. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/CORVOS_00032111-091-1340x893.jpg\"><figcaption>Amy Pieters and Kirsten Wild win the madison world title in Berlin 2020</figcaption></figure><p>Wild might have closed the book on her road career, but there are still the European and Track World Championships later this season. Although Wild is not sure yet what she will do.</p><p>“I don’t think I have anything to prove anymore,” she said. “That bronze medal in the omnium in Tokyo was a great way to end it. I always wanted an Olympic medal and now I have one. On the other hand, I am also a team with Amy Pieters in the Madison; I crashed in Tokyo in the Madison and we didn’t get a medal. We have two world titles already so we don’t have a thing to prove, but this is a decision I can’t make on my own. We are a team so I will give that some more thought.”</p><p>And after that? Wild sees a promising new generation of fast and strong young Dutch riders like Lonneke Uneken and Maike van der Duin coming up. She would like to continue in the sport in one way or another, but there isn’t a firm plan yet. </p><p>“After a period without big names, we now have a huge pool of new talent coming through in the Netherlands. At first, I thought: ‘what do I know that I can share with them?’, but I think I have a great deal of valuable experience. I have done a study in physical education and taught at high schools. There is a link there, that’s for sure, and I love working with young people. I will just take my time and look around to see what fits me. I haven’t thought about these things because the past one and a half years were all about Tokyo.”</p><p>Her immediate plans are much more personal.</p><p>“First I want to go on holiday without the bike,” she said, then changed her mind. “Well, maybe not even without the bike because I love riding my bike. My good friend Marijn and I go on a 220-kilometre ride next week to catch up.</p><p>“I mean on a holiday with my boyfriend without the need to train. Just to ride my bike, have a coffee stop and some cake, and not worry about the intervals or schedules. I look forward to stress free riding,” she concludes. “I also want to spend time with family because that’s something that I missed a lot in the past one and half years.”</p></div></div>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"cbd45fe2d618014ee15621c90b5b82fb26cb67b5698acaeea29c281fe64825e8","category":"Cycling"}