{"title":"3T adds a motor to the Exploro with new Racemax Boost e-gravel bike","link":"https://cyclingtips.com/2021/05/3t-adds-a-motor-to-the-exploro-with-new-racemax-boost-e-gravel-bike/","date":1621018727000,"content":"<div><div><p>3T has never been shy about pushing gravel bike design, first with the original Exploro aero-gravel bike in 2016 and then last year with the updated <a href=\"https://cyclingtips.com/2020/06/3t-exploro-racemax/\" target=\"_blank\">Exploro Racemax</a>. 3T has now gone a step further, adding the Exploro Racemax Boost e-bike with drop bar and flat bar options to its gravel bike family. </p><p>The new e-bike sticks with the same base frame as the Racemax launched just last year. As such, the e-bike has the same geometry as the Racemax, plus the same incredibly wide down tube, dropped seatstays, double dropped chainstays, and truncated tubing almost all over. </p><figure><ul><div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-2-1340x754.jpg\"><figcaption>Sure to be the most popular, the drop bar Exploro Racemax Boost</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-1-1340x754.jpg\"><figcaption>The flat bar version 3T claims offers “ultimate control”</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-Ultralight-12-1-1340x754.jpg\"><figcaption>Ultra high end Ultralight version</figcaption></figure></li></div></div></ul></figure><p>3T says it also wanted to maintain the agility of a fun gravel bike, and as such, the bike couldn’t be overly weighty. To achieve this, 3T turned to the Mahle X-35 e-bike system, which fits into the Racemax frame with no changes to the tube shapes (another benefit of that huge down tube). 3T says it also choose the Mahle system because of its smooth power ramp and drag-free pedaling when it’s turned off. </p><p>The new bike is available in three build options with the drop bar and flat bar options identical in everything except the bar and lever setup. 3T has equipped both options with Shimano GRX groupsets and 3T’s Disqus tubeless-ready wheelset.</p><p>At the top of the range sits the Ultralight version for weight and aero weenie e-gravel riders. The market for a lightweight and aero e-bike may be niche, but the result is an enviable claimed weight of 9.8 kg (21.61 lb) in full gravel setup, including the e-bike system. </p><p>3T uses the same frame and fork across all three models, and so has turned to some super-light components to achieve the sub-10 kg weight on the Ultralight. The Ultralight is built with a SRAM Red eTap AXS wireless electronic groupset, 3T’s Torno Team lightweight crankset with “ultra-narrow” 142 mm Q-factor, 3T Superergo LTD carbon handlebar, Carbon-Ti X-Rotor steel-carbon 160 mm rotors, and Panaracer GravelKing TLC 700×38 mm tyres. </p><p>Both the GRX build options retail at US$6,999 / £7,299 / €6,999 (thanks Brexit), which is a lot of money for a gravel bike if not entirely out of the ordinary, especially given the inclusion of the e-bike system. However, at this price, the flat bar option is one hefty price tag for a commuter focused e-bike. At US$9,999 / £10,299 / €9,999, it will only be a lucky few weight weenies who gets to enjoy the Ultralight model. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-13-1340x754.jpg\"><figcaption>The Mahle X-35 battery integrates into the standard Racemax tube sizes.</figcaption></figure><p>The Exploro range has always had aerodynamics at the core of its design ethos, with 3T marketing it as a sort of quiver killer in its ability to keep up in a fast group ride while still feel at home riding on gravel. </p><p>We’ve long maintained that quiver killers don’t really exist, at least not as much as we might hope, and as such the Racemax wasn’t as fast as a true road bike or as capable as a mountain bike, will the addition of a motor help? </p><p>3T say it designed this bike with three rider types in mind: the adventurer looking for some assistance to extend their exploring range; the group rider looking to level the playing field with a little bit of support; and the commuter looking to arrive at work without building up a sweat and still hit the gravel on the way home. </p><p>Sure, an e-gravel bike won’t be for everyone, but the new Exploro Racemax Boost offers some promise for those in the e-quiver killer market.</p><p>On paper at least, this makes sense. A little extra assistance to help with the fast group rides on the road with an extra boost for taking turns on the front or holding on for dear life at the back (although the 26 km/h motor cutout will obviously limit that role). Do e-bikes make sense for gravel? Well, we’ve <a href=\"https://cyclingtips.com/2020/05/do-e-bikes-make-sense-for-gravel/\">tried to answer that question before</a>. The short answer is yes, for many they’re a great option.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-9-1340x754.jpg\"><figcaption>The Mahle X-35 motor is built into the rear hub.</figcaption></figure><p>Personally, I quite like the idea of building an e-bike around an aero frame. The aerodynamics usually touted as efficiency gains for the rider offer the same benefits to an e-bike’s battery. I have a pet hate for road e-bikes weighed down by mountains of extra drag compared to their non-e-bike siblings. While I haven’t yet had the pleasure of trying one, gravel e-bikes seem like one of the best and most fun use cases for an e-bike motor. Put the two together and, at least in my book, 3T might be on to a winner.  </p><p>Only time (and a review) will tell if the 3T Exploro Racemax Boost is a hit or a miss. It certainly looks good on paper, but there are a number of areas for concern. </p><p>Using the same frame and fork as the standard Racemax has its advantages, but as CyclingTips global tech editor James Huang found out in his <a href=\"https://cyclingtips.com/2021/03/3t-exploro-racemax-review-a-one-bike-solution-with-one-big-downside/\" target=\"_blank\">review of the Racemax</a>, it is not without its flaws. Most notably is the limited tyre clearance and awkward cable routing entry port. Perhaps more worrying is the “curious handling quirks and overly muted ride quality.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-5-1340x754.jpg\"><figcaption>Sure the under bottom bracket position will put the charging point out of sight, but is still a peculiar place for electronics.</figcaption></figure><p>Now add to these concerns a peculiar forward-facing, under the bottom bracket charging port located on the new Boost model. Even accounting for a port cover on the bike (not pictured), I worry about having the charging port in one of the most exposed areas of a bike. If I think about my gravel routes, this area could be hit with mud, bottom bracket-deep river crossings ,and snow all on the one ride – not an ideal mix of conditions to blast a charging port. </p><p>By opting for the Mahle system, 3T has also eliminated some of the Racemax’s versatility. Currently, the Boost model is only available with 700c wheels. Although a 650b version may follow, it is very unlikely anyone would ever have the Mahle system built into both a 700c and 650b wheelset. </p><p>The Mahle system also requires a button on the top tube to control the system. This button controls and displays the assistance mode, and also displays battery level with colours in the halo around the button. While this system works, it doesn’t provide much information and also requires the rider to take their eyes away from the road/trail and look down at the top tube. This is neither natural nor easy to see when moving at speed on an e-bike.</p><p>One thing for sure, 3T has certainly upped the ante again in the gravel bike space, offering what it claims is the lightest e-gravel bike, arguably the lightest e-aero road bike, also. Time will tell if the Boost can live up to its promise. </p><p>The 3T Exploro Racemax Boost is available to order now at <a target=\"_blank\" href=\"http://trk.klclick.com/ls/click?upn=6gVj1d-2FB2CtvyLOoIKCnlV3UvpPD2vX2OyW-2FuC-2Fit-2FgvIfNYxahG-2BaOosN2NJtUwklFUi7oxTvMsh-2B883zGBx7RntoIVVy6i97-2B-2FxMrbS6vqWfE1zxGikTH5gwsvTYZwFmxeLcK9e5oQTG-2F6VZN-2BuG3UVPNhqwoWdGTEfPWNOWhdt6dhHj3IdgYssIQs4we-2F6DGtsPDKK66jWc-2FyBQBLDQ-3D-3DMi47_q-2BdpEcq7WJfuCP40fqxszPxFHGsRosZlFAqzCrabindJQ-2BWC8mYR4-2BWClmdeg8kNclOEHLKm37JtKDV7BriuyqU270NpM-2BI-2FGrRvtJTlh9zxVfzZn7pztFGwjvg2fug99S-2Fu7FD3vGgQlXAQUEQ0cEqg4E4XkTVSQFV5ybGX5WOmFrjJTEVdvB-2BQOxH6Loi8WdvRHUwgX-2Bt8Fl0xlOdmFOahfGHlS-2FNX6alf4l3yCrSUrCgFHUaAW4-2FfoeotZDFm04BOHKPZZgVeV1uSBo-2FUR5-2BjJBH-2Fm-2Bk7aLe4ZtZ15TsfGTtt8hws-2B6SeWySusonNItkUQSMqKGGV6dOCjZLDe6pS6MJI-2FdjgDhE3aWTXfkZrhL-2BD210ozMBOp8zjKutWI3VJEYp1x7vhzjcuCjkQrM19ihp8R-2Fku0EMsIL1GH08-3D\">3T.Bike</a> and official 3T retailers, with shipping expected to commence from June to September. </p><figure><ul><div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-3-1340x754.jpg\"><figcaption>The drop bar Shimano GRX equipped Exploro Racemax Boost.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-4-1340x754.jpg\"><figcaption>The Exploro has always offered an aerodynamic option for gravel riding.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-6-1340x754.jpg\"><figcaption>Want to charge your e-bike? Careful of the chainring tattoo</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-7-1340x754.jpg\"><figcaption>Thats one plush commuter bike! Better bring it into the office!</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-8-1340x754.jpg\"><figcaption>The Ultralight weighs in at a claimed 9.8 kg and is equipped with SRAM Red eTap AXS.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-Ultralight-13-1-1340x754.jpg\"><figcaption>Lightweight, tick. Aero, tick. The 3T Torno is said to be very aero partly due to its narrower Q-factor, and it is also super light.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/05/3T-Exploro-Racemax-Boost-12-1340x754.jpg\"><figcaption>The Mahle system is controlled with this button on the top tube.</figcaption></figure></li></div></div></ul></figure></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"cc142454b44744c8c494fd3160077edad45732762a44aa6e2098e0c0830fc1fe","category":"Cycling"}