{"title":"Bahrain defiant with ‘nothing to hide’ after hotel raid","link":"https://cyclingtips.com/2021/07/bahrain-defiant-with-nothing-to-hide-after-hotel-raid/","date":1626358361000,"content":"<div><p></p><h4>Mohoric in stage 16 of the Tour de France.</h4><p></p><div><p>A defiant but calm Matej Mohorič stood before reporters at the start of Thursday’s Tour de France stage and pushed back on any suggestion that police had cause to raid the Bahrain-Victorious hotel. </p><p>“I have nothing to hide,” he said. </p><p>The raid, managed by the same organization that raided Arkea-Samsic’s hotel after last year’s Tour de France, involved about 50 officers, who searched riders’ phones and computers.</p><p>A preliminary investigation was opened by a prosecutor in Marseille into possible “acquisition, transportation, possession, and importing of a prohibited substance or method for use by an athlete without justification by members of Team Bahrain Victorious, currently in action at the 2021 Tour de France.”</p><p>Possessing, using, and selling doping products are all criminal offenses in France. </p><p>There is no indication that anything untoward was uncovered. Police acquired some of the team’s training and power files and requested to see communications via phones and computers. </p><p>“They went through all the phones, all the personal messages,” Mohorič said. “They took some rider’s phones some rider’s computers, they checked all our belongings, all the trucks. Of course they didn’t find anything because we have nothing to hide, no?</p><p>“It was like 50 of them, they talked to every single one of us.”</p><p>The raid occurred Wednesday evening shortly after the team arrived at its hotel for the evening. It took about an hour, according to Bahrain rider Wout Poels, and delayed the normal recovery and dinner processes of the team.</p><p>“Following stage 17, we were greeted by several French police officers. We were not given a warrant to read through, but the team complied with all the officers’ requests,” Bahrain Victorious sport director Vladimir Miholjevic said.</p><p>“The process had impacted our riders’ recovery and meal planning.”</p><p>Mohorič echoed that sentiment in his interview ahead of stage 18.</p><p>“We were left without massage, without dinner yesterday, we had in the room just some snacks,” Mohorič said. “What can you do, it’s the Tour de France. We have something to prove, we go out today and race even more determined.”</p><p>The Office Central de Lutte contre les Atteintes à l’Environnement et la Santé Publique (OCLAESP) is conducting the investigation and performed the raid with permission from a judge in Marseille, according to a police statement. </p><p>“The existence of this investigation and the operations carried out do not in any way predict the existence of criminal offenses,” the statement reads. “Anyone suspected or prosecuted is presumed innocent until proven guilty.”</p><p>The raid on Arkea-Samsic after last year’s Tour initially resulted in two individuals being brought into custody. Both were released and no further action has been taken. </p><p>As is often the case in cycling, exceptional results appear to be at the base of suspicions around the team. Bahrain-Victorious has 18 victories this season, including two stages at this Tour de France, three at the Criterium du Dauphine, and two at the Giro d’Italia. The team was far less victorious last year when it was called Bahrain-McLaren and won only 9 races the entire year, albeit in a Covid-reduced season.</p><p>Mohorič appeared baffled as to why Bahrain in particular was the subject of the raid, though aspersions have been cast the team’s way in recent weeks. In a report in Le Parisien in early June, two anonymous individuals, including one team director, expressed doubts over the team’s credibility. Both individuals admitted they had no hard evidence to back up their suspicions.</p><p>“We don’t care, we are more determined than ever to go out there to show ourselves to do as well as we did up to this point, to take control of the race, of the tea GC,” Mohorič said. “We are more focused than ever to do this last mountain stage and I think we’ll be flying today.”</p></div></div>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"cd0c54c3c7e37461b308ffa24101b612ec97183c817297ee2e0ea1203a08d8e9","category":"Cycling"}