{"title":"Vaccine FOMO is real. Here’s how to deal with it","link":"https://arstechnica.com/?p=1752604","date":1616881580000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Irritation over innocculation —</h4><h2 itemprop=\"description\">The waiting is the hardest part—but there are steps you can take to manage the anxiety.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/scrubs-800x534.jpg\" alt=\"Vaccine FOMO is real. Here’s how to deal with it\"><figcaption><p>Michael Ciaglo | Getty Images</p></figcaption></figure><p>It's late on a Tuesday night, and you’re running through your usual routine. You go through your social media, blocking everyone who has posted an ecstatic shot selfie. You check, and double-check, your state’s eligibility requirements. Maybe you monitor your state’s daily vaccine counts; maybe you have the page <em>bookmarked</em>.</p><p>If this describes you, you may have the symptoms of <a href=\"https://www.health.harvard.edu/blog/you-got-the-covid-19-vaccine-i-have-vaccine-envy-2021031122140\">vaccine envy</a>. This condition is characterized by jealousy, anger, or frustration at the fact that so many people—but not you!—have already received lifesaving protection from Covid-19. Yes, President Biden has announced that <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/11/fact-sheet-president-biden-to-announce-all-americans-to-be-eligible-for-vaccinations-by-may-1-puts-the-nation-on-a-path-to-get-closer-to-normal-by-july-4th/\">all Americans will be eligible for the vaccine by May 1</a>. But after a year, waiting these last few weeks or months seems like the hardest of all.</p><p>Being stressed out is a normal response. Psychologists call this “painful uncertainty.” It’s a uniquely aggravating condition associated with life-changing situations where you have no control over the outcome. It’s also pretty common, as anyone who has waited for a positive pregnancy test or a call back from a job interview can tell you.</p><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/wired-logo.png\" width=\"218\" height=\"58\"></figure><p>Dr. Kate Sweeny is a psychology researcher who leads the Life Events Lab at the University of California Riverside and studies waiting in painful uncertainty. “A lot of the aspects of this pandemic have been riddled with uncertainty,” she said in a phone call to WIRED. “Even if it doesn’t necessarily look exactly like waiting for a medical test result, uncertainty is uncertainty, and it’s challenging to cope with. The vaccine piece has just added another layer of uncertainty on what was already a very tall uncertainty sandwich.”</p><h2>Manage your expectations</h2><p>Most people believe that managing your expectations means either choosing to be optimistic or pessimistic—that you can only either believe in a positive outcome or brace yourself for bad news. But you don’t have to do one or the other. You can do both at the same time, or change how you feel over the course of time. Both positive and negative expectation management techniques have their benefits.</p><p>Positive expectation management, or being optimistic about when you might get the shot, is the strategy that most of your friends and family will hope you’ll pursue. If your hopes are high, you’ll probably pursue <a href=\"https://pubmed.ncbi.nlm.nih.gov/31983235/\">health-promoting behaviors</a>, like eating well and getting into great shape in anticipation of a summer of sun, biking, and barbecues. However, if those positive expectations are dashed, then you might feel worse than before.</p><p>“People tend to alter their expectation management strategy over time, and it’s a good thing when we do that,” Sweeny said. “When you’re pretty far from a moment of truth, people are pretty optimistic on average. As we get closer, people start to brace for the worst.”</p><p>Everyone is living in their own separate pandemic, with their own family situations, jobs, and state guidelines. But at this point, it’s a foregone conclusion that you’ll have the vaccine in a few months if you want it. If you’re starting to get aggravated, it’s for an understandable reason. “It feels pretty bad right now because we’re getting close to the end,” Sweeny said.</p><h2>Seek social support carefully</h2><p>Effective vaccines may foretell the end of the pandemic. But there’s still uncertainty involved—will you be able to get an appointment? Will you suffer side effects? When will children get it, and when will herd immunity be reached? As a social human, I turn to my fellow human beings when I’m distressed. However, when you’re waiting in painful uncertainty, it’s hard to know what help you need.</p><p>Your friends and family may be able to help you when you’re grieving, or share your joy when you’re happy, but waiting in painful uncertainty doesn’t have an accepted social script. Do you want your friends to be upbeat and optimistic? Or would it help to have them be more realistic about when you’ll get the shot? The wrong social support can be ineffective, or worse.</p><p>In <a href=\"https://psycnet.apa.org/record/2019-23042-001\">a study led by Michael Dooley at Washington College</a>, researchers studied three separate groups waiting in painful uncertainty. They recruited participants from Amazon’s Mechanical Turk, recent Ph.D graduates looking for jobs, and law school graduates taking the bar exam; solicited open-ended responses about how they received social support.</p><p>Unsurprisingly, most people just wanted someone who would show up, whether that’s by answering the phone, listening to their frustrations, or, in this case, standing in physical proximity, six feet away in the yard, wearing a mask. But venting and looking for common ground online can also backfire if it makes you start ruminating on your negative thoughts.</p><p>“Different things work for different people in different moments. A lot of the time, we don’t know what we want ourselves,” Sweeny said. “It’s not about good or bad support, it’s really more about being responsive to a person’s needs in the moment.”</p><p>If you’re not getting the support you need from your friends and family, be open and honest about what helps and doesn’t help. If you’re upset that you won’t be eligible for the vaccine for months, it probably won’t ease your distress to get a long lecture about how Uncle Weehoo deserved it first. “This is why I didn’t tell anyone on social media when I got the vaccine,” laughed Sweeny. “Judgments like that are pretty universally unappreciated.”</p><h2>Find your flow</h2><p>One of the most effective tips for assuaging the agony of painful uncertainty is to find ways to stop thinking about it. Sweeny’s work has shown that achieving a state of wonder helps a lot. You can become full of awe by contemplating any phenomena that makes you feel small in the grand scheme of things—whether that’s by listening to a magnificent piano sonata, watching a few episodes of <em>Planet Earth</em>, or finding a random canyon to gaze into.</p><p>“[Awe] is a complex feeling, but as a result it’s pretty powerful,” Sweeny said. “It seems to be good at periods of uncertainty.”</p><p>Admittedly, though, some people are more open to the experience of awe than others. And not everyone can walk out on their back deck and look at the aurora borealis every time they need a mood boost. <a href=\"https://www.wired.com/story/how-to-set-up-a-home-meditation-space/\">Mindful meditation</a> has also been shown to be effective at breaking the cycle of anxious, obsessive thoughts, but likewise, not everyone can or wants to sit still and breathe for 5 to10 minutes every day, either.</p><p>Perhaps the most achievable way to distract yourself is by achieving a “flow state”. Sweeny describes <a href=\"https://news.ucr.edu/articles/2020/04/17/how-can-you-beat-covid-19-blues-find-your-flow\">the state of flow</a> as complete immersion in an activity. Think of it as being “in the zone.” During the state of flow, time passes without noticing (trying to achieve flow is probably why so many of us took up <a href=\"https://www.wired.com/story/bread-boom-science-stephen-jones/\">bread-baking</a> early in quarantine) and your mind becomes quiet.</p><p>Almost any activity that requires active engagement can become a flow activity. “The best kinds of activities for that challenge you a bit, but not too much, so you’re not frustrated but you’re not bored and where you can see that you’re making progress towards a goal that you set,” said Sweeny. Almost anything can be turned into a flow activity that fits these parameters, whether that’s cleaning, childcare, or my quarantine favorite, playing video games.</p><p>“Video games are perfect for flow,” said Sweeny. “It’s challenging, it gets harder as you get better. You’re meeting concrete goals.”</p><h2>Be kind to yourself</h2><p>At this point, waiting for the vaccine seems like a straightforward matter. But it’s not. Waiting without any control over the outcome sucks.</p><p>“People often ask me what types of uncertainty are more stressful than others,” Sweeny said. “And honestly, people waiting for a cancer biopsy give me the same kinds of numbers as people dealing with infertility, or someone in a lab waiting to see if someone else finds them attractive. Uncertainty is just really stressful, no matter what the domain.”</p><p>What works for others may not work for you, but there are a variety of strategies you can try besides having your already-vaccinated friends tell you to try not to think about it. If all else fails, playing <em>AC: Valhalla</em> <a href=\"https://www.wired.com/story/its-ok-to-quit-video-games/\">for hundreds of hours</a> has worked wonders for me.</p><p><em>This story originally appeared on <a href=\"https://www.wired.com/story/vaccine-fomo-how-to-wait-tips/\">wired.com</a>.</em></p></div></div></div>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cdcebda99ee0e5dadb9168b1b32ddfcd6896715853573a8ed08d2b25cd883718","category":"Tech"}