{"title":"Using whale songs to image beneath the ocean’s floor","link":"https://arstechnica.com/?p=1741444","date":1613070002000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Sing me a seismograph —</h4><h2 itemprop=\"description\">Seismic data generated by whale songs helps build a picture of the ocean's base.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/5184x3456-04_finwhale-noaa-pifsc-800x533.jpg\" alt=\"Image of a large whale.\"><figcaption></figcaption></figure><p>People tend to think of seismic waves as little more than signals of tectonic events, like an earthquake or lava shifting under a volcano. But these vibrations are also our best way of getting a clear picture of our planet's internal structure. By watching how the vibrations' paths shift as they encounter different materials, we can get a picture of where different rock layers meet, where rock becomes molten, and more.</p><p>In some cases, we get this picture by waiting for a natural event to produce the seismic waves. In others, we get impatient and set off explosive charges or use a powerful sound-making device. Today, V<span>áclav Kuna and John&nbsp;</span><span>Nábėlek of Oregon State University</span>&nbsp;are describing yet another option: waiting for a whale to float by. Using the songs of passing fin whales, the researchers were able to reconstruct the upper layers of the seafloor off the coast of Oregon.</p><h2>Quite a song</h2><p>The song of a fin whale is not exactly the sort of thing you'd typically describe as musical. It's generally in the area of 20Hz, which sounds more like a series of clicks than a continual sound, and the whales produce it in second-long bursts separated by dozens of seconds. But they are <em>loud</em>. A <a href=\"https://www.uofmhealth.org/health-library/tf4173\">guidance on hearing risks</a> places danger at any level above 80 decibels&nbsp;and the loudest concerts as hitting roughly 120 decibels. A fin whale's song can be in the neighborhood of 190 decibels, and it typically goes on for hours.</p><p>As it turns out, the frequency of whale calls is within the range of a bunch of underwater seismographs that researchers had placed on the ocean floor west of the coast of Oregon. These seismographs sample for signals 100 times every second, so they can easily pick up the song of a fin whale.</p><p>And in fact, the equipment had picked up the songs. By focusing on the calls themselves, <span>Kuna and&nbsp;</span><span>Nábėlek</span> could track the whales as they went along singing.</p><p>The songs they recorded typically went on for hours, during which time the whales cruised through the area at a rate of between 4 and 10 kilometers an hour. This meant that the song-filled trips ranged from 15 to 40 kilometers. During these trips, each individual whale produced anywhere from 200 to 500 individual bursts that could be picked up by the seismographs.</p><p>But the whale's songs don't only reach the seismographs by a direct route. Some of the sound waves get there after bouncing off the ocean's surface or floor—and some of them bounce between the two more than once. Others hit the ocean floor and then bounce off the different layers of material below it. All of them reach the instrument at different times within the 40-second window between each individual sonic element of the song.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Screen-Shot-2021-02-10-at-5.37.18-PM.png\" data-height=\"468\" data-width=\"885\" alt=\"The echoes created by a fin whale are rather complicated.\"><img alt=\"The echoes created by a fin whale are rather complicated.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Screen-Shot-2021-02-10-at-5.37.18-PM-640x338.png\" width=\"640\" height=\"338\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Screen-Shot-2021-02-10-at-5.37.18-PM.png 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Screen-Shot-2021-02-10-at-5.37.18-PM.png\" data-height=\"468\" data-width=\"885\">Enlarge</a> <span>/</span> The echoes created by a fin whale are rather complicated.</p><p>Kuna and Nábelek</p></figcaption></figure><p>Reconstructing the exact details of which signals arise, and when, is complicated, to put it mildly. But earth science researchers have a great deal of experience with this sort of thing. Waves that take certain paths require enough physical space between the whale and the seismometer to undergo all the reflections involved. So certain elements are cut off when the whale gets closer than 12 kilometers, and another set cut out at 4 kilometers.</p><p>By piecing these details together, <span>Kuna and</span>&nbsp;<span>Nábėlek were</span> able to figure out the thickness of the sediment layer, a layer formed by lava flows below that, and more robust volcanic rock below that. The seismometers were even sensitive enough to register differences in the amount of sediment,&nbsp;which ranged from 400 to 650 meters thick, that had built up.</p><p>Overall, the resolution wasn't as good as you'd get with human-triggered sound sources from the surface of the water. But critically, you don't need an actual boat above the seismograph array to get data. That's not a huge limitation for a specific study, but there are probably a lot more underwater sensors out there than there are people intentionally making seismic waves for them to pick up. And fin whales have a global range, so there's likely to be a few around.</p><p>There are areas with a complicated topography—meaning lots of lumps on the ocean's floor—where reading whale song probably wouldn't be all that effective. But the researchers behind this work think they can probably boost the resolution by using a different whale with a higher-frequency song. They specifically suggest that sperm whales would probably do the trick.</p><p><em>Science</em>, 2021. DOI: <a href=\"http://dx.doi.org/10.1126/science.abf3962\">10.1126/science.abf3962</a> &nbsp;(<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cdefe01d389f2a6a98c4dc607bd82db8a714c449ee5857039c9ccf722578ff47","category":"Tech"}