{"title":"Preview: The Women’s WorldTour wraps up at Ronde van Drenthe","link":"https://cyclingtips.com/2021/10/preview-the-womens-worldtour-wraps-up-at-ronde-van-drenthe/","date":1634855178000,"content":"<div><div><p>After what feels like an extra-long season the Women’s WorldTour will finally wrap up at Ronde van Drenthe this Saturday, October 23. The biggest races are behind us and some of the peloton has called it quits on the 2021 season. In fact, Movistar and FDJ Nouvelle-Aquitaine Futuroscope have already withdrawn from the race, but the startlist for this iconic Dutch Classic is still stacked with big names.</p><p>First introduced in 2007 the Ronde van Drenthe is one of the most brutal early season races. The 2020 edition was one of those that fell victim to the global pandemic and the 2021 race nearly met the same fate but instead of cancelling it, race organizers opted for a late fall weekend instead.</p><p>The list of former winners of the Ronde van Drenthe falls heavy on the sprinter side with names like Amalie Dideriksen, Amy Pieters, Jolien D’Hoore, and Marianne Vos. But the race has also come down to a small selection, like in 2014 when Lizzie Deignan narrowly beat Anna van der Breggen to take the victory. The most recent Ronde van Drenthe, in 2019, was won by Marta Bastianelli in a three-way sprint against Chantal van den Broek-Blaak and Ellen van Dijik.</p><p>This edition is a little up in the air. With many the riders ready to hit their off-season and some still hunting a result, there’s no telling what type of race action we will see.</p><h2>The course and the weather</h2><p>The terrain in the northern part of the Netherlands is as flat as can be but the Ronde van Drenthe still found some minor elevation as an added test for the riders. The “hill” in question is the dreaded VAM-Berg, a man-made construction that featured in the Dutch national championships the last two years.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/womens-worldtour-ronde-van-drenthe-2021-result-profile-cce848521d-1-1340x507.jpg\"></figure><p>The peloton will cover 140 km with a smattering of cobbles along the way from Assen to Hoogeveen. They will take on the VAM-Berg four times before the 15 km run-in to the finish.</p><p>Luckily for the riders, it looks like Saturday is going to be dry. The weather prediction is around 13 ºC with only 12 km/h winds and a 15% chance of precipitation. All in all, it could be the nicest weather Ronde van Drenthe has ever seen.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/womens-worldtour-ronde-van-drenthe-2021-result-map-b406cd1ecf.jpg\"></figure><h2>Who to watch</h2><p>Given the course, previous editions, and the current time of year, we are looking at either a sprinter or a gutsy go-getter winning on Saturday.</p><p>As noted, Movistar and FDJ Nouvelle-Aquitaine Futuroscope have already announced they won’t be able to make it up north – due to injuries within the team and lack of numbers. Liv Racing is only able to field four riders while Alé BTC Ljubljana, Canyon-SRAM, and Team BikeExchange will only start with five instead of the usual six.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/GettyImages-1344945376-2-1340x893.jpg\"></figure><p>SD Worx will line up with its usual cast of heavy hitters including three previous winners. <strong>Jolien D’Hoore</strong> and <strong>Amy Pieters</strong> (see image above) have both won the Ronde van Drenthe, as has <strong>Chantal van den Broek-Blaak</strong>. They will also have <strong>Christine Majerus</strong> starting on Saturday, someone who is always right around the top but usually working for others.</p><p>Between D’Hoore and Pieters, SD Worx has two fantastic sprinters to ride for, both of whom will not see the VAM-Berg as a threat. Young up-and-comer <strong>Lonneke Uneken</strong> is also one to keep an eye on from SD Worx. She won the VAM-Berg stage of the Healthy Ageing Tour back in March, but that was a much different finale.</p><p>Trek-Segafredo had to call <strong>Trixi Worrack</strong> out of retirement to field a full six-woman team. Along with Worrack, the American team has two strong sprinting options in <strong>Chloe Hosking</strong> and <strong>Letizia Paternoster</strong>. Hosking, especially, is a threat on this course, and with <strong>Ellen van Dijk</strong> helping her with any setbacks, the Australian could take another WorldTour victory on Saturday.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/GettyImages-1344440601-1340x893.jpg\"></figure><p>As far as aggressive and opportunistic riders go Trek-Segafredo has <strong>Audrey Cordon-Ragot</strong>, who always finds herself up the road but never seems lucky enough to be in the winning move.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/GettyImages-1344420867-1340x893.jpg\"></figure><p>If you’re looking for a fighter, look no further than <strong>Alison Jackson</strong>. The Canadian has had an excellent end to the 2021 season with wins in the Ladies Tour Norway, the Simac Ladies Tour, and both the road and time trial titles at the Canadian National Championships. Jackson is a great shout to take the win on Saturday and it would be her first WorldTour one-day victory. Especially because Liv Racing will start without Lotte Kopecky, the team’s go-to for this type of event.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/GettyImages-1345510487-1340x893.jpg\"></figure><p>If the race does come down to a sprint it will be hard for anyone to beat <strong>Lorena Wiebes</strong>. Wiebes has proved in 2021 that she is the best sprinter in the peloton at the moment with a handful of one-day victories, stage victories at the Giro Donne, Lotto Belgium Tour, and AJ Bell Women’s Tour.</p><p>Some other teams have a shot at victory, like Canyon-SRAM with their sprinter <strong>Alice Barnes</strong> or their rouleur <strong>Elise Chabbey</strong>. Jumbo-Visma’s <strong>Anouska Koster</strong> shouldn’t be forgotten, nor her teammate <strong>Riejanne Markus</strong>.</p><p>A handful of smaller teams will be keen to show their worth on Saturday too. The two key jerseys to keep an eye out for are NXTG Racing – the Dutch U23 women’s team – and GT Krush Tunap. Both teams boast strong young talent looking to make a jump up or hone their skills before the 2022 season starts.</p><h2>How to watch</h2><p>Ronde van Drenthe will be streamed live via GCN+ in all available territories, starting at 2pm local time (CET).</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ce21c2b804b90f91448e5404aa2b0c4e0bb17826e733af938c10c89ad0e8be83","category":"Cycling"}