{"title":"New browser-tracking hack works even when you flush caches or go incognito","link":"https://arstechnica.com/?p=1743712","date":1613739268000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>BROWSER FINGERPRINTING —</h4><h2 itemprop=\"description\">At least 4 top browsers affected by \"powerful tracking vector,\" researchers say.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/browser-tracking-800x534.jpg\" alt=\"New browser-tracking hack works even when you flush caches or go incognito\"><figcaption><p>Getty Images</p></figcaption></figure><p>The prospect of Web users being tracked by the sites they visit has prompted several countermeasures over the years, including using <a href=\"https://privacybadger.org/\">Privacy Badger</a> or an alternate anti-tracking extension, enabling private or incognito browsing sessions, or clearing cookies. Now, websites have a new way to defeat all three.</p><p>The technique leverages the use of favicons, the tiny icons that websites display in users’ browser tabs and bookmark lists. Researchers from the University of Chicago said in a <a href=\"https://www.cs.uic.edu/~polakis/papers/solomos-ndss21.pdf\" target=\"_blank\" rel=\"noopener\">new paper</a> that most browsers cache the images in a location that’s separate from the ones used to store site data, browsing history, and cookies. Websites can abuse this arrangement by loading a series of favicons on visitors’ browsers that uniquely identify them over an extended period of time.</p><h2>Powerful tracking vector</h2><p>“Overall, while favicons have long been considered a simple decorative resource supported by browsers to facilitate websites’ branding, our research demonstrates that they introduce a powerful tracking vector that poses a significant privacy threat to users,” the researchers wrote. They continued:</p><blockquote><p>The attack workflow can be easily implemented by any website, without the need for user interaction or consent, and works even when popular anti-tracking extensions are deployed. To make matters worse, the idiosyncratic caching behavior of modern browsers, lends a particularly egregious property to our attack as resources in the favicon cache are used even when browsing in incognito mode due to improper isolation practices in all major browsers.</p></blockquote><p>The attack works against Chrome, Safari, Edge, and until recently Brave, which developed an effective countermeasure after receiving a private report from the researchers. Firefox would also be susceptible to the technique, but a bug prevents the attack from working at the moment.</p><p>Favicons provide users with a small icon that can be unique for each domain or subdomain on the Internet. Websites use them to help users more easily identify the pages that are currently open in browser tabs or are stored in lists of bookmarks.</p><p>Browsers save the icons in a cache so they don't have to request them over and over. This cache isn't emptied when users clear their browser cache or cookies, or when they switch to a private browsing mode. A website can exploit this behavior by storing a specific combination of favicons when users first visit it, and then checking for those images when users revisit the site, thus allowing the website to identify the browser even when users have taken active measures to prevent tracking.</p><p>Browser tracking has been a concern since the advent of the World Wide Web in the 1990s. Once it became easy for users to clear browser cookies, websites devised other ways to identify visitors’ browsers.</p><p>One of those methods is known as device fingerprinting, a process that collects the screen size, list of available fonts, software versions, and other properties of the visitor's computer to create a profile that is often unique to that machine. A 2013 study found that 1.5 percent of the world’s most popular sites <a href=\"https://arstechnica.com/information-technology/2013/10/top-sites-and-maybe-the-nsa-track-users-with-device-fingerprinting/\">employed the technique</a>. Device fingerprinting can work even when <a href=\"https://arstechnica.com/information-technology/2017/02/now-sites-can-fingerprint-you-online-even-when-you-use-multiple-browsers/\">people use multiple browsers</a>. In response, some browsers have attempted to curb the tracking by <a href=\"https://arstechnica.com/gadgets/2020/01/firefox-72-blocks-fingerprinting-scripts-by-default-rethinks-notification-pop-ups/\">blocking fingerprinting scripts</a>.</p><h2>Two seconds is all it takes</h2><p>Websites can exploit the new favicon <a href=\"https://en.wikipedia.org/wiki/Side-channel_attack\">side channel</a> by sending visitors through a series of subdomains—each with its own favicon—before delivering them to the page they requested. The number of redirections required varies depending on the number of unique visitors a site has. To be able to track 4.5 billion unique browsers, a website would need 32 redirections, since each redirection translates to 1 bit of entropy. That would add about 2 seconds to the time it takes for the final page to load. With tweaks, websites can reduce the delay.</p><p>The paper explains it this way:</p><blockquote><p>By leveraging all these properties, we demonstrate a novel persistent tracking mechanism that allows websites to reidentify users across visits even if they are in incognito mode or have cleared client-side browser data. Specifically, websites can create and store a unique browser identifier through a unique combination of entries in the favicon cache. To be more precise, this tracking can be easily performed by any website by redirecting the user accordingly through a series of subdomains. These subdomains serve different favicons and, thus, create their own entries in the Favicon-Cache. Accordingly, a set of N-subdomains can be used to create an N-bit identifier, that is unique for each browser. Since the attacker controls the website, they can force the browser to visit subdomains without any user interaction. In essence, the presence of the favicon for subdomain in the cache corresponds to a value of 1 for the i-th bit of the identifier, while the absence denotes a value of 0.</p></blockquote><p>The researchers behind the findings are: Konstantinos Solomos, John Kristoff, Chris Kanich, and Jason Polakis, all of the University of Chicago. They will be presenting their research next week at the <a href=\"https://www.ndss-symposium.org/ndss-program/ndss-2021/\">NDSS Symposium</a>.</p><p>A Google spokesman said the company is aware of the research and is working on a fix. An Apple representative, meanwhile, said the company is looking into the findings. Ars also contacted Microsoft and Brave, and neither had an immediate comment for this post. As noted above, the researchers said Brave has introduced a countermeasure that prevents the technique from being effective, and other browser makers said they were working on fixes.</p><p>Until fixes are available, people who want to protect themselves should investigate the effectiveness of disabling the use of favicons. Searches <a href=\"https://duckduckgo.com/?q=chrome+disable+favicon&amp;atb=v110-1&amp;ia=web\">here,</a> <a href=\"https://duckduckgo.com/?q=safari+disable+favicon&amp;atb=v110-1&amp;ia=web\">here</a>, and <a href=\"https://duckduckgo.com/?q=edge+disable+favicon&amp;atb=v110-1&amp;ia=web\">here</a> list steps for Chrome, Safari, and Edge respectively.</p></div></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cfbc0b2e35f38611690809f420f804b56d08d7beacb9a85ee27c1d86351238dc","category":"Tech"}