{"title":"Caruso on his ‘not planned’ stage 20 victory: ‘It was magical’","link":"https://cyclingtips.com/2021/05/caruso-on-his-not-planned-stage-20-victory-it-was-magical/","date":1622308360000,"content":"<div><p></p><h4>Damiano Caruso wins stage 20 of the Giro d'Italia</h4><p></p><div><p>Damiano Caruso started this Giro d’Italia as a domestique and will likely finish it on the podium, as a first-time stage winner whose career highlight was a long time coming.</p><p>Caruso of Bahrain-Victorious set off three weeks ago riding for the on-form Mikel Landa, but he and the rest of his team were left scrambling at the end of stage 5 after their leader crashed out of the race. They rallied, though, and rallied fast, Gino Mäder winning from the breakaway the very next day. Meanwhile, Caruso found himself comfortably in the top 10 overall and he’s been on an uphill trajectory ever since.</p><p>It was a familiar position for the Italian, who has often hovered quietly around the top ten of grand tours. He was eighth at the Giro once before, ninth at the Vuelta, and 10th and 11th at the Tour de France. In recent years he’s been a faithful lieutenant in the service of riders like Landa, but that sort of form doesn’t simply disappear when leadership passes to another.</p><p>The 33-year-old Italian has been particularly strong in the challenging third week of this Giro, finishing third in the wintery weather on the shortened stage 16, which saw him climb to second overall, and coming home fifth and fourth on stages 17 and 19 respectively. He and race leader Egan Bernal traded seconds all week, and going into stage 20, Caruso had a deficit of 2:29.</p><p>With whispers as to Bernal’s enduring fitness, it was all to play for on the last road stage of the Giro.</p><p>“I knew that today, for me, would be very important to confirm the podium and try to hang on to 2nd place,” Caruso said after stage 20, “but what happened was a stupendous stage. My companions and I rode in great fashion, we made the most of it and in the final, it was magical.”</p><p>The pace was set by Romain Bardet’s Team DSM on the Passo San Bernardino, the first climb of the stage and the longest of the whole Giro. Their efforts brought the breakaway to within a minute over the top and then Bardet and two teammates sped away from the peloton very early in the descent. Caruso proved most attentive in the bunch.</p><p>“The move was not planned,” Caruso said. “On the descent from San Bernardino we saw that Team DSM were increasing the pace, and me and Pello Bilbao decided to follow them because we thought to get ahead could be a good strategy. In the end, it turned out to be the winning move.”</p><p>By the final climb Caruso and Bardet had one teammate each and both put everything into maintaining the ever-falling gap to the pink jersey group. Though Team DSM had worked longest and hardest throughout stage 20, it was Caruso who benefited most in the end, keeping just enough in reserve to ride away from the Frenchman and take a maiden Grand Tour stage victory.</p><p>“Before Pello was dropped, I thanked him, because he had done a fabulous job,” he said, “and it was especially satisfying to be able to finish it off with the win.”</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d0ce46920319ec36e651998b0d9c24faae9856e5b2ac6e6f0f33ebafd2f0c4a5","category":"Cycling"}