{"title":"Google’s Wear OS neglect has left voice activation broken for months","link":"https://arstechnica.com/?p=1745111","date":1614275626000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Really, it's amazing any part of Wear OS still works —</h4><h2 itemprop=\"description\">Broken voice commands are the latest sign that Google doesn't care about Wear OS.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/09/Android-Wear-OS-800x445.jpg\" alt=\"A Wear OS watch. \"><figcaption><div><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/09/Android-Wear-OS.jpg\" data-height=\"1067\" data-width=\"1920\">Enlarge</a> <span>/</span> A Wear OS watch.</p></div><p>Ron Amadeo</p></figcaption></figure><p>Poor, dying Wear OS.</p><p>Apparently, the Google Assistant on Wear OS has been broken for months, and until now, no one at Google has noticed. About four months ago, diehard Wear OS users <a href=\"https://issuetracker.google.com/issues/172776291\">started a thread</a> on the&nbsp;public Android issue tracker saying that the \"OK Google\" hotword no longer worked on Wear OS, and several claimed that the feature has been broken for months. Recently, news of the 900-user-strong thread spilled over to the <a href=\"https://www.reddit.com/r/Android/comments/lrafcr/ok_google_hotword_detection_is_now_broken_on/\">Android subreddit</a>, and after <a href=\"https://9to5google.com/2021/02/25/wear-os-hey-google-assistant-broken/\">9to5Google</a> and other news sites picked it up, Google has finally commented on the issue.</p><p><a href=\"https://www.theverge.com/2021/2/24/22300211/google-responds-wear-os-hey-google-not-responding\">The Verge</a>&nbsp;quotes a Google spokesperson as saying the company is&nbsp;“aware of the issues some users have been encountering,” and it will “address these and improve the overall experience.” Google didn't give an ETA on how long a fix would take. Google offered a similar boiler-plate response back in that November thread, with a rep <a href=\"https://issuetracker.google.com/issues/172776291#comment5\">saying</a>, \"We’ve shared this with our engineering teams and will continue to provide updates as more information becomes available.\"</p><p>Wear OS' broken voice system is the latest in a long line of signs that Wear OS is a dead platform and that it has been abandoned by Google. Google's last major update for Wear OS was <a href=\"https://arstechnica.com/gadgets/2018/09/review-googles-wear-os-2-0-cant-fix-its-obsolete-smartwatch-hardware/\">in 2018</a>, and many of Google's newer services have opted to not support the platform. Google Play Music had a standalone offline music app for Wear OS, which was fantastic if someone was out jogging and wanted to leave their phone at home.&nbsp;<a href=\"https://arstechnica.com/gadgets/2020/10/rip-google-play-music-2011-2020/\">Play Music is dead</a> now, and its replacement, YouTube Music, <a href=\"https://www.androidpolice.com/2020/10/15/youtube-music-proves-google-cares-more-about-apple-watch-than-its-own-wear-os-platform/\">supports the Apple Watch</a> but not Wear OS. Google Hangouts is another <a href=\"https://arstechnica.com/gadgets/2020/10/google-chat-goes-free-in-2021-while-hangouts-loses-features-this-month/\">dying Google app</a> that had great support for Wear OS, but its replacement, Google Chat, doesn't support the OS. Updates to Google Fit a few months ago&nbsp;<a href=\"https://www.androidpolice.com/2020/11/27/google-fit-removes-advanced-weight-training-tracking-on-wear-os/\">killed</a> the Wear OS weight training feature, which was one of the best parts of the platform.</p><p>Wear OS' hardware has also been a disaster. Qualcomm suffocated the platform by letting it go <a href=\"https://arstechnica.com/gadgets/2020/06/the-snapdragon-wear-4100-is-qualcomms-first-smartwatch-upgrade-in-six-years/\">six years</a> without a significant SoC upgrade, leading to slow hardware that struggled to run <a href=\"https://arstechnica.com/gadgets/2017/02/lg-watch-sport-review-googles-bulky-watch-lets-you-leave-your-phone-at-home/3/#h2\">the latest features</a>. Every major hardware company that once supported Wear OS—brands like Samsung, LG, Motorola, Huawei, Asus, and Sony—has abandoned it. Wear OS devices are only sold by fashion brands now.</p><p>Google's new fling in the wearables space <a href=\"https://arstechnica.com/gadgets/2021/01/google-closes-the-fitbit-acquisition-pledges-to-not-use-data-for-ads/\">is with Fitbit</a>, a company it recently acquired for $2.1 billion. Years ago, Fitbit was a trailblazer in simple, cheap step counters, but today the company is an also-ran with <a href=\"https://9to5google.com/2020/03/11/report-googles-recently-acquired-fitbit-accounted-for-6-of-wearable-market-in-2019/\">single-digit market share.</a>&nbsp;Fitbit hasn't been able to adapt to low-end pressure from cheap Chinese fitness trackers and high-end competition from the Apple Watch. It's not clear how combining Fitbit's failing wearables company with Google's failing wearables division will lead to any kind of success, but at this point, all we can do is wait and watch.</p></div></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d231771a9939abf6ea3b0be01ff46fe41e26d5ec45cf326af2f6d05b886df97d","category":"Tech"}