{"title":"All US Apple stores are open for the first time in almost a year","link":"https://arstechnica.com/?p=1746682","date":1614795858000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Retail —</h4><h2 itemprop=\"description\">COVID-19 isn't gone, but like much of the US, Apple is moving forward.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/06/apple-store-covid-800x534.jpg\" alt=\"Masked people mill about the glass walls adorned with the Apple logo.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/06/apple-store-covid.jpg\" data-height=\"683\" data-width=\"1024\">Enlarge</a> <span>/</span> NEW YORK, June 17, 2020 - Staff workers serve customers outside an Apple store on Fifth Avenue.</p></figcaption></figure><p>For the first time in just a few days shy of a year, all Apple Store retail locations in the United States are open this week, <a href=\"https://9to5mac.com/2021/03/01/apple-retail-stores-us-all-reopened/\">reports</a> 9to5Mac.</p><p>Apple first closed all retail locations outside of China on March 13, 2020 in response to the COVID-19 pandemic. The company originally planned to reopen its stores by the end of that month, but history had other plans.</p><p>Apple has periodically <a href=\"https://arstechnica.com/gadgets/2020/06/apple-is-reopening-a-bunch-of-stores-in-the-us-and-canada-again/\">reopened and reclosed</a> certain locations in the United States and elsewhere based on local case levels and government guidance—for example, a major push was attempted to reopen on May 31 as the virus's spread slowed as a result of lockdown measures. But that was before COVID cases began rising sharply again. The last locations to reopen in the US this week were located in Texas.</p><p>That said, not all Apple Stores offer the same mid-pandemic experience. In previous reopening pushes, Apple opened some stores <a href=\"https://arstechnica.com/gadgets/2020/05/apple-reopens-some-us-stores-amidst-covid-19-but-theyll-work-differently/\">with strict rules</a> like temperature screenings, appointment-only shopping, and curbside-style pickup options.</p><p>Depending on location and other factors, some Apple Stores are open to relatively normal foot traffic, while others retain some or all of the above restrictions. Apple still operates a website where would-be customers can go to check what the process is for a specific location.</p><p>Beyond the US, 12 Apple Stores remain closed globally due to the pandemic, according to <a href=\"https://www.cnbc.com/2021/03/01/apple-stores-in-us-open-for-first-time-since-last-march.html\">CNBC</a>, including two in Brazil and 12 in France.</p><p>Apple has long seen the retail experience as part of the Apple product experience; executives have talked not just of integrating software and hardware but of including retail and services in that integration as well. But the past year has been tumultuous for Apple Stores, to say the least.</p><p>The pandemic was not the only factor that negatively affected the stores. Rioting amid the protests for racial justice last year resulted in <a href=\"https://arstechnica.com/gadgets/2020/06/local-authorities-will-be-alerted-iphone-looters-end-up-with-useless-phones/\">damage and theft</a> at some stores around the country, while natural disasters like California wildfires and the winter storm in Texas further battered specific locations.</p><p>Nonetheless, Apple's sales <a href=\"https://arstechnica.com/gadgets/2021/01/apple-reports-double-digit-sales-booms-for-every-product-category-in-q1-2021/\">have been strong</a> over the last year. It may be impossible to say just how much retail closures affected those numbers, though; CEO Tim Cook recently suggested that Apple's blockbuster holiday could have been even bigger if physical retail had been a bigger part of the story.</p></div></div>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d26e278532d9da0190276b672c7131d368679d8ba8b59c632f8dbcdd87ed966a","category":"Tech"}