{"title":"Get to know the first new AWS Heroes of 2021!","link":"https://aws.amazon.com/blogs/aws/get-to-know-the-first-new-aws-heroes-of-2021/","date":1615496491000,"content":"<div id=\"readability-page-1\" class=\"page\"><section property=\"articleBody\"><div id=\"amazon-polly-audio-tab\"><p><a href=\"https://aws.amazon.com/polly/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://a0.awsstatic.com/aws-blog/images/Voiced_by_Amazon_Polly_EN.png\" width=\"554\" height=\"56\"></a></p></div><p>The global <a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\" rel=\"noopener noreferrer\">AWS Heroes</a> program recognizes individuals who are prominent leaders in local tech communities. Heroes help others learn about AWS by sharing knowledge via blog posts, presentations, social media, and open source projects; or by organizing events, Meetups, and workshops. As global communities grow we continue to see new leaders emerge, and today we’re thrilled to introduce to you the first new AWS Heroes of 2021, including the first Heroes from Austria, Belgium, Bulgaria, and Columbia:</p><h2>Ben Bridts – Antwerp, Belgium</h2><p><a href=\"https://aws.amazon.com/developer/community/heroes/ben-bridts/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/03/09/ben-bridts.jpg\" width=\"175\" height=\"263\"></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/ben-bridts/\" target=\"_blank\" rel=\"noopener noreferrer\">Ben Bridts</a> has been using AWS professionally since 2015, and as an AWS Technologist at Cloudar, he works with businesses ranging from start-ups to enterprises. He is also an AWS Authorized Instructor and gives AWS Classroom Trainings at The Campus. You can find his blog posts on the Cloudar blog, and see him participating on GitHub (maybe your CloudFormation Stack uses code he wrote). He is a co-organizer of the Belgian AWS User-Group and frequently speaks at various other events. He has a broad interest in serverless, automation, and enabling builders. Currently, he counts CloudFormation, Lambda, KMS, CloudFront, and Lambda@Edge among his favorite services.</p><h2>Nana Janashia – Vienna, Austria</h2><p><a href=\"https://aws.amazon.com/developer/community/heroes/nana-janashia/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/03/09/nana-janashia.jpg\" width=\"175\" height=\"263\"></a>Container Hero <a href=\"https://aws.amazon.com/developer/community/heroes/nana-janashia/\" target=\"_blank\" rel=\"noopener noreferrer\">Nana Janashia</a> is a DevOps consultant and trainer. She started the ‘Techworld with Nana’ channel to share her expertise about various DevOps topics and to help enthusiasts get into the field more easily. She consults with teams of developers and DevOps engineers to help them improve their existing processes for CI/CD, containerization, and orchestration. In 2020, she created a complete educational program for those looking to become DevOps engineers, focused on learning the most popular tools and platforms like Docker, Kubernetes, AWS, Terraform &amp; more.</p><h2>Zainab Maleki – Perth, Australia</h2><p><a href=\"https://aws.amazon.com/developer/community/heroes/zainab-maleki/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/03/09/zainab-maleki.jpg\" width=\"175\" height=\"263\"></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/zainab-maleki/\" target=\"_blank\" rel=\"noopener noreferrer\">Zainab Maleki</a> is a natural leader whose skills have shone since arriving in Australia: she facilitated CoderDojo for girls for three years, and in 2020 started a coding class for children of culturally diverse backgrounds. Over the past year Zainab presented reusable serverless patterns at AWS Community Day and co-presented Design Driven Development in data and analytics at the Latency conference in Perth. As a full-stack developer, Senior DevOps Engineer, AWS Ambassador, and regular conference presenter, Zainab is proud of the value that she has delivered to her clients and her community.</p><h2>Kenjiro Marumoto – Hiroshima, Japan</h2><p><a href=\"https://aws.amazon.com/developer/community/heroes/kenjiro-marumoto/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/03/09/kenjiro-marumoto.jpg\" width=\"175\" height=\"263\"></a>Data Hero <a href=\"https://aws.amazon.com/developer/community/heroes/kenjiro-marumoto/\" target=\"_blank\" rel=\"noopener noreferrer\">Kenjiro Marumoto</a> contributes to AWS user community activities by running Meetups and study sessions for the Hiroshima chapter (about 300 registered members) and the Big Data chapter (about 900 registered members) of JAWS-UG, the AWS User Group network in Japan. When he spoke at the 2019 AWS Summit Tokyo, he received a first place customer satisfaction rating. He was also featured at re:Invent 2018 for his company’s Amazon QuickSight use case. In recognition of these activities, he received the 2018 AWS Samurai Award, which is given to users who have made outstanding contributions to JAWS-UG.</p><h2>Dijeesh Padinharethi – Kochi, India</h2><p><a href=\"https://aws.amazon.com/developer/community/heroes/dijeesh-padinharethi/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/03/09/dijeesh-padinharethi.jpg\" width=\"175\" height=\"263\"></a>Container Hero <a href=\"https://aws.amazon.com/developer/community/heroes/dijeesh-padinharethi/\" target=\"_blank\" rel=\"noopener noreferrer\">Dijeesh Padinharethi</a> is currently an AWS User Group Leader for the Kochi community where he has organized several meetups, hackathons, and other knowledge-sharing sessions. He organized the first-ever AWS Community Day – Kochi back in 2019 and co-organized AWS Community Day India 2020 – Virtual Edition. He also leads the CNCF and Hashicorp User Group communities in Kochi. Dijeesh is an occasional blogger, and he shares knowledge about AWS via his and AWS UG Kochi’s social media accounts.</p><h2>Daniel Rankov – Sofia, Bulgaria</h2><p><a href=\"https://aws.amazon.com/developer/community/heroes/daniel-rankov/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/03/09/daniel-rankov.jpg\" width=\"175\" height=\"263\"></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/daniel-rankov/\" target=\"_blank\" rel=\"noopener noreferrer\">Daniel Rankov</a> leads the Cloud Center of Excellence (CCOE) team and guides the overall Cloud and DevOps strategy at MentorMate. Daniel’s cloud journey began as one of the first people at HeleCloud, now an AWS Premier Partner. There he became very passionate about AWS and all the benefits that the public cloud brings to businesses. This passion let him become a co-organizer of the AWS Bulgaria User Group, and he now actively speaks at conferences and performs trainings and workshops.</p><h2>Srushith Repakula – Bengaluru, India</h2><p><a href=\"https://aws.amazon.com/developer/community/heroes/srushith-repakula/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/03/09/srushith-repakula.jpg\" width=\"175\" height=\"263\"></a>Serverless Hero <a href=\"https://aws.amazon.com/developer/community/heroes/srushith-repakula/\" target=\"_blank\" rel=\"noopener noreferrer\">Shrushith Repakula</a> is the Head of Engineering at KonfHub. He is passionate about building serverless applications and sharing his experiences at various events across the globe. Srushith recently founded the Tirupati AWS User Group and also started the first serverless-focused meetup group in Bangalore. He also started Serverless Saturdays, a monthly webinar focusing on everything serverless and helping developers not only kick start their serverless journey, but also provide an opportunity to get access to learnings and experiences from experts across the globe.</p><h2>Shun Yoshie – Yokohama, Japan</h2><p><a href=\"https://aws.amazon.com/developer/community/heroes/shun-yoshie/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/03/10/shun_yoshie.jpg\" width=\"175\" height=\"263\"></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/shun-yoshie/\" target=\"_blank\" rel=\"noopener noreferrer\">Shun Yoshie</a> joined the Japanese AWS user group (JAWS-UG) in 2013, and has been running the JAWS-UG Tokyo chapter since 2019. In 2019, he was chair of the JAWS DAYS 2019 organizer committee, an event which drew 2000 participants and had 129 sessions across 11 tracks. He was named AWS Samurai 2018 and 2019. In September 2020, Shun launched a new event and was chair of JAWS SONIC 2020 / MIDNIGHT JAWS 2020, which was a fully online 24-hour event, with nearly 1,500 registrations and online participation from many countries overseas.</p><h2>Carlos Zambrano – Bogotá, Colombia</h2><p><a href=\"https://aws.amazon.com/developer/community/heroes/carlos-zambrano/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/03/09/carlos-zambrano.jpg\" width=\"175\" height=\"263\"></a>Data Hero <a href=\"https://aws.amazon.com/developer/community/heroes/carlos-zambrano/\" target=\"_blank\" rel=\"noopener noreferrer\">Carlos Zambrano</a> is passionate about everything related to AWS, with a focus on Data and Analytics, DevOps, and Machine Learning. He spoke at AWS re:Invents 2020 and 2019 and has more than six years of experience with global AWS projects. Currently, he holds 10 AWS Certifications. Carlos is also co-founder of Clouding LA and co-organizer of AWS User Group Bogotá, Colombia. He likes to write technical posts and talk about AWS Data and Analytics on Medium and Dev.to. Additionally, Carlos creates videos, online classes, and workshops focused on AWS. He has helped hundreds of people become AWS certified.<br>&nbsp;</p><p>If you’d like to learn more about the new Heroes, or connect with a Hero near you, please <a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\" rel=\"noopener noreferrer\">visit the AWS Hero website</a>.</p><p>— <a href=\"https://twitter.com/rossbarich\" target=\"_blank\" rel=\"noopener noreferrer\">Ross</a>;</p></section></div>","author":"Ross Barich","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"d2797f95420984778b5d10cce7af7784c52189ed6960f2b90a5bfd9c8638e02d","category":"Tech"}