{"title":"Bloomberg Story Breaks Down Apple's Unrivaled Success Under Tim Cook's Leadership","link":"https://www.macrumors.com/2021/02/09/bloomberg-apple-success-under-tim-cook/","date":1612869872000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/09/bloomberg-apple-success-under-tim-cook/\"><p><em>Bloomberg</em> has published an <a href=\"https://www.bloomberg.com/news/features/2021-02-09/this-is-how-tim-cook-transformed-apple-aapl-after-steve-jobs\">in-depth piece by journalist Austin Car</a> about the rise of Apple under <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a>'s leadership, covering several attributes of the CEO that took over from Steve Jobs, including his diplomatic acumen, operational prowess, eye for detail, and manifest success in making Apple one of the biggest companies in the history of modern business.</p><p><img alt=\"apple park 416 security\" width=\"1200\" height=\"669\" src=\"https://images.macrumors.com/t/O97V66pSbZMrQbYRSPxa5TszqHw=/400x0/filters:quality(90)/article-new/2018/04/apple-park-416-security.jpg?lossy\" data-src=\"https://images.macrumors.com/t/O97V66pSbZMrQbYRSPxa5TszqHw=/400x0/filters:quality(90)/article-new/2018/04/apple-park-416-security.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/O97V66pSbZMrQbYRSPxa5TszqHw=/400x0/filters:quality(90)/article-new/2018/04/apple-park-416-security.jpg?lossy 400w,https://images.macrumors.com/t/r_WebOsL1P6B_90xqruk50fRY6U=/800x0/filters:quality(90)/article-new/2018/04/apple-park-416-security.jpg?lossy 800w,https://images.macrumors.com/t/KjzLLAeOpbHSx72d3lWtjf_xJx8=/1600x0/filters:quality(90)/article-new/2018/04/apple-park-416-security.jpg 1600w,https://images.macrumors.com/t/5lqXsOQ9rMk_hKTopq2OpmUw1BY=/2500x0/filters:no_upscale():quality(90)/article-new/2018/04/apple-park-416-security.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/O97V66pSbZMrQbYRSPxa5TszqHw=/400x0/filters:quality(90)/article-new/2018/04/apple-park-416-security.jpg?lossy 400w,https://images.macrumors.com/t/r_WebOsL1P6B_90xqruk50fRY6U=/800x0/filters:quality(90)/article-new/2018/04/apple-park-416-security.jpg?lossy 800w,https://images.macrumors.com/t/KjzLLAeOpbHSx72d3lWtjf_xJx8=/1600x0/filters:quality(90)/article-new/2018/04/apple-park-416-security.jpg 1600w,https://images.macrumors.com/t/5lqXsOQ9rMk_hKTopq2OpmUw1BY=/2500x0/filters:no_upscale():quality(90)/article-new/2018/04/apple-park-416-security.jpg 2500w\"><br>The story touches on a number of topics in the recent history of Apple's meteoric rise under Cook's leadership, including the political sensitivities of outsourcing production to China, Cook's relationship with current and former U.S. presidents, his cost-conscious approach to new products, and the strategic difficulties of managing Apple's product diversification in a global-spanning supply chain.</p><p>Other highlights include:</p><ul><li>Steve Jobs' blunt response when President Obama asked him why Apple couldn't make the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> in the U.S.</li><li>‌Tim Cook‌'s unrelenting work ethic.</li><li>Cook's unlikely friendship with President Trump, and Apple's silence in the face of falsehoods propagated by the former president about Apple production coming back to the U.S.</li><li>Supply chain managers' alarm upon seeing the initial design of the 2013 \"trashcan\" <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a>.</li><li>Internal pressure at Apple to decouple from China over censorship, human-rights violations, and criticism about labor conditions at mainland factories.</li><li>Apple's continued success in the face of the global health crisis.<br></li><li>Apple's fightback against claims of the company's \"monopoly power\" and its ongoing feud with big name software developers and social media platforms like Spotify, <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, and Facebook.</li></ul><p>For all the details, be sure to check out the full long read over on <em><a href=\"https://www.bloomberg.com/news/features/2021-02-09/this-is-how-tim-cook-transformed-apple-aapl-after-steve-jobs\">Bloomberg</a></em>.</p><p><small>Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our <a href=\"https://forums.macrumors.com/forums/political-news.218/\">Political News</a> forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.</small></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/04/macbook-pro-copy-iphone-design/\">New MacBook Pro Expected to Copy Familiar iPhone Design</a></h3><p>Apple's upcoming 2021 MacBook Pro is expected to take design cues from the iPhone 12, according to well-respected analyst Ming-Chi Kuo. With the MacBook Pro being rumored to get a major overhaul this year, speculation about what, if any, design changes will come to the new machines has begun. In a recent note to investors, seen by MacRumors, Kuo explained: In terms of casing design, the ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/intel-11th-gen-vs-apple-m1-chip-benchmarks/\">Intel Downplays Apple's M1 Chip With 'Carefully Crafted' Benchmarks</a></h3><p>Saturday February 6, 2021 3:17 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Nearly three months after the launch of Apple's rave-reviewed M1 Macs, Intel has fired back, but there are some asterisks involved. In a slideshow shared by PCWorld this week, Intel highlighted what PCWorld described as \"carefully crafted\" benchmarks in an attempt to prove that laptops with the latest 11th Generation Core processors are superior to those with Apple's custom-designed M1 chip. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-dtk-credit-for-developers-increased/\">Apple Ups DTK Mac Mini Return Credit to $500 After Developer Complaints</a></h3><p>Friday February 5, 2021 8:51 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Prior to the release of the M1 Macs, Apple offered developers a $500 Developer Transition Kit (DTK) that included a Mac mini equipped with an A12Z Bionic chip first used in the iPad Pro, 16GB RAM, a 512GB SSD, two USB-C ports, two USB-A ports, and an HDMI 2.0 port. The DTKs were available on a temporary basis, and earlier this week, Apple said that it would soon begin asking developers to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/01/imac-apple-silicon-redesign/\">iMac to Get a Whole New Look for Apple Silicon</a></h3><p>Apple's long-awaited iMac with Apple Silicon is expected to arrive this year featuring a complete redesign, according to a range of reports. According to Bloomberg's Mark Gurman, the redesigned iMac models will feature significantly slimmed down bezels around the display. The large aluminum \"chin\" segment, below the display of current iMacs, will be removed entirely for a design that...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/07/iphone-12-risk-magnets-pacemakers/\">Medical Doctors Underline Potential Risk of iPhone 12 Interference With Pacemakers</a></h3><p>Sunday February 7, 2021 4:11 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple's warning to keep the iPhone 12 away from cardiac devices due to electromagnetic interference was further underlined by U.S. cardiologists this week in a new report (via NBC25 News). Apple's iPhone 12 series includes an array of magnets that help align the phone on Apple's MagSafe charging accessory to maximize charging, and Apple already advises users with implanted pacemakers and...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/06/top-stories-ios-14-5-beta/\">Top Stories: iOS 14.5 Beta, macOS 11.2 Released, VR Headset and Apple Car Rumors</a></h3><p>It was a big week for software this week, with Apple kicking off a new round of betas for its operating systems with plenty of tweaks and changes in iOS 14.5 and related updates. We also saw the public release of macOS 11.2, which trailed last week's release of iOS 14.4. In other news, we got some significant new rumors about Apple's VR headset project and the Apple Car, while over on our...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/05/apple-pauses-car-talks-hyundai-kia/\">Apple Pauses Electric Car Talks With Hyundai and Kia</a></h3><p>Friday February 5, 2021 2:02 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Multiple rumors over the course of the last week have suggested that Apple has been discussing Apple car manufacturing with Hyundai and Hyundai affiliate Kia, but those talks have paused recently, reports Bloomberg. Apple has also been discussing its Apple Car plans with other automobile manufacturers, so despite rumors suggesting Apple is considering a deal with Hyundai/Kia, Apple could...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/08/ios-14-5-beta-siri-default-music-service/\">Siri Setting in iOS 14.5 Beta Lets Users Select Default Music Streaming Service</a></h3><p>Monday February 8, 2021 4:09 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Apple last week released beta versions of upcoming iOS 14.5 and iPadOS 14.5 updates to developers and public beta testers, and among a number of new features, Apple has added the ability to set a default music streaming service when using Siri to play songs. Image via Reddit user matejamm1 First spotted by Reddit users, the first time you ask Siri to play a song in iOS 14.5, you are given the ...</p></div></div></div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d35334934125054742bebb1dfb3a8621a658be69e7845d865cd9b9e11a50752b","category":"Apple"}