{"title":"SpaceX Starlink factory in Texas will speed up production of Dishy McFlatface","link":"https://arstechnica.com/?p=1747067","date":1614876423000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Starlink factory —</h4><h2 itemprop=\"description\">Austin factory to create systems that improve SpaceX's high-volume manufacturing.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/dishy-mcflatface-teardown-800x469.jpg\" alt=\"View of the SpaceX Starlink satellite dish, with the back panel taken off.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/dishy-mcflatface-teardown.jpg\" data-height=\"845\" data-width=\"1440\">Enlarge</a> <span>/</span> The SpaceX Starlink satellite dish partway through a teardown.</p></figcaption></figure><p>SpaceX says it is building a factory in Austin, Texas, to design systems that will help make satellite dishes, Wi-Fi routers, and other equipment for its Starlink satellite broadband network. The news comes from a <a href=\"https://boards.greenhouse.io/spacex/jobs/5111363002?gh_jid=5111363002\">job posting</a> for an automation and controls engineer position flagged in a <a href=\"https://www.kxan.com/news/local/elon-musks-spacex-is-building-a-manufacturing-facility-in-austin/\">story Tuesday</a> by local news channel KXAN.</p><p>\"To keep up with global demand, SpaceX is breaking ground on a new, state of the art manufacturing facility in Austin, TX,\" the job posting said. \"The Automation &amp; Controls Engineer will play a key role as we strive to manufacture millions of consumer facing devices that we ship directly to customers (Starlink dishes, Wi-Fi routers, mounting hardware, etc).\"</p><p>The factory apparently won't make the dishes and routers on site but will instead design systems that improve the manufacturing process. \"Specifically, they will design and develop control systems and software for production line machinery—ultimately tackling the toughest mechanical, software, and electrical challenges that come with high-volume manufacturing, all while maintaining a focus on flexibility, reliability, maintainability, and ease of use,\" the job posting said.</p><p>Starlink is in beta and is serving over 10,000 customers, and it has asked the Federal Communications Commission for permission to deploy <a href=\"https://arstechnica.com/information-technology/2020/08/spacex-now-plans-for-5-million-starlink-customers-in-us-up-from-1-million/\">up to 5 million user terminals</a> in the US. SpaceX calls this piece of hardware \"Dishy McFlatface,\" and it receives transmissions from SpaceX's low-Earth orbit satellites. See our <a href=\"https://arstechnica.com/information-technology/2020/12/teardown-of-dishy-mcflatface-the-spacex-starlink-user-terminal/\">article</a> about a Dishy McFlatface teardown for more details on the hardware's inner portions, and <a href=\"https://arstechnica.com/information-technology/2020/11/spacex-starlink-beta-tester-takes-user-terminal-into-forest-gets-120mbps/\">this article</a> for more pictures of the dish in its fully intact state.</p><p>Starlink has been <a href=\"https://arstechnica.com/information-technology/2020/10/spacex-starlink-public-beta-begins-its-99-a-month-plus-500-up-front/\">charging</a> $99 per month plus a one-time fee of $499 for the user terminal, mounting tripod, and router. Starlink recently began taking <a href=\"https://arstechnica.com/information-technology/2021/02/spacex-starlink-now-taking-pre-orders-for-service-in-mid-to-late-2021/\">preorders</a> for service that would become available in the second half of 2021.</p><h2>Shipping to 25 countries this year</h2><p>The new job posting said the successful applicant will work in Austin but spend up to 25 percent of the time at SpaceX headquarters in Los Angeles \"until [the] Austin facility is fully established.\" The new engineer will make an impact on Starlink's ability to ship hardware this year. The person will \"set, implement, and maintain schedules and budgets to ensure project completion as we strive to ship to 25+ countries by the end of the year,\" the job posting said.</p><p>The engineer will be expected to \"design, develop, and manage automation and controls projects to manufacture consumer electronics that are easy for humans around the world to use, but are technically very sophisticated—this includes initial factory ideation, on-line commissioning and proof of rate capability, and eventual hand-off to operational teams.\" The engineer will also \"spearhead facility bring up and initial equipment conceptual development by carefully balancing product specifications, process requirements, layout complexity, cost, and lead-time limits,\" the job posting said.</p><p>We asked SpaceX for more detail on plans for the Austin facility and when it will open, and on where exactly the dishes and routers will be manufactured. We'll update this article if we get an answer.</p><p>The new SpaceX factory would be near Tesla's <a href=\"https://arstechnica.com/cars/2020/05/report-tesla-plans-to-build-a-new-car-factory-in-texas/\">planned car factory</a> in Austin. SpaceX founder and CEO Elon Musk is also the CEO of Tesla.</p></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d3575512cb5ed743d9005ae9379799d35f4f75ae2641634574e9f1ed66779671","category":"Tech"}