{"title":"Ellen van Dijk dreams of a solo win in Roubaix","link":"https://cyclingtips.com/2021/03/ellen-van-dijk-dreams-of-a-solo-win-in-roubaix/","date":1617164047000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>It’s an important time of the season for Ellen van Dijk. Dwars door Vlaanderen and the Tour of Flanders are next on the menu – two races she has won before – and after that, hopefully, will be the first women’s Paris-Roubaix. Aged 34, the former world time trial champion is still as ambitious and passionate as ever.&nbsp;</p><p>“I love racing in Flanders,” she says. “The racing is always hard. There are always cobbles and climbs to make a difference when you are not a super-light climber like I am. There is nothing like racing in Flanders. The atmosphere is absolutely unique because the racing is ingrained in the culture.”&nbsp;</p><p>Ellen van Dijk is one of the strongest riders in the peloton. Tall and muscular she has absolute power that is not matched by many. She was instrumental in many victories from her teammates like Coryn Rivera’s Tour of Flanders win in 2017, but the strong Dutchwoman has an impressive palmares herself. She recently added a fourth Healthy Ageing Tour win to that palmares. As she often does, she laid the foundations with a strong time trial.&nbsp;</p><figure><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/RhodePhoto_HealthyAgeingTour_2021-6780-1340x893.jpg\" data-src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/RhodePhoto_HealthyAgeingTour_2021-6780-1340x893.jpg\" alt=\"\" data-srcset=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/RhodePhoto_HealthyAgeingTour_2021-6780-1340x893.jpg 1340w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/RhodePhoto_HealthyAgeingTour_2021-6780-650x433.jpg 650w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/RhodePhoto_HealthyAgeingTour_2021-6780-190x127.jpg 190w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/RhodePhoto_HealthyAgeingTour_2021-6780-1080x720.jpg 1080w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/RhodePhoto_HealthyAgeingTour_2021-6780-16x11.jpg 16w\" sizes=\"(max-width: 1340px) 100vw, 1340px\"><figcaption>Van Dijk on her way to victory in the recent Healthy Ageing Tour time trial.</figcaption></figure><p>“Due to the storm [at the Healthy Ageing Tour], we couldn’t race our time trial bikes which was a big setback to me,” Van Dijk said. “I train a lot on the time trial bike and that would have given me a really big advantage. It was a bit of a mental challenge but in the end I was happy with my watts. It confirmed I had done a good winter period of training.”</p><p>The time trial is a discipline that is close to her heart. You can often find her battling the wind on her time trial bike on the Lek river dikes near her hometown of Woerden, in the centre of the Netherlands. In 2013 she became TT world champion in Florence, averaging almost 48 km/h on a flat course. Eight years later she wants the rainbow jersey back.</p><p>“I am really looking forward to the world championships in Belgium this year,” she says. “It is a big goal for me. It’s a flat course with hardly any turns. It’s a course for absolute power. That gives me an advantage. I feel better than I did last year. People often ask me about my career because of my age [she just turned 34] but I am still very ambitious and have so much passion for my job.”</p><p>Thanks to reigning champion Anna van der Breggen, the Netherlands gets three starting places at the world championships but at the Olympic Games in Tokyo the Dutch will only have two places.&nbsp;Anna van der Breggen, Annemiek van Vleuten, Ellen van Dijk.&nbsp;It’s an impossible choice for national coach Loes Gunnewijk.&nbsp;</p><p>“The selection will be made in May,” Van Dijk says. “Since the world championships we haven’t done a time trial to show what we are capable of. And there won’t be one before May either. The last time the three of us were in a time trial together is a long time ago. I can only try to be ready and then it’s up to Loes to decide. It’s out of my hands. It’s one of the things I learned from the COVID era: you have to just undergo the situation.”&nbsp;</p><figure><img loading=\"lazy\" width=\"1340\" height=\"894\" src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032534-128-1340x894.jpg\" data-src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032534-128-1340x894.jpg\" alt=\"\" data-srcset=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032534-128-1340x894.jpg 1340w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032534-128-650x434.jpg 650w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032534-128-190x127.jpg 190w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032534-128-1080x720.jpg 1080w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032534-128-16x11.jpg 16w\" sizes=\"(max-width: 1340px) 100vw, 1340px\"><figcaption>Ellen van Dijk congratulates Anna van der Breggen at the 2020 World Championships in Imola.</figcaption></figure><p>Before that all-important decision is made for Van Dijk’s Olympic and rainbow dreams, she’s got other more immediate goals. She’s helped to show that her Trek-Segafredo team is one of the squads to beat in the upcoming races. Dwars door Vlaanderen and the Tour of Flanders, both held this week, are important races for Van Dijk. She’s won both races before – Dwars door Vlaanderen twice – after impressive solo efforts. The week after Flanders is Paris-Roubaix.</p><p>The first edition for women has already been postponed twice and amid surging COVID-19 numbers in France the race might face a third postponement. Van Dijk has had Roubaix on her mind since ASO announced the addition to the women’s calendar.&nbsp;</p><figure><img loading=\"lazy\" width=\"1340\" height=\"747\" src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032930-100-1-1340x747.jpg\" data-src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032930-100-1-1340x747.jpg\" alt=\"\" data-srcset=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032930-100-1-1340x747.jpg 1340w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032930-100-1-650x362.jpg 650w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032930-100-1-190x106.jpg 190w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032930-100-1-1080x602.jpg 1080w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032930-100-1-16x9.jpg 16w\" sizes=\"(max-width: 1340px) 100vw, 1340px\"><figcaption>Ellen van Dijk leads the way at Strade Bianche earlier this year.</figcaption></figure><p>“If I could win that one solo as well …” she says. “I hope the race will go ahead. I heard there are lobby actions going on to make the race happen. We chat about this as a team of course but I have mixed feelings. I don’t want to make it seem that we as riders only think about ourselves, that riding Paris-Roubaix is so much more important than what’s happening in the world right now.</p><p>“I don’t want to come across as thinking I am more important than the people actually suffering from COVID-19 or from loss. It’s a bit of a dilemma, to be honest.”</p><blockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/CL5Fm45Fi8q/?utm_source=ig_embed&amp;utm_campaign=loading\" data-instgrm-version=\"13\" id=\"instagram-media-payload-0\"></blockquote><p>Trek-Segafredo has several pre-race favorites on the team for Roubaix. Van Dijk, world cyclocross champion Lucinda Brand, and WorldTour winner Lizzie Deignan have done several recon rides since October.</p><p>“I think Ina [Teutenberg, the sports director] knows every cobble by now,” Van Dijk laughs. “The first time on the cobbles at Arenberg I absolutely hated it. I thought to myself ‘do I need to find this enjoyable?’ It takes some getting used to and now it becomes more fun every time we are out there. The race breathes heroism. It’s always been amazing to see the men race this iconic race. The women’s race has now become a bit of a hype. Everyone is talking about it.”&nbsp;</p><p>The women’s Paris-Roubaix will be much shorter than the men’s version but will include a large share of all the iconic cobbled sectors in quick succession.&nbsp;</p><p>“It will be a race of attrition where only the strongest riders remain,” Van Dijk says. “It’s also about luck and not getting mechanical issues. Ina has been so enthusiastic and that is truly contagious. Everyone in the team is involved and works hard to give us the best equipment. I hope to be there with the best riders at the end. My ultimate race scenario? A solo win on the velodrome.”&nbsp;</p><figure><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00017498-014-1340x893.jpg\" data-src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00017498-014-1340x893.jpg\" alt=\"\" data-srcset=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00017498-014-1340x893.jpg 1340w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00017498-014-650x433.jpg 650w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00017498-014-190x127.jpg 190w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00017498-014-1080x720.jpg 1080w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00017498-014-16x11.jpg 16w\" sizes=\"(max-width: 1340px) 100vw, 1340px\"><figcaption>Van Dijk in action at the Dutch time trial championships in 2011.</figcaption></figure><p>Van Dijk has been around for a while. She started in 2006 at a team with an iconic name: Vrienden van het Platteland (“Friends of the countryside”), a team where she was paid 150 Euros a month. In 2009 she joined the first women’s cycling superteam, HTC Columbia. In a recent column for Fiets Magazine she described how that process went.&nbsp;</p><p>“I felt bold and asked the manager for a little more than I got at Vrienden van het Platteland. The manager was silent for a while and then told me: ‘Ellen, our minimum is 20,000 Euro a year.”&nbsp;</p><p>She describes how her young teammates like first year pros Shirin van Anrooij and Elynor Backstedt earn about 20 times more than she did. She likes to teach them a little bit about the history of the development of women’s racing; “like a grandma”, she writes in Fiets.&nbsp;</p><p>“It’s good that Trek-Segafredo committed to paying everyone the minimum wage,” she tells me. “They set an example that’s already been followed by BikeExchange. This is the way it should start but we must also realize that women’s cycling is not at a level yet [where everyone can pay minimum wages]. There are now world-renowned riders on other teams who get less than our first-year pros. That is not a stable situation.”&nbsp;</p><figure><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032601-061-1340x893.jpg\" data-src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032601-061-1340x893.jpg\" alt=\"\" data-srcset=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032601-061-1340x893.jpg 1340w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032601-061-650x433.jpg 650w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032601-061-190x127.jpg 190w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032601-061-1080x720.jpg 1080w, https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/03/CORVOS_00032601-061-16x11.jpg 16w\" sizes=\"(max-width: 1340px) 100vw, 1340px\"></figure><p>Van Dijk feels that the development of women’s cycling can never go too fast. With a base salary everyone has the option to reach their full potential. The level is improving and everyone becomes more professional. However, she also fears the balance of the sport will be off.</p><p>“It’s good to have a salary that you can live off and to have all the facilities you need to become a better rider but if paying our salaries means that the team can’t afford the other facilities the situation becomes unstable too,” she says. “You can’t regulate that the progress steadily moves upwards but I also feel that sometimes you need to make that extra step [like Trek-Segafredo did] to stimulate the others to pick up the pace.”</p><div><h5>Tags</h5></div></div></div>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d396166b105611b9a5c0f965ed836b5c152fc22333b4ec6642e98b7de2132b05","category":"Cycling"}