{"title":"Ballerini wins second stage of Tour de la Provence: Daily News","link":"https://cyclingtips.com/2021/02/ballerini-wins-second-stage-of-tour-de-la-provence-daily-news/","date":1613153814000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>This photo of InstaFund Pro Cycling was captured along the famous Sea-to-Sky from Vancouver to Whistler. The many beautiful backdrops along to make these strong riders look even better. Looking forward to 2021's adventures. Submitted to the Mark Gunter 2020 Photographer of the Year Awards.</h4><p></p><div><p>Hello again, CyclingTips readers,</p><p>On the racing side of news, it was déjà vu at the Tour de la Provence with the addition of some wet roads. Fabio Jakobsen’s Tour of Poland recovery continues with more surgery. And more races have announced the teams who will be in attendance at their events.</p><p>The news in the greater sporting world is that the Tokyo Olympic Organizing Committee is in need of a new president.</p><p>Until next time.</p><p><em>Abby Mickey<br>Associate Editor</em></p><h2>What’s news?</h2><h3>Davide Ballerini wins second stage of Tour de la Provence</h3><p>For the second consecutive day, Davide Ballerini crossed the finish line first at the Tour de la Provence. The Italian outsprinted Giulio Ciccone for the victory, Alex Aranburu was third across the line.</p><p>“What a stage and what a team. They worked all day and I think it’s the best thing to win in the final when you see a team like this,” Ballerini said after the race.</p><p>Ballerini will remain in the funky primary coloured leader’s jersey for stage three with a 16 second lead over Aranburu.</p><p>The stage two finale looked like it would be a standard sprint finish, with any breakaway attempts brought back in the final four kilometres. But, with wet and slippery roads the run into the line was not smooth sailing for the peloton.</p><p>A crash in the final 1.5 km took down the world champion Julian Alaphilippe along with Aleksandr Vlasov. Matteo Jorgenson also went down a few hundred meters from the line. After the race, Jorgenson <a href=\"https://twitter.com/MatteoJorg/status/1360261703448027136?s=20\" target=\"_blank\" rel=\"noreferrer noopener\">tweeted</a> that the crash had been caused by a fan leaning over the barriers into the path of the Team Movistar rider.</p><p>The third stage of Tour de la Provence will finish at Chalet Reynard, 9.7 km up the iconic Mont Ventoux.</p><h3>Fabio Jakobsen undergoes jaw surgery as part of Tour of Poland recovery</h3><p>Fabio Jakobsen has undergone surgery for jaw implants as part of his Tour of Poland rehabilitation. Jakobsen also had scars in his mouth reconstructed, both procedures were related to the numerous facial injuries Jakobsen sustained in the Tour of Poland crash.</p><p>Compared to the various other surgeries Jakobsen has had post-crash the recovery time for the jaw and mouth surgeries should be short.</p><p>“Yesterday I had another operation, that went well,” Jakobsen wrote on his Instagram. “The surgeons drilled implants in my upper and lower jaw and reconstructed the scars in my mouth. For now a week of rest and let the body do its healing. Hopefully, next week I can restart training again and build up towards races!”</p><p>Jakobsen is hoping to be back to racing soon and was at team camp riding alongside his Deceuninck-QucikStep teammates in January.</p><h3>Gent-Wevelgem announces men’s and women’s team lineups</h3><p>Gent-Wevelgem, set to take place on March 28th, has announced the men’s and women’s teams who will contest the slightly-cobbled victory.</p><p>For <a href=\"https://twitter.com/GentWevelgem/status/1360160322687037440?s=20\" target=\"_blank\" rel=\"noreferrer noopener\">the women</a>, all nine of the WorldTour teams will be in attendance, along with 15 UCI Continental teams. Amongst the Continental teams will be Ceratizit-WNT Pro Cycling, home of two-time Gent-Wevelgem champion Kirsten Wild.</p><p>As for <a href=\"https://twitter.com/GentWevelgem/status/1360192809609928712?s=20\">the men</a>, all 19 of the WorldTour teams are on the start list, along with Alpecin-Fenix and Arkéa-Samsic, the two highest-ranked UCI ProTeams of 2020. Wildcard invitations were given to B&amp;B Hotels, Total Direct Energie, Bingoal WB, and Sport Vlaanderen-Baloise.</p><h3>President of Tokyo Olympic Organizing Committee resigns in wake of sexist comments</h3><p>Following sexist comments made during a recent meeting, Yoshirō Mori has resigned as president of the Tokyo Olympic Organizing Committee.</p><p>Mori’s departure marks another obstacle for the upcoming Tokyo Olympic Games, with the event only five months away and continued unrest in Japan, and the World, about whether or not the Games should go ahead during a global pandemic. Recently there was a series of back-and-forth regarding quarantine requirements at the Games as well as statements from within the Japanese government that the Games would be cancelled. Those <a href=\"https://cyclingtips.com/2021/01/ioc-and-japanese-government-deny-rumors-suggesting-olympics-set-to-be-cancelled/\" target=\"_blank\" rel=\"noreferrer noopener\">claims</a> have since been debunked by the International Olympic Committee.</p><p>Tokyo 2020 has said they will replace Mori as soon as possible so as not to impede the preparation for the Games.</p><h3>Introducing Women’s Cycling Weekly</h3><p>Hello! Welcome to Women’s Cycling Weekly issue twelve.</p><p>We’re inching ever-closer to the start of the road season with Omloop Het Nieuwsblad just two weeks away now. Meanwhile, as ever, there’s been a lot going on in the world of women’s cycling this week; with a certain magazine issue causing a stir, a potential record-breaking ride, and (sadly) more race rearranging.</p><p>Read the full Women’s Cycling Weekly by Amy Jones <a href=\"https://mamilrepeller.substack.com/p/womens-cycling-weekly-issue-12?utm_medium=email&amp;utm_campaign=cta\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</p><h2>In case you missed it…</h2><h3>The Secret Pro: Supertucks and the coming season</h3><p>The new season is underway and with all of the new UCI rules, <a href=\"https://cyclingtips.com/2021/02/the-secret-pro-supertucks-and-the-coming-season/\" target=\"_blank\" rel=\"noreferrer noopener\">the Secret Pro</a> is back to dish some dirt.</p><h3>Melbourne to Warrnambool postponed as Victoria re-enters lockdown</h3><p>The 105th edition of the Melbourne to Warrnambool Cycling Classic has been postponed less than 24 hours before it was set to run. Read the full story <a href=\"https://cyclingtips.com/2021/02/melbourne-to-warrnambool-postponed-as-victoria-re-enters-lockdown/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</p><h3>Jabra Elite Active 75 T headphone review: hear hear?</h3><p>Iain Treloar reviews <a href=\"https://cyclingtips.com/2021/02/jabra-elite-active-75t-headphone-review-hear-hear/\" target=\"_blank\" rel=\"noreferrer noopener\">Jabra’s range-topping sports headphone</a>.</p><div><h5>Tags</h5></div></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d3a1cc0ac107554ae925d97bf34d0257d074ee019f6b412b384c03be3fc2e537","category":"Cycling"}