{"title":"Mark Cavendish is recovering at home after Ghent Six crash: ‘I’ll survive’","link":"https://cyclingtips.com/2021/11/mark-cavendish-is-recovering-at-home-after-ghent-six-crash-ill-survive/","date":1638029843000,"content":"<div><div><p>A few days after his release from the Ghent University Hospital’s ICU, Mark Cavendish is back home and recovering from his <a href=\"https://cyclingtips.com/2021/11/cavendish-suffers-two-broken-ribs-and-a-collapsed-lung-in-ghent-six-crash/\">nasty Ghent Six crash</a>.</p><p>“When I crashed I knew I’d done some damage and was in a bad way, that scares you,” Cavendish told The Sun. “But the kids were there and my instinct was to stand up so they’d know I’m OK. I walked back to the cabins we stay in at the velodrome and when they’d gone I was stretchered off to hospital.”</p><p>Cavendish and his partner Iljo Keisse were deep into the last day of Ghent Six, on the super-short ‘t Kuipke velodrome labelled the “wall of death”, when the Manxman hit the deck hard.</p><p>“It was a freak accident caused by water on the track after a rider spilled his drink,” Cav explained. “There was a slip of wheels in front which started a chain reaction and caused the crash. I landed on a bike, broke my ribs and ripped a hole in my lung. The hole is behind my heart, which complicates things and makes it harder to monitor, because it doesn’t show on X-rays, but I’ll survive.”</p><p>The Manx Missile is no stranger to injuries, and all the pain and retraining they involve. Though he’s <a href=\"https://cyclingtips.com/2021/09/cavendish-and-lefevere-have-reached-an-agreement-for-2022/\">yet to sign on the dotted line</a> for next season, Cav remains stoic and optimistic about his recovery and racing future.</p><p>“As professional sportspeople you know your body well enough to know what it means and what the recovery time is,” he said. “We’re used to broken bones and lungs heal quite quickly, so I should be back in the saddle in a few weeks. It might push my season back a bit, and I’ll be in pain for a while, but I heal well so it’s not too bad.”</p><p>Before his triumphant 2021 season, Cav had endured a number of difficult years, marred by injury, illness and <a href=\"https://cyclingtips.com/2020/04/mark-cavendish-opens-up-about-battle-with-depression/\">clinical depression</a>. He overcame the shoulder injury and the still longer recovery from Epstein-Barr, but learning to manage his mental health is an ongoing process.</p><p>“There’s almost a karma that somebody like me gets depression and that’s why I’m not afraid to talk about it,” he explained, admitting that he would have dismissed its seriousness before experiencing it himself. “Depression is not about feeling sorry for yourself because things aren’t going your way, it’s a medical condition that you can’t control.”</p><p>Mental health is not something we hear about often in professional cycling, but there’s little doubt that in a sport with such high demands on body and mind, emotional and mental challenges must be understood.</p><p>“I changed. I just wasn’t me. I was numb, with no empathy or feeling towards anybody or anything,” Cavendish said. “It’s hard to describe because it can be nothingness and it can be absolutely everything. But after saying it was all nonsense before, I can now say, from personal experience, mental health problems are real and have to be taken seriously.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/CORVOS_00033742-025-1340x893.jpg\"><figcaption>The Manx Missile ponders the “wall of death” from his ‘cabin’ in a quiet moment during Ghent Six.</figcaption></figure><p>“I’ve always thought it’s better to wear your heart on your sleeve, then people know what they’re getting from you,” Cavendish said. “You don’t have to pretend to be someone else to anyone and experience has now taught me that if you’re not all right, you have to say so. There’s not always something people can do about it. Just being able to open up about it is often enough to help.</p><blockquote><p>“Depression changes your life and you’re never the same again. But you can move forward, you can deal with things, you can turn things positive – and it all came right this year.”</p></blockquote><p>Back in the livery of Deceuninck-QuickStep, the signs were good from early in the 2021 season. <a href=\"https://cyclingtips.com/2021/04/cavendish-sprints-to-another-win-in-turkey-daily-news/\">Wins in Turkey</a> gathered momentum and before long, Cav was <a href=\"https://cyclingtips.com/2021/06/cavendish-proves-he-can-still-beat-the-worlds-best/\">beating some of the world’s best</a>. Then the Tour de France happened – <a href=\"https://cyclingtips.com/2021/07/mark-cavendish-wins-34th-tour-de-france-stage-matching-eddy-merckx/\">four stage wins</a> and the green jersey for the second time in his career, ten years after the first.</p><p>Naturally, the sprinter is expecting/hoping to return to the Tour’s happy hunting ground in 2022, but Cav was quick to dismiss a deliberate assault on the Merckx record.</p><p>“My goal is to try to win as much as I can, for as long as I can,” he said. “There’s no specific number I want to reach.”</p><p>Retirement seems further off now than it did this time last year – “<a href=\"https://cyclingtips.com/2020/10/mark-cavendish-isnt-done-racing-probably/\">That’s perhaps the last race of my career</a>”, he told reporters at Gent-Wevelgem, October 20, 2020 – but at 36 years old, he’s much more, let’s say, experienced than most of his rivals. While he’ll keep racing for a while longer, Cavendish has given some thought to what’s next.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/GettyImages-1354656133-1340x893.jpg\"><figcaption>Cav celebrates with his daugher Delilah at Ghent Six.</figcaption></figure><p>“My family have been on the back end of my career for too long so first and foremost, I’ll do what’s best for them,” he said. “But I have options and I have desires when it comes to what I do next.</p><p>“I’m not lucky to be a cyclist, because I have worked hard and sacrificed my whole life. But every day I’m on a bike, I feel fortunate to be able to do what I love and I’m fortunate that I’m in a position that I can choose what I want to do after in my career.”</p><p>Cavendish is better equipped than most to deal with recovery. While he was coping with Epstein-Barr and depression, deep in a results draught, he felt abandoned by some of those who were meant to believe in him most. But he knew what he had to do to get back to himself, with or without support.</p><p>“People who were with me went away while I was trying to find my way back,” he said of his darkest period. “But I knew what I could do, I knew where I was before and what I needed to do to get back there. I didn’t know how long it would take – maybe a year, maybe ten years – but I always knew that I had the dogged persistence and the work ethic to come back to the top.”</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d4f488bf38febb74ddbaf462840f94389504562b0c8e559ceaaf90a5caab4593","category":"Cycling"}