{"title":"Chrome users have faced 3 security concerns over the past 24 hours","link":"https://arstechnica.com/?p=1740160","date":1612560098000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>CHROME —</h4><h2 itemprop=\"description\">A 0-day, malicious extension, and sync abuse are keeping Google developers busy.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/05/Chrome.jpg\" alt=\"Chrome users have faced 3 security concerns over the past 24 hours\"><figcaption></figcaption></figure><p>Users of Google’s Chrome browser have faced three security concerns over the past 24 hours in the form of a malicious extension with more than 2 million users, a just-fixed zero-day, and new information about how malware can abuse Chrome's sync feature to bypass firewalls. Let’s discuss them one by one.</p><p>First up, the Great Suspender, an extension with more than 2 million downloads from the Chrome Web Store, has been pulled from Google servers and deleted from users’ computers. The extension has been an almost essential tool for users with small amounts of RAM on their devices. Since Chrome tabs are known to consume large amounts of memory, the Great Suspender temporarily suspends tabs that haven’t been opened recently. That allows Chrome to run smoothly on systems with modest resources.</p><h2>Characteristically terse</h2><p>Google's official reason for the removal is characteristically terse. Messages displayed on devices that had the extension installed say only, “This extension contains malware” along with an indication that it has been removed. A Google spokesman declined to elaborate.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/great-suspender.png\" data-height=\"172\" data-width=\"680\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/great-suspender-640x162.png\" width=\"640\" height=\"162\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/great-suspender.png 2x\"></a><figcaption></figcaption></figure><p>The longer back story is that, as <a href=\"https://github.com/greatsuspender/thegreatsuspender/issues/1263\">reported in a GitHub thread in November</a>, the original extension developer sold it last June, and it began showing signs of malice under the new ownership. Specifically, the thread said, a new version contained malicious code that tracked users and manipulated Web requests.</p><p>The automatic removal has left some users in the lurch because they can no longer easily access suspended tabs. Users in <a href=\"https://www.reddit.com/r/chrome/comments/lch3k5/warning_please_immediately_uninstall_the_great/gm0murs/\">this Reddit thread</a> have devised several ways to recover their tabs.</p><h2>High severity zero-day</h2><p>Next, Google on Thursday released a Chrome update that fixes what the company said was a zero-day vulnerability in the browser. Tracked as CVE-2021-21148, the vulnerability stems from a buffer overflow flaw in V8, Google’s open-source JavaScript engine. Google rated the severity as “high.”</p><p>Once again, Google provided minimal information about the vulnerability, saying only that the company “is aware of reports that an exploit for CVE-2021-21148 exists in the wild.”</p><p>In a <a href=\"https://www.tenable.com/blog/cve-2021-21148-google-chrome-heap-buffer-overflow-vulnerability-exploited-in-the-wild\" rel=\"nofollow\">post published Friday</a> by security firm Tenable, however, researchers noted that the flaw was reported to Google on January 24, one day before Google’s threat analysis group dropped a <a href=\"https://blog.google/threat-analysis-group/new-campaign-targeting-security-researchers/\">bombshell report</a> that hackers sponsored by a nation-state were using a malicious website to infect security researchers with malware. Microsoft issued its <a href=\"https://www.microsoft.com/security/blog/2021/01/28/zinc-attacks-against-security-researchers/\" rel=\"nofollow\">own report</a>&nbsp;speculating that the attack was exploiting a Chrome zero-day.</p><p>Google has declined to comment on that speculation or provide further details about exploits of CVE-2021-21148.</p><h2>Sync abuse</h2><p>Lastly, a security researcher <a href=\"https://isc.sans.edu/diary/27066\">reported on Thursday</a> that hackers were using malware that abused the Chrome sync feature to bypass firewalls so the malware could connect to command and control servers. Sync allows users to share bookmarks, browser tabs, extensions, and passwords across different devices running Chrome.</p><p>The attackers used a malicious extension that wasn’t available in the Chrome Web Store. The above link provides a wealth of technical details.</p><p>A Google spokesman said that developers won’t be modifying the sync feature because physically local attacks (meaning those that involve an attacker having access to the computer) are explicitly outside of Chrome's threat model. He included <a href=\"https://chromium.googlesource.com/chromium/src/+/master/docs/security/faq.md#Why-arent-physically_local-attacks-in-Chromes-threat-model\">this link</a>, which further explains the reasoning.</p><p>None of these concerns mean you should ditch Chrome, or even the sync feature. Still, it’s a good idea to check the version of Chrome installed to ensure it’s the latest, 88.0.4324.150.</p><p>The usual advice about browser extensions also applies, which is essentially to install them only when they’re truly useful and after vetting the security in user comments. That advice wouldn’t have saved Great Suspender users, however, which is precisely the problem with extensions.</p></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d5208b56a49e4f4fd94293b55d008d4edbf37cc27a59ae1eb2ca9487c5dac554","category":"Tech"}