{"title":"Valve Ordered to Give Apple Information on 436 Steam Games As Part of Epic Games Legal Case","link":"https://www.macrumors.com/2021/02/25/valve-apple-data-request-for-epic-games-case/","date":1614246614000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/02/25/valve-apple-data-request-for-epic-games-case/\"><p>Valve, the makers behind popular game distribution platform Steam, will be forced to hand over aggregate historical sales, price, and other information on 436 games hosted on the store to Apple, as part of the Apple vs. <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> antitrust case.</p><p><img alt=\"steam apple logo\" width=\"2560\" height=\"1440\" src=\"https://images.macrumors.com/t/nMhvWK5dKXBL9XcXoWdCEJuWjEA=/400x0/filters:quality(90)/article-new/2021/02/steam-apple-logo.jpg?lossy\" data-src=\"https://images.macrumors.com/t/nMhvWK5dKXBL9XcXoWdCEJuWjEA=/400x0/filters:quality(90)/article-new/2021/02/steam-apple-logo.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/nMhvWK5dKXBL9XcXoWdCEJuWjEA=/400x0/filters:quality(90)/article-new/2021/02/steam-apple-logo.jpg?lossy 400w,https://images.macrumors.com/t/gMrGfTz5nZW_0q95zptQgr_X8HE=/800x0/filters:quality(90)/article-new/2021/02/steam-apple-logo.jpg?lossy 800w,https://images.macrumors.com/t/aCOsVXby49KzTI-f9Po4GUOML2g=/1600x0/filters:quality(90)/article-new/2021/02/steam-apple-logo.jpg 1600w,https://images.macrumors.com/t/nLidsLfvN2dL6f5jIcu2YmE488I=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/steam-apple-logo.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/nMhvWK5dKXBL9XcXoWdCEJuWjEA=/400x0/filters:quality(90)/article-new/2021/02/steam-apple-logo.jpg?lossy 400w,https://images.macrumors.com/t/gMrGfTz5nZW_0q95zptQgr_X8HE=/800x0/filters:quality(90)/article-new/2021/02/steam-apple-logo.jpg?lossy 800w,https://images.macrumors.com/t/aCOsVXby49KzTI-f9Po4GUOML2g=/1600x0/filters:quality(90)/article-new/2021/02/steam-apple-logo.jpg 1600w,https://images.macrumors.com/t/nLidsLfvN2dL6f5jIcu2YmE488I=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/steam-apple-logo.jpg 2500w\"><br>As reported in a paywalled report by <em><a href=\"https://www.law360.com/articles/1358452\">Law360</a></em>, during a virtual discovery hearing on Wednesday, U.S. Magistrate Judge Thomas S. Hixson ordered that Apple's subpoena for the data to Valve was valid, however, noted that Apple has \"salted the earth with subpoenas,\" telling Valve \"don’t worry, it’s not just you.\" Apple's original subpoena requested data from Valve about Steam dating as far back as 2015, the judge's ruling however will only require Valve to produce data limited to as early as 2017.</p><p>‌Epic Games‌ is in a heated legal battle with Apple over the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> and claims that the Cupertino tech-giant locks developers into its ecosystem, and forces them to pay a \"30% tax\" for in-app purchases. Apple's subpoena for data from Valve is one of many that Apple has set forward as it attempts to prove its point that the ‌App Store‌ as a distribution platform for software is no different than others.</p><p>Gavin W. Stok, a lawyer representing Valve in the discovery hearing, urged Judge Hixson to reject the subpoena and not force his company to produce the data. Stok says that Valve is run by a small team and that collecting all the data Apple is requesting would require it to \"dedicate multiple employees working full time,\" and that it would not be able to guarantee the request could be met on time.</p><p>Apple's lawyer, Jay P. Srinivasan, says that the request is doable, and points out that Apple could have requested data on all 30,000 games on the Steam store, but that it instead is only requesting data on 436 games. Apple continued to defend its subpoena, calling Valve a \"prominent player\" in the complete picture of relevant markets like the ‌App Store‌.</p><p>Ahead of what is expected to be a heated court hearing set for July 2021 between Apple and ‌Epic Games‌, Valve has until mid-March to produce the data. We've reached out to Valve for a comment on the judge's ruling and will update the page once we hear back.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/22/2021-macbook-pro-sd-hdmi-port-kuo/\">Kuo: New MacBook Pro Models With HDMI Port and SD Card Reader to Launch Later This Year</a></h3><p>Monday February 22, 2021 8:52 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple plans to release two new MacBook Pro models equipped with an HDMI port and SD card reader in the second half of 2021, according to analyst Ming-Chi Kuo, who outlined his expectations in a research note obtained by MacRumors. The return of an SD card reader was first reported by Bloomberg's Mark Gurman last month. \"We predict that Apple's two new MacBook Pro models in 2H21 will have...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/23/m1-mac-users-report-excessive-ssd-wear/\">M1 Mac Users Report Excessive SSD Wear</a></h3><p>Over the past week, some M1 Mac users have been reporting alarming SSD health readings, suggesting that these devices are writing extraordinary amounts of data to their drives (via iMore). Across Twitter and the MacRumors forums, users are reporting that M1 Macs are experiencing extremely high drive writes over a short space of time. In what appear to be the most severe cases, M1 Macs are sai...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/22/iphone-13-boe-display-panels/\">BOE Rumored to Supply iPhone 13 Display Panels After iPhone 12 Failures</a></h3><p>Monday February 22, 2021 9:54 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Display manufacturer BOE will be one of the main suppliers of OLED panels for iPhone 13 models, according to a new report today from Taiwan's Economic Daily News. BOE is said to be working with touch panel manufacturer General Interface Solution (GIS), part of the Hon Hai Group to develop OLED panels. Multiple iPhone 12 rumors suggested that BOE would supply some panels for the devices,...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/22/apple-revokes-silver-sparrow-certificates/\">Apple Takes Step to Prevent Further Spread of 'Silver Sparrow' Malware on Macs</a></h3><p>Monday February 22, 2021 6:13 am PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Over the weekend, we reported on the second known piece of malware compiled to run natively on M1 Macs. Given the name \"Silver Sparrow,\" the malicious package is said to leverage the macOS Installer JavaScript API to execute suspicious commands. After observing the malware for over a week, however, security firm Red Canary did not observe any final payload, so the exact threat to users remains a...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/24/prosser-imac-colors-mac-pro-to-resemble-mac-minis/\">Prosser: 2021 iMac to Come in Five Colors, Apple Silicon Mac Pro to Resemble 'Stacked' Mac Minis</a></h3><p>Hit-and-miss leaker Jon Prosser has today alleged that the upcoming 2021 iMac models will offer five color options, mirroring the colors of the fourth-generation iPad Air, and revealed a number of additional details about the Mac Pro with Apple Silicon. In a new video on YouTube channel FrontPageTech, Prosser explained that the redesigned iMacs will come featuring options for Silver, Space ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/21/whatsapp-fate-of-accounts-privacy-policy/\">WhatsApp Reveals What Happens to Users Who Don't Agree to Upcoming Privacy Policy Changes</a></h3><p>Sunday February 21, 2021 1:11 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>WhatsApp has revealed how it will gradually limit the features available to accounts held by users who do not accept the platform's impending privacy policy changes, due to come into effect on May 15. WhatsApp's new banner explaining the privacy policy changes According to an email seen by TechCrunch to one of its merchant partners, WhatsApp said it will \"slowly ask\" users who have not yet...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/21/next-gen-airpods-image-leak/\">Alleged Leaked Image Claims to Show Third-Generation AirPods and Case</a></h3><p>Sunday February 21, 2021 2:49 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>A new image claims \u0010to offer our first real world look at Apple's next-generation AirPods. The image, shared by 52audio, showcases both AirPods and the charging case for what the site claims to be the third iteration of the wireless earbuds. 52audio has in the past shared images claiming to showcase different parts of the third-generation AirPods. Most notably, the site in November shared...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/23/anker-magsafe-battery-pack/\">Anker Releases MagSafe-Compatible Battery Pack for iPhone 12 Lineup</a></h3><p>Tuesday February 23, 2021 7:49 am PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Following rumors that Apple is working on a MagSafe battery pack for iPhone 12 models, popular accessory maker Anker has beaten Apple to the punch with the release of its PowerCore Magnetic 5K Wireless Power Bank. First previewed at CES 2021, the PowerCore battery pack magnetically attaches to the back of any iPhone 12 model and provides 5W of wireless charging. With a 5,000 mAh capacity,...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/23/mini-led-ipad-pro-macbooks-ennostar/\">New iPad Pro and MacBook Models With Mini-LED Displays Again Rumored to Launch This Year</a></h3><p>Monday February 22, 2021 9:32 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Taiwanese company Ennostar will begin production of Mini-LED backlight units for an upcoming 12.9-inch iPad Pro in the late first quarter or second quarter of this year, according to industry sources cited by DigiTimes. Ennostar is a holding company that was jointly established in January 2021 by LED-related manufacturers Epistar and Lextar Electronics. Apple is expected to unveil the new ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/22/ios-14-5-zero-click-attacks-harder/\">iOS 14.5 to Make Zero-Click Attacks 'Significantly Harder'</a></h3><p>Apple's impending iOS and iPadOS 14.5 update will make zero-click attacks considerably more difficult by extending PAC security provisions, according to Motherboard. Apple has made a change to the way in which it secures its code in the latest betas of iOS 14.5 and iPadOS 14.5 to make zero-click attacks much harder. The change, spotted by security researchers, has now been confirmed by...</p></div></div></div>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d554836c340c466796ba4c0ac04288d2386989c4ef7fef54720600201c8261b0","category":"Apple"}