{"title":"Apple TV+ Lands First Oscar Nominations for 'Greyhound' and 'Wolfwalkers'","link":"https://www.macrumors.com/2021/03/15/apple-tv-plus-first-oscar-nominations/","date":1615814437000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/15/apple-tv-plus-first-oscar-nominations/\"><p>Apple TV+ today picked up its first-ever Oscar nominations, with the Tom Hanks film \"Greyhound\" nominated for \"Best Sound\" and the animated Cartoon Saloon film \"Wolfwalkers\" nominated for \"Best Animated Feature Film.\"</p><p><img alt=\"oscar awards banner\" width=\"1920\" height=\"1080\" src=\"https://images.macrumors.com/t/kySuel6yYg9jJaxTfNzHZgvEr88=/400x0/filters:quality(90)/article-new/2021/03/oscar-awards-banner.jpeg?lossy\" data-src=\"https://images.macrumors.com/t/kySuel6yYg9jJaxTfNzHZgvEr88=/400x0/filters:quality(90)/article-new/2021/03/oscar-awards-banner.jpeg?lossy\" data-srcset=\"https://images.macrumors.com/t/kySuel6yYg9jJaxTfNzHZgvEr88=/400x0/filters:quality(90)/article-new/2021/03/oscar-awards-banner.jpeg?lossy 400w,https://images.macrumors.com/t/1WKwEyoi9FAQwY4f5LhjvhhWJJE=/800x0/filters:quality(90)/article-new/2021/03/oscar-awards-banner.jpeg?lossy 800w,https://images.macrumors.com/t/qznX5xqD2rudtX3WZdeY2nRVRNE=/1600x0/filters:quality(90)/article-new/2021/03/oscar-awards-banner.jpeg 1600w,https://images.macrumors.com/t/JEgNBTy4CTyQPcTJN0JgGLTA-oc=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/oscar-awards-banner.jpeg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/kySuel6yYg9jJaxTfNzHZgvEr88=/400x0/filters:quality(90)/article-new/2021/03/oscar-awards-banner.jpeg?lossy 400w,https://images.macrumors.com/t/1WKwEyoi9FAQwY4f5LhjvhhWJJE=/800x0/filters:quality(90)/article-new/2021/03/oscar-awards-banner.jpeg?lossy 800w,https://images.macrumors.com/t/qznX5xqD2rudtX3WZdeY2nRVRNE=/1600x0/filters:quality(90)/article-new/2021/03/oscar-awards-banner.jpeg 1600w,https://images.macrumors.com/t/JEgNBTy4CTyQPcTJN0JgGLTA-oc=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/oscar-awards-banner.jpeg 2500w\"><br>\"Greyhound\" is up against some tough competition, including the Pixar film \"Soul\" on Disney+ and the Netflix film \"Mank,\" along with \"News of the World\" and \"Sound of Metal.\" In the animated category, \"Wolfwalkers\" is also up against \"Soul,\" in addition to \"Onward,\" \"Over the Moon,\" and \"A Shaun the Sheep Movie: Farmageddon.\"</p><p>Apple TV+'s first Oscar nominations are not in major categories, but the streaming service still has a relatively small catalog of films. On the television side, Apple TV+ has seen more success this awards season, with hit comedy series \"Ted Lasso\" and star Jason Sudeikis <a href=\"https://www.macrumors.com/2021/02/28/jason-sudeikis-wins-golden-globe-award/\">winning a Golden Globe Award</a>, <a href=\"https://www.macrumors.com/2021/03/07/ted-lasso-wins-critics-choice-award/\">multiple Critics Choice Awards</a>, and more.</p><p>The 93rd Academy Awards ceremony will be hosted on Sunday, April 25 at 8 p.m. Eastern Time. The awards honor the best films released between January 1, 2020, and February 28, 2021, as chosen by the Academy of Motion Picture Arts and Sciences.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/12/iphone-13-touch-id-under-display/\">iPhone 13 Models Will 'Likely' Have Touch ID Under the Display</a></h3><p>iPhone 13 models slated for release later this year will \"likely\" feature a fingerprint scanner embedded under the display for authentication, in addition to Face ID, according to Barclays analyst Andrew Gardiner and three of his colleagues. In a research note shared with MacRumors today, the analysts added that iPhone 13 models will feature a smaller notch and that the LiDAR Scanner will...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/13/top-stories-apple-event-rumor-march-23/\">Top Stories: Apple Event Rumored for March 23, iMac Pro and HomePod Discontinued, and More</a></h3><p>Rumors about a potential Apple event are starting to heat up as we're getting close to the time of year when Apple frequently hosts an event, so stay tuned for more information on that front in the coming days and weeks. This week also saw Apple confirm it has discontinued both the iMac Pro and the original HomePod, while rumors are continuing to look forward to new Apple silicon MacBook Pro ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-discontinuing-homepod/\">Apple Discontinues Full-Sized HomePod to Focus on HomePod Mini</a></h3><p>Friday March 12, 2021 5:14 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple has discontinued the standard HomePod to focus exclusively on the HomePod mini, reports TechCrunch. First introduced four years ago, Apple's larger HomePod has never sold well because of its high price tag. Apple hoped that the HomePod's high-quality sound would give it an edge over competing products, but sales of the HomePod have always been lackluster with so many more affordable...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-silicon-mac-shipments-forecast/\">Next-Generation Apple Silicon MacBooks Expected to Drive Record-Breaking Mac Shipments This Year</a></h3><p>In a research note shared with MacRumors today, Barclays analysts said they expect Apple to report record Mac shipments in the 2021 fiscal year. Apple has seen strong demand for Macs driven by the COVID-19 pandemic and the release of Apple silicon Macs. With rumors indicating that Apple plans to release redesigned 14-inch and 16-inch MacBook Pro models with Apple silicon in the second half...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/airpods-3-redesign-new-images/\">Upcoming AirPods 3 Redesign Shown Off in New Images</a></h3><p>Friday March 12, 2021 11:55 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the AirPods 3 rumored to be launching as soon as this month, we've been seeing an increasing number of leaks showing off the design of the new earbuds. Renders were shared yesterday, and today, 52audio has published a series of images said to feature the third-generation AirPods. As with prior leaks, the AirPods 3 have an AirPods Pro-like design with a shorter stem and a more rounded...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/disney-magicband-support-iphone-apple-watch/\">Disney World MagicBand Support Coming to iPhone and Apple Watch</a></h3><p>Disney today announced MagicBand support for iPhone and Apple Watch in a service called \"Disney MagicMobile,\" which uses the Wallet app. Disney's MagicBand is a colorful wristband that guests can wear at Walt Disney World to enter the theme parks, unlock their hotel room, and buy food and merchandise. MagicMobile brings a contactless way to access many MagicBand features using only an...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/apple-prototyped-jet-black-iphone-x/\">Apple Prototyped a Jet Black iPhone X</a></h3><p>Friday March 12, 2021 12:18 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of the iPhone 7 in 2016, Apple debuted a new \"Jet Black\" color, which was a glossy, shiny finish that was a departure from the standard brushed aluminum finishes of the iPhones that preceded it. Jet Black was unique because of how dark it was in comparison to other \"black\" and \"space gray\" finishes at the time. Apple hasn't used the same Jet Black finish for another phone to...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/12/google-touts-chrome-89-memory-savings-mac/\">Google Touts Chrome 89 Memory Savings That 'Keep Your Mac Cooler' While Browsing</a></h3><p>Friday March 12, 2021 2:28 am PST by <a href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\">Tim Hardwick</a></p><p>Google's Chrome browser has been criticized for years for being a system resource hog, but Chromium developers are making some loud claims about how much smarter the latest version is at using and freeing up memory on macOS. According to a new post on Google's Chromium blog, Chrome developers recently managed to shrink the memory footprint of background tabs on Mac by up to 8%, or just over...</p></div></div></div>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d55b610cf8e90a69b5a72e274b937dd3603c967a4e4bc385f25996af4a9c9908","category":"Apple"}