{"title":"Pure nonsense: Debunking the latest attack on renewable energy","link":"https://arstechnica.com/?p=1744598","date":1614603138000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Ow, my brain —</h4><h2 itemprop=\"description\">What a terrible anti-renewable-power video reveals about the US energy market.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1231321911-800x533.jpg\" alt=\"Image of wind turbines.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1231321911.jpg\" data-height=\"682\" data-width=\"1024\">Enlarge</a> <span>/</span> Miraculously, the video at issue did not accuse wind turbines of causing cancer.</p></figcaption></figure><p>Our editor-in-chief obviously hates me. That's the only conclusion I could reach after he asked me to watch an <a href=\"https://www.prageru.com/video/whats-wrong-with-wind-and-solar/\">abysmal attack video</a> targeting renewable energy—a video produced by a notorious source of right-wing misinformation.</p><p>But despite its bizarre mishmash of irrelevancies and misdirection, the video has been widely shared on social media. Perhaps you've seen it, or maybe you just to want to be ready when a family member brings it up in an argument. What, if anything, is true in this farrago of bad faith?</p><h2>Yes, it’s awful</h2><p>The video is hosted by \"Prager University.\" My only previous exposure to the organization's videos had been&nbsp;<a href=\"https://www.youtube.com/watch?v=pcy7qV-BGF4\">this excellent one</a>&nbsp;on the Confederacy by Colonel Ty Seidule, a professor of History at West Point who has since been <a href=\"https://www.defense.gov/Explore/News/Article/Article/2503070/austin-announces-members-of-base-naming-commission/\">placed on the Pentagon commission</a> that will examine bases named after Confederate generals. Seemed legit!</p><p>Now that I've had to look more closely, however, it turns out that Prager U is not a university—it's run by a talk radio host. Its videos frequently contain misinformation, especially when the subject is climate change. The content is so bad that Google, which is often slow to react to misinformation on its platforms, has slapped fact checks on a number of Prager U videos.</p><p>Even without the Prager U branding, the host of this video would cause some concern. Mark Mills is associated with the Manhattan Institute, a free-market think tank with a long history of rejecting any government involvement in markets. This has left the group with a reflexive loathing of any attempts to address global warming.</p><p>Mills himself is not necessarily a reliable source on renewable power, as he's been heavily involved in companies focused on nuclear power and fossil fuel extraction. Mills has also spoken at <a href=\"https://arstechnica.com/science/2015/07/i-rejoice-that-it-is-warm-ars-attends-a-climate-contrarian-conference/\">the climate meeting</a> hosted by the <a href=\"https://arstechnica.com/science/2012/05/anti-climate-science-group-experiments-with-trolling/\">notorious trolls</a> at the Heartland Institute.</p><p>All that is to say that my expectations here were low; the reality turned out to be worse.</p><p>The problems with the video go beyond simple matters of bias; the whole thing is just terribly argued. We can't possibly go into detail on all of the problems, but we can list a few issues that stood out.</p><ul><li>Mills complains that our best solar technology is only 26 percent efficient.<b>&nbsp;</b>But that's only true for silicon panels; our best, most expensive panels can <a href=\"https://en.wikipedia.org/wiki/Multi-junction_solar_cell\">clear 40 percent efficiency</a>.&nbsp;The focus on efficiency, however, is also a distraction, because solar panel efficiency is <em>already</em> high enough for solar farms to be economical.</li><li>The same issue arises when Mills complains about the efficiency of wind turbines. Is it as high as we would like? No. But who cares? Wind turbines already generate power economically. Improvements would be terrific, but they aren't necessary to make wind and solar work cheaply in the real world.</li><li>Mills suggests that the only solution to the peaks and troughs (or \"intermittency\") of wind and solar is batteries. But there are plenty of additional options, like compressed air storage, pumped hydro, or even fossil fuel plants with carbon capture.</li><li>Mills focuses all his attention on what he considers to be the limitations of lithium batteries. But there is plenty of research on other battery chemistries that use different metals entirely.</li><li>Mills argues that the lack of batteries is why wind and solar power aren't producing more than three percent of the world's power. Note that he's using \"power\" to get this figure.&nbsp;If instead he used \"electricity,\" wind and solar now produce over 10 percent globally, starting from zero a few decades ago.</li><li>Mills claims that lithium and cobalt are rare earth elements. They are not. This isn't important to his argument, but it's extremely sloppy.</li><li>Mills then says he has environmental concerns about the resource extraction needed to build solar panels, wind turbines, and batteries. This a valid concern to have! But it ignores the massive environmental damage caused by fossil fuel extraction and the production of equipment to burn it.</li><li>Mills does a similar thing with human rights abuses in places where these materials are sourced. Again, a worthy concern. But it remains a problem for fossil fuels as well.</li><li>Mills acts like it's not possible to recycle any of the hardware involved in wind, solar, and batteries. This is an area where work remains to be done, but as a blanket statement, it's certainly not true.</li><li>Mills calls our fossil fuel supply \"almost inexhaustible.\" Come on. This is just obviously not true.</li><li>Mills compares the rate of oil extraction to the rate of power generation by wind turbines... for no obvious reason whatsoever.</li></ul><p>Ironically, Mills closes his mess of arguments by saying, \"We live in the real world.\" But the video presents no evidence that he does.</p><p>Overall, the video shows a sloppy disregard for facts and offers a biased presentation of the ones Mills gets right, along with a lot of misdirection. If solar panels were so inefficient that we would need to pave over all of Arizona and New Mexico with them, then yes, that would matter. But they're not, so why does Mills even bring it up as a concern?</p><p>There are some valid issues here, of course. Mills is right that environmental degradation, abusive labor practices, and repressive governments plague our supply chains. But they plague <em>all</em> our supply chains—not just those for renewable energy. And he's correct that we haven't figured out how to recycle wind turbine blades that reach their end of life. But again, that sort of issue isn't unique to renewable energy.</p><p>Critically, the one thing missing from all of this is a recognition of the risks of climate change, which is the whole reason we're trying to shift to wind and solar as quickly as possible. That is apparently because Mills doesn't see much in the way of risks. But here in the real world, those risks are considerable and rising. No discussion of renewable power is competent if those risks are ignored, yet Mills ignores them.</p><h2>Why now?</h2><p>So yes, the video is terrible. But I've also grown to think it's significant, and not just because it has found a huge audience on social media. The video signifies two things.</p><p>First: a decade ago, the same video would have been about why climate change either isn't happening or isn't a risk. The fact that this one isn't about climate change is a clear indication of how badly that fight has been lost by those who want us to keep using fossil fuels. We've seen record temperatures year after year, and all the things we expected to see have arrived with them: raging fires, massive storms, and droughts. Sure, a handful of people remain unconvinced, but that population has shrunk to the point where nobody pays them much attention.</p><p>Second: if the fight about the fact of climate change is over, it has also grown increasingly irrelevant. In the US, President Biden now promises four years of pushing for expanded renewable energy. And the economics are in place to drive renewable power regardless of policy or the environment—which explains why red-state Iowa <a href=\"https://iub.iowa.gov/regulated-industries/wind-powered-electric-generation-iowa\">generates 41 percent of its electricity from wind power</a>. In many areas of the country, wind power is now <a href=\"https://arstechnica.com/science/2019/08/wind-power-prices-now-lower-than-the-cost-of-natural-gas/\">cheaper than the fuel</a> for a natural gas plant. A zero-emissions grid <a href=\"https://arstechnica.com/science/2021/01/new-study-a-zero-emissions-us-is-now-pretty-cheap/\">is now relatively cheap</a>. As a result, 80 percent of the power added to the US grid this year <a href=\"https://arstechnica.com/science/2021/01/wind-solar-to-dominate-new-us-generating-capacity-in-2021/\">will be emission-free</a>.</p><p>The economics are now such that utilities in much of the US will install as much renewable power as their grid can manage while keeping the lights on, as it's now the cheapest way to get power—even if you already have more fossil fuel plants than you need.</p><p>And that's \"the real world\" that this video fails to see, a world where there's no good reason to continue using fossil fuels at the level we have been. So if you don't have <em>good</em> reasons to oppose renewables but still want to see fossil fuels expand, you go with whatever <em>bad</em> reasons you can come up with.</p><p>Which nicely explains this video.</p></div></div></div>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d5e722feeaf90a217bfd89e6cb1d3809c9d343b2faf50669fe419a75ba90e1a6","category":"Tech"}