{"title":"German cycling coach to be sent home after racist remarks during Olympic TT","link":"https://cyclingtips.com/2021/07/german-cycling-coach-to-be-sent-home-after-racist-remarks-during-olympic-tt/","date":1627571094000,"content":"<div><p></p><h4>Nikias Arndt racing the men's time trial at the Tokyo Olympics.</h4><p></p><div><p>Patrick Moster, the German cycling coach who shouted “catch the camel riders” at Nikias Arndt as the German was racing the Olympic time trial behind riders from Eritrea, Algeria, Iran, and Syria, is being sent home from Tokyo.</p><p>Moster had been set to continue directing the German squad in the upcoming Olympic events on the track.</p><p>Alfons Hörmann, president of the German Olympic federation, announced the news on Thursday.</p><p>“We remain convinced that his public apology for the racist remarks he made yesterday is sincere. With this derailment, however, Mr. Moster violated the Olympic values,” Hörmann said. “Fair play, respect and tolerance are not negotiable for Team D.”</p><p>Moster could be heard making the remarks on the television broadcast of the men’s time trial on Wednesday as Arndt passed through the feed zone. Azzedine Lagab of Algeria and then Amanuel Ghebreigzabhier of Eritrea had just ridden through prior to Arndt’s arrival.</p><p>Moster later apologized.</p><p>“I am extremely sorry and can only offer my sincere apologies,” he said, according to the DPA news agency. “I didn’t want to offend anyone.”</p><p>Arndt condemned Moster’s comments, saying that he was “appalled,” and Lagab addressed the incident on Twitter.</p><figure></figure><p>A few hours later on Wednesday, the UCI put out a short statement.</p><p>“The Union Cycliste Internationale (UCI) deeply regrets the words of German sport director Patrick Moster during the men’s individual time trial at the Olympic Games Tokyo 2020 today,” read the statement. “This remark goes against the values the UCI represents, promotes, and defends. There is no place for racism in sport, and the UCI continues its commitment to eradicating all forms of discrimination from cycling and encouraging diversity and equality.”</p><p>On Thursday, the UCI followed up that statement with an announcement that the organization’s Disciplinary Committee had decided to provisionally suspend Moster, finding his remarks “in violation of article 12.4.017 (d) of the UCI Regulations,” which state that anyone who “behaves in an insulting manner, makes defamatory comments or otherwise contravenes the basic rules of decency” is not acting in accordance with the organization’s rules.</p><p>“This decision is without prejudice to the final decision of the UCI Disciplinary Commission or any action that may be taken by Mr Moster’s National Federation, the Bund Deutscher Radfahrer,” read a statement from the UCI.</p><p>“The UCI condemns all forms of racist and discriminatory behavior and strives to ensure integrity, diversity and equality in cycling.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d61ae544ebaf032044ad937c83ec382f54815cd412c158227180d7711b2032dd","category":"Cycling"}