{"title":"Tim Cook Calls for a 'Durable and Hopeful Future For All' in Wall Street Journal Op-Ed","link":"https://www.macrumors.com/2021/03/19/tim-cook-durable-and-hopeful-future-op-ed/","date":1616148749000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/19/tim-cook-durable-and-hopeful-future-op-ed/\"><p>Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> has penned an op-ed for the <em><a href=\"https://www.wsj.com/articles/tim-cook-on-the-pandemic-year-the-urgency-of-racial-justice-11616090633\">Wall Street Journal</a></em>, calling for more action to be taken against systemic racism and the need to speak up in light of the disproportionate impact that the pandemic has had on communities.</p><p><img alt=\"tim cook interview with cbs 6 20\" width=\"1240\" height=\"700\" src=\"https://images.macrumors.com/t/ARmRpmclAItkAzD6raOL9JgnOHo=/400x0/filters:quality(90)/article-new/2020/06/tim-cook-interview-with-cbs-6-20.jpg?lossy\" data-src=\"https://images.macrumors.com/t/ARmRpmclAItkAzD6raOL9JgnOHo=/400x0/filters:quality(90)/article-new/2020/06/tim-cook-interview-with-cbs-6-20.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/ARmRpmclAItkAzD6raOL9JgnOHo=/400x0/filters:quality(90)/article-new/2020/06/tim-cook-interview-with-cbs-6-20.jpg?lossy 400w,https://images.macrumors.com/t/TLFbu8ID-ALmAELp0v-lzt8bcvI=/800x0/filters:quality(90)/article-new/2020/06/tim-cook-interview-with-cbs-6-20.jpg?lossy 800w,https://images.macrumors.com/t/fQxtwFjym0EWZqjkgcFyLECBxBY=/1600x0/filters:quality(90)/article-new/2020/06/tim-cook-interview-with-cbs-6-20.jpg 1600w,https://images.macrumors.com/t/LLiVZM6-XM_-wQUIlUgf96BCwPA=/2500x0/filters:no_upscale():quality(90)/article-new/2020/06/tim-cook-interview-with-cbs-6-20.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/ARmRpmclAItkAzD6raOL9JgnOHo=/400x0/filters:quality(90)/article-new/2020/06/tim-cook-interview-with-cbs-6-20.jpg?lossy 400w,https://images.macrumors.com/t/TLFbu8ID-ALmAELp0v-lzt8bcvI=/800x0/filters:quality(90)/article-new/2020/06/tim-cook-interview-with-cbs-6-20.jpg?lossy 800w,https://images.macrumors.com/t/fQxtwFjym0EWZqjkgcFyLECBxBY=/1600x0/filters:quality(90)/article-new/2020/06/tim-cook-interview-with-cbs-6-20.jpg 1600w,https://images.macrumors.com/t/LLiVZM6-XM_-wQUIlUgf96BCwPA=/2500x0/filters:no_upscale():quality(90)/article-new/2020/06/tim-cook-interview-with-cbs-6-20.jpg 2500w\"><br>Cook's piece highlights how the pandemic has impacted various communities differently and draws on his personal experience of growing up during the civil rights movement.<br></p><blockquote><p>In simple theory, a disease should affect all of us equally. But in plain fact, the opposite is true. We have all seen, in real time, how structural discrimination and obstacles to opportunity do their work in a crisis. In our communities, every burden—from rates of infection and care outcomes, to economic adversity, to the challenges of virtual learning when schools are closed—falls heaviest on those for whom true equity has always been farthest from reach. As someone who grew up during the civil-rights movement, it has been frustrating to see how much work is still to be done but heartening to see the degree to which people of good will have set aside comfort with the status quo to march and to demand something better.</p></blockquote><p>As the end of the pandemic nears, Cook says it is a collective responsibility to ensure that moving forward, all individuals, communities, companies, and governments do everything they can to ensure a hopeful and \"durable\" future for all.<br></p><blockquote><p>When the pandemic recedes, we can't simply assume that healing follows. It falls on all of us—individuals and communities, companies and governments—to ensure that what's ahead is not just the end of a disease but a durable and hopeful future for all who sacrificed and endured during this unprecedented time.</p></blockquote><p>The global health crisis has forced millions of students to learn remotely from home, and Cook says Apple is committed to building \"powerful learning tools and [sharing] them freely with tens of thousands of teachers, educators, and parents.\" Cook goes on to describe Apple's multiple investments for Black and underrepresented communities.<br></p><blockquote><p>And it's led us to undertake major new investments through our Racial Equity and Justice Initiative. These projects include the Propel Center in Atlanta, which we're helping to build in partnership with the country's historically Black colleges and universities, to support the next generation of leaders of color in fields ranging from machine learning to app development, entrepreneurship to design; and our first Apple Developer Academy in the U.S., in downtown Detroit, home to more than 50,000 Black-owned businesses and no shortage of great ideas for the app economy.</p></blockquote><p>Cook ends with a hopeful message, saying that if anything, he hopes this pandemic has taught us that there is a need to speak up and that a long history of injustice should not be used as an excuse to do nothing.<br></p><blockquote><p>The old saying goes that the best time to plant a tree was 20 years ago, but the second best time is today. If this pandemic has taught us anything, I hope it’s that none of us can use injustice’s long history as an excuse not to act. Our lives on this planet are precious and fleeting, and fate has a way of reminding us that society is only as strong as those who, for too long, have gone overlooked and undervalued.</p></blockquote><p>Cook's full op-ed can be read with a subscription to <em><a href=\"https://www.wsj.com/articles/tim-cook-on-the-pandemic-year-the-urgency-of-racial-justice-11616090633\">The Wall Street Journal</a></em>.</p><p><small>Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our <a href=\"https://forums.macrumors.com/forums/political-news.218/\">Political News</a> forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.</small></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/17/justin-long-get-a-mac-intel-ad-campaign/\">Former 'I'm a Mac' Actor Justin Long Throws Shade at M1 Apple Silicon in New Intel Ad Campaign</a></h3><p>Wednesday March 17, 2021 5:10 am PDT by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Intel has called on the services of former \"I'm a Mac\" actor Justin Long in a series of new ads in which Apple's latest custom-made M1 processors are cast as inferior to newer laptops powered by Intel processors. Well known for his role in Apple's popular \"Get a Mac\" TV ad campaign from the 2000s, Long stars in a series of ads called \"Justin Gets Real\" on Intel's YouTube channel, beginning...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/duckduckgo-google-search-spying-on-users/\">DuckDuckGo Calls Out Google Search for 'Spying' on Users After Privacy Labels Go Live</a></h3><p>Monday March 15, 2021 12:06 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Over the course of the last several weeks, Google has been adding App Privacy labels to its iOS apps in accordance with Apple's App Store rules, but it took Google multiple months to begin sharing the information. There was speculation that Google's delay meant that it had something to hide, which DuckDuckGo is leaning into with a new tweet that highlights Google's data collection and calls...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/march-23-apple-event-rumored-ipad-airpods-airtags/\">March 23 Apple Event Rumored to Unveil New iPad Pro, AirPods 3, and AirTags</a></h3><p>Apple will hold its first event of 2021 on March 23 to reveal new products, according to a reliable Chinese leaker known as \"Kang.\" The event could see the unveiling of new iPad Pro models, updated AirPods, and the long-awaited AirTags item trackers. Kang has said Apple's March event will be held on the same date as the OnePlus 9 reveal, which is scheduled for Tuesday, March 23, opening up...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/iphone-12-aluminum-color-issues/\">Some iPhone 11 and iPhone 12 Models Losing Color From Aluminum Body</a></h3><p>Monday March 15, 2021 10:02 am PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Some iPhone 12 models have been losing color from their aluminum chassis, according to a new report from Svetapple.sk, which includes photos of a PRODUCT(RED) iPhone 12 model that has been noticeably leached of color. The side of the iPhone 12 near the power button has faded to an orange shade and there's a clear delineation where the red coloring has worn off. Svetapple.sk says that the...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/15/apple-shares-jump-airpods-pro-ad/\">Apple Shares 'Jump' AirPods Pro Ad</a></h3><p>Sunday March 14, 2021 9:09 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today shared a new AirPods Pro-focused ad called \"Jump\" on its YouTube channel, highlighting the Active Noise Cancellation and Transparency features of the earbuds in a creative way. In the spot, a man wearing AirPods Pro jump ropes through the city. It's set to the song \"Fallin' Apart\" by Young Franco, and it features the tagline \"Turn the world into your playground with AirPods Pro.\" ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/17/digitimes-12-9-ipad-pro-mini-led-q2-2021/\">DigiTimes: 12.9-Inch iPad Pro With Mini-LED Display No Longer Expected to Ship Until At Least April</a></h3><p>Wednesday March 17, 2021 2:44 am PDT by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple will not launch a new 12.9-inch iPad Pro with a mini-LED display until at least the second quarter of the year, which begins on April 1, according to industry sources cited by DigiTimes. From today's report: Epistar has become the exclusive supplier of miniLED chips to be used in 12.9-inch miniLED-backlit iPad Pro, with nearly 50% of the corresponding production capacity booked up for...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/17/arm-imac-xcode-crash-log/\">Apple Silicon iMac Potentially Surfaces in Xcode Crash Log</a></h3><p>Wednesday March 17, 2021 9:00 am PDT by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple is expected to release a redesigned iMac powered by Apple silicon later this year, and ahead of time, developer Dennis Oberhoff has discovered an unreleased ARM-based iMac in an Xcode crash log for his Mac app DaftCloud. Oberhoff shared the Xcode crash log on Twitter and with 9to5Mac, which took a closer look at the log and believes that it is legitimate. DaftCloud is a third-party...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/17/new-imac-coming-in-five-retro-colors/\">New iMac Coming in Five Retro Colors</a></h3><p>Apple's upcoming 2021 iMac models will come in five color options, mirroring the colors of the fourth-generation iPad Air and harking back to the original iMac, according to hit-and-miss leaker Jon Prosser. Prosser explained that the redesigned iMacs will feature color options in Silver, Space Gray, Green, Sky Blue, and Rose Gold. The range of color options apparently aims to capitalize...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/16/florida-teenager-prison-apple-twitter-bitcoin-hack/\">Florida Teenager to Spend 3 Years in Prison for Twitter Hack That Affected Apple</a></h3><p>Tuesday March 16, 2021 11:54 am PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>A Florida teenager who was accused of being the \"mastermind\" behind a July 2020 Twitter hack that affected Apple has agreed to a plea deal that will see him spending three years in prison, according to the Tampa Bay Times. Graham Ivan Clark, alongside others, compromised the Twitter accounts of 130 prominent companies and individuals to solicit Bitcoin, scamming people out of more than...</p></div></div></div>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"d6bdf0d20dc7277a48f13159c55bcc7e9a031f94f0452c8f22e02d0119d5e598","category":"Apple"}