{"title":"Zipp merges two wheelsets into one with the new 353 NSW","link":"https://cyclingtips.com/2021/04/zipp-new-353-nsw-wheelset/","date":1618928143000,"content":"<div><div><p>Today Zipp has announced the 353 NSW, a new mid-depth flagship wheelset that borrows the inspired-by-whales sawtooth rim shaping of the <a href=\"https://cyclingtips.com/2018/01/zipp-454-nsw-review/\" target=\"_blank\">454 NSW</a> and merges it with many of the fast ideas found in the fresh <a href=\"https://cyclingtips.com/2020/05/2021-zipp-303-firecrest/\" target=\"_blank\">303 Firecrests</a>. </p><p>The outcome is a wheelset that’s even lighter, faster, more stable, and quite a bit more expensive than Zipp’s 303 Firecrest. And much like the Firecrest, the new 353 NSW is only available for use with disc brakes and tubeless tyres.</p><h2>Zipp’s lightest tubeless wheelset yet </h2><p>The new 353 NSWs feature a 45 mm-deep rim profile front and rear, 5 mm deeper than the comparable 303 Firecrest, and 8-13 mm shallower than the 454 NSW (depending on front or rear). We’ve previously covered the undulating rim shape first seen on the <a href=\"https://cyclingtips.com/2018/01/zipp-454-nsw-review/\" target=\"_blank\">454 NSW</a>, but the basics are that the unmistakable sawtooth pattern helps smooth the airflow versus a more traditional shape, and in turn, the wheel is more stable for a given depth.</p><p>Zipp combines the undulating rim shape with its shark-fin-inspired “HexFin ABLC dimple Pattern”, a successor to golf-ball-like dimpling that aims to further reduce drag.  </p><p>Following in the steps of Zipp’s other recent releases, the 353 NSW moves to a disc-specific and wide hookless rim that must be used with tubeless clinchers (tubes can be used inside, but the tyre must be tubeless-compatible). Matching the <a href=\"https://cyclingtips.com/2020/05/2021-zipp-303-firecrest/\" target=\"_blank\">303 Firecrests</a>, the internal and external rim widths sit at 25 and 30 mm respectively.</p><p>This move to hookless rims currently limits your tyre choices and comes with a maximum allowable pressure of just 72.5 psi (5 bar), however Zipp is confident in the benefits it introduces. That wider rim and lower running pressures bring reduced rolling resistance. The transition from the tyre to the rim is flatter for improved aerodynamics. And the lack of a bead allows for a lighter and stronger rim to be produced due to more consistent control of resin distribution. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/Zipp-303-Firecrest-MY2020-vs-MY2021.jpg\"><figcaption>This graphic (from the 303 Firecrest launch) shows how a wider and hookless rim aims to offer aerodynamic gains.</figcaption></figure><p>Zipp says the wheels are fastest with 28 mm rubber, however according to the recently updated ETRTO tyre guidelines they can be run with anything from 25 to 65 mm tyres. Zipp doesn’t recommend these for mountain bike use, but the brand does say they’re well up to the task of gravel (assuming you don’t mind scratching such premium wheels). </p><p>Despite that slightly deeper and more involved rim profile, the 353 NSWs are 100 grams lighter than the already-light 303 Firecrests. In the lightest configuration (XDR freehub, no rim tape or valves), Zipp claims the 353 NSWs weigh just 1,255 g (580 g front, 675 g rear). That figure is made all the more impressive when you consider a 33 mm-deep, 26 mm-wide and tube-only wheelset like the <a href=\"https://cyclingtips.com/2020/06/roval-ditches-tubeless-with-its-new-rapide-and-alpinist-clx-wheels/\" target=\"_blank\">Roval Alpinist</a> weighs just 20-30 g less. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Amstel-gold-Zipp-353-NSW-1340x754.jpg\"><figcaption>The new 353 NSWs were raced by select riders at Amstel Gold.</figcaption></figure><h2>A price to match </h2><p>The new hoops spin with Zipp’s own updated Cognition V2 hubs which offer a re-engineered “axial clutch” freehub engagement mechanism that’s said to offer faster pick up, lower friction, and improved durability versus the <a href=\"https://cyclingtips.com/2018/01/zipp-454-nsw-review/\" target=\"_blank\">original Cognition hubs</a>. </p><p>Zipp laces these up with Sapim CX-Ray bladed stainless spokes and external aluminium nipples. The wheels are available with either Shimano HG or SRAM XDR freehub bodies, while Campagnolo users can order the necessary body separately. </p><p>The 353 NSWs sit at the top of the hierarchy alongside the 454 NSWs and that means there’s a hefty pricetag to match the lowly weight. Front and rear wheels are sold individually, but you can expect to pay US$4,000 / £3,200 / €3,600 / AU$6,027 for a matching pair. </p><p>No doubt the technology that’s inspired by whales but weighs more like a jellyfish is going to be unaffordable to most. If the price is frightening to you then keep in mind that Zipp also offers the vastly more affordable <a href=\"https://cyclingtips.com/2020/05/2021-zipp-303-firecrest/\" target=\"_blank\">303 Firecrest</a> and the even-cheaper <a href=\"https://cyclingtips.com/2020/05/new-zipp-303-s-aero-wheels-are-wider-hookless-tubeless-cheaper-disc-only/\" target=\"_blank\">303-S</a>.</p></div></div>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d6c11d7104f6f759a9e81d739a2f9f99eb855a462e75377414cd2eca38ecd6f8","category":"Cycling"}