{"title":"Spotlight: Granite Design Aux bottle cage review","link":"https://cyclingtips.com/2021/03/granite-design-aux-bottle-cage-review/","date":1616980227000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>The Granite Design Aux is a quality side-access carbon fibre bottle cage with a stiff construction that grasps a bidon with an iron grip. And if you were handed just the cage you’d assume there’s nothing special about it – it has two holes for mounting to any regular bidon cage mount and it does that task wonderfully.&nbsp;</p><p>However, take a look next to the two mounting holes and you’ll find slots running on either side of the cage. These are for Granite Design’s silicon-backed hook-and-loop strap kit which allows this cage to be mounted to just about anything between the diameters of 27.2 and 70 mm.&nbsp;</p><p>Combined with a rubber pad that sits beneath the bottle cage, the straps provide a surprisingly secure hold that’s more than capable of staying put under the weight of a full bottle.&nbsp;</p><p>However, it’s worth noting that the fit is most secure on larger tubes due to the hook-and-loop straps lacking gripper material in the initial length. This means that things like a 27.2 mm seatpost barely have enough silicon backing touching the tube and so the hold isn’t as rigid when compared to how it fits on a top tube or around the lower legs of a suspension fork.&nbsp;</p><p>Granite Design made the straps long enough for use with large e-bike downtubes, and you’re expected to cut the excess strapping off once fitted. This provides a cleaner aesthetic but may limit the ability to move the cage to a larger-sized tube in the future. Moving forward the company is expected to offer both regular and e-bike-specific strap lengths to avoid having to waste such large lengths of strap.</p><p>If you’ve ever used any kind of strap-on bag system before, you’ll know that even the most secure-fitting things still have a knack for marring paint. And so while it’s not a must, I’d still suggest wrapping some protective tape around any important painted surfaces, especially if you’re using this cage to add some water-carrying capacity to your carbon fork blades.</p><p>This product is currently only available in a right-handed version (bottle can be pulled out straight or from the right side), however, Granite Design is assessing market demand for a left-handed version.&nbsp;</p><p>This isn’t the only option of its kind on the market, but it’s certainly the most compact, quickest to fit, and lightest I’m aware of. Of course, the design does limit you to carrying sports bottles and nothing else, and so many in the bikepacking world may want to find themselves something more versatile. Still, even if those straps prove to be a fail for your needs, at least you’re left with a nice side-access bottle cage that doesn’t cost a mint.&nbsp;</p><p><strong>Price: </strong>US$28 / AU$40 (including strap kit)<br><strong>Weight:</strong> 24 grams (cage only), 45 g (with strap kit).&nbsp;<br><strong>More info:</strong> <a href=\"https://www.granite-design.com/aux\">granite-design.com</a>&nbsp;</p><div><h5>Tags</h5></div></div></div>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d6dbd229b680c1f98c7dbf443ec050c0884ab05c931dc4b3393a073454663132","category":"Cycling"}