{"title":"Google flags its iOS apps as “out of date” after two months of neglect","link":"https://arstechnica.com/?p=1741421","date":1613071748000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>\"LA LA LA I CAN'T HEAR YOU\" IS NOT A POLICY LOOPHOLE —</h4><h2 itemprop=\"headline\">Google’s servers warn users about its “out of date” iOS apps</h2><h2 itemprop=\"description\">Google hasn't updated major apps since the iOS 14 privacy requirements launched.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/3-2-800x369.jpg\" alt=\"The current state of Google's iOS app lineup. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/3-2.jpg\" data-height=\"461\" data-width=\"1000\">Enlarge</a> <span>/</span> The current state of Google's iOS app lineup.</p><p>Aurich Lawson</p></figcaption></figure><p>Google's major iOS apps have been seeing serious neglect for the past few months. On December 8, Apple's App Store started requiring all apps to show privacy \"<a href=\"https://arstechnica.com/gadgets/2020/09/ios-and-ipados-14-review-iphone-transformation-ipad-iteration/#h23\">nutrition labels</a>\" in their app store listing, where developers self-report what data an app uses for tracking and how that data is linked to a user. <em>Coincidentally</em>, a lot of Google's apps, especially the most popular ones, have not been updated since December 8.</p><p>The situation has gotten so bad that Google's servers were briefly flagging its <em>own</em> iOS apps as \"out of date.\"&nbsp;As detailed by Techmeme editor <a href=\"https://spencerdailey.com/2021/02/10/google-itself-is-now-telling-users-their-apps-are-out-of-date-despite-no-updates-being-available/\">Spencer Dailey</a>, Gmail, Google Photos, and Google Maps on iOS were all caught showing a server-side pop-up message to users saying \"You should update this app. The version you're using doesn't include the latest security features to keep you protected. Only continue if you understand the risks.\" Actually Google, <em>you</em> should update this app.&nbsp;Thanks to Google's sudden disinterest in iOS app updates, the messages were showing even when users had the latest, 2-month-old updates of these Google apps. The messages have since been removed through a server update.</p><p>Presumably, this was an automatic notice that pops up when Google's app updates hit a certain age and are meant to catch people who haven't been to the App Store in a while. Presumably, Google picked a time frame (approximately two months) that it thought it would never pass without shipping some kind of app update. Now, for some mysterious reason, that time period has passed, and Google's servers were briefly accusing Google's app developers of putting users \"at risk.\"</p><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/39-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/39.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/39-980x1007.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/39-1440x1480.jpg 2560\" data-sub-html=\"#caption-1741536\"><figure><figcaption id=\"caption-1741536\"><span></span><p>Google says it's iOS apps are \"out of date.\" Google is right!</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/chrome_B6HLcD2giz-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/chrome_B6HLcD2giz.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/chrome_B6HLcD2giz.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/chrome_B6HLcD2giz.png 2560\" data-sub-html=\"#caption-1741537\"><figure><figcaption id=\"caption-1741537\"><span></span><p>Many of Google's major apps only show this message in the App Store. They haven't been updated with privacy labeling.</p><p><span></span> Ron Amadeo</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/chrome_IAPgxTkwcd-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/chrome_IAPgxTkwcd.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/chrome_IAPgxTkwcd-980x556.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/chrome_IAPgxTkwcd.png 2560\" data-sub-html=\"#caption-1741538\"><figure><figcaption id=\"caption-1741538\"><span></span><p>Here's what the privacy labeling should look like. This is from the Facebook app.</p><p><span></span> Ron Amadeo</p></figcaption></figure></li></ul></div><p>The theory that Google has halted iOS app updates as a result of the new privacy labeling has been kicking around for <a href=\"https://www.fastcompany.com/90591066/googles-ios-apps-havent-been-updated-in-weeks-apples-privacy-labels-could-be-the-reason-why\">about a month now</a>. Back in early January, Google had some plausible deniability. The company's annual holiday code freeze would have been just thawing out, and with COVID and all the work-from-home changes, it's understandable that maybe productivity was down. On January 5,&nbsp;<a href=\"https://techcrunch.com/2021/01/05/google-to-add-app-store-privacy-labels-to-its-ios-apps-as-soon-as-this-week/\">TechCrunch</a>&nbsp;relyed that \"a Google spokesperson confirmed the company has a plan to add privacy labels across its app catalog\" and that \"the labels are expected to begin rolling out as soon as this week or next week.\" On January 12, this was reiterated in an <a href=\"https://blog.google/technology/safety-security/our-work-keep-you-safe-and-control-your-privacy\">official blog post</a>.</p><p>It's a month later now, and while some Google apps since then have been updated with app privacy labels, but most of the major, popular apps still have not been updated. YouTube, which has its own CEO and is mostly run as a seperate company, is the most popular app with privacy labels, but the other heavy hitters like Gmail, Google Maps, Search, Chrome, Drive, Photos, Keep, and Duo have all been frozen since the privacy requirements launched.</p><h2>How bad have Google’s iOS updates gotten?</h2><p>Thanks to online app version histories, we can dig through a good bit of data on Google's iOS app freeze this year. The App Store keeps an official version history for the past year, and Archive.org's will get us a compariative copy of last year's iOS updates. Since Google's iOS and Android apps are all extremely similar, we'll also compare to how Android updates have been rolling out over the same time period (via <a href=\"https://www.apkmirror.com/\">APKMirror's</a> version history), which will help correct for any COVID-related work-from-home difficulties.</p><p>It's pretty clear Google's iOS productivity has flatlined in the last two months. Gmail was last updated <a href=\"https://apps.apple.com/us/app/gmail-email-by-google/id422689480\">on iOS</a> on December 1, but the <a href=\"https://www.apkmirror.com/apk/google-inc/gmail/\">Android</a> version of Gmail has gotten four updates since then: December 10, January 19, February 2, and February 9. Over the same time period&nbsp;<a href=\"https://web.archive.org/web/20200307114410if_/https://apps.apple.com/us/app/gmail-email-by-google/id422689480\">last year,</a>&nbsp;the holiday code freeze for Gmail on iOS ended on January 13, with four updates arriving before February 11, 2020. The same story holds for Google Maps: the <a href=\"https://apps.apple.com/us/app/google-maps-transit-food/id585027354\">iOS</a> version was frozen on December 1, while the <a href=\"https://www.apkmirror.com/uploads/?q=maps\">Android</a> version (not counting beta releases!) has had nine updates between then and now.</p><p>So many Google apps are like this that we'll do a big table. These are updates since December 8 (the enforcement date of Apple's privacy labels) according to the aforementioned sources. These numbers show iOS app updates from&nbsp;December 8, 2020 to February 11, 2021,&nbsp;iOS app updates from&nbsp;the same period a year ago, and Android updates from December 8, 2020 to February 11, 2021. We're not counting Android beta releases, though that would double some of these Android release numbers.</p><table><tbody><tr><th>App updates<br>since 12/8</th><th>iOS<br>(this year)</th><th>iOS<br>(last year)</th><th>Android<br>(this year)</th></tr><tr><th>Gmail</th><td><strong>0</strong></td><td>5</td><td>4</td></tr><tr><th>Google Maps</th><td><strong>0</strong></td><td>6</td><td>9</td></tr><tr><th>Google Search</th><td><strong>0</strong></td><td>5</td><td>27</td></tr><tr><th>Chrome (Stable)</th><td><strong>0</strong></td><td>2</td><td>6</td></tr><tr><th>Google Drive</th><td><strong>0</strong></td><td>9</td><td>8</td></tr><tr><th>Google Docs</th><td><strong>0</strong></td><td>5</td><td>9</td></tr><tr><th>Google Sheets</th><td><strong>0</strong></td><td>6</td><td>8</td></tr><tr><th>Google Photos</th><td><strong>0</strong></td><td>9</td><td>16</td></tr><tr><th>Google Keep</th><td><strong>0</strong></td><td>4</td><td>8</td></tr><tr><th>Google Duo</th><td><strong>0</strong></td><td>5</td><td>6</td></tr><tr><th>Google Home</th><td><strong>0</strong></td><td>3</td><td>3</td></tr></tbody></table><p>Quite a few of these apps (Drive, Docs, Sheets, Keep, Duo) were updated&nbsp;<em>on</em>&nbsp;December 7th, the very last day to get in app updates before the new privacy requirements, which is not a good look.</p><p>We've asked Google if it has any comment on the \"out-of-date\" incident and why iOS app updates are taking so long. We'll update this if the company responds.</p></div></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d81cbe360ef1b722a91440731efa4d1a1c13f3f75249c85b7e86e63ac50e1491","category":"Tech"}