{"title":"“We knew T-Mobile couldn’t be trusted,” union says after 5,000 job cuts","link":"https://arstechnica.com/?p=1746210","date":1614636007000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Post-merger job cuts —</h4><h2 itemprop=\"description\">T-Mobile claimed Sprint merger would create thousands of jobs \"from day one.\"</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/06/getty-t-mobile-sign-800x533.jpg\" alt=\"A T-Mobile logo on the window of a store.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/06/getty-t-mobile-sign.jpg\" data-height=\"1239\" data-width=\"1859\">Enlarge</a> <span>/</span> A T-Mobile logo at a store in New York on April 30, 2018.</p><p>Getty Images | Bloomberg</p></figcaption></figure><p>T-Mobile has cut at least 5,000 jobs since completing its acquisition of Sprint despite promising that the merged company would start creating new jobs \"from day one.\"</p><p>As <a href=\"https://www.lightreading.com/aiautomation/despite-pledge-t-mobile-has-cut-5k-jobs-since-sprint-merger/d/d-id/767735\">noted by Light Reading</a> today, a T-Mobile <a href=\"https://d18rn0p25nwr6d.cloudfront.net/CIK-0001283699/c2c2789c-74cc-4699-8a9a-34ee1bd9c41e.pdf\">filing</a> with the Securities and Exchange Commission last week said, \"As of December 31, 2020, we employed approximately 75,000 full-time and part-time employees, including network, retail, administrative, and customer support functions.\" That's 5,000 fewer than the number T-Mobile gave on previous occasions, including a <a href=\"https://www.t-mobile.com/news/community/women-and-working-from-home-how-to-prevent-downshifting\">press release</a> on December 8, 2020 that said there are \"more than 80,000 employees at the post-merger T-Mobile.\" The 80,000 figure was probably off by at least a few thousand employees by the time it was repeated in that press release, given that T-Mobile had 5,000 fewer employees just a few weeks later.</p><p>The US government didn't impose any hiring requirements in the <a href=\"https://www.fcc.gov/document/fcc-approves-t-mobilesprint-transaction-conditions\">merger conditions</a> that <a href=\"https://www.justice.gov/opa/pr/justice-department-settles-t-mobile-and-sprint-their-proposed-merger-requiring-package\">allowed</a> T-Mobile to <a href=\"https://arstechnica.com/information-technology/2020/04/t-mobile-completes-sprint-merger-john-legere-leaves-ceo-job-a-month-early/\">complete its acquisition</a> of Sprint in April 2020. But T-Mobile and then-CEO John Legere made jobs a key part of their lobbying for the merger. In April 2019, Legere published a <a href=\"https://www.t-mobile.com/news/un-carrier/new-t-mobile-creating-jobs\">blog post</a> titled \"Just the Facts on Jobs: The New T‑Mobile Will Create Jobs From Day One.\"</p><p>\"New T-Mobile will have more than 11,000 additional employees on our payroll by 2024 compared to what the combined standalone companies would have,\" Legere wrote. Legere also claimed that T-Mobile would \"open 600 new stores to serve rural areas and small towns, that neither T-Mobile nor Sprint serve today, directly resulting in approximately 5,000 new retail jobs.\"&nbsp;That was consistent with T-Mobile owner Deutsche Telekom's <a href=\"https://www.telekom.com/en/media/media-information/archive/merger-t-mobile-us-523420\">claim in April 2018</a> that its \"overall plan is for the larger company to employ more staff than the two previous companies put together.\"</p><h2>Union predicted job cuts before merger</h2><p>The Communications Workers of America (CWA) union wasn't fooled by T-Mobile's premerger promises.&nbsp;\"We knew that T-Mobile couldn't be trusted to keep its promises. That's why we pushed for enforceable commitments from T-Mobile on jobs during the merger process,\" a CWA spokesperson told Ars today. \"Regulators need to take a close look at what's happening at T-Mobile and get serious about protecting jobs as part of their oversight of corporate mergers.\"</p><p>The CWA <a href=\"https://www.tmobilesprintfacts.org/jobs\">predicted</a> before the merger was complete that it could lead to 25,500 job losses at retail stores and 4,500 job losses at T-Mobile headquarters. Retail stores are often run by independent third parties with their own employees, so those job losses wouldn't necessarily be reflected in T-Mobile's head count.</p><p>The US did force T-Mobile to <a href=\"https://arstechnica.com/tech-policy/2020/07/dish-is-finally-a-mobile-provider-but-doesnt-operate-its-own-network-yet/\">sell former Sprint subsidiary Boost Mobile</a> and other prepaid businesses, which may have reduced T-Mobile's head count a bit. This does not explain the reduction from 80,000 to 75,000 jobs at T-Mobile because of the aforementioned retail-store issue and the fact that T-Mobile continued to cite the 80,000-employee number for over five months after it sold Boost to Dish.</p><p>We asked T-Mobile today for details on what types of jobs were cut and will update this article if we get an answer.</p><p>Before the merger, T-Mobile had about <a href=\"http://d18rn0p25nwr6d.cloudfront.net/CIK-0001283699/bc54c43f-ee88-42d9-9393-807ec361b545.pdf\">53,000</a> part- and full-time employees at the end of 2019.&nbsp;Sprint had <a href=\"https://www.sec.gov/Archives/edgar/data/101830/000010183019000027/sprintcorpform10-ka20190331.htm\">nearly 29,000 employees</a> at the beginning of 2019, but it's not clear how many it had right before the merger was completed over a year later. T-Mobile also <a href=\"https://arstechnica.com/information-technology/2020/02/t-mobile-conducts-layoffs-as-it-prepares-to-complete-sprint-merger/\">laid off some employees</a> about a month before completing the Sprint acquisition.</p><p>California regulators imposed a merger condition requiring T-Mobile to add 1,000 employees across the state. T-Mobile <a href=\"https://arstechnica.com/tech-policy/2020/06/t-mobile-already-trying-to-get-out-of-merger-conditions-on-5g-and-hiring/\">asked</a> the California Public Utilities Commission (CPUC) to eliminate the jobs requirement, but the CPUC <a href=\"https://docs.cpuc.ca.gov/PublishedDocs/Published/G000/M351/K799/351799867.PDF\">denied</a> the request.</p></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"d81f16ed1990d7c73c85a356b4624ea8d67752fe759a6f0ba85cd7ca47c47715","category":"Tech"}