{"title":"Eli Iserbyt wins a wet and slippery World Cup Besançon","link":"https://cyclingtips.com/2021/11/eli-iserbyt-wins-a-wet-and-slippery-world-cup-besancon/","date":1638113213000,"content":"<div><div><p>Eli Iserbyt (Pauwels Sauzen-Bingoal) took a defiant victory in the eighth round of the CX World Cup after doing battle with Toon Aerts (Baloise Trek Lions) from start to finish. The French mud was slick, the course was challenging and the battle between the two rivals was fierce.</p><p>Besançon was hosting the World Cup for the first time, and it was a blistering introduction despite freezing conditions. Europe’s lower countries have been hit by true wintry weather for the first time this season, and though the snow did little more than trickle threateningly, it brought with it temperatures of just above freezing (about 35F).</p><p>By the end of the first lap of six, Iserbyt and Aerts had fought for an advantage of almost 30 seconds. With Quentin Hermans (Tormans Circus) and Lars van der Haar (Baloise Trek Lions) not racing – training camp and injury respectively – the chase behind was even more saturated with Pauwels Sauzen-Bingoal riders than we’re used to, with the notable exception of U23 world champion Pim Ronhaar (Baloise Trek Lions), who was searching for his first Elite podium.</p><p>The leading pair had eyes only for one another, their constant digs and attacks putting both under pressure while they increased their gap over the rest of the field. As the penultimate lap beckoned, ice-cold rain was falling heavily and Iserbyt’s head began to droop – he’s a man who struggles in the cold.</p><p>Aerts looked back, saw the World Cup leader’s cracks open up, and put the hammer down. But then the Baloise Trek Lions rider wiped out on a muddy corner half a lap later, giving Iserbyt the chance to regain the front and take a few seconds with him into the final lap.</p><p>The re-energised Iserbyt dug in as his compatriot battled the terrain and his own fatigue on the race for home. A mistake from Iserbyt within reach of the finish was almost fatal, but he held on to take truly defiant victory (<a href=\"https://cyclingtips.com/2021/11/11-wins-and-counting-cx-star-eli-iserbyt-is-having-a-season-to-remember/\">another one!</a>). With Aerts comfortable in second, his young teammate Ronhaar joined him on the podium in third after a coming-of-age performance in the mud.</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"d8bd3d7737eec680d789bf2ea3440c2db3d95d95f50645a1721343188d13e1ab","category":"Cycling"}