{"title":"Match Your Future ร่วมลงทุนอนาคต","link":"https://markpeak.net/match-your-future/","date":1612840962000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"page\"><main id=\"content\" role=\"main\"><article id=\"post-2159\" itemscope=\"itemscope\" itemtype=\"http://schema.org/BlogPosting\" itemprop=\"blogPost\"><img width=\"700\" height=\"525\" src=\"https://markpeak.net/wp-content/uploads/2021/02/mirror-foundation-700x525.jpg\" alt=\"\" loading=\"lazy\" itemprop=\"image\" srcset=\"https://markpeak.net/wp-content/uploads/2021/02/mirror-foundation-700x525.jpg 700w, https://markpeak.net/wp-content/uploads/2021/02/mirror-foundation-300x225.jpg 300w, https://markpeak.net/wp-content/uploads/2021/02/mirror-foundation-768x576.jpg 768w, https://markpeak.net/wp-content/uploads/2021/02/mirror-foundation.jpg 960w\" sizes=\"(max-width: 700px) 100vw, 700px\"><div itemprop=\"mainContentOfPage\"><p>เมื่อวานนี้<a href=\"https://markpeak.net/deng-yingchao/\">เขียนเรื่อง Podcast ของพรรคเพื่อไทยที่สัมภาษณ์ พันศักดิ์ วิญญรัตน์</a> ซึ่งเล่าเรื่องในหลายประเด็น</p><p>แล้วมาเจอกับ<a href=\"https://www.facebook.com/mirrorf/posts/10157704862280009\">โพสต์ของมูลนิธิกระจกเงา</a> ที่พูดเรื่องเดียวกันพอดี (โดยบังเอิญ) เลยคิดว่าต้องมาเขียนถึงเพื่อให้เห็นความเชื่อมโยงกัน</p><p><span><iframe width=\"700\" height=\"394\" src=\"https://www.youtube.com/embed/A36ssGMaBdk?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"></iframe></span></p><p>ช่วงที่พูดถึงเรื่องนี้อยู่ราวนาทีที่ 21 เมื่อผู้ดำเนินรายการถามว่าตอนคิดนโยบายหาเสียงหลังปี 40 ต้องทำอย่างไร</p><blockquote><p>เปิดกระเป๋าดูแล้วมันไม่มีตัง</p><p>อะไรคือ potential อะไรคือสิ่งที่พอเป็นไปได้ในเมืองไทย เราก็คิดนโยบายนี้ออกมา</p><p>เราชะงัก แต่เรามี saving</p><p>ให้คนเอา saving มา match กับความหวังในอนาคต</p><p>ปัจจุบันนี้จิตตกกันใช่ไหม ผมก็จิตตก อะไรคืออนาคต แต่พอมี saving บ้างนิดหน่อยนะ</p><p>ฉันจะกล้าเอา saving ของฉันมา match กับอนาคตไหม แต่ต้องมีอนาคตก่อนนะ</p></blockquote><p>อีกช่วงราวนาทีที่ 30</p><blockquote><p>การสร้างโอกาส หรือเปิดทางโอกาสให้ประชาชน ใช้ความสามารถของเขา</p><p>กองทุนหมู่บ้าน นอกจากให้ยืมตังค์แล้ว ประชาชนจะเอา saving ของตัวเองมาเติมเอง มาเติมที่ตัวเองไปยืมด้วย</p><p>ปรากฏว่ากองทุนหมู่บ้าน หนี้สูญไม่ถึง 1% หรือ 1% กว่าๆ หรือปัจจุบันก็ไม่เกิน 3% หนี้สูญน้อยกว่าธนาคารพาณิชย์</p><p>มันพิสูจน์ว่านโยบายเหล่านี้เปิดโอกาสให้ประชาชน ใช้ศักยภาพของเขาเอง มันถึงประสบความสำเร็จ ไม่ใช่เอาไปให้เฉยๆ</p></blockquote><p>ส่วนในโพสต์ของมูลนิธิกระจกเงา เป็นตัวอย่างของการ Match Your Future ที่ชัดเจนมาก เพราะคนไร้บ้านที่มีเงินเก็บจำนวนหนึ่ง ตัดสินใจไป “เช่าบ้าน” หลังได้เงินเพิ่มมาอีกก้อน และการการันตีรายได้จากโครงการ “จ้างวานข้า” ของมูลนิธิกระจกเงา</p><blockquote><p>ชายชราไร้บ้านสองคนตัดสินใจเช่าห้องพักราคาถูกในย่านสุขสวัสดิ์ หลังจากที่ชายชราคนนึง พึ่งได้เงินจากความพิการเดือนละ 800 บาท​</p><p>ชายชราเล่าว่าถ้าเพื่อนไม่ได้เงินจากคนพิการ แกเองก็ยังไม่กล้าตัดสินใจจะมาเช่าห้องแน่นอน แม้ว่ารายได้ที่แกมีจะได้จากคนชรา 600 บาท คนพิการ 800 บาท และเงินจากจ้างวานข้าเดือนละ 1,600 บาท​ รวมเบ็ดเสร็จ​แล้วเป็น 3,000 บาทก็ตาม</p><p>ถ้ารวมกับชายชรา(ที่พึ่งได้เงินคนพิการ) ซึ่งก็ได้เงินจากคนชรา 600 บาท และเงินจากจ้างวานข้าเดือนละ 1,600 บาท รวมแล้วเป็น2,200บาท รวมเงินกันของทั้งสองผู้เฒ่าอยู่ที่ 5,200 บาท แต่ชายคนแรกเองยังเห็นว่าเงินขนาดนี้ มันไม่พอที่จะกระเบียดกระเสียนใช้จ่าย ทั้งเป็นค่าห้อง และค่ากินให้กับคนสองคนได้</p><p>แกจึงตัดสินใจไม่เช่าห้อง​ยังคงนอนที่ข้างถนนเหมือนเดิมแต่ก็เพิ่มวันอีกหลายๆ วันเข้าไปจาก10กว่าปีที่เคยได้นอนข้างถนนมา</p><p>แต่เมื่อไม่กี่สัปดาห์ที่ผ่านมาเพื่อนแกพึ่งได้รับเงินคนพิการ 800 บาท มาสดๆ ร้อนๆ การตัดสินใจใหม่ของเรื่องที่อยู่อาศัยจึงเกิดขึ้นทันที​ แกได้ห้องเช่าราคาถูก ที่รวมน้ำไฟด้วย ก็ตกไม่เกิน 1800 บาทต่อเดือน​ การเข้าถึงทุนพอที่จะทำให้พวกเขาได้คิดได้ตัดสินใจขยับขยายตัวเอง เพื่อสร้างการเปลี่ยนผ่าน มันคือสิ่งที่ควรทำเป็นที่สุดในการให้ความช่วยเหลือพวกเขา</p></blockquote><p>ตัวอย่างนี้ชัดมาก เพราะเป็นการนำเงินเก็บที่เป็นสิ่งสำคัญมากๆ ของตัวเอง มา “เดิมพันอนาคต” หลังได้การการันตีหรือหลักประกันบางอย่าง (ในที่นี้คือเงินช่วยเหลือคนพิการของเพื่อน และการงานที่มั่นคงขึ้น)</p><p>เงินคนพิการ 800 บาท และเงินจากจ้างวานข้า 1,600 บาท ถือว่าน้อยมากสำหรับคนชั้นกลางทั่วไป (บางคนกินข้าวมื้อนึงก็เกินแล้ว) แต่จะเห็นว่าเงินเพียงแค่นี้ ถ้าจัดวางให้ถูกจุด และมอบ “โอกาสในอนาคต” ให้ ก็จะสร้างความเปลี่ยนแปลงได้อย่างมาก</p><p>มิตรสหายท่านหนึ่งคือคุณธีรภัทร เจริญสุข เคยเขียนเรื่องนี้ไว้ชัดเจนดี ขออนุญาตยกมาบางส่วน</p><blockquote><p>จะดีจะร้าย หรือว่ามีบางส่วนอาจรั่วไหลยังไง นโยบายแบบของทักษิณนั้นคือการเชื่อใจคน เชื่อใจประชาชน ว่าสามารถบริหารเงินของตัวเองได้ สามารถจัดการชีวิตของตัวเองได้ และผลก็พิสูจน์แล้วว่าส่วนมากทำได้ดีด้วย แม้ส่วนน้อยจะมีคนเอาไปใช้เละเทะเป็นหนี้ผีพนันติดเหล้าจริง ก็เป็นส่วนน้อยมาก ถ้ามองว่ามีบางคนเอาไปใช้เหลวไหลแล้วต้องยกเลิกไม่ให้กู้ แบบนี้ต้องยกเลิกเงินกู้ครูทั่วประเทศเพราะหนี้เสียจนล้มละลายเยอะกว่าด้วยซ้ำ</p><p>การให้ทุน ให้เงิน ต้องให้เป็นก้อนใหญ่พอที่พวกเขาจะสร้างชีวิตของตัวเอง พอที่จะสร้างงานสร้างรายได้ เปลี่ยนแปลงแนวทางชีวิต ให้เป็นหนี้เพื่อที่จะคิดว่าตัวเองมีศักดิ์ศรีพอที่จะมีคนเชื่อถือและจ่ายหนี้ เพราะหนี้สินคือความเชื่อว่าคนที่ก่อหนี้จะมีสัจจะ มีความรับผิดชอบพอที่จะชำระหนี้นั้น</p></blockquote><p>ในแง่ของการออกนโยบายเพื่อคนจำนวนมาก การสร้างอนาคตที่คนมั่นใจ ให้ความเชื่อมั่น จนล้วงเงินของตัวเองมาร่วมลงทุนไปด้วยกัน เป็นงานสเกลใหญ่ที่ต้องสานต่อกันไป</p><p>แต่ในสเกลขนาดเล็ก&nbsp; โครงการระดับจ้างวานข้า ที่ดำเนินการโดย NGO ภาคเอกชนกันเอง เป็นสิ่งที่สามารถสนับสนุนได้ทันที อ่านจบแล้วก็ขอเชิญบริจาคกันตามศรัทธาที่​ โครงการผู้ป่วยข้างถนน โดยมูลนิธิกระจกเงา เลขที่บัญชี 202-2-58289-4 SCB หรือ <a href=\"http://mirror.or.th/autopagev4/show_page.php?topic_id=2438&amp;auto_id=2&amp;TopicPk=\">อ่านรายละเอียดของโครงการ</a> ก่อนตัดสินใจ</p></div></article><div id=\"taglist\"><ul><li>Related Content by Tag</li><li><a href=\"https://markpeak.net/tag/policy/\" rel=\"tag\">Policy</a></li><li><a href=\"https://markpeak.net/tag/politics/\" rel=\"tag\">Politics</a></li><li><a href=\"https://markpeak.net/tag/%e0%b8%9e%e0%b8%b1%e0%b8%99%e0%b8%a8%e0%b8%b1%e0%b8%81%e0%b8%94%e0%b8%b4%e0%b9%8c-%e0%b8%a7%e0%b8%b4%e0%b8%8d%e0%b8%8d%e0%b8%a3%e0%b8%b1%e0%b8%95%e0%b8%99%e0%b9%8c/\" rel=\"tag\">พันศักดิ์ วิญญรัตน์</a></li></ul></div></main></div></div>","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"d9f6666f448220a3ae25259ba620629881a218f4ac895f3d0582b0e5084a10b3","category":"Thai"}