{"title":"Search Engine Optimization Checklist (PDF)","link":"https://smashingmagazine.com/2020/12/search-engine-optimization-checklist/","date":1608217213000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"article__content\"><div><div><figure role=\"presentation\"><a href=\"https://www.smashingmagazine.com/author/frederick-o-brien\"><div><picture><source type=\"image/avif\" srcset=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c2355758-f69b-4161-9421-ac70ba941620/brien200x200.avif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fecbfb97-8626-496b-ad67-bb918ad320bf/brien200px.jpg\" loading=\"eager\" width=\"100\" height=\"100\" alt=\"Frederick O’Brien\"></picture></div></a></figure></div><div id=\"author__desc\"><p>Frederick O’Brien is a freelance journalist who conforms to most British stereotypes. His interests include American literature, graphic design, sustainable … <a href=\"https://www.smashingmagazine.com/author/frederick-o-brien\">More about Frederick ↬</a></p></div></div><section aria-label=\"quick summary\">Implementing best SEO practice can produce immediate results, but long-term performance requires long-term maintenance. Besides, the journey is more important than the destination, isn’t it?<p>This is not an exhaustive list, but hopefully there is enough to help you win over some of the most tedious search engine optimization issues.</p></section><p>Search engine optimization (SEO) is an essential part of a website’s design, and one all too often overlooked. The most beautiful, spectacular site in the world won’t do anyone much good if people can’t find it on Google (or Bing, or DuckDuckGo).</p><p>Implementing SEO best practice doesn’t just give you the best chance possible of ranking well in search engines; it makes your websites better by scrutinizing quality, design, accessibility, and speed, among other things. It’s a daunting world for those who aren’t familiar with it (and even those who are at times), so this checklist breaks down key factors to consider when undertaking an audit.</p><p>For an overview of the SEO community — publications, thought leaders, podcasts, documentation, forums, things like that — I humbly point you towards the <a href=\"https://www.smashingmagazine.com/smashing-guide-search-engine-optimization/\">Smashing Guide To The World of Search Engine Optimization</a>.</p><p>If you’re ready to get stuck in, read on.</p><h4>Table Of Contents</h4><ul><li><a href=\"#get-ready-healthy-mindset\">Get Ready: A Healthy Mindset</a></li><li><a href=\"#setting-realistic-goals\">Setting Realistic Goals</a></li><li><a href=\"#defining-the-environment\">Defining The Environment</a></li><li><a href=\"#on-page\">On-page</a></li><li><a href=\"#off-page\">Off-page</a></li><li><a href=\"#testing-and-monitoring\">Testing And Monitoring</a></li><li><a href=\"#quick-wins\">Quick Wins</a></li></ul><p><strong>Note</strong>: <em>You can also just <a href=\"http://provide.smashingmagazine.com/smashing-seo-checklist-2020.pdf\">download the checklist</a> (PDF, 158 KB). Happy optimizing, everyone!</em></p><h3 id=\"get-ready-healthy-mindset\">Get Ready: A Healthy Mindset</h3><ol><li><strong>Establishing A Shared SEO Culture</strong><br>Done properly SEO is not something you implement once then walk away from never to think about again. It’s something that ought to be carefully maintained over years. One of the reasons audits can feel so overwhelming is because long-neglected SEO piles up into a big problem. Well maintained SEO runs like a dream, and is better placed to adapt to the turbulence of algorithm updates. Communicate the value of SEO, and don’t do it by lecturing. Following best practice usually means a better website, more organic traffic, and happier visitors. Win, win, win.</li><li><strong>Quality, Not ‘Quality’</strong><br>There is sometimes more talk about quality than there is commitment to it. Behind all the stats, tools, and quick wins there sits one simple SEO truth: it is your job to make the site as good as it possibly can be. Only then can you hope to be better than all the other sites you’re competing with for search queries. From UX design to copywriting, quality content takes commitment, passion, and time. Be ready to face your site’s limitations and work to improve them — for your sake as much as anyone else’s. Great content is so, so much easier to optimize than bad content is.</li><li><strong>A Holistic Approach</strong><br>Strong SEO is the sum total of a website, it’s not something to saddle one department (or person) with. It <em>can</em> be bolted on to an extent, but that’s never as good as when it’s woven into the site’s DNA. Implementing SEO well means open communication between different members of the team — from SEO execs to writers to developers. Before you even start, understand everyone likely has a role to play.<ul><li>“<em><a href=\"https://www.smashingmagazine.com/2020/02/seo-web-design-process/\">Where Does SEO Belong In Your Web Design Process?</a>” by Suzanne Scacca</em></li></ul></li><li><strong>Join The Community</strong><br>Guides like this cover as much as they can but there’s no getting away from the fact that SEO is constantly evolving. It is a huge industry, with its own publications, thought leaders, podcasts, video series, and more. Take advantage of those resources, plug into the SEO world. Just following a handful of reputable Twitter accounts and listening to a podcast or two a month will go a long way.<ul><li><em><a href=\"https://www.smashingmagazine.com/smashing-guide-search-engine-optimization/\">A Smashing Guide To The World Of Search Engine Optimization</a></em></li></ul></li></ol><h3 id=\"setting-realistic-goals\">Setting Realistic Goals</h3><ol><li><strong>Prioritizing Metrics</strong><br>Online metrics are almost limitless. Like, literally. They just won’t stop. Numbers are useful, but if you’re not careful they’ll be the ones calling the shots rather than you. Don’t let KPIs be the tail that wags the dog. Work out what your priorities are, how you can measure progress, and the limitations of the available data. The answers to these questions vary from site to site.<ul><li><em><a href=\"https://developers.google.com/web/tools/lighthouse\">Lighthouse</a> for automated web page audits</em></li><li><em><a href=\"https://www.goauditor.com/audit/\">Go Auditor</a></em></li></ul></li><li><strong>Timeframes</strong><br>Goals border on meaningless if you don’t have a time frame for them. It doesn’t have to be the be all and end all (SEO never stops, after all) but by giving yourself a date to work towards gives you a target, and a ready made opportunity to reassess what you’re doing. Have a schedule and stick to it as best you can. This also means having a plan for tracking and analysing search data. Putting a few minutes aside each week adds up nicely over six months.</li><li><strong>Keyword Research</strong><br>This is absolutely essential to targeted SEO. If you don’t know what keywords you’re hoping to rank for how can you possibly target them? What are popular search terms in your field? What are your competitors ranking for? What is your website already ranking well for and why? With <a href=\"https://search.google.com/search-console/about\">Google Search Console</a> you can see exactly where your pages are (or aren’t) ranking for different keywords.<ul><li><em><a href=\"https://ads.google.com/aw/keywordplanner/home\">Google Keyword Planner</a></em></li><li><em><a href=\"https://trends.google.com/trends/\">Google Trends</a></em></li><li><em><a href=\"https://moz.com/explorer\">Moz Keyword Explorer</a></em></li><li><em><a href=\"https://ahrefs.com/keyword-generator\">Ahref Keyword Generator</a></em></li><li><em><a href=\"https://www.semrush.com/analytics/keywordoverview/\">Keyword Overview by SEMrush</a></em></li></ul></li><li><strong>Size Up The Competition</strong><br>The internet is a big place. Odds are you’re not the only one trying to rank for certain searches. Competition is fierce, and that’s good. It forces websites to improve themselves. Analyse rival websites and note what they’re doing well, as well as what you do or can do better. Remember, search engines just want to connect searchers with the best results for their queries. Being the best means being better than everyone else.<ul><li><em><a href=\"https://ahrefs.com/site-explorer\">Ahref Site Explorer</a></em></li><li><em><a href=\"https://topics.seomonitor.com/\">Topics by SEOmonitor</a></em></li></ul></li><li><strong>Involve Colleagues In Setting Goals</strong><br>SEO is a deceptively big topic that affects all aspects of a site, so it’s only reasonable to involve your colleagues when setting ambitious yet achievable goals. Everyone knows something you don’t, and you might be surprised by how much smoother SEO implementation can be when everyone’s on board with it.</li></ol><h3 id=\"defining-the-environment\">Defining The Environment</h3><ol><li><strong>Mobile-First</strong><br>A lot of SEO revolves around how you organize content, and more than anything else you need to organize content well for mobile devices. More people browse on mobile devices than on desktops. In acknowledgement of this trend, <a href=\"https://webmasters.googleblog.com/2020/03/announcing-mobile-first-indexing-for.html\">Google went fully mobile-first in early 2020</a>. This means the mobile version of your website is what crawlers look at and index. Fabulous desktop layouts are great, but SEO, like the web, is now a mobile-first world.<ul><li><em><a href=\"https://search.google.com/test/mobile-friendly\">Google Mobile-Friendly Test</a></em></li><li><em><a href=\"https://www.experte.com/mobile-friendly\">Bulk Mobile Friendly Test</a> by Experte</em></li><li><em><a href=\"https://material.io/resources/resizer/#\">Resizer by Material Design</a> (view websites on different devices side by side)</em></li></ul></li><li><strong>Google’s Monopoly</strong><br>For better or worse, search is currently monopolised by one company — Google. It continues to dominate the space, <a href=\"https://www.smartinsights.com/search-engine-marketing/search-engine-statistics/\">handling more than 90% of global mobile searches, and 70% of desktop</a>. There are others of course — Bing, Waibu, DuckDuckGo, and more — but for the time being SEO gravitates around Google. Tick their boxes while keeping an eye on the wider terrain, which isn’t as static as you might think.</li></ol><h3 id=\"on-page\">On-Page</h3><ol><li><strong>Quality Content</strong><br>That’s right, folks. All the SEO in the world will only get you so far if a website’s content is rubbish. There’s no question that there exist bad websites that perform well, but more and more are weeded out with each update. What does quality content look like? There are countless articles on the topic, but here are a few things to be aiming for — clear, original, properly sourced, well written, accessible, and honest. Search engines (generally) want to connect searchers with high-quality results.<ul><li><em><a href=\"https://www.searchenginejournal.com/what-makes-content-great/346990/\">What Is Great Content?</a> by Search Engine Journal</em></li><li><em><a href=\"https://support.google.com/websearch/answer/9281931?hl=en\">Google’s Quality Rater Guidelines</a></em></li></ul></li><li><strong>Meta Titles And Descriptions</strong><br>Eat your sprouts, cross your i’s and dot your t’s, and use descriptive meta titles. Every web page should have a meta title and meta description. The title should tell people and web crawlers alike what the page is about. Meta descriptions are purely for browsers’ benefit — crawlers don’t look at them. Think of them as little blurbs for when that page pops up in search results. Entice the reader.<ul><li><em><a href=\"https://metatags.io/\">Metatags.io</a></em></li></ul></li><li><strong>Image Alt Text</strong><br>A depressing number of websites <a href=\"https://medium.com/include-ai/the-state-of-image-accessibility-on-the-web-e639dd056dc0\">don’t do this properly</a>. It’s so easy, and so helpful. Every image on your website should have alt text describing what the image shows. This helps crawlers understand your visual content, and allows screen readers to describe what visually impaired web browsers cannot see. Alt text also improves your chances of appearing in image search results.</li><li><strong>Internal Links</strong><br>A few years back scientists discovered that <a href=\"https://www.theguardian.com/science/2017/jul/04/why-roman-concrete-still-stands-strong-while-modern-version-decays\">ancient Roman concrete gets stronger over time</a>. Internal links are a prime example of a similar phenomenon in SEO. When you create a new website, linking to other, relevant parts of your site makes for a solid foundation. Continuing to do it over time makes it even stronger. Not only do internal links make websites easier to browse, but they also provide crucial context for search engine crawlers. Each one makes a site’s SEO that little bit stronger.</li><li><strong>External Links</strong><br>Some SEO types get a bit precious about ‘link juice’, loath to directing people away from their own site. While this is great for shoving people down funnels, it’s pretty slimy behavior. It’s bad for readers and it’s bad for SEO. If you cite something, link to it. If you quote someone, link to the source. Citing one’s sources is writing 101, and again, it provides context to your own content. It helps search engines to understand the type of website you are, and what sort of company you keep. Scour through your copy and make sure the appropriate external links are there.<ul><li><em><a href=\"https://www.smashingmagazine.com/2018/07/linkbuilding-the-citizens-field-guide/\">Linkbuilding: The Citizen’s Field Guide</a></em></li><li><em><a href=\"https://www.smashingmagazine.com/2020/08/clients-backlinks-design/\">How To Help Your Clients Get More Backlinks Through Design</a></em></li></ul></li><li><strong>Clear Structure Markup</strong><br>This is so simple and so, so important. Just like meta titles and descriptions show what a page is about, following best practice for HTML makes page structure clear and easy to understand. Use the right tags in the right places, make sure headings are arranged logically. A great way to do this is to strip away CSS and look at pages in pure HTML. If the structure isn’t obvious there then there’s work still to do. <a href=\"https://web.dev/measure/\">Google’s free Lighthouse assessment</a> is good at spotting problems of this kind.</li><li><strong>Structured Data</strong><br>Semantic markup is becoming increasingly important to SEO, and web design in general. It makes your website’s content machine readable, which in turn makes it easier to crawl, understand, index, and return as sophisticated search results. There are plenty of plugins to help with this, or if you’re feeling daring the markup is simpler than you might think to add yourself. Schema has emerged as the language of choice for search engines, with Google, Microsoft, Yahoo, and others all collaborating on its development. Our <a href=\"https://www.smashingmagazine.com/2020/04/structured-data-design-process/\">guide on structured data</a> is a good place to start.<ul><li><em><a href=\"https://search.google.com/test/rich-results\">Google Rich Result Tester</a></em></li></ul></li><li><strong>Sitemaps</strong><br>Every website should have a site map. It’s the ultimate reference point for web crawlers on how pages are organized and where to find all the content you want to be found. What would a metro system be without a map? Or a library without clearly marked sections? Take the time to do this properly as doing so will save you a lot of time in the long run. A badly organized, unmapped website is typically unpleasant for both people and crawlers to browse.</li><li><strong>Descriptive, Logical URL Structure</strong><br>This is a little one, but well worth standardising early. Use clear, succinct URL structures. This denotes both site structure and page content.<br>E.g. <code>www.mywebsite.com/book-reviews/catch-22-joseph-heller/</code> is infinitely clearer than <code>www.mywebsite.com/js7gw788</code>. One is clear to people and algorithms alike; the other is a random jumble of letters. Take the time to establish formats for different post types then stick to them.</li><li><strong>Multimedia Content</strong><br>Search engines like to see variety on pages — provided it loads quickly. A blog post with relevant images, audio clips, and an embedded video is likely to be more engaging than a plain text blog post. Never add these things just for the sake of adding them, but don’t be shy about getting creative. This is the internet; you can do just about anything.</li><li><strong>Assets Optimization</strong><br>Whatever media assets you have on-site, for goodness sake optimize them. Compressing image files is the most obvious example here, and often overlooked. That 2GB photograph from your family vacation might look sharp as the banner image on your photography portfolio — too bad nobody will stick around long enough for it to load. In a mobile-first world, super-high-resolution images are seldom necessary. Compress your images. Stagger CSS rollout. Your website has to be quick.<ul><li><em><a href=\"https://responsivebreakpoints.com/\">Responsive Image Breakpoint Generator by Cloudinary</a></em></li><li><em><a href=\"https://www.jitbit.com/unusedcss/\">Unused CSS Finder by JitBit</a></em></li></ul></li></ol><h3 id=\"off-page\">Off-Page</h3><ol><li><strong>HTTPs</strong><br>HTTPS (Hypertext Transfer Protocol Secure) improves the connection security between users and a website. Google and other search engines <a href=\"https://seo-hacker.com/google-adopt-https/\">punish websites that don’t have it</a>. Have HTTPS. Most web hosting providers throw it in for free. If they don’t, get it, or change providers.<ul><li><em><a href=\"https://gf.dev/http2-test\">HTTP/2 Test Tool by Geekflare</a></em></li></ul></li><li><strong>Backlinks</strong><br>Credibility plays a huge part in SEO, and backlinks are a major indicator of trust. If reputable, relevant sites are linking to your site, that makes you more credible in your field. Doing this properly takes time and dedication. Nobody owes you backlinks — you have to earn them. Earn. Not buy. Black hat approaches to backlinks (spamming comment sections, paying for them, etc.) will get you nowhere. If anything search engines will catch on and punish the offending site.<ul><li><em><a href=\"https://www.semrush.com/analytics/gap/backlinks/\">Backlink Gap by SEMrush</a></em></li></ul></li></ol><h3 id=\"testing-and-monitoring\">Testing And Monitoring</h3><ol><li><strong>Site Speed</strong><br>You can’t really be sure of site speed until it’s live. Run your site through speed testing tools like <a href=\"https://developers.google.com/speed/pagespeed/insights/\">PageSpeed Insights</a> and <a href=\"https://gtmetrix.com/\">GTmetrix</a>. Search engines like fast websites and dislike slow ones. So do people. Keep an eye on this over time. Just because a site was fast six months ago doesn’t mean it’s fast now, since you’ve been unloading uncompressed images again. Tut tut.<ul><li><em><a href=\"https://developers.google.com/speed/pagespeed/insights/\">PageSpeed Insights</a></em></li><li><em><a href=\"https://wattspeed.com/\">Wattspeed</a></em></li><li><em><a href=\"https://www.experte.com/mobile-friendly\">Bulk Mobile Friendly Test by Experte</a></em></li><li><em><a href=\"https://gf.dev/ttfb-test\">TTFB (Time to First Byte) Test by Geekflare</a></em></li><li><em><a href=\"https://www.webpagetest.org/\">WebPageTest</a></em></li></ul></li><li><strong>Analytics</strong><br>In the long term SEO is as much about monitoring as it is about on-site changes. There are numerous free tools available for tracking search analytics. Google has <a href=\"https://search.google.com/search-console/about\">Search Console</a> (GDPR friendly) and <a href=\"https://analytics.google.com/analytics/web/\">Analytics</a> (not always so GDPR friendly). Microsoft has the <a href=\"https://www.bing.com/toolbox/webmaster\">Bing panel</a>. Then there are third party outfits like <a href=\"https://moz.com/\">Moz</a>, <a href=\"https://www.semrush.com/\">SEMRush</a>, and <a href=\"https://www.screamingfrog.co.uk/seo-spider/\">Screaming Frog</a>. As mentioned at the start of this checklist, don’t drown in numbers. Ease yourself in with essential tools and explore from there as your priorities become clearer.</li><li><strong>Reports</strong><br>Boiling down your SEO performance into regular reports makes progress more manageable. Be it weekly, monthly, or quarterly, these are vital for staying focused on your goals… and achieving them! Keeping tabs on your performance over time means you can nip problems in the bud, and make proactive adjustments to your approach.<ul><li><em><a href=\"https://moz.com/blog/seo-reports-next-level\">How to Create Relevant and Engaging SEO Reports</a> by Moz</em></li></ul></li></ol><h3 id=\"quick-wins\">Quick Wins</h3><p>Not everyone has the time or resources to go through a full audit of their website’s SEO. That’s ok, and it doesn’t mean you have to fall behind. The following tips are particularly easy to implement, can return quick results, and allow you to keep an eye on your search performance long term.</p><ol><li><strong>Basic Analytics</strong><br>If you’re completely new to SEO there are few better ways to get started than getting basic analytics up and running. By this, we mean Google Search Console and Google Analytics. Both are free and easy to add to a site. Having these up and running will immediately give you a better sense of your SEO situation.<ul><li><em><a href=\"https://search.google.com/search-console/about\">Google Search Console</a></em></li><li><em><a href=\"https://analytics.google.com/analytics/web/\">Google Analytics</a></em></li><li><em><a href=\"https://www.bing.com/toolbox/webmaster\">Bing Webmaster Tools</a></em></li></ul></li><li><strong>Purge Low Quality Content</strong><br>Producing great content takes time and a lot of work. Deleting rubbish content takes seconds. Your website is the sum total of its pages. If a site has a lot of ‘thin’ content, that’s going to weigh down the good stuff. Go through your existing content and honestly assess whether it’s worthy of the standard you want to live up to. If the answer’s no, maybe you should delete it. Doing this can give your SEO an immediate bounce. Depending on the site, purging low quality content can be like removing a ball and chain.</li><li><strong>Optimize Images</strong><br>A great way to speed up your website is to properly compress your images. If this isn’t something you’ve thought about before you may be slightly mortified by how big some of the files are. It can be tedious, but it has to be done and is an immediate way to speed up your site speed. And make sure they’ve all got alt text, while you’re at it.<ul><li><em><a href=\"https://web.dev/measure/\">Measure tool at web.dev</a></em></li><li><em><a href=\"https://tinyjpg.com/\">TinyJPG.com</a></em></li><li><em><a href=\"https://kraken.io/web-interface\">Kraken.io</a></em></li></ul></li></ol><hr><p><em>Please note that this cheat sheet will be updated occasionally, so if you think anything is missing and should be added, feel free to let us know! We’ll consider it for inclusion the next time we update the list.</em></p><p><img src=\"https://www.smashingmagazine.com/images/logo/logo--red.png\" alt=\"Smashing Editorial\" width=\"35\" height=\"46\" loading=\"lazy\" decoding=\"async\"> <span>(ra, il)</span></p></div></div>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"da030b9dffdee57552becb6e99180c62608b7167b7b1bdd7166df27550ce6f39","category":"Tech"}