{"title":"Mouse embryos grow for days in culture, but the requirements are a bit nuts","link":"https://arstechnica.com/?p=1751042","date":1616255398000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Ex utero —</h4><h2 itemprop=\"description\">And human embryos now get to the earliest state of development in a dish.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Visel-Pen-mouse-embryo-CROPPED-e1616255191202-800x542.jpeg\" alt=\"A gross white blob looks vaguely like a human ear.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Visel-Pen-mouse-embryo-CROPPED-e1616255191202.jpeg\" data-height=\"812\" data-width=\"1199\">Enlarge</a> <span>/</span> A mouse embryo with the nervous system highlighted in blue.</p></figcaption></figure><p>Embryos start out as a single cell, and have to go from there to a complicated array of multiple tissues. For organisms like insects or frogs, that process is pretty easy to study, since development takes place in an egg that's deposited into the environment shortly after fertilization. But for mammals, where all of development takes place inside the reproductive tract, understanding the earliest stages of development is a serious challenge. Performing any experiments on a developing embryo is extremely difficult, and effectively impossible at some stages.</p><p>This week, however, progress has been made with both human and mouse embryos. On the human side, researchers have used induced stem cells to create embryo-like bodies that perform the first key step in development, catching them up to where mouse research has been for decades. On the mouse side, however, a research team has gotten mouse embryos to go for nearly a week outside the uterus. While that opens up a world of experiments that hadn't previously been possible, the requirements for getting it to work means that it's unlikely to be widely adopted.</p><h2>To grow mice, you need rats</h2><p>The mouse work was somewhat more interesting technically, so we'll get to that first. One of the most critical steps in the development of vertebrates is called gastrulation. The process takes some cells that have been set aside during the early embryo, and converts them into three critical layers that go on to form the embryo: the skin and nerves, the lining of the gut, and everything else.</p><p>Gastrulation takes place between six and seven days after fertilization, and a lot of key developmental events take place shortly afterwards: the formation of nerve cells and their organization, the development of the ordered structures that form the vertebrae, and more. But, given the size of the embryo at this time and its location in the uterus, the process of gastrulation is essentially invisible.</p><p>A large team based in Israel decided to figure out how to change that. They first started with embryos that had already passed the critical stages of gastrulation, and figured out how to get them to survive. It was... not simple. To start with, they embryos had to be incubated in a bottle that constantly rotated in order to ensure all the nutrients and oxygen around the embryo were thorough mixed, instead of allowing the embryo's energy demands to create a local \"dead zone\" around it.</p><p>The oxygen levels had to be controlled through a custom in-house gas supply system that ramped up the pressure over time in order to force more oxygen into solution. And fresh glucose had to be regularly infused into the liquid medium as well.</p><p>About that liquid medium. About a quarter of it was something you could buy out of a standard biotech supply catalog. The rest was substantially harder to come buy. Half of it was serum obtained from rat blood. And a quarter was serum obtained from human umbilical cord blood. Neither of these is particularly easy to come by. They tested, and you really do need the human blood; rat blood alone wasn't nearly as good. (How often do I get to write a sentence like that?)</p><p>In any case, this was enough to get the embryos through four days of development. This took them from three layers of unspecialized cells to a place where the spinal cord had started to form and limbs started budding off the side of the embryo. That, in development terms, includes a whole lot of important events that we are very interested in studying.</p><p>But, by this point, the embryos growing circulatory system should have integrated with the placenta, ensuring the entire embryo was well supplied with nutrients and oxygen. The embryos died in a way that suggested an oxygen supply was probably lacking.</p><h2>Earlier still...</h2><p>While an accomplishment, this all takes place after gastrulation has happened. So, the researchers backed up a bit further, isolating embryos between four and five days after fertilization. The same medium worked, but here, the embryos didn't need to be in a rotating bottle in order to survive. The two incubations could be combined, essentially taking the embryos through an entire week of development outside the uterus.</p><p>In addition, the team showed that they could perform a variety of manipulations on the embryos during this time in culture. This included inserting DNA into their cells (using either a virus or electrical currents), or adding in stem cells to see how they develop. So, for anyone willing to get enough rat and umbilical blood to make this all work, there's a lot of developmental biology research that can now be done on mouse embryos.</p><p>The one thing that's not obviously accessible through this work is the earliest developmental process, in which a cavity opens up in the uniform-looking ball of cells formed by the first cell divisions of the fertilized egg. This creates the first somewhat specialized populations of cells in the embryo (both the ones on the exterior, and a patch of cells inside the cavity). The resulting structure is called a blastocyst.</p><p>For mice, we've been able to take a fertilized egg and grow it into a blastocyst in culture for years. But this hasn't been done with human cells. And, to a degree, it still hasn't. Instead, two different labs started with stem cells, either embryonic stem cells or stem cells induced from adult tissues. In contrast to the mouse work, getting the embryo to go this far could be done with off-the-shelf ingredients in the media that the cells were grown in.</p><p>This opens up the earliest stages of human development to study. But, while formation of the blastocyst is interesting, a lot more goes on at later stages of development. And here, ethical concerns are likely to limit how far we're going to be willing to take human tissue in culture.</p><p>The interesting thing here is that we can already get mouse embryos to develop into blastocysts, and now we can take blastocysts well on their way through development. So it seems likely that we can probably connect the two processes with a bit of work. That would be enough to get from fertilization through to about two-thirds of the way to birth. That's pretty impressive.</p><p>But by this point, the embryo is getting very three-dimensional, and getting all the cells supplied with oxygen and nutrients really requires a functional blood supply, plugged into a source for all the embryos needs. And it's not clear how exactly we could substitute for the placenta, which hosts a very elaborate and specialized interchange between the fetal and maternal blood streams. In practical terms, though, these results mean a whole range of experiments are now possible in mice—provided you're willing to bleed enough rats.</p><p>Nature, 2021. DOI: <a href=\"http://dx.doi.org/10.1038/s41586-021-03416-3\">10.1038/s41586-021-03416-3</a>, <a href=\"http://dx.doi.org/10.1038/s41586-021-03372-y\">10.1038/s41586-021-03372-y</a>, <a href=\"http://dx.doi.org/10.1038/s41586-021-03356-y\">10.1038/s41586-021-03356-y</a> &nbsp;(<a href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\">About DOIs</a>).</p></div></div></div>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"da140e3f20f27476ccb282aac7934cb3ff95a33ea3c0074f9f6e5b2191759600","category":"Tech"}