{"title":"North Korea may have hacked into Pfizer servers looking for COVID data","link":"https://arstechnica.com/?p=1742679","date":1613498893000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>red team? more like red star team —</h4><h2 itemprop=\"description\">South Korea's NIS warned lawmakers of Russian and North Korean hacking activity.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Datacenter_NK_hacking-800x533.jpg\" alt=\"Intrusion attempts on Pfizer servers have North Korea's fingerprints all over them, according to the South Korean NIS.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Datacenter_NK_hacking.jpg\" data-height=\"1000\" data-width=\"1500\">Enlarge</a> <span>/</span> Intrusion attempts on Pfizer servers have North Korea's fingerprints all over them, according to the South Korean NIS.</p></figcaption></figure><p>This morning, South Korean intelligence officials <a href=\"https://en.yna.co.kr/view/AEN20210216008451315\">warned</a>&nbsp;the country's lawmakers of North Korean attempts to hack into a \"local drug manufacturer\" to illicitly obtain COVID-19 vaccine and treatment data.</p><p>As reported by <a href=\"https://www.washingtonpost.com/world/asia_pacific/north-korea-pfizer-coronavirus-vaccine-hack/2021/02/16/c09ec7fc-702e-11eb-8651-6d3091eac63f_story.html\">The Washington Post</a>, South Korean intelligence services committee member Ha Tae-Keung told reporters that the data sought included COVID-19 vaccine and treatment technology. Tae-Keung went on to say that South Korea detected a 32 percent year-on-year increase in North Korean cyber-attack attempts.</p><p>Pfizer has so far refused comment, leaving details vague on when the hack occurred or how successful it might have been. The newly reported hack attempts follow a spate of <a href=\"https://www.bbc.com/news/technology-54936886\">similar</a> state-sponsored attempts against health organizations that Microsoft reported in November 2020. According to Microsoft, those attempts were made by Russian group Fancy Bear, along with North Korean groups Zinc and Cerium.</p><p>North Korea's state media has not responded so far to the South Korean accusations. North Korea claims to be entirely free of COVID-19 infections—which should probably be evaluated alongside the country's claims that Kim Jong-Il's first-ever round of golf came in <a href=\"https://golf.com/news/behind-kim-jong-ils-famous-round-of-golf/\">38 under par</a>&nbsp;or that successor Kim Jong-Un learned to drive at <a href=\"https://www.upi.com/Top_News/World-News/2015/04/08/New-North-Korea-textbook-Kim-Jong-Un-learned-to-drive-at-age-3/8231428500261/\">age 3</a>&nbsp;and beat champion sailing yacht racers at age 9.</p><p>Whatever the real COVID-19 infection numbers in North Korea may be, the country has requested vaccines and is scheduled to receive some 2 million <a href=\"https://jp.reuters.com/article/health-coronavirus-vaccines-northkorea-idINKBN2A40Q4\">doses</a> of the&nbsp;AstraZeneca-Oxford University vaccine from a United Nations-backed Covax effort intended to deliver vaccines to the world's least affluent and most vulnerable countries.</p><p>North Korea's hackers have been up to more than just medical \"research.\" The country closed its border with China soon after the pandemic began, deeply impacting trade and undermining an already weak economy. A United Nations <a href=\"https://www.reuters.com/article/us-northkorea-sanctions-cyber-idUSKBN2AA00Q\">inquiry</a> into a $281 million cryptocurrency theft from September 2020 points the blame at North Korea. The sanctions monitors who reported the theft to the UN Security Council painted them as merely the latest in a long string of similar attacks, with similar thefts from banks and crypto exchanges netting North Korea an estimated $2 billion in 2019.</p><p>The sanctions monitors accuse North Korea of largely using the stolen funds to finance nuclear and ballistic missile research programs.</p></div></div>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"da29dd7c5e74e05ee0ec77bd39c1c352486f074eee9d513e9b464b5c47b558a7","category":"Tech"}