{"title":"As cars get heavier, even small speed differences matter in a crash","link":"https://arstechnica.com/?p=1740226","date":1612710052000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>(mass/2)*speed^2 —</h4><h2 itemprop=\"description\">A study on speed and crashes has me pining for lightweight cars.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Volvo-safety-event-8-800x451.jpg\" alt=\"An orange Volvo SUV after a crash test.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Volvo-safety-event-8.jpg\" data-height=\"1154\" data-width=\"2048\">Enlarge</a> <span>/</span> A Volvo XC90 SUV following a crash test in Sweden.</p><p>Jonathan Gitlin</p></figcaption></figure><p>At the end of January, safety researchers at the AAA Foundation for Traffic Safety and the Insurance Institute for Highway Safety <a href=\"https://www.iihs.org/topics/bibliography/ref/2218\">published a study showing that small increases in speed have big consequences during a crash</a>. After crashing three identical cars at increasing speed, the study showed that a car that aces the test across the board at 40mph (64km/h), with just a 15 percent change of serious injury may get a failing grade overall, with a 59 percent chance of serious injury at 50mph (80km/h). At 56mph (90km/h), the result was even worse; the 50th percentile male crash test dummy only had a 21 percent chance of escaping serious injury or worse.</p><p>No doubt, <a href=\"https://arstechnica.com/cars/2019/05/this-institute-crash-tests-cars-to-make-us-all-safer/\">the fact that vehicles are designed to pass a 45mph (73km/h) crash test</a> and not something at highway speed has something to do with the results of the study. But it's also a reminder of basic physics: a vehicle's kinetic energy is equal to half its mass multiplied by the square of its speed. So, the average US light-duty vehicle—<a href=\"https://www.forbes.com/sites/samabuelsamid/2019/01/03/new-vehicles-keep-getting-heavier-or-are-they/?sh=780f2ca64518\">which weighs about 4,000lbs (1,814kg)</a>—has 11.2kJ when it's traveling at 25mph (40km/h) but 22kJ at 35mph (56km/h), a fact that people can use next time someone complains that city speed limits are too slow.</p><p>But speed is, literally, only part of the equation. Local authorities can set limits on how fast we can drive, but no one's going to stop you buying a 5,000lb (2,268kg) car instead of a 4,000lb one. And big cars are attractive to the general public. Ironically, much of this trend is fueled by the fact that safety sells, and the biggest, heaviest cars are the safest—for their occupants, at least. Pedestrians or people in older or smaller cars? Not so much.</p><p>All things being equal, a bigger and heavier car will handle worse. You can compensate for that in some ways, as +5,000lb cars like the <a href=\"https://arstechnica.com/cars/2019/09/the-porsche-taycan-every-bit-as-good-as-a-200000-porsche-should-be/\">Porsche Taycan Turbo</a>, <a href=\"https://arstechnica.com/cars/2019/09/the-2020-audi-rs7-our-all-time-favorite-fastback-just-got-even-better/\">Audi RS7</a>, and <a href=\"https://arstechnica.com/cars/2021/01/aston-martins-new-suv-is-actually-extremely-good-the-2021-dbx-review/\">Aston Martin DBX</a> all show. Fast-reacting adaptive suspension and an excess of power is a good way to beat inertia when the time comes to start moving or change direction. All that stuff exists, but it all comes with its own baggage. Adaptive suspension is expensive and adds plenty of weight just on its own. Electric motors are great because they're so torquey, but now you need to carry hundreds of pounds of lithium-ion cells, which again, isn't cheap. And glacier-melting twin-turbo V8s are increasingly untenable because of the glacier-melting bit.</p><p>Powerful engines and smart dampers are all well and good for starting and swerving. But you can't really hide a car's mass when it's time to slow down or stop. Heavy cars need big brakes and longer braking distances. And tires that can cope with all of the above, rain or shine.</p><h2>Less can be more</h2><p>At the other end of the spectrum is a lightweight utopia, one envisioned by designers like Gordon Murray. He puts his money where his mouth is, too; none of his <a href=\"https://www.carthrottle.com/post/gordon-murray-liked-his-alpine-a110-so-much-he-took-it-apart/\">personal cars</a>—including one of those Suzuki Jimnys that everyone loves so much—weighs more than 2,500lbs (1,134kg), if memory serves.</p><p>Lighter cars have a payoff for enthusiasts as well as the safety conscious. The less mass a car has to move, the better it handles. And it won't need nearly as much power to get moving in the first place. Lighter, less powerful cars have much more accessible limits, which means you can have fun driving them at socially responsible velocities. In fact, I'm still wistful over my old 1996 Ford Ka. With just 59hp (44kW) and 2,002lbs (908kg), it remains etched in my memory as one of the most enjoyable cars to drive day-to-day.</p><p>The true godfather of lightweighting was Colin Chapman, founder of Lotus, who may have been more obsessed with weight <a href=\"https://arstechnica.com/cars/2020/08/gordon-murray-says-the-his-new-supercar-is-the-most-driver-centric-ever/\">than Murray</a>. Chapman described his philosophy as \"simplify, then add lightness,\" and that's been a hallmark of Lotus through good times and bad. Some of the bad included racing cars that were often too fragile for their own good, with tragic consequences. But the good have been road cars that outhandle any of their rivals and often at a keen price.</p><p>Since 1996, Lotus has existed on the success of the Elise and other lightweight sports cars derived from its still-innovative extruded and bonded aluminum chassis. I've still never driven one, and I remain sad about that. Perhaps if the pandemic ever ends, <a href=\"https://arstechnica.com/cars/2017/05/microcar-madness-at-the-lane-motor-museum/\">the nice people at the Lane Motor Museum in Nashville</a> might let me come and do a feature on their example.</p><p><a href=\"https://arstechnica.com/cars/2019/09/driving-the-2020-lotus-evora-gt-makes-me-optimistic-about-lotuss-future/\">I have driven a Lotus Evora</a> in Monterey in 2019. Yes, a car weighing 3,100lbs is what passes for lightweight these days, which does sound crazy when you say it out loud. It was wonderful to drive but not as good to live with as a Porsche 911. Not that you'll be able to buy one for much longer: Lotus is shutting down the production lines at its factory in Hethel, England, in order to retool for an all-new car, known only as Type 131 for now.</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus_Sports_Car_Series.jpg\" data-height=\"2159\" data-width=\"4096\" alt=\"The yellow car is the Lotus Evija, a very expensive, very powerful electric supercar which will be built in tiny numbers. But the Type 131 should be much more attainable. \"><img alt=\"The yellow car is the Lotus Evija, a very expensive, very powerful electric supercar which will be built in tiny numbers. But the Type 131 should be much more attainable. \" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus_Sports_Car_Series-980x517.jpg\" width=\"980\" height=\"517\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Lotus_Sports_Car_Series.jpg\" data-height=\"2159\" data-width=\"4096\">Enlarge</a> <span>/</span> The yellow car is the Lotus Evija, a very expensive, very powerful electric supercar which will be built in tiny numbers. But the Type 131 should be much more attainable.</p><p>Lotus Cars</p></figcaption></figure><p>I'm very excited to see how the Type 131 develops, as well as how Lotus <a href=\"https://arstechnica.com/cars/2017/05/lotus-cars-is-saved-being-bought-by-chinas-geely/\">adapts to life under the ownership of Geely</a>. How it works with Volvo's parts bin in particular intrigues me—Volvo also being owned by the Chinese company. And I've just realized that means future Lotuses will run Android automotive. A Lotus-badged crossover of some kind seems inevitable, which will set off all manner of complaining. But if Porsche can make the <a href=\"https://arstechnica.com/cars/2018/03/review-the-porsche-macan-gts-might-be-an-suv-but-its-all-porsche/\">Macan GTS great to drive</a>, I have no worries that Lotus will work its magic.</p><p>Still, Murray and Lotus are outliers, and the philosophy of lightweighting has far to go before it's a mainstream belief in the auto industry. But a man can dream, can't he?</p></div></div></div>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"da4279f17b32748f9fb6be5e6042e5050f07b8a4e62823b5e24e84afa4fb09ea","category":"Tech"}