{"title":"Cherie Pridham: My responsibility to succeed and carry the torch","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/my-responsibility-to-succeed-and-carry-the-torch-by-cherie-pridham","date":1615202544000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>March 08, 2021</span></p><p>On International Women's Day,&nbsp;</p><meta charset=\"utf-8\">Israel Start-Up Nation DS Cherie Pridham writes about her ambitions for women's role in pro cycling<p></p></div><div><p>Today is International Women’s Day and whilst I wholeheartedly support its significance, it speaks volumes that in this day and age we still require a day to champion issues that should actually be the norm within our society.</p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p>The fact that a tremendous amount of media coverage will be given to this topic over the next few days perhaps demonstrates best how much work there is still to do to achieve a gender-equal world which is free of stigma and stereotypes.</p><p>I don’t think that you must necessarily be a feminist to support the values of equal opportunity, but I do believe that women in general are underrepresented in everyday life.</p><p>I am very fortunate to work for an organisation that embraces equality, diversity, and fairness. But I know that I am one of the lucky ones. You only have to look at the world of cycling to see what a male-dominated sport it is. It is changing, if slowly, but I believe for the better.</p><p>I was staggered, back in December 2020, at the media attention following my appointment as a Sport Director (DS) at Israel Start-Up Nation. I think the simple fact that a professional cycling team had offered a job to a woman, based on ability, shocked a lot of people!</p><p>I didn’t for one minute consider myself to be a role model within the sport or a champion for women’s rights – those who know me well will testify that is not the person I am. However, the fact that people have subsequently described me as a trailblazer and a pioneer has certainly resonated with me.</p><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Cherie_Pridham_600x600.jpg?v=1615202088\" alt=\"\"></p><p>It has made me realise that I have a responsibility on behalf of other women to succeed in what I do, and to carry the torch for those who are not as fortunate and for the next generation.</p><p>Sure, I was nervous and apprehensive when I attended my first training camp in Girona at the start of the year. As the first woman DS in the professional peloton it was to be expected that I would have that ‘first day at school’ feeling.</p><p>I can honestly say though, I felt at home straight away and people could not have been more welcoming. I was treated as one of the group and that’s all I wanted. As a woman, I don’t expect special treatment, just equal treatment, and I now feel, a couple of months into my role, as simply one of the team.</p><p>The riders, the staff and the owner, have all gone out of their way to be supportive of me, and it has resulted in an environment in which I can give my best. It is super to be able to sit down with key riders, like Sep Vanmarcke, and chat about the races, my style of DS-ing and working together; we feel comfortable around each other as a team.</p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Subscribe to our women's newsletter,&nbsp;</span></p><p><span>produced in association with Rapha, to receive</span></p><p><span>a weekly complement of racing, gear and cycling</span></p><p><span>culture focussed on women</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p>I hope that in some small way my experience will encourage other employers to judge women solely on their ability and enable them to see the benefits of sometimes looking at issues from a female viewpoint.</p><p><a href=\"https://www.rouleur.cc/products/issue-101-womens-special\"><em><strong>Buy Rouleur's women's issue now</strong></em></a></p><p>I acknowledge that there is still a long way to go in order to achieve gender equality, but I do see efforts now being made in various quarters to balance things. In cycling, I am pleased to say that there has been some positive movement, too.</p><p>For Orla Chennaoui to be given the opportunity to guest edit a recent edition of <a href=\"https://www.rouleur.cc/products/issue-101-womens-special\"><i>Rouleur</i> magazine</a> is something that would not have happened a couple of years ago. Nor would José Been have been asked to commentate on men’s races by Eurosport, nor would broadcasters have asked race organisers to give more airtime to women’s races – but I see these things are happening now.</p><p>They are all small but very positive steps that help to build momentum to achieve a more inclusive and fairer environment. They are also, in my view, non-confrontational and helpful ways of getting the message across.</p><p>I really look forward to a day when I am not the only female DS at the top level of the sport and that all the WorldTour outfits have men’s and women’s teams – it will happen soon I am sure. Hopefully, it will just become the norm.</p><p>It was always my dream to work at this level and I feel so blessed that I have managed to achieve my goal.</p><p>Wouldn’t it be nice for all women to have similar opportunities in a world based on equality and values? Where people are simply judged and rewarded in terms of their ability to undertake a role.</p></div></div>","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"da5385a83fd7bd2424eab4450efbcd1697f44aa72998a9434680b63472781db0","category":"Cycling"}