{"title":"Tour of Britain and Women's Tour to honour key workers","link":"https://www.cyclist.co.uk/news/9391/tour-of-britain-and-womens-tour-to-honour-key-workers","date":1616156272000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Key workers and community champions are to be celebrated at the start and end of each stage of the <a href=\"https://www.cyclist.co.uk/tags/womens-tour\">Women's Tour</a> and the <a href=\"https://www.cyclist.co.uk/tags/tour-of-britain\">Tour of Britain</a> this year.</p><p>Race organiser SweetSpot together with <a href=\"https://www.cyclist.co.uk/tags/british-cycling\">British Cycling</a> have launched Ride for Heroes to honour the underappreciated work by those who have kept the country going since the beginning of the <a href=\"https://www.cyclist.co.uk/tags/coronavirus\">coronavirus</a> pandemic last March.</p><p>They're calling on people to nominate local heroes to be celebrated at the stage local to them, with groups then given the opportunity to lead out the peloton at the beginning of the day or be part of festivities leading into the finish.</p><p>'We want to make both races not just about the world-class racing and superstar riders but also through our campaign, Ride for Heroes, to ensure it is a celebration of \"all things British\",' says Hugh Roberts, SweetSpot Group CEO.</p><p>'It will be an occasion for ourselves and British Cycling to thank all those who have worked tirelessly over the past year to ensure our wellbeing and safety.'</p><p>'I don't think anyone can overstate the vital work which has been done by key workers over the last year, whether they are NHS staff or everyone who kept the country functioning,' British Cycling CEO Brian Facer says.</p><p>'The Tour of Britain and Women's Tour are two of our key events which visit towns and cities across the country, so it is an ideal opportunity for us to thank the key workers and community champions for everything that they have done.'</p><p>To nominate a hero, visit <a href=\"https://www.tourofbritain.co.uk/ride-for-heroes\" target=\"_blank\">tourofbritain.co.uk/ride-for-heroes</a> and <a href=\"https://www.womenstour.co.uk/ride-for-heroes\" target=\"_blank\">womenstour.co.uk/ride-for-heroes</a></p></div></div>","author":"wstrickson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"da5a64964295be318f84f2e181c74d4761c9c7fd949dd091abbfbfecc9ea5ecf","category":"Cycling"}