{"title":"Getting Started With The GetX Package In Flutter Applications","link":"https://smashingmagazine.com/2021/01/getx-package-flutter-applications/","date":1610107213000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"article__content\"><div><div><figure role=\"presentation\"><a href=\"https://www.smashingmagazine.com/author/kelvin-omereshone\"><p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2e7a505a-43d6-4f27-b0b3-1b8a674d2f5e/kelvin-omereshone-200x200.jpg\" loading=\"eager\" width=\"100\" height=\"100\" alt=\"Kelvin Omereshone\"></p></a></figure></div><div id=\"author__desc\"><p>Kelvin is an independent software maker currently building <a href=\"https://sailscasts.com/\">Sailscasts</a> — a platform to learn server-side JavaScript. He is also a technical writer and … <a href=\"https://www.smashingmagazine.com/author/kelvin-omereshone\">More about Kelvin ↬</a></p></div></div><p><section aria-label=\"quick summary\">GetX is an extra lightweight solution for state, navigation, and dependencies management for Flutter applications. In this article, we will be looking at its benefits, features, and how to start using it in Flutter applications.</section></p><p>Flutter is one of the fastest ways to build truly cross-platform native applications. It provides features allowing the developer to build a truly beautiful UI experience for their users.</p><p>However, most times to achieve things like navigating to screens, state management, and show alerts, a lot of boilerplates are needed. These boilerplates tend to slow down the development efficiency of developers trying to go about building features and meeting their deadlines.</p><p>Take for example the boilerplate needed to navigate to a screen in a Flutter application. Let’s say you want to navigate to a screen called <code>AboutScreen</code>. you will have to write:</p><p>It would be more efficient and developer-friendly to do something like:</p><p>When you need to navigate back to the previous page in Flutter you will have to write:</p><p>You will notice we are always depending on <a href=\"https://api.flutter.dev/flutter/widgets/State/context.html\">context property</a> for something as commonplace as navigating between screens. What if instead, we can do something like this:</p><p>The above examples are some of the ways where application development in Flutter can be improved to be more intuitive and efficient with less boilerplate. If you favor simplicity and being efficient in building out features and ideas, in Flutter then the Get package will interest you.</p><h3 id=\"what-is-getx\">What Is GetX</h3><p><a href=\"https://pub.dev/packages/get\">Get or GetX</a> is a fast, stable, extra-light framework for building Flutter applications.</p><p>GetX ships out of the box with high-performance state management, intelligent dependency injection, and route management in a simplistic and practical way.</p><p>GetX aims to minimize boilerplates while also providing simple and intuitive syntax for developers to use while building their applications. At the core of GetX are these 3 principles:</p><ul><li><strong>Performance</strong><br>GetX focuses on the performance of your application by implementing its features to consume as little resources as possible.</li><li><strong>Productivity</strong><br>GetX wants developers to use its features to be productive as quickly as possible. It does so by employing easy to remember syntax and practices. For example, generally, the developer should be concerned to remove controllers from memory but GetX out of the box provides smart management that monitors controllers in your application and remove them when they are not being used by default.</li><li><strong>Organization</strong><br>GetX allows the decoupling of the View, presentation logic, business logic, dependency injection, and navigation in your Flutter application. You do not need context to navigate between routes, so you are not dependent on the widget tree for navigation. You don’t need context to access your controllers/blocs through an <a href=\"https://api.flutter.dev/flutter/widgets/InheritedWidget-class.html\"><code>inheritedWidget</code></a>, so you can completely decouple your presentation logic and business logic from your view layer. You do not need to inject your Controllers/Models/Blocs classes into your widget tree through multiproviders, for this GetX uses its own dependency injection feature, decoupling the DI from its view completely.</li></ul><h3 id=\"features-of-getx\">Features Of GetX</h3><p>GetX comes with a couple of features you will need in your daily app development in Flutter. Let’s look at them:</p><h4 id=\"state-management\">State Management</h4><p>One of the flagship features of GetX is its intuitive state management feature. State management in GetX can be achieved with little or no boilerplate.</p><h4 id=\"route-management\">Route Management</h4><p>GetX provides API for navigating within the Flutter application. This API is simple and with less code needed.</p><h4 id=\"dependency-management\">Dependency Management</h4><p>GetX provides a smart way to manage dependencies in your Flutter application like the view controllers. GetX will remove any controller not being used at the moment from memory. This was a task you as the developer will have to do manually but GetX does that for you automatically out of the box.</p><h4 id=\"internationalization\">Internationalization</h4><p>GetX provides i18n out of the box allowing you to write applications with various language support.</p><h4 id=\"validation\">Validation</h4><p>GetX provides validation methods for performing input validation in your Flutter applications. This is quite convenient as you wouldn’t need to install a separate validation package.</p><h4 id=\"storage\">Storage</h4><p>GetX provides a fast, extra light, and synchronous key-value in memory, which backs up data to disk at each operation. It is written entirely in Dart and easily integrates with the core GetX package.</p><h3 id=\"getting-started-with-getx\">Getting Started With GetX</h3><p>Now that you have seen what GetX is and the features and benefits it provides, let’s see how to set it up in your application. We will build a demo app to see most of the features we have mentioned in action. Let’s get started.</p><h4 id=\"create-a-brand-new-flutter-application\">Create A Brand New Flutter Application</h4><p>We will get started by creating a brand new Flutter application through the Flutter CLI. I am assuming your machine is already set up for application development with Flutter. So we run:</p><p>This will generate the basic code needed for a Flutter application. Next, open up the project you just created in your editor of choice (We will be using VS Code for this article). We will then run the project to make sure it’s working alright (Make sure you have either a device connected or an emulator/simulator running).</p><p>When the application runs, you will see the default counter application that Flutter scaffold for you when you create a new Flutter application. What we are going to do is to implement the very same counter application but with GetX to manage the state of the app (which is the count variable).</p><p>We will start with clearing <code>main.dart</code> and leaving only this snippet of code:</p><p>By now our application would have been broken since there is no <code>MyHomePage</code> widget anymore. Let’s fix that. With GetX, we don’t need stateful widgets and also our UI can be clearly separated from our business logic. So we will create two directories inside <code>lib/</code>. These directories are:</p><table data-tablesaw-mode=\"stack\" data-tablesaw-minimap=\"\" data-tablesaw-swipe-media=\"(max-width: 800px)\"><tbody><tr><td><code>views/</code></td><td>To hold the screens in our application.</td></tr><tr><td><code>controllers/</code></td><td>To hold all controllers for the screens in our application.</td></tr></tbody></table><p>Let’s create <code>MyHomePage</code> widget inside <code>views/</code>. The name of the file will be <code>my_home_page.dart</code>. After you create it, add the following code snippet to it:</p><p>Now we have the <code>MyHomePage</code> widget, let’s import it in <code>main.dart</code>. Add the import statement to the top of main.dart below <code>import 'package:flutter/material.dart';</code></p><p>Now your <code>main.dart</code> file should look like this:</p><p>When you save your application now, all errors should have been fixed and the app will run. But you will notice when you click the button again, the counter won’t be updated. If you look at the <code>views/my_home_page.dart</code> code, you will see we are just hard coding <code>0</code> as the value of the Text widget and passing <code>null</code> to the <code>onPressed</code> handler of the button. Let’s bring in GetX to the mix to get the application functional again.</p><h4 id=\"installing-getx\">Installing GetX</h4><p>Head over to the <a href=\"https://pub.dev/packages/get/install\">install page</a> for GetX on pub.dev and you will see the line of code to copy to place in your <code>pubspec.yml</code> file to install GetX. As of the time of writing this article, the current version of GetX is 3.23.1. So we will copy the line:</p><p>And then paste it under the <code>dependencies</code> section of our <code>pubspec.yml</code> file. When you save the file, get should be automatically installed for you. Or you can run manually in your terminal.</p><p>The dependencies section of your <code>pubspec.yml</code> file should look like this:</p><h4 id=\"getxcontroller\"><code>GetxController</code></h4><p>We have mentioned that GetX allows you to separate the UI of your application from the logic. It does this by providing a <code>GetxController</code> class which you can inherit to create controller classes for the views of your application. For our current app, we have one view so we will create a controller for that view. Head over to the <code>controllers/</code> directory and create a file called <code>my_home_page_controller.dart</code>. This will hold the controller for the <code>MyHomePage</code> view.</p><p>After you’ve created the file, first import the GetX package by adding this to the top of the file:</p><p>Then you will create a class called <code>MyHomePageController</code> inside it and extend the <code>GetxController</code> class. This is how the file should look like:</p><p>let’s add the count state to the class we’ve created.</p><p>In GetX, to make a variable observable — this means that when it changes, other parts of our application depending on it will be notified. To do this we simply need to add <code>.obs</code> to the variable initialization. So for our above <code>count</code> variable, we will add <code>.obs</code> to <code>0</code>. So the above declaration will now look like this:</p><p>This is how our controller file looks like at the moment:</p><p>To wrap things up with the <code>MyHomePageController</code> we will implement the <code>increment</code> method. This is the snippet to do that:</p><p>You will notice we needed to add <code>.value</code> to the count variable to increment it. We did this because adding <code>.obs</code> to a variable makes it an observable variable and to get the value of an observable variable, you do so from the <code>value</code> property.</p><p>So we are done with the controller. Now when the value of count changes, any part of our application using it will be updated automatically.</p><p>We will now head over to our view and let it know about the controller we just created. We will do so by instantiating the controller class using GetX dependency management feature. This will ensure that our controller won’t be in memory when it is no longer needed.</p><p>In <code>views/my_home_page.dart</code> import the Get package and also the controller you created like so:</p><p>Then inside the <code>MyHomePage</code> class we will instantiate the <code>MyHomePageController</code>:</p><p>Now we have an instance of the <code>MyHomePageController</code>, we can use the state variable as well as the method. So starting with the state, in GetX to mark a part of your UI to be rebuilt when a state variable changes, you will wrap that part with the <code>Obx</code> widget. GetX provides other ways of doing this, but this method is much simpler and cleaner.</p><p>For our count application we want the Text widget to be updated with the current count. So we will wrap the Text widget with <code>Obx</code> widget like so:</p><p>Next, we will replace the static string <code>0</code> with the count variable from the <code>MyHomePageController</code> like so:</p><p>Lastly, we will call the increment method when the <code>floatingActionButton</code> is pressed like so:</p><p>So overall, our <code>MyHomePage</code> view file should now look like this:</p><p>When you save your application or you rerun it, the counter app should be working as it did when we first created the application.</p><p>I believe you have seen how intuitive state management is with GetX, we didn’t have to write a lot of boilerplate and this simplicity will be more obvious as your application get complex. You will also notice our view doesn’t hold or maintain any state so it can be a stateless widget. The brain of the view in turn is now a controller class that will hold the state for the view and methods.</p><h3 id=\"navigation-in-getx\">Navigation In GetX</h3><p>We have seen state management in GetX. Let’s now look at how GetX supports Navigation within your application. To activate the Navigation feature of GetX, you only need to make one change in <code>main.dart</code> which is to turn the <code>MaterialApp</code> widget to a <code>GetMaterialApp</code> widget. Let’s do that by first importing Get in the top of <code>main.dart</code></p><p>Then we make the change to <code>MaterialApp</code> so our <code>main.dart</code> file now look like this:</p><p>Now our app has been set up to support GetX navigation. To test this out we will create another view in <code>views/</code> directory. We will call this on <code>about_page.dart</code> and it will contain the following code:</p><p>We will then go over to <code>MyHomePage</code> and add a button that when pressed will navigate us to the <code>AboutPage</code>. Like so. The button should be below the Obx widget. Here it is:</p><p>We will also need to import the <code>AboutPage</code> on top of the <code>MyHomePage</code> file:</p><p>To tell GetX to navigate to the <code>AboutPage</code> all we need is one line of code which is:</p><p>Let’s add that to the <code>onPressed</code> callback of the <code>FlatButton</code> widget like so:</p><p>When you save your application now, you will now be able to navigate to the <code>AboutPage</code>.</p><p>You can also choose to replace the <code>MyHomePage</code> view with the <code>AboutPage</code> so the user won’t be able to navigate back to the previous page by hitting the device back button. This is useful for screens like login screens. To do this, replace the content of the <code>onPressed</code> handler with the below code:</p><p>This will pop the <code>MyHomePage</code> view and replace it with <code>AboutPage</code>.</p><p>Now that we can navigate to the <code>AboutPage</code>, I think it won’t be so bad to be able to go back to <code>MyHomePage</code> to do this we will add a button in <code>AboutPage</code> after the Padding widget and in it’s <code>onPressed</code> handler we will make a call to <code>Get.back()</code> to navigate back to the <code>MyHomePage</code>:</p><h3 id=\"snackbar\">Snackbar</h3><p>In Flutter conventionally to show a Snackbar, you will need to write something like this:</p><p>You can observe we are still depending on the <code>context</code> property. Let’s see how we can achieve this in GetX. Go into the <code>MyHomePage</code> view and add another <code>FlatButton</code> widget below the last button we added. Here is the snippet for the button:</p><p>Let’s display the message ‘Yay! Awesome GetX Snackbar’. Inside the onPressed handler function add the below line of code:</p><p>Run your application and when you click on the “Show Snackbar button” you will see a snackbar on top of your application!</p><p>See how we reduced the number of lines needed to show a snackbar in a Flutter application? Let’s do some more customization on the Snackbar; Let’s make it appear at the bottom of the app. Change the code to this:</p><p>Save and run your application and the Snackbar will now appear at the bottom of the application. How about we change the background color of the Snackbar as it is at the moment transparent. We will change it to an <code>amberAccent</code> color from the <code>Colors</code> class in Flutter. Update the code to this:</p><p>Overall, the button code should look like this:</p><h3 id=\"dialog\">Dialog</h3><p>GetX provides a simple method for creating AlertDialog in Flutter. Let’s see it in action. Create another button below the previous one:</p><p>Let’s call GetX to display an alert Dialog:</p><p>That will show a default Alert Dialog that is dismissable by tapping outside the Dialog. You can see how in one line of code we have a working alert dialog. Let’s customize it a bit. Let’s change the title and the message:</p><p>Save and run your app and you will see the changes when you hit the “Show AlertDialog” button. We can add confirm and Cancel buttons like so:</p><p>There are a lot of ways to customize the GetX dialog and the API is quite intuitive and simple.</p><h3 id=\"conclusion\">Conclusion</h3><p>GetX was created to improve the productivity of Flutter developers as they build out features. Instead of having to search for boilerplate needed to do things like state management, navigation management, and more, GetX provides a simple intuitive API to achieve these activities without sacrificing performance. This article introduces you to GetX and how to get started using it in your Flutter applications.</p><ul><li>You can find the demo <a href=\"https://github.com/DominusKelvin/getx_demo\">here&nbsp;→</a></li></ul><p><img src=\"https://www.smashingmagazine.com/images/logo/logo--red.png\" alt=\"Smashing Editorial\" width=\"35\" height=\"46\" loading=\"lazy\" decoding=\"async\"> <span>(ra, yk, il)</span></p></div></div>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"dad7eb93abef4c5b250323f187f4560497359d8d3580a1d4c70af7c45a3692ea","category":"Tech"}