{"title":"Hands-on with Stellantis’ new Android-based Uconnect 5 infotainment","link":"https://arstechnica.com/?p=1745454","date":1614351740000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>android assimilation —</h4><h2 itemprop=\"description\">More and more OEMs are switching to Google's operating system.</h2></header><div itemprop=\"articleBody\"><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Durango-SRT-Hellcat-cabin-layout-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Durango-SRT-Hellcat-cabin-layout.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Durango-SRT-Hellcat-cabin-layout-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Durango-SRT-Hellcat-cabin-layout-1440x960.jpg 2560\" data-sub-html=\"#caption-1745462\"><figure><figcaption id=\"caption-1745462\"><span></span><p>The Uconnect 5 infotainment system, as seen in the latest Dodge Durango SRT Hellcat, is built on Android OS.</p><p><span></span> Bradley Iger</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/main-menu-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/main-menu.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/main-menu-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/main-menu-1440x960.jpg 2560\" data-sub-html=\"#caption-1745465\"><figure><figcaption id=\"caption-1745465\"><span></span><p>Uconnect 5's main menu.</p><p><span></span> Bradley Iger</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Uconnect-user-profiles-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Uconnect-user-profiles.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Uconnect-user-profiles-980x613.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Uconnect-user-profiles-1440x900.jpg 2560\" data-sub-html=\"#caption-1745473\"><figure><figcaption id=\"caption-1745473\"><span></span><p>A key feature of new Android-based infotainment systems is robust support for multiple profiles.</p><p><span></span> Stellantis</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/media-menu-full-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/media-menu-full.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/media-menu-full-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/media-menu-full-1440x960.jpg 2560\" data-sub-html=\"#caption-1745466\"><figure><figcaption id=\"caption-1745466\"><span></span><p>This is what the media menu looks like.</p><p><span></span> Bradley Iger</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Media-menu-with-shortcuts-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Media-menu-with-shortcuts.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Media-menu-with-shortcuts-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Media-menu-with-shortcuts-1440x960.jpg 2560\" data-sub-html=\"#caption-1745467\"><figure><figcaption id=\"caption-1745467\"><span></span><p>And here's the media menu with shortcuts shown on the right side.</p><p><span></span> Bradley Iger</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/performance-menu-options-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/performance-menu-options.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/performance-menu-options-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/performance-menu-options-1440x960.jpg 2560\" data-sub-html=\"#caption-1745468\"><figure><figcaption id=\"caption-1745468\"><span></span><p>It's an SRT, so there are some performance settings you can play with.</p><p><span></span> Bradley Iger</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Tom-Tom-navigation-with-real-time-traffic-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Tom-Tom-navigation-with-real-time-traffic.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Tom-Tom-navigation-with-real-time-traffic-980x613.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Tom-Tom-navigation-with-real-time-traffic-1440x901.jpg 2560\" data-sub-html=\"#caption-1745471\"><figure><figcaption id=\"caption-1745471\"><span></span><p>Uconnect 5 uses TomTom for its native navigation app.</p><p><span></span> Stellantis</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Uconnect-Tom-Tom-nav-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Uconnect-Tom-Tom-nav.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Uconnect-Tom-Tom-nav-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Uconnect-Tom-Tom-nav-1440x960.jpg 2560\" data-sub-html=\"#caption-1745469\"><figure><figcaption id=\"caption-1745469\"><span></span><p>This is what TomTom looks like running on our test vehicle.</p><p><span></span> Bradley Iger</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/carplay-main-menu-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/carplay-main-menu.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/carplay-main-menu-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/carplay-main-menu-1440x960.jpg 2560\" data-sub-html=\"#caption-1745461\"><figure><figcaption id=\"caption-1745461\"><span></span><p>Even though it's an Android OS, you can still use Apple CarPlay.</p><p><span></span> Bradley Iger</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/CarPlay-Google-Maps-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/CarPlay-Google-Maps.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/CarPlay-Google-Maps-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/CarPlay-Google-Maps-1440x960.jpg 2560\" data-sub-html=\"#caption-1745460\"><figure><figcaption id=\"caption-1745460\"><span></span><p>Google Maps, running on iOS and casting to an Android-based infotainment OS via Apple CarPlay, feels a bit like <em>Inception</em>.</p><p><span></span> Bradley Iger</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Durango-USB-ports-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Durango-USB-ports.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Durango-USB-ports-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/Durango-USB-ports-1440x960.jpg 2560\" data-sub-html=\"#caption-1745464\"><figure><figcaption id=\"caption-1745464\"><span></span><p>USB-A and USB-C ports in the Durango.</p><p><span></span> Bradley Iger</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/wireless-charging-pad-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/wireless-charging-pad.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/wireless-charging-pad-980x653.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/02/wireless-charging-pad-1440x960.jpg 2560\" data-sub-html=\"#caption-1745470\"><figure><figcaption id=\"caption-1745470\"><span></span><p>The Hellcat's wireless charging pad.</p><p><span></span> Bradley Iger</p></figcaption></figure></li></ul></div><p>Infotainment systems have been a common sight in new passenger vehicles for well over a decade, but many automakers are only now realizing just how important these devices really are. For drivers who have embraced the always-connected lifestyle, it's undoubtedly the vehicle technology they'll directly interact with the most. As such, the features, performance, and user experience provided by these systems can have far-reaching implications for customers' overall impression of their automobiles.</p><p>It's something&nbsp;Stellantis has been well aware of for some time now. Back in 2003, Chrysler Group was the first North American automaker to offer Bluetooth technology in its vehicles, laying the groundwork for what would eventually become Uconnect 1.0.</p><p>In the years since, Uconnect has gone on to become one of the standard-bearers for OEM infotainment. Often at the forefront of emerging connectivity options and software integration, Uconnect has regularly been praised for its <a href=\"https://driving.ca/jeep/auto-news/entertainment/why-we-love-fcas-uconnect-in-jeeps-rams-and-chryslers\">responsive performance</a> and <a href=\"https://media.stellantisnorthamerica.com/newsrelease.do?id=13674&amp;mid=\">robust feature set</a>—both key struggling points for many manufacturers back in infotainment's early years. The Uconnect ecosystem would continue to mature with the launch of 3.0 in 2013 and 4.0 in 2016, the latter being one of the earliest to adopt Apple CarPlay and Android Auto in a wide breadth of vehicles across various market segments.</p><p>Early adoption isn't without its risks, though—something the Uconnect team <a href=\"https://arstechnica.com/information-technology/2015/07/fiat-chrysler-connected-car-bug-lets-hackers-take-over-jeep-remotely/\">learned the hard way</a> in 2015. Hacking still remains an ongoing concern for many motorists, but Stellantis said that it is committed to the safety and security of its vehicles. \"We continue to implement a strong defense-in-depth security strategy to protect our customers and secure our products and enterprise from unauthorized access, including potential cyber attacks,\" it said.</p><p>Uconnect 4 has further evolved in the years since its debut, but the march of progress rests for no one. Iterations like the massive 12.3-inch portrait display available in the <a href=\"https://www.thedrive.com/new-cars/37223/2021-ram-1500-trx-review-this-702-hp-factory-super-truck-is-the-new-king-of-the-hill\">latest Ram 1500 models</a> recently breathed some new life into version 4, but to some degree, it felt like a stop-gap measure for a system that was getting long in the tooth.</p><h2>Android gains another convert</h2><p>Now debuting in the 2021 Dodge Durango and Chrysler Pacifica, Uconnect 5 is perhaps the most comprehensive overhaul in the system's history. From a visual standpoint, there are obvious differences—here in the Durango SRT Hellcat, we have a bonded-glass 10.1-inch widescreen display rather than the 8.4-inch screen available in last year's model. Its TFT touchscreen offers significantly sharper graphics than the outgoing unit, supporting up to 15 million pixels in its 1920x1200 maximum resolution. CarPlay and Android Auto are now wireless, too—a feature that was previously relegated to high-end luxury marques' systems for the most part.</p><p>And rather than working off of a bespoke, piecemeal operating system, version 5 sees Uconnect move over to <a href=\"https://arstechnica.com/gadgets/2017/05/google-brings-android-to-the-car-with-audi-and-volvo/\">Android OS</a> as its backbone. That change necessitated a ground-up approach to the development of this new system, and with it, an opportunity to re-assess its design and functionality. (Stellantis now joins Volvo and Polestar in offering an Android-based infotainment system, with similar migrations underway at General Motors and&nbsp;<a href=\"https://arstechnica.com/cars/2021/02/ford-is-switching-to-android-os-for-infotainment-in-2023/\">Ford</a>&nbsp;(and we believe at Audi, as well.)</p><p>\"One of the big things we wanted to look at was personalization,\" said Vince Galante, Uconnect's chief designer for user experience. \"That's why we implemented the user profile feature—we can take all of that customization that users want to do to the system and make it available to them in one touch. So if your wife uses the car, she can change all of the settings to her preference without it affecting yours at all—one touch and you get it all back.\"</p><p>One of the places where this emphasis on customization is most obvious is Uconnect 5's home screen, which allows you to bring frequently used apps and vehicle functions to the forefront for quicker access.</p><p>\"We had a little bit of that in Uconnect 4,\" Galante&nbsp;said. \"You could customize the bar at the bottom for faster access to SRT Performance Pages, heated seats, things like that. But we wanted to kind of take that to the next level with 5 because there's just so many different choices for content with this system, so we wanted to make sure it was super easy for you get to the stuff you like to use.\" In practice, it means that rather than hunting through a convoluted tree of sub-menus to all of the functions that matter to you, the interface is designed to allow you to put those things front and center and keep them there.</p><p>The version 5 interface also more closely resembles the layout of a contemporary mobile device, offering quick-access shortcuts at the top of the screen as well as customizable widgets that can be integrated into page layouts to, for instance, display media information while also providing one-touch access to navigation functions.</p><h2>We’re going to need a bigger&nbsp;design team</h2><p>\"When we started working on the Uconnect 5 system, we basically tripled the size of our design team because this space is growing so quickly,\" Galante told us. \"And these people aren't just coming in from automotive backgrounds—we've got engineers who have come over from gaming, entertainment, mobile development, and other sectors. We have UX designers that have degrees in psychology. These various skill sets help us to better understand some of the trends that are emerging, and it allows us to get our ideas from a more diverse group of perspectives.\"</p><p>Fast response to inputs is also a critical characteristic of any infotainment system. Lag is not only annoying, it has a tendency to create a cascade of frustration: You press something, wait a second or two. Nothing happens, so you press it again. As the system catches up to the original input, the second input is registered on the following menu in the same location as the first button, and it ends up sending you somewhere else that you never intended to go. Even today, situations like these in OEM infotainment systems are all too common, and they result in a horrible user experience.</p><p>Clearly this issue is on the Uconnect team's radar as well. Boasting five times the processing power of the outgoing system and 6GB of RAM, Uconnect 5 never skipped a beat during our time with it—you press something and the reaction is near-instantaneous. Galante said that as the Uconnect team saw these new features taking shape, they wanted to ensure that they'd have the horsepower to keep pace with the expectations of today's mobile device users while also planning for the future.</p><p>\"We start developing these features years out, so when we spec out the hardware, we always build in enough headroom in terms of processing speed, memory, and storage space so that we can add things down the line,\" Galante said. \"And with Uconnect 5, all of the vehicles are connected, so you're going to see us updating these systems over the air on a regular basis. That allows us to keep it fresh—you're not going to be waiting for the next new model to come out in order to see new features.\"</p><p>As with any new connected device this early in its life span, the initial updates will likely focus on under-the-hood performance improvements and bug fixes, but Galante hinted at the direction he sees development headed. \"One thing that's really exciting right now is how much better voice recognition is becoming,\" he said. \"The Alexa integration in the Uconnect 5 system is better than any voice system we've ever had in our cars, and that is a powerful tool.\"</p><p>Galante also noted that Uconnect 5 is not relegated to just the 10.1-inch widescreen form factor, which paves the way for more specialized implementations in other vehicles in the years to come. \"This system allows for a wide range of different shapes and sizes,\" he said. \"The layout of the screen just comes down to the requirements of a particular vehicle in terms of use-case and packaging—it's often a balance between digital and physical controls. The Uconnect 5 system has been built with the flexibility to go larger, to go to multiple screens, and to change aspect ratios depending on what makes the most sense for that particular vehicle.\"</p><p><em>Listing image by Bradley Iger</em></p></div></div></div>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"daff6479eba7b1f6f95d9343d57d8076505e76338fa448617a6ce157858ac62d","category":"Tech"}