{"title":"Kuo: Apple's Upcoming Mixed Reality Headset to Feature 15 Camera Modules","link":"https://www.macrumors.com/2021/03/09/mixed-reality-headset-15-cameras/","date":1615267512000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/09/mixed-reality-headset-15-cameras/\"><p>Apple's upcoming mixed reality headset will feature a total of 15 optical camera modules, Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> said this evening in a research note obtained by <em>MacRumors</em>.</p><p><img alt=\"apple mixed reality headset mockup feature\" width=\"2006\" height=\"1129\" src=\"https://images.macrumors.com/t/1snRTOSwcSIfzReR9EmOKRpGH2E=/400x0/filters:quality(90)/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg?lossy\" data-src=\"https://images.macrumors.com/t/1snRTOSwcSIfzReR9EmOKRpGH2E=/400x0/filters:quality(90)/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/1snRTOSwcSIfzReR9EmOKRpGH2E=/400x0/filters:quality(90)/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg?lossy 400w,https://images.macrumors.com/t/RhI2m7jUfFlq99gXjpjpB3-o-xk=/800x0/filters:quality(90)/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg?lossy 800w,https://images.macrumors.com/t/JKTjAiE8m3be-AUCV9QoT51aEAw=/1600x0/filters:quality(90)/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg 1600w,https://images.macrumors.com/t/TfA4G4Tv9TvnDHI7Idy_LMff0Rs=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/1snRTOSwcSIfzReR9EmOKRpGH2E=/400x0/filters:quality(90)/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg?lossy 400w,https://images.macrumors.com/t/RhI2m7jUfFlq99gXjpjpB3-o-xk=/800x0/filters:quality(90)/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg?lossy 800w,https://images.macrumors.com/t/JKTjAiE8m3be-AUCV9QoT51aEAw=/1600x0/filters:quality(90)/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg 1600w,https://images.macrumors.com/t/TfA4G4Tv9TvnDHI7Idy_LMff0Rs=/2500x0/filters:no_upscale():quality(90)/article-new/2021/02/apple-mixed-reality-headset-mockup-feature.jpg 2500w\"><br>Eight of the 15 camera modules will be used for see-through augmented reality experiences, six modules will be used for \"innovative biometrics,\" and one camera module will be used for environmental detection. Largan will supply many of the 15 camera lenses.</p><p>Kuo's prediction of the number of cameras expected in the mixed reality headset comes following a report yesterday that shared several details on the device, which Kuo believes <a href=\"https://www.macrumors.com/2021/03/07/kuo-apple-mixed-reality-headset-2022/\">will launch in 2022</a>.</p><p>The headset will be \"portable\" with independent computing power and storage, but not \"mobile\" like an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>. Current prototypes weigh in at 200 to 300 grams, but the final weight may be reduced to 100 to 200 grams should Apple be able to solve technical problems.</p><p>Kuo believes that Apple's mixed reality headset will be significantly lighter than many VR devices on the market, and that it will provide an \"immersive experience that is significantly better than existing VR products.\" Kuo expects the headset to be priced at around $1000, and it will feature high-end micro-OLED displays.</p><p>For more on what we're expecting from the AR/VR headset that Apple has in development, we <a href=\"https://www.macrumors.com/roundup/apple-glasses/\">have a full roundup</a> with all of the rumors we've heard so far. The roundup also has details on the smart glasses that Apple is working on, which will be released after the headset.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/05/apple-watch-series-7-breakthrough-health-feature/\">Apple Watch Series 7 to Gain Breakthrough New Health Feature</a></h3><p>Apple is reportedly planning to bring a new, first-of-its-kind health technology to the Apple Watch Series 7, in what could be a breakthrough for managing conditions such as diabetes more easily. According to a recent report from ETNews, the Apple Watch Series 7 will feature blood glucose monitoring via a non-invasive optical sensor. Measuring blood glucose levels, also known as blood...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/apple-confirms-imac-pro-will-be-discontinued/\">Apple Confirms iMac Pro Will Be Discontinued When Supplies Run Out, Recommends 27-Inch iMac</a></h3><p>Apple on late Friday evening added a \"while supplies last\" notice to its iMac Pro product page worldwide, and removed all upgrade options for the computer, leaving only the standard configuration available to order for now. We've since confirmed with Apple that when supplies run out, the iMac Pro will no longer be available whatsoever. Apple says the latest 27-inch iMac introduced in August...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/top-stories-iphone-13-oled-ipads-macs/\">Top Stories: iPhone 13 Leaks, OLED iPads and Macs, New AirTags Evidence</a></h3><p>iPhone rumors are heating up, with noted analyst Ming-Chi Kuo this week releasing a wide-ranging report outlining his expectations for the iPhone lineup over the next three years. This week also saw rumors about OLED displays potentially coming to iPad and Mac starting next year, increasing signs of AirTags functionality in iOS 14.5 betas, and more, so check out all of the details below! i...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/08/apple-event-march-23-kang/\">Leaker Suggests Apple Event to Be Held on March 23</a></h3><p>Monday March 8, 2021 2:25 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple will hold its first event of the year on March 23, according to information provided by a reputable Chinese leaker (via DuanRui). Apple is expected to launch AirTags, new iPads, and possibly updated AirPods at a spring event, and leaker \"Kang\" believes that date will be March 23. Initial speculation pointed to an event happening on March 16; however, Bloomberg's Mark Gurman shot down...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/08/apple-releases-ios-14-4-1/\">Apple Releases iOS and iPadOS 14.4.1 With Security Fixes</a></h3><p>Monday March 8, 2021 10:01 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today released iOS and iPadOS 14.4.1, minor security updates that comes more than a month after the release of the iOS 14.4 update. The iOS and iPadOS 14.4.1 updates can be downloaded for free and the software is available on all eligible devices over-the-air in the Settings app. To access the new software, go to Settings &gt; General &gt; Software Update. According to Apple's release...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/06/imac-pro-while-supplies-last/\">iMac Pro No Longer Custom Configurable, Available 'While Supplies Last'</a></h3><p>Friday March 5, 2021 10:14 pm PST by <a href=\"https://www.macrumors.com/author/eric-slivka/\" rel=\"author\">Eric Slivka</a></p><p>Apple appears to be on the verge of discontinuing the iMac Pro, with the store page for the high-end all-in-one Mac including a \"While supplies last\" tagline and only the base model with no custom configurations available for purchase. The iMac Pro launched in December 2017, and while there have been a few tweaks to the available configurations over the years, it has received no substantial...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/07/kuo-apple-mixed-reality-headset-2022/\">Kuo: Apple to Launch Mixed Reality Headset in Mid 2022 and Augmented Reality Glasses by 2025</a></h3><p>Apple plans to release its long-rumored mixed reality headset \"in mid-2022,\" followed by augmented reality glasses by 2025, well-regarded analyst Ming-Chi Kuo said today in a research note with TF International Securities, obtained by MacRumors. \"We predict that Apple's MR/AR product roadmap includes three phases: helmet type by 2022, glasses type by 2025, and contact lens type by...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/07/kuo-apple-ar-contact-lenses-2030s/\">Kuo: Apple May Release Augmented Reality Contact Lenses in 2030s</a></h3><p>In a research note shared with MacRumors, analyst Ming-Chi Kuo today predicted that Apple will release augmented reality \"contact lenses\" in the 2030s. Kuo said the lenses will bring electronics from the era of \"visible computing\" to \"invisible computing.\" Mojo Vision smart contact lens Kuo said the lenses are \"unlikely to have independent computing power and storage,\" suggesting that they...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"db0a565979e8451b6db7a6286c20cce286207b25b12bf8368fc214488ded4618","category":"Apple"}