{"title":"Defending Vuelta champ Primož Roglič on stage 1: ‘It was crazy, huh?’","link":"https://cyclingtips.com/2021/08/defending-vuelta-champ-primoz-roglic-on-stage-1-it-was-crazy-huh/","date":1628976520000,"content":"<div><p></p><h4>Primož Roglič (Jumbo-Visma) celebrates stage 1 victory with the first red jersey of the 2021 Vuelta a España.</h4><p></p><div><p>Primož Roglič (Jumbo-Visma) got his Vuelta a España title defence off to a perfect start with victory on the <a href=\"https://cyclingtips.com/2021/08/roglic-takes-the-first-red-jersey-of-the-vuelta-with-stage-1-victory/\">stage 1 time trial</a>.</p><p>“It was crazy, huh?” he said from his turbo trainer after the finish. “Obviously it was enough. I’m super happy and pleased with today’s result.”</p><p>At just 7.1 km, the opening ITT of the Vuelta was a full-gas effort of less than 10 minutes for most of the field. But on a technical course at the end of a scorcher of a day in Burgos, it was no easy feat.</p><p>“Seven kilometres are still super-hard,” Roglič said. “You don’t wish for more when you cross the line. It’s hard. It’s all-out from the start to the finish.”</p><p>The route began with a 2.5 km stretch that was mostly uphill, before a fast descent and a challenging run back to the Catedral de Santa María.</p><p>“I don’t really know the intermediate times, but the fact is we have to go fast from the start uphill, and you also need to come down and survive the corners, and push on the flat.”</p><p>With the stage win, the 2019 and 2020 Vuelta champion also pulls on the familiar red jersey. Should he maintain the race lead through to the end in Santiago de Compostela, he would be the first rider to do so since 1994. These days it’s not unusual for a jersey wearer to hand over the race lead for a few stages, but for now, Roglič means to make the most of it.</p><p>“We will see. It’s a beautiful start, I’m enjoying it, and we hopefully can enjoy it as a team in the upcoming days.”</p></div></div>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"dc449187c127d6e54ffb335b82dd5da9d9f2ededc8bf85bd5304581e3ba22799","category":"Cycling"}