{"title":"Tour of Flanders 2021 Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-2021-preview","date":1615565872000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p><span>The Tour of Flanders, or Ronde van Vlaanderen, is one of the most&nbsp;anticipated races of the year. Some of Flanders’ most challenging cobbled climbs await the riders on <strong>Sunday 4th April.</strong> The race returns to it’s more familiar slot on the calendar, one week before Paris-Roubaix.</span></p><div><form novalidate=\"\" isembed=\"true\" tabindex=\"-1\"><div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div><div data-gramm=\"false\" contenteditable=\"false\" component=\"[object Object]\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><span>Did you notice there is no advertising on Rouleur.cc?&nbsp;</span></p><p><span>While it's free to read our content, it isn't free to produce it. Consider supporting cycling journalism by subscribing to Rouleur or buying from the Rouleur Desire Emporium. Thank you</span></p></div><div component=\"[object Object]\" alignment=\"center\" formcomponentstyling=\"[object Object]\" data-testid=\"form-row\" formcomponenttheme=\"[object Object]\"><p><img imageratio=\"0.008333333333333333\" src=\"https://d3k81ch9hvuctc.cloudfront.net/company/JQVLkV/images/92cf782c-a79d-4080-a0a0-9b006716be2d.png\" tabindex=\"-1\"></p></div></div></form></div><p><span>Like all of cycling’s Monuments, the Tour of Flanders is etched deep&nbsp;into cycling's history — the first edition occurred in 1913. No rider has won the race more than three times, with six achieving that feat.</span></p><p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related – The 2021 Men's Early Season: The Rouleur Racing Guide</a>&nbsp;<br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">Related –&nbsp;</a></strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\"><strong><span>The Women's 2021 Early Season: The Rouleur Racing Guide</span></strong></a></em></p><p><span>The Men’s 2020 edition was set to be one of the most anticipated three-way battles in recent times, with Mathieu van der Poel, Wout Van Aert and Julian Alaphilippe duking it out. However, three were reduced to two when Alaphilippe collided with a moto. </span><span>The two crested the Paterberg, the final cobbled effort of the day with a healthy lead which prove&nbsp;unassailable for the rest. </span><span>In the end, Mathieu van der Poel narrowly sprinted to victory ahead of Van Aert to claim his first Monument on the road. The first of many, we suspect.</span></p><p><span>The first kilometres of the race are typically used to establish a breakaway. However, soon enough the riders will reach a plethora of cobbled climbs.</span></p><p><span>We are without the official route for the 2021 edition due to the global pandemic.&nbsp;</span></p><p><span>Nonetheless, we can expect a similar course to 2020. Here, we witnessed numerous ascents of the Oude Kwaremont. The first ascent, which occurs with 120km remaining, has the potential to be the first serious selection process of the day.&nbsp;</span></p><p><span>The Paterberg and Taaienberg are two more climbs synonymous with the Flanders Classics which will be ridden here.</span></p><p><span>Following the final climb of the day which is the Paterberg, there are 13km of flat to the finish in Oudenaarde, where we could see attacks go off the front or reeled in for a sprint.</span></p><h4><b>Contenders</b></h4><p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032615-255_1024x1024.jpg?v=1615478780\" alt=\"Van Aert and Van der Poel\"></b><span><i>Mathieu van der Poel and Wout Van Aert in the 2020 edition of the Tour of Flanders (Image credit: </i><i>CorVos/SWpix)</i></span></p><p><span>The story starts with Wout Van Aert and Mathieu van der Poel. They entered as the two predominant&nbsp;protagonists last year and delivered – going to the line side-by-side. We mean that literally. The two could hardly be separated and as they crossed the line, neither knew for sure who had won. It was a battle of the titans and we are all for seeing a re-match this season.</span></p><p><span>Their sprinting ability is an interesting topic — who is stronger? Wout Van Aert has won mass-sprints before, he won stage one of Tirreno-Adriatico ahead of Caleb Ewan earlier this season. On the other hand, Van der Poel often rides for his teammate Tim Merlier when it comes to a mass sprint. On paper, this suggests that Van Aert is more confident in his sprint finish, yet it was Van der Poel who led-out and defeated Van Aert last season.</span><span>&nbsp;The two are very evenly matched in this regard, and should it come down to a sprint between the two this year, it'd be difficult to call the winner.</span></p><p><span>It could have been three, though. Alaphilippe was desperately unlucky to crash out after looking supremely strong on the Taaienberg to move clear with VDP and WVA. Of the three outfront, the world champion would’ve felt less comfortable in a sprint, although he too has won sprints before. Nonetheless, Alaphilippe can take a lot of confidence from his debut at De Ronde. He’ll be back for revenge this season.</span></p><p><span>As always, he’ll be backed up by a Deceuninck-Quick-Step team with exceptional depth. Among them: Yves Lampaert, <span>Zdeněk Štybar</span>, Kasper Asgreen and <span>Florian Sénéchal</span>. The tactical flexibility of having riders that can attack to victory or work for Alaphilippe is&nbsp;invaluable.</span></p><p><span>Led by Jakob Fuglsang, Astana Premier-Tech enter De Ronde in 2021 with intrigue. The Dane has only ridden the race once in his career to this point where he finished 25th in 2016, though he was working for his Astana teammate Lars Boom who was more established on the cobbles at that stage of their respective careers.&nbsp;</span></p><p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-changing-approach-to-grand-tour-racing\" target=\"_blank\" rel=\"noopener noreferrer\"><span><em><strong>Related – Ditch The GC: Why Teams are Giving up on the Battle for the Podium<br></strong></em></span></a></p><p><span>When speaking before the season, Fuglsang examined his chances at the Tour of Flanders, “I believe I have what it takes to be up there. Anything can happen. I’ve shown before riding in the Tour de France that I am capable on the cobbles. I think that Flanders is one of the classics where you can win it as a climber or a more pure cobble classic guy”.</span></p><p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_7369_1024x1024.jpg?v=1615481724\" alt=\"Jakob Fuglsang\"></span></p><p><em><span>Jakob Fuglsang (Image credit: Alex Broadway/ASO/SWpix)</span></em></p><p><span>Michael Matthews is perhaps one of the most accomplished riders in the peloton that is yet to claim a Monument. In sixteen attempts, Matthews has five top-10s in Monuments which he’s gained at Milan-San Remo, Liege-Bastogne-Liege and the Tour of Flanders. He’s only been on the Flanders startline once in his career, he managed sixth-place in 2019. If Matthews can tackle the likes of the Oude Kwaremont and the Paterberg whilst staying at the sharp end of the race, he’ll be one of the premier favourites in the sprint.</span></p><p><span>Albert Bettiol hasn’t started his 2021 campaign in red-hot form, he’d have been somewhat downbeat with his performance at Strade Bianche. However, Bettiol has garnered a reputation for doing well at de Ronde. He won in 2019 after perhaps being underestimated by his competitors and was in the second group last year, following WVA and VDP. Don’t count him out.</span></p><p><span>Although their squad doesn’t include any key favourites, Groupama-FDJ feature some interesting options. Stefan Kung is perhaps their leader, although he would need to go clear as he isn’t the quickest and has never been in the top-40 at De Ronde. Kevin Geniets has developed into a superb young classics rider. Still just 24, Geniets was top-10 at Omloop and was also strong at Strade this year. The French team also have Valentin Madouas in their ranks, he was was top-15 in his Tour of Flanders debut last season. Let’s not forget young Jake Stewart. He was second at Omloop het Nieuwsblad earlier this season, proving he’s more than capable on the cobbles and in a bunch finish.</span></p><p><b>Favourites:</b><span> Wout Van Aert, Julian Alaphilippe, Mathieu van der Poel</span></p><p><b>Outsiders: </b><span>Jakob Fuglsang, Arjen Livyns, Michael Matthews, Valentin Madouas</span></p><p><span>Cover image:&nbsp;</span><i><span>Image credit: </span></i><i><span>CorVos/SWpix</span></i></p></div></div>","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"dc5d2dae1a4d3cf6ca563c61741848e61ab901ce864a10c54f1328ea6bfc2349","category":"Cycling"}