{"title":"New malware found on 30,000 Macs has security pros stumped","link":"https://arstechnica.com/?p=1744063","date":1613833813000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>MAC MYSTERY —</h4><h2 itemprop=\"description\">With no payload, analysts are struggling to learn what this mature malware does.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/mac-800x534.jpg\" alt=\"Close-up photograph of Mac keyboard and toolbar.\"><figcaption></figcaption></figure><p>A previously undetected piece of malware found on almost 30,000 Macs worldwide is generating intrigue in security circles, which are still trying to understand precisely what it does and what purpose its self-destruct capability serves.</p><p>Once an hour, infected Macs check a control server to see if there are any new commands the malware should run or binaries to execute. So far, however, researchers have yet to observe delivery of any payload on any of the infected 30,000 machines, leaving the malware’s ultimate goal unknown. The lack of a final payload suggests that the malware may spring into action once an unknown condition is met.</p><p>Also curious, the malware comes with a mechanism to completely remove itself, a capability that’s typically reserved for high-stealth operations. So far, though, there are no signs the self-destruct feature has been used, raising the question why the mechanism exists.</p><p>Besides those questions, the malware is notable for a version that runs natively on the M1 chip that Apple introduced in November, making it only the second known piece of macOS malware to do so. The malicious binary is more mysterious still, because it uses the macOS Installer JavaScript API to execute commands. That makes it hard to analyze installation package contents or the way that package uses the JavaScript commands.</p><p>The malware has been found in 153 countries with detections concentrated in the US, UK, Canada, France, and Germany. Its use of Amazon Web Services and the Akamai content delivery network ensures the command infrastructure works reliably and also makes blocking the servers harder. Researchers from Red Canary, the security firm that discovered the malware, are calling the malware Silver Sparrow.</p><h2>Reasonably serious threat</h2><p>“Though we haven’t observed Silver Sparrow delivering additional malicious payloads yet, its forward-looking M1 chip compatibility, global reach, relatively high infection rate, and operational maturity suggest Silver Sparrow is a reasonably serious threat, uniquely positioned to deliver a potentially impactful payload at a moment’s notice,” Red Canary researchers wrote in a <a href=\"https://redcanary.com/blog/clipping-silver-sparrows-wings/\">blog post</a> published on Friday. “Given these causes for concern, in the spirit of transparency, we wanted to share everything we know with the broader infosec industry sooner rather than later.”</p><p>Silver Sparrow comes in two versions—one with a binary in <a href=\"https://en.wikipedia.org/wiki/Mach-O\">mach-object</a> format compiled for Intel x86_64 processors and the other Mach-O binary for the M1. The image below offers a high-level overview of the two versions:</p><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/silver-sparrow-overview.jpg\" data-height=\"619\" data-width=\"1238\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/silver-sparrow-overview-640x320.jpg\" width=\"640\" height=\"320\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/silver-sparrow-overview.jpg 2x\"></a><figcaption><p>Red Canary</p></figcaption></figure><p>So far, researchers haven’t seen either binary do much of anything, prompting the researchers to refer to them as “bystander binaries.” Curiously, when executed, the x86_64 binary displays the words “Hello World!” while the M1 binary reads “You did it!” The researchers suspect the files are placeholders to give the installer something to distribute content outside the JavaScript execution.</p><p>Silver Sparrow is only the second piece of malware to contain code that runs natively on Apple’s new M1 chip. An adware sample <a href=\"https://arstechnica.com/gadgets/2021/02/apple-m1-native-malware-has-already-begun-to-appear/\">reported earlier this week</a> was the first. Native M1 code runs with greater speed and reliability on the new platform than x86_64 code does because the former doesn’t have to be translated before being executed. Many developers of legitimate macOS apps still haven’t completed the process of recompiling their code for the M1. Silver Sparrow’s M1 version suggests its developers are ahead of the curve.</p><p>Once installed, Silver Sparrow searches for the URL the installer package was downloaded from, most likely so the malware operators will know which distribution channels are most successful. In that regard, Silver Sparrow resembles previously seen macOS adware. It remains unclear precisely how or where the malware is being distributed, though the URL check suggests that malicious search results may be at least one channel.</p><p>Among the most impressive things about Silver Sparrow is the number of Macs it has infected. Red Canary researchers worked with their counterparts at Malwarebytes, with the latter group finding Silver Sparrow installed on 29,139 macOS endpoints as of Wednesday. That’s a significant achievement.</p><p>“To me, the most notable [thing] is that it was found on almost 30K macOS endpoints... and these are only endpoints the MalwareBytes can see, so the number is likely way higher,” Patrick Wardle, a macOS security expert at enterprise software maker Jamf wrote in an Internet message. “That’s pretty widespread... and yet again shows the macOS malware is becoming ever more pervasive and commonplace, despite Apple’s best efforts.”</p><p>For those who want to check if they're Mac has been infected, Red Canary provides indicators of compromise at the end of its report.</p></div></div>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dcbda7f4ce272bd34b0578d2dab1d711bbbcbb446156a5f63916752476e26906","category":"Tech"}