{"title":"Developers to update GTA Online to address poor load times after community fix","link":"https://arstechnica.com/?p=1749918","date":1615904924000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>rockstar coding indeed —</h4><h2 itemprop=\"description\">Rockstar acknowledges t0st’s patch fixes issue, then pays out a $10k bug bounty.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/gta-online-logo-800x500.jpg\" alt=\"Now you can do all of these things <em>but faster</em>.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/gta-online-logo.jpg\" data-height=\"2400\" data-width=\"3840\">Enlarge</a> <span>/</span> Now you can do all of these things <em>but faster</em>.</p><p>Rockstar Games</p></figcaption></figure><p>A couple of weeks ago, we reported that a <em>Grand Theft Auto Online</em> player sick of the game’s notoriously long load times took matters into his own hands, broke out the disassembler, and crafted his own fix. The long load times were due to the inefficient way that the <em>GTA Online</em> developers chose to parse and then sort the data in a large multi-megabyte JSON file.</p><p>The fix—created by a coder known as <a href=\"https://arstechnica.com/gaming/2021/03/developers-to-update-gta-online-to-address-poor-load-times-after-community-fix/%E2%80%9Chttps://nee.lv/2021/02/28/How-I-cut-GTA-Online-loading-times-by-70/%E2%80%9C\">t0st</a>—resulted in a 70-ish percent decrease in loading times, going by t0st’s own informal benchmarks. For players suffering from the JSON parsing issue, this means that they only have to wait perhaps one or two minutes to enter a <em>GTA Online</em> game, rather than the six-plus minutes they were previously stuck watching the loading screen.</p><p>In the two weeks since t0st’s fix was made public, <em>GTA Online</em> developer Rockstar got in contact with t0st and acknowledged that t0st had indeed fixed a legitimate issue with the game and that he’d be receiving a $10,000 payment under Rockstar’s bug bounty program.</p><p>According to <a href=\"https://arstechnica.com/gaming/2021/03/developers-to-update-gta-online-to-address-poor-load-times-after-community-fix/%E2%80%9Chttps://www.pcgamer.com/rockstar-thanks-gta-online-player-who-fixed-poor-load-times-official-update-coming/%E2%80%9C\">PC Gamer</a>, Rockstar communicated the following in a statement:</p><blockquote><p>After a thorough investigation, we can confirm that player t0st did, in fact, reveal an aspect of the game code related to load times for the PC version of GTA Online that could be improved. As a result of these investigations, we have made some changes that will be implemented in a forthcoming title update.</p></blockquote><p>There is no timeframe on when that “forthcoming title update” will be released, but in his original write-up of his fix, t0st explained that the core JSON parsing and storing problem “shouldn’t take more than a day for a single dev to solve.”</p></div></div>","author":"Lee Hutchinson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"dd6d95eed0482ee6e65047d0d4a8318bcd84941a5a681bd0e28d99c8cdfa71f1","category":"Tech"}