{"title":"Spotlight: Maxima Matte Finish Cleaner review","link":"https://cyclingtips.com/2021/04/spotlight-maxima-matte-finish-cleaner-review/","date":1618450260000,"content":"<div><div><p>I mentioned Maxima’s Matte Finish cleaner in a recent <a href=\"https://cyclingtips.com/2021/02/nerd-alert-podcast-making-sense-of-the-latest-tech-chaos/\" target=\"_blank\">Nerd Alert podcast episode</a>. It’s a product I’ve found fantastic for increasingly common matte paint finishes. Given the interest received, I figured I’d do a quick review of the product that comes from an American company best known in the two-wheeled moto world.</p><p>The Matte Finish cleaner is exactly as the name describes. It’s a water-based clear liquid that’s designed to give a streak-free finish on matte paint finishes that have a habit of showing dust, streaks, smudges, fingerprints and even water splatter. </p><p>According to a representative from Maxima, this product is intended to clean lightly soiled or dusty surfaces and leave behind a dry non-glossy surface. And in my experience it’s great for a final wipe over the frame after a wash, too. </p><p>This has fast become my go-to for wiping down frames with matte paint, and the results are quite remarkable compared to the usual streaky finish I’m used to seeing with many all-purpose cleaners. And so far the 473 ml (16 oz) spray bottle has gone surprisingly far. </p><p>It’s worth noting that I’m also a fan of Maxima’s SC1 Bike Polish spray, but the Matte Cleaner serves a different role. The SC1 (now available in a non-aerosol form, yay!) remains a great pick for adding a final shine to gloss paint, but the Matte Finish cleaner is noticeably superior for its intended task. And while SC1 is perhaps most famous for the strawberry bubblegum smell it leaves behind, the Matte Finish is noticeably void of scent.</p><p>Perhaps my favourite part of the Matte Finish Cleaner is that it’s non-toxic, biodegradable, non-flammable and safe to use on almost all surfaces. It’s not the only matte finish cleaner on the market, but I haven’t been motivated to buy all the others given how well this one works. </p><p><strong>Price:</strong> US$11 / AU$23<br><strong>More info:</strong> <a href=\"https://maximausa.com/i-30498354-matte-finish-cleaner.html?locale=en\" target=\"_blank\">maximausa.com</a></p><div><p><em>Follow the link to see previous products we’ve reviewed in our <a href=\"https://cyclingtips.com/tag/spotlight/%E2%80%9D\" target=\"“_blank”\">Spotlight series</a>.</em></p></div></div></div>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"df9c91a6d520db638463861caf3771a67841b5d70f8db1e510bf691d21dce54c","category":"Cycling"}