{"title":"Fab fires and drought threaten to make chip shortages worse","link":"https://arstechnica.com/?p=1751897","date":1616600523000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Chips may get chopped —</h4><h2 itemprop=\"description\">Back-to-back incidents threaten to further strain already tight chip supplies.</h2></div><div itemprop=\"articleBody\"><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/20121008_130946_53A_6727.jpg\" data-height=\"2000\" data-width=\"3000\" alt=\"A significant portion of the Micron fab is bathed in yellow light to protect the light-sensitive coating on the wafers. Chips on the wafers are created using a photographic process. Each of the cameras, which are the machines on each side of the aisle, costs about $70 million.\"><img alt=\"A significant portion of the Micron fab is bathed in yellow light to protect the light-sensitive coating on the wafers. Chips on the wafers are created using a photographic process. Each of the cameras, which are the machines on each side of the aisle, costs about $70 million.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/20121008_130946_53A_6727-980x653.jpg\" width=\"980\" height=\"653\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/20121008_130946_53A_6727.jpg\" data-height=\"2000\" data-width=\"3000\">Enlarge</a> <span>/</span> A significant portion of the Micron fab is bathed in yellow light to protect the light-sensitive coating on the wafers. Chips on the wafers are created using a photographic process. Each of the cameras, which are the machines on each side of the aisle, costs about $70 million.</p><p>Micron</p></figcaption></figure><p>Semiconductor supply chains have not been having a good year. Shifts in demand brought on by COVID-19 have slammed into a series of fab and factory fires, the effects of which have been cascading throughout the global economy. Now, the semiconductor industry is being threatened by Taiwan’s worst drought in 67 years.</p><p>Chip shortages have rippled through various industries in recent months. Automakers have cut back production, citing supply issues. <a href=\"https://arstechnica.com/cars/2021/02/a-silicon-chip-shortage-is-causing-automakers-to-idle-their-factories/\">Automotive shortages</a> are somewhat of the industry’s own making—when the pandemic hit over a year ago, automakers cut production and chip orders. Meanwhile, demand for consumer electronics surged, snapping up excess fab capacity. When car and truck sales rebounded months later, semiconductor manufacturers had no slack to meet demand. Recently, even <a href=\"https://arstechnica.com/gadgets/2021/03/qualcomm-smartphones-are-the-next-to-get-hit-by-the-global-chip-shortage/\">consumer electronics</a> companies have been finding it hard to secure a steady supply of chips for their products.</p><p>Taiwan’s drought began when typhoons failed to make landfall last year. Today, drought conditions cover a significant portion of the densely populated western third of Taiwan, extending from Hsinchu south to Kaohsiung, an arcing span of more than 150 miles on an island that’s only about 240 miles long. Water levels in major reservoirs have been as low as 10 percent of their capacity, and they’re currently being stabilized by water piped in from Taipei, which has so far avoided the worst of the drought.</p><p>Semiconductor companies TSMC and Micron have major chipmaking operations in the affected regions, which include two large science parks that will have their water supplies trimmed by 15 percent starting on April 4. TSMC says it recycles 85 percent of the water it uses, yet it still requires 41 million gallons of water per day. The company says it will increasingly rely on tanker trucks to maintain operations.<span>&nbsp;</span></p><p>The problem isn’t limited to TSMC. All semiconductor fabs consume massive amounts of water. For the last 17 years, starting with the 90 nm node, the industry has been making chips using immersion lithography, which uses water to sharpen the resolution of the 193 nm ultraviolet light used to create features. Even today’s leading edge 5 nm nodes rely in part on immersion lithography, <a href=\"https://en.wikichip.org/wiki/5_nm_lithography_process\">according to WikiChip</a>. Elsewhere in the fab, water is used to wash wafers and cool equipment. For manufacturers, fresh water supply is so important that “fabs located in water-stress regions often perceive water security as one of the primary risk factors to the companies’ sustainability,” according to a <a href=\"https://www.sciencedirect.com/science/article/pii/S2588912518300316\">2018 study</a>.</p><p>If conditions in Taiwan don’t improve, starting on April 6, about one million households in two regions will have to go without running water two days per week. On those days, tankers will be sent to supply people who need water and cannot wait for it to be turned back on.</p><p>Drought conditions on the island are so dire that the Taiwanese government is hoping that several typhoons will hit the country in the coming months.</p><h2>Meanwhile, in Japan</h2><p>Taiwan’s semiconductor industry isn’t the only one beset by disaster. Semiconductor shortages have been exacerbated by problems in Japan, which mostly involve fires at various facilities. Last Friday, a blaze <a href=\"https://www.wsj.com/articles/renesas-chip-plant-fire-spreads-concerns-about-global-auto-production-11616414181\">ripped through a plant</a> owned by a subsidiary of Renesas Electronics. The fire was sparked by an electrical malfunction in a single piece of plating equipment and destroyed 5 percent of the clean room while contaminating other areas. Renesas expects it will take at least a month to bring the damaged 300 mm line back into production.</p><p>The auto industry is going to be hard-hit by the incident. At the building affected by the fire, two-thirds of the chips were being made for automotive customers.<span>&nbsp;</span></p><p>Before the Renesas fire, output from Japan’s semiconductor industry had already been dented by two other fires <a href=\"https://hbr.org/2021/02/why-were-in-the-midst-of-a-global-semiconductor-shortage\">earlier this year</a>. One occurred in July at a plant that produces a substrate used to make printed circuit boards. That substrate was reportedly already in short supply. The other happened in October at a plant run by Asahi Kasei Microdevices, a company that sells chips to the automotive industry that are used in collision avoidance systems, among others. Renesas had <a href=\"https://asia.nikkei.com/Business/Tech/Semiconductors/Japan-s-Renesas-steps-in-to-ease-automotive-chip-shortage\">announced in January</a> that it would use some of its capacity to alleviate any shortfall by producing Asahi Kasei’s chips in its own fabs. It’s unclear if those plans have been affected by Friday’s fire.</p><p><em>Listing image by Micron</em></p></div></div>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e0c06f781f4d7e92dab54705b902571f3d2973d3022ec482154bbae8af685e37","category":"Tech"}