{"title":"Elia Viviani signs a three-year deal with the Ineos Grenadiers","link":"https://cyclingtips.com/2021/11/elia-viviani-signs-a-three-year-deal-with-the-ineos-grenadiers/","date":1635802975000,"content":"<div><div><p>Elia Viviani has signed a three-year deal to join the Ineos Grenadiers in a move that will see the veteran sprinter rejoin the organization he rode for from 2015 to 2017.</p><p>“From the moment I left the team, I had in my head that one day I would come back – and now that day has come and I couldn’t be happier,” Viviani said in a team press release.</p><p>“In my years away, I’ve never lost contact with the team – with Dave [Brailsford], Rod [Ellingworth], and with the Italian riders and coaches. I am really good friends with lots of the team members and especially Dave. I never missed an opportunity to speak with him at races about cycling, my team, my season, and this team. This feels like coming back to a family for me.”</p><p>The 32-year-old Italian has been with Cofidis since 2020, having joined the French squad in its inaugural WorldTour season after two years with Deceuninck-QuickStep. An Olympic gold medalist in the Omnium on the track, Viviani has won stages across all three Grand Tours, with one stage victory at the Tour de France, three at the Vuelta a España, and five at the Giro d’Italia, where he has won a points classification title as well.</p><p>Viviani’s palmares also includes numerous WorldTour one-day wins; he won three straight editions of the Cyclassics Hamburg in addition to one edition each of the Bretagne Classic, the RideLondon-Surrey Classic, and the Cadel Evans Great Ocean Road Race.</p><p>Top-division results have been harder to come by for Viviani since he joined Cofidis, but he took a number of victories in lower-level races this season.</p><p>At the Ineos Grenadiers, Viviani should have plenty of opportunities to add to his win tally in the sprints. He also noted in a team press release that he will continue to focus on his Olympic goals as he rejoins the organization.</p><p>“My deal takes me to Paris 2024. I realized how important the Olympics are to me this year and I am privileged to be in a team that will support me. I look at how Filippo [Ganna] was able to perform on the road for the team this year and on the track in Tokyo. I also remember Rio 2016 like it was yesterday, and how the team helped me then too. That Gold medal also partly belonged to this team,” he said.</p><p>“I’ve had a tough two years and the Olympics gave me back what I’ve missed – the legs, confidence, conviction and belief in myself. My Bronze medal this year has given me the belief to step up to my level again.</p><p>“I think this is the best place for me to be at this stage in my career. I’ve done everything I can to come back and I feel proud as a person that I left on good terms and left something good here. Now that’s paid off.”</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e1399f5e44a6cc2407ef2ff4ffc067f46ace8b240d2c2fec1348f3cdc69c2cce","category":"Cycling"}