{"title":"Women who found freedom riding bikes in Afghanistan are burning their cycling gear","link":"https://cyclingtips.com/2021/08/women-who-found-freedom-riding-bikes-in-afghanistan-are-burning-their-cycling-gear/","date":1629402684000,"content":"<div><div><p>As the Taliban reclaims Afghanistan, the rights and freedoms of the country’s women are vanishing far more quickly than they arrived.</p><p>Shannon Galpin has spent the past thirteen years working and cycling alongside Afghan women in a post-Taliban, war-torn Afghanistan. In early 2021, however, Galpin and her colleagues began to sense that things were heading in the wrong direction. “We all saw this happening,” she says of the recent Taliban offensive. “Which is why it’s infuriating that the government leaders would be so shocked. It’s not shocking, we’ve been calling for this, and having conversations back in April, when the [US military] pullout was announced that women’s rights would be on the front line of this.” </p><p>In the past month, the Taliban have swept across Afghanistan, claiming swaths of the country, and, in the last week, the capital Kabul. This spells disaster for the rights of Afghan women. “This is not unexpected or new,” says Galpin. “It’s devastating that this level of chaos was preventable. And so now it’s literally a citizen movement to rescue Afghans.” </p><p>To paint a picture of the Taliban’s approach to women’s rights, an article on the website Human Rights Watch written by the organisation interim co-director of the Women’s Rights Division, Heather Barr, reads: “The world saw when they ruled from 1996 to 2001, how close to the fringe the Taliban views were on what Islam permitted. They <a href=\"https://www.hrw.org/report/2020/06/30/you-have-no-right-complain/education-social-restrictions-and-justice-taliban-held\">banned almost all education for women and girls</a>, imposed punishments including stoning, lashing, and amputation, and <a href=\"https://gandhara.rferl.org/a/taliban-repression-afghan-women/31358597.html\">confined women to their homes</a> unless they were escorted by a male family member, denying them access to most employment — or even a walk.”</p><p>Yesterday, Galpin posted a screenshot of a message from one of the cyclists she had been working with in Afghanistan on her Instagram page. In it, the anonymous woman detailed the sense of fear and desperation to flee the country in the face of Taliban rule. For a woman, being found to practice cycling could come with devastating consequences and Galpin’s contact reveals: “I hid in my friend’s house and I burned all my bicycle accessories and bicycle clothes.” </p><blockquote></blockquote><p>Galpin and her colleagues spent over a decade working with women in Afghanistan to rebuild and regain their autonomy and rights through the medium of sport. As of 2020, there were seven women’s racing teams in the country and hundreds of women were reaping the benefits of being able to use a bike for transport as well as sport. “We went from a handful of women cycling in 2011,” says Galpin. “2013 is when I started supporting and training and working with them. And now literally a decade later we had women racing in Afghanistan. We had seven provincial teams, multiple bike clubs, and so supporting the sport helped to normalise bikes as a mode of social access.”</p><p>In the space of just over a decade, the progress made started to reshape how women riding bikes was perceived in the country: “it really was the final taboo in Afghanistan,” says Galpin. “And we saw men and boys supporting the women who are biking. If we had had another 10 years of women on bikes that would have become normal.”</p><p>The story of the women Galpin worked with was made into a 2018 documentary Afghan Cycles and she hopes that the support and attention that the work to get women on bikes received will now extend to supporting the same women to flee a dangerous situation: “I’ve been to Afghanistan over 25 times since 2008, and have worked across the country and have watched as the world’s perception of Afghanistan began to change, and support Afghan women,” she says. “Right now, I feel like if we are so willing to leave Afghan women behind and abandon them, that to me shows how little women’s rights has come in the world.”</p><p>Instead of helping these women achieve freedom through cycling, Galpin is now part of an effort to help those same women flee the country that is now back under Taliban rule. </p><p>For those on the ground, the Taliban’s party line that women will still be allowed freedoms “within Islamic law” doesn’t wash, and there are already signs that the group are imposing strict Sharia Law in provinces around the country. “The Taliban are very media savvy,” says Galpin. “They understand that the world is watching Kabul right now because of the chaos of the airport and the evacuations and that being the main conduit out. But they have already shown in all of the provinces that they have not changed. They are marrying off young girls to their commanders, they’re pulling women out of their workplace and telling them they cannot go back. They’re enforcing the burqa.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/afghanistan-women-cycling-1-of-1-1340x893.jpg\"><figcaption>KABUL, AFGHANISTAN – JULY 19: Afghan women cyclists ride during the International Day against drug and the week of National Mobilization Commemoration event in Kabul, Afghanistan on July 19, 2016. (Photo by Haroon Sabawoon/Anadolu Agency/Getty Images)</figcaption></figure><p>Galpin is working with other women in the cycling industry to set up a collective movement to support the plight of some 150 women they are hoping to help evacuate from the country. “We need pressure in every country that has been involved in Afghanistan to call for direct evacuations. And to push their country to accept Afghan refugees,” Galpin says. “We can get people. We can resettle refugees. This is our responsibility, particularly in the United States, who has been involved in Afghanistan militarily for 40 years…and that ripple effect means that four decades of war have been laid at the feet of Afghan women.” </p><p>Meanwhile, her plea to the cycling community is thus: “Don’t look away, don’t get distracted. That’s what they’re counting on.” </p><p>“We’ve seen this first generation of women become cyclists. And they did it, not just because of sport, they did it because cycling is freedom of mobility, cycling is access. And so when I speak about bikes being a tool for social justice, I am looking right at the Afghan women, I’m looking at women who are using bikes, to challenge the gender barrier to have the same freedom of mobility that their fathers and brothers have.” </p></div></div>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e1730dcd4234623320da0a080254f7af41d812c38924df3ed32cbdf859c89721","category":"Cycling"}