{"title":"Apple Says COVID 'Health Pass' Apps Are Limited to Developers Working With Public Health Authorities","link":"https://www.macrumors.com/2021/02/16/apple-health-pass-apps-limited-public-health/","date":1613520221000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/16/apple-health-pass-apps-limited-public-health/\"><p>Apple today <a href=\"https://developer.apple.com/news/?id=l9sdah8l\">informed developers</a> that \"health pass\" apps can only be submitted by developers that are working with recognized public health authorities.</p><p><img alt=\"apple developer banner\" width=\"1024\" height=\"572\" src=\"https://images.macrumors.com/t/uO4DwXKjjWDkEv6yue0clBCfs6g=/400x0/filters:quality(90)/article-new/2020/09/apple-developer-banner.jpeg?lossy\" data-src=\"https://images.macrumors.com/t/uO4DwXKjjWDkEv6yue0clBCfs6g=/400x0/filters:quality(90)/article-new/2020/09/apple-developer-banner.jpeg?lossy\" data-srcset=\"https://images.macrumors.com/t/uO4DwXKjjWDkEv6yue0clBCfs6g=/400x0/filters:quality(90)/article-new/2020/09/apple-developer-banner.jpeg?lossy 400w,https://images.macrumors.com/t/Lr7ZoEztm8oqFvEUI4Jp0wjlYCU=/800x0/filters:quality(90)/article-new/2020/09/apple-developer-banner.jpeg?lossy 800w,https://images.macrumors.com/t/7K9cTrTBsckV2xAxj8ZkVr1f2w0=/1600x0/filters:quality(90)/article-new/2020/09/apple-developer-banner.jpeg 1600w,https://images.macrumors.com/t/F0lB1HSxnuMxd8CUELoBrqk9RBM=/2500x0/filters:no_upscale():quality(90)/article-new/2020/09/apple-developer-banner.jpeg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/uO4DwXKjjWDkEv6yue0clBCfs6g=/400x0/filters:quality(90)/article-new/2020/09/apple-developer-banner.jpeg?lossy 400w,https://images.macrumors.com/t/Lr7ZoEztm8oqFvEUI4Jp0wjlYCU=/800x0/filters:quality(90)/article-new/2020/09/apple-developer-banner.jpeg?lossy 800w,https://images.macrumors.com/t/7K9cTrTBsckV2xAxj8ZkVr1f2w0=/1600x0/filters:quality(90)/article-new/2020/09/apple-developer-banner.jpeg 1600w,https://images.macrumors.com/t/F0lB1HSxnuMxd8CUELoBrqk9RBM=/2500x0/filters:no_upscale():quality(90)/article-new/2020/09/apple-developer-banner.jpeg 2500w\"><br>A \"health pass\" app is classified as an app that generates a pass that's used to enter buildings and access in-person services based on testing and vaccination records.</p><p>Apple says that to make sure these apps are responsibly handling sensitive data and providing reliable functionality, they're being limited to developers work with test kit manufacturers, laboratories, and healthcare providers.</p><blockquote><p>With the recent release of COVID-19 vaccines, we've seen an increase in apps that generate health passes used to enter buildings and access in-person services based on testing and vaccination records. To ensure these apps responsibly handle sensitive data and provide reliable functionality, they must be submitted by developers working with entities recognized by public health authorities, such as test kit manufacturers, laboratories, or healthcare providers. As with other apps related to COVID-19, we also accept apps submitted directly by government, medical, and other credentialed institutions.</p></blockquote><p>Apple has been <a href=\"https://www.macrumors.com/2020/03/14/apple-reputable-covid-19-apps-only/\">restricting COVID 19-related apps</a> since March. Apps providing data on COVID must be submitted by developers working with recognized entities such as government organizations, health-focused NGOs, companies deeply credentialed in health issues, and medical or educational institutions. Apple does not allow COVID 19-themed entertainment or game apps, nor any other app not submitted by a qualified developer.</p><p><small>Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our <a href=\"https://forums.macrumors.com/forums/political-news.218/\">Political News</a> forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.</small></p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/14/heart-month-activity-challenge/\">Apple's Heart Month Activity Challenge Requires 60 Minutes of Exercise on Valentine's Day</a></h3><p>Saturday February 13, 2021 10:15 pm PST by <a href=\"https://www.macrumors.com/author/frank-mcshan/\" rel=\"author\">Frank McShan</a></p><p>Today only, Apple Watch owners can complete a new Apple Watch activity challenge in celebration of Heart Month, which is aimed at promoting cardiovascular health. The challenge, which is listed in the Fitness app on the iPhone, tasks users with earning 60 minutes on their Exercise ring. Show your heart some love. Get this award by earning 60 minutes on your Exercise ring this Valentine's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/prosser-airtags-ipad-pro-next-month/\">Leaker Jon Prosser Claims AirTags and New iPad Pro to Be Announced Next Month</a></h3><p>Friday February 12, 2021 11:56 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple is slated to release a number of new products this year, and the first round of products could be just a few weeks away. YouTuber Jon Prosser, who has a mixed track record when it comes to reporting on Apple's plans, claims that AirTags and brand new iPad Pro models are set to be announced next month, presumably via a virtual event. Prosser, who runs the tech-news show \"Front Page...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/11/one-last-intel-mac/\">Apple Surprisingly Sticking With Intel Chips for One Last Mac</a></h3><p>Despite having begun the transition towards using its own custom silicon across the Mac product lineup, somewhat surprising recent rumors have suggested that Apple may continue to use Intel chips for one Mac model. Last year at WWDC, Apple announced plans to transition away from Intel chips to Macs built with its own Apple Silicon, such as the M1 chip, starting in late 2020. It set out its ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/13/zuckerberg-facebook-inflict-pain-on-apple-privacy/\">Mark Zuckerberg Reportedly Told Staff Facebook Needs to 'Inflict Pain' on Apple Over Privacy Dispute</a></h3><p>Saturday February 13, 2021 2:33 am PST by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple and Facebook have been in a very public spat over the course of the last few months as Apple dials up its pro-privacy stance. The two companies have long had tension, but more recently, Facebook is taking shots at an upcoming iOS and iPadOS feature that will require apps and data companies such as Facebook to ask for users' permission before tracking them across other sites and websites. ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/12/ipad-2021-major-upgrade/\">Major Upgrades Coming to the iPad in 2021</a></h3><p>Apple is looking to launch an updated ninth-generation iPad with a larger display, the A13 Bionic chip, 4GB of RAM, and a thinner, lighter design in the first half of this year, according to recent reports. Reports from cnBeta and Mac Otakara, citing supply chain sources in China, have offered similar projections for the ninth-generation ‌iPad, explaining that the updated device will...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e24d60b02ea373e116fd914ed08740237a73664ad1abee6b318f608b6c42c842","category":"Apple"}