{"title":"The Secret Pro: It’s time rider safety was taken seriously","link":"https://cyclingtips.com/2021/12/the-secret-pro-its-time-rider-safety-was-taken-seriously/","date":1639012170000,"content":"<div><div><p>The season is well and truly over and the offseason has been underway for some time now. Unsurprisingly, it feels as though the offseason’s already slipping by far too fast. Legs, bodies, and minds have had a bit of a recharge. We’ve seen family and friends, maybe dabbled in a bit of nightlife, and now, we’re already throwing a leg over the training bike.</p><p>Luckily for me, I bloody love cycling, in all its incarnations, so getting out on the bike, even in the nip of early winter, isn’t too much of a chore.</p><p>With the mind and body refreshed, it has given me time to mull over the season, mull over what pro cycling’s become and evolved into – because it’s changed.</p><p>I’ve raced as a pro for a fair chunk of my life now. I’m not going to give you specifics; you’ll just have to trust me. I’ve been in the peloton long enough to see things morph, and in many cases, that’s not so much for the better. Oh, and before you start to point and shout “grumpy old pro”, I’m not that old. But be warned, I am going to be a bit grumpy, but for a very good reason.</p><p>You’ve all seen the movie Gladiator, I presume. If you haven’t, go and watch it (quick, before they do a reboot!) I bring it up because I feel like Russell Crowe when I turn up to races now. I know many of us to do. Like we’re being thrown in the lion’s den with a crowd watching, quietly anticipating a bit of carnage-induced entertainment. The only difference is that around the amphitheatre there are banners with sponsors flashing their wares, so you can see that lion mauling us just that bit better. We have a GoPro strapped to our armour.</p><p>Cycling has become a different beast, a far more monetised, commercial, and corporate business. Not just the races with their character slowly stripped away but also the teams. But it’s the races that drive that gladiatorial feel; in the drive to keep those eyeballs on the sport, organisers are spicing it up, making routes more “spectacular”. Fun fact: an alternative spelling for “spectacular” in the cycling world is “dangerous”.</p><p>For all the claims the UCI and race organisers have made about making races safer, we’ve seen some interesting route options get approval in the past year. More on that in a moment.</p><p>So what is being done? Well, there’s the CPA; I’m not back-slapping ourselves here as we could do so much more. Philippe Gilbert and Matteo Trentin don’t get enough credit for what they do; they work tirelessly for us. But unfortunately, there is only so much time they and us as a peloton can plough into working towards a safer sport.</p><p>I know I have a fantastic job, a dream job for many, but it’s still a full-time gig; a job that consumes pretty much every waking hour. How many jobs take you away from home for 200+ days a year? And yes, there is downtime but not as much as you’d expect. Training, racing, and traveling all take up valuable time and mental space, so having a bunch of productive spare time available where we as a peloton can work or even get together to move our grievances forward is a tough call.</p><p>It’s a scrappy situation we are in. There is only so much that can be done in between everything else we have on our plate. In all honestly, safety issues should fall squarely at the feet of the UCI; they shouldn’t need us to call out the bullshit. They should be on it already. They should be on the same wavelength and not feel like we are working against each other.</p><p>Let us just jump back to the start of the season and revisit a hot safety topic. The one that caused the pro cycling fan community to head into social media meltdown. The whole super tuck/invisible aero bars/bottle brouhaha.</p><p>Let me update you on the running total of how many crashes have been avoided this year due to the banning of that position. Incredibly it’s the same number of crashes that I saw when we were allowed to sit on top tubes, dangle our hands over the bars, and all that jazz — a big, fat whopping zero.</p><p>We all knew back on April 1 that it was a waste of time banning it; an absolute joke (I’m still sure that’s why they chose that date). And for those that claimed and still claim that we are role models to a younger generation, I’m pretty sure there are still just as many kids making dumb moves on bikes in training as there has ever been. You’ve got to learn to handle your bike somehow. The ban has changed nothing. It’s that simple.</p><p>“Lip service” is one phrase that comes to mind immediately when I think about that whole situation. If the UCI is concerned about reducing speed, let’s all race on compact chainsets or stick to junior gears. I’d love to see Sam Bennett’s sprint train using a 52/14 setup.</p><p>What has changed then for the better? Well, believe it or not, there have been fewer crashes at finish lines than in seasons past. Or it feels that way.</p><p>The implementation of those substantial plastic barriers at finish lines and the inflatable warning markers have helped somewhat. I tip my cap to the organisers who have invested in using these. It’s great to see that money has been well spent on this infrastructure by specific race organisers, but that’s the race organisers, not the UCI stumping up the cash for that. It’s still far too few that are using them.</p><p>I want to say it’s early days, but that would be rubbish because we’ve aired our grievances for many years now. It’s a start but a damn slow one if you ask me.</p><p>And, yes, there have been fewer sketchy finish lines. But organisers decided to take that right up to the rules deadline. Just take this year’s Étoile de Bessèges. Go back and watch the <a href=\"https://youtu.be/Q92C6pTBG0c?t=68\" target=\"_blank\">last half kilometre of stage 2</a>. With 500 metres to go on a dead straight road, we had a roundabout to negotiate. Edvald Boassan Haggen clipped a pedal and came down, taking out about nine other guys.</p><p>It was crazy; the crash happened on the left-hand side of a large roundabout, repercussions unsurprisingly snowballed onto riders who came out of the opposing side of the roundabout because it was at high speed. But that was OK, as it was held on February 4, a solid two months before the new rules came into play. It also doesn’t matter that we had laid out the rules that winter, months before the race was held, or even that we had had a CPA meeting the same week.</p><p>Now don’t get me wrong, there are still dangerous finish lines; we have not eliminated all of them. But it’s not just the finishes we need to worry about.</p><figure><p></p></figure><p>Many fans will have rejoiced at seeing the cobbles of northern France return to the Tour for 2022. But come on, that’s not taking safety into account at all. That’s adding that magic word “spectacle” into the race, isn’t it?</p><p>I’ve raced the Tour in previous years when we’ve taken on the cobbles and to say it’s a clusterfuck is an understatement. Having a third of the peloton that has never been near a cobble, let alone ridden over them, will only result in danger.</p><p>It’s not just the sectors or the stage itself that take a toll on the riders; it’s the build-up too. I’ve seen first-hand how stressed out riders can be and how much sleep team leaders and their 50 kg domestiques lose in the days leading up to a stage with cobbles. This all adds to the dangers of racing. No one wants to be next to a stressed, sleep-deprived, and worried bike handler.</p><p>What’s the answer? Send all the Classics specialists to the Tour, then watch them drag their sorry asses over Alpine and Pyrenean climbs with zero fireworks? How about we get teams sending the 50 kg climbers they plan on fielding at Grand Tours to the Classics to learn how to ride the cobbles at race pace? No, that would dilute those races too.</p><p>So I propose keeping the cobbles in, or at least some of them, but turn it into a technical TT day. You eliminate much of what makes the cobbles so dangerous but still have the real spectacle and challenge of taking on the rougher stuff. Plus, it would be super unique. Teams would definitely swap bikes. As a bonus, you get the geeky tech side stories and see who is really good on the cobbles and not just lucky.</p><p>And as for Strade Bianche-type roads in the Giro, I think no one has any problems with that. They’re nowhere near as dangerous as cobbles, and realistically, they can’t make or break a race GC as a cobbled section can. Let’s just say I’ve never seen a GC leader lose sleep over the dusty roads of Tuscany.</p><p>Now, one last grievance, and it’s with Velon. Now don’t get me wrong, I’m all behind Velon and what they are trying to (slowly) achieve. But as a company that seems to have its biggest hits on social media from our “biggest hits,” it does grate a little. It shows that fans still love the crash-and-burn side of the sport. I understand it, but it’s a shame we promote the sport in such a way. How is a video of a mass pile-up going to convince a young rider’s parents that it’s a safe and healthy sport for their kid to take up?</p><p>I understand, and I’m fine with them only using the videos of when we manage to ride away from an incident as entertainment. It just that it again comes back to that gritty gladiatorial feel of the sport. It just somehow seems counterproductive when you want to promote a healthy sport full of colour and characters. I much prefer seeing us in the peloton crumbling and talking shit to the camera when we know we have an hour’s climb left, or the joy in the gruppetto seeing the 2 km to go banner on the last Grand Tour stage of the year. The suffering and how we react are much more enlightening and insightful into what racing is all about.</p><p>Finally, there’s one last “issue” on my mind that has nothing to do with the UCI or race organisers, but ourselves, the peloton. And it’s one that I kind of hope doesn’t get rectified any time soon because it’s improved racing.</p><p>I’m one of those in the peloton that listens to the CyclingTips podcast. The reason I bring it up is that I’ve heard them discuss that racing seems in the past two seasons to have become way faster and way wilder. They’ve brought up the fact that lone attacks and breakaways seem more prevalent at races, and they wouldn’t be wrong. Racing has changed in the past few years. It is faster, more chaotic and in some cases more dangerous. But this isn’t down to any change in route options but, in one prominent case, how one team has changed its approach to racing this past two years.</p><p>I didn’t think I’d ever say that racing has got more animated, more dynamic, and changed for the better thanks to Ineos. But these past two seasons, with them straying from their old tired and dull ways, it’s made for some dynamic racing. Not because they as a team are spicing things up personally – though Tom Pidcock has done his fair share – but because they’ve said, “nope, we ain’t sitting on the front”, they’re not taking responsibility for how a stage will pan out now.</p><p>With Jumbo-Visma and UAE Team Emirates in the mix now at Grand Tours and running as superteams, it’s upended the old way Grand Tours were controlled. I, for one, hope that the chaotic, unpredictable nature of how races are run stays, as that’s what will bring new fans and keep old fans.</p><p>We don’t need dodgy finishes, crazy stages, or limits on how we ride a bike or what we ride on. We need good animated races where, if you’ve got the legs, you can hit it out and compete.</p></div></div>","author":"The Secret Pro","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e2c4150ac1e257c1070fd5aa673c2561da51523ede8c7edfc40f083475bf48cf","category":"Cycling"}