{"title":"Cervélo R5 review: Iterations on a theme","link":"https://cyclingtips.com/2021/09/2022-cervelo-r5-review/","date":1632812606000,"content":"<div><div><p>It’s not often that a new road bike launches to the world with the words <em>less stiff</em> within the marketing copy. But here we are, in 2021, and that’s just happened. </p><p>The new Cervelo R5, the latest in a long and storied R-series lineage, was designed to hit similar bottom bracket stiffness targets to the previous model but add a fair amount of compliance, particularly in the front end. It’s not much less stiff, mind. But it is less stiff. And it was done on purpose. </p><p>It’s also, of course, lighter. And more integrated. And a bit more aero. All the usual uses of <em>more</em> in the bike launch context<em>. </em>The purpose of these changes, Cervélo says, was to make a bike that stopped trying to be a “GC bike,” whatever that is, and just stuck to what it’s good at: going up and going down. </p><p>So did it work? Did this new R5 hit the mark? </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-5-1340x754.jpg\"><figcaption>No dropped seatstays, no dropped chainstays, no crazy aero tubing. Works for us.</figcaption></figure><div><h2>Story Highlights</h2><ul><li><strong>What:</strong>The latest in Cervélo’s R-series range.</li><li><strong>Key features:</strong>A 700-gram carbon fiber frame, ultra-stiff pedaling platform, and a more comfortable front end</li><li><strong>Weight:</strong>7.55 kg (16.64 lb, 54 cm, without pedals).</li><li><strong>Price:</strong> US$8,400 / AU$11,600 / £8,599 / €8,799.</li><li><strong>Highs:</strong> Still as fleet-footed as ever</li><li><strong>Lows:</strong>There’s a point of diminishing returns nearby.</li></ul></div><h2>Meet the new (2022) R5</h2><p>It’s difficult to discuss any R5 without talking about what came before, because any R5 is really just a mild variation on an ongoing theme. The series has always been defined as much by that it isn’t as what it is. It isn’t an aero bike. It isn’t an all-road munching, <a href=\"https://cyclingtips.com/2020/07/cervelo-caledonia-5-first-ride-review/\">fat-tired Caledonia</a>. It’s a road bike by the old definition, designed for ups and downs, prioritizing feel over numbers. There are faster bikes out there and there are lighter bikes out there but an R5, Cervélo thinks, should always feel like an R5. </p><p>That’s a bit touchy-feely in today’s world of analytics and data but the two don’t exist without each other. In fact, Cervélo says it’s used analytics and data to find the feel they were looking for. Ask the engineers and they’ll explain in great detail the value of a 45% ratio between head tube stiffness and bottom bracket stiffness, a number arrived at following extensive internal testing. The new R5 is 44.8%, just about spot-on. The previous R5 had a stiffer head tube — too stiff, according to Tom Dumoulin and other Jumbo-Visma pros — and fell afoul of that apparently magical ratio. That’s why the new one had to be softened in very specific ways. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-1-1340x754.jpg\"><figcaption>The revamped Cervelo R5 is a kinder and gentler machine than the one it replaces, and we mean that in a very good way.</figcaption></figure><p>So yes, the new R5 is less stiff. Not where it really matters for power transfer and out-of-the-saddle sensations, but specifically at your hands. When Dumoulin says your bike is too stiff near the end of a grand tour, you make changes. The head tube area was softened up slightly while BB stiffness remains virtually identical to the previous model. </p><p>The frame gets a few other notable updates as well. Most obvious, visually, is the internalization of brake lines. This provides a modest aerodynamic improvement and the integration itself is executed well (more in that later). Max tire sized is upped to an impressive 34 mm as well, making it a pretty capable light gravel bike should you choose to take it off-piste on occasion. </p><p>It’s also lighter. Claimed frame weight is just 703 grams, with a fork at 329 grams. That’s 130 grams lighter than the previous version of the R5.</p><h2>The Build</h2><p>Our test bike was set up with <a href=\"https://cyclingtips.com/2019/04/sram-force-etap-wireless-electronic-groupset-details-weights-prices/\" target=\"_blank\">SRAM Force eTap AXS</a> so derailleur wires were non-existent. The brake lines now run through the bars then down through the headset. It’s a clean system and one of the less annoying brake line integrations we’ve come across. As part of our Field Test, we had multiple testers on this bike, which mean multiple bar heights, and such changes were easy to make. That isn’t always the case. Stem swaps are another story, though, as those are very annoying and require you to completely disconnect the lines. Do yourself a favor and get stem length right the first time.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-24-1340x754.jpg\"><figcaption>Bars are relatively easy to swap, but changing stem lengths require you to completely undo all of the control lines.</figcaption></figure><p>It’s hard to fault Force eTap, particularly given its price point. Functionally, it’s identical to Red. Shifts are crisp and timely, setup is a breeze, and the 12-speed gear ratios are a good match for your average weekend warrior. The bike comes stock with 48/35-tooth chainrings and a 10-28 cassette, giving it more range than a traditional compact while retaining decent gear jumps across the cassette. </p><p>The Force hydraulic disc brake calipers are matched with 160 mm rotors, another good decision. Some light riders or those in flat areas may be able to get away with 140 mm rotors, but for most there’s little sense in dropping size. 160 mm rotors handle heat better and, in my opinion, are a better match for SRAM’s slightly decreased outright power and grab (relative to Shimano road discs). SRAM brake modulation is fantastic, though, and the 160 mm rotors compliment those brake characteristics. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-36-1340x754.jpg\"><figcaption>SRAM’s Force eTap AXS wireless electronic groupset is good stuff.</figcaption></figure><p>Handlebar, stem, and seatpost are all Cervélo-branded items. Five years ago, this would have been a negative, but these days in-house components are not only common, they’re virtually impossible to escape. The bars are flattened up top but still feel good in your hands, and the drops have a nicely rounded shape to them (those used to shallow-drop, abruptly-curving bars may not like it). And the reason you’re seeing D-shaped seatposts everywhere is because they add a fair amount of vertical compliance. The seatpost clamp is a two-bolt design that works fine and doesn’t make you want to chuck it across the room every time you need to adjust your saddle. </p><p>The Prologo Scratch M5 Nack saddle worked fine for me but our other tester on this bike, Dan Cavallari, hated it — your bum mileage will vary. </p><p>Reserve wheels is another house brand, first debuted with another PON company, Santa Cruz, on the mountain bike side. They’re good wheels. The front rim has a 22.6 mm inner width and the rear a 21.6 mm inner width, making them a good match for today’s 28 mm+ road tires. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-34-1340x754.jpg\"><figcaption>Nothing to complain about here, either, though you could argue that 28 mm tires would have made more sense.</figcaption></figure><p>Speaking of which, the R5 comes stock with 25 mm Vittoria Corsa tires. The tires themselves are superb, and they measure out to nearly 27mm thanks to those wide inner widths. But I’m still not sure why Cervélo didn’t stock 28s, and that 34 mm maximum tire size claim seems awfully optimistic given how these fit in the fork and frame. I chucked in some 32s and they were about as wide as I’d want to run on this frame. Hubs are DT Swiss 370s, which should be bombproof. </p><p>My one complaint is the use of a BBright bottom bracket. Yes, it helps Cervélo maintain that huge downtube cross-section. Yes, you can find pretty good bottom brackets for that standard these days. But it’s still press-fit. A threaded BB makes routine maintenance far easier and should be on every modern bike.</p><h2>Geometry </h2><p>There isn’t much to shout about here. The geometry and fit remain virtually identical to the previous R5, except for a slight tweak to the trail figure to adjust for larger tires. A 73-degree seat tube angle across the larger sizes is matched with 73-degree head tube angles on all but the 51 and 48 cm frames. BB drop of 72 mm for our 54 cm test bike is pretty standard as well.</p><p>Steering geometry is on the agile end of the modern road bike spectrum, but quite normal relative to other race bikes. Wheelbase is, again, quite average, within a few millimeters of bikes like the Trek Emonda and Specialized Aethos.</p><p>Cervélo found a geometry formula it likes (and we like) quite a while ago and it’s sticking with it, although using a 73-degree seat tube angle across the board seems a little odd. Shorter riders will definitely want to reach for that zero-offset seatpost option.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-geometry-1340x558.jpg\"></figure><h2>The ride</h2><p>Now, the good bit. How does it feel? Good? Bad? The same? </p><p>Unsurprisingly, it feels a heck of a lot like the last R5. That’s no surprise as it has nearly identical geometry.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-9-1340x754.jpg\"><figcaption>As is typical for Cervelo R-series bikes, the chainstays are huge on the R5, while the seatstays appear almost dangerously spindly.</figcaption></figure><p>As I mentioned earlier, the push for a softer R5 came especially strong from Dumoulin, and this new R5 supposedly reverts back to that magic 45% stiffness ratio.</p><p>So can you feel it? </p><p>We didn’t have an old R5 to ride back-to-back, unfortunately. I have spent a significant amount of time on that bike and never found it to be bone-breakingly stiff, particularly in comparison to many modern aero bikes. So for me to sit here and tell you that the new one provided a magical, life-changing, pillow-like handlebar experience would be both disingenuous and incorrect. </p><p>The new R5 is roughly as comfortable as other bikes in its class. The front end in particular feels a lot like the aforementioned Aethos, which was designed with a similar remit. It is more comfortable than many of the fully-integrated bar/stem combo setups I’ve been on recently. But it’s still a race bike. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-14-1340x754.jpg\"><figcaption>The front end is softer, but not in a dramatic way.</figcaption></figure><p>Frankly, the additional compliance found in the new R5 could also be found by dropping 3 psi out of the front tire. Perhaps that’s not something pro racers are willing to do, concerned about watts as they rightfully are, but it’s absolutely something I am willing to do. I might even drop 5 psi. </p><p>If comfort is what you’re after, this probably isn’t the bike for you. But the R5 does feel more balanced than before. It retains the D-shaped seatpost from the previous version, which has a nice amount of flex. The front end of the new R5 feels less jarring in relation to the rear than it did previously. So that’s a win.</p><p>There’s a quote from Primoz Roglic in Cervélo’s press materials that I find funny, perhaps because I can hear him saying it in that slow Slovenian drawl of his. “Good bike,” he said. And he’s right. It is. Ignoring any compliance claims, it rides superbly. It dives into corners with predictable manners. It’s as stiff as every other R5 I’ve ever been on when you pop out of the saddle and hammer. It feels more lively than an S5 — bikes with big, fat aero tubes usually feel a bit more dead — and sits in-line with other best-in-class all-rounders like the Specialized Tarmac and Cannondale SuperSix Evo. </p><p>Perhaps it’s a testament to the longevity and success of the R series as a whole that the changes made to this latest version feel more like tweaks to an already-excellent recipe than a wholesale restart. Cervélo has a good thing going, and they didn’t ruin it. If anything, the new R5 is a bit better than ever. </p><p>More information can be found at <a href=\"https://www.cervelo.com/en/\" target=\"_blank\">www.cervelo.com</a>.</p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-2-1340x754.jpg\"><figcaption>While the pedaling efficiency and handling responsiveness feel just about identical to the previous R5, the ride comfort is very noticeably improved.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-4-1340x754.jpg\"><figcaption>The new R5 still very much looks the part of Cervelo’s longstanding series of R-series climbing bikes.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-6-1340x754.jpg\"><figcaption>The down tube is nominally aero, but it’s the incredible stiffness that really won us over.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-7-1340x754.jpg\"><figcaption>The BBright bottom bracket shell provides a lot of width to work with, and Cervelo uses every bit of it on the new R5.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-8-1340x754.jpg\"><figcaption>The seat tube is highly flared and asymmetrical. How asymmetrical? Consider that those water bottle bosses sit on the centerline of the bike.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-10-1340x754.jpg\"><figcaption>When it comes to bending and torsional stiffness, cross-sectional size is key.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-11-1340x754.jpg\"><figcaption>How big are the down tube and chainstays? Compare them to the SRAM Force carbon crankarm.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-12-1340x754.jpg\"><figcaption>The chainstays curve for extra drivetrain clearance, enough to provide room for most crankarm-mounted power meters.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-13-1340x754.jpg\"><figcaption>Not flexy.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-15-1340x754.jpg\"><figcaption>D-shaped seatposts are becoming commonplace now given how they’re both more aerodynamic than round posts, and more comfortable, too.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-16-1340x754.jpg\"><figcaption>While the bottom half of the R5 frame is big and bulky, the upper half is slender and svelte.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-17-1340x754.jpg\"><figcaption>Cervelo says the chainstays shoulder so much of the load back here that the pencil-thin seatstays practically don’t do anything in terms of structural support.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-18-1340x754.jpg\"><figcaption>The seatpost wedge is impeccably hidden.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-19-1340x754.jpg\"><figcaption>The tiny seatpost binder holds tight despite its miniscule size.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-20-1340x754.jpg\"><figcaption>The rubber cover provides a nicely finished look, but it takes more than a fingernail to pry it up if you need to make a roadside adjustment.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-21-1340x754.jpg\"><figcaption>This color is excellent.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-22-1340x754.jpg\"><figcaption>The dropout area is elegantly sculpted.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-23-1340x754.jpg\"><figcaption>Cervelo’s hidden cabling setup is in some ways the worst of both worlds.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-24-1340x754.jpg\"><figcaption>Bars are relatively easy to swap, but changing stem lengths require you to completely undo all of the control lines.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-25-1340x754.jpg\"><figcaption>Profiled headset spacers supposedly improve the aerodynamic performance up here.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-26-1340x754.jpg\"><figcaption>The rubber plug for the headset preload bolt is a nice aesthetic touch, but good luck getting it out without a pick.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-27-1340x754.jpg\"><figcaption>This is a pure road bike, after all, so there’s no flare to be found here.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-28-1340x754.jpg\"><figcaption>If you don’t like the stock handlebar, don’t worry, there are other ones you can use. You just have to make sure it has internal routin and an exit port on the back of the stem clamp area.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-29-1340x754.jpg\"><figcaption>The compact bend should be agreeable for most riders.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-30-1340x754.jpg\"><figcaption>The flattened tops actually feel quite comfortable.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-31-1340x754.jpg\"><figcaption>The thru-axle handle is removable should you want a cleaner look.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-32-1340x754.jpg\"><figcaption>There’s an access port on the underside of the BBright bottom bracket shell to assist in running hoses and wires.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-33-1340x754.jpg\"><figcaption>Cervelo’s claimed tire clearance seems… ambitious.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-35-1340x754.jpg\"><figcaption>Not much to complain about here.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-37-1340x754.jpg\"><figcaption>The plastic cover on the outer chainring looks a little chintzy to us, but front shifts work well enough and the stock power meter is nice to see.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-38-1340x754.jpg\"><figcaption>Lots of range for general road riding.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-39-2-1340x754.jpg\"><figcaption>The Prologo saddle drew mixed reviews from our testers.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-39-1340x754.jpg\"><figcaption>Yep, that’s a Shimano lockring securing a SRAM rotor. The horror.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/2022-Cervelo-R5-40-1340x754.jpg\"><figcaption>The Cervelo carbon post works well enough, and there are thankfully other offsets available given the sole 73° seat tube angle.</figcaption></figure></li></ul></div></figure></div></div>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e2ea8a3052caf004c1879e002d849b833d85ca84170839cd8fd03cb437fda5f4","category":"Cycling"}