{"title":"MAAP and Suplest team up again for limited-edition Edge+ road shoes","link":"https://cyclingtips.com/2021/04/maap-and-suplest-team-up-again-for-limited-edition-edge-road-shoes/","date":1617905846000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Australian cycling apparel brand MAAP has made quite the habit of collaborating with brands in other segments for various limited-edition goods, such as bikes, shoes, sunglasses, and bags. For this latest partnership, MAAP has once again joined forces with Swiss shoe brand Suplest for a special version of its Edge+ model — which is now dubbed the Road Pro MAAP LTD.</p><p>The differences from the standard Road Pro purely boil down to two distinct color combinations. The shoes are functionally identical to stock versions otherwise, including an intentionally snug fit with dual Boa IP-1 dials, a wraparound-style synthetic upper, Suplest’s signature “CarbonShield” layer of carbon fiber to help distribute pressure across the top of the rider’s foot, supportive insoles made by Solestar, and a dual-layer hollow carbon fiber plate with a foam midsection to boost stiffness without adding too much weight.&nbsp;</p><p>The shoes are offered in sizes 39-47 (with half sizes from 42-45), and claimed weight is 230 grams per shoe, not including the insole. Retail price is US$399 / AU$549 / €345.&nbsp;</p><h2>A new hat for hot weather, too</h2><p>MAAP also recently partnered with New Era for a new cycling hat — the MAAP x New Era Stealth Performance Cap — designed specifically for warm weather. The body is made of wicking polyester, and features “laser cut perforations and an elasticated internal sweatband” to supposedly improve airflow over your head and help keep perspiration from running down into your sunglasses. Reflective graphics provide some passive low-light visibility, too.&nbsp;</p><p>The cap is offered in three colors, all with a rather heady (pun intended) retail price of US$50 / AU$50 / €35. UK prices for both the shoes and cap are to be confirmed.&nbsp;</p><p>For more information, visit <a href=\"https://maap.cc/\">www.maap.cc</a>.&nbsp;</p><div><h5>Tags</h5></div></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e4364e2d0581c4e88feb842b98535b85b87c43ab287e2ac04317a678865a17aa","category":"Cycling"}