{"title":"Team BikeExchange Jayco confirms rosters for 2022","link":"https://cyclingtips.com/2021/11/team-bikeexchange-jayco-confirms-rosters-for-2022/","date":1638196910000,"content":"<div><div><p>Team BikeExchange Jayco confirmed its rosters for 2022. Thirteen women and 28 men will represent the colors of the Australian team in the new season. No less than 21 nationalities from six continents were signed with 16 Australians as the biggest group of riders.</p><p>The women’s team presents six new riders with the experienced Dutch road captain Nina Kessler, season revelation <a href=\"https://cyclingtips.com/2021/04/from-alaska-to-the-kwaremont-the-spectacular-rise-of-kristen-faulkner/\">Kristen Faulkner</a> (USA), Chelsie Tan Wei Shi as the first World Tour pro from Singapore and Alex Manly, <a href=\"https://cyclingtips.com/2021/11/from-5-year-old-racer-to-the-worldtour-a-qa-with-ruby-roseman-gannon/\">Ruby Roseman Gannon</a> and Georgia Baker for Australia.</p><p>“The work done over this last year, working together with performance and technical team, has been very intense and I do believe that we have managed to put together the best line-up possible for the 2022 season,” General Manager Brent Copeland stated. “We have deeply analysed what has been done in the past and how we have to manage our future. Last season wasn’t the easiest for us, but with the talent and determination of our riders and staff members, we believe can step back up in the WorldTour ranking once again.”</p><p>The men’s team announced seven new riders for the 2022 season. Track specialists specialist Kelland O’Brien joins the team together with Tokyo omnium silver medal winner Campbell Stewart (New Zealand). Young talents Alex Balmer (Switzerland), Jesus David Peña (Colombia), Jan Maas (Netherlands) and Italian time trial champion Matteo Sobrero were signed while American Lawson Craddock adds experience to the team.</p><p>“Over the last two seasons our roster has changed, so we also need to do things differently and adapt,” Head Sport Director Matt White was quoted in the team’s press release. “We have traditionally been a team that has won races across our roster from January to October and never relied on one star to deliver the majority of our wins. We did not achieve this in 2021 and it’s an area we will again focus on in 2022. The Grand Tours are of course very important objectives, especially with leaders like Simon Yates and Michael Matthews, but in this rebuilding phase, winning races anywhere and everywhere is also crucial. With these changes in mind, we will alter some of our goals for the coming season, and that also involves adapting our style of racing when required.”</p><p>The BikeExchange men’s team won only nine races this year with two races at WorldTour level with Simon Yates winning in the Giro d’Italia and Esteban Chaves in the Volta a Catalunya. Grace Brown won twice at World Tour level (Vuelta a Burgos) and the Oxyclean Bruges-De Panne Classic. The other wins came from Teniel Campbell (Tour de l’Ardèche), Urška Žigart (Volta a Valenciana) plus national titles for Georgia Williams and Sarah Roy.</p></div></div>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e553e1af0dc1c82e028a0af654a001a14c520ecf477a95c12bc2f08ba1bef29a","category":"Cycling"}