{"title":"The Six Day Experience: An Assault on the Senses","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-six-day-experience","date":1614266808000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Some of the greatest cyclists in the world, battling it out head-to-head, with music and lights generating a festive atmosphere. A Six Day is so much more than a bike race.</p><p>The racing takes place just metres from the frenetic fans who can watch all of the action unfold on the velodrome directly in front of them.</p><p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-six-day-virtual-series-returns\">Related – The Six Day Virtual Racing Series Returns</a></strong></em></p><p>The experience for spectators is very different to cheering on riders at a road race, where it is only possible to catch a fraction of a race before the riders battle on to the stage-finish, wherever that may be. In Six Day racing, the finish line doesn’t move. This is just part of what makes the Six Day Series so special, though.</p><p>“The fans can feel the wind from the drag of the riders”, 2012 Six Day Copenhagen winner Marc Hester, explains. “As spectators, you can have an effect on the riders in a different way to if you’re standing on a mountain-top cheering for a Tour de France rider. It’s much more a one-to-one experience as a spectator.”</p><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Hester1_1024x1024.jpg?v=1614259833\" alt=\"Marc Hester\"><em>Marc Hester at a Six Day Event</em></p><p>Yoeri Havik has won a Six Days overall classification five times in his career. \"It’s more than a sports event, more than a bike race. It’s a party atmosphere. On a road race you see the bunch passing by for one second, but on the track you can see when the riders are suffering or going fast, it’s a really good sport to watch live.\"</p><p>\"Six Day cycling is all about track racing, partying and getting to know amazing people. It’s like a circus travelling the world together as one big family,\" adds Amalie Winter Olsen, who has recorded 40 top 10 finishes in her Six Day career&nbsp;so far.</p><p>The competition is not quite as brutal as it once was, however. Once upon a time, Six Day competitions took place 24 hours-a-day. Nowadays, as the name suggests, the event continues to take place over six consecutive days, but the competition has been compressed to the evening hours, usually from 6pm to 2am.</p><p>Nonetheless, the length of the race does mean that riders must think carefully about their strategic approach, particularly if they are targeting overall victory. This is no different to how a GC rider must spend their energy in moderation over the 21 days of a Grand Tour.</p><p>Marc Hester has competed in over 100 Six Days in his career and has learnt how to manage his effort to achieve success in different ways. “If you’re not a top contender for the general classification, you can target some of the smaller events that give less points and still get success out of an evening, even though you’re maybe tenth in the GC. That creates diversity within the peloton, because you cannot race full gas in every event, it’s impossible to do for six days”.</p><p>Competing in teams of usually two riders, there is the opportunity for teammates and competitors to get to know one another, both on and off the track. “You do have time between the races to have a calm chat on a friendly basis, you know. It’s more possible to connect with sponsors and spectators at Six Days”, says Hester.</p><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_090361_6day_cycling_an-4_1024x1024.jpg?v=1614185687\" alt=\"Six Day Musician\"><em>Music has always been intergral to a Six Day event,&nbsp;<span>1961</span> (Image credit: Gerry Cranham / Offside)</em></p><p>Yoeri Havik was inspired to take up cycling by his uncle Danny Stam, who was an elite cyclist and Six Day competitor in his own right. At Rotterdam 2012, Havik and Stam teamed up to form a family-oriented duo, albeit at very different stages of their respective careers. Yoeri recalls the event with fondness.</p><p>“I was 20 years old and he was 39 years old. I started cycling because of him and I always looked up to him. When we were riding together at Rotterdam, in the first few days I almost started telling him how to do it, because I thought I really knew. In the final days of the event, I remember I was so tired and there were so many funny moments. I really had to rely on him and I did what he said all the time. It was so funny to ride with my uncle but he was always like a big brother to me. And now, we have these moments together years later, ‘do you remember when you thought you knew everything and in the fifth and sixth day you were so tired?”</p><p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Havik4_1024x1024.jpg?v=1614260026\" alt=\"Yoeri Havik\"></p><p><em>Yoeri Havik competing at a Six Day</em></p><p>Competing over the course of an entire evening means riders cannot simply leave the arena after their race, as they would at, say, a World Championships or Olympic Games. They must recover, prepare and survive between races. At this point, family members can lend a helping hand.</p><p>Marc Hester remembers one of his earlier Six Day memories with his brother Andreas, who often assists Marc when he is competing at his home event in Copenhagen.</p><p>“The year I won in 2012 in Copenhagen with Iljo (Keisse), that was the first time in probably 30 years where we had a 100km chase as the first event of the first night. That was nerve-breaking for the whole peloton.</p><p>\"I remember everybody was like, 'this is a little too crazy, we have to do five days after this'. Everyone who has done a 45-minute or 60-minute chase knows how hard and intense it is. But we did this chase, me and Iljo, and we actually ended up winning it.\"</p><p>The gargantuan effort had taken its toll on Marc, though. \"When we went to the finish line after the race to celebrate the win, to get flowers and lap of honour and all these things, I just remember that I was pale white in the face and a little bit dizzy after a really hard race. I sat down in the cabin downstairs just after the lap of honour. In Copenhagen, I always have my younger brother Andreas helping me with changing clothes and all these things us riders need in order to be recovered for the next races. And I just sat down, looked around, and I just vomited all over the cabin. If I was white in the face when I came down, you should have seen how white my brother was in the face, because he had to clean it up afterwards!”</p><p>Six Day events only bring families closer together, whether they are struggling to tame an overzealous youngster or leading a clean-up after an arduous chase.</p><p>The global pandemic has prevented the Six Day Series from continuing as scheduled as of late. The Six Day Virtual Series was initially setup to fill this void but could become much more than a temporary solution. We caught up with James Durbin, CEO of the Madison Sports Group, the organisers of the Six Day Series, who went into detail on how the virtual series came about and Six Day's plans moving forward. You can read our chat with James below.</p><p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/six-day-series-james-durbin-interview\" target=\"_blank\" rel=\"noopener noreferrer\"><em><strong>Related – \"The World’s Best Cyclists Racing in a Gladiatorial Environment\": James Durbin on the Six Day Series</strong></em></a></p><p>Amalie Winther Olsen has found success in the virtual series and currently leads the Women's standings ahead of Round 3.</p><p>“The Six Day Virtual Series is a fun alternative. I think it is great that the organisation gathers the riders now that it is not possible to gather us for the big Six Day events,\" says Olsen. \"Still, I’m really looking forward to getting back to the in-venue Six Day races. In a time with no races, it is great to have the virtual Six Day to look forward to and train to”.</p><p><em><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/WintherOlsen2_1024x1024.jpg?v=1614259699\" alt=\"Amalie Winther Olsen\"></strong></em></p><p><em>Amalie Winther Olsen on track</em></p><p>Marc Hester also gave us his thoughts on the virtual series. “We accept everything with open arms in the situation we are in now. Just to get a bit of that competitive spirit polished is really nice. But also to see the other guys. I mean, we have video on when we are racing so between the races we have some time to chat, I enjoy that.\"</p><p>\"It’s the first time I ever tried these virtual platforms. I mean, I’m 35 years old now, I’m a little bit more old-school, maybe. I never used the heart rate monitor or anything in my whole career”.</p><p>If Marc and Amalie can warm to the virtual series, so can you. Round three takes place Friday 26th to Sunday 28th February; you can watch live on the&nbsp;<a href=\"https://www.facebook.com/SixDayCycling/\" target=\"_blank\" rel=\"noopener noreferrer\">Six Day Facebook page.</a></p><p>Although a Six Day features some of the most competitive bike racing in the world, it is so much more than that, be it virtual or in a tangible velodrome. For fans, riders, or anyone else, it really is an assault on the senses.</p></div></div>","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e56f4d639142ae61f5dfffdff467c91e3634feb87026e924ec38a28a1335c6b3","category":"Cycling"}