{"title":"Into the Lion’s Den criterium attracts women’s WorldTour attention","link":"https://cyclingtips.com/2021/10/into-the-lions-den-criterium-attracts-womens-worldtour-attention/","date":1634753242000,"content":"<div><div><p>A scattering of women’s WorldTeams will return to California to compete in L39ion of Los Angeles’ Into the Lion’s Den criterium on October 30th. Top names include Team DSM’s Coryn Rivera, winner of the 2021 Liegè-Bastogne-Liegè Demi Vollering (SD Worx), and Tokyo 2020 Olympian Alison Jackson (Liv Racing).</p><p>“I’m excited to show the world what U.S. crit racing is all about,” said Rivera. “My season was over after the road world championships but I added Into the Lion’s Den to my calendar because I grew up racing criteriums and want to give back to that style of racing. And of course, I love racing on home soil and in front of my home-state California fans.”</p><p>Rivera is based in California and has achieved impressive results in her home state previously, including a victory on stage 3 of the 2017 Tour of California and second behind Marianne Vos in stage 3 the previous year. Rivera also won countless criteriums in the years before she made the jump to race full time in Europe.</p><p>Team SD Worx will also send Amy Pieters, who recently won a stage of the AJ Bell Women’s Tour in the UK and has been one of the top sprinters in the women’s peloton for years. Pieters and Vollering together make a formidable pair, although American criterium racing is its own kind of chaos.</p><p>These top women will line up against the best in the criterium business; L39ion of LA’s women’s team. Skylar Schneider and Kendall Ryan have been sweeping up results all Summer and will be on top form for their premier event in Sacramento.</p><p>“Spectators will be inspired by the women’s field,” said Justin Williams, founder of Into the Lion’s Den and L39ION of Los Angeles. “Into the Lion’s Den powered by SRAM has one of the best women’s crit fields competing on U.S. soil in years. We are proud to give the top U.S. riders the opportunity to test their abilities against women who just competed in the Tokyo Olympics and the recent road world championships.”</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e5c3f5baccb8969a9a7bf8a20188353dc2a1252924eac5465f580c5cf1e4afb4","category":"Cycling"}