{"title":"Cinelli Palio Disc review","link":"https://www.cyclist.co.uk/cinelli/9337/cinelli-palio-disc-review","date":1615205132000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>You’ve got to hand it to Italian designers. The newest road bike to hit UK shores from Milanese brand Cinelli – the Palio Disc – appears to be decorated with miiltary-style dazzle-camo… or is it lightning bolts?</p><p>The truth is even more out-there: this toned down grey version (along with the much more garish yellow/red design available) wears a paintjob based on the clothing and team banners of riders in the Palio di Siena horse races. Yes, twice a year – in the height of the Tuscan summertime – the central square of Siena (yes, the one which also hosts <a href=\"https://www.cyclist.co.uk/news/9331/mathieu-van-der-poels-insane-strade-bianche-watts-revealed\">the finish line of Strade Bianche</a>) is given over to frantic horse races.</p><p>Where’s the connection with cycling? Your guess is as good as mine. And that’s what makes it so brilliantly bonkers. Anyway, more importantly, is the new Cinelli Palio Disc hot to trot? Or has it been put together off the hoof?</p><p>It’s certainly a bike which reflects the almost gladiatorial atmosphere of the Palio di Siena – you probably won’t find a quicker Tiagra-equipped machine.</p>&nbsp;<h3>Jockeying for position</h3><p>In a crowded market for road bikes that balance affordability with performance, Cinelli has almost gone completely its own way with the Palio Disc. What you’re getting for your money (and I’ll come to that) is a carbon monocoque frame which wouldn’t feel out of place with a full Dura-Ace groupset hanging off it and a set of deep-sections at either end.</p><p>However, the Palio Disc is equipped with Shimano Tiagra components (remember 10-speed?). And costs £1 shy of two grand. Yes, £2,000 for a Tiagra road bike.</p>&nbsp;<p>'The Tiagra hydraulic groupset was chosen for its perfect balance of performance and a lower price-point,' explains Josh Lambert of Cinelli’s UK distributor, Chicken Cycle Kit.</p><p>'The frame is an excellent platform to upgrade upon, but Tiagra is so good you probably won’t want to. We wanted to get a hydraulic disc-braked, full carbon road bike at the £2k mark, feeling that it is an area not as well represented by some of the larger brands as it should be.</p><p>'There are plenty of 105-equipped bikes at £3,000+, but that is just not reasonable for a lot of people.'</p><p><a href=\"https://www.tredz.co.uk/.Cinelli-Palio-Disc-Tiagra-Hydro-2021-Road-Bike_236210.htm\" target=\"_blank\"><strong><em>Buy the Cinelli Palio Disc from Tredz now</em></strong></a></p>&nbsp;<h3>In fine fettle</h3><p>The frameset of the Cinelli is race-ready – or, if you’re not the type to pin on a number, it’s certainly ‘weekend smashfest-ready’. Bike manufacturers talk an awful lot of hot air sometimes about ‘stiffness this’ and ‘handling that’, but the Cinelli Palio Disc is one of those rare machines that can lay claim to offering both in abundance.</p><p>The box-section down tube and sloping tapered top tube combine with short chainstays and thru-axles front and rear to provide a stiffly set up ride with little to deter from developing and maintaining maximal velocity.</p>&nbsp;<p>The sloping of the top tube also allows for a longer than usual length of 27.2mm alloy seatpost to project from the seat tube, itself flexing slightly – yet imperceptibly – to help dull any resultant harshness in the ride.</p><p><a href=\"https://www.tredz.co.uk/.Cinelli-Palio-Disc-Tiagra-Hydro-2021-Road-Bike_236210.htm\" target=\"_blank\"><strong><em>Buy the Cinelli Palio Disc from Tredz now</em></strong></a></p><p>The frame has clearance for a maximum of 28c diameter tyres, and makes full use of that allowance in this set-up, with high-volume, low-pressure 28mm Impac RacePac tyres providing a grippy, supple ride that also soaks up some road buzz.</p>&nbsp;<h3>Is the going good?</h3><p>For a size S road bike that weighs just north of 9kg, the Cinelli Palio Disc has no right to climb as well as it does. Its bulk is tempered by its stiffness, with satisfyingly rapid progress made when going up rolling hills.</p><p>Longer ascents requiring out of the (very comfortable Selle Italia Model X) saddle efforts are a little more irksome, but much of this is down to the lengthy jumps between ratios on the 11-34 Tiagra cassette when you require a quick gear change.</p>&nbsp;<p>You’re certainly never going to run out of gears, though, with the smallest available from the FSA Omega chainset/Tiagra block set-up being a 34-34.</p><p>Budget all-rounder Vision Team 30 wheels at either end do add more than a couple of kilos to the rotational mass of this bike, and I’ve every confidence it would be an even more pleasurable experience if wearing lightweight carbon wheels.</p><p><a href=\"https://www.tredz.co.uk/.Cinelli-Palio-Disc-Tiagra-Hydro-2021-Road-Bike_236210.htm\" target=\"_blank\"><strong><em>Buy the Cinelli Palio Disc from Tredz now</em></strong></a></p><p>Rocketing descents are a different matter. Throw the left-hand lever of the Tiagra shifters to select the 50-tooth chainring and you’re on a one-way trip to downhill cornering accomplishment.</p>&nbsp;<p>The exactness with which lines are carved, and the finely moderated input from the Tiagra hydraulic front brake disc, makes for a beaming smile and a rush of blood to the head.</p><p>More of a sprinter? Fill your boots… the Cinelli Palio Disc is alert enough to inputs and transmits power more than adequately through its drivetrain. Again, lighter wheels would help it in this department.</p>&nbsp;<h3>The final hurdle</h3><p>The elephant in the room full of horses is always going to be the price. Specifying Shimano Tiagra groupset items on a £2,000 carbon bike does, on the face of it, seem peculiar.</p><p>After all, most Tiagra bikes have alloy frames because the intention is to come in under a certain price, usually the magical £1,000 mark. So, £2k for a Tiagra carbon wannabe racer? I’m right behind it.&nbsp;Here’s why…</p><p>If you bought the £999 frameset, a full Shimano 105 groupset and some basic finishing kit, you’d have spent £2,000 before you even started to think about wheels. What Cinelli has done with the Palio Disc is effectively serve to democratise a phenomenal frameset.</p><p>You can spec it up later. You can add better wheels. And the frame is electronic groupset-ready. What I’m saying, of course, is if you’re in the market for your first carbon bike and you value a different approach, then giddy-up!</p><p><a href=\"https://www.tredz.co.uk/.Cinelli-Palio-Disc-Tiagra-Hydro-2021-Road-Bike_236210.htm\" target=\"_blank\"><strong><em>Buy the Cinelli Palio Disc from Tredz now</em></strong></a></p><h3>Spec</h3><table><tbody><tr><td>Frame</td><td>Columbus carbon monocoque frame and fork</td></tr><tr><td>Groupset</td><td>Shimano Tiagra</td></tr><tr><td>Brakes</td><td>Shimano Tiagra, hydraulic discs, 160mm rotors</td></tr><tr><td>Chainset</td><td>FSA Omega, 50-34</td></tr><tr><td>Cassette</td><td>Shimano Tiagra, 11-34</td></tr><tr><td>Bars</td><td>Tifosi, alloy</td></tr><tr><td>Stem</td><td>Tifosi, alloy</td></tr><tr><td>Seatpost</td><td>Tifosi, alloy, 27.2mm</td></tr><tr><td>Saddle</td><td>Selle Italia Model X</td></tr><tr><td>Wheels</td><td>Vision Team 30 TLR Disc, Impac RacePac tyres, 700 x 28c</td></tr><tr><td>Weight</td><td>9.16kg (size S)</td></tr><tr><td>Contact</td><td>chickencyclekit.co.uk</td></tr></tbody></table><p><a href=\"https://www.cyclist.co.uk/cyclist-reviews-policy\" target=\"_blank\"><em>All reviews are fully independent and no payments have been made by companies featured in reviews</em></a></p></div></div>","author":"jackew","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"e6989eb71bca2335e7095cff9114cd4351606f38dd1b7e44f9932b34b43fd8ee","category":"Cycling"}