{"title":"Tadej Pogacar outsprints Julian Alaphilippe to win Liège-Bastogne-Liège","link":"https://cyclingtips.com/2021/04/tadej-pogacar-out-sprints-julian-alaphilippe-to-win-liege-bastogne-liege/","date":1619363141000,"content":"<div><div><p>Tadej Pogacar (UAE-Team Emirates) sprinted to victory from a group of five at Liège-Bastogne-Liège, narrowly beating the world champion Julian Alaphilippe (Deceuninck-Quick Step) to take the win. David Gaudu (Groupama-FDJ) outsprinted Alejandro Valverde (Movistar) and Michael Woods (Israel Start-Up Nation) for third.</p><p>The crucial turning point of the race came on Côte de la Redoute when Tao Geoghegan Hart (Ineos Grenadiers) set a pace that fractured the remaining peloton. Geoghegan Hart led two of his teammates and a handful of other riders over the top of the climb with a small gap on the splintering race behind. On the next climb, the Côte de Forges, with 24 km to go the action picked up yet again. A move by Adam Yates (Ineos Grenadiers) couldn’t break free of but a counter move by Richard Carapaz (Ineos Grenadiers) was successful.</p><p>Carapaz attacked with 21.4 km to go, leaving a small selection of riders in his wake to get swallowed by the remaining peloton. The lone leader was brought back with 13.5 km to go on the Côte de la Roche-aux-Faucons, soon afterwards Woods threw down a blistering attack that coaxed out a group of five riders including Alaphilippe, Valverde, Gaudu, and Pogacar. The action continued behind the leaders which helped their advantage grow to 18″ with 10 km to go.</p><p>The advantage for the leaders hovered around half a minute and with a kilometre to go it was clear they would be contesting the win between them. From the front of the group, Valverde started the sprint but it was Pogacar and Alaphilippe who crossed the line side by side. After finishing third in 2020 Pogacar successfully stole the win from the world champion by half a wheel width. Gaudu outsprinted Woods and Valverde to round out the podium.</p><div><div><p>Liège-Bastogne-Liège (1.UWT) <span>Liège → Liège</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/dc/tadej-pogacar-2021.jpeg\"></p></div></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e7939d01b3d1d46886e3bf1f5fc0a9f2ab7d5d92ec17f8fe920833b71b6bf7a3","category":"Cycling"}