{"title":"Poc Ventral Lite: Poc launches lightest ever helmet","link":"https://www.cyclist.co.uk/news/9263/poc-ventral-lite-poc-launches-lightest-ever-helmet","date":1614016735000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Poc has launched the Ventral Lite, its 'lightest ever' cycling helmet, designed for climbing and riding in hot conditions.</p><p>Since releasing its first cycling helmet in 2014, Poc has made its way to the forefront of helmet design, both technically and aesthetically – having been <a href=\"https://www.cyclist.co.uk/news/8771/palace-skateboards-and-rapha-collaborate-for-education-first-kit-at-giro-ditalia\" target=\"_blank\">host to a large duck</a>&nbsp;during last year's <a href=\"https://www.cyclist.co.uk/tags/giro-ditalia\">Giro d'Italia</a>.</p><p>That original helmet, the Octal, was designed to find the optimum combination of safety, performance and light weight and the Ventral Lite takes inspiration from the Octal with that same objective.</p><p>Poc's head of product, Oscar Huss, said: 'We wanted to take the ideas and concepts from the Octal even further. Riders who are focussed on climbing or ride in hotter conditions are extremely conscious about weight, ventilation and comfort, which is where the Ventral Lite, our lightest ever helmet will excel.'</p>&nbsp;<h3>What's in the Poc?</h3><p>From the template of the Ventral Air, Poc has stripped away any hint of excess weight, refining even the straps, while keeping it as safe as possible.</p><p>While the redesigning of the shell and liner gives the Ventral Lite better structural integrity than its predecessor, it's the weight saving of the precisely cut outer shell and lower-density EPS foam that Poc wants you to get excited about.</p><p>On top of that, it features a new minimalist size adjustment system and optimised straps that are, of course, more lightweight.</p><p><a href=\"https://www.pocsports.com/collections/cycling-helmets-road/products/ventral-lite\" target=\"_blank\"><em><strong>Buy the Poc Ventral Lite now</strong></em></a></p>&nbsp;<p>'We strongly believe that the safest helmet is the one you choose to wear, one which you always look forward to wearing,' Huss says.</p><p>'The Ventral Lite will provide the protection those riders deserve without ever noticing it's there.'</p>&nbsp;<h3>Weight and price</h3><p>Poc says a size small weighs in at 180g, with a 190g medium and 210g large.</p><p>if you can't wait for the <a href=\"https://www.cyclist.co.uk/tags/ef-education-nippo\">EF Education-Nippo</a> issue bright pink version that's set to debut at the Paris-Nice on March 7th and want to stand out on the road, it's available with bright green straps as well as calmer blue and white, with grey and black options for the shell.</p><p>It's available online and in selected stores for £240.</p><p><a href=\"https://www.pocsports.com/collections/cycling-helmets-road/products/ventral-lite\" target=\"_blank\"><em><strong>Buy the Poc Ventral Lite now</strong></em></a></p></div></div>","author":"wstrickson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"e7c0956195482b7281192ce7f23a161f0c0cb9e77510ed7ddeed52ac53a147a7","category":"Cycling"}