{"title":"Report: Indian government is planning outright ban on cryptocurrency","link":"https://arstechnica.com/?p=1749805","date":1615842446000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Blockchain —</h4><h2 itemprop=\"description\">The proposed bill would ban trading, mining, and even holding cryptocurrencies.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1230848229-800x533.jpg\" alt=\"A man with a long white beard speaks into a microphone.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1230848229.jpg\" data-height=\"2667\" data-width=\"4000\">Enlarge</a> <span>/</span> Indian Prime Minister Narendra Modi.</p></figcaption></figure><p>The government of India is planning to introduce legislation banning cryptocurrency, Reuters <a href=\"https://www.reuters.com/article/us-india-cryptocurrency-ban/india-to-propose-cryptocurrency-ban-penalising-miners-traders-source-idUSKBN2B60R0\">reports</a>. The law would impose fines on anyone who trades, mines, or even holds cryptocurrency. The government has a comfortable majority in parliament, giving the proposal a good shot at becoming law.</p><p>This would make India one of the most cryptocurrency-hostile jurisdictions in the world. China, for example, has imposed a number of restrictions on <a href=\"https://arstechnica.com/tech-policy/2017/09/initial-coin-offerings-are-becoming-a-big-deal-china-just-banned-them/\">trading</a> and <a href=\"https://arstechnica.com/tech-policy/2019/04/chinese-government-proposes-ban-on-bitcoin-mining/\">mining</a> cryptocurrency, but it hasn't banned ownership of cryptocurrencies outright.</p><p>The legal status of cryptocurrency has been a subject of controversy in India over the last few years. In 2018, India's central bank banned Indian banks from providing financial services to cryptocurrency exchanges, hampering the growth of the nation's cryptocurrency economy.</p><p>Last year, India's Supreme Court <a href=\"https://www.coindesk.com/after-court-victory-indian-exchanges-gear-up-for-crypto-trading-surge\">overturned the ban</a>, triggering a surge of Indian interest in cryptocurrencies. One cryptocurrency exchange,&nbsp;Bitbns, told Reuters that user registrations have risen thirtyfold over the last year.</p><p>But the high court's ruling left the door open for legislation on the subject. In January, rumors started to <a href=\"https://www.coindesk.com/indias-proposed-ban-of-private-cryptos-has-many-of-the-nations-investors-nervous\">circulate</a> that the government was considering a ban.</p><p>According to Reuters, the legislation would give cryptocurrency owners six months to liquidate their positions before the ban went into effect.</p><p>Officials seem to be worried that ordinary Indian consumers could make bad cryptocurrency bets and lose their savings as a result. Bitcoin's price rose above $60,000 for the first time over the weekend—double its value at the start of the year. But there have been periods in the past where bitcoin has lost more than 80 percent of its value in a few months.</p></div></div>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e7c1c5796d0836ca2fd1f66fcc42823bdd885874d7039a6380430fb8faf05cab","category":"Tech"}