{"title":"“ShareIt” Android app with over a billion downloads is a security nightmare","link":"https://arstechnica.com/?p=1742615","date":1613504213000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>I wanted sharing, but this is too much sharing —</h4><h2 itemprop=\"description\">Trend Micro audited one of Android's most popular file-sharing apps. It's not good.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/1-2-800x354.jpg\" alt=\"You can't argue with that green &quot;safe&quot; shield. \"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/1-2.jpg\" data-height=\"444\" data-width=\"1004\">Enlarge</a> <span>/</span> You can't argue with that green \"safe\" shield.</p></figcaption></figure><p>Trend Micro says it has found <a href=\"https://www.trendmicro.com/en_us/research/21/b/shareit-flaw-could-lead-to-remote-code-execution.html\" rel=\"nofollow\">\"several\" security flaws</a> in the popular Android app <a href=\"https://play.google.com/store/apps/details?id=com.lenovo.anyshare.gps\">ShareIt</a>. ShareIt has been downloaded over a billion times from the Play Store, and, according to <a href=\"https://www.outlookindia.com/newsscroll/shareit-included-in-top-10-most-downloaded-mobile-apps-in-2019/1725789\">App Annie,</a>&nbsp;was one of the 10 most globally downloaded apps in 2019.&nbsp;The app was originally developed by Lenovo (it has since spun off into its own company) and for a time was pre-installed on Lenovo phones.</p><p>The report says ShareIt's vulnerabilities can \"be abused to leak a user's sensitive data and execute arbitrary code with ShareIt permissions.\" ShareIt's permissions, as a local file-sharing app, are pretty extensive. According to the Play Store permissions readout, ShareIt requests access to the entire user storage and all media, the camera and microphone, and location. It can delete apps, run at startup,&nbsp;create accounts and set passwords, and do a whole lot more. It also has full network access. Trend Micro says compromising the app can lead to remote code execution. The security&nbsp;firm says it shared these vulnerabilities with ShareIt three months ago, but the company has yet to issue patches.</p><p>ShareIt's incredible success of a billion Android downloads and 1.8 billion users worldwide (there are also iOS, Windows, and Mac apps) has led to what looks like an incredible amount of app bloat. The app was considered one of the best for local file sharing, but today the Play Store listing shows an app that offers \"Infinite Online Videos,\" \"Tens of millions of high-quality songs,\" \"GIFs, Wallpapers &amp; Stickers,\" a \"popular\" media section that looks like a social network, a game store, a retail movie download section, COVID-19 check-in activity and case statistics, and what looks like its own form of currency. <a href=\"http://www.ushareit.com/about\">ShareIt's website</a>&nbsp;(which, just like the app, does not default to HTTPS) says the service is \"now a leading content platform\" and popular in&nbsp;Southeast Asia, South Asia, the Middle East, Africa, and Russia.</p><h2>When private storage isn’t private</h2><p>Trend Micro's report details a laundry list of bad decisions made while designing ShareIt that could make it more susceptible to malicious code. One problem is <a href=\"https://blog.oversecured.com/Android-Access-to-app-protected-components/\">a common</a> Android app vulnerability that arises when developers set up a <a href=\"https://developer.android.com/guide/topics/providers/content-providers\">content provider</a> incorrectly. Android prides itself on intra-app communication, partly because any app can create a content provider and provide its content and services to other apps. If Gmail wants to attach a file to an email, it can do that by showing a list of available file-content providers installed on your phone (it's basically an \"open with\" dialog box), and the user can pick their favorite file manager, navigate through their storage, and pass the file they want to Gmail.&nbsp;It's up to developers to sanitize these cross-app capabilities and only expose the necessary file manager capabilities to Gmail and other apps.</p><p>ShareIt doesn't seem to have given much thought to the need to sanitize its content-provider capabilities. The report says: \"The developer behind this disabled the exported attribute via android:exported=\"false\", but enabled the android:grantUriPermissions=\"true\" attribute. This indicates that any third-party entity can still gain temporary read/write access to the content provider's data.\" Passing along some permissions is normal, but Trend Micro found that ShareIt doesn't try to scope down its permissions at all and will happily serve up its files to any app that asks. A malicious developer needs to only call on the ShareIt's file-content provider and pass it a file path for the developer to get back any of the files that make up the ShareIt app.</p><p>The file paths ShareIt will offer up are limited to its own data files, but that means apps can edit the data ShareIt uses to run, including the app cache that gets generated during install and runtime. The report says that \"an attacker may craft a fake [app cache] file, then replace those files via the aforementioned vulnerability to perform code execution.\" Normally these files live in private storage, but ShareIt's private storage is open to the world.</p><p>ShareIt also comes with its own Android app installer. With its private storage no longer being \"private,\" it repeats the same mistakes we saw in <a href=\"https://arstechnica.com/gadgets/2018/08/fortnites-android-vulnerability-leads-to-googleepic-games-spat/\">Epic's <em>Fornite</em> installer.</a>&nbsp;It downloads app install files to world-readable storage, where they are vulnerable to a \"Man-in-the-disk\" attack. App install files need to be protected in private storage before they are installed, but in public storage, the install package could be swapped out as soon as it is downloaded but before install time. Then the user thinks they're installing the good app they just downloaded, but it's actually an imposter malicious app.</p><h2>“The attacker can steal sensitive data”</h2><p>A whole extra problem is that ShareIt's game store can apparently download app data over unsecured HTTP, where it can be subject to a man-in-the-middle attack. ShareIt registers itself as the handler for any link that ends its domains, like \"wshareit.com\" or \"gshare.cdn.shareitgames.com,\" and it will automatically pop up when users click on a download link. Most apps force all traffic to HTTPS, but ShareIt does not. Chrome will shut down HTTP download traffic, so this would have to be done through a Web interface other than the main browser.</p><p>Trend Micro ends by saying, \"We reported these vulnerabilities to the vendor, who has not responded yet. We decided to disclose our research three months after reporting this since many users might be affected by this attack, because the attacker can steal sensitive data and do anything with the apps' permission.\" Users should probably uninstall the app ASAP. If you're looking for a more secure file-sharing alternative, <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.nbu.files\">Google's file manager</a> can do local sharing over Wi-Fi now and should be written with better security practices.</p></div></div></div>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e877ddf4e0398f95a7cd117624c66f1c00cd582b3d01887e025eb25d11e15a24","category":"Tech"}