{"title":"Live chat tomorrow: Ars Texas on living through last week’s arctic adventure","link":"https://arstechnica.com/?p=1745062","date":1614272287000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>more power to us (please) —</h4><h2 itemprop=\"description\">Come chat about enduring sub-freezing temperatures without heat, water, or electricity!</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/Tales-From-The-Texas-Freeze-800x450.jpg\" alt=\"Live chat tomorrow: Ars Texas on living through last week’s arctic adventure\"><figcaption></figcaption></figure><p>Most of Texas endured record or near-record low temperatures last week as a late-season (for Texas, at least) arctic cold front sagged down across the state. In the week leading up to the event, forecasters warned residents to prepare for the kind of cold common in more northern climates but exceedingly rare for most of us down here—temperatures in the teens or even high single-digits (think lows around -12 to -10 degrees C for you folks who don't use Freedom Units)—and even (gasp!)&nbsp;<em>snow</em>. Along the Gulf Coast where Ars Space Editor Eric Berger and I live, the combination of low temperatures and wintry&nbsp;precipitation was a once-in-30-years kind of event. (Indeed, the last time it got this cold here was in December 1989.)</p><p>The cold was expected, and while it's unpleasant as hell to deal with in a city built for summer heat and not winter cold, it would have been manageable on its own. But what we weren't expecting—well, <a href=\"https://www.texastribune.org/2021/02/17/texas-power-grid-failures/\">most of us</a>, at least—was having to deal with this rare low-temperature excursion <em>without power or heat</em>. As the front plowed across the state on the evening of Valentine's Day, demand on the state's power grid spiked to a record 69GW as residents turned on heaters to combat temperatures sliding down into the teens. (That level of power demand beat even the <a href=\"https://www.nerc.com/pa/RAPA/ra/Reliability%20Assessments%20DL/NERC_WRA_2020_2021.pdf\">predicted extreme weather peak of 67GW</a>&nbsp;and was higher than the previous <a href=\"http://www.ercot.com/content/meetings/tac/keydocs/2011/0505/09._IMM_Report_Events_020211.pdf\">February 2011 cold-weather-demand peak of 59GW</a>.) As demand spiked, the state's electrical grid operators had to take <a href=\"https://arstechnica.com/science/2021/02/texas-power-grid-crumples-under-the-cold/\">emergency measures</a> to stave off total collapse.</p><p>And thus began a week of freezing misery for more than 4 million Texans who had to endure the coldest weather in decades without any power or heat, in homes designed to release summer heat rather than keep it in. The majority of the power-loss issues occurred in Houston.</p><h2>No sir, I don’t like it</h2><p>When temperatures finally clawed their way back above freezing a few days later and the power finally came back on for most folks, the picture wasn't pretty. Many had made it through without any lasting damage other than losing their outdoor plants, but many others were dealing with that sad, old Texas refrain of flooded homes—though this time the flooding wasn't from a hurricane but from burst pipes. Still others—those who had elected to take advantage of the fact that Texas' energy market allows consumers to buy electricity at wholesale prices if they wish—faced <a href=\"https://www.nytimes.com/2021/02/20/us/texas-storm-electric-bills.html\">exorbitant power bills</a> of up to $9 per kilowatt-hour, a situation that no one in authority has shown much <a href=\"https://www.youtube.com/watch?v=UONyL2QmYYU\">enthusiasm for addressing</a>. Large swaths of the Houston metro area—home to about 7 million, or about twelve Wyomings' worth of people—were under water-boil advisories. (Even now, a full week after the event ended, boil advisories persist for many parts of Houston.)</p><p>Worst of all, people died. The final tally is <a href=\"https://www.wsj.com/articles/full-death-toll-from-texas-storm-could-take-months-to-determine-11614107708\">still uncertain</a>, but the Associated Press cites <a href=\"https://apnews.com/article/houston-hypothermia-weather-conroe-texas-8323ab5f5c1612e632f7f2e6c2c20358\">at least 70 deaths</a> attributable nationwide to the storm, with \"most of those\" occurring in Texas.</p><p>As with all disasters, the impact was hugely variable depending on where you lived and a healthy dose of chance. Some folks got through the entire event without losing power or having to boil water at all—it was just cold. Others found themselves having to <a href=\"https://abcnews.go.com/US/family-11-year-boy-died-texas-deep-freeze/story?id=76030082\">bury family members</a>.</p><p>It was not an awesome week.</p><p>But part of the way we heal from stuff like this is to talk about it—and that's what we're going to do.</p><h2>Live chat: Friday, February 26, at 12:00pm EST</h2><p>Join Ars alum and energy expert <a href=\"https://arstechnica.com/author/megan-geuss/\">Megan Geuss</a> tomorrow as she chairs a small panel consisting of space editor and <a href=\"https://spacecityweather.com/\">local weather forecaster</a> Eric Berger and myself. (I'm not a weather guy, but I did live through the event, so think of me like the Jim Nantz to Eric's Tony Romo—he and Megan will bring the facts; I'll make the jokes.)</p><p>We'll be broadcasting the chat via Twitter Live, and if you just want to watch, you can <a href=\"https://twitter.com/i/broadcasts/1MnGnlaYoRLxO\">follow along at this link</a>. If you'd like to actually lob some questions at us, you can register at <a href=\"https://condenast.zoom.us/webinar/register/WN_8oTRk9XBSgyW6vuazZRcgw\">this Zoom link</a> and drop questions into the chat, where our behind-the-scenes moderators will whisk them to our computer screens.</p></div></div>","author":"Lee Hutchinson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e885681dda04aa1ff770b1a21e63b1fd14bebeb4f981442fb5e10af93b45f186","category":"Tech"}