{"title":"2022 Orbea Terra adds more clearance and comfort to keep up with the Joneses","link":"https://cyclingtips.com/2021/11/2022-orbea-terra-adds-more-clearance-and-comfort-to-keep-up-with-the-joneses/","date":1636668204000,"content":"<div><div><div><h2>Story Highlights</h2><ul><li><strong>What it is:</strong>Orbea’s second-generation carbon gravel bike.</li><li><strong>Frame features:</strong>Dropped chainstays, hidden cable routing, clearance for 700×45 mm or 650×50 mm tires, updated geometry, front and rear optional fender mounts, BB386EVO press-fit bottom bracket shell.</li><li><strong>Weight:</strong> 1,030g (claimed, medium raw frame only).</li><li><strong>Price:</strong>Varies.</li><li></li></ul></div><h2>Steady as she goes</h2><p>Orbea’s first-generation Terra gravel bike was a quietly competent offering free of fluff and filigree. It had good tire clearance, it was reasonably light and rode OK, and it looked good and fit well enough. It may not have stood out for any crazy features, but my sense is that was by design because it didn’t stand out for any bad ideas, either.</p><p>Orbea’s new second-generation Terra gravel bike incorporates a long list of changes that bring it more up-to-date with the competition while retaining the previous model’s somewhat conservative look and feel — and for plenty of riders, that’ll come across as a very appealing thing.</p><p>As expected, tire clearance has grown from the previous Terra, which could only handle “most” 700c tires up to 40 mm across. For this version, newly asymmetrically dropped chainstays now officially allow for 700×45 mm tires across the board, as well as 650×50 mm ones if you want to go even burlier. And if you want to make use of the hidden front and rear fender mounts, Orbea says you can still fit 700x35s in there, too.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-7-1340x754.jpg\"><figcaption>Lots of tire clearance this time around.</figcaption></figure><p>Frame geometry otherwise gets a more thorough — and arguably much needed — update. </p><p>Whereas the previous Terra made do with the same head tube (70.5°) and seat tube angles (73.5°) across the five-size range, the new one finally goes with properly size-specific figures while also adding a new XXL size. As it should have been to begin with, head tube angles now vary from 70-72°, and seat tube angles range from 73-74°, in order to maintain a more proportional position and similar handling traits for all rider heights. Interestingly — and coupled with the new fork’s longer 55 mm rake — trail figures have actually gone down a bit as compared to the original Terra, now ranging in the mid-60s.</p><p>As expected, Orbea has (sort of) jumped on the longer-reach bandwagon, although the actual changes — just 2-5 mm, depending on size — are quite modest. The bigger news is the increase in stack, which ranges a much more substantial 9-19 mm for a slightly more upright posture. Going along with those slightly longer reach dimensions are correspondingly shorter stems to retain similar total cockpit lengths.</p><p>Aiding in the stability department, bottom brackets are now also quite a bit lower than before (76-78 mm of drop instead of 65-70 mm), although the chainstays have shortened by 10 mm (to 420 mm), which is particularly impressive given the boost in tire clearance and the fact this new Terra still accepts conventional 2x compact road cranksets. However, although the rear end of the new Terra is now shorter, those changes in head tube angle still result in shorter wheelbases across the board.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-geometry-1-1340x708.jpg\"></figure><p>Taken in total, the new Terra’s handling looks to be quite interesting. The lower center of gravity should lend a more stable and planted feel, but the shorter wheelbase and smaller trail dimensions should actually liven up the handling, especially in larger sizes. </p><p>Orbea has apparently focused a lot of attention on the new Terra’s ride quality, too, which is good to hear given the old one was a bit on the rough side. </p><p>Carrying over is the same 27.2 mm round seatpost, but Orbea has incorporated more top tube slope for a shorter seat tube, which exposes more unsupported seatpost to flex on bumps. Further down, the seat tube also sports a shallower profile down near the bottom bracket to help the whole area bend a bit more under load. Overall Orbea claims the new Terra records “8% more deflection” at the seatpost head as compared to the previous model, on average across the size range — not a ton, but better than nothing.</p><p>There’s even a new down tube storage compartment called Lockr, which Orbea says has enough room for common repair items and other essentials such as snacks and car keys. Curiously, though, there’s no mount on the top tube for a feed bag or similar accessory, although there is some rubber armoring on the underside of the down tube and on the driveside chainstay.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-12-1340x754.jpg\"><figcaption>The “Lockr” hatch on the down tube appears to be a little smaller than what you’ll find on bikes from Specialized and Trek, but it should still prove handy.</figcaption></figure><p>Like it or not, Orbea has graced the new Terra with fully internal cable routing as well, using the company’s own stem and headset design. The bar and stem are thankfully separate items, though, and while everything runs through the upper headset bearing, the lines are actually external to the cockpit components, hidden beneath bar tape and cosmetic plastic covers on the underside of the stem. As a result, Terra owners should enjoy most of the benefits of fully internal routing without all of the headache.</p><p>“We want to keep the Terra Carbon character sporty and there are multiple types of bags available that don’t require top tube bag mounts,” explained Orbea product manager Joseba Arizaga. “And actually, internal cable routing is not just for aesthetics, but we prefer handlebar bags instead of small top tube bags.”</p><p>Claimed weight is 1,130 g for a raw “ready-to-paint” medium Terra frame.</p><h2>Models and availability</h2><p>Orbea will offer the new Terra in up to seven complete builds, and all on the same frameset, starting with Shimano GRX 600 and topping out with SRAM Force XPLR eTap AXS. Orbea will also offer the Terra through its MyO custom program should you prefer to go with your own paint colors and build kit.</p><p>Brief specs and prices are as follows, with projected availability starting early 2022.</p><ul><li><strong>Terra M21eTeam 1x:</strong> SRAM Force XPLR eTap AXS 1×12 wireless electronic groupset, Fulcrum Rapid Red 500 DB wheels; US$5,300 / AU$TBC / £5,000 / €5,000.</li><li><strong>Terra M20iTeam:</strong> Shimano GRX Di2 2×11 electronic groupset, Fulcrum Racing Red 500 DB wheels; US$5,000 / AU$TBC / £4,600 / €4,600.</li><li><strong>Terra M31eTeam 1x:</strong> SRAM Rival XPLR eTap AXS 1×12 wireless electronic groupset, Fulcrum Rapid Red 900 DB wheels; US$4,200 / AU$TBC / £3,800 / €3,800.</li><li><strong>Terra M20 Team:</strong> Shimano GRX 800 2×11 mechanical groupset, Orbea aluminum rims with Shimano RS470 hubs; US$3,700 / AU$TBC / £3,400 / €3,400.</li><li><strong>Terra M30 Team: </strong>Shimano GRX 800 2×11 mechanical groupset with FSA Gossamer Pro crankset, Orbea aluminum rims with Shimano RS470 hubs; US$3,300 / AU$TBC / £3,000 / €3,000.</li><li><strong>Terra M30 Team 1x:</strong> Shimano GRX 600 2×11 mechanical groupset, Orbea aluminum rims with Shimano RS470 hubs; US$3,200 / AU$TBC / £2,900 / €2,900.</li></ul><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-16-1340x754.jpg\"><figcaption>Do yourself a favor and go with the MyO custom paint option. It doesn’t cost any extra, and you can thank me later.</figcaption></figure><h2>So how’s it ride?</h2><p>Beats me! We’ve put in a request for a test sample, so stay tuned for a ride report hopefully in the near future. </p><p>In the meantime, more information can be found at <a href=\"https://www.orbea.com/ie-en/bicycles/road/terra/\">www.orbea.com</a>. </p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-2-1340x754.jpg\"><figcaption>The new Terra isn’t a massive change from the previous one in some ways, but there are significant improvements throughout nonetheless.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-3-1340x754.jpg\"><figcaption>Orbea isn’t pegging the new Terra as being best for the extreme end of the usage spectrum. While it can obviously be used for gravel racing or light bikepacking, it’s really intended to be a sort of do-it-all rig.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-4-1340x754.jpg\"><figcaption>The scalloped section behind the seat tube is intended to promote frame flex on bumps for more rider comfort.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-5-1340x754.jpg\"><figcaption>Orbea doesn’t make a big deal of the tube shaping on the new Terra, but it does look quite nice.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-8-1340x754.jpg\"><figcaption>While the rear of the bike is only approved for 50 mm-wide tires on 650b rims, the fork is big enough to handle them on 700c rims, too.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-9-1340x754.jpg\"><figcaption>The dropped chainstays are an essential element to cramming everything into this tight area.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-10-1340x754.jpg\"><figcaption>Orbea has switched to an internal seatpost binder this time around.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-11-1340x754.jpg\"><figcaption>Cable routing is fully hidden, though technically not totally internal since it’s actually external to the handlebar and stem. Plastic covers conceal everything on the underside of the stem.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-13-1340x754.jpg\"><figcaption>Thick guards on the underside of the down tube should prevent most damage from rocks.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-14-1340x754.jpg\"><figcaption>Should you prefer a 1x drivetrain, the front derailleur mount can be removed and replaced with a flush cap. If you look carefully, you can see the compartment on the upper side of the bottom bracket shell for the Di2 junction box, too.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/11/2022-Orbea-Terra-17-1340x754.jpg\"><figcaption>Whichever Terra you go with, it’ll come with a new Orbea handlebar, featuring a modest bit of flare at the drops and, on carbon models, a bit of rise on the tops.</figcaption></figure></li></ul></div></figure></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e88ac35bf01b35905a86f51ca198d9e0cdb108f471224d63787a89b372edb4fb","category":"Cycling"}