{"title":"Paris-Roubaix has been postponed","link":"https://cyclingtips.com/2021/04/paris-roubaix-has-been-postponed/","date":1617289470000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Philippe Gilbert leading the way at Paris-Roubaix in 2019.</h4><p></p><div><p>After weeks of uncertainty over whether Paris-Roubaix would go ahead in April, organizers announced on Thursday that the event has been postponed until October due to COVID-19.</p><p>The women’s and men’s races will now be held over two days instead of on the same day. With the April 11 date off the table, the inaugural women’s race is now set to be held on Saturday, October 2, with the men’s race set to be held the following day, Sunday, October 3.</p><p>“The new dates were approved by the stakeholders in men’s and women’s professional road cycling (organisers, teams and riders), following a consultation process involving organisers and other stakeholders,” read a statement from the UCI.</p><p>“This decision follows the decision of the competent French authorities to prohibit the holding of the 2021 edition of Paris-Roubaix – men and women – on the dates scheduled in the UCI International Road Calendar in the context of the current health situation.”</p><p>Paris-Roubaix did not take place at all in 2020 due to COVID-19; it was initially postponed from its traditional April date, and then it was cancelled altogether. The 2021 edition was scheduled for April as normal, but in recent weeks it became increasingly uncertain whether it would be possible to hold the event. France recently increased COVID-19 restrictions across the country, and cases have been surging in Northern France in particular.</p><p>According to <a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Christian-prudhomme-sur-le-report-de-paris-roubaix-en-octobre-certains-etaient-prets-a-s-arracher-le-coeur-pour-que-la-course-soit-maintenue/1238325\" target=\"_blank\" rel=\"noreferrer noopener\">L’Equipe</a>, the ASO considered implementing various measures in order to keep the April date for the event, but the government ultimately decided against allowing the race to go ahead.</p><p>“We had hope when we made the reconnaissance of the course on the spot, at the end of last week with the police and the gendarmerie, because we were then in search of concrete, tangible solutions,” ASO director of cycling Christian Prudhomme said. “The goal was to see if by removing certain sectors, we could have more easily held the potential audience. It was a ‘recce’ almost meter-by-meter, where the objective was to see how to block the road, what device to put in place, what display, what barrier … It was very meticulous, but it didn’t work. We did not get permission.”</p><p>Unable to hold the event on the planned date, the organizers requested new dates, and the request was granted.</p><p>“For the UCI and the cycling community, it was very important that both races could take place in 2021, and I am delighted that new dates suitable for all parties have been found,” UCI President David Lappartient said in the UCI’s statement. “Paris-Roubaix is one of the Monuments of the UCI WorldTour calendar, while Paris-Roubaix Women will be held for the first time this year as part of the UCI Women’s WorldTour. It was therefore essential to find, together with all parties concerned, an appropriate postponement date, in keeping with the status of this mythical event so much appreciated by riders and fans, and whose female riders are looking forward to competing in the inaugural women’s edition.”</p><p>The new October dates for Paris-Roubaix come one week after the UCI Road World Championships in Belgium, which are likely to suit the stars of the cobbled Classics.</p><div><h5>Tags</h5></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e8e9f2046272569e3a61f8a351c0f9ceb99362948e42a353df43447cbf0525c1","category":"Cycling"}