{"title":"Judge grants class-action status to MacBook butterfly-keyboard suit","link":"https://arstechnica.com/?p=1751264","date":1616443414000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>bad butterfly —</h4><h2 itemprop=\"description\">Apple phased out the design after 2019, but older models still have issues.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/07/2018-MacBook-Pro-keyboard-800x430.jpg\" alt=\"The keyboard on the MacBook Pro\"><figcaption></figcaption></figure><p>A judge has granted class-action status to a suit against Apple over its controversial, allegedly defective MacBook \"butterfly\" keyboard design, agreeing that owners of any affected model in seven states qualify for the class.</p><p>Beginning in 2018, several MacBook owners in seven states filed suits against Apple, claiming that the company knew the butterfly-style switches were defective. In an order (<a href=\"https://www.courtlistener.com/recap/gov.uscourts.cand.326502/gov.uscourts.cand.326502.306.2.pdf\">PDF</a>), made public on Friday, Judge Edward J. Davila of US District Court for the Northern District of California agreed to grant class-action status to the suit. All customers residing in California, New York, Florida, Illinois, New Jersey, Michigan, or Washington state who purchased a 2015-2017 MacBook, a 2016-2019 MacBook Pro, or a 2018-2019 MacBook Air now qualify for the class.</p><p>The butterfly-style keyboard design was controversial from the start. Apple designed it to be thinner and provide a shorter return, which would save space inside the computer chassis and make typing faster. Some users hated the feel of it, while others loved it. The larger problem, however, seemed to be not one of preference but rather one of basic function: the thinner keys proved to be more susceptible to failure when used in the actual real world, as even small particles of dust accumulating around the switches could make them stop working, requiring a full replacement of the entire keyboard.</p><p>The plaintiffs in the suit allege that Apple's actions, as well as internal documents from the company, show that Apple knew the design was defective. They argue that the company violated several states' consumer protection laws when it kept selling the defective products to consumers.</p><p>A <a href=\"https://arstechnica.com/gadgets/2018/05/report-butterfly-macbook-pro-keyboards-require-more-frequent-more-expensive-repairs/\">2018 report</a> found that MacBooks needed keyboard-related repairs roughly 40 percent more often once Apple introduced the butterfly-style keyboard. Repeat repairs—keyboards needing an expensive second or even third fix—also increased significantly.</p><p>In June 2018, Apple acknowledged the butterfly-style switches were causing problems, and the company <a href=\"https://arstechnica.com/gadgets/2018/06/apple-launches-service-program-to-address-macbook-pro-keyboard-woes/\">launched a keyboard service program</a> specifically to address those issues. The program allowed for affected MacBook owners to have their keyboards repaired or replaced at no charge for the next four years, and some customers who had previously paid for those repairs became eligible to request refunds.</p><p>By mid-2018, Apple <a href=\"https://arstechnica.com/gadgets/2018/07/apple-to-stop-selling-2015-macbook-pro-with-old-style-keyboard-legacy-ports/\">only sold</a> MacBook models with butterfly keyboards. By 2019, however, Apple was already <a href=\"https://arstechnica.com/gadgets/2019/11/2019-16-inch-macbook-pro-review-bye-bye-butterfly/\">overhauling the keyboards</a> in the MacBook Pro line, and by 2020 the company <a href=\"https://arstechnica.com/information-technology/2021/03/judge-grants-class-action-status-to-macbook-butterfly-keyboard-suit/%22https://arstechnica.com/gadgets/2020/05/apple-updates-13-inch-macbook-pro-with-new-keyboard-and-more-storage/\">completely phased out</a> the butterfly keyboard from its entire lineup of laptops.</p></div></div>","author":"Kate Cox","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ea028def38b853c917aacb13ec46798bcf4bc106eb4e1a9d319f7838f4fa86aa","category":"Tech"}