{"title":"Radiohead, Foo Fighters and more team up with Brompton for fundraiser","link":"https://cyclingtips.com/2021/04/radiohead-foo-fighters-and-more-team-up-with-brompton-for-fundraiser/","date":1619654460000,"content":"<div><div><p>Live music has taken a colossal hit over the past year, as COVID-19 has wreaked havoc and touring has ground to a standstill. Thousands of people employed in the industry as stagehands and lighting techs, sound engineers and musicians, have had their livelihoods evaporate. </p><p>Meanwhile, the bike industry has gone from strength to strength. </p><p>“We’re lucky to count a number of musicians and their crews as dear friends, and over the years Brompton bikes have found a moving home on tour buses and been ridden by crews while out on the road,” said Tevis Jory, Brompton’s North American Sales Manager, who introduced a free-of-charge bike hire program for touring artists a couple of years ago. With the music industry in dire straits (the situation – not the band), Jory got thinking about how the British folding bike brand could lend a helping hand. </p><p>The answer was a bike-design collaboration with 13 big-name artists, raising funds for Crew Nation, a global relief fund for live music crews.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Brompton-Live-Nation-feature-1340x1006.jpg\"></figure><p>The 13 one-off bikes will be auctioned off from May 28, with 100% of funds raised going to the cause. </p><p>Brompton has so far revealed four of the unique designs, including the clear pick of the litter, an insane <em><a href=\"https://open.spotify.com/album/5vkqYmiPBYLaalcmjujWxK\" target=\"_blank\">In Rainbows</a></em>-inspired design by Stanley Donwood, Radiohead’s art director. </p><p>Donwood, who has created all of the (extremely good) band’s (also extremely good) album artwork since 1994, apparently knows a bit about the infectious joy of bike riding, describing Bromptons as “fantastic zippy folding freedom machines” in an accompanying press release.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Radiohead2520-2520WHT2520-25204-1340x894.jpg\"><figcaption>Donwood’s (at least) 15 Step paintjob transformed a Nude frame into All I Need.</figcaption></figure><p>The other artists featured in this first batch include Rise Against, Oh Wonder and Dinosaur Jr., the last of those being the inspiration for an absolutely sweet purple floral number. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Screen-Shot-2021-04-29-at-1.01.00-pm-1340x907.jpg\"></figure><p>Brompton will trickle out the remaining designs in the lead-up to the auction opening, with the complete line-up including:</p><ul><li>Foo Fighters, of Foo Fighters fame</li><li>Phoebe Bridgers, who you should really listen to because she’s the greatest</li><li>LCD Soundsystem, a band I feel like I should be into although I don’t think I know a single song</li><li>Khruangbin, who I have never heard of</li><li>Nathan East, as above</li><li>Underworld, as above as above, although I don’t mind the snippet I’m listening to on Spotify right now, so that’s something, I guess?</li><li>The iconic Seattle label Sub Pop, which you might know of as Nirvana’s label (but also house bands like Low, Shearwater and Afghan Whigs, which are all much, much more exciting to me personally)</li><li>Enrique Iglesias, who is obviously the odd one out here</li><li>and Neko Case, who is empress of all she surveys.</li></ul><p>My editorialising is done here. Find out more about the auction and sign up for updates at <a href=\"https://www.brompton.com/crewnation\">Brompton.com</a></p></div></div>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"eaed7a0941da17a382dc4a6fb67505c9182d578c9b1adf6512f566c75a4ada77","category":"Cycling"}