{"title":"Muc-Off’s Ludicrous AF is said to be the world’s fastest lube, but is it?","link":"https://cyclingtips.com/2021/09/muc-offs-ludicrous-af-is-said-to-be-the-worlds-fastest-lube-but-is-it/","date":1631783982000,"content":"<div><div><p>Muc-Off has today unveiled a new race-focused drip chain lube. It was apparently used during Ineos’ Giro d’Italia victory, and Muc-Off’s accompanying marketing materials aren’t shy about bold claims, labelling it the world’s fastest lube.  </p><p>The ‘world’s fastest lube’ title seems to get handed from one brand’s marketing team to the next like an endless game of pass-the-parcel, and there’s no shortage of contenders claiming they deserve the honour – usually thanks to results from their own testing. Not to overstate things, but it’s become a murky and dirty world where the biggest microphone seemingly equates to the best product. And it’s this very topic we recently <a href=\"https://cyclingtips.com/2021/08/nerd-alert-podcast-separating-chain-lube-testing-fact-from-fiction/\" target=\"_blank\">dived deeply into on the Nerd Alert podcast</a>. </p><p>We’ve also taken previous deep dives on the subject of <a href=\"https://cyclingtips.com/2018/03/fast-chain-lube-that-saves-you-money/\" target=\"_blank\">what makes a great chain lube</a>. In a nutshell, a great chain lube needs to reduce metal-on-metal friction while preventing wear- and friction-inducing contamination (grit) from getting trapped in the chain’s inner workings. Many oil-based lubes are great at the former, but it’s the latter where wax-based lubes typically win back some ground.</p><p>And yet, Muc-Off is claiming its wet oil-based lube is a winner when speed matters – regardless of the conditions.</p><h2>Introducing Muc-Off’s Ludicrous AF </h2><p>Said to be lightning in a bottle, Ludicrous AF (yes, the AF does stand for what you think it does) is Muc-Off’s latest magic speed potion that’s claimed to help win races. It’s a pro-level product with a pro-level price: £50 / US$65 for a 50 ml bottle.</p><p>The goal of the product was simply to be the fastest thing in the peloton, and Muc-Off doesn’t claim much more than that. It’s supposedly the first product produced from the company’s claimed million-pound investment in new expertise and testing machinery. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Muc-Off-Ludicrous-AF-chain-lube-release-5-1340x754.jpg\"><figcaption>Muc-Off intends Ludicrous AF to be a pure performance product and so doesn’t have any colouring or perfume added (like some of its other products). Yep, perfume in bike lubes is a thing!</figcaption></figure><p>Using the company’s own full tension test dynometer and third-party testing by New Motion Labs, the company claims that the previous benchmark AbsoluteBlack and CeramicSpeed UFO drip lubes both suffer from degrading efficiency as the kilometres tick by. By contrast, Muc-Off claims its new Ludicrously-named oil-based lube is able to maintain stable efficiency numbers throughout its tests that clock up as much as 8 hours of continuous running. </p><p>And so while both the AbsoluteBlack and CeramicSpeed drip lube products start off quicker, Muc-Off is suggesting that by the end of its test run, its ritzy new lube sits as the benchmark. Meanwhile, Silca Synergetic, Absolute Black Graphenlube, and CeramicSpeed UFO Drip (unknown if V1 or V2) consume 3%, 15% and 124% more power respectively, according to Muc-Off. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/09/Muc-off-AF-lube-test-chart-1340x419.jpg\"><figcaption>These charts raise questions which are covered in the next section.</figcaption></figure><p>According to the British company’s press release, the secret to Ludicrous AF is how “the molecules react with the surface of the chain, leading to the creation of a fluid sheer plane which helps to reduce friction and thus power loss.” </p><p>The oil-based based lube is said to contain “self-lubricating capabilities and synthetic polymers” which the company says are suitable for use in wet, damp, dry, and dusty conditions across a wide range of temperatures. The ingredients are also said to be biodegradable and made entirely of “renewable” sources, but what’s obviously missing are the words “non-toxic.” </p><p>According to Steve Fearn, Muc-Off’s communications manager, “Ludicrous AF is the choice of our pro peloton teams for TT, we have and will continue to provide them with pre-treated Ludicrous AF chains and their own mini ultrasonic tanks. The Tour of Britain TT stage last week was won by INEOS using Ludicrous AF treated chains.” </p><p>According to Fearn, each sponsored team is able to make its own decision in relation to which lube to run. “Hydrodynamic is still very popular during particularly harsh weather stages with most teams, but we have found that Ludicrous AF – although not originally developed for wet weather – performs phenomenally well in the rain and have fed this back to our teams.” </p><h2>Questions raised</h2><p>Muc-Off has obviously made some heady claims here based on efficiency testing done in a sterile lab environment. It’s also critical to note that the company hasn’t shared any raw data figures or how Muc-Off’s previously claimed “best” lubes stack up – rather the company has merely said Ludicrous AF sets a new benchmark. </p><p>What’s obvious is that Muc-Off has made huge investments in its research and development, and the lube acts as a billboard for that.  However, from the outside it seems possible that Muc-Off has fallen into a few testing traps that were a large reason for <a href=\"https://cyclingtips.com/2021/08/nerd-alert-podcast-separating-chain-lube-testing-fact-from-fiction/\" target=\"_blank\">our recent Nerd Alert podcast on the topic</a>. Namely, there are ways of testing that favour oil-based drip lubes over wax lubes – and that leaves plenty of confusion over what is in fact best. </p><p>Muc-Off’s own marketing materials specifically mention that they just surpass Silca’s Synergetic in efficiency and I think this provides a healthy clue into the product’s claims. Synergetic recently became the first oil-based wet lube to make it to the final stages of Zero Friction Cycling’s torture tests, something that only wax lubes had managed to do previously. And Silca claims that Synergetic offers the best single-application durability when compared to its hot-melt and <a href=\"https://cyclingtips.com/2020/04/silcas-new-super-secret-chain-lube-is-like-hot-melt-wax-in-a-bottle/\" target=\"_blank\">drip-on Super Secret lubes</a>. </p><p>However, where things get confusing is that Silca clearly states that its Synergetic lube isn’t as efficient as its own wax lube products (at least over shorter distances), and Silca has acknowledged that its own “fastest” wax products are within punching distance (and even beaten) by the likes of <a href=\"https://cyclingtips.com/2020/11/ceramicspeeds-new-ufo-drip-lube-is-slicker-longer-lasting-and-far-cheaper/\" target=\"_blank\">CeramicSpeed’s new UFO Drip lube</a>. </p><p>And so from the outside, I speculate that Muc-Off has arrived at the conclusion that Ludicrous AF is the world’s fastest lube by, firstly, running a test for long enough that the performance of competing wax products degrades. And secondly, it’s possible their measurements are being run with the chains under tension for extended periods of time, something that doesn’t allow a solid-state wax lubricant to reset within the chain like it would on a normal bicycle and therefore favours an oil-based wet lube.</p><p>I’m not doubting that Muc-Off has spent a small fortune creating this obnoxiously-named product and in turn has created a brilliant wet lube. However, I’m keen to see more third party data before I give up my clean running wax, and until that point, am hesitant to accept the company’s claims that this is the fastest lube across all cycling conditions – especially once dust and grit set in.<br></p><p>Visit <a href=\"https://muc-off.com/pages/ludicrous-af\" target=\"_blank\">Muc-Off’s website</a> to learn more from the company about its new Ludicrous AF lube.</p></div></div>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"eb3e3df48faf3cfb3775a503d9247e59cce2f62e104989e84219e603945aff15","category":"Cycling"}