{"title":"‘Why Are You Still Here?’","link":"https://money.cnn.com/2008/11/09/technology/cook_apple.fortune/index.htm","date":1613098063000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><div id=\"IEContainerR\"><div><table><tbody><tr><td><img src=\"http://i.l.cnn.net/money/2008/11/09/technology/cook_apple.fortune/cook_jobs.co.03.jpg\" alt=\"cook_jobs.co.03.jpg\" width=\"220\" height=\"263\"></td></tr><tr><td><span><b>Tim Cook (left) and Steve Jobs at Apple headquarters in 2007. Jobs hired Cook from Compaq in 1998 to fix Apple's production mess.</b></span></td></tr></tbody></table></div><p><img src=\"http://i.l.cnn.net/money/2008/11/09/technology/cook_apple.fortune/mag_APP24_graphic2.gif\" alt=\"mag_APP24_graphic2.gif\" width=\"220\" height=\"793\"></p><div id=\"vidIEContainer\"><p><span><img alt=\"Apple beyond Steve Jobs\" width=\"218\" height=\"164\" src=\"https://i2.cdn.turner.com/money/video/fortune/2008/11/10/fortune.lashinsky.apple.succession.fortune.216x164.jpg\"></span></p></div><div><table><tbody><tr><td><img src=\"http://i.l.cnn.net/money/2008/11/09/technology/cook_apple.fortune/jobs_cover.jpg\" alt=\"jobs_cover.jpg\" width=\"220\" height=\"294\"></td></tr><tr><td><span><b>Jobs is a hero to many - but there are still nagging questions about his health.</b></span></td></tr></tbody></table></div></div><p>(Fortune Magazine) -- Let's start with some uncomfortable truths. We wouldn't be publishing an article about the under-the-radar guy who's most likely to succeed Steve Jobs as chief executive of Apple if Jobs himself hadn't shown up at a company event in San Francisco in June looking frightfully skinny and pale.</p><p>Jobs, after all, is a pancreatic-cancer survivor, having beaten a treatable form of the disease in 2004. Since that appearance last summer, Apple's excitable investor base and blogosphere have spun full tilt wondering about their hero's health, a topic that - other than the pithy retort here and the acerbic talk-to-the-hand comment there - Apple's CEO has declined to address.</p><p>Then there's the widespread opinion inside and out of Apple (<a href=\"https://money.cnn.com/quote/quote.html?symb=AAPL&amp;source=story_quote_link\">AAPL</a>, <a href=\"https://money.cnn.com/magazines/fortune/fortune500/2008/snapshots/670.html?source=story_f500_link\">Fortune 500</a>) that the Magician of 1 Infinite Loop simply can't be replaced.</p><p>There is only one Steve Jobs, one table-pounding visionary who can refashion whole industries with a wave of his hand. The mere hint of a Jobs health scare knocks billions of dollars off Apple's market value. (Temporary hit from a false web post in early October about a Jobs heart attack: $10 billion.)</p><p>The most influential promoter of Steve Jobs' indispensability, of course, is Steve Jobs. But another person who is very much with that program is the one executive who has actually filled in for Jobs as CEO. That would be Tim Cook, Apple's chief operating officer and its interim chief executive for two months in 2004, when Jobs was recovering from cancer surgery.</p><p>\"Come on, replace Steve? No. He's irreplaceable,\" Cook said recently, according to a person who knows him well. \"That's something people have to get over. I see Steve there with gray hair in his 70s, long after I'm retired.\"</p><p>Cook may be right; we simply don't know the status of Jobs' health. Yet succession plans at giant corporations typically aren't built on hope. Apple's plan to replace the 53-year-old CEO is known for sure only to Jobs and the company's seven other board members.</p><p>Though he is highly regarded as a business-operations maestro, few people outside of Apple have any sense of whether Cook (who, for the record, turns 48 in November and is a fitness nut) would be a good chief executive, much less a suitable replacement for Steve Jobs. Even careful Apple watchers don't quite know what to think.</p><p>\"By default Tim Cook would be the logical guy,\" says Toni Sacconaghi, an influential Apple analyst at brokerage firm Sanford C. Bernstein. \"Yet that hasn't been spelled out. And the stakes are just higher at Apple, because Steve is larger than life, and Tim isn't a known quantity.\"</p><p>So the \"logical\" heir to the throne of one of the coolest - never mind most successful - companies on the planet right now is a blank slate. That is reason enough to find out who the man is. In interviews with two dozen people who have dealt directly with Cook, a picture emerges that is reassuring if unanticipated. It turns out that although Cook and Jobs are in many ways opposites, the No. 2 exec is equally obsessive and exacting about his work.</p><p>An intensely private Alabaman and Auburn University engineering grad (class of 1982), Cook is also a workaholic whose only interests outside of Apple appear to be cycling, the outdoors, and Auburn football. (Talk about tough years: Apple's stock is down 50% year to date; the Tigers, nationally ranked early in the season, were 4-5 at presstime.) What's more, there's every reason to believe that Apple would at least be stable for some years to come if Cook were to find himself at the helm. The reason: He's essentially been running much of the company for years.</p><p>Demanding and even-keeled</p><p>Tim cook arrived at Apple in 1998 from Compaq Computer. He was a 16-year computer-industry veteran - he'd worked for IBM (<a href=\"https://money.cnn.com/quote/quote.html?symb=IBM&amp;source=story_quote_link\">IBM</a>, <a href=\"https://money.cnn.com/magazines/fortune/fortune500/2008/snapshots/225.html?source=story_f500_link\">Fortune 500</a>) for 12 of those years - with a mandate to clean up the atrocious state of Apple's manufacturing, distribution, and supply apparatus. One day back then, he convened a meeting with his team, and the discussion turned to a particular problem in Asia.</p><p>\"This is really bad,\" Cook told the group. \"Someone should be in China driving this.\" Thirty minutes into that meeting Cook looked at Sabih Khan, a key operations executive, and abruptly asked, without a trace of emotion, \"Why are you still here?\"</p><p>Khan, who remains one of Cook's top lieutenants to this day, immediately stood up, drove to San Francisco International Airport, and, without a change of clothes, booked a flight to China with no return date, according to people familiar with the episode. The story is vintage Cook: demanding and unemotional.</p><p>Almost from the time he showed up at Apple, Cook knew he had to pull the company out of manufacturing. He closed factories and warehouses around the world and instead established relationships with contract manufacturers. As a result, Apple's inventory, measured by the amount of time it sat on the company's balance sheet, quickly fell from months to days. Inventory, Cook has said, is \"fundamentally evil,\" and he has been known to observe that it declines in value by 1% to 2% a week in normal times, faster in tough times like the present.</p><p>\"You kind of want to manage it like you're in the dairy business,\" he has said. \"If it gets past its freshness date, you have a problem.\" This logistical discipline has given Apple inventory management comparable with Dell's, then as now the gold standard for computer-manufacturing efficiency.</p><p>We know what you're thinking: Why dwell on the backroom aspects of such a sexy company? Because that seemingly dull stuff is as important to Apple's success as the gorgeous designs and ultracool marketing. Forecasting demand, for example, and executing against that forecast, are critical in the computer industry, especially when new products quickly cannibalize the old.</p><p>Consider what befell Palm (<a href=\"https://money.cnn.com/quote/quote.html?symb=PALM&amp;source=story_quote_link\">PALM</a>) in 2001. The company torpedoed an entire quarter's performance by announcing a new version of its mainstay PDA - which helped dry up sales of the old version - and then failing to deliver the new product when the company said it would.</p><p>Those kinds of flubs just don't happen at Apple, which routinely pulls off the miraculous: unveiling revolutionary products that have been kept completely secret until they magically appear in stores all over the world. The iPhone, the iPod, any number of iMacs and MacBooks - the consistently seamless orchestration of Apple's product introductions and delivery is nothing short of remarkable.</p><p>A classic example: In 2006 Apple transitioned its entire computer line to running on processors made by Intel (<a href=\"https://money.cnn.com/quote/quote.html?symb=INTC&amp;source=story_quote_link\">INTC</a>, <a href=\"https://money.cnn.com/magazines/fortune/fortune500/2008/snapshots/642.html?source=story_f500_link\">Fortune 500</a>). For lots of technical reasons we won't go into here, doing that was not easy. But Cook's team somehow made sure there was nary a blip in sales.</p><p>Think of Cook's contribution like this. There are two basic ways to get great profit margins: Charge high prices or reduce costs. Apple does both. The marketing and design drive consumers wild with desire and make them willing to pay a premium; Cook's operational savvy keeps costs under control. Thus Apple is a cash-generating machine. Cook has called the company a place that is \"entrepreneurial in its nature but with the mother of all balance sheets.\" At last count that meant $24.5 billion in cash and no debt.</p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ebe4b0dc1f0bfc2d3f19ecf20da5d3e7ee73c2bfb72ded26e5fea165508373d2","category":"Tech"}