{"title":"Preview: The Women’s Tour is back!","link":"https://cyclingtips.com/2021/10/preview-the-aj-bell-womens-tour-is-back/","date":1633301760000,"content":"<div><div><p>The final Women’s WorldTour stage race of the season starts Monday, October 4th in Bicester, the United Kingdom: the newly-named AJ Bell Women’s Tour.</p><p>It’s been over two years since the last edition of the Women’s Tour, won by Lizzie Deignan. Cancelled in 2020 and then postponed in 2021, the Women’s Tour was one of the races hit hardest by the pandemic. Thankfully, it’s back on the calendar to close out the WorldTour stage race season in 2021, before taking up its usual June slot on the calendar in 2022.</p><p>Since the race is taking place so late in the season, a lot of domestiques and young riders are going to get their time in the spotlight. Most of the big names are done for the year: some have retired, some are injured (notably, <a href=\"https://cyclingtips.com/2021/10/annemiek-van-vleutens-season-is-over-after-crashing-at-paris-roubaix/\" target=\"_blank\">Annemiek van Vleuten who crashed hard in Paris-Roubaix Femmes</a>), and some are just mentally ready for the off-season.</p><p>Unfortunately for fans of the six-day British race, there will not be the promised live television coverage. In February 2021, race organizers Sweetspot announced a fantastic five year deal with Eurosport and GCN to deliver live coverage for the women’s stage race for the first time, but this hasn’t panned out.</p><p>It’s unclear as of now what kind of sanctions might be in the pipeline for Sweetspot from the UCI, but by the book, all women’s WorldTour races are required to have at least 45 minutes of live coverage. When the Giro Rosa failed to provide this in 2020 they were demoted from WWT status in 2021.</p><p>If you overlook the lack of live coverage, the Women’s Tour has been a benchmark for women’s stage racing because of the race organization and how the riders are treated – not to mention the thousands of fans who show up roadside for each of the stages. The race also matches prize money to the men’s Tour of Britain, and is one of the very few WorldTour races to do so. This year, however, the prize money is also down. The blow of no live coverage again is hard to swallow, since it’s arguably what riders and fans want most; according to many of the top pros and the Cyclists’ Alliance – the women’s cycling union – live TV coverage is key to the growth of the sport.</p><p>“We will continue to have a fantastic free-to-air nightly highlights programme in the UK on ITV4 and distributed internationally by Eurosport GCN, and to share content from the race across our website and social media channels to keep fans as informed and updated as possible,” Sweetspot said in a press release.</p><p>There are still some pretty exciting aspects of the AJ Bell Women’s Tour to look forward to this year. For the first time ever, the race will have an individual time trial. The overall course is flatter than years past, so it’s going to be a tight fight. Fans can look forward to six days of exciting racing in Britain, and possibly some more <a href=\"https://cyclingtips.com/2021/10/gallery-the-grit-and-glory-of-paris-roubaix-femmes/\">wet roads as we saw at Paris-Roubaix Femmes</a>.</p><h2>Who is going to be there?</h2><p>Despite a few past winners skipping the Women’s Tour this year, there will still be some strong contenders lining up. With a plethora of flat stages, the peloton will be packed with sprinters including the new road race World Champion <strong>Elisa Balsamo</strong> (Valcar-Travel &amp; Service). Based on her sprint at the World Championships – and, indeed, all season – it would not be surprising to see Balsamo take at least one stage.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/GettyImages-1327291576-1340x893.jpg\"><figcaption>Lorena Wiebes</figcaption></figure><p><strong>Lorena Wiebes </strong>(Team DSM) has been the best sprinter of 2021, with nine sprint victories this season. She’s well placed to pull a Marianne Vos (Vos won three stages and the overall in the first edition of the Women’s Tour in 2014) and win multiple stages plus the overall. She’s quick in a time trial as well. What’s more, Wiebes is going in with a very strong team.</p><p>Team DSM is taking Pfeiffer Georgi, Leah Kirchmann, Liane Lippert, and Juliette Labous – all very capable teammates for Wiebes.</p><p>Hometown hero <strong>Alice Barnes</strong> – the reigning national champ since winning the British Championships last time they were held in 2019 – is a strong sprinter and rode well at the inaugural Paris-Roubaix Femmes on Saturday. Canyon-SRAM only has four riders listed to start, however, so she might be lacking a bit of team back-up.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/GettyImages-1341467612-1340x893.jpg\"><figcaption>Joss Lowden</figcaption></figure><p>With the time trial on stage 3, Drops-Le Col s/b Tempur’s <strong>Joss Lowden</strong> could pull off the British team’s first WorldTour victory. The team has made it known they are keen to become a WorldTeam in the future, and Lowden is one of their most promising stars. Lowden’s clearly in form, having set a <a href=\"https://cyclingtips.com/2021/09/48-km-joss-lowden-has-broken-the-hour-record/\">staggering new benchmark</a> for the Women’s World Hour Record just last week.</p><p>Also starting for Drops will be <strong>Marjolein Van’t Geloof </strong>who finished 13th at Paris-Roubaix Femmes.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/GettyImages-1235646856-1340x893.jpg\"><figcaption>Lizzie Deignan was the inaugural winner of Paris-Roubaix Femmes.</figcaption></figure><p>Speaking of Paris-Roubaix Femmes, Trek-Segafredo will enter the Women’s Tour with the Queen herself, <strong>Lizzie Deignan</strong>. Deignan has won two editions of the race so far – first in 2016 and again in 2019. Her most recent victory was by only two seconds and courtesy of a solo stage win on stage 3.</p><p>French rider <strong>Audrey Cordon-Ragot </strong>will also be lining up for the American team. Cordon-Ragot has long been a loyal domestique for the bigger names on her team, but it would be nice to see her go for her own victory, with the race so late in the season and the outcome somewhat up in the air. <strong>Elisa Longo Borghini</strong> – third at Paris-Roubaix – has continued her good form from the whole season, and while normally with such a flat course she wouldn’t look like a favourite, did you see that lead out she did for Balsamo at the World Championships?!</p><p>Trek-Segafredo is going into the race brimming with confidence after Paris-Roubaix. They also have a wicked fast sprinter in <strong>Chloe Hosking</strong> and a strong team to either back her or throw their own brand of chaos at the race.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/GettyImages-1344434580-1340x893.jpg\"><figcaption>Amy Pieters</figcaption></figure><p>Another strong team on the start line will of course be SD Worx. With <strong>Amy Pieters</strong>, <strong>Demi Vollering</strong>, and <strong>Chantal van den Broek-Blaak</strong> they have a few fantastic options for fast stages.</p><p>New fan favourite <strong>Alison Jackson</strong> (Liv Racing) is another potential sprint winner or mid-race stealer of seconds. She might not be able to slip off the front and evade the peloton to win a stage, but she’s built up enough confidence this season to win a sprint outright. She is also a leader on Liv Racing for the Women’s Tour, as Lotte Kopecky will sit out this final stage race.</p><h2>The Stages</h2><p>Previous editions of the Women’s Tour have featured short and brutally steep climbs, but this year the stages are a little bit on the tame side. The most elevation gain comes in the first two stages, after which it flattens out.</p><h3>Stage 1: Bicester – Banbury (147.7 km) Monday, October 4</h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT2021_Launch-Map_Stage1-v2-02-scaled-1-1340x754.jpg\"></figure><p>With two sprints and three Queen of the Mountain points on offer the day will likely start fast. Smaller British teams will fight to get into a breakaway and that break will probably go pretty early. The insanely quick turnaround from Paris-Roubaix to the Women’s Tour might leave the WorldTeams feeling a bit of whiplash, giving the hometown teams a bit of an upper hand in these early stages.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT_S1_profile_branded-scaled-1-1340x623.jpg\"></figure><p>After 100 km of racing the peloton enters two circuits to finish the day. They will race up the Sibford Ferris climb twice before finishing in Banbury.</p><p>It’s likely the race ends in a small bunch sprint, but it’s equally possible a break survives to battle for the first leader’s jersey of the week.</p><h3>Stage 2: Walsall – Walsall (102 km) Tuesday, October 5</h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT2021_Launch-Map_Stage2_v3-02-scaled-1-1340x754.jpg\"></figure><p>Stage 2 is a circuit race. The peloton will complete ten laps of the 10 km long loop and each time will race up the Barr Beacon climb. At 1,200 meters in length with just over 5.5% average grade the climb isn’t nuts, but it will definitely wear on the legs by the end of the day.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT_S2_profile_branded-scaled-1-1340x623.jpg\"></figure><p>This stage is potentially the most decisive road stage of the race and could see some minor time gaps form between the race favorites – especially those who know they will struggle in the stage 3 time trial.</p><h3>Stage 3: Atherstone ITT (16.6 km) Wednesday, October 6</h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT2021_Launch-Map_Stage3-v2-02-scaled-1-1340x754.jpg\"></figure><p>Originally Ellen van Dijk was set to show off her brand new Time Trial World Champion rainbow jersey on stage 3 of the Women’s Tour, but unfortunately the Trek-Segafredo rider suffered a concussion in Paris-Roubaix and has been forced to withdraw from the event.</p><p>Without Van Dijk, attention turns to some of the other time trial favourites in the race, especially Lowden. The course is flat as can be with only a few technical turns. It’s going to be very fast, and at 16 km long it will probably favor someone who spends a lot of time in an aero position. Chantal Van den Broek-Blaak (SD Worx) isn’t one to rule out. She was third behind Marlen Reusser and Van Dijk in a similar time trial on stage 2 of the Simac Ladies Tour in August.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT_S3_profile_branded-scaled-1-1340x623.jpg\"></figure><h3>Stage 4: Shoeburyness – Southend-on-Sea (117.8 km) Thursday, October 7</h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT2021_Launch-Map_Stage4-v2-02-scaled-1-1340x754.jpg\"></figure><p>The first stage of the race that is purely for the sprinters, stage 4 is very flat. There is only one climb near the end but it’s nothing to write home about. Since the stage is pretty close to the coast maybe wind will be a factor, and if it does, look to SD Worx and Team DSM to split the field.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT_S4_profile_branded-scaled-1-1340x623.jpg\"></figure><h3>Stage 5: Colchester – Clacton-on-Sea (95.4 km) Friday, October 8</h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT2021_Launch-Map_Stage5-v2-02-scaled-1-1340x754.jpg\"></figure><p>Another course that hugs the coast, stage 5 will probably be another sprinters day. There are three climbs but the ascents will hardly have the fast women shaking in their cleats.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT_S5_profile_branded-scaled-1-1340x623.jpg\"></figure><h3>Stage 6: Haverhill – Felixstowe (155.3 km) Saturday, October 9</h3><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT2021_Launch-Map_Stage6-v2-02-scaled-1-1340x754.jpg\"></figure><p>The final and longest stage of the Women’s Tour will crown the 2021 victor. The stage is similar to the two before, but does start a bit more inland. If the general classification is close, all three of the final days will focus on bonus seconds found scattered along the route – the final day more than the others. If stages 4 and 5 don’t end in bunch sprints, stage 6 definitely will.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/10/WT_S6_profile_branded-scaled-1-1340x623.jpg\"></figure><h2>How to follow</h2><p>Once again we are sans live coverage, but the Women’s Tour will provide post-race highlights packages to Eurosport and GCN+. Check out CyclingTips every day for race reporting and analysis, and if you’re keen to follow the race live on Twitter bookmark both the @uci_wwt account and #WomensTour.</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ec601f8b6937725f66f6f1996789e03e083f1bc263b750fdf37e76224dec5d75","category":"Cycling"}