{"title":"'Exploding Kittens' Creator Launches New 'Kitty Letter' iOS Game","link":"https://www.macrumors.com/2021/02/11/kitty-letter-game-ios/","date":1613081988000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><article expanded=\"true\"><div data-io-article-url=\"/2021/02/11/kitty-letter-game-ios/\"><p>Matthew Inman, the artist behind <em><a href=\"https://theoatmeal.com/\">The Oatmeal</a></em> comics and board games like Exploding Kittens and Throw, Throw Burrito, today announced the launch of a new free-to-play iOS game called Kitty Letter.</p><p>Described as a \"Scrabble combined with Crash Royale\" or \"words with enemies,\" gameplay consists of unscrambling words, with the words then turning into cat armies that march forward and attack the opponent you're playing against.</p><blockquote><p>Only one thing can protect you from legions of exploding cats: Vocabulary!</p><p>Kitty Letter is a head-to-head competitive word game where the best linguist wins. Unscramble words using your enchanted language vortex from the multiverse of infinite vocabularinities, collect power-ups from dysenteric deer, and stop your crazy cat-collecting neighbor from destroying your house!</p></blockquote><p>There's an extensive single player game that features a story by Inman, along with the option to play 1v1 games with either friends or strangers. Gameplay is free, but there are cosmetic in-app purchases that are available.</p><p>Kitty Letter can be downloaded from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> for free. [<a href=\"https://apps.apple.com/app/id1510395712\">Direct Link</a>]</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/02/08/buyers-guide-dont-buy-macbook-pro-now/\">Buyer’s Guide: Don't Buy a MacBook Pro Now</a></h3><p>New MacBook Pro models are expected to arrive later this year with some of the biggest improvements to the product line to date, including some surprising changes, so now is not the best time to buy a new MacBook Pro. With major upgrades expected to key features such as the chipset, display, Touch Bar, charging, ports, and design, customers eyeing a new MacBook Pro may be better off...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-health-app-data-crime-investigation/\">Apple Health App Data Helps Send a Man to Prison for His Wife's Death</a></h3><p>Tuesday February 9, 2021 1:28 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>A man who claimed to be innocent following the death of his wife was found to be guilty after police used evidence sourced from the Apple Health app on his iPhone to convict him. As outlined by The Birmingham News (via Cult of Mac), Kat West, Jeff West's wife, was found dead in January 2018 after suffering a blow to the head. Jeff West claimed that she was drunk and fell while he was asleep...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/apple-releases-macos-big-sur-11-2-1/\">Apple Releases macOS Big Sur 11.2.1 With Fix for MacBook Pro Charging Issue [Updated]</a></h3><p>Tuesday February 9, 2021 10:13 am PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Apple today released macOS Big Sur 11.2.1, the third update to the macOS Big Sur operating system that launched in November. macOS Big Sur‌ 11.2.1 comes a little over a week after the release of macOS 11.2. The new ‌‌‌macOS Big Sur‌‌ 11.2.1‌ update can be downloaded for free on all eligible Macs using the Software Update section of System Preferences. According to Apple's...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/10/useful-mac-accessories-worth-checking-out/\">Useful Mac Accessories Worth Checking Out</a></h3><p>Wednesday February 10, 2021 1:21 pm PST by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>If you recently picked up one of the new M1 Macs that Apple released in November, or received a new Mac for the holidays, you may be in search of useful accessories to go along with it. In our latest YouTube video, we rounded up some great Mac accessories that are worth checking out. Subscribe to the MacRumors YouTube channel for more videos. MacRumors videographer Dan has highlighted several ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/ipad-pro-2021-thicker/\">iPad Pro Getting Thicker in 2021 to Fit New Technology</a></h3><p>Apple's affinity for thin and light product designs is well-known, so it is not often the case that the company chooses to make its existing products thicker. This year, Apple's largest and most expensive iPad offering, the 12.9-inch iPad Pro, is looking to buck the trend and get thicker, according to recent reports. Alleged factory CAD drawings leaked in January revealed that, as...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/02/09/2016-2017-macbook-pro-battery-charging-issue/\">Apple Offering Free Battery Replacements for 2016-2017 MacBook Pros That Can't Charge Past 1%</a></h3><p>Tuesday February 9, 2021 4:45 pm PST by <a href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\">Joe Rossignol</a></p><p>Apple today released macOS Big Sur 11.2.1 to address an issue that may prevent the battery from charging in some 2016 and 2017 MacBook Pro models, and the company has since shared a new support document with more details. Apple says a \"very small number of customers\" with 2016 and 2017 models of the 13-inch and 15-inch MacBook Pro have experienced an issue with the battery not charging past...</p></div></div></div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ec72b3ae506c7029ba775847da513ee300dbc884013134f3e6590c2b3a64f68a","category":"Apple"}