{"title":"Did a new front wheel & tyre combo win the worlds for Ganna?","link":"https://cyclingtips.com/2021/09/did-a-new-front-wheel-tyre-combo-win-the-worlds-for-ganna/","date":1632304330000,"content":"<div><div><p>Filippo Ganna successfully defended the time trial world championships over the weekend. Ganna winning a time trial is hardly extraordinary, however, we did spot some exciting equipment choices on his Pinarello Bolide TT.</p><p>Ganna and the Ineos Grenadiers regularly opt for Princeton Carbonworks wheels for time trials. While the front wheel Ganna opted for in the worlds TT certainly appears to be a Princeton, it is also deeper than anything we have previously seen from Princeton. With its wavy rim shape, the unbranded wheel is clearly a Princeton offering, and the move to offer a deeper profile is on-trend for time trialling with many riders now opting for front wheels right on the UCI limit of 100mm.</p><p>While this new wheel doesn’t quite hit that 100mm, if Princeton’s other wheels are anything to go by, it will likely come with claims of further improved aerodynamics while retaining stability. That extra depth and any potential aero benefits could very well have made a significant difference on the incredibly fast time trial course at this year’s world championships where Ganna took the win by just six seconds.</p><p>Judging by the brakes and valve on Ganna’s wheel, the new rim will have rim brake and tubeless tyre compatibility, only time will tell if Princeton will offer tubular and disc brake options.</p><p>That tubeless valve also raises some questions about Ganna’s tyre selection. At first glance, it appears to be a Continental GP 5000, no surprises there, the GP 5000 is known to be a fast and reliable tyre. However, the tan sidewalls and that tubeless valve is a surprising combination as Continental does not currently offer a tan sidewall tubeless GP 5000. That valve and some permanent marker handiwork on the tyre suggests Continental is about to introduce that very combination. Watch this space!</p></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ed60b46aa71b0b31fcfae5dfcaeabd679d36723b194b6f47737cabfae8de45ba","category":"Cycling"}