{"title":"เทียบสเปก Galaxy A71 และ Galaxy A72 ซีพียูใหม่ กับความแตกต่างอื่นเพียงเล็กน้อย","link":"https://www.blognone.com/node/121801","date":1616318009000,"content":"<div id=\"readability-page-1\" class=\"page\"><div itemprop=\"description\"><p>Samsung เปิดตัว Galaxy A72 มือถือหน้าจอ 6.7 นิ้ว ความละเอียด 1080x2400 พิกเซล รีเฟรชเรต 90Hz ซีพียู Snapdragon 720G ไปเมื่อวันที่ 18 มีนาคมที่ผ่านมา ซึ่งชูโรงว่าเป็นสมาร์ทโฟนที่ “สายเกมเมอร์ต้องจัด” เพราะมาพร้อมกับ Super AI Game Booster+ เพิ่มจัดการประสิทธิภาพและตัดการทำงานอื่นที่ไม่จำเป็นในช่วงเล่นเกม รวมถึงกันน้ำ/กันฝุ่น IP67 ในราคา 13,999 บาท</p><p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b55c439d44613b11f2fb7d89e24f55c1.jpg\"></p><p><strong>เปรียบเทียบ Galaxy A71 กับ Galaxy A72</strong></p><p><a href=\"https://www.blognone.com/node/115778\">Galaxy A71</a> เปิดตัวช่วงธันวาคม 2019 และเปิดราคาไทยช่วง<a href=\"https://www.blognone.com/node/114308\">เดือนมกราคม ปี 2020</a> หน้าจอ 6.7 นิ้ว ความละเอียด 1080x2400 พิกเซล เท่ากัน แต่มีอัตรารีเฟรชเรตต่ำกว่าคือ 60Hz ใช้ซีพียู Snapdragon 730 จีพียู Adreno 618 ส่วนแรม และหน่วยความจำภายใน อยู่ที่ 8GB และ 128GB เท่ากัน ราคาเปิดตัว 13,990 บาท แทบไม่ต่างจากราคาเปิดตัว A72 (ห่างกัน 9 บาท)</p><p><img src=\"https://www.blognone.com/sites/default/files/externals/4bf4df7faf206489e71bed0e7f3a7ce7.jpg\" alt=\"\"><em>Galaxy A71</em></p><p><strong>ประสิทธิภาพ</strong></p><p>แม้ Galaxy A71 มาพร้อมกับ Snapdragon 730 ที่ตัวเลขดูมากกว่า แต่ Snapdragon 720G ของ A72 เป็นรุ่นเล่นเกมที่มีประสิทธิภาพมากกว่า 730 เล็กน้อย โดยทั้งสองรุ่นใช้จีพียู Adreno 618 เหมือนกัน</p><p>Snapdragon 720G มี<a href=\"https://nanoreview.net/en/soc-compare/qualcomm-snapdragon-730-vs-qualcomm-snapdragon-720g#benchmarks\">คะแนนการทดสอบ AnTuTu มากกว่า 730 อยู่ราว 10%</a> คะแนนการทดสอบแบบ Single Core บน Geekbench 5 มากกว่าอยู่ 6% แต่แบบ Multi-Core ยังแพ้ Snapdragon 730 อยู่ 4% ทั้งนี้คะแนนนี้เป็นการทดสอบระหว่าง Xiaomi Mi9T และ Realme 7 Pro ซึ่งใช้ซีพียูคู่เปรียบเทียบเดียวกัน</p><p>ตัวเลขความแตกต่างดังกล่าวเล็กน้อยมาก จนไม่น่าจะส่งผลในการใช้งานจริง คงต้องขึ้นอยู่กับระบบ Super AI Game Booster+ ใหม่บน Galaxy A72 ว่าจะจัดการกับประสิทธิภาพได้ดีกว่าจริงหรือไม่</p><p><strong>หน้าจอ</strong></p><p>Galaxy A71 ใช้หน้าจอขนาด 6.7 นิ้วแบบเจาะรู ความละเอียด 1080x2400 พิกเซล แบบ Super AMOLED 24-bit โดย A72 ยังใช้หน้าจอแบบเดิม ความละเอียดเท่าเดิม มีสแกนลายนิ้วมือใต้จอแบบ Optical เหมือนกัน สิ่งที่เพิ่มเติมมาคือความสว่างสูงสุด จาก 515 nits เป็น 900 nits และเพิ่มอัตรารีเฟรชเป็น 90Hz เท่านั้น</p><p>ส่วนกระจกหน้าจอ รุ่น A71 ใช้ Gorilla Glass 3, A72 ยังไม่มีข้อมูลระบุ แต่ <a href=\"https://www.blognone.com/node/121740\">A52 ที่เปิดตัวพร้อมกัน</a> อัพเกรดเป็น Gorilla Glass 5 ทำให้มีความเป็นไปได้ที่จะเป็น Gorilla Glass 5 เช่นกัน แต่คงต้องรอข้อมูลเพิ่มเติม</p><p><strong>กล้อง</strong></p><p>Galaxy A71 มีกล้องหลัก 64MP f/1.8 กล้องอัลตร้าไวด์ 12MP f/2.2 กล้องมาโคร 5MP f/2.4 และ depth sensor 5MP f/2.2</p><p>ส่วน A72 แค่เปลี่ยนเอากล้อง depth sensor ออก แล้วใส่กล้องเทเลโฟโต้ ซูมสองเท่า ความละเอียด 8MP f/2.4 เข้ามาแทนเท่านั้น ส่วนกล้องหน้าเป็นความละเอียด 32MP f/2.2 เท่าเดิม</p><p><strong>แบตเตอรี่ และซอฟต์แวร์ และการเชื่อมต่อ</strong></p><p>แบตเตอรี่ A71 ความจุ 4,500 mAh ส่วน A72 เพิ่มมาเล็กน้อยเป็น 5,000 mAh น่าจะต่างกันไม่มากนัก และรองรับชาร์จเร็ว 25W เท่าเดิม</p><p>ด้านซอฟต์แวร์ A71 มาพร้อมกับ Android 10 ครอบด้วย One UI 2 แม้จะอัพเกรดเป็น Android 11 พร้อม One UI 3.1 ได้ แต่ก็จะหมดรุ่นอัพเกรดตามที่ Samsung การันตีไว้ที่ Android 13 เท่านั้น ส่วน A72 มาพร้อมกับ Android 11 ครอบด้วย One UI 3.1 จากโรงงาน ก็จะได้อัพเกรดถึง Android 14 ทำให้อายุการใช้งานน่าจะมากกว่าอีกหนึ่งปี</p><p>ด้านการเชื่อมต่อ ไม่มีข้อแตกต่าง ทั้งสองรุ่นรองรับเครือข่ายแค่ 4G ไม่รองรับ WiFi 6 และรองรับ Bluetooth 5.0</p><p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5218793d022ed77f518c096e850d30a0.png\"></p><p><strong>สรุป</strong></p><p>Galaxy A71 และ Galaxy A72 เป็นมือถือสองรุ่นที่แตกต่างกันน้อยมาก แม้ออกขายห่างกันนานหนึ่งปีกว่า สรุปข้อแตกต่างได้แค่เพียงซีพียู (ต่างเพียงเล็กน้อย) หน้าจอ 90Hz, กล้องเทเลโฟโต้ที่เข้ามาแทน depth sensor ดีไซน์ สี และคุณสมบัติกันน้ำ กันฝุ่น IP67 เท่านั้น</p><p>สุดท้ายแล้วการตัดสินใจซื้อน่าจะเป็นเรื่องของงบประมาณมากกว่า เพราะ Galaxy A71 ปรับราคาเหลือ 11,990 บาท บนหน้าเว็บไซต์ <a href=\"https://www.samsung.com/th/smartphones/galaxy-a/galaxy-a71-a715-sm-a715fzkethl/\">Samsung</a>แล้ว และอาจหาได้ถูกกว่านี้ หรือในราคาไม่ถึงหนึ่งหมื่นบาทบนช่องทางอื่น แต่ก็ต้องแลกมาด้วยการซัพพอร์ตที่น้อยกว่าประมาณ 1 ปี หน้าจอ 60Hz และการไม่มีเลนส์ซูม (ซึ่งก็ไม่น่าเป็นปัญหาสำหรับหลายๆ คน)</p><p>Galaxy A72 เอง แม้จะมีจุดขายว่าเป็นมือถือสำหรับเกมเมอร์ แต่ความแตกต่างจาก Galaxy A71 ยังมีไม่มากนัก เมื่อเทียบกับ <a href=\"https://www.blognone.com/node/121786#comment-1203513\">Galaxy A52/A52 5G ที่มีข้อแตกต่างจาก A51 มากกว่า</a> โดยเฉพาะการเปลี่ยนซีพียู Exynos มาเป็น Snapdragon ทั้งสองรุ่น</p><p>อย่างไรก็ตาม Galaxy A71 เอง ก่อนหน้านี้ก็มีรุ่น 5G แยกออกมาภายหลัง และ Galaxy A52 ก็ออกรุ่น A52 5G (ที่ใช้ซีพียู Snapdragon 750G แรงกว่า Snapdragon 720G บน A72) มาพร้อมกันด้วย แปลว่าเราอาจจะได้เห็น Galaxy A72 5G ที่มีการอัพเกรดด้านอื่นๆ มากกว่านี้ในอนาคตก็เป็นได้</p><p><img src=\"https://www.blognone.com/sites/default/files/externals/38d9ed796d17c493a06eb09c177ca686.jpg\" alt=\"\"><em>Galaxy A72</em></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"eee0bffcab4f63dac5dde811f6e9d52ed78ce755c8edeb031c46bfd62c433a45","category":"Thai"}