{"title":"Merlier and Kopecky take wins at Le Samyn, Pogacar extends: Daily News","link":"https://cyclingtips.com/2021/03/merlier-and-kopecky-take-wins-at-le-samyn-pogacar-extends-daily-news/","date":1614727835000,"content":"<div id=\"readability-page-1\" class=\"page\"><p></p><h4>Tim Merlier wins Le Samyn.</h4><p></p><div><p>Hello again, CyclingTips readers,</p><p>Tuesday featured racing action in Belgium at Le Samyn, while Tadej Pogacar has signed a contract extension to stick with UAE-Team Emirates all the way through 2026.</p><p>Read on for the latest from the world of cycling.</p><p><em>Dane Cash<br>News Editor</em></p><h2>What’s news?</h2><h3>Merlier sprints to victory at Le Samyn</h3><p><strong>Tim Merlier</strong> powered to the men’s victory in a reduced sprint at Le Samyn on Tuesday.</p><p>The 205.4 km one-day from Quaregnon to Dour featured plenty of action with several flurries of attacks and regroupings in the last 60 km of the day. <strong>Victor Campenaerts</strong> led solo into the last 20 km before he was caught, and then his Qhubeka-Assos teammate <strong>Lukasz Wisniowski</strong> attacked off the front. Inside the last 4 km, <strong>Florian Sénéchal</strong> moved to bridge and <strong>Mathieu van der Poel</strong> followed. They caught and passed Wisniowski, but Van der Poel was hampered by a broken handlebar (more on that in a moment). The pair were soon caught by a small group of chasers, and then the reduced peloton made contact.</p><p>Campenaerts tried to get clear in the last kilometer but could not open much of a gap. In the ensuing sprint, <strong>Rasmus Tiller</strong> powered out to an early lead, but he could not hold off Merlier, who surged past in the final hundred meters to take his first win of 2021. Tiller settled for second with <strong>Andrea Pasqualon</strong> taking third on the day.</p><p><strong>Top 10</strong></p><p>1 MERLIER Tim (Alpecin-Fenix) 4:34:29<br>2 TILLER Rasmus (Uno-X Pro Cycling Team)<br>3 PASQUALON Andrea (Intermarché – Wanty – Gobert Matériaux)<br>4 VANMARCKE Sep (Israel Start-Up Nation)<br>5 HOFSTETTER Hugo (Israel Start-Up Nation)<br>6 CAPIOT Amaury (Team Arkéa Samsic)<br>7 DEGENKOLB John (Lotto Soudal)<br>8 CLAEYS Dimitri (Team Qhubeka ASSOS)<br>9 DUPONT Timothy (Bingoal – Wallonie Bruxelles)<br>10 MENTEN Milan (Bingoal – Wallonie Bruxelles)</p><p>You can <a href=\"https://www.eurosport.com/cycling/le-samyn/2021/2021-le-samyn-men-s-highlights-as-tim-merlier-wins-the-race_vid1440986/video.shtml\" target=\"_blank\" rel=\"noreferrer noopener\">watch highlights of the race here</a>.</p><h3>Kopecky takes the win at Le Samyn</h3><p><strong>Lotte Kopecky</strong> took the women’s victory at Le Samyn with a well-timed sprint.</p><p>The 92.5 km race saw numerous attacks in the last 20 km, but the peloton closed down one more after another as the race approached Dour. Inside the last 4 km, <strong>Marlen Reusser</strong> spurred a last-ditch effort to get clear on the final cobbled sector, but the peloton reeled that in as well to set up a fast finish.</p><p><strong>Emma Norsgaard</strong> opened her sprint early with <strong>Chloe Hosking</strong> close behind at first, but Kopecky came around and powered to the front as the line approached to nab a convincing victory, her first of the year and her first with her new team Liv Racing. Norsgaard took runner-up honors with Hosking in third.</p><p><strong>Top 10</strong></p><p>1 KOPECKY Lotte (Liv Racing) 2:20:04<br>2 NORSGAARD Emma Cecilie (Movistar Team)<br>3 HOSKING Chloe (Trek-Segafredo Women)<br>4 VERHULST Gladys (Team Arkéa)<br>5 VAN ‘T GELOOF Marjolein (Drops)<br>6 PIETERS Amy (SD Worx)<br>7 TOMASI Laura (Alé BTC Ljubljana)<br>8 HENDERSON Anna (Team Jumbo-Visma Women)<br>9 VAN DER HULST Amber (Parkhotel Valkenburg)<br>10 KASPER Romy (Team Jumbo-Visma Women)</p><p>You can <a href=\"https://www.eurosport.com/cycling/le-samyn/2021/le-samyn-2021-women-s-highlights-catch-up-with-everything-from-the-race_vid1441093/video.shtml\" target=\"_blank\" rel=\"noreferrer noopener\">watch highlights of the race here</a>.</p><h3>Van der Poel: ‘I couldn’t do my thing’ with broken handlebar</h3><p><strong>Mathieu van der Poel</strong> explained after Le Samyn that his broken handlebar prevented him from riding the way he otherwise might have in the finale, and so he decided to shift his focus towards working for <strong>Alpecin-Fenix</strong> teammate <strong>Tim Merlier</strong> instead.</p><p>“I actually still felt very good,” Van der Poel said, according to Het Nieuwsblad. “But because my handlebar broke, I could no longer apply power. It happened on that long cobblestone strip. I couldn’t do my thing anymore and let the team know that we would ride for Tim. I did everything to paralyze that small leading group. Then I’m glad Tim was able to finish it.”</p><p>James Huang has more on the subject of <a href=\"https://cyclingtips.com/2021/03/yep-mathieu-van-der-poels-handlebar-broke-but-its-not-what-you-think/\" target=\"_blank\" rel=\"noreferrer noopener\">Van der Poel’s broken bar</a>.</p><h3>Pogacar extends with UAE-Team Emirates</h3><p><strong>UAE-Team Emirates</strong> announced on Tuesday that it had <a href=\"https://cyclingtips.com/2021/03/tadej-pogacar-extends-contract-with-uae-emirates-through-2026/\" target=\"_blank\" rel=\"noreferrer noopener\">extended the contract of <strong>Tadej Pogacar</strong></a>, adding to more years to the contract of the reigning Tour de France champion.</p><p>That will keep Pogacar with the UAE team all the way through 2026, in what is quite a long-term agreement for a cycling pro.</p><p>“I feel at home in this team,” Pogacar said in a press release. “There is a special atmosphere between the management, riders and staff and it’s a good environment to be in. The team shows a lot of trust and confidence in me which I am thankful for and I work hard to show that when I’m racing alongside my teammates. I hope we can have many more successful seasons together in the years ahead.”</p><h3>Volta a Catalunya will feature a time trial</h3><p><strong>Volta a Catalunya</strong> organizers have unveiled that route of the 2021 edition of race, which will feature plenty of climbs (as usual) and also an individual time trial.</p><p>Riders will take on an 18.5 km individual TT on the second stage of the seven-day race, and the GC riders will face more challenges soon after, with a climb to Valter 2000 closing out stage 3 and two special-category climbs closing out stage 4. In keeping with previous years, the seventh and final stage will be another tough one, featuring several trips up Alt del Castell de Montjuïc in the finale.</p><p>The Volta a Catalunya kicks off on March 22.</p><h3>Geoghegan Hart: ‘If we don’t want opinions and characters in sport, let’s just watch robots compete’</h3><p>A week after footballer (soccer player) Zlatan Ibrahimovic opined that athletes like NBA player LeBron James should steer clear of politics, <strong>Tao Geoghegan Hart</strong> has expressed his strong disagreement with that notion in an interview with <a href=\"https://www.theguardian.com/sport/2021/mar/02/everything-is-political-tao-geoghegan-hart-exclusive\" target=\"_blank\" rel=\"noreferrer noopener\">The Guardian</a>.</p><p>“First and foremost, everything is political. We are all in this together. Secondly, there are many who simply do not have the choice whether they are political or not, because these issues so directly impact their lives and the lives of their friends, families and loved ones,” said the reigning Giro d’Italia champ, who recently announced that he would fund a spot on the Axeon Hagens Berman team in an effort to boost diversity in cycling.</p><p>“I deplore racism. I want the best for all people. Sport should be a reflection of talent, of diversity, of all the incredible characters out there in this world.</p><p>“If we don’t want opinions and characters in sport, let’s just watch robots compete. As a fan I don’t cheer for the best rider, runner or player. I back the one I relate most to, the one who inspires me. There is more to sport than simply athletic ability. And championing a positive cause, that you believe in, is a huge part of that, of trying to leave the world a better place than you found it.”</p><h2>In case you missed it…</h2><ul><li><strong>Cane Creek’s</strong> second-generation <strong>eeSilk suspension seatpost</strong> has the same 20 mm of travel, but it is <a href=\"https://cyclingtips.com/2021/03/second-gen-cane-creek-eesilk-suspension-seatpost-is-sleeker-more-affordable/\" target=\"_blank\" rel=\"noreferrer noopener\">quieter, smoother, and more affordable</a>.</li><li><strong>Adidas’s Samba</strong> design is <a href=\"https://cyclingtips.com/2021/03/velosamba-shut-up-and-take-my-money-adidas/\" target=\"_blank\" rel=\"noreferrer noopener\">now available in a cycling shoe</a>.</li></ul><div><h5>Tags</h5></div></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"eef8385db2740db1446d7bbe11b0c102f24d28d6913b4f3d09f774d7e2f797b7","category":"Cycling"}