{"title":"Bitcoin’s value just passed $1 trillion","link":"https://arstechnica.com/?p=1743919","date":1613773692000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Trillion with a T —</h4><h2 itemprop=\"headline\">Bitcoin boom pushes total value past $1 trillion</h2><h2 itemprop=\"description\">Bitcoin creator Satoshi Nakamoto may have mined 1M bitcoins worth $55 billion.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-924986096-800x600.jpg\" alt=\"Bitcoin’s value just passed $1 trillion\"><figcaption></figcaption></figure><p>Bitcoin's price soared past $56,000 on Friday, pushing the combined value of all bitcoins past the $1 trillion mark—at least in theory. That's more than the market capitalization of Facebook, though Apple, Alphabet, Amazon, and Microsoft are worth more. Bitcoin's value has almost doubled from $29,000 since the start of the year.</p><p>I say \"in theory\" because not all bitcoins are actually available for use. Each bitcoin (or fraction of a bitcoin) is secured by one or more cryptographic signatures. To transfer a bitcoin, you need to know its corresponding private key. And some of those keys have been lost—and it's impossible to know how many.</p><p>For example, a British man says he threw away a hard drive in 2013 that <a href=\"https://www.cnn.com/2021/01/15/uk/bitcoin-trash-landfill-gbr-scli-intl/index.html\">contained the keys</a> to 7,500 bitcoins—worth around $400 million at today's price. He sought permission to excavate the dump containing the hard drive, but the request was denied.</p><p>This kind of incident has been repeated many times over the past 12 years. It was likely an especially common occurrence in the first two years of bitcoin's operation, when you could get a bitcoin for a fraction of a penny. In 2010, a man <a href=\"https://finance.yahoo.com/news/10-years-laszlo-hanyecz-bought-143000184.html\">paid 10,000 bitcoins</a> for two pizzas—a transaction now widely recognized as the first commercial bitcoin payment.</p><p>Back then, it was common for people to mine a few hundred bitcoins—or even many thousands—and then forget about them, since they might be worth too little to be worth the trouble of selling them. By the time owners realized the bitcoins were valuable, the data might have been lost.</p><p>The world's biggest stash of bitcoins is probably the one owned by the pseudonymous bitcoin creator Satoshi Nakamoto. In the cryptocurrency's early months, Nakamoto is estimated to have <a href=\"https://decrypt.co/34810/how-many-bitcoin-does-its-inventor-satoshi-nakamoto-still-own\">mined more than 1 million bitcoins</a>.</p><p>Nakamoto never revealed his true identity, and he disappeared from public view in 2011. No one knows if he's still alive; those 1 million bitcoins haven't been transferred since they were created more than a decade ago.</p><p>But if Nakamoto held on to the private keys, his net worth would be more than $50 billion today—sufficient to make him among the 20 wealthiest people in the world.</p><p>Two other likely bitcoin billionaires are <a href=\"https://www.cnbc.com/2017/12/05/winklevoss-twins-head-the-list-of-people-getting-very-rich-from-bitcoin.html\">Tyler and Cameron Winklevoss</a>. The Harvard alums first came to prominence during a legal battle over Facebook's origins as a social network for Harvard students. After they settled their legal battle with Mark Zuckerberg, they <a href=\"https://www.cnbc.com/2017/12/05/winklevoss-twins-head-the-list-of-people-getting-very-rich-from-bitcoin.html\">spent $11 million</a> to buy bitcoins in 2013. At a reported price around $120, they might have gotten nearly 100,000 bitcoins—which would give them a net worth of several billion dollars today.</p></div></div>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"effdcc20d881fadabf3945d8672e962e88df602631d61774808efb63d0c20a90","category":"Tech"}