{"title":"Florian Sénéchal wins Vuelta stage 13 after chaotic final few kilometres","link":"https://cyclingtips.com/2021/08/florian-senechal-wins-vuelta-a-espana-stage-13-after-chaotic-final-few-kilometres/","date":1630079153000,"content":"<div><div><p>Florian Sénéchal took over sprinting duties on stage 13 of the Vuelta a España and delivered another stage victory for Deceuninck-Quick Step. Matteo Trentin (UAE Team Emirates) finished second with Alberto Dainese (Team DSM) taking third.</p><p>The general classification contenders left the finish to the sprinters and finished safely together. Odd Christian Eiking (Intermarché-Wanty-Gobert Matériaux) remained in the red jersey with a mountainous stage coming up on stage 14.</p><p>A breakaway of three Spanish riders attacked early in the stage and stayed out front for the majority of the day. Team Qhubeka NextHash did try to create an echelon and split the peloton but their attempt didn’t last long.</p><p>The breakaway was caught with 29 km to go as the sprinter’s teams eyed the intermediate sprint with 13 km to go. It was won by Fabio Jakobsen (Deceuninck-Quick Step) who built up more of a lead in the points classification.</p><p>The pace really started to pick up with 3.5 km to go, with Deceuninck-Quick Step leading the race. Multiple roundabouts and tight turns scattered throughout the final kilometres caused splits in the peloton and it was Jakobsen who was caught out. With 1.5 km to go Jakobsen suffered from a mechanical and left his team at the front of the peloton.</p><p>Trentin took Jakobsen’s spot behind the Deceuninck-Quick Step train in the final kilometre. A reduced group sprinted for victory in Villanueva de la Serena and Sénéchal came away with the win.</p><hr><div><div><p>La Vuelta ciclista a España (2.UWT) <span>Belmez → Villanueva de la Serena</span></p></div><p><img src=\"https://www.procyclingstats.com/images/riders/cw/ec/florian-senechal-2021.jpeg\"></p></div></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f05de0d0f606a329915c0ba110f2c86f2b87ea398cf31094ceaada61248bfc94","category":"Cycling"}