{"title":"A SuperDuper Workaround for Big Sur and M1 Macs","link":"https://www.shirtpocket.com/blog/index.php/shadedgrey/thats_big_sir_to_you/","date":1612399299000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Hey, folks. Sorry it's been a while, but it's been a busy time. Let's start with the bad news first.</p><h2>Bad news</h2><p>As you know, SuperDuper 3.3.1 cannot copy a volume with Big Sur on it. We're currently blocked on some issues I don't have direct control over, and as such I don't have a new version for you that <strong>fully</strong> supports Big Sur, nor a timeframe for when that will be released.</p><p>Right now, as many of you know, v3.3.1 <strong>will</strong> work with non-boot volumes, but it <strong>won't</strong> work with volumes that have macOS on them, because it will try to do some of the things that no longer work in macOS 11.</p><p>I know that's been a disappointment, but that's where we are with v3.3.1.</p><h2>Good news!</h2><p>However, after wracking my brain for <strong>far</strong> too long, I've come up with a <strong>workaround</strong> that will let you make the backups you need to save your files, and to supplement your Time Machine backup. And for that, we need to go Back...to the Future!</p><h2>Huh?</h2><p>Let me try to explain.</p><p>In Catalina, as I explain in <a href=\"https://www.shirtpocket.com/blog/index.php/shadedgrey/comments/breaking_the_tape/\">Breaking the Tape</a>, Apple split the startup volume into two parts: the System volume and the Data volume. We did a ton of work that year to support this new setup in a way that was transparent to the user; SuperDuper automatically creates the proper volumes, converts the drives to APFS as needed, etc.</p><p>Worked great.</p><p>In macOS 10.15.5, though, <a href=\"https://www.shirtpocket.com/blog/index.php/shadedgrey/comments/black_boxes_and_bugs/\">Apple broke 3rd party copy tools</a> in a way that couldn't be worked around without the use of <code>asr</code>, a low-level drive copy tool that has its own issues. They fixed that in 10.15.6...but it was a rather ominous sign for the future.</p><p>That ominous sign became terrifying reality in macOS 11. Due to the new Sealed System Volume, use of <code>asr</code> became mandatory if you wanted to make a copy that was bootable. And even <strong>that</strong> didn't work <strong>at all</strong> until <a href=\"https://www.shirtpocket.com/blog/index.php/shadedgrey/comments/big_sur/\">November 5th</a> of last year—just before Big Sur's official release.</p><p>Even now, as of the time of this writing, <code>asr</code> won't make a bootable copy of an M1-based Mac.</p><p>So, as of Big Sur, 3rd party tools like SuperDuper can no longer make bootable copies on their own. For that, it's <code>asr</code> or nothing.</p><p>It is, indeed, <a href=\"https://mjtsai.com/blog/2007/06/13/a-very-sweet-solution/\">a <em>very</em> <strong>sweet solution</strong></a>.</p><p>But, 3.3.1 doesn't know that. It tries to do all the special stuff that we had to do for Catalina, and those things no longer work. And so, as you've seen, that copy generates errors or seems to hang right at the start (because it's thrown exceptions that stop the copy).</p><h2>Didn't You Say \"Good News\"?</h2><p>I'm getting there.</p><p>SuperDuper! 3.3.1's magic was all about dealing with the split startup volume. It built on the APFS support and scheduling fixes we put into the previous version...and added new things for compatibility with Catalina.</p><p>But...what if it <strong>didn't</strong> do that? What if SuperDuper was...<strong>stupider</strong>?</p><h2>Wonderfully Awful</h2><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/oUUdW2bTa3Y\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe><p>I've been testing this out for a while in-house. and I've come up with a weird-sounding workaround that...works!</p><p>Basically, you can use SuperDuper to copy the Data volume of the volume group. The result contains all <strong>your</strong> data and applications, can be restored in a few different ways...and can even be made bootable.</p><blockquote><p>Note that, as I indicated above, M1 Macs <strong>can't readily boot from external drives</strong>. There are things you can do, if you have an external Thunderbolt 3 drive (USB-C isn't sufficient), but even that won't work if the internal drive is dead. Unless things change, bootable backups are basically a thing of the past on M1-based Macs.</p></blockquote><h2>How?</h2><p>It's actually easy. To accomplish this, use an old version of SuperDuper—<a href=\"https://www.shirtpocket.com/mint/pepper/orderedlist/downloads/download.php?file=https%3A//www.shirtpocket.com/downloads/SuperDuper%21+3.2.5.dmg\">specifically, v3.2.5</a>—to copy the Data volume, which is shown in the older version!</p><p>v3.2.5 is well tested, having been on the market for quite some time, and is reliable. So we don't have to worry about doing a broad beta test of a partially complete new release. It's already tested, and I've been busy doing the additional testing necessary to prove it works on Big Sur.</p><p>Again, this will make a copy of the data that you need to preserve <strong>your</strong> stuff, both Applications and Data, while leaving the Sealed System Volume alone.</p><p>And it's a valid source for \"restore\" during a clean install or migration! So restoration is <strong>easy</strong> and <strong>fast</strong> should it become necessary.</p><h2>Neat!</h2><p>Yeah, I wish I had thought of this earlier.</p><p>So, if you're on Big Sur, and you want to copy a startup drive, here's what to do:</p><ol><li>Make sure you have your license information handy. You can retrieve it from SuperDuper's Register... page should you need to.</li><li>Download and install <a href=\"https://www.shirtpocket.com/mint/pepper/orderedlist/downloads/download.php?file=https%3A//www.shirtpocket.com/downloads/SuperDuper%21+3.2.5.dmg\">SuperDuper! v3.2.5 from here</a>.</li><li>Remove SuperDuper! from the \"Full Disk Access\" list in the Security &amp; Privacy preference pane and restart your Mac. This is important, and works around an Apple bug triggered by the change of SuperDuper!'s bundle ID.</li><li>Run SuperDuper and follow the steps to allow it Full Disk Access.</li><li>If your license is missing, re-enter it from your license email.</li><li>Turn off \"Check for Updates\" in our Preferences so we don't nag you about v3.3.1.</li><li>Select the \"Data\" volume in the source pop-up, and a <strong>new</strong> APFS backup volume in the destination pop-up, along with \"Backup - all files\" (or whatever script you want). If you already have a backup volume, you can use Disk Utility to select and delete <strong>just</strong> the backup System volume, rather than create a new one. After doing this, rename the Data volume to something sensible (remove \"- Data\"). Note that you may need to repair it with Disk First Aid before it will show up in SuperDuper.</li><li>Make your copy as normal, set up your schedule as needed, etc. Your regular Smart Updates will work as expected.</li></ol><p>To fully restore, it's easiest to boot to recovery, erase the internal drive you want to restore to, <a href=\"https://support.apple.com/en-us/HT204904\">reinstall the OS from Recovery mode</a>, and then, when prompted to restore during the first boot of the fresh copy of macOS, point at the backup. All your data and applications will be brought in automatically.</p><blockquote><p>If you want to make the backup bootable and have an Intel Mac, boot to Recovery (Cmd+R during power on) and install Big Sur to the backup drive. You can then start up from the backup. Note, though, that once made bootable, you can no longer copy <strong>to</strong> the backup until you delete the system volume as above. So <strong>don't</strong> do this unless you need to.</p></blockquote><h2>Forward-Looking Statements</h2><p>It seems clear that the future of bootable backups is unclear.</p><p>M1 Macs <strong>can't</strong> be copied in a way that makes them bootable. Bare metal recovery on an M1 Mac isn't possible, since they depend on the contents of their internal drive even when booting externally. And the tools required to make bootable copies of Intel Macs are limited, often fail, and produce inscrutable and undocumented diagnostics when they do.</p><p>Everything's a tradeoff, and with the M1 Macs, Apple has given us an amazing new platform, while taking away some of the things that made macOS such a joy to work with. And one of those things is bootable backups.</p><p>I have <strong>no idea</strong> if this is going to change for the better in whatever the next macOS version brings, and have no insight into Apple's future plans.</p><p>But I <a href=\"https://www.shirtpocket.com/blog/index.php/shadedgrey/comments/practices_make_perfect_backups/\">continue to advise multiple backup strategies</a>, including Time Machine (to an APFS volume under Big Sur), SuperDuper! (for a simple copy of your data and applications) and an online backup program (as a last resort).</p><p>With that, back to plugging away at a new version.</p><p>Thanks for reading, and for using SuperDuper.</p></div></div>","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"f337e7f17967ecc262c017c11f70bca596012f95b2e1e60f316971c17f397998","category":"Tech"}