{"title":"41 and flying: Like it or not, Valverde is still among the world’s best","link":"https://cyclingtips.com/2021/04/41-and-flying-like-it-or-not-valverde-is-still-among-the-worlds-best/","date":1619410735000,"content":"<div><div><p>In 2020, Alejandro Valverde went winless for the first season in a decade. After nearly two decades racing at the highest level – less a two-year doping ban – it seemed like the 40-year-old Spaniard was finally starting to slow down.</p><p>Four months into the 2021 season, though, and Valverde is giving a vastly different impression.</p><p>His season started inconspicuously at the UAE Tour in February, but fourth overall at the Volta a Catalunya in March suggested a promising trajectory. His solo win at the GP Miguel Indurain in early April was his third victory at the Spanish 1.Pro race and his first win in nearly 20 months. Equally impressive was his seventh overall at the Itzulia Basque Country the following week where he was among the race’s best climbers.</p><p>And then came ‘Ardennes Week’, ever a bountiful hunting ground for the man from Murcia. There, Valverde left little doubt that he is still among the world’s best.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Kramon_Lie%CC%80geBastogneLie%CC%80ge2021_0574-1340x893.jpg\"><figcaption>Valverde in action at Sunday’s Liège–Bastogne–Liège.</figcaption></figure><p>At last Sunday’s Amstel Gold Race, Valverde rode to a commendable fifth, in an elite chase group just seconds behind the winning trio. At Wednesday’s Flèche Wallonne, a race he has won a record five times, Valverde rode to third place – his eighth podium finish at the race.</p><p>For most riders a podium at a WorldTour one-day would be a career highlight, and certainly at 40 years old. For Valverde, it was a result that left him wondering what could have been, had his positioning been better on the race-ending ascent of the Mur de Huy.</p><p>“I knew I had to be up there in a good position but that wasn’t possible,” Valverde said afterwards. “In the end I had to work my way up here and there and made a big effort to do so. I was third, and I’m happy, but I think I had the legs to be a bit further up at the end.”</p><p>But it was his ride at yesterday’s Liège–Bastogne–Liège that was perhaps Valverde’s most impressive effort of the season thus far.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Kramon_FlecheWallonne2021_0386-1340x918.jpeg\"><figcaption>Valverde after taking third at Flèche Wallonne.</figcaption></figure><p>On his 41st birthday, Valverde never looked in trouble as the race split over the day’s final climb, the Côte de la Roche-aux-Faucons. When the dust cleared, Valverde was safely ensconced in the final selection of five riders. As that quintet approached the finish in Liège, he was among the most likely to win the sprint.</p><p>Valverde was forced to lead out that sprint from the front, and made his surge with around 250 metres to go. He’d ultimately be swamped by those with younger legs and finish the day in fourth.</p><p>“Of course I would have liked to get on the podium, but I felt very good and I saw myself in front again in one of the most beautiful races of the season,” he wrote later on Twitter.</p><p>Had Valverde managed to win the sprint, it would have been his fifth victory at ‘La Doyenne’, a result that would have drawn him alongside the greatest ever, Eddy Merckx, in the record books. Instead, Valverde will have to settle for four career victories at the Belgian Monument, and a total of eight top-four finishes.</p><p>Or will he?</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/04/Kramon_Lie%CC%80geBastogneLie%CC%80ge2021_3253-1340x754.jpg\"><figcaption>Valverde (centre) en route to fourth at Liège–Bastogne–Liège.</figcaption></figure><p>At times last year, and even <a href=\"https://cyclingtips.com/2021/01/alejandro-valverde-confirms-that-he-plans-to-retire-at-the-end-of-2021/\" target=\"_blank\">into this year,</a> Valverde was clear: the 2021 season would be his last as a professional bike racer. Partway through that ‘final’ season though, any sense of clarity appears to be gone.</p><p>“Last year, I was saying no, but this year I’ve got great feelings again, so it’s not clear if I’ll stop or carry on,” Valverde said after Flèche Wallonne. “The only reason [to continue on 2022] would be if for one reason or another the season ends up very dull,” he told Spanish sports daily <a href=\"https://www.marca.com/ciclismo/2021/01/22/6009d37b268e3e1f748b456e.html\" target=\"_blank\">Marca</a> back in January. “It would be a shame to leave if there are hardly any races due to the virus, and the season is grey and flat. I wouldn’t like that, and I would reconsider it.”</p><p>The door appears to be open for Valverde to continue on at Movistar too. As he told Marca, his contract with Abarca Sports – Movistar’s holding company – extends for another four years; as a rider this season and in another as-yet-undisclosed role beyond that.</p><blockquote></blockquote><p>For all his considerable success over the years, Valverde remains one of the sport’s most polarising figures. His <a href=\"https://www.theguardian.com/sport/2010/jun/01/alejandro-valverde-ban\" target=\"_blank\">two-year ban</a> from the sport in 2010-11, after being implicated in the Operación Puerto blood doping investigation, is a bright stain on his record. To many, the fact Valverde remains unwilling to acknowledge his apparent wrongdoing (let alone repent for it) makes him unworthy of forgiveness. For some, questions remain about whether Valverde’s strength so late into his career can be traced back, at least in part, to earlier “assistance”.</p><p>Regardless of your feelings about Valverde, his longevity and competitiveness are beyond doubt. That he remains one of the world’s best is plain to see. And he’s not done yet: he’s got his sights on a medal at the postponed Tokyo Olympics in July.</p><p>“I am focused on the Olympic Games and trying to reach the highest level,” he said at <a href=\"https://as.com/ciclismo/2021/03/02/mas_ciclismo/1614698978_996865.html\" target=\"_blank\">an awards presentation</a> earlier this year. “There is still a lot left. I hope to reach 100%.”</p><p>Assuming Valverde is selected to the Spanish squad for Tokyo, it will be his fifth visit to the Olympics. He’s raced every edition since the 2004 Olympics in Athens. With a best result of 13th in the Beijing road race in 2008 (won by teammate Sammy Sanchez), a top result at the Olympics remains a rare gap in a palmares that includes more than 130 victories, four Monument wins, and a Grand Tour victory.</p><p>That Grand Tour victory? The 2009 Vuelta a España. It’s at this home Grand Tour that Valverde is likely to close out his 2021 season, if not his career. Valverde’s record at the Vuelta is remarkable – in 14 starts, he’s finished the race 13 times, and finished in the top 10 on 12 occasions. He’s hoping for another top result there later this year.</p><p>“I’d like [for the Vuelta to] be like a party for being the last year,” he told Marca. “I’ll enjoy it and try to win again, but I won’t obsess over it. If the wins come, they will; if not, well, <em>no pasa nada</em>. I’ve had a great time during all these years, and I hope the ending is just as good.”</p><p>We’ll have to wait some months before we know whether 2021 is the ending of Valverde’s time as a pro racer. He doesn’t seem to have decided. Perhaps an Olympic medal or top Vuelta finish will tip the balance in favour of a 2021 retirement.</p><p>Regardless, Valverde’s showing at the Ardennes Classics makes it clear that, after all these years, he remains one of the very best in the sport. What else can he achieve before the curtain closes on his brilliant but divisive career?</p></div></div>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f3c364d90772868501991109d7d235219e5fbd3cf1ed132261536e07acb681ac","category":"Cycling"}