{"title":"How one club’s pride crit is a roadmap to representation","link":"https://cyclingtips.com/2021/11/how-one-clubs-pride-crit-is-a-roadmap-to-representation/","date":1637627270000,"content":"<div><div><p>Something small but significant happened last week in cycling. It was about as far away from the WorldTour as you can get, but the ripple effect might prove to be far-reaching.</p><p>Carnegie Caulfield Cycling Club, one of Australia’s oldest cycling clubs, hosted the first ever pride round of its summer crit series. Five years after the AFL (Australian Rules football) introduced its first pride round, a local club from a different sport stepped up to the plate and created history in the same city of Melbourne.</p><p>I was grateful to talk to the person who initiated this event to ask all about it. Alex Smyth is a well-known Australian-Maltese cyclist that has raced for teams such as State of Matter MAAP Racing, NSWIS, and Drapac EF Cycling. He has been a committee member of the CCCC for over five years, and since July this year has taken up the inaugural role of Diversity and Inclusion Ambassador for the club.</p><p>Coincidentally, Alex and I were housemates in Belgium a decade ago at a time when we were both chasing amateur races and seeing if we could cut it on the road. We didn’t know each other but were fast friends, sharing the home of a Team Sky mechanic on the outskirts of Oudenaarde, the heartland of Belgian cycling. Much has happened for both of us since then, but our paths have paralleled in recent years.</p><p>For the same reason I said ‘yes’ to helping create <a href=\"https://cyclingtips.com/tag/the-cyclists-alliance/\" target=\"_blank\">The Cyclists’ Alliance</a>, Alex asked himself the question “If not me, then who?” After being the confidant to many closeted friends and acquaintances in cycling he realised that there was no representation in his sport – particularly for males – and something needed to change.</p><p>Being a spokesperson is a scary and vulnerable thing to do, but for some of us it is a logical step to creating the world we want to live in. Instead of complaining that things should be better, we stand up and start to make the change ourselves. Alex made the brave decision to ask his club to run a pride round and show all members, and the broader cycling community, that cycling is for everyone. He wanted to let people know that showing up no matter your identity, and “just [being] who you are”, are welcomed attitudes at his club.</p><p>There has been much conjecture as to why there are no openly gay male professional riders. <a href=\"https://www.cyclingweekly.com/news/why-is-the-peloton-hiding-its-true-colours\">This insightful article</a> written by David Bradford earlier this year highlighted many reasons. Traditionalism, machoism, misogyny, sexism, and homophobia are still rife in the culture of cycling. While there are many openly gay women in cycling, the fact there are no out males at WorldTour level, and only a very small number in the lower levels, shows the fears that many must have about being one of the first to come out publicly.</p><p>This is where I think the CCCC event is a game-changer. Instead of pressuring those at the top to be role models, I believe that a groundswell approach can be a good solution. Club cycling is the foundation of our sport, a place where juniors develop to realise their dreams; a place where women can come to gain skills and confidence; a place where everyone can share their love of cycling and show up to bunch rides, crits, track nights, coffee stops, weekend road racing, and everything in between. Clubs are something to belong to, to be a proud member of. </p><p>If more clubs in Australia (and around the world) can host pride rounds and races, then maybe the entrenched negative aspects of cycling might start to dissipate. Riders can take their experiences and attitudes of inclusion and share them at national-level events, and even internationally. We might have more participants who previously felt too different or too intimidated, and we might see a better retention of young people remain in sport as they navigate the rocky terrain of figuring out their personal identity as they shift into early adulthood.</p><p>Cycling industry disruptor Zwift has paved the way with its annual Pride Month and regular pride rides, so let’s continue that good work out in the real world where friends made on the Companion app can meet IRL.</p><p>Pride events aren’t about shoving alternative ideas down people’s throats; they’re about enhancing the lives of everyone within a community and increasing understanding and empathy for people different to you. Insidious homophobia can be more damaging than when it’s blatant and direct – offhand remarks such as “that’s so gay” may mean nothing to you but think about what harm you might unknowingly be causing a close friend or family member when you make a joke like that.</p><p>What if it was your best friend that was too scared to share with you something so important and personal because of the perceived attitudes of those around them?</p><p>The CCCC pride round was well received by the participating club members. Rainbow flags added a celebratory touch on a cold and rainy Melbourne morning. I can’t think of a better way for cycling to “come out” of lockdown.</p><p>The world didn’t end. All that happened was regular racing – riders attacking; hanging on; waiting for the sprint. Riders grinning from ear to ear, stoked to be back throttling one another and sharing a drink afterwards. Every person left feeling satisfied, but also with the knowledge that there was always a place for them at their club; that cycling is for everyone.</p><p>I want to applaud CCCC and Alex Smyth for taking this step towards a more inclusive sport in our country. There is no doubt that at least one person’s life was made better that day, and that’s all the impact that you need.</p></div></div>","author":"Gracie Elvin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f3cbc51ed21456625ee49df4cb9de1cd14fdf20a3ff35fa277855e13f0ab9715","category":"Cycling"}