{"title":"Annemiek van Vleuten will skip the Giro Donne","link":"https://cyclingtips.com/2021/06/annemiek-van-vleuten-will-skip-the-giro-donne/","date":1623319478000,"content":"<div><div><p>Two-time Giro Donne winner Annemiek van Vleuten will skip the 2021 edition of the ten-day race to prepare for the Tokyo Olympic Games.</p><p>Van Vleuten won the Giro Donne, formally the Giro Rosa, in 2019 and 2018 and was set to win again in 2020 when a late-race crash took her out of the race. At the time of the crash, Van Vleuten was leading the general classification by almost two minutes with two stages remaining, the penultimate stage being a mountain top finish that had the Dutch riders name all over it.</p><p>The Giro Rosa crash in 2020 was a deciding factor for Van Vleuten when planning her Olympic preparation in 2021.</p><p>“It hurts me a lot not to ride it, because it’s my favorite race. But every time I think ‘I’m just going to ride it’, I look again at the scar on my wrist, where I broke my wrist in the Giro five days before the Time Trial World Championship,” Van Vleuten said.</p><blockquote><p>“You simply have less control over the risks in a race.”</p></blockquote><p>Van Vleuten <a href=\"https://cyclingtips.com/2020/09/annemiek-van-vleuten-to-race-world-championships-with-broken-wrist/\" target=\"_blank\">did end up racing the World Championships</a> a week after crashing in Italy and although she finished second being Anna van der Breggen in the road race, she was unable to compete in the time trial.</p><p>Instead of racing the Giro Donne Van Vleuten will head to altitude for a training camp. The Dutchwoman has a lot of experience training at altitude and has prepared for many important races high up.</p><p>“I am convinced that you can better prepare for a time trial with a training camp and less well in a road race,” Van Vleuten said. “In addition, you have no control over how hard the racing is, you have to travel a lot, you have the pressure of defending a classification and so it is mentally tough as well. On the other hand, at training camp I can recharge myself mentally.”</p><p>The Olympic Games in Tokyo are a massive target for Van Vleuten who was leading the women’s road race at the Rio de Janeiro Games in 2016 before a nasty crash ended her race. Despite being a target in her 2021 season, Van Vleuten claims the goal has nothing to do with revenge.</p><p>“What I found particularly annoying is that people try to tell me that I have to take revenge in Tokyo, to which my answer is that I can’t take revenge because it’s not on the same track. They are completely different Games and besides, I don’t feel the need to take revenge,” Van Vleuten said. </p><p>“I have really embraced the result in Rio and I am proud of what I have achieved there. I made a mistake in that corner, but it also brought me a lot, including many great results afterwards. I don’t mind when people talk about Rio. It’s not an annoying thing for me. The results that followed were really inspired by what I showed in Rio uphill.”</p><p>Van Vleuten has been in Andorra with her Movistar team getting ready for the Dutch National Championships in mid-June. The time trial and road race on home soil will be the only races Van Vleuten does before the Olympic Games as she has opted not to race La Course by the Tour de France due to the route change.</p></div></div>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f45e4d340ac781eebc109e353feaddd3136c587bc2799fb40e197d2c387bb8b1","category":"Cycling"}