{"title":"New – Amazon Elastic Block Store Local Snapshots on AWS Outposts","link":"https://aws.amazon.com/blogs/aws/new-amazon-elastic-block-store-local-snapshots-on-aws-outposts/","date":1612481033000,"content":"<div id=\"readability-page-1\" class=\"page\"><section property=\"articleBody\"><div id=\"amazon-polly-audio-tab\"><p><a href=\"https://aws.amazon.com/polly/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://a0.awsstatic.com/aws-blog/images/Voiced_by_Amazon_Polly_EN.png\" width=\"554\" height=\"56\"></a></p></div><p>Today I am happy to announce that <a href=\"https://aws.amazon.com/outposts/\" title=\"\">AWS Outposts</a> customers can now make local snapshots of their <a href=\"https://aws.amazon.com/ebs/\" title=\"\">Amazon Elastic Block Store (EBS)</a> volumes, making it easy to meet data residency and local backup requirements. AWS Outposts is a fully managed service that extends AWS infrastructure, services, APIs, and tools to virtually any datacenter, co-location space, or on-premises facility for a truly consistent hybrid experience. Until now, Amazon EBS snapshots on Outposts were stored by default on <a href=\"https://aws.amazon.com/s3/\" title=\"\">Amazon Simple Storage Service (S3)</a> in the AWS Region. If your Outpost is provisioned with <a href=\"https://aws.amazon.com/s3/outposts/\">Amazon S3 on Outposts</a>, now you have the option to store your snapshots locally on your Outpost.</p><p>Customers use AWS Outposts to support applications that need to run on-premises due to low latency, local data processing, or data residency requirements. Customers looking to use AWS services in countries where no AWS Region exists today can opt to run their applications on Outposts. Sometimes data needs to remain in a particular country, state, or municipality for regulatory, contractual, or information security reasons. These customers need the data for snapshots and <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html\" title=\"\">Amazon Machine Image (AMI)</a> to be stored locally on Outposts to operate their applications. In addition, some of our customers could also see value for workloads that need low latency access to local backups.</p><p>EBS Local Snapshots on Outposts is a new capability that enables snapshots and AMI data to be stored locally on Amazon S3 on Outposts. Now you can create and manage EBS Local Snapshots on Outposts through the <a href=\"https://console.aws.amazon.com/\" title=\"\">AWS Management Console</a>, <a href=\"https://aws.amazon.com/cli/\" title=\"\">AWS Command Line Interface (CLI)</a>, and <a href=\"https://aws.amazon.com/tools/\" title=\"\">AWS SDKs</a>. You can also continue to take snapshots of EBS volumes on Outposts, which are stored in S3 in the associated parent Region.</p><p><strong><u>How to Get Started With EBS Local Snapshots on Outposts</u></strong><br>To get started, visit the <a href=\"https://console.aws.amazon.com/outposts/\">AWS Outposts Management Console</a> to order an Outposts configuration that includes your selected EBS and Amazon S3 storage capacity (EBS snapshots use Amazon S3 on Outposts to store snapshots), or you can add S3 storage to your existing Outposts. EBS Local Snapshots are enabled on Outposts provisioned with Amazon S3 on Outposts.</p><p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/01/12/2021-outposts-local-ebs-snapshots-0.png\" alt=\"\" width=\"2260\" height=\"1306\"></p><p>To create a local EBS snapshot on Outposts, go to the EBS volume console and select the volume you want to create a snapshot from. Click the <strong>Actions</strong> button, then select <strong>Create Snapshot</strong> in the dropdown menu.</p><p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/01/12/2021-outposts-local-ebs-snapshots-1.png\" alt=\"\" width=\"2384\" height=\"956\"></p><p>You can create a snapshot either in the AWS Region or your Outposts when you choose the <strong>Snapshot destination</strong>. The AWS Region snapshot uses Amazon S3 in the region and the AWS Outposts snapshot uses S3 storage on Outposts for storing the snapshots. Amazon S3 on Outposts is a new storage class, which is designed to durably and redundantly store data on Outposts. Note that due to its scale, Amazon S3 in a region offers higher durability than S3 on Outposts.</p><p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/01/17/2021-outposts-local-ebs-snapshots-2-new.png\" alt=\"\" width=\"1934\" height=\"1322\"></p><p>You can call <code>CreateSnapshot</code> with the <code>outpost-arn</code> parameter set to the Outposts ARN that uniquely identifies your installation. If data residency is not a concern, you can also get the <code>CreateSnapshot</code> API to create the snapshot in the parent AWS Region by specifying AWS Region as the destination.</p><p>You can also use commands for the <a href=\"https://aws.amazon.com/cli/\" title=\"\">AWS Command Line Interface (CLI)</a> and <a href=\"https://aws.amazon.com/tools/\" title=\"\">AWS SDKs</a> e.g. <code>CreateSnapshots</code>, <code>DescribeSnapshot</code>, <code>CopySnapshot</code>, and <code>DeleteSnapshot</code> to manage snapshots on Outposts, and use Amazon Data Lifecycle Manager to <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/snapshots-outposts.html#dlm\">automate snapshots management</a> on Outposts. All local snapshots on Outposts are Encrypted by Default (EBD).</p><p>You can set IAM policies for data residency of your snapshots. The policy example below will enforce data residency on the Outposts by denying CreateSnapshot(s) calls to create snapshots in the region from outpost volumes.</p><p>You can audit your own data residency compliance by calling the <code>DescribeSnapshots</code> API that will return the snapshot’s storage location. All creation, update, and copy operations are logged in <a href=\"https://aws.amazon.com/cloudtrail/\" title=\"\">AWS CloudTrail</a> audit logs.</p><p>You can copy AMI snapshots from the AWS Region to your Outposts and register them as AMI to launch your EC2 instances on Outposts.</p><p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/02/03/2021-outposts-local-ebs-snapshots-3-new.png\" alt=\"\" width=\"2322\" height=\"1306\"></p><p>Also, you can do this via simple <a href=\"https://aws.amazon.com/cli/\" title=\"\">AWS Command Line Interface (CLI)</a> commands as follows:</p><p>Now you can register the snapshot as a local AMI for launching your EC2 instances on your Outposts.</p><p>You can also copy your regional AMIs to Outposts using the <code>copy-image</code> command. Specify the ID of the AMI to copy, the source Region, and the ARN of the destination Outpost.</p><p>Copying of local snapshots on Outposts to the parent AWS Region is not supported. In scenarios where data residency is required, you can only create local snapshots or copy snapshots from the parent Region. To ensure your data residency requirements are met on AWS Outposts, I recommend you refer to whitepapers such as <a href=\"https://aws.amazon.com/blogs/security/addressing-data-residency-with-aws/\">AWS Policy Perspectives: Data Residency</a> and <a href=\"https://d1.awsstatic.com/product-marketing/Outposts/AWS%20Outposts%20Data%20Residency%20eBook.pdf\">Addressing Data Residency Requirements with AWS Outposts</a>, and confirm and work closely with your compliance and security teams.</p><p><a href=\"https://aws.amazon.com/cloudendure-migration\">CloudEndure Migration</a> and Disaster Recovery services, offered by AWS, allow customers to migrate or replicate workloads for recovery purposes into AWS from physical, virtual, or cloud-based sources. Up until now, if customers selected an Outposts device as a migration or recovery target, the snapshot data had to be copied to a public region before being copied back into the Outposts device. This led to increased cutover and recovery times, as well as other data transfer impacts.</p><p>With the newly launched availability of EBS Local Snapshots on Outposts, you can migrate, replicate and recover workloads from any sources directly into Outposts, or between Outposts devices, without requiring the EBS snapshot data to go through a public region, leading to lower latencies, greater performance, and reduced costs. Supported use cases related to Outposts for migration and disaster recovery include: from on-premises to Outposts, from public AWS Regions into Outposts, from Outposts into public AWS Regions, and between two Outposts devices. Learn more about <a href=\"https://aws.amazon.com/cloudendure-migration\">CloudEndure Migration</a> and <a href=\"https://aws.amazon.com/cloudendure-disaster-recovery\">CloudEndure Disaster Recovery</a>.</p><p><strong><u>Available Now</u></strong><br>Amazon EBS Local Snapshots on AWS Outposts is available for all Outposts provisioned with S3 on Outposts. To learn more, take a look at the <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/snapshots-outposts.html\">documentation</a>. Please send feedback to the <a href=\"https://pages.awscloud.com/GLOBAL_PM_LN_outposts-features_2020084_7010z000001Lpcl_01.LandingPage.html\">AWS Outposts team</a>, your usual AWS support contacts, or <a href=\"https://aws.amazon.com/outposts/partners/\">Outposts partners</a>.</p><p><strong>Learn all the details about <a href=\"https://aws.amazon.com/outposts/?sc_detail=blog_cta1\">AWS Outposts</a> and get started today.</strong></p><p>— <a href=\"https://twitter.com/channyun\">Channy</a></p></section></div>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"f4793c0919e15ebef8aaf648ada02dc7fdb8a66de8a5213b8392a06717e63e84","category":"Tech"}