{"title":"Mastercard จะสนับสนุนการชำระเงินด้วยสกุลเงินคริปโตบนเครือข่ายของบริษัทภายในปีนี้","link":"https://www.blognone.com/node/121166","date":1613099468000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/mastercard-logo.png?itok=8MDJamsH\"></p><div itemprop=\"description\"><p>Mastercard เป็นบริษัทระบบชำระเงินรายล่าสุดที่ออกมาพูดถึงเรื่องสกุลเงินคริปโต โดย Raj Dhamodharan รองประธานฝ่ายสินทรัพย์ดิจิทัลและบล็อกเชนระบุว่า Mastercard จะซัพพอร์ตสกุลเงินคริปโตในปีนี้เป็นบางสกุลเงินบนเครือข่ายของ Mastercard ซึ่งแม้ว่าก่อนหน้านี้แม้จะออกบัตรคริปโตร่วมกับ Wirex และ BitPay มาแล้วก็ยังไม่ใช่การชำระเงินด้วยคริปโตแบบวิ่งบนเครือข่าย Mastercard โดยตรง เพราะยังต้องแปลงเป็นสกุลเงินดั้งเดิมก่อนจะวิ่งผ่านเครือข่าย Mastercard</p><p>การที่ Mastercard ตัดสินใจเลือกสนับสนุนสกุลเงินคริปโตก็เพื่อเป็นทางเลือกให้ผู้บริโภค เป้าหมายหลักไม่ใช่การสนับสนุนให้ใช้สกุลเงินคริปโต แต่เป็นการเปิดช่องทางให้ผู้บริโภค, ผู้ค้าขาย และภาคธุรกิจให้เคลื่อนย้ายมูลค่าทางดิจิทัลในรูปแบบที่ต้องการไม่ว่าจะเป็นสกุลเงินแบบดั้งเดิม หรือจะเป็นคริปโต</p><p>แต่การจะนำสกุลเงินคริปโตมาใช้ยังมีข้อจำกัดมากมาย ไม่ว่าจะเป็นการปกป้องผู้บริโภค ทั้งความเป็นส่วนตัวและความปลอดภัยของข้อมูลลูกค้าในระดับเดียวกับที่ผู้บริโภคคาดหวังจากบัตรเครดิต ดังนั้นถ้าจะนำมาใช้จริงจะต้องมีสิ่งที่ต้องอิมพลีเมนต์เพิ่มอีกมาก อย่างเช่น KYC (Know Your Customer) และสินทรัพย์ดิจิทัลทั้งหมดจะต้องปฏิบัติตามกฎหมายและข้อบังคับในประเทศที่ใช้งานด้วย รวมถึงการใช้สินทรัพย์ดิจิทัลสำหรับใช้จ่ายเพื่อการบริโภคก็จะต้องมีความเสถียรและมั่นคงเพียงพอที่จะใช้ชำระเงิน ไม่ใช่เสถียรเพียงพอในแง่มุมการลงทุน</p><p>ตอนนี้ Mastercard ระบุว่าทางบริษัทถือสิทธิบัตรบล็อคเชนกว่า 89 รายการ และกำลังอยู่ระหว่างกระบวนการขออีก 285 รายการ ทำให้ Mastercard เป็นหนึ่งในองค์กรด้านระบบชำระเงินที่ถือสิทธิบัตรบล็อคเชนมากที่สุด และจะทำให้โครงการเหล่านี้สำเร็จขึ้นมาให้ได้</p><p>ที่มา - <a href=\"https://www.engadget.com/mastercard-cryptocurrency-support-113518862.html\">Engadget</a>, <a href=\"https://www.mastercard.com/news/perspectives/2021/why-mastercard-is-bringing-crypto-onto-our-network/\">Mastercard</a> </p><p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/055ee409e4513ad89f04e8b0ff06420c.png\"><br>ภาพจาก Shutterstock</p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f5213ddfb8f825185a96e84f9f51d9065f0ff8cc33d393cefa74e5e00589151e","category":"Thai"}