{"title":"Litespeed Watia gravel bike review: A magical ride, but old-school handling","link":"https://cyclingtips.com/2021/06/litespeed-watia-gravel-bike-review/","date":1623802444000,"content":"<div><p></p><h4>The Litespeed Watia wows you with its gleaming finish and fantastic ride quality.</h4><p></p><div><p>Litespeed has been in the titanium game for well over three decades now, and as you can imagine, the heralded American brand has accumulated a fair bit of knowledge in that time on how to work with this mysterious metal. <a href=\"https://cyclingtips.com/2020/10/litespeed-refines-its-gravel-game-with-the-new-watia-titanium-frame/\" target=\"_blank\">The Watia</a> is the company’s latest gravel model, and as you’d expect (and hope), it incorporates plenty of clever thinking.</p><div><h2>Story Highlights</h2><ul><li><strong>What it is:</strong>The latest gravel machine from legendary US titanium brand Litespeed.</li><li><strong>Frame features:</strong>Intricate tube shaping, lots of available options, official clearance for 700×45 mm or 650×53 mm tires, made-in-USA manufacturing.</li><li><strong>Weight:</strong> 1,545 g (claimed, medium frame only); 8.93 kg (19.69 lb, as tested, medium size, without pedals)</li><li><strong>Price:</strong>US$2,350 / AU$3,050 / £1,665 / €1,940 (starting price, frame only); US$6,350 / AU$8,340 / £4,500 / €5,245 (as tested)</li><li><strong>Highs:</strong>Superb ride quality, generous tire clearance, excellent finish work, reasonable pricing for custom geometry.</li><li><strong>Lows:</strong>Old-fashioned stock geometry, stock PF30 bottom bracket shell, chainstays are prone to mud build-up.</li></ul></div> <p>At first glance, the Watia comes across as a fairly conventional double-diamond, TIG-welded titanium frame. But a closer look reveals quite a bit more.</p><p>Tire and drivetrain clearance is the name of the game these days when it comes to gravel bikes, and to help squeeze out more of both, Litespeed has dropped the driveside chainstay slightly, and also replaced the forward portion of the tube with a slender chunk of machined titanium.</p><p>According to Litespeed, the Watia can easily handle 700c tires up to 45 mm wide, or 650b ones up to 53 mm.</p><p>Up top is some more clever metalwork. The top tube is heavily ovalized at the seat tube, and the widely set seatstays are welded to those overhangs to produce a seat cluster that looks more than a little bit like a first-generation <a href=\"https://cyclingtips.com/2021/05/bikes-of-the-bunch-a-personalised-cannondale-supersix-evo-disc/\" target=\"_blank\">Cannondale SuperSix Evo</a> (and I mean that in a good way).</p><p>That sort of arrangement likely helps to boost frame stiffness in some way, but it also provides a neat pathway that Litespeed uses to route the rear derailleur housing if you’re running a mechanical drivetrain. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-7-1340x754.jpg\"><figcaption>One of the key features on the Watia is how the flattened top tube joins with the widely set seatstays. It’s almost like an old Cannondale SuperSix Evo rendered in titanium.</figcaption></figure><p>At the front of the frame, Litespeed equips the Watia with a gorgeous 44 mm oversized head tube, which is engraved (and then color-filled) with the company logo. Filling that tube is Litespeed’s own carbon fork. Out back are tidy and compact machined-in-house thru-axle dropouts with a replaceable aluminum derailleur hanger, and the whole thing is capped with a refreshingly normal external aluminum seatpost collar (with a barrel nut to reduce stress on the bolt). </p><p>As for the tubing itself, Litespeed curiously doesn’t make a big deal out of this, but all three main tubes — not just the top tube — have size-specific modified tube wall thicknesses (Litespeed product design and development head Brad DeVaney is resistant to describing it as “butting”), and the head tube receives a “massive amount of wall reduction internally.” Both the seatstays and chainstays are straight-gauge, but they still get some clever shaping. Even the seatstay and chainstay bridges aren’t left well enough alone; both are slightly bent before being mitered and welded into place.</p><p>“A new tool was made to create subtle ovalization midway up the tube, mildly increasing at the tire, and quickly transitioning out at the exact point of the bottom tip of the arched brace,” DeVaney explained. “It’s a very subtle touch that has added an additional 4 mm of tire clearance.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-24-1340x754.jpg\"><figcaption>Tire clearance is excellent all around, with plenty of room around these 43 mm-wide Panaracer GravelKing SK clinchers.</figcaption></figure><p>“The goal of this frame was not to push weight limits or attain the eye of a discriminating racer,” DeVaney said. “I’d love to lie and tell you there were ‘no compromises in this development’. Let’s be honest; all developments are laced with compromise. The beauty of compromise with titanium is that it becomes more durable and of greater value. We didn’t go nuts butting the down tube in a way we might have on a finely tuned late-’90s race bike, but we are delivering a very stable, predictable ride quality that comes at a more digestible price.”</p><h2>Have it your way</h2><p>Technically speaking, the Watia is a mass-produced frame, but Litespeed still offers it with an impressive array of stock and custom options.</p><p>Instead of going the universal route with convertible routing, Litespeed makes the Watia in three distinct configurations: internal Di2, internal mechanical, or external mechanical. This allows buyers to get the cleanest possible setup, and in the case of the external mechanical option, also saves US$300 (and some potential headache when it comes time for service and maintenance).</p><p>The downside to this, of course, is limited recourse if you decide to switch later on, but even then, you’re not totally stuck since Litespeed gives you the option of adding Di2 ports.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-16-1340x754.jpg\"><figcaption>Litespeed offers several different routing options for the Watia. This particular example can accommodate both mechanical and electronic drivetrains.</figcaption></figure><p>“Internal routing is approximately 80% over external,” DeVaney said. “Mechanical is holding a slight lead over Di2. With 20% of our sales being externally routed, and all of those being mechanical, it tells us that more of the internally routed bikes are Di2-equipped. This is no huge surprise, but a nice factoid to share.”</p><p>Litespeed offers (for modest uncharges) front and rear fender, front and rear rack, and top tube feed bag mounts, and if you anticipate needing more serious cargo capacity, you can add anything mounts to the fork, too. You can also ditch the standard PF30 press-fit bottom bracket shell for a T47 threaded one (something I’d recommend), and if the stock, etched down tube logo isn’t your style, Litespeed will do colored decals instead. If you want to go super matchy-matchy, you can add a Litespeed titanium seatpost (using an Enve aluminum cradle). </p><p>Most unusually for a semi-stock titanium frame, you can even get fully custom geometry for the relatively paltry sum of US$600, which is even more of a bargain when you find out what’s bundled together with it.</p><p>“Full custom geometry is $600 and would include any other customizations we might offer on the stock geo,” DeVaney said. “Custom frame eyelets, mounts, or fork eyelet options most always come at a cost of $50-150 depending on the level of personalization being requested.”</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-10-1340x754.jpg\"><figcaption>The machined chainstay segment provides extra drivetrain and tire clearance as compared to usual tubular setup.</figcaption></figure><p>Bare Watia frames (as in, without fork) start at US$2,350 / AU$3,050 / £1,665 / €1,940, and individual add-ons are priced pretty reasonably. Outfitted as shown here with internal mechanical routing, a Campagnolo Ekar 1×13 mechanical groupset, Spinergy GXX aluminum clincher wheels, a Litespeed seatpost, a <a href=\"https://cyclingtips.com/2016/04/origins-how-chris-king-headsets-almost-didnt-happen/\" target=\"_blank\">Chris King headset</a>, and most of the frame options (including the T47 threaded bottom bracket shell), the grand total comes out to about US$6,350 / AU$8,340 / £4,500 / €5,245. That’s not cheap, of course, but compared to similar alternatives, it’s actually quite good value.</p><p>Actual weight for my medium-sized test bike is 8.93 kg (19.69 lb) without pedals or accessories.</p><h2>Keeping the magic alive</h2><p>If you have an idea in your head of what good titanium bikes feel like, then you’ve already got a pretty good idea of what the Watia is all about — and I mean that in a very good way.</p><p>I can’t say that I’ve loved (or even liked) every titanium bike I’ve ever ridden, and certainly not every one has provided the sort of almost-mystical ride quality that you often hear about. But in the case of the Watia, the combination of those oversized tube dimensions, the subtle shaping, and the thin tube walls join together to form a gloriously melodious symphony of ride quality. </p><p>Ever watch that animated movie Ratatouille? Remember the part where Remy <a href=\"https://www.youtube.com/watch?v=Yyah49_Oz78\" target=\"_blank\">first ate cheese and strawberry together</a> and his head exploded? The ride quality of the Watia is sort of like that.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-12-1340x754.jpg\"><figcaption>The machined dropouts are compact and beautiful in an industrial sort of way. Rack and fender eyelets can be added, too.</figcaption></figure><p>The oversized main tubes keep things lively and responsive in terms of pedaling efficiency and handling precision, while those thin tube walls impart an entertainingly springy personality to the whole thing. It’s everything you expect and hope for in a titanium frame: stiff yet comfortable, lively yet well damped, communicative without being buzzy. It’s what you would hope a company with this level of experience with the material could provide, and the sensation easily makes you forget the extra grams you’re carrying around relative to a carbon something-or-other.</p><p>Also faithfully upholding titanium’s reputation is the Watia’s finish quality. In the sun, the whole thing twinkles like a shiny coin you found on the ground. The welds are tidy and clean, the bare brushed tubes and etched logos laugh off mud and crust that might dull a painted finish, and even potential long-term issues like shoe scuffs are easily remedied with the proper grade of steel wool. Rust? Corrosion? Please.</p><p>While no frame material is literally bombproof, the thought nevertheless goes through your head that you could potentially pass this thing down to your kids someday. Given that, you may as well go nuts with the options list since it’s a whole lot cheaper to get them when the frame is being built than later on.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-21-1340x754.jpg\"><figcaption>Stock Watias come with a PF30 bottom bracket shell. A T47 threaded shell is an available option, and one I’d recommend.</figcaption></figure><p>Litespeed has clearly been quite conservative in reporting the Watia’s official tire clearance. The supplied Panaracers measured 43 mm-wide almost exactly, and there was easily room for maybe as much as 5 mm more, depending on the exact tire and rim. I didn’t bother trying the Watia in 650b trim, but given the shape of the stays, I’d expect a similar amount of wiggle room there, too.</p><p>“Being a framebuilder, we never know when a set of 142 mm hubs laced into MTB hoops are going to be put on our bike,” DeVaney explained. “The tire measurement variations are huge, so we do stay a bit conservative in what we say the bike is capable of. I sleep far better when we under-promise and over-deliver.”</p><p>As much as I fell in love with the Watia’s ride quality, I wish I could say the same about the bike’s handling.</p><p>I consider myself firmly in the new-school camp when it comes to gravel bike geometry. Those longer front-centers, shorter stems, and slacker head tube angles might seem unusual from a roadie perspective, but pushing that wheel further out in front of you really does make for more forgiving handling (especially when things get loose and/or steep), while the short stem does wonders for maintaining agility despite the larger trail dimension. And contrary to what you might think, I’ve found that forgiving handling results in more aggressive riding off-road, not less, since you can push harder with fewer consequences. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-frame-geometry-1340x577.jpg\"></figure><p>I personally think bikes like <a href=\"https://cyclingtips.com/2020/03/evil-chamois-hagar-gravel-bike-review/\" target=\"_blank\">Evil’s Chamois Hagar</a> take the concept a little too far, but bikes like the <a href=\"https://cyclingtips.com/2020/03/2020-bmc-urs-three-gravel-bike-review/\" target=\"_blank\">BMC URS</a> and <a href=\"https://cyclingtips.com/2020/10/devinci-hatchet-carbon-gravel-bike-review/\" target=\"_blank\">Devinci Hatchet</a> have certainly helped to cement my position on the topic. The Watia, on the other hand, is far more traditional. As compared to the Hatchet I tested, the Watia has the same 71° head tube angle, 50 mm fork rake, and 430 mm chainstays, but the reach is 13 mm shorter and the front-center is 9 mm shorter. And keep in mind that this is comparing a small Hatchet with a medium Watia.</p><p>On the (unpaved) road, this translates into a more front-heavy feel on the Watia, particularly with the longer stem I had to run to maintain my desired cockpit dimensions. The front wheel changes direction eagerly enough, but it sometimes almost seemed like the rear wheel was dragging behind instead of everything happening in unison. And then when things were really loose and sketchy, I missed the Hatchet’s longer wheelbase and more generous standover clearance. </p><p>All of this was less of an issue at slower speeds, but whatever gains were made there were arguably canceled out by the considerable toe overlap.</p><p>There are some other quirks on this frame, too.  </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-20-1340x754.jpg\"><figcaption>Mud likes it here.</figcaption></figure><p>There’s a considerable shelf behind the bottom bracket shell (created by the chainstay bridge and front derailleur housing stop) where mud and debris readily accumulate. And while I like how you can run the rear brake hose through the down tube without having to remove the hardware or cut the line (which is how it usually goes), the oversized guide tube that Litespeed uses looks kind of awkward. DeVaney explained that this tube was sized to accommodate both a front derailleur housing and the rear brake hose, so 1x users might want to specify the optional smaller guide tube instead.</p><p>Otherwise, the routing on this bike is pretty neat, particularly with the way the rear derailleur housing runs through the top tube, around the seat tube, and down the seatstays. It’s really clean, although if you switch to electronic down the road, there’ll be a fair bit of vestigial hardware left behind.</p><p>In fairness to Litespeed, all of my complaints can be eliminated by taking advantage of custom options, and considering that modest upcharge includes all the other add-ons, that route seems like a downright bargain. I dare say that had Litespeed supplied a Watia sample with a more progressive geometry and more refined cable routing setup, there’s a good chance I would have sent the company my credit card information instead of a dirty test bike.</p><h2>Spec notes</h2><p>The more I ride on <a href=\"https://cyclingtips.com/2020/09/new-campagnolo-ekar-groupset-brings-mechanical-13-speed-to-gravel/\" target=\"_blank\">Campagnolo’s Ekar 1×13 groupset</a>, the more I like it. The shifts are responsive and accurate, the gear ratios feel dead-on in terms of total spread and the individual gaps, it’s light and easy to work on, the lever ergonomics are fantastic, and while the pad clearance is noticeably tighter than Shimano or SRAM, I still hold the opinion that the disc brakes are the best of the big three in terms of power, control, and lever feel. </p><p>As for the rolling stock, the Spinergy wheels are light and smooth-riding, but I’d like to see a faster-engaging rear hub — not a big deal, but worth noting if you like to tackle more technical terrain. The <a href=\"https://cyclingtips.com/2021/04/panaracer-announces-limited-edition-pink-and-blue-gravel-king-tyres/\" target=\"_blank\">Panaracer GravelKing SK tires</a> are a little more polarizing. They roll well and grip pretty nicely on hardpacked dirt, but they’re borderline useless in muddy conditions, don’t have much of a shoulder tread in loose conditions, and have a nasty tendency to toss small pebbles both behind you and up in front of you. It’s not a big deal if you’re riding by yourself, but if you regularly ride with friends, they might not be too happy with you.</p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-37-1340x754.jpg\"><figcaption>Panaracer’s GravelKing SK tires have a loyal following, and for good reason.</figcaption></figure><p>The cockpit components were a mixed bag. The seatpost is lovely, but I’m not a huge fan of cylindrical heads off-road. They’re more finicky to adjust than opposing-bolt designs (like a Thomson), and more prone to slipping. The stock FSA Energy SCR stem did its job just fine, but I could do without the matching FSA handlebar. I like drop bars with long reach and a lot of drop on the road, but that’s not what I want in a gravel setup, and not what most other gravel riders seem to want, either. I’d switch to something with a more compact shape.</p><h2>Patience pays</h2><p>OK, so where does that leave us on the Watia overall?</p><p>If you’re in the market for a US-made titanium gravel bike with that legendary ride quality you’ve heard about, the Watia will certainly deliver that in spades, (presumably) along with the long-term durability and toughness that so many titanium buyers value. The geometry thing is a tricky issue, and if the stock setup doesn’t suit you, I’d normally say that’s a deal-breaker. </p><p>However, Litespeed’s impressively reasonable pricing — and particularly the surprisingly modest upcharge for full custom — makes it anything but, especially since the upcharge includes so much of the other a la carte stuff.</p><p>Overall, Litespeed is making a pretty compelling argument for the Watia to be your “forever” titanium gravel bike. Just keep in mind that forever is an awfully long time, and it might be worth waiting a bit longer at the front end to make sure you’re getting exactly what you want.</p><p>For more information, visit <a href=\"https://litespeed.com/collections/titanium-gravel-bikes\" target=\"_blank\">www.litespeed.com</a>.  </p><figure><ul><div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-2-1340x754.jpg\"><figcaption>The Watia is Litespeed’s newest gravel bike, and as compared to other US-made titanium options, it’s actually quite reasonably priced.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-1-1340x754.jpg\"><figcaption>The Litespeed Watia wows you with its gleaming finish and fantastic ride quality.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-4-1340x754.jpg\"><figcaption>Riders looking at titanium often expect an almost mystical ride quality given all the hype surrounding the material. In this case, you won’t be disappointed.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-5-1340x754.jpg\"><figcaption>The Watia’s generous tire clearance lends it heaps of capability to explore unbeaten paths.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-6-1340x754.jpg\"><figcaption>The etched logos are a nice touch.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-8-1340x754.jpg\"><figcaption>OK, so the weld aesthetic doesn’t look to be quite on the level of, say, Moots or Mosaic. But then again, we’re talking awfully elite company here.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-9-1340x754.jpg\"><figcaption>Overall, the Watia sports a pleasantly traditional profile. The tubes are butted and shaped, but not in any sort of extreme way.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-11-1340x754.jpg\"><figcaption>The machined chainstay section looks pretty neat, too.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-13-1340x754.jpg\"><figcaption>Unlike some titanium brands that are using 3D-printed non-driveside dropouts that directly incorporate the disc brake mount, Litespeed is sticking to a more traditional layout.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-14-1340x754.jpg\"><figcaption>The 44 mm-diameter head tube matches up well with the oversized top tube and down tube.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-15-1340x754.jpg\"><figcaption>The engraved logo is a lovely alternative to a traditional head tube badge (and certainly is nicer than a decal).</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-17-1340x754.jpg\"><figcaption>The welded-in guide tube for the rear brake is curiously oversized on this test sample. Litespeed says Watia buyers who know they aren’t going to use a front derailleur can opt for a smaller tube instead.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-18-1340x754.jpg\"><figcaption>The oversized guide tube on this sample not only looks a little funny, but also requires the hose to be lined with foam to prevent rattling.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-19-1340x754.jpg\"><figcaption>The elegantly curved seatstay bridge provides a refreshingly normal spot for a rear fender mount.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-22-1340x754.jpg\"><figcaption>The chainstays have a nice S-bend to them.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-23-1340x754.jpg\"><figcaption>The driveside chainstay is dropped, but only just barely.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-25-1340x754.jpg\"><figcaption>Litespeed officially quotes the maximum tire size on the Watia as 700×45 mm or 650×53 mm (without fenders). Based on how these 43 mm-wide Panaracers fit, though, at least the 700c figure seems pretty conservative.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-26-1340x754.jpg\"><figcaption>Lots of room to grow.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-27-1340x754.jpg\"><figcaption>The made-in-USA sourcing won’t matter to everyone, but it’ll definitely matter a lot to some.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-28-1340x754.jpg\"><figcaption>A third bottle mount is located in the usual spot on the underside of the down tube.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-29-1340x754.jpg\"><figcaption>Litespeed equips the Watia with three mounting holes for the down tube water bottle cage in case you need to move things around for a frame bag.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-30-1340x754.jpg\"><figcaption>I was a little disappointed to see rivnuts used instead of welded-on mounts, but it’s not exactly a deal breaker.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-31-1340x754.jpg\"><figcaption>The included carbon fiber fork rides nicely and is available with fender mounts.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-33-1340x754.jpg\"><figcaption>The optional titanium seatpost looks lovely, but I’m not a huge fan of cylindrical seatpost heads. This one (which uses hardware from Enve) worked just fine during testing and looks very tidy, but the layout is more prone to unwanted rotation than an opposing two-bolt setup and harder to adjust, too.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-34-1340x754.jpg\"><figcaption>The Spinergy GXX wheels are a nice pairing with the Watia given their similarly smooth ride.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-35-1340x754.jpg\"><figcaption>The Spinergy wheels’ tensioned fiber spokes aren’t aero at all, but gravel riders are likely to be more attracted to their cushy ride quality.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-36-1340x754.jpg\"><figcaption>The splined spoke nipples are much harder to strip than conventional square ones. The slight misalignment between the spoke and nipple is a little concerning, though.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-37-1340x754.jpg\"><figcaption>Panaracer’s GravelKing SK tires have a loyal following, and for good reason. They roll and grip reasonably well, and the rubber compound is hard-wearing, too. They’re as useless in mud as you’d expect, however, and the unique tread pattern has an annoying tendency to catch (and then toss) little pebbles up in the air.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-38-1340x754.jpg\"><figcaption>Campagnolo’s Ekar 1×13 mechanical groupset is only continuing to grow on me the more I use it. It’s lightweight, offers excellent range, works very well, and looks good, too.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-39-1340x754.jpg\"><figcaption>Campagnolo’s latest crankset design is a love-it-or-hate-it affair for many.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-40-1340x754.jpg\"><figcaption>The aluminum Campagnolo Ekar levers are nicely shaped for strong braking either from the hoods or the drops.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-42-1340x754.jpg\"><figcaption>The deep drop and long reach of the FSA bar would be fine on a road bike, but didn’t feel right for gravel.</figcaption></figure></li></div><div><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Litespeed-Watia-43-1340x754.jpg\"><figcaption>Aside from the bend shape, though, the slight flare and ovalized tops were quite nice.</figcaption></figure></li></div></div></ul></figure></div></div>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f58fbd4b5723702e14b4128b3010cfd7d592a41653a0308dd4151ddccdcb46dd","category":"Cycling"}