{"title":"Jakobsen loses touch in Vuelta finale but Deceuninck wins anyway","link":"https://cyclingtips.com/2021/08/jakobsen-loses-touch-in-vuelta-finale-but-deceuninck-wins-anyway/","date":1630089643000,"content":"<div><div><p>With less than two kilometers to go in Friday’s <a href=\"https://cyclingtips.com/2021/08/florian-senechal-wins-vuelta-a-espana-stage-13-after-chaotic-final-few-kilometres/\" target=\"_blank\">stage 13</a> of the Vuelta a España, Deceuninck-QuickStep seemed primed to secure another sprint victory for speedster Fabio Jakobsen. Multiple Deceuninck riders were bossing the front and setting such a high tempo that splits began to form only a little ways back, putting many of Jakobsen’s would-be rivals out of contention.</p><p>That left Jakobsen sitting behind Matteo Trentin (UAE Team Emirates) with several Deceuninck jerseys in front of the Italian. Jakobsen appeared to be in a great position to power to the win – but you know what they say about the best laid schemes o’ Belgian bike racing teams.</p><p>Just when Deceuninck appeared to have gotten it so right, Jakobsen lost touch with the front group, which rapidly left him behind. The Dutchman’s drop was so abrupt that it initially appeared to have been caused by a mechanical issue. Suddenly, Deceuninck found itself with three riders hammering at the front of a group of four, with Plan A fading into the rearview mirror and with a speedy Trentin enjoying the free ride.</p><p>With less than two minutes left in the race, it was time for a change in plans.</p><p>“I tried to close the gap but I couldn’t,” Jakobsen said later. “I didn’t have the legs to sprint, so I told Florian [Sénéchal] that he should do the sprint.”</p><p>In the moments after he was dropped, Jakobsen put his hand to his ear and spoke into the radio, alerting his teammates to the situation. At first, Deceuninck eased off the accelerator.</p><p>That allowed a trio of Alpecin-Fenix riders to close down the gap, and then a handful of others got back into the draft of the front group as well – but the three remaining Deceuninck riders were still the best-positioned of all, pushing the pace in a very, very lined out group. If they could just hang on out front, the list of potential rivals for the stage was still quite small.</p><p>With around 850 meters to go, Zdenek Stybar peeled off, leaving Bert Van Lerberghe leading the way for Deceuninck. Van Lerberghe led through a few late curves with Florian Sénéchal just behind, followed by Trentin and then then Scott Thwaites of Alpecin-Fenix. Then, with 400 meters left to race, Thwaites decided to go for a long one, surging past on the left.</p><p>Deceuninck’s last two riders were ready. Van Lerberghe put in one last big dig to help bridge a small gap to Thwaites, and then Sénéchal jumped on the Brit’s wheel with Trentin just behind. The Frenchman couldn’t have found himself in a better position as Thwaites effectively led him out right up until the 150 meters to go marker, where Sénéchal exploded past. Trentin tried to come around and nearly made it – but Sénéchal held him off to secure his first ever Grand Tour stage win.</p><p>The result came down to a combination of collective firepower and a remarkable ability to adapt at roughly 50 kilometers per hour.</p><p>“We did a perfect lead-out for Fabio and he said on the radio, ‘flat tire’ or ‘you have a gap,’ ‘Florian, you can sprint,'” Sénéchal said afterwards. “We waited, Bert Van Lerberghe did a super good job, I stayed calm, and in the last 100 meters I gave the maximum.”</p><p>Deceuninck had been all-in on Plan A with less than two kilometers to race, but exactly one hundred seconds later, a hastily cobbled together backup plan produced a victory.</p><p>“At first I thought [Arnaud] Démare would pass me, or [Michael] Matthews, I don’t know, but nobody passed me,” Sénéchal. “I gave my maximum, it’s crazy. A lot of thanks for my teammates, they did a pretty crazy job.”</p><p>In life and in bike racing, sometimes you have to stay calm and adapt. Deceuninck did just that on Friday, and for the 24th time this season, the squad picked up a WorldTour victory in the process.</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f61c00a7863e82365481fb380d5cf13a72c14f45fa865148552f5262b807e9b4","category":"Cycling"}