{"title":"Epic ยอมความคดี Loot Box เกม Fortnite แต่ไม่จ่ายเป็นเงินจริง จ่ายเป็นเครดิตในเกมแทน","link":"https://www.blognone.com/node/121378","date":1614215867000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/Fortnite-Logo.png?itok=1HZQx2p8\"></p><div itemprop=\"description\"><p>เกม Fortnite เคยขายไอเทมชื่อ Loot Llama ซึ่งเป็นการรวมไอเทมแบบสุ่มอยู่ช่วงหนึ่ง ก่อนเลิกไปในช่วงต้นปี 2019 หลังมีกระแสต่อต้าน loot box ไปทั่วโลก แต่ก็ยังมิวายโดนผู้เล่นยื่นฟ้องแบบกลุ่ม (class action) เรียกค่าเสียหายจากการถูกทำให้เข้าใจผิด</p><p>สัปดาห์นี้ Epic เจรจายอมความกับผู้เล่นแล้ว แต่รูปแบบการยอมความต่างไปจากคดีอื่นๆ ที่บริษัทจ่ายค่าชดเชยให้เป็นเงินจริง (<a href=\"https://www.blognone.com/node/60123\">ตัวอย่างคดีของกูเกิล</a>) เพราะ Epic เลือกจ่ายเป็นสกุลเงิน V-Bucks ในเกม Fortnite แทน</p><p>ผู้เล่นทุกคนที่เคยซื้อไอเทม Loot Llama ทุกคนจะได้เงินเสมือน 1,000 V-Bucks (เทียบเป็นเงินจริงประมาณ 8 ดอลลาร์) แม้คดีฟ้องเฉพาะในสหรัฐ แต่ Epic ก็ประกาศแจก 1,000 V-Bucks ให้ผู้เล่นทั่วโลก</p><p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/340c0576784d3c101604f6c79337d904.jpg\"></p><p>นอกจากเกม Fortnite แล้วยังมีเกม Rocket League <a href=\"https://www.blognone.com/node/109517\">ที่ถูก Epic ซื้อมาในปี 2019</a> และมีกรณีขายไอเทมแบบสุ่มชื่อ Event Crate อีกเหมือนกัน (เลิกขายไปพร้อม Fortnite ในยุคที่ Epic เป็นเจ้าของแล้ว) ก็จะได้เครดิตคืนจำนวน 1,000 เครดิตด้วยเช่นกัน</p><p>ตัวเลขของ Epic เองประเมินว่ามีผู้เล่นที่จะได้รับสิทธินี้ 6.5 ล้านราย (Fortnite) และ 2.9 ล้านราย (Rocket League) คิดเป็นเงินจริงมูลค่า 78.3 ล้านดอลลาร์ แต่เว็บไซต์ Ars Technica ประเมินว่าต้นทุนจริงๆ ของ Epic น้อยกว่านี้มาก เพราะไม่ต้องจ่ายเงินจริงๆ ออกไป, ผู้เล่นบางคนไม่ได้กดรับสิทธิ, หรือรับสิทธิแล้วไม่ได้ใช้เครดิตในเกม อีกทั้งยังเป็นเหมือนการแจกโปรโมชั่นให้ผู้เล่นกลับเข้ามาเล่นใหม่ด้วย</p><p>ที่มา - <a href=\"https://www.epicgames.com/fortnite/en-US/news/fortnite-save-the-world-loot-llama-purchasers-to-receive-1000-v-bucks\">Fortnite</a>, <a href=\"https://arstechnica.com/gaming/2021/02/epic-will-pay-off-class-action-loot-box-settlement-with-in-game-currency/\">Ars Technica</a></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f6b89de42846beee2cf9a1e9afc3f4665fb01cbc986ea4592ed83ab299ed1ae8","category":"Thai"}