{"title":"Strava rolls out activity and privacy updates for subscribers and free users","link":"https://cyclingtips.com/2021/08/strava-rolls-out-activity-and-privacy-updates-for-subscribers-and-free-users/","date":1628787801000,"content":"<div><div><p>If you’ve taken the plunge to be a Strava subscriber, you may have noticed some updates to the app over the past week. Strava quietly pushed a test update with new ‘Edit Activity/ features for subscribers – and now Strava has announced a further update with enhanced privacy controls for its entire community. </p><h2>Edit activity controls</h2><p>Strava’s test update, pushed to around half the subscription community last week, is a major revamp and reorganisation of the ‘Edit Activity’ screen and includes some exciting new map personalisation features plus visibility options for heart rate, power, and pace. </p><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/Strava-Edit-Map-Visibility-4-1340x754.jpg\"><figcaption>The new ‘Edit Activity’ screen.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/Strava-Personalized-Stat-Maps-1340x754.jpg\"><figcaption>Here’s something I prepared earlier.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/Strava-Personalized-Stat-Maps-2-1340x754.jpg\"><figcaption>The new layout makes editing the ride much more streamlined.</figcaption></figure></li></ul></div></figure><p>The Personalised Stats Maps feature offers users the option to change their route maps to data-driven polylines with a choice of highlighting heart rate, pace, elevation, etc.</p><p>While this new feature is mostly for Strava subscribers only, there are a few exceptions. Strava has some featured maps, including a BLM map treatment available free to all athletes. </p><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/Strava-Personalized-Stat-Maps-3-1340x754.jpg\"></figure><p>In perhaps some bad news for <a target=\"_blank\" href=\"https://cyclingtips.com/2021/05/power-analysis-egan-bernals-strava-and-power-file-from-his-stage-9-victory/\">pro rider power analysis</a>, Strava is now offering users the option to hide power, heart rate, pace, and calories burned on activities. </p><p>Strava is also adding a private notes section – separate to public comments – on all activities, allowing athletes to record notes on each ride for future reference. </p><p>These new features are easily accessible after each ride upload via the ‘Edit Activity’ menu in-app or on the web, with a series of drop-down menus for each new feature. </p><p>While Strava has yet to announce an official launch date for these new updates, it is testing on a huge scale – again, roughly half the community already has access to the new updates. </p><h2>Edit map visibility</h2><figure><div><ul><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/Strava-Edit-Map-Visibility-3-1340x754.jpg\"><figcaption>The grey section of the route denotes hidden sections, while the orange is public.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/Strava-Edit-Map-Visibility-2-1340x754.jpg\"><figcaption>Users can now also hide an entire activity map without making the activity private.</figcaption></figure></li><li><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/Strava-Edit-Map-Visibility-1340x754.jpg\"><figcaption>“Privacy Zones” are now “Edit Map Visibility” options.</figcaption></figure></li></ul></div></figure><p>Formerly known as “Privacy zones”, Strava has updated this feature, allowing users to hide start and finish areas of activities. Previously users could hide up to one mile from the start/end of a ride at a specific location previously selected in-app or on the web.</p><p>The new update adds to the original privacy zones feature with an option for users to hide up to one mile from the start/end of every ride regardless of location, or even hide the map entirely. Both new features will apply only to future activity uploads, with the hidden map also concealing those rides from Strava’s Global Heatmap. </p><p>Strava has gone one step further, highlighting the hidden zones for athletes when viewing their own activities. Sections of an activity hidden from the public are shown in grey, with publicly visible sections of the same activity highlighted in orange. </p><p>Strava users can edit their map visibility both on the mobile app and the web. The ‘Edit Map Visibility’ function is available to all Strava users as of August 18. </p><p>Strava copped some heat when it moved many of its popular features to a <a target=\"_blank\" href=\"https://cyclingtips.com/2020/05/strava-shake-up-major-changes-for-paid-and-free-users/\">subscription service last year</a>. At the time, founders Mark Gainey and Michael Horvath said, “we plan to take what we earn from these changes and reinvest straight back into building more and better features.”</p><p>However, the Strava community was not the only group promised an abundance of new features, as Strava made a similar statement after raising <a target=\"_blank\" href=\"https://cyclingtips.com/2020/11/strava-raises-110-million-in-series-f-funding/\">$110 million in series F funding</a> last November.</p><p>With multiple <a target=\"_blank\" href=\"https://cyclingtips.com/2021/06/stravas-latest-update-offers-segment-recommendations-and-custom-challenges/\">new feature-heavy</a> updates and <a target=\"_blank\" href=\"https://cyclingtips.com/2021/05/new-strava-update-makes-big-changes-to-layout-organization-and-navigation/\">app revamps</a> in the time since, plus these latest feature updates, Strava is certainly sticking to its word – and expect more to follow.</p></div></div>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f79625e24888dbe0efd79a3d5cd27a5aaffcea13914da9067f8214c157dc1d7b","category":"Cycling"}