{"title":"AWS PrivateLink for Amazon S3 is Now Generally Available","link":"https://aws.amazon.com/blogs/aws/aws-privatelink-for-amazon-s3-now-available/","date":1612298969000,"content":"<div id=\"readability-page-1\" class=\"page\"><section property=\"articleBody\"><div id=\"amazon-polly-audio-tab\"><p><a href=\"https://aws.amazon.com/polly/\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://a0.awsstatic.com/aws-blog/images/Voiced_by_Amazon_Polly_EN.png\" width=\"554\" height=\"56\"></a></p></div><p>At <a href=\"https://reinvent.awsevents.com/\" title=\"\">AWS re:Invent</a>, we pre-announced that <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/privatelink-interface-endpoints.html\" title=\"\">AWS PrivateLink for Amazon S3</a> was coming soon, and soon has arrived — this new feature is now generally available. <a href=\"https://aws.amazon.com/privatelink/\" title=\"\">AWS PrivateLink</a> provides private connectivity between <a href=\"https://aws.amazon.com/s3/\" title=\"\">Amazon Simple Storage Service (S3)</a> and on-premises resources using private IPs from your virtual network.</p><p>Way back in 2015, <span title=\"\">S3</span> was the <a href=\"https://aws.amazon.com/blogs/aws/new-vpc-endpoint-for-amazon-s3/\">first service to add a VPC endpoint;</a> these endpoints provide a secure connection to <span title=\"\">S3</span> that does not require a gateway or NAT instances. Our customers welcomed this new flexibility but also told us they needed to access <span title=\"\">S3</span> from on-premises applications privately over secure connections provided by <a href=\"https://aws.amazon.com/directconnect/\" title=\"\">AWS Direct Connect</a> or <a href=\"https://aws.amazon.com/vpn/\" title=\"\">AWS VPN</a>.</p><p>Our customers are very resourceful and by setting up proxy servers with private IP addresses in their <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Clouds</a> and using gateway endpoints for <span title=\"\">S3</span>, they found a way to solve this problem. While this solution works, proxy servers typically constrain performance, add additional points of failure, and increase operational complexity.</p><p>We looked at how we could solve this problem for our customers without these drawbacks and <span title=\"\">PrivateLink for S3</span> is the result.</p><p>With this feature you can now access <span title=\"\">S3</span> directly as a private endpoint within your secure, virtual network using a new interface VPC endpoint in your <a href=\"https://aws.amazon.com/vpc/\" title=\"\">Virtual Private Cloud</a>. This extends the functionality of existing gateway endpoints by enabling you to access <span title=\"\">S3</span> using private IP addresses. API requests and HTTPS requests to <span title=\"\">S3</span> from your on-premises applications are automatically directed through interface endpoints, which connect to <span title=\"\">S3</span> securely and privately through <span title=\"\">PrivateLink</span>.</p><p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/01/15/explainer.png\" alt=\"\" width=\"800\" height=\"302\"></p><p>Interface endpoints simplify your network architecture when connecting to <span title=\"\">S3</span> from on-premises applications by eliminating the need to configure firewall rules or an internet gateway. You can also gain additional visibility into network traffic with the ability to capture and monitor flow logs in your VPC. Additionally, you can set security groups and access control policies on your interface endpoints.</p><p><span><strong>Available Now<br></strong></span><span title=\"\">PrivateLink for S3</span> is available in all AWS Regions. <a href=\"https://aws.amazon.com/privatelink/\" title=\"\">AWS PrivateLink</a> is available at a <a href=\"https://aws.amazon.com/privatelink/pricing/\">low per-GB</a> charge for data processed and a low <a href=\"https://aws.amazon.com/privatelink/pricing/\">hourly charge</a> for interface VPC endpoints. We hope you enjoy using this new feature and look forward to receiving your feedback. To learn more, check out the <span title=\"\">PrivateLink for S3</span> <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/privatelink-interface-endpoints.html\">documentation</a>.</p><p><strong>Try out <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/privatelink-interface-endpoints.html\" title=\"\">AWS PrivateLink for Amazon S3</a> today, and happy storing.</strong></p><a href=\"https://twitter.com/thebeebs\" title=\"Martin on Twitter\">— Martin</a></section></div>","author":"Martin Beeby","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"f88b3f21988502fd4eb56b2ca770a1c5011e9c9bd51a4722ab7308d80f860e77","category":"Tech"}