{"title":"เกมเพราะเกม นักโทษแแหกคุกในอังกฤษ โดนจับเพราะออกไปซื้อเกม Call of Duty กับเพื่อน","link":"https://www.blognone.com/node/121600","date":1615263862000,"content":"<div id=\"readability-page-1\" class=\"page\"><div id=\"block-system-main\" itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"><p><img alt=\"Node Thumbnail\" src=\"https://www.blognone.com/sites/default/files/styles/thumbnail/public/topics-images/Call-of-duty-logo.png?itok=QGMsFr16\"></p><div itemprop=\"description\"><p>Clint Butler แหกคุกจากเรือนจำ HMP Spring Hill ใน Buckinghamshire ประเทศอังกฤษ ที่เขาโดนโทษ 17 ปี มาเมื่อเดือนพฤศจิกายนปีก่อน และอยู่ในระหว่างกบดานจากเจ้าหน้าที่ตำรวจ</p><p>เขากับเพื่อนก็ทนความเบื่อไม่ไหว ออกมาในเมืองในช่วงล็อกดาวน์เพื่อซื้อเกม Call of Duty แต่ดันมีพิรุธ เดินหันหลังหลบ เมื่อเจอเจ้าหน้าที่ตำรวจ จนดูน่าสงสัยและถูกเจ้าหน้าที่เข้าไปสอบถาม</p><p>เขาบอกเจ้าหน้าที่ตำรวจว่าเข้ามาในเมืองเพื่อซื้อเกม Call of Duty ภาคใหม่ เพราะเบื่อมาก แต่พอถูกสอบถามข้อมูลเพิ่มเติม ก็สติหลุด เข้าทำร้ายเจ้าหน้าที่ และถูกจับหลังมีการชุลมุนกันเล็กน้อย สุดท้ายโดนเพิ่มโทษไปอีก 13 เดือนจากการแหกคุก และอีก 6 เดือนจากการทำร้ายเจ้าพนักงาน</p><p>Nick Rowe สารวัตรตำรวจ West Midlands Police เขตรับผิดชอบที่จับกุม Butler กล่าวว่าเขาไม่เข้าใจว่า Butler จะเสี่ยงติดคุกแบบบื้อๆ ออกมาซื้อเกมในเมือง ในช่วงล็อกดาวน์เพื่ออะไร และคงเป็นปริศนาที่ไขไม่ออกกันต่อไป</p><p>สำหรับผู้ที่ยังไม่ทราบ ปัจจุบันผู้บริโภคสามารถซื้อเกมผ่านสโตร์ออนไลน์ทั้ง Battle.net (สำหรับเกม Call of Duty) และสโตร์อื่นๆ เช่น Steam, Epic Games Store, Origin และอีกมากมายได้แล้ว โดยไม่ต้องเสี่ยงออกมาเจอ COVID-19 หรือโดนตำรวจจับแต่อย่างใด</p><p>ที่มา - <a href=\"https://kotaku.com/bored-fugitive-caught-by-police-after-venturing-out-to-1846417080\">Kotaku</a></p><p><img src=\"https://www.blognone.com/sites/default/files/externals/71bf17c064f3163bd35a2e24f7be6bf6.jpg\" alt=\"\"></p></div><div id=\"page-sharing\"><p><span id=\"page-sharing-title\">Get latest news from Blognone</span></p></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f8afd8d47fb2b9b7d49acb1f378b7a51b9b1f654a28e00e1a2cd2f109e178194","category":"Thai"}