{"title":"Spotify Mobile's Home Hub to Gain Recently Played History and More","link":"https://www.macrumors.com/2021/03/23/spotify-mobile-recently-played-history/","date":1616499745000,"content":"<div id=\"readability-page-1\" class=\"page\"><div role=\"main\"><article expanded=\"true\"><div data-io-article-url=\"/2021/03/23/spotify-mobile-recently-played-history/\"><p>Spotify has <a href=\"https://newsroom.spotify.com/2021-03-22/new-features-on-spotifys-home-hub-make-navigation-and-discovery-even-simpler/\">announced</a> new features coming to its mobile app this month that aim to provide new ways for users to access their recently played history and discover new music.</p><p><img alt=\"spotify march 2021 home screen update\" width=\"1024\" height=\"576\" src=\"https://images.macrumors.com/t/d_oYU635JZXSB1G36zMMEY8PRTY=/400x0/filters:quality(90)/article-new/2021/03/spotify-march-2021-home-screen-update.jpg?lossy\" data-src=\"https://images.macrumors.com/t/d_oYU635JZXSB1G36zMMEY8PRTY=/400x0/filters:quality(90)/article-new/2021/03/spotify-march-2021-home-screen-update.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/d_oYU635JZXSB1G36zMMEY8PRTY=/400x0/filters:quality(90)/article-new/2021/03/spotify-march-2021-home-screen-update.jpg?lossy 400w,https://images.macrumors.com/t/h7nMpfyLH0rZy-M0Gw62v6PFyYA=/800x0/filters:quality(90)/article-new/2021/03/spotify-march-2021-home-screen-update.jpg?lossy 800w,https://images.macrumors.com/t/Vnfdk_hzK8a3NL2SG_qbALNPSSg=/1600x0/filters:quality(90)/article-new/2021/03/spotify-march-2021-home-screen-update.jpg 1600w,https://images.macrumors.com/t/TMw-jIQSEMIr41FqYEbkrKNhpZ0=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/spotify-march-2021-home-screen-update.jpg 2500w\" data-sizes=\"auto\" sizes=\"748px\" srcset=\"https://images.macrumors.com/t/d_oYU635JZXSB1G36zMMEY8PRTY=/400x0/filters:quality(90)/article-new/2021/03/spotify-march-2021-home-screen-update.jpg?lossy 400w,https://images.macrumors.com/t/h7nMpfyLH0rZy-M0Gw62v6PFyYA=/800x0/filters:quality(90)/article-new/2021/03/spotify-march-2021-home-screen-update.jpg?lossy 800w,https://images.macrumors.com/t/Vnfdk_hzK8a3NL2SG_qbALNPSSg=/1600x0/filters:quality(90)/article-new/2021/03/spotify-march-2021-home-screen-update.jpg 1600w,https://images.macrumors.com/t/TMw-jIQSEMIr41FqYEbkrKNhpZ0=/2500x0/filters:no_upscale():quality(90)/article-new/2021/03/spotify-march-2021-home-screen-update.jpg 2500w\"><br>The upcoming update adds a new History icon to the top of the Home screen. Tapping the icon (which looks like Apple's Time Machine icon) displays a screen containing up to three months of listening history in the form of individual tracks. These also include links to the playlists, albums, or shows that the songs were played from.</p><p>The History section will be available to both free-plan members and Premium subscribers.</p><p>Coming exclusively to Premium users, a new section of six tiles at the top of the <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a> will show new and relevant podcast episodes. New episodes will be marked with a blue dot, and episodes already started by users will display a progress bar indicating how far into the episode they are.</p><p>Lastly, another Premium-exclusive feature is a new section that will sit under these six tiles to highlight new releases from followed artists. Spotify says this section will be \"personalized, timely, and reactive to your taste.\"</p><p>Spotify says the redesigned Home interface will begin rolling out to both Android and iOS users globally this month.</p></div></article><p></p><h2>Top Stories</h2><p></p><div><h3><a href=\"https://www.macrumors.com/2021/03/19/apple-stops-signing-ios-14-4-1/\">Apple Stops Signing iOS 14.4 Following Release of iOS 14.4.1</a></h3><p>Friday March 19, 2021 1:23 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>Following the release of iOS 14.4.1 on March 8, Apple has stopped signing iOS 14.4, the previous version of iOS 14. With the software no longer being signed, it is no longer possible to downgrade from iOS 14.4.1 to iOS 14.4 if you've already upgraded your iPhone or iPad. Apple routinely stops signing older versions of software updates after new releases come out in order to encourage...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/19/handy-iphone-shortcuts/\">Handy iPhone and iPad Shortcuts You Should Check Out</a></h3><p>Friday March 19, 2021 12:31 pm PDT by <a href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\">Juli Clover</a></p><p>With the launch of iOS 13, Apple introduced Shortcuts support and the Shortcuts app, adding a whole range of new functionality to the iPhone. Shortcuts have continued to be popular since their debut, and in iOS 14, the addition of Home screen widgets made it even easier to get to your Shortcuts, so we thought we'd round up some of our most useful Shortcut options for iPhone and iPad. Subscribe ...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/20/apple-brazil-fine-iphone-charger/\">Apple Fined $2 Million in Brazil for Selling iPhones Without Chargers</a></h3><p>Saturday March 20, 2021 8:04 am PDT by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Apple has been slapped with a near $2 million fine in the Brazilian state of São Paulo over violations of the Consumer Law Code due to the lack of a charger in the box for newer iPhones, Brazilian tech news outlet Tilt reports. Procon-SP, São Paulo's consumer protection agency, decided to fine Apple following intense scrutiny over the decision to remove the power adapter from the boxes of...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/20/top-stories-thunderbolt-ipad-pro/\">Top Stories: iPad Pro With Thunderbolt?, Intel Mocks M1 Macs, iMac Pro Officially Discontinued</a></h3><p>We're past the halfway point of March with no sign of an Apple media event, but that doesn't mean we won't be seeing an event or simply some product launches via press release in the coming weeks, as rumors of upcoming products continue to circulate. Subscribe to the MacRumors YouTube channel for more videos. Perhaps the biggest news topic this week was Justin Long of Apple's \"Get a Mac\" ad...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/20/512gb-1tb-ssd-imac-21-discontinued/\">Apple Discontinues 512GB and 1TB SSD Configurations of 4K 21.5-inch iMac</a></h3><p>Saturday March 20, 2021 8:15 am PDT by <a href=\"https://www.macrumors.com/author/sami-fathi/\" rel=\"author\">Sami Fathi</a></p><p>Just hours after officially discontinuing the iMac Pro, Apple has also discontinued the 512GB and 1TB SSD configurations of the 4K 21.5-inch iMac. Last month, both options became unavailable for purchase, although it was unclear at the time whether it was a temporary issue due to a component supply problem or if it was a permanent decision to no longer offer the options. Apple has now...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/22/apple-speakers-with-screens-and-cameras-report/\">Apple Developing New 'HomePod' Models With Screens and Cameras</a></h3><p>In a report today focused on an unactivated temperature/humidity sensor in the HomePod mini, Bloomberg's Mark Gurman briefly mentioned that Apple has \"been developing new speakers with screens and cameras.\" This reporting suggests that Apple could be at least exploring the idea of new HomePod models with a display and camera to compete with the likes of Google's Nest Hub Max, Amazon's Echo...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/22/apple-tvos-homepod-facetime-framework/\">Apple Adds FaceTime Framework to Apple TV/HomePod Amid Speaker With Screen Rumors</a></h3><p>Bloomberg's Mark Gurman today revealed that Apple has been developing new speakers that are equipped with \"screens and cameras,\" suggesting we could see a future HomePod-like device that has a built-in display and camera feature for FaceTiming and other functions. Ahead of these rumors, MacRumors contributor Steve Moser was combing through the tvOS 14.5 beta code and found that Apple has...</p></div><div><h3><a href=\"https://www.macrumors.com/2021/03/18/apple-event-april-rumor-recap/\">Apple Event in April? Recapping the Latest iPad Pro, AirPods, and AirTags Rumors</a></h3><p>It's been a whirlwind of a month for Apple rumors. First, we heard from leaker Jon Prosser that an Apple Event was planned for March 16, but that was ruled out by Bloomberg's Mark Gurman. Once that date passed, Prosser and other leakers then suggested there would be an Apple Event on March 23, which is seemingly not happening either. With attention now shifting to April, we've put together...</p></div></div></div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f8eb1ba128d9c78a293fb12075633036a3bfd36b9789fd5233e5718cc1c55a15","category":"Apple"}