{"title":"Europe is starting to freak out about the launch dominance of SpaceX","link":"https://arstechnica.com/?p=1751120","date":1616426664000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>rouleau compresseur —</h4><h2 itemprop=\"description\">The Falcon 9 has come to dominate commercial satellite launches.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/07/37917_A4-800x487.jpg\" alt=\"Artist's view of the configuration of Ariane 6 using two boosters (A62) on the ELA-4 launch pad together with the system's mobile launch gantry.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/07/37917_A4.jpg\" data-height=\"853\" data-width=\"1400\">Enlarge</a> <span>/</span> Artist's view of the configuration of Ariane 6 using two boosters (A62) on the ELA-4 launch pad together with the system's mobile launch gantry.</p><p>ESA - D. Ducros</p></figcaption></figure><p>A little more than a week ago, the European Space Agency <a href=\"https://www.esa.int/Enabling_Support/Space_Transportation/ESA_defines_elements_of_future_European_space_transportation_solutions\">announced</a> an initiative to study \"future space transportation solutions.\" Basically, the agency provided about $600,000, each, to three companies—ArianeGroup, Avio, and Rocket Factory Augsburg—to study competitive launch systems from 2030 onward.</p><p>This initiative would allow Europe to understand and prepare for the future of space launch, said&nbsp;Daniel Neuenschwander, director of space transportation for the space agency. It \"lays the foundations that enable us to prepare the future beyond Ariane 6 and Vega-C,\" he said. \"These system concept studies will include services that prioritize the future needs of Europe’s space programs but also allow us to address global market needs.\"</p><p>The implication is that Europe's next generation of rockets, the larger Ariane 6 booster and smaller Vega-C, will meet the continent's launch needs for the next decade. <a href=\"https://arstechnica.com/science/2018/07/as-the-spacex-steamroller-surges-european-rocket-industry-vows-to-resist/\">Both of these new rockets</a>, which are evolved from an earlier generation of boosters, are due to make their debut within the next 12 to 18 months.</p><p>However, there now appears to be increasing concern in Europe that the Ariane 6 and Vega-C rockets <em>will not</em> be competitive in the launch market of the near future. This is important, because while member states of the European Union pay for development of the rockets, after reaching operational status, these launch programs are expected to become self-sufficient by attracting commercial satellite launches to help pay the bills.</p><p>Economic ministers in France and Italy have now concluded that the launch market has changed dramatically since 2014, when the Ariane 6 and Vega-C rockets were first designed. <a href=\"https://www.lefigaro.fr/societes/spatial-paris-et-rome-s-unissent-pour-l-apres-ariane-6-20210319\">According to a report</a> in <em>Le Figaro</em> newspaper, the ministers believe the ability of these new European rockets to compete for commercial launch contracts has significantly deteriorated since then.</p><p>The primary cause? SpaceX. Thanks to its reusable, low-cost Falcon 9 rocket, SpaceX has been able to slash prices for large commercial satellites that could be lofted by the Ariane 6. Whereas Europe's Ariane vehicles once played a dominant role in launching geostationary satellites, they've lost considerable market share since 2014. Moreover, through its rideshare program for the Falcon 9, SpaceX also threatens to take missions away from Vega-C, which has a lift capacity of about 1.5 tons to polar orbit.</p><p>As the newspaper reports, Europe now lags behind SpaceX in other key ways. Because of its partnership with NASA, SpaceX can now launch astronauts. French astronaut Thomas Pesquet, in fact, is a mission specialist on the Crew-2 mission due to launch next month. He will likely be the first of many European astronauts to reach space on a SpaceX vehicle. Europe also presently has no answer to the Starlink megaconstellation that SpaceX is in the midst of launching—either in the capacity to build hundreds of satellites a year or affordably get them into orbit.</p><p>Because of this, the French and Italian ministers are calling for Europe to offer a significant \"technological and industrial\" response to the rise of SpaceX. It is not clear what form this would take, nor how quickly the European nations could move in response.</p><p>Moreover, any initiative will be complicated by politics. The Ariane program has roots in France, while Vega originated in Italy. Germany, with no history of its own rockets during the European Union era, nonetheless has several promising small launch companies, including Rocket Factory Augsburg, and it may seek to foster private competition rather than financially support an institutional approach.</p></div></div>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f943818593c8e70c04669233c77615956ad3123501a7d4adab9133b95a9934a2","category":"Tech"}