{"title":"Why Big Tech is facing regulatory threats from Australia to Arizona","link":"https://arstechnica.com/?p=1747386","date":1615473903000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Backlash —</h4><h2 itemprop=\"description\">The era of Silicon Valley exceptionalism is over.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/world-tech-connected-800x500.jpg\" alt=\"Why Big Tech is facing regulatory threats from Australia to Arizona\"><figcaption><p>Jackie Niam | Getty Images</p></figcaption></figure><p>Last week, Arizona's House of Representatives <a href=\"https://arstechnica.com/tech-policy/2021/03/arizona-house-advances-bill-targeting-apple-google-mobile-app-stores/\">approved</a> legislation to prohibit platform owners like Apple and Google from locking app makers into their own payment systems. The bill passed only narrowly, and it must be approved by the Arizona Senate and Gov. Doug Ducey before it can become law. But regardless of the bill's ultimate fate, the vote is the latest sign of a dramatic shift in public attitudes toward Silicon Valley's most powerful companies.</p><p>For the first two decades of the Internet era, there was a broad consensus that politicians shouldn't tie Silicon Valley companies down with burdensome rules and regulations. Companies like Apple, Amazon, Google, and Uber were widely admired. In 2007, presidential candidates from both parties <a href=\"https://www.nytimes.com/2007/12/02/business/02digi.html\">made pilgrimages</a> to associate themselves with Google. In 2015, Jeb Bush, Ted Cruz, and other Republican hopefuls <a href=\"https://www.vox.com/2015/7/24/9026455/republicans-love-uber\">tripped over each other</a> to position themselves as the most Uber-friendly candidate.</p><p>Tech companies' prestige bolstered their political power. Those who proposed regulations to rein in tech companies—or in some cases just wanted to subject them to the same rules as other companies—were often dismissed as out-of-touch reactionaries and enemies of progress.</p><p>But all that is changing. Products like YouTube, the iPhone, and ride-hailing apps have become banal parts of modern life. The companies behind them are widely considered entrenched incumbents. And so the public and their elected representatives increasingly treat them like other big, powerful companies. Politicians score points by railing against them. Proposals to rein them in sometimes poll well.</p><p>The next few years are going to be particularly challenging for companies like Apple, Google, Facebook, and Uber because they are global companies. They not only have to worry about antitrust lawsuits by the US federal government, they also face heavy scrutiny from US states and from foreign governments around the world. For the tech giants, there's a danger that a policy experiment in one jurisdiction could become a precedent that's copied around the world.</p><h2>Scorched-earth tactics used to work for Uber and Lyft</h2><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1298805062.jpg\" data-height=\"2640\" data-width=\"3889\" alt=\"A Lyft vehicle in San Francisco, in 2012.\"><img alt=\"A Lyft vehicle in San Francisco, in 2012.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1298805062-640x434.jpg\" width=\"640\" height=\"434\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1298805062-1280x869.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1298805062.jpg\" data-height=\"2640\" data-width=\"3889\">Enlarge</a> <span>/</span> A Lyft vehicle in San Francisco, in 2012.</p></figcaption></figure><p>Back in 2016, the city of Austin, Texas wanted Uber and Lyft to fingerprint drivers—a rule that already applied to regular taxi drivers in the city. The idea was approved by 56 percent of the city's voters. Uber and Lyft responded by <a href=\"https://www.nytimes.com/2016/05/10/technology/uber-and-lyft-stop-rides-in-austin-to-protest-fingerprint-background-checks.html\">going nuclear</a>—shutting down their Austin operations until the city changed its rules.</p><p>Austin officials argued they were simply requiring Uber and Lyft to play by the same rules as other taxi providers. But many members of the public, especially customers of the services, bought into a different narrative: that Austin officials were out of touch and hostile to modern technology. Having a significant part of the public behind them gave Uber and Lyft a lot of power—power Uber and Lyft ultimately used to get the state legislature to <a href=\"https://archive.curbed.com/2017/6/14/15803138/austin-uber-lyft-transportation-ride-hailing-return\">override Austin's rules</a>.</p><p>This wasn't a one-off victory. It's a playbook the companies used over and over again in their early years. Uber and Lyft would frequently swoop into a new metropolitan area without worrying too much about local taxi regulations. Spending millions in venture capital, they'd try to build up a customer base as quickly as possible. City officials feared a backlash from these customers and they didn't want to be seen as standing in the way of progress. So they almost always relented.</p><h2>Now Uber and Lyft are on the defensive</h2><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/GettyImages-634301230.jpg\" data-height=\"3744\" data-width=\"5616\" alt=\"A Lyft driver in San Francisco, California.\"><img alt=\"A Lyft driver in San Francisco, California.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/GettyImages-634301230-640x427.jpg\" width=\"640\" height=\"427\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/GettyImages-634301230-1280x853.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/GettyImages-634301230.jpg\" data-height=\"3744\" data-width=\"5616\">Enlarge</a> <span>/</span> A Lyft driver in San Francisco, California.</p></figcaption></figure><p>This strategy has become less effective in recent years. Partly that's because activists have generated more negative press for these firms. Once the gusher of venture-funded subsidies dried up, driving for Uber or Lyft proved to be a low-paying and precarious gig. Critics have also highlighted the problem of sexual assaults occurring in Uber and Lyft vehicles—although it's not clear if Uber and Lyft have a bigger problem here than traditional taxis.</p><p>But perhaps the most important shift is that Uber and Lyft are no longer seen as underdogs. In the early 2010s, these companies' survival still seemed like an open question. Customers worried that incumbent taxi companies would use antiquated regulations to smother them in the cradle. So when Uber and Lyft argued that a particular regulation could force them to leave a city or state, customers believed them and some lobbied their elected officials to back off.</p><p>Today this just isn't a serious concern. Uber and Lyft are multibillion dollar companies operating in dozens of cities. Many jurisdictions have passed legislation explicitly allowing this type of service to operate.</p><p>As a result, the companies are finding it more and more difficult to beat back efforts to regulate their business practices. In 2019, California <a href=\"https://arstechnica.com/tech-policy/2019/09/uber-and-lyft-vow-continued-fight-against-california-worker-rights-bill/\">passed legislation</a> requiring Uber and Lyft to treat their drivers as employees. As they've done in the past, Uber and Lyft threatened to shut down their services if voters didn't overturn the law. Voters <a href=\"https://arstechnica.com/tech-policy/2020/11/california-votes-against-granting-uber-and-lyft-drivers-employee-status/\">ultimately approved</a> a ballot measure sponsored by Uber and Lyft. But Uber and Lyft was forced to make some tactical concessions; the voter-approved measures offered gig economy drivers some added protections.</p><p>And things are going even worse for Uber outside the United States. Last month the Supreme Court of the United Kingdom <a href=\"https://arstechnica.com/tech-policy/2021/02/uk-supreme-court-says-uber-drivers-are-not-independent-contractors/\">ruled</a> that Uber can't treat its drivers like independent contractors. Courts in <a href=\"https://www.reuters.com/article/us-uber-court/top-french-court-deals-blow-to-uber-by-giving-driver-employee-status-idUSKBN20R23F\">France</a> and <a href=\"https://thenextweb.com/shift/2020/09/24/spains-top-court-declares-gig-workers-are-employees-not-contractors/\">Spain</a> have reached similar conclusions—though Uber seems to still be <a href=\"https://hacklerflynnlaw.com/how-france-is-responding-to-the-uber-and-the-gig-economy/\">resisting</a> a switch to an employee model in France.</p><p>Last year, <a href=\"https://www.nytimes.com/2020/07/14/technology/massachusetts-sues-uber-lyft.html\">Massachusetts filed a lawsuit</a> against Uber and Lyft arguing that their drivers are employees under state law. A <a href=\"https://globalnews.ca/news/7111024/supreme-court-of-canada-uber-drivers-employees/\">class-action lawsuit</a> in Ontario makes a similar claim.</p><p>In each of these jurisdictions, a key Uber argument is that enforcing traditional labor law will break Uber's on-demand business model. That argument is hard to evaluate, since Uber has been mostly been successful in defeating these efforts. But Uber will very likely need to change how it does business in the UK, France, Spain, and probably other jurisdictions in the coming years.</p><p>If Uber manages to come up with a viable model that treats drivers as employees, it will face pressure to adopt the same model in other cities. Though of course the opposite is also possible: maybe a switch to an employee-based model will make Uber's service dramatically worse in places like France and Spain, strengthening Uber's case in future battles.</p><h2>Google and Facebook are on the defensive on news payments</h2><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1303955169.jpg\" data-height=\"1886\" data-width=\"2829\" alt=\"Australian Prime Minister Scott Morrison.\"><img alt=\"Australian Prime Minister Scott Morrison.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1303955169-640x427.jpg\" width=\"640\" height=\"427\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1303955169-1280x853.jpg 2x\"></a><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1303955169.jpg\" data-height=\"1886\" data-width=\"2829\">Enlarge</a> <span>/</span> Australian Prime Minister Scott Morrison.</p><p>Sam Mooy/Getty Images</p></figcaption></figure><p>Some news organizations have long blamed Google and Facebook for draining away ad revenue that previously went to newspapers and other news media. In 2014, the government of Spain <a href=\"https://www.reuters.com/article/us-google-spain-news/google-to-shut-down-news-site-in-spain-over-copyright-fees-idUSKBN0JP0QM20141211\">passed legislation</a> requiring Google to pay to link to news articles.</p><p>Google responded to this legislation in much the same way Uber and Lyft responded to Austin's legislation: by shutting down the Spanish version of Google News. Traffic to Spanish news sites plunged, hurting their advertising revenue. The Spanish government was ultimately forced to capitulate. Like Uber and Lyft in Austin, Google portrayed Spanish officials as out of touch and ignorant of how the Internet worked.</p><p>Google's scorched-earth response to the Spanish law gave the company a few years' reprieve from these \"link tax\" proposals. But in 2019, they returned with a vengeance. The European Parliament <a href=\"https://arstechnica.com/tech-policy/2019/03/the-eu-votes-on-a-confusing-new-copyright-law-tuesday/\">passed a copyright overhaul</a> that gave news organizations a new right to charge people who reproduced \"snippets\" of news stories. Officials in France, one of the first countries to implement the new rules, <a href=\"https://arstechnica.com/tech-policy/2020/04/french-regulator-says-google-must-pay-news-sites-to-send-them-traffic/\">warned Google</a> that it wouldn't be allowed to simply delist news sites to avoid paying. So Google <a href=\"https://arstechnica.com/tech-policy/2021/01/google-agrees-to-pay-french-news-sites-to-send-them-traffic/\">started paying</a>.</p><p>When Australia began debating its own \"link tax\" proposal targeting both Google and Facebook, the companies threatened to pull their products from the Australian market. In February, Facebook <a href=\"https://arstechnica.com/tech-policy/2021/02/facebook-bans-all-australian-news-content-over-pay-to-link-proposal/\">banned Australian users</a> from posting news stories from Facebook, much as Google had done in Spain seven years earlier. But this time the outcome was rather different. Australian officials <a href=\"https://arstechnica.com/tech-policy/2021/02/facebooks-australia-news-ban-backfires-hits-government-and-charity-pages/\">vowed</a> not to let Facebook intimidate them. Facebook did wring some concessions out of the Australian government, but ultimately Australia <a href=\"https://arstechnica.com/tech-policy/2021/02/australia-passes-law-to-force-facebook-and-google-to-pay-for-news/\">passed legislation</a> that effectively requires Google and Facebook to pay to link to news stories.</p><p>Of course, leaders in other countries have been closely monitoring the Australian and French showdowns. Now that those countries shown how to stare down Google and Facebook, we can expect other countries to follow their example. The Canadian government is reportedly <a href=\"https://nypost.com/2021/02/20/canada-to-take-on-facebook-by-seeking-payment-for-content/\">working</a> on legislation similar to Australia's law. And we can expect a lot of EU member states to follow the French model as they implement the EU Copyright Directive.</p><h2>We could wind up with a more balkanized Internet</h2><figure><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/08/iphone.jpg\" data-height=\"575\" data-width=\"900\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/08/iphone-640x409.jpg\" width=\"640\" height=\"409\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2019/08/iphone.jpg 2x\"></a><figcaption></figcaption></figure><p>The fight in Arizona over app store policies has some similarities to the news and ride-hailing battles, as well as some differences. One important difference is that Apple and Google can't credibly threaten to pull their smartphone platforms out of the Arizona market.</p><p>On the other hand, this is another case where tech companies are battling similar legislative proposals on many different fronts. A few weeks ago, for example, Apple <a href=\"https://www.cnbc.com/2021/02/16/apple-wins-victory-as-north-dakota-votes-down-bill-that-would-regulate-app-stores.html\">defeated North Dakota legislation</a> requiring the company to allow iOS apps to use third-party payment mechanisms. Epic Games, Apple's main protagonist in the payment fight, has also made formal complaints to competition regulators in the <a href=\"https://www.theverge.com/2021/2/17/22286998/epic-games-apple-european-comission-antitrust-complaint-app-store-fortnite\">European Union</a>, the <a href=\"https://www.bloomberg.com/news/articles/2021-01-14/epic-widens-fortnite-access-dispute-with-apple-google-in-u-k\">United Kingdom</a>, and <a href=\"https://www.epicgames.com/site/en-US/freefortnite-australia-press-release\">Australia</a>.</p><p>It's impossible to predict how any of these specific fights will play out, but it seems likely that Epic will prevail in at least one of these venues. That could force Apple to open up its app store to third-party payments somewhere in the world. And once they've done that, it will be easier for officials in other countries to press Apple to make the same options available for their own consumers and developers.</p><p>Meanwhile, big tech companies are facing broader investigations—and in some cases lawsuits—from a number of governments. The US government along with 52 states and territories <a href=\"https://arstechnica.com/tech-policy/2020/12/new-suits-accuse-google-of-antitrust-evils-collusion-with-facebook/\">sued Google</a> late last year over anticompetitive behavior in the search and ad markets. Another lawsuit by the Federal Trade Commission and 47 states seeks to <a href=\"https://arstechnica.com/tech-policy/2020/12/ftc-48-states-file-suits-to-break-up-instagram-and-whatsapp-from-facebook/\">break up Facebook</a>. Several tech giants are <a href=\"https://www.bloomberg.com/news/articles/2019-07-02/facebook-is-latest-to-come-under-eu-s-antitrust-scrutiny\">under investigation</a> by European competition authorities. Australian officials have said they see the news bargaining rule as <a href=\"https://www.reuters.com/article/us-australia-facebook-google/australian-competition-watchdog-warns-google-facebook-laws-are-just-the-start-idUSKBN29H11I\">just the first step</a> in regulating the tech giants.</p><p>In short, it seems that Silicon Valley companies will increasingly be forced to knuckle under to the policy preferences of governments around the world. Critics of concentrated tech company power may see this as a positive development. But it could also have a big downside: making it more difficult for companies to operate across national borders.</p><p>One of the great things about the Internet is how easy it is for a software company in one nation to expand rapidly and offer its product to customers around the world. But if countries, states, and other jurisdictions adopt a growing thicket of rules governing how online services have to work, it will be harder to offer a single product in multiple jurisdictions. Big companies like Apple and Google will figure it out. Smaller companies might struggle.</p><p>On the other hand, the major technology incumbents haven't faced a lot of serious new competitors in the last decade. So as the Internet industry matures and incumbents become ever more entrenched, there may not be that much downside to having different rules in France and Australia—or for that matter, Arizona and North Dakota.</p></div></div>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f9600c05351f81839967c1146036825cb15a5af34473c7cbe1aabcb196d9d1b8","category":"Tech"}