{"title":"Can you make a comedy set during COVID-19? Recovery takes the idea for a drive","link":"https://arstechnica.com/?p=1751106","date":1616853616000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Comedy is tragedy plus time (roughly 12 months) —</h4><h2 itemprop=\"description\">Director: \"I want people thinking it’s a Marvel movie. And that Timothee Chalamet is in it.\"</h2></header><div itemprop=\"articleBody\"><figure><p><iframe type=\"text/html\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/fTkbqmxPP0E?start=0&amp;wmode=transparent\" frameborder=\"0\" allowfullscreen=\"\"></iframe></p><figcaption><p>The trailer for <em>Recovery</em>, which enjoyed its world premiere at SXSW 2021.</p></figcaption></figure><p>The second edition of <a href=\"https://arstechnica.com/gaming/2020/03/the-only-little-movie-screen-in-the-capital-of-texas/\">South by Southwest to take place in the middle of our in-progress pandemic</a> just wrapped. Maybe this should've been obvious beforehand—since everyone from Michael Bay to Netflix rolled out shot-in-quarantine films in recent months—but the era of COVID-19 films is clearly upon us, before the era of COVID-19 has subsided even a tad. Of the 75 feature-length films on the SXSW Online 2021 schedule, more than a tenth (<a href=\"https://www.vulture.com/2021/02/sxsw-film-festival-2021-all-of-the-movies-about-covid.html\">at least eight</a>) explicitly involve COVID-19.</p><p><em>Recovery&nbsp;</em>is not a comedy about COVID-19; it's a&nbsp;buddy comedy written by and starring actors Mallory Everton and Whitney Call. These first-time filmmakers use COVID-19 as their film's setting in the same way that&nbsp;<em>Harold and Kumar&nbsp;</em>uses an insanely high night. During a <a href=\"https://online.sxsw.com/event/sxsw-online/planning/UGxhbm5pbmdfMzM2NTk5\">panel on the film's creation</a>, in fact, co-director Stephen Meek said the team set out to make a road movie, taking a lot of inspiration from British films <em>Locke&nbsp;</em>and&nbsp;<em>The Trip.&nbsp;</em>That format, after all, could theoretically be executed safely and quickly in the middle of a global health crisis. (Apparently, roughly 20 pages of the script were all filmed on the same road.)</p><p>\"This was during the time when we all were still really afraid to open our doors and breathe outside,\" Call said. “It wasn’t that far after March 2020 that we made the March 2020 movie—it was June when we started writing it.”</p><p>\"[A friend said] if you told me you’re going to make comedy, in a pandemic, about the pandemic, and that it's a road trip movie, I would've advised you to do <i>none </i>of those things,” Meek said. \"But we pulled it off.\"</p><div><ul><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/recovery-195476-150x150.jpeg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/recovery-195476.jpeg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/recovery-195476-980x551.jpeg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/recovery-195476-1440x810.jpeg 2560\" data-sub-html=\"#caption-1751107\"><figure><figcaption id=\"caption-1751107\"><span></span><p>Blake (Mallory Everton, to the right) readies herself to exit the car and handle a sticky gas pump, armed with nothing but sandwich bags for gloves. Jamie (Whitney Call, left) looks on in appropriate disgust and horror.</p><p><span></span> Brenna Empey</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-22-at-4.47.47-PM-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-22-at-4.47.47-PM.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-22-at-4.47.47-PM-980x500.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-22-at-4.47.47-PM-1440x734.png 2560\" data-sub-html=\"#caption-1751347\"><figure><figcaption id=\"caption-1751347\"><span></span><p>The Hyundai starring in <em>Recovery</em> actually belongs to writer/actor Whitney Call and her husband, director Stephen Meek.</p><p><span></span> Brenna Empey</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.30.49-AM-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.30.49-AM.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.30.49-AM-980x421.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.30.49-AM-1440x619.png 2560\" data-sub-html=\"#caption-1751463\"><figure><figcaption id=\"caption-1751463\"><span></span><p>I'm not sure why sequences like this are in the film, but I'm glad they are. (Also, <em>Recovery</em>'s soundtrack overall is 🔥🔥🔥, so kudos to the sound team.)</p><p><span></span> Brenna Empey</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.30.19-AM-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.30.19-AM.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.30.19-AM-980x453.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.30.19-AM-1440x666.png 2560\" data-sub-html=\"#caption-1751462\"><figure><figcaption id=\"caption-1751462\"><span></span><p>This is a film where you encounter someone named \"Gorb.\" In the press notes, Call and Everton shared what they want people to know about the film: What would you want people to know before watching this film? C: 2020’s been a real douchebag to all of us. // E: I want people to go into this film thinking it’s a Marvel movie. And that Timothee Chalamet is in it. They’ll love it.</p><p><span></span> Brenna Empey</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.32.07-AM-150x150.png\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.32.07-AM.png\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.32.07-AM-980x417.png 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-23-at-7.32.07-AM-1440x613.png 2560\" data-sub-html=\"#caption-1751464\"><figure><figcaption id=\"caption-1751464\"><span></span><p>Stick around for the credits, where Call and Everton share some of the work they created together as kids (they're big proponents of women in film and hope to encourage others with female-centric stories and production teams).</p><p><span></span> Whitney Call</p></figcaption></figure></li><li data-thumb=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/PXL_20210322_213214362-150x150.jpg\" data-src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/PXL_20210322_213214362.jpg\" data-responsive=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/PXL_20210322_213214362-980x735.jpg 1080, https://cdn.arstechnica.net/wp-content/uploads/2021/03/PXL_20210322_213214362-1440x1080.jpg 2560\" data-sub-html=\"#caption-1751388\"><figure><figcaption id=\"caption-1751388\"><span></span><p>Sneaky SXSW DRM stuff won't let you screenshot during any of the streaming panels, but here's (L to R) Call, Everton, and Meek discussing their feature for the festival.</p><p><span></span> SXSW</p></figcaption></figure></li></ul></div><p>The road trip in <em>Recovery&nbsp;</em>puts sisters Jamie (Call) and Blake (Everton) behind the wheel. Shortly after Jamie's 30th birthday, the two find themselves quarantined together in Albuquerque and slowly going a bit stir-crazy. So when they get an official notice that their grandmother in Washington state lives in a nursing home with some confirmed COVID-19 cases, the choice is clear: get in the car, get on the road, and go 20-plus hours to save Grandma.</p><p>Beyond giving the film's two central sisters a reason to get in motion, artifacts from our COVID-times largely lurk in the background. <em>Recovery's</em>&nbsp;ideas and punchlines about it never really move beyond surface-level. One family member ignores the increasingly clear grim reality to an alarming degree. Lysol spray flows amply. Multiple references to Tom Hanks' well-being pop up. As with all of these comedic touches, a lot of audience can now laugh at something—say, having to rely on whatever plastic you can find in the console to touch a gas pump—because it's become another universally relatable experience for these times. (Personally, I used dog waste bags instead of sandwich ones.) But the team had to constantly weigh the COVID-ness of it all: Which of these touchpoints could elicit laughter? Which would be relatable in a year or two? Which felt too glommed onto the story or too outside of these characters' character?</p><p>\"That was a huge fear—how much context [do you need]?\" Everton said. \"Do you need to really say something of value about the period you’re in? We were constantly wondering, 'Are people going to care about this? Are they going to get this joke? Will it make sense?'\"</p><p>Overall, the film can feel a little meandering at times. But whether or not it's intentional, that attitude does genuinely mimic the experience of the 20-plus-hour road trip. When you're in the car with only one other person for that amount of time, maybe it's only natural to fixate a little too much on a text exchange with someone who still has the word \"Tinder\" attached to their name within the Contacts list, for instance. As the center of a confined buddy comedy, Jamie and Blake feel more real than some because they genuinely act like siblings would on such a tedious journey—they have inside jokes that don't need explanation and there's no rift just for the sake of narrative tension because these people get along and could do so for a few straight days.</p><p>Playing off that dynamic, the best bits in&nbsp;<em>Recovery&nbsp;</em>come from&nbsp;Jamie and Blake leaning into their unique brands of weirdness. Jamie teaches fourth grade and has kids watching the classroom pets while she's away—\"Have you ever smelled mouse afterbirth?\" is a question that will stay with me (and reliably incite a chuckle) for a bit. She has some <em>vivid&nbsp;</em>passenger seat dreams, too.&nbsp;Blake has the more over-the-top personality, and her thoughts during a game of \"Dealbreaker\" (where you must consider whether things like having rotisserie chicken for hands would be a dealbreaker in a guy) emphasize that. They meet a few characters who reveal themselves as their oddity equal. The duo also get a few cinematically indulgent, slo-mo sequences where they dance in the middle of a desert or rollerblade down rural roads... well, because it's fun and looks cool. Such moments earn a smirk through sheer absurdity, not from saying anything clever about COVID. (The idea of someone fermenting wine from Dial is probably a touch funnier considering the situation, though.)</p><p><em>Recovery&nbsp;</em>could probably be a bit tighter than its current 80 minutes, or a few of the film's slower moments could be spiked in favor of more sequences either showcasing the personalities of these two main characters or exploring the complications of the journey they're on. For me, the film also seemed to have a false flag ending, and it's possible that the film overall may have been more interesting if the teased route was followed. But the choice the&nbsp;<em>Recovery&nbsp;</em>team&nbsp;makes ultimately better fits the breezy, vibes-only tone of this largely hangout comedy; it's the right way to wrap the story these writers wanted to tell.</p><p>Call, Everton, Meek, and the <em>Recovery&nbsp;</em>team&nbsp;managed to do all this within a short period of time while a global pandemic unfolded all around them and the industry. Considering that context,&nbsp;<em>Recovery&nbsp;</em>stands as a remarkably resilient bit of filmmaking—it's a quick-turnaround project that incorporates a very scary, in-progress real world scenario and gives audiences more than a few chuckles to forget about that off-screen life for a while. Comedy, during COVID-19 or not, remains subjective, and this one won't land for everyone. But it's easy to root for the people you see in&nbsp;<em>Recovery&nbsp;</em>(both on-screen and off) as they face the unknown of life in 2020 head-on and push forward to do something.</p><p>\"We decided to make this movie in the middle of 2020 to give shape to our suddenly purposeless lives, and, since we were&nbsp;horribly depressed, we wanted to make something that wasn’t horribly depressing,\" Meek and Everton wrote in their <a href=\"https://drive.google.com/file/d/1KabibshbVl9tXiJNUfpgSsE71XdnR-i0/view\">directors' statement.</a>&nbsp;\"It is a friendly wave to the world with&nbsp;which we miss colliding, a love letter to you and the year you’ve had...&nbsp;When we&nbsp;wrote the script, we didn’t know when the pandemic would end, and, as we write this statement, we still don’t.\"</p><p>Recovery <em>remains on the festival circuit and is currently seeking&nbsp;</em><em>distribution. Stay tuned to production house&nbsp;<a href=\"https://www.facebook.com/sorofilms/\">Sorø Films' Facebook page</a> for the latest updates.</em></p><p><em>Listing image by Brenna Empey</em></p></div></div></div>","author":"Nathan Mattise","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fb38abd5763ee04eedc33819cbd75ec4c847df6761b2822bb03bb5cc706df392","category":"Tech"}