{"title":"Eurosport to air special on 'state of play' in women's sport","link":"https://www.cyclist.co.uk/news/9345/eurosport-to-air-special-on-state-of-play-in-womens-sport","date":1615209807000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>Eurosport will air a special programme focussing on the 'state of play' in women's sport this evening at 19:00GMT.</p><p>To mark International Women's Day, the film will look across multiple sports at the current situation and the future, highlighting the immense gender disparity that's still present in most sports.</p><p>'International Women's Day – Women in Sport' features a discussion hosted by Orla Chennaoui with a panel that includes former England netball coach Tracey Neville, former tennis player Annabel Croft and British cyclist Lizzy Banks.</p><p>Banks, who rides for Ceratizit-WNT Pro Cycling, was speaking prior to competing in Strade Bianche and emphasised the huge gap in the prize fund between men and women in cycling.</p><p>'In my sport the prize fund is dictated by the organiser, it's not dictated by the world governing body, it's the organiser's decision how they split the prize pot. I just don't understand, are we seven times less valuable than the men's race? I don't think so,' she said.</p><p>At this weekend's races, €40,000 was split amongst the men while the women shared only €10,260, with the winners <a href=\"https://www.cyclist.co.uk/tags/mathieu-van-der-poel\">Mathieu van der Poel</a> and Chantal van den Broek-Blaak taking home €16,000 and €2,256 respectively.</p><p>Banks also highlighted another race, <a href=\"https://www.bbc.co.uk/sport/cycling/56307206\" target=\"_blank\">revealed by the <em>BBC</em> to be Omloop Het Nieuwsblad</a>, saying: 'I got the race manual the night before and I always flick through to see what the difference in the prize money is, just out of interest, because some race organisers are really forward thinking and they're like, we're going to make the change now and we're going to make it equal and then everything else will come.&nbsp;</p><p>'Not so much with this organiser, the prize fund for the male winner was €16,000 and the prize fund for the female winner was €930.'</p><p>Tomas van den Spiegel, chief executive of Omloop organiser Flanders Classics told the <em>BBC</em> that they had 'followed the UCI financial obligations' regarding the prize money and tweeted that the company aims to have equal pay at races by 2023.</p><p><em>Watch an International Women's Day special feature on <a href=\"https://www.eurosport.co.uk/cycling/strade-bianche/2021/strade-bianche-2021-news-britains-lizzy-banks-calls-for-equal-prize-money-across-cycling_sto8159356/story.shtml\" target=\"_blank\">Eurosport</a> and the Eurosport app: Monday 8th March at 19:00</em></p></div></div>","author":"wstrickson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"fc2e80cc378125b371a14c1c9cee5f5687aaa89940b4998bcd964e783ee7293e","category":"Cycling"}