{"title":"Nikola admits to making “inaccurate” statements under disgraced founder","link":"https://arstechnica.com/?p=1745745","date":1614431108000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><h4>Going downhill —</h4><h2 itemprop=\"description\">Under new leadership, Nikola is trying to become a viable truck maker.</h2></div><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/nikola_tre-800x495.jpg\" alt=\"A prototype of the Nikola Tre battery electric truck.\"><figcaption><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/nikola_tre.jpg\" data-height=\"1434\" data-width=\"2317\">Enlarge</a> <span>/</span> A prototype of the Nikola Tre battery electric truck.</p><p>Nikola</p></figcaption></figure><p>Aspiring electric truck maker Nikola has <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1731289/000173128921000006/nkla-20201231.htm\">admitted to the Securities and Exchange Commission</a> that nine statements made by founder Trevor Milton were \"inaccurate.\"&nbsp;Milton was forced to <a href=\"https://arstechnica.com/cars/2020/09/nikola-founder-abruptly-resigns-amid-fraud-allegations/\">resign from Nikola</a> in September, shortly after the falsehoods first came to light.</p><p>Between 2016 and 2020, Milton told a series of whoppers about his fledgling truck maker. At a 2016 press event, Milton took to the stage to unveil a prototype of the company's first truck, dubbed the Nikola One. During the event, Milton claimed that the truck \"fully functions.\" In reality, Nikola never got the truck to move under its own power.</p><p>Nikola's most infamous flimflam came in 2018, when the company <a href=\"https://arstechnica.com/cars/2020/09/nikola-admits-prototype-was-rolling-downhill-in-promotional-video/\">released a video</a> of the Nikola One \"in motion.\" In reality, Nikola had towed the inoperative truck to the top of a long, shallow incline and rolled it down, angling the camera so that it looked like it was driving on level ground.</p><p>These and several other misstatements came to light in September after a short-selling firm called Hindenburg Research <a href=\"https://arstechnica.com/cars/2020/09/nikola-stock-falls-25-as-the-company-faces-new-fraud-allegations/\">published</a> a report declaring Nikola to be a \"massive fraud.\" In response, Nikola commissioned the law firm of&nbsp;Kirkland and Ellis to examine Hindenburg's allegations. While the resulting report hasn't been made public, Nikola has now copped to nine inaccurate statements prior to Milton's September 2020 departure. They include:</p><ul><li>\"In July 2016, the Company stated that it owned rights to natural gas wells, and in August 2016 that the wells were used as a backup to solar hydrogen production\"</li><li>\"In April 2019, Milton stated that solar panels on the roof of the Company’s headquarters produce approximately&nbsp;18&nbsp;megawatts of energy per day\"</li><li>\"In December 2019 and July 2020, Milton stated that the Company 'can produce' over&nbsp;1,000&nbsp;kg of hydrogen at the Company’s demo stations and that the Company was 'down below' $3/kg at that time\"</li><li>\"In July 2020, Milton stated that 'all major components are done in house'\"</li></ul><p>Nikola now admits that these statements \"were inaccurate in whole or in part, when made.\"</p><p>Nikola says Kirkland and Ellis hasn't decided whether the company violated any laws when it made these misstatements. The firm's investigation is ongoing.</p><p>Nikola says it could still face serious legal consequences for these misstatements. Federal prosecutors and the Securities and Exchange Commission both took an interest in the situation last September. Nikola says it can't predict how those investigations will turn out. Nikola has incurred $8 million in legal fees under an indemnification agreement with Trevor Milton.</p><h2>Nikola is trying to move past Trevor Milton</h2><p>At the same time, Nikola argues that the main thesis of the Hindenburg report—that Nikola was a \"massive fraud,\" is not accurate. Milton really was trying to build a viable hydrogen trucking business, however incompetently. While he wildly exaggerated Nikola's capabilities, he also hired experienced engineers to work on its products. Before his departure, Milton forged deals with companies that really do know how to design and build trucks.</p><p>So while Nikola's new management is trying to move past Milton's antics, they've carried forward with the most promising aspects of the founder's strategy. Indeed, when it released its&nbsp;<a href=\"https://nikolamotor.com/press_releases/nikola-corporation-reports-fourth-quarter-and-full-year-2020-results-114\">quarterly financial results</a> this week, Nikola said that it has completed assembly of five prototypes of its Nikola Tre battery electric truck in partnership with IVECO, an Italian truck maker. Nikola says that it's working with IVECO to build a manufacturing facility in Germany, with trial production slated to begin in June. Nikola is also building a truck factory in Arizona that it hopes will begin manufacturing trucks later this year.</p><p>Nikola says it will get trucks into the hands of customers before the end of the year. In a Thursday conference call, the company said that there continues to be strong demand for its battery electric trucks.</p><p>Nikola also said that its hydrogen electric trucks are on track for a planned 2023 release date. The company recently announced an <a href=\"https://azbigmedia.com/business/nikola-and-aps-deal-paves-way-for-zero-emission-route-from-phoenix-to-l-a/\">electricity supply deal</a> with an Arizona electric utility that will help Nikola produce hydrogen fuel at a low cost for its planned network of hydrogen fuel stations.</p><p>Nikola was able to get a rock-bottom price for electricity because hydrogen production can be suspended during hot summer afternoons. That's valuable to electric utilities because they have to spend a lot of money ensuring that they have enough capacity during periods of peak demand. A customer who commits to consuming zero power during periods of peak demand adds very little cost, allowing them to get a great deal. Nikola says it is hoping to secure similar deals in other states.</p><p>In short, Nikola's new management really is trying to turn Nikola into a viable truck company. They've jettisoned the most ridiculous parts of Milton's vision—like the <a href=\"https://arstechnica.com/tech-policy/2020/11/nikola-stock-plunges-as-company-cancels-badger-pickup-truck/\">Badger pickup truck</a>—and are focusing on the more viable aspects.</p><p>But the clock is ticking. Nikola lost almost $150 million in the fourth quarter of 2020 and has $840 million in the bank. So the company is going to need to raise more money before too long. And to do that, the company's leaders need to convince investors that they have put Milton's chicanery in the past and are now running a normal company with a viable business strategy. It's not clear if they're going to make it. But they're trying.</p></div></div>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fd1cbf159cee187c3d66d827e838979e04cf8d582751c2d050410a5572a560bd","category":"Tech"}