{"title":"US claims seller of encrypted phones violated racketeering and drug laws","link":"https://arstechnica.com/?p=1749746","date":1615833967000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><header><h4>Encrypted phones —</h4><h2 itemprop=\"description\">US: Company put \"sophisticated encryption\" on phones sold to drug traffickers.</h2></header><div itemprop=\"articleBody\"><figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/getty-locked-phone-800x533.jpg\" alt=\"A man's hand on a smartphone with a screen displaying a lock symbol.\"><figcaption></figcaption></figure><p>A US grand jury has indicted the CEO of a Canadian company that sells encrypted phones, alleging that he and an associate violated racketeering and drug laws.&nbsp;On Friday, the federal grand jury \"returned an indictment against the Chief Executive Officer and an associate of the Canada-based firm Sky Global on charges that they knowingly and intentionally participated in a criminal enterprise that facilitated the transnational importation and distribution of narcotics through the sale and service of encrypted communications devices,\" the Department of Justice said in a <a href=\"https://www.justice.gov/usao-sdca/pr/sky-global-executive-and-associate-indicted-providing-encrypted-communication-devices\">press release</a>.</p><p>Sky Global CEO Jean-Francois Eap and Thomas Herdman, a former distributor of Sky Global devices, were charged with a conspiracy to violate the Racketeer Influenced and Corrupt Organizations Act (RICO), a law designed to punish organized crime. They were also charged with a conspiracy to distribute illegal drugs and aiding and abetting. The racketeering and drug counts each carry maximum penalties of life in prison, the DOJ said. The US is seeking criminal convictions and forfeiture of \"at least $100,000,000\" worth of assets.</p><p>The indictment is available in this <a href=\"https://www.vice.com/en/article/4adzdj/sky-secure-global-indictment\">Motherboard article</a>.</p><p>\"Sky Global's devices are specifically designed to prevent law enforcement from actively monitoring the communications between members of transnational criminal organizations involved in drug trafficking and money laundering,\" the DOJ said. \"As part of its services, Sky Global guarantees that messages stored on its devices can and will be remotely deleted by the company if the device is seized by law enforcement or otherwise compromised.\"</p><p>The company \"installs sophisticated encryption software in iPhone, Google Pixel, Blackberry, and Nokia handsets,\" allowing users to \"communicate with each other in a closed network, and Sky Global routes these communications through encrypted servers located in Canada and France,\" the DOJ said.</p><h2>CEO defends fight against surveillance</h2><p>Eap intends to fight the charges, he said in a statement posted on <a href=\"https://web.archive.org/web/20210315082330/https://www.skyecc.com/article/sky-globals-ceo-responds-to-recent-news-reports/\">Sky Global's website</a> yesterday:</p><blockquote><p>Sky Global's technology... was not created to prevent the police from monitoring criminal organizations; it exists to prevent anyone from monitoring and spying on the global community. The indictment against me personally in the United States is an example of the police and the government trying to vilify anyone who takes a stance against unwarranted surveillance. It seems that it is simply not enough that you have not done anything illegal. There is no question that I have been targeted, as Sky Global has been targeted, only because we build tools to protect the fundamental right to privacy. The unfounded allegations of involvement in criminal activity by me and our company are entirely false.</p></blockquote><p>That statement was available on Sky Global's website earlier today. But the <a href=\"http://skyecc.com/\">website</a> now has a message saying, \"This domain has been seized by the Federal Bureau of Investigation in accordance with a seizure warrant.\"</p><h2>US and Canada cooperated</h2><p>The indictment was made in US District Court for the Southern District of California. While Sky Global is based in Canada, the indictment said the alleged criminal activity occurred \"within the Southern District of California and elsewhere.\"</p><p>\"The international operation to seize Sky Global's infrastructure involved cooperation and efforts by law enforcement authorities in the United States and Canada,\" the DOJ said. \"In addition, on March 10, 2021, Europol announced that judicial and law enforcement authorities in Belgium, France, and the Netherlands had wiretapped Sky Global's servers and monitored hundreds of millions of messages by Sky Global's users. The European investigation resulted in hundreds of arrests, the seizure of thousands of kilograms of cocaine and methamphetamine, hundreds of firearms, and millions of Euros.\"</p><p>Eap and Hardman are both citizens of Canada and residents of Vancouver. Warrants were issued for their arrests on Friday.</p><p>The case is similar to one <a href=\"https://arstechnica.com/tech-policy/2018/10/ceo-that-sold-encrypted-blackberry-phones-to-drug-dealers-pleads-guilty/\">involving Phantom Secure CEO Vincent Ramos</a>. In October 2018, the DOJ <a href=\"https://www.justice.gov/usao-sdca/pr/ceo-encrypted-communications-company-pleads-guilty-tooperating-criminal-enterprise\">announced</a> a plea deal in which \"Ramos admitted that he and his co-conspirators facilitated the distribution of cocaine, heroin, and methamphetamine to locations around the world including in the United States, Australia, Mexico, Canada, Thailand and Europe by supplying narcotics traffickers with Phantom Secure encrypted communications devices designed to thwart law enforcement.\" Ramos was <a href=\"https://www.justice.gov/usao-sdca/pr/chief-executive-communications-company-sentenced-prison-providing-encryption-services\">sentenced</a> to nine years in prison and ordered to forfeit $80 million.</p><h2>Sky Global sold 70,000 modified devices</h2><p>\"There are at least 70,000 Sky Global devices in use worldwide, including in the United States,\" the indictment on Friday said. Having operated since 2010, Sky Global \"generated hundreds of millions of dollars in profit by facilitating the criminal activity of transnational criminal organizations and protecting these organizations from law enforcement.\"</p><p>Sky Global replaces key components of commercially available phones to prevent surveillance by law enforcement, the indictment said:</p><blockquote><p>Whereas the standard iPhone, Google Pixel, Blackberry, or handset is sold to the public with the capability for voice communication, GPS navigation, camera, Internet access, and the Messenger services, when Sky Global receives the devices, their technical team removes the internal hardware/software responsible for the GPS, camera, Internet, and voice communications. Sky Global then installs sophisticated encryption software and routes the data through encrypted servers located in Canada and France.</p></blockquote><p>Sky Global charged subscription fees of \"approximately $1,200-$2,000 USD per six month period,\" the indictment said. Sky Global \"used digital currencies, including Bitcoin, to facilitate illegal transactions on the website, to protect the membership's anonymity, and to facilitate the laundering of the membership's ill-gotten gains,\" the indictment also said.</p><p>After the Phantom Secure case, \"Sky Global instituted an 'ask nothing/do nothing' approach toward its clients,\" the DOJ said. \"This policy allowed for Sky Global to claim plausible deniability from the activities of their clients that they knew or had reason to know participated in illegal activities, including international drug trafficking.\"</p></div></div></div>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fd2f0c95f005592388eec16543ef0d984acfb305158212bfd042f5914b830061","category":"Tech"}