{"title":"López and Nibali both aim to race the Giro and the Tour in 2022","link":"https://cyclingtips.com/2021/12/lopez-and-nibali-both-aim-to-race-the-giro-and-the-tour-in-2022/","date":1639680508000,"content":"<div><div><p>Astana-Premier Tech, which will become Astana Qazaqstan in the new year, has unveiled the plans of some big names for 2022. Miguel Ángel López and Vincenzo Nibali are both aiming to race the Giro d’Italia before heading to the Tour de France next year, while Alexey Lutsenko is placing the main focus of his own season on the French Grand Tour.</p><p>López and Nibali raced for the squad in the past and are rejoining the team next season, with Nibali coming back after stints at Bahrain-McLaren and then Trek-Segafredo and López returning after a <a href=\"https://cyclingtips.com/2021/09/after-missing-the-decisive-gc-move-lopez-left-the-vuelta-in-dramatic-fashion/\" target=\"_blank\">rocky stint</a> at Movistar. As Jakob Fuglsang and Aleksandr Vlasov are heading elsewhere in 2022, López and Nibali will play a key role in Astana’s Grand Tour ambitions next year, and that starts at the Giro. At least according to a team press release, López will be “the team leader” there, although both riders have histories of success in the race; Nibali has won it twice, and López has finished as highly as third overall there.</p><p>They are set to be joined by David de la Cruz, a three-time Grand Tour top 10 finisher, in the Italian Grand Tour. De la Cruz will then lead the charge at the Vuelta.</p><p>Lutsenko will be Astana’s other main card to play for the Grand Tours after he registered his first top 10 in a three-week race at least year’s Tour de France, finishing seventh. He told media in a training camp press conference that he is aiming for the podium in 2022.</p><p>Gianni Moscon, who is coming aboard from the Ineos Grenadiers, will lead the way in the Classics, with both the cobbled and Ardennes races on his radar. He will then race the Tour de France.</p></div></div>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"fdda5d2e12c3c748e327b90106b44f911dba39ed453dd6c8de065e980143d691","category":"Cycling"}