{"title":"Tour of Britain 2021 start and finish destinations announced","link":"https://www.cyclist.co.uk/news/9374/tour-of-britain-2021-start-and-finish-destinations-announced","date":1615974722000,"content":"<div id=\"readability-page-1\" class=\"page\"><div><p>The 2021 <a href=\"https://www.cyclist.co.uk/tags/tour-of-britain\">Tour of Britain</a> host locations have been announced, with the race streching almost the entire length of Great Britian and visiting many places for the first time since its 2004 rebirth.</p><p>Following a year off because of <em>that</em> virus, the Tour will kick off in Cornwall on Sunday 5th September, 722 days after <a href=\"https://www.cyclist.co.uk/tags/mathieu-van-der-poel\">Mathieu van der Poel</a> won the title in Manchester in 2019.</p><p>Organiser SweetSpot confirmed that on its way to the finish in Aberdeen, the 2021 Tour of Britain will be hosted by Devon, Wales, Cheshire, Warrington, Cumbria, Gateshead, Hawick and Edinburgh.</p><div id=\"file-44055\"><p><img typeof=\"foaf:Image\" src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/03/tob_2021_launch_map_16x9_march_17.jpg?itok=n6oMHxPC\" alt=\"\"></p></div><p>There will be seven new host destinations in this year's Tour: Penzance and Bodmin on Stage 1; Sherford on Stage 2; Warrington on Stage 5; Hawick on Stage 7; and both Stonehaven and Aberdeen on the final stage.</p><p>It's also the first time that two full stages will be held in Wales, <a href=\"https://www.cyclist.co.uk/tags/coronavirus\">Covid-19</a> restrictions permitting, with further details on those stages to be announced in the summer.</p><p>SweetSpot and <a href=\"https://www.cyclist.co.uk/tags/british-cycling\">British Cycling</a> will also be celebrating key workers and community heroes through their Ride for Heroes campaign throughout the race.</p><p>Hugh Roberts, chief executive of SweetSpot, said, 'We want to make September not just about the world-class racing and superstar riders but also through our campaign, Ride for Heroes, to ensure it is a celebration of all things British and make it an occasion for ourselves and British Cycling to thank all those who have worked tirelessly over the past year to ensure our wellbeing and safety.'</p><p>British Cycling head of sport and major events, Jonathan Day, said, 'We pride ourselves on the Tour of Britain being the biggest and most prestigious cycle race in the UK.</p><p>'As we look ahead to its return after postponement in 2020 we're sure that the riders on show – who will be going shoulder to shoulder from Cornwall to Aberdeen over eight days – will make this latest edition the most spectacular yet.'</p></div></div>","author":"wstrickson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"ffe899b7299ec05edf63a4f73c007fdfda2643b2e6d0f06f335c4c804d76d24b","category":"Cycling"}