{"title":"The observational EURACAN prospective clinical registry dedicated to epithelioid hemangioendothelioma: The protocol of an international and collaborative effort on an ultra-rare entity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308387","date":1723471200000,"content":"<p>by Anna Maria Frezza, Hugh Leonard, Ninna Aggerholm-Pedersen, Giuseppe Badalamenti, Paolo Baili, Giacomo G. Baldi, Sebastian Bauer, Serena Bazzurri, Irene Benzonelli, Alexia Bertuzzi, Jean-Yves Blay, Giuseppe Bianchi, Simone Bonfarnuzzo, Christophe Bouvier, Kyetil Boye, Javier Martin Broto, Antonella Brunello, Domenico Campanacci, Paolo G. Casali, Carlo Cicala, Elisa Crotti, Lorenzo D’Ambrosio, Angelo Paolo Dei Tos, Nils Dieckmann, Armelle Dufresne, Stephanie Elston, Virginia Ferraresi, Stefano Gabellini, Claudia Giani, Vincenzo Giannusa, Melissa Gil Sanjines, Teresa Grassani, Alessandro Gronchi, Paolo Lasalvia, Stefan Lindskog, Nadia Hindi, Matilde Ingrosso, Andrei Ivanescu, Robin Jones, Iwona Lugowska, Julia Ketzer, Anna Mariuk-Jarema, Alessandro Mazzocca, Laura Monteleone, Carlo Morosi, Andrea Napolitano, Francesca Nardozza, Elisabetta Neri, Maria Nilsson, Andri Papakonstantinou, Sandro Pasquali, Marta Sbaraglia, Federico Scolari, Joanna Szkandera, Claudia Valverde, Bruno Vincenzi, Salvatore Vizzaccaro, Federica Zuccheri, Silvia Stacchiotti, Annalisa Trama</p>\r\nIntroduction <p>Epithelioid hemangioendothelioma (EHE) is an ultra-rare sarcoma, marked by distinctive molecular and pathological features and with a variable clinical behavior. Its natural history is still partially understood, reliable prognostic and predictive factors are lacking and many questions are still open on the optimal management. In the context of EURACAN, a prospective registry specifically dedicated to EHE was developed and launched with the aim of providing, through high-quality prospective data collection, a better understanding of this disease.</p> Study design <p>Registry-based cohort study including only new cases of patients with a pathological and molecularly confirmed diagnosis of EHE</p> Objectives <p>To improve the understanding of EHE natural history, validate and identify new prognostic and predictive factors, clarify the activity and efficacy of currently available treatment options, describe treatment pattern.</p> Methods <p></p> Results <p>The registry has been joined by 21 sarcoma reference centers across EU and UK, covering 10 countries. Patients’ recruitment started in December 2023. The estimated completion date is December 2033 upon agreement on the achievement of all the registry objectives. The already established collaboration and participation of EHE patient’s associations involved in the project will help in promoting the registry and fostering accrual.</p>","author":"Anna Maria Frezza","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"00172475d9ece63d08d29796fc5788ee7c6cbeac2975d6c18074b2198c129175","category":"Interdisciplinary"}