{"title":"Announcing HashiCorp Boundary 0.3","link":"https://www.hashicorp.com/blog/announcing-hashicorp-boundary-0-3","date":1623772800000,"content":"<p>We are pleased to announce the release of <a href=\"https://www.boundaryproject.io/downloads\">HashiCorp Boundary 0.3</a> and the Windows release of Boundary Desktop 1.1. Boundary provides identity-based access management for dynamic infrastructure. Boundary 0.3 includes several key features and improvements:</p>\n<ul>\n<li><strong>Boundary Desktop for Windows</strong>: Boundary Desktop gives users the ability to connect to remote targets and view active session details. Boundary Desktop is now available for both Windows and MacOS.</li>\n<li><strong>Managed groups:</strong> Allows Boundary group memberships to be managed based on external identity provider (IDP) metadata.</li>\n<li><strong>OIDC configuration improvements</strong>: Administrators can now configure Boundary authentication from OIDC identity providers in the Boundary admin console.</li>\n</ul>\n<h2><a href=\"#boundary-desktop-for-windows\">»</a><a></a>Boundary Desktop for Windows</h2>\n<p>Boundary 0.3.0 includes a new variant of our desktop client that is compatible with Microsoft Windows operating systems. This variant is exactly the same in terms of feature parity with our existing macOS desktop client, and provides our Windows users the same ease-of-use for starting, stopping, and observing sessions from one easy graphical interface.</p><img src=\"https://www.datocms-assets.com/2885/1623685393-boundary-desktop-authn.png\" /><p>To download the new Boundary Desktop client for Windows, navigate to our <a href=\"https://www.boundaryproject.io/downloads\">releases page</a> to download our Windows-specific installation. Documentation for installing on Windows has also been added to our <a href=\"https://www.boundaryproject.io/docs/api-clients/desktop\">documentation</a> site.</p>\n<h2><a href=\"#oidc-workflows-in-the-administrator-console\">»</a><a></a>OIDC Workflows in the Administrator Console</h2>\n<p>In Boundary 0.2.0 we released a new OIDC (OpenID Connect) authentication method. This authentication method allows users to integrate Boundary with existing identity systems such as Microsoft Azure Active Directory, AWS Identity and Access Management (IAM), and popular single sign-on services like Okta and Auth0. Configuration of the OIDC authentication method had been available only via the command line or through our <a href=\"https://registry.terraform.io/providers/hashicorp/boundary/latest/docs\">Terraform provider</a>. Boundary 0.3.0 includes the ability to configure OIDC authentication methods through our graphical administrator interface. This provides another option when setting up OIDC authentication methods for users.</p>\n<h2><a href=\"#managed-groups\">»</a><a></a>Managed Groups</h2>\n<p>Managed groups allow the population of Boundary groups based on external IdP metadata. This feature allows users of our OIDC authentication method to automatically create groups based on the IdP they’re integrating with over OIDC.</p>\n<p>We’re working hard on a new Learn guide for the managed groups resource, but in the meantime, you can read about <a href=\"https://www.boundaryproject.io/docs/concepts/domain-model/managed-groups\">how it fits into our domain model</a> in our docs. Along with the Learn guide, be on the lookout for a new release of our <a href=\"https://github.com/hashicorp/terraform-provider-boundary\">Terraform provider</a> that will include the managed groups resource in the next couple of weeks.</p>\n<h2><a href=\"#upgrade-details\">»</a><a></a>Upgrade Details</h2>\n<p>Boundary 0.3 introduces significant new functionality. Please review Boundary’s <a href=\"https://learn.hashicorp.com/tutorials/boundary/upgrade-version\">general upgrade guide</a> and <a href=\"https://www.boundaryproject.io/docs/releases/release-notes/v0_2_0\">Release Notes</a> for details.</p>\n<p>As always, we recommend upgrading and testing this release in an isolated environment. If you experience any issues, please report them on the <a href=\"https://github.com/hashicorp/boundary/issues/new/choose\">Boundary GitHub issue tracker</a> or post to the <a href=\"https://discuss.hashicorp.com/c/boundary/50\">Boundary discussion forum</a>. As a reminder, if you believe you have found a security issue in Boundary, please responsibly disclose it by emailing <a href=\"mailto:security@hashicorp.com\">security@hashicorp.com</a> — do not use the public issue tracker. Our security policy and our PGP key can be found on the <a href=\"https://www.hashicorp.com/security\">HashiCorp security page</a>.</p>\n<p>We hope you enjoy Boundary 0.3.</p>","author":"Randall Morey","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"0028063c32997a9048becacdbe4aa6efc9567bdd9c5a54e9d58629d88f06f4f0","category":"Tech"}