{"title":"Worldwide revision of synanthropic silverfish (Insecta: Zygentoma: Lepismatidae) combining morphological and molecular data","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae045/7664562?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Synanthropic silverfish are the best-known and most widely distributed insects of the order Zygentoma. However, there is a great gap in the knowledge and confusion about the geographic distribution and the diagnostic characteristics that allow their identification. In this work, we provide an exhaustive and deep analysis of the most common 9 synanthropic silverfish of the world, combining previously published and newly derived morphological and molecular data. Updated descriptions of <span>Ctenolepisma calvum</span> (<a href=\"#CIT0072\">Ritter, 1910</a>) and <span>Ctenolepisma</span> (<span>Sceletolepisma</span>) <span>villosum</span> (Fabricius, 1775) are included, and morphological remarks, illustrations, and photographs of the remaining synanthropic species are provided to clarify their diagnosis and differentiation among them and from other free-living species. In addition, <span>Ctenolepisma targionii</span> (Grassi and Rovelli, 1889) is synonymized with <span>C. villosum.</span> A molecular phylogeny is presented based on the COI sequences of all the synanthropic species deposited in BOLD and GenBank, with 15 new sequences provided by this study. This has allowed us to detect and correct a series of identification errors based on the lack of morphological knowledge of several species. Moreover, 2 different lineages of <span>Ctenolepisma longicaudatum</span><a href=\"#CIT0018\">Escherich, 1905</a> have also been detected. To help future studies, we also provide a taxonomic interpretation guide for the most important diagnostic characters of the order Zygentoma, as well as an identification key for all the Synanthropic studied species. Finally, an approximation of the global distribution of synanthropic silverfish is discussed. Several new records indicate that the expansion of these species, generally associated with the transport of goods and people, is still far from over.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"0037dcce3413727802839fd52758064af04f2ccaabecf2808a5273602dfd1dc1","category":"Environment"}