{"title":"The Effect of UV Irradiation on Rearing Water Quality, Growth, and Survival of European Lobster (Homarus gammarus, L.) Larvae","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/8668381?af=R","date":1675843200000,"content":"<p>The successful establishment of European lobster (<i>Homarus gammarus</i>) land-based production is hampered by the high mortality rate during larval development, which can be partially explained by the proliferation of pathogens in the communal tanks commonly used for larval rearing. Therefore, disinfection water treatment could improve the low survival rates frequently recorded in <i>H. gammarus</i> farming. In this study, we evaluated the effect of UV irradiation on the microbial abundance and physicochemical quality of the culture water, as well as on <i>H. gammarus</i> larvae growth and survival reared on a flow-through system for a period of 15 days. Results showed that UV treatment significantly decreased the microbial abundance and reduced the variation in water parameters but did not improve physicochemical water quality (turbidity, ultraviolet transmission, nitrogenous compounds, biochemical, and chemical oxygen demand). Moreover, contrary to the expectations, UV irradiation did not improve but slowed down larvae growth. We initially hypothesized that UV disinfection would enhance the rearing water quality by inactivating bacteria, including potential pathogens, and hence, benefit larvae growth and survival. Our findings suggest that UV disinfection can stabilize the rearing environment but does not benefit <i>H. gammarus</i> larvae rearing, at least in a flow-through system set-up. This could be due to UV disinfection eliminating not only potential harmful pathogens but also other microbial groups important for the establishment of a healthy gut microbiota supporting lobster larvae growth.</p>","author":"Renata Goncalves, \nSanni L. Aalto, \nIvar Lund, \nCarlos Rosas Vázquez","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"0042432bc04c84231d032501ab32d96eddce081c3b6888438c5fb4f30fbdcf0e","category":"Environment"}