{"title":"Is natural resource dependence a blessing or curse for sustainable energy blueprint? An empirical insight towards achieving sustainable environment","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12393?af=R","date":1704193198000,"content":"<h2>Abstract</h2>\n<p>Natural resources have become the centerpiece of global discussion recently in an effort to achieving sustainable development. There are arguments that as much as natural resources are inevitable for development; they are disastrous to factors that promote sustainability of the global environment of which the transition to sustainable energy stands out. That notwithstanding, studies have been largely engrossed in verifying the roles natural resources on economic growth and the environment. Consequently, this research provides the first empirical evidence on the impacts of natural resources on sustainable environment in a global dataset for 73 countries from 1997 to 2019. To extend the frontier of knowledge, the roles of technological advancement, structural change, regulatory quality, and foreign direct investment are considered in the empirical model. The empirical evidence relies on cross-sectional autoregressive distributed lag, augmented mean group; common correlated effects mean group and method of moment quantile regression. The preliminary analyses show that the world is presently in a renewable energy deficit while recording a gradual shift from relying on natural resources. Feedbacks from the model evaluated expose that natural resource dependence curses sustainable energy through its militating impacts. Besides, technological advancement, structural change, regulatory quality, and foreign direct investment significantly and positively drive sustainable energy. Besides, the quantile regression analysis provides diverging magnitudes. Policies that promote sustainable energy are suggested.</p>","author":"Jianjie Huang, \nRidwan Lanre Ibrahim, \nMamdouh Abdulaziz Saleh Al‐Faryan","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"0044db50b270d31fdfcb7f026fb661bcf1fb7a9fa45a28de424f54311b219138","category":"Environment"}