{"title":"wcm.02.2024.217.226","link":"https://www.watconman.org/wcm-02-2024-217-226/","date":1709601298000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>DETERMINING ASSIMILATIVE CAPACITY OF RIVER TAPI USING QUAL2Kw MODEL</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Author: Hiralkumari B. Patel, Namrata D. Jariwala</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.02.2024.217.226\">10.26480/wcm.02.2024.217.226</a></em></span></p>\n<h3>Abstract</h3>\n<div><img src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />The Tapi River is the prime source of drinking and irrigation for the city of Surat, which is located in the state of Gujarat in India. The water quality of this river is degrading at an alarming rate due to heavy loads of pollutants from various identified sources such as treated and partially treated municipal wastewater, industrial effluents, and non-identified sources. As the pollutants are progressively discharged into the river, the available dissolved oxygen (DO) rapidly reduces and other water quality parameters are degraded. In this research, the water quality was analyzed using a one-dimensional QUAL2Kw model and it was calibrated with the field-observed datasets. With some exceptions, the model depicted the field data very well. Sensitivity testing was undertaken for two water quality strategies: one with reductions in wastewater discharge concentrations of 10%, 20%, and 30% of total discharge and the other by limiting wastewater biochemical oxygen demand (BOD) concentrations from 5 to 30 mg/l at incremental intervals of 5 mg/l. It was concluded that was DO concentration of 4 mg/l would be able to maintain the stretch of the Tapi River in Sural area if from all the source entering BOD will be up to 10 mg/l.</div>\n<h3>Keywords</h3>\n<p><span>Dissolved oxygen, BOD, QUAL2Kw, Tapi River, Surat</span></p>\n<h3><strong>1. INTRODUCTION</strong></h3>\n<div>\n<p>Rivers are one of the most important natural resources on the planet, supporting human societies and sustaining the planet’s ecological systems. India is facing a significant challenge in terms of river water pollution. According to the Central Pollution Control Board (CPCB), as of March 2021, around 351 river stretches in India were polluted, out of which 301 were classified as ‘critically polluted.’ In recent decades, contamination of water has posed significant risks to human and natural ecosystems (Raeisi et al., 2022). Increased human population, industrialization, agriculture practices, and other anthropogenic activity have all significantly degraded the aquatic environment with many pollutants. (Sakthivadivel et al., 2021). Urban waste disposal, farming operations, and manufacturing practices contribute to the discharge of a large number of organic wastes and other pollutants into rivers. The discharge of biodegradable pollutants into river water significantly affects the quality of water. When degradable and non-degradable substances are released into the river systems, they alter the water characteristics in the river by depleting the dissolved oxygen (DO) levels (Cox, 2003; Kannel et al., 2011; Rusjan et al., 2008). The problem of depleted DO levels is aggravated in the pre-monsoon season as available flow is minimum in the river. Under minimum flow conditions, the problems associated with depleted DO levels are aggravated. Under severe conditions, low concentrations of DO disrupt the balance of the habitat and can result in fish death, odor, and other nuisance (Cox, 2003). Hence, DO concentration is considered to be a primary measure of the river’s ecological health and is the most significant factor to protect the water body for the survival of aquatic life. (Chang, 2005; Kannel et al., 2007). To sustain the water quality in a river, it is crucial to recognize the level of pollutants and their characteristics that the river can assimilate without compromising its capacity for self-purification (Glavan and Pintar, 2010).</p>\n<p>The Tapi River enters Surat at Kamrej village having an approximate 22.39 km total length within Surat city boundary. From the upstream point Kamrej to the downstream point Causeway there are many discharge points of wastewater available like Khadi, untreated wastewater from the village area, agricultural runoff, and untreated wastewater entering from cattle farm on the stretch.</p>\n<p>The degradation of Tapi River water quality has reached new heights due to massive wastewater discharges into the river. According to the Central Pollution Control Board, the stretch of the Tapi River that flows through Surat city in Gujarat is classified as polluted. Excessive discharge from all point and non-point sources reduces the ability of the self-purification process which ultimately depletes the river water quality.</p>\n<p>Various available water quality models can be an effective tool in simulating and predicting the pollutant levels of dispersion, and risks of pollutants in the river system which finally help to control water pollutants. From the available model results, appropriate decisions can be taken by urban authorities to control the water bodies from pollutants. (Wang et al., 2013). Based on the statistics on many river conditions, the concentration of pollutants beyond the river’s self-purification capacity alters the balance of water bodies. To this, it is necessary to enhance water quality by minimizing water pollution through techniques of simulation (Farjoudi et al., 2021). The nonlinear and complicated relationship between numerous variables affects water quality parameters, so general methods of modelling results cannot be efficiently used to manage water quality resources (Chen et al., 2020). There are various mathematical models like QUAL2Kw, MIKE11, QUASAR, WASP, etc. are available. QUAL2Kw has less complexity and can provide necessary information for evaluating water quality with restricted datasets which finally helps decision-makers for proper planning. (Paliwal et al., 2007; Parmar and Keshari, 2012; Sharma et al., 2015). For this study, the QUAL2Kw model also has been used. The main objective of this research work is to predict the water quality of the Tapi River using the QUAL2Kw quality model and to develop hypothetical scenarios that maintain the minimum amount of dissolved oxygen concentration in the Tapi River.</p>\n<p>According to (Varghese et al, 2011), 2.81 million people reside within the boundaries of the SMC, and seven villages spread along a 15 km reach upstream of the weir Tapi River generates a combined effluent discharge of 5200 m3 per day from identified and non –identified sources and outfalls. According to Dubey and Ujjania (2013), observed levels of DO, BOD, COD, pH, turbidity, phosphate (PO4-3), and ammonia all exceeded the limits specified by the Bureau of Indian Standard and the World Health Organization for potable water. hence, the water is unfit for domestic use. The degradation of Tapi River water quality has reached new heights due to massive wastewater discharges into the river continuously. Looking this, present work has been planned to examine the impact of effluent discharges in the river Tapi. QUAL2Kw model was used to analysis pollutant load in the urban stretch of river Tapi. The model-predicted output will help planners and decision-makers to control the pollutants and sustain the water quality of River Tapi.</p>\n<h3><strong>2. MATERIALS AND METHODS</strong></h3>\n<p><strong>2.1 Description of the study area </strong></p>\n<p>The research work was undertaken within the reach of the Tapi River through Surat City which is one of the most rapidly growing smart cities located in the western part of India Gujarat state. It is the second-largest city in Gujarat in terms of area and population. The total area of Surat is 326.515 sq. km. and according to the census 2011, the population of Surat is 44,66,826 (Shihora and Bhagat, 2020). During high tides, seawater enters the river and mixes with the freshwater, thereby making it salty. In 1995, a causeway and low weir (600 m long and 5 m deep) was constructed at Rander village to maintain freshwater quality and to meet the increasing domestic and industrial demands. The lotic watercourse was converted into a lentic watercourse owing to the construction of the weir, contributing to water pollution in the city as the weir cum causeway has actually blocked the passage of impurities on Tapi (Varghese et al., 2011).</p>\n<p>Numbers of villages are discharging their partially treated, untreated effluents along the stretch of the river: the major ones are, Kholwad, Kathor, Abrama, Valak, and Uttaran. Urban settlements in the area of Aswini Kumar, Katargam, Chaprabhataha, etc. have shown encroachments on both sides of the area. Finally, it has also resulted in the lowering carrying capacity from 8.5 lakh cusecs to 3.5 lakh cusecs (Gaur, 2018). This also significantly affects the river’s water quality. The river water is also impacted by various practices followed on the bank of the river like washing clothes, religious activities, cremation, cattle farming, open defecation, fishing, and agricultural runoff.</p>\n<p>The river water is also affected by various practices, including washing clothes, religious activities, cattle farming, open defecation, cremation, fishing, and agricultural runoff.</p>\n<p>Figure 1 shows the study area of the Tapi River of 22.39 km length, and details of various discharge points and monitoring stations considered for study. Information about the discharge location and monitoring stations is listed in Table 1.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"761\" height=\"515\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-1.jpg 761w, https://www.watconman.org/wp-content/uploads/2024/03/Fig-1-300x203.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 1</strong>: The study area the Tapi River with the waste load discharge and monitoring sites. Source: http://www.diva-gis.org/gdata, google earth image@2021maxar technologies.</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"1009\" height=\"347\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-1.jpg 1009w, https://www.watconman.org/wp-content/uploads/2024/03/Table-1-300x103.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/Table-1-768x264.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>2.2 Sampling and Data Analysis</strong></p>\n<p>The sampling was carried out when the flow of the river was very low i.e. in pre moon soon season. The monitoring was carried out in the month of January and November during the year 2018-19. Water quality parameters such as DO, temperature, total solids (TS), BOD, ammoniacal (NH4) nitrogen, organic-N, and pH were analysed in the study. Samples of the river water and the discharged wastewater were carefully collected from the sites, transported, and analyzed as per standard methods (APHA 2005).</p>\n<p>The water temperature was measured with a portable thermometer. The river flow was obtained from the Urban authority. The pH of the samples was measured in the laboratory using a pH meter. Carbonaceous biochemical oxygen demand (CBOD) was estimated at 20°C for 5 days and ammoniacal (NH4) nitrogen was determined by the titration method. Using a temperature-controlled oven, Total solids (TS) was assessed gravimetrically.</p>\n<p><strong>2.3 Water Quality Model: QUAL2Kw</strong></p>\n<p>The QUAL2Kw model is capable of providing high-level quantitative–qualitative river modeling. The QUAL2Kw is a one-dimensional water quality model created by Pelletier and Chapra Steven (2005) to evaluate the water quality of rivers. The model is capable of simulating water quality along a reach of a river and can simulate various parameters such as pH, temperature, dissolved oxygen (DO), chemical oxygen demand (COD), sediment oxygen demand (SOD), organic nitrogen (organic-N), ammoniacal (NH4) nitrogen, nitrate and nitrite nitrogen, organic nitrogen, total nitrogen, total phosphorus, organic phosphorus, inorganic phosphorus, bottom algae, and phytoplankton. The model considers the river body to be segmented into a number of equal and unequal-sized reaches. It is possible to input data for point sources, diffuse sources, and abstractions in any reach. The other datasets are required to include (a) meteorological data (temperature, solar radiation, due point, and speed of the wind), (b) hydraulic properties of the stream or river, (c) waste load characteristics, and headwater quality data. To facilitate the calibration process entire program is implemented with a set of genetic rules. The genetic algorithm program is applied to determine the kinetic rate values that best fit the monitored data (Pelletier et al., 2006).</p>\n<p>As shown schematically in Figure 2 and Equation 1, the QUAL2Kw provides a well-established mass balance approach to the estimation of the concentration level of constituents in the water column (omitted hypothetic) of reach i (loading and transport excluded from the equation of mass balance for modeling of algae at the bottom) ( Kannel et al, 2007, Pelletier et al, 2006).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"493\" height=\"311\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-2.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-2.jpg 493w, https://www.watconman.org/wp-content/uploads/2024/03/Fig-2-300x189.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 2: </strong>Mass balance in Reach section i. Source:( Kannel et al, 2007, Pelletier et al, 2006).</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>where, Qi = reach i flow (L/day), Qab, i = reach i flow abstraction (L/day), Vi = reach i volume (L), Wi = external constituent load on the reach i (mg/day), Si = sinks and sources of the constituent due to mass transfer mechanisms and reactions (mg/L/day), Ei = bulk coefficient of dispersion in the reach i (L/day), Ei-1, Ei bulk coefficient of dispersion amongst reaches i-1, and i ,and i and i+1 (L/day), ci = concentration of constituent water quality in reach i (mg/l), and t = time (day).</p>\n<p>Figure 3 provides a graphical representation of the interacting state variables with water quality. Pelletier and Chapra (2005) have provided a complete overview of the interaction between water quality state and variables.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"728\" height=\"463\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-3.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-3.jpg 728w, https://www.watconman.org/wp-content/uploads/2024/03/Fig-3-300x191.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 3: </strong>Graphical representation of the interacting state variables for water quality (Source: Pelletier et al. 2006).</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"1010\" height=\"303\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-2.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-2.jpg 1010w, https://www.watconman.org/wp-content/uploads/2024/03/Table-2-300x90.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/Table-2-768x230.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The model utilizes a genetic algorithm (GA) to auto-calibrate by adjusting parameter values to achieve the best fit between predicted and observed water quality data. The model’s fitness was determined by taking the reciprocal of the weighted average of the normalised root mean squared error (RMSE) of the differences between predicted and observed water quality. The function of fitness f(x) is expressed as follows in equation 2(Pelletier et al., 2006).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"488\" height=\"83\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Formular2.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Formular2.jpg 488w, https://www.watconman.org/wp-content/uploads/2024/03/Formular2-300x51.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>where, Oi, j = values observed, Pi, j = values predicted, m = sets of a number of predicted and observed values, wi = weight factors, and n = numbers of various state variables involved in the reciprocal of the normalized weighted RMSE.</p>\n<p><strong>2.4 Model Calibration, Validation and Analysis</strong></p>\n<p>2.4.1 River Sub-reaches</p>\n<p>According to the topography of the study area entire stretch of 22.39 km of the Tapi River from Kamrej to the Causeway was divided into 21 unequal sub-reaches which has been shown in Figure 4.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img src=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-4-640x362.jpg\" width=\"640\" height=\"362\" alt=\"Fig 4\" title=\"Fig 4\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 4: </strong>The discretization of the Tapi River.</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>2.4.2 Input data for the model</strong></p>\n<p>The QUAL2Kw model can assess the hydraulic properties of each sub-reach. Table 2 summaries the hydraulic characteristics of the sub-reaches data used in the model which has been obtained for the Tapi river basin from the Surat irrigation circle office.<br />\nUnder the assumption of steady-state conditions to compute the mean velocity and depth manning equation 3 was used (Pelletier et al, 2006).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"495\" height=\"115\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Formular3.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Formular3.jpg 495w, https://www.watconman.org/wp-content/uploads/2024/03/Formular3-300x70.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>where, Q = flow of river (m3/s), S0 = bottom slope (m/m), n = coefficient of the Manning roughness, AC = cross-sectional area (m2), and p = wetted perimeter (m)</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"1012\" height=\"310\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Table21.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Table21.jpg 1012w, https://www.watconman.org/wp-content/uploads/2024/03/Table21-300x92.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/Table21-768x235.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"1013\" height=\"380\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-3.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-3.jpg 1013w, https://www.watconman.org/wp-content/uploads/2024/03/Table-3-300x113.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/Table-3-768x288.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The QUAL2KW water quality model converts measured 5 days of CBOD into the ultimate biochemical oxygen demand (CBODu) using the following equation:</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"479\" height=\"80\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Formular4.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Formular4.jpg 479w, https://www.watconman.org/wp-content/uploads/2024/03/Formular4-300x50.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>wwhere, k is the kinetic rate of ultimate biochemical oxygen demand oxidation per day (Pelletier et al., 2006).<br />\nThe k value for organic carbon found in wastewater ranges from 0.05 to 0.3 day-1 (Chapra, 1997). The adopted value of k was 0.018 day-1.</p>\n<p>The analyzed parameters like water flow, temperature, pH, BOD, organic-N, ammonium (NH4) nitrogen, and inorganic suspended solids (ISS) were used as input parameters in the model. The identified various point sources such as Kathor, Valak, and Varacha, and non-point sources like Kholwad, Abrama, Uttaran, and Aswinikumar were considered in the model as represented in Figure 4. The model value for bottom sediment oxygen and algae cover were set at 100% (Kannel et al., 2007) while the thickness of the sediment/hyporheic area was 10cm, sediment porosity was 40%, and the hyporheic exchange rate of 5% was considered in the model. (Hossain et al., 2014; Kannel et al., 2007). Meteorological data (including dew point, air temperature, wind speed, and cloud cover) were collected from the Meteorological Sub-division office located at Magdalla in Surat.</p>\n<p><strong>2.4.3 Model Kinetic Rate Parameters </strong></p>\n<p>The kinetic rate parameters needed for the river water quality model were referred from various Environmental Protection Agency (EPA) documents (USEPA, 1985a,b) like the QUAL2E and QUAL2E-UNCAS stream water quality model documentation (Brown and Barnwell, 1987), and the QUAL2Kw user manual (Pelletier and Chapra, 2005). The reaeration rate coefficient was determined using the Owens–Gibbs method (Owens et al, 1964), which was devised for shallow regions. For CBOD oxygen inhibition, denitrification, nitrification, photo-respiration, and algae bottom, the model exponential was used. In model QUAL2KW, the remaining sets of parameter default values were adopted.</p>\n<p><strong>2.4.4 Model outcomes</strong></p>\n<p>For calibration purposes, set of data obtained from the analysis result of 2018-19 was used. To avoid the instability of the model calculation, a time step of 5.625 mins was adopted as a reference given in the manual. The integration solution method was implemented since it produces sufficiently accurate results. For pH modeling, the Brent approach was utilized. The hyporheic exchange simulation in the model was performed by applying the level I option. Standard weights were allocated to various parameters to produce the best results (Hossain et al.,2014). To eliminate the error between observed and predicted water quality several trial weights were applied. The model was validated with datasets without changing the calibrated parameters to assess the capacity of the calibrated model to predict water characteristics. The calibrated parameters’ values obtained after trial and error from the model run are represented in Table 3.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"1024\" height=\"526\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-41-1024x526.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-41-1024x526.jpg 1024w, https://www.watconman.org/wp-content/uploads/2024/03/Table-41-300x154.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/Table-41-768x394.jpg 768w, https://www.watconman.org/wp-content/uploads/2024/03/Table-41.jpg 1030w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"1015\" height=\"406\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-42.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-42.jpg 1015w, https://www.watconman.org/wp-content/uploads/2024/03/Table-42-300x120.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/Table-42-768x307.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>2.5 Water Quality Requirements for various uses</strong></p>\n<p>The Central Pollution Control Board (CPCB) of India has developed guidelines for five designated uses of water. These classifications assist water quality executives and developers in formulating water quality targets and planning suitable restoration plans for distinguished water bodies. Table 4 indicates the standard guidelines designated best uses of water as per CPCB.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"813\" height=\"545\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-5-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Table-5-1.jpg 813w, https://www.watconman.org/wp-content/uploads/2024/03/Table-5-1-300x201.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/Table-5-1-768x515.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>(Source: CPCB)</p>\n<h3><strong>3. RESULTS AND DISCUSSION </strong></h3>\n<p>Considering the various standard input parameters and observed characteristics of wastewater the model was run with the standard data set and the final output was obtained in terms of DO, and BOD. The model output revealed that the complete reaches of Tapi River failed to meet the drinking standards of water quality. It means that the stretch of Tapi River is not able to maintain the minimum level of DO of 4-6 mg/l as the category A for considering the Tapi as a drinking water source. It is noted that from the available French well on the bank of river Tapi urban authority supplies drinking water to the community after treating it in the water treatment plant. From the model result level of agreement is achieved between the observed and predicted water quality as shown in Figure 5. As per Figure 5(a), DO was in the range of 2.39 mg/l – 5.20 mg/l, with the average value along the reach as 3.85 mg/l in the urban stretch of river Tapi. This may be because highly polluted wastewater is entering into the stream through Kathor as a point source in the form of village wastewater and Kholwad as non-point sources, which are very close to the headwater. hence, DO concentrations decreased rapidly. In the middle of the reach, the average DO concentration was found to be 4.43 mg/l, which indicated that the water quality had recovered to a certain degree.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"612\" height=\"575\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-5.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-5.jpg 612w, https://www.watconman.org/wp-content/uploads/2024/03/Fig-5-300x282.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"602\" height=\"276\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-5a.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-5a.jpg 602w, https://www.watconman.org/wp-content/uploads/2024/03/Fig-5a-300x138.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 5: </strong>Calibration results for the Tapi River (a) DO, (b)CBOD, (c) pH, (d) ISS (e) Organic Nitrogen, and (f) NH4.</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"505\" height=\"434\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-6.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-6.jpg 505w, https://www.watconman.org/wp-content/uploads/2024/03/Fig-6-300x258.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"509\" height=\"208\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-61.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-61.jpg 509w, https://www.watconman.org/wp-content/uploads/2024/03/Fig-61-300x123.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 6: </strong>Validation results for the Tapi River (a) DO, (b) CBOD, (c) pH, (d) ISS (e) Organic Nitrogen, and (f) NH4.</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>However, in the stretch after 15.46 km, drastically decline in DO is observed owing to the discharge of highly polluted wastewater from Uttaran and Ashwinikumar. The water quality standards require to maintain a minimum 6 mg/l DO concentration consequently as per CPCB guidelines. As per the river water classification according to CPCB, the river Tapi was not in a position to maintain DO as per A, B, C category.</p>\n<p>The BOD was obtained in the range of 9 mg/l to 21.46 mg/l along 22 km path. From the Figure 5(b), it could be inferred that the BOD levels upstream of the reach were high due to wastewater discharges. However, BOD levels in the Tapi River reduced at a distance of 15 km. To achieve water standards, the BOD should be ≤ 2-3 mg/l according to the CPCB category of A, B, and C. From the model average BOD value was observed to be as high as 18.06 mg/l, which implies that the river water quality is highly compromised and that it does not meet the standards for Class A, B, C, or D water (referring Table 4).</p>\n<p>After 15 km the dilution effects was not effective and all other pollutants like inorganic suspended solids, organic-N, and ammonium-N varied effectively. This point was the critical point which requires to manage effectively to control the water pollutants in the river Tapi. Considering the calibration of the model from the set of the analyzed result and observed data it revealed that the result agreed well with model output. The RMSEs of the water quality calibration parameters observed and simulated values of the model for the such as pH, inorganic SS, DO, BOD, organic-N, and ammoniacal (NH4) nitrogen were 0.48, 11.54, 0.28, 0.52, 3.59, and 4.05 respectively with the mean absolute errors (MAEs) as 0.63, 0.88, 0.16, 0.9, 2.07, and 2.54.<br />\nFigure 6 depicts the water quality results considered for validation purposes. The RMSEs for pH, inorganic SS, DO, BOD, organic-N, and NH4 were 0.46, 4.36, 0.44, 0.81, 0.46, and 2.06, respectively, and the MAEs were 0.3, 16, 0.11, 0.06, 3.66, and 1.19, respectively. This indicates model results are fit for calibration and validation purposes.</p>\n<p>The model value consider in the study is the average value of parameters obtained from the set of reading representing overall conditions whereas the observed and predicted value is based on the set of reading for a particular set of data. With certain exceptions, the modeling outcomes were found to be acceptable for achieving the management objective.</p>\n<h3><strong>4. WATER QUALITY MANAGEMENT AND PLANNING</strong></h3>\n<p>To assess the effects of wastewater discharge on the river water quality and to control the pollution problem in Tapi River analyzed results were used to simulate the optimum flow and BOD load in Tapi River. For effective management of water quality, two strategies were considered. A) one with reductions in wastewater discharge quantity as 10%, 20%, and 30% of total discharge and B) by limiting wastewater concentrations in terms of biochemical oxygen demand (BOD) in the range of 5 to 30 mg/l at incremental intervals of 5 mg/l. so, the main criteria of wastewater load reduction entering from point and non-point sources and BOD consideration up to 5-30 mg/l. This was adopted to develop the simulation result and based on the obtained result urban authority may forced to reduce the load and enhance their sewage treatment facility.</p>\n<p>Under the first strategy, the assumed reductions in wastewater discharge from considered point sources were reduced to 10%, 20%, and 30% phase-wise. The simulated result of this is as per Figure 7.</p>\n<p>It was noted that if the wastewater discharge concentration is reduced by 10%, then also at the stretch of river it is difficult to manage at least 4 mg/l DO. At the distance after 12 km DO level is drastically reduced and difficult to manage at least 4 mg/l at most of the points. So, the simulation result clearly reveals that only 10-30 % reductions in point source discharge which can be easily managed by the urban authority would also not be enough to manage 4 mg/l of DO in complete stretch. So, the simulation result also indicates there are crucial effects of non-point sources on depleting water quality of the Tapi River. It is the time for the urban authority to manage non-point sources like laundry washing clothes activity and cattle farming. For making the river sustainable and for the livelihood of aquatic life, the urban authority must take stringent steps to control the point and non-point sources effectively.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"652\" height=\"383\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-7.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-7.jpg 652w, https://www.watconman.org/wp-content/uploads/2024/03/Fig-7-300x176.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 7: </strong>Dissolved oxygen concentration in Tapi River under 10%, 20%, and 30% reduction in wastewater discharge concentrations.</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>As in the first strategy, it has been observed that even a reduction in 10-30 % of point sources quantity is not effective to manage 4 mg/l of Do, in the second attempt BOD reduction was considered. Generally, from the point sources vary high BOD load is discharged which makes the stream unable to maintain the DO in it. So, the second simulation was attempted with BOD concentrations of 5 to 30 mg/l at equal intervals of 5 mg/l. The obtained results predicted changes in DO levels are presented in Figure 8. From the results, it is clearly observed that BOD concentration limits are effective in increasing the DO concentrations in the river. If the wastewater entering from all sources has BOD in the range of 5-15 mg/l then the entire reach would experience the desired DO level of 4 mg/l effectively. Thus, urban authority has to enhance the treatment facility of villages available on the stretch of river Tapi effectively. This can make the river water quality in good condition.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"666\" height=\"395\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-8.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/Fig-8.jpg 666w, https://www.watconman.org/wp-content/uploads/2024/03/Fig-8-300x178.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 8: </strong>Dissolved oxygen concentration in Tapi river considering BOD as 5-30 mg/L</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<h3><strong>5. CONCLUSION</strong></h3>\n<p>The Tapi River was found to be substantially contaminated on the upstream and the downstream side. The water quality of this river is degrading at an alarming rate due to heavy loads of pollutants from various sources. The results revealed that anthropogenic activity had a significant effect on the examined stretch of the Tapi River. With the QUAL2Kw model pollutant load at various points can be effectively analyzed considering various point and non-point sources. From the observed, calibrated, and validated results, it is found that the entire stretch does not have a minimum DO level of 4mg/L. The water quality of Tapi River is even not falling under the category of A and B throughout the year. During the monsoon season, water quality is comparatively good than in other seasons. It is necessary to control the water pollutants entering the river. For this simulation results were developed using two strategies. From the obtained result it is concluded that reduction of load by 10-30 % from the point source is not effective to make the Tapi River pollutant-free but BOD reduction from the point source in the range of 5-15 mg/l is effective to control the pollutant effects in the river. Based on the study urban authority has to manage point sources and non-point sources. Stringent steps are required to be taken to make the Tapi River clean and pollution free. It is very necessary to provide the treatment to the point sources and achieve the norms of 5-15 mg/l rather than the present disposal limit of 30 mg/l bringing to improve the overall water quality of the Tapi River and protect the health of its ecosystem.</p>\n<h3><strong>ACKNOWLEDGMENT </strong></h3>\n<p>The authors are thankful to the Hydraulics Department, Surat Municipal Corporation, for providing the necessary technical information for this research work.</p>\n<h3><strong>GRANT SUPPORT DETAILS</strong></h3>\n<p>The authors received no specific funding for this study.</p>\n<h3><strong>CONFLICT OF INTEREST</strong></h3>\n<p>The authors declare that there is no conflict of interest regarding the publication of this manuscript.</p>\n<h3><strong>AUTHOR CONTRIBUTION</strong></h3>\n<p>HP has done a literature study and collected samples, conducted experiments, along with data interpretation, generated the result, and calculated the load-carrying capacity of the Tapi River using QUAL2KW. NJ provided technical support, suggestion, comments, and revisions in the manuscript for the study.</p>\n<h3><strong>REFERENCES</strong></h3>\n<p>APHA.,2005 Standard Methods for the Examination of Water and Wastewater. 21st Edition, American Public Health Association/American Water Works Association/Water Environment Federation, Washington DC.</p>\n<p>Brown, L., Barnwell, T., 1987. The Enhanced Stream Water Quality Models QUAL2E and QUAL2E-UNCAS Documentation and User Manual. USEPA, Environmental Research Laboratory, Athens, GA.</p>\n<p>Chang, H., 2005. Spatial and temporal variations of water quality in the Han River and its tributaries, Seoul, Korea, 1993-2002. Water, Air, and Soil Pollution, 161(1–4), 267–284. https://doi.org/10.1007/s11270-005-4286-7.</p>\n<p>Chapra, S.C., 1997. Surface water quality modeling. McGraw-Hill Companies, Inc.<br />\nChen, Y., Song, L., Liu, Y., Yang, L., Li, D., 2020. A review of the artificial neural network models for water quality prediction. Applied Sciences (Switzerland), 10(17). https://doi.org/10.3390/app10175776.</p>\n<p>Cox, B.A., 2003. A review of currently available in-stream water-quality models and their applicability for simulating dissolved oxygen in lowland rivers. Science of the Total Environment, 314–316(03), 335–377. https://doi.org/10.1016/S0048-9697(03)00063-9.</p>\n<p>Dubey, M., Ujjania, N. C.,2013. Water Quality and Pollution Status of Tapi River, Gujarat, India. 1(3), 261–266.</p>\n<p>Farjoudi, S. Z., Moridi, A., Sarang, A., Lence, B. J., 2021. Application Of Probabilistic Bankruptcy Method In River Water Quality Management. International Journal of Environmental Science and Technology, 18(10), 3043–3060. https://doi.org/10.1007/s13762-020-03046-8.</p>\n<p>Gaur, S.,2018. An Updated Review on Quantitative and Qualitative Analysis of Water Pollution in West Flowing Tapi River of Gujarat, India, Environmental Pollution, Water Science and Technology, 525-547, https://doi.org/10.1007/978-981-10-5792-2_42.</p>\n<p>Glavan, M., Pntar, M., 2010. Impact of Point and Diffuse Pollution Sources on Nitrate And Ammonium Ion Concentrations In The Karst-Influenced Temenica River. Fresenius Environmental Bulletin, 19(5 A), 1005–1014.</p>\n<p>Hossain, MA, Sujaul, IM, and Nasly, MA., 2014. Application of QUAL2Kw for water quality modeling in the Tunggak River, Kuantan, Pahang, Malaysia. Research Journal of Recent Sciences, 3(6), 6–14.</p>\n<p>Kannel, P. R., Lee, S., Lee, Y. S., Kanel, S. R., Pelletier, G. J., and Kim, H., 2007. Application of automated QUAL2Kw for water quality modeling and management in the Bagmati River, Nepal. Ecological Modelling, 202(3–4), 503–517. https://doi.org/10.1016/j.ecolmodel.2006.12.033</p>\n<p>Kannel, P.R., Kanel, S. R., Lee, S., Lee, Y. S., Gan, T. Y., 2011. A Review of Public Domain Water Quality Models for Simulating Dissolved Oxygen in Rivers and Streams. Environmental Modeling and Assessment, 16(2), 183–204. https://doi.org/10.1007/s10666-010-9235-1</p>\n<p>Owens, M., Edwards, R.W.,Gibbs, J.W.,1964 Some Reaeration Studies in Streams. International Journal of Air and Water Pollution, 8, 469-486.</p>\n<p>Paliwal, R., Sharma, P., Kansal, A., 2007 Water quality modelling of the river Yamuna (India) using QUAL2E-UNCAS, Journal of Environmental Management 83 (2007) 131–144.</p>\n<p>Parmar, D.L., Keshari, A. K., 2012. Sensitivity analysis of water quality for Delhi stretch of the River Yamuna, India. 1487–1508. https://doi.org/10.1007/s10661-011-2055-1.</p>\n<p>Pelletier, G. J., Chapra, S. C., &amp; Tao, H. 2006. QUAL2Kw – A framework for modeling water quality in streams and rivers using a genetic algorithm for calibration. Environmental Modelling and Software, 21(3), 419–425. https://doi.org/10.1016/j.envsoft.2005.07.002</p>\n<p>Pelletier, G.J., Chapra, S.C., 2005. QUAL2Kw theory and documentation (version 5.1), A Modelling Framework for Simulating River and Stream Water Quality. http://www.ecy.wa.gov/programs/eap/models</p>\n<p>Raeisi, N., Moradi, S., Scholz, M., 2022. Surface Water Resources Assessment and Planning with the QUAL2KW Model: A Case Study of the Maroon and Jarahi Basin (Iran). Water (Switzerland), 14(5). https://doi.org/10.3390/w14050705</p>\n<p>Rusjan, S., Brilly, M., &amp; Mikoš, M., 2008. Flushing of nitrate from a forested watershed: An insight into hydrological nitrate mobilization mechanisms through seasonal high-frequency stream nitrate dynamics. Journal of Hydrology, 354(1–4), 187–202. https://doi.org/10.1016/j.jhydrol.2008.03.009</p>\n<p>Sakthivadivel, M., Nirmala, A., Sakthivadivel, J., Mukhilan, R. R., Tennyson, S., 2021. Physicochemical and biological parameters of water at industrial sites of metropolitan city of Chennai, Tamil Nadu, India. Water Conservation and Management, 4(2), 90–98. https://doi.org/10.26480/WCM.02.2020.90.98</p>\n<p>Sharma, D., Kansal, A., Pelletier, G., 2015. Water quality modeling for urban reach of Yamun river, India. (1999–2009), using QUAL2Kw Applied Water Science. https://doi.org/10.1007/s13201-015-0311-1.</p>\n<p>Shihora, D., Bhagat, S. S., 2020. Assessment Of Educational Centers For West Zone, Surat City. 9(03), 3025–3027.<br />\nUSEPA, 1985a. Screening Procedure for Toxic and Conventional Pollutants in Surface and Ground Water, EPA/600/6-85/002a, U.S. Environmental Protection Agency, Athens.</p>\n<p>USEPA, 1985b. Rates, constants and kinetics formulations in surface water quality, second ed. EPA 600/3-85-040, U.S. Environmental Protection Agency, Athens, GA, retrieved 20 October 2006 from: http://www.ecy.wa.gov/</p>\n<p>Varghese, G. K., Shah, I. K., Mudliar, S. L., Alappat, B. J., 2011. Integrated source water protection plan for an urban water body – A case study of Tapi river, India. International Journal of Environmental Sciences, 1(7), 1559–1573. https://doi.org/10.6088/ijessi.00107020015</p>\n<p>Wang, Q., Li, S., Jia, P., Qi, C., &amp; Ding, F., 2013. A review of surface water quality models. The Scientific World Journal, 231768. Retrieved August 14, 2019, from. https://doi.org/10.1155/2013/231768.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>217-226</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>2</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8192/\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/2wcm2024/2wcm2024-217-226.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"Natasha","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"005d24603d4d733f5458dbb600914aa921dac31a3bd088f31972fc0a6b722100","category":"Environment"}