{"title":"Apidura’s Revive program gives new life to used bags","link":"https://cyclingtips.com/2021/07/apiduras-revive-program-gives-new-life-to-used-bags/","date":1625767200000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/Apidura-Racing-Handlebar-Mini-Pack-1-650x433.jpg\" /></div><h2>Apidura’s Revive program gives new life to used bags</h2><p>\n</p><p></p>\n\n\n\n<p>Bikepacking baggage company, Apidura, is no stranger to producing sustainable products. Since its inception, the company has focussed on producing functional products built to last, and encouraged repairs over replacement.</p>\n\n\n\n<p>Last month the UK-based company launched Revive, a recycling program designed to give another life to its repaired, refurbished, and sample products. According to Apidura, the program aims to reduce waste and hopefully reduce demand for new, low-cost products that have shorter lifecycles. </p>\n\n\n\n<p>“Revive products have lived varied lives – from pre-production prototypes to Transcontinental Race veterans – and often show the signs of their journeys with pride,” reads a statement on Apidura’s website. “But if they’ve made it into the program, that means we have checked them, repaired and cleaned them and are happy that they will perform to the level they were designed to for many years to come.” Products sold through the Revive program carry Apidura’s usual <a href=\"https://www.apidura.com/warranty/\" target=\"_blank\">generous warranty</a>.</p>\n\n\n\n<p>Apidura’s approach to sustainable products is surprisingly rare in cycling and is perhaps most closely compared to the likes of Patagonia in the outdoor industry. “This less orthodox approach sees us concentrating our sustainability efforts on the lifespan of our products themselves,” said Apidura’s founder Tori Fahey in a <a href=\"https://www.bikebiz.com/how-can-we-cycle-towards-a-greener-future-tori-fahey-apidura/\" target=\"_blank\">past interview with BikeBiz</a> about building products to last. “Ultimately, every aspect of a product’s impact on our environment is dramatically reduced if we can keep that product in use for a longer time.” </p>\n\n\n\n<p>“Sustainability is such an overwhelming topic; it’s hard to know where to begin, and therefore easy to look for quick solutions,” Fahey wrote to CyclingTips. “Launching Revive (especially at our small size) was not as simple as planting trees or buying carbon offsets, but it was a project that everyone on the team felt was important. It is an expression of how we think about sustainability (it’s not a marketing gimmick) and how we can have impact beyond the actual actions we take (and what we celebrate). I feel (/hope) there’s a cultural shift afoot and real impact will need to involve changing mindsets and how we think about consumption.”</p>\n\n\n\n<p>Building long-lasting products and finding new homes for repaired products is something we at CyclingTips are happy to promote. However, Apidura’s own program does highlight an obvious limitation of such recycling initiatives: limited product availability to suit one’s specific needs. A quick look at <a href=\"https://revive.apidura.com/shop/\" target=\"_blank\">Apidura’s Revive shop</a> reveals just a small selection of products available and there isn’t much scope to greatly increase those offerings. </p>\n\n\n\n<p>Still, the initiative is a positive step with little downside and one that we’re eager to see others in the industry follow. Apidura’s approach to encouraging less product consumption and repairing existing products is to be admired.  Some other cycling companies to have done similar in recent times include <a href=\"https://cyclingtips.com/2021/04/4iiii-shimano-crank-buyback-program/\" target=\"_blank\">4iiii with its crank buy-back program</a> and <a href=\"https://www.pinkbike.com/news/pnw-components-debuts-recycled-dropper-program.html\" target=\"_blank\">PNW’s refurbished dropper posts</a>. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/apiduras-revive-program-gives-new-life-to-used-bags/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"005fe31a2252afc4ab59393b9309a2f50851d929f81b9a801115cde49be63310","category":"Cycling"}