{"title":"★ Actually, All Three Third-Party ‘Find My’ Products Announced Yesterday Are Months Away From Shipping","link":"https://daringfireball.net/2021/04/three_find_my_products_are_months_away","date":1617911007000,"content":"\n<p>In <a href=\"https://daringfireball.net/linked/2021/04/07/find-my-third-party-products\">my post yesterday</a> linking to <a href=\"https://www.apple.com/newsroom/2021/04/apples-find-my-network-now-offers-new-third-party-finding-experiences/\">Apple’s announcement</a> of three new products that work with their Find My network accessory program, I pointed out that <a href=\"https://www.belkin.com/us/p/P-AUC002/\">Belkin’s Soundform Freedom True Wireless Earbuds</a> aren’t shipping until June. I should have dug deeper into the other two products: </p>\n\n<ul>\n<li><p><a href=\"https://chipolo.net/en-us/pages/chipolo-one-spot\">Chipolo’s One Spot tracker</a> isn’t shipping until June, either, and might be in limited supply after it does ship. (“Join the waitlist for the very limited first batch and get exclusive access to pre-orders before it sells out.”) Chipolo’s regular <a href=\"https://chipolo.net/en-us/products/chipolo-one-4-pack\">One trackers</a> that are already on sale won’t work as Find My accessories.</p></li>\n<li><p><a href=\"https://www.vanmoof.com/shop/en_us/configure-s3-x3-us\">VanMoof’s $2,000 S3 and X3 bikes</a> are available to order today, but new S3 orders will be delivered “within 9 to 11 weeks”, and X3 deliveries are “within 18 to 20 weeks”.</p></li>\n</ul>\n\n<p>So it just makes yesterday’s announcement all the more curious: nothing that was announced will be available until June, so why announce any of it now? It only makes sense to me if Apple is on the cusp of announcing AirTags very soon, and wanted to get their “Find My supports third-party products too” story out the door beforehand, even if the products aren’t shipping for months. Apple also has significant updates to iOS, MacOS, WatchOS, and tvOS that all feel ready to ship, and iOS 14.5 is the version that introduces the much-publicized “opt-in to allow apps to track you” changes — a feature I suspect Apple wants to explain on their own terms during an event. Then, at the end of the show, Tim Cook can conclude by telling everyone these OS updates are all available now.</p>\n\n<p>But yet here we are on Thursday, a week into April, and <a href=\"https://twitter.com/iupdate/status/1379958778104320000\">still</a> no word from Apple about an online event next week. Their COVID-era online events, after WWDC last year:</p>\n\n<ul>\n<li><a href=\"https://www.apple.com/apple-events/november-2020/\">The “One More Thing” M1 Mac event</a> was held on Tuesday, November 10, and was announced eight days in advance.</li>\n<li><a href=\"https://www.apple.com/apple-events/october-2020/\">The “Hi, Speed” iPhones 12 event</a> was held on Tuesday, October 13 and announced seven days in advance.</li>\n<li><a href=\"https://www.apple.com/apple-events/september-2020/\">The “Time Flies” Apple Watch Series 6 event</a> was held on Tuesday, September 15, and announced seven days in advance.</li>\n</ul>\n\n<p>Apple has always liked holding product events on Tuesdays, and, for last year’s online-only events, they sent the event announcements out 7–8 days in advance. Who knows, maybe they’ll send out an announcement for a special event to be broadcast next week as soon I hit “Publish” on this post. But it’s starting to feel like something has gone awry.</p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"00647ca7d963ca9913b4f20b636b8af6d423f8a1e1f58598e7ce78bcbb33fbfd","category":"Tech"}