{"title":"Association of Overweight and Central Obesity in Women of Reproductive Age and Overweight Children below Five Years of Age","link":"https://www.preprints.org/manuscript/202405.2174/v1","date":1717394717000,"content":"Introduction: Childhood obesity is becoming an emerging public health issue as it is associated with increased morbidity and premature deaths. Determinants like the child’s household characteristics, maternal weight before the preconception stage, and maternal weight in childhood are studied. There is no study available to understand the association between overweight women of reproductive age and overweight children under five years of age. Studying these determinants to understand the problem can help in framing policies to intervene in the issue. Methods: The data for the study was collected from the National Family Health Survey 5 (NFHS5). It has been sub-grouped into urban and rural categories. The percentage of women with high-risk Waist-Hip-Ratio (WHR) and the percentage of overweight women were independent variables whereas the percentage of overweight under-five children was dependent. Simple linear regression, multiple linear regression, and Pearson correlation coefficient analysis were done for the collected data. Results: Study shows the percentage of overweight women has increased by 4.1%, and the percentage of overweight children has increased by 2% during the NFHS5 (2019-21) compared to NFHS4 (2015-16). Pearson correlation coefficient (R) is 0.5662 and Ꞵ-coefficient for multiple linear regression is 0.1397 for central obesity in women (%) and percentage of overweight children. Conclusion: Central obesity in women is more common than the overweight. Overweight in women as well as in children under five is increasing. Central obesity in women shows a moderate positive relation with overweight in children under five years.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"006cae6e43e19f12b2e4da9e4d009696a69f36b4209c9993dbfb986b9cba6627","category":"Interdisciplinary"}