{"title":"The sprint that never was: A dramatic turn of events at the Tour de France Femmes","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-sprint-that-never-was-a-dramatic-turn-of-events-at-the-tour-de-france-femmes","date":1690484660000,"content":"\n      <p><span>The day started on a strange note. Less than half an hour before stage five of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> was due to begin, a WhatsApp message popped up on my phone from the SD Worx press officer. Lorena Wiebes, winner of stage three, the European Champion and likely the fastest woman in the peloton, was unwell. She would not take to the start and with that, her Tour de France was over. In an instant, everything we expected from the stage ahead had shifted. Charlotte Kool of Team DSM, Wiebes key sprint rival, was whispered the news in her ear by her press officer. Her eyes widened in surprise: “I would have loved to have a battle, but that’s not the case now. I guess, it’s not my problem,” she said with a wry smile when journalists surrounded her with probing questions.</span></p>\n<div></div>\n<p><span>The reality is that Wiebes departure changed a lot of things about today’s stage. SD Worx now had no pure sprinter to ride for and it would all be down to Team DSM to control things if they wanted Kool to have a shot at the line. Yara Kastelijn’s win yesterday seemed to have instilled a raw, visceral sense of belief in the peloton: a successful breakaway was possible, this race was not solely in the claws of SD Worx. What was once being spoken about as a pure sprint stage had been turned on its head and the race, suddenly, seemed wide open.</span></p>\n<p><span>When the flag dropped and the start of stage five was officially given, attacks shot off like bullets and the peloton was disbanded all over the roads leading out of Onet-le-Château. Everyone wanted it, that chance of victory. They had been given a taste of what might be possible the day before, and today they wanted to feast. It was as if the eyes of the attackers had been opened: this Tour was theirs as much as anyone else's.</span></p>\n<p><span>The aggression meant trouble for the sprinters and their teams. “I was off of the back the whole day. It was so hard from the beginning and it split everyone apart. With the heat and it being day five, fatigue set in,” Megan Jastrab of Team DSM – a key lead-out rider for Kool – said after the stage, her face a sheen of sweat and the ice vest on her body already melted in the glare of the blazing sun.</span></p>\n<p><span>“They were racing in the front, racing in the back, that made it hard from the gun until the finish line. In the end, because they raced so hard over the climbs, a lot of riders were dropping from the main peloton,” Jolien d’Hoore, sports director for AG Insurance-Soudal-Quick Step, explained after a day doing her best to make sense of things from her team car. “Everyone was panicking a little bit, the peloton started chasing, the pace was always on.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230727TDFFAZ0041-A.S.O._Thomas_Maheux_1024x1024.jpg?v=1690484522\" alt /></span></p>\n<p><span>The panic that d’Hoore mentions became evident in the most unexpected of places as the stage continued. Usually so cool and imperturbable, even SD Worx started to appear ruffled as Demi Vollering suffered a puncture mid-way through the stage. A slow, scrappy wheel change left the Dutch GC-hopeful with plenty of work to do to make it back to the peloton and she sat tight behind the bumper of her team car. The kilometres ticked by as she remained in the draft of the vehicle, ignoring the shouts of the commissaire’s motorbike instructing her to move away, fast. The result was a 20-second time penalty at the end of the stage, only to add to the Dutch team’s woes from the day.</span></p>\n<p><span>But as things unravelled behind for SD Worx and the sprinters crawled over the mountains in the baking heat to try and make it home inside the time cut, things were going very, very right for a rider up the road ahead. Ricarda Bauernfeind of Canyon//SRAM had attacked the reduced bunch of GC contenders and was riding solo towards the finish line. A flash of orange and pink, the German rider, just 23-years-old, was doing the thing that had seemed unthinkable in a stage we’d all been as naive to think this was going to be a simple sprint day when we woke up this morning.</span></p>\n<p><span>As she got closer and closer to the crowds awaiting her at the finish in Albi, Bauernfeind continued the trend of everything that should not have happened in this stage, happening. She held off breakaway specialist Marlen Reusser of SD Worx who set off in pursuit of her behind; the slight, young climber somehow faster than the time trialist who specialises in this sort of effort. She crossed the line alone. Astonished, she did not even dare celebrate, covering her mouth in surprise and stopping alongside her soigneurs with a stunned expression, dumbfounded by it all. By winning on the day that was not meant for her, the day that began with a shock that seemed to change everything, the day where the script was ripped up and rewritten entirely.</span></p>\n<p><span>“I trusted the DS and I went. I didn’t celebrate in the end because I just wanted to pass the finish line because I never thought that I could make it.” Bauernfeind said after the stage in her post-race press conference. “It’s nice… really nice.” The German rider could barely find the words to describe the day, her pants audible through the echo of the microphone. Shocked. Breathless. A representation of how stage five had left everyone.</span></p>\n<p><span>Today was an example that this edition of Tour de France Femmes will keep throwing up surprises. People are talking about tomorrow being a bunch sprint, but really, the journalists don’t know what to write. The fans don’t know what to expect. The pundits don’t know what to predict. In this Tour, anything can happen.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"006ecbbe9615bfc540934004ac0742581e3595d964fbb75e396b5235412dffbf","category":"Cycling"}