{"title":"NT-proBNP as a Biomarker of Endotheliopathy in Pediatric and Young Adult Hematopoietic Stem Cell Transplantation","link":"https://www.preprints.org/manuscript/202408.1767/v1","date":1724634066000,"content":"Background/Objectives: Hematopoietic stem cell transplantation (HSCT) in pediatric and young adult (YA) patients can lead to endotheliopathy, such as thrombotic microangiopathy (TMA), sinusoidal obstruction syndrome (SOS), and diffuse alveolar hemorrhage (DAH). Natriuretic peptides have been studied as markers of endotheliopathy and critical illness. We hypothesized that elevation in NT-proBNP was associated with development of endotheliopathy (DAH, SOS, or TMA) in the first 100 days following HSCT in pediatric and YA patients. Methods: IRB exempt status was obtained. This retrospective case-control study reviewed HSCT at our institution from 2016-2020. Cases were selected based on an endotheliopathy diagnosis in the first 100 days after HSCT. Cases were matched with controls. Baseline and near-event NT-proBNP levels were compared between cases and matched controls. Effect of NT-proBNP levels on developing endotheliopathy was estimated using conditional logistic regression. Results: Sixty-two patients were included (31 cases, 31 controls). Near-event NT-proBNP was significantly higher in cases compared to controls (Median: 473 vs. 187 pg/mL, p = 0.03, Wilcoxon rank-sum test), in contrast to comparison in baseline NT-proBNP (Median: 86 vs. 86 pg/mL, p = 0.51). After adjusting for co-variates, association between near-event NT-proBNP and odds of developing endotheliopathy did not achieve statistical significance. However, trends from most common transplant indications suggested an association between elevated near-event NT-proBNP level and endotheliopathy, particularly in acute lymphoblastic leukemia (ALL) patients. Conclusions: NT-proBNP should be studied further as a biomarker for endotheliopathy in pediatric and YA patients undergoing HSCT. This may be particularly relevant for patients undergoing HSCT for ALL.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0076757e2459c23a1978d81a4fda25c37a14f16de8b7db5bb20d02aaaadf95ec","category":"Interdisciplinary"}