{"title":"Microsoft's AI-Powered Bing Experience Gains Image Creation Functionality","link":"https://www.macrumors.com/2023/03/21/bing-ai-image-creation-microsoft/","date":1679434482000,"content":"Microsoft <a href=\"https://blogs.microsoft.com/blog/2023/03/21/create-images-with-your-words-bing-image-creator-comes-to-the-new-bing/\">today announced</a> that its AI-enhanced Bing browser now includes <a href=\"https://www.bing.com/images/create\">Bing Image Creator</a>, image-generating technology powered by OpenAI's DALL-E deep learning model.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/bing-image-creator-experience.jpg\" alt width=\"2560\" height=\"1440\" />\r<br />\nDALL-E is designed to generate digital content through natural language descriptions, and it has been a popular image generation tool for some time now. Microsoft says that the Bing Image Creator will bring AI-powered visual stories and updated Knowledge Cards to both Bing and the Microsoft Edge preview that has the same AI capabilities.\r<br />\n\r<br />\nBing Image Creator is integrated into the Bing chat experience, launching in creative mode to begin with. Typing in a description for an image, adding context like location or activity, and providing an art style will allow the Image Creator to generate a unique image.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/bing-ai-content-creator.jpg\" alt width=\"2000\" height=\"1470\" />\r<br />\nMicrosoft says that it is working with OpenAI to curb potential misuse of the image creator, and that it has implemented safeguards and additional protections to limit the generation of harmful or unsafe images.\r<br />\n\r<br />\nUsing the Bing Image Creator requires <a href=\"http://www.bing.com/new\">access to the Bing preview</a> or the new Microsoft Edge experience. Not all Bing preview users will have access to the Image Creator right away, as Microsoft says it will be deployed with a phased approach. It will be available on both desktop and the Bing mobile apps for those who have been given access.<div>Tags: <a href=\"https://www.macrumors.com/guide/microsoft/\">Microsoft</a>, <a href=\"https://www.macrumors.com/guide/bing/\">Bing</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/21/bing-ai-image-creation-microsoft/\">Microsoft's AI-Powered Bing Experience Gains Image Creation Functionality</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/microsofts-ai-powered-bing-experience-gains-image-creation-functionality.2384374/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"007e8e263c49f0ead7f1c5cc0da3f6d581e6bc62ca88539c497e0e711b4bf809","category":"Apple"}