{"title":"PSV-5 Characterizing the activity of bovine Lactobacillus strains against the top 7 Shiga-toxin Producing Escherichia coli strains","link":"https://academic.oup.com/jas/article/102/Supplement_3/520/7757593?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Shiga toxigenic <span>Escherichia coli</span> (STEC), specifically serogroups O26, O45, O111, O103, O121, O145, and O157 (Top 7), pose significant health risks. Cattle are the primary reservoir of STEC, and effective intervention remains elusive. The identification of <span>Lactobacillus spp.</span> with antimicrobial activity as direct-fed microbials (DFMs) presents a potential strategy for pathogen reduction. These strains are not only capable of favorably modulating the gut microbiota but also possess the innate ability to produce bacteriocins that can target specific pathogens including STEC. Selection of viable anti-STEC <span>Lactobacillus</span> strains requires assessment of the presence or absence of prophage that may revert from the lysogenic to lytic phase and affect their efficacy. This study aimed to characterize anti-STEC potential of 14 <span>Lactobacillus</span> strains isolated from cattle and to identify their associated bacteriocins and prophages. Antimicrobial activity of 14 <span>Lactobacillus</span> strains against the top 7 STEC strains was determined using live culture spot assays and cell-free supernatants (CFS) well-diffusion assays. To further assess their anti-STEC efficacy, <span>Lactobacillus</span> strains with the strongest activity were selected and further evaluated in MRS broth culture and rumen fluid. The ability of <span>Lactobacillus</span> strains to inhibit STEC attachment to Caco-2 epithelial cells was also assessed. Prokka 1.14.6, and Bagel5 were utilized to identify genes encoding bacteriocins. Additionally, PHASTEST 3.0 was utilized to identify prophages. All 14 strains demonstrated antimicrobial activity against the top 7 STEC serogroups. Notably, <span>L. agilis</span> strains L3 and L6, with genome sizes of 2,063,576 bp and 2,071,091 bp respectively, and <span>L. amylovorus</span> L7 (883,016 bp) exhibited the greatest anti-STEC activities, targeting O157, O26, O45, and O103 for L3 and L6, and O157, O45, and O103 for L7. The CFS from these strains showed anti-STEC activity at pH 4.4-4.6, but not at 7, suggesting that organic acids played a role in inhibition. In MRS, DFM reduced STEC O157:H7 by 5 to 7.4 logs after 24 h. However, in rumen fluid, no notable reduction in STEC O157:H7 was observed. Bioinformatic analysis revealed that the L7 genome encoded Helveticin-J, a Class III bacteriocin. Prophage identified included 1 intact (51,818 bp) and 1 non-intact (17,267 bp) in L3, and 2 intact (46,916 bp, 20,295 bp) and 1 non-intact (13,939 bp) in L6, while no prophage was identified in L7. This study identified novel DFMs with activity against STEC, but future studies with cattle are required to confirm their ability to inhibit STEC.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0085e5c1da0e6dc464c34ecbb927b8d7b1e25aae8e67de6a3a48cca28506e80a","category":"Environment"}