{"title":"Evaluation of Histopathological and Hematological Effects of Neonicotinoid (Acetamiprid 20% SP) on Grass Carp (Ctenopharyngodon idella)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/9951536?af=R","date":1675411200000,"content":"<p>Pesticides are usually used as an effective tool to control pests in agriculture; however, these chemicals may be a threat to nontarget organisms, especially aquatic organisms, because aquatic environments are the last station of pollutants. The present study evaluated the toxicity of a commercial formulation of neonicotinoid (acetamiprid 20% SP) as a systematic pesticide on the survival, hematology, and histology of the grass carp (<i>Ctenopharyngodon idella</i>). For these purposes, 105 fingerlings of the grass carp with an average body weight of 30 ± 2 g were exposed to 0, 50, 100, 150, and 200 mg·L<sup>−1</sup> of acetamiprid for 96 h. According to the data, a clear mortality was observed as the concentration of acetamiprid elevated (<i>P</i> &lt; 0.01). The LC50 96 h of acetamiprid was 121.146 mg·L<sup>−1</sup>. The hematological parameters in fish changed, following exposure to acetamiprid (<i>P</i> &lt; 0.05). Also, a strong correlation was found between acetamiprid concentrations and stress bioindicators such as glucose, total protein, albumin, and cholesterol (<i>P</i> &lt; 0.01). There was not significant tissue damage in the control group (0 mg·L<sup>−1</sup> of acetamiprid); however, acetamiprid led to tissues lesions such as hypertrophy, hyperplasia, uplifting of gill filaments, necrosis of gill epithelial cells, pyknosis and karyorrhexis of liver cells, and hemorrhage and necrosis of liver cell. Finally, acetamiprid-exposed fish exhibited some clinical signs including unbalanced swimming near the water surface, increasing operculum movement, and deaths with open-mouthed. The results of the present study clearly showed the survival-reducing effects of acetamiprid in <i>C. Idella</i>, which may return to tissue damage and stress induced by the pesticide. The results of the present study can be used as a base for future studies and environmental management.</p>","author":"Dariush Azadikhah, \nMozhgan Velayati Baghdari, \nMahnaz Dadras, \nSokaina Issa Kadhim, \nAli Kamil Kareem, \nHussein Ali Hussein, \nHouguo Xu","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"0088eff7837df73cfc1589f21c281f97c8094126a6884d16aa1e8cdd4f6991bf","category":"Environment"}