{"title":"Inside Meta’s Threads Launch","link":"https://www.washingtonpost.com/technology/2023/07/29/meta-threads-mark-zuckerberg-rival-twitter-musk/","date":1690835415000,"content":"\n<p>Naomi Nix and Will Oremus, reporting for The Washington Post:</p>\n\n<blockquote>\n  <p>With a mandate from Zuckerberg to take a big risk, Mosseri\nassembled a lean, engineer-heavy team of fewer than 60 people to\nhack together a bare-bones app on a breakneck timetable more\nreminiscent of a start-up than an entrenched tech giant. Speaking\nto investors this week after Meta reported strong earnings,\nZuckerberg held up Threads as vindication of his “<a href=\"https://www.washingtonpost.com/technology/2023/05/25/meta-layoffs-future-facebook-instagram-company/\">year of\nefficiency</a>,” in which he sheared tens of thousands of jobs\nin a bid for more agile teams that would ship products quickly.</p>\n\n<p>That Threads was created by such a small group in such a short\namount of time has become something of a marvel inside Meta,\naccording to current and former employees who spoke on the\ncondition of anonymity to discuss internal matters, as well as\nprivate messages viewed by The Post. Many see its quick rise\nas a reminder that well-executed product launches might not need\nall the bureaucratic trappings that a company with some 66,000\nemployees had grown accustomed to.</p>\n\n<p>“Quick execution. Nothing fancy,” one person wrote on Blind, an\nanonymous workplace app. “Just solid engineering that most of our\n<em>ICs</em> [individual contributors] can do but unfortunately are\nshackled.”</p>\n</blockquote>\n\n<p>It continues to astound me that anyone with any experience whatsoever would express surprise that a small-ish talented team was so effective. (I say “ish” because 50-60 people isn’t all that small.) Fred Brooks’s <em><a href=\"https://en.wikipedia.org/wiki/The_Mythical_Man-Month\">The Mythical Man-Month</a></em> is somehow simultaneously famous and widely-ignored. A larger team would likely have delayed Threads, not accelerated its launch. A <em>much</em> larger team might have doomed the project to failure.</p>\n\n<blockquote>\n  <p>To keep things moving, the Threads team punted thorny decisions\nand eschewed difficult features, including private messages and\nthe ability to search for content or view the feeds of people you\ndon’t follow. The company also opted not to launch in the European\nUnion, where regulators are preparing to enforce new rules next\nyear requiring tech companies to provide more information to\nregulators about their algorithms.</p>\n\n<p>“You do the simple thing first,” Mosseri said. “And I think\nthat also helps reduce the scope, because often what happens is\nscope creep and you want to add all these things because\nthey’re all great.”</p>\n</blockquote>\n\n<p>Get something good out, even if it’s missing obvious important features, and start iterating. That’s <a href=\"https://daringfireball.net/2010/05/this_is_how_apple_rolls\">the recipe</a>. I’m very curious what the story is going to be for private messages on Threads, though — yet another new messaging silo, or something tied to Instagram’s? Whatever it is, I sure hope it uses E2EE. </p>\n\n<p>(Twitter DMs, <a href=\"https://www.eff.org/deeplinks/2020/07/after-weeks-hack-it-past-time-twitter-end-end-encrypt-direct-messages\">infamously</a>, do not use E2EE, so every single ostensibly private message ever sent on Twitter is readable by Twitter employees with access privileges, and thus potentially exposable to the public by either a bug or spite. The same goes for Mastodon, which offers “mentioned people only” messaging, a feature that should not exist, in my opinion, because it creates the illusion of privacy. Better to offer no private messaging at all than offer it without E2EE.)</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/07/31/inside-threads\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"008d636ee0629072f075321e46de131023c2d62b065a10ece1f084f0af2e8688","category":"Tech"}