{"title":"Temporal and spatial variability in availability bias has consequences for marine bird abundance estimates during the non‐breeding season","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12373?af=R","date":1728445495000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/445da721-7c29-447d-9ac2-00d6771bec42/eso312373-toc-0001-m.png\" alt=\"Temporal and spatial variability in availability bias has consequences for marine bird abundance estimates during the non-breeding season\" />\n<p>Effective monitoring of marine ecosystems requires accurate estimates of species abundances and distributions. Our study investigates a form of detection bias called ‘availability bias’ in at-sea surveys of diving marine birds, revealing significant variation by species, month, and area in our four focal species: Atlantic puffins, common guillemots, razorbills, and red-throated divers. We present availability bias correction factors that are species- and month-specific to the areas around northwest Europe that the study populations use during their non-breeding seasons. Using more relevant correction factors will improve abundance estimates, enhancing the accuracy of ecological impact assessments and conservation efforts.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTo effectively monitor how marine ecosystems are being reshaped by anthropogenic pressures, we require understanding of species abundances and distributions. Due to their socio-economic and ecological value, predatory species are often at the forefront of survey efforts. However, survey data are only valuable if they can reliably be converted into estimates of underlying distributions.\n\nWe consider at-sea surveys of marine predators that often inform ecological impact assessments of offshore windfarms. These surveys are subject to a form of detection bias called ‘availability bias’ whereby individuals which are submerged below the surface are consequently ‘unavailable’ for detection. Although correction factors are commonly used in these surveys, they are currently based on limited data that may not be species-, time-, or area-specific. Here, we use time-depth-recorder data to investigate variation in marine bird availability bias.\n\nWe found that the proportion of diving marine birds submerged below the sea surface during daylight hours, and therefore unavailable to be counted during surveys, varied by species, month, and area. For three of our focal species wintering around northwest Europe (Atlantic puffin, common guillemot, razorbill), our results were different to comparable values previously used to correct for the availability bias, whereas no correction factors are regularly used for the fourth species (red-throated diver). We now present availability bias correction factors that are species- and month-specific to the areas the study populations use during their non-breeding seasons: the North Sea, the north and west coasts of the UK, the Baltic Sea, and Icelandic coastal waters.\n\n<i>Practical implication</i>: Variation in the proportion of daylight hours that marine birds spent submerged lead to differences in availability bias correction factors, thereby impacting estimations of their abundances. We encourage use of correction factors that use data from the species, marine area, and month during which surveys are conducted to provide more accurate abundance estimates. Using more relevant correction factors will result in increasingly accurate abundance and distribution estimates of diving marine birds, with relevance for a range of applications including planning for offshore windfarm developments, the designation and monitoring of protected areas, and understanding environmental change.\n</p>","author":"Ruth E. Dunn, \nJames Duckworth, \nSusan O'Brien, \nRobert W. Furness, \nLila Buckingham, \nFrancis Daunt, \nMaria Bogdanova, \nJonathan A. Green","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"009107abe81b71169d2d7f3fbe3ba1bc6ea9004a02ec5ad9f50d27738751cfa0","category":"Environment"}