{"title":"Prehospital emergency anesthesia: A single-center retrospective analysis of guideline adherence and unexpected incidents","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310146","date":1725631200000,"content":"<p>by Syrina Beierle, Alexander Beierle, Rolf Rossaint, Stefan K. Beckers, Hanna Schröder, Marc Felzen</p>\r\n\r\nAlthough prehospital emergency anesthesia (PHEA), with a specific focus on intubation attempts, is frequently studied in prehospital emergency care, there is a gap in the knowledge on aspects related to adherence to PHEA guidelines. This study investigates adherence to the “Guidelines for Prehospital Emergency Anesthesia in Adults” with regard to the induction of PHEA, including the decision making, rapid sequence induction, preoxygenation, standard monitoring, intubation attempts, adverse events, and administration of appropriate medications and their side effects. This retrospective study examined PHEA interventions from 01/01/2020 to 12/31/2021 in the city of Aachen, Germany. The inclusion criteria were adult patients who met the indication criteria for the PHEA. Data were obtained from emergency medical protocols. A total of 127 patients were included in this study. All the patients met the PHEA indication criteria. Despite having a valid indication, 29 patients did not receive the PHEA. 98 patients were endotracheally intubated. For these patients, monitoring had conformed to the guidelines. The medications were used according to the guidelines. A significant increase in oxygen saturation was reported after anesthesia induction (p &lt; 0.001). The patients were successfully intubated endotracheally on the third attempt. Guideline adherence was maintained in terms of execution of PHEA, rapid sequence induction, preoxygenation, monitoring, selection, and administration of relevant medications. Emergency physicians demonstrated the capacity to effectively respond to cardiorespiratory events. Further investigations are needed on the group of patients who did not receive PHEA despite meeting the criteria. The underlying causes of decision making in these cases need to be evaluated in the future.","author":"Syrina Beierle","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"00965e5b93a69ae400ec026a868208f67e0afa3348f9d2d7cebf325713e44d91","category":"Interdisciplinary"}