{"title":"Seismic behavior of precast wall slab wall structure under near and far field earthquakes","link":"http://link.springer.com/10.1007/s10518-024-02030-8","date":1728000000000,"content":"<h3>Abstract</h3>\n                  <p>Significant damages to precast wall-slab-wall (WSW) systems due to past earthquakes in near-field zones has been reported in the literature. This led to research on the seismic behavior of precast structures. Most of them concentrated on precast framed structures. Comparatively, fewer studies have been conducted on WSW systems, especially in exploring their performance in near-field earthquakes. This study focuses on the analysis of a 5-story precast WSW structure and the corresponding monolithic WSW structures under near-field (NF) and far-field (FF) earthquakes. The normalized backbone curves (M-θ curves) for precast and monolithic wall-slab connections were modeled using link elements at the slab-wall interface. A default plastic hinge is assigned at a distance of 0.1 L from the slab-wall interface. Three types of earthquakes were considered: far-field (FF), near-field forward directivity (NFD), and near-field fling step effect (NFFE). Nonlinear time history analysis (NLTHA) is performed in the computer program SAP2000 using an ensemble of 7 different earthquake records for each type. The earthquake records are normalized for three levels of peak ground acceleration (PGA): 0.4 g, 0.6 g, and 0.8 g. The responses of interest include top story displacement (TSD), maximum inter-story drift ratio (MIDR), base shear (BS), and maximum acceleration (MA). Comparative studies utilized the ensemble average of responses. The findings reveal that the theoretical analysis of precast frames shows greater vulnerability compared to conventional monolithic frames (as commonly practiced without specifying M-θ curves at the slab-wall interface). Moreover, NFFE led to increased top story displacement and MIDR responses in all types of precast and monolithic WSW structures under study.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"00977650ebf4d05659e576213c23138a457f8cc056238d4809fca6a5cff42fb8","category":"Environment"}