{"title":"Electronic groupsets: everything you need to know about Di2, AXS and SRW","link":"https://www.bikeradar.com/advice/buyers-guides/electronic-groupsets/","date":1687428000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/SRAM-Apex-2023-7-90435e6-e1686570415764.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/SRAM-Apex-2023-7-90435e6-e1686570415764.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/SRAM-Apex-2023-7-90435e6-e1686570415764.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/SRAM-Apex-2023-7-90435e6-e1686570415764.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/SRAM-Apex-2023-7-90435e6-e1686570415764.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/SRAM-Apex-2023-7-90435e6-e1686570415764.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/SRAM-Apex-2023-7-90435e6-e1686570415764.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/SRAM-Apex-2023-7-90435e6-e1686570415764.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"SRAM Apex XPLR AXS groupset on a Canyon Grizl gravel bike\" title=\"SRAM Apex XPLR AXS groupset on a Canyon Grizl gravel bike\" />                                            <p>Electronic groupsets are ever-increasing in popularity and are near-ubiquitous in the pro peloton. The technology has trickled down to lower-tier road and <a href=\"https://www.bikeradar.com/advice/buyers-guides/mountain-bike-groupsets-everything-you-need-to-know/\">mountain bike groupsets</a> since the arrival of Shimano Di2, and there are now more options available on the market than ever before.</p>\n<p>In fact, Shimano, SRAM and Campagnolo now only offer electronic options for their top-tier road groupsets and <a href=\"https://www.bikeradar.com/features/opinion/future-of-mechanical-groupsets/\">there do not seem to be any plans to further develop the brands’ mechanical groupsets</a>.</p>\n<p>While Campagnolo has a focus on <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road bike groupsets</a>, SRAM and Shimano lead the way when it comes to electronic mountain bike drivetrains.</p>\n<p>Electronic groupsets offer a number of benefits, including accurate shifting and, in some cases, ease of setup, but some riders prefer the tactile shifting and serviceability of a mechanical groupset. Electronic groupsets are more expensive, too.</p>\n<p>In this guide, we’ll take a closer look at what exactly constitutes an electronic groupset, how they work, and the pros and cons of electronic groupsets versus mechanical groupsets. We’ll then outline the major manufacturers, their options and the intricacies between different systems.</p>\n<p>You can use the links below to jump straight to the section you need:</p>\n<ul><li><a href=\"#whatisanelectronicgroupset\">What is an electronic groupset?</a></li>\n<li><a href=\"#mechanicalvselectronic\">Mechanical vs electronic</a></li>\n<li><a href=\"#whomakeselectronicgroupsets\">Who makes electronic groupsets?</a></li>\n<li><a href=\"#howdoesanelectronicgroupsetwork\">How does an electronic groupset work?</a></li>\n<li><a href=\"#canyouupgrade\">Can you upgrade from a mechanical groupset to electronic?</a></li>\n</ul><h2>What is an electronic groupset?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano Dura-Ace R9200 front derailleur\" title=\"Pinarello Dogma F with Dura-Ace R9200-6\" /></div><div><figcaption><span><i></i> Electronic groupsets use motorised derailleurs to shift gears.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>An electronic groupset forgoes gear cables and instead relies on motorised derailleurs to shift gears.</p>\n<p>Unlike a mechanical groupset, which utilises gear cables between the shifter and derailleur, an electronic groupset uses either wires or a wireless signal between the shifter and the derailleurs to communicate.</p>\n<p>The derailleurs are electro-mechanical and the motors inside dictate the chain moving up or down the <a href=\"https://www.bikeradar.com/advice/workshop/bike-cassettes/\">cassette</a>, or between chainrings, into the selected gear.</p>\n<h2>Mechanical groupsets vs electronic groupsets</h2>\n<p>Why would you opt for an electronic groupset over its mechanical counterpart?</p>\n<p>There are advantages and disadvantages to both technologies and the decision will ultimately come down to personal preference and budget.</p>\n<h3>Pros of mechanical groupsets</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Campagnolo's 12-speed chorus rear mech\" title=\"Chorus 12 Speed launch 08\" /></div><div><figcaption><span><i></i> Some riders prefer the tactile feel of mechanical shifting.</span></figcaption><span> <i>Robin Wilmott / Immediate Media</i></span></div>\n<ul><li>Simplicity</li>\n<li>Price</li>\n</ul><p>The benefits of a mechanical groupset are chiefly simplicity and price.</p>\n<p>Mechanical shifting has stood the test of time and, as a result, there are mechanical groupset options for every level, from outright beginners to the top tier of the sport.</p>\n<p>Mechanical groupsets are relatively easy to work on in terms of <a href=\"https://www.bikeradar.com/advice/workshop/\">bike maintenance</a>. Should you get caught short in the middle of nowhere with a problem, issues are generally relatively simple to diagnose and in the worst-case scenario, it is relatively easy and inexpensive to <a href=\"https://www.bikeradar.com/advice/workshop/how-to-replace-brake-gear-cables/\">replace a gear cable</a>. It is also generally easier and cheaper to buy replacement parts.</p>\n<p>Many riders have grown accustomed to – and prefer – the feel of mechanical shifting, as the actuation of the shifter offers crisp and satisfying feedback.</p>\n<p>When you initiate a shift, you can feel the derailleur moving, which offers a more meaningful interaction to the user than a robotic, electronic whir.</p>\n<h3>Cons of mechanical groupsets</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Ekar derailleur limit and B screws\" title=\"Campagnolo Ekar groupset\" /></div><div><figcaption><span><i></i> Mechanical groupsets require reindexing from time to time.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<ul><li>Regular maintenance</li>\n<li>Subject to wear and tear</li>\n</ul><p>Mechanical groupsets often require <a href=\"https://www.bikeradar.com/advice/workshop/how-to-adjust-the-gears-on-your-bike/\">re-indexing to adjust the gears</a> after initial set-up, as the cables try to find the shortest path between the shifter and derailleur in their housing. This is sometimes referred to as cable stretch.</p>\n<p>Gear cables are subject to wear and dirt ingress over time and, as a result, the quality of the shifting degrades. Gear outer and inner cables therefore require replacing at semi-regular intervals to keep shifting optimal.</p>\n<h3>Pros of electronic groupsets</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"R9200 shifter side view\" title=\"Pinarello Dogma F with Dura-Ace R9200-10\" /></div><div><figcaption><span><i></i> Simply click the relevant button to initiate a shift.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<ul><li>No cable stretch</li>\n<li>Reliable, consistent shifting</li>\n<li>Ease of setup (sometimes)</li>\n</ul><p>With an electronic groupset, there are no cables to stretch and, as such, the wires (in Shimano’s case) are not affected by road or trail conditions.</p>\n<p>In theory, as long as you do not crash or bend your <a href=\"https://www.bikeradar.com/advice/workshop/derailleur-hangers/\">derailleur hanger</a> and keep your battery charged, the quality of the shifting will not degrade over time.</p>\n<p>The shifting is generally more consistent and it is virtually impossible to trick the various systems to mis-shift, no matter what shifting combinations you throw at them.</p>\n<p>They also require less effort to shift because you simply click one of the relevant levers on the shifter, as opposed to pushing a lever, which creates more friction because the cable manually moves the respective derailleur.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SRAM GX Eagle AXS mountain bike drivetrain\" title=\"SRAM GX Eagle AXS mountain bike drivetrain-9\" /></div><div><figcaption><span><i></i> With no cables to speak of, SRAM’s wireless eTap AXS groupsets are easy to set up.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>Electronic shifting makes for a compelling prospect off-road, given the increased ingress of mud and slop that can make its way into cables.</p>\n<p>Virtually all modern, off-road <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">rear derailleurs</a> utilise a clutch mechanism to prevent chain slap. With mechanical shifting, this increases friction as you overcome the force of the clutch, but that’s not a problem with electronic shifting.</p>\n<p>Electronic groupsets also offer the ability to shift across multiple gears at the same time, up and down the cassette, by holding onto the relevant button. This can be useful if you need to change quickly into a different gear, if you hit the foot of a steep ramp after a fast descent, for example.</p>\n<p>On a mechanical road groupset, you can up-shift three gears with all of the major groupset brands. You can down-shift up to five gears only with Campagnolo’s Chorus, Record and Super-Record groupsets with its Ultra-Shift mechanism. Shimano and SRAM are limited to one down-shift at a time.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano Dura-Ace R9200 Di2 climbing shifter on bar.\" title=\"Pinarello Dogma F with Dura-Ace R9200-7\" /></div><div><figcaption><span><i></i> You can also customise electronic groupsets by adding additional points of shifting, such as the handlebar-mounted buttons pictured here.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>You can also customise electronic groupsets by adding additional points of shifting, known as ‘sprint shifters’, ‘satellite shifters’ or ‘blips’. These allow you to shift from alternative locations besides the shifter, such as on the drops when you are sprinting or on the tops of the bars if you are climbing.</p>\n<p>This is quite a popular feature with the pros and allows riders to shift quickly without moving their hands from a preferred position.</p>\n<p>The major groupset manufacturers all offer connectivity between their electronic groupsets and their respective partner apps, which allows you to customise what function each button performs.</p>\n<p>For example, you could set a lever that would normally be pre-programmed to down-shift and vice versa, depending on your preference. This is unachievable on mechanical systems because the respective lever has a set amount of cable pull for the relevant derailleur.</p>\n<p>Electronic groupsets can be easier to install compared to mechanical systems when building up a bike, because you are not tied to running a gear cable from the head tube to the chainstays. As electronic wires are narrower in profile, they are easier to install through convoluted integrated set-ups.</p>\n<p>In the case of both SRAM’s wireless electronic AXS groupsets and Campagnolo Super Record Wireless, there is no cabling to route whatsoever, which makes set-up significantly easier.</p>\n<h3>Cons of electronic groupsets</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"R9200 shifter side view\" title=\"Pinarello Dogma F with Dura-Ace R9200-10\" /></div><div><figcaption><span><i></i> Shimano has designed its latest Di2 shifting buttons to be easier to differentiate from one another.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<ul><li>Lack of feedback when shifting</li>\n<li>Harder to diagnose issues</li>\n<li>Small weight penalty</li>\n<li>More expensive</li>\n</ul><p>Electronic groupsets can lack ‘feel’ or feedback in the shifting, but this is admittedly down to personal preference. Some riders prefer the positive feedback of a mechanical shifter with a rewarding click at the end of the shift.</p>\n<p>Vague shifting on electronic systems can be a common complaint in the winter when riders are using thick <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-cycling-gloves/\">winter gloves</a>, but the latest electronic groupsets have been designed to offer more of a ‘click’ in the lever.</p>\n<p>If you experience an issue out on the road or trail with your shifting, it is generally harder to diagnose compared to a mechanical system and you are unlikely to be carrying the relevant spare with you to sort the problem.</p>\n<p>If, for example, your Shimano shifting stops working, you would need to check every component by plugging it into a computer with the brand’s eTube software.</p>\n<p>Similarly, you can typically expect a higher bill at the bike shop if there are any problems because it can be a more labour-intensive process to diagnose and resolve an issue.</p>\n<p>There is generally a slight weight penalty on an electronic groupset over mechanical. The derailleurs need to house the additional motors and you also need to factor in the extra weight of a battery and any junction boxes (if applicable). That said, the benefits likely outweigh the additional weight for most riders.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SRAM GX Eagle AXS mountain bike drivetrain\" title=\"SRAM GX Eagle AXS mountain bike drivetrain-11\" /></div><div><figcaption><span><i></i> Electronic groupsets require charging and it can be difficult to diagnose issues out on the road or trail.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>While the front shifting of electronic groupsets is impressive and far more consistent than their mechanical counterparts, you will want to exercise care when shifting and avoid shifting under load, despite manufacturers allowing you to do so.</p>\n<p>Electronic front derailleurs have quite an aggressive motor, which enables you to shift under load, for example if you need to change quickly between chainrings. However, this puts more strain on your frame and specifically your front-derailleur hanger. SRAM AXS front derailleurs come with a support brace in the box for this reason.</p>\n<p>The most notable downside of an electronic groupset is the increased cost, both in comparison to an equivalent mechanical groupset and due to the fact electronic groupsets are, on the whole, only available at the higher end of the market.</p>\n<p>That said, electronic technology is slowly trickling down the groupset tiers, with more options in brands’ ranges, as we’ll discuss next.</p>\n<h2>Who makes electronic groupsets?</h2>\n<p>Shimano, SRAM and Campagnolo are the ‘big three’ in the groupset market and each offer electronic groupsets.</p>\n<p>Shimano (Di2) and SRAM (eTap AXS) produce electronic groupsets for road, gravel and mountain biking, while Campagnolo is limited to road cycling.</p>\n<h3>Shimano Di2</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Orbea Orca Aero M10i LTD\" title=\"Orbea Orca Aero M10i LTD\" /></div><div><figcaption><span><i></i> Shimano’s Dura-Ace R9200 is the flagship road groupset from the brand.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<h4>Road</h4>\n<ul><li>Dura-Ace R9200</li>\n<li>Ultegra R8100</li>\n<li>105 R7150</li>\n</ul><h4>Gravel</h4>\n<ul><li>GRX 815</li>\n</ul><h4>Mountain</h4>\n<ul><li>XTR M9050</li>\n<li>XT M8050</li>\n</ul><h4>Urban</h4>\n<ul><li>Alfine Di2</li>\n</ul><p>The Japanese company was the first major manufacturer to crack the code of a mass-market electronic groupset.</p>\n<p>The road line was limited to the brand’s two top-tier groupsets, Dura-Ace and Ultegra, until June 2022, but 105, the brand’s third-tier groupset, has now joined the electronic club.</p>\n<p>The current-generation Dura-Ace R9200, Ultegra R8100 and 105 R7100 groupsets are the cream of the crop and mark Shimano’s move into semi-wireless shifting (though the rim-brake versions of Ultegra and Dura-Ace remain fully wired). They build on existing technologies in previous generations and offer 12-speeds.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Mark Beaumont’s Bike Argon 18 Dark Matter GBDuro tech gallery 20\" title=\"Mark Beaumont’s Bike Argon 18 Dark Matter GBDuro tech gallery 3\" /></div><div><figcaption><span><i></i> GRX Di2 is Shimano’s electronic gravel groupset.</span></figcaption><span> <a href=\"https://tommycheck.com/\"><strong>Tommy Check</strong></a></span></div>\n<p>Shimano also offers Di2 versions of its 11-speed mountain bike groupsets, XTR and Deore XT. These are fully wired and there isn’t an option to run them semi-wireless.</p>\n<p>Moving on to <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bikes</a>, Shimano offers a Di2 version of its GRX gravel groupset, specifically GRX815. Again, this is 11-speed and relies on the same wired technologies as the brand’s mountain groupsets and previous-gen 11-speed road groupsets.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano XTR Di2\" title=\"Shimano XTR Di2\" /></div><div><figcaption><span><i></i> Shimano XTR M9050 is long overdue an update.</span></figcaption><span> <i>James Huang / Immediate Media</i></span></div>\n<p>Given how the Japanese brand hasn’t released an electronic equivalent to its current XTR M9100 or XT M8100 12-speed mechanical groupsets and that GRX is 11-speed, could an update to Shimano’s off-road setups be in the pipeline?</p>\n<p>On the utilitarian side, Shimano also offers Alfine Di2 for hub-gear users, the only brand of the big three to do this.</p>\n<h3>SRAM eTap AXS</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SRAM’s Force AXS wireless drivetrain on the Cervélo Áspero-5 Force eTap AXS 1 gravel bike\" title=\"Cervélo Áspero-5 Force eTap AXS 1 06\" /></div><div><figcaption><span><i></i> SRAM’s eTap AXS groupsets are wireless.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<h4>Road</h4>\n<ul><li>Red eTap AXS</li>\n<li>Force AXS</li>\n<li>Rival eTap AXS</li>\n</ul><h4>Gravel</h4>\n<ul><li>Red eTap XPLR AXS</li>\n<li>Force XPLR AXS</li>\n<li>Rival eTap XPLR AXS</li>\n<li>Apex XPLR AXS</li>\n</ul><h4>Mountain</h4>\n<ul><li>XX Eagle Transmission</li>\n<li>XO Eagle Transmission</li>\n<li>XX1 Eagle AXS</li>\n<li>X01 Eagle AXS</li>\n<li>GX Eagle AXS</li>\n</ul><p>The American manufacturer was the last brand to join the electronic revolution but, when it did, SRAM bypassed Shimano and Campagnolo and went straight to wireless.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Factor Ostro Gravel against a graffiti background\" title=\"DSC00299\" /></div><div><figcaption><span><i></i> Red is the top-of-the-range option.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>SRAM currently offers four levels of road groupset in its eTap AXS line-up. Red is the top-flight, no-expense-spared option, followed by Force, which utilises many of the same technologies but is heavier in weight to hit a lower price point.</p>\n<p>The third-tier <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-rival-etap-axs-review/\">Rival eTap AXS</a> was launched in April 2021 and is heavier still but, once again, more competitive in price and brought electronic shifting for the road down to a third-tier groupset for the first time. It now <a href=\"https://www.bikeradar.com/advice/buyers-guides/shimano-105-r7150-di2-vs-sram-rival-etap-axs/\">competes with 105 Di2</a>.</p>\n<p>More recently, SRAM also upgraded its entry road groupset, Apex, to the AXS treatment. <a href=\"https://www.bikeradar.com/reviews/components/groupsets/gravel-groupset/sram-apex-axs-xplr-review/\">SRAM Apex AXS XPLR</a> is aimed squarely at <a href=\"https://www.bikeradar.com/features/routes-and-rides/what-is-gravel-riding/\">gravel riding</a>, <a href=\"https://www.bikeradar.com/features/routes-and-rides/bikepacking/\">bikepacking</a> and commuting because it’s only available in 1x.</p>\n<p><span>SRAM has also migrated the eTap AXS system to its mountain bike Eagle groupsets. Like road, there are also three options extending from the flagship XX1 to X01 and now down to the GX level.</span></p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SRAM XX T-Type Eagle Transmission Powermeter AXS groupset.\" title=\"SRAM XX T-Type Eagle Transmission Powermeter AXS groupset\" /></div><div><figcaption><span><i></i> Will T-Type trickle down to road and gravel? Only time will tell.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p>In March 2023, SRAM unveiled its new <a href=\"https://www.bikeradar.com/news/sram-t-type-eagle-transmission/\">T-Type Eagle Transmission</a>, which utilises a direct-mount rear derailleur design, removing the need for a derailleur hanger and adjustment screws.</p>\n<p>SRAM achieved this by taking advantage of the future-proofed <a href=\"https://www.bikeradar.com/advice/workshop/sram-udh/\">UDH</a> (Universal Derailleur Hanger) it launched back in 2019. It’s a whole new system that isn’t compatible with any of the current-generation Eagle drivetrain parts, bar the AXS controller.</p>\n<p>The electronic revolution further extends to the wireless <a href=\"https://www.bikeradar.com/reviews/components/seatposts/seatpost-and-seat-pin/rockshox-reverb-dropper-seatpost-review/\">RockShox Reverb dropper post</a>, also part of the SRAM catalogue.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SRAM XPLR cassette on Rå Valravn S gravel bike\" title=\"Rå Valravn S long-term - Cassette2\" /></div><div><figcaption><span><i></i> SRAM’s XPLR is a gravel-specific drivetrain with a wide-ranging 10-44t cassette.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>On top of that, SRAM has launched gravel iterations of its eTap AXS groupsets in the form of <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-rockshox-xplr/\">eTap AXS XPLR</a>.</p>\n<p>Available in options from Red down to Rival, XPLR features rear derailleurs with a larger 44t capacity and 10-44 cassettes, for <a href=\"https://www.bikeradar.com/advice/buyers-guides/gravel-bike-setup/\">gravel-specific gearing</a>, and a range of 1x or 2x chainsets.</p>\n<p>The SRAM ecosystem also allows you to pair different elements of the road, gravel and mountain bike groupsets, with the exception of the new T-Type Transmission drivetrains.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SRAM 1× mullet drivetrain\" title=\"JessCerra_ENVE_20210603_IWM4489-Edit\" /></div><div><figcaption><span><i></i> A SRAM 1x ‘mullet’ setup, pairing a road chainset with an Eagle mountain bike rear derailleur, chain and cassette.</span></figcaption><span> <i>Enve</i></span></div>\n<p>For example, if you owned a gravel bike, you could run Red shifters for drop handlebars, but then an XX1 Eagle mountain bike drivetrain out the back if you wanted to achieve the widest range possible with road shifters.</p>\n<p>While you can also mix and match between Shimano’s offerings in its 11-speed guise, SRAM’s system pushes the envelope further in this regard in that there is significantly greater compatibility.</p>\n<h3>Campagnolo</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Campagnolo Super Record Wireless crankset and front derailleur\" title=\"Campagnolo Super Record Wireless crankset and front derailleur\" /></div><div><figcaption><span><i></i> There’s just the one wireless electronic groupset for now.</span></figcaption><span> <i>Oscar Huckle / Our Media</i></span></div>\n<h4>Road</h4>\n<ul><li>Super Record Wireless</li>\n</ul><p>Campagnolo currently only offers the <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/campagnolo-super-record-wireless/\">Super Record Wireless</a> groupset. Launched in May 2023, it’s Campagnolo’s new top-flight 12-speed groupset and it <a href=\"https://www.bikeradar.com/features/opinion/the-death-of-campagnolos-thumb-shifter/\">ditches the iconic thumb shifter</a>.</p>\n<p>While the brand was tight-lipped on any specific future developments, it noted it always launches new technology at the top of the range before trickling it down, so expect to see a lower-tier Wireless groupset in the future.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Campagnolo Super Record EPS 12 speed shifter on BMC Teammachine SLR01 against a wall\" title=\"Campagnolo Super Record EPS 12 speed shifter on BMC Teammachine SLR01 against a wall\" /></div><div><figcaption><span><i></i> Although Super Record EPS 12 has been discontinued, it’s still in circulation and can be found on complete bikes.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>Prior to the new groupset, Campagnolo’s electronic technology was called EPS which in its 12-speed format, was only available on Super Record.</p>\n<p>Super Record EPS 12-speed is fully wired and Campagnolo made a concerted effort to keep the electronic effort as similar to mechanical as possible, going so far as to say that Super Record represents an “electro-mechanisation” of its mechanical counterpart.</p>\n<section><div>\n        \n<h3>Who made the first electronic groupset?</h3>\n<p>Mavic, the French brand most famous for its range of wheels, was the first brand to pioneer an electronic groupset with the Zap in 1992.</p>\n<p>It was a wired system where shifts were actuated by a button on the shifter. When you shift, the system sends an electronic signal to the rear derailleur, where a solenoid engages the jockeywheel and, coupled with the speed of the rider’s pedalling action, actuates the shift.</p>\n<p>The speed of the shift is dependent on how fast you are pedalling. This was a common complaint from the pros who used the system, because the shifting was haphazard when being used under load.</p>\n<p>Mavic then updated the system in 1999 to Mektronic, which was wireless. It also had its problems – it was a weighty affair and had reliability issues.</p>\n<p>Although innovative, Mavic’s technology didn’t really take off due to its lack of refinement and reliability, but it certainly sowed the seeds for what would come a decade later.</p>\n<p>On that note, in 2009 Shimano launched its Di2 electronic technical with the <a href=\"https://www.bikeradar.com/reviews/components/groupsets/gear-shifters/shimano-dura-ace-di2-electronic-transmission-review/\">Dura-Ace 7950 series groupset</a>. This trickled down to <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-ultegra-di2-review/\">Ultegra 6750</a> a year later.</p>\n<p>Campagnolo was next to the party with <a href=\"https://www.bikeradar.com/news/campagnolo-launch-electronic-eps-groups/\">Super Record EPS in late 2011</a>.</p>\n<p>SRAM was the last major manufacturer to produce an electronic groupset, but took things a step further with the <a href=\"https://www.bikeradar.com/news/sram-red-etap-ushers-in-wireless-shifting-era/\">release of SRAM Red eTap in 2015</a>, which was the first wireless groupset.</p>\n<p>\n\n    </p></div>\n    </section><h2>How does an electronic groupset work?</h2>\n<p>Although there are variations between brands, the fundamentals of how an electronic groupset works remain the same.</p>\n<p>Depending on the system, when you actuate the shifter, it will send an electrical signal down the wire or communicate wirelessly to the relevant derailleur, which makes it shift into the gear that you have specified.</p>\n<h3>Wireless vs wired</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano Dura-Ace R9200 rear derailleur\" title=\"Pinarello Dogma F with Dura-Ace R9200-5\" /></div><div><figcaption><span><i></i> Shimano and Campagnolo’s respective systems use wires.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>There is a split between the big three groupset manufacturers when it comes to how the electronic signal is communicated.</p>\n<p>Shimano’s electronic groupsets have historically been fully wired (and, for the most part, that remains the case), but the Japanese brand’s latest <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-di2-r9200-review/\">Dura-Ace Di2 R9200</a> and <a href=\"https://www.bikeradar.com/news/shimano-ultegra-di2-r8100/\">Ultegra R8100</a> road groupsets are semi-wireless (in their hydraulic disc brake guise). <a href=\"https://www.bikeradar.com/news/shimano-105-di2-r7150/\">105 Di2</a> is also semi-wireless and does not come in a rim brake option.</p>\n<p>Here, you have a wire between the two derailleurs and the battery, which is generally housed in the seatpost. The shifters are wireless, with their own coin cell batteries.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Red eTap AXS drivetrain\" title=\"Tarmac SL7 BR-34\" /></div><div><figcaption><span><i></i> There are no electronic wires to be seen here.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>SRAM was the first manufacturer of the big three to offer a fully wireless setup, with its eTap AXS groupsets across road cycling, gravel riding and mountain biking.</p>\n<p>When you actuate a SRAM eTap shifter, it communicates to the relevant derailleur via AIREA (essentially SRAM’s equivalent of the Bluetooth or ANT+ wireless protocols), causing it to shift.</p>\n<p>Campagnolo also now offers a wireless setup with its Super Record Wireless groupset, where the shifters communicate to the derailleurs via ANT+ and Bluetooth.</p>\n<h3>How long does the battery on an electronic groupset last?</h3>\n<p>There are many variables that determine battery life, not only from one system to the next but also how frequently you shift.</p>\n<p>For example, you’ll be shifting gears more often on a hilly ride where you need to change between extremes more regularly. Some riders also just shift more frequently than other riders, particularly if you’re someone who likes to maintain a specific <a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">cadence</a>.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Indicator LED on rear derailleur\" title=\"Pinarello Dogma F with Dura-Ace R9200-15\" /></div><div><figcaption><span><i></i> Shimano’s new 12-speed Dura-Ace and Ultegra groupsets are charged via the rear derailleur. The existing 11-speed groupsets are charged through a separate junction box.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Shimano claims the main battery in its latest Dura-Ace R9200 battery will last up to 1,000km. The CR1632 coin cell batteries in the levers are claimed to last between one and a half and two years and are non-rechargeable. Battery life can be extended by up to 50 per cent if you run the system fully wired.</p>\n<p>On 105 Di2, Shimano claims an approximate three-year battery life. The shifters are not compatible with Di2 wires to run rim brakes, nor are they compatible with satellite shifters and they also lack an auxiliary button on the hoods.</p>\n<p>On Shimano’s 11-speed groupsets, the central battery life is rated to between 1,000 and 2,000km, though the exact mileage you’ll achieve is dependent on the frequency of shifting and the terrain you’re riding.</p>\n<p>You can monitor battery life via the rear derailleur on Shimano’s latest Ultegra and Dura-Ace Di2 groupsets or on the junction box on the existing road, gravel and mountain bike Di2 setups.</p>\n<p>Green means you have between 50 and 100 per cent of battery, red is between 50 and 25 per cent and flashing red is under 25 cent.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SRAM GX Eagle AXS mountain bike drivetrain\" title=\"SRAM GX Eagle AXS mountain bike drivetrain-10\" /></div><div><figcaption><span><i></i> SRAM’s system is powered by rechargeable batteries in the derailleurs, with single-use coin-cell batteries in the shifters.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>If you forget to charge the system and the battery gets really low, the <a href=\"https://www.bikeradar.com/advice/buyers-guides/front-derailleur/\">front derailleur</a> will stop working (it should shift into the small chainring first, to give you easier gears to work with) and there will be a couple of hundred shifts left in the rear derailleur.</p>\n<p>If you still neglect to charge the battery, the rear derailleur will then stop working and you’ll be single-speeding home.</p>\n<p>SRAM eTap AXS uses one rechargeable lithium-ion battery per derailleur and a CR2032 coin-cell battery in either shifter. The derailleur batteries will last approximately 60 hours from a full charge, according to SRAM. They take approximately one hour to charge in their designated charging cradle.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"When the lever is actuated, the colour of the light on the inside of the shifter paddle portrays the remaining battery life.\" title=\"etap13-1452710498809-11yuct0dpjock-3c30e32\" /></div><div><figcaption><span><i></i> When a SRAM eTap lever is actuated, the colour of the light on the inside of the shifter paddle show the remaining battery life.</span></figcaption><span> <i>Ben Delaney / Immediate Media</i></span></div>\n<p>It is easy to tell when the batteries need charging. There is a green indicator light on the derailleurs that flashes with each shift, which indicates that battery life is between 25 and 100 per cent. When the system is under 25 per cent, the light will change to red and a flashing red light indicates the system is under 10 per cent.</p>\n<p>If you are using a 2x system and one of your batteries happens to die, you can switch the batteries around to the preferable derailleur, if applicable.</p>\n<p>The shifter battery life works on a similar principle and can be viewed on the inside of the shifter paddle – green when there is 6-24 months remaining, red when there is 1-6 months remaining and flashing red when there is under a month.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Campagnolo Super Record Wireless shifters\" title=\"Campagnolo Super Record Wireless shifters\" /></div><div><figcaption><span><i></i> Peeling back the rubber hood exposes a slot for a CR2032 battery.</span></figcaption><span> <i>Oscar Huckle / Our Media</i></span></div>\n<p>Campagnolo Super Record Wireless uses a CR2032 coin battery in the shifter, which it says will last for two years. The derailleurs use separate batteries, so you cannot swap them around if one happens to run out of juice, which you can with SRAM. However, unlike SRAM, you can charge them both on or off the bike.</p>\n<p>The derailleurs use ‘Mac-type’ charging ports and Campagnolo claims the batteries can be charged to 90 per cent in 45 minutes or full in 60 minutes. If you happen to run out of battery on a ride, providing you’re carrying the charge cable, Campagnolo claims you can charge the system up to 20 per cent in ten minutes.</p>\n<p>Campagnolo’s previous EPS groupsets are fully wired with one battery and the brand claims its latest V4 battery will last up to 1,700km, depending on riding conditions and frequency of shifts.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Like Shimano, the junction box indicates the remaining battery life on Campagnolo's EPS system.\" title=\"caleb-ewan-noah-fast-7-1547093888475-ec7tr091jjtb-69c20d9\" /></div><div><figcaption><span><i></i> Like Shimano’s 11-speed groupsets, the Campagnolo EPS junction box indicates the remaining battery life on Campagnolo’s EPS system.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>You can monitor the battery life at the V4 interface unit, which will be located under the stem, integrated into the down tube of the frame or in place of a bar-end plug.</p>\n<p>The LED light is a steady green when the charge is between 60 and 100 per cent. When it is under 60 per cent, it will be a flashing green. It will then flash amber between 40 and 60 per cent. A continuous red light denotes the battery is between 6 per cent and 20 per cent. Finally, there is flashing red, which is under 6 per cent.</p>\n<h2>Can you upgrade your bike from a mechanical groupset to electronic?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"There isn't provision to fit a wired electronic groupset when the cables are routed externally.\" title=\"1444814819374-y9pi43pnx6b9-a38eafa\" /></div><div><figcaption><span><i></i> There isn’t a provision to fit a wired electronic groupset when the cables are routed externally.</span></figcaption><span> <i>Ben Delaney / Immediate Media</i></span></div>\n<p>While mechanical drivetrain components are not compatible with electronic parts, you can generally upgrade your bike from a mechanical groupset to an electronic one if overhauling the entire groupset.</p>\n<p>However, that’s not always the case, so there are some aspects to bear in mind if you want to overhaul your bike’s drivetrain.</p>\n<p>Switching from mechanical to electronic is all dependent on the arrangement of cables if you are using a wired system.</p>\n<p>If your frame has external cable routing, it likely doesn’t have anywhere to mount the battery. Some older frames feature mounting on the bottom of the down tube / bottom bracket area for the original style of Shimano or Campagnolo battery.</p>\n<p>So, can you then convert your frame to accept internal cable routing for electronic groupsets?</p>\n<p>The answer is generally ‘no’ because the frame will have been designed by the respective manufacturer with its style of cabling in mind. The area between the chainstay and bottom bracket area is quite often sealed, which prevents access for cables or wires to be run.</p>\n<p>If you are planning on upgrading to a fully wireless system, the cable routing of your frame is a moot point, so the beauty of this system is that it has greater compatibility with older frames.</p>\n<p>You may want to use some plugs to blank any redundant cable guides to improve the frame’s appearance and to prevent moisture ingress.</p>","author":"Oscar Huckle","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"0097af12dc67a2bdd3604826c6095bb820773d0729ecf0e2403ce81461617ff0","category":"Cycling"}