{"title":"Perspective: Social License as a Lens for Improving Ethical and Welfare Standards in Cephalopod Research","link":"https://academic.oup.com/icb/article/63/6/1307/7223969?rss=1","date":1689206400000,"content":"<span><div>Synopsis</div>Interest in cephalopods as comparative models in neuroscience, cognition, behavior, and ecology is surging due to recent advances in culture and experimental techniques. Although cephalopods have a long history in research, their use had remained limited due to the challenges of funding work on comparative models, the lack of modern techniques applicable to them, and the small number of labs with the facilities to keep and house large numbers of healthy animals for long periods. Breakthroughs in each of these areas are now creating new interest in cephalopods from researchers who trained and worked in other models, as well as allowing established cephalopod labs to grow and collaborate more widely. This broadening of the field is essential to its long-term health, but also brings with it new and heightened scrutiny from animal rights organizations, federal regulatory agencies, and members of the public. As a community, it is critical that scientists working with cephalopods engage in discussions, studies, and communication that promote high standards for cephalopod welfare. The concept of “social license to operate,” more commonly encountered in industry, recreation, and agriculture, provides a useful lens through which to view proactive steps the cephalopod research community may take to ensure a strong future for our field. In this Perspective, I discuss recent progress in cephalopod ethics and welfare studies, and use the conceptual framework of Social License to Operate to propose a forward-looking, public-facing strategy for the parallel development of welfare-focused best practices and scientific breakthroughs.</span>","author":"","siteTitle":"Integrative and Comparative Biology Current Issue","siteHash":"715dd1b0fb4f45600bceadb227e9b7fdf8bd9d1d7a2fd3d5e0399d2c1f410646","entryHash":"00ae91b3569dc0d7f28dd79aa9d06d6b885cfaf5807ff6533e2efce4869e5eda","category":"Environment"}