{"title":"Mechanical Constraints during Vertical Climbing Reveals Limited Deviation from Theoretical Minima","link":"https://academic.oup.com/icb/article/64/1/145/7660567?rss=1","date":1714435200000,"content":"<span><div>Synopsis</div>Center of mass (COM) mechanics, often used as an energetic proxy during locomotion, has primarily focused on level movement and hardly explores climbing scenarios. This study examines three-dimensional COM movements across five phylogenetically distinct species to test theoretical expectations of climbing costs, explore how interspecific variation (i.e., different limb numbers, adhesion mechanisms, body masses [0.008–84 kg], and limb postures) affects COM mechanics, and determine the impact of out-of-plane COM movements on climbing costs. A parallel experiment with rosy-faced lovebirds explores how inclination angle affects COM mechanical energy and how these empirical data align with theoretical expectations. Results indicate that, irrespective of anatomical differences, total mechanical costs of climbing are primarily driven by potential energy, outweighing contributions from kinetic energy. Despite species exhibiting significant out-of-plane kinematics, these movements have minimal impact on overall locomotor costs. Inclination angle changes have minimal effects, as potential energy accumulation dominates quickly as steepness increases, suggesting climbing occurs even on acutely angled substrates from a COM perspective. The study challenges prior assumptions about factors influencing climbing costs, such as body mass, speed, or posture, indicating a lack of evident anatomical or behavioral adaptations for climbing efficiency across species. The research sheds light on the universal challenges posed by the mechanical demands of scaling vertical substrates, offering valuable insights for functional morphologists studying climbing behaviors in extant and fossilized species.</span>","author":"","siteTitle":"Integrative and Comparative Biology Current Issue","siteHash":"715dd1b0fb4f45600bceadb227e9b7fdf8bd9d1d7a2fd3d5e0399d2c1f410646","entryHash":"00b2c72514dd263f31a9fbfe4ab2c2a037010edd64257d93e7a936f538619b99","category":"Environment"}