{"title":"Viviparity is associated with larger female size and higher sexual size dimorphism in a reproductively bimodal lizard","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2656.14170?af=R","date":1725355637000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d944d63d-1937-4b58-8ae8-4a3059d8bcad/jane14170-toc-0001-m.png\" alt=\"Viviparity is associated with larger female size and higher sexual size dimorphism in a reproductively bimodal lizard\" />\n<p>Using an exceptionally large dataset on body size, climatic seasonality and lineage identity in European common lizards, we show that viviparous females, but not males, are larger than oviparous ones. Other reproductively bimodal lizards show differing patterns, indicating why across squamates, viviparity is only weakly associated with larger size.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSquamate reptiles are central for studying phenotypic correlates of evolutionary transitions from oviparity to viviparity because these transitions are numerous, with many of them being recent. Several models of life-history theory predict that viviparity is associated with increased female size, and thus more female-biased sexual size dimorphism (SSD). Yet, the corresponding empirical evidence is overall weak and inconsistent. The lizard <i>Zootoca vivipara</i>, which occupies a major part of Northern Eurasia and includes four viviparous and two non-sister oviparous lineages, represents an excellent model for testing these predictions.\n\nWe analysed how sex-specific body size and SSD is associated with parity mode, using body length data for nearly 14,000 adult individuals from 97 geographically distinct populations, which cover almost the entire species' range and represent all six lineages. Our analyses controlled for lineage identity, climatic seasonality (the strongest predictor of geographic body size variation in previous studies of this species) and several aspects of data heterogeneity.\n\nParity mode, lineage and seasonality are significantly associated with female size and SSD; the first two predictors accounted for 14%–26% of the total variation each, while seasonality explained 5%–7%. Viviparous populations exhibited a larger female size than oviparous populations, with no concomitant differences in male size. The variation of male size was overall low and poorly explained by our predictors.\n\nAlbeit fully expected from theory, the strong female bias of the body size differences between oviparous and viviparous populations found in <i>Z. vivipara</i> is not evident from available data on three other lizard systems of closely related lineages differing in parity mode. We confront this pattern with the data on female reproductive traits in the considered systems and the frequencies of evolutionary changes of parity mode in the corresponding lizard families and speculate why the life-history correlates of live-bearing in <i>Z. vivipara</i> are distinct.\n\nComparing conspecific populations, our study provides the most direct evidence for the predicted effect of parity mode on adult body size but also demonstrates that the revealed pattern may not be general. This might explain why across squamates, viviparity is only weakly associated with larger size.\n</p>","author":"Evgeny S. Roitberg, \nHans Recknagel, \nKathryn R. Elmer, \nFlorentino Braña, \nTania Rodríguez Díaz, \nAnamarija Žagar, \nValentina N. Kuranova, \nLidiya A. Epova, \nDirk Bauwens, \nGiovanni Giovine, \nValentina F. Orlova, \nNina A. Bulakhova, \nGalina V. Eplanova, \nOscar J. Arribas","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"00b3f552c58714beb857280fafbb60c2b47d5ae7913c7ffc0ba7deaecd0cd47f","category":"Environment"}