{"title":"Our essential training plan for gravel riding and racing","link":"https://www.bikeradar.com/advice/fitness-and-training/gravel-riding-training-plan/","date":1688310044000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Dirty-Reiver-2023-24-e888fbe.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Dirty-Reiver-2023-24-e888fbe.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Dirty-Reiver-2023-24-e888fbe.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Dirty-Reiver-2023-24-e888fbe.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Dirty-Reiver-2023-24-e888fbe.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Dirty-Reiver-2023-24-e888fbe.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Dirty-Reiver-2023-24-e888fbe.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Dirty-Reiver-2023-24-e888fbe.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Dirty-Reiver-2023-24-e888fbe.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Dirty Reiver 2023\" title=\"Dirty Reiver 2023\" />                                            <p>Although gravel riding and racing have exploded in popularity in recent years, compared with more established cycling disciplines, there’s considerably less written about the physical demands of this cycling specialism.</p>\n<p>No two gravel rides are alike and competitive events can last anywhere from several hours to multiple days. <a href=\"https://www.bikeradar.com/features/routes-and-rides/what-is-gravel-riding/\">Gravel riding</a> and <a href=\"https://www.bikeradar.com/features/routes-and-rides/gravel-racing/\">gravel racing</a> can incorporate flat and severely hilly sections, with surfaces as diverse as gravel, forest trails, fireroads, cobbles, rocky bridleways and canal towpaths.</p>\n<p>In this article, we’ll run through the physical abilities you’ll need for gravel riding. We’ll help you put together a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-training-plan/\">training plan</a> for gravel riding and racing, and provide some handy tips for getting the most from your gravel-focused workouts.</p>\n<h2>The physical demands of gravel riding explained</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Dirty Reiver 2023\" title=\"Dirty Reiver 2023\" /></div><div><figcaption><span><i></i> Gravel racing is a tough ol’ gig.</span></figcaption><span> <i>Mick Kirkman / Our Media</i></span></div>\n<p>Gravel riding sits somewhere between a <a href=\"https://www.bikeradar.com/features/routes-and-rides/what-is-a-sportive/\">sportive</a> and a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cross-country-racing-guide/\">cross-country mountain bike marathon</a> in terms of physiological demands.</p>\n<p>Key to all of these disciplines is having a good ability to <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-train-with-power/\">sustain power</a> for many hours at a time.</p>\n<p>However, sustainable power is arguably even more important for gravel riding than perhaps all other cycling disciplines.</p>\n<p>This is because the higher rolling resistance means you’ll be spending less time coasting or soft pedalling than on the road.</p>\n<p>The long, sustained climbs that feature heavily in gravel rides also mean that you’re likely to be plugging away for longer continuous periods than you would on a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike/\">mountain bike</a>.</p>\n<h3>Carbs are king</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Precision Fuel 30 energy gel\" title=\"Best of Engery Gels - Precision Fuel 30\" /></div><div><figcaption><span><i></i> Energy gels are often packed full of carbs to help fuel racy efforts.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>The ability to sustain power for a long time has a lot to do with your ability to use fats for fuel.</p>\n<p>That’s because the body largely relies on carbohydrates and fats to produce energy.</p>\n<p>Even the leanest person will store enough fat to keep riding for several days.</p>\n<p>However, the amount of carbohydrates stored in the body is only sufficient to sustain roughly 1.5 hours of all-out riding.</p>\n<p>Running out of carbohydrates is the key reason for fatigue in endurance events such as gravel rides, and is generally the cause of ‘<a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-avoid-bonking-on-a-bike-ride/\">bonking</a>’.</p>\n<p>If you were to derive energy purely from carbohydrates during a gravel ride, you wouldn’t be able to eat and digest enough to replace the fuel that’s being burnt. So a good ability to use fats is paramount.</p>\n<p>The best way to train your fat oxidation ability is by riding for a long time at a relatively low intensity (known as <a href=\"https://www.bikeradar.com/advice/fitness-and-training/base-training-cycling/\">base training</a>) where fat oxidation rates are high.</p>\n<h3>Muscles matter</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Female athlete lifting a barbell at the gym\" title=\"Female athlete lifting a barbell at the gym\" /></div><div><figcaption><span><i></i> Building muscle strength through weight training could help improve your fitness for gravel riding.</span></figcaption><span> <i>Getty</i></span></div>\n<p>Another factor that plays into sustainable power is muscle strength.</p>\n<p>There’s good research that suggests <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-stronger-legs-for-cycling/\">improving the strength of leg muscles</a> helps <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-endurance/\">improve endurance</a>.</p>\n<p>It’s not completely clear why this helps, but one theory is that, with each pedal stroke, you’re having to contract the muscles at a lower percentage of the maximum contractile force, meaning there’s less muscle damage.</p>\n<p>Although it’s possible to work on muscle strength on the bike, this is an ability that’s usually trained best in the gym, by <a href=\"https://www.bikeradar.com/advice/fitness-and-training/strength-training-cycling/\">lifting weights</a>. We’ll discuss this in more detail later in this article.</p>\n<h3>Don’t forget skills</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Specialized Diverge STR Expert gravel bike review BikeRadar\" title=\"Specialized Diverge STR Expert gravel bike review BikeRadar\" /></div><div><figcaption><span><i></i> If you want to ride fast on gravel, you also need to work on your skills.</span></figcaption><span> <i>Felix Smith / Our Media</i></span></div>\n<p>Of course, there’s more to gravel riding than just having a good sustainable power output…</p>\n<p>When we look at the power and heart rate data from gravel rides, average heart rates for gravel rides generally range between 70 and 85 per cent maximum. Average power is between roughly 50 and 85 per cent <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">FTP</a> (functional threshold power).</p>\n<p>However, riders will spend considerable time at a variety of intensities, both above and below this range.</p>\n<p>When you hit steep, slippy or technical terrain, or make a move to catch up with a group, you need to be able to put down some higher wattages.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Basso Palta Disc Ekar gravel bike\" title=\"Basso Palta Disc Ekar - 18\" /></div><div><figcaption><span><i></i> Building your threshold power will mean you are less likely to be above it when riding on technical terrain.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Having a decent ‘threshold power’ can help with this, because it means you’ll be stepping ‘into the red’ less often.</p>\n<p>Broadly speaking, your threshold power is your maximum sustainable power. Above this power, fatigue accumulates much more rapidly than below this threshold.</p>\n<p>It can be defined in a number of ways, with the most common being ‘functional threshold power’ (or FTP).</p>\n<p>Other terms you might be familiar with include <a href=\"https://www.bikeradar.com/advice/fitness-and-training/critical-power/\">critical power</a> and lactate threshold. For the purpose of this article, we can interpret them as pointing to the same thing.</p>\n<p>It’s also wise to spend a little time training your short-duration power (e.g. abilities over 30 seconds up to 5 minutes) so that you’re prepared when you need to produce some bigger watts.</p>\n<p>The shorter the ride or event, the more you should pay attention to this ability.</p>\n<p>Much like mountain biking, gravel riding is often characterised by lower <a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">cadences</a>, compared with road cycling, and this is something that you’ll need to develop specifically in training.</p>\n<h2>Recommended training plan for gravel riding</h2>\n<p>Pulling this all together, here are some of the key workouts you can use to build a good base of fitness for gravel riding.</p>\n<h3>Long endurance rides</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"cyclists riding gravel bikes through kielder forest\" title=\"Adventure Addicts part 5 06\" /></div><div><figcaption><span><i></i> Long rides should form the basis of your training for gravel riding.</span></figcaption><span> <i>Mick Kirkman / Our Media</i></span></div>\n<p>These sessions should be the bedrock of your training, because they help to develop that all-important sustainable power and fat oxidation ability.</p>\n<p>Ideally, you’ll want to do one to three of these per week, with at least one being a duration that challenges your endurance capabilities.</p>\n<p>You should aim to keep the intensity mostly between 55 and 75 per cent of FTP, or 60 to 70 per cent of your maximum heart rate.</p>\n<p>Importantly, your breathing should be ‘conversational’, meaning that you can speak in full sentences.</p>\n<h3>Sustained lower-cadence ‘tempo’</h3>\n<p>These <a href=\"https://www.bikeradar.com/advice/fitness-and-training/why-you-should-build-tempo-riding-into-your-training-this-spring/\">tempo</a> sessions help build strength endurance and improve fatigue resistance, while also helping you become accustomed to the high-torque, low-cadence pedalling style that’s common in gravel riding.</p>\n<p>Start with something such as three 10-minute intervals at 85 to 95 per cent of your FTP, or 70 to 85 per cent of your maximum heart rate, using a cadence from 60-75 RPM. Take 2 to 5 mins of recovery between each block.</p>\n<p>As you improve, you can build towards completing up to 60 minutes riding in this intensity zone (e.g. 3x 20mins).</p>\n<h3>Long supra-threshold efforts</h3>\n<p>Long intervals (e.g. 6-8mins) performed just slightly above your threshold power (e.g. 102 to 108 per cent of FTP, or 88 to 92 per cent of maximum heart rate) are great for a number of reasons.</p>\n<p>They can really help lift your threshold power, as well as help improve your ability to repeat harder efforts above your threshold, which translates to better endurance on a gravel ride.</p>\n<p>They also help develop your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/vo2-max/\">‘VO2max’</a> (the maximum rate at which you can take on and process oxygen to produce energy), which can help with short-duration power.</p>\n<p>One of our favourite sessions is five to six 6-minute efforts at 102 to 108 per cent of FTP, or ~88 to 92 per cent of your maximum heart rate, taking 4 minutes recovery between each effort.</p>\n<p>You can make this extra discipline-specific by performing it on a loose climb, to work on body positioning and traction.</p>\n<h3>Race-pace gravel riding skills</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Cycling: Garmin Unbound Gravela Race: Rear view of cyclists in action during race. Emporia, KS 6/5/2021 CREDIT: Nils Nilsen (Photo by Nils Nilsen/Sports Illustrated via Getty Images) (Set Number: X163645 TK1)\" title=\"Cycling: Garmin Unbound Gravela Race: Rear view of cyclists in action during race. Emporia, KS 6/5/2021 CREDIT: Nils Nilsen (Photo by Nils Nilsen/Sports Illustrated via Getty Images) (Set Number: X163645 TK1)\" /></div><div><figcaption><span><i></i> Gravel racing demands a different set of skills compared to other disciplines.</span></figcaption><span> <i>Nils Nilsen / Contributor / Getty</i></span></div>\n<p>Skills training should not be neglected for gravel riding. Although the terrain is generally less technical than in mountain biking, the bikes are less forgiving. There’s more crossover with <a href=\"https://www.bikeradar.com/advice/skills/technique/cyclocross-skills/\">cyclocross skills</a>.</p>\n<p>Therefore, it’s essential to make sure you’re confident handling the bike on various surfaces, particularly loose downhills and unsupported open turns.</p>\n<p>Recommended skills include:</p>\n<ul><li>Climbing on loose/slippery surfaces, emphasising keeping your weight on the back wheel and applying power smoothly across the full pedal stroke to avoid wheel slip</li>\n<li>Line choice on technical terrain. Practise looking further ahead down the trail, and focusing on where you want your front wheel to go, rather than looking at the obstacles you want to avoid</li>\n<li>Cornering on loose terrain, working on lightly feathering the brakes to scrub off speed coming into a corner, and getting your line choice and weight distribution right in order to avoid losing grip</li>\n</ul><p>Skills training at a race-like intensity is recommended, since this helps you get used to riding technical terrain at higher speeds, as well as enabling you to work on your short-duration power.</p>\n<h3>Leg strength</h3>\n<p>Work on leg strength around once or twice per week. This doesn’t need to take long or be overly complex. A quick routine comprising squats and deadlifts will be enough to help with endurance.</p>\n<p>The most effective type of <a href=\"https://www.bikeradar.com/advice/fitness-and-training/6-strength-and-conditioning-tips-for-the-busy-cyclist/\">strength training</a> involves heavy weights (4-8 reps per set, and 3-5 sets per exercise), and uses moderate-speed and controlled movements, with plenty of recovery (e.g. 3 or more minutes) between each set.</p>\n<p>If you’re not confident in lifting weights with good form, consult with a strength and conditioning coach, and consider using equipment such as a leg press.</p>\n<h2>Tips for more effective training for gravel riding</h2>\n<p>Having looked at some of the key sessions you might want to focus on, let’s look at how you can get the most from these.</p>\n<h3>Build ride length gradually</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Liam Cahill riding Lauf Seigla gravel bike along gravel trail.\" title=\"_MG_1267\" /></div><div><figcaption><span><i></i> Avoid the temptation to go all-out with big rides from the off.</span></figcaption><span> <i>Felix Smith / Our Media</i></span></div>\n<p>When you’re looking to develop your endurance, it can be tempting to go all-guns-blazing and take on a really long ride that’s highly challenging.</p>\n<p>However, this can be counterproductive, because the amount of time you’ll need to recover from a session that stretches you too far, will often mean you end up losing fitness overall.</p>\n<p>Instead, focus on building your endurance gradually, perhaps adding just 15 to 20 mins each week onto your longest ride.</p>\n<h3>Keep rides long and varied</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Moonrakers &amp; Sunseekers audax brevet card.\" title=\"brevet-card-3\" /></div><div><figcaption><span><i></i> Training for gravel riding doesn’t have to be limited to off-road riding. Events such as an audax can help break up the monotony of training.</span></figcaption><span> <i>Stan Portus / Our Media</i></span></div>\n<p>Because long rides will be a cornerstone of your training, it can be easy to get mentally burnt out by these.</p>\n<p>Try to keep your long rides varied, by doing some with friends, and perhaps entering some low-priority events such as <a href=\"https://www.bikeradar.com/features/routes-and-rides/audax/\">audax events</a>, shorter gravel rides or sportives. You can ride these at a more leisurely pace to get some mileage in.</p>\n<p>Another strategy is to break your long rides up with some skills training, or some low-cadence tempo riding, as described above. This can make the time go much faster.</p>\n<h3>Use ‘breakthrough’ sessions</h3>\n<p>Every four to six weeks, we suggest doing a so-called ‘breakthrough’ ride, which challenges your sustainable power a little more than your usual training.</p>\n<p>This can be a particularly good strategy for time-crunched riders who have a similar training load from week to week, and therefore need help to cause a big boost to fitness.</p>\n<p>A good breakthrough session for gravel riding would be to perform your usual long ride, but aim to do this on a hilly route, performing all the climbs at <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">zone 3 to 4 intensity</a>.</p>\n<h3>Late-stage intensity</h3>\n<p>If you’re pressed for time, another good strategy is to include some intensity towards the end of your endurance rides.</p>\n<p>Although it’s not a perfect substitute for a long ride, adding some late-stage intensity (and particularly low-cadence ‘tempo’ efforts as described above) can help bring about some of the adaptations you’d usually get from riding longer.</p>\n<h3>Keep well-fuelled and hydrated</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Kristen Legan packed a variety of food, including a lot of carbohydrate powder for liquid calories. XL racers compete unassisted, meaning they must carry all their food and water or stop at stores on course.\" title=\"Kristen Legan packed a variety of food, including a lot of carbohydrate powder for liquid calories. XL racers compete unassisted, meaning they must carry all their food and water or stop at stores on course.\" /></div><div><figcaption><span><i></i> Staying fed and watered is critical to gravel-racing success.</span></figcaption><span> <i>Ben Delaney / Our Media</i></span></div>\n<p>As mentioned above, there’s often minimal let-up in gravel rides, due to fewer coasting and drafting opportunities, which can mean you deplete the body’s <a href=\"https://www.bikeradar.com/advice/nutrition/the-best-carbs-for-cycling-what-to-eat-and-when/\">stores of carbohydrates</a> more rapidly than you might if you were riding on the road.</p>\n<p>Because you’re riding at a slower speed, there’s also less air cooling, and you may find you sweat more.</p>\n<p>It’s therefore important to stay on top of <a href=\"https://www.bikeradar.com/advice/nutrition/fueling-your-body-for-performance/\">fuelling and hydration</a>. For gravel rides lasting two hours or more, aim to eat between 30 and 60g of carbohydrates per hour – that’s one or two typical <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-energy-bars/\">energy bars</a>.</p>\n<p>Increase this to 90g per hour if riding for more than 4 to 6 hours, provided you fuel using ‘multiple transportable carbohydrates’ such as <a href=\"https://www.bikeradar.com/advice/nutrition/best-energy-gels-for-cycling/\">energy gels</a> with mixture of maltodextrin and fructose.</p>\n<p>There is evidence that sports products containing branched-chain amino acids may also help stave off muscle damage in very long rides.</p>\n<p>Aim to drink largely to thirst, but be mindful to drink in smaller and more frequent amounts, rather than downing a bottle all in one when you’re gasping for a drink. <a href=\"https://www.bikeradar.com/advice/nutrition/what-is-a-sports-drink-and-when-should-you-use-one/\">Electrolytes</a> are usually recommended, especially if it’s hot or you know you’re a salty sweater.</p>\n<p>Start eating and drinking within the first 30 minutes, so you’re not playing catch-up in the latter part of the ride.</p>\n<h3>Don’t forget recovery</h3>\n<p>Finally, don’t forget <a href=\"https://www.bikeradar.com/advice/fitness-and-training/the-basics-of-recovery-explained/\">recovery</a> is a vitally important part of training. It’s the period of time when training adaptations actually occur, and without it, you can end up in a spiral of ever-decreasing performance, which ultimately can lead to <a href=\"https://www.bikeradar.com/advice/fitness-and-training/overtraining-syndrome/\">overtraining</a>.</p>\n<p>Try taking between two and three days per week to recover from your regular training (which can either be full days off from training or just a very light spin no longer than an hour).</p>\n<p>Most riders should also take a lighter ‘recovery week’ every four to eight weeks. How often you take this depends on your weekly training volume, how challenging you find this, and how much fatigue you accrue from non-training actvities, such as work and family life.</p>\n<h2>Targeting a gravel event</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Cycling: Garmin Unbound Gravel Race: View of cyclist in action, starting pack during race. Emporia, KS 6/5/2021 CREDIT: Nils Nilsen (Photo by Nils Nilsen/Sports Illustrated via Getty Images) (Set Number: X163645 TK1)\" title=\"Cycling: Garmin Unbound Gravel Race: View of cyclist in action, starting pack during race. Emporia, KS 6/5/2021 CREDIT: Nils Nilsen (Photo by Nils Nilsen/Sports Illustrated via Getty Images) (Set Number: X163645 TK1)\" /></div><div><figcaption><span><i></i> Having a specific event in mind can help focus your training.</span></figcaption><span> <i>\tNils Nilsen / Contributor</i></span></div>\n<p>Having talked in general terms about how to train for gravel riding, let’s look at how you might put together a plan geared towards a specific event.</p>\n<p>It can be helpful to break your plan into three phases: general preparation, specific preparation and a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-reducing-your-training-before-a-big-race-can-boost-your-performance/\">taper phase</a>, as outlined below.</p>\n<h3>General preparation</h3>\n<p>This phase should ideally last between 12 and 16 weeks, although if you’re short on time, you could cut it down to eight weeks.</p>\n<p>Through this period, the focus is mostly on building up your sustainable power, focusing on endurance rides, sustained low-cadence ‘tempo’ and leg strength sessions outlined above.</p>\n<p>Try gradually building up the length of your long rides through this phase, aiming to complete up to 80 to 90 per cent of your expected race length for shorter races (e.g. six hours or less) or 70 per cent of your expected race length for longer races.</p>\n<p>If you’re targeting a long race, it can be helpful to do very long training rides (e.g. longer than six hours every two weeks), rather than every week.</p>\n<p>This is frequent enough to keep your endurance progressing forward, while also allowing time for you to recover, and to focus on other aspects of your training.</p>\n<h3>Specific preparation</h3>\n<p>This phase can last between four and eight weeks, depending on how much time you have available.</p>\n<p>Through this phase, you will look to maintain or slightly reduce your normal riding volume, and long-ride duration, but make your training a little more high-intensity and race-specific.</p>\n<p>This is a good time to include supra-threshold intervals, race-pace skills sessions, and to add one or two breakthrough sessions, as described above.</p>\n<p>In order to get the right balance of intensity, recovery and low-intensity riding, you’ll usually want to significantly cut back on the low-cadence tempo intervals and decrease the frequency of your strength sessions to 1x per week.</p>\n<p>This is also a good time to test and finesse your <a href=\"https://www.bikeradar.com/advice/nutrition/get-your-nutrition-right-with-our-guide-to-pre-ride-during-and-post-ride-fuelling/\">race nutrition strategy</a> in training, and get used to riding with all the kit you’ll be carrying on race day, because this will affect how your bike feels and handles.</p>\n<h3>Taper</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Orbea Terra M21e Team 1X gravel bike\" title=\"Orbea Terra M21e Team 1X - 17\" /></div><div><figcaption><span><i></i> You should continue to ride in the run-up to an event, but dial back the intensity.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Finally, it’s time for the taper, which should last between 7 and 10 days, depending on the length of the event, and how quickly you as an individual find you recover (use a longer taper for longer events, or if you are slow to recover).</p>\n<p>Something of a golden rule with tapering – and something many cyclists get wrong – is that you should continue to ride quite frequently through the taper phase.</p>\n<p>If you usually ride five days per week, then continue to ride approximately five days per week while tapering. Otherwise, you can be left with legs that feel heavy.</p>\n<p>You’ll just need to make most of these rides nice and short, and very easy – no more than 60 per cent of FTP or around 60 per cent of maximum heart rate.</p>\n<p>In addition, you’ll want to include a bit of intensity in one to two sessions during your taper. This can help to keep your legs feeling activated, minimise fitness loss, and ‘prime’ your aerobic system ahead of your race.</p>\n<p>If the race is on a Sunday, for example, an ‘abbreviated’ interval session on Tuesday, and an openers session on Friday or Saturday, which includes some short, high-intensity surges, can work well.</p>\n<p>These shouldn’t be sessions that push you to your limits, but should leave you feeling you’ve done something reasonably challenging that got you breathing heavily.</p>","author":"Tom Bell","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"00b33ef3a9a32fba546d9ee9a9b86c4bdb36ca15cf8b0a92737303cf7b3903b2","category":"Cycling"}