{"title":"Delimiting species, revealing cryptic diversity in Molytinae (Coleoptera: Curculionidae) weevil through DNA barcoding","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae083/7796689?rss=1","date":1727654400000,"content":"<span><div>Abstract</div>The subfamily Molytinae (Coleoptera: Curculionidae), being the second largest group within the family Curculionidae, exhibits a diverse range of hosts and poses a serious threat to agricultural and forestry industries. We used 1,290 cytochrome c oxidase subunit I (COI) barcodes to assess the efficiency of COI barcodes in species differentiation and uncover cryptic species diversity within weevils of Molytinae. The average Kimura 2-parameter distances within species, genus, and subfamily were 2.90%, 11.0%, and 22.26%, respectively, indicating significant genetic differentiation at both levels. Moreover, there exists a considerable degree of overlap between intraspecific (0%–27.50%) and interspecific genetic distances (GDs; 0%–39.30%). The application of Automatic barcode gap discovery, Assemble Species by Automatic Partitioning, Barcode Index Number, Poisson Tree Processes (PTP), Bayesian Poisson Tree Processes (bPTP), and jMOTU resulted in the identification of 279, 275, 494, 322, 320, and 279 molecular operational taxonomic units, respectively. The integration of 6 methods successfully delimited species of Molytinae in 86.6% of all examined morphospecies, surpassing a threshold value of 3% GD (73.0%). A total of 28 morphospecies exhibiting significant intraspecific divergences were assigned to multiple MOTUs, respectively, suggesting the presence of cryptic diversity or population divergence. The identification of cryptic species within certain morphological species in this study necessitates further investigation through comprehensive taxonomic practices in the future.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"00b6fe2c5c23ecdf96df2550c9208263a9b03d5ebfe91657a636628ef17bb054","category":"Environment"}