{"title":"Molecular processes underlying the ROS‐induced changes in muscle hardness in grass carp: Insights from a dietary pro‐oxidant and oxidant approach","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16079?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>Reactive oxygen species (ROS) is known to increase muscle hardness, which has been of particular interest in food animals, but the detailed mechanism for the ROS-induced changes remains unclear. To explore the responsible molecular pathway, we conducted a detailed gene/protein expression analysis on the crisp grass carp model using four groups fed with different diets: control commercial feed (C group), a natural pro-oxidant faba bean (FB group) only, FB + antioxidants vitamins C and E (FB + AO group), and commercial feed + a pro-oxidant vitamin K3 (O group). Real-time PCR and parallel reaction monitoring, an emerging high-resolution mass spectrometry analysis, were employed. Our expression analysis highlighted two main effects of dietary pro-oxidants: endogenous ROS production and enhancement of muscle regeneration. The CGC and O groups generally increased the expression of genes/proteins related to ROS generation (e.g. mitochondrial proteins), caspase 3 (a candidate mediator of muscle regeneration) and muscle structural proteins such as tropomyosin and collagen. Most changes were not observed in the FB + AO group, indicating the causal role of ROS in the observed changes. These results explain part of molecular processes of ROS-induced improvement in muscle hardness in grass carp and would be useful for further application of dietary pro-oxidants to other species.</p>","author":"Ermeng Yu, \nLunjian Chen, \nGuangjun Wang, \nJun Xie, \nJingjing Tian, \nHongyan Li, \nYun Xia, \nKai Zhang, \nZhifei Li, \nWangbao Gong, \nGen Kaneko","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"00cee9fe5621a26fb8feb7c591bcd0cdecd97aa997c079cc11eb81f9bffc8c4d","category":"Environment"}