{"title":"Development and application of an inexpensive open-source dendrometer for detecting xylem water potential and radial stem growth at high spatial and temporal resolution","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae009/7615917?rss=1","date":1709078400000,"content":"<span><div>Abstract</div>There is currently a need for inexpensive, continuous, non-destructive water potential measurements at high temporal resolution (&lt;1 min). We describe here the development and testing of an entirely open-source dendrometer that, when combined with periodic Scholander pressure chamber measurements, provides sub-minute resolution estimates of water potential when placed on tissues exhibiting little or no secondary growth (petioles, monocotyledon stems). The dendrometer can also be used to measure radial growth of stems and branches when placed on dicotyledon and gymnosperm species. The dendrometer can be interfaced directly with a computer in real time in the lab or greenhouse, or connected to a datalogger for long periods of use in the field on batteries. We tested this device on a herbaceous dicotyledon (<span>Helianthus annuus</span>) (petioles and stems) and a monocotyledon (<span>Zea mays</span>) species (stems) for 1 week during dehydration and re-watering treatments under laboratory conditions. We also demonstrated the ability of the device to record branch and trunk diameter variation of a woody dicotyledon (<span>Rhus typhina</span>) in the field. Under laboratory conditions, we compared our device (hereafter ‘contact’ dendrometer) with modified versions of another open-source dendrometer (the ‘optical’ dendrometer). Overall, contact and optical dendrometers were well aligned with one another, with Pearson correlation coefficients ranging from 0.77 to 0.97. Both dendrometer devices were well aligned with direct measurements of xylem water potential, with calibration curves exhibiting significant non-linearity, especially at water potentials near the point of incipient plasmolysis, with pseudo <span>R</span><sup>2</sup> values (Efron) ranging from 0.89 to 0.99. Overall, both dendrometers were comparable and provided sufficient resolution to detect subtle differences in stem water potential (ca. 50 kPa) resulting from light-induced changes in transpiration, vapour pressure deficit and drying/wetting soils. All hardware designs, alternative configurations, software and build instructions for the contact dendrometers are provided.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"00d35aeadb3c4f1d846d7616115762f02885aa9f88a6af4b0f5870cf15001aa9","category":"Environment"}