{"title":"Deep Learning for Point-of-Care Ultrasound Image Quality Enhancement: A Review","link":"https://www.preprints.org/manuscript/202407.2600/v1","date":1722483518000,"content":"The popularity of handheld devices for point-of-care ultrasound (POCUS) has increased in recent years due to their portability and cost-effectiveness. However, POCUS has the drawback of lower imaging quality compared to conventional ultrasound, because of hardware limitations. Improving the quality of POCUS through post-image processing would therefore be beneficial, with deep learning approaches showing promise in this regard. This review investigates the state-of-the-art progress of image enhancement using deep learning suitable for POCUS applications. A systematic search was conducted from January 2024 to February 2024 on PubMed and Scopus. From the 457 articles that were found, the full text was retrieved for 69 articles. From this selection, 15 articles were identified addressing multiple quality enhancement aspects. A disparity in the baseline performance of the low-quality input images was seen across these studies, ranging between 8.65–29.24 dB for the Peak Signal-to-Noise Ratio (PSNR) and 0.03-0.71 for the Structural Similarity Index Measure (SSIM). In six studies, where both PSNR and the SSIM metrics were reported for the baseline and the generated images a mean difference of 6.60 (SD ± 2.99) and 0.28 (SD ± 0.15) was observed for the PSNR and SSIM, respectively. The reported performances demonstrate the potential of deep-learning-based image enhancement for POCUS. However, variability in the extent of performance gain across datasets and articles was notable, and the heterogeneity across articles makes quantifying the exact improvements challenging.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"00dddd2ccbd850fc35398e6d95c1173a3fa1b29715cf4b9f3b301072fa538141","category":"Interdisciplinary"}