{"title":"PSA: Make Sure to Update, iOS 16.6.1 and macOS 13.5.2 Address Actively Exploited Vulnerability","link":"https://www.macrumors.com/2023/09/07/ios-16-6-1-macos-13-5-2-active-vulnerabilities/","date":1694108384000,"content":"The macOS 13.5.2, iOS 16.6.1, iPadOS 16.6.1, and watchOS 9.6.2 updates that Apple released today includes fixes for security vulnerabilities that Apple says may have been actively exploited in the wild.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/macbook-air-purple.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nAccording to Apple's <a href=\"https://support.apple.com/en-us/HT201222\">security support page</a>, in iOS, iPadOS, and macOS, processing a maliciously crafted image could lead to arbitrary code execution, allowing a hacker to gain access to the operating system with a simple picture. Apple fixed the ImageIO process by addressing a buffer overflow issue to improve memory handling.\r<br />\n\r<br />\nIn iOS, iPadOS, and watchOS, a maliciously crafted attachment in the Wallet app could also lead to arbitrary code execution. Apple addressed the validation issue with improved logic.\r<br />\n\r<br />\nAs these updates include important security fixes, everyone should install iOS 16.6.1, iPadOS 16.6.1, macOS 13.5.2, and watchOS 9.6.2 as soon as possible. Apple recommends these software updates for all users.\r<br />\n\r<br />\n<b>Update</b>: As <a href=\"https://citizenlab.ca/2023/09/blastpass-nso-group-iphone-zero-click-zero-day-exploit-captured-in-the-wild/\">reported by Citizen Lab</a>, the vulnerabilities are part of a \"BLASTPASS\" exploit chain that was observed having been used in the wild to deliver NSO Group's Pegasus spyware. Pegasus is of critical concern to government officials, journalists, activists, and others with potentially sensitive information on their devices.\r<br />\n\r<br />\nThe zero-click vulnerability allowed attackers to send a maliciously crafted PassKit (Wallet) image to a target via iMessage, infecting their device \"without any interaction from the victim.\"\r<br />\n\r<br />\nThe attacks can be blocked by applying today's updates or by enabling Lockdown Mode on your device.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-16/\">iOS 16</a>, <a href=\"https://www.macrumors.com/roundup/ipados-16/\">iPadOS 16</a>, <a href=\"https://www.macrumors.com/roundup/macos-13/\">macOS Ventura</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-16.238\">iOS 16</a>, <a href=\"https://forums.macrumors.com/forums/macos-ventura.239\">macOS Ventura</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/07/ios-16-6-1-macos-13-5-2-active-vulnerabilities/\">PSA: Make Sure to Update, iOS 16.6.1 and macOS 13.5.2 Address Actively Exploited Vulnerability</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/psa-make-sure-to-update-ios-16-6-1-and-macos-13-5-2-address-actively-exploited-vulnerability.2400732/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"00e361dc27d3cdad469cc9d96499b5fbdd32f3aefcda13f7e41253fafb120f03","category":"Apple"}