{"title":"Driving across the American West in techno-excess with the BMW XM","link":"https://arstechnica.com/?p=1935214","date":1682769610000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/0425_bmw_xm-1-800x533.jpg\" alt=\"A BMW XM next to a very large Saguro cactus\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/0425_bmw_xm-1.jpg\">Enlarge</a> <span>/</span> Big power, big cactus, mostly big price tag. (credit: Roberto Baldwin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>I’m barreling down Interstate 10 in Arizona toward California in the BMW XM, the latest luxury performance SUV from the German automaker. A dagger of extravagance, the black-on-black SUV is all about <em>more</em>. But it's more than just a vehicle you stand next to while posing for social media shots; it's a bold expression from BMW that it can merge luxury with the latest technology.</p>\n<h2>The drive</h2>\n<p>With a starting price of $160,000, the BMW XM is actually quite a deal when you look at its closest competitor, the Lamborghini Urus. I've driven both over long distances, and the XM delivers on a long road trip while saving the person behind the wheel about $75,000—that's less than the price of the 2023 BMW i4 M50. So you get your showoff car and, well, another showoff car that's an electric vehicle.</p>\n<p>The XM is a plug-in hybrid, so you could spend most of your time behind the wheel in electric mode. It has an electric-only range of about 30 miles, so trips to Whole Foods and back could be far cleaner than what the Urus offers, as it's a gas-only proposition. But driving cross-country, I burned through the range within the first 30 minutes. Efficiency-wise, plug-in hybrids lose most of their appeal on a long road trip. I could have tried to find a level 2 charger along the way, but it would have been a waste of my time, and I would have been the jerk who's stopping someone with an EV from charging.</p></div><p><a href=\"https://arstechnica.com/?p=1935214#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1935214&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"00e69f88ab9596a771d24b0431dbf6ffeab862b8f9e25eb5518f5d56a7f7c329","category":"Tech"}