{"title":"Venmo gets more private—but it’s still not fully safe","link":"https://arstechnica.com/?p=1782606","date":1627210240000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/money-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/money.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Venmo, the popular mobile payment service, has redesigned its app. That's normally news you could safely ignore, but this announcement is worth a closer look. In addition to making some navigational tweaks and adding new purchase protections, the PayPal-owned platform is finally shutting down its global social feed, where the app published transactions from people around the world. It's an important step toward resolving one of the most prominent privacy issues in the world of apps, but the work isn't finished yet.</p>\n<p>Venmo’s global feed has for years been a font of voyeuristic insights into the financial habits of total strangers. The feed doesn't display amounts for a given transaction, but names and notes emoji and likes are included. Tapping on a name brings you to that user's profile, and an enterprising busybody (or worse) could pretty quickly build a small dossier of that person's friends, their hobbies, and anything else they’ve slipped into the stream—without, perhaps, realizing how public that info can be. In the time it took to write these paragraphs, relatives reimbursed each other for Phillies tickets, someone made a payment for “liquid gold <img src=\"https://s.w.org/images/core/emoji/11/72x72/1f60d.png\" />,” more than one set of roommates split their Internet bill.</p>\n<p></p></div><p><a href=\"https://arstechnica.com/?p=1782606#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1782606&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"00eafa8cce434e307c483691543ee6e175c97ad6678d28c051453e1b38aa544f","category":"Tech"}