{"title":"Supplementing a Bacillus-based direct-fed microbial improves feed efficiency in lactating dairy cows","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae110/7718447?rss=1","date":1721692800000,"content":"<span><div>Abstract</div>This experiment was conducted to evaluate the effects of feeding a <span>Bacillus</span>-based direct-fed microbial (<strong>DFM</strong>) on performance and nutrient digestibility of lactating dairy cows. Seventy-six lactating (42 ± 6 days in milk [<strong>DIM</strong>]) Holstein–Friesian primiparous and multiparous cows were enrolled to a 16-wk experiment. Cows were blocked by lactation number and DIM and within blocks, assigned to 1 of the 2 treatments: 1) basal partial-mixed ration (<strong>PMR</strong>) without DFM addition (<span>n</span> = 38; <strong>CON</strong>) or 2) basal PMR with the addition of 3 g/head/d of a DFM containing <span>B. licheniformis</span> 809 and <span>B. subtilis</span> 810 (<span>n</span> = 38; BOVACILLUS, Chr. Hansen A/S, Hørsholm, Denmark; <strong>DFM</strong>). The DFM was mixed in a protein-based pellet, whereas the CON group was fed the same pellet without DFM (0.6 kg/cow/d). The PMR contained (dry matter [<strong>DM</strong>] basis) 50% of forage and 48% of a concentrate feed based on corn meal, soybean meal, wheat meal, wheat middlings, and a mineral–vitamin premix, with the remaining part of the diet being represented by the pellet used as a carrier for the treatments (CON and DFM). Dry matter intake (<strong>DMI</strong>), milk yield, and production efficiency were recorded daily, whereas milk protein and fat concentrations were recorded using electronic milk meters. An additional milk sample was collected every second week of the study for milk composition. On week 15 of the study, fecal samples were collected from each cow for apparent nutrient digestibility calculation. All data were analyzed using the MIXED procedure of SAS (version 9.4; SAS Inst. Inc., Cary, NC). No treatment effects were observed on cow final body weight, daily <strong>DMI</strong>, milk yield, energy-corrected milk (<strong>ECM</strong>), ECM efficiency, milk composition (yield or content), and somatic cell count (<strong>SCC</strong>) (<span>P</span> ≥ 0.12). However, cows fed DFM had a greater feed and N efficiency (<span>P</span> ≤ 0.03) compared to cows fed CON. Moreover, DM digestibility tended to be greater for DFM-fed cows when compared to CON (<span>P</span> = 0.10), whereas no further nutrient digestibility differences were observed (<span>P</span> ≥ 0.24). In summary, supplementing a DFM containing <span>Bacillus licheniformis</span> and <span>B. subtilis</span> benefited feed efficiency of lactating dairy cows fed a PMR, while also tending to improve the digestibility of DM.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"00efb891556f25a26bf7f1981b07cc6484c771051be321299b4e6d63370940e3","category":"Environment"}