{"title":"Mark Zuckerberg พบประธานาธิบดีเกาหลีใต้ พูดคุยเรื่อง Fake News และความร่วมมือด้าน AI","link":"https://www.blognone.com/node/138482","date":1709258584000,"content":"<div><div><div><p>Mark Zuckerberg ซีอีโอ Meta ยังคงอยู่ในโปรแกรมเดินทางในเอเชีย โดยเมื่อวานนี้เขาได้เข้าพบหารือกับประธานาธิบดีเกาหลีใต้ Yoon Suk Yeol เป็นเวลา 30 นาที ที่สำนักประธานาธิบดี</p>\n<p>เนื้อหาการพูดคุยที่มีรายงานออกมานั้น ประธานาธิบดี Yoon ได้แสดงความกังวลเรื่องการจัดการข่าวปลอมบนโซเชียลมีเดีย และต้องการให้ Meta ทำหน้าที่ร่วมพัฒนาให้โลกดิจิทัลมีความน่าเชื่อถือ ซึ่ง Zuckerberg ก็ตอบว่า Meta ยังคงเดินหน้าจัดการปัญหานี้ตลอด โดยเฉพาะสำหรับการเลือกตั้งใหญ่ในหลายประเทศที่กำลังมาถึง ซึ่งเกาหลีใต้ก็จะจัดการเลือกตั้งทั่วไปในเดือนเมษายนนี้</p>\n<p>นอกจากนี้หัวข้อที่พูดคุยคือเรื่องการพัฒนาด้าน AI ซึ่งเกาหลีใต้เป็นฐานการผลิตชิปที่สำคัญแห่งหนึ่งของโลก ซึ่งประธานาธิบดี Yoon บอกว่าพร้อมร่วมมือกับ Meta ในความต้องการด้านชิป AI ที่จำเป็นสำหรับการพัฒนา</p>\n<p>Zuckerberg เดินทางมาเกาหลีใต้เป็นครั้งแรกในรอบ 10 ปี โดยได้พบกับพนักงานที่สำนักงาน Meta ในเกาหลีใต้, พูดคุยกับ<a href=\"https://www.blognone.com/node/138448\">ผู้บริหาร LG</a> และเขาก็ได้พบกับ Lee Jae-yong ประธานซัมซุง เพื่อหารือเรื่องการพัฒนา AI และ XR ร่วมกันอีกด้วย ส่วนโปรแกรมจากนี้เขาและภรรยา Priscilla Chan ได้เดินทางไปเมือง Jamnagar ประเทศอินเดีย เพื่อร่วมในพิธีแต่งงานของ Anant Ambani ลูกชายของ Mukesh Ambani มหาเศรษฐีประธานกลุ่มบริษัท Reliance ซึ่งมีรายชื่อผู้เข้าร่วมงานที่เปิดเผยเพิ่มเติมเช่น Bill Gates และศิลปิน Rihanna</p>\n<p>ที่มา: <a href=\"https://koreajoongangdaily.joins.com/news/2024-02-29/national/politics/Yoon-Zuckerberg-discuss-online-disinformation-AI-cooperation/1992195\">Korea JoongAng Daily</a> และ <a href=\"https://www.indiatoday.in/india/story/mark-zuckerberg-priscilla-chan-arrives-jamnagar-ahead-of-anant-ambanis-pre-wedding-bash-2508800-2024-02-29\">India Today</a> ภาพ <a href=\"https://www.president.go.kr/newsroom/photo_news/xarWwJ5k\">Office of the President, Republic of Korea</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c248784a9b7bd3da6e420cba4951a8f4.jpeg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/mark-zuckerberg\">Mark Zuckerberg</a></div><div><a href=\"/topics/south-korea\">South Korea</a></div><div><a href=\"/topics/meta\">Meta</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"00f13ae8571a16c728782acedeeb4bef0baebd13d5e8162aa5cc4fb3076a9bb8","category":"Thai"}