{"title":"Influence of an Alternative Diagnosis on the Diagnosis of Pulmonary Thromboembolism","link":"https://www.preprints.org/manuscript/202410.1256/v1","date":1729068457000,"content":"Background: The diagnosis of Pulmonary Embolism (PE) is based on the application of a priori probability scales such as the Wells scale or PERC criteria. However, the clinical heterogeneity of this pathology results in the absence of a target population to apply these algorithms. Moreover, these scales do not consider the possible influence of the presence of an objective alternative diagnosis to PE, complicating its clinical assessment and possibly leading to an increase in unnecessary testing or missed diagnoses.\nObjective: The aim of this study is to evaluate the discrimination capacity of clinical objective factors with a high negative predictive value for PE, compared to PERC in terms of reducing unnecessary testing across different risk strata of the Wells scale.\nMaterials and Methods: This was a single-center retrospective cohort study, including patients who underwent chest CT angiography to rule out PE at a University Hospital between 2008 and 2017, considering the presence of PE as the study outcome. The study collected demographic data, comorbidities, and clinical presentation data. The presence of objective criteria for pneumonia, heart failure, exacerbation of COPD, or the use of anticoagulation in non-oncological patients was considered a priori criteria with a high negative predictive value.\nResults: The analyses were performed on a cohort of 399 patients with an average age of 65 years and 53% females. A total of 139 patients were diagnosed with PE by CT angiography. The presence of factors with a high NPV showed a sensitivity and NPV of 100% in low-risk patients according to Wells, with sensitivity dropping below 50% in other populations. The association of these factors in the PERC plus criteria would allow a reduction of up to 34% in CT angiographies in patients with low risk according to the Wells scale.\nConclusions: The combination of risk stratification of the Wells scale and PERC plus criteria allows an absolute reduction of 34.3% in the performance of CT angiographies in patients classified as low risk with a sensitivity and a negative predictive value of 100%. The preexistence of an alternative diagnosis does not allow ruling out PE in patients with intermediate or high risk according to the Wells scale.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"00f8207a849f94c59ceb8660d20fdc37d048064402e3f838b605ea8e50f30177","category":"Interdisciplinary"}