{"title":"Review de Avast Security: ¿Es la protección antimalware que necesita tu Mac?","link":"https://www.macworld.com/article/2022093/review-avast-security.html","date":1691419323000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n<div><span>At a glance</span><h3>Expert's Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Buen rendimiento de detección de<em> malware</em> en Windows</li><li>Escáner de red</li></ul></div><div><h3>Cons</h3><ul><li>Instalación engorrosa</li><li>Las funciones adicionales con coste se anuncian con demasiada frecuencia</li></ul></div></div></div><h3>Our Verdict</h3><p>Avast Security es un antivirus de primera clase y de uso gratuito. Sin embargo, la abundante publicidad de servicios adicionales de pago resulta molesta, especialmente en la versión Avast One.</p>\n</div>\n\n\n<p>Los antivirus son controvertidos en Mac: siempre ha existido el debate de si un ordenador Mac o portátil MacBook necesita antivirus o no. Sin embargo, en los últimos años parece que el público se inclina hacia la opinión de que las funciones de protección de Apple no siempre son suficientes. Un buen escáner antivirus es especialmente recomendable para un Mac utilizado, sobre todo, con fines profesionales.</p>\n\n\n\n<p>El fabricante de <em>software </em>Avast ofrece dos antivirus gratuitos para Mac: <a href=\"https://www.jdoqocy.com/click-100470607-13637464?sid=1-1-2022093-1-0-0&amp;url=https://www.avast.com/index#mac\" target=\"_blank\">Avast Security</a> y <a href=\"https://www.jdoqocy.com/click-100470607-13637464?sid=1-1-2022093-1-0-0&amp;url=https://www.avast.com/avast-one#mac\" target=\"_blank\">Avast One Essential</a>. Si deseas “solo un antivirus”, te recomendamos la versión Avast Security.  La versión Avast One se basa en Avast Security, pero ofrece algunas funciones adicionales y una interfaz diferente – y molesta con publicidad intensiva para las funciones de pago, la verdad.</p>\n\n\n\n<p>No es el único <a href=\"https://www.macworld.com/article/1451392/mejores-antivirus-mac.html\">antivirus disponible para Mac,</a> sin embargo, en este artículo vamos a central en analizar su rendimiento y todas sus funciones para contarte si merece la pena o no. </p>\n\n\n\n<h2>Excelente detección de virus</h2>\n\n\n\n<p>En nuestra evaluación de un antivirus, la calidad de la detección de virus es crucial, y en este caso, le otorgamos una puntuación especialmente alta. Además de la protección contra los virus del Mac -que amenazan al propio Mac-, también se deben detectar los virus de Windows.</p>\n\n\n\n<p>A primera vista, esto parece secundario, pero especialmente en una red mixta Mac-PC, la detección de virus de PC es una función importante del escáner de Mac. El adware -esa herramienta que redirige el navegador a sitios publicitarios- también debería detectarse de forma fiable. Avast convence en este aspecto.</p>\n\n\n\n<p>Para la evaluación de la detección de virus de Avast, utilizamos los resultados de las pruebas de la organización AV-Test y AV-Comparatives – las dos organizaciones se consideran la mejor referencia y también son reconocidas por los fabricantes de<em> software </em>antivirus como pruebas sólidas.</p>\n\n\n\n<p>En una reciente prueba realizada por AV-Comparatives en junio, Avast se situó entre los mejores productos, detectando el 100 % del malware para Mac, el 99 % del <em>adware </em>y el 99 % de los virus para Windows. En la prueba actual, r<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.av-test.org/es/antivirus/usuarios-finales-macos/macos-monterey/septiembre-2022/avast-security-15.4-225301/&amp;xcust=1-1-2022093-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">ealizada por AV-Test en septiembre de 2022</a>, obtuvo unos resultados excelentes. Aquí también detectó el 100 por cien de los virus de Mac y el 99 por cien de los virus de Windows – de los siete sujetos de la prueba, sólo otros dos lo consiguieron y es sencillamente de primera clase.</p>\n\n\n\n<h2>Sin freno del sistema</h2>\n\n\n\n<p>Los escáneres antivirus pueden ralentizar un Mac porque el <em>software</em> de protección supervisa todas las acciones de los archivos, incluida la copia de archivos. Sin embargo, esto apenas se nota en la práctica, especialmente en un Mac con un SSD; la versión actual de Avast que probamos no tuvo ningún efecto sobre el rendimiento del sistema en nuestra prueba. En general, la herramienta ofrece una buena compatibilidad con macOS.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/01/Bildschirm%C2%ADfoto-2023-01-18-um-16.50.04.jpg?quality=50&amp;strip=all\" alt=\"Avast One\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/01/Bildschirm­foto-2023-01-18-um-16.50.04.jpg?quality=50&amp;strip=all 994w, https://b2c-contenthub.com/wp-content/uploads/2023/01/Bildschirm­foto-2023-01-18-um-16.50.04.jpg?resize=300%2C204&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/01/Bildschirm­foto-2023-01-18-um-16.50.04.jpg?resize=768%2C522&amp;quality=50&amp;strip=all 768w\" width=\"994\" height=\"675\" /><figcaption><p>La versión Avast One tiene una interfaz completamente diferente y ofrece una gama más amplia de funciones.</p>\n</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Instalación engorrosa</h2>\n\n\n\n<p>Por desgracia, un programa antivirus no se puede instalar en Ventura tan fácilmente como una aplicación de la Mac App Store. Instalar un antivirus es engorroso, pero eso no es culpa de Avast. Para poder comprobar los archivos, un antivirus debe instalar algunos programas en segundo plano y necesita acceso al sistema de archivos – ambos especialmente protegidos por Ventura y en los que el usuario debe estar activo.</p>\n\n\n\n<p>Durante la instalación, el usuario debe permitir la instalación de la extensión a través de la configuración del sistema “Seguridad y privacidad”; además, también debe permitir el acceso al disco duro y permitir el filtrado de contenidos de red.</p>\n\n\n\n<p>Para la desinstalación se necesita un programa de desinstalación especial, que se puede activar mediante el comando de la barra de menús “Eliminar Avast Security” o, en el caso de la otra versión, “Desinstalar Avast One”.</p>\n\n\n\n<h2>Gama de funciones</h2>\n\n\n\n<p>Inusual: Como en cualquier programa antivirus completo, un programa de protección comprueba cada acceso al disco duro; Avast llama a esta función protección de archivos. Además, Avast ofrece un módulo llamado Web Protection, que comprueba el acceso a la red y bloquea inmediatamente la descarga accidental de malware, por ejemplo. Sin embargo, es difícil comprobar si esto proporciona más seguridad.</p>\n\n\n\n<p>La versión One ofrece varias docenas de funciones más. Incluye opciones como protección contra ransomware, protección de la privacidad, recomienda limpiar el disco duro sin que se le pida y busca fugas de datos. Se hace mucha publicidad de un servicio VPN gratuito con un volumen de datos de 5 GB a la semana – sin embargo, sólo se puede seleccionar la ubicación en otro país por un cargo adicional.</p>\n\n\n\n<p>Este alto nivel de funcionalidad en realidad tiene un efecto positivo. Sin embargo, la vista general de tres columnas con todas las funciones listadas está muy desordenada, ya que además de las funciones disponibles, también se listan todas las funciones bloqueadas de las versiones de pago. Esto podría abrumar a algunos principiantes.</p>\n\n\n\n<p>Las advertencias exageradas sobre supuestas brechas de seguridad también son menos agradables: Por ejemplo, Avast One clasifica nuestra WLAN doméstica como insegura y recomienda el uso de VPN, una advertencia que aparece con todas las WLAN. VPN es más seguro que ninguna VPN, pero eso es engañoso y podría inquietar a los principiantes.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/01/Bildschirm%C2%ADfoto-2023-01-18-um-09.34.34.jpg?quality=50&amp;strip=all\" alt=\"Avast\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/01/Bildschirm­foto-2023-01-18-um-09.34.34.jpg?quality=50&amp;strip=all 392w, https://b2c-contenthub.com/wp-content/uploads/2023/01/Bildschirm­foto-2023-01-18-um-09.34.34.jpg?resize=275%2C300&amp;quality=50&amp;strip=all 275w\" width=\"392\" height=\"427\" /><figcaption><p>Desgraciadamente, Avast One exagera un poco con sus advertencias; esta red es completamente de confianza.</p>\n</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Nuestro veredicto: ¿lo recomendamos?</h2>\n\n\n\n<p>Avast es realmente un antivirus de primera clase y de uso gratuito. Sin embargo, no podemos recomendar la herramienta sin reservas. Además de la publicidad que resulta bastante molesta, también debemos mencionar algunos problemas de versiones anteriores. Por ejemplo, el antivirus de Avast tuvo algunos problemas de estabilidad bajo macOS en el pasado, algo que esperemos que ya no ocurra con la versión actual. </p>\n\n\n\n<p>Avast tampoco estuvo exento de críticas en lo que respecta al manejo de los datos de los usuarios; en 2020, se supo que los datos de los usuarios para el uso de VPN se vendían con fines de marketing. Esto y la publicidad intrusiva para funciones de pago le costaron por tanto a la app nuestra recomendación – a pesar de los buenos resultados de las pruebas.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macwelt.de/article/988900/10-antivirus-loesungen-fuer-macs-im-vergleich.html&amp;xcust=1-1-2022093-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\"> Puede encontrar</a> nuestra prueba comparativa detallada de los programas antivirus actuales para Mac<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macwelt.de/article/988900/10-antivirus-loesungen-fuer-macs-im-vergleich.html&amp;xcust=1-1-2022093-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\"> aquí</a></p>\n\nPersonal Software</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"00f8d5fe7a8281b6115492fe8eaceed3803e174d2040e9436abe0b109604d17b","category":"Apple"}