{"title":"Garmin Lily 2 In-Depth Review","link":"https://www.dcrainmaker.com/2024/01/garmin-lily-2-in-depth-review.html","date":1704747850000,"content":"<p><span>﻿</span></p>\n<p>Garmin has just announced the Lily 2 smartwatch, which continues to be aimed at being a minimalist fitness and health smartwatch that contains most of the behind-the-scenes wellness tracking features of the rest of Garmin’s watches, but without as many of the fancier sports or higher-end smartwatch features. All while concurrently aiming to look more like a fashion accessory than a generic smartwatch.</p>\n<p>The Lily 2 makes some relatively modest changes compared to the Lily 1 announced two years ago this January. To begin, they upgraded from a plastic case to a metal case, as well as ditching the proprietary band design for standard 14mm bands (much appreciated). They then added Garmin Pay, the company’s contactless payment system, while also increasing a bunch of sport modes, particularly around dance modes. Finally, they increased some of the sleep-tracking features. Oh, and the price got increased too, by about $50.</p>\n<p>Both myself and my wife have been testing the Lily 2 over the last little while, putting it through its paces in both day-to-day life, as well as sports and workouts. This review will cover all those areas and tons more, from both our perspectives. This unit is a media loaner, and once this review is complete, will go back to Garmin. As always, I don’t accept advertising from any company I review – so, if you found this review useful, consider becoming a <a href=\"https://www.dcrainmaker.com/support\">DCR Supporter</a>, which gets you an ad-free site, plus the behind-the-scenes video series between both myself (and my wife) on everything that happens in the DCR Sports Tech.</p>\n<h3><strong><u>What’s New &amp; Quick Overview:</u></strong></h3>\n<p><img title=\"DSC_0695.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0695.jpg\" width=\"720\" height=\"480\" /></p>\n<p>To begin, let’s just dive into what’s new on the Lily 2, as well as a short level-set on what’s actually in the Lily series, for those who aren’t familiar with this minimalist and style-focused watch. A Fenix this is not.</p>\n<p>Starting with the newness, here are the changes from Lily 1 to Lily 2:</p>\n<p>– Changed from plastic case to metal case<br />\n– Switched to standard 14mm band design (vs previous 14mm proprietary design)<br />\n– Adds Sleep Score and Sleep Details on watch widget<br />\n– Adds incident detection (e.g. bike crash) safety alerts<br />\n– Adds Garmin Pay (contactless payments)<br />\n– Also added new sport profiles: HIIT, Row Indoor, Walk Indoor, Meditation<br />\n– Adds Dance Fitness Feature, with Dance Types: Afrobeat, Bhangra, Bollywood, EDM, Hip Hop, Latin, Line Dancing, Pop &amp; Jazz, Video Game, Cardio<br />\n– Priced at  $249 for Lily 2 with a silicone band, $279 for Lily 2 Classic Nylon band, and $299 for Lily 2 Classic Leather (all of which is a $50 increase from Lily 1)</p>\n<p>And then, for those not familiar with the Lily series, here’s all the baseline bits:</p>\n<p>– 35mm case design (14mm band design)<br />\n– Smartwatch with 24×7 activity tracking for steps/distance/calories<br />\n– Optical HR sensor for 24×7 heart rate tracking (Garmin ELEVATE Gen 4)<br />\n– PulseOx sensor for sleeping SpO2 tracking<br />\n– Tracks respiration/breathing rate 24×7<br />\n– Tracks stress and sleep automatically<br />\n– Sports tracking including using Connected GPS (doesn’t have GPS internally)<br />\n– Sport tracking modes (full list below)<br />\n– Displays smartphone notifications, as well as details like calendar appointments and the weather<br />\n– Has live tracking, including safety and incident alerts<br />\n– Includes female health tracking for both menstrual cycles and pregnancy tracking<br />\n– Claimed battery life of up to five days (inclusive of smartphone notifications being enabled)<br />\n– Tracks your VO2Max based on workout data<br />\n– Does not include stair tracking (no barometric altimeter)<br />\n– Does not include connecting to ANT+ or Bluetooth Smart HR straps<br />\n– Does not include broadcasting of your HR via ANT+ or Bluetooth Smart to other apps/devices (such as a Peloton Bike)<br />\n– Does not include music storage/playback, but can control music on your phone</p>\n<p>Here’s all the sports profiles that are on the Lily 2:</p>\n<blockquote><p>Walk, Run, Treadmill, Cardio, Strength, Dance Fitness, Yoga, Breathwork, Bike, HIIT, Row Indoor, Stair Stepper, Elliptical, Walk Indoor, Meditation, Pilates, Pool Swim, Other.</p></blockquote>\n<p>Here’s a quick image of all the different models/colors/etc:</p>\n<p><img title=\"Lily2Series.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/01/Lily2Series.jpeg\" width=\"718\" height=\"251\" /></p>\n<p>Note that the editions only come with a single strap, thus the leather one doesn’t also come with a silicon strap or other strap to wear during sports/workouts.</p>\n<h3><span><strong>General Usage:</strong></span></h3>\n<p><img title=\"DSC_0696.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0696.jpg\" width=\"720\" height=\"480\" /></p>\n<p>This section is all about daily usage of the Lily 2, including bits like interacting with the device, health/fitness features it tracks outside of sports/workouts, and features like the new addition of Garmin Pay. Whereas in the next section, I’ll dive into all the sports modes.</p>\n<p>To begin, the Garmin Lily 2 features a touchscreen without any dedicated side buttons. All interactions come via the touchscreen in the form of swipes, or taps, including taps on a little dot at the bottom which acts as a button. It’s like a wanna-be button. As you tap the screen, you’ll get vibration/tactile feedback confirming each time.</p>\n<p>In general, the interface works fine for me, though my wife finds it a bit more frustrating than her Fenix device with actual buttons to press. That said, she did use the Lily 1 for more time and got used to it a bit more. One tip that I found in terms of making the user interface a bit better is increasing the display timeout from the default ‘Short’ to either Medium or Long. Else, the screen turns off really quick.</p>\n<p><img title=\"DSC_0698.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0698.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Speaking of which, by default, when your wrist isn’t raised, the screen is off. Meaning, it’s not an always-on display watch. Instead, the display only enumerates when you raise your wrist. And thankfully, the wrist raise detection seems significantly improved over the Lily 1 (or at least, the Lily 1 when I tested it upon launch). I’ve got no issues with the wrist raise detection here now in the default configuration (you can also increase sensitivity too). But that kinda matches Garmin as a whole, which has improved the gesture detection over the last few years.</p>\n<p>Here’s what it looks like when the display is powered off, which shows one of a few different patterns (depending on which model you bought). Here’s the pattern for this specific model:</p>\n<p><img title=\"DSC_0699.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0699.jpg\" width=\"720\" height=\"480\" /></p>\n<p>And if you reference the lineup of units from Garmin, you can see all the different background styles for each model. This isn’t changeable, because it’s the actual background of the watch, not a display. The display is instead illuminated under/through it.</p>\n<p>Now, as with the Lily 1, the display technology here from a visibility standpoint is great. Absolutely zero issues seeing it in direct sunlight, such as this:</p>\n<p><img title=\"IMG_2028.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_2028.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Nor any issues at night, like on this night run.</p>\n<p>And of course, no issues in all other times of the day. Everything there works perfectly, and is a big step-up over some of the other technologies that Garmin has used in some older stylish watches.</p>\n<p>With those display basics out of the way, you can select from a handful of different watch faces, which in turn have different metrics on them. And then, within that, on a given watch face you can tap on the data complications to cycle through other data metrics (e.g., heart rate, steps, calories, etc…).</p>\n<p><img title=\"DSC_0700.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0700.jpg\" width=\"720\" height=\"480\" /></p>\n<p>From there you can swipe left/right through the different widgets. Garmin doesn’t support Connect IQ widgets on the Lily 2, but does have a large number of other widgets you can enable/disable. These include heart rate pages, calendars, weather, hydration, female health tracking, Garmin’s Body Battery, steps, and more.</p>\n<p>You can then tap-open the widget page to get more details about any given one, such as this one showing your sleep metrics – which is new on the Lily 2. Previously you couldn’t see your sleep data on-watch. Now you can not only see the sleep data, but also see your Sleep Score.</p>\n<p><img title=\"DSC_0701.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0701.jpg\" width=\"720\" height=\"480\" /></p>\n<p>You can tap that open to get other data like sleep stages/phases/etc…</p>\n<p><img title=\"DSC_0702.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0702-2.jpg\" width=\"720\" height=\"480\" /></p>\n<p>From a sleep accuracy standpoint, we (mainly my wife wearing it) found that the sleep times were usually correct, but not always. For example, Saturday night it showed going to sleep at 22:53 (10:53PM), when in reality, that was close to 4AM, due to a movie marathon that got out of control. Albeit, the wake-up time of 10:43AM was correct. Win some, lose some. But otherwise for other days it was perfectly fine.</p>\n<p>From a sleep stages/phases standpoint, as I always say, I don’t see a ton of value in that data. Namely because most companies aren’t super accurate in it, and even so-called gold standard tests are somewhat iffy. Given Lily doesn’t have more advanced training status like Training Readiness or such, the impact of that is somewhat minimal here. It will leverage it for features like Sleep Score of course, but the sleep scores have roughly been aligned to how she felt each morning.</p>\n<p><img title=\"DSC_0703.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0703.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Respiration rate is tracked nightly, as well as SpO2, if you enable it. Note that enabling SpO2 (which Garmin calls PulseOx) will significantly impact the battery, thus I don’t tend to ever enable that unless you really really really have something specific you want from that data (and even then, it’ll probably be wrong anyway).</p>\n<p>All of this data is also available on Garmin Connect Mobile (the smartphone app), as well as Garmin Connect desktop (web app) too. For example, here’s the sleep data shown on Garmin Connect Mobile:</p>\n<p><img title=\"IMG_1600.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1600.png\" width=\"235\" height=\"509\" /> <img title=\"IMG_1599.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1599.png\" width=\"235\" height=\"509\" /></p>\n<p>And here’s the steps data shown, alongside the 24×7 heart rate data:</p>\n<p><img title=\"IMG_1602.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1602.png\" width=\"235\" height=\"509\" /> <img title=\"IMG_1603.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1603.png\" width=\"235\" height=\"509\" /></p>\n<p>In addition, Garmin has their Body Battery feature, which aims to figure out how much energy you have throughout the day. Think of it either as the name implies, your body’s battery, or kinda like an old Street Fighter arcade game, where you power back up again through things like sitting on the couch or sleeping. Poor sleep won’t get you as highly recharged as a good night’s sleep. And inversely, high stress throughout the day will impact you more highly. You can see this on the watch, or also on Garmin Connect later, including all the contributing factors highlighted:</p>\n<p><img title=\"IMG_1606.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1606.png\" width=\"235\" height=\"509\" /> <img title=\"IMG_1605.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1605.png\" width=\"235\" height=\"509\" /></p>\n<p>Speaking of sleeping one last time, the Lily 2 has a sleep mode so that when you go to sleep the watch face isn’t automatically turning on and illuminating. You can tweak which hours it automatically enables for within the settings. In order to access the time during the middle of the night, you’ll need to tap the little fake button at the bottom, else simply raising your wrist won’t do anything. It’s a nice touch, and matches what they do on all their other recent watches.</p>\n<p><img title=\"DSC_0705.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0705.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Next, is Garmin’s female health tracking, which allows you to track when your period starts and ends, as well as both physical (like discharge or bloating) and emotional symptoms (for example, moods). Some of these data points are trackable/loggable from the watch on the tracking widget, while others require entry via the phone app. Related, there’s also pregnancy tracking too. All the data is consolidated there however. As the data logged gets more detailed, you’ll get period and fertility reminders and predictions. My wife uses this feature, and finds it can pretty accurately predict her cycles within a day, despite having an irregular cycle. Note that the Garmin Lily 2 doesn’t have wrist temperature tracking, and even if it did, Garmin isn’t leveraging it today in women’s health tracking (they only recently <a href=\"https://www.dcrainmaker.com/2023/12/garmin-wrist-temperature.html\">added general wrist temp tracking to their higher-end watches</a>).</p>\n<p>In any case, on the Lily 2, here’s what it looks like on the watch widget:</p>\n<p><img title=\"DSC_0707.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0707-1.jpg\" width=\"235\" height=\"157\" /> <img title=\"DSC_0710.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0710.jpg\" width=\"235\" height=\"157\" /></p>\n<p>Plus a boatload more data options for logging within the Garmin Connect Mobile app:</p>\n<p><img title=\"IMG_1608.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1608.png\" width=\"235\" height=\"509\" /><img title=\"IMG_1609.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1609.png\" width=\"235\" height=\"509\" /><img title=\"IMG_1610.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1610.png\" width=\"235\" height=\"509\" /></p>\n<p>Next, there’s the new Garmin Pay option. Well, new to the Lily 2 anyway, it’s been around for years on other Garmin watches. You can load up your compatible credit cards to Garmin Pay, but you’ll want to check the <a href=\"https://www.garmin.com/en-US/garminpay/banks/\">list of supported banks first</a>. It’s got pretty good coverage in the US, but outside of that is hit or miss. It supports our US credit cards just fine, but doesn’t support our specific Dutch bank (but has virtually all the other ones in the Netherlands).</p>\n<p><img title=\"DSC_0711.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0711.jpg\" width=\"235\" height=\"157\" /><img title=\"DSC_0712.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0712.jpg\" width=\"235\" height=\"157\" /><img title=\"DSC_0713.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0713.jpg\" width=\"235\" height=\"157\" /></p>\n<p>Finally, let’s take a quick look at the band. Garmin went away from the previous proprietary design, to a more standard one here, which is much appreciated. This allows you to swap any 14mm watch band that you want onto the watch:</p>\n<p><img title=\"DSC_0715.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0715.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Meanwhile, in that same region you’ll find the charging port. It retains the same clip-style charging port as the previous Lily, though Garmin did swap out the charging end for USB-C (versus the previous USB-A):</p>\n<p><img title=\"DSC_0717.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0717.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Garmin maintains the same 5-day battery life, but of course that’ll vary based on what settings you used. Thus far, despite all the workouts and slightly higher (medium) gesture timeout, it seems on-track for about 4 days, which is fair enough given the higher battery demand.</p>\n<h3><span><strong>Sports Usage:</strong></span></h3>\n<p><img title=\"DSC_0721.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0721.jpg\" width=\"720\" height=\"480\" />If you’re looking for a powerhouse sports watch, the Lily 2 definitely isn’t it. But, if you’re looking at something with more sports functionality than most activity tracker bands, you’re probably in luck. The Lily series essentially tries to find that middle ground between the basic sports features of an activity tracker, and some ‘good enough’ features of a sports watch.</p>\n<p>Point being, if you’re planning on training for a running race (or primarily for sports), you’re far better off buying one of Garmin’s Forerunner watches (like the <a href=\"https://www.dcrainmaker.com/2019/04/garmin-forerunner-45-45s-gps-watch-in-depth-review.html\">Forerunner 45</a> or <a href=\"https://www.dcrainmaker.com/2021/06/garmin-forerunner-55-depth-review.html\">Forerunner 55</a>) for the money, or even a<a href=\"https://www.dcrainmaker.com/2022/06/garmin-forerunner-255-review-multisport.html\"> Forerunner 255</a>, which depending on sales floats in the same ballpark as the higher-end Lily 2 units.</p>\n<p>But of course, the goal of the Lily 2 isn’t just sports value, it’s designed to be more fashionable than those Forerunner units. So again, compromises are apparently to be made.</p>\n<p>With that background, the Lily 2 has two methods to track workouts:</p>\n<p><strong>A) Automatic tracking:</strong> The base of this is called Move IQ, and will automatically log activities like walking or running after they exceed a time threshold you’ve set in the app. So, for example, a 10-minute walk will trigger an entry in your Garmin Connect activity calendar. These activities though don’t have much detail, you won’t get pace charts or HR charts for example (or GPS maps). They also won’t upload to sites like Strava or MapMyFitness.</p>\n<p><strong>B) Manually started workouts:</strong> These are workouts where you’ve manually hit the start button after selecting a sport. For these, you’ll get full activity data including heart rate, GPS tracking with a phone, and a complete workout file that uploads to 3rd party sites.</p>\n<p>For the first one, automatic tracking, you can configure the thresholds for the two activities it supports – walk and run – using Garmin Connect Mobile. Interestingly, it doesn’t support detection for activities like cycling, as higher-end Garmin watches do.</p>\n<p><img title=\"IMG_1619.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1619.png\" width=\"235\" height=\"509\" /> <img title=\"IMG_1620.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1620.png\" width=\"235\" height=\"509\" /></p>\n<p>If you look at your calendar afterwards, you’ll see these activities as grey, and you can tap on them to get some very minor details. Fear not though, they will count towards your steps for the day.</p>\n<p>However, for ‘real’ sports tracking, you’ll want to tap that little button at the bottom, and then select ‘Activities’. This is where you can select from a growing list of sports, and even do some light customization of those sports:</p>\n<p><img title=\"DSC_0723.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0723.jpg\" width=\"720\" height=\"480\" /></p>\n<p>To customize this list, you’ll crack open the Garmin Connect Mobile app, and then you can choose which activities to be included. This list has been increased from the Lily 2 slightly:</p>\n<p><img title=\"IMG_1613.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1613.png\" width=\"235\" height=\"509\" /><img title=\"IMG_1614.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1614.png\" width=\"235\" height=\"509\" /></p>\n<p>If you choose a given sport profile, you can customize a handful of things. Starting with data pages, you can have two custom data pages, plus some toggled on/off data pages like a heart rate gauge, music screen (your phone’s music), and clock:</p>\n<p><img title=\"IMG_1615.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1615.png\" width=\"235\" height=\"509\" /><img title=\"IMG_1616.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1616.png\" width=\"235\" height=\"509\" /><img title=\"IMG_1617.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1617.png\" width=\"235\" height=\"509\" /></p>\n<p>And depending on which sport you’ve selected, you can also configure alerts for time, calories, distance, and heart rate. Note that distance obviously wouldn’t show for a sport like Yoga.</p>\n<p><img title=\"IMG_1622.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1622.png\" width=\"235\" height=\"509\" /></p>\n<p>In any event, after tapping the ‘Activities’ option on the watch, you’ll then choose which sport mode you want:</p>\n<p><img title=\"DSC_0723.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0723-1.jpg\" width=\"720\" height=\"480\" /></p>\n<p>By default, if you were to select the ‘Run’ profile, it’s going to chat with your phone and start to leverage your phone’s GPS. You’ll see a notice on the watch while it does this, but usually it only takes a second or two. This whole process seems much improved over the Lily 1 when I tested that, where it didn’t work half the time. Every single time I went to track, it found it. I even did it for fun at random times when I wasn’t planning on doing a workout, just to see if it’d connect properly.</p>\n<p><img title=\"DSC_0724.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0724.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Once connected you’ll see a little ‘GPS’ indicated on the screen:</p>\n<p><img title=\"IMG_2028.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_2028-1.jpg\" width=\"720\" height=\"480\" /></p>\n<p>You’ll also see settings, where you can set up a basic interval counter too, as well as alerts if you didn’t do it earlier:</p>\n<p><img title=\"DSC_0726.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0726.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Once ready, tap to start, then you’ll see your configured data pages/fields on the screen. You can iterate through the different data pages you’ve set up. As noted, I had no problems seeing the data either in sunny or dark conditions.</p>\n<p><img title=\"DSC_0728.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0728.jpg\" width=\"235\" height=\"157\" /> <img title=\"DSC_0730.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0730.jpg\" width=\"235\" height=\"157\" /><img title=\"DSC_0731.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0731.jpg\" width=\"235\" height=\"157\" /></p>\n<p>I also didn’t have any issues this time with my coat accidentally triggering the touchscreen, like I did on the Lily 1. Previously, on that watch, my coat (because it’s winter) would constantly trip/tap the screen, causing the timer to pause mid-workout, which was super frustrating. That didn’t happen for either me or my wife on her runs – so that’s great.</p>\n<p>The Lily 2 does support Garmin’s Live Tracking feature, which means that you can set up automatic tracking links of your workouts to be sent to friends/family. So the second you start a workout, if your phone is in range, it’ll send them a link so they can follow along. Both my wife and I have this setup for all our workouts, and it works great – and is an easy way to ensure we both know where we are in case something happens.</p>\n<p><img title=\"IMG_1624.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1624.png\" width=\"235\" height=\"509\" /><img title=\"IMG_1625.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1625.png\" width=\"235\" height=\"509\" /></p>\n<p>In a similar vein, the watch also will automatically trigger incident detection notices to friends/family if you fall while in a workout. Once you do fall, you’ll have about 10 seconds to cancel the notification if there’s no reason to notify your roommate or partner that you just face-planted into a puddle.</p>\n<p>In any case, all that aside, once your workout is complete you’ll get a quick confirmation page showing some summary details of the workout:</p>\n<p><img title=\"IMG_2364.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_2364.jpg\" width=\"720\" height=\"480\" /></p>\n<p>However, the bulk of the data is up on Garmin Connect, and can be accessed via the smartphone app, or the website. For example, here’s a run I did last night, where I had the phone connected for GPS, showing the GPS track:</p>\n<p><img title=\"IMG_1626.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1626.png\" width=\"170\" height=\"368\" /><img title=\"IMG_1627.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1627.png\" width=\"170\" height=\"368\" /><img title=\"IMG_1630.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1630.png\" width=\"170\" height=\"368\" /><img title=\"IMG_1632.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1632.png\" width=\"170\" height=\"368\" /></p>\n<p>And then, if you’ve got Strava or other platforms connected up, your workouts will end up there as well within a few seconds of it being sent to your phone.</p>\n<p>In addition, you’ll get updates to your VO2Max shown on the watch (and in the app), that you can monitor over time:</p>\n<p><img title=\"DSC_0733.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0733.jpg\" width=\"720\" height=\"480\" /></p>\n<p>One feature I don’t possess the required capabilities to test is the new Dance Fitness feature, which is a first on any Garmin device. This feature lets you track different types of dance as an activity profile. First, you’ll select the sport profile:</p>\n<p><img title=\"DSC_0734.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0734.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Then you’ll select the specific dance style that you’re going to attempt:</p>\n<p><img title=\"DSC_0739.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0739.jpg\" width=\"720\" height=\"480\" /></p>\n<p>In addition, you can toggle whether or not to ‘Mark songs’ within the dance, which basically just sets a marker in the file which shows up in Garmin Connect saying ‘Song 1’ at X timestamp (e.g., Song 1 at 2:35) and the average HR for that section:</p>\n<p><img title=\"IMG_1637.PNG\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_1637.png\" width=\"222\" height=\"480\" /></p>\n<p>However, it doesn’t pull from any of the song data that Garmin has on the Music Control widget. So even when I was playing the best Miley Cyrus I had, it still just wrote “Song 1”, instead of Wrecking Ball. Shame.</p>\n<p>Maybe I’m just a bit Jaded, but when I Used To Be Young, Garmin Connect actually showed the song titles for a workout within the activity, now I’m basically just On My Own to figure it out and Do My Thang. Hopefully they’ll Get It Right down the River.</p>\n<h3><span><strong>Heart Rate &amp; GPS Accuracy:</strong></span></h3>\n<p><img title=\"DSC_0740.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0740.jpg\" width=\"720\" height=\"480\" /></p>\n<p>This section will mostly focus on heart rate accuracy, but I’ll briefly include GPS accuracy. You see, the Lily 2 doesn’t have GPS inside of it, instead it leverages your phone’s GPS for that. Thus, the accuracy here is mostly that of your phone. However, I always include a quick check of GPS accuracy in ‘Connected GPS’ devices, because there’s also a big factor of how well Garmin/Fitbit/etc handle that connectivity. I’ve seen countless cases where the GPS plots will be horrific (when we know that the iPhone’s GPS is more than good enough for this).</p>\n<p>For all these charts I’m comparing multiple devices worn on the same workout, specifically looking at more than just averages, but the ups and downs of heart rate accuracy throughout a workout. All devices are worn fully separated, so no two devices are on the same wrist at the same time (which can cause accuracy issues). Some devices are chest straps or upper arm bands.</p>\n<p>To begin, we’ll take a quick look at the ‘Connected GPS’ accuracy on a run last night. This was a simple 5KM run, but it did go through some tunnels/overpasses, as well as past some massive business district buildings. I had to ‘rescue’ one of our commuter bikes that had broken down across town a few days prior and was locked up in a rack. The Lily 2 was connected to an iPhone 13 Pro for GPS (roughly 2-year old phone).</p>\n<p>Here’s that compared to a Garmin Tactix 7 AMOLED watch and a Garmin Forerunner 965 watch (<a href=\"https://analyze.dcrainmaker.com/#/public/a272cf34-64cd-4e54-7287-fb20292e0a04\">data set here</a>):</p>\n<p><img title=\"Lily2-OutsideGPS1.png\" src=\"https://media.dcrainmaker.com/images/2024/01/Lily2-OutsideGPS1.png\" width=\"719\" height=\"382\" /></p>\n<p>As you can see above, there’s no obvious issues at a high level.However, once you zoom in a bit more, you can see a bit of wobble. In this case, my phone was in my running shorts pocket, which isn’t ideal placement. Certainly an arm band phone case would solve for that, but almost nobody likes wearing those.</p>\n<p><img title=\"Lily2-OutsideRunGPS2.png\" src=\"https://media.dcrainmaker.com/images/2024/01/Lily2-OutsideRunGPS2.png\" width=\"720\" height=\"382\" /></p>\n<p>So, let’s switch over to some heart rate data then. First up, we’ve got an indoor treadmill workout. This one my wife did, compared to the also-new Garmin HRM-FIT chest strap, Polar Verity Sense (armband), as well as her Fenix 7S Pro. As you can see, it was very close here, with only a minor wobble about 3 minutes in briefly.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2024/01/Lily2-TreadmillRun-Bobbie5KM-720x326.png\" width=\"720\" height=\"326\" srcset=\"https://media.dcrainmaker.com/images/2024/01/Lily2-TreadmillRun-Bobbie5KM-720x326.png 720w, https://media.dcrainmaker.com/images/2024/01/Lily2-TreadmillRun-Bobbie5KM-200x91.png 200w, https://media.dcrainmaker.com/images/2024/01/Lily2-TreadmillRun-Bobbie5KM-1536x696.png 1536w, https://media.dcrainmaker.com/images/2024/01/Lily2-TreadmillRun-Bobbie5KM-2048x929.png 2048w, https://media.dcrainmaker.com/images/2024/01/Lily2-TreadmillRun-Bobbie5KM-125x57.png 125w\" /></p>\n<p>Next, another indoor workout, this one an indoor Peloton workout I did, including some rather painful intervals in it. This too, was mostly good compared to the Garmin HRM-PRO Plus chest strap, the Tactix 7 AMOLED, and the Apple Watch Ultra 2:</p>\n<p><img title=\"Lily-Accuracy-PelotonRide.png\" src=\"https://media.dcrainmaker.com/images/2024/01/Lily-Accuracy-PelotonRide.png\" width=\"718\" height=\"303\" /></p>\n<p>However, you can see a couple of blips once I got past the warm-up, once at around the 10-minute marker, and again around the 23-minute marker. I’m not clear why for either.</p>\n<p>Next, we’ll start sliding things outdoors. First up is that night run I mentioned earlier. Here’s a look at that data compared to the chest strap (HRM-PRO Plus), and Garmin Tacitx 7 AMOLED:</p>\n<p><img title=\"Lily-OutsideRun.png\" src=\"https://media.dcrainmaker.com/images/2024/01/Lily-OutsideRun.png\" width=\"720\" height=\"287\" /></p>\n<p>Ironically, the Lily 2 did better than the $1,400 Garmin Tactix 7 AMOLED watch, however, the reasons make sense. The default strap on the Tacitx 7 AMOLED isn’t great for optical HR sensor accuracy, as it’s a bit stiffer, and thus is more prone to having a looser fit (I can’t get it as tight as I’d like to). Thus, it jostles around a bit, and given the cold temps this night, struggled some. The Lily 2 was perfectly fine though (and it’s actually the HRM-PRO Plus at the beginning there that was wrong, I added more moisture at the 2-minute marker, and it snapped into place).</p>\n<p>Next, we’ve got one of my wife’s outdoor runs, this one actually started off well for the Garmin Lily 2, whereas the HRM-FIT chest strap had some struggles with the cold dry air. She also had the Polar Verity Sense (arm band), and her Fenix 7S Pro with her:</p>\n<p><img title=\"HRM-FIT-BobbieOutsieRunWarmer.png\" src=\"https://media.dcrainmaker.com/images/2024/01/HRM-FIT-BobbieOutsieRunWarmer-1.png\" width=\"719\" height=\"317\" /></p>\n<p>A great example of where sometimes optical HR sensors can do better than chest straps, even with moisture as she had applied beforehand. Now, later in the short high-intensity intervals you see that it did have a few wobbles in there, missing the 2nd interval entirely, and half of the 3rd. Though it did good-enough on #1/4/5, as well as the rest of the run.</p>\n<p>In any case, overall the Lily 2 saw reasonably good optical HR performance across a variety of scenarios, but did struggle occasionally in very high-intensity situations in colder temps, as well as briefly in one indoor workout.</p>\n<p><em>(Note: All of the charts in these accuracy portions were created using the DCR Analyzer tool. It allows you to compare power meters/trainers, heart rate, cadence, speed/pace, GPS tracks, and plenty more. You can use it as well for your own gadget comparisons, <a href=\"http://www.dcrainmaker.com/analyzer\">more details here</a>.)</em></p>\n<h3><span><strong>Wrap-Up:</strong></span></h3>\n<p><img title=\"DSC_0745.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/DSC_0745.jpg\" width=\"720\" height=\"480\" /></p>\n<p>The Garmin Lily 2 takes seemingly all of the criticisms I had about the Lily 1 and fixes it, which…well…is kinda nice. Gone is the proprietary band, gone are the issues I had with gesture wake, and gone are the constant auto-pauses with my coat during workouts. Inversely, in comes more new features including a number of sports profiles, Garmin Pay, and proper enumeration of sleep data on the watch itself.</p>\n<p>I’m sure some of these probably could have been rolled out to Lily 1 owners via software updates, but, as is often the case with Garmin, we don’t see major updates to their lifestyle watches. It’s just one of those things you’ve got to come to accept. Garmin did have many software updates for the Lily 1 over the last two years, but most were focused on optimizations rather than new features.</p>\n<p>Still, this seems like a very solid option for folks who don’t want the looks (or perhaps software bloat) of some of Garmin’s more premium smartwatches, and instead just want something that quietly tracks all the metrics behind the scenes, without all the fuss. In other words, it’s a perfectly nice iteration on the Lily 1. About the only thing I wish Garmin had incorporated is their newer ELEVATE V5 optical heart rate sensor, mainly because that would have added wrist temperature tracking, which in turn I strongly suspect Garmin will start leveraging for period prediction (like a number of their competitors). That would have future-proofed this watch a bit more.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"00f93dd3d38f9ea88bd1e5fd61360572eb52365a541f2c09fac1544de3d87d17","category":"Cycling"}