{"title":"Falling For Fall – john watson & kyle klain","link":"https://theradavist.com/2021/10/falling-for-fall/?utm_source=rss&utm_medium=rss&utm_campaign=falling-for-fall","date":1633195521000,"content":"<p>Season changes mark a time for renewal, not only for the forest but for ourselves. Just when the long days and heat start to get to you, the temperature drops and a cool breath blows across the dry landscape. Here in Northern New Mexico, the skies change from a blue expanse with puff-ball clouds to gargantuan storms enveloping our peaks; the terminus of the great Rocky Mountains. Each morning our mountains have a cloud toupée and upon their dissipation, reveal a dusting of white snow.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/FallWinsorShuttle-15.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>This usually triggers the desire to leave the confines of the house and pedal away as the aroma of piñon fireplace fires fills the air. It’s been a tepid time for Santa Feans who are back in the throes of mask mandates, spiking Covid numbers, and once again, overworked service industry employees. Living in a tourist destination – one established with the Camino Real – wayward travelers bring their emotional baggage to this place. Tempers fly like cottonwood bloom and in this Adobe Disneyland, there’s tension so thick you could slice it with a butter knife. This energy gets absorbed whether we like it or not in the form of speeding cars, grouchy hikers, and burnt-out friends. We all need relief and the fall is just that time for us. It’s the downtime between summer and the holidays. Our month-long chance to enjoy our city with each other.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/FallWinsorShuttle-19.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>My good friend Kyle Klain and I used to go on photography rides all the time. We’ve always got a camera on us and it’s fun to work off each other’s eyes and energy. Yet, the business of life has gotten in the way this summer. Kyle manages a real estate office in town, so he’s been spending his days putting out fires and managing a stressed workforce. I’ve been putting out my own fires and have had little free time to ride or do anything that doesn’t involve tapping a keyboard.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/FallWinsorShuttle-3.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Such is the fast pace life of owning a media company in the throes of dealing with parts and supply shortages. The mining of content is constant as my energy depletes, in need of a recharge.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/J9.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We used to spend the seasons on the road, traveling all over making our own content, and over the past few years, we’ve had to look to our friends in the community and showcase their own micro-adventures. Now our backyard becomes the backdrop for Reportage as well and the Sangre de Cristo range is often the setting.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/FallWinsorShuttle-4.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/10/FallWinsorShuttle-10.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/10/FallWinsorShuttle-14.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>On Friday, I closed my laptop and pedaled over to a bus stop, <a href=\"https://theradavist.com/2019/07/taking-the-5-blue-bus-shuttle-in-santa-fe/\" target=\"_blank\">where a city bus took Kyle and myself up to the Santa Fe Ski Basin</a>, where the temperature was a chilling 35º and a fresh cloak of snow so delicately draped atop the Ponderosa and Spruce trees. Our beloved Aspen trees are still holding onto their green leaves. Over the past few years, they’ve withstood drought and an onslaught of caterpillar attacks. This year, we had a moderate monsoon season and the Aspen had their fill of water. It feels like their resistance to the change in temperatures is akin to our own weary resilience to the pandemic.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/FallWinsorShuttle-6.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/10/FallWinsorShuttle-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>As soon as our tires hit the dirt, we had to battle the craving to let off the brakes and just bomb back down to our homes but every corner revealed a new moment in time worth capturing. Steel full suspensions, big tires, and warm gloves became the vessels of our emergence and yes, all this is just a fancy way of saying we had a good time reconnecting with our passion of photography.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/FallWinsorShuttle-9.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Once the leaf change happens, we’ll be back with wide-angle primes and full-frame sensors to pay our respects to the mighty Aspen stands.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/J7.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Til’ then, we find meaning and respice in these damp and cool afternoons…</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"00fc3cb9858cfa4234bed5487e36ee0ae5207a8ad89d30c45cfaf9e56fe6ff0c","category":"Cycling"}