{"title":"Preoperative dual-energy computed tomography and positron-emission tomography evaluation of lymph node metastasis in esophageal squamous cell carcinoma","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309653","date":1726840800000,"content":"<p>by Xuyang Sun, Tetsu Niwa, Toshiki Kazama, Takashi Okazaki, Kazuo Koyanagi, Nobue Kumaki, Jun Hashimoto, Soji Ozawa</p>\r\nPurpose <p>To investigate the detectability of lymph node metastasis in patients with esophageal squamous cell carcinoma using a combination of dual-energy computed tomography (CT) and positron-emission tomography (PET) parameters.</p> Methods <p>We analyzed dual-energy CT and PET preoperative data in 27 consecutive patients with esophageal squamous cell carcinoma (23 men, 4 women; mean age, 73.7 years). We selected lymph nodes with a short-axis diameter of ≥5 mm and measured CT values, iodine concentrations, fat fractions, long- and short-axis diameters, and ratio of long- and short-axis diameters. We performed visual assessment of lymph node characteristics based on dual-energy CT and determined the maximum standardized uptake value via PET. The measured values were postoperatively compared between pathologically confirmed metastatic and nonmetastatic lymph nodes. Stepwise logistic regression analysis was performed to determine factors associated with lymph node metastasis. Diagnostic accuracy was assessed via receiver operating characteristic curve analysis.</p> Results <p>Overall, 18 metastatic and 37 nonmetastatic lymph nodes were detected. CT values, iodine concentrations, fat fractions, and the maximum standardized uptake values differed significantly between metastatic and nonmetastatic lymph nodes (<i>p</i> &lt; 0.05). Stepwise logistic regression showed that iodine concentration and the maximum standardized uptake value were significant predictors of metastatic lymph nodes. The areas under the curve of iodine concentrations and maximum standardized uptake values were 0.809 and 0.833, respectively. The area under the curve of the combined parameters was 0.884, with 83.3% sensitivity and 86.5% specificity.</p> Conclusion <p>Combined dual-energy CT and PET parameters improved the diagnosis of lymph node metastasis in patients with esophageal cancer.</p>","author":"Xuyang Sun","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"00fe41fdf0e349ce22a7b67f947e39289bacf46eede963f2c1f521f7c6369172","category":"Interdisciplinary"}