{"title":"Engineered virus and goggles restore object recognition in a blind man","link":"https://arstechnica.com/?p=1768443","date":1622219202000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Screen-Shot-2021-05-28-at-11.42.49-AM-800x667.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Screen-Shot-2021-05-28-at-11.42.49-AM.png\">Enlarge</a> <span>/</span> The goggles in use. The red cap isn't part of the system; it holds electrodes that are tracking the participant's brain activity. (credit: <a href=\"https://www.nature.com/articles/s41591-021-01351-4/figures/1\">Sahel et. al.</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Our nerves' electrical impulses are created by a class of proteins called ion channels, which let ions flow into and out of cells. But controlling the flow of ions has uses that go well beyond creating nerve impulses, and there are many other channels made by cells—and even some made by bacteria and other organisms that don't have nerves.</p>\n<p>Scientists have discovered channels that only allow ions to flow after being triggered by light of specific wavelengths. When placed back into nerve cells, the channels turned out to be useful, as they allowed researchers to activate nerves using nothing but light. This discovery created an entire field of research—optogenetics—which has demonstrated that even complicated behaviors <a href=\"https://arstechnica.com/science/2021/05/researchers-force-two-mice-to-hang-out-and-induce-fomo-in-a-third/\">like socializing</a> can be controlled with light.</p>\n<p>But light-activated nerve activity is also part of normal biology, in the form of our eyes. The development of channels as a research tool has raised the prospect of using them to treat failing vision. In an important proof of concept, researchers have now used a light-sensitive channel and some specialized goggles to allow someone who is otherwise blind to locate objects.</p></div><p><a href=\"https://arstechnica.com/?p=1768443#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1768443&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0123a89a34b443d272117d06290b140428901b6759b7d1de0ea108d81dc3e4a6","category":"Tech"}