{"title":"Photo‐identification and satellite telemetry connect southern right whales from South Georgia Island (Islas Georgias del Sur) with multiple feeding and calving grounds in the southwest Atlantic","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13089?af=R","date":1712234898000,"content":"<h2>Abstract</h2>\n<p>The sub-Antarctic waters of South Georgia Island (Islas Georgias del Sur, SG/IG) are a regularly visited feeding ground for southern right whales (<i>Eubalaena australis</i>, SRW) in the southwest Atlantic. Satellite telemetry and photo-identification records were compared to better understand the role of SG/IG in the SRW migratory network. We present the first insights from SRW satellite-tracked from the SG/IG feeding ground, habitat use patterns in the Scotia Arc, and movements to Antarctic habitats. Photo-identification comparisons to calving and feeding areas across the South Atlantic and a review of sightings of cetaceans reported from Bird Island (west of SG/IG) since 1979 illuminate long-term habitat use patterns in SG/IG. We present the first recorded migratory movement between SG/IG and multiple countries: Argentina, Uruguay, and Brazil. Photo-identification (1) linked SG/IG to a female SRW with a long-term sighting history in Brazil, and (2) provided the first match between SG/IG and the western Antarctic Peninsula, suggesting the latter could extend the feeding area for southwest Atlantic SRW. Satellite tracking and opportunistic sightings suggest that shelf and coastal waters west of SG/IG represent an important multi-season SRW feeding habitat and add to our overall understanding of habitats and ranges occupied by recovering southwest Atlantic SRW.</p>","author":"Amy S. Kennedy, \nEmma L. Carroll, \nAlexandre N. Zerbini, \nC. Scott Baker, \nManuela Bassoi, \nNazarena A. Beretta, \nDanielle L. Buss, \nSusannah Calderan, \nTed Cheeseman, \nMartin A. Collins, \nPaula Costa‐Urrutia, \nPaul Ensor, \nKarina Groch, \nRussell Leaper, \nPaula Olson, \nCecilia Passadore, \nFederico G. Riet‐Sapriza, \nEls Vermeulen, \nFlorencia Vilches, \nAndrew G. Wood, \nJennifer A. Jackson","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"01235ad6ff64f8be6e219678acfe728dd3fadf18c209c9f5ab7f9f0e3e188baf","category":"Environment"}