{"title":"Negative association of sea lice from fish farms on recreational fishing catches of Atlantic salmon","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14712?af=R","date":1719493503000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/94affb38-6a91-4bb1-84b4-a4d6a38203ce/jpe14712-toc-0001-m.png\" alt=\"Negative association of sea lice from fish farms on recreational fishing catches of Atlantic salmon\" />\n<p>Our study expands the existing body of evidence demonstrating a negative association between fish farming and the ecosystem services provided by wild salmon stocks. It has important implications for aquaculture management. First, it shows that farm sea lice directly affect peoples, rights holders and interest groups, such as landowners and anglers, who rely on viable populations of wild salmon. Second, it suggests that a &gt;0.1 sea lice limit may be insufficient to prevent subpar catches in some areas. Furthermore, in the context of allowing further growth in farmed salmon biomass, setting absolute sea-louse limits for entire production areas may be a more effective regulatory instrument than setting average lice limits per farmed fish. Our findings contribute to advancing a scientific basis for setting appropriate louse limits on farm and area scales. Photo: Gjert-Are Valberg.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe question of whether and to what extent sea-louse (<i>Lepeophtheirus salmonis</i>) infestations from salmon farms influence wild Atlantic salmon survival has been subject to sustained scientific debate and political controversy. Documenting population-level effects of sea lice on wild salmon remains inherently challenging.\n\nWe employ comprehensive sea-lice data and recreational catch data from Norway to assess the impact of farm sea-louse infestations on wild salmon catches in different production areas (PAs).\n\nOur analysis finds a significant correlation between declines in wild Atlantic salmon catches and increasing amounts of adult female sea lice per km<sup>2</sup>. The effect is most pronounced in PA 4 on the west coast of Norway, an area within the government's” traffic light” management system where out-migrating salmon smolts are deemed to face high risk of louse-induced mortality.\n\nOur model predicts below-average catches when the total sea-louse load exceeds the limit of 0.1 average adult female sea louse per farmed fish within some production areas. Furthermore, our results indicate that the risk of below-average catches increases by approximately 47% when salmon farms exceed this limit (estimated risk ratio of 1.47, 95% CI [1.10, 1.96]).\n\n<i>Synthesis and applications</i>: Our study expands the existing body of evidence demonstrating a negative association between fish farming and the ecosystem services provided by wild salmon stocks. This has important implications for aquaculture management. First, it shows that farm sea lice directly affect peoples, rights holders and interest groups, such as landowners and anglers, who rely on viable populations of wild salmon. Second, it suggests that a &gt;0.1 sea lice limit may be insufficient to prevent subpar catches in some areas. Furthermore, in the context of allowing further growth in farmed salmon biomass, setting absolute sea-louse limits for entire production areas may be a more effective regulatory instrument than setting average lice limits per farmed fish. Our findings contribute to advancing a scientific basis for setting appropriate louse limits on farm and area scales.\n</p>","author":"Mari Lie Larsen, \nIrja Vormedal, \nKnut W. Vollset","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"0125a4a7b32aba7b3f9e98f0d131f98a79fe45a728bb36ea4111bd9655af5f1d","category":"Environment"}