{"title":"Counterweight mass influences single-leg cycling biomechanics","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304136","date":1717768800000,"content":"<p>by Michael J. Asmussen, Erica Casto E., Martin J. MacInnis, Benno M. Nigg</p>\r\nIntroduction <p>Single-leg cycling is a commonly used intervention in exercise physiology that has applications in exercise training and rehabilitation. The addition of a counterweight to the contralateral pedal helps single-leg cycling mimic cycling patterns of double-leg cycling. To date, no research has tested (a) the influence of a wide range of counterweight masses on a person’s cycling biomechanics and (b) the optimal counterweight mass to emulate double-leg cycling.</p> Objectives <p>The purpose of this study was to determine the effects of varying counterweights on the kinematics (joint angles) and kinetics (joint moments, work) of cycling using a 3D analysis.</p> Methods <p>Twelve participants cycled at 50W or 100W with different counterweight masses (0 to 30 lbs, 2.5 lbs increments), while we analyzed the pedal force data, joint angles, joint moments, and joint power of the lower limb using 3D motion capture and 3D instrumented pedals to create participant-specific musculoskeletal models.</p> Results <p>The results showed that no single-leg cycling condition truly emulated double-leg cycling with respect to all measured variables, namely pedal forces (<i>p</i> ≤ 0.05), joint angles (<i>p</i> ≤ 0.05), joint moments(<i>p</i> ≤ 0.05), and joint powers (<i>p</i> ≤ 0.05), but higher counterweights resulted in single-leg cycling that was statistically similar (<i>p</i> &gt; 0.05), but descriptively, asymptotically approached the biomechanics of double-leg cycling.</p> Conclusion <p>We suggest that a 20-lb counterweight is a conservative estimate of the counterweight required for using single-leg cycling in exercise physiology studies, but further modifications are needed to the cycle ergometer for the biomechanics of single-leg cycling to match those of double-leg cycling.</p>","author":"Michael J. Asmussen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"012771092fbd60b1e55c538f6bd7779e68ef2e7787e0f015b3432c063a8013a7","category":"Interdisciplinary"}