{"title":"New for Amazon Connect: Voice ID, Wisdom, and Outbound Communications","link":"https://aws.amazon.com/blogs/aws/three-new-capabilities-for-amazon-connect/","date":1632745039000,"content":"<p>During the <a href=\"https://reinvent.awsevents.com/\">AWS re:Invent</a> conference last year, <a href=\"https://aws.amazon.com/blogs/aws/amazon-connect-smarter-and-more-integrated/\">I wrote about new capabilities</a> added to <a href=\"https://aws.amazon.com/connect/\">Amazon Connect</a>. Today, I am happy to announce the general availability of two of these capabilities, <a href=\"https://aws.amazon.com/connect/voice-id/\">Voice ID</a> and <a href=\"https://aws.amazon.com/connect/wisdom/\">Wisdom</a>, and the launch of a new one. <a href=\"https://aws.amazon.com/connect/features/\">High-volume outbound communications </a>allows, as the name implies, the initiation and management of outbound communications over voice, SMS, or email.</p> \n<p><span>Amazon Connect</span> is an easy-to-use omnichannel cloud contact center that helps you provide customer service at a lower cost. In just a few clicks, you can set up and make changes to your contact center, so agents can begin helping customers right away.</p> \n<p><span><strong>Amazon Connect Wisdom</strong></span><br /> Wisdom reduces the time agents spend searching for answers. Today, when agents require access to information to help a customer, they lose time trying to navigate different data sources in siloes: FAQ, files, wiki pages, customer call history, knowledge bases, etc.</p> \n<p>When using Wisdom, agents simply enter a question or phrase in their agent desktop application, such as “what is the pet policy in hotel rooms”, and Wisdom searches connected repositories and returns the most relevant information and best answer to handle the customer issue.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/27/LMV43-Wisdom.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/27/LMV43-Wisdom-1024x576.png\" /></a></p> \n<p>Wisdom also uses real-time call transcripts from <a href=\"https://aws.amazon.com/connect/contact-lens/\">Contact Lens for Amazon Connect</a> to automatically detect customer issues during calls and to recommend relevant content stored across connected knowledge repositories, without requiring agents to even enter a question.</p> \n<p>Wisdom connects to knowledge repositories with built-in connectors for third-party applications including <a href=\"https://www.salesforce.com/\">Salesforce</a> and <a href=\"https://www.servicenow.com/\">ServiceNow</a>. You can also ingest content from other knowledge stores using the Wisdom ingestion APIs.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/27/Ingest-your-data-with-built-in-connectors.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/27/Ingest-your-data-with-built-in-connectors-1024x519.png\" /></a></p> \n<p><span><strong>Amazon Connect Voice ID</strong></span><br /> How many times have you been through an authentication procedure when calling a contact center? Voice ID simplifies this to make voice interactions faster and more secure. It uses machine learning to provide real-time caller authentication based on the caller’s voice.</p> \n<p>To effectively recognize me as “Sébastien”, Voice ID must learn how I talk. This is the enrollment phase. It only requires 30 seconds of voice recording to enroll a caller.</p> \n<p>When I call the same contact center again, Voice ID compares the sound of my voice with the one enrolled earlier. This is the verification phase. It only requires between 5 and 10 seconds of my voice to authenticate me. The verification phase generates a confidence score and a status displayed in the agent desktop app.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/27/2021-09-27_08-51-43-1.gif\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/27/2021-09-27_08-51-43-1.gif\" /></a></p> \n<p>Contact Center administrators can use this result to configure different flows depending on the verification outcome. The routing is configured with a simple configuration panel such as this one:<a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/21/Amazon-Connect-Voice-ID-p1.aec4e21459d01be6a096d3017dff876ebd54782b.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/21/Amazon-Connect-Voice-ID-p1.aec4e21459d01be6a096d3017dff876ebd54782b-242x300.png\" /></a>To meet with personal data protection laws, contact center agents capture my consent to use Voice ID.</p> \n<p><span><strong>High-Volume Outbound Communications<br /> </strong></span>Typical contact centers are designed to receive customer calls. However, there is a growing set of use cases where contact centers send outbound communications as well. For example, to call customers back,to inform them about the progress of a case, to confirm an appointment, to renew a subscription, or for telemarketing, just to name a few.</p> \n<p>The majority of these outbound communications are phone calls. When doing so, traditional contact center agents dial the number provided by a customer management system and wait for someone to answer. Typically, only 10% of the calls are answered. This process is highly inefficient.</p> \n<p>In the Amazon Connect administration console, I select <strong>High volume outbound communication</strong>, then I select <strong>Create Campaign</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/22/Screenshot-2021-09-20-152316.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/22/Screenshot-2021-09-20-152316-1024x231.png\" /></a></p> \n<p>I then configure the details. I give the campaign a <strong>name</strong>, then I select one of my <strong>outbound contact flow</strong> and a <strong>contact queue</strong> associated with an outbound phone number.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/22/Campaign-config-2.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/09/22/Campaign-config-2-1024x701.png\" /></a></p> \n<p>The <strong>predictive</strong> dialer makes more calls than available agents. It uses metrics such as campaign performance, expected pick-up rates, and the number of available agents to adjust the number of calls. When a call is answered, it detects when a human is on the line (vs. an automatic machine, a fax line, etc.). Only calls answered by humans are routed to an available agent. The <span>Amazon Connect</span> agent application shows the call script that was specified during setup, along with relevant customer information.</p> \n<p>The <strong>progressive</strong> dialer is more conservative, it uses a 1:1 ratio between calls and available agents.</p> \n<p><span>Amazon Connect</span> not only adds high-volume outbound communication capabilities for voice, but also for SMS, and email. <span>Amazon Connect</span> comes with pre-built connectors for importing customer contact lists from external systems, such as <a href=\"https://www.salesforce.com\">Salesforce</a>, <a href=\"https://www.zendesk.com/\">Zendesk</a>, <a href=\"https://www.marketo.com/\">Marketo</a>, and <a href=\"https://aws.amazon.com/pinpoint/\">Amazon Pinpoint</a>. No coding required.</p> \n<p>Contact center managers have access to real-time metrics such as contact volume, abandonment rates, average connection times, and minimum ring times to optimize agent efficiency. These metrics help to understand the status of their campaigns and ensure compliance with applicable regulations, such as maximum call abandonment rates. Contact center managers use historical reports of these metrics to understand the effectiveness of all their communications campaigns over time.</p> \n<p>To ensure a fair usage of the high-volume outbound communication capability, you must apply for production access to use the predictive dialer as well as SMS and email. You may <a href=\"https://pages.awscloud.com/Amazon-Connect-Gardner-Preview.html\">submit a service request</a> detailing your use cases and business context, which will be used to validate your legitimacy as a sender. Once access is granted, <span>Amazon Connect</span> continuously monitors your usage and the team might revoke access when fraud is suspected.</p> \n<p>If you want to try it out yourself, <a href=\"https://pages.awscloud.com/Amazon-Connect-Gardner-Preview.html\">you may apply to the preview by filling out this form</a>.</p> \n<p><span><strong>Pricing and Availability</strong></span><br /> As usual, there are no upfront costs or minimum usage fees. You pay only what you use: a price per minute of outbound calls and per email or SMS message. The details are up-to-date on the <a href=\"https://aws.amazon.com/connect/pricing/\">Amazon Connect pricing page</a>.</p> \n<p>Regional availability slightly differ for each of these three new capabilities, here is a the list of AWS Regions where they are available:</p> \n<ul> \n <li>Wisdom: <span>US West (Oregon)</span>, <span>US East (N. Virginia)</span>, <span>Europe (London)</span>, <span>Europe (Frankfurt)</span>, <span>Asia Pacific (Tokyo)</span>, and <span>Asia Pacific (Sydney)</span>.</li> \n <li>Voice ID: <span>US West (Oregon)</span>, <span>US East (N. Virginia)</span>, <span>Europe (London)</span>, <span>Europe (Frankfurt)</span>, <span>Asia Pacific (Tokyo)</span>, <span>Asia Pacific (Singapore)</span>, and <span>Asia Pacific (Sydney)</span></li> \n <li>High volume outbound communication (preview): <span>US East (N. Virginia)</span>, <span>Europe (London)</span>, and <span>US West (Oregon)</span>. More Regions will be added when it will be generally available.</li> \n</ul> \n<p>As usual, let us know what you think about these new capabilities and how you use them. Go <a href=\"https://aws.amazon.com/connect/\">build your own contact center in the cloud</a> today.</p> \n<a href=\"https://twitter.com/sebsto\">-- seb</a>","author":"Sébastien Stormacq","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"01280a363ff8e20dee9f8ad656c7172efdd46d6e702d03ba5085796441e5a447","category":"Tech"}