{"title":"A possible pattern in the evolution of male meiotic cytokinesis in angiosperms","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae017/7635175?rss=1","date":1711411200000,"content":"<span><div>Abstract</div>Evolution of cellular characteristics is a fundamental aspect of evolutionary biology, but knowledge about evolution at the cellular level is very limited. In particular, whether a certain intracellular characteristic evolved in angiosperms, and what significance of such evolution is to angiosperms, if it exists, are important and yet unanswered questions. We have found that bidirectional cytokinesis occurs or likely occurs in male meiosis in extant basal and near-basal angiosperm lineages, which differs from the unidirectional cytokinesis in male meiosis in monocots and eudicots. This pattern of cytokinesis in angiosperms seems to align with the distribution pattern of angiosperms with the lineages basal to monocots and eudicots living in tropical, subtropical or temperate environments and monocots and eudicots in an expanded range of environments including tropical, subtropical, temperate, subarctic and arctic environments. These two cytokinetic modes seem to result from two phragmoplast types, respectively. A phragmoplast in the bidirectional cytokinesis dynamically associates with the leading edge of a growing cell plate whereas a phragmoplast in the unidirectional cytokinesis is localized to an entire division plane. The large assembly of microtubules in the phragmoplast in unidirectional cytokinesis may be indicative of increased microtubule stability compared with that of the small microtubule assembly in the phragmoplast in bidirectional cytokinesis. Microtubules could conceivably increase their stability from evolutionary changes in tubulins and/or microtubule-associated proteins. Microtubules are very sensitive to low temperatures, which should be a reason for plants to be sensitive to low temperatures. If monocots and eudicots have more stable microtubules than other angiosperms, they will be expected to deal with low temperatures better than other angiosperms. Future investigations into the male meiotic cytokinetic directions, microtubule stability at low temperatures, and proteins affecting microtubule stability in more species may shed light on how plants evolved to inhabit cold environments.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"01299161e8d648b7277737586e1dc2f3f1035f9e3b8c4cfcc16069535440a1d9","category":"Environment"}