{"title":"iPhone Survives 16,000-Foot Drop After Alaska Airlines Plane Incident","link":"https://www.macrumors.com/2024/01/08/iphone-survives-fall-from-plane/","date":1704751288000,"content":"An <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> that was expelled from the cabin of Alaska Airlines flight 1282 on Friday survived a fall of more than 16,000 feet and was discovered intact.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/recovered-alaska-phone.jpg\" width=\"1153\" height=\"648\" />\r<br />\nVancouver, Washington resident Sean Bates shared images of the device on Sunday after he found it on the side of Barnes Road in Portland, Oregon. The ‌iPhone‌ was in full working condition and was in fact still open to an Alaska Airlines email. There were no cracks on the display, though it was protected by a case and presumably landed in a forested area with soft ground cover.\r<br />\n\r<br />\nBates alerted the National Transportation Safety Board, and officials came out to collect the device. The NTSB told Bates that it was the second phone to be found from the flight in the area.\r<br />\n\r<br />\n<div><blockquote><p>Found an iPhone on the side of the road... Still in airplane mode with half a battery and open to a baggage claim for <a href=\"https://twitter.com/hashtag/AlaskaAirlines?src=hash&amp;ref_src=twsrc%5Etfw\">#AlaskaAirlines</a> ASA1282 Survived a 16,000 foot drop perfectly in tact!<br /><br />When I called it in, Zoe at <a href=\"https://twitter.com/NTSB?ref_src=twsrc%5Etfw\">@NTSB</a> said it was the SECOND phone to be found. No door yet😅 <a href=\"https://t.co/CObMikpuFd\">pic.twitter.com/CObMikpuFd</a></p>— Seanathan Bates (@SeanSafyre) <a href=\"https://twitter.com/SeanSafyre/status/1744138937239822685?ref_src=twsrc%5Etfw\">January 7, 2024</a></blockquote> </div>\r<br />\nThe ‌iPhone‌ was <a href=\"https://news.alaskaair.com/alaska-airlines/operations/as-1282/?linkId=100000234605102\">expelled from Alaska Airlines flight 1282</a> after a portion of the plane blew out shortly after it took off from the Portland International Airport. The aircraft was able to safely land back at the Portland airport, and all passengers and crew members survived.\r<br />\n\r<br />\nThe sudden depressurization in the cabin of the plane caused items like smartphones to be sucked out, where they fell to the ground below. In 2011, <em>Wired</em> <a href=\"https://www.wired.com/2011/04/what-is-the-terminal-velocity-of-an-iphone/\">wrote a piece</a> on the terminal velocity of an ‌iPhone‌ falling from a plane, which is a good explainer how the device was able to survive. In a nutshell, the low weight and maximum speed of the ‌iPhone‌ leads to a limited amount of force on landing despite the height of the fall, so the end result isn't too much different from dropping it from a lower height.\r<br />\n\r<br />\nThere were two smartphones found from the plane, along with other debris such as the plug door that may give some insight into what went wrong.<br />This article, \"<a href=\"https://www.macrumors.com/2024/01/08/iphone-survives-fall-from-plane/\">iPhone Survives 16,000-Foot Drop After Alaska Airlines Plane Incident</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-survives-16-000-foot-drop-after-alaska-airlines-plane-incident.2415799/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0138ff45f3cfcccab3fdfc00f9e21889d5ea6dd0797fa87af3d162e53761b74c","category":"Apple"}