{"title":"The Brain Region Specific Citrullinome and PAD 1-6 Isozyme Detection in a Pre-motor Parkinson’s Disease Rat Model","link":"https://www.preprints.org/manuscript/202406.2001/v1","date":1719564647000,"content":"The detection of early biomarkers and molecular mechanisms in Parkinson’s disease (PD) remains a challenge. Recent research has pointed to potential roles for peptidylarginine deiminases (PADs), a family of calcium activated enzymes, and associated post-translational protein citrul-lination/deimination in early stages of the disease, with a focus on hippocampal and cortex re-gions of the brain. Further analysis of brain region specific changes in PAD isozymes and identi-fication of brain-region specific citrullinomes, therefore remain to be studied. This study assessed brain-region specific PAD isozyme expression (PADs 1-4; PAD6) and associated citrullinated protein targets in the 6-hydroxydopamine (6-OHDA) induced rat model of pre-motor PD. Cortex, hippocampus, striatum, midbrain, cerebellum and olfactory bulb were compared between con-trols/shams and the PD model.  In cortex, a significant increase of PAD2 and PAD3 was observed in the PD model. In hippocampus, PAD3, PAD4 and PAD6 showed strongest levels, but with no significant changes observed between PD and controls. In striatum, a significant reduction in all PAD isozymes was observed in the PD model. In the olfactory bulb, PAD3 was significantly el-evated in PD. In midbrain, PAD2, PAD4 and PAD6 showed strongest signal but with no signifi-cant changes between PD and controls. In cerebellum, a significant increase was seen in PAD3, PAD4 and PAD6 in the PD model. Citrullinated protein hits were most abundant in cortex and hippocampus, while for the PD model an increase in citrullinated hits was particularly observed in cortex and cerebellum, compared to controls. For all brain regions there was a considerable difference in citrullinated protein IDs between the PD model and the controls. Citrullinome as-sociated KEGG pathways differed in the six brain regions; some were overlapping for controls and PD, some were identified for the PD model only, and some were identified in control brains only. KEGG pathways identified in PD brains onlywere: “Axon guidance”; “Spinocerebellar ataxia”; “Hippo signalling pathway”; “NOD-like receptor signalling pathway”; “Phosphatidyl-inositol signalling system”; “Rap1 signalling pathway”; “Platelet activation”; “Yersinia infection”; “Fc gamma R-mediated phagocytosis”; “Human cytomegalovirus infection”; “Inositol phosphate metabolism”; “Thyroid hormone signalling pathway”; “Progesterone-mediated oocyte matura-tion”; “Oocyte meiosis”; and “Choline metabolism in cancer”. Our findings  highlight differences in PAD isozymes, citrullinated proteins and associated KEGG pathways between brain regions, in pre-motor PD.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"013ae5b87163f1905c2db1c2b601c5c14a4219ade21d590e67fb2cbb47a3732f","category":"Interdisciplinary"}