{"title":"Specialized decides sponsoring the world's best team for longer is a good thing","link":"https://www.cyclist.co.uk/specialized/9782/specialized-decides-sponsoring-the-worlds-best-team-for-longer-is-a-good-thing","date":1624457164000,"content":"<span>\n      <span><a href=\"/authors/joe-robinson\">Joe Robinson</a></span>\n  </span><div>  \n  <div>      <div><span>23 Jun 2021</span></div>    </div></div><p>\nAmerican bike brand to continue sponsorship of Deceuninck-QuickStep through to 2027</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/04/tour-of-flanders-auld-13.jpg?itok=XHnL8147\" />  </div>\n<div>\n      <p> American bike brand <a href=\"/specialized/8796/specialized-s-works-aethos-first-ride-review-on-the-lightest-ever-disc-brake-bike\">Specialized</a> has decided sponsoring the world's most successful team is definitely a good thing and has extended its deal with <a href=\"/tags/deceuninck-quickstep\">Deceuninck-QuickStep</a> through to 2027.</p>\n<p>Since Specialized came on board as the Belgian team's bike sponsor in 2012, the partnership has claimed 541 victories and counting, more than any other team and bike sponsor duo in the same timeframe. And in nine of those complete seasons together, QuickStep have been the most successful team in terms of wins on eight occasions.</p>\n<p>So it comes as no surprise that Specialized decided it best to back Patrick Lefevere's team for the longer term in a contract extension that not only covers the team's bike choices but also helmets, shoes, wheels and components.</p>\n<p>Founder and CEO of Specialized Mike Sinyard said of the deal: 'For over a decade, Deceuninck-QuickStep has been instrumental in the development of cutting-edge technology for our bikes and equipment, which has resulted in some of the most monumental victories for Specialized.</p>\n<p>'We are honoured to continue the close partnership with Patrick and this special team, to drive the future of our sport.'</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2021: Everything you need to know</a></div>      <div><a href=\"/in-depth/9797/gallery-emotional-mathieu-van-der-poel-wins-tour-de-france-stage-2-to-take-yellow\">Gallery: emotional Mathieu van der Poel wins Tour de France Stage 2 to take yellow</a></div>      <div><a href=\"/in-depth/9460/tour-de-france-history-the-hardest-stage-ever\">Tour de France history: The hardest stage ever?</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 115: on sale now!</a></div>    </div></div><p>\nAdding on from Sinyard was Deceuninck-QuickStep manager Lefevere, who welcomed the continued long-term support of his team.</p>\n<p>'We are delighted to extend our agreement with Specialized, which has been a vital part of what we have achieved in recent times. You only have to look at the record books to get a feel for their standing in the sport of professional cycling, and we have hugely enjoyed having them by our side.'</p>\n<p>For QuickStep, support through to the end of 2027 suggests the team's long term future is more secure than usual. Like clockwork, Lefevere almost annually states the difficulties of finding a sponsor for the team for the next season around the time of the <a href=\"/tags/tour-de-france\">Tour de France</a>.</p>\n<p>However, with Specialized pledging through to 2027, QuickStep promising its future support of the team and recent contract extensions to the likes of Remco Evenepoel, it seems as if Lefevere's team is in a more stable position than usual.</p>\n<p>For Specialized, this could be quite a big deal. Rumours are currently circulating that its other WorldTour cycling asset, <a href=\"/tags/peter-sagan\">Peter Sagan</a>, could be soon ending his long-standing association with the brand.</p>\n<p>It has been hinted that Sagan is set to leave <a href=\"/tags/bora-hansgrohe\">Bora-Hansgrohe</a> at the end of the year for current ProTeam Total-Direct Energie. With this potential move, Specialized could lose Sagan as a sponsored rider as the French team currently use bikes supplied by Wilier-Triestina. </p>\n<p>The same rumours are suggesting Specialized are looking at following Sagan to Total-Direct Energie, however if a deal cannot be made, at least they have the fallback of the world's best team. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/bikes\">Bikes</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"0141c1cfff715e1a503fb5073dc4acd89885c64245e08d9b33c0b4f44a9f6de3","category":"Cycling"}