{"title":"AUZANGATE: A New Film Project from Shared Territory – Josh Weinberg & Justin Balog","link":"https://theradavist.com/2021/11/auzangate-bikepacking-peru/?utm_source=rss&utm_medium=rss&utm_campaign=auzangate-bikepacking-peru","date":1636549229000,"content":"<p><em>AUZANGATE is the third <a href=\"https://www.sharedterritory.co/\" target=\"_blank\">Shared Territory</a> film, which debuted this week. We recently caught up with Director, <a href=\"https://www.justinbalog.com/\" target=\"_blank\">Justin Balog</a>, for a brief Q&amp;A about the project, which you can find below, along with a link to the beautiful film and incredible gallery of images from photographer <a href=\"https://www.instagram.com/analogstrikesback/?hl=en\" target=\"_blank\">Ian Matteson</a>.</em><span></span></p>\n<div><span>﻿</span></div>\n<p> </p>\n<p><em>If you find yourself in Cusco Peru, and look to the east, you’ll see a snowcapped mountain, most likely more massive than any mountain you have ever seen. The mountain has been the guardian, the giver of life, the Apu of not only Cusco but all the communities that live in its shadow. This mountain is known as Auzangate. At 20,945ft Auzangate is the 5th highest mountain in the Peruvian Andes and is home to the last remaining pastoral societies in the world. The goal of Shared Territory is, and always has been, to connect with others with the hope of better understanding the shared experiences that make us all human. In our 3rd film, Auzangate we set out on an expedition with a team of Peruvians, led by a local fortune teller, to circumnavigate this mountain and document the people and places we found. What we found was an unrelenting mountain that had a different plan for us. The story that Auzangate wanted to tell was a story of human generosity at its absolute best. When you visit Peru, please connect with Fidaluz of “Peru Ancestral” and Manuel of “Peru by Bike.” Not only did they help with the depth of this story, but they are also some of the greatest folks you spend time with. They will take your journey in Peru to new heights. Like 18,000 feet heights!</em></p>\n<p><em><br />\n<a href=\"https://peruancestral.com\" target=\"_blank\">Peru Ancestral</a><br />\n<a href=\"https://www.instagram.com/perubybike/\" target=\"_blank\">Peru by Bike</a></em></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/%40analogstrikesback_20210717__IWM7685-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>JW: What is Shared Territory?</p>\n<p>JB: Shared Territory is a fellowship of explorers and documentary film projects, guided by creative principles, that connects people and promotes understanding through human-powered exploration.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/%40analogstrikesback_20210717__IWM8171-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>JW: I’m always curious about the planning/coordination aspects of expeditions like this. You mention getting an invitation from Manuel; how did you connect with him and others in Peru?</p>\n<p>JB: That’s a funny story. A story that really is an example of the connection we’ve set out to create with Shared Territory. This is our 3rd film, our first one being Iceland. It was with the release of that film, that Manuel left a simple comment that said, “I loved your film, it would be great for you to visit Peru to ride.” That was it. From there we connected, talked, and made a plan!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/%40analogstrikesback_20210714__IWM5764-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>JW: Is there an established trail system around the mountain? What was the route development like?</p>\n<p>JB: Auzangate is a very famous trekking route. We wanted to establish an alternate route that was not only favorable to bikes, but one that would allow us to visit all the lagoons that surround the mountain. That is where Ponchito came in. He’s lived in the shadow of Auzangate his entire life and knows the mountain range like the back of his hand. The route we attempted was a route Ponchito imagined.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/%40analogstrikesback_20210718__IWM8625-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>JW: In the film, it looks like the night before the snowstorm started your group slept in a hut/refugio (camp two). Is there an established hut system in the Vilcanota range? Had you stayed on the originally planned route, would you have visited more huts?</p>\n<p>JB: Yes, if you are trekking the route, there are a few huts. The route we were attempting intersected portions of the trekking route, and there were access to huts on a few nights. That being said, there were nights where camping under the stars was the play!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/%40analogstrikesback_20210717__IWM8269-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>JW: How do you train for riding at such high elevations? And, was your preparation enough?</p>\n<p>JB:We’re all from mountainous areas, so we were all familiar with moderately high elevations. That being said, we did chew coca leaves which is the traditional way of managing those elevations. I honestly don’t know if training is really a thing for those elevations. Everything just slows down and you only can do one speed.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/%40analogstrikesback_20210718__IWM8893-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>JW: Peter riding the route with you on a bmx is a highlight of the story. How did that work out for him? Had he done big rides like that in the past?</p>\n<p>JB: Peter is a LEGEND! He’s actually a geologist and works as a miner. He was home from work on vacation and wanted to improve his English, so he decided to join. He had never done a ride like that before, I’m positive NO ONE has ever done that ride on a BMX. He pushed his bike a lot, but he rode when he could. That’s the great thing about the bike. We had never met before, and there we we’re, just buds out on a bike ride together. It was pretty special!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/%40analogstrikesback_20210719__IWM9118-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>JW: Climate change and its impacts on the land are discussed in the film. How did you see/hear about it affecting people’s lives both in the city and rural areas?</p>\n<p>JB: The irony is that the new route we were attempting has only been made possible because of the retreating snowpack in the Andes. I can’t speak directly to the impact that the retreating snow mass has had on the local populations, all I can say is that Sabrina, who we speak with in the film, provides a terrifying first hand account of what she has witnessed.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/%40analogstrikesback_20210717__IWM7827-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>JW: There were strong cultural components to your expedition. What resonated with you the most about the people you met and stories you heard?</p>\n<p>JB: All Shared Territory projects are an attempt to share the voices and perspectives of the people we meet and the cultures we experience. The goal is to promote an understanding of one another and discover the commonalities across the human experience that we share. In Peru, we discovered nothing but generosity and warmth. What we observed were a people who were proud of their heritage, and willing to share their stories with us. If everyone could show others the same caring that the family shared with us, who at the time were total strangers, the world would defiantly be a better place.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/%40analogstrikesback_20210715__IWM6365-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>JW: Do you recommend this region of Peru for bike travel? What are some things folks can do to learn more about bike touring in the area?</p>\n<p>JB: Absolutely! We just scratched the surface. If you look at Google Earth all you see are gravel roads, pasture lands and villages that you can connect. I would defiantly recommend connecting with Manuel from Peru by Bike. Just drop him a line on Instagram ( @PeruByBike), and he will be able to connect you with all sorts of ideas. He has a beautiful lodge near Cusco surrounded by gravel roads. We never even made it there, but we can’t wait to go back and check it out!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/%40analogstrikesback_20210714__IWM6225-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>JW: What’s next for Shared Territory?</p>\n<p>JB: We’re beginning to plan our next 2 projects right now. All with the goal of sharing the bonds that make us human. You can join in <a href=\"https://www.instagram.com/sharedterritory/?hl=en\" target=\"_blank\">@SharedTerritory</a> on Instagram, or watch all our films at <a href=\"https://www.sharedterritory.co/\" target=\"_blank\">SharedTerritory.co</a></p>\n<p><em>This film wouldn’t have been possible without the voices in it. If you find yourself planning to visit Peru please connect with Manuel, Fidelus and Ponchito.</em></p>\n<p><em>Fidelus – <a href=\"https://peruancestral.com\" target=\"_blank\">Peru Ancestral</a> </em><br />\n<em>Manuel – <a href=\"https://www.instagram.com/perubybike/\" target=\"_blank\">Peru by Bike</a> </em><br />\n<em>Ponchito – He recently opened a small hotel on his family’s farm in Tinki. You can contact him via Manuel.</em></p>","author":"Josh Weinberg","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"01414e3e3051061f707897a14c000f1cb53380b5e64eb2a495d3253587c32710","category":"Cycling"}