{"title":"Which muscles are used during cycling?","link":"https://www.bikeradar.com/advice/fitness-and-training/muscles-used-in-cycling/","date":1619359200000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/04/0W5A2278-4da1b80.jpg?quality=45&amp;resize=620,413\" />                                            <p>A lot of emphasis is placed on the aerobic benefits of cycling but you’re also giving a wide range of muscles a workout when riding. Here, we talk through the key muscle groups that get stronger through cycling.</p>\n<h2>What are the key cycling muscles?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Unsurprisingly, your legs will get the greatest workout when cycling.</span></figcaption><span> <i>Russell Burton</i></span></div>\n<p>As you’d expect, the main muscle groups exercised by cycling are in the legs. That includes the muscles on the top of the legs in the front of the thigh, called the quadriceps (a group of four muscles), and the hamstrings (a group of muscles at the rear of the upper leg).</p>\n<p>There’s also significant input from the buttock muscles, the gluteus maximus.</p>\n<p>These are the primary muscles used to drive the pedals, producing the power which in turn propels you forward.</p>\n<p>That plays on the strengths of the human body, says Dr Xavier Disley of <a href=\"https://www.aero-coach.co.uk/\" target=\"_blank\">AeroCoach</a>, as we’ve evolved to perform knee and hip extension exercises like walking, running, jumping and pushing.</p>\n<p>But with pedals limiting the extent of motion, there’s less extension when cycling than in these activities, leading to different effects on your muscles and different injury risks.</p>\n<h2>How are those muscles used in the pedal stroke?</h2>\n<p>Since effective power delivery is crucial to the sport, there’s been a lot of research into how to optimise the pedal stroke.</p>\n<p>As you’d expect, pedalling is most efficient when most of the power is put into the downstroke, primarily using those powerful quad and buttock muscles.</p>\n<p>Trying to pull up on the pedals on the upstroke uses the smaller muscles in the hamstrings and so doesn’t help as much, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/stop-pulling-up-on-your-pedals/\">nor is it recommended</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Many elite cyclists can exert power further around the pedal stroke than untrained riders.</span></figcaption><span> <a href=\"http://SWpix.com%20\"><strong>Russell Ellis/russellis.co.uk/SWpix.com </strong></a></span></div>\n<p>The muscle groups in your calves, ankles and feet don’t contribute as much to your power as you might think, says physiotherapist <a href=\"https://www.philburtinnovation.co.uk/\" target=\"_blank\">Phil Burt</a>, who has supported Britain’s elite cyclists at three Olympic games and Team Sky at seven Tours de France.</p>\n<p>He cites Paralympic cyclists who have lost their lower legs and are actually more efficient cyclists.</p>\n<p>But pulling – or ‘scraping’ – through the very top and bottom of the rotation will increase your power output: this will use a different set of muscles in your quads and calves. Many elite cyclists can exert power further around the pedal stroke than untrained riders.</p>\n<p>That’s especially true of elite mountain bikers, where smooth power delivery is crucial to progress off the tarmac.</p>\n<p>It’s an ability that transfers well to the road, with Cadel Evans being an example of a mountain biker turned road cycling (and, indeed, Tour de France) champion. Track and <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-fixies-and-singlespeed-bikes/\" target=\"_blank\">fixed gear</a> riding will also improve your power delivery, says Burt.</p>\n<h2>What other muscle groups does cycling use?</h2>\n<p>Cycling doesn’t just use your leg muscles; those in your abdomen and back need to work to keep the upper body stable, while your shoulders and arms will get a workout, especially when <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-climb-out-of-the-saddle-like-alberto-contador/\">climbing and out of the saddle</a>.</p>\n<p>Because you’re extending your muscles less when cycling than with other exercises, cyclists may be less flexible than other athletes; tight hamstrings can be an issue.</p>\n<p>The three points of contact with the bike mean that core stability can be less developed, particularly for road cyclists. Coaches suggest mixing cycling with core strength exercises to improve this, in turn improving your efficiency on the bike and helping to prevent injury.</p>\n<ul><li><a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-simple-strength-and-conditioning-exercises-you-can-do-at-home/\">10 simple strength and conditioning exercises you can do at home</a></li>\n</ul><h2>What are the injury risks when cycling?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> It’s important to look after yourself, even if cycling is a low-impact sport.</span></figcaption><span> <i>Immediate Media Co.</i></span></div>\n<p>Cycling has the advantage that it puts a lower load on the body than many forms of exercise, so it’s less likely that you’ll pull a muscle. But there’s more of a risk of repetitive strain injury and aches and pains from holding the same position for long periods, particularly if your bike setup isn’t correct, so a <a href=\"https://www.bikeradar.com/features/6-simple-tweaks-to-get-the-best-bike-fit/\">bike fit</a> is something to consider.</p>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-knee-pain-the-problem-areas/\" target=\"_blank\">Knee pain</a> is the largest cause of injury that cycling physiotherapist Nichola Roberts sees in her practice at <a href=\"http://www.velophysio.co.uk/\" target=\"_blank\">Velophysio</a>. She says poor bike fit is the primary cause of knee pain, followed by trauma from an accident.</p>\n<p>Biomechanical problems from muscle imbalances are also an issue, often caused by <a href=\"https://www.bikeradar.com/advice/fitness-and-training/overtraining-syndrome/\">overtraining</a>. She stresses the importance of building mileage gradually and incorporating stretches and exercises such as squats into your routine.</p>\n<ul><li><a href=\"https://www.bikeradar.com/advice/fitness-and-training/use-these-exercises-to-ride-stronger-and-stay-injury-free-in-2019/\">Use these exercises to ride stronger and stay injury-free</a></li>\n</ul><h2>How does your riding style change which muscles you use?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Mountain biking offers a more complete workout than road riding.</span></figcaption><span> <i>Dan Milner / Immediate Media</i></span></div>\n<p>The type of riding you’re doing will also affect which muscles you use. A lot of road cycling and time trialling is about holding a static position for extended periods, which can result in aches and pains if your setup isn’t correct.</p>\n<p>Mountain biking is as much about balance and position on the bike, while a sprinter churning out big watts out of the saddle will be using their arms and back muscles too. That’s also true of out-of-saddle climbing, when the legs and back will be more extended than when sitting.</p>\n<p>Phil Burt emphasises the importance of your position on the bike to effective cycling; too low and too far back and you won’t be able to recruit your major muscles efficiently, including your hip extensors, the most powerful in the body.</p>\n<p>“You want to be positioned high and forward, more like a triathlete,” he says. That’s also important to avoid knee pain and to optimise your cadence.</p>\n<h2>Will cycling give me big legs?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Cycling can make you very strong indeed, but don’t expect to become a buff beefcake overnight.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>With all the emphasis on power output via the legs, you might think that your legs and buttocks would bulk out.</p>\n<p>That’s often true of elite track riders and sprinters required to produce a lot of power quickly – think of <a href=\"https://www.bikeradar.com/advice/fitness-and-training/chris-hoy-explains-how-to-condition-your-body-for-extra-power-and-pace/\" target=\"_blank\">Sir Chris Hoy</a> – but it’s not necessarily so.</p>\n<p>Again, it depends on the type of riding you’re doing and its intensity. Some of the best road riders are ultra-skinny to help get them up hills as fast as possible, although even they will have well-developed quads. In turn, their aerobic systems will be highly developed to deliver the oxygen those muscles require.</p>\n<p>Because you need your legs to be able to move fast and efficiently, cycling is less likely to develop massive muscles than bodybuilding at the gym.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"01418c9dd01014cae03c78437fef600883ca15151a3e4f0c40d62de1b482a6f6","category":"Cycling"}