{"title":"Rapper Pras’ lawyer used AI to defend him in criminal case—it did not go well","link":"https://arstechnica.com/?p=1977018","date":1697660968000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/pras-michel-800x533.jpg\" alt=\"Rapper Pras Michel performing on stage while holding a microphone.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/pras-michel.jpg\">Enlarge</a> <span>/</span> Pras Michel performs during the Roots Picnic at The Mann on June 3, 2023, in Philadelphia.  (credit: Getty Images | Taylor Hill )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>After being convicted of federal crimes related to a foreign influence campaign, rapper Prakazrel \"Pras\" Michel says he should get a new trial because his lawyer \"used an experimental AI program to write his closing argument.\" In a <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.206880/gov.uscourts.dcd.206880.310.0.pdf\">motion for a new trial</a> filed Monday, the Fugees rapper's new lawyers say Michel's previous representation used \"an experimental AI program in which they had a financial stake to write the closing argument, resulting in a frivolous and ineffectual closing argument.\"</p>\n<p>Michel was represented at trial by defense counsel David Kenner, who is accused of failing to provide a cogent defense and misattributing two songs to the Fugees. The allegations about Kenner's use of AI are reminiscent of a <a href=\"https://arstechnica.com/tech-policy/2023/05/lawyer-cited-6-fake-cases-made-up-by-chatgpt-judge-calls-it-unprecedented/\">previous incident</a> in which a lawyer admitted using ChatGPT to help write court filings that cited six nonexistent cases invented by the artificial intelligence tool.</p>\n<p>According to the motion for a new trial, \"Kenner failed to familiarize himself with the charged statutes, causing him to overlook critical weaknesses in the Government's case,\" and he \"did not understand the facts or allegations.\"</p></div><p><a href=\"https://arstechnica.com/?p=1977018#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1977018&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"01424e7486295e2b1ee83623525be8412914c1db276f67a7c32c917beef7b7fb","category":"Tech"}