{"title":"Efficiency of IoT Adoption and Supply Chain Optimization: An Empirical Evidence from Nigeria","link":"https://www.preprints.org/manuscript/202410.1582/v1","date":1729498137000,"content":"The rapid expansion of the Internet of Things (IoT) is revolutionising industries by enhancing connectivity among people, systems, and objects. With IoT device numbers predicted to rise from 9.7 billion in 2020 to 29 billion by 2030, its integration into supply chain management is increasingly critical, improving transparency, efficiency, and decision-making. This study focuses on evaluating the impact of IoT on supply chain efficiency within five Nigerian companies, a region where IoT's potential remains largely untapped due to infrastructural and technological challenges.Methods: The research employed a quantitative methodology, with purposive sampling used to select 50 participants across the 5 selected companies, ensuring a comprehensive assessment of IoT's influence across diverse sectors. A structured questionnaire was administered online to 10 senior managers from each selected company, collecting data on IoT adoption levels, applications, and impacts on supply chain performance. Data analysis was conducted using IBM SPSS version 27, employing descriptive analysis and regression and correlation tests to examine the relationship between IoT adoption and supply chain metrics.Results: The analysis revealed a significant adoption rate of 74.4% across the companies, with notable enhancements in supply chain metrics. Specifically, a negative correlation coefficient of -0.345 was observed between IoT adoption and lead time, although this was not statistically significant (p=0.053). Inventory turnover showed marked improvement, with 60% of companies reporting increased efficiency in inventory management. Order accuracy saw substantial improvements, with 17 out of 43 respondents (39.5%) rating it as significantly enhanced. Despite these positive trends, challenges such as inadequate infrastructure and high implementation costs were significant barriers, affecting the full realization of IoT benefits.Conclusion and Recommendations: The study concludes that while IoT adoption shows promise in enhancing supply chain operations in Nigeria, the benefits are unevenly realized, largely influenced by existing infrastructural deficits and high initial costs. Recommendations include enhancing digital infrastructure, developing supportive regulatory frameworks, and implementing pilot projects to better integrate IoT solutions tailored to specific operational needs. Investing in local expertise and fostering public-private partnerships are also critical for overcoming barriers to IoT adoption and leveraging its full potential for supply chain enhancement in Nigeria.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"01426bd3833c81e937d1a7706b6d4208f29697af8f12ddfb400670cc12d7a0a7","category":"Interdisciplinary"}