{"title":"Self-inhibition of growth and allelopathy through volatile organic compounds in <i>Fusarium solani</i> and <i>Aspergillus fumigatus</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308383","date":1724767200000,"content":"<p>by Takae Takeuchi, Takahito Suzuki, Tomoko Kimura, Masato Kiuchi</p>\r\n\r\nMicrobial volatile organic compounds (VOCs) emitted from fungi are known as their secondary metabolites from environmental sources. However, their physiological roles remain to be unclear. Even though the roles are still unknown, VOCs are deliberately released to convey information to both homologous and non-homologous organisms. We investigated the effects of single VOCs (hexanal, benzaldehyde, heptanal, 2-ethyl-1-hexanol, 3-octanone, 2-undecanone, 3-octanol, 2-Phenylethanol, 2-phenyl-2-propanol, phenylbenzaldehyde, 2-pentadecanone, β-trans-bergamotene, β-bisabolene, 2-methyl-5 -(1-methylethyl)pyrazine) on the fungal growth. In parallel, application of the co-culturing system in a growth chamber allowed free gas and VOCs exchange between emitter colonies of <i>Fusarium solani</i> and <i>Aspergillus fumigatus</i>, or between colonies of different growth stages of the same species. Distinct self-inhibition occurred by the emitters of fungal growing colonies against receiver ones on the stage of conidial germination or against the younger colonies at an earlier stage in both fungi. Similarly, the phenomenon of allelopathy appeared to work between growing colonies of <i>F</i>. <i>solani</i> and the germinating conidia or young colonies of <i>A</i>. <i>fumigatus</i> or vice versa. Solid phase microextraction—gas chromatography/mass spectrometry revealed VOCs compounds of each fungi. In <i>F</i>. <i>solani</i>, hexanal and benzaldehyde appeared to be significant inhibitors for colony growth. Benzaldehyde inhibited filamentous growth but not conidial germination. In <i>A</i>. <i>fumigatus</i>, heptanal seemed to be an equivalent effector. The inhibitory effect of benzaldehyde was more distinct on the <i>A</i>. <i>fumigatus</i> conidial germination than its filamentous growth.","author":"Takae Takeuchi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0143e57925631645765456a56d995a1af6819bf962c78e93fc3cf7515811d836","category":"Interdisciplinary"}