{"title":"Impact of water, sanitation, and hygiene (WASH) interventions on gender-specific school attendance and learning outcomes: A systematic review and meta-analysis protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308144","date":1722520800000,"content":"<p>by Dinaol Bedada Dibaba, Bezatu Mengistie Alemu, Sisay Abebe Debela</p>\r\n\r\nThe Water, Sanitation, and Hygiene (WASH) interventions have been acknowledged for their role in the public health and educational outcomes. While there are strong evidences that reveal that WASH facilities do reduce the prevalence of infectious diseases and improve the learning environment, data remain thin and equivocal on the differential impacts of WASH facilities on education by gender. The literature reviewed does not, in most cases; go to the extent of investigating if indeed both men and women students have unique needs especially in underprivileged areas. This is the point from which the present systematic review and meta-analysis intend to fill this gap by assessing the global evidence on the effect of WASH interventions on educational outcomes with due consideration given to gender. This systematic review will include international databases used for the search, such as PubMed, Google Scholar, Web of Science, Europe PubMed Central, and Scopus. Study eligibility will include cross-sectional studies published in English on the impact of WASH interventions on school attendance and academic performance, stratifying gender-specific outcomes. Data extracted will be analyzed using the STATA software version 17. The percentage of heterogeneity will be quantified through the I<sup>2</sup> statistics to show the variability between the included studies. Based on the observed results, diversity will be checked among the outcomes of the study and based on that random-effect model will be used to estimate the pooled effect size. I will, therefore, make use of the Egger and Begg tests for checking statistical asymmetry. Publication bias will be assessed with funnel plots. These will ensure the methodologies used provide comprehensive and rigorous data analysis, which will give strong insights into the impacts of the WASH intervention on educational outcomes.\r\nProspero registration number: Systematic review and Meta-analysis registration number: PROSPERO CRD42024536477.","author":"Dinaol Bedada Dibaba","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0149641b74dde834e1194e8235151d6ba4d749faa75a5f7ef56ff49d73c453ca","category":"Interdisciplinary"}