{"title":"Review: Anker's Soundcore Frames Offer Bluetooth Audio Eyewear in a Range of Styles","link":"https://www.macrumors.com/review/anker-soundcore-frames/","date":1635760800000,"content":"Anker's audio brand <a href=\"https://www.anrdoezrs.net/click-462641-13909589\">Soundcore</a> last month announced the Soundcore Frames, modular Bluetooth glasses frames that offer open-ear audio and interchangeable front frames for a variety of looks. The Soundcore Frames start at $200 for a standard kit and begin shipping today, but I've been trying them for the past couple of weeks and have come away impressed with their looks, versatility, and performance.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/soundcore-frames-worn.jpg\" />\r\n<br />\r\nThe Soundcore Frames consist of a pair of temple pieces that support the glasses and include all of the electronics, paired with a choice of 10 frame options in various shapes, sizes, and styles.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/soundcore-frames-kit.jpg\" />\r\n<br />\r\nAnker sent me a basic kit with a Tour Style frame, but also included Harbor Style, Landmark Style in clear, black, and tortoise shell, Festival Style, Wander Style, Marina Style, and Promenade Style. There is also a Cafe Style option available that I did not receive for testing.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/soundcore-frames-fronts.jpg\" />\r\n<br />\r\nSwapping between front frames is very simple, as all you have to do is pull the temple pieces out of the slots on front frame and insert them into your new frame. It does require a bit of force to remove them, but that's a good thing to ensure they stay together during use, and they snap in easily.\r\n<br />\r\n\r\n<br />\r\nIn addition to the temple pieces and a front frame, the standard Soundcore Frames kit also comes with a special USB-A charging cable to connect to the glasses and a collapsible case that helps protect the glasses when not in use.\r\n<br />\r\n\r\n<br />\r\n<h2>Setup and Tap/Swipe Controls</h2>\r\n<br />\r\nSetting up the Soundcore Frames is super simple, requiring only that they be paired to your device through the standard Bluetooth settings, and then the Soundcore app can be used to customize controls, sound profile, and more. The app also manages firmware updates for the glasses themselves.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/soundcore-frames-app.jpg\" />\r\n<br />\r\nThe Frames include both touch and voice controls, and the two sides of the glasses can be configured for different functions. With double-tap and forward/backward swipe gestures, a total of six functions can be configured.\r\n<br />\r\n\r\n<br />\r\nI set mine up so that the right temple controls play/pause with a double-tap and track skip forward and backward with swipes, while the left temple activates <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> with a double-tap and volume up and down with swipes.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/soundcore-frames-controls.jpg\" />\r\n<br />\r\nThe gestures took a little bit of getting used to, but once I got the hang of them, they worked well. I found that I was initially double-tapping too quickly, and putting a bit more of a pause between the taps yielded more consistent results. Similarly, I needed to make sure there was a bit of a pause between swipes, such as if I was trying to raise the volume by several levels at once.\r\n<br />\r\n\r\n<br />\r\n<h2>Voice Controls</h2>\r\n<br />\r\nIn addition to the swipe controls, the Soundcore Frames also support voice commands. Once the feature is turned on, no special wake word is required, with the Frames responding to a handful of specific phrases including \"stop/resume playing,\" \"next/previous song,\" \"volume up/down,\" and \"answer/reject the call\".\r\n<br />\r\n\r\n<br />\r\nVoice control worked quite well in my testing, consistently picking up my commands and immediately responding with only a few misses.\r\n<br />\r\n\r\n<br />\r\nAs with many other earphones, the Soundcore Frames support the native voice assistant on your connected device, so in the case of Apple's ecosystem, that means you can interact with ‌Siri‌ through the microphone and speakers in the Soundcore Frames. I was able to place phone calls, check the time, and more by simply double-tapping on the left side and making my requests to ‌Siri‌.\r\n<br />\r\n\r\n<br />\r\n<h2>Design and Fit</h2>\r\n<br />\r\nThe temple pieces are definitely chunky in order to hold all of the electronics, but I didn't find the size overly distracting from the look or particularly uncomfortable to wear. Their black design minimizes their obtrusiveness, although there is some small Soundcore branding on each side.\r\n<br />\r\n\r\n<br />\r\nI'm normally a glasses wearer with occasional contacts usage, and the Soundcore Frames are unsurprisingly heavier than my regular glasses. With most of the weight being toward the back over the ears, I found the Soundcore Frames to still be fairly comfortable, although I did feel a bit of pressure from the nose pads after several hours.\r\n<br />\r\n\r\n<br />\r\n<h2>Audio Quality</h2>\r\n<br />\r\nI found the audio quality to be perfectly acceptable, but you're certainly not going to be getting audiophile quality out of these. That's to be expected considering these are an open-ear design where the sound comes from small speakers embedded in the temple pieces, and you're more likely to be using these when you're out and about than for serious music listening.\r\n<br />\r\n\r\n<br />\r\nThere are actually two speakers on each side, a primary one located just in front of your ear and a secondary one behind the ear to assist with stereo.\r\n<br />\r\n\r\n<br />\r\nWith the open-ear system, people around you will definitely be able to hear your audio unless you have the volume set very low, so that's something to be aware of. There is a privacy mode available in the Soundcore app that helps minimize sound leakage in quiet environments, but it was hard to tell just what it does beyond reducing volume.\r\n<br />\r\n\r\n<br />\r\nThe Frames offered good stereo separation in my experience, and there's also an OpenSurround mode with seven levels that offers a \"concert-like experience\" that's more immersive than standard stereo and works pretty well, although it feels like you lose some bass as it has more of an airy sound.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/11/soundcore-frames-eq.jpg\" /><em>Privacy Mode pop-up explanation and equalizer presets and custom configuration</em></div>\r\n<br />\r\nThe Soundcore app allows you to configure equalizer settings for various sound profiles, including a handful of presets and the ability to save custom configurations. I found the Bass Booster preset to be my favorite as it helps compensate a bit for the shortcomings of the tiny speakers.\r\n<br />\r\n\r\n<br />\r\nWhile the Soundcore Frames are handy for listening to music, where I found their utility particularly noteworthy was when it came to phone calls. Being able to chat on the phone while leaving my phone in my pocket and without having anything in my ears is super convenient both around the house and while out and about. Phone audio is as crisp and clear on my end as it is directly through the phone, and listeners on the other end of the line had no problem hearing my voice in our testing.\r\n<br />\r\n\r\n<br />\r\nBluetooth range has proven to be solid for me, as I was able to leave my phone in my office and move to a different floor at the opposite end of my house before I lost the audio connection.\r\n<br />\r\n\r\n<br />\r\n<h2>Charging</h2>\r\n<br />\r\nCharging the Soundcore Frames is incredibly simple, with the custom USB-A cable included in the box. The cable has two inline magnetic charging units that snap onto contacts on each temple piece when the glasses are folded. LEDs on the charging units shine green while the frames are charging and turn off once charging is completed.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/soundcore-frames-charging.jpg\" />\r\n<br />\r\nAs long as your frames have a charge and you've already paired them to your device, they automatically power on and connect to your device when you put them on your face. Thanks to proximity sensors, they can automatically play and pause audio when you put them on and take them off, and once you take them off, the frames will completely power down after two minutes.\r\n<br />\r\n\r\n<br />\r\n<h2>Battery Life</h2>\r\n<br />\r\nAnker says the Soundcore Frames offer up to 5.5 hours of audio playback per charge, with a fast fuel feature delivering 1.5 hours of battery life after just 10 minutes of charging. My usage was roughly in line with Anker's stated figures, so they offered plenty of battery life for my daily activities.\r\n<br />\r\n\r\n<br />\r\n<h2>Lens Options</h2>\r\n<br />\r\nThe Soundcore Frames come in both clear blue-light filtering and sunglasses options, with most of the sunglasses options being polarized. If you're a prescription glasses wearer, you can take the frames to your optometrist to have prescription lenses custom made for your desired frame style, although that obviously adds to the overall expense.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/11/soundcore-frames-try-on.jpg\" /><em>Virtual try-on in the Soundcore app</em></div>\r\n<br />\r\nThe Soundcore app and website include a virtual try-on experience using your device's camera, letting you see how the different frame options will look on you.\r\n<br />\r\n\r\n<br />\r\n<h2>Wrap-up and How to Buy</h2>\r\n<br />\r\nEven after a week or so of testing, my biggest question mark with the Soundcore Frames remains whether the use case for the audio/phone capabilities sufficiently overlaps with the use case for glasses. As someone who primarily wears glasses, I'm not inclined to spend the money to get prescription lenses in these and wear them as my full-time glasses. I don't necessarily want iPhone-connected glasses on at all times and I don't want to be swapping between glasses throughout the day.\r\n<br />\r\n\r\n<br />\r\nSo that limits me to the times I'm wearing contacts, which obviously applies more broadly for people who don't wear glasses at all. Around the house and other indoor settings, perhaps using blue-light filtering lenses as computer glasses might be handy so I can stay connected for music and phone calls both at my desk and while wandering around the house without needing to wear earphones, so that's something I'll have to explore a bit more.\r\n<br />\r\n\r\n<br />\r\nBut based on Anker's promotional materials, the intended primary use case is as sunglasses. If I'm outside all day on a bright day, I can certainly see these being handy. But if it's more marginally sunny or I'm going in and out of buildings, the need to take my sunglasses on and off may frequently not match up with the times I want or need the audio and phone functionality. For that reason, separate earphones and standard sunglasses are a more useful combination for me than putting both functions in one product.\r\n<br />\r\n\r\n<br />\r\nStill, I can't deny that it feels cool to be able to just wander around and listen to music and talk on the phone with nothing in my hands or ears. So what I can recommend is to carefully consider the situations where you might be able to use the Soundcore Frames, and if they seem reasonable to you, you might want to give these a shot.\r\n<br />\r\n\r\n<br />\r\nThey're not the only option for audio sunglasses on the market, as seen in our previous <a href=\"https://www.macrumors.com/2021/02/24/hands-on-bose-tenor-sunglasses/\">hands-on with Bose's Frames Tenor sunglasses</a>, but I do like the interchangeable frames on Soundcore's version so you can have a more individualized look and even change your look depending on your mood or activities.\r\n<br />\r\n\r\n<br />\r\nI think the overall product is a solid one that's well-executed, but you'll need to decide for yourself whether it's something you'll get enough use out of to make a purchase worthwhile.\r\n<br />\r\n\r\n<br />\r\nThe Soundcore Frames are launching today via the <a href=\"https://www.anrdoezrs.net/click-462641-13909589\">Soundcore website</a> and <a href=\"https://bestbuy.7tiv.net/vnxrnW\">Best Buy</a>, with the basic kit including one frame style of your choice priced at $199.99 and additional front frames available for $49.99 each.\r\n<br />\r\n\r\n<br />\r\n<em><small>Note: Anker provided MacRumors with Soundcore Frames and additional front frames for the purpose of this review. No other compensation was received. MacRumors is an affiliate partner with Anker/Soundcore and Best Buy. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.</small></em><div>Tags: <a href=\"https://www.macrumors.com/guide/anker/\">Anker</a>, <a href=\"https://www.macrumors.com/guide/soundcore/\">Soundcore</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/anker-soundcore-frames/\">Review: Anker's Soundcore Frames Offer Bluetooth Audio Eyewear in a Range of Styles</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-ankers-soundcore-frames-offer-bluetooth-audio-eyewear-in-a-range-of-styles.2321094/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=YDa3zk2KM0E:u0aTyLngOO8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=YDa3zk2KM0E:u0aTyLngOO8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/YDa3zk2KM0E\" />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"014f72b35483d81f15c0a11df2f77b1802b6548f492c7441b9dce216facd16b7","category":"Apple"}