{"title":"PSXIII-2 Does choice of apparatus affect detergent fiber fractions across forage types?","link":"https://academic.oup.com/jas/article/102/Supplement_3/615/7757811?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Since the 1960s, detergent fiber fractions have had a fundamental role in animal nutrition. Not only was this system an improvement on measurement of cell wall material, it has also helped advance our understanding and prediction of forage intake and digestibility. The ANKOM fiber analyzer, introduced in the 1990s, streamlined the assay, and multiple technical improvements have been introduced that increased the level of automation in the procedure. To date, however, there has not been an evaluation of the influence the choice of apparatus has on the results. The objective of this study was to determine the effect of fiber analyzer apparatus on recovery of detergent fiber fractions of various forage species. The study was designed as a randomized complete block design with a two-factor factorial treatment structure. The first treatment factor was fiber analyzer (ANKOM 200, ANKOM 2000, or ANKOM Delta), and the second treatment factor was forage (n = 12). Forages were ground to pass through a 1-mm screen and sealed in F57 fiber bags. All bags were subjected to neutral detergent fiber (NDF) and acid detergent fiber (ADF) assays according to manufacturer instructions in their designated fiber analyzer. After the ADF assay, samples were subjected to the acid detergent lignin (ADL) assay using the ANKOM Daisy<sup>II</sup> incubator. Data were analyzed using the GLIMMIX procedure of SAS 9.4. Across forage species, NDF concentrations were less (<span>P</span> = 0.02) from the manual ANKOM 200 (61.4%) than from ANKOM Delta or ANKOM 2000 (63.3 and 63.1%, respectively). Across forages, ADF was greatest (<span>P</span> &lt; 0.01) from ANKOM 2000 (37.8%), followed by ANKOM Delta (36.2%), and least from ANKOM 200 (34.8%). However, these differences did not carry through as there was no effect of fiber analyzer on ADL concentrations (<span>P</span> = 0.67). Results are interpreted to mean that, across forage species, choice of fiber analyzer may have an influence on detergent fiber concentrations. However, these differences are minimized in the automated systems relative to the older, more manual apparatus.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0152841f011e070de10f208f23f7d17f6d531e859f60baa893b0de63eaa09a56","category":"Environment"}