{"title":"Candida albicans Mannosidases, Dfg5 and Dcw1, Are Required for Pathogenesis","link":"https://www.preprints.org/manuscript/202406.1097/v1","date":1718605947000,"content":"C. albicans Dfg5 and Dcw1 are homologous cell wall alpha-1,6-mannosidases with important functions. Our past studies have shown that Dfg5 and Dcw1 function in cell wall biogenesis via cross-linking of glycoproteins into the cell wall, thus playing a key role in cell wall integrity. Additionally, Dfg5 and Dcw1 are required for hyphal morphogenesis. However, the exact functions of Dfg5 and Dcw1 in cell wall integrity, hyphal morphogenesis, and pathogenesis were not known. In this study, we determined the relation of Dfg5 and Dcw1 with Hog1 MAPK, that plays a key role in cell wall integrity via regulation of chitin synthesis in C. albicans. Additionally, we also determined the effect of dfg5 and dcw1 mutations on gene expression of transcriptional regulators of hyphal morphogenesis. Furthermore, we determined the effects of dfg5 and dcw1 mutations on pathogenesis in a mouse model of oral candidiasis. Our results demonstrate that dfg5 and dcw1 mutations, as well as hog1 knock-out mutation result in dysregulation of chitin synthesis resulting in a cell separation defect. The heterozygous and conditional mutations of dfg5 and dcw1 result in decreased levels of Cst20, a positive regulator of hyphal morphogenesis. However, mutations of dfg5 and dcw1 mutations resulted in increased levels of all the five negative regulators of hyphal morphogenesis – Tup1, Nrg1, Mig1, Rbf1 and Rfg1. However, Tup1 levels were significantly higher than other negative regulators indicating that Dfg5 and Dcw1 function in hyphal morphogenesis by repression of Tup1. Finally, dfg5 and dcw1 mutations affected the ability of C. albicans to cause oral candidiasis in mice. Thus, cell wall glycosidases, Dfg5 and Dcw1, are required for virulence and pathogenesis and represent novel drug targets.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0154fcdc794288c3d4b69222f334230cbab6c5ddff94ee55489139a5713fe49b","category":"Interdisciplinary"}