{"title":"Ganoderma from Cuba: an approach to some species based on morphology and phylogenetic analyses","link":"https://academic.oup.com/biolinnean/article/140/3/323/7252213?rss=1","date":1693008000000,"content":"<span><div>Abstract</div><span>Ganoderma</span> is a genus of wood-decaying polypores fungi with several species, in which morphological delimitation has been challenging due to its large plasticity. Knowledge of the taxonomic diversity of <span>Ganoderma</span> in Cuba remains incomplete. Here, we identified some species, mainly laccate, of <span>Ganoderma</span> present in Cuba based on morphological and phylogenetic data and investigated their relationships with other species. Type specimens, recently collected materials, herbarium specimens and <span>in vitro</span> cultures were studied to delimit morphological species. The phylogenetic affinities of ten species were inferred based on multilocus (ITS rDNA, <span>rpb2</span>, <span>tef1-α</span>) DNA sequences to delimit phylogenetic species. In this work, 14 species of <span>Ganoderma</span> were recognized in Cuba, of which <span>G. amazonense</span>, <span>G. curtisii</span>, <span>G. dussii</span> and <span>G. multiplicatum</span> are reported for the first time. <strong><span>Ganoderma rodriguezii</span> sp. nov.</strong> is described as a novel species. We confirmed <span>G. amazonense</span> is a non-laccate species although it is phylogenetically affine to laccate species. An identification key for studied species, nomenclatural information, updated descriptions and geographical distributions are presented. The lectotypification in second step of <span>﻿G. perzonatum</span>, <span>﻿G. pulverulentum</span> and ﻿<span>G. zonatum</span> was made here. To correctly interpret <span>G. perzonatum</span>, recent collections, including live strains from the type locality, are described. We confirm <span>G. lucidum</span> is not present in Cuba, despite previous records from the country.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"0154f747a01369ae6668f409d1cb3a7a47d0d990c124c3371796ee20b72be3e3","category":"Environment"}