{"title":"Predictors of change in early child development among children with stunting: Secondary analysis of a randomized trial in Uganda","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003456","date":1723730400000,"content":"<p>by Joseph Mbabazi, Hannah Pesu, Rolland Mutumba, Gareth McCray, Christian Ritz, Suzanne Filteau, André Briend, Ezekiel Mupere, Benedikte Grenov, Henrik Friis, Mette F. Olsen</p>\r\n\r\nMillions of children under 5 years in low- and middle-income countries fail to attain their development potential with accruing short- and long-term consequences. Low length/height for age (stunting) is known to be a key factor, but there is little data on how child characteristics are linked with developmental changes among children with stunting. We assessed the socioeconomic, household, anthropometric, and clinical predictors of change in early child development (ECD) among 1–5-year-old children with stunting. This was a prospective cohort study nested in a randomized trial testing effects of lipid-based nutrient supplementation among children with stunting in Uganda. Development was assessed using the Malawi Development Assessment Tool (MDAT). Multiple linear regression analysis was used to assess for predictors of change. We included 750 children with mean ±SD age of 30.2 ±11.7 months 45% of whom were female. After 12 weeks, total MDAT z-score increased by 0.40 (95%CI: 0.32; 0.48). Moderate vs severe stunting, higher fat-free mass, negative malaria test and no inflammation (serum α-1-acid glycoprotein &lt;1 g/l) at baseline predicted greater increase in ECD scores. Older age and fat mass gain predicted a lesser increase in ECD. Our findings reinforce the link between stunting and development with more severely stunted children having a lesser increase in ECD scores over time. Younger age, freedom from malaria and inflammation, and higher fat-free mass at baseline, as well as less gain of fat mass during follow-up predicted a higher increase in developmental scores in this study. Thus, supporting fat-free mass accretion, focusing on younger children, and infection prevention may improve development among children with stunting.","author":"Joseph Mbabazi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"01578e60c44f1e917e9785c823ffd00895a38f816bb751ba4d69e1ac8a9aca05","category":"Environment"}