{"title":"The Wheel of Time show totally changes who the story’s main character is","link":"https://arstechnica.com/?p=1819372","date":1639139707000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200303_THIJAN_00215_1-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200303_THIJAN_00215_1.jpg\">Enlarge</a> <span>/</span> Egwene and Moiraine discuss Perrin's sudden case of acute wolfishness. (credit: Amazon Studios)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Andrew Cunningham and Lee Hutchinson have spent decades of their lives with Robert Jordan and Brandon Sanderson's <em>Wheel of Time</em> books, and they're bringing that knowledge to bear as they <a href=\"https://arstechnica.com/gaming/2021/11/ars-is-reviewing-amazons-the-wheel-of-time-series/\">recap each episode</a> of Amazon's new <em>WoT</em> TV series. These recaps won't cover every element of every episode, but they will contain major spoilers for the show and the book series. If you want to stay unspoiled and haven't read the books, these recaps aren't for you.</p>\n<p>New episodes of <em>The Wheel of Time</em> will be posted to Amazon Prime subscribers every Friday.</p>\n<aside>\n  <h2>The Wheel of Time season one</h2>\n\t<ul>\n\t    <li><a href=\"https://arstechnica.com/gaming/2021/12/andrew-and-lee-talk-about-which-characters-kiss-in-wheel-of-times-latest-episode/\"><em>The Wheel of Time</em> show totally changes who the story’s main character is</a></li>\n      <li><a href=\"https://arstechnica.com/gaming/2021/12/the-wheel-of-times-fifth-episode-is-bookended-by-funerals/\">Andrew and Lee do <em>The Wheel of Time</em> episode five: Funerals everywhere!</a></li>\n      <li><a href=\"https://arstechnica.com/gaming/2021/11/wheel-of-time-book-reader-recap-episode-4-who-is-the-dragon-reborn/\">Andrew and Lee continue watching <em>The Wheel of Time</em>—and it’s getting real</a></li>\n      <li><a href=\"https://arstechnica.com/gaming/2021/11/two-book-readers-recap-the-first-three-episodes-of-amazons-the-wheel-of-time/\">Andrew and Lee dissect <em>The Wheel of Time’s</em> television premiere</a></li>\n      <li><a href=\"https://arstechnica.com/gaming/2021/11/ars-is-reviewing-amazons-the-wheel-of-time-series/\">Ars is reviewing Amazon’s <em>The Wheel of Time</em> series</a></li>\n    </ul>\n  <span><a href=\"https://arstechnica.com/series/the-wheel-of-time-season-one/\">View more stories</a></span>\n</aside>\n\n<div>\n<p><strong>Andrew</strong>: Put your ear to the ground, Lee. Can you hear it? That’s the sound of every <em>Wheel of Time</em> shipper losing their whole minds over this week’s episode.</p>\n<p>There’s a bunch more to talk about, and we’ll get to most of it, but this episode’s introduction of Siuan Sanche, the fisherman’s daughter who became the Amyrlin Seat, is inarguably the focal point.</p>\n<p>I think you and I might have <em>slightly</em> different feelings about how her character was handled, particularly around The Big Thing, but I’ve got to say I think this was an outstanding capper for the show’s mid-season Aes Sedai interlude. It establishes Siuan’s meteoric rise and her character’s different public and private faces, while also establishing the authority and power of the Amyrlin Seat and the entire Aes Sedai organization. But it’s also clear in a bunch of little ways that Aes Sedai power is waning and Siuan’s position is more precarious than it seems. You get more information on what Moiraine has been chasing with the Two Rivers folks and why. And yeah, there’s some serious smooching.</p>\n</div>\n<div><strong>Lee</strong>: Before we dig into the big stuff, though, I’ve got a question. Our Amyrlin Seat, Siuan Sanche, gets a nice little introduction as the poor fisherman’s daughter. But does this mean Nynaeve was lying or otherwise misinformed when she mentioned <a href=\"https://arstechnica.com/gaming/2021/11/two-book-readers-recap-the-first-three-episodes-of-amazons-the-wheel-of-time/\">back in the first episode</a> that the White Tower turns away poor people? It seemed an odd thing to say at the time, given that the White Tower regards women who can channel as their actual-for-real property, and in Siuan we have an example of a girl who clearly came from nothing not just being accepted for training, but becoming the Amyrlin Seat. Am I just getting too caught up in the details, or is there a piece missing in this puzzle?</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_201012_THIJAN_00184_1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_201012_THIJAN_00184_1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_201012_THIJAN_00184_1_thumb.jpg\">Young Siuan, prior to her journeying to Tar Valon to become an Aes Sedai.</a> (credit: Amazon Studios)</p></div>\n<div>\n<p><strong>Andrew</strong>: Ah, that’s interesting. I do think generally when a character in the show has told us something, it’s because the show itself wants us to know that thing and take it at face value. That’s how most of the lore dumps seem intended to be read, at any rate. But with context from the books you can more easily assume that misinformation about the White Tower and its practices runs rampant the farther you get from Tar Valon, and Nynaeve could easily be misinformed. Or maybe the Aes Sedai more readily take in refugees from channeling-averse nations like Tear. At any rate, it didn’t occur to me to be bothered by it.</p>\n<p>It’s clear that the Aes Sedai in the show, as in the books, seem to think that you leave most of your old life behind when you join up—note how scandalized the room is when Siuan dresses down Moiraine <em>Damodred</em>, wielding her noble family’s name as a weapon. The read I still get is that Aes Sedai hierarchy is determined more by channeling strength than prior economic or social circumstances.</p>\n<p>OK, now let’s talk about kissing??</p>\n</div>\n<div>\n<p><strong>Lee</strong>: Moiraine and Siuan, sitting in a tree...</p>\n<p>OK, I admit, when Moiraine popped into Siuan’s rooms via a…what, <a href=\"https://wot.fandom.com/wiki/Ter%27angreal\">a <em>ter’angreal</em></a>? Gotta be a <em>ter’angreal</em>, right? When she popped in there and they started making out, my first reaction was to roll my eyes. The books imply (maybe more than imply) that the two of them used to have a thing going back to when they were novices, but the books also imply (maybe more than imply!) that it’s pretty normal for novices to have “pillow friends” to help them get through the hardships of apprentice life in the Tower. Having Moiraine and Siuan jump each others’ bones now, though, felt... maybe just a bit performative and male-gaze-y?</p>\n<p>My gut reaction was, “These are two powerful women who are both Blue Ajah, who commit themselves to politics and causes—isn’t it kind of disrespectful to imply that they need to have a romantic relationship, too? Can’t the fact that they’ve both dedicated their lives to finding the Dragon Reborn be a powerful enough bond?” But I’ve had a few conversations about it with my wife and also with my cousin Shaun (who is an excellent author—<a href=\"https://www.amazon.com/dp/1481449648/?tag=arstech20-20\">go buy his books</a>!), and I think now I’m on the side of this being an expedient storytelling way to establish just how all-in they are on trying to save the world. And having someone to love—actually love, not just Warder-bond-share with—is also a good way to tie them to the realness of the world, rather than simply having them tie themselves to ideals.</p>\n<p>I dunno, these are deep waters to navigate, but I think I’m sold on the idea of them being together. It works, and especially on the back of the stuff I’m reading about the showrunner’s <a href=\"https://reddit.com/r/television/comments/r19e96/im_rafe_judkins_showrunner_and_executive_producer/\">commitment to lore</a>, I’m willing to trust the narrative.</p>\n</div>\n<div><a name=\"page-2\"></a></div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200211_THIJAN_00097_1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200211_THIJAN_00097_1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200211_THIJAN_00097_1_thumb.jpg\">Moiraine stops for some tea and serenity.</a> (credit: Amazon Studios)</p></div>\n<div>\n<p><strong>Andrew</strong>: It’s certainly valid to feel like it’s needlessly sexualized! And regardless, it’s definitely a storytelling shortcut that more quickly conveys these characters’ closeness. But I think it’s of a piece with the general updating (or, less charitably, “sexing up”) that the show has done elsewhere. Rand and Egwene clearly had sex in the first episode, rather than blushing at each other from across a room. At least a couple of Alanna’s Warders (I’m pretty sure they’re Alanna’s) are gay or bi.</p>\n<p>The books’ fusty “pillow friends” conception of homosexuality, as something that you mostly experiment with in youth to get it out of your system and then politely refuse to talk about for the rest of your life, would seem pretty stilted and weird in this new context. Which is to say, I am 100 percent in the tank for a Siuan/Moiraine romance. Though as with so many things, it could ripple out to the rest of the story in unexpected ways depending on which of the books’ characters and threads are picked up in future seasons.</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200304_THIJAN_00502_1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200304_THIJAN_00502_1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200304_THIJAN_00502_1_thumb.jpg\">An older, wiser Siuan is now the Amyrlin Seat.</a> (credit: Amazon Studios.)</p></div>\n<div>\n<p><strong>Lee</strong>: We shall see!</p>\n<p>The big centerpiece scenes of the episode take place in the Hall of the Tower, where the Amyrlin Seat rules and dispenses justice. And although I’ve dogged on the set design and visuals before, I love the Hall—especially the overhead shots, with all the circular/wheel imagery. If there’s one complaint, it’s that nobody’s wearing the infamous Aes Sedai shawls that the books go on and on about—though since the shows have gone ahead and just flat-out explicitly clothed all the Aes Sedai in the colors of their ajahs, having everybody wearing grandma shawls might be a little stuffy.</p>\n<p>We get a nice look at some Tower politics, both during and after that scene—Moiraine’s superiors in the Blue Ajah want her to stay in the Tower for a while, and there’s also a great hallway scene where Moiraine threatens to expose what might be a secret affair Liandrin is having with (gasp!) A MAN.</p>\n<p>...though, as my wife pointed out, Liandrin may not be having an affair with anyone. There might be, how do you say, <em>darker</em> things at play.</p>\n</div>\n<div>\n<p><strong>Andrew</strong>: Yeah I’ve consistently enjoyed the Aes Sedai stuff we’ve gotten in the last three episodes, from the encampment a couple episodes ago to the stay in Tar Valon. The thing that the show needs to do that <em>Eye of the World</em> didn’t is to make the world feel bigger and more complex from the jump, and taking the show to what is arguably Randland’s largest and most important power center is a good way to do that. This episode sows all kinds of seeds that will be harvested in future seasons, including a vague mention of disappearing ships to the west (the Seanchan) and another mention of the Aiel.</p>\n<p>This episode largely bands the original party back together again, and as we enter the Ways I suspect that the season’s last couple episodes will go back to following the events of <em>EotW</em> at least a bit more closely. But regardless, six episodes into the season, the show’s biggest change is its shift in perspective—in the books, Rand is our main protagonist, and Moiraine is a remote, mysterious instigator who keeps the story moving. Of <a href=\"https://wot.fandom.com/wiki/Statistical_analysis#Unique_POV_Breakdown_2\">the 310,191 words in Eye of the World</a>, we get 246,816 of them from inside Rand’s head and just 124 from inside Moiraine’s. But the show has made Moiraine the story’s central figure, aided by Rosamund Pike’s ability to absolutely kill every scene she’s in.</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200205_THIJAN_00097_1_thumb-1.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200205_THIJAN_00097_1_thumb-1-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200205_THIJAN_00097_1_thumb-1.jpg\">Loial the Ogier helps Moiraine and Lan prepare for a creepy journey.</a> (credit: Amazon Studios)</p></div>\n<div>\n<p><strong>Lee</strong>: And we’re also spending time in the show playing this lovely game of “Who’s the Dragon Reborn?” Book readers know what’s up, but it’s been rewarding to hear second-hand reports from friends who are cutting their teeth on the TV series—at least one person in my circle of friends is convinced that Nynaeve has <em>got</em> to be the Dragon.</p>\n<p>I do want to talk a bit more about some scenes in this episode, but there’s one thing I’ve got to bring up: the Eye of the World itself. I won’t get into the nature of the Eye in the books, or how it figures into the first book’s finale, but going by Moiraine’s dialogue we’re about to take a bit of a turn—we’re heading into the Ways to quickly travel to the Eye of the World, which we are told is the site of the Dark One’s prison. This threw me quite a bit when I heard it! Sorry for playing “The Show is Different Than the Books” again, but this one’s a pretty big deal—the Dark One’s prison obviously has series-long implications, and this is a switch. What do you think?</p>\n</div>\n<div>\n<p><strong>Andrew</strong>: Depends on whether the Eye is <em>also</em> what it is in the books, or if they’re just using it as a fancier word to refer to what we know in the books as “the Bore” (which is a reference to the patched-up hole that’s been drilled into the Dark One’s prison and not a boring character like, say, Elayne. I kid, all you Elayne fans!!). It’s all wrapped up in the changes the show has made to how the One Power works, and we’re still waiting to learn a lot of the particulars there.</p>\n<p>Honestly the biggest tell in the Who’s the Dragon game is how everyone except Rand has picked up some new power or mysterious malady since leaving home. Sure, you’ve got a couple people telling him he’s definitely an Aiel and not A Normal Lad From The Two Rivers, but show viewers have no real reason to make the jump from “Rand is adopted” to “Rand is the Messiah.” At least not that I’ve caught.</p>\n<p>You do seem to be right in your speculation that Moiraine, and not Elyas Machera, will be the one to fill Perrin in on his still-developing case of wolf-itis, by the way. She clearly knows what’s up when she tells Egwene that she definitely should not tell anyone else about his golden eyes.</p>\n</div>\n<div><a name=\"page-3\"></a></div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200304_THIJAN_00866_1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200304_THIJAN_00866_1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200304_THIJAN_00866_1_thumb.jpg\">The (brief) trial of Logain before the Amyrlin Seat.</a> (credit: Amazon Studios)</p></div>\n<div>\n<p><strong>Lee</strong>: And we have some resolution to Mat’s KNIFE MADNESS! Moiraine has finally ferreted out his location—with a bit of Aes Sedai twistiness—and she channels the madness right out of him. It’s a well-done little scene, with Moiraine maintaining a cool saidar-enveloped detachment even as the evil madness goop tries to eel its way into her face-holes, and poor Mat seems a little bit less pale and gross after it’s over with.</p>\n<p>Pike is doing a killer job of manifesting the loss that the characters feel when they’re finished channeling and they release the True Source—she seems untouchable while she exorcises the evil out of Mat, then sags back with feeling the physical cost of wielding so much of the power. I just can’t say enough of her portrayal of Moiraine—she’s perfect. (And I’m so glad we finally get to see her little blue jewel thing on her forehead in the tower hall scene!)</p>\n</div>\n<div>\n<p><strong>Andrew</strong>: KNIFE MADNESS or no, show-Mat remains a dour presence who evinces little of the joyful-trickster vibe that makes book-Mat a fan favorite. Maybe that’s harsh, but I feel like I have warmed to every other character on the show except him, at this point.</p>\n<p>I hesitate to blame Barney Harris for this, because I don’t think the writing is doing him any favors. Rand, Perrin, and Mat are all a bit underdeveloped at this point, just because they’ve had less to do than Moiraine, Lan, Nynaeve or (to a lesser extent) Egwene. And I think Rand and Perrin are both still coming off as more fundamentally sympathetic in a way that Mat isn’t yet.</p>\n</div>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200203_THIJAN_00337_v1_thumb.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200203_THIJAN_00337_v1_thumb-640x426.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/WOFT_S1_UT_106_200203_THIJAN_00337_v1_thumb.jpg\">Poor Mat. Dude just can't catch a break.</a> (credit: Amazon Studios)</p></div>\n<div><strong>Lee</strong>: Give the guy some slack—unlike his book counterpart, he comes from an abusive home! Though, yeah, it’s not doing his character any favors.</div>\n<div>\n<p><strong>Andrew</strong>: Yeah, I know, I know. Maybe that’s a part of it, actually? The show’s shortcut for “why we should feel for Mat” is that he had abusive and absent parents and because he tries, in his way, to shield his little sisters from some portion of that abuse and absence. But then he leaves town? For good reason, and still to protect them! But still.</p>\n<p>So we get to see less of that side of him, because none of the other characters who make that dynamic work are actually around, and then we get tossed straight into KNIFE MADNESS. The show sucks the carefree roguishness from Mat’s character and doesn’t replace it with anything. It’s not as immediately frustrating as “giving Perrin a wife just so he can accidentally kill her and then feel awful about it,” but in the long run I think it’s been a liability.</p>\n<p>This is all to say that this episode’s cliffhanger, in which the party enters the Ways but Mat chooses to stay behind at the last minute, took what I hoped would be a post-KNIFE MADNESS bright spot for show-Mat and soured it.</p>\n</div>\n<div>\n<p><strong>Lee</strong>: That’s a good point—I think my brain has been automatically filling in all that stuff for Mat. I already “know” he’s a roguish fun gambler who loves to toss the dice, but you’re absolutely right in that none of that has really been shown. Show viewers who don’t know the character might indeed be left with some odd impressions.</p>\n<p>Regardless, that’s where this episode leaves us—with Mat hanging back as the rest of The Gang plunges ahead into the darkness of the Ways. Which, if the spooky darkness wasn’t enough to tip you guys off, are gonna be kinda creepy.</p>\n<p>And that, dear readers, is it for this week. We’ve got two episodes left for the season, so check back next week to continue the journey. Peace favor your sword, Andrew!</p>\n</div>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/Wheel-icon-e1637336031883.jpg\" /><p>(credit: <a href=\"https://wot.fandom.com/wiki/Category:Chapter_art\">WoT Wiki</a>)</p></div>\n\n</div><p><a href=\"https://arstechnica.com/?p=1819372\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1819372&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"015b7fd5b8890722eb7edd85147b0539288f401df16f0ae46138f0f719b1b1cc","category":"Tech"}