{"title":"Long‐term changes in multi‐trophic diversity alter the functioning of river food webs","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14593?af=R","date":1722927600000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/ff838bac-1ed2-4593-a71f-555e3c52a89b/fec14593-toc-0001-m.png\" alt=\"Long-term changes in multi-trophic diversity alter the functioning of river food webs\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/05/08/human-pressure-drives-the-functioning-of-riverine-food-webs/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nIncreasing human pressures threaten fish diversity, with potentially severe but unknown consequences for the functioning of riverine food webs.\n\nUsing a 17-year dataset from multi-trophic fish communities, we investigated the long-term effects of human pressure on the diversity and food web functioning. Combining metabolic scaling and ecological network principles, we calculate the annual energy fluxes through trophic compartments (top-carnivore, mesocarnivore, detritivore and omnivore). Energy fluxes link trophic compartments, and thus represents food web functions such as carnivory, omnivory, herbivory and detritivory.\n\nSpecies richness across all trophic compartments was positively associated with energy flux. However, species richness decreased over time, as did the energy flux at the whole-network level, which was reduced by 75%. Human pressure negatively affected both species richness and energy flux. Moreover, the negative impacts of human pressure on energy flux have intensified over time.\n\nOur results illustrate how human pressure can reduce diversity and erode the energy flux through food webs, with negative implications for the ecosystem functioning.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/05/08/human-pressure-drives-the-functioning-of-riverine-food-webs/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Dieison A. Moi, \nAlejandro D'Anatro, \nIvan González‐Bergonzoni, \nNicolás Vidal, \nIvana Silva, \nBenoit Gauzens, \nGustavo Q. Romero, \nBradley J. Cardinale, \nClaudia C. Bonecker, \nVítor Carvalho‐Rocha, \nFranco Teixeira de Mello","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"01621c4ee0bc3be9cb63ad3521c017dafeb91fc9242a4e1a435790e58fbefe4c","category":"Environment"}