{"title":"Halo Infinite preview: The more things change…","link":"https://arstechnica.com/?p=1814287","date":1637338440000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul>\n          <li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/hi1-980x552.jpg\" /></div>\n        <p>\n          A map to make a <em>Far Cry</em> fan proud.                  </p>\n        </div>\n      </li>\n      </ul>\n  \n<p>The <em>Halo</em> series has seen plenty of changes over the years, but the core gameplay loop of the single-player campaigns has remained largely the same. You march (or drive or fly) through corridors, chambers, and open-air compounds, gunning down waves of bad guys to get to the next goal and the next cutscene. Then you go somewhere else and march from point A to point B again, maybe with a few small detours for hidden secrets along the way.</p>\n<p><em>Halo Infinite</em> starts out the same way, with two broad tutorial missions set in broken, collapsing space stations that good ol' Master Chief does his best to help break, at points. After that quick introduction, though, you take an elevator up to the lush outdoor environments of Zeta Halo, where you're greeted with a much more open-ended gameplay experience than you might expect from the franchise.</p>\n<p>I've only just scratched the surface of that open-world design while playing with a limited preview build of the game this week, ahead of its launch December 8. Thus far, though, the more things change, the more they stay the same. <em>Halo Infinite</em> is still very much a <em>Halo</em> game, even if the path you take from point A to point B winds a little more than usual.</p></div><p><a href=\"https://arstechnica.com/?p=1814287#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1814287&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"016c3811f4770b9d25a006e5f37fe4b9e554835f944604b796927e761a75a4e3","category":"Tech"}