{"title":"Jellyfish and flies use the same hormone when they’ve had enough to eat","link":"https://arstechnica.com/?p=1929739","date":1680805575000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-117487868-800x546.jpg\" alt=\"Image of a jellyfish near the surface of the ocean.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-117487868.jpg\">Enlarge</a> <span>/</span> A Moon jellyfish.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/moon-jellyfish-swims-beneath-the-waters-of-inner-farne-on-news-photo/117487868?adppopup=true\">Dan Kitwood / Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The sensation of hunger seems pretty simple on the surface, but behind the scenes, it involves complicated networks of sending and signaling, with multiple hormones that influence whether we decide to have another serving or not. The ability to know when to stop eating appears to be widespread among animals, suggesting that it might have deep evolutionary roots.</p>\n<p>A new study suggests that at least one part of the system goes back to nearly the origin of animals. Researchers have identified a hormone that jellyfish use to determine when they're full and stop eating. And they found that it's capable of eliciting the same response in fruit flies, suggesting the system may have been operating in the ancestor of these two very distantly related animals. That ancestor would have lived prior to the Cambrian.</p>\n<h2>Feeding the fish (or jellyfish)</h2>\n<p>Given they lack any obvious equivalents to a mouth, it might seem like it would be tough to determine whether a jellyfish is even eating, much less hungry. But a team of Japanese researchers showed that the jellyfish species <em>Cladonema pacificum</em> has a bunch of stereotypical behaviors while feeding, including that their tentacles latch onto prey and that they then withdraw the tentacle into the bell so that the prey can be digested. And, if you keep feeding the jellyfish brine shrimp, eventually this process will slow, indicating that the animal is sensing it is well fed. (There's <a href=\"https://www.pnas.org/doi/10.1073/pnas.2221493120#supplementary-materials\">a movie</a> available of the jellyfish feeding.)</p></div><p><a href=\"https://arstechnica.com/?p=1929739#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1929739&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"016e180ef75f5b3955afbe7cc4320e9576b98fed0b99418678cd0b9553dd3936","category":"Tech"}