{"title":"Sam Bennett sprints to victory in the opening stage of Paris-Nice: Daily News","link":"https://cyclingtips.com/2021/03/sam-bennett-sprints-to-victory-in-the-opening-stage-of-paris-nice-daily-news/","date":1615138222000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>Today was packed with racing, between a one-day in Belgium, a one-day in Italy, and the first stage of Paris-Nice. Also racing related, the Tour de Suisse announced the route for their 84th edition of the event.</p>\n\n\n\n<p>As for tech news, Canyon cleared up any rumours about the bike that won Strade Bianche, yes it did have external cables (gasp). </p>\n\n\n\n<p>Read on for more news from the cycling world.</p>\n\n\n\n<p><em>Abby Mickey<br>Associate Editor</em></p>\n\n\n\n<h2>What&#8217;s News?</h2>\n\n\n\n<h3>Sam Bennett sprints to victory at stage 1 of Paris-Nice</h3>\n\n\n\n<p>Sam Bennett claimed his third victory of 2021 in Saint-Cyr-L&#8217;École, sprinting to victory in the first stage of Paris-Nice. The Irishman was quicker than Arnaud Démare and Mads Pedersen and got to pull on the first yellow jersey of the race. </p>\n\n\n\n<p>Most of the favourites for the general classification finished safely within the peloton, despite a few crashes. Unfortunately, Riche Porte went down with around 32 km to go and was forced to abandon.</p>\n\n\n\n<p>Overall the first stage of Paris-Nice was hectic, with a few small groups trying and failing to break away. With the climbing concentrated towards the final stages of the race, the sprinter&#8217;s teams controlled the finale for their speed specialists to have a go. </p>\n\n\n\n<p>&#8220;The guys did a fantastic job again. We were a little blocked in the last 15 km, and the nature of the sprint here with the straight roads, it was chaotic,&#8221; said Bennett. &#8220;Then the narrowing in the last 500 meters made it very very tricky.&#8221;</p>\n\n\n\n<p>Bennett will wear the yellow leader&#8217;s jersey on stage 2. Démare sits second in the general classification, 4 seconds behind Bennett, with Michael Matthews in third, 5 seconds behind the leader after capturing bonus seconds on course. </p>\n\n\n\n<h3>Tim Merlier wins GP Jean-Pierre Monseré ahead of Mark Cavendish</h3>\n\n\n\n<p>Tim Merlier launched a long and early sprint to win the 1.1 Belgian one-day Grote Prijs Jean-Pierre Monseré. Merlier outsprinted Mark Cavendish who&#8217;s lead-out man got squeezed in the final corner, hindering the sprinter&#8217;s path to the finish line. Timothy Dupont finished third behind Cavendish.</p>\n\n\n\n<p>There were quite a few nasty crashes throughout the day, making the lead into the finish even more chaotic. </p>\n\n\n\n<p>&#8220;We were going good. The team controlled it in the end. We got sandwiched but honestly, Merlier was really clever,&#8221; Cavendish said at the finish. &#8220;When he saw that he launched it dead quick. What can you do? When you’re that smart and that quick and think that much on your feet in a bike race then you deserve the win.&#8221;</p>\n\n\n\n<p>Merlier also won Le Samyn last week. The 2019 Belgian national champion is slated to line up at Tirreno-Adriatico later this week. Merlier won stage 6 of the Italian race last season. </p>\n\n\n\n<p>For Cavendish, this second place marks his best result in years. It&#8217;s unclear when Cavendish will be able to try for a victory again, after the race he hinted that his calendar wasn&#8217;t set in stone this season. &#8220;When we talked about my programme for the year I just said I don’t really mind what I do. I just really want to race in Belgium as much as I can. I don’t need to look at my power meter. It’s just racing, isn’t it? The Flemish people love cycling and they just get. I want to be Flemish and it’s about the racing,&#8221; Cavendish said. </p>\n\n\n\n<p>Read more on what this means for Cavendish <a href=\"https://cyclingtips.com/2021/03/cav-is-almost-back/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>. </p>\n\n\n\n<h3>Mauri Vansevenant wins GP Industria &amp; Artigianato</h3>\n\n\n\n<p>Mauri Vansevenant outsprinted Bauke Mollema and Mikel Landa to take the victory at GP Industria &amp; Artigianato, the 1.Pro Italian one-day. </p>\n\n\n\n<p>The 193 km long course that starts and finishes in Larciano ends with four laps of an 8.6 km long, 3.5% climb, making it quality preparation for riders headed to Tirreno-Adriatico later in the week. For this reason, the start list was filled with top names including Nairo Quintana, Vincenzo Nibali, and Alejandro Valverde. </p>\n\n\n\n<p>The race came down to a group of seven sprinting for the win. Mollema led the sprint early but was overtaken by Vansevenant who perfectly timed his move to claim victory.</p>\n\n\n\n<p>&#8220;I knew Vansevenant was quite fast, and there was a good chance to go for the win. But ya the sprint, perhaps I went a little bit too early, and then he passed me again,&#8221; said Mollema at the finish. &#8220;It was a hard sprint, a false flat uphill. I&#8217;m a bit disappointed I didn&#8217;t win, it was close, but ya.&#8221;</p>\n\n\n\n<h3>Mountainous Tour de Suisse route announced</h3>\n\n\n\n<p>After being cancelled in 2020 due to the pandemic, the Tour de Suisse will return in 2021 with eight stages similar to those planned for last year. Set to run from June 6-13, the race will kick off with a flat time trial in Frauenfeld, the only flat stage of the race. </p>\n\n\n\n<p>Following the opening stage, the race organizers designed a series of breakaway and sprinter friendly stages. Stages 2, 3, and 4 all follow rolling terrain but refrain from tapping into the major climbing. </p>\n\n\n\n<p>Stages 5 and 6 move onto Alpine climbs, challenging those hoping to walk away with the overall classification at the end of the week. Another time trial will take place on the seventh stage, featuring a 13 km climb that averages 6.9%. </p>\n\n\n\n<p>Finally, the Queen stage features 3,600 meters of altitude gain over 118 km. The peloton will take on the Furkapass, Grimsel Pass, and Susten Pass before finishing atop the Schöllenen Gorge.</p>\n\n\n\n<p>More information on the route can be found <a href=\"https://www.tourdesuisse.ch/en/tds-2021/stage-plan/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>, along with some stunning pictures. </p>\n\n\n\n<h3>Mathieu van der Poel won Strade Bianche on an adapted Aeroad CFR</h3>\n\n\n\n<p>Canyon ordered all of their athletes to hang up their Aeroad models after the Mathieu van der Poel <a href=\"https://cyclingtips.com/2021/03/yep-mathieu-van-der-poels-handlebar-broke-but-its-not-what-you-think/\" target=\"_blank\" rel=\"noreferrer noopener\">handlebar incident</a> at Le Samyn.  So what Canyon model was the Dutch national champion riding when he left the world champion Julian Alaphilippe in his dust on the final climb into Siena?</p>\n\n\n\n<p>Enough viewers were curious about Van der Poel&#8217;s setup that Canyon confirmed in a statement that Van der Poel was riding an adapted Aeroad CFR frame with a CP00010 cockpit. </p>\n\n\n\n<p>&#8220;This setup will continue to be raced by our teams while we investigate the incident with the CP00015 and CP00018 cockpits that emerged with Mathieu’s bike at Le Samyn on Tuesday,&#8221; the statement read.</p>\n\n\n\n<h2>Coming Up&#8230;</h2>\n\n\n\n<p>Paris-Nice continues with stage 2 from Oinville-sur-Montcient to Amilly. The 188 km long stage is flat as can be with a single 1 km-long category three climb midway through the stage, the Côte des Granges-le-Roi. </p>\n\n\n\n<h2>In case you missed it&#8230;</h2>\n\n\n\n<ul><li>A collection of <a href=\"https://cyclingtips.com/2021/03/gallery-a-battle-of-the-stars-at-the-mens-strade-bianche/\" target=\"_blank\" rel=\"noreferrer noopener\">photographs</a> from the men&#8217;s <strong>Strade Bianche</strong>. </li><li><a href=\"https://cyclingtips.com/2021/03/gallery-a-tactical-master-class-at-the-womens-strade-bianche/\" target=\"_blank\" rel=\"noreferrer noopener\">Photos</a> from the 7th edition of the women&#8217;s <strong>Strade Bianche</strong>. </li><li>An interview with <strong>Maja Leye</strong> of Flanders Classics about prize money and the <a href=\"https://cyclingtips.com/2021/03/prize-money-is-only-one-of-the-ways-to-progress-womens-cycling/\" target=\"_blank\" rel=\"noreferrer noopener\">progress of women&#8217;s cycling</a>. </li><li>Relive the action from the men&#8217;s <a href=\"https://cyclingtips.com/2021/03/mathieu-van-der-poel-wins-strade-bianche/\" target=\"_blank\" rel=\"noreferrer noopener\">Strade Bianche</a> with<strong> Dane Cash</strong>.</li><li><strong>Abby Mickey</strong> reported all the chaos from the women&#8217;s WorldTour opener, <a href=\"https://cyclingtips.com/2021/03/chantal-van-den-broek-blaak-wins-strade-bianche/\" target=\"_blank\" rel=\"noreferrer noopener\">Strade Bianche</a>.</li></ul>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/sam-bennett-sprints-to-victory-in-the-opening-stage-of-paris-nice-daily-news/\">Sam Bennett sprints to victory in the opening stage of Paris-Nice: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"016f9087cc157c2416c6193d808e34a2499622a5c835c7b382fd72fc209d3dd5","category":"Cycling"}