{"title":"Phil Southerland: Changing diabetes, one pedal stroke at a time","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/phil-southerland-eng","date":1637251315000,"content":"\n      <p><span>If you need a spark of inspiration, there's no better way to find it than by getting on a bike. With the mind free to roam without any distractions, surely it's no coincidence that great thinkers and creatives such as Albert Einstein and Ernest Hemingway whiled away their time on two wheels? So perhaps it should be no surprise that the fast-growing company Supersapiens, which produces an app and hardware that measures glucose levels, was first dreamt up on a bicycle ride.</span></p>\n<div></div>\n<p><span>\"The founding moments for Supersapiens was at the Velocity, which is a charity ride to support a hospital in Atlanta, Georgia,\" says Phil Southerland, CEO and Founder of Supersapiens as well as of Team Novo Nordisk cycling team – a professional cycling team whose roster is entirely comprised of athletes with type 1 diabetes.</span></p>\n\n<p><span><span>That day, Southerland was riding with a good friend of his, an Atlanta resident Chip Hawkins. Hawkins is also the CEO and Founder of another disruptive company in the cycling industry, Wahoo. In conversation, Southerland shared his desire to integrate readings of his glucose levels (which he gets from the Abbott’s Libre sensor worn on his arm) with his Wahoo, so he could constantly see how his numbers were fluctuating during exercise, similarly to how we view power or heart rate data.</span></span></p>\n<p><span>\"We partnered with two separate companies who said they would be able to do it [show glucose levels on the head unit], and they failed,\" says Southerland, who was diagnosed with diabetes when he was seven months old. \"So I said to Chip, for my athletes, to perform consistently at their best, we've got to control glucose, and other companies said it was not possible.\"</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/05-11-2021_Phil-Southerland_2949_f1_1024x1024.jpg?v=1637245836\" /></span></p>\n<p><em>Portrait by Véronique Rolland</em></p>\n<p>Southerland was sure that if athletes in Team Novo Nordisk could continually view their glucose levels on their head units they’d be able to plan their fueling much more efficiently in both training and racing.</p>\n<p><span>Hawkins didn't overthink too much. \"'I'll be able to do it,' he replied, just like that. And we kept on riding,\" says Southerland. \"It was a 100-mile ride. We had a lot of fun, and at the end, Chip said he'd come to my office on Monday with the supplies, and he'd get it done. He found one of the best guys in the world to hack my Wahoo, and a few months later, I had glucose levels on my Wahoo Bolt. And my life had changed.\" </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/rouleur-performance/what-is-supersapiens-the-story-behind-the-next-frontier-in-performance\">Related: What is Supersapiens? The story behind the next frontier in performance</a></em></strong></p>\n\n<p>It was from that moment that Southerland had the idea to create Supersapiens, an app and hardware that would allow the world to view their glucose levels and improve their nutrition accordingly, regardless of whether they have diabetes or not. The Supersapiens app can currently sync with select types of Garmins and is fully integrated with Garmin Connect. Rumour has it that integration with long-term supporters of Supersapiens, Wahoo, is on the way very soon.</p>\n<p>The Wahoo office in Atlanta happens to be just a 30-minute drive from Southerland's, who visited the company for the first time in 2013. \"I showed up in a suit, but you just don't wear a suit at Wahoo. It's a shorts and t-shirt kind of company. The Wahooligans are a company I really look up to,\" he says.</p>\n<p><span>When Southerland visited Wahoo, he was looking for sponsors for Team NovoNordisk, but the Wahooligans were already just a stone's throw from signing the first partnership that changed the trajectory of the company, one with Team Sky in 2014. The stars didn't align for Southerland then, but good things followed for his trailblazing Supersapiens app, and quickly.</span></p>\n<p><span>\"We got Chris Froome first, and then we started with Jumbo-Visma in 2020, then with Ineos and Canyon-SRAM,\" Southerland says when discussing the athletes that use and train with his game-changing device. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-podcast/rouleur-tech-podcast-supersapiens-with-gagan-chaudhari\">Rouleur Tech Podcast: Supersapiens with Gagan Chaudhari </a></em></strong></p>\n<p><span>Supersapiens is not only booming in cycling, but also in other sports, where it has had even more followers and success.</span> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_Stage_11_14_1024x1024.jpg?v=1636535386\" /><br /><em>Chris Froome was among the early adopters of Supersapiens. Photo: Emma Wilcock/SWpix.com</em></p>\n<p><span>\"We went into triathlon with Jan Frodeno [world record holder for the Ironman distance], Christian Blummenfelt [Olympic gold in Tokyo], Gustav Iden [Ironman 70.3 reigning champion], who have all achieved their major goals. And Eliud Kipchoge in the running world has been using the product since February. His goal was Tokyo, and we helped him win. Lewis Hamilton was using it, and also football players. It's spreading like wildfire.\"</span></p>\n<p><span>But Southerland is aware that giving people numbers without context is neither the technology's goal nor the brand's philosophy.</span></p>\n<p><span>\"We have to give people better direction,\" he says. \"We launched the app, it's great, it's flashy, shiny, but data without context is meaningless. So we want to simplify the different stages in the app: priming food before we work out, performing different targets during the workout, and then recovery. But on top of that, it's really important to educate our customers. Glucose is very complex, so it's our number one job and mission as a company right now to educate our consumers. Those who understand it, they never take it off. But some who put it on and just see the numbers might use it for a month and then say bye. So we understand our customers, and we understand their needs.\"</span></p>\n\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/05-11-2021_Phil-Southerland_2967_f1_1024x1024.jpg?v=1636547543\" /></span></p>\n\n<p><em>Portrait by Véronique Rolland</em></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/rouleur-performance/chasing-ventoux-part-one\">Related: Chasing Ventoux, Rouleur's 3-month training plan</a></em></strong></p>\n<p><span>Southerland’s idea for Supersapiens was born out of the needs of Team Novo Nordisk athletes, but it's now optimising performances, recovery, and nutritional strategies for sportspeople all over the world. Though athletes are at the core of Supersapiens, the brand hopes to attract a wider audience.</span></p>\n<p><span>\"We came to the market to prevent the bonk. That's what we got originally. But we've seen such phenomenal impacts [on the general public],\" he says. \"I've seen one of our participants in a clinical trial lose 79 pounds (35 kilos) in three months. We've seen people's lives fundamentally change. So it's my belief that every human is an athlete, and we will help all of humanity achieve their goals in sports because in doing so, we're going to create a more active and happier community.\"</span></p>\n<p><em><span>Cover image: Team NovoNordisk</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0173a90d47912cc26636c08bc5c9dcdcc75bd59daf9b53354506defadd1f40fc","category":"Cycling"}