{"title":"Impact of three decades of warming, increased nutrient availability, and increased cloudiness on the fluxes of greenhouse gases and biogenic volatile organic compounds in a subarctic tundra heath","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17416?af=R","date":1720781108000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/42683a26-e009-4485-9ffe-a3dcd412d748/gcb17416-toc-0001-m.png\" alt=\"Impact of three decades of warming, increased nutrient availability, and increased cloudiness on the fluxes of greenhouse gases and biogenic volatile organic compounds in a subarctic tundra heath\" />\n<p>We showed enhanced methane uptake under warming and shading (simulating increased cloudiness), increased carbon dioxide and nitrous oxide emissions under warming and increased nutrient availability, and increased isoprene emissions under warming in a subarctic heath exposed to more than three decades of climate change related manipulations of temperature, nutrient addition, and light. Our results indicate that the rapidly changing climate, associated with increasing temperatures, nutrient availability, and cloud cover, in the northern high latitudes will alter the ecosystem-atmosphere exchange of greenhouse gases and atmospherically reactive biogenic volatile organic compounds with important feedback implications for the climate, atmosphere, and ecosystem processes in these regions.</p>\n<br />\n<h2>Abstract</h2>\n<p>Climate change is exposing subarctic ecosystems to higher temperatures, increased nutrient availability, and increasing cloud cover. In this study, we assessed how these factors affect the fluxes of greenhouse gases (GHGs) (i.e., methane (CH<sub>4</sub>), nitrous oxide (N<sub>2</sub>O), and carbon dioxide (CO<sub>2</sub>)), and biogenic volatile organic compounds (BVOCs) in a subarctic mesic heath subjected to 34 years of climate change related manipulations of temperature, nutrient availability, and light. GHGs were sampled from static chambers and gases analyzed with gas chromatograph. BVOCs were measured using the push-pull method and gases analyzed with chromatography–mass spectrometry. The soil temperature and moisture content in the warmed and shaded plots did not differ significantly from that in the controls during GHG and BVOC measurements. Also, the enclosure temperatures during BVOC measurements in the warmed and shaded plots did not differ significantly from temperatures in the controls. Hence, this allowed for assessment of long-term effects of the climate treatment manipulations without interference of temperature and moisture differences at the time of measurements. Warming enhanced CH<sub>4</sub> uptake and the emissions of CO<sub>2</sub>, N<sub>2</sub>O, and isoprene. Increased nutrient availability increased the emissions of CO<sub>2</sub> and N<sub>2</sub>O but caused no significant changes in the fluxes of CH<sub>4</sub> and BVOCs. Shading (simulating increased cloudiness) enhanced CH<sub>4</sub> uptake but caused no significant changes in the fluxes of other gases compared to the controls. The results show that climate warming and increased cloudiness will enhance CH<sub>4</sub> sink strength of subarctic mesic heath ecosystems, providing negative climate feedback, while climate warming and enhanced nutrient availability will provide positive climate feedback through increased emissions of CO<sub>2</sub> and N<sub>2</sub>O. Climate warming will also indirectly, through vegetation changes, increase the amount of carbon lost as isoprene from subarctic ecosystems.</p>","author":"Flobert A. Ndah, \nAnders Michelsen, \nRiikka Rinnan, \nMarja Maljanen, \nSanttu Mikkonen, \nMinna Kivimäenpää","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"017973eb63bf2091d4467c89049f5cb266fba48e929ada52cac2443f57ffda4d","category":"Environment"}