{"title":"Parental Experiences and Perceptions of Using Traditional Medicine and Biomedical Services for Their Children&rsquo;s Health: A Qualitative Study in Indonesia","link":"https://www.preprints.org/manuscript/202404.1486/v1","date":1713866282000,"content":"Traditional Medicine (TM) is a culturally-rooted healthcare practice, and its use, including for treating illnesses among children, has been reported in many countries. Despite the cultural significance of TM in managing children’s illnesses, evidence suggests that child mortality remains high in many settings. This indicates that the sole use of TM within families and communities might act as a barrier to using biomedical services, contributing to avoidable deaths. Globally, Indonesia is in the top 10 countries with the highest child mortality rates. In addition, Belu is a district in East Nusa Tenggara province, Indonesia that exhibits a high number of child deaths within the last three years. However, the use of TM for the treatment of illnesses among children in Indonesia has received minimal academic attention. This study aimed to understand parental beliefs, knowledge, views, and perceptions of TM and the impact on the use of TM and biomedical services in the treatment of illnesses among their children in Belu district, Indonesia. The participants (n=25) were parents with the real-life experiences of using TM for treating their children’s illnesses. They were recruited using the snowballing sampling technique. Data were collected using in-depth qualitative interviews. A thematic data analysis was performed and guided by a qualitative data analysis framework. The findings were grouped into four main themes: (i) parental beliefs, knowledge, views, and perceptions of TM, (ii) the influence of these factors on parental use of TM and biomedical services for the treatment of children’s illnesses, (iii) social and cultural influences on the use of TM and biomedical services among their children, and (iv) the impact of the sole use of TM or late medical diagnosis on the health condition and the death of children. The findings show that the use of TM is a common practice within families and communities in Belu, however evidence suggests that child mortality remains high in the setting, indicating less effectiveness of the sole use of TM. Thus, there is a need for the development of collaborative models of healthcare programs and service delivery fostering mutual respect and understanding between traditional healers and healthcare professionals, which could significantly contribute to improving parental use of biomedical services for the treatment of their children’s illnesses.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"017a5fbc68b69a920e0a929274b94be4510ed867b73a7a41d3c7eb414cccf031","category":"Interdisciplinary"}