{"title":"Sea walls might just make floods someone else’s problem, study suggests","link":"https://arstechnica.com/?p=1780487","date":1626374378000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/ISS037-E-002604_lrg-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/ISS037-E-002604_lrg.jpg\">Enlarge</a> <span>/</span> An image of the Bay Area at night shows why protecting some regions will likely lead to damaging floods elsewhere. (credit: <a href=\"https://visibleearth.nasa.gov/images/82198/san-francisco-region-at-night\">NASA</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Protecting the coasts in the United States from the impacts of climate change comes with a hefty price tag. But new research shows that using sea walls to safeguard land can just make the rising tides a problem somewhere else.</p>\n<p>The paper, published in PNAS, looks into the effect of erecting sea walls in one location and what that means for other places along the coast. Using the San Francisco Bay as a case study, it also assesses the economic impacts of flood scenarios in the nonprotected regions. According to the paper, defending individual parcels of the shore can increase flooding elsewhere by as much as 36 million cubic meters. This can result in $723 million in damages for a single flooding event in the most dire situations—costs can even exceed the damages that would have resulted otherwise in the protected region.</p>\n<h2>Sea change</h2>\n<p>As the sea level around the world rises, humans are inevitably going to be putting up structures to protect themselves—and, in the case of the US, that includes <a href=\"https://oceanservice.noaa.gov/facts/shoreline-armoring.html\">350,000 structures</a> near the coast. But this can have detrimental effects on those places we choose not to protect.</p></div><p><a href=\"https://arstechnica.com/?p=1780487#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780487&amp;comments=1\">Comments</a></p>","author":"Doug Johnson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"01834e20dc1720e08d83ddffe3fd36ab576b04e3b3d773984dbb79f54ca41cc6","category":"Tech"}