{"title":"Chronobiological perspectives: Association between meal timing and sleep quality","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308172","date":1722520800000,"content":"<p>by Li-Ming Yan, Hai-Jun Li, Qi Fan, Yi-Dong Xue, Tao Wang</p>\r\nBackground <p>Meal timing has been associated with metabolism and cardiovascular diseases; however, the relationship between meal timing and sleep quality remains inconclusive.</p> Objective <p>This study aims to investigate the relationship between meal timing and sleep quality from a chronobiological perspective.</p> Methods <p>This study utilized data from the NHANES for the years 2005–2008, including a cohort of 7,023 participants after applying exclusion criteria. Sleep quality was assessed using the Pittsburgh Sleep Quality Index (PSQI). Meal timing was analyzed based on two 24-hour dietary recalls from each individual, considering the timing of the initial and final meals, meal duration, and frequency of meal occasions. Multiple linear regression models and hierarchical analyses were employed to examine the relationship between meal timing and PSQI scores, adjusting for various demographic and habitat covariates.</p> Results <p>Statistical analysis revealed a positive correlation between delayed meal timings, increased meal occasions, and elevated PSQI scores, indicating that later meal timing are intricately linked with diminished sleep quality. Both later meal timings and more frequent meal occasions were significantly associated with poorer sleep quality. Compared to the first tertile, the β (95%CI) values of the third tertile were 0.545 (0.226, 0.864) for first meal timing, 0.586 (0.277, 0.896) for midpoint meal timing, 0.385 (0.090, 0.680) for last meal timing, and 0.332 (0.021, 0.642) for meal occasions in the adjusted models.</p> Conclusion <p>These findings suggest that late initial, midpoint, and final meal timing, as well as more frequent meal occasions, are chrono-nutrition patterns associated with poor sleep quality.</p>","author":"Li-Ming Yan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0188de305efc9f350e3014eef482a99457e5367d8674113f9f3a12d651d3bdee","category":"Interdisciplinary"}