{"title":"Research progress on natural preservatives of meat and meat products: classifications, mechanisms and applications","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13495?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<p>Meat and meat products are highly susceptible to contamination by microorganisms and foodborne pathogens, which cause serious economic losses and health hazards. The large consumption and waste of meat and meat products means that there is a need for safe and effective preservation methods. Furthermore, toxicological aspects of chemical preservation techniques related to major health problems have sparked controversies and have prompted consumers and producers to turn to natural preservatives. Consequently, natural preservatives are being increasingly used to ensure the safety and quality of meat products as a result of customer preferences and biological efficacy. However, information on the current status of these preservatives is scattered and a comprehensive review is lacking. Here, we review current knowledge on the classification, mechanisms of natural preservatives and their applications in the preservation of meat and meat products, and also discuss the potential of natural preservatives to improve the safety of meat and meat products. The current status and the current research gaps in the extraction, application and controlled-release of natural antibacterial agents for meat preservation are also discussed in detail. This review may be useful to the development of efficient food preservation techniques in the meat industry. © 2024 Society of Chemical Industry.</p>","author":"Lei Wen, \nHongjun He, \nYaobo Liu, \nWeiting Wang, \nPengfei Du, \nPeng Hu, \nJianfang Cao, \nYanli Ma","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"018ee2eecfea435008b97f82676b111f051e249df3794fa44029277b26bc0f98","category":"Environment"}