{"title":"Transcription factor FveMYB117a inhibits axillary bud outgrowth by regulating cytokinin homeostasis in woodland strawberry","link":"https://academic.oup.com/plcell/article/36/6/2427/7637060?rss=1","date":1711584000000,"content":"<span><div>Abstract</div>Shoot branching affects plant architecture. In strawberry (<span>Fragaria</span> L.), short branches (crowns) develop from dormant axillary buds to form inflorescences and flowers. While this developmental transition contributes greatly to perenniality and yield in strawberry, its regulatory mechanism remains unclear and understudied. In the woodland strawberry (<span>Fragaria vesca</span>), we identified and characterized 2 independent mutants showing more crowns. Both mutant alleles reside in <span>FveMYB117a</span>, a R2R3-MYB transcription factor gene highly expressed in shoot apical meristems, axillary buds, and young leaves. Transcriptome analysis revealed that the expression of several cytokinin pathway genes was altered in the <span>fvemyb117a</span> mutant. Consistently, active cytokinins were significantly increased in the axillary buds of the <span>fvemyb117a</span> mutant. Exogenous application of cytokinin enhanced crown outgrowth in the wild type, whereas the cytokinin inhibitors suppressed crown outgrowth in the <span>fvemyb117a</span> mutant. FveMYB117a binds directly to the promoters of the cytokinin homeostasis genes <span>FveIPT2</span> encoding an isopentenyltransferase and <span>FveCKX1</span> encoding a cytokinin oxidase to regulate their expression. Conversely, the type-B <span>Arabidopsis</span> response regulators FveARR1 and FveARR2b can directly inhibit the expression of <span>FveMYB117a</span>, indicative of a negative feedback regulation. In conclusion, we identified FveMYB117a as a key repressor of crown outgrowth by inhibiting cytokinin accumulation and provide a mechanistic basis for bud fate transition in an herbaceous perennial plant.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"018fd4c458d4162d8a375421dedaed13b081222a1d05e5405a7a9e406045ba34","category":"Environment"}