{"title":"Display and Manufacture of Bacterial Thrombolytic Enzymes from Various Soil Environments in Egypt","link":"https://www.preprints.org/manuscript/202404.1339/v1","date":1713750771000,"content":"BACKGROUND:\nThromboembolic disorders including Myocardial infarction[ MI] and stroke represent the leading causes of death worldwide. Fibrinolytic enzymes extracted from microbial sources showed high efficacy in the dissolution of different blood clots.\nAIM OF THE STUDY:\nScreening and the bacterial recombinant DNA manufacture of bacterial fibrinolytic enzymes from different soil environments in Egypt.\nMETHODOLOGY:\nA total of 50 soil samples were screened for their fibrinolytic enzyme production. The potent fibrinolytic enzyme-producing bacterial isolates were evaluated for their thrombolytic activities using the plasma plate method. The characterization of the enzyme activity and thermostability were carried out; also, the determination of molecular mass using a mass spectrometer and western blot technique was performed. The purification of the fibrinolytic enzymes was done through the affinity chromatography technique. On the other hand, the production of the purified bacterial fibrinolytic enzyme was achieved via bacterial recombinant DNA technology. Formulation of fibrinolytic enzymes in different dosage forms was tried.\nRESULTS:\nIn the present study, the purified bacterial fibrinolytic enzyme was approximately 83% pure through affinity chromatography and SDS-PAGE assay. The predominating bacterial isolate secreting fibrinolytic enzymes was found to be Bacillus cereus. The fibrinolytic enzyme activities of 50 soil samples were found to be in the range of 0.167-1.853 U/ ml. The fibrinolytic activity of the extracellular enzyme refined from the culture supernatant of Bacillus cereus was relatively stable over the PH range from 7.4-10 for 18 hours and also it showed stability with the highest productivity at a temperature of 43 0C for nearly 60 minutes. The enzyme was called fibrin-proteinase[ FP] in the present study. The FP degraded the fibrin clots via direct thrombolysis. The specific activity and the molecular mass of the FP were estimated to be nearly 40.71 Units/ mg protein and nearly 30 KDa respectively. Protease activity was noticed to be slightly increased in the presence of Fe+3; While it was inhibited in the presence of EDTA. On the other hand, the FP fibrinolytic activity was enhanced greatly after the addition of monovalent cations such as K+1 and Na +1. The enzyme was also active over the temperature range of 20- 65 0C with the highest activity at 55 0C. The optimum temperature and PH of protease production was at 35-43 0C and PH 8.0-10.\nConclusion:\nDuring the present study, the thermostable fibrinolytic enzyme FP purified from Bacillus cereus in different soil environments in Egypt was a promising fibrinolytic enzyme because it showed a broader efficacious fibrinolytic activity as well as less adverse effects than the current fibrinolytic enzymes globally. It is recommended in the future advanced exploration of the optimization of suitable formulation of bacterial fibrinolytic enzymes to aid in the dissolution of various blood clots and as a consequence overcoming the high rate of mortality globally.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0196c4cfacf8a7f31dba6c299c6de0d0fcc3d370ce8d4ced6559ce201a961815","category":"Interdisciplinary"}