{"title":"Behind the bike | How Boardman Bikes designed our Bike of the Year 2021","link":"https://www.bikeradar.com/features/long-reads/boardman-slr-94-axs-disc/","date":1621605659000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Boardman-SLR-9.4-AXS-Disc-Carbon-02-d6f474d.jpg?quality=90&amp;resize=620,413\" />                                            <p>As you’ll have discovered by reading our Bike of the Year 2021 coverage, the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/boardman-slr-9-4-axs-disc-carbon-review/\">Boardman SLR 9.4 AXS Disc</a>, which took our <a href=\"https://www.bikeradar.com/news/2021-road-bike-of-the-year/\">overall Road Bike of the Year award</a>, is a superbly crafted machine.</p>\n<p>The all-round performance is stunning, and its component selection and build utilise some of the smartest choices around. It’s taken our ultimate accolade for 2021 by being a bike that balances all aspects incredibly well. It’s comfortable, rapid, smooth and huge fun to ride, while being good value for money at £2,700 with an impressive suite of parts, including the latest <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-rival-etap-axs-review/\">SRAM Rival AXS groupset</a>.</p>\n<p>The twin jewels in its Bike of the Year crown, however, are the frame and fork: the heart of any great bike, and an area in which the British-based Boardman team focused on to ensure the new SLR chassis would blend the comfort, aerodynamic and performance capabilities we loved.</p>\n<p>We spoke to Boardman Bikes’ product manager, Matt Dowler, and design manager, James Ryan, to get the inside story on the bike.</p>\n<hr /><h2>BikeRadar Meets podcast | Boardman Bikes</h2>\n<p>Read on for our Q&amp;A with Matt Dowler and James Ryan, and more on the Boardman SLR 9.4 AXS Disc – or listen to the latest episode of the BikeRadar Podcast below.</p>\n<p>We were joined by Matt and the man behind the brand, Chris Boardman, to talk Bike of the Year victory, new tech, old tech, gravel, ebikes and the future of cycling in the UK.</p>\n<p>Don’t forget to subscribe to the BikeRadar Podcast via <a href=\"https://podcasts.apple.com/gb/podcast/the-bikeradar-podcast/id1461106709\" target=\"_blank\"><strong>Apple</strong></a> or <a href=\"https://open.spotify.com/show/6aLvE13Bge7WC7AWbiR3LS\" target=\"_blank\"><strong>Spotify</strong></a>, so you don’t miss an episode.</p>\n<div>\n    <div>\n        \n    </div>\n</div>\n\n<p><a href=\"https://podcasts.apple.com/gb/podcast/the-bikeradar-podcast/id1461106709\"><div>\n    <img /></div></a></p>\n<p><a href=\"https://open.spotify.com/show/6aLvE13Bge7WC7AWbiR3LS\"><div>\n    <img /></div></a></p>\n<hr /><h2>The concept</h2>\n<p>In designing the latest SLR, the Boardman team quickly defined the key areas in which it had to excel.</p>\n<p>First up was aerodynamics, an area that the Boardman brand has always held close to its heart, particularly given the key role drag-saving played in founder Chris Boardman’s illustrious cycling career; one that saw him win Olympic track medals and claim UCI Hour Records, not to mention Tour de France prologue successes.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/An-in-depth-look-at-the-Boardman-SLR-9.4-07-3e2c1cc.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Big tyre clearance and mudguard fittings make this bike ideal for inclement UK conditions</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/An-in-depth-look-at-the-Boardman-SLR-9.4-06-c23e0e6.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>New look: the SLR combines elements from Boardman’s Race and Endurance ranges</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/An-in-depth-look-at-the-Boardman-SLR-9.4-09-01075c7.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>It’s all about the build: Boardman focuses on real-life benefits, rather than flashy add ons</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/An-in-depth-look-at-the-Boardman-SLR-9.4-08-c0835ea.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The SLR 9.4 uses the new wireless SRAM Rival AXS groupset.</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/An-in-depth-look-at-the-Boardman-SLR-9.4-10-939cb57.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Our Bike of the Year 2021 is comfortable, rapid, smooth and, above all, huge fun to ride.</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nNext up on the Boardman team’s menu was a lightweight chassis – a key element of any well-rounded <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bike</a>, of course, but the primary concern was that aero and lightness didn’t come at the expense of ride quality.\n<p>Because of an over-emphasis on aerodynamics, bikes are sometimes heavy and hard riding; or in the pursuit of being as light as possible, bikes overcompensate in stiffness, making for a harsh ride. Alternatively, by chasing a light overall weight, brands can sometimes compromise the drivetrain stiffness and the result is a bike that feels sloppy and flexible.</p>\n<p>The final concern – and one which we applaud – is its suitability for British riding conditions. Our poor roads and often inclement weather ensured the SLR had generous clearances for wider <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">road bike tyres</a> and proper <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mudguards-fenders-a-buyers-guide/\">mudguard</a> fittings.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Boardman Bikes claim the new SLR offers a 10-watt reduction in aero drag at 40km/h in wind-tunnel testing.</span></figcaption><span> <i>Boardman Bikes</i></span></div>\n<p><b>BikeRadar: </b>The SLR successfully straddles the space between a race and an endurance bike. Was that the original concept?</p>\n<p><strong>Matt Dowler:</strong> Very much so – the development brief we worked up with Chris Boardman for the SLR was all about efficiency. That’s subtly different from the focus on pure speed with a race bike, or outright comfort on an endurance bike. Marketing a ‘WorldTour replica bike’ to people riding fast club rides or sportives doesn’t make sense to us, but we all love the thrill of beating a personal best, so the SLR is designed to deliver speed without some of the compromises on comfort, cost or usability that can come with more race-focused or endurance bikes. That’s not to say the SLR isn’t fast enough to race on, though, as Paralympian Sarah Storey will be riding hers in the Paralympic Games road race in Tokyo this summer.</p>\n<p>Historically, we used to run two separate SLR platforms – the Endurance and the Race. However, with its ultra-high stiffness, aggressive geometry and low weight, the use case for the SLR Race was narrow. The SLR Endurance had a great <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-geometry-explained/\">road bike geometry</a> for long, fast rides, which we kept, but it wasn’t particularly aerodynamic and lacked tyre clearance. With the new platform, we combined the best features of both older bikes and improved aerodynamic performance and comfort to improve efficiency. Less aero drag equals less effort for the same speed, and greater comfort reduces fatigue over time helping people to ride faster for longer.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Development of the SLR saw the team use the latest modelling and analytical technology.</span></figcaption><span> <i>Boardman Bikes</i></span></div>\n<p><strong>BikeRadar:</strong> You’ve put in plenty of UK-friendly design touches, including increased tyre clearance and provision for proper mudguards. Was the SLR always intended as a year-round UK bike?</p>\n<p><strong>Matt Dowler:</strong> Absolutely. Chris’s most popular social media posts are always about mudguards – it’s fair to say he isn’t a fan of a soggy bottom. Not everyone has the luxury of multiple bikes for different times of the year, so why wouldn’t we put features into the bike that make using it year-round more enjoyable? Clearance for wide tyres and/or mudguards, and consistent disc braking without wearing down expensive rims means using a ‘best’ bike in the winter is a real option now, particularly with the more affordable Rival AXS cassette and chain.</p>\n<p><b>BikeRadar: </b>Can you expand upon the development process and what tech was utilised in the SLR’s creation?</p>\n<p><strong>James Ryan: </strong>We put a lot of time into the development from the original concept designs through to extensive CFD (Computational Fluid Dynamics) modelling and a lot of work into the carbon layup with FEA (Finite Element Analysis). All of this was using the computing power available to us in conjunction with our manufacturing partners.</p>\n<p><strong>Matt Dowler:</strong> Once we’ve got through all of this extensive research and development, we needed to prove the CFD results were matched in the wind tunnel and in real-world ride testing. After running the SLR’s initial fork through its paces, we weren’t happy and so we went back to the drawing board. I wouldn’t let it go until I was 100 per cent happy with it. It meant the SLR ended up being six months late and I really thought I might lose my job over that! In my defence, the bike had to be right, and a Bike of the Year award has proven it was a good decision!</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Chris Boardman continues to have a hands-on role in the brand that bears his name.</span></figcaption><span> <i>Boardman Bikes</i></span></div>\n<p><strong>BikeRadar:</strong> When balancing aero and weight, was there one of those that had more of an emphasis?</p>\n<p><strong>Matt Dowler:</strong> We focused on balancing aero performance, frame stiffness and ride quality to create an efficient bike, and the comparatively low weight is almost a by-product of this. The weight savings you can make in a frame and fork give such a tiny performance benefit even on a very steep climb, so it wasn’t really a specific target. However, there’s something special about the way a light bike feels to ride, so we set limits on tube sizing and shape within our CFD research programme to ensure that we didn’t add in too much weight.</p>\n<p>The new SLR kept the sub-900g frame weight of the old SLR Endurance, but when we put it in our wind tunnel to validate our modelling, we saw around a 10-watt reduction in aero drag at 40km/h, giving a genuine performance benefit. We actually produced some lighter prototypes using different carbon layups, but they were hasher on broken roads, so the negatives outweighed the positives of saving 50g.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Tweaks to the bike meant that it was six months late in delivery.</span></figcaption><span> <i>Boardman Bikes</i></span></div>\n<p><strong>BikeRadar: </strong>You have been able to produce both a lightweight frame and fork at a complete bike price few can match. How?</p>\n<p><strong>Matt Dowler:</strong> Boardman has always been about delivering outstanding performance for the money, so we’re super-efficient in how we design, manufacture, market and sell our bikes. We work directly with factories, cutting out any middlemen, and we sell directly to customers through Halfords and Tredz.</p>\n<p><strong>BikeRadar:</strong> One of the major highlights of the 9.4 SLR is the new wireless SRAM Rival AXS groupset. You are one of the first major brands to bring out a bike with this user-friendly tuneable and connected gear system.</p>\n<p><strong>Matt Dowler:</strong> We’ve always had a good relationship with SRAM. We were the first UK brand to launch a Red eTap bike back in 2015 (AiR 9.8 eTap) and when they told us about Rival AXS, we knew straight away how much of a game-changer it was going to be.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Chris Boardman: CEO of Boardman bikes and Olympic champion</span></figcaption><span> <i>Boardman Bikes</i></span></div>\n<p><strong>BikeRadar:</strong> The SLR’s build has clearly been well researched, with the Alexrims wheelset, for example, not coming from one of the standard rim brands but offering an impressive spec.</p>\n<p><strong>James Ryan:</strong> Features and spec choices that make a difference are a really big part of what we do at Boardman and on every bike that we design. We focus on the components that are going to have the most positive impact for riders, rather than the flashy or the headline-grabbing stuff.</p>\n<p><strong>Matt Dowler:</strong> We run an extensive component sourcing and testing programme to make sure they have a great performance versus cost ratio. The Alexrims RXD3 wheels we’ve used on the SLR are a great example of this – they use a light, wide 30mm-deep rim with quality cartridge bearing hubs for a total weight of 1,550g. For the same performance level from Mavic or Fulcrum, for example, the bike would cost £250-300 more.</p>\n<p>Any investments we make have to be paid for in bike sales, so they have to deliver a genuine benefit to riders to justify them. We’d much rather our product does the talking, so we invest in research and development and tooling for our frames to get them just right for customer requirements, rather than spending millions on a WorldTour team sponsorship to buy credibility and adding that cost into RRPs.</p>","author":"Warren Rossiter","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"01975e085024dc7e09ea62fd20d60133025dea4a3b376ce4a9d466ffdf297502","category":"Cycling"}