{"title":"PSIV-21 Ileal digestibility of amino acids in feed ingredients for 22-, 56-, and 87-kilogram pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/307/7665081?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of the present study was to test the hypothesis that the apparent ileal digestibility (AID) of amino acids (AA) in feed ingredients is not constant in pigs with 3 different body weights (BW). Eight pigs with initial BW of 22.2 ± 1.2 kg cannulated at the distal ileum were used. Two experimental diets contained corn distillers dried grains with solubles (DDGS) and soybean meal-wheat mixture (SBM-W; 70% soybean meal + 30% wheat) as the sole source of nitrogen, respectively. The diets were assigned to the animals in a 2-period cross-over design. Each period consisted of a 5-d adaptation period and a 2-d ileal digesta collection period. The animals, diets, and experimental design for 50 kg pigs (initial BW = 55.6 ± 3.3 kg) and 80 kg pigs (initial BW = 86.9 ± 5.1 kg) were identical to those used for 22 kg pigs. Orthogonal polynomial contrasts were used to determine the effect of ingredient type (corn DDGS or SBMM) and BW of pigs (from 22 to 87 kg) and the interaction between these 2 main effects. The AID of crude protein, lysine, and methionine in both corn DDGS and SBM-W linearly or quadratically increased (<span>P</span> &lt; 0.05) with an increase in pig BW. An interaction between ingredient type and linear effect of BW was observed (<span>P</span> &lt; 0.05) in histidine, isoleucine, leucine, phenylalanine, threonine, and valine. Specifically, a linear increase in AID of these AA with increasing BW of pigs was greater in SBM-W compared with corn DDGS. In conclusion, the AID values of most AA differed between the BW range of 22 to 87 kg, and these patterns varied among different ingredients.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"019bfd5e30cf8410aa4a5627ad7b8030e8690a60a3efa36029b8799c9910f72f","category":"Environment"}