{"title":"Trend prediction and influencing factors of the production comparative advantage of China’s main apple-producing provinces","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311912","date":1729260000000,"content":"<p>by Wenping Ning, Fuhong Zhang, Meiling Zhang</p>\r\nIntroduction <p>The apple industry is an essential industry to assist in rural revitalization. However, in recent years, the urbanization, industrialization, globalization and climate change have brought various challenges to the apple industry in China’s main apple-producing provinces. Given this, effectively identifying, enhancing on apple production comparative advantage (APCA) is imperative to safeguard the long-term sustainable development of China’s apple industry. This study aims to explore the evolutionary trends and influencing factors of APCA, and to provide quantitative support for the formulation of scientific and effective apple production policies.</p> Methods <p>In this paper, the APCA of China’s eight main apple-producing provinces from 2013 to 2022 was measured by using a aggregate comparative advantage index. The spatio-temporal dynamic evolution characteristics of APCA were revealed by adopted Arc GIS and kernel density estimation method. Second, the transfer probabilities of different types of APCA were predicted by empolyed traditional and spatial Markov chains. Finally, the driving mechanism of APCA is explored with the panel quantile model.</p> Results <p>1) The average value of APCA of the main producing provinces increased from 1.330 in 2013 to 1.419 in 2022. 2) The probabilities of provinces with low, primary and middle level of advantage jumping to the next level are 31.58%, 16.67% and 11.76%, respectively. When the spatial lag type is high-level advantage, the probability of stabilization of the low-level advantage decreases from 68.42% to 0.00%. 3) Nonfarm payrolls have the largest dampening effect at the 40% quantile.</p> Conclusions <p>1) Temporally, APCA shows a trend of slow growth, ups and downs. Spatially, APCA shows a distribution pattern of “west high, east low”. 2) APCA mainly shifted sequentially between neighbouring ranks. Besides, the change of APCA had significant spatial spillover effect, and highly advantage provinces featured more prominent proactive spillovers. 3) There is significant heterogeneity among the influencing factors.</p>","author":"Wenping Ning","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"019c45ad47a17fb677f46e9b7774cb448507af22e5954c4ff8815faef2dd017c","category":"Interdisciplinary"}