{"title":"Responses of Legumes to Rhizobia and Arbuscular Mycorrhizal Fungi: A Global Meta-Analysis","link":"https://www.preprints.org/manuscript/202410.0739/v1","date":1728544097000,"content":"Arbuscular mycorrhizal fungi (AMF) and rhizobia are crucial for plant productivity, microbial community structure, and soil quality, making them key components for sustainable ecosystem development. The symbiotic relationship between AMF and rhizobia is essential for effective biological nitrogen fixation and nutrient absorption, reducing reliance on chemical fertilizers and promoting sustainable agricultural practices. However, studies have shown that soil environment can hinder the symbiotic relationship between AMF and rhizobia. We conducted a meta-analysis of 158 articles from 1980 to 2022 to explore the synergistic interactions in legume-AMF-rhizobium systems and the potential mechanisms underlying synergism. Our findings revealed that the inoculation with AMF and/or rhizobia significantly (P &lt; 0.001) increased legume plant nitrogen content, phosphorus content, shoot biomass, yield, AMF colonization rate, nodule number, and nodule weight compared to uninoculated controls (effect size d &gt;0). There was a substantial synergistic effect between AMF and rhizobia (P &lt; 0.001). However, soil salt, drought and pH stress inhibited the positive effects of inoculation treatments, possibly due to the plant trade off strategies under adverse stress conditions. Under well-watered condition, the d values of plant yield in the rhizobia, AMF and co-inoculation treatments were 2.047, 1.661, and 3.412 (QM = 246, P &lt; 0.001), respectively, which were higher than that of 1.196, 0.765, and 1.828 (QM = 195, P &lt; 0.001) in the drought stress treatment. This research may potentially lead to new solutions for sustainable agricultural systems in the face of global climate change.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"01a078957e1ca7ae093a81c1ec4d4d6ab66937bc53750c056fabe0aa465122bf","category":"Interdisciplinary"}