{"title":"สรุปแถลงข่าวจับกุม 9Near คนร้ายเป็นทหาร ต้นสังกัดไม่เกี่ยวกับเทคโนโลยี, ยังไม่ระบุว่าหลุดจากไหน","link":"https://www.blognone.com/node/133338","date":1680856861000,"content":"<div><div><div><p>เมื่อ 15.00 ที่ผ่านมา กระทรวงดิจิทัลฯ ร่วมกับ กองบัญชาการตำรวจสืบสวนสอบสวนอาชญากรรมทางเทคโนโลยี (บช.สอท) แถลงข่าวกรณีการจับกุมแฮกเกอร์ <a href=\"https://www.blognone.com/node/133040\">9Near ที่แฮกข้อมูลคนไทย 55 ล้านคน</a> ระบุว่าคนร้ายเป็นทหารยศ จ่าสิบโท โดยต้นสังกัดที่ทำงาน ไม่มีความเกี่ยวข้องใดๆ กับภารกิจด้านเทคโนโลยี และจากการสืบสวน คนร้ายมีความรู้ด้านคอมพิวเตอร์ค่อนข้างมาก ส่วนแรงจูงใจคาดว่าน่าจะเป็นเรื่องส่วนตัว</p>\n<p>ขณะที่การจับตัวคนร้าย เนื่องจากเป็นทหาร ยังไม่สามารถจับกุมได้ทันที ต้องผ่านกระบวนการทางผู้บังคับบัญชา ตอนนี้ได้ส่งหนังสือไปยังต้นสังกัดแล้ว เพื่อตรวจสอบว่าตอนนี้ยังรับราชการอยู่หรือไม่ ถ้ายังรับอยู่ ต้องเป็นหน้าที่ของต้นสังกัดในการติดตามตัวและดำเนินการ ส่วนคนร้ายตอนนี้ติดต่อไม่ได้ รวมถึงภรรยาคนร้ายด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8294dccccab10a92e33863b3232607c4.png\" /></p>\n<p>ในแง่ของช่องโหว่ ณ ตอนนี้ยังสืบสวนสอบสวนอยู่ และยังไม่ยืนยันว่าหลุดออกมาจากระบบไหน รวมถึงยังไม่ยืนยันด้วยว่าข้อมูลถึง 55 ล้านรายการจริงหรือไม่ เพราะต้องรอตรวจสอบจากหลักฐานที่ยึดจากคนร้าย ว่าใช้อุปกรณ์ของตัวเองในการแฮ็กแค่ไหนอย่างไร รวมถึงมีข้อมูล 55 ล้านรายการจริงๆ หรือแค่โม้</p>\n<p>ทาง บช.สอท แนะนำแนวทางแก้ปัญหาข้อมูลหลุดด้วยว่า ด้วยสำรวจความปลอดภัยของตัวเอง ไม่เอาข้อมูลส่วนตัว เช่น วันเกิดมาตั้งเป็นรหัสผ่าน หรือมีเบอร์แปลกๆ โทรมา ไม่รู้จักก็ไม่ควรรับ</p>\n<p>นายชัยวุฒิ รัฐมนตรี DES ระบุด้วยว่า ขอให้ประชาชนที่ได้รับความเดือนร้อนจากกรณีนี้ (ข้อมูลหลุด) ขอให้เข้าแจ้งความ ซึ่งตาม PDPA ฟ้องได้หลายกรณี ตามความเสียหายที่เกิด โดยฟ้องกับหน่วยงานที่เกี่ยวข้อง ไม่ว่าจะศาลแพ่ง ศาลอาญา หรือสำนักงานคุ้มครองข้อมูลส่วนบุคคล ส่วนการเอาผิดหน่วยงานที่ทำข้อมูลหลุด ยังตอบไม่ได้ตอนนี้ ว่าจะดำเนินการต่อไปอย่างไร เป็นหน้าที่ของกรรมการที่ดูแลเรื่องนี้</p>\n<p>ส่วนในแง่มาตรการ ก็ระบุว่ารัฐบาลมีมาตรการป้องกันเรื่องนี้อยู่แล้ว หน่วยงานไหนของภาครัฐที่อาจมีช่องโหว่ก็จะมีคณะกรรมการการรักษาความมั่นคงปลอดภัยไซเบอร์แห่งชาติ (กมช.) เข้าไปดำเนินการ อุดช่องโหว่ รวมถึงเรียกร้องให้ทุกหน่วยงาน ช่วยกันดูแลระบบให้ปลอดภัย เพราะมีหลายหน่วยงานที่มีข้อมูลลักษณะนี้่อยู่</p>\n<p>ที่มา - <a href=\"https://www.facebook.com/watch/live/?ref=watch_permalink&amp;v=1345901123015183\">กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ministry-digital-economy\">Ministry of Digital Economy</a></div><div><a href=\"/topics/thailand\">Thailand</a></div><div><a href=\"/topics/hacking\">Hacking</a></div><div><a href=\"/topics/cybersecurity\">Cybersecurity</a></div></div></div>","author":"nismod","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"01b3076f45b55427b82d9cf275142672b2796d36c9a5748b276073c2cb704f59","category":"Thai"}