{"title":"Barley yellow dwarf virus in winter barley: Control in light of resistance issues and loss of neonicotinoid insecticides","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12946?af=R","date":1727664235000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/41e64d63-d33b-4aff-9a9d-8fb56cc2ec80/aab12946-toc-0001-m.png\" alt=\"Barley yellow dwarf virus in winter barley: Control in light of resistance issues and loss of neonicotinoid insecticides\" />\n<p>Winter barley yield is significantly impacted by BYDV. In the absence of neonicotinoid seed dressing, alternative insecticides offer protection for winter barley crops against the aphid vectors of BYDV and associated yield loss.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Barley yellow dwarf virus (BYDV) is the most widespread viral disease of cereal crops vectored by aphids, causing stunting of the crop and significant yield loss. Management recommendations for autumn sown cereals has centred on the timely control of aphid vectors, particularly their management before the crop has reached Growth Stage 31 (stem elongation). In recent years two separate but related issues have emerged, (i) the detection of pyrethroid resistance in a single <i>Sitobion avenae</i> SA3 clone and (ii) the withdrawal of neonicotinoid insecticide seed dressing; widely used to manage aphids in the early development of cereal crops. A series of replicated field studies were conducted from 2016 to 2019 to ascertain if the pyrethroid insecticide is still effective in light of the SA3 clones' presence in aphid populations and if withdrawal of neonicotinoid seed dressings has negatively affected aphid management. Both disease levels and yields confirmed that the neonicotinoid, clothianidin, applied as a seed treatment significantly contributed to the management of BYDV in the different trials investigated. Results of this study demonstrate application of a foliar (lambda-cyhalothrin or a sulfoxaflor) insecticide has a significant positive impact on yield. Foliar pyrethroid insecticides were as effective in protecting yield from BYDV as the neonicotinoid seed treatments. In the absence of neonicotinoid seed dressing, alternative insecticides still offer protection for winter barley crops against the aphid vectors of BYDV and associated yield loss. Furthermore, the presence of a pyrethroid resistant <i>Sitobion avenae</i> SA3 clone had no observable impact on field efficacy of the pyrethroid insecticide, lambda-cyhalothrin in these trials. However, this needs continuous monitoring because of potential further increases in resistance levels or emergence of additional resistance mechanisms, which could render pyrethroid insecticides ineffective.</p>","author":"Louise Mc Namara, \nSeán Lacey, \nStephen Kildea, \nMaximilian Schughart, \nLael Walsh, \nDeidre Doyle, \nMichael T. Gaffney","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"01ba378111734c910afef50a8dc4750aa57033b7d6a2361ce1951c4e8169c6d5","category":"Environment"}