{"title":"Diagnostic Performance of F-18 FDG PET/CT in the Detection of Recurrent Colorectal Cancer: Correlation with Biochemical Markers and Conventional Imaging Modalities","link":"https://www.preprints.org/manuscript/202405.0308/v1","date":1715041632000,"content":"Background/Objectives: Although the role of F-18 FDG PET/CT imaging is well established in oncology, its diagnostic value in routine monitoring for recurrent colorectal cancer (CRC) is still controversial. The aim was to evaluate the diagnostic value of FDG PET/CT in detecting recurrent CRC in correlation with CEA, CA 19-9 levels, and conventional imaging modalities (CIM). Methods: Between 2009 and 2023, we retrospectively studied 134 CRC patients referred for FDG PET/CT imaging on the suspicion of recurrence based on elevated CEA and/or CA 19-9, and/or equivocal radiological findings. According to the Institutional Tumor Board CRC protocol, after initial treatment which was dependent on TNM stage (neoadjuvant therapy, primary resection or adjuvant treatment), patients underwent a standard 5-year surveillance including CEA and CA 19-9 measurements, CIM, and colonoscopy every 6 months. The statistics including univariate and multivariable analyses were conducted using the IBM SPSS 20.0 statistical software. P-values &lt;0.05 were considered statistically significant. Results: Recurrent CRC was confirmed in 54/134 (40.3%) patients with elevated tumor markers. FDG PET/CT shows high diagnostic performance in detecting recurrent CRC with sensitivity, specificity, PPV, NPV, and accuracy of 94.4%, 82.5%, 78.5%, 95.7%, and 87.3%, respectively. The CEA shows a high sensitivity of 98.1%, but both low specificity and accuracy of 15% and 48.5%, respectively. The sensitivity, specificity, and accuracy, for CA 19-9 and CIM for the correct diagnosis in CRC patients were: 44.4%, 67.5%, 58.2%, and 51.9%, 98.8%, 79.9%, respectively. The AUC for FDG PET/CT, elevated CEA levels, CIM, and elevated CA 19-9 levels was 0.885 (95% CI: 0.824-0.946; p&lt;0.001), 0.844 (95% CI: 0.772-0.916; p&lt;0.001), 0.753 (95% CI: 0.612-0.844; p&lt;0.001); and 0.547 (95% CI: 0.442-0.652; p=0.358). Univariate analysis shows that both FDG PET/CT- and CIM-positive results were highly associated with CRC recurrence (p&lt;0.001 and p&lt;0.001, respectively), while gender, mucinous tumor type, presence of initial lymph node metastasis (N+), and presence of initial distant metastasis (M+) have no significance (p=0.211, p=0.158, p=0.583, and p=0.201, respectively). Our multivariate analysis shows that independent predictors for CRC recurrence are: positive FDG PET/CT scans (p&lt;0.001), positive CIM results (p=0.001) and elevated CA19-9 levels (p=0.023). Although CA 19-9 was not detected as a statistically significant predictor in the univariate analysis (p=0.358), in a multivariate analysis it was recognized as a significant predicting factor in detecting CRC recurrence (p=0.023). Conclusions: FDG PET/CT shows a high diagnostic efficacy in CRC recurrence detection, in correlation with CEA levels, CA 19-9 levels, and CIM. This imaging modality should be routinely integrated into the postoperative follow-op in patients with elevated tumor markers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"01bca7fe11bf1ee534c7176884bd06ad43ab3ed389909645a90b38e3e5fac752","category":"Interdisciplinary"}