{"title":"Nutrition and diet in the general U.S. Asian American population: A scoping review protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309219","date":1724421600000,"content":"<p>by Sze Wan Chan, Gregory Laynor, Shahmir H. Ali, Stella S. Yi</p>\r\nIntroduction <p>Asian American populations face unique structural/social inequities contributing to poor diet quality and health disparities. The current body of literature on diet and food consumption of Asian Americans mainly focuses on the health of Filipino and East Asian Americans, or those with pre-existing non-communicable diseases.</p> Objective <p>The aim of this review is to comprehensively compile all available literature on nutrition and dietary consumption among the general population in Asian American ethnic subgroups, highlight any disparities and research gaps, and suggest further research action.</p> Methods <p>With guidance from a research librarian, we enumerated and searched key terms related to diet, food, nutrition, and Asian Americans in PubMed/MEDLINE, Food Science Collection (CABI Digital Library), CINAHL (EBSCO), Scopus, Food Science and Technology Abstracts (Web of Science), and Biological &amp; Agricultural Index Plus (EBSCO) in accordance with PRISMA-S guidelines. An article will be included if it was published in the English language; is a peer-reviewed research manuscript or published in grey literature from 2000 to present; and describes what food groups and macronutrients healthy non-institutionalized Asian Americans in the U.S. are eating. An article will be excluded if it contains only research conducted outside of the U.S.; combines Asian Americans with Native Hawaiian and Pacific Islanders; and had no explicit focus on Asian American nutrition and dietary consumption. Two or more reviewers will participate in the study screening and selection process. We will record article characteristics, diet outcomes, and recommendations from final included articles using a data extraction table and prepare a summary narrative with key findings.</p> Expected outputs <p>Results will be disseminated through a peer-reviewed manuscript. The findings from this review can have broad implications for designing and implementing nutrition-focused initiatives that will appropriately reflect and address the needs as well as norms and values of each distinct Asian American ethnic subgroup.</p>","author":"Sze Wan Chan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"01bed1825fcc50b9e2f94f2e10bddb113004c4ed9c8e131ffdcff097689c19c1","category":"Interdisciplinary"}