{"title":"Perceptions towards management of acute malnutrition by community health volunteers in northern Kenya","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002564","date":1715868000000,"content":"<p>by Elizabeth Wambui, Calistus Wilunda, Hermann Pythagore Pierre Donfouet, Bonventure Mwangi, Taddese Alemu Zerfu, Tewoldeberha Daniel, Olivia Agutu, Betty Samburu, Daniel Kavoo, Lydia Karimurio, Pilar Charle Cuellar, Emily Keane, Lilly Schofield, James Njiru, Martin Chabi, Lucy Gathigi Maina, Peter Okoth, Judith Raburu, Grace Gichohi, Alex Mutua, Charles Matanda, Elizabeth Kimani-Murage</p>\r\n\r\nChild undernutrition is a persistent challenge in arid and semi-arid areas due to low and erratic rainfall, recurrent droughts and food insecurity. In these settings, caregivers face several challenges in accessing health services for sick and/or malnourished children, including long distances to health facilities, harsh terrain, and lack of money to pay for transportation costs to the health facilities, leading to low service coverage and sub-optimal treatment outcomes. To address these challenges and optimize treatment outcomes, the World Health Organization recommends utilizing community health volunteers (CHVs) to manage acute malnutrition in the community. This study explored the perceptions of community members regarding acute malnutrition treatment by CHVs in Turkana and Isiolo counties in Kenya. The study utilized a cross-sectional study design and included a purposive sample of caregivers of children, CHVs, officers who trained and supervised CHVs and community leaders in the intervention area. Focus group discussions and key informant interviews were used to explore perceptions towards the management of acute malnutrition by CHVs. Generally, caregivers and CHVs perceived the intervention to be beneficial as it readily addressed acute malnutrition treatment needs in the community. The intervention was perceived to be acceptable, effective, and easily accessible. The community health structure provided a platform for commodity supply and management and CHV support supervision. This was a major enabler in implementing the intervention. The intervention faced operational and systemic challenges that should be considered before scale-up.","author":"Elizabeth Wambui","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"01c034a5e09aa0598ab224c94a1b980b7814dede20e40b3cac50788b64840202","category":"Environment"}