{"title":"The Temperature of the Deep Ocean Is a Robust Proxy for Global Mean Surface Temperature During the Cenozoic","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004788?af=R","date":1715929200000,"content":"<h2>Abstract</h2>\n<p>Reconstructing global mean surface temperature (GMST) is one of the key contributions that paleoclimate science can make in addressing societally relevant questions and is required to determine equilibrium climate sensitivity (ECS). GMST has been derived from the temperature of the deep ocean (T<sub>d</sub>), with previous work suggesting a simple T<sub>d</sub>-GMST scaling factor of 1 prior to the Pliocene. However, this factor lacks a robust mechanistic basis, and indeed, is intuitively difficult to envisage given that polar amplification is a ubiquitous feature of past warm climate states and deep water overwhelmingly forms at high latitudes. Here, we interrogate whether and crucially, why, this relationship exists using a suite of curated data compilations and two sets of paleoclimate model simulations. We show that models and data are in full agreement that a 1:1 relationship is a good approximation. Taken together, the two sets of climate models suggest that (a) a lower sensitivity of SST in the season of deep water formation than high latitude mean annual SST in response to climate forcing, and moreover (b) a greater degree of land versus ocean surface warming are the two processes that act to counterbalance a possible polar amplification-derived bias on T<sub>d</sub>-derived GMST. Using this knowledge, we provide a new Cenozoic record of GMST. Our estimates are substantially warmer than similar previous efforts for much of the Paleogene and are thus consistent with a substantially higher-than-modern ECS during deep-time high CO<sub>2</sub> climate states.</p>","author":"David Evans, \nJulia Brugger, \nGordon N. Inglis, \nPaul Valdes","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"01c459fcd1a91587f1783140a0967bc54dac3946909f66a28028d93ef7f4f6e0","category":"Environment"}