{"title":"The iPhone 15 Pro buttons saga presses on with  ‘3D Touch’ Action button rumor","link":"https://www.macworld.com/article/1788799/iphone-15-pro-solid-state-action-button-3d-touch.html","date":1681753463000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>After reports last week that Apple had abandoned the iPhone 15 Pro’s solid-state buttons after ‘technical issues,’ a new leak claims that Apple is indeed going ahead with the feature.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/analyst941&amp;xcust=1-1-1788799-1-0-0&amp;sref=https://www.macworld.com/feed\">@analyst941 on Twitter</a>, who revealed <a href=\"https://www.macworld.com/article/1785378/ios-17-leak-app-settings-interface-details.html\">information about iOS 17</a> last week, Apple is still planning to launch the iPhone 15 Pro with a capacitive Active Button that will be “Force-sensitive…like 3D-touch was” and “can be ‘light’ or ‘hard’ pressed.” The button would replace the mute switch, which has been a staple on all iPhone models since it launched in 2007.</p>\n\n\n\n<figure><div>\n<blockquote><p>If you missed it, or don’t understand how the capacitive button can be “light” or “hard” pressed: again, the capacitive buttons (incl. action) will be Force-sensitive.<br /><br />It’s like 3D-touch was, so it will recognize whether you’re just tapping it, lightly pressing it, or hard press</p>— 941 (@analyst941) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/analyst941/status/1647404201507422210?ref_src=twsrc%5Etfw&amp;xcust=1-1-1788799-1-0-0&amp;sref=https://www.macworld.com/feed\">April 16, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>The tipster also claims the Action button will have various uses within apps, including new functionality within the Camera app. Analyst941 claims the buttons will have three functions:</p>\n\n\n\n<ul><li>Light press: Forces the camera to auto-focus on the closest subject</li><li>Hard press: Takes a photo</li><li>Hard, Long-hold press: Takes a video</li></ul>\n\n\n\n<p>You can currently press either of the volume buttons to snap a photo or hold one to record a video, with an option in Settings to use volume up for Burst mode. However, the Action button would be a much more visible—and presumably, advertised—feature if it arrives with the iPhone 15.</p>\n\n\n\n<p>Analyst941 also says the Action button will be used to force-restart the phone instead of the power button but doesn’t offer any other details on how the button would work. Presumably, it will have different options depending on the app being used and have an API so developers can customize it for third-party apps as well.</p>\n\n\n\n<p>After months of rumors about the iPhone 15 Pro’s solid-state buttons, Ming-Chi Kup reported last week that Apple had decided to ditch the feature due to “technical issues,” but Analyst941, who has leaked accurate rumors in the past, is confident Apple will still ship the new iPhones with capacitive buttons. We probably won’t know for sure until the iPhone 15 launches in September but you can follow along with the ever-changing leaks and rumors in our <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15 roundup</a>.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"01c98750db4dcf5066bd38e219182f9235c6e88acf53db8285fb399b6ec30f33","category":"Apple"}