{"title":"New RockShox BoXXer gets burlier 38mm stanchions, a new spring and highlights from single-crown fork range","link":"https://www.bikeradar.com/news/new-rockshox-boxxer-gets-burlier-38mm-stanchions-a-new-spring-and-highlights-from-its-single-crown-fork-range/","date":1689861604000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/07/RockShox-BoXXer-Ultimate-0aa55b9.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/07/RockShox-BoXXer-Ultimate-0aa55b9.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/RockShox-BoXXer-Ultimate-0aa55b9.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/RockShox-BoXXer-Ultimate-0aa55b9.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/RockShox-BoXXer-Ultimate-0aa55b9.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/RockShox-BoXXer-Ultimate-0aa55b9.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/RockShox-BoXXer-Ultimate-0aa55b9.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/RockShox-BoXXer-Ultimate-0aa55b9.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/RockShox-BoXXer-Ultimate-0aa55b9.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/RockShox-BoXXer-Ultimate-0aa55b9.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"RockShox BoXXer Ultimate\" title=\"RockShox BoXXer Ultimate\" />                                            <p>The new RockShox BoXXer hasn’t been a well-kept secret. With two years of development under the brand’s sponsored athletes and testing team, the fork has been hiding in plain sight for a while.</p>\n<p>The BoXXer has been well represented in the UCI downhill world cup this season, chalking up wins under world champion and SRAM rider Vali Höll.</p>\n<p>Now, it’s available for public consumption. RockShox has overhauled its double-crown fork with plenty of updates and new features. The aim is to keep racers on top of the podium and give the bike park crowd, and riders of electric bikes, a better experience on the trail.</p>\n<p>There are two models being released, the first of which is the RockShox BoXXer Ultimate.</p>\n<p>The BoXXer Ultimate is available aftermarket for £2,029/$1,899/€2,279 and gets all the latest RockShox tech, including its Charger 3 RC2 damper.</p>\n<p>Secondly, there’s an OE-only fork, called the Rockshox BoXXer, fitted with a Charger 3 RC damper.</p>\n<p>Both forks dish out <a href=\"https://www.bikeradar.com/advice/buyers-guides/how-much-suspension-travel-do-i-need-on-my-mountain-bike/\">200mm of travel</a> from a new spring and are available in 650b and <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-a-29er/\">29in wheel-size</a> versions of the new chassis. Spring travel kits are available to reduce travel to 190mm or 180mm. The fork is also rated for use on <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-mountain-bikes/\">electric mountain bikes</a>.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"RockShox BoXXer Ultimate ridden by world champion Vali Höll\" title=\"RockShox BoXXer Ultimate ridden by world champion Vali Höll\" /></div><div><figcaption><span><i></i> World champion Vali Höll has piloted the new RockShox BoXXer Ultimate to two downhill world cup wins so far this season.</span></figcaption><span> <i>Ross Bell</i></span></div>\n<section><div>\n        \n<h4>Five things you need to know about the RockShox BoXXer</h4>\n<ul><li>It features 38mm stanchions and new lower-leg architecture to optimise handling and comfort</li>\n<li>There’s a new DebonAir+ twin-tube spring, which uses a cartridge design to provide RockShox’s most linear air-spring curve</li>\n<li>New oil flow ports in the upper tubes are designed to help keep the bushings lubricated during use</li>\n<li>The RockShox BoXXer Ultimate features a Charger 3 RC2 damper and ButterCups</li>\n<li>The BoXXer Ultimate is the only fork currently available aftermarket, at £2,029/$1,899/€2,279</li>\n</ul><p>\n\n    </p></div>\n    </section><p> </p>\n<h2>A new burly BoXXer</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"RockShox BoXXer chunkier silhouette\" title=\"RockShox BoXXer chunkier silhouette\" /></div><div><figcaption><span><i></i> The new 38mm-stanchion BoXXer provides a chunkier aesthetic at the front of downhill bikes than its predecessor.</span></figcaption><span> <i>Ross Bell</i></span></div>\n<p>The least subtle change to RockShox’s downhill <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-suspension-forks/\">mountain bike fork</a> is its beefed-up chassis size, with new 38mm stanchion diameters. This is clearly a burlier fork than its 35mm-stanchion predecessor.</p>\n<p>RockShox says, however, that it hasn’t gone for all-out stiffness, and the 38mm BoXXer has been designed to blend torsional and bending stiffness for the handling characteristics RockShox wanted.</p>\n<p>To fine-tune the balance between stiffness, compliance and comfort, RockShox says it has used countless downhill runs, lab test cycles and park laps to tailor the stanchion-wall thickness and lower-leg architecture to offer steering inputs that deliver control without shaking your hands to bits.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"RockShox BoXXer lower leg arch\" title=\"RockShox BoXXer lower leg arch\" /></div><div><figcaption><span><i></i> The lower legs have been designed alongside the stanchion wall thickness to offer handling that balances comfort, control and precision.</span></figcaption><span> <i>RockShox</i></span></div>\n<p>The dual crown also comes in tall and short options, depending on head tube length. These are available for OE bikes and on aftermarket forks. The crowns have been machined to save weight and are anodised for a smart and tough aesthetic.</p>\n<p>Another detail added to the chassis is the height marking on the stanchions, which means you can set the crown height without needing to reach for a ruler.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"RockShox BoXXer crown height markers\" title=\"RockShox BoXXer crown height markers\" /></div><div><figcaption><span><i></i> New printings on the stanchions enable you to set the crown height without needing to measure anything.</span></figcaption><span> <i>RockShox</i></span></div>\n<p>The new BoXXer still uses the same 20x110mm Boost Maxle fitted on older BoXXer models and uses a 200mm brake mount with a maximum rotor size of 220mm. The BoXXer Ultimate comes with a bolt-on fender too. It’s available to buy separately for OE forks.</p>\n<h2>Spring into action</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"RockShox BoXXer Ultimate DebonAir+ twin tube spring with ButterCups\" title=\"RockShox BoXXer Ultimate DebonAir+ twin tube spring with ButterCups\" /></div><div><figcaption><span><i></i> RockShox developed its new DebonAir+ twin-tube spring to provide better small-bump sensitivity, more linear support and a taller rider height.</span></figcaption><span> <i>RockShox</i></span></div>\n<p>For the BoXXer, Rockshox had to develop a new air spring to produce the linear spring curve it wanted. Using the 38mm stanchion wall as a component of the spring meant the positive chamber was too large on the dual-crown fork and the progressivity too severe.</p>\n<p>This means RockShox introduces its DebonAir+ twin-tube spring. This is a cartridge-design air spring that fits inside the 38mm stanchions.</p>\n<p>RockShox claims this has enabled it to optimise the air chamber’s volumes, along with the casting volume (air trapped inside the lower legs) to achieve the desired spring curve and feel.</p>\n<p>Inside the spring is a new hollow 14mm spring shaft rather than its standard 10mm shaft. This hollow design has increased the negative spring volume for improved small-bump sensitivity.</p>\n<p>The positive spring volume was optimised with the casting to produce a ‘bump-swallowing’ spring curve RockShox claims is its most linear yet.</p>\n<p>The DebonAir+ twin-tube spring is intended to deliver the feel and use of travel of a coil spring, while keeping the tuneability of an air spring. The more linear spring curve is said to enable full use of travel, and progression can be tailored with RockShox’s standard Bottomless Tokens, yet it maintains a taller rider height.</p>\n<p>To prevent harsh bottom-outs, the BoXXer comes fitted with a new jounce (bottom-out) bumper to help prevent metal-on-metal clunks when you end up at full travel.</p>\n<h2>Stolen goods</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"RockShox BoXXer Ultimate Charger 3 RC2 damper dials\" title=\"RockShox BoXXer Ultimate Charger 3 RC2 damper dials\" /></div><div><figcaption><span><i></i> The new BoXXer Ultimate gets a BoXXer-specific Charger 3 RC2 damper. This keeps high- and low-speed compression circuits separate.</span></figcaption><span> <i>RockShox</i></span></div>\n<p>With a whole new chassis and air spring, it’s no surprise to see RockShox make use of its latest Charger 3 dampers in the new BoXXer. Plus, it has borrowed some of the latest features from its single-crown fork range to boost the BoXXer’s tech.</p>\n<p>The latest Charger 3 RC2 damper employed in the BoXXer Ultimate has independent high- and low-speed compression damping that’s designed to completely take away cross-talk between the two damping circuits. That means adjusting one won’t affect the other, and vice versa.</p>\n<p>RockShox also states that each of the five clicks of high-speed compression, 15 clicks of low-speed compression and 18 clicks of rebound damping makes a meaningful difference to ride feel. So, optimal settings should be just one click away.</p>\n<p>The low-speed rebound-damping circuit has also been revamped, to work alongside the new air spring.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"RockShox BoXXer Ultimate with ButterCups\" title=\"RockShox BoXXer Ultimate with ButterCups\" /></div><div><figcaption><span><i></i> The new BoXXer Ultimate employs RockShox’s ButterCups to help reduce high-frequency vibrations and minimise hand and arm ache.</span></figcaption><span> <i>RockShox</i></span></div>\n<p>The BoXXer Ultimate also gets ButterCups, found on <a href=\"https://www.bikeradar.com/advice/buyers-guides/rockshox-suspension-fork-guide/\">RockShox’s Pike, Lyrik and ZEB Ultimate forks</a>. These are small rubber pucks at the bottom of the air spring and damper shafts. They connect to the lower legs and are designed to reduce high-frequency vibrations that can lead to sore hands and arms on long, rough descents.</p>\n<p>While the BoXXer Ultimate features all of RockShox’s most advanced tech, the new DebonAir+ twin-tube spring with ButterCups and the Charger 3 RC2 damper with ButterCups are available upgrades for the OE RockShox BoXXer.</p>\n<p>These cost £101/$104/€113 and £356/$358/€399, respectively. It should be noted these are not compatible with the older 35mm-stanchion forks.</p>\n<h2>Maximising slipperiness</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"RockShox BoXXer Oil Flow Ports\" title=\"RockShox BoXXer Oil Flow Ports\" /></div><div><figcaption><span><i></i> RockShox’s new oil flow ports enable oil to circulate around the lower legs in use, helping to lubricate the bushing to keep them running smoothly.</span></figcaption><span> <i>RockShox</i></span></div>\n<p>To help keep the BoXXer’s performance at its best, oil flow ports have been drilled into the stanchions to enable oil to circulate through the fork. This should help lubricate the bushings and keep them smooth and slippery.</p>\n<p>A second claim is that deep in the stroke, these ports enable air in the lower legs to equalise above and below the bushing, helping to maintain a consistent spring rate.</p>\n<p>The BoXXer features a new Lower Leg Plug, which is an update to the Pressure Relief Valves and said to be easier and simpler for riders. However, not much information about this has been provided by RockShox.</p>\n<p>The BoXXer Ultimate also shares the ZEB’s Ultra-low Friction SKF wiper seals for smooth operation, while both BoXXer models use Maxima Plush Damping Fluid and Dynamic Suspension Lube.</p>\n<h2>RockShox BoXXer specifications and details</h2>\n<p>There are two new forks, the RockShox BoXXer and RockShox BoXXer Ultimate. Only the BoXXer Ultimate is currently available aftermarket for £2,029/$1,899/€2,279.</p>\n<p>We’ll be getting our hands on a test pair very soon, so keep an eye out on BikeRadar for a review.</p>\n<h3>RockShox BoXXer Ultimate</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"RockShox BoXXer Ultimate 2024\" title=\"RockShox BoXXer Ultimate 2024\" /></div><div><figcaption><span><i></i> RockShox BoXXer Ultimate 2024.</span></figcaption><span> <i>RockShox</i></span></div>\n<h3>Features</h3>\n<ul><li>New 38mm chassis designed to balanced stiffness and ride quality</li>\n<li>New DebonAir+ twin-tube air spring for improved small-bump feel, added support and taller rider height</li>\n<li>New signature colourway – BoXXer Electric Red/Gloss Black</li>\n<li>New RockShox fender</li>\n<li>New Lightweight machined and anodized crown for aesthetics and durability</li>\n<li>New Crown-height gradient markers to simplify setup</li>\n<li>Charger 3 RC2 damper for BoXXer. Featuring high-speed compression, low-speed compression and a revamped low-speed rebound</li>\n<li>ButterCups to help reduce hand and arm fatigue</li>\n<li>Ultra-low-friction SKF wiper seals designed to improve overall suspension feel</li>\n<li>Maxima Plush damping fluid helps reduces friction and silences damper noise</li>\n<li>Maxima Plush Dynamic suspension lube to enhance suspension performance</li>\n</ul><h3>Specifications</h3>\n<ul><li><strong>Damper:</strong> Charger 3 RC2 with ButterCups</li>\n<li><strong>Spring:</strong> BoXXer DebonAir+ twin tube with ButterCups</li>\n<li><strong>Wheel size:</strong> 27.5in, 29in</li>\n<li><strong>Travel:</strong> 180mm†, 190mm†, 200mm</li>\n<li><strong>Fork offset:</strong> 44mm (27.5in), 48mm (27.5in, 29in) 52mm (29in)</li>\n<li><strong>Claimed weight:</strong> 2,840g (200mm travel, 48mm offset)</li>\n<li><strong>MSRP:</strong> £2,029/$1,899/€2,279</li>\n</ul><p>†Travel change kit available</p>\n<h3>RockShox BoXXer</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"RockShox BoXXer 2024\" title=\"RockShox BoXXer 2024\" /></div><div><figcaption><span><i></i> RockShox BoXXer 2024.</span></figcaption><span> <i>RockShox</i></span></div>\n<h3>Features</h3>\n<ul><li>New 38mm chassis designed to balanced stiffness and ride quality</li>\n<li>New DebonAir+ twin tube air spring for improved small-bump feel, added support and taller rider height</li>\n<li>New Charger 3 RC damper featuring easy to adjust low-speed compression and independent low-speed rebound</li>\n<li>New Graphics package</li>\n<li>Maxima Plush damping fluid helps reduce friction and silences damper noise</li>\n<li>Maxima Plush Dynamic suspension lube to enhance suspension performance</li>\n</ul><h3>Specifications</h3>\n<ul><li><strong>Damper:</strong> Charger 3 RC</li>\n<li><strong>Spring:</strong> BoXXer DebonAir+ twin tube</li>\n<li><strong>Wheel size:</strong> 27.5in, 29in</li>\n<li><strong>Travel:</strong> 180mm†, 190mm†, 200mm</li>\n<li><strong>Fork offset:</strong> 44mm (27.5in), 48mm (27.5in, 29in) 52mm (29in)</li>\n<li><strong>Claimed weight:</strong> 2,680g (200mm travel, 48mm offset)</li>\n</ul><p>†Travel change kit available</p>\n<p> </p>\n<p> </p>","author":"Luke Marshall","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"01cca0053cf1827494099216b9f40d54de635887d70802c4f8cb1dd6dee456f1","category":"Cycling"}