{"title":"Giro d'Italia 2023 stage four preview - a taste of the Apennines","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2023-stage-four-preview","date":1683565487000,"content":"\n      <p><b></b><b>Distance: </b><span>175km<br /></span><b>Start location: </b><span>Venosa<br /></span><b>Finish location: </b><span>Lago Laceno<br /></span><b>Start time: </b><span>12:30 CEST<br /></span><b>Finish time (approx): </b><span>17:15 CEST</span></p>\n<p><span>Spanning across the Italian peninsula are the Apennine mountains, which the riders will venture into for the first time at this year’s <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>. Although at a lower altitude than the fearsome summits of the Alps that lie north of the nation and await later in the race, this mountain range is still made up of climbs big enough to have a significant impact on the race. And the way they stretch as far south as Calabria and as far north as the Ligurian coast means they handily provide the Giro organisers the option of including major climbs throughout the race’s entire three weeks.</span></p>\n<div></div>\n<p><span>The geography of the Apennines was also important to the Roman empire in ancient history. They formed a natural land barrier around Rome, making it difficult for invaders to move from one end of the peninsula to the other, while the fertile soil in the values was conducive to growing crops like olives and grains.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/to-lose-the-jersey-or-keep-the-jersey-why-ceding-a-grand-tour-lead-is-not-as-simple-as-it-seems\"><strong><em>Read more: To lose the jersey or keep the jersey? Why ceding a Grand Tour lead is not as simple as it seems</em></strong></a></p>\n<p><span>Today’s stage will take place further south from the central Apennines that lie west of Rome in the southern Apennines, but still have significance in ancient history: the starting town of Venosa was the birthplace of Horace, one of the great classic poets whose conversational intimate style of writing provides insights into life in Rome during the era of Augustus. </span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Giro_stage_4_preview.jpg?v=1682419847\" alt=\"Stage four of the Giro 2023\" /></p>\n\n<p><span><em>Stage four profile sourced on the Giro d'Italia website </em></span></p>\n<p><span>The nature of the climbs today are long and steady rather than short and steep, so expect attritional rather than explosive racing. In total there are 3,500 metres of climbing, which isn’t enough for a full-blown GC battle (the organisers have given it a three-star rank out of five), but will be enough to draw out the main contenders for the pink jersey. The category two Passo Delle Crocelle is the first of the day’s three climbs, and rises at relatively shallow gradients of about 4 or 5% for just over 20km; then comes the Valco di Monte Carruozzo, another category two climb with a very similar length and gradient.</span></p>\n<p><span>The final climb of Colle Molella starts similarly, with the gradient barely rising above 5% to begin with. But halfway up the road ramps up to nearly 10%, and stays like that for the next 3km before levelling off before the summit, followed by a 3km plateau to the finish at Lago Laceno ski resort. It’s on this steep stretch of road that the stage will likely be decided, as was the case when the Giro last visited in 2012, when Domenico Pozzovivo went clear to win what remains his only stage win from sixteen Giro appearances. </span></p>\n<p><span>On that occasion, there were 23 riders left in the peloton that arrived behind Pozzovivo at the finish, suggesting that the climb is difficult enough to determine the dozen or so riders who will be contention for a high GC finish, but not establish a hierarchy among them. And bad fortune here need not necessarily be fatal — Ryder Hesjedal had a puncture just before the climb in 2012, but managed to chase back on to be among those 23 riders, and ultimately went on to win the pink jersey.</span></p>\n<h3><span>Contenders</span></h3>\n<p><span>Deciding on stage four's contenders depends on whether or not you expect the breakaway stays away. Race leader Remco Evenepoel (Soudal-Quick-Step) has already casually proclaimed he'd be eyeing ceding the pink jersey to a breakaway rider in the Giro's first mountain stage, but that is easier said than done. The Belgian would need all the GC teams to be in agreement that the breakaway can stay away, which seems likely considering how early in the race we are, but nothing is guaranteed.</span></p>\n<p><span>It'll be a race between the main GC contenders if there is a team interested in keeping things together, but if a big breakaway escapes as expected we need to look further down the standings for a possible winner.</span></p>\n<p><span>Judging by the way he was chasing mountain points on stage three, there's an almost certainty that <strong>Thibaut Pinot</strong> (Groupama-FDJ) will try and make it into the escape. His main problem will be his undoubted quality, and at only two minutes down, he's unlikely to be given too much of a leash by the leading teams and may put the break's chances in jeopardy. If Pinot can't make it in, expect Groupama-FDJ to be represented as they hunt for stage wins.</span></p>\n<p><span><strong>Bauke Mollema</strong> (Trek-Segafredo) will be at home on the medium mountains too, while his team-mates <strong>Toms Skujiņš</strong> and <strong>Natnael Tesfatsion</strong> are also both capable of being competitive on this type of stage.</span></p>\n<p><span>There's a host of other riders who are suited to the stage and could form a huge breakaway. Expect <strong>Domenico Pozzovivo</strong> (a former winner on the final climb), <strong>Simon Clarke</strong>, and <strong>Stevie Williams</strong> to be active from Israel-Premier Tech, likewise <strong>Lorenzo Rota</strong> and <strong>Rein Taaramäe</strong> from Intermarché-Circus-Wanty. </span></p>\n<p><span><strong>Luis León Sánchez</strong>, <strong>Joe Dombrowski</strong> (both Astana Qazaqstan), <strong>Lorenzo Fortunato</strong>, <strong>Vincenzo Albanese</strong> (both Eolo-Kometa), <strong>Aurélien Paret-Peintre</strong>, <strong>Mikaël Cherel</strong> (both Ag2r Citroën), <strong>Jonathan Caicedo</strong> (EF Education-EasyPost), <strong>Bob Jungels</strong> (Bora-Hansgrohe), <strong>Valerio Conti</strong> (Corratec-Selle Italia), <strong>Harm Vanhoucke</strong> (DSM), <strong>Alessandro De Marchi</strong>, <strong>Filippo Zana</strong> (both Jayco-Alula), <strong>Alessandro Covi</strong> (UAE Team Emirates), <strong>Einer Rubio</strong> (Movistar), and <strong>Stefano Oldani</strong> and <strong>Nicola Conci</strong> (Alpecin-Deceuninck), all look like possible candidates for the first breakaway win of the Giro.</span></p>\n<h3><span>Prediction</span></h3>\n<p><span>It's one almost practically impossible to predict at this point of the race but we're confident the breakaway will be contesting the stage. In the spirit of Italy, we're going to back Italian champion <strong>Filippo Zana</strong> to secure a second consecutive stage win for Jayco-Alula and maiden Grand Tour win for himself.</span></p>\n<p> </p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"01cf76dd650e53e72553943d25c7b98ec7abf03b47623516b4f7f35f512ca614","category":"Cycling"}