{"title":"Morphology, Crystalline, and Microscopy Study of n-Alkanal Functionalized Cellulose Nanofibrils","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.475/7720050?rss=1","date":1721779200000,"content":"<span>Cellulose nanofibrils (CNF) are organic polymers with potential applications for developing biocomposites, drug delivery, and environmental applications [<a href=\"#ozae044.475-B1\">1</a>]. The properties of CNFs, such as their non-toxic and non-abrasive nature, high elastic modulus, and large specific surface area, are essential depending on the application [<a href=\"#ozae044.475-B1\">1</a>, <a href=\"#ozae044.475-B2\">2</a>]. Besides, two methods are often used to obtain nanocellulose materials; some chemical methods include contaminant solutions, higher costs, and lower recovery yields. However, ball milling is a low-cost, easy, and rapid technology for nanosized cellulosic material [<a href=\"#ozae044.475-B3\">3</a>]. Usually, dry milling is used, but wet milling is still studied because it provokes defibrillation of the material until CNF, which contains amorphous and crystalline cellulose domains but diameters of about 1 to 100 nm and length of about 500 to 2000 nm [<a href=\"#ozae044.475-B1\">1</a>, <a href=\"#ozae044.475-B4\">4</a>]. Currently, there is limited information regarding the uses of solvents and functional groups to enhance the properties of CNF for desired applications. In this study, particle size changes and the crystallinity index (CI, %) of commercial cellulose after wet ball milling in the presence of n-alkanals provide valuable results in choosing a milling time and the best functionalization compound. The CNF size and morphology were evaluated using microscopy and spectroscopy techniques for diverse applications.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"01d30985063e3b2b02976f991f8f320ce3d8c4228f0e5d68c1de1742e9be5a67","category":"Environment"}