{"title":"Is Canada Moving towards a More Agile Regulatory Approval and a Reimbursement Process with a Shifting Role for Real-World Evidence (RWE) for Oncology Drugs?","link":"https://www.preprints.org/manuscript/202408.1985/v1","date":1724834881000,"content":"Canada is known to have a complex pathway for new drug approval and reimbursement resulting in delayed access to patients with serious and life-threatening diseases such as cancer. Several recent publications from key stakeholders including patients, physicians and policymakers highlight patient helplessness, physician frustrations and policymakers entangled in a massive network of bureaucracy unable to make headway. Several quantitative assessments using time from regulatory approvals to successful reimbursements confirm long review times and high rejection rates for oncology drugs especially those receiving conditional approvals. A consensus forum of 18 Canadian oncology clinicians recently voiced frustration with the process and inability to deliver guideline-supported efficacious therapies to their patients. This manuscript compares data extracted from publicly available data sources from 2019 to June 2024 to previous publications. \nMethods: Public databases from Health Canada, the Canadian Agency for Drugs and Technologies in Health (CADTH), which is in the process of changing to Canada’s Drug Agency, and the pan-Canadian Pharmaceutical Alliance (pCPA) were reviewed and data collected were analyzed with descriptive statistics.\nResults: From the data, three trends emerge, i) an increasing number of oncology drugs are receiving conditional approvals from Health Canada, ii) the percentage of conditionally approved oncology drugs receiving positive reimbursement recommendations from CADTH is still low but appears to be improving, but delays in access are now contingent upon pCPA deciding whether to negotiate price and then the duration of any negotiation, and iii) real-world evidence is no longer part of decision-making for conditional approvals. A slight increase in positive endorsement of RWE used to support CADTH recommendations was observed.\nConclusion: Lack of timely access to oncology drugs hurts Canadian patients. While a small trend of improvement appears to be emerging, longer-term data collection is required to ensure sustained patient benefits.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"01df45849ff594c60721eb74651a99fda3bc842ec3e901140a1ea9931f0c5752","category":"Interdisciplinary"}