{"title":"A Unified Phenomenological Model Captures Water Equilibrium and Kinetic Processes in Soil","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035782?af=R","date":1710764013000,"content":"<h2>Abstract</h2>\n<p>Soil water sustains life on Earth, and how to quantify water equilibrium and kinetics in soil remains a challenge for over a century despite significant efforts. For example, various models were proposed to interpret non-Darcian flow in saturated soils, but none of them can capture the full range of non-Darcian flow. To unify the different models into one overall framework and improve them if needed, this technical note proposes a theory based on the tempered stable density (TSD) assumption for the soil-hydraulic property distribution, recognizing that the underlying hydrologic processes all occur in the same, albeit very complex and not measurable at all the relevant scales, soil-water system. The TSD assumption forms a unified fractional-derivative equation (FDE) using subordination. Preliminary applications show that simplified FDEs, with proposed hydrological interpretations and TSD distributed properties, effectively capture core equilibrium and kinetic water processes, spanning non-Darcian flow, water retention, moisture movement, infiltration, and wetting/drying, in the soil-water system with various degrees and scales of system heterogeneity. Model comparisons and evaluations suggest that the TSD may serve as a unified density for the properties of a broad range of soil-water systems, driving multi-rate mass, momentum, and energy equilibrium/kinetic processes often oversimplified by classical models as single-rate processes.</p>","author":"Yong Zhang, \nMartinus Th. van Genuchten, \nDongbao Zhou, \nGolden J. Zhang, \nHongGuang Sun","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"01e291a5233e120fab4840e36a8352ab39e9e0420b81be3d53b3c7b57ece4ed0","category":"Environment"}