{"title":"250 Effects of corn processing on growth performance, starch digestibility, and blood metabolites in receiving beef steers","link":"https://academic.oup.com/jas/article/102/Supplement_3/355/7757239?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Corn is the most common grain ingredient fed to feedlot cattle in the U.S. and most corn goes through some processing to increase the energy availability. This study examined the effects of a novel corn processing method on the growth performance, starch digestibility, and blood metabolites of growing steers compared with traditional corn processing methods. Angus-cross steers [n = 218; body weight (BW) = 230 ± 18.5 kg] were sorted into pens of 6 or 7 steers upon arrival and fed a common receiving diet for 2 d prior to being weighed, processed, and starting dietary treatments (n = 12 pens/treatment) on d 0. Treatments included diets with dry rolled corn (ROLL), steam flaked corn (FLAKE), and high shear dry extruded corn (EXT; High-Gel Insta-Pro International, Grimes, IA). Corn was included at 30% DM of a corn silage and SweetBran-based diet. Due to illness concerns, diets were adjusted to reduce corn in the diet to 25% on d 5; in feed antibiotic was fed d 5 to 9, and all calves were weighed and administered Draxxin (1.1 mL/45.45 kg) on d 17. Final BW were collected on d 37 and 38 and serum (glucose, insulin) and fecal samples (total tract starch digestibility) were collected from one steer per pen. Data were analyzed using the Mixed procedure of SAS 9.4 (Cary, NC) with pen as the experimental unit. Treatment did not affect midpoint (d 17) BW or average daily gain (ADG) from d 0 to 17 (<span>P</span> ≥ 0.31). Final BW, ADG, and dry matter intake were not different between treatments (<span>P</span> ≥ 0.15). Feed efficiency (gain:feed) was greatest in EXT (0.261) compared with ROLL (0.232) with FLAKE (0.259) being intermediate and not different from other treatments (<span>P</span> = 0.007). Total tract starch digestibility was determined using the equations from Zinn et al. (2007) and was increased in EXT and FLAKE compared with ROLL (<span>P</span> = 0.0002). Serum glucose and insulin on d 36 were not affected by treatment (<span>P</span> ≥ 0.19). Overall, a growing diet of 25% high shear dry extruded corn increased feed efficiency and total tract starch digestibility over dry rolled corn and resulted in similar performance to steers fed steam flaked corn.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"01e843eb623890b5de99b5c6b7afecfe5ad10331fce2f448b704c8c405e087c2","category":"Environment"}