{"title":"Size at sexual maturity, seasonal variation by maturity stages, and fecundity of the spotted round ray (Urobatis maculatus) and the thorny stingray (Urotrygon rogersi) from the northern tropical eastern Pacific","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15709?af=R","date":1716279641000,"content":"<h2>Abstract</h2>\n<p>Round rays (family: Urotrygonidae) are commonly caught as by-catch by shrimp trawl fisheries in the tropical eastern Pacific (TEP). However, little information on their life history and catch species composition exists for most round ray species, preventing the evaluation of the impact of fishing on their populations. The mean size at sexual maturity (<i>DW</i>\n<sub>\n   <i>50</i>\n</sub>), seasonal variation by maturity stages, and fecundity for two round ray species caught during shrimp trawl research cruises in the south-eastern Gulf of California (northern TEP) were estimated using a multi-model approach and inference for the first time, to determine the part of the population of each species that is being affected by shrimp trawling. Disc width (<i>DW</i>) ranged from 7.0 to 30.9 cm for the spotted round ray (<i>Urobatis maculatus</i>), and 7.2–33.5 cm for the thorny stingray (<i>Urotrygon rogersi</i>), with females reaching larger sizes than males in both species. The <i>DW</i>\n<sub>\n   <i>50</i>\n</sub> was estimated at 12.8 and 11.8 cm <i>DW</i> for the males and females of <i>U. maculatus</i>, respectively, whereas for <i>U.rogersi</i>, it was 15.0 and 18.4 cm <i>DW</i> for males and females, respectively. Embryos were found in females ≥14.5 cm <i>DW</i> in both species. The maximum fecundity was five embryos for <i>U. maculatus</i> (mean = 3.1 ± 0.2 <span>S.E.</span>, mode = 4), and six embryos for <i>U. rogersi</i> (mean = 3.0 ± 0.3 <span>S.E.</span>, mode = 2). Fecundity and embryo size did not vary with maternal size. Male and female immature and mature individuals for both species, including pregnant females, were found in the catches in all seasons of the year. Our results can help determine the vulnerability of the studied species populations to fishing pressure from shrimp trawling in the northern TEP and guide the development of future monitoring strategies and conservation actions for these species, if necessary.</p>","author":"Alain García‐Rodríguez, \nJavier Tovar‐Ávila, \nA. Hiromi Arellano‐Cuenca, \nDavid Rivas‐Landa, \nDarío A. Chávez‐Arrenquín, \nFelipe Amezcua","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"01e819d35feaa8a6bf70af1ad636487dd9ad249cf1ca4d88476c0ca248e1ef39","category":"Environment"}