{"title":"An approach to optimizing dietary protein to growth and body composition in walking catfish, <i>Clarias batrachus</i> (Linneaeus, 1758)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301712","date":1714744800000,"content":"<p>by Zara Naeem, Amina Zuberi, Muhammad Ali, Ammar Danyal Naeem, Muhammad Naeem</p>\r\n\r\n<i>Clarias batrachus</i> is a commercially important food fish. In the present study, effect of varying dietary protein levels was evaluated on the survival, growth parameters and proximate composition of <i>C</i>. <i>batrachus</i>. Diets comprising 25%, 30%, 35%, 40%, 45%, and 50% crude protein (CP) were supplied to fish in T1, T2, T3, T4, T5, and T6, respectively, at the rate of 5% of fish body weight for the entire 90 days, twice daily. Size of each stocked <i>C</i>. <i>batrachus</i> was recorded after 15 days. Results revealed 100% survival rate of <i>C</i>. <i>batrachus</i> in all treatments. Significantly highest (P&lt;0.001) mean value of weight gain (g/fish), percent weight gain, daily growth rate, specific growth rate and protein efficiency ratio (PER) in <i>C</i>. <i>batrachus</i> were recorded, reared in T4 by feeding 40% CP in diet. The best FCR value (1.90±0.02) for <i>C</i>. <i>batrachus</i> was obtained in T4 by feeding 40%CP in diet. Mean value of water, ash, fat and protein contents (wet mass) were ranged 74.10–79.23%, 3.12–4.68%, 3.90–4.43% and 13.09–16.79% for <i>C</i>. <i>batrachus</i> in the studied treatment groups. Water content (%) was found significantly (P&lt;0.05) higher in the body of <i>C</i>. <i>batrachus</i> for T1, T2, T3 and T6 than for T4 and T5. Ash was found significantly (P&lt;0.05) higher in the fish reared in T4 and T5. Fat content in the wet body mass of <i>C</i>. <i>batrachus</i> was found significantly higher in T4 and T1. While, significant higher (P&lt;0.05) values of mean protein content was noted in <i>C</i>. <i>batrachus</i> reared in T4 and T5. Body composition of <i>C</i>. <i>batrachus</i> was also categorically affected by body size, however, condition factor showed non-significant correlation in most of the relationships in the present study. Overall, results indicated that feeding appropriate diet (containing 40% CP) to the fish resulted good growth performance, lower FCR and higher protein content in the fish. Present study provides valuable knowledge of optimal dietary protein level in <i>C</i>. <i>batrachus</i> which will help in commercial success of aquaculture.","author":"Zara Naeem","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"01eea3ffb3cdaf4c346b95a3dccfc0b75b73b666594f9b4ae5e8258c0d06d385","category":"Interdisciplinary"}