{"title":"The backstory behind British Prime Minister Boris Johnson’s New Bike Day","link":"https://cyclingtips.com/2021/06/the-backstory-behind-british-prime-minister-boris-johnsons-new-bike-day/","date":1623697220000,"content":"<p>When Stephen Bilenky of <a href=\"https://www.bilenky.com/\" target=\"_blank\">Bilenky Cycle Works</a> opened his inbox on Sunday, May 23, he thought he was getting conned — as would most people who received an email like he did.</p>\n\n\n\n<p>“Basically I get an email from the State Department on a Sunday — does the State Department work on Sundays? Seemed odd,” he recounted. “So I answered the email, and they came back with more things. They said, ‘We’re looking for a custom bike for a diplomatic gift, and we need it for June 4. So basically they emailed me on a Sunday with the possibility of a two-week window, but they were still just in the shopping phase. They couldn’t tell me who it was for or exactly what it was about. They say they needed it to be red, white, and blue, and he’s 5’ 8″ and 180 lb.” </p>\n\n\n\n<p>Hmm, so this was to be a diplomatic gift, it needed to red, white, and blue, and the recipient was 5’ 8″ and 180 lb. The possibilities were tantalizing.</p>\n\n\n\n<p>“We started doing some research. Red, white, and blue could be UK, could be France, or it could be Russia. Biden was going to meet with [Russian president Vladimir] Putin in the middle of June, and then there was this G-7 thing. He’s meeting with all of these people, so it could be anybody. And then they told me he was 5’ 8″. Most customers, when they come here and I ask them how tall they are, most male customers will add two inches or so. One of my guys researched and said Putin is around 5’ 6 1/2″, so it was like, who knows, maybe we’re making a bike for Putin.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-2-1340x754.jpg\" /><figcaption>Nope, it wasn’t for Putin.</figcaption></figure>\n\n\n\n<p>As we now know, this was destined for UK Prime Minister Boris Johnson, who Biden presented with a lovely steel runabout resplendent in the Union Jack. Johnson was well known to be a fan of commuting by bike through the busy streets of London, so a gift like this certainly seemed more useful than a fancy pen or ancient vase or some curio with questionable historical lineage. </p>\n\n\n\n<p>“They basically wanted some urban commuter bike, but with upper-level execution and visual. They somehow communicated to me that they wanted upright roadster bars. They had this picture of [Johnson] riding a bike, and that’s the kind of bike they wanted.”</p>\n\n\n\n<p>One aspect that was emphasized by the State Department was that not only should the frame be US-made, but it should be fitted with as many US-made components as possible. That’s a tricky proposition in normal times, but the current Covid-fueled shortages made the ask even more challenging, let alone the incredibly short timeframe.</p>\n\n\n\n<p>“That Friday, I was on the phone with various US component makers, and it came to my realization that, wait, Monday’s Memorial Day. It’s a holiday! UPS isn’t even going to be delivering. It was also Friday afternoon and I’m writing to companies, and people are going to be going away for Memorial Day weekend and they might not even read this.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-12-1340x754.jpg\" /><figcaption>The state department requested that the bike use as many US-made parts as possible. This crankset comes from White Industries, who machines everything in Petaluma, California.</figcaption></figure>\n\n\n\n<p>White Industries, Thomson, Velocity, and Selle Anatomica responded very quickly, but SRAM didn’t get back to Bilenky until several days later, which is why the frame has some unused housing stops. Without a confirmed transmission, Bilenky originally planned to use a simple mechanical setup with a basic thumb shifter.</p>\n\n\n\n<p>“The sad part is, as I was polishing the clear coat, I remembered that there was a down tube housing stuff because I was just going to use some thumb shifter. For me as a builder, it was kind of a downer.”</p>\n\n\n\n<p>But as a nice cherry on top to distract from those vestigial bits, Bilenky reached out to fellow Philly resident <a href=\"https://www.headbadges.com/store/c1/Featured_Products.html\" target=\"_blank\">Jen Green</a>, a jeweler who specializes in custom head tube badges. She designed a bespoke piece in CAD, then cut everything out of sterling silver and bronze and hand-painted the whole thing — all within days.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-9-1340x754.jpg\" /><figcaption>The head tube badge was made by renowned jeweler Jen Green, who’s also based in Philadelphia and makes a living making custom head tube badges.</figcaption></figure>\n\n\n\n<p>Seasoned commuters might question the lack of functional add-ons like lights, racks, and fenders, but Bilenky said that was the State Department’s specific request.</p>\n\n\n\n<p>“We started talking and I said, ‘A bike like that would have fenders and lights, maybe a chain guard and kickstand,’ and it was like, ‘Oh, well we don’t want any accessories.’ I don’t know if that was a budget thing.”</p>\n\n\n\n<p>Complicating the whole thing further was a cross-country trip that Bilenky had already planned to visit the old shop of Roland Della Santa in Reno, Nevada (Della Santa passed away in May 2019).</p>\n\n\n\n<p>“When [the State Department] wrote back on Tuesday, I was already in preparation mode because I had a plane out of Philly at 6pm. I was getting things organized and finishing up some jobs, and now they want this thing by next Friday, and I’m leaving tonight. So I went on this trip, and while I was there, I was communicating with the State Department to get more details, because we still didn’t really know what we were building yet. We had to make a frame plan, and make a game plan. I was only there for a day, and so when I was back on Thursday, we were getting the bike off the ground.</p>\n\n\n\n<p>“Casey [Sussman] from <a href=\"http://www.marscycles.com/\" target=\"_blank\">Mars Cycles</a> was going to be here for the week, cutting the front triangle while I was flying on a plane. Just before I got on the plane, I was able to email him the frame plan. On the weekend when we were doing the painting, he handled the masking of the helmet. We were already doing a part-time collaboration, so it worked out.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-6-1340x754.jpg\" /><figcaption>It’s good to have friends. and the US State Department commissions a custom steel bike from you on very short notice, it’s especially useful when those friends can miter and braze.</figcaption></figure>\n\n\n\n<p>Another hiccup was paint. Bilenky does some painting in-house, but it’s usually limited to some repair work and other smaller jobs. Given the tight timeline, he didn’t think he’d be able to coax a painter to squeeze this in, so he just did it himself.</p>\n\n\n\n<p>“Because it was so rushed, I did the paint job here, and I knew I was going to get fussy because it was a fillet-brazed frame. And so I wound up just doing a lot of finish work pre-paint and during the painting. It wasn’t just a rush job, this was a show bike. It took a lot of effort to do that.</p>\n\n\n\n<p>“Brian from <a href=\"http://www.bicyclerevolutions.com/\" target=\"_blank\">Bicycle Revolutions</a>, who works here, he took the stuff home and built the wheels, and he did most of the bike assembly. On Friday, we stuck it in a box, and then our shop assistant guy got in a van and took it to Washington. We had to hand-deliver it. He took it to the State Department parking lot and handed it off there.”</p>\n\n\n\n<h2>A government windfall — or maybe not</h2>\n\n\n\n<p>Bilenky’s lead times are usually measured in weeks or months, not days. And especially given the significance and specificity of the proposal, one would think that the State Department was offering up a pretty penny to make this happen. After all, the US government isn’t exactly known for being particularly tight with its money.</p>\n\n\n\n<p>Nope.</p>\n\n\n\n<p>“I was thinking, oh, high-speed commission for the government, this is going to be like a US$10,000 bike. Special diplomatic gift, there are some specifications to follow in terms of visual, I have to bring some concept together. And then one point of the conversation was, ‘Oh, the budget is US$1,500.’ That barely buys a frame in a regular time! I was sort of half tempted to say, ‘Thanks, but no thanks,’ because I have lots of other things I should be doing, and this is going to tie me up for ten days and turn everything upside-down to make this happen.</p>\n\n\n\n<p>“They did tell me, ‘For the unremunerated value, you can use it as a charitable gift, because the State Department is some kind of non-profit. Great, that’ll pay for a lot in the frame builder world.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-7-1340x754.jpg\" /><figcaption>“Is this going to be like that Italian builder who made a bike for the pope?” Why yes, actually, it is sort of like that.</figcaption></figure>\n\n\n\n<p>Bilenky and his team ultimately decided to go through with this as a potential marketing opportunity. Seeing as how <a href=\"https://www.washingtonpost.com/world/2021/06/12/biden-boris-gifts/\">the Washington Post</a> wrote about the bike over the weekend — along with countless other mainstream international media outlets — it seems safe to say that “Bilenky Cycle Works” is a fair bit better known today than it was a week ago.</p>\n\n\n\n<p>“This was a career-topping thing.”</p>\n\n\n\n<p>Still, Bilenky says that one aspect of the whole experience was distinctly lacking.</p>\n\n\n\n<p>“I didn’t see the bike being given, so that was a little bit of a disappointment. The staff people from the State Department just gave it to the UK equivalents.”</p>\n\n\n\n<p>So what happens now? That’s hard to say.</p>\n\n\n\n<p>“Is Joe Biden going to contact me and say, ‘hey, now I want a bike’?” Bilenky wondered aloud. “I do have people asking me about getting a bike like that, so that could be the immediate future. We’re planning on doing a limited edition, so that’s the plan. I only want to make it if it’s exactly the same. That would be a cool project.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-3-1340x754.jpg\" /><figcaption>Yes, some of the parts are black, and some of them are silver. Let’s see how much better you could do given a few days’ notice and a global parts shortage, eh?</figcaption></figure>\n\n\n\n<p>The complete build sheet is as follows:</p>\n\n\n\n<ul><li>Handlebar: Ahearne+Map Handlebar</li><li>Stem: Thomson X4</li><li>Grips: ODI Cult X Vans Flangeless</li><li>Saddle: Selle Anatomica X1</li><li>Seatpost: Thomson Elite</li><li>Headset: White Industries </li><li>Brakes: Avid Shorty Ultimate cantilever</li><li>Brake levers: Velo Orange Grand Cru</li><li>Shift lever: SRAM GX AXS</li><li>Rear derailleur: SRAM GX AXS</li><li>Cassette: SRAM NX, 11-50T</li><li>Crankset: White Industries ENO, 42T</li><li>Bottom bracket: White Industries</li><li>Chain: SRAM Eagle</li><li>Rims: Velocity Quill, 36H</li><li>Hubs: White Industries Mi5 QR</li><li>Spokes: Wheelsmith</li><li>Tires: Schwalbe Lugano, 700×32 mm</li><li>Pedals: Volume Demolition</li><li>Other: Spurcycle bell, Jen Green “Friendship Flag” head tube badge, Bern FL-1 helmet</li></ul>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-5-1340x754.jpg\" /><figcaption>Bilenky is hoping to perhaps make a limited run of replica bikes that the general public will be able to buy. They’re bound to cost a lot more than what the US State Department paid, though.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-8-1340x754.jpg\" /><figcaption>It was all hands on deck for several frantic days, and everything else got pushed by the wayside.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Biden-Johnson-Jen-Green-head-tube-badge-1340x754.jpg\" /><figcaption>Jen Green normally does her custom head tube badges completely by hand, but when I asked her about it, she admitted that this one required a bit more help. “I wish I had that patience. I had to build this one in CAD, then it was hand-finished and assembled in three parts. Hand painted.” Photo: Jen Green.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-10-1340x754.jpg\" /><figcaption>The frame bears the signatures of both world leaders.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-11-1340x754.jpg\" /><figcaption>So… can you just ask the US state department for a graphic of the president’s signature?</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-13-1340x754.jpg\" /><figcaption>Thomson still machines its bicycle parts in Macon, Georgia.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-14-1340x754.jpg\" /><figcaption>The headset came from White Industries, too.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-15-1340x754.jpg\" /><figcaption>Selle Anatomica makes its leather saddles in Poway, California.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-16-1340x754.jpg\" /><figcaption>Spurcycle’s bells aren’t cheap, but they work extremely well and fulfill the state department’s request, being made in San Francisco, California out of domestically sourced parts.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-17-1340x754.jpg\" /><figcaption>I would have guessed grips to be one of the most difficult bits to source from a US manufacturer, but these Vans grips check that box (and they’re made from the same rubber as the shoes, too).</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-18-1340x754.jpg\" /><figcaption>Bilenky had a vision of producing a lightweight urban commuter, and the old Avid Shorty Ultimate cantilevers should work in London’s flat environment just fine.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-19-1340x754.jpg\" /><figcaption>SRAM may not manufacture any of its parts in the United States, but it’s at least a US-based company.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-20-1340x754.jpg\" /><figcaption>Also on the list of requirements was a painted-to-match helmet. This is the FL-1 Libre model from Bern, which is based close to Bilenky in Plymouth, Massachusetts.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Bilenky-Cycle-Works-Boris-Johnson-Joe-Biden-bike-21-1340x754.jpg\" /><figcaption>Getting closer…</figcaption></figure></li></ul></figure>\n<p>The post <a href=\"https://cyclingtips.com/2021/06/the-backstory-behind-british-prime-minister-boris-johnsons-new-bike-day/\">The backstory behind British Prime Minister Boris Johnson’s New Bike Day</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"01ef88a76f9d338460e9bef1b6f5cd8cfc07191bb9055de98310d2e1e0446bb1","category":"Cycling"}