{"title":"Top-end Roomba can now refill itself with water via furniture-sized dock","link":"https://arstechnica.com/?p=1967124","date":1694466950000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/2-1-980x668.jpg\" alt /></div>\n          <p>\n            The Roomba Combo j9+.                          [credit:\n                              iRobot                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>IRobot has even more new robots to take a look at. This week it's refreshing the top-of-the-line lineup with the<a href=\"https://www.irobot.com/en_US/roomba-combo-j9plus-robot-vacuum-and-mop/C975020.html\"> Roomba Combo j9+</a>, which comes in at $1,399. Just like<a href=\"https://arstechnica.com/gadgets/2022/09/the-transforming-roomba-combo-j7-can-mop-without-getting-your-carpet-wet/\"> Combo j7+</a>, this is a vacuum with a mop pad mounted on a swing arm setup. In mop mode, the pad swings under the robot and drags across the floor. When it's time to vacuum the carpet, rather than lifting the pad only a few millimeters and potentially dragging it across the carpet, the whole pad swings around to the top of the robot and looks like a racing spoiler. The upgrade to the j9+ involves a new dock that can refill the robot's water tank and a \"SmartScrub\" feature that does a better job of mopping.</p>\n<p>Most of the new features are enabled by the new dock. These vacuum docks unavoidably just keep growing in size as they get more capable, and the j9+ combo dock is so big that iRobot's press images humorously suggest decorating the Combo j9+ base by putting a vase or some other knickknacks on top. The Combo j9+ dock is approaching the size of a small end table, so iRobot says it gave the dock a \"wood-like top to double as a usable surface.\" It actually looks quite nice, with ribbing around the perimeter and a faux leather tag on the side as an opening handle. Grab the tab, and the front of the dock will swing open like a cabinet.</p>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/RoombaCombo_j9_Web_PDP_Carousel_DesignedForYourHome_3000x3000-980x980.webp\" alt /></div>\n          <p>\n            The dock is so big it's like a small piece of furniture now.                          [credit:\n                              iRobot                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Inside the door, you'll see handy storage bins for new mop pads and dock vacuum bags. In the main body of the dock, there's a white tank at the top that stores the cleaning liquid, and below that is a drawer for the dust bag. Altogether, this will suck dust out of the robot and refill it with water, and iRobot says you'll get \"60 days of dirt emptying and 30 days of liquid refill.\"</p></div><p><a href=\"https://arstechnica.com/?p=1967124#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1967124&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"01ef2e18144120209a4a2946ba65bbb044e985aeb89c347050248f4e7cbb7890","category":"Tech"}