{"title":"Apple's Online Store Now Available in Chile","link":"https://www.macrumors.com/2023/10/16/apple-bringing-online-store-chile-october-16/","date":1697461200000,"content":"Apple has <a href=\"https://www.apple.com/newsroom/2023/10/apple-store-online-launches-in-chile-to-bring-customers-new-shopping-options/\">announced</a> that its online store is now available in Chile, providing customers located in the country with a way to purchase iPhones, Macs, iPads, and more directly from Apple.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/Apple-Chile.jpg\" alt width=\"1960\" height=\"1102\" />\r<br />\nAs in other countries, Apple's Chilean online store offers a full range of Apple products and accessories, with shopping assistance from Apple Specialists, a trade-in program for iPhone sales, free one-on-one online training sessions with certain product purchases, build-to-order Mac options, and multiple payment options including financing.\r<br />\n\r<br />\nPreviously, customers in Chile could only purchase Apple products through third-party Apple Authorized Distributors. Apple's online store allows customers from Chile to purchase from Apple directly and have their orders shipped for free to all regions in the country.\r<br />\n\r<br />\n\"We're thrilled to be expanding in Chile with the launch of the Apple Store online,\" said Deirdre O'Brien, Apple's Senior Vice President of Retail. \"We love creating magical experiences for our customers, and whether they're looking to unleash creativity or embrace an entrepreneurial spirit, we now have an incredible Apple experience for everyone in Chile who wants to discover and shop for our amazing products, including the all new iPhone 15 lineup and Apple Watch Series 9.\"\r<br />\n\r<br />\nApple says customers in Chile will be able to pre-order the iPhone 15 Pro and iPhone 15 Pro Max starting October 20.\r<br />\n\r<br />\n<em>This story was originally published on October 11 and updated on October 16.</em><div>Tags: <a href=\"https://www.macrumors.com/guide/apple-store/\">Apple Store</a>, <a href=\"https://www.macrumors.com/guide/chile/\">Chile</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/16/apple-bringing-online-store-chile-october-16/\">Apple's Online Store Now Available in Chile</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-online-store-now-available-in-chile.2407177/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"01f78964fe7be624fe299bdc03f09c030a059eec575567fe396343de015a5741","category":"Apple"}