{"title":"Impact of Allogeneic Stem Cell Transplant on Safety and Outcomes of Chimeric Antigen Receptor T Cell (CAR-T) Therapy in Patients with Multiple Myeloma (MM)","link":"https://www.preprints.org/manuscript/202409.0529/v1","date":1725613194000,"content":"Introduction \nAllogeneic stem cell transplantation (allo-SCT) has been used less frequently as a treatment modality in patients with MM. Allo-SCT may have the potential of long-term survival or even cure due to graft versus myeloma effect, however, its use continues to remain controversial given the toxicity profile related to infectious complications and graft versus host disease (GVHD). Concern for exacerbation of GVHD has been raised following re-infusion of CAR-T cells in patients with prior Allo-SCT. Ciltacabtagene autoleucel (Cilta-cel) and Idecabtagene vicleucel (Ide-cel) are two engineered CAR-T products targeting specific B-cell receptors that are approved by the FDA for the treatment of relapsed/refractory (R/R) MM. A recent retrospective study conducted by Htut et al, using data from CARTITUDE-1 trial, showed favorable efficacy and safety in patients who received Cilta-Cel with prior allo-SCT. We report our experience for patients with prior Allo-SCT who underwent therapy with CAR-T in the real world setting.\n\nObjective \nTo evaluate the safety and efficacy of CAR-T therapy in patients with R/R MM with a history of allo-SCT. \n\nMethods\nWe conducted a retrospective chart review of adult patients (age 18-70 years old) with R/R MM who had received CAR-T on an institutional IRB approved protocol. We collected data for the eligible patients from our institution's database. Safety outcomes included the incidence and severity of adverse events (AEs). AEs were graded using National Cancer Institute Common Terminology Criteria for Adverse Events version 5.0 (NCI-CTCAE 5.0). Cytokine release syndrome (CRS) and immune effector associated neurotoxicity syndrome (ICANS) were graded as per the American Society for Transplantation and Cellular Therapy criteria. Efficacy outcomes included overall response rates (ORR), progression free survival (PFS). Survival analysis was performed using the Kaplan-Meir method including PFS. PFS was defined as time from initiation of treatment to progression of disease or death whichever occurred first. The IMW response criteria were utilized for response assessment.\nResults \n8 out of 56 patients who received CAR-T (Cilta-cel or Ide-cel) had a prior allo-SCT. Pts with prior allo-SCT had received a median of 7 prior lines of therapy(LOT) compared with 5 prior LOT for pts who did not(non-Allo)(p=0.04). Median time of CAR-T infusion was 98.8 months following allo-SCT. 7 of 8 (85.7%) pts experienced CRS (any grade) in Allo-SCT vs. 37 of 48 pts (77.1%) in non-Allo (p=0.48); 1 pt with prior allo-SCT experienced HLH requiring intervention with anakinra. At a median follow-up of 4.8 months, 7 of 8 patients had a response (ORR= 87.5%) in allo-SCT vs. 75%(36 of 48) in non-Allo (p=0.4), mPFS was not reached in allo-SCT vs. 11.9-months in non-Allo (p=0.5), although f/u for our cohort was short. No TRM was observed in either group. None of the patients with prior allo-SCT experienced acute GVHD following CAR-T therapy.  Baseline characteristics, safety and efficacy data are summarized in Table 1.\n\n\nConclusion\nOur findings support the conclusion that prior Allo-SCT does not impact the safety and efficacy of CAR-T therapy in patients with R/R MM. More clinical studies with a higher number of subjects and longer duration of follow-up are warranted to further evaluate the impact of Allo-SCT on CAR-T therapy's safety and clinical outcome in patients with MM.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"020dec0a56af8f62e31e7e216bc9b184342d5007f63806ccf8821e2b7f891513","category":"Interdisciplinary"}