{"title":"“We must regulate AI,” FTC Chair Khan says","link":"https://arstechnica.com/?p=1936486","date":1683148595000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/lina_khan_hero_2-800x450.jpg\" alt=\"Lina M. Khan testifies during a Senate Commerce, Science, and Transportation Committee nomination hearing on April 21, 2021 in Washington, DC.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/lina_khan_hero_2.jpg\">Enlarge</a> <span>/</span> FTC Chair Lina M. Khan testifies during a Senate Commerce, Science, and Transportation Committee nomination hearing on April 21, 2021, in Washington, DC. (credit: Graeme Jennings/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Wednesday, Federal Trade Commission (FTC) Chair Lina Khan pledged to use existing laws to regulate AI in a New York Times <a href=\"https://www.nytimes.com/2023/05/03/opinion/ai-lina-khan-ftc-technology.html\">op-ed</a>, \"We Must Regulate A.I. Here's How.\" In the piece, she warns of AI risks such as market dominance by large tech firms, collusion, and the potential for increased fraud and privacy violations.</p>\n\n<p>In the op-ed, Khan cites the rise of the \"Web 2.0\" era in the mid-2000s as a cautionary tale for AI's expansion, saying that the growth of tech companies led to invasive surveillance and loss of privacy. Khan feels that public officials must now ensure history doesn't repeat itself with AI, but without unduly restricting innovation.</p>\n<p>\"As these technologies evolve,\" she wrote, \"we are committed to doing our part to uphold America’s longstanding tradition of maintaining the open, fair and competitive markets that have underpinned both breakthrough innovations and our nation’s economic success—without tolerating business models or practices involving the mass exploitation of their users.\"</p></div><p><a href=\"https://arstechnica.com/?p=1936486#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1936486&amp;comments=1\">Comments</a></p>","author":"Benj Edwards","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"020fb9eaba4072f4ef73003ed1da6c282f46bed6d426b67ceff0bd3713f34a0a","category":"Tech"}