{"title":"Road to rejuvenation: how a strong Jayco-AlUla team could dominate Tour Down Under 2024","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/road-to-rejuvenation-how-strong-jayco-alula-team-could-dominate-tour-down-under-2024","date":1705221003000,"content":"\n      <p>This time last year, Team Jayco-AlUla began the 2023 season amid an atmosphere of relief. They’d spent the previous year frantically scrambling in search of enough WorldTour points to avoid relegation from cycling’s top tier, something that would have marked a significant regression from a team that had, since its inception in 2012, looked at home among the sport’s elite.</p>\n<div></div>\n<div></div>\n<p>Thankfully, the combined efforts of the likes of Simon Yates, Michael Matthews, Dylan Groenewegen and Kaden Groves was enough to ensure survival for the 2023 season, but the year which followed was relatively underwhelming. Groenewegen won enough sprints in minor races to keep their season total at a respectable, but aside from a couple of Giro stage wins from Michael Matthews and Filippo Zana, none of these victories were of especially high calibre, while the best stage race finish anyone could manage was Simon Yates’ fourth at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France.</a></p>\n<p>Perhaps aware of a need for rejuvenation, the team were active in the transfer market ahead of the 2024 season, replacing outgoing riders such as Giro time trial stage winner Matteo Sobrero and the retiring Zdeněk Štybar with the likes of Classics specialist Max Walschied and talented young all-rounder Mauro Schmid. The most eye-catching new signings though were both Australian, in the form of Caleb Ewan and Luke Plapp — both of whom are set to make their WorldTour debut for the team this Tuesday at the start of the Tour Down Under.</p>\n<p>Jayco-AlUla have a proud history in their home WorldTour event, but have endured a leaner recent run here; the last time they won the overall title was in 2019, having triumphed in five of the previous eight editions. It’s hoped that Plapp will follow in the footsteps of the now departed Simon Gerrans and Daryl Impey and lead them to victory once more. At last year’s race, Plapp was a thorn in Jayco-AlUla’s side as he played a key role in controlling the race in the service of his Ineos Grenadier leader Magnus Sheffield, neutralising attacks from the Australian team’s leader Simon Yates. Now, Plapp will join forces with Yates in what looks like the strongest GC outfit in the race.</p>\n<p>The signing of Plapp was a major coup for Jayco-AlUla. He’s recognised not only as one of the peloton’s most talented young Australian riders, but across the whole world, and, having only just turned 23 last month, still has plenty of scope for improvement. As a GC candidate he looks like the complete package, with time trialling skills to back up his climbing, and he’s already made a winning start for his new team, claiming both the road and time trial national titles on his first two days of racing for them. It’s a transfer that looks good from Plapp’s point of view, too, as he can expect to have more leadership opportunities than at Ineos, including, potentially, at the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>.</p>\n<p>Winning the Tour Down Under would help make a great case for such roles, although the parcours is more in favour of puncheurs than purer climbers like Plapp. The GC will surely be decided during the final two stages, the former culminating with two ascents of the race’s signature climb Willunga Hill, which averages 7.4% for 3km, and the latter finishing atop the equally steep but shorter 1.3km Mount Lofty.</p>\n<p>On these hills, Plapp and Yates are likely to come up against a number of climbers. Fellow Australian Jack Haig (Bahrain-Victorious) will surely be one to watch, given the motivation of home roads, and his need to get his career back on track following an underwhelming second half of the 2023 season. New Zealander George Bennett will be making a fresh start for new team Israel-Premier Tech having left UAE Team Emirates, while Michael Storer will represent the Australian national team on loan from his new trade employers Tudor Pro Cycling. But all of these riders could be undone by the kind of short-lasting, explosive accelerations better-suited to these shorter climbs from specialist puncheurs Julian Alaphilippe (Soudal-Quick-Step), and Diego Ulissi (UAE Team Emirates), who has twice before made the podium here without winning the overall title. And given his revelatory form on the hills last season, even Ineos’ Filippo Ganna could be one to watch.</p>\n<p><img alt=\"Luke Plapp\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1734819347.jpg?v=1705076931\" /></p>\n<p><em>Luke Plapp will be a major contender for overall victory after his National Championship wins (Getty Images)</em></p>\n<p>While Plapp and Yates will come to the fore during the last two days, the first four stages will see Jayco-AlUla attempt to guide their other new recruit Caleb Ewan to stage victories in the sprints. We say ‘new’, but Ewan is in fact returning to where he began his professional career ten years ago, and enjoyed great success at, with stages at both the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> and <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> among his many victories. His homecoming was prompted by a loss of form and souring of relations with management at Lotto Dstny, and he hopes to reestablish himself as one of the peloton’s quickest sprinters. If he can, Jayco-AlUla will be among top sprinter teams in the WorldTour, with Dylan Groenewegen and Michael Matthews also in their roster.</p>\n<p>Ewan will be their only sprinter at the Tour Down Under though, and has a rich pedigree at this race, winning a total of nine stages here. Milan-Sanremo is again a major target of his this year, and he’ll get some useful climbing training done on the opening two stages here, the first of which features the shallow but tricky Menglers Hill inside the final 15km, and the latter of which will be complicated by the short but super-steep 18% ramp of Fox Creek, climbed twice mid-way through.</p>\n<p>While these stages could suit the sprinters with better climbing legs, such as Intermarché - Wanty’s Biniam Girmay (himself in need of a boost after a 2023 that failed to live up expectations) and Corbin Strong (Israel-Premier Tech), the more straightforwardly flat stages the following two days will be good for the likes of Bora-Hansgrohe’s new recruit and home rider Sam Welsford, Elia Viviani (Ineos Grenadiers), and Phil Bauhaus (Bahrain Victorious), who won the opening bunch sprint at last year’s race.</p>\n<p>If Ewan can come out on top against such a strong sprinting field, and Plapp and Yates seal overall victory, this could be the start of a season of rejuvenation for Jayco-AlUla.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0215c7d04e656731b96c000c9a80d0a8a356464b3c7c8a0c95dab25ba7106af0","category":"Cycling"}