{"title":"Apple Seeds Second Public Beta of macOS Big Sur 11.3","link":"https://www.macrumors.com/2021/02/18/macos-big-sur-11-3-public-beta/","date":1613672396000,"content":"Apple today seeded the second public beta of an upcoming <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">macOS Big Sur</a> 11.3 update to its public beta testing group, with the new software coming two weeks after <a href=\"https://www.macrumors.com/2021/02/04/apple-seeds-first-macos-big-sur-11-3-public-beta/\">the first public beta</a>.\r\n<br/>\r\n\r\n<br/>\r\n<img class=\"aligncenter size-full wp-image-753390\" src=\"https://images.macrumors.com/article-new/2020/08/First-Look-Big-Sur-Feature2.jpg\" alt=\"\" width=\"2146\" height=\"1207\" />\r\n<br/>\r\nPublic beta testers can download ‌&zwnj;macOS Big Sur&zwnj;‌ 11.3 from the Software Update section of the System Preferences app after installing the proper profile from <a href=\"https://beta.apple.com/sp/betaprogram/\">Apple's beta software website</a>.\r\n<br/>\r\n\r\n<br/>\r\n&zwnj;macOS Big Sur&zwnj; 11.3 <a href=\"https://www.imore.com/macos-big-sur-113-will-bring-updates-reminders-apple-music-more\">introduces</a> more customization options for Safari, adding a way to rearrange the different sections on the Start Page like Favorites, Reading List, <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> Suggestions, Privacy Report, and more. Developers also have access to a new integration to develop features for the Start Page.\r\n<br/>\r\n\r\n<br/>\r\nThe update includes optimizations for using iOS apps on <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> Macs. When running <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> apps on &zwnj;M1&zwnj; Macs, there's a Touch Alternatives preference pane that allows users to set keyboard commands for touch input alternatives, plus iPadOS apps launch with a larger window if the Mac's display allows it. Touch Alternatives can be enabled for &zwnj;iPhone&zwnj; or &zwnj;iPad&zwnj; apps by clicking on the app's name in the menu bar and then selecting the Preferences option. Touch Alternatives let you customize taps, swipes, and drags.\r\n<br/>\r\n\r\n<br/>\r\n&zwnj;macOS Big Sur&zwnj; 11.3 also adds support for the latest PlayStation 5 DualSense and Xbox Series X/S controllers for use with macOS games.\r\n<br/>\r\n\r\n<br/>\r\nIn the Reminders app, reminder lists can be sorted by Due Date, Creation Date, Priority, or Title, and there is an option to print lists by going to File > Print. Reminders can also be moved manually across lists with drag and drop, something that wasn't possible before.\r\n<br/>\r\n\r\n<br/>\r\nApple is adding a new \"Made For You\" library shortcut in <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> for finding personal mixes and Replay playlists, and the Listen Now section has been updated with support for highlighting live events. In the second beta, there's a new autoplay feature in the &zwnj;Apple Music&zwnj; app that allows the streaming service to continue to play music after a playlist or music queue ends. &zwnj;Apple Music&zwnj; sources music similar to what's in a person's &zwnj;Apple Music&zwnj; library, similar to the autoplay feature added in <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a>. \r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/macos-big-sur-apple-music-autoplay.jpg\" alt=\"\" width=\"2000\" height=\"1174\" class=\"aligncenter size-full wp-image-784152\" />\r\n<br/>\r\nWith this feature enabled, &zwnj;Apple Music&zwnj; audio will not end even after a playlist or album is over. To check that it's on, play a playlist or album and then click on the three dot/line menu button in the upper right hand corner. From there, make sure the infinity symbol is toggled on.\r\n<br/>\r\n\r\n<br/>\r\nIn the <a href=\"https://www.macrumors.com/guide/apple-news-plus/\">Apple News</a> app, there's a redesigned &zwnj;Apple News&zwnj;+ tab with a dedicated \"For You\" section and a new Browse tab that makes it easier to browse through available content. The new For You section is designed to help &zwnj;Apple News&zwnj;+ users find favorite magazines and newspapers much faster, plus it adds new tools for managing downloaded issues.\r\n<br/>\r\n\r\n<br/>\r\nThere's also an updated \"Support\" interface when accessing \"About This Mac.\" The new design includes details on your warranty and it allows for starting a repair right from the Mac interface.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/macos-big-sur-beta-support.jpg\" alt=\"\" width=\"1195\" height=\"697\" class=\"aligncenter size-full wp-image-784154\" />\r\n<br/>\r\n&zwnj;macOS Big Sur&zwnj; 11.3 <a href=\"https://www.macrumors.com/2021/02/03/macos-11-3-homepod-stereo-pairs/\">adds support</a> for <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> Stereo pairs, allowing a set of paired HomePods to be set as the default sound output option, with the two HomePods showing up as a single selectable speaker rather than separate as in prior versions of macOS.\r\n<br/>\r\n\r\n<br/>\r\nCode in the update suggests that the Optimized Battery Charging feature <a href=\"https://www.macrumors.com/2021/02/18/macos-11-3-optimized-battery-charging-meetings/\">will now make sure</a> the Mac's battery is fully charged before a scheduled calendar event. The Mac will charge to 100 percent three hours before a calendar event's start time.\r\n<br/>\r\n\r\n<br/>\r\nOptimized Battery Charging is designed to preserve the lifespan of the Mac's battery by limiting the amount of time that a Mac sits at 100 percent battery.\r\n<br/>\r\n\r\n<br/>\r\nIn Safari, there's support for <a href=\"https://www.macrumors.com/2021/02/18/safari-to-support-webm-after-11-years/\">WebM video playback</a>, allowing users to play WebM videos using Apple's browser. WebM is a niche video format designed to be a royalty-free alternative to the H.264 codec used in the MP4 format. WebM allows video files to remain small without sacrificing quality and can be played with little processing power, making it ideal for webpages and browsers.\r\n<br/>\r\n\r\n<br/>\r\nMore on &zwnj;macOS Big Sur&zwnj; can be found in <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">our macOS Big Sur roundup</a>. The software is expected to see a release this spring. <div class=\"linkback\">Related Roundup: <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">macOS Big Sur</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/18/macos-big-sur-11-3-public-beta/\">Apple Seeds Second Public Beta of macOS Big Sur 11.3</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-seeds-second-public-beta-of-macos-big-sur-11-3.2285237/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=KtXxR117hAs:9P6saaS7qlk:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=KtXxR117hAs:9P6saaS7qlk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/KtXxR117hAs\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0218927f7ffbe1cd16eec3bc05b2a529357f5a8aedd342dc01e7d0c49345e19b","category":"Apple"}