{"title":"Review: Framework’s lightweight modular laptop is a winner","link":"https://arstechnica.com/?p=1783255","date":1627404353000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/framework-hero-800x562.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/framework-hero.jpg\">Enlarge</a> <span>/</span> Framework promised a modular, lightweight, ultraslim 13-inch laptop with a 3:2 display at a competitive price—and that's exactly what it delivered. (credit: Jim Salter)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>When we originally <a href=\"https://arstechnica.com/gadgets/2021/02/framework-startup-designed-a-thin-modular-repairable-13-inch-laptop/\">covered</a> startup Framework's ambitious plans for a fully repairable, modular laptop aiming to compete on even ground with industry champions like Dell's XPS 13, it seemed like quite a long shot.</p>\n<p>The company's proposed 13-inch laptop was to be its very first product and include custom-built hardware features no other company had ever offered—most notably, four modular bays replacing the usual collection of hardwired laptop I/O ports. Each bay features a deeply recessed USB-C port that can accept a module offering the user an external USB-A, USB-C, DisplayPort, HDMI, or MicroSD port.</p>\n<p>Designing and building a feature like that is a big risk—doing so for the first time while planning to compete evenly with industry-leading compact laptops like Dell's XPS 13 in weight, width, thickness, and price raised our eyebrows so far it hurt. But we've spent several days with a review unit—and Framework has satisfied all of its major claims. Its new laptop isn't perfect, but it's a solid competitor that lives up to its promises.</p></div><p><a href=\"https://arstechnica.com/?p=1783255#p3\">Read 47 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1783255&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"02214cd4b06f4196fefcf12d4948bb9b5ef8060f0954e427c2594b97499687b6","category":"Tech"}