{"title":"Archaeologists uncover ruins of medieval wine factory at Israel’s Yavne site","link":"https://arstechnica.com/?p=1803174","date":1634064762000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>At a site in Yavne, archaeologists have discovered the largest complex of winepresses known in the world. The presses date back to the Byzantine Period. </p></div>\n<p>The Israeli archaeological site known as <a href=\"https://en.wikipedia.org/wiki/Yavne\" target=\"_blank\">Yavne</a> dates back to the late Bronze Age and late Iron Age and is considered one of the most significant Jewish historical sites after the Romans destroyed the temple of Jerusalem in 70 CE. Apparently, Yavne was also a major producer of wine during medieval times. Archaeologists have excavated what they believe was once a wine factory, likely the largest in the world some 1,500 years ago during the Byzantine era, according to a <a href=\"https://fb.watch/8An36Wjktn/\" target=\"_blank\">post (and accompanying video) on the Facebook page</a> of the Israel Antiquities Authority (IAA).</p>\n<p>\"Drinking wine was very common in ancient times for adults and children alike,\" <a href=\"https://fb.watch/8An36Wjktn/\" target=\"_blank\">the IAA post reads</a>. \"Since water was not always sterile or tasty, wine was also used as a kind of 'concentrate' to improve the taste or as a substitute for drinking water,\" according to Dr. Elie Haddad, Liat Nadav-Ziv, and Dr. Jon Seligman, who are the directors of the excavation on behalf of the IAA.</p>\n<p>Prior excavations at Yavne have uncovered several Iron Age and Bronze Age burial points, Philistine artifacts, and pottery shards, as well as the ancient city's harbor, abandoned sometime in the 12th century CE. (The book of Maccabees describes the burning of the harbor and its fleet, so it holds special significance in Jewish tradition and history.) A 2005 excavation unearthed the gate room of a castle built during the Crusades, when the city was known as Ibelin.</p></div><p><a href=\"https://arstechnica.com/?p=1803174#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1803174&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"02307140ea8ebbcd6990411f48145e15abab0ddeb5bb832aab3a02217b1bcbe7","category":"Tech"}