{"title":"พนักงาน OpenAI เริ่มยื่นใบลาออก พร้อมทำแคมเปญ \"OpenAI is nothing without its people\"","link":"https://www.blognone.com/node/136848","date":1700483454000,"content":"<div><div><div><p>หลังจากไมโครซอฟท์ประกาศว่า Sam Altman อดีตซีอีโอ OpenAI ที่ถูกไล่ออก <a href=\"https://www.blognone.com/node/136842\">จะมาร่วมงาน</a>โดยดูแลแผนกใหม่ด้าน Advance AI พร้อมกับ Greg Brockman อดีตประธานบอร์ดที่ลาออกตามมา ฉากถัดไปที่หลายคนคาดเดาได้ก็คือพนักงาน OpenAI น่าจะลาออกตามมาอยู่ที่ไมโครซอฟท์ และก็ดูเป็นเช่นนั้น</p>\n<p>โดยเบื้องต้น Greg โพสต์ข้อความใน X ว่าเรากำลังจะสร้างสิ่งที่ใหม่และน่าทึ่ง โดยระบุทีมงานเบื้องต้นคือตัวเขาเอง, Sam และ 3 พนักงานระดับสูงของ OpenAI ที่<a href=\"https://www.blognone.com/node/136818\">ลาออก</a>ตั้งแต่มีข่าวว่า Sam ถูกไล่ออก คือ Jakub Pachocki, Aleksander Madry และ Szymon Sidor โดย Greg บอกว่าจะมีเพิ่มเติมอีกเร็ว ๆ นี้</p>\n<p>สัญญาณความไม่พอใจภายใน OpenAI ยังมีเพิ่มเติมหลังจาก<a href=\"https://www.blognone.com/node/136845\">บอร์ดบริษัทประกาศ</a>ยืนยันว่าการไล่ Sam ออกเป็นทางเลือกที่ถูกต้อง โดยมีการทำแคมเปญใน X ด้วยการโพสต์ข้อความว่า \"OpenAI is nothing without its people\" หรือ OpenAI ก็ไม่มีความหมายอะไรถ้าปราศจากผู้คน โดยคนที่โพสต์ข้อความนี้มีทั้ง Mira Murati ซีทีโอที่ตอนแรกถูกแต่งตั้งเป็นซีอีโอชั่วคราว, Brad Lightcap ซีโอโอ รวมถึงพนักงานอีกหลายคน</p>\n<p>มีรายงานอย่างไม่เป็นทางการว่าตอนนี้มีพนักงาน OpenAI จำนวนหลายสิบคนแล้วที่ยื่นใบลาออก หลังจากได้รับข่าวยืนยันว่า Sam จะไม่กลับมาเป็นซีอีโอ ขณะเดียวกันก็มีรายงานว่าบริษัท AI หลายแห่งเริ่มเจรจากับพนักงาน OpenAI เพื่อดึงตัว รวมถึง Deepmind บริษัท AI ของกูเกิลที่ได้รับเรซูเม่จากพนักงาน OpenAI เพิ่มขึ้นสูง</p>\n<p>ที่มา: <a href=\"https://www.businessinsider.com/openai-key-staff-depatures-ai-following-sam-altman-exit-microsoft-2023-11\">Business Insider</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/bf63320de3f81c79d464e32b0febee84.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/openai\">OpenAI</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0234f132ca0848dc4cecc889ba69a5803ccb19befba0bcf3f9997b5421a5b31f","category":"Thai"}