{"title":"Granting access: Development of a formal course to demystify and promote predoctoral fellowship applications for graduate students","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301480","date":1714140000000,"content":"<p>by Pamela K. Geyer, Darren S. Hoffmann, Jennifer Y. Barr, Heather A. Widmayer, Christine M. Blaumueller</p>\r\n\r\nStrong scientific writing skills are the foundation of a successful research career and require training and practice. Although these skills are critical for completing a PhD, most students receive little formal writing instruction prior to joining a graduate program. In 2015, the University of Iowa Medical Scientist Training Program (MSTP) addressed this issue by developing the scientific writing course Grant Writing Basics (GWB). Here we describe the structure of this course and its effectiveness. GWB is an interactive, workshop-based course that uses a National Institutes of Health (NIH) F30 predoctoral fellowship proposal as a platform for building writing expertise. GWB incorporates established pedagogical principles of adult learning, including flipped classrooms, peer teaching, and reiterative evaluation. Time spent in class centers on active student analysis of previously submitted fellowship applications, discussion of writing resources, active writing, facilitated small group discussion of critiques of student writing samples, revision, and a discussion with a panel of experienced study section members and a student who completed a fellowship submission. Outcomes of GWB include a substantial increase in the number of applications submitted and fellowships awarded. Rigorous evaluation provides evidence that learning objectives were met and that students gained confidence in both their scientific writing skills and their ability to give constructive feedback. Our findings show that investment in formal training in written scientific communication provides a foundation for good writing habits, and the knowledge and skills needed to succeed in this vital aspect of a scientific research career. Furthermore, they highlight that evaluation is valuable in guiding course evolution. Strategies embedded in GWB can be adapted for use in any graduate program to advance scientific writing skills among its trainees.","author":"Pamela K. Geyer","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0238e576f3e340ee4dc4e7a8bd88f42e3a61bed0249bb171e5ea70ab0b1cf2b4","category":"Interdisciplinary"}