{"title":"Mixed mating patterns in morphologically diverse bumblebee-pollinated Salvia species from China","link":"https://academic.oup.com/biolinnean/article/doi/10.1093/biolinnean/blad164/7439588?rss=1","date":1700524800000,"content":"<span><div>Abstract</div>Flowers of <span>Salvia</span> are characterized by a diversity of staminal lever types mediating pollen transfer. In the East Asian subgenus <span>Glutinaria</span>, species have been categorized based on their distinct flower and stamen morphologies. A hypothesized advantage of degraded-lever types suggests they may optimize pollinator foraging time, increase visitation rates, and potentially trigger autonomous self-pollination. However, this hypothesis remains untested. Here, <span>Salvia castanea</span>, <span>S. miltiorrhiza</span>, and <span>S. liguliloba</span> were selected as test species representing the three major flower and stamen types of the East Asian sages. We compared the species with regard to their inflorescence architecture, floral display, nectar reward, pollinator efficiency, and seed set. We found that <span>S. liguliloba</span> had a degraded-lever type that significantly reduced pollinator foraging time did not significantly increase pollination efficiency. These species have a mixed mating pattern with high seed set, no pollen- or pollinator limitation, and no inbreeding depression. We conclude that the diversity of floral traits is addressed to pollinators, whereas reproductive success emerges from a complex interplay of factors encompassing floral characteristics, pollination efficiency, plant life history, or/and other biotic and abiotic factors. For this reason, the link between floral morphological traits and mating systems should not overestimated.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"023a9d9d49f2de2aefcb2cba27e8751f0f0fda209c9401a1fa519bdc0930cafe","category":"Environment"}