{"title":"Review: No Time to Die finds 007’s heart in Daniel Craig’s final outing","link":"https://arstechnica.com/?p=1802053","date":1633727712000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul>\n          <li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/bondstill13-980x653.jpg\" /></div>\n        <p>\n          Daniel Craig returns one last time as 007.                  </p>\n        </div>\n      </li>\n      </ul>\n  \n<p>Everyone has their favorite incarnation of James Bond, Ian Fleming's iconic British spy with an eye for the ladies, fast cars, cool gadgets, and a martini that's shaken, not stirred. Sean Connery, George Lazenby, Roger Moore, Timothy Dalton, and Pierce Brosnan have all brought their own distinctive style to 007, with varying results. But Daniel Craig has been my #1 Bond since 2006's <a href=\"https://en.wikipedia.org/wiki/Casino_Royale_(2006_film)\"><em>Casino Royale</em></a>, aka one of the best Bond films yet made. So I was delighted to find that Craig's 007 is getting the action-packed, emotionally powerful sendoff he deserves with <a href=\"https://en.wikipedia.org/wiki/No_Time_to_Die\"><em>No Time to Die</em></a>. The film brings the character arc that began with <em>Casino Royale</em> to a satisfying and fitting conclusion.</p>\n<p><strong>(Spoilers for prior films in the Craig/Bond series; only minor spoilers for <em>No Time to Die</em>.)</strong></p>\n<p>It's worth taking a moment to revisit why <em>Casino Royale</em> worked so well as a fresh take on a well-worn franchise. It brought 007 firmly into the 21st century while still remaining true to the character. Even Craig's physical appearance was markedly different from the tall, dark, and handsome incarnations that came before. This Bond was more of a rugged street tough who's learned to adopt the trappings of refinement. The cinematography, production design, and even the music reinforced that portrayal.</p></div><p><a href=\"https://arstechnica.com/?p=1802053#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1802053&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"02474addf1bac5c1de9f315327f3c577f0fc2e8cea9939274c19dfb27a446a8b","category":"Tech"}