{"title":"Liveblog: All the news from Apple’s “Wonderlust” event","link":"https://arstechnica.com/?p=1964620","date":1694445832000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/Screenshot-2023-08-29-at-12.23.34-PM-800x405-1.png\" alt=\"An Apple logo accompanied by the word \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/Screenshot-2023-08-29-at-12.23.34-PM-800x405-1.png\">Enlarge</a> <span>/</span> As usual, internet forum denizens are picking apart the teaser image for clues. (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n\n<p>CUPERTINO,Calif.—At 1 pm EST on Tuesday, September 12, Apple will begin broadcasting its annual event focused on new flagship iPhones and Apple Watch wearables. As has long been a tradition here at Ars Technica, we'll be liveblogging the proceedings right here. Head back to this page when the event starts to see the updates roll in!</p>\n<p>Apple hasn't talked publicly about what it plans to announce, but given the timing and past history, you can bet we'll see the iPhone 15 family of phones—likely including the iPhone 15, iPhone 15 Ultra, iPhone 15 Pro, and iPhone 15 Max. The Apple Watch will also get some airtime, with new updates to the Apple Watch Series 8 and possibly the Apple Watch Ultra.</p>\n<p>We're expecting the big news to be Apple's inclusion of a USB-C port in the iPhone 15—thrilling, right? But there are surely other new features and tweaks planned. We know comparatively little about what to expect from the Watch lineup, though.</p></div><p><a href=\"https://arstechnica.com/?p=1964620#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1964620&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"024f6100625f645c24a2fe15e088b7b408c1e7a714d13a104fa67a10c21cbea5","category":"Tech"}