{"title":"An Invasive Predator Substantially Alters Energy Flux Without Changing Food Web Functional State or Stability","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4240?af=R","date":1726114069000,"content":"<h2>ABSTRACT</h2>\n<p>Understanding how invasive species affect the stability and function of ecosystems is critical for conservation. Here, we quantified the effect of an actively suppressed invasive species on the Yellowstone Lake ecosystem using a food web energetics approach. We compared energy flux, functional state, and stability of four food web states: a pre-invasion network and three post-invasion networks undergoing active invasive species suppression, namely, initial invasion, expansion, and decline. Invasion caused ≥ 25% change (±) in energy flux for most consumers, and total flux increased twofold post-invasion. Flux to the species of conservation concern, Yellowstone cutthroat trout (<i>Oncorhynchus virginalis bouvieri</i>), was 2.8 times less post-invasion versus pre-invasion, whereas invasive lake trout (<i>Salvelinus namaycush</i>) flux was up to 17.3 times higher compared to the initial invasion network. The dominant functional state and food web stability did not change post-invasion, likely due to introduction of a generalist predator and the stabilizing effect of suppression. Lake trout invasion in Yellowstone Lake caused large changes to energy flux, shifting dominant fluxes away from the species of conservation concern, despite not changing functional state or stability. We demonstrate that changes in energy flux may signal invasions in ecosystems, but functional state or stability may not necessarily reflect the magnitude of invasion influences. For invaded fish communities, a better understanding of how the invasive species control the food web beyond just the direct influence on prey can be achieved by investigating energy flux, functional state, and food web stability. Furthermore, evaluating the effect of suppression beyond the invasive species can demonstrate the far-reaching value of suppression management actions for conservation.</p>","author":"Hayley C. Glassic, \nJames R. Junker, \nChristopher S. Guy, \nLusha M. Tronstad, \nMichelle A. Briggs, \nLindsey K. Albertson, \nDominique R. Lujan, \nTravis O. Brenden, \nTimothy E. Walsworth, \nTodd M. Koel","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"025ce18cd501853dabb4fca48a4a483a8af7c8a793e4a8b82ad3dc650fee880a","category":"Environment"}