{"title":"Amazon Bedrock now provides access to Anthropic’s latest model, Claude 2.1","link":"https://aws.amazon.com/blogs/aws/amazon-bedrock-now-provides-access-to-anthropics-latest-model-claude-2-1/","date":1701276235000,"content":"<p>Today, we’re announcing the availability of <strong>Anthropic’s Claude 2.1 </strong>foundation model (FM) in <a href=\"https://aws.amazon.com/bedrock\">Amazon Bedrock</a>. Last week, Anthropic introduced its latest model, <a href=\"https://www.anthropic.com/index/claude-2-1\">Claude 2.1</a>, delivering key capabilities for enterprises such as an industry-leading 200,000 token context window (2x the context of Claude 2.0), reduced rates of hallucination, improved accuracy over long documents, system prompts, and a beta tool use feature for function calling and workflow orchestration.</p> \n<p>With Claude 2.1’s availability in Amazon Bedrock, you can build enterprise-ready <a href=\"https://aws.amazon.com/generative-ai/\">generative artificial intelligence (AI)</a> applications using more honest and reliable AI systems from Anthropic. You can now use the Claude 2.1 model provided by Anthropic in the <a href=\"https://console.aws.amazon.com/bedrock\">Amazon Bedrock console</a>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/27/2023-claude21-in-bedrock-2-1.png\" width=\"2613\" height=\"1473\" /></p> \n<p>Here are some key highlights about the new Claude 2.1 model in Amazon Bedrock:</p> \n<p><strong>200,000 token context window </strong>– Enterprise applications demand larger context windows and more accurate outputs when working with long documents such as product guides, technical documentation, or financial or legal statements. Claude 2.1 supports 200,000 tokens, the equivalent of roughly 150,000 words or over 500 pages of documents. When uploading extensive information to Claude, you can summarize, perform Q&amp;A, forecast trends, and compare and contrast multiple documents for drafting business plans and analyzing complex contracts.</p> \n<p><strong>Strong accuracy upgrades </strong>– Claude 2.1 has also made significant gains in honesty, with a 2x decrease in hallucination rates, 50 percent fewer hallucinations in open-ended conversation and document Q&amp;A, a 30 percent reduction in incorrect answers, and a 3–4 times lower rate of mistakenly concluding that a document supports a particular claim compared to Claude 2.0. Claude increasingly knows what it doesn’t know and will more likely demur rather than hallucinate. With this improved accuracy, you can build more reliable, mission-critical applications for your customers and employees.</p> \n<p><strong>System prompts</strong> – Claude 2.1 now supports system prompts, a new feature that can improve Claude’s performance in a variety of ways, including greater character depth and role adherence in role-playing scenarios, particularly over longer conversations, as well as stricter adherence to guidelines, rules, and instructions. This represents a structural change, but not a content change from former ways of prompting Claude.</p> \n<p><strong>Tool use for function calling and workflow orchestration </strong>– Available as a beta feature, Claude 2.1 can now integrate with your existing internal processes, products, and APIs to build generative AI applications. Claude 2.1 accurately retrieves and processes data from additional knowledge sources as well as invokes functions for a given task.  Claude 2.1 can answer questions by searching databases using private APIs and a web search API, translate natural language requests into structured API calls, or connect to product datasets to make recommendations and help customers complete purchases. Access to this feature is currently limited to select early access partners, with plans for open access in the near future. If you are interested in gaining early access, please contact your AWS account team.</p> \n<p>To learn more about Claude 2.1’s features and capabilities, visit <a href=\"https://aws.amazon.com/bedrock/claude/\">Anthropic Claude on Amazon Bedrock</a> and the <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/what-is-bedrock.html#acessing-api\">Amazon Bedrock documentation</a>.</p> \n<p><strong><u>Claude 2.1 in action<br /> </u></strong>To get started with Claude 2.1 in Amazon Bedrock, go to the <a href=\"https://console.aws.amazon.com/bedrock/\">Amazon Bedrock console</a>. Choose <strong>Model access </strong>on the bottom left pane, then choose <strong>Manage model access </strong>on the top right side, submit your use case, and request model access to the Anthropic Claude model. It may take several minutes to get access to models. If you already have access to the Claude model, you don’t need to request access separately for Claude 2.1.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/27/2023-claude21-in-bedrock-1-1.png\" width=\"2398\" height=\"1322\" /></p> \n<p>To test Claude 2.1 in chat mode, choose <strong>Text </strong>or <strong>Chat </strong>under <strong>Playgrounds </strong>in the left menu pane. Then select <strong>Anthropic</strong> and then <strong>Claude v2.1</strong>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/27/2023-claude21-in-bedrock-3.png\" width=\"2564\" height=\"1604\" /></p> \n<p>By choosing <strong>View API request</strong>, you can also access the model via code examples in the <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (AWS CLI)</a> and AWS SDKs. Here is a sample of the AWS CLI command:</p> \n<pre><code>$ aws bedrock-runtime invoke-model \\\n      --model-id anthropic.claude-v2:1 \\\n      --body \"{\\\"prompt\\\":\\\"Human: \\\\n\\\\nHuman: Tell me funny joke about outer space!\\n\\nAssistant:\", \"max_tokens_to_sample\": 50}' \\\n      --cli-binary-format raw-in-base64-out \\\n      invoke-model-output.txt</code></pre> \n<p>You can use system prompt engineering techniques provided by the Claude 2.1 model, where you place your inputs and documents before any questions that reference or utilize that content. Inputs can be natural language text, structured documents, or code snippets using <code>&lt;document&gt;</code>, <code>&lt;papers&gt;</code>, <code>&lt;books&gt;</code>, or <code>&lt;code&gt;</code> tags, and so on. You can also use conversational text, such as chat history, and Retrieval Augmented Generation (RAG) results, such as chunked documents.</p> \n<p>Here is a system prompt example for support agents to respond to customer questions based on corporate documents.</p> \n<pre><code>Here are some documents for you to reference for your task:\n&lt;documents&gt;\n &lt;document index=\"1\"&gt;\n  &lt;document_content&gt;\n  (the text content of the document - could be a passage, web page, article, etc)\n   &lt;/document_content&gt;\n&lt;document index=\"2\"&gt;\n  &lt;source&gt;https://mycompany.repository/userguide/what-is-it.html&lt;/source&gt;\n&lt;/document&gt;\n&lt;document index=\"3\"&gt;\n  &lt;source&gt;https://mycompany.repository/docs/techspec.pdf&lt;/source&gt;\n &lt;/document&gt;\n...\n&lt;/documents&gt;\n\nYou are Larry, and you are a customer advisor with deep knowledge of your company's products. Larry has a great deal of patience with his customers, even when they say nonsense or are sarcastic. Larry's answers are polite but sometimes funny. However, he only answers questions about the company's products and doesn't know much about other questions. Use the provided documentation to answer user questions.\n\nHuman: Your product is making a weird stuttering sound when I operate. What might be the problem?\n</code></pre> \n<p>To learn more about prompt engineering on Amazon Bedrock, see the <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/prompt-engineering-guidelines.html\">Prompt engineering guidelines</a> included in the Amazon Bedrock documentation. You can learn general prompt techniques, templates, and examples for Amazon Bedrock text models, including Claude.</p> \n<p><strong><u>Now available</u></strong><br /> Claude 2.1 is available today in the US East (N. Virginia) and US West (Oregon) Regions.</p> \n<p>You only pay for what you use, with no time-based term commitments for on-demand mode. For text generation models, you are charged for every input token processed and every output token generated. Or you can choose the <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/prov-throughput.html\">provisioned throughput</a> mode to meet your application’s performance requirements in exchange for a time-based term commitment. To learn more, see <a href=\"https://aws.amazon.com/bedrock/pricing/\">Amazon Bedrock Pricing</a>.</p> \n<p>Give Anthropic Claude 2.1 a try in <a href=\"https://console.aws.amazon.com/bedrock\">Amazon Bedrock console</a> today and send feedback to <a href=\"https://repost.aws/tags/TAQeKlaPaNRQ2tWB6P7KrMag/amazon-bedrock\">AWS re:Post for Amazon Bedrock</a> or through your usual AWS Support contacts.</p> \n<p>— <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"025d81f672d0df1455cf364fa11eec8ba41193c5cc8e3209a32bd56f7f76b661","category":"Tech"}