{"title":"Racing put into perspective - the Tour de Suisse 2023 in review","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-suisse-in-review","date":1687172999000,"content":"\n      <p>A race that began with the exciting emergence of several great young talents, was overwhelmed by the tragic death of another, Gino Mäder. The Swiss rider, just 26 years old, crashed on the descent of the Albulapass during stage five, and his death was announced around midday the following day.</p>\n<h3>Cycling world mourns Gino Mäder</h3>\n<p>The news of Mäder’s death shocked the cycling world, and united everyone in grieving together during the final few days.</p>\n<p>In this outpouring of grief came many tributes to Mäder as a person. As well as being a popular personality in the peloton, he was celebrated in particular for his charity and social conscience, with a particular interest in environmentalism and climate change. At the 2021 <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> he raised thousands for the African re-greening charity Just Diggit after pledging to donate €10 for every rider he finished ahead of in the general classification, and €1 for every rider he finished ahead of per stage.</p>\n<p>That Vuelta was also his breakthrough as a stage race contender, when, competing in just his third Grand Tour and at the age of just 24, he placed fifth overall.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1498990399.jpg?v=1687171027\" alt /></p>\n<p><em>Bahrain Victorious cross the line in tribute to Mäder on stage six of the Tour de Suisse (Dario Belingheri/Getty Images)</em></p>\n<p>His Bahrain-Victorious teammates withdrew from the Tour de Suisse after his death, as did Tudor Pro Cycling and Intermarché-Circus-Wanty, plus many other individuals from other teams who understandably did not feel in the right frame of mind to race.</p>\n<p>The race continued under this dark shadow. On the day of his death, stage six was neutralised, with the riders riding the final 20km of the planned stage in his honour. The GC was neutralised for the final 25km of stage seven, won by Remco Evenepoel (Soudal-Quick-Step). He dedicated his win to Mäder.</p>\n<p>The race then finished with a final time trial taking place as originally planned, and which was raced competitively for the overall victory between Evenepoel, Juan Ayuso (UAE Team Emirates) and Mattias Skjelmose (Trek-Segafredo) doing battle. Ayuso took the stage, while Skjelmose held on to the GC.</p>\n<h3>Skjelmose wins the GC</h3>\n<p>Mäder’s passing was all the more painful for occurring during a race in which so much young talent flourished.</p>\n<p>While the first few days were an exciting showcase for some emerging stars of the new generation coming through, Mäder’s fate was a reminder of just how vulnerable these young men and women are in such a dangerous sport.</p>\n<p>The battle for overall victory mostly involved four riders all under the age of 26, and eventually won by the 22-year-old Mattias Skjelmose.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/mattias-skjelmose-never-gives-up\"><strong><em>Read more: Mattias Skjelmose never gives up</em></strong></a></p>\n<p>Skjelmose had already proven himself this year to be one to watch following a runner-up finish at Flèche Wallonne, high placings in some French continental races, and multiple good performances at Itzulia Basque Country. But whereas he lost his high place on GC in the latter race on the final day, this time he managed to mark and keep his GC rivals close on all the mountains after taking the leaders’ jersey following is victory on stage three, proving he has the ability to climb the high cols as well as on punchy hills and in time trials.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-09717_999520fd-f8c8-4a99-acc5-44a97bb03aba.jpg?v=1687171228\" alt=\"Mattias Skjelmose \" /></p>\n<p><em>Mattias Skjelmose won stage three on his way to overall victory (Zac Williams/SWPix)</em></p>\n<p>Similarly impressive was his cool, unpanicked tactical approach to the race. After being dropped by and losing the jersey to Felix Gall (AG2R Citroën) on the stage four summit finish (on which Gall gained over one minute while Skjelmose seemed more concerned with marking Evenepoel than chasing), Skjelmose revealed that letting Gall have the jersey was all part of the plan. He believed he and his Trek-Segafredo team would have been too vulnerable if obliged to control the race on the following day’s mountainous stage. It seemed risky, especially given how brilliantly Gall climbed to Höhenweg to win that stage, but it was ultimately justified as Skjelmose retook the jersey the very next day and defended it in the time trial; while Gall did indeed lose substantial time in the final stage against the clock, falling all the way down to eighth overall.</p>\n<h3>Juan Ayuso reconfirms talent</h3>\n<p>While Skjelmose’s ride to win the overall classification was revelatory, the prodigious talent of Juan Ayuso was already widely known, and this week he did much to reinforce the hype surrounding him.</p>\n<p>The 20-year-old Spaniard was on another level to every other rider climbing the Albulapass to win stage five by almost a minute, and then showcased his equally impressive time trialling skills to win the final stage against the clock.</p>\n<p>He now looks back to the kind of form he was in to finish third overall on Grand Tour debut at the Vuelta a España last year, before problems with his tendon forced him out of racing until April.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-04642.jpg?v=1687171468\" alt=\"Juan Ayuso\" /></p>\n<p><em>Juan Ayuso won the Tour de Suisse final time trial (Zac Williams/SWPix)</em></p>\n<p>If one criticism can be made of Ayuso since his return, it’s that he’s been a little too inconsistent in the stage races he’s committed in to take overall victory. All the time he gained in the aforementioned two stage wins would have been enough to see him finish first rather than second had he not been dropped and lost so much time on stage four’s Höhenweg climb, while his excellent time trial stage win at the Tour de Romandie was also followed by a bad day in the mountains, this time bad enough to put him out of GC contention altogether.</p>\n<p>But overall this was a great performance and one that shows he’s still making progress following his injury, and is all set to be a top favourite when he returns to the Vuelta again this year.</p>\n<h3>Evenepoel's subpar form put into perspective</h3>\n<p>Given how most WorldTour stage races this year had been dominated and won with massive margins by the peloton’s leading stars, the presence of one of those stars, Remco Evenepoel, made him the top favourite for overall victory going into the race.</p>\n<p>However, it became apparent that he had not fully returned to top form following his Covid-related withdrawal from the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> last month when he missed out on a time trial stage win to Stefan Küng (Groupama-FDJ) on the opening day, and then was not among the top performers during the climbs of the first mountainous stages.</p>\n<p>Still, he rode within his limits and paced himself well, so that he was still in with a shot of GC victory going into the final stage, needing 46 seconds on Skjelmose in the final time trial. But his time trialling legs still weren’t quite at their best, and he only managed to gain a single second, and had to settle for third overall behind Ayuso too.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-09597.jpg?v=1687172039\" alt=\"Remco Evenepoel\" /></p>\n<p>Evenepoel may not been at the top of his game, but still won a stage and took third overall (Zac Williams/SWPix)</p>\n<p>The most memorable moment from his race was when he broke away solo to win stage seven, and dedicated the victory to Gino Mäder. It was a moving moment, especially considering Evenepoel’s own near-death experience at Il Lombardia just a few years ago. What happened to Mäder this week must have put racing into perspective, and made him grateful to still be alive in the context of the harrowing reminder of what could have been his fate.</p>\n<p><em>Cover image by Zac Williams/SWPix</em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"025e922b3a0f5f0e0f502ccbe575936cb13a981110626e88ad20d78b061fdaad","category":"Cycling"}