{"title":"Leptin receptor Gln223Arg and Lys109Arg polymorphisms may be associated with HBV‐related hepatocellular carcinoma risk: A system review and meta‐analysis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24286?af=R","date":1713424693000,"content":"<h2>Abstract</h2>\n<p>Increasing evidence has suggested a strong association of hepatocellular carcinoma (HCC) susceptibility and <i>Gln223Arg</i> (rs1137101) and <i>Lys109Arg</i> (rs1137100) polymorphisms in leptin receptor (LEPR) genes. To provide a quantitative assessment for such correlation, we reviewed all related systems and conducted meta-analysis for case and control researches. A literature search of Web of Science, EMBASE, PubMed, Scopus as well as China National Knowledge Infrastructure databases was collected. 95% confidence intervals (95% CIs) together with odds ratios (ORs) were calculated. Five case–control researches consisting of 1323 cases and 1919 control cases were incorporated into meta-analysis. Researches indicated A-allelic and AA genotype of rs1137101 were substantially related to boosted susceptibility of hepatitis B virus (HBV)-related HCC (mutant model, OR = 1.81, 95% CI = 1.36–2.41, <i>p</i> &lt; .001; allelic model, OR = 1.55, 95% CI = 1.32–1.83, <i>p</i> &lt; .001). On the contrary, we observed GG genotype of rs1137101 substantially related to reduced risk of HBV-related HCC (wild model, OR 0.59, 95%CI = 0.46–0.75, <i>p</i> &lt; .001). We observed AA genotype of rs1137100 relevant to boosted HCC risk (mutant model, OR = 1.51, 95%CI = 1.14–2.01, <i>p</i> = .005) as well as in those with HBV-related HCCs (homozygous model, OR = 2.12, 95%CI = 1.49–3.02, <i>p</i> &lt; .001; mutant model, OR = 1.67, 95%CI = 1.23–2.26, <i>p</i> = .001). G-allele and AA genotype of rs1137101 might be in connection with boosted HBV-related HCC susceptibility, and wild-type GG genotype might prevent diseases. AA genotype of rs1137100 might also improve HBV-related HCC susceptibility. Such conclusions ought to be validated by larger and better-designed researches.</p>","author":"Xiaofeng Dong, \nMengjie Zou, \nChunxing Li, \nHonglin Luo, \nShaoliang Zhu, \nZheng Gong","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"0275523bd968c6671435241cb444232d04c3dacd50090bc0ad601f1c9809c761","category":"Environment"}