{"title":"Seasonal insights for integrative mosquito management from multi-year baseline entomological data on <i>Aedes aegypti</i> in Lee County, Florida","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311407","date":1728655200000,"content":"<p>by Rachel Morreale, Steven Stenhouse, Danilo O. Carvalho, Daniel A. Hahn, Kostas Bourtzis, Aaron Lloyd, Thomas Wayne Gale, David F. Hoel</p>\r\n\r\nThe spread of arboviruses like yellow fever, dengue, chikungunya, and Zika, transmitted by the invasive mosquito <i>Aedes aegypti</i> has led to the development of many strategies to suppress mosquito populations. Given the rapid development of resistance to common chemical larvicides and adulticides in some <i>Ae</i>. <i>aegypti</i> populations, as well as the ever-shrinking chemical options for mosquito control, there is a pressing need for new tools and deployment of those innovative tools as a component of integrative mosquito management programs. Prior to the adoption of any mosquito population intervention, be it conventional or innovative, understanding the baseline population is essential to evaluate the efficacy of the control measure. The Lee County Mosquito Control District in Florida has collected a three-year-long period of baseline entomological surveillance data collection for <i>Ae</i>. <i>aegypti</i> on Captiva and Sanibel Islands as foundational information prior to implementation of a new integrative mosquito management approach. We identified 18 mosquito species and described their population dynamics during the rainy and dry seasons. The two islands had no significant differences in species richness, diversity, dominance, or evenness overall. Yet, there were clear differences between the high rain season and low rain season in the Shannon diversity index, Simpson dominance index, and Pielou species evenness index within each site. Our data suggest that any innovative intervention should begin before mid to late April when the mosquito population is at its lowest and certainly before populations build up to their summer peak between June and September. These data also show the spatial distribution of <i>Ae</i>. <i>aegypti</i> is dynamic in space and time, identifying hotspots of mosquito abundance to focus on for future interventions. Overall, our study emphasizes the importance of entomological data collection to understand the population dynamics of <i>Ae</i>. <i>aegypti</i> mosquitoes, including the impact of environmental factors such as temperature and precipitation.","author":"Rachel Morreale","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0278d131fd8885a5f698c6e051d14f39c8fd15d8cc0fe59584d3ebc4a65276f1","category":"Interdisciplinary"}