{"title":"Measuring progress on health and well-being in the Eastern Mediterranean Region via voluntary national reviews, 2016–2021: What does the data reveal?","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002838","date":1721311200000,"content":"<p>by Ruth M. Mabry, Henry V. Doctor, Mina N. Khair, Maha Abdelgalil, Arash Rashidian</p>\r\nBackground <p>Country submission of Voluntary National Reviews is the formal mechanism to report on progress of the Sustainable Development Goals (SDGs). Despite strong political commitment to strong information systems, large data gaps exist in the Eastern Mediterranean Region.</p> Methods <p>This study aims to review reports submitted by countries in the region to assess the comprehensiveness of reporting on the health-reported SDG targets and indicators. We conducted a content analysis of reports submitted between 2016 and 2021 of 18 countries of the region. The review focused on progress on the SDGs by assessing i) the reporting on the 50 health-related targets and indicators ii) data availability using the WHO reporting framework, and iii) data availability based on source of information. Spreadsheets were developed and used to extract data and facilitate content analysis.</p> Results <p>All reports confirmed that SDG monitoring and reporting mechanisms have been established, however, only 11 reported on all 17 SDGs and 8 explicitly mentioned country specific 2030 targets. Many reports identified data availability as a key challenge to SDG monitoring; for the health SDG, data availability ranged from 48% to 93% among the five countries reporting this figure. Comprehensiveness of reporting varied by type of indicator (maternal, child and infant mortality were the most common) and by country income level (greater reporting by high income countries).</p> Conclusions <p>Significant work remains to enhance information systems across the region to monitor progress and guide actions to achieve the health-related SDGs. Strengthening health information systems regulatory frameworks, data collection capacities including strengthening civil registration and vital statistics and population-based surveys are key steps to enhancing access to quality data which in turn can contribute to achieving the health-related SDGs.</p>","author":"Ruth M. Mabry","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"028a3a67379e150f430ba048a438d51f3054df26fc33f455f9822e224879f922","category":"Environment"}