{"title":"Evaluating the implementation of weekly rifapentine-isoniazid (3HP) for tuberculosis prevention among people living with HIV in Uganda: A qualitative evaluation of the 3HP Options Trial","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003347","date":1729778400000,"content":"<p>by Allan Musinguzi, Joan R. Kasidi, Jillian L. Kadota, Fred Welishe, Anne Nakitende, Lydia Akello, Jane Nakimuli, Lynn T. Kunihira, Bishop Opira, Yeonsoo Baik, Devika Patel, Amanda Sammann, Christopher A. Berger, Hélène E. Aschmann, Payam Nahid, Robert Belknap, Moses R. Kamya, Margaret A. Handley, Patrick P. J. Phillips, Noah Kiwanuka, Achilles Katamba, David W. Dowdy, Adithya Cattamanchi, Fred C. Semitala, Anne R. Katahoire</p>\r\n\r\nThree months of isoniazid-rifapentine (3HP) is being scaled up for tuberculosis (TB) preventive treatment (TPT) among people living with HIV (PLHIV) in high-burden settings. More evidence is needed to identify factors influencing successful 3HP delivery. We conducted a qualitative assessment of 3HP delivery nested within the 3HP Options Trial, which compared three optimized strategies for delivering 3HP: facilitated directly observed therapy (DOT), facilitated self-administered therapy (SAT), and patient choice between facilitated DOT and facilitated SAT at the Mulago HIV/AIDS clinic in Kampala, Uganda. We conducted 72 in-depth interviews among PLHIV purposively selected to investigate factors influencing 3HP acceptance and completion. We conducted ten key informant interviews with healthcare providers (HCPs) involved in 3HP delivery to identify facilitators and barriers at the clinic level. We used post-trial 3HP delivery data to assess sustainability. We used thematic analysis (inductive and deductive) to align the emergent themes with the RE-AIM framework dimensions to report implementation outcomes. Understanding the need for TPT, once-weekly dosing, shorter duration, and perceived 3HP safety enhanced acceptance overall. Treatment monitoring by HCPs and reduced risk of HIV status disclosure enabled DOT acceptance. Dosing autonomy enabled SAT acceptance. Switching between DOT and SAT as needed enabled acceptance of patient choice. Dosing reminders, reimbursement for clinical visits, and social support enabled 3HP completion; pill burden, side effects, and COVID-19-related treatment restrictions hindered completion. All HCPs were trained and participated in 3HP delivery with high fidelity. Training, care integration, prior TPT experience with daily isoniazid, and few 3HP-related serious adverse events enabled adoption, whereas initial concerns about 3HP safety among HCPs, and COVID-19 treatment disruptions delayed 3HP adoption. Refresher training and collaboration among HCPs enabled implementation whereas limited diagnostic facilities for adverse events at the clinic hindered implementation. SAT was modified post-trial; DOT was discontinued due to inadequate ongoing financial support beyond the study period. Facilitated delivery strategies made 3HP treatment convenient for PLHIV and were feasible and implemented with high fidelity by HCPs. However, the costs of 3HP facilitation may limit wider scale-up.\r\nTrial registration: ClinicalTrials.gov (NCT03934931); Registered 2<sup>nd</sup> May 2019; https://clinicaltrials.gov/study/NCT03934931?id = NCT03934931&amp;rank = 1.","author":"Allan Musinguzi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"028b16d5576d1a30f34c1680e685a2b3db5012e9c521c832c94920b800e20a50","category":"Environment"}