{"title":"Feasibility of excitation‐emission fluorescence spectroscopy in tandem with chemometrics for quantitation of trans‐resveratrol in vine shoots ethanolic extracts","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13435?af=R","date":1709652783000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p><i>Trans</i>-resveratrol (TR) is a well-known phytochemical compound with important biological properties, that could be recovered from agri-food by-products or wastes, such as vine shoots. Once recovered, its concentration should be measured, possibly in a green, non-destructive, and efficient manner. With these premises, this work aims to explore the feasibility of excitation-emission fluorescence spectroscopy combined with chemometrics for the analysis of TR in raw extracts obtained from vine shoots. A total of 75 extracts were produced and analysed by UPLC-DAD and spectrofluorimetry. Then, the feasibility of two calibration strategies (a PARAFAC based calibration and the NPLS regression) for TR quantitation was assessed.</p>\n<h2>Results</h2>\n<p>The extracts showed a variable content of TR, whose excitation/emission maxima were at around 305/390 nm, respectively. The best PARAFAC based calibration allows to obtain a RMSEP = 22.57 mg L<sup>-1</sup>, and an RPD = 2.91 but a large number of PARAFAC components should be considered to improve the predictions. The results of the NPLS regression were slightly better, with a RMSEP = 19.47 mg L<sup>-1</sup>, and an RPD = 3.33, in the best case.</p>\n<h2>Conclusion</h2>\n<p>Fluorescence could be an alternative analytical technique to measure TR in complex samples. Chemometrics tools allowed the identification of the TR signal in the fluorescence landscapes that could be further used for its non-destructive quantitation. The needing of a more accurate criterion for the optimal PARAFAC complexity emerged.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Antonio F. Caputi, \nGiacomo Squeo, \nEwa Sikorska, \nRoccangelo Silletti, \nMirella Noviello, \nAntonella Pasqualone, \nCarmine Summo, \nFrancesco Caponio","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"028d34ba5c4ea222a5af20bf457a55819d45358925019b2f97142c28ff65ee69","category":"Environment"}