{"title":"Does government food demonstration intervention influence household dietary diversity in the Upper West Region of Ghana?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302869","date":1715176800000,"content":"<p>by Cornelius K. A. Pienaah, Sulemana Ansumah Saaka, Herwin Ziemeh Yengnone, Mildred Naamwintome Molle, Isaac Luginaah</p>\r\n\r\nDietary diversity is crucial in ensuring food and nutrition security. In low-middle-income countries, people frequently prioritize the quantity of food they consume over its quality due to a lack of availability and financial limitations. As a result, achieving dietary diversity is often overlooked in favor of ensuring adequate caloric intake. Through a social cognitive theory perspective, our study examines the relationship between food demonstrations and household dietary diversity in Ghana’s Upper West Region utilizing cross-sectional survey data from 517 smallholder farmer households. The results from ordered logistic regression presented in odds ratio (OR) show that participating in food demonstrations (OR: 2.585, p&lt;0.01), engaging in home gardening (OR: 1.932, p&lt;0.001), having access to credit (OR: 1.609, p&lt;0.01), self-rated good nutritional status (OR: 1.747, p&lt;0.01), and Waala ethnicity (OR: 3.686, p&lt;0.001) were all positively associated with high household dietary diversity. Conversely, living in the Wa West district was associated with lower dietary diversity (OR: 0.326, p&lt;0.001). Our research findings suggest that policymakers may want to consider implementing community-based educational programs, such as home and school visits for food demonstrations and sensitizations, promoting mother-to-mother support groups for dietary diversity education, nutrition counseling services, and using role-play and local media. In addition, strengthening local agricultural policies through food banks, indigenous seed development, and mobile food markets and enhancing public-private partnerships like the Ghana Schools Feeding Programme and National Food Buffer Stock company could improve the supply chain and distribution networks for diverse food items. Implementing these interventions in the Upper West Region of Ghana could improve health, well-being, food security, and nutritional outcomes.","author":"Cornelius K. A. Pienaah","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"029081756aef52eef59bacd9f2461da562cc06bac05f1ef086a8e540c1f198f1","category":"Interdisciplinary"}