{"title":"Amazon เปิดตัวแท็บเล็ต Fire 10 รุ่นใหม่, Fire Kids Pro จับกลุ่มเด็กโต","link":"https://www.blognone.com/node/122383","date":1619540969000,"content":"<div><div><div><p>Amazon เปิดตัวแท็บเล็ตใหม่ในรอบนี้ โดยมี Fire HD 10, 10 Pro, 10 Kids และแท็บเล็ตไลน์ใหม่ Amazon Fire Kids Pro ที่จับกลุ่มเด็กโตขึ้นมาอีกเล็กน้อย</p>\n<p>สำหรับ Amazon Fire HD 10 และ 10 Plus ทั้งสองรุ่นจะมีหน้าจอ 10.1 นิ้ว Full HD ที่สว่างกว่ารุ่นเดิม 10%, หน่วยประมวลผลแปดคอร์ที่ 2GHz, สตอเรจมีให้เลือกสูงสุด 64GB (ขยายได้สูงสุดถึง 1TB ด้วย microSD), แบตเตอรี่ใช้งานได้นานสุดถึง 12 ชั่วโมง</p>\n<p>ส่วนที่แตกต่างกันคือรุ่น Fire HD 10 ใช้แรม 3GB ส่วน 10 Plus ใช้แรม 4GB ซึ่งรุ่น 10 Plus จะมีระบบชาร์จแบตเตอรี่ไร้สาย และพื้นผิวสัมผัสที่ให้ความพรีเมียมกว่ารุ่นธรรมดา</p>\n<p>ราคาจำหน่าย Fire HD 10 อยู่ที่ 149.99 ดอลลาร์ ส่วน Fire HD 10 Plus อยู่ที่ 179.99 ดอลลาร์ มี Productivity Bundles ที่มีแท็บเล็ตพร้อมคีย์บอร์ดเชื่อมต่อผ่าน Bluetooth และสมาชิก Microsoft 365 Personal อายุ 12 เดือน โดยราคาเริ่มต้นอยู่ที่ 219.99 ดอลลาร์</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/0ed1e7cd9e323482729b00c01883c285.jpg\" /></p>\n<p>ถัดไปเป็น Fire HD 10 Kids แท็บเล็ตสำหรับเด็ก ใช้หน้าจอ 10 นิ้ว พร้อมแรม 3GB, กล้องหลัง 5 ล้านพิกเซล ส่วนสเปคเพิ่มเติมสำหรับเด็ก คือตัวแท็บเล็ตจะมาพร้อมแคสป้องกัน 7 สี ออกแบบมาป้องกันการตกหรืออุบัติเหตุกับตัวเครื่อง โดยแท็บเล็ตจะมาพร้อมกับ Amazon Kids+ ที่ให้เข้าถึงหนังสือ, ภาพยนตร์, รายการทีวี และแอปสำหรับเด็กกว่า 20,000 รายการ</p>\n<p>Amazon Fire HD 10 Kids วางจำหน่ายที่ราคา 199.99 ดอลลาร์</p>\n<p>ถัดไปเป็น Amazon Fire Kids Pro เป็นแท็บเล็ตจับกลุ่มเด็กที่โตขึ้นอีกเล็กน้อย มาพร้อม Amazon Kids+ ที่สามารถเข้าใช้คอนเทนต์ได้เยอะกว่ารุ่นธรรมดา, ระบบโทรด้วยเสียงหรือวิดีโอคอลไปหาแท็บเล็ต Fire Kids อื่น ๆ ด้วยที่อยู่ติดต่อที่ผู้ปกครองอนุมัติ, เข้าใช้สโตร์โดยเด็กสามารถขอดาวน์โหลดแอปจากผู้ปกครองได้ ส่วนตัวฮาร์ดแวร์จะมีเคสป้องกันแบบบางและขาตั้งในตัวให้ในชุด</p>\n<p>Amazon Fire Kids Pro มี 3 รุ่นย่อย คือ 7 นิ้ว ราคา 99.99 ดอลลาร์, 8 นิ้ว ราคา 139.99 ดอลลาร์ และ 10 นิ้ว ราคา 199.99 ดอลลาร์</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3619f5dfc7244481740604b6b5edd1fb.jpeg\" /></p>\n<p>ที่มา - <a href=\"https://www.theverge.com/2021/4/27/22405230/amazon-fire-hd-10-2021-announced-kids-pro\">The Verge</a>, <a href=\"https://www.engadget.com/amazon-new-fire-hd-10-tablets-plus-kids-pro-130029307.html\">Engadget</a>, <a href=\"https://techcrunch.com/2021/04/27/amazon-announces-new-fire-tablets-and-kids-editions/\">TechCrunch</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/tablet\">Tablet</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0297b18c3aedcdc0a4cf52c5a1bae0cf46d4f09d06d613a99a192d2f327ea051","category":"Thai"}