{"title":"ISPs complain that listing every fee is too hard, urge FCC to scrap new rule","link":"https://arstechnica.com/?p=1961031","date":1692129708000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/getty-internet-bills-800x533.jpg\" alt=\"Dollar signs superimposed on a photo of a person's hands typing on a laptop keyboard.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/getty-internet-bills.jpg\">Enlarge</a> (credit: Getty Images | anyaberkut)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The US broadband industry is united in opposition to a requirement that Internet service providers list all of their monthly fees. Five lobby groups representing cable companies, fiber and DSL providers, and mobile operators have repeatedly urged the Federal Communications Commission to eliminate the requirement before new broadband labeling rules take effect.</p>\n<p>The trade associations <a href=\"https://www.fcc.gov/ecfs/document/10117331109471/1\">petitioned the FCC</a> in January to change the rules and renewed their call last week in a <a href=\"https://www.fcc.gov/ecfs/document/10811085828256/1\">filing</a> and in a meeting with FCC officials. The requirement that ISPs list all their monthly fees \"would add unnecessary complexity and burdens to the label for consumers and providers and could result in some providers having to create many labels for any given plan,\" the groups said in the filing on Friday.</p>\n<p>The trade groups said the FCC should instead \"require providers to include an explanatory statement that such fees may apply and that they vary by jurisdiction, similar to the Commission's treatment of government-imposed taxes,\" or require \"the display of the maximum level of government-imposed fees that might be passed through, so that consumers would not experience bill shock with respect to such fees.\"</p></div><p><a href=\"https://arstechnica.com/?p=1961031#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1961031&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0299d4ec7197df382bb30e8adaf3fc580d43ca79cfcda9c214be340529838f2c","category":"Tech"}