{"title":"Odour information enables patch choice by mammalian herbivores from afar, leading to predictable plant associational effects","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14665?af=R","date":1727849422000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/25bd1121-157f-4aa2-a612-59386d2b7b47/fec14665-toc-0001-m.png\" alt=\"Odour information enables patch choice by mammalian herbivores from afar, leading to predictable plant associational effects\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/19/plant-odour-enables-patch-choice-by-mammalian-herbivores-from-afar-shaping-the-likelihood-of-plants-within-a-patch-being-found-and-eaten/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nNeighbouring plants can alter the susceptibility of high-quality focal plants to herbivores by affecting herbivore patch choice. Herbivores can use plant odour to make patch-scale foraging decisions from afar, but the actual information they rely on within complex plant odours is rarely defined. Revealing the information enabling patch choice by herbivores will provide the mechanistic link underpinning associational effects of plant neighbours arising from these foraging decisions.\n\nHere, our first aim was to test whether odour cues alone enable a mammalian herbivore to make patch choice decisions leading to predictable associational effects of neighbours on high-quality focal plants. Our second aim was then to test whether artificial odour, designed to mimic the informative odour component within the whole odour profile of low-quality neighbours, is as effective as real plants in influencing patch choice and associational refuge.\n\nWe tested patch choice by African elephants, <i>Loxodonta africana</i> using a giant Y-maze and real or artificial plant odours as the only cues for the neighbours of a high-quality focal plant. We quantified the probability of various odour treatments being chosen in comparison with the odour of a focal plant alone.\n\nCompared with focal plants alone, we found that elephants were more likely to choose patches with the focal plant plus high-quality neighbours of the same or different species, but less likely to choose patches with the focal plant plus low-quality neighbours. We also demonstrated that an artificial subset of odours, designed to be informative, were as effective as real low-quality neighbours in influencing patch choice and hence associational refuge to the focal plant.\n\nOur results demonstrate a key role of plant odour—and specifically informative components within complex odour profiles—in patch choice decisions by a mammalian herbivore, leading to plant associational effects on high-quality focal plants. Understanding what olfactory information herbivores use when deciding which patches to visit or avoid, and how it affects focal plant susceptibility is important ecologically. Non-random patch choice will not only affect individual fitness of herbivores, but also shape plant community dynamics through impacting plant survival and recruitment. Furthermore, artificially re-creating odour information could offer a new tool to influence herbivore foraging decisions, with implications for wildlife management and conservation, including plant protection.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/19/plant-odour-enables-patch-choice-by-mammalian-herbivores-from-afar-shaping-the-likelihood-of-plants-within-a-patch-being-found-and-eaten/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Patrick B. Finnerty, \nAdrian M. Shrader, \nPeter B. Banks, \nMelissa H. Schmitt, \nClare McArthur","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"02a0298b107c44d5c1c624a7fb7db6318ea663de58598acec6bbe64503d303d4","category":"Environment"}