{"title":"Contrasting effect of hybridization on genetic differentiation in three rockfish species with similar life history","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13749?af=R","date":1721451926000,"content":"<h2>Abstract</h2>\n<p>Hybridization can provide evolutionary benefits (e.g., population resilience to climate change) through the introduction of adaptive alleles and increase of genetic diversity. Nevertheless, management strategies may be designed based only on the parental species within a hybrid zone, without considering the hybrids. This can lead to ineffective spatial management of species, which can directly harm population diversity and negatively impact food webs. Three species of rockfish (Brown Rockfish (<i>Sebastes caurinus</i>), Copper Rockfish (<i>S. auriculatus</i>), and Quillback Rockfish (<i>S. maliger</i>)) are known to hybridize within Puget Sound, Washington, but genetic data from these species are used to infer population structure in the entire genus, including in species that do not hybridize. The goal of this project was to estimate the hybridization rates within the region and determine the effect of hybridization on geographic patterns of genetic structure. We sequenced 290 Brown, Copper, and Quillback rockfish using restriction-site associated DNA sequencing (RADseq) from four regions within and outside Puget Sound, Washington. We show that (i) hybridization within Puget Sound was asymmetrical, not recent, widespread among individuals, and relatively low level within the genome, (ii) hybridization affected population structure in Copper and Brown rockfish, but not in Quillback Rockfish and (iii) after taking hybridization into account we found limited directional dispersal in Brown and Copper rockfish, and evidence for two isolated populations in Quillback Rockfish. Our results suggest that rockfish population structure is species-specific, dependent on the extent of hybridization, and cannot be inferred from one species to another despite similar life history.</p>","author":"Anita Wray, \nEleni Petrou, \nKrista M. Nichols, \nRobert Pacunski, \nLarry LeClair, \nKelly S. Andrews, \nMarty Kardos, \nLorenz Hauser","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"02aceefe1e8e08f01ef2be8068dba76b9452dd20e7e423dddeada8bce421ab84","category":"Environment"}