{"title":"Variation in hydropeaking‐induced stranding of Barbus barbus L. and Chondrostoma nasus L. larvae: Assessing the impact of daytime and down‐ramping rates","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2626?af=R","date":1710913800000,"content":"<h2>Abstract</h2>\n<p>Unnatural changes in river flow patterns resulting from peak-operating hydropower plants adversely impact freshwater ecosystems. In particular, the rapid dewatering of shoreline habitats during artificial flow down-ramping puts early fish life stages at a high risk of becoming stranded if they fail to follow receding water levels in time. While extensive research has been conducted on the effects of hydropeaking on salmonid species, there is limited knowledge on the diverse cyprinid family, particularly on vulnerable early life stages. Hence, this study aims to compare the larval stranding of two cyprinid species, the common barbel (<i>Barbus barbus</i> L.) and common nase (<i>Chondrostoma nasus</i> L.), in response to bank dewatering. We conducted larvae experiments in near-natural mesocosms, simulating single flow down-ramping events with varying down-ramping rates (0.3–1.8 cm·min<sup>−1</sup>) during the day and at night to quantify stranding rates, also including water temperature and fish development. Our results reveal distinct diurnal patterns for both species, with higher stranding rates during the night than during the day in all experimental scenarios. The data also show higher stranding rates at faster down-ramping, with interaction effects between down-ramping rates and time of day. The stranding rates between the two species are similar across most of the scenarios. Scenarios with colder water temperatures show that nase larvae tend to strand more frequently than with warmer temperatures. In conclusion, the study results contribute to the ongoing discourse on hydropeaking mitigation by providing new perspectives on flow-reduction effects on early cyprinid life stages. Mitigation measures should prioritize the periods during early larval development and factor in prevailing water temperatures. Lowering down-ramping rates, especially during nighttime, will help minimizing negative impacts on aquatic ecosystems, particularly when combining flow rules and habitat restoration measures.</p>","author":"Simon Führer, \nStefan Auer, \nAnna Coudrais‐Duhamel, \nAntonin Olejarz, \nFelix Stoisser, \nStefan Schmutz, \nDaniel S. Hayes","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"02b895c0abe4b70c8b709623c1d68bc603820b311d47903b568e8f87823e0e2e","category":"Environment"}