{"title":"Maritime international trade and bioinvasions: A three‐year long survey of small mammals in Autonomous Port of Cotonou, Benin","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14557?af=R","date":1702563907000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/e4f3b94c-1637-4ce6-836c-8cc1e3ecdf76/jpe14557-toc-0001-m.png\" alt=\"Maritime international trade and bioinvasions: A three-year long survey of small mammals in Autonomous Port of Cotonou, Benin\" />\n<p>Our results are discussed in terms of ecological processes at play (e.g. interspecific interactions) and operational recommendations (e.g. assessment of proper eradication units, environmental modifications).</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nInternational trade has been favouring the dissemination of a wide suite of invasive alien species. Upstream prevention through the monitoring of entry points is identified as an appropriate strategy to achieve control of bioinvasions and their consequences. Maritime transportation has been responsible for the introduction worldwide of exotic rodents that are major pests for crops and food stocks as well as reservoirs of many zoonotic pathogens. In order to limit further dissemination, the International Health Regulation constrains decisions makers and socio-economic stakeholders to manage ship-mediated import/export of rodents within seaports.\n\nUnfortunately, eco-evolutionary insights into rodent introduction events that could guide preventive actions in seaports are very scarce. In order to bridge this gap, we here describe the results of a 3 year-long survey of small mammals conducted in the Port of Cotonou, Benin.\n\nOur aim was to assess the spatiotemporal distribution, diversity and relative abundance of invasive and native rodents.\n\n960 small mammal individuals were captured in nine within-seaport sites. We found (i) a marked predominance of invasive species (84% of the individuals belonging to <i>Mus musculus</i>, <i>Rattus rattus</i>, <i>R. norvegicus</i>), (ii) with native species (i.e. <i>Mastomys natalensis</i> and the shrew <i>Crocidura olivieri</i>) essentially restricted to peripheral non-industrial areas, as well as (iii) a fine-scale spatial segregation stable over time between the invasive Norway rats and house mice on the one hand, and the black rats and shrews on the other hand.\n\nFurthermore, trapping before and after two successive rodent control campaigns indicates that they were ineffective and that subsequent rodent recolonisation occurred 6–12 months following intervention.\n\n<i>Synthesis and applications</i>. Our results are discussed in terms of ecological processes at play (e.g. interspecific interactions) and operational recommendations (e.g. assessment of proper eradication units, environmental modifications).\n</p>","author":"Sylvestre Badou, \nAntoine A. Missihoun, \nClément Agbangla, \nPhilippe Gauthier, \nGualbert Houéménou, \nHenri‐Joël Dossou, \nJonas Etougbétché, \nTasnime Adamjy, \nArlette Tchabi, \nLaurent Faton, \nKarmadine Hima, \nCamille Evenamia, \nChristophe Diagne, \nAurélien Besnard, \nAmbroise Dalecky, \nGauthier Dobigny","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"02b9c49e2ddefa4f41ef66c31a74271b506671c479c1c018ead8e7812e0de6f9","category":"Environment"}