{"title":"Performance and accuracy of cross‐section tracking methods for hydromorphological habitat assessment in wadable rivers with sparse canopy conditions","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4252?af=R","date":1707352192000,"content":"<h2>Abstract</h2>\n<p>This article investigates the performance and accuracy of continuous Real-Time Kinematic (RTK) Global Navigation Satellite System (GNSS) position tracking for hydromorphological surveys, based on a comprehensive river restoration monitoring campaign. The aim of the research was to assess the method's suitability for efficient data collection in turbid, wadable rivers with sparse canopy conditions, and responds to the water management sector's increasing demand for efficient, low-cost, and robust survey techniques. The methodological approach involved comparing manual, cross-sectional water depth measurements to water depth estimations obtained by applying different interpolation methods to the continuous tracking data. The results demonstrate good agreement between both datasets (R2 = 0.77, RMSE = 0.13 m). When using a local standard deviation filter to remove noisy RTK-GNSS measurements, estimation performance increased significantly (R2 = 0.96, RMSE = 0.06 m). The filter's influence on the hydromorphological habitat statistics mean water depth and coefficient of variation was limited but proved to be relevant for reach-scale assessments of hydromorphological diversity. Based on a correlation analysis of &gt;10<sup>6</sup> RTK-GNSS position logs, we furthermore assessed the impact of tree canopy on RTK-GNSS measurement accuracy and observed a strong influence within 6.5 m from the canopy border. Estimated accuracy deteriorated noticeably when canopy penetration exceeded 1 m, and accuracies &gt;1 m were common beyond 4 m penetration. The study highlights the efficiency gains achieved with RTK-GNSS tracking, and showcases its potential for hydromorphological surveys and streamgaging applications in challenging conditions, making it a promising alternative to traditional methods and remote sensing techniques.</p>","author":"Robin Schroff, \nGiovanni De Cesare, \nPaolo Perona","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"02cd92073a7c7889efcb3c0ea874d705965033096cc56d52f8a814880100badb","category":"Environment"}