{"title":"More than 1,000 Android phones found infected by creepy new spyware","link":"https://arstechnica.com/?p=1811970","date":1636574195000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/robot-phone-800x534.jpeg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/robot-phone.jpeg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>More than 1,000 Android users have been infected with newly discovered malware that surreptitiously records audio and video in real time, downloads files, and performs a variety of other creepy surveillance activities.</p>\n<p>In all, researchers uncovered 23 apps that covertly installed spyware that researchers from security firm Zimperium are calling PhoneSpy. The malware offers a full-featured array of capabilities that, besides eavesdropping and document theft, also includes transmitting GPS location data, modifying Wi-Fi connections, and performing overlay attacks for harvesting passwords to Facebook, Instagram, Google, and the Kakao Talk messaging application.</p>\n<p>“These malicious Android apps are designed to run silently in the background, constantly spying on their victims without raising any suspicion,” Zimperium researcher Aazim Yaswant <a href=\"https://blog.zimperium.com/phonespy-the-app-based-cyberattack-snooping-south-korean-citizens/\" target=\"_blank\">wrote</a>. “We believe the malicious actors responsible for PhoneSpy have gathered significant amounts of personal and corporate information on their victims, including private communications and photos.”</p></div><p><a href=\"https://arstechnica.com/?p=1811970#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1811970&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"02d52def0e47198e5c5ed09c7ac37c6e0801d60d96b6b8f04f8d9fb5add7f93e","category":"Tech"}