{"title":"352 Supplementing bovine satellite cells with anabolic hormones and/or zinc at differentiation impacts abundance of mRNA involved in growth, mineral transport, and oxidative stress","link":"https://academic.oup.com/jas/article/102/Supplement_3/373/7757499?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Zinc (Zn) is the most utilized metal in biological processes and supports growth through critical roles in protein turnover. The Zn requirements of skeletal muscle may be augmented when growth promoting technologies, such as anabolic hormones are being utilized. Both anabolic hormones and Zn affect protein synthesis and degradation in skeletal muscle. However, the molecular mechanisms through which Zn may interact with anabolic hormones to support skeletal muscle growth remains unknown. The objective of this study was to determine whether trenbolone acetate (TBA), estradiol (E2) and Zn interact to promote differentiation of bovine satellite cell (BSC) cultures by assessing abundance of mRNA involved in growth, mineral transport, differentiation, protein turnover and oxidative stress. To do this, primary BSC cultures were isolated from three different steers and grown to 80% confluency and induced to differentiate in 3% horse serum, at which time a factorial design was employed to assess the impact of Zn (0, 10, 20 or 40 μM) as ZnCl<sub>2</sub> and/or the impact of hormone (10 nM TBA,10 nM E2, 10 nM TBA and 10 nM E2). Zinc concentrations represent physiologically relevant plasma Zn concentrations. Total mRNA was isolated from the treated cultures at 4 h, 12 h and 24 h post-treatment. Assays utilizing cultures from each steer were run in duplicate (n = 6). The mRNA abundance of 45 genes were examined and analyzed using the PROC MIXED procedure of SAS with time as a repeated measure to evaluate the fixed effects of hormone, mineral, time, and all interactions. No effects (<span>P</span> ≥ 0.19) of hormone x mineral x time, hormone x time, hormone x mineral or hormone were noted. A mineral x time effect (<span>P</span> ≤ 0.04) was noted for the igf1r, slc39a7, mapk1, mmp2, and G6pd. A mineral effect was found for hormone receptors (ir, ar, esr1, esr2, and gper; <span>P</span> ≤ 0.03), mRNA involved in mineral transport (slc30a10, slc30a7, sod1, sod2, slc2a4, and slc39a8; <span>P</span> ≤ 0.009), and genes related to skeletal muscle differentiation (pax7, myf5, myf6, spry1, myog, mef2a, and myod; <span>P</span> ≤ 0.02) and protein turnover (akt1, fox01, fox04, mstn,fbox32, fox03, mtor, trim63, and CKM; <span>P</span> ≤ 0.03). These differences are generally driven by abundance being increased (<span>P</span> ≤ 0.05) in cultures treated with 40 or 20 μM Zn compared with cultures receiving 0 or 10 μM Zn. These results indicate that while Zn and hormone do not appear to interact to influence gene expression of differentiating primary BSC cultures at the time points measured, increased concentrations of Zn appear to increase mRNA abundance of hormone receptors, mineral transporters, and genes involved in skeletal muscle differentiation and protein turnover.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"02d8e8e9589fac2eaf4fc74973b7306e3772298940d13fe7740e8bcc9c78560a","category":"Environment"}