{"title":"The Most Dramatic Giro d'Italia Finishes","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-most-dramatic-giro-ditalia-finishes","date":1622322072000,"content":"\n      <p><span>The 2021 Giro d’Italia is about to reach its conclusion. With 20 stages in the legs, just 30 kilometres are left. Egan Bernal holds a lead of two minutes over Damiano Caruso and looks certain to win if not for a highly dramatic final stage. But when it comes to dramatic final stages, </span><span>the Giro d'Italia certainly has form. </span></p>\n<div></div>\n<p><span>With that in mind, let's look back to some of the most nail-biting, shocking and dramatic finishes in Giro d'Italia history. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2021-preview\">Giro d'Italia 2021 guide</a></em></strong></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tagged/giro-ditalia-2021\"><strong><em>Giro d'Italia articles</em></strong></a></p>\n<h4><span><b>Giro d'Italia<span> </span></b><b>2010 - Ivan Basso / David Arroyo</b></span></h4>\n<p><span><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-533219522_1024x1024.jpg?v=1622321825\" /></em></span></p>\n<p><span><em>Scarponi, Basso and Nibali attack on the Passo del Mortirolo (</em></span><em><span>Image credit: Tim de Waele/Corbis via Getty Images)</span></em></p>\n<p><span>The 2010 Giro is<span> </span>often<span> </span>remembered for an apocalyptic day to Montalcino, where biblical weather conditions obliterated the peloton on the gravelled strade bianche roads. Cadel Evans won that day, but the battle for pink was equally as exciting.</span></p>\n<p><span>After arriving in Brescia to complete stage 18, David Arroyo was in the prime position to claim his first Grand Tour victory. The Spaniard’s best finish at a three week tour previously was eighth. It was the chance of a lifetime.</span></p>\n<p><span>However, Liquigas-Doimo had other ideas — the Passo del Mortirolo would be the scene for one of the great team comebacks in Giro history. Robert Kiserlovski blew the peloton to smithereens, dropping the<span> </span><em>maglia rosa</em><span> </span>worn by Arroyo. Vincenzo Nibali then rode in support of Ivan Basso for the remainder of the stage. The Liquigas duo were joined by Androni’s Michele Scarponi and the leading trio formed a three man time trial where they gained over three minutes before the finish in Aprica.</span><span><span> </span>Scarponi, who was further back in the GC, won the stage as the Liquigas duo battled just to cross the finish line. It was a day of pure attrition. Basso had overturned a two and half minute deficit to claim pink at the last.</span></p>\n<p><span>Basso held the lead over the final few stages to secure an improbable comeback victory. For Arroyo, he would never finish on the podium of a Grand Tour again.</span></p>\n<h4><b>Giro d'Italia 2017 - Tom Dumoulin / Nairo Quintana</b></h4>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-689458022_1024x1024.jpg?v=1622321899\" /></div>\n<p><i><span>Image credit: KT/Tim De Waele/Corbis via Getty Images</span></i></p>\n<p><span>Tom Dumoulin entered the final week of the 2017 Giro d'Italia with a healthy lead of multiple minutes over Nairo Quintana in second. His major advantage can mainly be attributed to a 40 kilometre time trial on stage 10, where Dumoulin won by almost a full minute. Expected to struggle comparatively when the road went uphill, </span><span>Dumoulin looked in consummate control when he won stage 14 on the mountain-top finish in Oropa, extending his advantage to 2:47.</span></p>\n<p><span>The race is remembered for an 'incident' on stage 16. After crossing the Passo dello Stelvio, Dumoulin’s infamous ill-timed toilet break cost him major time and meant the <em>maglia rosa</em> was chasing solo at a crucial point in the race. Following the stage, his lead had tumbled to 31 seconds. The pure climbers, namely Nairo Quintana, Vincenzo Nibali and Thibaut Pinot, attacked Dumoulin repeatedly over the final mountain stages and entering stage 21, Dumoulin had dropped to fourth overall. His gap was 53 seconds to Quintana in pink, with Nibali and Pinot sandwiched in the middle.</span></p>\n<p><span>Dumoulin couldn’t win the 29km time-trial from Monza to Milan, but second place on the stage was enough to jump from fourth into first at the final opportunity, defeating Nairo Quintana by just 31 seconds. It was one of the most closely fought editions of the Giro with four riders in contention until the very last.</span></p>\n<h4>\n<b>Giro d'Italia </b><b>2016 - Vincenzo Nibali / Steven Kruijswijk</b>\n</h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-531590756_1024x1024.jpg?v=1622321952\" /></span></i></p>\n<p><i><span>Image credit: KT/Tim De Waele/Corbis via Getty Images</span></i></p>\n<p><span>With just three stages left of the 2016 Giro d’Italia, Steven Kruijswijk sat pretty in pink, precisely three minutes clear at the top of the standings. His lead looked beyond doubt, but with consecutive high-altitude mountain stages left, the race was about to turn on its head.</span></p>\n<p><span>After crossing the mammoth Colle dell'Agnello, which was the Cima Coppi that year at an incredible 2,700 metres above sea level, the Dutchman clattered the snow-covered roadside. The rest of the major contenders pressed on and Vincenzo Nibali won the stage, gaining an enormous five minutes to Kruijswijk. The Dutchman fell to third overall, whilst Esteban Chaves jumped into the </span><i><span>maglia rosa </span></i><span>with just one mountain stage remaining</span><span>.</span></p>\n<p><span>However, Nibali carried his momentum into stage 20 and the decisive shark attack was inflicted with 12km left on the Colle della Lombarda. The move catapulted Nibali from almost five minutes down into pink within two days to claim his second Giro d’Italia title. A battle-bruised Kruijswijk could only finish fourth.</span></p>\n<h4><span><b></b></span></h4>\n<h4><b>Giro d’Italia 1984 - Francesco Moser / Laurent Fignon</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/unnamed_1024x1024.jpg?v=1622295150\" /></b></p>\n<p><span>This was one of the most controversial editions of the Giro d’Italia. The race was marked with allegations that race organisers were working to ensure that home rider Francesco Moser would win ahead of Laurent Fignon.</span></p>\n<p><span>Before the race, Moser had never managed to win his home Grand Tour despite finishing second on multiple occasions and gaining a plethora of stage wins. Although Moser led into the final few stages in the Alps, Fignon, the reigning Tour de France champ, would make his push for pink. The Frenchman's first moment of misfortune came when Fignon attacked on the Selva di Val Gardena. The Frenchman attacked and opened up an advantage before suffering a mechanical.</span><span> His Renault team car wasn’t allowed to follow Fignon up the road after he had gapped Moser, and Fignon was forced to wait for assistance.</span></p>\n<p><span>The next day, the organisers removed the planned Passo dello Stelvio from the stage, citing potential snowfall and dangerous conditions. Some reported that the Stelvio </span><span>was clear of snow and safe to pass. Nonetheless, another opportunity for Fignon was wiped away.</span></p>\n<p><span>The pinnacle of alleged skulduggery came on the final stage time-trial to Verona where Moser sealed victory. Not only was this the third solo stage against the clock in the race, TV helicopters were accused of deliberately placing the chopper's downdraft to favour Moser and hinder Fignon.</span></p>\n<p><span>It would be Moser’s first and only Grand Tour triumph, whilst Fignon would return to the Giro in ‘89 where he’d eventually conquer the Tour of Italy. </span></p>\n<p><em>Cover image: Tim de Waele/Corbis via Getty Images</em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"02dcdafd3fc16ba97c24dbec93212b9dd1dffd1245aa47b7ebb801bb1043de19","category":"Cycling"}