{"title":"Aerial Video Surveys and Spatial Prioritization Reveal Conservation Opportunities for Endangered Dugongs in New Caledonia","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4237?af=R","date":1724310000000,"content":"<h2>ABSTRACT</h2>\n<p>\n\nThe dugong population of New Caledonia was recently assessed as endangered by the IUCN due to its low genetic diversity, its limited number of mature individuals and the continuing threats from poaching, collisions, incidental capture and seagrass degradation. No-take marine protected areas (MPAs) implemented in critical dugong habitats may efficiently safeguard the remaining population by directly or indirectly reducing these threats.\n\nThe goal of the present study was to develop scenarios of MPAs targeting dugongs in New Caledonia, focusing on the central west coast where they are known to aggregate during austral winter.\n\nWe combined 7 h of video surveys from a light airplane and habitat modelling to derive regional predictions of dugong density. We then used these predictions to (1) assess the proportion of dugong population abundance protected by existing no-take MPAs and (2) develop spatial prioritization scenarios based on explicit dugong abundance targets.\n\nWe found that existing no-take MPAs only protect 11% of the estimated dugong population in the study region, leaving most dugong hotspots unprotected. For the same protected area coverage, prioritization based on abundance would allow protecting nearly five times more dugong individuals.\n\nGiven the endangered status of the population, a 70% abundance prioritization scenario is warranted, requiring the expansion of existing MPAs toward reef passes and shallow nearshore areas where dugong abundance is the highest. Our study offers an opportunity for dynamic spatial management through the implementation of a seasonal closure strictly restricting human activities in areas where dugongs aggregate in winter.\n</p>","author":"Laura Mannocci, \nSolène Derville, \nRaphael Seguin, \nDavid Mouillot","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"030ef1357d4b18848ed120cbdb1de65a4aeff556bad79b9a37c73a770a9735de","category":"Environment"}