{"title":"Cruis’n Blast review: ’90s arcade racing, supercharged for the modern era","link":"https://arstechnica.com/?p=1794047","date":1631635235000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Cruisn-Blast-Screenshot-4-980x551.jpg\" /></div>\n        <p>\n          Flipping past a technicolor dinosaur in a shiny, blue sports car: that's the <em>Cruis'n Blast</em> lifestyle at work.                      [credit:\n                        <a href=\"https://rawthrills.com/\">Raw Thrills / Nintendo</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p><em>Cruis'n Blast</em>'s placement on my list of favorite video games of 2021 should not be taken as a universal recommendation. As a painstakingly authentic refresh of the dated <em>Cruis'n</em> arcade-racing series, it's a simple game, and in many ways, it lags behind other arcade racers that have come and gone in the past few years.</p>\n<p>Still, if you're looking for sheer, unadulterated, all-ages racing fun, especially on the underpowered Nintendo Switch, you should set your GPS coordinates to the bonkers racetracks and <em>Burnout</em>-leaning smashy-smash of <em>Cruis'n Blast</em> as soon as possible.</p>\n<h2><em>Cruis’n</em> through history: A primer</h2>\n<p><em>Cruis'n</em> emerged in the '90s as one of the only major Western racing series in arcades, years after Sega and Namco unleashed their own dazzling 3D racers. This Midway series didn't really compete with the likes of <a href=\"https://arstechnica.com/gaming/2016/11/daytona-usa-cruisn-racing-series-are-coming-back-as-arcade-first-sequels/\"><em>Daytona USA</em></a> or <em>Ridge Racer</em>, as it was marked by wimpy tech and simple mechanics. Instead, 1994's <em>Cruis'n USA</em> kept things loud and silly in a shameless, drive-straight-ahead manner. The result was, depending on where you lived, a pizza parlor mainstay—and one that rode Nintendo's coattails, since it was emblazoned with \"Nintendo Ultra 64\" logos before that console launched with a different name.</p></div><p><a href=\"https://arstechnica.com/?p=1794047#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1794047&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"030e71be8ac6dd91d298fb06a4ceb0d6b2dfd6820979b81ecc8bb368d99bfc46","category":"Tech"}