{"title":"More than 20,000 people died on US roads in the first half of 2021","link":"https://arstechnica.com/?p=1809320","date":1635792251000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-168264633-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-168264633.jpg\">Enlarge</a> <span>/</span> Anecdotally, I have never seen as much lawless driving as I have in the past year. (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The United States registered its greatest-ever six-month rise in traffic deaths for the first half of 2021. The National Highway Traffic Safety Administration <a href=\"https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/813199\">has just published its early estimate</a> for the months of January-June for this year, and the numbers are grim reading. During the first half of the year, 20,160 people died on US roads, an increase of 18.4 percent compared to the same six months of (<a href=\"https://arstechnica.com/cars/2021/03/traffic-deaths-rose-8-percent-in-2020-despite-fewer-miles-travelled/\">an already very deadly</a>) 2020.</p>\n<p>As we've noted previously, Americans started driving more riskily during 2020 than ever. Although the pandemic resulted in a decrease in the total number of vehicle miles traveled in 2020, the total number of deaths actually increased.</p>\n<p>The mass availability of highly effective vaccines and nationwide loosening of public health restrictions saw a big rise in vehicle miles traveled for the first half of 2021—an increase of 173.1 billion miles (278.6 billion km) versus the same six months of 2020.</p></div><p><a href=\"https://arstechnica.com/?p=1809320#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1809320&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0310304abc8c240e72cb59020a8e49bcdc252be8a132fd8ad00185e4a97aefcb","category":"Tech"}