{"title":"EFF Flew a Banner Over Apple Park During Last Apple Event to Protest CSAM Plans","link":"https://www.macrumors.com/2021/09/24/eff-apple-park-banner-csam-detection-protests/","date":1632474407000,"content":"In protest of the company's now delayed CSAM detection plans, the EFF, which <a href=\"https://www.macrumors.com/2021/08/06/snowden-eff-slam-plan-to-scan-messages-images/\">has been vocal</a> about Apple's child safety features plans in the past, flew a banner over <a href=\"https://www.macrumors.com/guide/apple-park/\">Apple Park</a> during the <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> event earlier this month with a message for the Cupertino tech giant.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/eff-apple-park-plane-1.jpg\" />\r\n<br />\r\nDuring Apple's fully-digital \"California streaming\" event on September 14, which included no physical audience attendance in Cupertino in favor of pre-recorded segments live-streamed, the EFF decided to fly a plane over ‌Apple Park‌ with the message \"Apple: Don't scan our phones! EFF.ORG/APPLE.\"\r\n<br />\r\n\r\n<br />\r\nThe EFF says it opted to use this form of \"aerial advertising\" to make sure that Apple's CSAM plans don't \"fade into the background\" and that Apple \"hears\" them. The EFF also flew the same banner over 1 Infinite Loop, Apple's previous headquarters that it largely vacated four years ago.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/eff-apple-park-3-min.jpg\" />\r\n<br />\r\nApple announced in August its plans to use on-device machine learning and its custom-built \"NeuralHash\" system <a href=\"https://www.macrumors.com/2021/08/05/apple-new-child-safety-features/\">to detect images of known CSAM images</a> on <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users' photo libraries. Following its announcement, privacy advocates and groups, including the EFF, were vocal about its potential privacy risks.\r\n<br />\r\n\r\n<br />\r\nUnlike Google and others who scan for CSAM, or child sexual abuse material, in the cloud, Apple's system instead uses on-device processing to identify CSAM images. The EFF is, however, unsatisfied and has <a href=\"https://www.macrumors.com/2021/09/06/eff-urges-apple-abandon-csam-plans/\">previously called</a> on Apple to abandon its plans entirely.\r\n<br />\r\n\r\n<br />\r\nOn September 3, Apple announced it would be <a href=\"https://www.macrumors.com/2021/09/03/apple-delaying-rollout-of-child-safety-features/\">delaying CSAM detection</a>, which was meant to roll out later this fall, to \"collect input and make improvements before releasing these critically important child safety features.\" The EFF, in a <a href=\"https://www.eff.org/deeplinks/2021/09/why-eff-flew-plane-over-apples-headquarters\">blog post</a>, says it will independently be holding events with \"various groups\" to collect research and suggestions, some of which it says could be helpful to the tech giant amid the delay. \r\n<br />\r\n<blockquote>Now that Apple's September event is over, Apple must reach out to groups that have criticized it and seek a wider range of suggestions on how to deal with difficult problems, like protecting children online. EFF, for its part, will be holding an event with various groups that work in this space to share research and concerns that Apple and other tech companies should find useful. </blockquote>Apple's child safety feature plans, besides CSAM detection, includes enhanced protection of children from unsolicited images. To learn more about Apple's plans, read up on <a href=\"https://www.macrumors.com/2021/08/05/apple-new-child-safety-features/\">our guide</a>.<div>Tags: <a href=\"https://www.macrumors.com/guide/apple-privacy/\">Apple privacy</a>, <a href=\"https://www.macrumors.com/guide/eff/\">EFF</a>, <a href=\"https://www.macrumors.com/guide/apple-child-safety-features/\">Apple child safety features</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/24/eff-apple-park-banner-csam-detection-protests/\">EFF Flew a Banner Over Apple Park During Last Apple Event to Protest CSAM Plans</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/eff-flew-a-banner-over-apple-park-during-last-apple-event-to-protest-csam-plans.2313041/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=3nOYvYhjZ3E:EwrE2hD2rGM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=3nOYvYhjZ3E:EwrE2hD2rGM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/3nOYvYhjZ3E\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"03125f1234cb5f462169e42aa515e24daf4b985958a17146b202e01da247496a","category":"Apple"}