{"title":"แพตช์รายเดือน Windows มีบั๊กอีกแล้ว ไมโครซอฟท์ปิดแพตช์ด้วยวิธีใหม่ Known Issue Rollback","link":"https://www.blognone.com/node/122350","date":1619412243000,"content":"<div><div><div><p>ข่าวแพตช์ประจำเดือนของ Windows มีปัญหาคงกลายเป็นเรื่องปกติไปแล้ว สิ่งที่น่าสนใจในแพตช์รอบเดือนเมษายน 2021 คือไมโครซอฟท์แก้ปัญหาด้วยวิธีใหม่ที่เรียกว่า <a href=\"https://techcommunity.microsoft.com/t5/windows-it-pro-blog/known-issue-rollback-helping-you-keep-windows-devices-protected/ba-p/2176831\">Known Issue Rollback (KIR)</a></p>\n<p>ท่าปกติของการแก้ปัญหาพบบั๊กในแพตช์คือ ถอนการติดตั้งแพตช์นั้นๆ แต่วิธี KIR ถูกเริ่มนำมาใช้แบบเงียบๆ ตั้งแต่ Windows 10 v2004 ที่ออกปีที่แล้ว โดยจะใช้กับแพตช์แก้บั๊กที่ไม่เกี่ยวกับความปลอดภัย (non-security bug fix) เท่านั้น</p>\n<p>หลักการทำงานของ KIR ค่อนข้างตรงไปตรงมาคือ ในการแก้บั๊กใดๆ ผ่านแพตช์ประจำเดือน ไมโครซอฟท์จะเก็บโค้ดเดิมเอาไว้ด้วยเสมอ แล้วเพิ่มโค้ดใหม่เข้ามาโดยไม่ยุ่งเกี่ยวกัน (ตัวอย่างโค้ดตามภาพ ใช้ if else แยกส่วนมาเลย)</p>\n<p>KIR เป็นฟีเจอร์ที่ระดับ OS เอาไว้กำหนดว่าควรใช้โค้ดเก่าหรือโค้ดใหม่ ตามปกติแล้ว หลังติดตั้งแพตช์ใดๆ จะเปิดใช้โค้ดใหม่เป็นค่าดีฟอลต์ แต่หากโค้ดใหม่เกิดบั๊กใหม่ขึ้นมา ไมโครซอฟท์จะสั่งให้ KIR จะปิดการทำงานของโค้ดใหม่และกลับไปใช้โค้ดเก่าชั่วคราว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1b38d1a2195a86c80ea020111a40715d.png\" /></p>\n<p>ไมโครซอฟท์บอกว่าเริ่มใช้ KIR แบบเงียบๆ มาตั้งแต่ปลายปี 2019 และเริ่มใช้เต็มตัวใน Windows 10 v2004 ที่รองรับ KIR เต็มรูปแบบ</p>\n<p>ล่าสุดในแพตช์รอบเดือนเมษายน 2021 มีแพตช์ชื่อ KB5000842/KB5001330 ที่ส่งผลกระทบต่อเฟรมเรตขณะเล่นเกม หลังผู้ใช้แจ้งปัญหากันมาได้หลายวัน ไมโครซอฟท์ก็รับทราบปัญหา และแจ้งปิดการทำงานของแพตช์นี้ชั่วคราวด้วยเทคนิค KIR หลังจากแก้บั๊กนี้อย่างถาวรแล้ว ในอนาคตจะอัพเดตผ่านช่องทางแพตช์ตามปกติต่อไป</p>\n<p>ไมโครซอฟท์แจ้งว่ากระบวนการทำงานของ KIR อาจใช้เวลา 24 ชั่วโมงกว่าจะไปครบทุกเครื่อง ถ้าอยากให้เร็วขึ้น การรีสตาร์ตเครื่องอาจช่วยได้</p>\n<p>ที่มา - <a href=\"https://docs.microsoft.com/en-us/windows/release-health/status-windows-10-20h2#1594msgdesc\">Microsoft</a>, <a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-pushes-emergency-fix-for-windows-10-kb5001330-gaming-issues/\">Bleeping Computer</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/windows-10\">Windows 10</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/bug\">Bug</a></div><div><a href=\"/topics/operating-system\">Operating System</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0322b9b375de9edf584ef7f31b7e39fb1ccb4065045948bee831edfc4b9878bc","category":"Thai"}