{"title":"Cable lobby and Republicans fight proposed ban on early termination fees","link":"https://arstechnica.com/?p=1991147","date":1702576630000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/getty-cable-tv-remote-800x533.jpg\" alt=\"A hand pointing a TV remote control toward a television in a dark background.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/getty-cable-tv-remote-scaled.jpg\">Enlarge</a> (credit: Getty Images | RoyalFive)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Federal Communications Commission has taken a step toward prohibiting early termination fees charged by cable and satellite TV providers. If given final approval, the FCC action would also require cable and satellite providers to provide a prorated credit or rebate to customers who cancel before a billing period ends.</p>\n<p>The new rules are being floated in a Notice of Proposed Rulemaking (NPRM) that the FCC <a href=\"https://www.fcc.gov/document/fcc-acts-against-video-service-junk-fees\">voted to approve</a> yesterday in a 3–2 vote, with both Republicans dissenting. The NPRM seeks public comment on the proposed rules and could lead to a final vote in a few months or so.</p>\n<p>\"Today's action proposes to adopt customer service protections that prohibit cable operators and DBS (Direct Broadcast Satellite) providers from imposing a fee for the early termination of a cable or DBS video service contract,\" the FCC said. \"Additionally, the NPRM recommends the adoption of customer service protections to require cable and DBS providers to grant subscribers a prorated credit or rebate for the remaining whole days in a monthly or periodic billing cycle after the subscriber cancels service.\"</p></div><p><a href=\"https://arstechnica.com/?p=1991147#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1991147&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"03262ca8f17edcc0f4f95b878eccdf4f762bc1c9fa6922276e19036998519ce3","category":"Tech"}