{"title":"PSX-6 Genome-wide association study on hippocampal biomarkers of cumulative affective experience in chicken layers","link":"https://academic.oup.com/jas/article/102/Supplement_3/455/7757708?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Recurring stress, which can be termed a negative cumulative affective experience has numerous detrimental phenotypic impacts on poultry welfare. Consequently, this negative experience could lead to reduced productivity. Biomarkers that serve as indicators of cumulative affective experience have been found through the density of highly plastic neurons in the hippocampus. There is limited published research on biomarkers of cumulative affective experience in poultry. Therefore, identifying genomic regions associated with the biomarkers of poultry susceptible or resistant to the negative affective experience could aid in creating more efficient and sustainable farming practices. For this study, H&amp;N and Hy-Line Brown hens (n = 42) housed in a multi-tier free range and enriched cage system, respectively, were available. All hens were genotyped with a proprietary 200K SNP panel and phenotypic data were collected from brain tissue sections stained using an antibody to doublecortin (DCX), which was used to quantify densities of highly plastic neurons in the hippocampus. A genome-wide association study (GWAS) was used to detect genomic regions associated with biomarkers of cumulative affective experience in poultry. The GWAS results found a total of 19 regions from 8 chromosomes with a comparatively high proportion of genetic variance explained, which is associated with the cumulative affective experience. From these regions, 39 different genes were found to be within 100 kb upstream and downstream of the identified regions. These genes were examined for their biological function and role in the cumulative affective experience. The identified genes are associated with cellular processes and genetic information processing. Of the genes, PIKR6, VPS37D, STX1A, BAZ1B, HGH1, MAF, MAPK15, PIT54 were identified as important candidate genes for the cumulative affective experience. Notably, the identified gene, PIK3R6, overlapped with previously reported genes for the stress response in chickens. These identified genes with association to the hippocampal neural density serve as potential candidate genes underlying the cumulative affective experience in poultry. This study shows that genomic regions associated with cumulative affective experience can be detected and help to provide insight into the genetic architecture of the trait.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0329bd1b992f46cdc96f5939de0a8542893068f69bf0e54fa82bcc5d061da54f","category":"Environment"}