{"title":"Our health care system may soon receive a much-needed cybersecurity boost","link":"https://arstechnica.com/?p=1961745","date":1692360016000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1307656509-800x489.jpg\" alt=\"Back view of a nurse, checking on patients from monitors.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1307656509-scaled.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/back-view-of-a-nurse-checking-on-patients-from-royalty-free-image/1307656509\">Lorenzo Capunata/Getty</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Advanced Research Projects Agency for Health (Arpa-H), a research support agency within the United States Department of Health and Human Services, said today that it is launching an initiative to find and help fund the development of cybersecurity technologies that can specifically improve defenses for digital infrastructure in US health care. Dubbed the Digital Health Security project, also known as Digiheals, the effort will allow researchers and technologists to submit proposals beginning today through September 7 for cybersecurity tools geared specifically to health care systems, hospitals and clinics, and health-related devices.</p>\n<p>For more than a decade, health care providers in the United States and around the world have been <a href=\"https://www.wired.com/story/universal-health-services-ransomware-attack/\">plagued</a> by criminal cyberattacks, particularly <a href=\"https://www.wired.com/2016/03/ransomware-why-hospitals-are-the-perfect-targets/\">ransomware attacks</a>, that take advantage of medical facilities’ high-stakes work to attempt to extort big payouts. Efforts in recent years to <a href=\"https://www.wired.com/story/ransomware-task-force-proposal/\">crack down on and deter</a> cybercriminal actors have made some limited progress, but health care attacks still <a href=\"https://www.wired.com/story/ransomware-tactics-cancer-photos-student-records/\">occur regularly</a>, disrupting vital services and endangering patients. </p><div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/wired-logo.png\" /></div>\n<p>Health and Human Service’s research agency Arpa-H doesn’t specifically focus on cybersecurity innovation. The agency has programs running, for example, to spur advances in osteoarthritis treatment and medical imaging for cancer removal. But Digiheals program manager and longtime security researcher Andrew Carney says there is a dire need to make progress on digital defense tools for health care that are both effective and usable for medical facilities in practice.</p></div><p><a href=\"https://arstechnica.com/?p=1961745#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1961745&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"032ab434aa17c6f877b00d6390b60a112d595e67d40dcc711e908237d955721d","category":"Tech"}