{"title":"What's inside Issue 122 of Rouleur?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/whats-inside-issue-122-of-rouleur","date":1694790003000,"content":"\n      <p><span>\n<strong><i>Rouleur 122: the Travel Edition,</i> is available now. To subscribe go to <a href=\"https://ujcgdqg5gufc8gy4-4052516910.shopifypreview.com/blogs/the-rouleur-journal/www.rouleur.cc/subscribe\">www.rouleur.cc/subscribe</a></strong></span></p>\n<p><span>Every bike ride is a journey, both literal and emotional, and in the latest edition of </span><i><span>Rouleur</span></i><span>, our </span><i><span>Travel Edition</span></i><span>, we have asked what it really means to explore and travel by bike. We know as cyclists that the journey is as important as the destination, and is sometimes even the point. But that’s not to say that the destination is not important – we learn a lot by exploring new places, and travelling teaches us about the world. We travel, they say, to find ourselves. However, we can also discover some amazing places en route.</span></p>\n<p><span>For </span><i><span>Rouleur 122: the Travel Edition</span></i><span>, the opening feature is </span><i><span>The Road, </span></i><span>by Richard Abraham, with pictures by Jered and Ashley Gruber. Richard’s pitch for </span><i><span>The Road</span></i><span> was an unusual one: the destination is secret, though if you read between the lines, maybe you can work out where to look for it. Much like the beach that featured in Alex Garland’s turn-of-the-century backpacking novel </span><i><span>The Beach</span></i><span>, The Road is a shared secret among those who like to explore the best cycling routes. It’s not the highest road, nor the steepest, nor the most epic, but it does have a character all of its own, and it is atmospheric and scenic. Best of all, it’s rarely used by cars, and to Richard’s mind, offers the very best kind of riding experience. We’re not going to tell you where it is, but part of the point is to understand that The Road symbolises all our favourite roads. The perfect riding experience doesn’t have to be a bucket-list destination like L’Alpe d’Huez or the Col du Tourmalet, it can sometimes be found in the most surprising places.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/122_-_closeups_-_by_Alessandra_Bucci-8523.jpg?v=1694788160\" alt />Of course, travel is about the people we meet as well as the places we go, and our at-home feature with Alison Jackson, the Paris-Roubaix champion, ticks both boxes. Canadian journalist Curtis Gillespie, in his first feature for <i>Rouleur</i>, went to visit the irrepressible Jackson at the farm she grew up on, and along with Cooper &amp; O’Hara photography, came up with <i>Alison Jackson Has Outdoor Energy</i>. The Jackson farm is close to the Alberta/Saskatchewan border in rural western Canada, and to say that it is an unusual background for a professional cyclist is to understate the case. Canada’s three prairie provinces are approximately 15 times the size of England, and are home to a population of approximately a million people, and it’s no surprise to find out that Jackson’s journey from deepest Canada to the Paris-Roubaix podium has been a convoluted one. But what really shines through in Curtis’s feature is Jackson’s raw energy and joie de vivre. Read this feature, and then <a href=\"https://www.rouleur.cc/pages/rouleur-live\">buy a ticket to </a><a href=\"https://www.rouleur.cc/pages/rouleur-live\"><i>Rouleur Live</i>, where Jackson will be making an appearance.</a></span></p>\n<p><span>We often associate cycling travel features with big landscapes and mountain scenery. The most epic cycling tours head up into the mountains, where cyclists can commune with nature and enjoy the view. However, Tom Owen and Matt Grayson came up with a bike tour with a difference for their feature </span><i><span>Nothing Beside Remains</span></i><span>. Tom and Matt went bikepacking around Sardinia. So far, so normal, because Sardinia is a beautiful place – a Mediterranean island with forested mountains, lovely seascapes and nice weather. However, Tom and Matt were on an urbex (urban exploration) tour, and visited a series of atmospheric and eerie abandoned places – a huge crumbling satellite dish, a long-dead holiday resort and a disused chairlift among others. Travel is about culture, as well as nature, though in the case of some of the buildings Tom and Matt explored, nature is taking back over.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/122_-_closeups_-_by_Alessandra_Bucci-8565.jpg?v=1694788220\" alt />Also in <i>Rouleur 122: the Travel Edition: </i>the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> visits the obscure town of Moulins, lost in La France Profonde; we cycle up <i>from </i>the top of the Col du Tourmalet to the Pic du Midi du Bigorre and ask if the Tour de France could one day follow the same route; Chris Marshall-Bell interviews Ethiopian rider Negasi Haylu Abreha; Amy Sedghi goes gravel riding in Sri Lanka for a week of sensory overload, heat, humidity and wild animals; Rachel Jary goes to Finland to take part in F1 driver Valtteri Bottas’s new event FNLD GRVL; James Startt visits Flanders, Roubaix and Lombardia winner Andrea Tafi at his agriturismo in Tuscany; we go to Iten in Kenya, more famous for producing the world’s fastest distance runners, to follow the Team Amani project; Art Cycle celebrates the career of professional cyclist and artist Maurice de Vlaminck; plus Technogym, Vittoria, Pico Aneto with Jack Ultracyclist, the Amalfi Coast, a long Tour stage to Peyragudes, Costa Brava, Heidi Franz, Orla, Ned and much, much more.</span></p>\n<p><strong><i>Rouleur 122: the Travel Edition,</i> is available now. To subscribe go to <a href=\"www.rouleur.cc/subscribe\">www.rouleur.cc/subscribe</a></strong></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"032cb9ef403329b9b8e9c390b097501d544b22767eb6dbc545ab8124a4797746","category":"Cycling"}