{"title":"Identification of Key Drivers for Performance Measurement in Sustainable Humanitarian Relief Logistics: An Integrated Fuzzy Delphi-DEMATEL Approach","link":"https://www.preprints.org/manuscript/202403.1453/v1","date":1711368923000,"content":"Sustainable Humanitarian logistics is gaining attention due to increased disasters. It involves various operations to support people's survival efforts. Key characteristics include unpredictable demand, sudden large demand volumes, high stakes in delivery timeliness, and limited resources. However, the complexity and unpredictability of disaster scenarios necessitate robust and adaptable performance measurement models to evaluate the effectiveness of sustainable humanitarian relief logistics (SHRL). This study proposes a novel performance measurement model for sustainable humanitarian logistics and supply chains that integrates the Fuzzy Delphi Method (FDM) and Fuzzy Decision-Making Trial and Evaluation Laboratory (Fuzzy-DEMATEL) method. In this research, using 115 articles focused on sustainable humanitarian logistics and supply chains, crisis management, and humanitarian aid, this research identified 25 key performance indicators (KPIs) in the initial phase. Following the implementation of FDM, 19 KPIs were identified as crucial for further analysis. These KPIs were then divided into four distinct categories: \"Quality,\" \"Accountability,\" \"Operational Excellence,\" and \"Sustainability\". Initially, FDM is utilized to reach a consensus among experts concerning KPIs for humanitarian logistics and supply chains. By incorporating the inherent uncertainty and vagueness in expert judgments, FDM refines the list of key performance indicators that reflect the real-life conditions and constraints in disaster operations. Finally, the fuzzy DEMATEL approach was used to analyze interrelationships among factors, identifying cause-and-effect behavior and ranking them, forming a robust theoretical framework. The study concludes with the development of a comprehensive performance measurement model that facilitates the strategic planning and operational assessment of humanitarian organization operations. The integration of FDM and fuzzy DEMATEL methods offers multiple perspectives for decision-making and helps stakeholders identify critical areas for improvement. Based on the acquired results, the KPIs attached to the Quality (P1) aspect of the proposed framework have gained significant importance and main cause in the cause-and-effect relationship which impacts and is helpful to improve the performance of humanitarian organizations in all phases of disaster management. The KPIs prompt delivery (D1), and delivery accuracy (D2) are more significant, while capacity building and training (D19) and delivery compliance (D15) are least significant in SHRL scenarios. This research is expected to support humanitarian organizations in enhancing their capabilities, thereby improving the effectiveness and efficiency of aid delivery in disaster-stricken areas.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0339b69ba1e1a7fa010d6f1b1d9e08ea7dc8d8a08aa337ab26811c485ad941b8","category":"Interdisciplinary"}