{"title":"Adobe and Microsoft break some old files by removing PostScript font support","link":"https://arstechnica.com/?p=1961210","date":1692214495000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/apple-mac-laserwriter-800x539.jpeg\" alt=\"An Apple Macintosh Plus along with an original LaserWriter, the printer that helped popularize PostScript Type 1 fonts.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/apple-mac-laserwriter.jpeg\">Enlarge</a> <span>/</span> An Apple Macintosh Plus along with an original LaserWriter, the printer that helped popularize PostScript Type 1 fonts. (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>If you want to know about the history of desktop publishing, you need to know about Adobe's PostScript fonts. PostScript fonts used vector graphics so that they could look crisp and clear no matter what size they were, and Apple licensed PostScript fonts for the original LaserWriter printer; together with publishing software like Aldus PageMaker, they made it possible to create a file that would look exactly the same on your computer screen as it did when you printed it.</p>\n<p>The most important PostScript fonts were so-called \"Type 1\" fonts, which Adobe initially didn't publish a specification for. From the 1980s up until roughly the early 2000s or so, if you were working in desktop publishing professionally, you were probably using Type 1 fonts.</p>\n<p>Other companies didn't want Adobe to have a monopoly on vector-based fonts or desktop publishing, of course; Apple created the TrueType format in the early 90s and licensed it to Microsoft, which used it in Windows 3.1 and later versions. Adobe and Microsoft later collaborated on a new font format called OpenType that could replace both TrueType and PostScript Type 1, and <a href=\"https://www.prepressure.com/fonts/basics/history\">by the mid-2000s</a>, it had been released as an open standard and had become the predominant font format used across most operating systems and software.</p></div><p><a href=\"https://arstechnica.com/?p=1961210#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1961210&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"033d471bddf60d4db57c401fa2d9c8377e1283cf2bc2f139f68dea23720d7991","category":"Tech"}