{"title":"Using the Family Planning Estimation Tool (FPET) to assess national-level family planning trends and future projections for contraceptive prevalence and associated demand for HIV-infected women in sub-Saharan Africa","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002637","date":1722952800000,"content":"<p>by Preshit Nemdas Ambade, Julia Hajjar, Nicholas Kofi Adjei, Sanni Yaya</p>\r\n\r\nThe combination of low uptake of modern contraceptives, high rates of unintended pregnancies, and the pervasive HIV epidemic in Sub-Saharan Africa (SSA) poses a threat to maternal, newborn, and child health in the region. This study examined the prevalence, need, and demand satisfied by modern contraceptive methods for women who tested positive for HIV (both unmarried and married) in 10 countries in SSA. We used the Family Planning Estimation Tool (FPET) to generate national-level trends and projections from 1983 through 2030. Individual-level data from 30 DHS surveys conducted between 2004 and 2018 in 10 sub-Saharan Africa (SSA) countries were used to produce projections for 1) all women and 2) unmarried and married women who tested positive for HIV. Throughout the period, Ethiopian and Guinean women who tested positive for HIV had a higher %mCPR (utilization of modern family planning methods) vis-à-vis all women. Among women who tested positive for HIV, the highest percentage of family planning demand satisfied by modern methods was observed in Zimbabwe (85.27, CI: 76.32−91.69), Lesotho (82.75, CI: 71.80−89.86), Rwanda (80.17, CI: 70.01−87.62), Malawi (73.11, CI: 61.50−82.63), and Zambia (72.63, CI: 64.49−80.09). The highest unmet need for modern contraceptives was found in Senegal (25.38, CI:18.36−33.72), followed by Cameroon (23.59, CI:19.30−28.59) and Sierra Leone (23.16, CI:16.64−32.05). Zimbabwe had the lowest unmet need (10.61, CI:6.36−16.13) and achieved the highest change in %mCPR (49.28, SE:6.80). Among married women who tested positive for HIV, their unmet need for modern contraception will remain higher in 2030. Continuing existing policies until 2030 would result in significant coverage gain among married vis-à-vis unmarried women who tested positive for HIV. Our projections emphasize the importance of country-specific strengthening initiatives, programs, and services targeting unmarried women.","author":"Preshit Nemdas Ambade","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"034b1675dfceb50db3b8e2b98b84c291750a7465b71be8198afbcd2ef73bb92e","category":"Environment"}