{"title":"The Ferrari Portofino M, reviewed","link":"https://arstechnica.com/?p=1765505","date":1621596641000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Ferrari-Portofino-M-4-800x600.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Ferrari-Portofino-M-4.jpg\">Enlarge</a> <span>/</span> You might associate the Florida Keys with Crimson Jihad, but this red is actually called Rosso Portofino.  (credit: Elle Cayabyab Gitlin)</p>  </figure><div><a name=\"page-1\"></a></div>\n<aside>Ferrari provided flights to Miami and two nights in a hotel on Key Largo so we could drive this European-spec Portofino M. Ars does not accept paid editorial content.</aside><p>A couple of years ago, <a href=\"https://arstechnica.com/cars/2019/08/the-ferrari-portofino-maranello-made-this-one-handle-like-a-miata/\">Ars got to spend a rather enjoyable morning</a> with a Ferrari Portofino on a very deserted, very twisty California road. It was revelatory, demonstrating that this entry-level Ferrari—sometimes unfairly maligned because it has back seats and a retractable hardtop—was capable of delivering the goods in terms of driver engagement. That's good; you'd hope that even Ferrari's most affordable road car would be fun to drive.</p>\n<p>Now there's an uprated version, called the Portofino M (for <em>Modificata</em>). This gets a small bump in power and a brand-new eight-speed dual clutch transmission. There's now a more permissive race mode, too, and that retunes the onboard electronic systems that both flatter and protect the driver. But the Portofino is also supposed to be one of Ferrari's most versatile vehicles, thanks to those (admittedly rudimentary) back seats and folding hard top. And so the Portofino M—base price $226,000—gains some extra convenience features, including a suite of advanced driver assistance systems and the option to have ventilated seats.</p>\n<p>I concluded my 2019 Portofino review praising its handling on that sinuous ribbon of asphalt, but I left my time with the car none the wiser with regard to its ability at more mundane tasks. After all, this is the closest thing Ferrari builds to a daily driver. And evidently, this practicality was on Ferrari's mind again when it organized the first US drive of the Portofino M. There were no winding mountain roads this time, nor a race track upon which to really push the <em>Modificata</em> to the <em>limite</em>.</p></div><p><a href=\"https://arstechnica.com/?p=1765505#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1765505&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"034d2000e86ab0714ce011b4d5bf39798f25c7229a59bd40f5ef1c475b9a9a9e","category":"Tech"}