{"title":"Colorado Catholic Group Bought App Data That Tracked Gay Priests","link":"https://www.washingtonpost.com/dc-md-va/2023/03/09/catholics-gay-priests-grindr-data-bishops/","date":1678922891000,"content":"\n<p>Michelle Boorstein and Heather Kelly, reporting for The Washington Post:</p>\n\n<blockquote>\n  <p>A group of conservative Colorado Catholics has spent millions of\ndollars to buy mobile app tracking data that identified priests\nwho used gay dating and hookup apps and then shared it with\nbishops around the country. [...]</p>\n\n<p>One report prepared for bishops says the group’s sources are data\nbrokers who got the information from ad exchanges, which are sites\nwhere ads are bought and sold in real time, like a stock market.\nThe group cross-referenced location data from the apps and other\ndetails with locations of church residences, workplaces and\nseminaries to find clergy who were allegedly active on the apps,\naccording to one of the reports and also the audiotape of the\ngroup’s president.</p>\n\n<p>Sherman said police departments have bought data about citizens\ninstead of seeking a warrant, domestic abusers have accessed data\nabout their victims, and antiabortion activists have used data to\ntarget people who visit clinics.</p>\n\n<p>But Bennett Cyphers, a special adviser to the Electronic Frontier\nFoundation, a digital rights organization, said the Burrill story\nwas the first time he had heard of a private group buying\ncommercial data and using it against a specific individual.</p>\n</blockquote>\n\n<p>Makes me wonder how often this technique is being used to blackmail people. This group was targeting gay priests to out them; they could have just as easily blackmailed them.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/15/catholic-group-gay-priest-location-data\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"034ef4cc8ce0fecd9b6080355e79780357e6f48e4780019bba80b38061e83676","category":"Tech"}