{"title":"Increasing Optimum Temperature of Vegetation Activity Over the Past Four Decades","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004489?af=R","date":1727965460000,"content":"<h2>Abstract</h2>\n<p>Over the past four decades, global temperatures have increased more rapidly than before, potentially reducing vegetation activity if temperatures exceed the optimum temperature (T<sub>opt</sub>). However, plants have the capacity to acclimate to rising temperatures by adjusting T<sub>opt</sub>, thereby maintaining or even enhancing photosynthesis and carbon uptake. Despite this, it remains unclear how T<sub>opt</sub> of vegetation activity changes over time and to what extent global vegetation can acclimate to current temperature changes. In this study, we evaluated the temporal trends of T<sub>opt</sub> of vegetation activity and the thermal acclimation magnitudes globally using three remote-sensed vegetation indices and eddy-covariance observations of gross primary productivity from 1982 to 2020. We found that the global T<sub>opt</sub> of vegetation activity has increased at an average rate of 0.63°C per decade over the past four decades. The increase in T<sub>opt</sub> closely tracked the rise in annual maximum daily mean temperature (T<sub>max</sub>), indicating that thermal acclimation has occurred widely across the globe. Globally, we found an average thermal acclimation magnitude of 0.38°C per 1°C increase in T<sub>max</sub>. Notably, polar and continental regions exhibited the highest thermal acclimation magnitudes, while arid areas showed the lowest. Additionally, the thermal acclimation magnitude was positively affected by interannual temperature variability and negatively affected by soil moisture and vapor pressure deficits. Our findings indicate that terrestrial ecosystems have acclimated to current climate warming trends with varying degrees, suggesting a greater potential for land carbon uptake. Moreover, these results highlight the necessity for earth system models to integrate the thermal acclimation of T<sub>opt</sub> to better forecast the global carbon cycle.</p>","author":"Yiheng Wang, \nSangeeta Sarmah, \nMrinal Singha, \nWeinan Chen, \nYong Ge, \nLiyin L. Liang, \nSantonu Goswami, \nShuli Niu","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"034fd944deec49483fc17f7f2e4740c5c42987ad2e6242cc73fa74e240104aca","category":"Environment"}