{"title":"Quintessential Cav: Mark Cavendish bows out of the Giro d'Italia at his very best","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/quintessential-cav-mark-cavendish-bows-out-of-the-giro-ditalia-at-his-very-best","date":1685303518000,"content":"\n      <p>There was only ever one man who could take the attention away from Primož Roglič on the day he banished his demons, redeemed himself forever and became the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> champion on the beautiful, historic streets of Rome. That man, of course, was Mark Cavendish.</p>\n<div></div>\n<p>For 20 stages the Briton has battled through this Giro d’Italia, riding in torrential rain, crashing over the line, and stunning the world by announcing his impending retirement on the second rest day. Cycling was crying out for the romantic finish, desperate for Cavendish to win yet again at a Grand Tour, to take his 17th Giro d’Italia stage victory, and to ensure that he would continue his 100% record of winning in each of the seven times he has ridden the Corsa Rosa. </p>\n<p>There had been six chances before, six cases of no luck. There was the crash, there was being caught behind one tumble, there was poor positioning, there was a third-place and then there was illness. It looked like it would never come. </p>\n<p>Many don’t like processional stages like stage 21 was, but what they do provide is a testimonial-like ending to a gruelling three weeks, a chance to celebrate the winners, to feat one another on a lap around an entire country. In Rome on Sunday it seemed that the entire peloton were hellbent on giving Cavendish his fairytale ending to his Giro story.</p>\n<p>Into the final four kilometres and Ineos Grenadiers took up the reins at the front of the peloton. They had no sprinter to back in the fight, but Cavendish was a former employee, a longtime friend of Geraint Thomas. As the metres ticked by, as the Colosseum came into view, Thomas - 24 hours on from his devastating dethroning atop Monte Lussari - took up position at the front of the peloton to guide Cavendish towards the line. It was like Paris 2012 all over again, with Thomas emulating Bradley Wiggins.</p>\n<p>As the kilometre to go sign morphed into 500m and then 400m, Groupama-FDJ's Jake Stewart - 14 years Cavendish’s junior and a rider who grew up idolising the Manx man - fired himself to the front. Was he sprinting himself? Or was he trying to lead out Cavendish? It was unclear.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_SWpix_Giro_2978.jpg?v=1685303387\" alt /></p>\n<p>What was clear, however, was that Cavendish was lightening quick, demolishing the field in the grandest of settings, crossing the line in disbelief and happiness, hand smacked over his mouth, and the loudest, deafening and emotive roar he’s perhaps ever let out. The greatest sprinter of all time had, remarkably, won yet another stage. And it was Vintage Cav.</p>\n<p>The whole peloton found him, congratulated him, and shared in his delight. He planted a kiss on the cheek of Thomas. “Gotta help a brother out,” the Welshman laughed. It was not Cavendish’s final swansong - that will be the Tour where he’ll have one last go at number 35 - but rarely have we seen Cavendish as happy, as relieved and as ecstatic as this. And the whole of cycling rejoiced along with him.</p>\n<p>Win number 162. Mark Cavendish: The fastest man there ever has been on a bicycle, and the greatest sprinter there ever will be.<br /><br /></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0351fe2e68d0478822fdf65ee505775a77923614e03092cedbc043f1a74bc9f2","category":"Cycling"}