{"title":"A battle from beginning to end - the 2023 Volta a Catalunya in review","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-battle-from-beginning-to-end-the-2023-volta-a-catalunya-in-review","date":1679913681000,"content":"\n      \n<p>The 2023 Volta a Catalunya was expected to be all about two men: Primož Roglič (Jumbo-Visma) and Remco Evenepoel (Soudal - Quick-Step). The former had just made an electrifying return to racing at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico\">Tirreno-Adriatico</a>, where he won three stages and the general classification despite not having raced at all since September, while Evenepoel was in similarly touchless form at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uae-tour-everything-you-need-to-know\">UAE Tour</a>, winning by a margin of almost one minute. </p>\n<div></div>\n<h3>Evenepoel versus Roglič lives up to the billing</h3>\n<p><span>Comparisons are often made between Tadej Pogačar (UAE Team Emirates) and the ‘cannibal’ Eddy Merckx for the way the Slovenian races to win every race he competes in, but these two riders are also exhibiting insatiable appetites. Right from the very first day in Catalunya they were racing full on, turning a gentle uphill sprint that’s usually the reserve of puncheurs into the first GC showdown of the race. While the likes of Ethan Hayter (Ineos Grenadiers), Bryan Coquard (Cofidis) had been expected to sprint for the win, and had used their team-mates during the day to control the pace, instead it was Roglič and Evenepoel who were the quickest in the sprint, with Roglič narrowly coming out on top to strike the first blow.</span></p>\n<p><span>Both riders inevitably rode away again on stage two’s mountain top finish at Valter 2000, although this time they were interrupted by a gate-crasher in Giulio Ciccone (Trek-Segafredo), who surprisingly nabbed them both on the line. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1475078350.jpg?v=1679909101\" alt=\"Primoz Roglic, Giulio Ciccone and Remco Evenepoel sprinting to the finish line on stage two of the  Volta Ciclista a Catalunya\" />Had the pair found a new rival? It turned out not, as on stage four’s La Molina summit finish they again rode away. On this occasion it was Evenepoel who had the quicker sprint to take the stage win, and drew level on GC with the exact same time: an apt situation considering just how evenly matched the two riders were.</span></p>\n<h3><span>A matter of experience</span></h3>\n<p><span>Ultimately, it was arguably a difference in experience that proved to be the difference between the two. The 33-year-old and the 23-year-old once again raced away from the opposition on the brutally steep Lo Port summit finish at the end of stage five, and they were together to contest the sprint at the top. But this time the younger man made a fatal misjudgement, going too deep too early in his sprint and collapsing to a virtual standstill, losing a whole six seconds, plus the bonifications, in a mere matter of metres. </span></p>\n<p><span>Evenepoel attacked relentlessly in the final two stages in an effort to get that time back, but despite managing to win the final stage ahead of Roglič, those seconds lost proved to be decisive. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1249270214.jpg?v=1679909329\" alt=\"Primoz Roglic ahead of Remco Evenepoel on stage 5 of the Volta Ciclista a Catalunya\" />Evenepoel is not used to finishing as a runner-up. In fact, he's only ever once finished second in a stage race throughout his career (the 2022 Volta a la Comunitat Valenciana, behind Aleksandr Vlasov), compared with 12 overall victories. In Roglič he has at last met his match, and can perhaps learn a few tricks from just how calm the Slovenian remained throughout the whole race. Roglič was so blasé that he didn’t even celebrate his two stage wins, in marked contrast to Evenepoel’s exuberant finish line salutes. If Evenepoel had remained similarly calm at the top of Lo Port, perhaps he would have been triumphant instead? There’s no way of knowing, but the stage is beautifully set for a rematch at the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> in May.</span></p>\n<h3><span>UAE Team Emirates dysfunction</span></h3>\n<p><span>Aside from Ciccone’s surprise victory on stage two, the only other rider to challenge Roglič and Evenepoel on any of the mountains was João Almeida, who dug deep to keep clawing his way back to the pair on the Lo Port stage five summit finish. And whereas Ciccone succumbed to a familiar problem of inconsistency to eventually slide down to seventh overall, Almeida managed to finish third overall, adding a second WorldTour podium finish to the second-place overall he managed behind Roglič at Tirreno-Adriatico. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1476612861.jpg?v=1679909687\" alt=\"João Almeida racing \" />Bizarrely, the biggest threat to his podium finish turned out to be his own team-mate, Marc Soler. Despite doing a good job pacing him towards the top of Lo Port, Soler (who had moved up to fourth overall) spent the next two stages attacking, seemingly trying to out Almeida from his podium spot. Almeida even took it upon himself to chase down Soler towards the end of stage seven, in embarrassing scenes for the UAE Emirates team. </span></p>\n<p><span>The incident brought back memories of Soler’s time at Movistar where such intra-team rivalry was common-place, and the team’s management couldn't have been happy at how things panned out, even if they did finish with third and fourth overall. Without Tadej Pogačar to bring a sense of authority, it seems UAE Team Emirates can lack some internal cohesion among their many other talented GC men. They’ll need to sort that out ahead of the Giro d’Italia if Almeida is going to have a chance of making the podium. </span></p>\n<h3><span>Landa's vain attempts </span></h3>\n<p><span>Although Roglič and Evenepoel were a cut above everyone else, Mikel Landa bravely had a go at putting pressure on them, having his Bahrain-Victorious team-mates set the pace on the first summit finish on stage two. It proved to be unsuccessful, as Landa wasn’t able to drop them with his attack, and ended up instead losing a handful of seconds to them, and then a few more the following day at La Molina.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1475085140.jpg?v=1679909762\" alt=\"Mikel Landa and Primoz Roglic \" />Landa receives an undue amount of flack, and was the object of some ridicule for his effort on Valter 2000, especially after his sidelong peer to the camera caught the attention of social media. But he deserves credit for his willingness to take on the race rather than just following wheels, and his ultimate finishing position of fifth overall was more than respectable. </span></p>\n<h3><span>Ineos struggle</span></h3>\n<p><span>It was a far worse week for Ineos Grenadiers, who saw their GC hopes unravel right from the start. First the on-form Luke Plapp was announced as a non-starter, then Geraint Thomas lost time in a crash on the very first stage, then Thomas and Egan Bernal were both dropped out of GC on stage two’s summit finish.</span></p>\n<p><span>It’s clear Bernal still has a long way to go before he’s recovered from his lengthy absence from racing, while Thomas has a lot of catching up to do ahead of the Giro d’Italia in May. For a team that filled all spots on the podium at this race just two years ago, this was further evidence that Ineos Grenadiers are no longer the force they once were. </span></p>\n<h3>Groves the pick of the sprinters</h3>\n<p>On the few days that weren’t dominated by Roglič and Evenepoel, Kaden Groves (Alpine-Deceuninck) capitalised, winning bunch sprints on both stages four and six.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1476220512.jpg?v=1679909826\" alt=\"Kaden Groves winning bunch sprint\" />The tough parcours meant this year’s race was short of many sprinters, with Groves being one of the few to brave all the climbing in the hope of winning the easier stages. And he was rewarded for his efforts with two stage wins, both times defeating Bryan Coquard into second place.</p>\n<p><span>It had been a slow start to the season for the Australian, after he failed to get into the mix of the sprints at Paris-Nice and the Tour Down Under. But by winning these two stages, he’s confirmed the talent he first showed by winning a stage at last year’s edition, and looks set to be a feature at the Giro d’Italia bunch sprints in May. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"03649cc645ab327039637280d64436a9cd4aa76629020128501d2927373bdf7b","category":"Cycling"}