{"title":"Macroinvertebrate and environmental responses to dredging and submerged macrophytes transplantation","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14620?af=R","date":1710137708000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/9b1e1b9e-863a-4a9b-ab86-a1d4e5712b60/jpe14620-toc-0001-m.png\" alt=\"Macroinvertebrate and environmental responses to dredging and submerged macrophytes transplantation\" />\n<p>Our study provides an long-term field monitoring with new findings about the benefits and caution of submerged macrophytes transplantation post-dredging and the effect of partial restoration, which could inform eutrophic waterbody restoration schemes.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nEutrophication of freshwater ecosystems is a global problem, but restoration can be difficult due to ongoing problems relating to water pollution, sedimentary nutrient stores and altered aquatic biodiversity. Mitigation of Eutrophication is often conducted alongside transplantation of submerged macrophytes and dredging, but knowledge of ecosystem response to post-dredging transplantation of submerged macrophytes is limited.\n\nWe report a long-term (2008–2018) in situ monitoring study to evaluate the effects of different restoration measures: dredging only (Dredged) and dredged with post-transplantation of submerged macrophytes (Dredged with macrophytes) conducted in five subtropical eutrophic lakes, Taihu basin. Water and sediment nutrients, bloom-forming algae <i>Microcystis</i> and macroinvertebrate were monitored every 2 years for each treatment and compared with reference areas (Control) established in unrestored parts of the same lake.\n\nDredging only decreased sediment nutrients (e.g. carbon, phosphorus) significantly; however, this effect diminished about 5 years later. Dredged with macrophytes had a stronger, longer lasting positive effect on water quality than dredged alone. Disturbance caused by dredging (without macrophytes transplantation) decreased the biomass of <i>Microcystis</i>, while transplantation of macrophytes shortly after dredging did not contribute to the decreasing of <i>Microcystis</i> biomass. The biomass of <i>Microcystis</i> in Dredged with macrophytes areas was always similar to Control over the period of our monitoring.\n\nA positive effect of submerged macrophytes transplantation post-dredging was found for macroinvertebrate abundance and diversity: Dredged with macrophytes areas had significantly higher macroinvertebrate biomass and richness than Dredged areas after 9 years' recovery. Macroinvertebrate richness in Dredged with macrophytes areas nearly doubled compared to Control, while Dredged areas were just restored to Control levels.\n\n<i>Synthesis and applications</i>: Our study provides an long-term field monitoring with new findings about the benefits and caution of submerged macrophytes transplantation post-dredging and the effect of partial restoration, which could inform eutrophic waterbody restoration schemes.\n</p>","author":"Hong Fu, \nJun Xu, \nJorge García Molinos, \nHuan Zhang, \nHuan Wang, \nMin Zhang, \nMegan Klaar, \nLee E. Brown","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"036761f69067e6bb375285b92a66d0b54c6469db1e01e9c2b0143d81f1c6d59d","category":"Environment"}