{"title":"This isn’t what George Bennett had planned for the Giro’s first GC day","link":"https://cyclingtips.com/2021/05/this-isnt-how-george-bennett-drew-up-the-giros-first-gc-day/","date":1620775860000,"content":"<p>George Bennett (Jumbo-Visma) predicted that stage 4 of the Giro d’Italia would be a tough one. “There’ll be big gaps today, with the weather, with the downhills, with how hard the last climb is,” he said before the Giro’s first real GC stage. “I think we’re really going to see a big fight.”</p>\n\n\n\n<p>What he didn’t predict was that he himself would have a big fight on his hands, to avoid dropping out of the GC battle entirely.</p>\n\n\n\n<p>On a cold and rain-soaked day in the Emilia-Romagna region of northern Italy, Bennett stayed protected in the bunch as a large breakaway got up the road to fight for stage honours. But on the day’s final climb, the punishingly steep Colle Passerino, Bennett fell apart.</p>\n\n\n\n<p>Suffering in the cold and the rain, the Kiwi champion lost contact with the group of GC favourites when Mikel Landa (Bahrain Victorious) kicked off a series of attacks with a few kilometres to go.</p>\n\n\n\n<p>“It definitely was not a good day,” Jumbo-Visma sports director Addy Engels <a href=\"https://www.teamjumbovisma.com/race-report/news/bennett-loses-time-in-fourth-stage-giro-ditalia/\" target=\"_blank\">said</a> afterwards. “It didn’t go as we had hoped and expected. The circumstances were difficult because of the bad weather. George was affected by the cold in the end. Some people digest it better than others, but that is no excuse. We know about George that he can’t take the cold well.”</p>\n\n\n\n<p>While Joe Dombrowski (UAE-Team Emirates) was <a href=\"https://cyclingtips.com/2021/05/joe-dombrowski-and-the-long-long-wait/\" target=\"_blank\">winning the stage solo from the breakaway</a>, and several of the GC favourites were trying to gap their rivals, Bennett was battling hard to limit his losses. His young teammate Tobias Foss, second overall at the time, would put in a crucial supporting ride for his 31-year-old leader.</p>\n\n\n\n<p>In the end Bennett crossed the line 3:06 down on Dombrowski but, crucially, roughly 90 seconds down on his GC rivals. He’s now about the same margin behind on GC, in 34th place, with Aleksandr Vlasov (Astana-Premier Tech), Remco Evenepoel (Deceuninck-QuickStep) and Hugh Carthy (EF Education-Nippo) the best-placed of the overall contenders.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/CORVOS_00033112-084-1340x951.jpeg\" /><figcaption>Foss leading Bennett up the Colle Passerino on stage 4 of the 2021 Giro d’Italia.</figcaption></figure>\n\n\n\n<p>It’s an unfortunate early blow for the affable Kiwi who came into the Giro with a rare opportunity to ride for his own GC result. So often employed in the service of others in the Grand Tours, Bennett had entertained hopes of reaching the top five overall.</p>\n\n\n\n<p>“I would like to see how far I can reach in the general classification; that’s what I want to focus on”, Bennett said via the Jumbo-Visma website before the race began. “There is a strong field of participants at the start. I think there are two or three absolute favourites for the overall victory. Shortly afterwards, a list of outsiders with perhaps 10 to 15 names follows. I put myself in between.</p>\n\n\n\n<p>“You want to be at the front end of that list of names so something realistic is the top five,” he <a href=\"https://www.cyclingnews.com/features/george-bennett-all-im-thinking-about-is-the-giro-ditalia-gc/\" target=\"_blank\">told Cyclingnews</a>. “That’s a great result but you can’t put too much on it because it’s such an unknown.”</p>\n\n\n\n<p>What we now know is Bennett is on the back foot in that quest for a high GC finish. Reaching the top five is less likely than it was before stage 4. But that’s not to say it can’t happen.</p>\n\n\n\n<p>On his day Bennett is among the sport’s best climbers. If his battle on stage 4 was simply down to the weather conditions, then there’s no reason he can’t bounce back, possibly as soon as the <a href=\"https://cyclingtips.com/2021/05/preview-your-stage-by-stage-breakdown-of-the-2021-giro-ditalia-course/\" target=\"_blank\">next uphill finish, on stage 6</a>. There’s certainly no reason why he can’t add to his top-10 overall finish at the Giro back in 2018.</p>\n\n\n\n<p>After all, Bennett wasn’t nearly the <a href=\"https://cyclingtips.com/2021/05/the-gc-winners-and-losers-of-the-giros-first-mountain-stage/\" target=\"_blank\">worst off of the GC contenders</a> on stage 4. Joao Almeida, the man who wore pink for 15 days last year, and who ostensibly started the Giro as <a href=\"https://cyclingtips.com/2021/05/preview-your-guide-to-the-2021-giro-ditalia-contenders-sprinters-and-more/\" target=\"_blank\">Deceuninck-QuickStep’s outright leader</a>, dropped more than four minutes to his GC rivals.</p>\n\n\n\n<p>Meanwhile, Bennett’s sports director Addy Engels is remaining positive.</p>\n\n\n\n<p>“In the end he loses a minute and a half on the first GC guys and with the help of Tobias he has limited his time loss,” he said. “On such a climb that is a lot, but on the other hand we have also just started. A lot can still happen in three weeks, as we have seen in the past. There is no reason to change tactics yet.”</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/this-isnt-how-george-bennett-drew-up-the-giros-first-gc-day/\">This isn’t what George Bennett had planned for the Giro’s first GC day</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"036948157df0945d779827ca88464bb6b050a689e1b23c0e13a9a6dcdc3d04a7","category":"Cycling"}