{"title":"MacRumors Giveaway: Win an Apple Watch Fitness Award Prize Pack From Activity Awards","link":"https://www.macrumors.com/2021/04/16/macrumors-giveaway-activity-awards/","date":1618596098000,"content":"For this week's <a href=\"https://www.macrumors.com/guide/giveaway/\">giveaway</a>, we've teamed up with <a href=\"https://activityawards.com\">Activity Awards</a>, a fun company that creates magnets designed to look like the awards that you receive for reaching Apple Watch fitness goals.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/activity-awards-1.jpg\" />\r\n<br />\r\nPriced <a href=\"https://activityawards.com\">from $8.99 to $12.99</a>, each magnet is modeled after a different award, with a wide range of options available. There are awards for meeting goals like the seven-day move, exercise, and stand requirements along with awards for special activity challenges like the heart and yoga events Apple has offered.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/activity-awards-2.jpg\" />\r\n<br />\r\nThere are awards for meeting new records and collections that include all the perfect week awards and awards to mark each monthly challenge in 2021. All of the awards are true to the design of Apple's awards made available in the Fitness app, and there's no mistaking them.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/activity-awards-3.jpg\" />\r\n<br />\r\nEach magnet is made in the style of an enamel pin with bright colors and high-quality finishes, and we were impressed with them when we <a href=\"https://www.macrumors.com/review/activity-awards-magnets/\">reviewed them last year</a>. You can stick them to any magnetic surface.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/activity-awards-6.jpg\" />\r\n<br />\r\nThere are many people who have been inspired to work out and get fit because of the Apple Watch, and Activity Awards are an ideal self reward if you've been working hard because they serve as a physical representation of a fitness achievement to remind you what you've accomplished.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/activity-awards-4.jpg\" />\r\n<br />\r\nActivity Awards also have the potential to make a great gift for someone who has put a lot of effort into working out with the Apple Watch. Many of the designs are also eye-catching and look great stuck on the refrigerator.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/activity-awards-5.jpg\" />\r\n<br />\r\nWe have seven Activity Awards prize packages to give out to <em>MacRumors</em> readers. Two winners will get to pick any six awards, two winners will get to pick any five awards, and two winners will get to pick out four awards. One grand prize winner will receive a monthly subscription that includes all 12 Perfect Month Awards and all 12 Monthly Challenge Awards for 2021, shipped out throughout the year.\r\n<br />\r\n\r\n<br />\r\nTo enter to win, use the Gleam.io widget below and enter an email address. Email addresses will be used solely for contact purposes to reach the winners and send the prizes. You can earn additional entries by subscribing to our <a href=\"https://my.leadpages.net/leadbox/145ef7173f72a2%3A104a9fa76b46dc/5754903989321728/\">weekly newsletter</a>, subscribing to our <a href=\"https://www.youtube.com/user/macrumors\">YouTube channel</a>, following us on <a href=\"https://twitter.com/macrumors\">Twitter</a>, following us on <a href=\"https://www.instagram.com/macrumors/\">Instagram</a>, or visiting the <em>MacRumors</em> <a href=\"https://www.facebook.com/MacRumors\">Facebook page</a>.\r\n<br />\r\n\r\n<br />\r\nDue to the complexities of international laws regarding giveaways, only <strong>U.S. residents who are 18 years or older and Canadian residents (excluding Quebec) who have reached the age of majority in their province or territory are eligible to enter</strong>. To offer feedback or get more information on the ‌giveaway‌ restrictions, please refer to <a href=\"http://forums.macrumors.com/threads/macrumors-giveaways-why-are-they-only-open-to-u-s-residents.1918337/\">our Site Feedback section</a>, as that is where discussion of the rules will be redirected.\r\n<br />\r\n\r\n<br />\r\n<div><a href=\"https://gleam.io/GcLD2/activity-awards-giveaway\">Activity Awards Giveaway</a>\r\n<br />\r\n</div>The contest will run from today (April 16) at 11:00 a.m. Pacific Time through 11:00 a.m. Pacific Time on April 23. The winners will be chosen randomly on April 23 and will be contacted by email. The winners will have 48 hours to respond and provide a shipping address before new winners are chosen.<div>Tag: <a href=\"https://www.macrumors.com/guide/giveaway/\">giveaway</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/16/macrumors-giveaway-activity-awards/\">MacRumors Giveaway: Win an Apple Watch Fitness Award Prize Pack From Activity Awards</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/macrumors-giveaway-win-an-apple-watch-fitness-award-prize-pack-from-activity-awards.2291935/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=2kaYl5IUtDI:xsN_wO9rppQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=2kaYl5IUtDI:xsN_wO9rppQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/2kaYl5IUtDI\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0373fdcfaea2bf91385bbfd6140077018e60c9b69632be4f0b1285e453af159e","category":"Apple"}