{"title":"เอกสารฟ้องเผยกูเกิลเสนอแบ่งกำไรให้ซัมซุง ป้องกัน Galaxy Store มาแข่งกับตัวเอง","link":"https://www.blognone.com/node/123641","date":1625822416000,"content":"<div><div><div><p>จากประเด็น<a href=\"https://www.blognone.com/node/123613\">อัยการกว่า 30 รัฐในสหรัฐฯ ฟ้องกูเกิลเรื่องผูกขาดร้านค้าแอป</a> ซึ่งพุ่งเป้าที่การเก็บค่าคอมมิชชั่น 30% แต่ในเอกสารส่งฟ้องยังมีรายละเอียดเพิ่มระบุว่า กูเกิลพยายามกีดกันร้านค้าแอปคู่แข่งโดยเฉพาะ Samsung Galaxy Store เพื่อให้ตัวเองได้เป็นร้านค้าแอปแห่งเดียวบนอุปกรณ์แอนดรอยด์</p>\n<p>ในเอกสารบอกว่า กูเกิลได้เสนอข้อตกลงแบ่งปันผลกำไรให้นักพัฒนาแอปรายใหญ่เพื่อแลกกับการพัฒนาแอปบนแพลตฟอร์มของตนเท่านั้น สร้างอุปสรรคต่อการไซด์โหลด และยื่นข้อเสนอไปยังซัมซุงเพื่อสร้างความได้เปรียบแก่ตัวเองด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/743f69c1824ef58c36dead87a588cc47.png\" /></p>\n<p>แม้ Galaxy Store จะไม่ได้รับความนิยมเท่า Play Store แต่ก็มีโอกาสที่ซัมซุงจะพัฒนาเป็นคู่แข่งที่แข็งแกร่งได้ อย่างเช่นในปี 2018 ที่ซัมซุงได้ร่วมมือกับ Epic เพื่อเปิดตัว Fortnite บน Galaxy Store</p>\n<p>ในเอกสารบอกด้วยว่า กูเกิลพยายามเสนอเนื้อหาเกม และกิจกรรมพิเศษเฉพาะของซัมซุงบน Google Play Store และบน YouTube และเสนอเงินก้อนเป็นส่วนแบ่งรายได้ แต่ไม่แบ่งเป็นสัดส่วนซึ่งจะกลายเป็นไปเปิดเผยขนาดของ Play Store ให้ซัมซุงได้รู้ ส่วนบริษัทอื่นๆ ที่รับส่วนแบ่งรายได้จากกูเกิลไป ก็ต้องวาง Play Store ไว้บนหน้าจอหลัก ตรวจสอบให้แน่ใจว่าไม่สามารถลบออกได้ และสัญญาว่าจะไม่วางร้านค้าแอปอื่นให้โดดเด่นกว่า</p>\n<p>ด้านกูเกิลออกมาโต้การฟ้องร้องครั้งใหม่ว่าเป็นการเข้าใจบริษัทผิด เพราะบนมือถือแอนดรอยด์มีช่องทางร้านค้าแอปอื่นนอกจาก Play Store ติดตั้งมาด้วย ผู้ใช้งานมือถือยังสามารถดาวน์โหลดแอปหรือร้านค้าแอปอื่นโดยไม่ผ่านช่องทาง Google Play Store ได้ ซึ่งการฟ้องที่บอกว่านักพัฒนาและผู้ใช้งานไม่มีทางเลือกอื่นเลยนั้นจึงเป็นเรื่องที่ผิด</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/17380deb951732f685bccec8267b1cdc.png\" /></p>\n<p>กูเกิลยังยกข้อมูลมาโต้ด้วยว่า ปัจจุบัน นักพัฒนาประมาณ 97% ไม่ได้ขายเนื้อหาดิจิทัลบน Google Play ดังนั้นพวกเขาจึงไม่ต้องเสียค่าบริการ มีเพียงไม่เกิน 0.1% ที่เสียค่าบริการ 30% ในบางธุรกรรม และเป็นนักพัฒนาจากบริษัทใหญ่ มีรายได้มาก และค่าธรรมเนียมของกูเกิลก็เทียบเคียงได้กับเจ้าอื่นอย่าง Samsung Galaxy Store, Amazon Appstore, Microsoft Xbox, Sony PlayStation, Nintendo Switch และ App Store</p>\n<p>ส่วนระบบการเรียกเก็บเงินนั้น จะช่วยปกป้องผู้บริโภคจากการฉ้อโกง และช่วยให้ผู้บริโภคสามารถติดตามการซื้อได้อย่างง่ายดายในที่เดียว</p>\n<p>ที่มา - <a href=\"https://arstechnica.com/tech-policy/2021/07/google-bought-off-samsung-to-limit-app-store-competition-36-states-allege/\">Ars Technica</a>, <a href=\"https://blog.google/outreach-initiatives/public-policy/lawsuit-ignores-choice-android-and-google-play/\">กูเกิล</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/samsung\">Samsung</a></div><div><a href=\"/topics/play-store-0\">Play Store</a></div><div><a href=\"/topics/lawsuit\">Lawsuit</a></div><div><a href=\"/topics/antitrust\">Antitrust</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0375b1431d3e947ad068a8aaff0f17023edd78c6d42d248a42101a512bdc72c6","category":"Thai"}