{"title":"Loss of Surfactant Protein a Alters Perinatal Lung Morphology and Susceptibility to Hyperoxia-Induced Bronchopulmonary Dysplasia","link":"https://www.preprints.org/manuscript/202410.0150/v1","date":1727867044000,"content":"Background-Bronchopulmonary dysplasia (BPD) is a condition of poor alveolar formation that causes chronic breathing impairment in infants born prematurely. Preterm lungs lack surfactant and are vulnerable to oxidative injuries driving the development of BPD. Our recent studies reported that surfactant protein A (SP-A) genetic variants influence susceptibility to neonatal lung disease. SP-A modulates activation of alveolar macrophages and parturition onset in late gestation. We asked whether a lack of SP-A alters alveolarization in a mouse model of hyperoxia-induced BPD. Methods- SP-A-deficient and control newborn mice were exposed to either clinically relevant 60% O2 hyperoxia or normoxia for 5-7 days. Alveolar formation was then assessed by mean linear intercept (MLI) and radial alveolar count (RAC) measurements in lung tissue sections. Results- We report that the combination of SP-A deficiency and hyperoxia reduces alveolar growth compared to WT mice. The morphometric analysis of normoxic SP-A-deficient lungs showed lower RAC compared to controls, indicating reduced alveolar number. In the presence of hyperoxia, MLI was higher in SP-A-deficient lungs compared to controls. Differences were statistically significant for female pups. Spatial proteomic profiling of lung tissue sections showed that hyperoxia caused a 4-fold increase in the DNA damage marker gammaH2Ax in macrophages of SP-A-deficient lungs compared to normoxia. Conclusions- Our short report suggests an important role for SP-A in perinatal lung development and in protecting lung macrophages from oxidant injury. These studies warrant future investigation to discern the temporal interaction of SP-A, gender, oxidant injury, and lung macrophages in perinatal alveolar formation and development of BPD.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"037598ff2010891a14fa43c29845eb9b641783c3553bfd7401d692b09b640d78","category":"Interdisciplinary"}