{"title":"A prognostic model for hepatocellular carcinoma patients based on polyunsaturated fatty acid‐related genes","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24273?af=R","date":1714380281000,"content":"<h2>Abstract</h2>\n<h2>Objective</h2>\n<p>Polyunsaturated fatty acids (PUFAs) have attracted increasing attention for their role in liver cancer development. The objective of this study is to develop a prognosis prediction model for patients with liver cancer based on PUFA-related metabolic gene characteristics.</p>\n<h2>Method</h2>\n<p>Transcriptome data and clinical data were obtained from public databases, while gene sets related to PUFAs were acquired from the gene set enrichment analysis (GSEA) database. Univariate Cox analysis was conducted on the training set, followed by LASSO logistic regression and multivariate Cox analysis on genes with <i>p</i> &lt; .05. Subsequently, the stepwise Akaike information criterion method was employed to construct the model. The high- and low-risk groups were divided based on the median score, and the model's survival prediction ability, diagnostic efficiency, and risk score distribution of clinical features were validated. The above procedures were also validated in the validation set. Immune infiltration levels were evaluated using four algorithms, and the immunotherapeutic potential of different groups was explored. Significant enrichment pathways among different groups were selected based on the GSEA algorithm, and mutation analyses were conducted. Nomogram prognostic models were constructed by incorporating clinical factors and risk scores using univariate and multivariate Cox regression analysis, validated through calibration curves and clinical decision curves. Additionally, sensitivity analysis of drugs was performed to screen potential targeted drugs.</p>\n<h2>Results</h2>\n<p>We constructed a prognostic model comprising eight genes (PLA2G12A, CYP2C8, ABCCI, CD74, CCR7, P2RY4, P2RY6, and YY1). Validation across multiple datasets indicated the model's favorable prognostic prediction ability and diagnostic efficiency, with poorer grading and staging observed in the high-risk group. Variations in mutation status and pathway enrichment were noted among different groups. Incorporating Stage, Grade, T.Stage, and RiskScore into the nomogram prognostic model demonstrated good accuracy and clinical decision benefits. Multiple immune analyses suggested greater benefits from immunotherapy in the low-risk group. We predicted multiple targeted drugs, providing a basis for drug development.</p>\n<h2>Conclusion</h2>\n<p>Our study's multifactorial prognostic model across multiple datasets demonstrates good applicability, offering a reliable tool for personalized therapy. Immunological and mutation-related analyses provide theoretical foundations for further research. Drug predictions offer important insights for future drug development and treatment strategies. Overall, this study provides comprehensive insights into tumor prognosis assessment and personalized treatment planning.</p>","author":"Yun Lin, \nRuihao Li, \nTong Li, \nWenrong Zhao, \nQianling Ye, \nChunyan Dong, \nYong Gao","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"03776f653a8dcec466850130135e9d4b1bcd8319897803b691ea981b8a92dcb2","category":"Environment"}