{"title":"Japan Fair Trade Commission forces Apple to slightly loosen restrictions on ‘reader’ apps","link":"https://www.macworld.com/article/354963/japan-fair-trade-commission-forces-apple-to-slightly-loosen-restrictions-on-reader-apps.html","date":1630543316000,"content":"<div>\n<section><div></div></section><p>Apple has long allowed what it calls “reader” apps (like Netflix, Kindle, Spotify, Audible, or Dropbox) to bill users outside of Apple’s usual in-app purchase method (in which Apple takes 15 to 30 percent of subscription or purchase revenue). However, such apps are forbidden from mentioning that such a thing is possible, and cannot link out from the app to their websites for account management (including subscription renewals or purchases).</p>\n\n\n\n<p>On Wednesday, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/09/japan-fair-trade-commission-closes-app-store-investigation/&amp;xcust=1-1-354963-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple announced</a> that is making a small revision to this policy in order to close an investigation by the Japan Fair Trade Commission (JFTC). Apple’s press release states:</p>\n\n\n\n<blockquote><p>“The update will allow developers of “reader” apps to include an in-app link to their website for users to set up or manage an account. While the agreement was made with the JFTC, Apple will apply this change globally to all reader apps on the store. Reader apps provide previously purchased content or content subscriptions for digital magazines, newspapers, books, audio, music, and video.</p><p>To ensure a safe and seamless user experience, the App Store’s guidelines require developers to sell digital services and subscriptions using Apple’s in-app payment system. Because developers of reader apps do not offer in-app digital goods and services for purchase, Apple agreed with the JFTC to let developers of these apps share a single link to their website to help users set up and manage their account.”</p></blockquote>\n\n\n\n<p>The change will go into effect early in 2022, after an update and review of the guidelines for App Store developers. It’s a relatively small concession: the apps in question will <em>not</em> be able to offer their own in-app billing and payment processing, as apps that provide physical goods and services do (such as Amazon, Uber, or DoorDash). </p>\n\n\n\n<p>It doesn’t sound like the new guidelines will allow the apps to even state that subscriptions or purchases are available on the web. Rather, the apps will be allowed to, “share a single link to their website to help users set up and manage their account,” according to Apple’s release. That account management might include purchasing or renewing subscriptions, but it sounds from Apple’s release as if the single link in the app may not be allowed to say “subscribe for just $9.99 a month” and instead must say something like “Account Management” or “set up your account.” </p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0378c4c2e1cf1285f93d663ad3449c55b5f5b48ff1106fe4e7bbaf88ddd0bc7b","category":"Apple"}