{"title":"Building Complex Forms In Vue","link":"https://smashingmagazine.com/2023/03/building-complex-forms-vue/","date":1678356000000,"content":"<p>More often than not, web engineers always have causes to build out forms, from simple to complex. It is also a familiar pain in the shoe for engineers how fast codebases get incredibly messy and incongruously lengthy when building large and complex forms. Thus begging the question, “How can this be optimized?”.</p>\n<p>Consider a business scenario where we need to build a waitlist that captures the name and email. This scenario only requires two/three input fields, as the case may be, and could be added swiftly with little to no hassle. Now, let us consider a different business scenario where users need to fill out a form with ten input fields in 5 sections. Writing 50 input fields isn’t just a tiring job for the Engineer but also a waste of great technical time. More so, it goes against the infamous “Don’t Repeat Yourself” (DRY) principle.</p>\n<p>In this article, we will focus on learning to use the Vue components, the <code>v-model</code> directive, and the Vue props to build complex forms in Vue.</p>\nThe <code>v-model</code> Directive In Vue\n<p>Vue has several unique HTML attributes called directives, which are prefixed with the <code>v-</code>. These directives perform different functions, from rendering data in the DOM to manipulating data. </p>\n<p>The <code>v-model</code> is one such directive, and it is responsible for two-way data binding between the form input value and the value stored in the <code>data</code> property. The <code>v-model</code> works with any input element, such as the <code>input</code> or the <code>select</code> elements. Under the hood, it combines the inputted input value and the corresponding change event listener like the following:</p>\n<pre><code>&lt;!-- Input element --&gt;\n&lt;input v-model=\"inputValue\" type=\"text\"&gt;\n\n&lt;!-- Select element --&gt;\n&lt;select v-model=\"selectedValue\"&gt;\n  &lt;option value=\"\"&gt;Please select the right option&lt;/option&gt;\n  &lt;option&gt;A&lt;/option&gt;\n  &lt;option&gt;B&lt;/option&gt;\n  &lt;option&gt;C&lt;/option&gt;\n&lt;/select&gt;\n</code></pre>\n\n<p>The <code>input</code> event is used for the <code>&lt;input type= \"text\"&gt;</code> element. Likewise, for the <code>&lt;select&gt; … &lt;/select&gt;</code>, <code>&lt;input type= \"checkbox\"&gt;</code> and <code>&lt;input type= \"radio\"&gt;</code>, the <code>v-model</code> will, in turn, match the values to a <code>change</code> event.</p>\nComponents In Vue\n<p>Reusability is one of the core principles of Software Engineering, emphasizing on using existing software features or assets in a software project for reasons ranging from minimizing development time to saving cost. </p>\n<p>One of the ways we observe reusability in Vue is through the use of components. Vue components are reusable and modular interfaces with their own logic and custom content. Even though they can be nested within each other just as a regular HTML element, they can also work in isolation.</p>\n<p>Vue components can be built in two ways as follows:</p>\n<ul>\n<li>Without the build step,</li>\n<li>With the build step.</li>\n</ul>\n<h3>Without The Build Step</h3>\n<p>Vue components can be created without using the <strong>Vue Command Line Interface (CLI)</strong>. This component creation method defines a JavaScript object in a Vue instance options property. In the code block below, we inlined a JavaScript string that Vue parses on the fly.</p>\n<pre><code>template: `\n  &lt;p&gt; Vue component without the build step &lt;/p&gt;\n  `\n</code></pre>\n\n<h3>With The Build Step</h3>\n<p>Creating components using the build step involves using <a href=\"https://vitejs.dev/\">Vite</a> — a blazingly fast, lightweight build tool. Using the build step to create a Vue component makes a <strong>Single File Component (SFC)</strong>, as it can cater to the file’s logic, content, and styling.</p>\n<pre><code>&lt;template&gt;\n  &lt;p&gt; Vue component with the build step &lt;/p&gt;\n&lt;/template&gt;\n</code></pre>\n\n<p>In the above code, we have the <code>&lt;p&gt;</code> tag within the HTML <code>&lt;template&gt;</code> tag, which gets rendered when we use a build step for the application.</p>\n<h3>Registering Vue Components</h3>\n<p>Creating a Vue component is the first step of reusability and modularity in Vue. Next is the registration and actual usage of the created Vue component.</p>\n<p>Vue components allow the nesting of components within components and, even more, the nesting of components within a global or parent component.</p>\n<p>Let’s consider that we stored the component we created using the build step in a <code>BuildStep.vue</code> file. To make this component available for usage, we will import it into another Vue component or a <code>.vue</code>, such as the root entry file. After importing this component, we can then register the component name in the <code>components</code> option property, thus making the component available as an HTML tag. While this HTML tag will have a custom name, the Vue engine will parse them as valid HTML and render them successfully in the browser.</p>\n<pre><code>&lt;!-- App.vue --&gt;\n&lt;template&gt;\n  &lt;div&gt;\n    &lt;BuildStep /&gt;\n  &lt;/div&gt;\n&lt;/template&gt;\n\n&lt;script&gt;\nimport BuildStep from './BuildStep.vue'\n\nexport default {\n  components: {\n    BuildStep\n  }\n}\n&lt;/script&gt;\n</code></pre>\n\n<p>From the above, we imported the <code>BuildStep.vue</code> component into the <code>App.vue</code> file, registered it in the <code>components</code> option property, and then declared it within our HTML template as <code>&lt;BuildStep /&gt;</code>.</p>\nVue Props\n<p>Vue props, otherwise known as properties, are custom-made attributes used on a component for passing data from the parent component to the child component(s). A case where props can come in handy is when we need a component with different content but a constant visual layout, considering a component can have as many props as possible.</p>\n<p>The Vue prop has a one-way data flow, i.e., from the parent to the child component. Thus, the parent component owns the data, and the child component cannot modify the data. Instead, the child component can emit events that the parent component can record.</p>\n<h3>Props Declaration In Vue</h3>\n<p>Let us consider the code block below:</p>\n<pre><code>&lt;template&gt;\n  &lt;p&gt; Vue component {{ buildType }} the build step&lt;/p&gt;\n&lt;/template&gt;\n\n&lt;script&gt;\nexport default {\n  props: {\n    buildType: {\n      type: String\n    }\n  }\n}\n&lt;/script&gt;\n</code></pre>\n\n<p>We updated the HTML template with the interpolated <code>buildType</code>, which will get executed and replaced with the value of the props that will be passed down from the parent component.</p>\n<p>We also added a <strong>props</strong> tag in the props option property to listen to the props change and update the template accordingly. Within this props option property, we declared the name of the props, which matches what we have in the <code>&lt;template&gt;</code> tag, and also added the <strong>props type</strong>.</p>\n<p>The props type, which can be Strings, Numbers, Arrays, Boolean, or Objects, acts as a rule or check to determine what our component will receive.</p>\n<p>In the example above, we added a type of String; we will get an error if we try to pass in any other kind of value like a Boolean or Object.</p>\n<h3>Passing Props In Vue</h3>\n<p>To wrap this up, we will update the parent file, i.e., the <code>App.vue</code>, and pass the props accordingly.</p>\n<pre><code>&lt;!-- App.vue --&gt;\n&lt;template&gt;\n  &lt;div&gt;\n    &lt;BuildStep buildType=\"with\"/&gt;\n  &lt;/div&gt;\n&lt;/template&gt;\n\n&lt;script&gt;\nimport BuildStep from './BuildStep.vue'\n\nexport default {\n  components: {\n    BuildStep\n  }\n}\n&lt;/script&gt;\n</code></pre>\n\n<p>Now, when the <strong>build step</strong> component gets rendered, we will see something like the following:</p>\n<pre><code>Vue component with the build step\n</code></pre>\n\n<p>With props, we needn’t create a new component from scratch to display whether a component has a build step or not. We can again declare the <code>&lt;BuildStep /&gt;</code> component and add the relevant build type.</p>\n<pre><code>&lt;!-- App..vue --&gt;\n&lt;template&gt;\n  &lt;div&gt;\n    &lt;BuildStep buildType=\"without\"/&gt;\n  &lt;/div&gt;\n&lt;/template&gt;\n</code></pre>\n\n<p>Likewise, just as for the build step, when the component gets rendered, we will have the following view:</p>\n<pre><code>Vue component without the build step\n</code></pre>\n\nEvent Handling In Vue\n<p>Vue has many directives, which include the <code>v-on</code>. The <code>v-on</code> is responsible for listening and handling DOM events to act when triggered. The <code>v-on</code> directive can also be written as the <code>@</code> symbol to reduce verbosity.</p>\n<pre><code>&lt;button @click=\"checkBuildType\"&gt; Check build type &lt;/button&gt;\n</code></pre>\n\n<p>The button tag in the above code block has a click event attached to a <code>checkBuildType</code> method. When this button gets clicked, it facilitates executing a function that checks for the build type of the component.</p>\n<h3>Event Modifiers</h3>\n<p>The <code>v-on</code> directive has several event modifiers that add unique attributes to the <code>v-on</code> event handler. These event modifiers start with a dot and are found right after the event modifier name.</p>\n<div>\n<pre><code>&lt;form @submit.prevent=\"submitData\"&gt;\n ...\n&lt;!-- This enables a form to be submitted while preventing the page from being reloaded. --&gt;\n&lt;/form&gt;\n</code></pre>\n</div>\n\n<h3>Key Modifiers</h3>\n<p>Key modifiers help us listen to keyboard events, such as <code>enter</code>, and <code>page-up</code> on the fly. Key modifiers are bound to the <code>v-on</code> directive like <code>v-on:eventname.keymodifiername</code>, where the <code>eventname</code> could be <code>keyup</code> and the <code>modifiername</code> as <code>enter</code>.</p>\n<pre><code>&lt;input @keyup.enter=\"checkInput\"&gt;\n</code></pre>\n\n<p>The key modifiers also offer flexibility but allow multiple key name chaining.</p>\n<pre><code>&lt;input @keyup.ctrl.enter=\"checkInput\"&gt;\n</code></pre>\n\n<p>Here the key names will listen for both the <code>ctrl</code> and the <code>enter</code> keyboard events before the <code>checkInput</code> method gets called.</p>\nThe <code>v-for</code> Directive\n<p>Just as JavaScript provides for iterating through arrays using loops like the <code>for</code> loop, Vue-js also provides a built-in directive known as the <code>v-for</code> that performs the same function.</p>\n<p>We can write the <code>v-for</code> syntax as <code>item in items</code> where <strong>items</strong> are the array we are iterating over or as <code>items of items</code> to express the similarity with the JavaScript loop syntax.</p>\n<h3>List Rendering</h3>\n<p>Let us consider rendering the types of component build steps on a page.</p>\n<div>\n<pre><code>&lt;template&gt;\n  &lt;div&gt;\n    &lt;ul&gt;\n        &lt;li v-for=\"steps in buildSteps\" :key=\"steps.id\"&gt; {{ steps.step }}&lt;/li&gt;\n      &lt;/ul&gt;\n  &lt;/div&gt;\n&lt;/template&gt;\n\n&lt;script&gt;\nexport default {\n data() {\n   return {\n     buildSteps: [\n      {\n       id: \"step 1\",\n       step:'With the build step',\n      },\n      {\n        id: \"step 2\",\n       step:'Without the build step'\n      }\n    ]\n   }\n }\n}\n&lt;/script&gt;\n</code></pre>\n</div> \n\n<p>In the code block above, the <code>steps</code> array within the <code>data</code> property shows the two types of build steps we have for a component. Within our template, we used the <code>v-for</code> directive to loop through the steps array, the result of which we will render in an unordered list.</p>\n<p>We added an optional <code>key</code> argument representing the index of the item we are currently iterating on. But beyond that, the <code>key</code> accepts a unique identifier that enables us to track each item’s node for proper state management.</p>\n<h3>Using <code>v-for</code> With A Component</h3>\n<p>Just like using the <code>v-for</code> to render lists, we can also use it to generate components. We can add the <code>v-for</code> directive to the component like the following:</p>\n<pre><code>&lt;BuildStep v-for=\"steps in buildSteps\" :key=\"steps.id\"/&gt;\n</code></pre>\n\n<p>The above code block will not do much for rendering or passing the <code>step</code> to the component. Instead, we will need to pass the value of the <code>step</code> as props to the component.</p>\n<div>\n<pre><code>&lt;BuildStep v-for=\"steps in buildSteps\" :key=\"steps.id\" :buildType=\"steps.step\" /&gt;\n</code></pre>\n</div>\n\n<p>We do the above to prevent any tight fixation of the <code>v-for</code> to the component.</p>\n<p>The most important thing to note in the different usage of the <code>v-for</code> is the automation of a long process. We can move from manually listing out 100 items or components to using the <code>v-for</code> directive and have everything rendered out within the split of a second, as the case may be.</p>\n<h3>Building A Complex Registration Form In Vue</h3>\n<p>We will combine everything we have learned about the <code>v-model</code>, Vue components, the Vue props, the <code>v-for</code> directive, and event handling to build a complex form that would help us achieve efficiency, scalability, and time management.</p>\n<p>This form will cater to capturing students’ bio-data, which we will develop to facilitate progressive enhancement as business demands increase.</p>\n<h4>Setting Up The Vue App</h4>\n<p>We will be scaffolding our Vue application using the build step. To do this, we will need to ensure we have the following installed:</p>\n<ul>\n<li><a href=\"https://nodejs.org/en/\">Node.js</a>;</li>\n<li><a href=\"https://docs.npmjs.com/downloading-and-installing-node-js-and-npm\">npm</a> or <a href=\"https://classic.yarnpkg.com/lang/en/docs/install/#windows-stable\">yarn</a>.</li>\n</ul>\n<p>Now we will proceed to create our Vue application by running the command below:</p>\n<pre><code># npm\nnpm init vue@latest vue-complex-form\n</code></pre>\n\n<p>where <code>vue-complex-form</code> is the name of the Vue application.</p>\n<p>After that, we will run the command below at the root of our Vue project:</p>\n<pre><code>npm install\n</code></pre>\n\n<h4>Creating The JSON File To Host The Form Data</h4>\n<p>We aim to create a form where users can fill in their details. While we can manually add all the input fields, we will use a different approach to simplify our codebase. We will achieve this by creating a JSON file called <code>util/bio-data.json</code>. Within each of the JSON objects, we will have the basic info we want each input field to have.</p>\n<pre><code>[\n  {\n    \"id\": 1,\n    \"inputvalue\":\"  \",\n    \"formdata\": \"First Name\",\n    \"type\": \"text\",\n    \"inputdata\": \"firstname\"\n  },\n  {\n    \"id\": 2,\n    \"inputvalue\":\"  \",\n    \"formdata\": \"Last Name\",\n    \"type\": \"text\",\n    \"inputdata\": \"lastname\"\n  },\n]\n</code></pre>\n\n<p>As seen in the code block above, we created an object with some keys already carrying values:</p>\n<ul>\n<li><code>id</code> acts as the primary identifier of the individual object;</li>\n<li><code>inputvalue</code> will cater to the value passed into the <code>v-model</code>;</li>\n<li><code>formdata</code> will handle the input placeholder and the labels name;</li>\n<li><code>type</code> denotes the input type, such as email, number, or text;</li>\n<li><code>inputdata</code> represents the input <strong>id</strong> and <strong>name</strong>.</li>\n</ul>\n<p>These keys’ values will be passed in later to our component as props. We can access the complete JSON data here.</p>\n<h4>Creating The Reusable Component</h4>\n<p>We will create an input component that will get passed the props from the JSON file we created. This input component will get iterated on using a <code>v-for</code> directive to create numerous instances of the input field at a stretch without having to write it all out manually. To do this, we will create a  <code>components/TheInputTemplate.vue</code> file and add the code below:</p>\n<pre><code>&lt;template&gt;\n  &lt;div&gt;\n    &lt;label :for=\"inputData\"&gt;{{ formData }}&lt;/label&gt;\n    &lt;input\n      :value= \"modelValue\"\n      :type= \"type\"\n      :id= \"inputData\"\n      :name= \"inputData\"\n      :placeholder= \"formData\"\n      @input=\"$emit('update:modelValue', $event.target.value)\"\n    &gt;\n  &lt;/div&gt;\n &lt;/template&gt;\n\n&lt;script&gt;\nexport default {\n  name: 'TheInputTemplate',\n  props: {\n    modelValue: {\n      type: String\n    },\n    formData: {\n      type: String\n    },\n    type: {\n      type: String\n    },\n    inputData: {\n      type: String\n    }\n  },\n  emits: ['update:modelValue']\n}\n&lt;/script&gt;\n&lt;style&gt;\nlabel {\n  display: inline-block;\n  margin-bottom: 0.5rem;\n  text-transform: uppercase;\n  color: rgb(61, 59, 59);\n  font-weight: 700;\n  font-size: 0.8rem;\n}\ninput {\n  display: block;\n  width: 90%;\n  padding: 0.5rem;\n  margin: 0 auto 1.5rem auto;\n}\n&lt;/style&gt;\n</code></pre>\n\n<p>In the above code block, we achieved the following:</p>\n<ul>\n<li>We created a component with an input field.</li>\n<li>Within the input field, we matched the values that we will pass in from the JSON file to the respective places of interest in the element.</li>\n<li>We also created props of <code>modelValue</code>, <code>formData</code>, <code>type</code>, and <code>inputData</code> that will be registered on the component when exported. These props will be responsible for taking in data from the parent file and passing it down to the <code>TheInputTemplate.vue</code> component.</li>\n<li>Bound the <code>modelValue</code> prop to the value of the input value.</li>\n<li>Added the <code>update:modelValue</code>, which gets emitted when the <code>input</code> event is triggered.</li>\n</ul>\n<h4>Registering The Input Component</h4>\n<p>We will navigate to our <code>App.vue</code> file and import the <code>TheInputTemplate.vue</code> component from where we can proceed to use it.</p>\n<pre><code>&lt;template&gt;\n  &lt;form class=\"wrapper\"&gt;\n    &lt;TheInputTemplate/&gt;\n  &lt;/form&gt;\n&lt;/template&gt;\n&lt;script&gt;\nimport TheInputTemplate from './components/TheInputTemplate.vue'\nexport default {\n  name: 'App',\n  components: {\n    TheInputTemplate\n  }\n}\n&lt;/script&gt;\n&lt;style&gt;\nhtml, body{\n  background-color: grey;\n  height: 100%;\n  min-height: 100vh;\n}\n.wrapper {\n  background-color: white;\n  width: 50%;\n  border-radius: 3px;\n  padding: 2rem  1.5rem;\n  margin: 2rem auto;\n}\n&lt;/style&gt;\n</code></pre>\n\n<p>Here we imported the <code>TheInputTemplate.vue</code> component into the <code>App.vue</code> file, registered it in the <code>components</code> option property, and then declared it within our HTML template.</p>\n<p>If we run <code>npm run serve</code>, we should have the following view:</p>\n<p><img src=\"https://files.smashing.media/articles/building-complex-forms-vue/1-ui-view.png\" /></p>\n<p>At this point, there is not much to see because we are yet to register the props on the component.</p>\n<h4>Passing Input Data</h4>\n<p>To get the result we are after, we will need to pass the input data and add the props to the component. To do this, we will update our <code>App.vue</code> file:</p>\n<div>\n<pre><code>&lt;template&gt;\n  &lt;div class=\"wrapper\"&gt;\n    &lt;div v-for=\"bioinfo in biodata\" :key=\"bioinfo.id\"&gt;\n      &lt;TheInputTemplate v-model=\"bioinfo.inputvalue\":formData= \"bioinfo.formdata\":type= \"bioinfo.type\":inputData= \"bioinfo.inputdata\"/&gt;\n    &lt;/div&gt;\n  &lt;/div&gt;\n&lt;script&gt;\n//add imports here\nimport biodata from \"../util/bio-data.json\";\nexport default {\n  name: 'App',\n //component goes here\n  data: () =&gt; ({\n    biodata\n  })\n}\n&lt;/script&gt;\n</code></pre>\n</div>\n\n<p>From the code block above, we achieved several things:</p>\n<ul>\n<li>We imported the bio-data JSON file we created into the <code>App.vue</code> file. Then we added the imported variable to the <code>data</code> options of the Vue script.</li>\n<li>Looped through the JSON data, which we instantiated in the data options using the Vue <code>v-for</code> directive.</li>\n<li>Within the <code>TheInputTemplate.vue</code> component we created, we passed in the suitable data to fill the props option.</li>\n</ul>\n<p>At this point, our interface should look like the following:</p>\n<p><img src=\"https://files.smashing.media/articles/building-complex-forms-vue/2-interface-input-fields.png\" /></p>\n<p>To confirm if our application is working as it should, we will open up our Vue DevTools, or install one from <a href=\"https://devtools.vuejs.org/\">https://devtools.vuejs.org</a> if we do not have it in our browser yet.</p>\n<p>When we type in a value in any of the input fields, we can see the value show up in the <code>modelValue</code> within the Vue Devtools dashboard.</p>\n<p><img src=\"https://files.smashing.media/articles/building-complex-forms-vue/3-vue-devtools-dashboard.png\" /></p>\nConclusion\n<p>In this article, we explored some core Vue fundamentals like the <code>v-for</code>, <code>v-model</code>, and so on, which we later sewed together to build a complex form. The main goal of this article is to simplify the process of building complex forms while maintaining readability and reusability and reducing development time.</p>\n<p>If, in any case, there will be a need to extend the form, all the developer would have to do is populate the JSON files with the needed information, and voila, the form is ready. Also, new Engineers can avoid swimming in lengthy lines of code to get an idea of what is going on in the codebase.</p>\n<p><strong>Note</strong>: <em>To explore more about handling events within components to deal with as much complexity as possible, you can check out this article on <a href=\"https://vuejs.org/guide/components/events.html#usage-with-v-model\">using components with v-model</a>.</em></p>\n<h3>Further Reading on Smashing Magazine</h3>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/11/optimizing-vue-app/\">Optimizing A Vue App</a>,” Michelle Barker</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2021/07/three-insights-vuejs-accessibility/\">Three Insights I Gained While Researching Vue.js Accessibility</a>,” Marcus Herrmann</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2021/07/tools-practices-speed-up-vuejs-development-process/\">Tools And Practices To Speed Up The Vue.js Development Process</a>,” Uma Victor</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2023/03/vue-case-study-migrating-headless-cms-system/\">Moving From Vue 1 To Vue 2 To Vue 3: A Case Study Of Migrating A Headless CMS System</a>,” Lisi Linhart</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"f300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"03816a673d60f94170c52c030cdd4b93396603471f79d702864f08","category":"Tech"}