{"title":"90,000 old BMWs too dangerous to drive due to airbag recall, maker says","link":"https://arstechnica.com/?p=1936739","date":1683214546000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/P90236607_highRes_the-bmw-m3-csl-e46-0-800x533.jpg\" alt=\"A BMW E46 M3 from behind\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/P90236607_highRes_the-bmw-m3-csl-e46-0-scaled.jpg\">Enlarge</a> <span>/</span> The E46 BMW 3 Series is highly appreciated by enthusiasts, but there's no excuse to not have replaced the Takata airbag by now. (credit: BMW)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In 2015, the largest automotive recall in US history began, due to faulty airbag inflators manufactured by the automotive supplier Takata. At first, 32 million cars were recalled, but the following year, that number grew to as many as 67 million airbags in 42 million vehicles, with at least 24 people killed due to the defective parts. But quite a few recalled cars have not yet had their airbags replaced, and on Thursday, BMW issued a \"do not drive\" warning to approximately 90,000 owners, telling them to park their vehicles if they have not been fixed.</p>\n<p>The problem is a lack of a desiccant or chemical drying agent that would otherwise prevent the ammonium nitrate propellant from taking on moisture due to long-term exposure to heat and humidity. As the propellant ages and takes on moisture, it can fail to properly inflate the airbag during a crash and may even throw metal shrapnel around the vehicle interior.</p>\n<p>Takata knew from testing as early as 2000 that some of its airbags might not deploy properly, with the first US incident occurring in 2004. In 2009, a driver in Oklahoma was killed when the airbag in a Honda Accord ruptured, and later that year, Honda recalled half a million cars to fix the problem.</p></div><p><a href=\"https://arstechnica.com/?p=1936739#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1936739&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"038819bf03a0ee5af064d8b5567d70642c5007916efbd47bf0ca7da36312b3ed","category":"Tech"}