{"title":"Reply to Comment by W. Knoben and M. Clark on “The Treatment of Uncertainty in Hydrometric Observations: A Probabilistic Description of Streamflow Records”","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036550?af=R","date":1709625600000,"content":"<h2>Abstract</h2>\n<p>In this Reply, we address the concerns of Knoben and Clark (2023, <a target=\"_blank\" href=\"https://doi.org/10.1029/2022WR034294\">https://doi.org/10.1029/2022WR034294</a>) or KC23 that “<i>the assumptions needed to effectively use difference-based variance estimation methods are not always met by hourly streamflow records</i>.” There should be little doubt that the assumptions of our difference-based estimator will sometimes be violated in hourly streamflow records but the results from de Oliveira and Vrugt (2022, <a target=\"_blank\" href=\"https://doi.org/10.1029/2022wr032263\">https://doi.org/10.1029/2022wr032263</a>) and confirmed by the findings in our Reply show that such violations are sporadic enough not to affect much the error variance estimates. Snowmelt as pointed out by KC23 (<a target=\"_blank\" href=\"https://doi.org/10.1029/2022WR034294\">https://doi.org/10.1029/2022WR034294</a>) may not have received sufficient attention in our paper, yet their 365-day record is simply not long enough to demonstrate bias of our discharge error variance estimates (and their dependence on flow level). This would require analysis of a much longer, multi-year, streamflow record of a snowmelt-driven watershed. The snowmelt catchment analyzed in dOV22 (<a target=\"_blank\" href=\"https://doi.org/10.1029/2022wr032263\">https://doi.org/10.1029/2022wr032263</a>) did not demonstrate bias in the discharge error variance estimates. We also provide additional clarification on the interpretation of the variance estimates obtained with the nonparametric estimator, and discuss the main issues in the test case presented in Knoben and Clark (2023, <a target=\"_blank\" href=\"https://doi.org/10.1029/2022WR034294\">https://doi.org/10.1029/2022WR034294</a>)).</p>","author":"Debora Y. de Oliveira, \nJasper A. Vrugt","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"039574b270eab7f5f179a12b2315000a923dabac2dd39aee0e71d30d698438f3","category":"Environment"}