{"title":"Two‐dimensional adaptive Whittaker–Shannon Sinc‐based zooming","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400018?af=R","date":1719379540000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/23f28f3a-ce1c-4360-88a1-34ee382e81e7/appl202400018-gra-0001-m.png\" alt=\"Two-dimensional adaptive Whittaker–Shannon Sinc-based zooming\" /><p>The departing image (384 × 348 pixel matrix) is shown in (a). The pixel-local scaled k-space B*(x,y) ${B}^{* }(x,\\ y)$value is shown in (b), it changes pixel-by-pixel as an adaptive map, and it is plotted in (c). B*(x,y) ${B}^{* }(x,\\ y)\\ $ is calculated by Equation (6) and then filtered with Equation (7). Zoom-out with S $S$ = 1.5 (see (d)), no-zoom with S $S$ = 2.0 (see (e)), and zoom-in with S $S$ = 2.5 (see (f)).\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>In this work, we introduce a novel image zooming methodology that transitions from a nonadaptive Sin-based approach to an adaptive Sinc-based zooming technique. The two techniques base their theoretical foundation on the Whittaker–Shannon interpolation formula and the Nyquist theorem. The evolution into adaptive Sinc-based zoom is accomplished through the use of two novel concepts: (1) the pixel-local scaled k-space and (2) the k-space filtering sigmoidal function. The pixel-local scaled k-space is the standardized and scaled k-space magnitude of the image to zoom. The k-space filtering sigmoidal function scales the pixel-local scaled k-space values into the numerical interval [0, 1]. Using these two novel concepts, the Whittaker–Shannon interpolation formula is elaborated and used to zoom images. Zooming is determined by the shape of the Sinc functions in the Whittaker–Shannon interpolation formula, which, in turn, depends on the combined effect of the pixel-local scaled k-space, the sampling rate, and the k-space filtering sigmoidal function. The primary outcome of this research demonstrates that the Whittaker–Shannon interpolation formula can achieve successful zooms for values of the sampling rate significantly greater than the bandwidth. Conversely, when the sampling rate is much greater than the bandwidth, the nonadaptive technique fails to perform the zoom correctly. The conclusion is that the k-space filtering sigmoidal function is identified as the crucial parameter in the adaptive Sinc-based zoom technique. The implications of this research extend to Sinc-based image zooming applications.</p>","author":"Carlo Ciulla, \nBlerta Shabani, \nFarouk Yahaya","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"039532442afdee5a40dd518ad2224dcecd68603898ecdad7010029b62918bcb5","category":"Environment"}