{"title":"Upgrade your home theater with $120 off the Apple TV 4K and AirPods Max","link":"https://www.macworld.com/article/542774/upgrade-your-home-theater-with-120-off-the-apple-tv-4k-and-airpods-max.html","date":1633711293000,"content":"<div>\n<section><div></div></section><p>If you’re tired of the same old sound in your home theater, you don’t need to get a whole new speaker setup just to upgrade to the latest sound. Thanks to Dolby Atmos spatial audio in tvOS 15, a pair of AirPods Max headphones and an Apple TV 4K will deliver stunning spatial audio. And today, Adorama is slashing $120 off the package: <a href=\"https://www.amazon.com/dp/product/B08PZHYWJS,B08PZJN7BD,B08PZD76NP,B08PZJ8FZ8?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">$100 off the AirPods Max</a> and $20 off the new Apple TV 4K with Siri Remote.</p>\n\n\n\n<p>Even at $100 off, the <a href=\"https://www.macworld.com/article/234986/airpods-max-review.html\">AirPods Max headphones</a> aren’t cheap, but they offer incredible sound and superb noise-canceling. Spatial audio support is perfect for the Apple TV 4K, which finally arrived in tvOS 15. Now you can watch movies as if you had a thousand-dollar Dolby Atmos speaker setup no matter where you sit. As you turn your head the sound automatically reorients itself to keep the sound in front. It’s a stunning trick that you need to hear to believe.</p>\n\n\n\n<p>The newest <a href=\"https://www.macworld.com/article/347379/apple-tv-4k-review-2.html\">Apple TV 4K</a> wasn’t a huge upgrade over the previous model, but it has a faster processor and a big improvement in one key area: the remote. The new Siri Remote has a nicer design and better functionality that makes navigating with it much easier. And the Apple TV brings the same excellent interface and streaming quality.</p>\n\n\n\n<p>You can buy both items separately, of course, but we think they make an excellent pair. So treat your ears to some incredible audio and your eyes to beautiful 4K before the price shoots back up.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"039afd2e6e467723f7a28446a8c99ce2caad8116324d4ffce088d6a9b391c57c","category":"Apple"}