{"title":"A new lithostratigraphic scheme of the Ordovician Jeongseon Formation of the Yongtan Group in the Taebaeksan Basin and sequence stratigraphic analysis with discussion on basin geometry","link":"http://link.springer.com/10.1007/s12303-024-0005-5","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Lithostratigraphy of the Yongtan Group is newly established based on detailed sedimentologic and stratigraphic studies on recently exposed, less deformed, relatively continuous outcrops and comprehensive review of previous studies, mainly focusing on the Jeongseon Formation which occupies most of the group spatially and stratigraphically. The Yongtan Group is divided into the Jeongseon, Haengmae, and Hoedongri formations in ascending order, and all the units are assigned to the Ordovician. The Jeongseon Formation is divided into three members based on lithology. Eleven sedimentary facies are recognized in the Jeongseon Formation and organized into five facies associations (FAs), FA1 (tidal flat), FA2 (inner-ramp), FA3 (shoal), FA4 (mid-ramp), and FA5 (ramp-slope to outer-ramp). The formation is interpreted to have been deposited on a homoclinal ramp. The Yongtan Group is divided into two supersequences separated by type 1 sequence boundary and the lower and middle members of the Jeongseon Formation belong to Supersequence I and the Upper Member to Supersequence II which includes the Haengmae and Hoedongri formations. The relative sea-level curve inferred from sequence stratigraphic analysis suggests that the formation evolved through two depositional stages in accordance with second-order sea-level changes separated by the boundary between the Sauk and Tippecanoe sequence, and the curve is greatly similar to that of the Taebaek and Yeongwol groups. The southeastward thickening of FA3 and northwestward prevalence of shale-rich facies suggest that topographic highs and lows were present in the Taebaeksan Basin and a slope might have developed along the carbonate platform during the early stage of deposition. The correlation and lateral thickness variation of the facies associations additionally suggest that the basin was deeper toward the northwestern part of the Jeongseon area. The deepening is likely attributed to the weakening of the productivity of the carbonate factory during the early Ordovician.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"03a206f107418699c0079adb601ec37a6eb4b6556cc924aec712fcf070be399f","category":"Environment"}