{"title":"Best free indoor cycling apps | 7 free alternatives to Zwift","link":"https://www.bikeradar.com/advice/buyers-guides/best-free-indoor-cycling-apps/","date":1698141639000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/best-free-indoor-training-apps-0c0ea86.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/best-free-indoor-training-apps-0c0ea86.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/best-free-indoor-training-apps-0c0ea86.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/best-free-indoor-training-apps-0c0ea86.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/best-free-indoor-training-apps-0c0ea86.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/best-free-indoor-training-apps-0c0ea86.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/best-free-indoor-training-apps-0c0ea86.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/best-free-indoor-training-apps-0c0ea86.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/best-free-indoor-training-apps-0c0ea86.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/best-free-indoor-training-apps-0c0ea86.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Tadej Pogacar photographed from behind while looking over his shoulder in bike race with graphic that says 'bikeradar indoor training week'.\" title=\"best-free-indoor-training-apps\" />                                            <p>Zwift dominates the indoor cycling app landscape, and you’ll need to pay for a subscription after a 14-day trial period, with the monthly fee currently £12.99 / $14.99. However, there are alternatives, with the best free indoor cycling apps providing a variety of user experiences.</p>\n<p>With Wahoo closing Wahoo RGT, which offers a free tier, the only option that gives you a gamified environment comparable to <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a> is now MyWhoosh.</p>\n<p>Some free Zwift alternatives offer route videos similar to Rouvy, although you’ll often only have a small number of free-to-use roads to ride, with a paid subscription opening up further options and greater functionality.</p>\n<p>Other free indoor cycling apps limit you to a ramp-based interface rather than something more interactive. If you’re happy with that and don’t mind looking elsewhere for entertainment while you ride, more options open up.</p>\n<p>Here are our top seven free smart trainer apps to help you maintain your fitness and enjoy the <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-cycling-benefits/\">benefits of indoor cycling</a> when you can’t ride outdoors. You can also read our <a href=\"https://www.bikeradar.com/advice/fitness-and-training/top-5-indoor-training-tips/\">top five indoor training tips</a>.</p>\n<h2>Best free indoor cycling apps</h2>\n<h3>MyWhoosh</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"MyWhoosh in-game graphic.\" title=\"MyWhoosh\" />\n\n</div><div><figcaption><span><i></i> MyWhoosh has been awarded the UCI Esports World Championships for three years.</span></figcaption><span> <i>MyWhoosh</i></span></div>\n<p>MyWhoosh isn’t just free, it offers cash prizes. Its Sunday Race Club has a monthly cash prize of $90,000 and its MyWhoosh Championships in April 2023 had a $1 million prize pot.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-zwift-setups-for-every-rider/\">setup is similar to Zwift</a>, with MyWhoosh able to control a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a> via the app running on a range of devices, although these need to be quite high-end for the best performance.</p>\n<p>MyWhoosh’s virtual worlds used to be very desert-heavy, plugging the United Arab Emirates (UAE) where it is based, but it has now branched out to Belgium and elsewhere.</p>\n<p>The UAE tie-up goes further though. You may have noted MyWhoosh’s logo emblazoned over Tadej Pogačar’s backside. The app’s content is heavily linked to the UAE Emirates team’s equipment, including its Colnago bikes and team clothing for your avatar.</p>\n<p>MyWhoosh has just been awarded the UCI Esports World Championships for three years from 2024 to 2026, bumping out Zwift.</p>\n<p>As with Zwift, there’s a calendar of group rides and races, as well as a whole range of workouts and training plans.</p>\n<p>It’s the closest alternative to Zwift that you can ride for free.</p>\n<h3>ErgVideo</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"ERG Video in-game screen.\" title=\"ERGvideo\" />\n\n</div><div><figcaption><span><i></i> Up to 24 riders can train together in ErgVideo.</span></figcaption><span> <i>ERG Video</i></span></div>\n<p>ErgVideo enables you to upload and ride a .fit file from any source, providing a console-based interface as you ride, which includes a simulation with an avatar, not just a ramp profile. Up to 24 riders can train together.</p>\n<p>If you don’t have any power-based files yourself, there’s a library of sessions to follow and ErgVideo has now added <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-training-plan/\">training plans</a> too.</p>\n<p>It will link into the cycling app TrainingPeaks, so you can follow a TrainingPeaks plan, and both Strava and TrainingPeaks, once your workout is completed.</p>\n<h3>TrainerDay</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"TrainerDay app shown on shown phone screens.\" title=\"trainerday\" />\n\n</div><div><figcaption><span><i></i> TrainerDay has more in common with TrainerRoad than with Zwift.</span></figcaption><span> <i>TrainerDay</i></span></div>\n<p>TrainerDay is more an alternative to TrainerRoad than to Zwift, offering a library of up to 30,000 workouts and a claimed library of hundreds of training plans.</p>\n<p>The free tier includes an app, although you’re limited to the 20 workouts that are included. The subscription to unlock the app’s full functionality is relatively affordable at $3.99 a month if you find the free tier limiting.</p>\n<p>TrainerDay boasts a quick startup. It enables you to get pedalling to start your warm-up, and then choose the workout you want to follow. It will merge your warm-up effort into the chosen workout, so there’s no downtime before you start riding.</p>\n<h3>Garmin Connect</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Garmin Connect App home screen.\" title=\"garmin-connect-app\" />\n\n</div><div><figcaption><span><i></i> Garmin Connect can provide a range of training plans for cyclists and other athletes, including runners.</span></figcaption><span> <i>Garmin</i></span></div>\n<p>Although it helps to have a Garmin <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">bike computer</a> or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-watch/\">smartwatch</a>, Garmin Connect provides a range of training plans for cyclists, which can be ridden <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-vs-outdoor-cycle-training/\">indoors or outdoors</a> and which you can also follow without a Garmin.</p>\n<p>The Garmin Connect app is available for desktops and for smartphones.</p>\n<p>You don’t get an interactive interface as you do with Zwift, but Garmin’s workout library is comprehensive.</p>\n<p>If you tell the app how much time you can dedicate to your riding and when you want to be ready for your event, Garmin Connect will set up a schedule with workouts and non-exercise days mapped out for each day leading up to your target date.</p>\n<p>It will probably include some longer tempo rides – riding for two hours in Zone 2 is probably nicer outdoors than indoors. Garmin advises that early in a training plan longer rides can be subbed out for other exercise if you’re seeking variety.</p>\n<p>Additionally, there will be shorter sessions of an hour or so, which include <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">intervals</a> and which might be easier to manage indoors, particularly if you’re trying to fit in three or more sessions a week over the winter.</p>\n<p>Garmin will also track your progress, if you’ve got the right kit, with a smartwatch useful to keep an eye on your heart rate, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/heart-rate-variability/\">heart rate variability</a>, sleep quality, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/vo2-max/\">VO2 max</a> and other metrics, to ensure you’re hitting your targets and not <a href=\"https://www.bikeradar.com/advice/fitness-and-training/overtraining-syndrome/\">overtraining</a>.</p>\n<h3>Tacx Training app (for Tacx trainers)</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Tacx app on phone screen.\" title=\"Tackx-app\" />\n\n</div><div><figcaption><span><i></i> Tacx has a free tier, but the paid version features high-quality video streams.</span></figcaption><span> <i>Tacx</i></span></div>\n<p>Another option from Garmin, which now owns Tacx, is the Tacx Training app.</p>\n<p>The app has a free tier as well as paid-for options. Paying will increase the range of functionality available and open up high-quality video streams, but there’s a reasonable amount of content available without paying.</p>\n<p>You will need a Tacx trainer, because although the app communicates via BLE, Tacx says that third-party trainers won’t function correctly. That’s not something we’ve tested ourselves though. The app also integrates with Garmin Connect.</p>\n<p>The free tier enables you to follow structured workouts, compete and analyse your data, although you only get two demo video streams. A paid subscription, meanwhile, opens up the complete library of more than 150 route videos in 720p. A premium tier adds higher-quality 1048p video.</p>\n<p>There’s a downloadable computer app for Windows as well as an app-based version for both iOS and Android devices.</p>\n<h3>My E-Training (for Elite trainers)</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"My E-Trainer screens shown on phone, tablet and laptop.\" title=\"Elites-My-E-Training-software\" />\n\n</div><div><figcaption><span><i></i> My E-Training links up with Elite smart trainers.</span></figcaption><span> <i>Elite</i></span></div>\n<p>Like the Tacx app, My E-Training is another brand-specific training app, which in this case is linked to the Elite trainer range.</p>\n<p>As well as a suite of workouts and training plans, Elite has a library of routes with RealVideo. Elite claims there are more than 50 different video routes that you can follow for free, with the resistance of your Elite trainer adjusted to reflect the gradient.</p>\n<p>You can also film your own video, upload it, and ride and share it on the platform to create your own training plans. Some Elite trainers such as the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/elite-direto-smart-trainer-review/\">Direto</a> and <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/elite-drivo-ii-review/\">Drivo</a> ranges will provide pedalling analysis on the platform.</p>\n<h3>Kinetic Fit (for Kinetic trainers)</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Kinetic Fit app on tablet and smartphone screen.\" title=\"Kinetic Fit\" />\n\n</div><div><figcaption><span><i></i> You can sync Kinetic Fit with apps including Strava and TrainingPeaks.</span></figcaption><span> <i>Kinetic App</i></span></div>\n<p>Yet another suite of training software linked to a specific trainer brand, Kinetic Fit has a free Core tier that gives you access to a subset of its power-based workouts and training plans. It’s another ramp-based user interface with limited interactivity.</p>\n<p>Although in-app analysis is limited for the free tier, you can sync out to a range of third-party apps including Strava and TrainingPeaks.</p>\n<section>\n    <div>\n        \n<h2>What other indoor training apps are there?</h2>\n<p>As with Zwift, many subscription-based indoor training apps offer a free trial period before you need to put your money down. It’s usually 14 days, although for Bkool it’s 30 days.</p>\n<p>So if you don’t mind app surfing – and there are likely more than we’ve listed here – you could go a good few months before having to make a decision. By which time the weather might have got sufficiently better to entice you out of your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/tips-for-building-the-ideal-indoor-training-space/\">pain cave</a> and back outdoors.</p>\n<p>If you want some suggestions for paid-for indoor cycling apps to try, check out our guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">best indoor cycling apps</a>. We’ve also got detailed guides to <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/trainerroad/\">TrainerRoad</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/rouvy-everything-you-need-to-know/\">Rouvy</a> and more.</p>\n<p>We also have a guide to essential <a href=\"https://www.bikeradar.com/advice/buyers-guides/turbo-trainer-accessories/\">indoor training accessories</a>.</p>\n<p>\n\n    </p></div>\n    </section>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"03b421d9bd80edca05511bf2b8c63315b305df1c4d122825f5b262d7c650e5f2","category":"Cycling"}