{"title":"Truly, madly, deeply: the bikes I’ve loved","link":"https://cyclingtips.com/2021/10/the-best-road-bikes-of-the-last-30-years/","date":1635523466000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Ronans-Trek-1000-Malin-Head-650x366.jpg\" /></div><h2>Truly, madly, deeply: the bikes I've loved</h2><p>\n</p><p>Two weeks ago, I posted a seemingly simple question on my <a href=\"https://twitter.com/ronanmclaughlin?lang=en\" target=\"_blank\">Twitter</a> feed: “what was the best team jersey ever?” The flood of responses led to a weekend of Twitter polls to decide “the people’s” favourite jersey. The classic La Vie Claire was crowned the winner. </p>\n\n\n\n<p>The jersey poll was such fun that I decided to run a similar poll thread to decide our favourite pro bikes this week. What are the best pro bikes ever? The responses to my favourite bike question had the widest array of bicycles you could imagine and proved only one thing: beauty is very much in the eye of the beholder. The responses were a mix of rigs from iconic teams and timeless classics to a handful I suspect were heavily influenced by the responder’s personal rig.</p>\n\n\n\n<p>This handful of bikes got me thinking about my own dream bikes and the realisation that, as of this year, I have been racing bikes for more years than I have not. I am not ashamed to say this led to at least an hour of daydreaming of some of my favourite bikes ever. Classics like the <a href=\"https://cyclingtips.com/tag/colnago/\">Colnago</a> C50 and Master sat alongside head-scratchers like the Litespeed Ghisallo. </p>\n\n\n\n<p>Perhaps most interesting was how my dream bikes have changed over the years. Not only have the brands and models changed, but the style of bike has also changed considerably, swinging from classic cylindrical-tubed frames to outright aero rigs and back again. Sure, performance claims, marketing campaigns and successful riders all influenced my wish lists, but the style of bike I desired closely tracked my style of riding. Unsurprisingly, World tour race bikes featured heavily, with only a few deviations down through the years before a full 180° shift over the past two years.</p>\n\n\n\n<p>Having spent so much of my working day drooling over dream bikes of bygone years, I thought I had better shape this into some form of article to convince the bosses I was actually working. Luckily I drew some conclusions about modern bikes along the way, giving me something meaningful to write about.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Ronans-Trek-1000-Malin-Head-1340x754.jpg\" /><figcaption>My first road bike, a Trek 1000. Not the best bike in the world, but, nevertheless, the perfect gateway into the bike world</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Trek-5900-Superlight-2004-1340x754.jpg\" /><figcaption>Before I even heard about geometry, or aerodynamics, or even XXX Superlight SL SLR Tout de la Fruit frames, I was proud of my Trek 1000 because there was a Trek 5900. Of course, soon after that I started thinking I need a 5900. Photo – Trek</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Trek-USPS-1340x754.jpg\" /><figcaption>Wireless… Vetta speedo</figcaption></figure></li></ul></figure>\n\n\n\n<h2>The early days</h2>\n\n\n\n<p>I was heavily influenced by a certain American who was dominating a big bike race in France during my early years on the bike. Unsurprisingly then, my first road bike was an aluminium <a href=\"https://cyclingtips.com/tag/trek-bikes/\">Trek</a> 1000. This bike got me hooked on cycling, involved with the local club, and into my first club races. My thoughts very quickly turned to carbon, and a Trek 5900, which, with my limited experience, was seemingly the only bike worth having at that time. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Shimano-seatpost-1340x754.jpg\" /><figcaption>Would any bike be complete without this seatpost?</figcaption></figure>\n\n\n\n<p>It was around this time I contracted a severe infection of the cycling bug. While the symptoms were obvious and included a Credit Agricole team kit, a cycle the length of Ireland, and at least two or three falls due to having my feet “locked” in the pedals, it was a football match that confirmed the diagnosis. </p>\n\n\n\n<p>I was always terrible at the soccer ball, so a bad game was not noteworthy, but fitness and effort were my skills. So one game where I made no effort and almost zero running stood out as a particularly bad day. Where had the work rate gone? Nowhere, I was just completely distracted by the beauty of… a Dura-Ace seat post I had seen earlier that day. The distraction and the end of my footballing days I could live with, but worrying whether I would ever be a cyclist if I couldn’t have one of these duralumin posts I could not. I had to have one. </p>\n\n\n\n<p>I never did, the search continues.</p>\n\n\n\n<p>Around the same time, in July/August 2003, Shimano released Dura-Ace 7800. I first laid eyes on the new 10-speed groupset in Cycle Sport magazine. I had just finished my first ever century (miles) ride, got rained on for a lot of it, and suffered like hell. My Dad treated me to a dinner out but my attention was elsewhere. “If only I had a tenth gear today, I wouldn’t have struggled so much,” I thought. This is just logical. </p>\n\n\n\n<p>I was determined to have the new groupset with that Dura-Ace seat post on the new Trek 5900. So when my parents took me to the local bike shop and we ordered a Campagnolo Chorus equipped Look KG486, I was considerably confused. Looking back I shouldn’t have been, the local shop was not a Trek dealer and all the staff were Campagnolo fans. I was sold, and I am eternally grateful for it.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Gilberto-Simoni-Giro-2005-Cannondale-Six13-1340x893.jpg\" /><figcaption>Gilberto Simoni and Jose Rujano Guillen. Photo Marketa Navratilova/Cor Vos ©2005</figcaption></figure>\n\n\n\n<p>That Look was years ahead of its time and was a fabulous bike, right up until the point I rode straight into a fence and broke it along the top tube. Truth be told, for the first few months I had the Look I was not too fond of it. Really all I needed was a good chunk of training and a bike fit, but I thought the bike was slow. At the same time, <a href=\"https://cyclingtips.com/tag/cannondale/\">Cannondale</a> brought out its UCI-weight-limit-defying Six13, the one Damiano Cunego rode to Giro d’Italia glory. I had to have it! That would end my suffering once and for all, I thought! A trend was developing, the idea that tech wins races. An idea that most likely led me to be a tech editor today. </p>\n\n\n\n<p>After breaking the Look, it was back to the bike shop to get the Six13. The Six13 was everything I needed, I would be a champion on the Six13… so we bought a Litespeed Mira frame and fork and transferred the Chorus groupset onto the new frame. Yes, you guessed it, the local bike shop was not a Cannondale dealer, but did sell Litespeeds.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Ronan-Litespeed-Mira-040506-1340x754.jpg\" /><figcaption>I loved that Litespeed and used it on and off for three seasons, with the only upgrade being black bar tape and an SRM power meter. In hindsight perhaps I should have downgraded my Ergopower Lever angles. </figcaption></figure>\n\n\n\n<h2>Sponsored bikes</h2>\n\n\n\n<p>From there, much to my parent’s relief, I was onto the first of my team bikes. First up was a Planet X Superlight alloy frame. The “cobble craft” as it was somewhat affectionately known, saw me through my first full year racing and my first excursions to Belgium. As perfectly suited to Belgian junior racing as the Planet X was, I had my eye on the Time VXRS Tom Boonen powered to Flanders, Roubaix, a Tour stage, and Worlds victories in 2005. That was, and still is, a beautiful bike. As a recent convert to Campag-ism and forced to ride Shimano (how rude), the naked carbon effect Time frames kitted out with the carbon-clad Record 10-speed groupsets were things of beauty.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Tom-Boonen-Time-VXRS-2005-1340x754.jpg\" /><figcaption>Tom Boonen (Quick-Step) winning the Tour of Flanders solo, with zero consideration for marginal gains or even significant gains. Photo Cor Vos ©2005</figcaption></figure>\n\n\n\n<p>The Planet X was the first bike in a three-year love affair with British bikes. In 2006, a carbon framed Dolan with Ultegra and the same SRM was sandwiched by that Planet X cobble craft in 2005 and a Planet X Pro Carbon in 2007. But of course, my mind was elsewhere.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Dolan-2006-1340x754.jpg\" /><figcaption>I never got that Six13, which is why I never won the Giro, but I did at least get the same Rudy Project helmet Saeco used. </figcaption></figure>\n\n\n\n<p>I finished college (interpret that as you will) in 2006 and took a job in a bike shop to save some money for another summer in Belgium. The shop was a Colnago dealership and seeing those frames every day instilled a longing to own one that remains to this day. C50, Extreme Power, Master, Mexico and the Arabesque frames all come calling me on a somewhat regular basis. Saved eBay searches notify me any time someone loses their marbles and decides it’s a good idea to sell their PR82 Master, PR11 C50, or any frame with the AD10 colourway. God only knows how long I have spent scrolling photos of MPWH C60s and BDWH C64s. Yes, I have deliberately only used the colour codes, those four letters and numbers are enough to make die-hard Colnago fans feel all warm and fuzzy inside. To be any more descriptive would kill the buzz.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Colnago-C50-PR11-1340x754.jpg\" /><figcaption>Any day now. This photo is from the 391 page <a href=\"https://weightweenies.starbike.com/forum/viewtopic.php?f=131&amp;t=56175&amp;hilit=c50+st01&amp;sid=46c33819824e9f7eb1dd4ce329f6a954\" target=\"_blank\">WeightWeenies forum Pictures of Colnagos thread</a>, photo – WeightWeenies member SampsC50, Mr Samppala</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Colnago-Arabesque-RAWH-1340x754.jpg\" /><figcaption>The Arabesque, too good to ride? Photo – Colnago</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Colnago-C60-MPWH-Mapei-1340x754.jpg\" /><figcaption>I’m not fussy, anything carbon and Mapei – Photo – Colnago</figcaption></figure></li></ul></figure>\n\n\n\n<h2>Teardrops</h2>\n\n\n\n<p>Until the end of 2006, all my dream bikes were very traditional frames with round tubing, fully external cable routing with a focus on lightweight and ride characteristics. That was about to change. Team Sky and British Cycling are credited with starting the marginal gains wave, but for me, it was <a href=\"https://cyclingtips.com/tag/cervelo/\">Cervelo</a> and Team CSC a few years earlier. With its Soloist, Soloist Carbon, and P3, Cervelo took aerodynamics and shoved it down the throats of the entire road bike world, in doing so, setting the industry on a course for where we are today.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/CSC-Cervelo-Soloist-Jens-Voigt-2-1-1340x754.jpg\" /><figcaption>As fast as it got, or so I thought.</figcaption></figure>\n\n\n\n<p>In 2007 I longed for one of those Soloist Carbons. Soon after that, in 2009, it was a Cervelo S3 and fast forward to 2014, it was the Cervelo S5 I needed. I was obsessed with marginal gains, aerodynamics, and Cervelo rigs. I had the pleasure of racing a P3 in a few time trials, but that was as close as I got. The teardrop tube shaping and semi-internal cable routing were revolutionary at the time, and to be on any other bike felt like a disadvantage.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Cervelo-P3-Carbon--1340x754.jpg\" /><figcaption>Have some decency! It seems rude to picture this bike in its little chainring.  </figcaption></figure></li></ul></figure>\n\n\n\n<p>The bikes changed over the years, but the longing for an aerodynamic World Tour-level race bike stuck with me as long as I raced. There was the Ridley Noah Fast, the Orbea Orca, and those S5 Cervelos to name but a few examples of bikes I thought could have helped me be less beaten by fewer riders.</p>\n\n\n\n<p>Finally, in 2015 I got my first superbike, the <a href=\"https://cyclingtips.com/tag/pinarello/\">Pinarello</a> F8. Super Record EPS, Bora One wheels, 3T Aeronova bars, and it was fast! Strava PRs fell and race wins followed. It was perfect, until perfecter came along. Fully-internal cable routing, aero cockpits, more aeroer frames. The second-generation S-Works Venge, Canyon Aeroad, the Dogma F10 and the Trek Madone tested my love for the F8. Thankfully my wallet said no; my brain might not have. The scary thing is some of those very bikes all seem dated, old, dare I say it, even slow by today’s standards.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Principia-2009-calpe-1340x754.jpg\" /><figcaption>In 2009 it was a Principia. All sorts of cringe in this photo, but, yellow pedals on a black and red bike? </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Principia-2010-Muur-1340x754.jpg\" /><figcaption>Principia again in 2010</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Dolan-Ares-1340x754.jpg\" /><figcaption>The Dolan Ares gave me some of my best years in 2011 and 2021</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Vitus-Vitesse-1340x754.jpg\" /><figcaption>2013 was not a highlight, and I never did sell that Vitus.</figcaption></figure></li></ul></figure>\n\n\n\n<h2>“The times they are a changin” </h2>\n\n\n\n<p>To this day, I still dream of owning one of those Treks, or the Six13, or any of the Colnagos. Add to that list almost any Pinarello, Bianchi, or Look from the 80s and 90s. I’d do bold things to own any one of them, even if only for a day. At the time, they were race bikes, but they have stood the test of time and now, to varying degrees, are iconic and classic bikes. </p>\n\n\n\n<p>I don’t dream of owning these bikes to go racing as I did back in 2005, but I still really want them. On the contrary, the subsequent performance-focused bikes I dreamed of helping me achieve better results, well, I don’t want those at all now. While back in the early 2010s I dreamed of how fast I would be on an S5, or how I would have won a stage of the Ras with deeper wheels, those bikes and wheels don’t seem as fast anymore, and they certainly are not in my pick of most beautiful bikes ever. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Valverde-Pinarello-Prince-of-Spain-2008-1340x754.jpg\" /><figcaption>If only the colourway stuck around as long as the rider has.</figcaption></figure></li></ul></figure>\n\n\n\n<p>There are exceptions to the rule, of course. Valverde’s 2008 Pinarello Prince of Spain, Thomas Voeckler’s Colnago C59, Andy Schleck’s 2010 <a href=\"https://cyclingtips.com/tag/specialized/\">Specialized</a> Tarmac SL3, and Fillipo Pozzato’s ramato <a href=\"https://cyclingtips.com/tag/wilier-triestina/\">Wilier</a> Cento 10 Air all spring to mind.</p>\n\n\n\n<p>Am I saying those early adopter aero bikes were bad bikes or the dark days of bike design? Not at all. Modern race machines owe their very existence to their aero ancestors of the early part of the last decade. But performance-wise, there is no doubting those bikes are outclassed by their modern descendants. If I am racing today, I want an aero bike with everything bar my backside integrated, all in the name of optimal performance. Paradoxically, that performance progression is my concern for the modern bike.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Thomas-Voeckler-Europcar-yellow-jersey-Colnago-c59-2-1340x754.jpg\" /><figcaption>Strike a pose</figcaption></figure>\n\n\n\n<p>My 18 years of racing bikes coincided with a monumental shift in bicycle design. Prior, bicycle design hadn’t changed much in decades, if at all. To the untrained eye, a 1980s road racing bike was identical to a 2005 Colnago C50, two big wheels with skinny tyres, round tubes, and drop handlebars. Sure, there were concept bikes from Colnago, Boardman’s Lotus, and time trial bikes of the 90s, but road racing bike design hadn’t changed for the most part.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Wilier-Cento-10-Air-Ramato-1340x754.jpg\" /><figcaption>The Wilier Cento 10 Air Ramato, the only one of my dream bikes I actually bought… so far. Photo – Wilier</figcaption></figure>\n\n\n\n<p>In the years since 2005, starting with that Cervelo Soloist for me, only the two wheels and drop bars have remained the same shape. Aero tubing, compact geometry, integrated tubing, wider tyres, stubby saddles, disc brakes, and electronic shifting; all relatively new concepts to mainstream bike design. Marginal gains and performance are the drivers, but arguably at the expense of creating classic road racing bikes. </p>\n\n\n\n<p>In response to my simple Twitter question, “what is your favourite pro-bike”, I got plenty of bikes from the 70s, 80s, and 90s, barely a few years between each bike’s release. I got significantly fewer responses for bikes from the naughties, almost zero from the 2010s, then plenty of bikes from the past year or two. If the focus is always performance, the result, I fear, will date very quickly. Great for bike brands selling the latest and greatest thing, not so great, I’d argue, for bike enthusiasts born after 1990. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/fiftyonebikes.com-www.deanella.com-2-1340x810.jpg\" /><figcaption>My northern lights inspired Fiftyone, a rare round-tubed love affair in a decade dominated by truncated tubing. </figcaption></figure>\n\n\n\n<p>I was born in 1987, I remember Boonen on a Time, Freire on a C50, the generations before mine have Mapei on C40s, Kelly on a Concorde, Merckx on a Colnago. Will the 15-year-old kid of 2014 inextricably link Marcel Kittel and the first-generation Giant Propel? In 18 years, will I scour eBay for Egan Bernal’s 2021 F12 the same way I happily spend too much time just window shopping Saronni’s Mexico now? I know my answer, I hope I’m wrong.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Specialized-Crux-Pro-1340x754.jpg\" /><figcaption>The Crux Pro comes in this vivid colour scheme… Photo – Specialized</figcaption></figure>\n\n\n\n<p>My dream bikes have evolved again in the past two years. Covid and, paradoxically, <a href=\"https://cyclingtips.com/2021/03/ronan-mc-laughlin-has-smashed-the-everesting-record-in-6-hours-40-minutes/\">Everesting</a> both accelerated the decline of my racing ambitions, and my dream bikes reflect that. I have a rim brake <a href=\"https://cyclingtips.com/2017/06/2018-specialized-s-works-tarmac-sl6-first-look/\" target=\"_blank\">Tarmac SL6</a> with mechanical Campagnolo Record. I love this bike, but even this bike, widely accepted last of the classic bikes, is feeling a bit outdated or almost too middle-ground for me. It’s not as fast as a fully integrated aero rig and not as slow or classic as an Arabesque. It’s not as versatile as the <a href=\"https://cyclingtips.com/2021/10/2022-specialized-crux-review/\" target=\"_blank\">new Crux</a> and not really any lighter. With those external cables and roundish tubes, it wouldn’t be my first choice for racing, but it feels wasted going slow. It rides fabulously but being somewhat confined to tarmac, or at least hardpack roads, I often find myself reluctantly passing the fire tracks and wooded trails I want to ride.</p>\n\n\n\n<p>Where does that leave me? It might sound like I don’t know, but actually, I have never been more certain. If I was still racing (am I not still racing?) I’d happily be on that latest and greatest merry go round, definitely aero, probably fully integrated, and preferably sponsored…with a mechanic. Remove the racing and things get a bit simpler. Then I figure I need just three bikes: an iconic classic with a fabulous paint job for sociable club spins. A versatile modern “all-road” bike for mixing up paved and unpaved roads. And an e-cargo bike, no explanation required.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/Urban-Arrow-Family-long-term-update-one-10-1340x894.jpg\" /></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/10/the-best-road-bikes-of-the-last-30-years/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"03c2f2d6963b680a50ab58c57e024219129beeabb3ae8c97f1bcc2c08fe9c049","category":"Cycling"}