{"title":"A modified Goldstein filter for interferogram denoising of interferometric imaging radar altimeter based on multiple quality-guided graphs","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308636","date":1723125600000,"content":"<p>by Jian Liu, Huili Zhang, Lihua Wang, Zhiyong Wang</p>\r\n\r\nAiming at the characteristics that the signal noise ratio (SNR) gradually decreases from the near to far range of the swath, an adaptive phase filtering algorithm based on Goldstein filtering and combined with multiple quality-guided graphs was proposed. Firstly, the components used to determine the filtering parameters were obtained through residue density, pseudo-coherence coefficient and pseudo-SNR, the three quality-guided graphs. Then, the filter parameters were calculated by weighting the three components. Finally, the size of filtering window was determined according to the account of residues, and the interferometric phase noise was removed in frequency domain. Simulated data, TSX/TDX data and airborne interferometric imaging radar altimeter data were used to verify the performance of the new algorithm. Compared with the results of Goldstein filtering and its improved algorithms, the results showed that the proposed algorithm can effectively filter out phase noise while maintaining the edge characteristics of interferometric fringe. The section of filtering result can well match with the section of simulated pure interfeometric phase. Moreover, the algorithm proposed in this paper can effectively remove the noise in the interferogram of TSX/TDX sea ice data, and the residues’ filtering rate was above 86%, which can effectively remove the phase residues of the sea ice surface while maintaining the characteristics of the sea ice edge. Experimental results showed that the new algorithm provides an effective phase noise filtering method for imaging radar altimeter data processing.","author":"Jian Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"03c4cf661c9f67376f461ee808d8922d408fe8031c3e736c1cde3ba71fe7faa1","category":"Interdisciplinary"}