{"title":"Evaluating the Antihyperalgesic Potential of Sildenafil-Metformin Combination and Its Impact on Biochemical Markers in Alloxan-Induced Diabetic Neuropathy in Rats","link":"https://www.preprints.org/manuscript/202403.1853/v1","date":1711716341000,"content":"(1) Background: Globally, about 600 million people are afflicted with diabetes, and one of its most prevalent complications is neuropathy, a debilitating condition. At present, the exploration of novel therapies for alleviating diabetic neuropathy-associated pain is genuinely captivating, considering that current therapeutic options are characterized by poor efficacy and significant risk of side effects. In the current research, we evaluated the antihyperalgesic effect of sildenafil (phosphodiesterase-5 inhibitor) – metformin (antihyperglycemic agent) combination and its impact on biochemical markers in alloxan-induced diabetic neuropathy in rats; (2) Methods: The study comprised a cohort of 70 diabetic rats and 10 non-diabetic rats which were submitted to hot, cold, and tactile stimulus tests. Morover, we investigated the influence of this combination on TNF-α, IL-6 nitrites and thiols levels in brain and liver tissues; (3) Results: The results demonstrated that all sildenafil-metformin combinations decreased the pain sensitivity in von Frey test, Hot-plate test and Cold-plate test. Furthermore, alterations in nitrites and thiols concentrations and pro-inflammatory cytokines (specifically TNF-α and IL-6) were noted following a 15-day regimen of various sildenafil-metformin combinations. (4) Conclusions: The combination of sildenafil and metformin has a synergistic effect in alleviating pain in alloxan-induced diabetic neuropathy rats. Additionally, the combination effectively decreased inflammation, inhibited the rise in NOS activity, and provided protection against glutathione depletion.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"03ca9432ebb60c584034c189914c126295144aee09e418b446dbf0a610a9994b","category":"Interdisciplinary"}