{"title":"Threads usage drops as Meta blocks VPN access in EU [Updated]","link":"https://arstechnica.com/?p=1953967","date":1689350093000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-1524125233-800x533.jpg\" alt=\"Threads usage drops as Meta blocks VPN access in EU [Updated]\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-1524125233.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/the-threads-logo-on-a-smartphone-arranged-in-the-brooklyn-news-photo/1524134158\">Bloomberg / Contributor | Bloomberg</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p><strong>[Update:</strong> Top10VPN's head of research, Simon Migliano, told Ars that \"demand for VPN services is significantly up in a handful of major EU countries, such as Italy (26 percent), France (19 percent) and Sweden (20 percent), and up around 12 percent across the bloc as a whole since the launch of Threads on July 5 compared to the daily average over the 30 days prior. Other countries with significant spikes include Croatia (20 percent), Denmark (23 percent), Greece (22 percent) and Luxembourg (21 percent).\" Compared to its neighbors, \"privacy conscious\" Germany's VPN \"demand is fairly flat\" and only up by 5 percent, Migliano said.</p>\n<p>Migliano also indicated that it seemed likely that Meta may not be blocking all VPN traffic.</p>\n<p>\"It's understandable that Meta would try to block VPN traffic to Threads in the hope of improving their standing with EU regulators looking at their wider business model,\" Migliano told Ars. \"It does however feel like it's more for PR purposes than a serious attempt to lock out all EU users keen enough to use a VPN to access Threads. While Meta may well have gone for the low-hanging fruit of blocking easy-to-identify IP ranges, such as those from data centres, it would be much more resource-intensive to identify and block obfuscated VPN traffic for example.\"<strong>]</strong></p></div><p><a href=\"https://arstechnica.com/?p=1953967#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1953967&amp;comments=1\">Comments</a></p>","author":"Ashley Belanger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"03ca1d627faaefb6226fe711b36f2b6c60bfabce24bd9728fdedd0f0fb8bf7fb","category":"Tech"}