{"title":"The Impact of Delayed Access to Care on Psychological Distress Among Chinese Immigrants in Canada During the Second Wave of the Pandemic","link":"https://www.preprints.org/manuscript/202406.1332/v1","date":1718787301000,"content":"It is unclear whether delayed access to treatment/health assessment impacted psychological distress for these populations. This study aimed to fill this literature gap by using a cross-sectional survey, which aimed to evaluate the impact of COVID-19 pandemic on Chinese immigrants in North America during the second wave of the pandemic. The study focused on Chinese immigrants aged 16 or older in Canada. Covariates included sociodemographic variables, delayed access to treatment/health assessment, and other COVID-19 related variables. We used logistic LASSO regression for model selection and multivariate logistic regression models to evaluate the association between delayed access to treatment/health assessment and psychological distress outcome. Missing data were handled using multiple imputation. Our study included 746 respondents, with 47.18% normal CPDI group and 36.82% mild to severe CPDI group. Most respondents were originally from Mainland China and residing in Ontario. Over half have stayed in Canada for at least 15 years. The multivariate logistic regression models unveiled a significantly positive association between psychological distress and delayed access to treatment/health assessment (OR=1.362, 95% CI: 1.078–1.720, p= 0.0095), fear of COVID-19 (OR=1.604, 95% CI: 1.293–1.989, p&lt;.0001), social loneliness (OR=1.408, 95%CI: 1.314–1.508, p&lt;.0001). Sociodemographic variables and other COVID-19 related-variates did not significantly impact the study’s outcome. Reliable health information, mental health supports, and virtual care tailored to immigrants should be considered to mitigate this impact and optimize overall health and well-being.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"03cfbbf8fc30e1e92e07be834fa63cf0bb8bf51e07b2f208dd012671f0d057d0","category":"Interdisciplinary"}