{"title":"NYPD hands out 500 AirTags to combat recent car theft epidemic","link":"https://www.macworld.com/article/1805271/nypd-car-theft-500-free-airtags.html","date":1683033034000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>New York City Mayor Eric Adams has announced a plan to tackle ballooning auto theft rates by encouraging car owners to use AirTags to protect their vehicles. To support the initiative, 500 of the $29 devices will be given out for free, funded by a nonprofit group called the Association for a Better New York.</p>\n\n\n\n<p>The announcement, as first reported by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cbsnews.com/newyork/news/watch-mayor-adams-makes-public-safety-announcement-in-the-bronx/&amp;xcust=1-1-1805271-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">CBS New York</a>, comes in response to a spate of thefts in the Bronx, particularly affecting Hyundai and Kia vehicles. The free AirTags will be given out in the Castle Hill, Soundview, and Parkchester neighborhoods, where thefts have risen by 548 percent year on year.</p>\n\n\n\n<figure><div>\n<blockquote><p>The 21st century calls for 21st century policing.  AirTags in your car will help us recover your vehicle if it’s stolen. We’ll use our drones, our StarChase technology &amp; good old fashion police work to safely recover your stolen car.  Help us help you, get an AirTag. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/hashtag/GSD?src=hash&amp;ref_src=twsrc%5Etfw&amp;xcust=1-1-1805271-1-0-0&amp;sref=https://www.macworld.com/feed\">#GSD</a> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/fTfk8p4lye&amp;xcust=1-1-1805271-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/fTfk8p4lye</a></p>— NYPD Chief of Department (@NYPDChiefOfDept) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/NYPDChiefOfDept/status/1652759702697017345?ref_src=twsrc%5Etfw&amp;xcust=1-1-1805271-1-0-0&amp;sref=https://www.macworld.com/feed\">April 30, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>The sudden rise appears to be related to the discovery of a technical fault with certain car models. If a thief removes a plastic cylinder, a phone charger can be used to jumpstart the vehicle, and TikTok videos have been made showing how this works. (Hyundai responded to the story by releasing a statement detailing its “comprehensive action” to protect customers, and this can be read in full in CBS’s article.)</p>\n\n\n\n<p>AirTags are designed to be attached to objects of value, and can then track their location in real-time and report this to a paired iPhone or other Apple device. Many owners place them inside wallets or attach them to keyrings, and some even buy special AirTag-ready collars for their pets so they can see where they’ve gone. But the use of AirTags to track cars, as logical as this seems, is more often publicized from the other side of the coin: as a tool used by stalkers and other criminals to <a href=\"https://www.macworld.com/article/678287/woman-discovers-stalker-airtag-hidden-in-car.html\">track their victims</a>.</p>\n\n\n\n<p>Indeed a number of such cases prompted Apple to implement anti-stalking software updates to alert victims that they were being tracked without their consent. As valuable and necessary as these measures were, there were concerns that they might neuter the effectiveness of AirTags at tackling theft. (As I <a href=\"https://www.macworld.com/article/678459/the-airtag-can-beat-theft-or-stalking-but-not-both.html\">wrote at the time</a>, “If we want to catch the thief we endanger the stalking victim; if we want to protect the stalking victim we allow the thief to escape.”) The NYPD appears not to share these concerns.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"03cf7f7ed581aac159927e25ee3f04e0b558e43c1e2369601e47ba98ba50d121","category":"Apple"}