{"title":"Impact of Thinning on the Yield and Quality of Eucalyptus grandis Wood at Harvest Time","link":"https://www.preprints.org/manuscript/202404.0233/v1","date":1712143009000,"content":"To understand how the thinning strategies impacts on wood quality and quantity for different purposes is of interest, considering that the management of plantations is carried out with parameters that have yet to be validated for different growth conditions. This work evaluated contrasting thinning regimes applied early at two moments of the crop cycle. With an initial population of 840 trees.ha-1, two thinning with populations ranging from 700 to 400, and from 400 to 100 trees.ha-1 were applied at 1.5 and 7.3 years, respectively. Growth analyses were carried out from the ages of 1.5 to 20.8 years considering: total height, diameter at breast height, individual volume, total and commercial volume per hectare, mean annual increase and current annual increase. At final age, contrasting populations of 100, 250 and 400 trees.ha-1 were sampled to assess wood density, and mechanical properties (bending and compression on small scale clear samples). The values of individual growth and wood properties are related to a Stand Density Index to understand the effect of competition on those values. The results allow us to identify the thinning schemes that record the most significant individual and per-hectare growth (both in thinning and clear felling) and the optimal harvest time under specific growth conditions. We assessed the proportions of commercial logs for sawmill and pulp uses, providing valuable inputs for a subsequent economic analysis of thinning regimes seeking for the most convenient combination of wood products. Wood's physical and mechanical properties assessed were barely affected by contrasting levels of competition between trees, therefore the decision of the silvicultural system to implement will depend on production and economic criteria.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"03e1876cb3ff4d3dbae195fcadee21628d939823a7d9134eeff6a63048002519","category":"Interdisciplinary"}