{"title":"High‐humidity hot‐air impingement blanching conditions for the inhibition of potato‐browning enzymes and for quality retention","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13153?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Potato is an important non-cereal crop. It provides carbohydrates, a major source of energy in the human diet. Blanching during the processing of fresh fruits and vegetables is essential for their preservation. High-humidity hot-air impingement blanching (HHAIB) is a promising emerging technology for pretreating different food materials. This research aimed to identify the optimum HHAIB conditions for the inhibition of potato-browning enzymes, maintaining their nutritional and physical quality, and to compare this with conventional hot-water blanching (HWB).</p>\n<h2>RESULTS</h2>\n<p>Polyphenol oxidase (PPO) inactivation, total phenol content (TPC), 2,2-diphenyl-1-picrylhydrazyl (DPPH) radical scavenging activity, color, textural attributes, thermal properties, microstructure, and particles crystallinity were evaluated. The relative humidity (RH), temperature, and duration of HHAIB required for PPO inactivation (2.59%) were 50%, 105 °C, and 4 min, respectively, which resulted in a complete gelatigination of potato starches, based on the thermal properties and the microstrcture of the blanched potatoes. These conditions led to improvements in TPC to 312.54 μg GAE.g<sup>−1</sup> FP, DPPH scavenging to 1.99 μmol TE.g<sup>−1</sup> FP, as well as enhancements in color and crystallinity. When HHAIB was conducted at lower temperatures (85 and 95 °C) there were negative effects on the blanched potatoes' color and crystallinity, along with a non-safe level of PPO activity.</p>\n<h2>CONCLUSION</h2>\n<p>High-humidity hot-air impingement blanching was superior to HWB, inhibiting PPO, maintaining nutrients, and preserving physical properties, especially under the optimum conditions revealed by the principal component analysis. It provides an excellent technique for blanching and pretreating potatoes, preserving them, and maintaining their quality. © 2023 Society of Chemical Industry.</p>","author":"Samir Mowafy, \nYanhong Liu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"03e21691ecbd2c401e5d4cd3430d5c8cd17912308f766f1f22dc3845ede1df1c","category":"Environment"}