{"title":"Deadline: ‘Hollywood Studios’ WGA Strike Endgame Is To Let Writers Go Broke Before Resuming Talks In Fall’","link":"https://deadline.com/2023/07/writers-strike-hollywood-studios-deal-fight-wga-actors-1235434335/","date":1689287374000,"content":"\n<p>Dominic Patten, reporting for Deadline two days ago:</p>\n\n<blockquote>\n  <p>“I think we’re in for a long strike, and they’re going to let it\nbleed out,” said one industry veteran intimate with the POV of\nstudio CEOs. With the scribes’ strike now finishing its 71st day\nand the actors’ union just 30 hours from a possible labor action\nof its own, the Alliance of Motion Picture and Television\nProducers are planning to dig in hard this fall before even\nentertaining the idea of more talks with the WGA, I’ve learned.\n“Not Halloween precisely, but late October, for sure, is the\nintention,” says a top-tier producer close to the Carol\nLombardini-run AMPTP. [...]</p>\n\n<p>Receiving positive feedback from Wall Street since the WGA went on\nstrike May 2, Warner Bros Discovery, Apple, Netflix, Amazon,\nDisney, Paramount and others have become determined to “break the\nWGA,” as one studio exec blatantly put it. To do so, the studios\nand the AMPTP believe that by October most writers will be running\nout of money after five months on the picket lines and no work.</p>\n\n<p>“The endgame is to allow things to drag on until union members\nstart losing their apartments and losing their houses,” a studio\nexecutive told Deadline. Acknowledging the cold-as-ice approach,\nseveral other sources reiterated the statement. One insider called\nit “a cruel but necessary evil.”</p>\n</blockquote>\n\n<p>Cold as ice indeed. There are very few people, in any field, who can go months without a paycheck.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/07/13/deadline-writers-strike\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"03ed574bf6aa64dd220b0dd00e14b129441ac9b62bd4dcc94bc48f896b071372","category":"Tech"}