{"title":"Oral glucose tolerance test clearance in type 2 diabetes patients who underwent remission following intense lifestyle modification: A quasi-experimental study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302777","date":1714744800000,"content":"<p>by Pramod Tripathi, Nidhi Kadam, Diptika Tiwari, Anagha Vyawahare, Baby Sharma, Thejas Kathrikolly, Maheshkumar Kuppusamy, Venugopal Vijayakumar</p>\r\n\r\nAchieving diabetes remission (HbA1c&lt;48mmol/mol without the use of anti-diabetic medication for 3 months) might not assure restoration of a normal glycemic profile [fasting blood sugar level &lt;5.6 mmol/L and Post-Prandial (PP) blood glucose &lt;7.8mmol/L]. The study investigates the factors associated with OGTT clearance in patients under type 2 diabetes remission. Four hundred participants who achieved remission during a one-year online structured lifestyle modification program, which included a plant-based diet, physical activity, psychological support, and medical management (between January 2021 and June 2022), and appeared for the OGTT were included in the study. OGTT clearance was defined by fasting blood glucose &lt; 5.6 mmol/L and 2-hour post-prandial blood glucose &lt;7.8 mmol/L post-consumption of 75g glucose solution. Of the 400 participants, 207 (52%) cleared OGTT and 175 (44%) had impaired glucose tolerance (<i>IGT</i>). A shorter diabetes duration (&lt;5 years) was significantly associated with OGTT clearance (p&lt;0.05). Pre-intervention use of glucose-lowering drugs showed no association with OGTT clearance (p&lt;0.1). Post-intervention, the <i>OGTT-cleared</i> group showed significantly higher weight loss (p&lt;0.05) and a decrease in HbA1c compared to the <i>IGT</i> group (p&lt;0.05). Improvement in Insulin resistance and β-cell function was also higher in the <i>OGTT-cleared</i> group compared to the <i>IGT</i> group (p&lt;0.05). In conclusion, clearing the OGTT is a possibility for those achieving remission through lifestyle interventions. Higher weight loss, a shorter duration of diabetes, and improvement in insulin resistance were significantly associated with OGTT clearance in participants in remission. Future randomized controlled trials with longer follow-ups may help substantiate our findings.","author":"Pramod Tripathi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"040109131c3e28791928ecf3fbcb3dc09cce34559d826b9c12240c585522b28e","category":"Interdisciplinary"}