{"title":"First Phase of Apple's New North Carolina Campus Will Total 900,000 Square Feet","link":"https://www.macrumors.com/2023/06/30/apple-north-carolina-campus-first-phase/","date":1688135887000,"content":"More than two years after Apple announced plans to <a href=\"https://www.macrumors.com/2021/04/26/apple-investment-create-20000-jobs/\">invest over $1 billion in North Carolina</a> with over half of that investment going towards a new engineering and research center in the Research Triangle area of Raleigh and Durham, the company has finally filed development plans for the first phase with local authorities.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2019/12/apple_rtp_land.jpg\" alt width=\"1600\" height=\"900\" /><em>Assemblage of seven properties in Research Triangle Park owned by Apple</em></div>\r<br />\nAs <a href=\"https://www.bizjournals.com/triangle/news/2023/06/30/apple-east-coast-campus-rtp-site-plans-buildings.html\">shared by the <em>Triangle Business Journal</em></a>, the 41-acre initial phase at Research Triangle Park will include six buildings and a parking garage totaling 700,000 square feet of office space, 190,000 square feet of accessory space, and almost 3,000 parking spaces.\r<br />\n\r<br />\nAmong the structures in the first phase are three office buildings with the largest coming in at around 242,000 square feet and the other two measuring just over 230,000 square feet each. All three buildings are listed as having heights of 73 feet.\r<br />\n\r<br />\nThree smaller accessory buildings will join a parking garage for the initial phase, which does not yet have a disclosed starting date for construction. A starting date does appear to be close, however, as Apple has begun some initial site preparations and is moving forward on obtaining various approvals.\r<br />\n\r<br />\nWhile this initial phase covers 41 acres, Apple owns a total of 281 acres at the site and the company's filed plans allude to future phases. Apple had said in its announcement about the North Carolina investment that it will eventually create at least 3,000 new jobs in \"machine learning, artificial intelligence, software engineering, and other cutting-edge fields\" with average salaries ultimately approaching $200,000.\r<br />\n\r<br />\nAt full buildout, Apple's Research Triangle Park campus is likely to become one of the company's largest employment centers in the United States after its Silicon Valley headquarters area and a major existing campus in Austin, Texas, that is <a href=\"https://www.macrumors.com/2018/12/13/apple-to-build-1-billion-campus-austin-texas/\">itself seeing significant investment and expansion</a>. Other major Apple employment centers in the U.S. include Southern California, the Seattle area, and New York City.\r<br />\n\r<br />\nAs Apple prepares to construct its major new campus in Research Triangle Park, the company has already been building up its presence in the region with <a href=\"https://www.macrumors.com/2021/07/29/apple-metlife-campus-nc/\">temporary space</a>, headlined by a takeover of one building of a three-building complex in neighboring Cary that had been built for insurance company MetLife.\r<br />\n\r<br />\nAmid the rise in remote work, MetLife was recently able to consolidate operations into two buildings of the complex, freeing up the third to be used by Apple. Apple has also been working to acquire additional temporary space in the area as it will be several more years before its own campus is ready.<br />This article, \"<a href=\"https://www.macrumors.com/2023/06/30/apple-north-carolina-campus-first-phase/\">First Phase of Apple's New North Carolina Campus Will Total 900,000 Square Feet</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/first-phase-of-apples-new-north-carolina-campus-will-total-900-000-square-feet.2394658/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0406822c89dd4e50f6b7f7c724f5db15e9c4752a5d020e4bd8f2de4bce3f08a5","category":"Apple"}