{"title":"PSVI-1 Backgrounding and finishing systems for cattle fed corn silages and corn grains differing in amylase expression","link":"https://academic.oup.com/jas/article/102/Supplement_2/341/7664780?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Amylase is a key enzyme involved in the hydrolysis of starch, which typically constitutes the predominant source of energy in feedlot cattle diets. Performance of cattle during the backgrounding phase can influence performance during the subsequent finishing phase. Our objective was to assess growth performance of backgrounding steers fed diets that contained combinations of corn silage (S) and steam-flaked corn (G) from hybrids with high amylase expression (Enogen corn; E; Syngenta Seeds, LLC) or common corn hybrid (C), as well as subsequent finishing performance, carcass characteristics, and liver abscess incidence when fed G produced from the same hybrids. Crossbred steers (n = 911; 306 ± 8 kg initial body weight) were assigned randomly to one of four backgrounding treatments with 12 replicates in a randomized complete block experiment using a factorial treatment arrangement. Factor 1 consisted of two corn silage hybrids (ES or CS), and factor 2 consisted of two SFC hybrids (EG or CG). In the subsequent finishing phase, animals were assigned to one of two treatments consisting of two grain hybrids (EG or CG) with 24 replicates per treatment. Backgrounding diets (dry basis) contained 20.1% flaked corn and 41.6% corn silage, and finishing diets contained 81.5% flaked corn with triticale silage as a common roughage source. There was no three-way interaction for measures of interest, and no differences among treatment combinations with respect to average daily gain (ADG) or incidence of abscessed livers (<span>P</span> &gt; 0.10). Steers fed CG during the backgrounding phase ate more than steers fed EG (<span>P</span> = 0.04), thus leading to improved overall efficiency of steers fed EG in the backgrounding phase compared with their counterparts fed CG (<span>P</span> &lt; 0.01; Table 1). Overall efficiency tended to be greater for cattle fed CG during the finishing phase (<span>P</span> = 0.06) compared with cattle fed EG during the finishing phase. There was a tendency for interaction between G fed in the backgrounding and G fed in the finishing phase for hot carcass weight (<span>P</span> = 0.07), such that steers fed the same hybrid in both phases had greater carcass weight compared with those fed different hybrids in the backgrounding and finishing phases. Type of grain fed in the backgrounding and finishing phases, but not silage, impacted overall system efficiency.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0407c89df7f90a36783cb41148f4daf04eeba067919c004e15a0755b9b53f3d7","category":"Environment"}