{"title":"VPN App Claims Apple Intentionally Blocking App Store Updates Amid Internet Crackdown in Myanmar","link":"https://www.macrumors.com/2021/03/23/protonvpn-app-store-dispute-myanmar/","date":1616506768000,"content":"ProtonVPN, a popular VPN choice for iOS users, claims that Apple is blocking \"important updates\" to its iOS app following a United Nations recommendation for the app to be used amid an internet crackdown in Myanmar.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/protonvpn-stop-sign-apple-1.jpeg\" alt=\"\" width=\"1200\" height=\"682\" class=\"aligncenter size-full wp-image-790430\" />\r\n<br/>\r\nIn a <a href=\"https://protonvpn.com/blog/apple-blocks-app-updates/\">blog post today</a>, the app says that Apple is blocking updates for the app due to an excerpt from the app's description. In the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, ProtonVPN says: \r\n<br/>\r\n\r\n<br/>\r\n<blockquote>Whether it is challenging governments, educating the public, or training journalists, we have a long history of helping bring online freedom to more people around the world.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\nIn an email to the developers, Apple says that the app needs to revise the description to exclude any action that \"encourages users to bypass geo-restrictions or content limitations.\" &zwnj;App Store&zwnj; <a href=\"https://developer.apple.com/app-store/review/guidelines/#legal\">rule 5.4</a>, which outlines policies for VPN apps on the platform, says that all apps must \"not violate local laws,\" and ProtonVPN makes the connection to the current ongoing situation in Myanmar, in which a military-led coup has shut down internet access for millions.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/IMG_1813.png\" alt=\"\" width=\"999\" height=\"622\" class=\"aligncenter size-full wp-image-790397\" /><div class=\"center-wrap\"><em>Email from Apple to ProtonVPN regarding update rejection</em></div>\r\n<br/>\r\n\r\n<br/>\r\nOn March 17, the United Nations advised people to document the ongoing situation as evidence for \"crimes against humanity.\" The UN specifically recommended that users use ProtonMail and/or Signal to share the information. Proton says, however, that users have also turned to ProtonVPN.\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>ProtonMail is not the only Proton app being used by activists and protesters in Myanmar. For the past month, the Myanmar military has forced the national telecom companies to regularly shut down the internet and block access to social media to prevent damaging evidence from getting out.\r\n<br/>\r\n\r\n<br/>\r\nThe people of Myanmar have also turned to ProtonVPN to get around these internet blocks, seek accurate news to stay safe, and report on the killings. In the days immediately after the coup, the sign-ups for ProtonVPN in Myanmar spiked to 250 times the previous average daily rate.\r\n<br/>\r\n\r\n<br/>\r\nOn the same day the UN recommended Proton apps, Apple suddenly rejected important updates to our ProtonVPN iOS app. These updates include security enhancements designed to further improve safeguards against account takeover attempts which could compromise privacy.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\nApple claims that one reason for rejection is the reference to \"challenging governments\" in its description. It's not clear when the app decided to add that excerpt, as the app has received plenty of app updates in the past without any rejections. It is plausible that the app added the description as part of a recent update, triggering Apple's rejection, which just so happens to line up with the situation in Myanmar.\r\n<br/>\r\n\r\n<br/>\r\nWe've reached out to Apple to clarify the situation and we'll update the article if we hear back.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/23/protonvpn-app-store-dispute-myanmar/\">VPN App Claims Apple Intentionally Blocking App Store Updates Amid Internet Crackdown in Myanmar</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=6-ogx5Jr4XU:LrTdC8_izu4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=6-ogx5Jr4XU:LrTdC8_izu4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/6-ogx5Jr4XU\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"04095f0e37c2c1835732d6d14374622bb49d45525a3fbb01753fe034cd790c63","category":"Apple"}