{"title":"Impacts of polycultural cropping on crop yields and biodiversity: A systematic map protocol","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12349?af=R","date":1721442544000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/abd9d3b7-624b-4f9a-beda-aa03b4e420b9/eso312349-toc-0001-m.png\" alt=\"Impacts of polycultural cropping on crop yields and biodiversity: A systematic map protocol\" />\n<p>Do we need to sacrifice biodiversity in some landscapes in order to conserve biodiversity in others? This protocol sets out the methodology for a systematic map of evidence on yield- and biodiversity-outcomes in ‘polycultures’—systems of cultivation where multiple crop species are grown simultaneously at field-scale. The map will facilitate ongoing assessments of polyculture as a tool to bridge the currently conflicting priorities of food production and biodiversity conservation—moving beyond the classical land-sharing/land-sparing dichotomy.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAgriculture is currently the largest driver of biodiversity-loss worldwide. There is a critical need to develop agricultural systems that protect and promote biodiversity, while also meeting local and global food needs. Ecological theory suggests that cultivating crops in diverse mixtures both maximises niche occupancy and generates additional niches, generating both higher yields <i>and</i> higher biodiversity than cultivation in monocultures. A large and growing body of agronomic research provides strong evidence for the potential productivity and biodiversity benefits of in-field crop-diversification strategies. This protocol sets out a methodology for a systematic map of evidence on yield- and biodiversity-outcomes in ‘<i>polycultures</i>’—systems of cultivation where multiple food crop species are grown together simultaneously at field-scale.\n\nSystematic searches with a global scope will be conducted in Web of Science Core Collection, Scopus, and CAB Abstracts to yield a comprehensive sample of relevant published, peer-reviewed literature. The articles returned by searches will be subject to eligibility screening according to pre-defined inclusion criteria, at successive stages (title and abstract, and full text). Following this, we will extract data from eligible studies on study designs, survey and sampling protocols, experimental treatments and comparators, and outcomes measured.\n\nA narrative synthesis, illustrated by tables, figures and maps, will describe the quantity and characteristics of the available evidence on the impacts of polycultural cropping on (i) crop yields, and (ii) agroecosystem biodiversity. We will also identify the research that examines these two outcomes in parallel. The synthesis will be accompanied by a published database containing bibliographic information as well as data (see ‘2’) on study characteristics and outcomes.\n\n<i>Practical implications</i>. The anticipated systematic map will provide a synthesis of current evidence regarding the potential yield- and biodiversity-impacts of polycultural cropping. We will identify key knowledge gaps, and ‘clusters’ of related evidence that could lend themselves to further quantitative synthesis via subsequent systematic reviews and/or meta-analyses. As such, the work will facilitate future appraisal of the potential of polyculture as a tool to bridge the currently conflicting priorities of food production on the one hand and biodiversity conservation on the other.\n</p>","author":"Daisy A. Martinez, \nAlfred Gathorne‐Hardy, \nBarbara M. Smith","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"040b53f9902fb2b689bba542f9607dd4ae576e7663d4a34b98cf65a999ea5caa","category":"Environment"}