{"title":"Assessing current visual tooth wear age estimation methods for <i>Rangifer tarandus</i> using a known age sample from Canada","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301408","date":1712066400000,"content":"<p>by Grace Kohut, Robert Losey, Susan Kutz, Kamal Khidas, Tatiana Nomokonova</p>\r\n\r\nAge estimation is crucial for investigating animal populations in the past and present. Visual examination of tooth wear and eruption is one of the most common ageing methods in zooarchaeology, wildlife management, palaeontology, and veterinary research. Such approaches are particularly advantageous because they are non-destructive, can be completed using photographs, and do not require specialized training. Several tooth wear and eruption methods have been developed for <i>Rangifer tarandus</i>, a widely distributed and long-utilized species in the North. This paper evaluates the practicality and effectiveness of three existing visual tooth wear and eruption methods for this species using a large known-age sample from several caribou populations in northern Canada (Bluenose East, Bluenose West, Dolphin-Union, Qamanirjuaq, and Beverly herds). These methods are evaluated based on: (1) the amount of error and bias between estimated and actual ages, (2) suitable and interpretable results, (3) user-friendly and unambiguous procedures, and (4) which teeth and visual features of those teeth are used to record wear and eruption status. This study finds that the three evaluated methods all have variable errors and biases, and two show extensive biases when applied to older individuals. Demographic data is simpler to generate and more flexible to report when methods allow age to be estimated as a continuous or discrete variable, rather than as age ranges. The dentition samples used by two of the previously developed methods impact their applicability to other populations of <i>Rangifer</i>. In one existing method, individuals were unavailable from some age ranges leaving gaps when assigning ages. For another <i>Rangifer</i>-ageing method, the population utilized was too distinct in morphology or diet to be used with the Canadian caribou analyzed here. Additional refinement of tooth wear and eruption ageing methods will benefit zooarchaeological research on reindeer and caribou remains.","author":"Grace Kohut","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"041ce8466efc304094591c19d637e0cb2d276930fa0eba3a2cb7ec028c1480fe","category":"Interdisciplinary"}