{"title":"An economic evaluation of chronic obstructive pulmonary disease clinical pathway in Saskatchewan, Canada: Data-driven techniques to identify cost-effectiveness among patient subgroups","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301334","date":1711980000000,"content":"<p>by John Paul Kuwornu, Fernando Maldonado, Gary Groot, Elizabeth J. Cooper, Erika Penz, Leland Sommer, Amy Reid, Darcy D. Marciniuk</p>\r\nBackground <p>Saskatchewan has implemented care pathways for several common health conditions. To date, there has not been any cost-effectiveness evaluation of care pathways in the province. The objective of this study was to evaluate the real-world cost-effectiveness of a chronic obstructive pulmonary disease (COPD) care pathway program in Saskatchewan.</p> Methods <p>Using patient-level administrative health data, we identified adults (35+ years) with COPD diagnosis recruited into the care pathway program in Regina between April 1, 2018, and March 31, 2019 (<i>N</i> = 759). The control group comprised adults (35+ years) with COPD who lived in Saskatoon during the same period (<i>N</i> = 759). The control group was matched to the intervention group using propensity scores. Costs were calculated at the patient level. The outcome measure was the number of days patients remained without experiencing COPD exacerbation within 1-year follow-up. Both manual and data-driven policy learning approaches were used to assess heterogeneity in the cost-effectiveness by patient demographic and disease characteristics. Bootstrapping was used to quantify uncertainty in the results.</p> Results <p>In the overall sample, the estimates indicate that the COPD care pathway was not cost-effective using the willingness to pay (WTP) threshold values in the range of $1,000 and $5,000/exacerbation day averted. The manual subgroup analyses show the COPD care pathway was dominant among patients with comorbidities and among patients aged 65 years or younger at the WTP threshold of $2000/exacerbation day averted. Although similar profiles as those identified in the manual subgroup analyses were confirmed, the data-driven policy learning approach suggests more nuanced demographic and disease profiles that the care pathway would be most appropriate for.</p> Conclusions <p>Both manual subgroup analysis and data-driven policy learning approach showed that the COPD care pathway consistently produced cost savings and better health outcomes among patients with comorbidities or among those relatively younger. The care pathway was not cost-effective in the entire sample.</p>","author":"John Paul Kuwornu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"042231508bd9937b1dcf79d57765ce511023b8a0caea469d34d20ccca3cde8a2","category":"Interdisciplinary"}