{"title":"iPhone SE 4: Prototype used as test unit for Apple’s 5G modem, according to report","link":"https://www.macworld.com/article/1354114/iphone-se-4-design-specs-features-release-date.html","date":1681397277000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple updated its entry-level iPhone in March 2022, adding a few nips and tucks here and there along with a quiet price increase. But the aging design and minimal upgrades meant the new iPhone SE was coolly received, with many looking forward to the next generation and reviewers hoping Apple was planning a more radical overhaul of the device. </p>\n\n\n\n<p>Right on cue, rumors are now starting to appear about what that might look like. In this article we’ve gathered together everything we know so far, and what we can reasonably speculate, about the iPhone SE 4.</p>\n\n\n\n<p><em><strong>Update 04/13/23:</strong> Analyst Ming-Chi Kuo <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1646502136988180480&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\">tweeted</a> that the iPhone SE 4 is dead (again)</em> <em>and that Apple is using an engineering prototype iPhone SE to test its 5G modem.</em> <em>Kuo’s tweet comes a day after a MacRumors report of an Apple fourth-generation iPhone SE with an Apple-designed 5G modem in 2025.</em></p>\n\n\n\n<h2>iPhone SE 4 release date: When will the iPhone SE 4 be released?</h2>\n\n\n\n<p>Apple’s iPhone SE doesn’t follow the same predictable annual release schedule as the standard line, and the intervals between updates can be harder to predict. The timing of the next launch points to a biennial routine, but that followed a far longer gap between the first and second phones. Here’s when the three models released so far made their debut:</p>\n\n\n\n<ul><li><a href=\"https://www.macworld.com/article/624052/iphone-se-2022-review.html\">iPhone SE (3rd gen)</a>: March 2022</li><li><a href=\"https://www.macworld.com/article/668001/iphone-se-2020-review.html\">iPhone SE (2nd gen)</a>: April 2020</li><li><a href=\"https://www.macworld.com/article/667407/iphone-se-review.html\">iPhone SE (1st gen)</a>: March 2016</li></ul>\n\n\n\n<p>As you can see, after Apple introduced the SE line back in 2016 we had to wait four years until the device was updated—so long that the original SE was discontinued in September 2018. The 2nd generation moved it from the iPhone 5/5S design to the iPhone 6/6S style it retains to this day. Since then we’ve had two versions, two years apart. With that in mind, it seems likely that the iPhone SE (4th gen) will arrive in March or April of 2024. </p>\n\n\n\n<p>Ross Young of Display Supply Chain Consultants, a reliable industry expert who specializes in displays and is very accurate with his predictions, also thinks a new iPhone SE will arrive in 2024. Another analyst, Jeff Pu, thinks that the iPhone SE will arrive in 2025, but Pu isn’t as reliable as Young or analyst Ming-Chi Kuo.</p>\n\n\n\n<p>Kuo <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1630241484443377666&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\">tweeted</a> in February 2023 that Apple restarted development of the iPhone SE 4 after putting the project on hold. However, in April 2023, Kuo <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1646502136988180480&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\">tweeted</a> that his February report was incorrect and that Apple is using a prototype iPhone SE to test its 5G modem. Kuo states that “there are no plans for mass production and sales” of this prototype iPhone SE.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Which-iPhone-do-I-have-iPhone-SE-2022.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Front panel of the iPhone SE 3rd Generation\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/Which-iPhone-do-I-have-iPhone-SE-2022.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Which-iPhone-do-I-have-iPhone-SE-2022.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Which-iPhone-do-I-have-iPhone-SE-2022.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Which-iPhone-do-I-have-iPhone-SE-2022.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Which-iPhone-do-I-have-iPhone-SE-2022.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Which-iPhone-do-I-have-iPhone-SE-2022.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/05/Which-iPhone-do-I-have-iPhone-SE-2022.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption>Apple’s current budget phone, the iPhone SE (2022)</figcaption></figure><p>Dominik Tomaszewski</p></div>\n\n\n\n<h2>How much will the iPhone SE 4 cost?</h2>\n\n\n\n<p>Pricing has steadily increased across the three existing generations, no doubt influenced by the global cost of components and distribution. While the iPhone SE (3rd generation) was released around the same price as the model it replaced, Apple added a chunk onto the cost, making the current model somewhat less desirable than previous iterations, especially when you factor in the measly amount of storage that comes with the baseline model. Here’s how they line up:</p>\n\n\n\n<p><strong>iPhone SE (3rd gen, 2022):</strong></p>\n\n\n\n<ul><li>64GB: $429/£449</li><li>128GB: $479/£499</li><li>256GB: $579/£609</li></ul>\n\n\n\n<p><strong>iPhone SE (2nd gen, 2020): </strong></p>\n\n\n\n<ul><li>64GB: $399/£419</li><li>128GB: $449/£469</li><li>256GB: $549/£569</li></ul>\n\n\n\n<p><strong>iPhone SE (1st gen, 2016): </strong></p>\n\n\n\n<ul><li>32GB: $399/£379</li><li>128GB: $499/£449</li></ul>\n\n\n\n<p>However, the iPhone SE needs to be inexpensive, and we’d be surprised to see much of an increase with the next generation, even with several rumored upgrades. </p>\n\n\n\n<h2>What will the new iPhone SE look like?</h2>\n\n\n\n<p>As the iPhone SE has always traditionally been one of the smallest devices Apple offers, it seems logical that the discounted iPhone 13 mini format might make its way down to replace the iPhone 6 chassis on the SE. But this is only one of several futures Apple could choose for the SE line.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>On a recent episode of the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://podcasts.apple.com/gb/podcast/the-iphone-14-is-upon-us-w-jon-prosser/id1218876801?i=1000577612612&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Geared Up podcast</a>, tech tipster Jon Prosser said the “iPhone SE 4… is just the iPhone XR,” meaning it has an “all-screen” design and a 6.1-inch display. </p>\n\n\n\n<p>However, a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2022/10/31/iphone-se-4-2024-display-rumors/&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\">report by Ross Young</a> in late October claimed that Apple is also mulling a 5.7-inch display as well, which would be a new size for an iPhone. The iPhone 13 mini is 5.4 inches and the iPhone X and XS were 5.8 inches. Young also says that Apple is deciding whether to use LCD or OLED for the display.</p>\n\n\n\n<p>In February 2023, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1630241484443377666&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\">analyst Ming-Chi Kuo reported</a> that Apple is moving forward with a 6.1-inch OLED display for the iPhone SE 4. Overall design and features are expected to be similar to the base iPhone 14 (which will be a 1.5-year old model by the time the SE 4 is released).</p>\n\n\n\n<h2>What features will the iPhone SE 4 have?</h2>\n\n\n\n<p>Even though the iPhone SE 4 is rumored to have a notch, it might not have Face ID. Apple has established Face ID as a feature of its higher-end products (iPhone and iPad Pro), and leakers are unsure whether it will have the face-scanning tech. Having a notch without Face ID would be weird but not unprecedented—remember the MacBook Pro has a notch that only houses the front camera. We’ve seen older reports from industry analyst Ming Chi-Kuo (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/12/08/apple-to-launch-new-iphone-se-models-2022-2023/&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">via MacRumors</a>) and Chinese tech site <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://news.mydrivers.com/1/790/790144.htm&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MyDrivers</a> claiming that Apple will move the Touch ID sensor to the power button as in the 10th-gen iPad. </p>\n\n\n\n<p>Renders by Ian Zelco on Front Page Tech show the iPhone SE 4 with a single camera, so you can probably expect a similar 12MP wide-angle lens. However, we’re hoping it includes some of the features we didn’t get with the iPhone SE 3, namely Night Mode and Cinematic Mode.</p>\n\n\n\n<p>Depending on when it comes out, it could get the enhanced A15 chip that’s in the iPhone 14 or the newer A16. Neither would be much of an improvement over the A15 in the current model.</p>\n\n\n\n<p>The iPhone SE 4 might be the first iPhone to feature one of Apple’s own 5G modems. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1630241484443377666&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\">Analyst Ming-Chi Kuo expects it to be</a>, and claims the baseband chip will be manufactured with a 4nm process and support only sub-6GHz bands. In April 2023, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/04/12/iphone-se-5g-modem-2025-launch-rumor/&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\">MacRumors</a> reported that analyst Jeff Pu believes that Apple will release a fourth-generation iPhone SE with an Apple-designed 5G modem in 2025. TSMC will manufacture the modem chip. However, Pu doesn’t have a track record for accuracy like other analysts. In April, Kuo <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1646502136988180480&amp;xcust=1-1-1354114-1-0-0&amp;sref=https://www.macworld.com/feed\">tweeted</a> that the iPhone SE 4 is dead (again) and that Apple is using an engineering prototype iPhone SE to test its 5G modem. Kuo does not think this prototype iPhone will be developed, produced, and put doon the market.</p>\n\n\n\n<p>With the iPhone 13 range moving to a baseline of 128GB (and the 14-series handsets following suit), it’s hoped that the new iPhone SE might do likewise, as 64GB really isn’t enough for most people anymore, especially since system files take up more than 10GB. But we’re not terribly hopeful—the iPhone SE (3rd gen) launched after the iPhone 13 range and still started with the same 64GB of storage, and the redesigned 10th-generation iPad also starts at 64GB. We explain more about this in <a href=\"https://www.macworld.com/article/678535/why-you-shouldnt-buy-the-64gb-iphone-se.html\">why you shouldn’t buy the 64GB iPhone SE</a>.</p>\n\n\n\n<p>Hopefully, we won’t have to wait too long to find out. We’ll update this article as more information becomes available, so check back regularly to see what we can dig up. In the meantime, if you can’t wait until next year, here’s a roundup of the <a href=\"https://www.macworld.com/article/672801/best-iphone-deals.html\">best iPhone deals</a> available at the moment. </p>\n\niPhone, Smartphones</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0428e27cfc720b71e0b3c898af16da6e51dd719c0f0f6f68d7fa7dcd65c4fb1c","category":"Apple"}