{"title":"Effects of incubation temperature on the upper thermal tolerance of the imperiled longfin smelt (Spirinchus thaleichthys)","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae004/7604666?rss=1","date":1707523200000,"content":"<span><div>Abstract</div>Upper thermal limits in many fish species are limited, in part, by the heart’s ability to meet increased oxygen demand during high temperatures. Cardiac plasticity induced by developmental temperatures can therefore influence thermal tolerance. Here, we determined how incubation temperatures during the embryonic stage influence cardiac performance across temperatures during the sensitive larval stage of the imperiled longfin smelt. We transposed a cardiac assay for larger fish to newly hatched larvae that were incubated at 9°C, 12°C or 15°C. We measured heart rate over increases in temperature to identify the Arrhenius breakpoint temperature (T<sub>AB</sub>), a proxy for thermal optimum and two upper thermal limit metrics: temperature when heart rate is maximized (T<sub>peak</sub>) and when cardiac arrhythmia occurs (T<sub>Arr</sub>). Higher incubation temperatures increased T<sub>AB</sub>, T<sub>peak</sub> and T<sub>Arr</sub>, but high individual variation in all three metrics resulted in great overlap of individuals at T<sub>AB</sub>, T<sub>peak</sub> and T<sub>Arr</sub> across temperatures. We found that the temperatures at which 10% of individuals reached T<sub>peak</sub> or T<sub>Arr</sub> and temperatures at which number of individuals at T<sub>AB</sub> relative to T<sub>peak</sub> (ΔN(T<sub>AB,</sub>T<sub>peak</sub>)) was maximal, correlated more closely with upper thermal limits and thermal optima inferred from previous studies, compared to the mean values of the three cardiac metrics of the present study. Higher incubation temperatures increased the 10% T<sub>peak</sub> and T<sub>Arr</sub> thresholds but maximum ΔN(T<sub>AB,</sub>T<sub>peak</sub>) largely remained the same, suggesting that incubation temperatures modulate upper thermal limits but not T<sub>opt</sub> for a group of larvae. Overall, by measuring cardiac performance across temperatures, we defined upper thermal limits (10% thresholds; T<sub>peak</sub>, 14.4–17.5°C; T<sub>Arr</sub>, 16.9–20.2°C) and optima (ΔN(T<sub>AB,</sub>T<sub>peak</sub>), 12.4–14.4°C) that can guide conservation strategies for longfin smelt and demonstrated the potential of this cardiac assay for informing conservation plans for the early life stages of fish.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"042e000ff679cc44c1f1f6850e0823c1e8209e5d566116d14a403e9f4c23f89c","category":"Environment"}