{"title":"Morphology and motor behavior of endemic fishes in the upper reaches of the Yangtze River basin","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15670?af=R","date":1707455409000,"content":"<h2>Abstract</h2>\n<p>Dam construction alters the hydrodynamic conditions, consequently impacting the swimming behavior of fish. To explore the effect of flow hydrodynamics on fish swimming behavior, five endemic fish species in the upper Yangtze River basin were selected. Through high-speed video visualization and computer analysis, these species' swimming patterns under different flow velocities (0.1–1.2 m/s) were investigated. The kinematic and morphological characteristics of the fish were presented. The principal component analysis was used to analyse the main factors influencing the swimming ability of fish and to determine the correlation coefficients among fish behavior indicators. Fish exhibited three different swimming patterns under different flow velocities. Low velocity (0.1–0.3 m/s) corresponds to free motion, middle velocity (0.4–0.7 m/s) corresponds to cruising motion, and high velocity corresponds to stress motion (0.8–1.2 m/s). The fish kinematic index curves were obtained, and four of five fish species showed two extreme points, which means the optimal and adverse swimming strategies can be determined. With the increase in flow velocity, the tail-beat frequency showed an increasing trend, whereas the tail-beat angle and amplitude showed a decreasing trend. Morphological and kinematic parameters were the two main indexes that affect the swimming ability of fish, which accounts for 41.9% and 26.9%, respectively.</p>","author":"Shikang Liu, \nChengyang Cao, \nYuqian Xi, \nPengcheng Li, \nXuefeng Chen, \nLirong Xiao, \nWeiwei Yao","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"042e23692e618207618a2640bdae23bd3f38110d42976e1a44e5fa657d8b482e","category":"Environment"}