{"title":"Optimization of the Factors Affecting Biogas Production Using Taguchi Design of Experiment Method","link":"https://www.preprints.org/manuscript/202404.1030/v1","date":1713256450000,"content":"The present study analyzed the effect of temperature, pH, retention time, pretreatment and mixing ratio on the anerobic digestion process. The parameters during the anaerobic co digestion of cow manure and food waste were then optimized using the Taguchi experimental design method. ANOVA is carried out to find the significant parameters which influence the biogas production. Experimental tests were carried out at laboratory scale reactors kept at different temperatures (28 °C, 35 °C, and 50 °C). The specific methanogenic Performance (SMP) during anerobic digestion at higher temperatures was characterized with the analysis of acetate, propionate, butyrate, hydrogen, glucose, and formate. The improvement of biogas production with different pre-treatment i.e., ultrasonic, autoclave, and microwave techniques also analysed. The results showed that reactor that maintained at 35 °C showed the highest biogas production. While the reactor that maintained at lower temperature (28 °C) produced the lower volume of biogas. As the retention time increases, the amount of biogas produced increases. Methanogenic activities of microorganisms reduced at higher temperature conditions (65 °C). Biogas production increased by 28.1%, 20.23%, and 13.27 % when the of substrates treated with ultrasonic, autoclave, and microwave, respectively, compared to the untreated substrate. The optimized condition for the highest biogas production during anaerobic co digestion of food waste and cow manure is temperature of 35 °C, pH of 7 and mixing ratio (CM: FW=1.5:0.5). ANOVA showed that temperature is the most important input parameter affecting biogas production, followed by mixing ratio.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0433fe8c21427e969c21d4de7265fba3258ddc6b76893c43dbbb1fff54231eaa","category":"Interdisciplinary"}