{"title":"“Very sick” pet cat gave Oregon resident case of bubonic plague","link":"https://arstechnica.com/?p=2002891","date":1707771430000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-1973904344-800x532.jpeg\" alt=\"A cat, but not the one with plague.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-1973904344-scaled.jpeg\">Enlarge</a> <span>/</span> A cat, but not the one with plague. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/february-2024-baden-w%C3%BCrttemberg-b%C3%B6singen-a-tomcat-is-lying-news-photo/1973904344?adppopup=true\">Getty | Silas Stein</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>An Oregon resident contracted bubonic plague from their \"very sick\" pet cat, marking the first time since 2015 that someone in the state has been stricken with the Black Death bacterium, <a href=\"https://www.deschutes.org/health/page/deschutes-county-confirms-case-human-plague-local-resident\">according to local health officials.</a></p>\n<p>Plague bacteria, <em>Yersinia pestis</em>, circulates cryptically in the US in various types of rodents and their fleas. It causes an average of seven human cases a year, with a range of 1 to 17, according to the Centers for Disease Control and Prevention. The cases tend to cluster in two regions, the CDC notes: a hotspot that spans northern New Mexico, northern Arizona, and southern Colorado, and another region spanning California, far western Nevada, and southern Oregon.</p>\n<p>The new case in Oregon occurred in the central county of Deschutes. It was fortunately caught early before the infection developed into a more severe, systemic bloodstream infection (septicemic plague). However, according to <a href=\"https://www.nbcnews.com/health/health-news/oregons-first-case-human-plague-8-years-likely-came-cat-rcna138090\">a local official who spoke with NBC News,</a> some doctors felt the person had developed a cough while being treated at the hospital. This could indicate progression toward pneumonic plague, a more life-threatening and more readily contagious variety of the plague that spreads via respiratory droplets. Nevertheless, the person's case reportedly responded well to antibiotic treatment, and the person is recovering.</p></div><p><a href=\"https://arstechnica.com/?p=2002891#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2002891&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"043a8563b001cb0d67121f2e6a59b064404176723538f9c4472400d9e5e2307c","category":"Tech"}