{"title":"Beta-Cyclodextrin Molecules (&beta;‐CD) Modified PVDF Membranes to Remove Multi-Ionic Dye Solutions using Steric, Inclusion, and Dielectric Exclusion","link":"https://www.preprints.org/manuscript/202404.1247/v1","date":1713442068000,"content":"In this study, we aim to evaluate how cyclodextrin molecules affect the hydrophilicity and selec-tivity of PVDF membrane. Herein, we prepared PVDF-PVP(1-x) β-CDx membranes, with x rang-ing from 0 to 1 wt%. The membranes were deeply characterized by means of X-ray diffraction (XRD), attenuated total reflectance infrared (ATR-IR), Raman spectroscopies, Thermal gravimet-ric analysis (TGA), Contact angle measurement (CA), scanning electron microscopy (SEM) and atomic force microscopy (AFM). The study unequivocally demonstrates the effectiveness of the addition of β-CD molecules on membranes' structural, morphological, and dielectric properties. Adding 0.25wt% β-CD enhanced hydrophilicity, with CA decreasing from 72.6° to 56° and roughness decreasing from 81 to 29 nm. The PVDF-PVP(1-x) β-CDx membranes were then fully characterized using electrochemical impedance spectroscopy (EIS) to determine their dielectric properties, which clearly showed that the presence of β-CD induced polarization of the mem-brane. The separation of various dyes with different sizes and charges was utilized. These dyes included methylene blue (MB, positive, 0.504 nm), methyl red (MR, neutral, 0.487 nm), rose Bengal (RB, negative, 0.588 nm), and brilliant blue (BB, negative, 0.798 nm). Based on our re-search, we found that the membrane's selectivity is determined by both exclusion factors (such as size and dielectric properties) and inclusion inside the β-CD cage. We found that using alpha-CD instead of beta-CD led to the disappearance of dye inclusion. These findings strongly sug-gest that β-CD molecules can be a viable solution for dye removal from wastewater.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"044081653ad29aacb7625d9c30fb260ed1bc3947ae5d009c73ccb652680f84e7","category":"Interdisciplinary"}