{"title":"219 Winter nutritional dynamics of Idaho fescue and bluebunch wheatgrass on a Montana foothill rangeland","link":"https://academic.oup.com/jas/article/102/Supplement_3/185/7757389?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The objectives of this study were to quantify the change and variation in forage quality of Idaho fescue (<span>Festuca idahoensis</span>) and bluebunch wheatgrass (<span>Pseudoroegneria spicata</span>) over the course of two consecutive winters. Five sites were selected from within a 1064-ha, foothill grassland management unit at Red Bluff Research Ranch in Norris, MT. Beginning mid-October and ending early February, a minimum of seven ungrazed individuals of Idaho fescue and bluebunch wheatgrass were clipped at each site every 14 d, for a total of nine sampling dates. This was repeated for two consecutive winters. Samples were analyzed for crude protein (CP), acid detergent fiber (ADF), and neutral detergent fiber (NDF). Data were analyzed as a repeated measures completely randomized design. Idaho fescue had greater CP than bluebunch wheatgrass across all sampling dates and both years (<span>P</span> &lt; 0.01); however, at each sampling date, Idaho fescue also had a greater variation in CP than bluebunch wheatgrass (<span>P</span> = 0.02). Across species, there was no difference in CP between sampling dates in yr 1 (<span>P</span> ≥ 0.1); however, in yr 2, there was a tendency for a positive linear contrast (<span>P</span> = 0.05). In yr 1, ADF was greater in Idaho fescue than bluebunch wheatgrass; however, in yr 2, ADF was greater in bluebunch wheatgrass than Idaho fescue (<span>P</span> &lt; 0.05). In yr 1, there was a positive cubic contrast for ADF between sampling dates (<span>P</span> &lt; 0.05), and in yr 2 there was a tendency for a negative quadratic contrast between sampling dates (<span>P</span> = 0.06). There was no difference in NDF between sampling dates (<span>P</span> = 0.27); however, NDF was greater in yr 2 than yr 1 (<span>P</span> &lt; 0.01). There was a tendency for greater NDF in bluebunch wheatgrass than Idaho fescue (<span>P</span> = 0.06). The forage quality of Idaho fescue and bluebunch wheatgrass is relatively stable during the dormant season compared with the growing season. The differences between species are greater and more consistent in CP. The differences between years are greater in ADF and NDF. If forage quality is temporally uniform during the winter, then the diet quality of livestock must therefore be controlled by other factors such as stocking rate, selectivity, and spatial use of the pasture. Under moderate stocking rates, livestock may be able to select a greater quality diet than is presented here.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"044d19bba0bc5ca00bb3c98e08eebb91b6843f0c5713ac73eedd14360c0ae8dc","category":"Environment"}