{"title":"Fred Wright's Classics Diary - Competitive card games, killing time, and hanging on to the Big Three","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/fred-wrights-classics-diary-competitive-card-games-the-mandalorian-and-hanging-on-to-the-big-three","date":1680261060000,"content":"\n      <p><em><span>Fred Wright has been knocking on a big win for the past two seasons – he's always present at the front of the toughest Classics, whether that is fighting for his own result or supporting the likes of </span>Matej Mohorič. After his seventh place finish at the Tour of Flanders last year, the British rider is hoping to go even better in 2023. His form has been building solidly in races like E3 Saxo Bank, Gent-Wevelgem and Dwars door Vlaanderen, and he's currently in the Bahrain-Victorious team house preparing for the big one on Sunday. He spoke to Rouleur to give an inside look into the how the week as gone so far and what he's expecting from De Ronde.</em></p>\n<p><span>After Dwars door Vlaanderen yesterday, I’m a little bit tired but not too bad. I’ve just finished watching the latest episode of the Mandalorian, there’s also pool table and table football in the villa where our team is staying, so there's plenty of options here for stuff to do, but today was more about just relaxing and having a nap. We’ve been playing quite a lot of cards and we have a full scoreboard, I managed to win last night which was a good consolation prize after the race.</span></p>\n<div></div>\n<p><span>I was potentially going to do recon of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a> today, but I looked back to last year and I didn't do one then. I just did easy rides, so I'm going to do the same thing this year – I think the best thing to do is just rest up. </span><span>Kortrijk</span> is only about 15km away from where we are staying so today we jumped on the canal and rode there to have a coffee and it was lovely. It looked like I made the right decision not to do the recon because from what the guys are saying, Matej was absolutely smashing it, I definitely wouldn't have enjoyed that.</p>\n<p><span>We have a chef here too, so it’s always nice food after the races. It’s different from last year as we have a nutritionist helping with carb quantities. It gets a bit dull always measuring how many carbs you’re eating but it does make a difference for the races because you can overeat in some of these periods and also under eat, so it's getting that nailed. Last night it was quite simple, pasta with tomato sauce, then some kebabs afterwards and a little brownie to finish. </span></p>\n<p><span>I think having this shared house keeps things fresh for this period, I’m glad I don’t just have to spend these days in a hotel room, that could get a bit demoralising. Having a house where you can sit in a communal space is so much better. We always end up watching previous editions of the races as well the night before or two days before our race. There’s a good atmosphere between us.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1477797399_1024x1024.jpg?v=1680253868\" alt /><em>Wright and his teammates during Dwars door Vlaanderen 2023 (Image: Tim de Waele/Getty)</em></span></p>\n<p><span>My Belgian Classics block started with <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-best-of-three-why-wout-van-aert-s-win-in-e3-saxo-bank-classic-could-be-his-most-important-yet\">E3 Saxo Classic</a>. I was happy with how that went comparing it to last year where I really messed up the positioning coming into the Taienberg, so I wasn’t able to do anything and that was it, I was out of the race from that point. </span></p>\n<p><span>This year, we had to nail it and make sure we were there and I did that – I was probably eighth wheel going into the </span><span>Taienberg</span>. That's where it exploded. Pogačar was a bit further back so he came past me at the top and went straight to the front of our group of six or seven guys that were chasing Wout and Mathieu. He just completely drilled it and that finished me off. I couldn't recover from that effort.</p>\n<p><span>It's hard because you have to keep putting yourself in the right position before these next climbs, they’re so constant. E3 is harder than Flanders in some ways as you do so many climbs in such a short space of time. I was a bit disappointed at the finish because unlike last time, I put myself in the right place, but when those three had gone, that was it, I just didn’t have the legs.</span></p>\n<p><span>I'd like to think it will be different in Flanders, but in a race like E3, one of them is going to twat it on the </span><span><span>Taienberg</span> and then they're just taking chunks out of each other on the climbs after that. Matej was so nearly with them but in E3, it’s about nothing but legs. It’s not the race when you can do a preemptive attack, everyone is waiting for that moment on the </span><span><span>Taienberg</span></span> then it’s flat out until the finish. There were a couple of moments where I was just hanging on to the group for dear life.</p>\n<p><span>At Gent-Wevelgem a few days later, I think the bad weather definitely played into my favour. I really got my layers and clothing right. I didn’t feel cold at all, which is an achievement in itself. With days like that if you're motivated and happy with the weather, you have already beaten quite a lot of guys in the bunch. I also probably had better legs that day than in E3. I wouldn’t have been able to follow the Jumbo guys when they went over the Kemmelberg but I wasn’t far off, I was in the group behind them with Matej. The chase just didn’t really materialise, if we got everyone working together earlier we probably would have got them back.</span></p>\n<p><span>I think everyone’s legs were just falling off. That was frustrating, because compared to everyone else, I was probably one of the strongest in that group and then I was too far back on this roundabout with about 15km to go. There was a bit of crosswind and the guys in front of me let the wheel go and I couldn't get back into the group. If I’d had the chance to go for the sprint I would have been able to get a result It was a bit like, why have I just done six hours in the rain, taking years off my life and messed up the chance of getting a result from it?</span></p>\n<p><span>Compared to last year, I’m still not there yet with positioning and getting in the right place but I am getting better, I haven’t had a result yet, but I’m up there a lot more than I was previously.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW--02745-_2_1024x1024.jpg?v=1680253893\" alt /></span><em><span>Wright during the Tour of Flanders 2022 (Image: Zac Williams/SWpix)</span></em></p>\n<p><span>At Dwars door Vlaanderen, the course itself is a little bit easier, there's more of a break between the climbs. It was still really hard but not the same level as Gent or E3. I was fine until I just drifted back a bit too much before the climb where Alaphilippe dropped his chain, then Merlier crashed and I couldn’t quite get round him, so I had to chase back on. This sapped me enough that I couldn’t quite follow the move that was chasing the breakaway. While it did all come back together in the end, I wanted to be in the race more so we have more cards to play. It’s all learning leading up to Sunday.</span></p>\n<p><span>Over the next few days, ideally I’d like to look at some of the roads tomorrow and do a couple of hours riding, but the weather is not looking very good at all. Last year the weather was really bad leading up to the Tour of Flanders, I was just on the turbo leading up to the race. If I have to do that again this year, I’m not too worried. I’m in a position now where I know the race pretty well, it’s not the end of the world if I can’t see the course, I could probably list the route off the top of my head.</span></p>\n<p><span>Matej has shown he's definitely the best shot at the podium out of all of us, but we have to look at the earlier movies and climbs to try and get ahead of those three top guys. Hopefully we will have as many of us there as possible in whatever group that forms with Matej, but then it will be just about the legs.</span></p>\n<p><span>Last year, we missed the move on the Berendries that went with 100km to go, but if we can have someone in there just to get ahead this year, we don’t have to do any chasing from the bunch. You don’t have to actually expend that more energy in the break than you do in the peloton. Then it’s all about the last time up the Kwaremont and Paterberg.</span></p>\n<p><span>If you can put yourself there, with as much energy saved as possible, then that’s all you can hope for. If those top three guys start looking at each other then you never know. They are incredible bike riders but you’ve got to try. The truth of it is, I’d like to win Flanders at some point in my career and with people like Pogačar hanging around it’s not going to be easy, but we’ve got to work it out at some point. </span></p>\n<p><em><span>Cover image: Tim de Waele/Getty</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"04626014deb73e2d91ed93e7c22b239d513ea7c38cd7ff6c9fbac661b5eee4ec","category":"Cycling"}