{"title":"4,700 Amazon employees had unauthorized access to private seller data","link":"https://arstechnica.com/?p=1762278","date":1620143068000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/11/amazon-prime-box-800x450.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2016/11/amazon-prime-box.jpeg\">Enlarge</a> </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Thousands of Amazon employees, including those who developed private-label goods for the e-commerce giant, enjoyed years of access to sensitive third-party seller data, according to a new report.</p>\n<p>An internal audit in 2015 traced the issue to lax security protocols, including the use of a tool called “spoofer access,” which allowed Amazon employees to view and edit accounts as sellers. The employees had access to profile information, inventory levels, product pricing, and even the ability to cancel orders. The audit, obtained by <a href=\"https://www.politico.eu/article/amazon-seller-data-company-sales/\">Politico</a>, says that spoofer access was available to employees from around the world and persisted until at least 2018.<span> </span></p>\n<p>At least one employee used the security lapses to their advantage. “We identified one Vendor Manager who inappropriately reviewed a Seller’s on-hand inventory to improve the likelihood and timing of the Vendor Manager winning buy-box,” the audit said. The \"buy box\" is the main “Buy” button that appears on a product page on Amazon. Various sellers compete for opportunities to “win” the buy box, giving them access to easy sales by making it more likely that orders will be fulfilled from their inventory.</p></div><p><a href=\"https://arstechnica.com/?p=1762278#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1762278&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"046265985bf0d4426b48338395bfdaefab2ec9c9df0f140d5bda3a0f77d5f8f3","category":"Tech"}