{"title":"North Korea launched a satellite, then apparently blew up its booster","link":"https://arstechnica.com/?p=1986251","date":1700686885000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/GettyImages-1796532499-800x443.jpg\" alt=\"A television monitor at a train station in South Korea shows an image of the launch of North Korea's Chollima 1 rocket Tuesday.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/GettyImages-1796532499.jpg\">Enlarge</a> <span>/</span> A television monitor at a train station in South Korea shows an image of the launch of North Korea's Chollima 1 rocket Tuesday. (credit: Kim Jae-Hwan/SOPA Images/LightRocket via Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>North Korea launched a small military spy satellite Tuesday on the country's first successful orbital launch since 2016. This, alone, would be newsworthy, but this launch comes with a twist.</p>\n<p>A remotely operated camera in Seoul, South Korea, set up to detect meteors streaking through the atmosphere, captured the launch. North Korea's Chŏllima 1 rocket appears on the horizon, climbing higher in the night sky until its booster engine cuts off. Then an upper stage engine fires to continue powering its payload into orbit, leaving behind the rocket's spent expendable booster to fall into the Yellow Sea west of the Korean Peninsula.</p>\n<p>Then, the night vision camera <a href=\"https://archive.allsky.tv/PUB/ALLSKY7_NK_ROCKET_2023_11_21.mp4\">recorded a bright fireball</a>. Instead of plunging into the sea, the booster explodes. It's unusual to see a spent booster blow up during the launch of expendable rocket, so this raises questions. Did North Korea intentionally explode its rocket?</p></div><p><a href=\"https://arstechnica.com/?p=1986251#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986251&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"046e497e44351b9c6fd6728d06d3c7a2ae9c53749421a87cc9d42c3799b145d2","category":"Tech"}