{"title":"Effects of dietary supplementation of a blend of Saccharomyces cerevisiae, multiple live probiotic bacteria, and their fermentation products on performance, health, and rumen bacterial community of newly weaned beef steers during a 56-d receiving period","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txad143/7486319?rss=1","date":1703116800000,"content":"<span><div>Abstract</div>We examined the effects of a blend of <span>Saccharomyces cerevisiae</span>, multiple live probiotic bacteria, and their fermentation products on performance, health, and the ruminal bacterial community of newly weaned beef steers during a 56-d receiving period. Forty newly weaned Angus crossbred steers (221 ± 25.6 kg BW; 180 ± 17 d of age) were stratified by body weight (<strong>BW</strong>) into four pens (10 steers per pen) such that each pen had a similar average BW at the beginning of the experiment. The pens were randomly assigned to receive a corn silage basal diet (CON; <span>n</span> = 20) or the basal diet supplemented with 9 g/steer/d of PRO feed additive (PRO; <span>n</span> = 20). The PRO additive is a blend of <span>S. cerevisiae</span> and the fermentation products of <span>Enterococcus faecium</span>, <span>Bacillus licheniformis</span>, <span>B. subtilis</span>, <span>Lactobacillus animalis</span>, and <span>Propionibacterium freudenreichii</span>. The DMI and water consumed were monitored using the GrowSafe intake nodes and custom flow meters, respectively. BWs were recorded weekly to calculate average daily gain (<strong>ADG</strong>). Before morning feeding, 10 mL of blood was taken from each steer on days 0–7, and thereafter weekly for analyses of immune cells, plasma glucose, and NEFAs. On day 56, rumen fluid samples (200 mL each) were collected from all the steers for microbiome analysis. Over the 56-d receiving period, the supplemental PRO had no effects on DMI, water intake, or ADG. However, compared to CON, beef steers fed supplemental PRO tended to have greater ADG (<span>P</span> = 0.08) and BW (<span>P</span> = 0.07) during the first 14 d of the study. There was a treatment × day interaction (<span>P</span> ≤ 0.05) for WBC, neutrophils and monocytes over the 56 d such that beef steers fed supplemental PRO had lower blood concentrations on certain days during the first 7 d after weaning, indicating reduced inflammation or stress response. The results of the rumen microbiome analysis revealed that the relative abundance of complex fiber degrading or obligate proton-reducing bacterial genera such as <span>Bacteroides</span>, <span>Ruminococcus gauvreauii</span> group, <span>Desulfovibrio</span>, <span>Syntrophococcus</span>, and <span>Acetitomaculum</span> were greater (<span>P</span> ≤ 0.05) in beef steers fed supplemental PRO compared to CON. This study demonstrated that dietary supplementation of PRO improved the growth performance, reduced stress or inflammatory response during the initial days after weaning, and altered the ruminal bacterial community toward increased relative abundance of bacterial genera associated with improved rumen function.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"046f04889534db8b571cecc184eed6b869c77225a6b727395c1c80fd73125da8","category":"Environment"}