{"title":"Using Thermal Diffuse Scattering in Electron Backscatter Diffraction to Probe Temperature Changes on the Nanoscale","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.070/7719500?rss=1","date":1721779200000,"content":"<span>Nanothermometry aims to map temperature changes on scales smaller than the diffraction limit of optical techniques. Recent advancements in electron detection (<span>e.g.</span>, direct electron detectors) has, in part, driven renewed interest in measuring, understanding, and utilizing thermal diffusely scattered electrons as a proxy for temperature on nanometer length scales [<a href=\"#ozae044.070-B1\">1</a>]. Thermal diffuse scattering of electrons is well understood in the transmission geometry [<a href=\"#ozae044.070-B2\">2</a>], but less so in other techniques like electron backscattered diffraction (EBSD). In the case of EBSD, this is mostly due to the combination of the stochastic backscattering process and dynamical diffraction. However, because EBSD systems are almost entirely coupled to SEM platforms, EBSD provides an opportunity to map temperature of technologically relevant devices <span>in operando</span> thicker than what can be measured in TEM or STEM (&lt;100 nm). It is worth noting that while the interaction volume of the SEM electron beam (10<sup>1</sup> to 10<sup>2</sup> nanometers) is larger than that in scanning transmission electron microscopy (STEM, 10<sup>0</sup> nanometers); it is still lower than the diffraction limit of temperature mapping optical techniques (&gt;10<sup>2</sup> nanometers). Additionally, TDS electrons in transmission setups are often scattered into the near but distinct background away from Bragg peaks or disks. However, due to the lack of control in convergence angle of the pattern-forming electrons and detector geometries, the Kikuchi bands overlap: A feature necessary and ideal for grain orientation identification but less so for studying smaller inelastic scattering processes. Despite this, Wu and Hull have shown that they can use EBSD to detect a temperature difference in Si and Ge using a CCD detector [<a href=\"#ozae044.070-B3\">3</a>,<a href=\"#ozae044.070-B4\">4</a>]. Although experimentally demonstrated, a rigorous understanding of how temperature affects EBSD pattern formation, best practices for extracting temperature changes from patterns, and material dependence/sensitivity are not well understood.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"04761e721771280a59106771c402d35809c14b6b08abc283f299af72527a9507","category":"Environment"}