{"title":"Multi‐year monitoring shows higher species richness and diversity of fish assemblages in a Danish seagrass meadow as compared to neighbouring non‐vegetated areas","link":"https://onlinelibrary.wiley.com/doi/10.1111/maec.12821?af=R","date":1719818056000,"content":"<h2>Abstract</h2>\n<p>Seagrass meadows provide an important nursery and feeding habitat for fish, globally. However, limited data exist on how these vegetated coastal ecosystems affect local fish stocks over longer time periods. By means of beach seine hauling with a bio-monitoring seine net, we collected fish data in Kronborg Bay (Denmark) over 4 years. The bay contains both vegetated and bare sediment areas in close proximity to Kronborg Castle in Elsinore and is part of the Øresund strait; a dynamic marine environment linking the Baltic Sea with the inner Danish waters (Kattegat). We investigated the biodiversity and fish abundance in a healthy seagrass meadow and compared it with a bare adjacent sediment area. We show that seagrass is important for fish species like the Atlantic cod, the two-spotted goby, and the broadnosed pipefish. The seagrass meadow harboured more fish species and higher biodiversity, while the number of individuals was higher in the adjacent bare sediment area as a result of high abundances of lesser sand eel. Pilou's evenness and the Shannon-Wiener index showed 2–4-fold higher biodiversity in the seagrass meadow. The seagrass meadow harboured about 35% more fish species than the bare adjacent sediment. The Atlantic cod was almost entirely found in the seagrass meadow, while lesser sand eel that showed an overall increase in abundance in both habitats, represented the largest proportion of the total number of fish individuals (up to about 60%) and was mostly found on the bare adjacent sediment. Species abundance was analysed for changes over time, where, for example the European plaice showed an increase in abundance over the 4-year period of investigation. Seagrass meadows can thus be very important for the Atlantic cod population in the Øresund strait and generally for local fish productivity, abundance and diversity.</p>","author":"Søren Lundgaard Olesen, \nMichael Hansen, \nJens Peder Jeppesen, \nMichael Kühl, \nKasper Elgetti Brodersen","siteTitle":"Wiley: Marine Ecology: Table of Contents","siteHash":"9aeeb02fb4d0869ca2d9b47a9c219a8693576fd84433bf6b8b40db990539dbf7","entryHash":"0478e0378a9d82dbc6e7f8116ac8284f74cdeca347865015ad4921d759b2c1bc","category":"Environment"}