{"title":"Major and Trace Elements in Soils from an Industrial Area in the Lower Danube Basin: Levels, Transfer to Crops (Wheat, Corn, Sunflower) and Health Risk","link":"https://www.preprints.org/manuscript/202405.1911/v1","date":1716964388000,"content":"The study aimed to evaluate for the first time the degree of contamination of soil and crops with major and trace elements (Cd, Co, Cr, Cu, Ni, Pb, Zn, F, Na, Mg, Si, P, Cl, Fe, Al) in agricultural lands situated in the Lower Danube Basin, Galati and Braila counties (SE Romania), impacted by the steel industry. Soil samples from two depths (0–5 cm and 5–30 cm), as well as leaves and seeds of wheat, corn, and sunflower, were collected from 11 different sites. Along with elemental and mineralogical analysis, performed by HR-CS AAS, PIGE, SEM-EDX and ATR-FTIR, the soil pH, texture, organic matter, electric conductivity and CaCO3 content were investigated. The results showed that the levels of Cr (83.270–383.100 mg kg-1), Cu (17.110–68.151 mg kg-1), Ni (30.157–55.656 mg kg-1), and F (319–544 mg kg-1) in soil exceeded the Romanian regulations for sensitive use of the land. The pollution indices (Igeo, EF, PI, PERI) indicate that the soil is moderate to highly contaminated with Cr, Ni and Cu, while CSI and mERMQ indices suggested a relatively low risk for metal contamination. The concentrations of elements in plant tissues and bioaccumulation factors (BFs) show the soil-plant relation and health risk, but also the elemental selectivity of vegetal compartments. Thus, the results showed that wheat plants tend to exclude the bioaccumulation of certain elements in their tissues, while for Zn and Cu, the bioaccumulation pattern is different. In the case of corn, most BFs were below 1, indicating limited phytoaccumulation capacity. However, exceptions were observed for Cd, Zn, and Cu. Sunflower BFs indicate higher bioconcentration of Cu, Cd, and Zn in both the leaves and seeds compared to other elements. Chromium (Cr) contributes to non-carcinogenic dermal contact and ingestion hazards, with children being more susceptible to the adverse effects of this contaminant.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"047961520ae7e2a0e6e92028d6a33e0cd974ee5989fc829be5540c75517c781d","category":"Interdisciplinary"}