{"title":"Terraform Cloud updates plans with an enhanced Free tier and more flexibility","link":"https://www.hashicorp.com/blog/terraform-cloud-updates-plans-with-an-enhanced-free-tier-and-more-flexibility","date":1684256400000,"content":"<p>Today we are excited to introduce updates to our lineup of <a href=\"https://app.terraform.io/session\">HashiCorp Terraform Cloud</a> offerings that provide access to premium features for up to 500 resources in the Free tier, as well as new paid offerings for management capabilities, scaling concurrency, and enterprise support, as well as consistent billing metrics based on managed resources, across tiers. </p>\n\n<p>These updates to our Terraform Cloud offerings are based on feedback from users and customers and are designed to:  </p>\n\n<ol>\n<li>Provide premium security features, such as SSO and policy as code, on all tiers. </li>\n<li>Make it easy and frictionless for smaller teams and organizations to get started with their first use case. The updated Free tier covers up to 500 managed resources — accommodating more than 90% of the practitioners, small teams, and organizations using Terraform Cloud. It also includes unlimited users and <em>applies</em>, so organizations can onboard any team member to collaborate, provision, and manage their own resources, and users can make changes to their infrastructure as needed without incurring additional costs. </li>\n<li>Finally, the updated paid tiers provide easy upgrade paths for organizations as their usage scales and they have more advanced use cases and the need for enterprise support. </li>\n</ol>\n\n<p>This table provides an overview of the updated Terraform Cloud offerings: </p>\n<img src=\"https://www.datocms-assets.com/2885/1684246440-tfc-new-pricing.png\" alt=\"New\" /><p>To see the full list of capabilities in each package, visit the <a href=\"https://www.hashicorp.com/products/terraform/pricing\">HashiCorp Terraform pricing page</a>.</p>\n\n<h2>New Free tier capabilities bolster security posture from the start</h2>\n\n<p>Terraform Cloud Free is great for small teams and organizations getting started with Terraform. Free includes everything needed to use Terraform in a team setting, including remote state, remote runs, private registry, secure variables, dynamic provider credentials, and additional security features for a robust security posture from the start. New features include: </p>\n\n<ul>\n<li><strong>SSO</strong> — Owners have more control to secure accessibility to an organization’s infrastructure, reducing risk through the enforcement of identity and access management (IAM) policies.</li>\n<li><strong>Policy as code with HashiCorp Sentinel and OPA</strong> — Create policies as code and enable advisory enforcement to view policy violations. </li>\n<li><strong>Run Tasks</strong> — Add checks from third-party products for improved security, code scanning, cost control, and regulatory compliance.</li>\n<li><strong>Terraform Cloud Agent</strong> — Execute runs and manage resources in isolated, private, or on-premises environments.</li>\n</ul>\n\n<h2>Updated paid tiers with increased concurrency and support</h2>\n\n<p>Terraform Cloud Standard is great for organizations starting to use Terraform where team management, scalability, security, and support are critical. The Standard tier is available through monthly credit card billing or as part of an annual contract. Features include: </p>\n\n<ul>\n<li><strong>Team management</strong> to grant the right workspace permissions to allow members to start Terraform runs, create workspace variables, read and write state, and more.</li>\n<li><strong>Three concurrent runs</strong> to limit bottlenecks and contention for run time with parallel Terraform operations.</li>\n<li><strong>Flexible enterprise support</strong> so organizations can select the support type that works best for them.</li>\n</ul>\n\n<p>Terraform Cloud Plus offers everything in the Standard tier along with additional capabilities to continuously manage infrastructure. Capabilities include:</p>\n\n<ul>\n<li><strong>No-code provisioning</strong> for self-service provisioning of desired infrastructure without having to write code.</li>\n<li><strong>Drift Detection</strong> for visibility into when your infrastructure configuration has changed from the intended configuration. </li>\n<li><strong>Continuous validation</strong> to continuously check infrastructure following provisioning to validate health and custom assertions.</li>\n<li><strong>Unlimited Sentinel and OPA policies and Run Tasks</strong> to ensure all infrastructure changes follow security, compliance, or operational policies.</li>\n<li><strong>Scaling concurrency and agents</strong> to support a team's ideal project and workspace arrangement, and prevent bottlenecks. </li>\n<li><strong>Flexible enterprise support</strong> so organizations can select the support type that works best for them, up to Enterprise 24x7. </li>\n</ul>\n\n<h2>Existing Terraform Cloud users</h2>\n\n<p>If you are already using Terraform Cloud Free, there is no change to your account. However, you can take advantage of the new Free tier features by opting in from your <a href=\"http://app.terraform.io\">Terraform Cloud account</a>. </p>\n\n<p>If you are a Terraform Cloud Team or Team &amp; Governance customer, your existing plan also remains unchanged. However, you can migrate to the new Standard plan to take advantage of new capabilities starting today, by logging into your HashiCorp Cloud Platform (HCP) account and going to the TFC Organization Plan and Billing tab. If you do not have an HCP account, you can create an account on the <a href=\"https://portal.cloud.hashicorp.com/sign-in\">HashiCorp Cloud Platform portal</a>. </p>\n\n<h2>Getting started</h2>\n\n<p><a href=\"https://www.hashicorp.com/products/terraform\">HashiCorp Terraform</a> is the standard for infrastructure automation using infrastructure as code to provision and manage any infrastructure. The Terraform ecosystem has more than <a href=\"https://registry.terraform.io/\">3,000 providers</a>, 12,000 modules, and 250 million downloads. From adoption to standardization to scale, Terraform Cloud provides a standardized workflow delivered as a managed service for teams and organizations to get started for free and scale their usage and capabilities as their use cases become more advanced.</p>\n<p>If you are currently using Terraform open source or completely new to Terraform, you can <a href=\"http://hashi.co/tf-cloud-bc\">sign up for Terraform Cloud</a> and get started using the Free offering today.</p>\n","author":"Melar Chen","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"0482be510d0fa82b849a9137e53eb2cc7931f504abbfb961e6f48cddc99e689b","category":"Tech"}