{"title":"A tropical storm is coming for the Olympic MTB and time trial events","link":"https://cyclingtips.com/2021/07/a-tropical-storm-is-coming-for-the-olympic-mtb-and-time-trial-events/","date":1627237854000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033343-010-650x433.jpg\" /></div><h2>A tropical storm is coming for the Olympic MTB and time trial events</h2><p>\n</p><p>There’s a tropical storm forming east of Japan and it’s bound for Tokyo, putting this week’s outdoor events – including Wednesday’s time trials – at risk of postponement.</p>\n\n\n\n<p>Forecasters and time trialists alike have been tracking the course of Storm Nepartek, born out of a tropical depression north-northeast of Guam on Friday and now moving toward mainland Japan, bringing with it rain, wind and another blow to the chronically unlucky 2020 Tokyo Olympics.</p>\n\n\n\n<p>Accuweather meteorologists say it’s still too early to tell exactly where Nepartek will make landfall, but it could hit Tokyo late Monday or early Tuesday (local time), with bad weather likely to linger for a few days. So the chances are that the men’s cross-country mountain bike event may get interesting, and the typhoon’s tail is likely to affect the time trial. Although with any luck, it won’t cause any more issues than slight headaches where equipment choices are concerned.</p>\n\n\n\n<blockquote><p>The 2020 Summer Olympic Games in Tokyo have already been postponed by an entire year due to the coronavirus pandemic, and now Tropical Storm Nepartak in the Philippine Sea could put some events at risk of being delayed again: <a href=\"https://t.co/FTqy0I4pvi\">https://t.co/FTqy0I4pvi</a> <a href=\"https://t.co/dK7OflltGp\">pic.twitter.com/dK7OflltGp</a></p>— Breaking Weather by AccuWeather (@breakingweather) <a href=\"https://twitter.com/breakingweather/status/1419194864487567360?ref_src=twsrc%5Etfw\">July 25, 2021</a></blockquote> \n\n\n\n<p>Weather has already been a major talking point at the Olympics, Tokyo being notorious for the hot and humid conditions it endures in July and August. Both the <a href=\"https://cyclingtips.com/2021/07/richard-carapaz-wins-olympic-gold-in-mens-road-race/\">men’s</a> and <a href=\"https://cyclingtips.com/2021/07/anna-kiesenhofer-takes-surprise-victory-in-tokyo-olympic-road-race/\">women’s road races</a> played out in sweltering heat this weekend, and it’s looking like those sticking around for the mid-week time trial will have a whole new set of challenges to contend with.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/a-tropical-storm-is-coming-for-the-olympic-mtb-and-time-trial-events/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"04839bd53f78470438ed4c7f0f42f5f212ae45df2ce4c9a7aaa5f677dff1783e","category":"Cycling"}