{"title":"คนเก่งฟ้าประทานฉบับคนแสดงติดอันดับ 2 ของ Netflix ทั่วโลก มียอดผู้ชม 7.7 ล้านวิวในสัปดาห์แรก","link":"https://www.blognone.com/node/137364","date":1703241707000,"content":"<div><div><div><p>หลังจากที่ Yu Yu Hakusho หรือคนเก่งฟ้าประทาน ฉบับซีรี่ส์คนแสดงเปิดให้รับชมใน Netflix เมื่อวันที่ 14 ธันวาคมที่ผ่านมา ล่าสุดซีรี่ส์ดังกล่าว ได้รับการจัดอันดับเป็นที่ 1 ทั่วโลกรายสัปดาห์ของ Netflix (ซีรีส์ที่ไม่ใช่ภาษาอังกฤษ) และเป็นอันดับ 2 ของโลกในซีรีส์ที่รวมทุกภาษา กลายเป็นซีรี่ส์ที่มาจากประเทศญี่ปุ่นที่มียอดคนดูสูงสุดในประวัติศาสตร์ โดยมียอดคนดูอยู่ที่ 7.7 ล้านวิว (นับตั้งแต่ 11-17 ธันวาคม)</p>\n<p>นอกจากนี้ตัวซีรี่ส์ยังติดอันดับ Today's Series TOP10 ใน 92 ประเทศทั่วโลกรวมถึงประเทศญี่ปุ่น, สหรัฐอเมริกา, แคนาดา, ฝรั่งเศส, เยอรมนี, บราซิล, อินเดีย, ฮ่องกง, และไต้หวัน นอกจากนี้ยังครองอันดับหนึ่งของ Today's Series TOP10 ในประเทศญี่ปุ่นได้ 5 วันติดต่อกันแล้ว</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f1a9abf03c7c204aabcddb75ee2b099c.jpg\" /><em>ภาพจาก Oricon News</em></p>\n<p>สำหรับคนเก่งฟ้าประทานฉบับซีรี่ส์คนแสดงใช้เวลาสร้างกว่า 5 ปี เป็นความร่วมมือระหว่างญี่ปุ่นและอเมริกา กำกับซีรี่ส์โดยคุณ Sho Tsukikawa ที่มีผลงานเด่นอย่างเรื่อง ตับอ่อนเธอนั้น ขอฉันเถอะนะ (Let Me Eat Your Pancreas) ฉบับภาพยนตร์คนแสดง และย้อนรัก 100 ครั้งก็ยังเป็นเธอ (The 100th Love With You) มีคุณ Takahito Ouchi เป็นผู้กำกับฉากแอคชั่นมีผลงานเด่นจาก ซามุไรพเนจรฉบับคนแสดง 3 ภาคแรก (Rurouni Kenshin) นำแสดงโดย Takumi Kitamura สมาชิกวง DISH และเป็นนักแสดงแนวหน้าของญี่ปุ่นในตอนนี้</p>\n<p>ที่มา - <a href=\"https://news.livedoor.com/article/image_detail/25569070/?img_id=40209819\">Livedoor News</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/tv-series\">TV Series</a></div><div><a href=\"/topics/yu-yu-hakusho\">Yu Yu Hakusho</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0489f69d71d6fe0e757622b02ff7c1a784e70b81765b3e81e5be3ed097d4fe10","category":"Thai"}