{"title":"Population Fluctuation of Dendroctonus spp. and Its Relationship with Climatic Variables in Southwestern Chihuahua, Mexico","link":"https://www.preprints.org/manuscript/202405.0528/v1","date":1715243997000,"content":"Conifer bark beetles (Coleoptera: Curculionidae: Scolytinae) are major agents of natural disturbance in temperate forests of the northern hemisphere, capable of killing billions of trees in native forests. The dynamics of these insect populations are influenced by climatic variability. To understand such a relationship, it is necessary to monitor the population fluctuation of the species present over time. In this regard, the objective of the present study was to determine the species community of the genus Dendroctonus, the population fluctuation throughout the months of the year, and the effects of relative humidity, temperature, and precipitation on the fluctuation, at three sites of mixed forests in the Municipality of Bocoyna, Chihuahua, in northern Mexico. For insect monitoring, we used Lindgren funnel traps (with 8 funnels each) baited with semiochemicals. Every two weeks, and during 2 years, we collected, identified, and counted the insects. The identification of the species was based on the external morphology and characteristics of the male seminal rod. Temperature and relative humidity were measured using climate data loggers (HOBOs). We found six Dendroctonus species. We also determined the population fluctuation patterns of D. mexicanus Hopkins, D. frontalis Zimmermann, and D. brevicomis LeConte, species with the highest number of captures at each site. Additionally, the relationship between species abundance and climatic variables was determined. The variable that significantly influenced (P&amp;lt;0.05) abundance was temperature. Relative humidity and precipitation variables did not show a significant relationship (P&amp;gt;0.05).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0499d0aec761977fec6b111ea3383ade8eb252a9cf9406cbbc5ccee3142d3e5e","category":"Interdisciplinary"}