{"title":"Former Employees Explain What Facebook Has to Lose When Apple Implements App Tracking Transparency","link":"https://www.macrumors.com/2021/03/11/facebook-employees-app-tracking-transparency/","date":1615505311000,"content":"As Apple prepares to implement App Tracking Transparency changes <a href=\"https://www.macrumors.com/2021/02/01/apple-releases-ios-14-5-beta-1-to-developers/\">in iOS 14.5</a>, <em><a href=\"https://www.cnbc.com/2021/03/11/why-facebook-is-so-upset-about-apple-idfa-change-insiders-spill.html\">CNBC</a></em> spoke with several former Facebook employees to get details on why Facebook has been so heavily against the planned privacy updates.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/Apple-vs-Facebook-feature.jpg\" alt=\"\" width=\"2500\" height=\"1406\" class=\"aligncenter size-full wp-image-775612\" />\r\n<br/>\r\nStarting this spring, Facebook and other app developers will need to get express permission to access a user's advertising identifier, or IDFA, which is used to track usage across apps and websites for ad targeting purposes. Facebook has campaigned heavily against App Tracking Transparency, taking out <a href=\"https://www.macrumors.com/2020/12/16/facebook-takes-out-full-page-ads-to-attack-apple/\">full page newspaper ads</a> and attempting to position Apple <a href=\"https://www.facebook.com/business/apple-ios-14-speak-up-for-small-business\">as an enemy</a> of small businesses.\r\n<br/>\r\n\r\n<br/>\r\nOne of Facebook's main arguments is that Apple's changes will hurt businesses that use Facebook's advertising tools, but former Facebook employee Henry Love told <em>CNBC</em> that for many businesses, the change might not even be noticeable.\r\n<br/>\r\n\r\n<br/>\r\nLess ad tracking data will prevent Facebook and its clients from targeting ads as effectively as they can now, but a lot of businesses may not need much data for effective ad targeting. A small coffee shop in Texas, for example, likely uses broad targeting categories like zip code and age range for ads, which is data that Facebook can collect from its own apps without the need for the IDFA.\r\n<br/>\r\n<blockquote>\"If you talked to any restaurant owner anywhere and asked them what IDFA is, I don't think any of them would know what that is,\" Love said. \"It's affecting Facebook at scale. Not the small business owners.\"\r\n<br/>\r\n\r\n<br/>\r\nAmong the few \"small business owners\" who might feel the effects of the IDFA change are start-ups backed by venture capital money who have hired professionals with the skills to target users with sniper precision, Love said.</blockquote>\r\n<br/>\r\nPeople who are targeting users across mobile, web, and the Facebook Audience Network with the IDFA are \"not small businesses,\" with Love calling such companies \"sophisticated, VC-backed startups.\"\r\n<br/>\r\n\r\n<br/>\r\nApp Tracking Transparency will threaten Facebook's view-through conversion tracking, a metric that lets ad companies figure out how many people saw an ad, didn't click it, but later made a purchase related to the ad. Retailers can record the info of the person who bought an item and then share it with Facebook, with Facebook able to determine whether that person's IDFA matches with a user who saw an ad for the product purchased.\r\n<br/>\r\n\r\n<br/>\r\n<em>CNBC</em> says that the loss of this info could heavily impact Facebook because if advertisers can't accurately measure the effectiveness of Instagram and Facebook ads, they might shift more of their budget to other apps and services.\r\n<br/>\r\n\r\n<br/>\r\nFacebook's Audience Network, which provides advertisements in non-Facebook apps, will also be impacted because it uses IDFA data to choose the best ads to show to users based on Facebook data. If users opt out of sharing the IDFA, Facebook's ad personalization efforts will be rendered useless outside of its own apps.\r\n<br/>\r\n\r\n<br/>\r\nFacebook is <a href=\"https://www.macrumors.com/2021/02/01/facebooks-will-encourage-users-to-accept-tracking/\">planning to ask</a> users for permission to access the IDFA, and is testing wording that suggests the tracking will provide a better ad experience. Facebook test prompts encourage customers to allow IDFA usage to \"support businesses that rely on ads to reach customers.\"<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/facebook/\">Facebook</a>, <a href=\"https://www.macrumors.com/guide/app-tracking-transparency/\">App Tracking Transparency</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/11/facebook-employees-app-tracking-transparency/\">Former Employees Explain What Facebook Has to Lose When Apple Implements App Tracking Transparency</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/former-employees-explain-what-facebook-has-to-lose-when-apple-implements-app-tracking-transparency.2288022/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=qWY5wgNtuLQ:Nx6PqjkWtoc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=qWY5wgNtuLQ:Nx6PqjkWtoc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/qWY5wgNtuLQ\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"04a15d438f61b21209b6036a1ed1600d9fcd2772bcea8eac4629307ff144ff0b","category":"Apple"}