{"title":"Significant Differences in Microbial Soil Properties, Stoichiometry, and Tree Growth Occurred within 15 Years after Afforestation on Different Parent Material","link":"https://www.preprints.org/manuscript/202408.0550/v1","date":1723112903000,"content":"Soil formation results from the weathering and alteration of bedrock, influenced by climatic conditions and biotic factors, including living organisms. The mineralogical composition of the parent material, along with plant species and soil microorganisms, forms the foundational elements of an ecosystem's energy cycle. Afforestation in arid-semi arid regions plays a crucial role in preventing erosion and enhancing soil quality, offering significant economic and ecological benefits. This study assessed the impact of parent material diversity on soil physicochemical properties, microbial basal respiration (MR), and microbiological characteristics, as well as their subsequent effects on plant growth, 15 years post-afforestation. For this purpose, various soil physicochemical parameters, MR, soil microbial biomass carbon (Cmic), stoichiometry (microbial quotient= Cmic/Corg = qMic and metabolic quotient = MR/Cmic = qCO2), and tree growth metrics such as height and diameter were measured. The results of the one-way ANOVA indicated that afforested soils on limestone bedrock exhibited significantly better physicochemical and microbiological properties, as well as tree growth parameters, compared to those on andesite. Notably, sensitive microbial properties such as Cmic, MR, and qMic were positively influenced by afforestation. The highest Cmic (323 g C kg−1) and MR (1.3 CO2–C g−1 h−1) values were recorded in limestone-derived soils. Currently, the measured properties of soils can be ranked as LS&amp;gt;AS&amp;gt;LC&amp;gt;AC. Conversely, the highest qCO2 values were observed in the control plots of andesite parent material (7.22). This study highlights the importance of selecting appropriate parent material and understanding soil characteristics to optimize afforestation efforts in bare areas. As a result, the higher plant growth capacity and carbon retention of limestone soil indicate that it has high microbial biomass and microbial activity (qMic).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"04afcb70f1f7410cefc00dfeeb7778563c1fec3f212451bfc6dd2c580f5ccb57","category":"Interdisciplinary"}