{"title":"Sectors of my heart: my Paris-Roubaix obsession","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/sectors-of-my-heart-my-paris-roubaix-obsession","date":1633106061000,"content":"\n      <p><span>There’s two races that professional cyclists will do anything to finish. One has become their calling card. Whenever somebody asks them what their profession is, the follow-up question will be \"have you done the Tour de France?\"</span></p>\n<div></div>\n<p>But the other one is Paris-Roubaix, a race that elicits a shrug from members of the public. That event is more like entering a secret society: if you know, you know – and cycling fans and racing cyclists who do are often united in awe, respect and anticipation. Once you discover it, through whatever medium, it can take a special hold over you.</p>\n\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-femmes-2021-preview\">Related: Paris Roubaix Femmes 2021 Preview</a></em></strong></p>\n<p>Seeing it in magazines or on the TV is gripping enough, but my initiation came in 2013 on a day trip from London. The roar of the crowd as leaders Fabian Cancellara and Sep Vanmarcke entered the velodrome gave me goose-bumps. I can still recall interviewing the last-place finisher Chris Juul-Jensen as he left the velodrome’s <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/rouleur-cover-stories-issue-19-2-roubaix-showers-by-michael-blann\">famous, functional showers</a>. He was a newbie like me, exhausted and exhilarated in equal measure after his Hell of the North debut. I asked him whether it was the hardest race of his life. “Yes. I couldn’t predict how tough and frightening it would be, physically demanding and whatnot. There’s no forgiveness. Although it may have been the hardest race, it was also the most fascinating.” Just like him, I was hooked. </p>\n<p><a href=\"https://www.rouleur.cc/pages/rouleur-live\"><strong>See Fabian Cancellara at Rouleur Live 2021</strong></a></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Paris_Roubaix_2014_05_1024x1024.jpg?v=1632820789\" /></div>\n\n<p><em>John Degenkolb after winning the 2015 Paris-Roubaix </em><br /><br />Everyone has a story when it comes to Roubaix, and I’ve been drawn back every year since to find them. I interviewed the old miners at Arenberg and toured their preserved pithead. I’ve lurched around in the Mavic neutral service car on race day. I nearly cut off my finger while watching the race on five cobbled sectors (a story for another day). I even dragged the Rouleur crew along in 2018 so we could do it mob-handed and make an entire magazine about the race. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/im-proud-to-be-on-the-startline-and-make-history-emma-norsgaard-on-her-first-paris-roubaix\">Related: Emma Norsgaard, ready to make history in Roubaix</a></p>\n<p>As you can see, Roubaix and me, it must be love. Seeing cobblestones always gives a thrill, as something positively Dickensian. Being around those nondescript countryside sectors is earthy and good for the soul, if not for the car’s undercarriage. Every time I return, it’s like visiting an old friend who hasn’t changed, is never short of tales and never lets me down.</p>\n<p><span>Paris-Roubaix may be </span><i><span>the </span></i><span>mainstream one-day race of the cycling season, but it’s still a race for obsessives and outsiders too. There’s nothing outwardly attractive about it, which is probably part of the appeal. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-640256709_1024x1024.jpg?v=1633086965\" /></div>\n<p><em>Johan Museeuw's radical Roubaix ride in 1994. Photo by Jerome Prevost/TempSport/Corbis/VCG via Getty Images</em><br /><br />This is not the French Riviera, the lavender fields of Provence or Montmartre. This is the gritty Nord, an unpretentious bit of France that gets passed on the motorway by holidaymakers going south, one of former slag heaps covered in grass, communities who feel marginalised. Roubaix, after all, is one of France’s poorest cities and its finishing venue is overlooked by a giant housing estate. </p>\n<p><span>That’s before you throw in the sporting spectacle. To watch Paris-Roubaix is to fall in love with it. It resembles no other road race, in terms of adrenaline, anticipation (especially after a Covid-enforced absence), mythology, drama, number and severity of the cobblestone sectors, the obsession with tyre PSI – and the rhythm of the racing.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/fabian-cancellara-one-of-the-all-time-great-classics-riders\">Related: Fabian Cancellara, a Classics legend</a></strong></em></p>\n<p><span>Often, the race is whittled down in the no-holds-barred fight for positioning </span><i><span>before </span></i><span>the pavé, not the stones themselves. And these are cobbles, but not as we know them. I’m wary that any modern marketer trying to invent Paris-Roubaix nowadays would probably be prevented on the grounds of health and safety.</span></p>\n<p><span>Virtually unchanged since 1948, the finish is the cherry on top of the oddity. Which race finishes on an </span><i><span>outdoor velodrome</span></i><span> any more? Fans gather (for free!) around this 500-metre concrete track, itself making for a lengthened vantage point of any finale. There’s a TV screen and beers available from the humble Velo-Club bar and that’s about it. VIPs and past winners shift uncomfortably in the stands on faded cyan seats with bird poo on them. Paris-Roubaix, it’s a great leveller.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_5873_3ff93014-6015-4e1c-af3f-2d2e16b9e8b8_1024x1024.jpg?v=1632926920\" /></div>\n\n<p><em>View from the velodrome: Nils Politt and eventual winner Philippe Gilbert duel for victory in 2019. Photo: Alex Broadway/SWpix.com</em><br /><br />When the riders finish there, they collapse on the track's grass infield, coughing and spluttering, and journalists gather round for quotes, like robbers extracting from open graves. A wild, unsanitised endpoint to pro cycling’s great anachronism. (Though I’m sure this race-end ritual will change after Covid-19).</p>\n<p>Ultimately, Paris-Roubaix keeps proving that almost anything is possible. It is a race where the greats become even greater and long-shot outsiders can become fairytale heroes. I’m thinking of Tom Boonen’s 50km solo escape to victory, but also riders like Silvan Dillier, Johan Vansummeren and Mat Hayman. It defies both predictability and comparison.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/outsiders-with-a-chance-at-paris-roubaix-2021\">Related: outsiders with a chance at Paris-Roubaix 2021</a></strong></em></p>\n<p>So where will I be this year? On the sofa. With great regret, it’s a DNS from me as I get over the last vestiges of Covid-19 fatigue. Doubly cruel timing, given the women’s debut. (Incidentally, I feel it’s not wet weather, but this overdue gender parity that will make Paris-Roubaix even more enthralling.)</p>\n<p>But the Roubaix fever is still running wild: I won’t miss a minute of the action on the TV. And no doubt, absence makes the heart grow even fonder.</p>\n<p><em><span>Cover image: Stephane Mantey/AFP via Getty Images</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"04b279ebfde37eb7167d15a2a1f40b4e1a5f3108437d53685192980cb99fd6d5","category":"Cycling"}