{"title":"Qualcomm Opposes Nvidia's Acquisition of Arm as Deal Comes Under Increasing Scrutiny","link":"https://www.macrumors.com/2021/02/12/qualcomm-opposes-nvidia-acquisition-of-arm/","date":1613148199000,"content":"U.S. chipmaker and <a href=\"https://www.macrumors.com/2020/10/21/iphone-12-qualcomm-x55-modem/\">Apple supplier</a> Qualcomm has told regulators around the world that it opposes Nvidia's &#36;40 billion <a href=\"https://www.macrumors.com/2020/09/13/softbank-nearing-deal-to-sell-arm/\">proposed acquisition of Arm</a>, according to <em><a href=\"https://www.cnbc.com/2021/02/12/qualcomm-objects-to-nvidias-40-billion-arm-acquisition.html\">CNBC</a></em>.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/arm-logo-blue-bg.jpg\" alt=\"\" width=\"1600\" height=\"900\" class=\"aligncenter size-full wp-image-783300\" />\r\n<br/>\r\n\r\n<br/>\r\nQualcomm has registered an objection to Nvidia's acquisition of Arm with the Federal Trade Commission (FTC), the European Commission, the UK Competition and Markets Authority, and China's State Administration for Market Regulation. Qualcomm believes that the acquisition risks Nvidia acting as a gatekeeper for Arm's technology, and could prevent other chipmakers from using it. Most importantly, Qualcomm is building a case to suggest that the only way Nvidia can make the acquisition profitable will be to gatekeep Arm's technology.\r\n<br/>\r\n\r\n<br/>\r\nBritish chip architect Arm is currently owned by Japanese tech giant <a href=\"https://www.macrumors.com/2020/07/22/apple-not-interested-in-buying-arm/\">SoftBank</a> and licenses its chip designs to over 500 companies, including Apple. With Arm's architecture being used in 95 percent of the world's smartphones, there has been significant concern around Nvidia, which is a rival to Arm licensees such as AMD and Apple, acquiring the company. \r\n<br/>\r\n\r\n<br/>\r\nArm's architecture underpins all of Apple's custom silicon processors such as the A14 in the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> or the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> in the MacBook Pro, since Apple licenses the Arm instruction set. While Apple does not license entire core designs from Arm and still designs its own custom silicon, if the deal is permitted, Nvidia will become responsible for the vital instruction set behind Apple's own chips. \r\n<br/>\r\n\r\n<br/>\r\nNvidia says that the deal will create the world's \"premier computing company for the age of AI,\" and has pledged to keep the company headquartered in Cambridge, England.\r\n<br/>\r\n\r\n<br/>\r\nThe FTC has now reportedly moved into the \"second phase\" of its investigations, asking SoftBank, Nvidia, and Arm itself to provide more information about the acquisition. This phase is also expected to involve discussion with other companies with relevant information, such as Qualcomm. Since a number of large documents will now need to be produced, the investigation is expected to continue for several more months.\r\n<br/>\r\n\r\n<br/>\r\nQualcomm is said to believe that it will play a significant role in whether the deal is allowed to continue, having spoken to antitrust representatives and legal counsel. Nvidia told <em>CNBC</em> that it is confident regulators will see the benefits of the acquisition, yet five senior industry sources said that the deal has \"a very high chance of being blocked\" by regulators.\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>At the end of the day, whether this deal is anti-competitive or not, is based on a very simple idea: Arm is an enabler of competition. It enables companies to go out and compete. Whether you are MediaTek, Amazon Web Services, Qualcomm, or NXP. Any company — regardless of your R&D (research and development) budget — can take and license from Arm and build their own Arm-based CPU. That is a unique model.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\nSoftBank <a href=\"https://www.macrumors.com/2020/07/22/apple-not-interested-in-buying-arm/\">reportedly approached Apple</a> to see if it was interested in the purchase of Arm last year, but Apple was believed to have rejected the opportunity in part due to these regulatory concerns. \r\n<br/>\r\n\r\n<br/>\r\nIn addition to Qualcomm, AI chip start-up company Graphcore has raised concerns with the UK's Competition and Markets Authority, saying that the deal is anti-competitive, while in China, Huawei is similarly calling for the deal to be blocked.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/arm/\">Arm</a>, <a href=\"https://www.macrumors.com/guide/qualcomm/\">Qualcomm</a>, <a href=\"https://www.macrumors.com/guide/nvidia/\">Nvidia</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/12/qualcomm-opposes-nvidia-acquisition-of-arm/\">Qualcomm Opposes Nvidia&#039;s Acquisition of Arm as Deal Comes Under Increasing Scrutiny</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/qualcomm-opposes-nvidias-acquisition-of-arm-as-deal-comes-under-increasing-scrutiny.2284422/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=W5e_OF-zLTY:ekrS0Or9qZo:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=W5e_OF-zLTY:ekrS0Or9qZo:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/W5e_OF-zLTY\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"04b5fa59a05e9b732a39b4fed03dc251147d9fa59d5189852214f8925609a24c","category":"Apple"}