{"title":"Opinion: Patrick Moster's comments are part of a wider problem in the sport","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/mosters-comments-are-part-of-a-wider-problem-in-the-sport","date":1627652534000,"content":"\n      <p><span>As a sport, cycling is far behind wider society when it comes to both attitudes towards and representation of race and gender. It’s telling that a moniker for the typical punter is: MAMIL or ‘middle aged man in lycra’, although it really ought to have ‘w’ in there too for ‘white’. </span></p>\n<div></div>\n<p><span>The issue of racism in the sport has once again been brought to the fore in the wake of comments from German director Patrick Moster at the Tokyo Olympic Games. Moster was stood in the feed zone during the time trial and — as Azzedine Lagab of Algeria and Amanuel Ghebreigzabhier of Eritrea rode ahead of German rider Nikias Arndt — he shouted </span><span>“Get the camel riders! Get the camel riders! Come on!” as Arndt approached.  </span></p>\n<p><span>As is so often the case, Moster’s remorse only kicked in once it was clear that his remarks had been captured on the live coverage. He issued an apology for his comments claiming that it was “in the heat of the moment” as if it’s okay to only be racist when under pressure (spoiler: it’s never okay). The German federation sent him home from the Games but have done little else since, and the UCI did as the UCI does: nothing until mounting pressure forced them to.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/opinion-tao-zlatan-and-how-to-cut-through-pro-cyclings-white-noise\">Related – Tao, Zlatan and cutting through cycling's white noise</a></strong></em></p>\n<p><span>Africa Rising Cycling were instrumental in giving the incident exposure online and ensuring that the necessary parties were held to account — including the UCI. The governing body issued a statement condemning Moster which did not originally detail any repercussions for the German. Later, after more external pressure had been applied, the UCI announced that Moster would be provisionally suspended: “The </span><span>UCI Disciplinary Commission urgently examined the matter and considered that Mr Moster’s remarks were discriminatory and contrary to basic rules of decency, in violation of article 12.4.017 (d) of the UCI Regulations,” read the statement. They added: “The UCI condemns all forms of racist and discriminatory behaviour and strives to ensure integrity, diversity and equality in cycling.”</span></p>\n<p><span>The UCI code of ethics states: “The persons bound by the Code shall not undertake any action, use any denigrating words, or any other means, that offend the human dignity of a person or group of persons, on any grounds including but not limited to skin colour, race, religion, ethnic or social origin, political opinion, sexual orientation, disability or any other reason contrary to human dignity.”</span></p>\n<p><span>The way the governing body deals with this case from here will set an important benchmark for the future. If their stance is as strong as they claim then nothing short of a total expulsion from the sport would suffice. Historically, most have escaped with tokenistic suspensions of little consequence equating to a mere slap on the wrist — after which they are clear to continue in the sport unimpeded.  </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1234259046_1024x1024.jpg?v=1627651784\" /></span></p>\n<p><em><span>The comments took place during the men's Individual Time Trial at the Olympic games. (Pictured is Maximilian Schachmann, not </span>Nikias Arndt). Photo: Greg Baker/Getty Images</em></p>\n<p><span>The reason cycling hasn’t had a reckoning when it comes to tackling racism is that there is so little representation in the pro peloton of riders from diverse backgrounds. The collective impetus isn’t there because there is too much experiential distance between most of the riders and those directly affected by racism. But not being directly affected by racism is not an excuse to turn a blind eye and, although the tide is changing — with individual riders making statements and showing solidarity — the overwhelming silence is deafening and not enough is being done both from powers like the UCI and individuals within the sport.  </span></p>\n<p>Of course, the fragile structure of professional cycling impedes riders’ agency. Those for whom employment is precarious at the best of times — with many facing one- or two-year contracts — the concern is that coming out with a hard-hitting political message might be seen as a problematic trait that could cost them a contract down the line. However those who can afford to speak up but who are silent are part of the problem, too. You don’t have to dig too deeply into how anti-racism works to discover the importance of allyship. </p>\n<p><span>German rider Rick Zabel — who wasn’t at the Olympic Games himself — addressed this problem in a statement posted on his social media in the wake of Moster’s comments: “I understand all athletes who say nothing about it because they are afraid of being in the line of fire if they express their opinion” said Zabel. </span></p>\n<p><span>But, unlike others, Zabel was willing to speak out: “I decided to do it anyway because it directly affects my sport and I think it’s a shame when almost no one takes a position on it,” he said before condemning Moster’s comments and his “terse” apology. </span></p>\n<p><span>Zabel was clear on the next steps, too: “If we want to defend the Olympic values and anti-racism campaigns and also credibly represent them in the long term, then such an incident must not be tolerated.” </span></p>\n<p><span>Arndt, the rider to whom Moster was ‘encouraging’ with his slurs was also quick to state: </span><span>“I am appalled by the incidents at today’s Olympic time trial and would like to distance myself clearly from the statements of the sporting director! Such words are not acceptable,” adding: “The Olympics and cycling stand for tolerance, respect and fairness. I represent these values 100% and take my hat off to all the great athletes who have come from all over the world here in Tokyo!” </span></p>\n<div></div>\n<p><span>As is the case within wider society, the issue in cycling is systemic: if people keep getting away with being racist then they have no incentive to stop. Gianni Moscon, who has a history of hot-headed incidents dotted throughout his career, has managed to keep a contract with INEOS after racially abusing one of the few black riders in the men’s peloton, Kevin Reza, at the Tour of Romandie in 2017. Moscon was given a paltry six-week suspension by the team and ordered to attend a ‘diversity awareness course'. </span></p>\n<p><span>Fast forward to the 2020 Tour de France and while the wider world was engaged with the Black Lives Matter movement, the overwhelmingly white riders and teams at the Tour were conspicuous in their silence on the issue. As those within other sports were taking the knee and making their zero-tolerance stances clear, cycling was missing an opportunity to use one of the biggest sporting platforms in the world to make a statement. </span></p>\n<p><span>There was a lukewarm effort on the final stage in which a handful of riders took a Sharpie to their masks to write ‘no to racism’ on them and Reza was allowed to ride front and centre. The prominence of the B&amp;B Hotels rider at the beginning of that stage only served to highlight the loneliness of being the only black rider in the 176-man peloton — few rode up and spoke to Reza, who told Cycling News: </span><span>“I’ve been a professional for 10 years now and I haven’t seen a lot of solidarity in cycling\".</span></p>\n<p><span>In order to combat racism in cycling those in the sport must listen to and acknowledge what Reza and other black riders have to say. Not only that but act by speaking up to condemn the likes of Moster. Attitudes and actions must change on both an individual and administrative level. Inadequate punishments and radio silence won’t suffice. Until the sport as a whole takes a collective stance, nothing will change. The only positive outcome of Moster’s contemptible actions would be for them to at last inspire a change in the way those within the sport respond to racism.</span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"04c1088269a337b717ec526eef6d0151b2e3da18d59ee875f85c60a2105a035a","category":"Cycling"}