{"title":"Plasticity and associated epigenetic mechanisms play a role in thermal evolution during range expansion","link":"https://academic.oup.com/evlett/article/8/1/76/7017528?rss=1","date":1675123200000,"content":"<span><div>Abstract</div>Due to global change, many species are shifting their distribution and are thereby confronted with novel thermal conditions at the moving range edges. Especially during the initial phases of exposure to a new environment, it has been hypothesized that plasticity and associated epigenetic mechanisms enable species to cope with environmental change. We tested this idea by capitalizing on the well-documented southward range expansion of the damselfly <span>Ischnura elegans</span> from France into Spain where the species invaded warmer regions in the 1950s in eastern Spain (old edge region) and in the 2010s in central Spain (new edge region). Using a common garden experiment at rearing temperatures matching the ancestral and invaded thermal regimes, we tested for evolutionary changes in (thermal plasticity in) larval life history and heat tolerance in these expansion zones. Through the use of de- and hypermethylating agents, we tested whether epigenetic mechanisms play a role in enabling heat tolerance during expansion. We used the phenotype of the native sister species in Spain, <span>I. graellsii</span>, as proxy for the locally adapted phenotype. New edge populations converged toward the phenotype of the native species through plastic thermal responses in life history and heat tolerance while old edge populations (partly) constitutively evolved a faster life history and higher heat tolerance than the core populations, thereby matching the native species. Only the heat tolerance of new edge populations increased significantly when exposed to the hypermethylating agent. This suggests that the DNA methylation machinery is more amenable to perturbation at the new edge and shows it is able to play a role in achieving a higher heat tolerance. Our results show that both (evolved) plasticity as well as associated epigenetic mechanisms are initially important when facing new thermal regimes but that their importance diminishes with time.</span>","author":"","siteTitle":"Evolution Letters Current Issue","siteHash":"ccc44437a8276654c44dddd156a8ce3b5dae5730f1c2406ed04aa90599bdf071","entryHash":"04ca47e79e907d99d0e1c3436e200273896184cb3e3a3a4ff44093bdd797a3b3","category":"Environment"}