{"title":"222 nm causes greater protein damage and repair inhibition of <i>E</i>. <i>coli</i> than 254 nm for water disinfection","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000238","date":1721829600000,"content":"<p>by David McDonald, Daniel Ma, Natalie M. Hull</p>\r\n\r\nGermicidal ultraviolet (UV) light has been widely used to inactivate pathogens in water. Emerging alternatives to conventional low pressure (LP) mercury lamps emitting at 254 nm, such as krypton chloride (KrCl) excimer lamps emitting at 222 nm, are gaining acceptance and popularity due to advantages in human safety and disinfection mechanisms. Cyclobutane pyrimidine dimer (CPD) formation kinetics and photolyase damage kinetics were quantified in <i>E</i>. <i>coli</i> for 222 nm and 254 nm UV. Molecular damage and cell regrowth were also quantified after UV irradiation under photorepair and dark repair incubation conditions using a standardized photorepair fluence response protocol. CPDs and photolyase were measured using enzyme linked immunosorbent assays (ELISA). A novel ELISA for photolyase was developed for this study. Culture-based log inactivation UV fluence responses were similar for 254 nm and 222 nm, with Geeraerd model estimates for rate constants of 1.18±0.09 and 1.24±0.08 cm<sup>2</sup> mJ<sup>−1</sup> for LP and KrCl lamps, respectively. Molecular UV fluence kinetics showed that the rate of CPD formation was greater by LP, but the rate of photolyase damage was greater by KrCl, as supported by the intercepts of repair kinetics. Compared to LP irradiated samples, KrCl irradiated samples exhibited less repair overall. For a given lamp, similar repair was observed between light and dark repair incubations. Percent reactivation rates with respect to photorepair fluence were (3.7±1.4)×10<sup>−5</sup> and (–1.3±2.5)×10<sup>−5</sup> cm<sup>2</sup> mJ<sup>-1</sup> for LP and KrCl lamps, respectively. CPDs decreased at a higher rate during repair incubations in LP samples than KrCl samples, and photolyase concentration increased in LP samples but decreased in KrCl samples. The results quantify contributions of photolyase protein damage to disinfection and repair prevention mechanism of KrCl lamps. This study mechanistically demonstrates why KrCl lamps can be applied for UV water disinfection to limit photorepair after treatment.\r\nSynopsis: This study used a novel photolyase assay to demonstrate photolyase damage inflicted by krypton chloride excimer lamps contributes to disinfection of bacteria to prevent bacterial photorepair of damaged DNA and regrowth in drinking water treatment.","author":"David McDonald","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"04cb8528c9b78fb2834fc3f573a9167d46dea67635746b32594886d253a59ac6","category":"Environment"}