{"title":"Climatic Predictors of Long‐Distance Migratory Birds Breeding Productivity Across Europe","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13901?af=R","date":1723871378000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>Ongoing climate changes represent a major determinant of demographic processes in many organisms worldwide. Birds, and especially long-distance migrants, are particularly sensitive to such changes. To better understand these impacts on long-distance migrants' breeding productivity, we tested three hypotheses focused on (i) the shape of the relationships with different climate variables, including previously rarely tested quadratic responses, and on regional differences in these relationships predicted by (ii) mean climatic conditions and (iii) by the rate of climate change in respective regions ranging from Spain to Finland.</p>\n<h2>Location</h2>\n<p>Europe.</p>\n<h2>Time Period</h2>\n<p>2004–2021.</p>\n<h2>Major Taxa Studied</h2>\n<p>Long-distance migratory passerine birds.</p>\n<h2>Methods</h2>\n<p>We calculated breeding productivity from constant effort ringing sites from 11 European countries covering 34° of latitude, and extracted temperature- and precipitation-related climate variables from E-OBS and NASA MODIS datasets. To test our hypotheses, we fitted GLMM and Bayesian meta-analytic models.</p>\n<h2>Results</h2>\n<p>We revealed hump-shaped responses of productivity to temperature, growing degree-days, green-up onset date, and precipitation anomaly, and negative responses to intense and prolonged rains across the regions. The effects of March temperature and April growing degree-days were more negative in cold than in warm regions, except for the region with the highest accumulated heat, whereas increasing June precipitation anomalies were associated with higher productivity in both dry and wet regions. Productivity responses to climate were unrelated to the rate of climate warming.</p>\n<h2>Main Conclusions</h2>\n<p>The influence of climate on bird productivity proved to be frequently nonlinear, as expected by ecological theory. The rate of climate change is less important than regional interannual variability in climate (which is predicted to increase), but this may change with the progression of climate change in the future. Productivity declines in long-distance migratory songbirds are particularly expected if out-of-norm water excess increases in frequency or strength.</p>","author":"Jan Hanzelka, \nTomáš Telenský, \nJaroslav Koleček, \nPetr Procházka, \nRobert A. Robinson, \nOriol Baltà, \nJaroslav Cepák, \nGabriel Gargallo, \nPierre‐Yves Henry, \nIan Henshaw, \nHenk van der Jeugd, \nZsolt Karcza, \nPetteri Lehikoinen, \nBert Meister, \nArantza Leal Nebot, \nMarkus Piha, \nKasper Thorup, \nAnders P. Tøttrup, \nJiří Reif","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"04ccb33cd9c074d8bfce087720df26c52f1a04bed22ed56b2a171fd415dac221","category":"Environment"}