{"title":"Epidemiology of soil-transmitted helminthiasis among school-aged children in pastoralist communities of Kenya: A cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304266","date":1716472800000,"content":"<p>by Richelle W. Kihoro, Damaris Mulewa, Collins Okoyo, Dominic Ayaa, Agnes Korir, Doris W. Njomo, Charles Mwandawiro, Janet Masaku</p>\r\nIntroduction <p>Soil-transmitted helminthiasis (STH) are a major public health problem in Sub-Saharan Africa. In Kenya, the National School Based Deworming Program (NSBDP) was launched in 2012 with a goal of reducing STH prevalence in school-aged children (SAC) to &lt;1%, however monitoring and evaluation results have consistently showed &gt; 20% prevalence in Narok County. We conducted a study to investigate factors associated with STH infections among SAC in Narok County.</p> Methodology <p>A cross-sectional study was conducted among 514 SAC from five schools in Trans Mara West sub-county, Narok County. The sub-county was selected because it had participating schools within the NSBDP with a high prevalence of STH infection. Participants were selected using systematic random sampling. Stool samples collected from participants were examined for STH eggs using Kato-Katz technique. An open data kit questionnaire was used to collect socio-demographics, household, and STH knowledge information from 139 of the 514 SAC. Descriptive statistics was used to summarize the data, prevalence and mean intensity of infections were calculated, and logistic regression used to determine factors associated with STH infections.</p> Results <p>The overall prevalence of any STH infection was 24.6% (95%CI: 21.1–28.6). <i>Trichuris trichiura</i> 14.4% (95%CI: 11.7–17.8), <i>Ascaris lumbricoides</i> 12.5% (95%CI: 9.9–15.7) and hookworm 0%. From multivariable analysis the only factors significantly associated with increased risk of STH infection were, children attending Karda and Nkarano schools with aOR = 5.29 (95%CI: 1.45–19.24); p = 0.011 and aOR = 4.53 (95%CI: 1.29–15.97); p = 0.019 respectively. For <i>A</i>. <i>lumbricoides</i>, children attending Nkarano School were associated with a significant risk of infection with aOR = 7.81 (95%CI: 1.81–33.63); p = 0.006.</p> Conclusions <p>Despite the ongoing work of NSBDP, the STH prevalence is still ≥ 20% in Trans Mara West sub-county Narok County, among SAC. This underscores the need for continued annual MDA. Additionally, if possible, drug combinations may effectively manage <i>T</i>. <i>trichiura</i>, the region’s most common helminth. The study found a correlation between children attending specific schools and STH infection risk, suggesting the importance of health education and improved water, sanitation, and hygiene practices holistically both in schools and associated catchment areas that can act as STH reservoirs to alleviate the burden of STH.</p>","author":"Richelle W. Kihoro","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"04d679a00b599ea69f26217729402089ec393d78bf0e01e6635d4a3165c43a2e","category":"Interdisciplinary"}