{"title":"Characteristics of creative individuals: An umbrella review protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311851","date":1728568800000,"content":"<p>by Alex Thabane, Tyler McKechnie, Phillip Staibano, Goran Calic, Colin Kruse, Jason W. Busse, Sameer Parpia, Mohit Bhandari</p>\r\nIntroduction <p>The properties of creative products–novelty and usefulness–are generally agreed upon by researchers. Yet, consensus is lacking on which personal and environmental factors contribute to an individual’s creative potential, or to what extent. substantial research work has been conducted in this area, leading to the publication of many systematic reviews and meta-analyses collating the available evidence. However, many of these reviews have differing methodological and theoretical characteristics, and often report conflicting results. To summarize the current review literature on factors associated with creativity and better understand the similarities and discrepancies among reviews on the same topic, we plan to conduct an umbrella review of reviews.</p> Methods <p>This protocol has been registered in Open Science Framework (DOI: 10.17605/OSF.IO/H78YS). We will search MEDLINE, PsycINFO, Web of Science, EMBASE, and Google Scholar for peer-reviewed reviews exploring factors associated with creativity. The quality of the included reviews will be assessed using the Risk of Bias Assessment Tool for Systematic Reviews (ROBIS), and the degree of study overlap across reviews assessed through calculation of the corrected covered area (CCA). Descriptive analyses will be performed to synthesize the results of the included reviews. We plan to use the results to create a holistic framework of the factors associated with creativity, which could be used to cross-validate existing creativity theories, or create new ones.</p> Ethics and dissemination <p>The results of this umbrella review will be published in a relevant psychology-focused journal and presented at local, national and international conferences. As all data is peer-reviewed and presented in aggregate, we will not require ethics approval.</p>","author":"Alex Thabane","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"04d7242f1743cfbc45ae5bd27771e2beb6a8e11a232b41ffb2b8f41242591c54","category":"Interdisciplinary"}