{"title":"A Biomarker-Based Characterisation of EMT and Neuroendocrine Differentiation States in Pancreatic and Small Cell Hypercalcemic Ovarian Tumor Cells and Their Modulation by Transforming Growth Factor-&beta; and Bone Morphogenetic Protein-7","link":"https://www.preprints.org/manuscript/202407.1176/v1","date":1721082189000,"content":"Pancreatic ductal adenocarcinoma (PDAC) represents an extremely aggressive type of cancer due in part to early invasion and metastasis, which in turn involves epithelial-mesenchymal transition (EMT) of the tumor cells. Prompted by the discovery that two PDAC-derived tumor cell lines of the quasi-mesenchymal subtype (PANC-1, MIA PaCa-2) exhibit neuroendocrine differentiation (NED), we asked whether NED is associated with EMT. Using quantitative real-time PCR and immunoblot analysis, we initially verified endogenous expression of various NED markers, i.e., chromogranin A (CHGA), synaptophysin (SYP), somatostatin receptor 2 (SSTR2) and SSTR5 in PANC-1 and MIA PaCa-2 cells. In HPDE6c7 normal pancreatic duct epithelial cells and in BxPC-3, another PDAC cell line with an epithelial phenotype, the expression of CHGA, SYP and neuron-specific enolase 2 (NSE) was either undetectable or much lower than in PANC-1 and MIA PaCa-2 cells. Parental cultures of PANC-1 cells exhibit EM plasticity (EMP) and harbor clonal subpopulations with different EMT phenotypes [Ungefroren et al 2022]. Monitoring the NED state of mesenchymal and epithelial PANC-1 subclones showed that the NE phenotype is more pronounced in M-type clones when compared to E-type ones. Inducing EMT in parental cultures of PANC-1 cells by treatment with transforming growth factor (TGF)-β1 repressed epithelial genes and co-induced mesenchymal and NED genes, except for SSTR5. Surprisingly, treatment with bone morphogenetic protein (BMP)-7 differentially affected gene expression in PANC-1 and MIA PaCa-2 cells. It synergised with TGF-β1 in the induction of vimentin, SNAIL, SSTR2 and NSE but antagonised it in the regulation of CHGA and SSTR5. From these data, we conclude that in EMT of PDAC cells mesenchymal and NED markers are co-regulated, and that mesenchymal-epithelial transition (MET) is associated with a loss of both the mesenchymal and NED phenotypes. Analysing NED in another tumor type, small cell carcinoma of the ovary hypercalcemic type (SCCOHT), revealed that two model cell lines of this disease (SCCOHT-1, BIN-67) do express CDH1, SNAI1, VIM, CHGA, SYP, ENO2 and SSTR2, but that in contrast to BMP-7 none of these genes was transcriptionally regulated by TGF-β1. We conclude that in PDAC-derived tumor cells, NED is closely linked to EMT and TGF-β signaling, which may have implications for the therapeutic use of TGF-β inhibitors in PDAC management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"04de34d495488b0b641153e7e54bb47514b37c4dbe1044e8094a09e2ace0b7fa","category":"Interdisciplinary"}