{"title":"Modelling animal network data in R using STRAND","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14021?af=R","date":1709702152000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/dd808c34-3d44-42a8-8a8d-440723f38848/jane14021-toc-0001-m.png\" alt=\"Modelling animal network data in R using STRAND\" />\n<p>Using simple base-R syntax, users can create complex Bayesian network analysis models that integrate actor, recipient and dyadic random effects, and accommodate individual-level, dyad-level and block-level covariates. This R package thus allows biologists, ecologists and social scientists to study social relationships using scientifically plausible generative models of network ties.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThere have been recent calls for wider application of generative modelling approaches in applied social network analysis. At present, however, it remains difficult for typical end users—for example, field researchers—to implement generative network models, as there is a dearth of openly available software packages that make application of such models as simple as other, permutation-based approaches.\n\nHere, we outline the <span>STRAND</span> R package, which provides a suite of generative models for Bayesian analysis of animal social network data that can be implemented using simple, base R syntax.\n\nTo facilitate ease of use, we provide a tutorial demonstrating how <span>STRAND</span> can be used to model proportion, count or binary network data using stochastic block models, social relation models or a combination of the two modelling frameworks.\n\n<span>STRAND</span> facilitates the application of generative network models to a broad range of data found in the animal social networks literature.\n</p>","author":"Cody T. Ross, \nRichard McElreath, \nDaniel Redhead","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"04faa7b9c7cac001dd38c92f78f6383630c030cabe7987aca0becd5fd0e25c9a","category":"Environment"}