{"title":"The TLK1&gt;Nek1 Axis Promotes Nuclear Retention and Activation of YAP with Implications for CRPC","link":"https://www.preprints.org/manuscript/202407.1709/v1","date":1721641967000,"content":"Despite some advances in controlling progression of Prostate Cancer (PCa) that is refractory to the use of ADT/ARSI, most patients eventually succumb to the disease, and there is a pressing need to understand the mechanisms that lead to the development of CRPC.  A common mechanism is the ability to integrate AR signals from vanishing levels of testosterone, with the frequent participation of YAP as a coactivator, and pointing to deregulation of the Hippo pathway as a major determinant. We have recently shown that YAP is post-transcriptionally activated via the TLK1&gt;NEK1 axis by a stabilizing phosphorylation at Y407. We are now solidifying this work by showing that: 1) The phosphorylation of Y407 is critical for YAP retention/partition in the nuclei, and that J54 (TLK1i) reverses this along with YAP407 dephosphorylation. 2) That the enhanced degradation of (cytoplasmic) YAP is increased by J54 counteracting its Enzalutamide-induced accumulation.  3) That the basis for all these effects, including YAP nuclear retention, can be explained by the stronger association of pYAP-Y407 with its transcriptional co-activators, AR and TEAD1.  4) We demonstrate that ChIP for GFP-YAP-wt, but hardly for the GFP-YAP-Y407F mutant, at promoters of typical ARE- and TEAD1-driven genes is readily detected but becomes displaced after treatment with J54.  5) While xenografts of LNCaP cells show rapid regression following treatment with ARSI+J54, in the VCaP model, driven by the TMPRSS2-ERG oncogenic translocation, tumors initially respond well to the combination but subsequently recur, despite the continuous suppression of pNek1-T141 and pYAP-Y407.  This suggests an alternative parallel pathway for CRPC progression for VCaP tumors long-term, that may be separate from the observed ENZ-driven YAP deregulation, although clearly some YAP gene targets like PD-L1, that are found accumulate following prolonged ENZ treatment, are still suppressed by concomitant addition of J54.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"04fe3d9b095d4e5835158cd9766392be5013124d192d8e0d1d1f3addc3601fea","category":"Interdisciplinary"}