{"title":"Epic Games ประกาศปรับวิธีคิดราคาใช้ Unreal Engine สำหรับผู้ใช้งานนอกกลุ่มเกม เช่น หนัง-ทีวี","link":"https://www.blognone.com/node/136111","date":1696554055000,"content":"<div><div><div><p>Tim Sweeney ซีอีโอ Epic Games ประกาศในระหว่างการนำเสนอในงาน Unreal Fest 2023 ว่าบริษัทจะขึ้นราคาการใช้ Unreal Engine สำหรับงานที่ไม่ใช่เกม เช่น ภาพยนตร์, โทรทัศน์, ยานยนต์ หรือในอุตสาหกรรมอื่น โดยยังไม่ได้ให้รายละเอียดราคา แต่บอกว่าไม่ได้ถูกหรือแพงจนเกินไป โครงสร้างราคาจะเป็นแบบต่อผู้ใช้งานคล้ายกับการคิดราคาของ Maya หรือ Photoshop</p>\n<p>ทั้งนี้ผู้ใช้ Unreal Engine สำหรับงานเกม จะไม่มีปรับราคาแต่อย่างใด</p>\n<p>เขาให้เหตุผลแบบตรงไปตรงมาถึงสาเหตุที่ขึ้นราคา ว่าเป็นผลจากปัญหาการเงินของบริษัท โดยเริ่มเห็นสัญญาณตั้งแต่ 10 สัปดาห์ที่แล้ว นำมาสู่การประกาศ<a href=\"https://www.blognone.com/node/135983\">ปลดพนักงาน</a>เมื่อสัปดาห์ก่อน</p>\n<p>Sweeney ยังให้ข้อมูลเพิ่มเติมว่าลูกค้ากลุ่มการศึกษาและนักเรียน ยังสามารถใช้งาน Unreal Engine ได้ฟรีต่อไป รวมถึงผู้ผลิตภาพยนตร์อิสระรายเล็กและงานที่มีรายได้ไม่ถึงเกณฑ์ ก็จะได้ใช้งานฟรีหรือเป็นราคาพิเศษ</p>\n<p>ประกาศการเปลี่ยนเงื่อนไขราคาของ Unreal Engine นี้ ออกมาหลังจาก Unity ประกาศ<a href=\"https://www.blognone.com/node/135724\">เปลี่ยนวิธีคิดไลเซนส์</a>สำหรับผู้พัฒนาเกม ซึ่งนำมาสู่การประท้วงรุนแรงจน Unity ต้องประกาศ<a href=\"https://www.blognone.com/node/135887\">ปรับราคา</a> จึงเห็นได้ว่ากรณีของ Unreal Engine ยังไม่ได้เปลี่ยนในกลุ่มลูกค้าผู้พัฒนาเกมนั่นเอง</p>\n<p>ที่มา: <a href=\"https://www.gamedeveloper.com/business/epic-games-to-update-unreal-engine-pricing-for-devs-outside-game-industry#close-modal\">Game Developer</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e07cd8aad4127514f7b5666013f00c9f.jpg\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/unreal\">Unreal</a></div><div><a href=\"/topics/epic-games\">Epic Games</a></div><div><a href=\"/topics/game-engine\">Game Engine</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"04fef523f535ded7cf9f8ba883dfa8bd9de56c308995e02c4c24b0b24d1cd28e","category":"Thai"}