{"title":"Comparison of causes of stillbirth and child deaths as determined by verbal autopsy and minimally invasive tissue sampling","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003065","date":1722261600000,"content":"<p>by Nega Assefa, Anthony Scott, Lola Madrid, Merga Dheresa, Gezahegn Mengesha, Shabir Mahdi, Sana Mahtab, Ziyaad Dangor, Nellie Myburgh, Lesego Kamogelo Mothibi, Samba O. Sow, Karen L. Kotloff, Milagritos D. Tapia, Uma U. Onwuchekwa, Mahamane Djiteye, Rosauro Varo, Inacio Mandomando, Ariel Nhacolo, Charfudin Sacoor, Elisio Xerinda, Ikechukwu Ogbuanu, Solomon Samura, Babatunde Duduyemi, Alim Swaray-Deen, Abdulai Bah, Shams El Arifeen, Emily S. Gurley, Mohammed Zahid Hossain, Afruna Rahman, Atique Iqbal Chowdhury, Bassat Quique, Portia Mutevedzi, Solveig A. Cunningham, Dianna Blau, Cyndy Whitney</p>\r\n\r\nIn resource-limited settings where vital registration and medical death certificates are unavailable or incomplete, verbal autopsy (VA) is often used to attribute causes of death (CoD) and prioritize resource allocation and interventions. We aimed to determine the CoD concordance between InterVA and CHAMPS’s method. The causes of death (CoDs) of children &lt;5 were determined by two methods using data from seven low- and middle-income countries (LMICs) enrolled in the Child Health and Mortality Prevention Surveillance (CHAMPS) network. The first CoD method was from the DeCoDe panel using data from Minimally Invasive Tissue Sampling (MITS), whereas the second method used Verbal Autopsy (VA), which utilizes the InterVA software. This analysis evaluated the agreement between the two using Lin’s concordance correlation coefficient. The overall concordance of InterVA4 and DeCoDe in assigning causes of death across surveillance sites, age groups, and causes of death was poor (0.75 with 95% CI: 0.73–0.76) and lacked precision. We found substantial differences in agreement by surveillance site, with Mali showing the lowest and Mozambique and Ethiopia the highest concordance. The InterVA4 assigned CoD agrees poorly in assigning causes of death for U5s and stillbirths. Because VA methods are relatively easy to implement, such systems could be more useful if algorithms were improved to more accurately reflect causes of death, for example, by calibrating algorithms to information from programs that used detailed diagnostic testing to improve the accuracy of COD determination.","author":"Nega Assefa","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"050ba60c3bfd89593fa01e4bf655aca6007be991d38314d4d56dc53d9a05cd46","category":"Environment"}