{"title":"First Malware Running Natively on M1 Chip Discovered","link":"https://www.macrumors.com/2021/02/17/first-m1-chip-malware/","date":1613601239000,"content":"Malware specifically tailored to run on Apple's <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> chip has been discovered, indicating that malware authors have begun adapting malicious software for Apple's new generation of Macs with Apple silicon.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/11/macbook-air-m1-unboxing-feature.jpg\" alt=\"\" width=\"1616\" height=\"902\" class=\"aligncenter size-full wp-image-770435\" />\r\n<br/>\r\nMac security researcher Patrick Wardle has now <a href=\"https://objective-see.com/blog/blog_0x62.html\">published a report</a>, cited by <a href=\"https://www.wired.com/story/apple-m1-malware/\"><em>Wired</em></a>, that explains in detail how malware has started to be adapted and recompiled to run natively on the &zwnj;M1&zwnj; chip. \r\n<br/>\r\n\r\n<br/>\r\nWardle discovered the first known native &zwnj;M1&zwnj; malware in the form of a Safari adware extension, originally written to run on Intel x86 chips. The malicious extension, called \"GoSearch22,\" is a well-known member of the \"Pirrit\" Mac adware family and was first spotted at the end of December. Pirrit is one of the oldest and most active Mac adware families, and has been known to constantly change in an attempt to evade detection, so it is unsurprising that it has already begun adapting for the &zwnj;M1&zwnj;.\r\n<br/>\r\n\r\n<br/>\r\nThe GoSearch22 adware presents itself as a legitimate Safari browser extension, but collects user data and serves a large number of ads such as banners and popups, including some that link to malicious websites to proliferate more malware. Wardle says the adware was signed with an Apple Developer ID in November to further conceal its malicious content, but it has since been revoked.\r\n<br/>\r\n\r\n<br/>\r\nWardle notes that since malware for the &zwnj;M1&zwnj; is still at an early stage, antivirus scanners are not detecting it as easily as x86 versions and defensive tools like antivirus engines are struggling to process the amended files. The signatures used to detect threats from malware on the &zwnj;M1&zwnj; chip have not yet been substantially observed, so the security tools to detect and deal with it are not yet available.\r\n<br/>\r\n\r\n<br/>\r\nResearchers from security company Red Canary told <em>Wired</em> that other types of native &zwnj;M1&zwnj; malware, distinct from Wardle's findings, have also been found and are being investigated.\r\n<br/>\r\n\r\n<br/>\r\nOnly the MacBook Pro, <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>, and <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a> have Apple silicon chips at this time, but the technology is expected to expand across the Mac lineup over the next two years.  Given that all new Mac computers are expected to feature Apple silicon chips like the &zwnj;M1&zwnj; in the near future, it was somewhat inevitable that malware developers would eventually start to target Apple's new machines. \r\n<br/>\r\n\r\n<br/>\r\nWhile the M1-native malware that researchers have found does not seem to be unusual or particularly dangerous, the emergence of these new varieties acts as a warning that there is likely more to come.\r\n<br/>\r\n\r\n<br/>\r\nSee Wardle's <a href=\"https://objective-see.com/blog/blog_0x62.html\">full report</a> for more information about the first M1-native malware.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/apple-silicon/\">Apple Silicon</a>, <a href=\"https://www.macrumors.com/guide/m1/\">M1</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/17/first-m1-chip-malware/\">First Malware Running Natively on M1 Chip Discovered</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/first-malware-running-natively-on-m1-chip-discovered.2285114/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0blNXbvRklM:GHLoRpg1j7g:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0blNXbvRklM:GHLoRpg1j7g:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/0blNXbvRklM\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0521233c5c1691cbece7fd0857acc6882d9b68e218aa588e5f0285316997cf8f","category":"Apple"}