{"title":"Giro d'Italia stage 14 preview - can the sprinters survive the Simplon Pass?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-stage-14-preview","date":1684514182000,"content":"\n      <p><b>Distance: </b><span>193km<br /></span><b>Start location: </b><span>Sierre<br /></span><b>Finish location: </b><span>Cassano Magnago<br /></span><b>Start time: </b><span>12:05 CEST<br /></span><b>Finish time (approx): </b><span>17:14</span><b> </b>CEST</p>\n<p><span>Before the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia</a> route crosses the border back into Italy, the riders will spend a little more time in Switzerland at the start of stage 14 as they set off from the town of Sierre. Located in the canton of Valais, Sierre is known as the ‘City of the Sun’ for being exposed to approximately 300 days of sunshine every year, and these conditions, along with its south-easterly aspect that helps make the most of the sunlight, and the way the surrounding Alpine peaks help protect it from rainfall, have helped make it the leading wine producing region in Switzerland. Their wine is the pride of the town, and there are museums, wine trails and vineyard walks dedicated to it.  </span></p>\n<p>The riders return to Italy while climbing the Simplon Pass, after which they’ll head in a south-easterly direction towards Cassano Magnago. A small, unremarkable town in Lombardy, Cassano Magnago nevertheless has the cycling claim to fame for being the home of two-time Giro d’Italia winner Ivan Basso. Despite being one of the most successful Italian cyclists of the last few decades, Basso leaves a controversial legacy after being implicated in the Operation Puerto doping scandal just weeks after the 2006 Giro. After serving a ban and sort of admitting to having doped, he came back to win his second Giro title in 2010. Since retiring, he has invested in the Eolo-Kometa along with former Tinkoff-Saxo teammate Alberto Contador, who secured another wildcard invitation to take part in their third Giro d’Italia edition this year. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_14_fced547d-ee70-46b0-9e4e-279129440a7b.jpg?v=1684316485\" alt /><em>Stage 14 profile sourced on the Giro d'Italia website </em></p>\n<p><span>Despite the inclusion of Simplon Pass, this will not be a stage for the climbing GC men in the mould of Basso. After they’ve finished descending it, there are about 100km of almost completely flat roads until the finish, allowing plenty of time for anyone dropped to chase back into the peloton in time for a bunch sprint.</span></p>\n<p>That said, lasting over 20km and averaging 6.5%, the Simplon Pass is a very hard, category one climb that won't be easy for the sprinters. Those hoping to remain in contention won’t want to give themselves too much ground to make up by distanced early on the climb, and nor can they afford to go into the red trying to follow the pace and end up falling several minutes behind. It is still possible that teams whose sprinters arrive at the top still in the peloton work hard to ensure those dropped don’t return, even if it will require a long effort. </p>\n<p>In the event that only a small peloton makes it to the final phase of the race, it could be hard to control any stage-hunting attacks on the uncategorised uphill kilometre at 6.1% 16km from the finish. And even if the race does end in a sprint, the draggy final kilometre, which rises at about 2 or 3%, adds another complication for the sprinters hoping for a stage win. With all this to worry about, don’t be surprised if the sprinters allow whatever breakaway forms on the Simplon Pass to survive to the finish.</p>\n<h3>Contenders</h3>\n<p><span>After yesterday's shortened stage that started with fireworks up the Croix de Cœur, legs will be feeling heavy. And while the 100km from the finish is relatively flat on stage 14, the mighty Simplon Pass is a big beast they'll have to contend with first – maybe too big a challenge for the pure sprinters – making it a potential day for the breakaway. </span></p>\n<p><span>Moreover, the firepower of the sprint teams is beginning to dwindle amongst the peloton. Kaden Groves (Alpecin-Deceuninck) and Mads Pedersen (Trek-Segafredo) have both left the race leaving their teammates to seek glory from the breakaways, while the likes of UAE Team Emirates for Pascal Ackermann, Team DSM for Marius Mayrhofer and Alberto Dainese, and Intermarché-Circus-Wanty for Niccolò Bonifazio, either have GC interests or so few remaining teammates that controlling a break will be near-impossible.</span></p>\n<p><span>Mark Cavendish (Astana-Qazaqstan) and Jonathan Milan (Bahrain-Victorious) are the two sprinters remaining with full teams, but the former is likely to find the climbing too much on this stage, while the latter's team won't want to burn all their matches with a GC rider to protect and a handsome lead in the points classification.</span></p>\n<p><span>Jayco-Alula could pull for <strong>Michael Matthews</strong>, but his team are more likely to send him out into the breakaway than work all day on the front of the peloton. His team-mate <strong>Alessandro De Marchi </strong>could also feature, hunting down his stage win after two near-miss attempts at a victory. Matthews' fellow Aussie, Simon Clarke (Israel-Premier Tech), was with De Marchi for one of those missed chances last week and will want to complete his Grand Tour clean-sweep.</span></p>\n<p><b>Toms Skujinš </b><span>(Trek-Segafredo) is on fine form at the moment, having finished in the top 10 on four occasions. Managing to get in the break on a number of stages already, he and his team-mate <strong>Bauke Mollema</strong> will fancy their chances of escaping on the early category one climb.</span></p>\n<p><span>EF Education-EasyPost have been having an excellent Grand Tour so far with two stage wins, courtesy of Magnus Cort and Ben Healy. Looking to make it a third win for the team, </span><b>Alberto Bettiol</b><span> could be a rider to watch if he can get in the break, as could <strong>Magnus Cort.</strong></span></p>\n<p><b>Derek Gee</b><span> (Israel-Premier Tech) has been riding very well, securing two second-place finishes so far and finishing fourth at the summit of Crans Montana. Within touching distance of a win, he'll surely want to be present in a breakaway if he has enough remaining in the tank from Friday's stage. If Soudal - Quick-Step's </span><b>Davide Ballerini</b><span> can get in the break, he will be one of the faster riders in the bunch who can climb the Simplon Pass and push the pace on the flat, shaking out some of the slower riders, while his team-mate <strong>Ilan Van Wilder</strong> impressed from the breakaway on Thursday. </span></p>\n<p><b>Stefano Oldani </b><span>(Alpecin-Deceuninck) is also looking in good shape and could be a contender.</span></p>\n<h3>Predictions</h3>\n<p>We think it'll be three-up for EF Education-EasyPost with Alberto Bettiol taking the win from the breakaway.</p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0522048d5a5ac2068c618a18847e1ccf37c8e01a83f821071dd40e1aa6fd40e8","category":"Cycling"}