{"title":"Regulatory problems and associated factors among infants in Arba Minch health and demographic surveillance system sites, southern Ethiopia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305722","date":1718719200000,"content":"<p>by Agegnehu Bante, Gistane Ayele, Birhanu Alamirew, Muluken Ahmed</p>\r\nIntroduction <p>Infant regulatory problems are a common source of concern for parents, and they increase the risk of impaired infant-caregiver bonding. Despite their impact, they are often overlooked in Ethiopia. Hence, this study aimed to determine the prevalence and associated factors of infant regulatory problems in Arba Minch Health and Demographic Surveillance System sites in southern Ethiopia.</p> Methods <p>A community-based cross-sectional study was conducted among 451 mother-infant pairs from February 15 to March 15, 2022. Regulatory problems were assessed using diagnostic interviews for regulatory problems. The data was collected using an open data kit Android application and analyzed with Stata version 17.0. Bivariable and multivariable logistic regression analyses were computed to identify factors associated with each infant regulatory problem. Statistical significance was declared at a p-value &lt; 0.05.</p> Results <p>In this study, four hundred forty-nine mother-infant pairs were involved, with a response rate of 99.5%. The prevalence of excessive crying, feeding problems, and sleeping difficulties was 14.03% [95% CI: 10.95, 17.59], 20.04% [95% CI: 16.44, 24.05], and 13.59% [95% CI: 10.55, 17.11], respectively. Attending primary education (AOR: 2.54, 95% CI: 1.22, 5.32), high perceived social support (AOR: 0.32, 95% CI: 0.12, 0.89), feeding problems (AOR: 5.0, 95% CI: 2.65, 9.45), and depression, anxiety, and stress (DAS) symptoms (AOR: 2.67, 95% CI: 1.19, 5.98) were associated with excessive crying. In addition, a family size of above five (AOR: 1.82, 95% CI: 1.03, 3.22), excessive crying (AOR: 3.76, 95% CI: 1.85, 7.65), sleeping problems (AOR: 2.29, 95% CI: 1.13, 4.65), comorbid DAS symptoms (AOR: 3.42, 95% CI: 1.64, 7.11), alcohol abuse (AOR: 1.89, 95% CI: 1.04, 3.42), and late initiation of complementary feeding (AOR: 2.67, 95% CI: 1.22, 5.88) were associated with feeding problems. Furthermore, attending primary education (AOR: 2.35, 95% CI: 1.16, 4.77), feeding problems (AOR: 3.47, 95% CI: 1.86, 6.48), and comorbid DAS symptoms (AOR: 3.23, 95% CI: 1.53, 6.84) were associated with sleeping problems.</p> Conclusions <p>Approximately one-third of infants encountered at least one regulatory problem. Level of education, perceived social support, feeding problems, and DAS symptoms were associated with excessive crying. Large family sizes, excessive crying, sleeping problems, comorbid DAS symptoms, alcohol abuse and, late initiation of complementary feeding increase the likelihood of feeding problems. Moreover, attending primary education, feeding problems, and comorbid DAS symptoms increase the odds of sleeping problems. Continuous guidance and support on infant soothing techniques, cognitive and behavioral therapy, and counselling on appropriate coping strategies for postpartum women are imperative to reduce the burden of infant regulatory problems.</p>","author":"Agegnehu Bante","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"05285f4efd03aac0db59d63c0bca2f4d80c2cc4becbd131c392e74ab452006fd","category":"Interdisciplinary"}