{"title":"Used routers often come loaded with corporate secrets","link":"https://arstechnica.com/?p=1932973","date":1681910913000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/routers-800x533.jpg\" alt=\"Pile of old networking gear\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/routers.jpg\">Enlarge</a> (credit: aquatarkus/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>You know that you're supposed to <a href=\"https://www.wired.com/story/how-to-reset-your-phone-before-you-sell-it/\">wipe your smartphone</a> or laptop before you resell it or give it to your cousin. After all, there's a lot of valuable personal data on there that should stay in your control. Businesses and other institutions need to take the same approach, deleting their information from PCs, servers, and network equipment so it doesn't fall into the wrong hands. At the RSA security conference in San Francisco next week, though, researchers from the security firm ESET will <a href=\"https://www.welivesecurity.com/2023/04/18/discarded-not-destroyed-old-routers-reveal-corporate-secrets/\">present findings</a> showing that more than half of secondhand enterprise routers they bought for testing had been left completely intact by their previous owners. And the devices were brimming with network information, credentials, and confidential data about the institutions they had belonged to.</p>\n<p>The researchers bought 18 used routers in different models made by three mainstream vendors: Cisco, Fortinet, and Juniper Networks. Of those, nine were just as their owners had left them and fully accessible, while only five had been properly wiped. Two were encrypted, one was dead, and one was a mirror copy of another device.</p>\n<p></p></div><p><a href=\"https://arstechnica.com/?p=1932973#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1932973&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"052d54e0af56ca95f089ce773731e806f58e398ff111fc42cc622c9024740640","category":"Tech"}