{"title":"Web Roulette for iPhone Lets You Swipe Through Your Favorite Websites","link":"https://www.macrumors.com/2023/05/30/web-roulette-ios-app/","date":1685479045000,"content":"Web Roulette is a newly launched lightweight app from Impending, the app designers behind popular game Heads Up and list-making app Clear. Web Roulette is a redesigned browser app that lets you swipe through your favorite sites one after another, so you can better keep up with new content.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/web-roulette-app.jpg\" alt width=\"1712\" height=\"962\" />\r<br />\nThe Web Roulette interface is populated with a list of popular websites in categories like technology, pop culture, news, gaming, lifestyle, social, shopping, sports, fashion, and business, so you can download it, open it up, select your favorites, and start swiping, but it works best with customization.\r<br />\n\r<br />\nYou're meant to choose the sites that you regularly visit throughout the day, and if they're not in the provided list, you can add them. Once you've loaded the app up, it shifts over to a focused, single-site browser experience. It loads the first webpage in the list, and you can swipe left or right to access additional webpages.\r<br />\n\r<br />\nThe idea is to swipe through during the day to see new content on the pages that you like to refresh. For sites like <em>MacRumors</em>, for example, you'll see an up-to-date version of the front page each time you get to it through your swiping routine. You can swipe left or right through each webpage that you've added without needing to go to Safari and type in the website or change tabs each time you want to get new content.\r<br />\n\r<br />\nThe app works just like any other web browser, so you can tap into stories and use another swipe to get back to where you were.\r<br />\n\r<br />\nAs a little bonus, as you swipe through the app, you'll earn shakes. Shaking the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> will bring up a random, interesting website that may catch your attention and give you something fresh to read. Swipes and shakes are precached, cutting down on load times.\r<br />\n\r<br />\nSwiping on the ‌iPhone‌ is a natural gesture, and browsing websites this way is quick and convenient, plus there is a satisfying haptic mechanic when you shake. Web Roulette is free to use, and can be downloaded from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. [<a href=\"https://apps.apple.com/us/app/id6448401688\">Direct Link</a>]<br />This article, \"<a href=\"https://www.macrumors.com/2023/05/30/web-roulette-ios-app/\">Web Roulette for iPhone Lets You Swipe Through Your Favorite Websites</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/web-roulette-for-iphone-lets-you-swipe-through-your-favorite-websites.2390927/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0531645c37efbeecd3636994468dc52042a805cccbac80c5e8a47d6f70a7fcc9","category":"Apple"}