{"title":"Hospital and Patient Characteristics Associated with Neonatal Blood Stream Infection in Inpatient Hospital Care; Healthcare Cost and Utilization Project (HCUP) Kids&rsquo; Inpatient Databases (KID) 2019","link":"https://www.preprints.org/manuscript/202404.0534/v1","date":1712577435000,"content":"This study aims to explore the associations between pediatric adverse events (PAEs) and hospital and patient characteristics within the inpatient hospital setting, focusing solely on the framework of pediatric quality indicators (PDIs) from the Agency for Healthcare Research and Quality (AHRQ). Specifically, the study focuses on NQI 03 Neonatal Blood Stream Infection (NBSI). The analysis utilizes discharge data from the Healthcare Cost and Utilization Project (HCUP) Kids’ Inpatient Databases (KID) for the year 2019. Through this analysis, the study seeks to answer research questions regarding associations between hospital characteristics and patient characteristics with NQI 03. The methodology employs bivariate and multivariate logistic regression models to analyze patient-level encounters of NBSI. The results indicate that smaller, rural, and non-teaching hospitals exhibit significantly lower odds of NQI 03 compared to large hospitals. Various individual factors such as gender, age, race, service lines, payment sources, and major operating room procedures also demonstrate differing levels of significance in relation to NQI 03, warranting further investigation. This study provides contextual expansion on the findings and offers valuable insights into PAEs in the inpatient hospital setting, specifically focusing on NBSI within the PDIs framework. It highlights areas for developing evidence-based interventions and guidelines for clinicians and policymakers. Ultimately, the findings contribute to the growing understanding of factors influencing NBSI and emphasize the importance of targeted strategies for improving pediatric patient safety.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0539b9de1278be1b117b61c045fa44434a2ef4d6ae5c5451ffc28d23dea36dfe","category":"Interdisciplinary"}