{"title":"Association between smoking and lack of HIV virological suppression in a cross-sectional study of persons with HIV on antiretroviral therapy in Uganda","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300508","date":1710943200000,"content":"<p>by Adah Tumwegamire, Robin Fatch, Nneka I. Emenyonu, Sara Lodi, Winnie R. Muyindike, Allen Kekibiina, Julian Adong, Christine Ngabirano, Brian Beesiga, Kara Marson, Nakisa Golabi, Moses Kamya, Gabriel Chamie, Judith A. Hahn</p>\r\nBackground <p>Smoking and alcohol use frequently co-occur and are the leading causes of preventable death in sub-Saharan Africa (SSA) and are common among people living with HIV (PLWH). While alcohol use has been shown to be associated with reduced adherence to antiretroviral treatment (ART), which may affect HIV viral suppression, the independent effect of smoking on HIV outcomes in SSA is unknown. We aimed to 1) describe the prevalence of current smoking and correlates of smoking; 2) assess the association of smoking with viral suppression, adjusting for level of alcohol use; 3) explore the relationship between smoking and CD4 cell count &lt;350 cells/mm<sup>3</sup>, among participants who are virally suppressed.</p> Methods <p>We analyzed data from the Drinkers Intervention to Prevent Tuberculosis (DIPT) and the Alcohol Drinkers’ Exposure to Preventive Therapy for TB (ADEPTT) studies conducted in Southwest Uganda. The studies enrolled PLWH who were on ART for at least 6 months and co-infected with latent tuberculosis and dominated with participants who had unhealthy alcohol use. Current smoking (prior 3 months) was assessed by self-report. Alcohol use was assessed using the Alcohol Use Disorders Identification Test-Consumption (AUDIT-C, modified for prior 3 months) and phosphatidylethanol (PEth), an alcohol biomarker. We used logistic regression to estimate the cross-sectional association between smoking and lack of virological suppression (≥40 copies/ml), adjusting for level of alcohol use and other covariates, and to examine the association between smoking and CD4 cell counts among PLWH with viral suppression.</p> Results <p>Of the 955 participants enrolled from 2017 to 2021 who had viral load (VL) results, 63% were men, median age was 40 years (interquartile range [IQR] 32–47), 63% engaged in high/very high-risk alcohol use (AUDIT-C≥6 or PEth≥200 ng/mL), and 22% reported smoking in the prior 3 months. Among 865 participants (91%) with viral suppression and available CD4 count, 11% had a CD4 cell count &lt;350 cells/mm<sup>3</sup>. In unadjusted and adjusted analyses, there was no evidence of an association between smoking and lack of virological suppression nor between smoking and CD4 count among those with viral suppression.</p> Conclusions <p>The prevalence of smoking was high among a study sample of PLWH in HIV care with latent TB in Southwest Uganda in which the majority of persons engaged in alcohol use. Although there was no evidence of an association between smoking and lack of virological suppression, the co-occurrence of smoking among PLWH who use alcohol underscores the need for targeted and integrated approaches to reduce their co-existence and improve health.</p>","author":"Adah Tumwegamire","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0540e43f3263079f066e4a2f87cc98291c57e762e3fa0a733fec82fda6d8379f","category":"Interdisciplinary"}