{"title":"Evaluating wildlife tourism exposure to Florida manatees using citizen science, public interviews, and trail cameras","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4140?af=R","date":1711970382000,"content":"<h2>Abstract</h2>\n<p>\nWildlife tourism often focuses on marine mammals, and the growing frequency of human interactions raises concerns about the sustainability of these activities and their impact on aquatic species. Tourists have the opportunity to view the Florida manatee (<i>Trichechus manatus latirostris</i>) in various locations; however, the level of tourist activity in some areas and their effects on manatees are unknown. Preliminary studies are essential to assess whether these areas warrant additional regulatory and mitigation strategies based on tourism impact.\nHere, we investigated tourism activity on a site often visited by small aggregations of Florida manatees. From 2022 to 2023, interviews, citizen science, and trail cameras were used to assess watercraft activity, tourist knowledge, and the educational practices offered by watercraft rental businesses at Portosueno Park, Florida, USA.\nBoth trail cameras and citizen science revealed that boats were the most common visitors to the park, averaging 23 watercraft visits per week. Interviews indicated that the majority of the public did not observe the posted signs addressing manatee harassment and were unaware of the prohibition against chasing manatees, the most frequently observed form of harassment at the park.\nThe methods used complemented each other to elucidate tourism activity and has the potential to inform outreach efforts and mitigation strategies.\n</p>","author":"Beth Brady, \nGabrielle Carroll, \nGiulia Costa, \nEric Angel Ramos","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"054177d8b7c7b1ef0002335353b43e512c7819986c2fe1fcbbf29517cecd3fab","category":"Environment"}