{"title":"Acetylcholine Activates a Regenerative Vasodilator Mechanism That Is Sensitive to Nitric Oxide Production","link":"https://www.preprints.org/manuscript/202409.0187/v1","date":1725341736000,"content":"Conduction of vasodilator signals plays an important role in the coordination of blood flow distribution. It is thought that endothelium-dependent vasodilation’s are conducted by electrotonic spread through gap junctions of the endothelial cell hyperpolarization generated at the stimulation site. However, nitric oxide (NO) was found to reduce the propagation of vasodilator responses, suggesting the participation of this signaling molecule in the mechanism of conduction. Mouse cremasteric arterioles were stimulated through micro-application of ACh or the NO donor, S-nitroso-N-acetylpenicillamine (SNAP) and the responses were evaluated at the stimulation site (local) and at sites located 500, 1000 and 2000 µm upstream from the vessel segment stimulated with ACh. The response to ACh spread along the entire vessel showing a slight decay and, in contrast, the dilation evoked by SNAP was restricted to the stimulation site, independently of the magnitude of the response. Blockade of NO production with 100 µM NG-nitro-L-arginine methyl ester (L-NAME) or 100 µM NG-nitro-L-arginine (L-NA) reduced the resting diameter by 10-12% (n=4), but the combination of two NO blockers enhanced the basal vasoconstrictor tone by ~38% (n=5) and inhibited the local (~45%) and conducted (~20-35%) responses to ACh. Interestingly, the conduction of ACh-induced vasodilation increased along the vessel length in the presence of L-NAME and L-NA. In addition, endothelial cell hyperpolarization blockade exclusively at the stimulation site through microsuperfusion of tetraethylammonium inhibited the local vasodilation, but not the conduction of the response. These results indicate that ACh activates a NO-sensitive regenerative vasodilator mechanism that is coupled to the activation of NO production and endothelium-dependent hyperpolarization along the vessel length.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"054272f4260afebabaf62897fd0ee806435905338430b13de3e1cc269464818a","category":"Interdisciplinary"}