{"title":"How to use Wahoo’s indoor cycling ecosystem to fast-track your training this winter","link":"https://www.bikeradar.com/advertising-feature/wahoo-indoor-cycling-ecosystem/","date":1698253227000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wahoo-11-a403c88.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wahoo-11-a403c88.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wahoo-11-a403c88.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wahoo-11-a403c88.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wahoo-11-a403c88.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wahoo-11-a403c88.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wahoo-11-a403c88.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wahoo-11-a403c88.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wahoo-11-a403c88.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/Wahoo-11-a403c88.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />                                            <p>Summer riding season may be over in the Northern Hemisphere, but that doesn’t mean you have to put your fitness on hold until next spring.</p>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">Indoor cycling</a> provides a great way to maintain and even increase your fitness during the months when it’s dark and cold, and no brand offers a more comprehensive range of indoor cycling products than Wahoo Fitness.</p>\n<p>There are hardware options to suit everyone, from the budget-focused Wahoo KICKR SNAP wheel-on smart trainer, to the new, flagship Wahoo KICKR MOVE and KICKR BIKE.</p>\n<p>It’s all supported by <a href=\"https://www.bikeradar.com/advice/buyers-guides/wahoo-systm-guide\">Wahoo SYSTM</a>, one of the most comprehensive <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">indoor training apps</a> available.</p>\n<p>What’s more, Wahoo is now partnering with Zwift to offer value-packed bundles that combine Wahoo’s leading hardware with Zwift’s cutting-edge training software. When you buy a Wahoo smart trainer or indoor bike, you <a href=\"https://uk.wahoofitness.com/devices/indoor-cycling/bike-trainer-bundles/zwift-bundles\">get a one-year Zwift membership for free</a>.</p>\n<p>That combination of hardware and software means Wahoo Fitness offers a full ecosystem to take care of all aspects of indoor training.</p>\n<p>You’re covered, whether you’re dipping your toe into the water for the first time or following in the pedal stroke of Wahoo’s women’s and men’s supported pro teams, including EF Education-Easypost, Lidl-Trek and Lifeplus-Wahoo.</p>\n<p>Let’s take a closer look at Wahoo’s full range of indoor training products and how they work together to help keep you riding – and thriving – through the winter.</p>\n<h2>Combining hardware and software to make you a better rider</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />\n\n</div><div><figcaption><span><i></i> Wahoo Fitness has all bases covered when it comes to indoor training.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>Wahoo’s products span both the hardware needed to take your riding indoors and the software to get the best from your time in the saddle, making it a one-stop shop for all things training.</p>\n<p>If you’re new to indoor cycling, choosing a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a> or <a href=\"https://www.bikeradar.com/advice/buyers-guides/indoor-bikes/\">smart bike</a> that gives you a realistic ride experience will make it more enjoyable. And if it’s more enjoyable, you’re more likely to stick at it through winter.</p>\n<p><span>If you already have a trainer, linking it up to the Wahoo SYSTM indoor training environment will enable you to find workouts and training plans to boost your fitness, work on your strengths and weaknesses, and monitor your performance gains.</span></p>\n<p><span>After all, one of the main </span><a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-cycling-benefits/\"><span>benefits of indoor cycling</span></a><span> is the ability to embark on a structured training programme to achieve your training goals – and regardless of your ability or how much time you have, there’s something for everyone.</span></p>\n<p><span>Wahoo SYSTM even has training plans for specific cycling disciplines, including road riding, mountain biking, gravel, cyclocross, triathlon and e-sports.</span></p>\n<p>On top of that, Wahoo SYSTM offers off-bike workouts and activities, documentaries and other inspiring content to keep you motivated and add variety to your off-season riding.</p>\n<p>Zwift, meanwhile, now offers 10 online worlds for virtual riding, whether you’re following a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-workouts-training-plans-zwift/\">training plan</a>, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-group-rides/\">joining a group ride</a> or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-racing/\">entering your first virtual race</a>.</p>\n<h2>How to choose a Wahoo smart trainer</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />\n\n</div><div><figcaption><span><i></i> Wahoo has a range of smart trainers for all budgets.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>Wahoo first made its mark with its <a href=\"https://www.bikeradar.com/news/kinomap-and-wahoo-fitness-kickr-trainer-cycle-show-2012/\">KICKR direct-drive smart trainer in 2012</a> and it continues to innovate, adding new features and, in September 2023, <a href=\"https://www.bikeradar.com/news/wahoo-kickr-move-kickr-bike-shift/\">introducing the KICKR MOVE</a> to expand the smart trainer line-up to five models.</p>\n<p>In fact, Wahoo’s latest range includes smart trainers for all budgets.</p>\n<p>The ‘smart’ part of the name refers to a trainer’s capability to vary the resistance you pedal against in response to commands from a training environment such as Wahoo SYSTM, which we’ll explain more about below, or an indoor cycling game. The most popular of these is <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a>.</p>\n<p><span>Wahoo offers two wheel-on trainers alongside its three direct-drive models. The ‘direct-drive’ part means your bike is connected to the trainer via its </span><a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-axle-standards/\"><span>rear dropouts/thru-axle</span></a><span> and chain, so you remove your rear wheel, rather than the tyre forming the connection.</span></p>\n<p>Here’s a quick overview of the key features of each Wahoo smart trainer, to help you find the right model for your riding needs and budget.</p>\n<h3>Wahoo KICKR MOVE</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />\n\n</div><div><figcaption><span><i></i> The KICKR MOVE is Wahoo’s new flagship smart trainer.</span></figcaption><span> <i>Wahoo Fitness</i></span></div>\n<p>There are three aspects of a realistic ride experience: speed of response to input, the weight and inertia of the trainer’s flywheel and the degree of movement possible.</p>\n<p>As Wahoo’s latest flagship smart trainer, the KICKR MOVE focuses on all three. It enables forward and back movement of your bike by up to 20cm as you adjust your effort level, as well as up to five degrees of side-to-side movement via its Axis feet.</p>\n<p>The idea is your bike can move much more naturally as you ride, rather than being held in a static position, and is unique to the KICKR MOVE.</p>\n<p>The KICKR MOVE’s flywheel is among the heaviest available, which means it mimics the inertia you feel when riding outdoors. It can simulate uphill gradients of up to 20 per cent and downhill of up to 10 per cent, for realism when riding a road in a training app such as Zwift.</p>\n<p>There are a wide range of connectivity options, including a WiFi connection into your network, and a Bluetooth connection to the computer, tablet or phone running your training software.</p>\n<ul>\n<li><strong>Buy if…</strong> <span>You want the very latest smart trainer technology, with Wahoo’s most advanced features to improve comfort and realism</span></li>\n<li><strong>Price:</strong> £1,399.99 / $1,599.99 / €1,599.99</li>\n</ul>\n<h3>Wahoo KICKR</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />\n\n</div><div><figcaption><span><i></i> The KICKR was Wahoo’s original smart trainer and is now on its sixth iteration.</span></figcaption><span> <i>Wahoo Fitness</i></span></div>\n<p>The original KICKR smart trainer was launched more than a decade ago – and it helped revolutionise the indoor training experience.</p>\n<p>The <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wahoo-kickr-v6-review/\">Wahoo KICKR </a>is now on its sixth iteration, attesting to the continuing evolution of Wahoo’s ground-breaking direct-drive trainer.</p>\n<p>The large flywheel and responsive resistance unit of the original continue, for a realistic ride feel, but Wahoo has added WiFi support to the V6 model.</p>\n<p>As with the KICKR MOVE, the Axis feet on the KICKR enable you to rock the bike from side-to-side for a more natural feel.</p>\n<p>Plus, the latest <a href=\"https://www.bikeradar.com/advice/fitness-and-training/erg-mode/\">ERG</a> Easyramp feature means if you’re interrupted during a session, the KICKR restarts you at a lower resistance, so getting going again is much easier.</p>\n<p>Wahoo has also added compatibility with thru-axles and disc brakes, making its trainers the natural choice for riders of the latest road bikes.</p>\n<ul>\n<li><strong>Buy if…</strong> You want a top-end indoor training experience, without the flagship price tag of the Wahoo KICKR</li>\n<li><strong>Price:</strong> £1,299.99 / $1,299.99 / €1,299.99</li>\n</ul>\n<h3>Wahoo KICKR CORE</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />\n\n</div><div><figcaption><span><i></i> The KICKR CORE offers direct-drive performance on a budget.</span></figcaption><span> <i>Wahoo Fitness</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/wahoo-kickr-core-review/\">Wahoo KICKR CORE</a> is Wahoo’s most affordable direct-drive trainer – and, as a result, is likely to appeal to many riders.</p>\n<p>It provides much of the functionality of the Wahoo KICKR, and has recently seen a permanent price drop.</p>\n<p>There’s a slightly lower maximum resistance and gradient than the KICKR, and the flywheel is lighter, but those aren’t changes the average rider is likely to find significant.</p>\n<p>As with the KICKR, you can link the KICKR CORE into Wahoo SYSTM for a systematic approach to training or hook up to an indoor cycling app to race or ride in a simulated world with app-controlled resistance.</p>\n<ul>\n<li><strong>Buy if…</strong> You want a feature-packed direct-drive smart trainer that won’t break the bank</li>\n<li><strong>Price:</strong> £549.99 / $599.99 / €599.99</li>\n</ul>\n<h3>Wahoo KICKR ROLLR</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />\n\n</div><div><figcaption><span><i></i> The KICKR ROLLR is Wahoo’s take on traditional rollers.</span></figcaption><span> <i>Wahoo Fitness</i></span></div>\n<p>People either love or hate <a href=\"http://v\">riding conventional rollers</a>.</p>\n<p>On the one hand, the free movement of the bike feels more natural, and enables you to practise your balance and high-<a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">cadence</a> pedalling; on the other, it needs concentration and takes some getting used to, in order not to fall off – particularly for beginners.</p>\n<p>The Wahoo KICKR ROLLR prevents the latter with a system that grips your front tyre, so you’re locked in place. The rear wheel rolls on two rollers that are narrower than conventional rollers, making the KICKR ROLLR more compact.</p>\n<p>Unlike Wahoo’s other trainers, you’ll need to supply your own <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meter</a> to get the best from the KICKR ROLLR. However, you can still connect the ROLLR to Zwift to rack up valuable time and miles in the saddle.</p>\n<p>Wahoo can help you there too, with its <a href=\"https://www.bikeradar.com/reviews/training/power-meters/wahoo-powrlink-zero-power-meter-pedals-review/\">Powrlink Zero power meter pedals</a>, compatible with the Speedplay pedal system.</p>\n<ul>\n<li><strong>Buy if…</strong> You want the convenience of rollers, without the risk of falling off</li>\n<li><strong>Price:</strong> £699.99 / $799.99 / €799.99</li>\n</ul>\n<h3>Wahoo KICKR SNAP</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />\n\n</div><div><figcaption><span><i></i> The wheel-on KICKR SNAP opens the Wahoo smart trainer range.</span></figcaption><span> <i>Wahoo Fitness</i></span></div>\n<p>Finally, <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/wahoo-kickr-snap-review/\">Wahoo offers the KICKR SNAP</a> wheel-on smart trainer, the lowest-priced entry point to the range.</p>\n<p>The wheel-on design makes the KICKR SNAP compact and relatively lightweight, so it will fit easily into a smaller space.</p>\n<p>It still offers an impressive 1,500 watts of resistance, and ANT+ or Bluetooth connectivity, as well as being able to simulate 12 per cent climbs and 10 per cent descents, all with +/- 3 per cent power accuracy.</p>\n<ul>\n<li><strong>Buy if…</strong> You want a budget-focused smart trainer that still offers all the features most riders need</li>\n<li><strong>Price:</strong> £299.99 / $499.99 / €499.99</li>\n</ul>\n<h2>Wahoo’s smart bikes</h2>\n<p>If you have the space, Wahoo’s smart bikes have a few advantages over a trainer: there’s no setup required each time you ride, there’s the adjustability to duplicate your outdoor bike’s ride position and gearing, and you can save your ‘real’ bike for outdoor riding.</p>\n<p>Wahoo now has two smart bike options, the original KICKR BIKE, which will tilt to simulate uphill and downhill gradients, and the newer, more affordable KICKR BIKE SHIFT, which omits the tilting mechanism.</p>\n<h3>Wahoo KICKR BIKE</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />\n\n</div><div><figcaption><span><i></i> The Wahoo KICKR BIKE offers +/- 1 per cent power measurement and can replicate resistance up to 2,500 watts.</span></figcaption><span> <i>Wahoo Fitness</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/wahoo-kickr-bike-smart-bike-review/\">Wahoo KICKR BIKE</a> shares much of its tech with the KICKR trainer, including its high-inertia flywheel and responsive, accurate resistance.</p>\n<p>The KICKR BIKE offers in-built power measurement, accurate to +/- 1 per cent, and replicates a maximum resistance of 2,500 watts.</p>\n<p>It enables you to mimic your outdoor bike’s shifting pattern, whether that’s Shimano, SRAM or Campagnolo, and your gear ratios, for a realistic ride experience.</p>\n<p>The KICKR BIKE’s tilting mechanism simulates real-world climbs and descents when you’re riding a course on a training app, engaging the muscles you’d use in a climb outdoors, for even greater realism.</p>\n<ul>\n<li><strong>Buy if…</strong> You want a best-in-class indoor training bike with a realistic experience</li>\n<li><strong>Price:</strong> £3,499.99 / $3,999.99 / €3,999.99</li>\n</ul>\n<h3>Wahoo KICKR BIKE SHIFT</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo_KICKR BIKE SHIFT_WFBIKE2_ Final Concept - Keyshot_20210802_3.794 (1)\" />\n\n</div><div><figcaption><span><i></i> Wahoo has also introduced the KICKR BIKE SHIFT as a more affordable indoor bike.</span></figcaption><span> <i>Wahoo Fitness</i></span></div>\n<p>The new Wahoo KICKR BIKE SHIFT provides a more affordable alternative to the KICKR BIKE.</p>\n<p>Unlike the KICKR BIKE, there’s no tilting mechanism, and the maximum resistance available is a little lower at 2,200 watts. Needless to say, that’s more than enough for the vast majority of riders, including most pros.</p>\n<p>Features such as configurable shifting and quick adjustability are carried over from the KICKR BIKE. A new drive system is designed to provide fast resistance changes.</p>\n<ul>\n<li><strong>Buy if…</strong> You want a ready-to-ride indoor training bike</li>\n<li><strong>Price:</strong> £2,699.99 / $2,999.99 / €2,999.99</li>\n</ul>\n<h2>Accessories to help you go the distance</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />\n\n</div><div><figcaption><span><i></i> Wahoo offers a full range of dedicated accessories, including the KICKR HEADWIND.</span></figcaption><span> <i>Wahoo Fitness</i></span></div>\n<p>As well as its comprehensive range of indoor training hardware, Wahoo sells the <a href=\"https://www.bikeradar.com/advice/buyers-guides/turbo-trainer-accessories/\">accessories you need to enhance the experience</a>.</p>\n<p>The <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wahoo-kickr-climb-first-ride-review/\">Wahoo KICKR CLIMB</a> adds even more realism to your indoor training, raising and lowering the front of your bike in response to changes in gradient. It’s compatible with the majority of KICKR trainers.</p>\n<p>Riding indoors can be hot work, but the KICKR HEADWIND fan provides a variable level of airflow at up to 48km/h. It uses Bluetooth to connect to your trainer and vary its output with your speed or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">heart rate</a>.</p>\n<p>Wahoo also sells <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-choose-a-heart-rate-monitor/\">heart rate monitors</a>, and speed and cadence sensors, as well as the KICKR DESK for your computer and the KICKR MAT to keep your floor sweat-free.</p>\n<h2>What about Wahoo SYSTM?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Kickr Move\" title=\"Wahoo_KICKR MOVE_WFBKTR123_PRODUCT_DETAILS_02541-01\" />\n\n</div><div><figcaption><span><i></i> Choose Wahoo SYSTM for data-led structured training.</span></figcaption><span> <i>Wahoo</i></span></div>\n<p>Wahoo SYSTM is the company’s subscription-based service, which gives you access to the whole suite of training software in Wahoo SYSTM. There’s a wide range of indoor and outdoor workouts and training plans offered, developed by top cycling coaches.</p>\n<p>Wahoo’s <a href=\"https://www.bikeradar.com/news/ftp-is-dead-the-sufferfest-claims-and-launches-4dp-training/\">4DP fitness profile</a> goes beyond the cyclist’s favourite, the <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">FTP test</a>, to look at other aspects of your riding, such as all-out sprinting, to help tailor your training to meet your riding goals.</p>\n<p>Wahoo SYSTM also offers pro-ride simulations, documentary content on famous locations and insights into the pro lifestyle. Off-bike content includes mental training, yoga, and flexibility and strength training.</p>\n<p>Wahoo SYSTM works alongside Wahoo’s comprehensive range of trainer hardware and accessories to provide you with a full set of products to support your indoor cycling this winter.</p>\n<h2>Where does Zwift fit in?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Wahoo Fitness\" title=\"Wahoo Fitness\" />\n\n</div><div><figcaption><span><i></i> Wahoo is now offering its smart trainers with a one-year Zwift subscription.</span></figcaption><span> <i>Wahoo Fitness</i></span></div>\n<p>As well as offering SYSTM for data-led structured training that delivers results, Wahoo is now also partnering with Zwift.</p>\n<p>Zwift offers 10 worlds for virtual riding, from Watopia to a hairpin-by-hairpin replica of Alpe d’Huez, as well as two event-only worlds (Bologna and Crit City).</p>\n<p>If you buy a KICKR smart trainer, Wahoo will bundle in a one-year Zwift membership, meaning you’ve got everything you need to make the most out of your virtual time in the saddle.</p>\n<p>If you’re already a Zwift member, then don’t worry, you’re still eligible. When you redeem your one-year code, it will take effect at the end of your current Zwift billing cycle.</p>\n<p>Visit <a href=\"https://uk.wahoofitness.com/devices/indoor-cycling/bike-trainer-bundles/zwift-bundles\">wahoofitness.com</a> for more.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"05427d5f4c8b58370b92ffcb9a7c26e8856a079a62e657169ab28fd8c6acfe34","category":"Cycling"}