{"title":"Wanting to be part of change but feeling overworked and disempowered: Researchers’ perceptions of climate action in UK universities","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000322","date":1704722400000,"content":"<p>by Briony Latter, Christina Demski, Stuart Capstick</p>\r\n\r\nInterest in the relationship between the activities of universities and action on climate change is growing, but until recently there has been little focus on the critical role of researchers, particularly with regards to how research practices and culture can enable or inhibit change. This study addresses this gap, exploring researchers’ perceptions of universities’ measures to tackle their own emissions, their own engagement on issues surrounding the climate crisis, and challenges and opportunities for researchers to contribute to them. We present findings from a representative survey of 1,853 researchers from 127 UK universities across disciplines and career stages, including comparing responses across these professional differences, and analysis based on over 5,000 open text responses provided by the survey participants. The results show that while most have some knowledge of actions being taken by their universities and feel that universities’ public declarations of a climate emergency are making a difference, almost half think not enough is being done. They feel that responsibility for university climate action sits across government, universities and research councils, but almost all researchers are also personally worried about climate change and want to do more themselves to address it. For the most part, they also strongly support climate advocacy by those engaged in research. Yet high workload, uncertainty about what actions to take, perceived lack of agency or power, inflexible university processes and pressure to travel are just some of the many barriers researchers face in taking action. The study highlights how these barriers can be overcome, and the steps universities and researchers can take to better incorporate climate action into their research culture and practices.","author":"Briony Latter","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"054becc416476799b5c3eff452d6240762dd6536df0535122288c8ab438a9125","category":"Environment"}