{"title":"A Triangulation of Information from Healthcare Workers and Patients about the Concurrent Use of Traditional Medicine and Conventional Prescribed Medicines for Schistosomiasis in iLembe District, KwaZulu-Natal, South Africa","link":"https://www.preprints.org/manuscript/202403.1270/v1","date":1711016515000,"content":"Background Praziquantel is the commonly used conventional treatment recommended for schistosomiasis in the mainstream healthcare system. Although Praziquantel may be free in healthcare facilities, many individuals may resort to the use of traditional medicine. This study aimed to assess perceptions of participants on the availability of Praziquantel and to ascertain whether individuals infected with schistosomiasis used concurrently African traditional medicines with this treatment. Methods A cross–sectional descriptive study, using face-to-face interviews, was conducted from January to April 2023 among healthcare workers (HCWs) and patients. A review of medical chart records of patients was further carried out to triangulate the information from interviews. Ddescriptive statistics including frequency and percentage were used; categorical data were represented as tables. Chi-squared tests were performed for the association between continuous variables. A p value ≤ 0.05 was estimated as statistically significant. Results Most of HCWs (114/124; 91.9%) reported that Praziquantel was available in healthcare facilities. Majority of HCWs (76/124; 61.3%) did not know whether patients seen by them used concurrently traditional medicine and Praziquantel for schistosomiasis. There was no significant relationship between the availability of Praziquantel and the concurrent use of TM by patients for schistosomiasis (X2 = 3.042, p = 0.551). Patients seen by THPs (8/20, 40%) did not use Praziquantel for schistosomiasis. Those patients (8/15, 53.3%) who crossed from TM to the mainstream healthcare system did not disclose their use of TM to HCWs. Their main reason was that concurrent use of TM and Praziquantel could destroy organs or make Praziquantel not to work properly. None of the medical chart records analysed documented the concurrent use of TM and Praziquantel. Conclusion Most of HCWs were not aware of the concurrent use of TM and Praziquantel by patients for the treatment of schistosomiasis. Patients seen by THPs relied solely on TM for schistosomiasis. Although patients indicated crossing from TM to the mainstream healthcare system, there was no evidence of documented use of TM in medical chart records of patients. Further studies are needed to contribute to the knowledge of medicinal plants used by THPs for schistosomiasis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0552fbe4fcc6fcbf05066e2eb925f2975a9fc55927c0830f164104217f309496","category":"Interdisciplinary"}