{"title":"Chirality Engineering-Regulated Liquid-Liquid Phase Separation of Stress Granules and Its Role in Chemo-Sensitization and Side Effect Mitigation","link":"https://www.preprints.org/manuscript/202404.1867/v1","date":1714379642000,"content":"In recent years, the chiral biological effects of nanomedicines have become a subject of widespread interest. The research focus has been on understanding the influence of material chirality on cellular transcription and metabolism. Stress granules are membraneless organelles formed through liquid-liquid phase separation of G3BP1 proteins and related compartments. They have been extensively studied and proven to be closely associated with cellular damage repair and metabolism. However, the role and mechanism of chiral nanomaterials in modulating stress granules remain unknown. The aim of this study was to investigate the expression and structural characteristics of stress granules under the individual influence of chiral nanomaterials and in combination with chemotherapy. To achieve this, we constructed a library of chiral ligand-modified materials and employed immunofluorescence, live-cell imaging, and fluorescence recovery after photobleaching assays. We also used proximity labeling techniques combined with proteomics analysis to identify the protein corona adsorbed on the surface of the nanomaterials and explore their relationship with nanomaterial chirality. Our results demonstrate that the assembly of stress granules is chiral-dependent and can be regulated by chiral nanomaterials. Furthermore, we achieved enhanced chemotherapy sensitivity in cancer cells and protected normal cells by exploiting the chiral-dependent modulation of material assembly in stress granules. This study provides important insights into the regulation of membraneless cellular structures based on chiral biological effects.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"055c26616be7bb283131d7c9866e2fadfdb9adb9183a8c3dd2f39c98d1bf90e5","category":"Interdisciplinary"}