{"title":"How long does Apple support iPads?","link":"https://www.macworld.com/article/2035481/how-long-does-apple-support-ipads.html","date":1695122166000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you have an iPad already or are thinking of picking up an older one, maybe a <a href=\"https://www.macworld.com/article/670633/where-buy-refurbished-ipad.html\">refurbished model</a> that would save you some money, it’s a good idea to find out how long it will still be able to use apps and services. Apple is usually excellent in this area, often keeping older generations of its products on the latest versions of iPadOS or at least blessed with security updates to keep them safe. But there comes a time when the software on an iPad can no longer be updated to a secure version of iPadOS, and when that happens you may find that apps and websites will no longer work and your data could be at risk. </p>\n\n\n\n<p>Here’s a quick guide to how long you should expect an iPad to remain usable. </p>\n\n\n\n<h2>Which versions of iPadOS does Apple support?</h2>\n\n\n\n<p>The crucial thing is whether Apple will update the operating system software that runs on your iPad if it discovers a security flaw. While Apple only issues updates with new features for the current version of the iPadOS, it does issue security updates to older versions of iPadOS, in order to keep older iPads secure. </p>\n\n\n\n<p>Security updates are released relatively frequently and simply update the code in the system to close any potential areas where hackers or malware could gain access. These appear on your device as ‘point releases’, such as iPadOS 16.1, .1.1, 2.1, etc., and they make small adjustments to iPadOS and fix any security issues. </p>\n\n\n\n<p>While full iPadOS updates often require system resources that can be too much for older devices, security updates work under the hood and can usually keep an older model going for years after the point where it can receive a new version of iPadOS. </p>\n\n\n\n<p>This means that the real defining element of how long an iPad can last is security updates. Once those stop, it’s not advisable to continue using the device, as it could be vulnerable to attacks. </p>\n\n\n\n<p>Currently iPads that run the following versions of iPadOS are supported with security updates: </p>\n\n\n\n<ul>\n<li><a href=\"https://www.macworld.com/article/1794980/ipados-17-release-date-features-compatibility-beta.html\">iPadOS 17</a> (launched September 18, 2023)</li>\n\n\n\n<li>iPadOS 16 (last updated in September 2023)</li>\n\n\n\n<li>iPadOS 15 (last updated in September 2023)</li>\n</ul>\n\n\n\n<p>It’s interesting to note that iOS 12, which runs on some iPads, was last updated in January 2023, but we don’t expect those devices to have coverage in the future.  </p>\n\n\n\n<p>Despite this iOS 12 coverage, it is best to assume that anything prior to iPadOS 15 is no longer supported with security updates. This means that if your iPad can’t run iPadOS 15 you may be vulnerable to security flaws. </p>\n\n\n\n<p>It is also possible that Apple will cease supporting iPadOS 15.</p>\n\n\n\n<h2>Which version of iPadOS can I run?</h2>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Bildschirmfoto-2023-06-07-um-16.33.09.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPadOS 17\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Bildschirmfoto-2023-06-07-um-16.33.09.jpg?quality=50&amp;strip=all 2766w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Bildschirmfoto-2023-06-07-um-16.33.09.jpg?resize=300%2C162&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Bildschirmfoto-2023-06-07-um-16.33.09.jpg?resize=768%2C414&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Bildschirmfoto-2023-06-07-um-16.33.09.jpg?resize=1200%2C646&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Bildschirmfoto-2023-06-07-um-16.33.09.jpg?resize=1536%2C827&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Bildschirmfoto-2023-06-07-um-16.33.09.jpg?resize=2048%2C1103&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"646\" /><figcaption><p>iPadOS 17<span> is coming later in 2023 </span></p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>The key is to know which version of iPadOS your iPad can run, that way you can identify whether Apple is still committed to updating it with security-related fixes. </p>\n\n\n\n<p><strong>iOS 12 </strong></p>\n\n\n\n<p>This old version of iOS ran on various iPads as well as the iPhone, including: </p>\n\n\n\n<ul>\n<li>iPad Air (1st generation) – from 2013</li>\n\n\n\n<li>iPad mini (2nd and 3rd generation) – from 2013</li>\n</ul>\n\n\n\n<p>Apple issued a security update in January 2023. We do not expect any further updates for this version. </p>\n\n\n\n<p><strong>iPadOS 15 </strong></p>\n\n\n\n<p>iPadOS 15 arrived in 2021 and was last updated in September 2023. It runs on the following models that were sold prior to the launch of iPadOS 16 (you can’t run an older version of iPadOS than the one the iPad shipped with):</p>\n\n\n\n<ul>\n<li>iPad Pro (all models) – from 2015</li>\n\n\n\n<li>iPad Air (2nd generation and later) – from 2014</li>\n\n\n\n<li>iPad (5th generation and later) – from 2017</li>\n\n\n\n<li>iPad mini (4th generation and later) – from 2015</li>\n</ul>\n\n\n\n<p><strong>iPadOS 16 </strong></p>\n\n\n\n<p>The 2022 version of iPadOS runs on the following iPads: </p>\n\n\n\n<ul>\n<li>iPad Pro (all models) – from 2015</li>\n\n\n\n<li>iPad Air (3rd generation and later) – from 2019</li>\n\n\n\n<li>iPad (5th generation and later) – from 2017</li>\n\n\n\n<li>iPad mini (5th generation and later) – from 2019</li>\n</ul>\n\n\n\n<p>iPadOS 16 dropped support for iPad Air 2 and iPad mini 4 from those supported by iPadOS 15. </p>\n\n\n\n<p><strong>iPadOS 17</strong></p>\n\n\n\n<p>iPadOS 17 is the current version of the iPad operating system. It runs on the following iPads:</p>\n\n\n\n<ul>\n<li>iPad Pro 12.9 (5th, 4th, 3rd and 2nd gen) – from 2017</li>\n\n\n\n<li>iPad Pro 11 (3rd, 2nd and 1st gen) – from 2018</li>\n\n\n\n<li>iPad Pro 10.5 – from 2017</li>\n\n\n\n<li>iPad (10th, 9th, 8th, 7th and 6th gen) – from 2018</li>\n\n\n\n<li>iPad mini (5th and 6th gen) – from 2019</li>\n\n\n\n<li>iPad Air (5th, 4th and 3rd gen) – from 2019</li>\n</ul>\n\n\n\n<p>iPadOS 17 dropped support for 2016 iPad Pro 9.7-inch (A9X chip), 2015 iPad Pro 12.9-inch (1st generation) (A9X chip) and 2017 iPad (5th generation) which runs on an even slower A9 processor.</p>\n\n\n\n<h2>Which iPads are not supported with updates?</h2>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3693772/nuevos_ipads_2019_ipad-air_ipad-mini_.jpg?quality=50&amp;strip=all\" alt=\"iPad range \" loading=\"lazy\" /></figure><p>Apple</p></div>\n\n\n\n<p>While some iPads can run iOS 12, which did get a security update in January 2023, we would avoid any iPads that aren’t running a version of iPadOS that is supported by Apple. </p>\n\n\n\n<p>Because these iPads don’t run iPadOS 15 we consider that they are no longer supported:</p>\n\n\n\n<ul>\n<li>iPad Air (1st generation) – 2013</li>\n\n\n\n<li>iPad (4th generation and earlier) – 2012 and older</li>\n\n\n\n<li>iPad mini (3rd generation and earlier) – 2014 and older</li>\n</ul>\n\n\n\n<p>If Apple drops support for iPadOS 15, then we can add the following to the list of unsupported iPads: </p>\n\n\n\n<ul>\n<li>iPad Air 2 – 2014</li>\n\n\n\n<li>iPad mini 4 – 2015</li>\n</ul>\n\n\n\n<p>Our advice is not to buy any iPad that is listed above.</p>\n\n\n\n<h2>Which iPads are supported with updates?</h2>\n\n\n\n<p>While Apple continues to support iPadOS 15 with security updates, the following iPads will be on the supported list: </p>\n\n\n\n<ul>\n<li>iPad Pro (all models) – from 2015</li>\n\n\n\n<li>iPad Air (2nd generation and later) – from 2014</li>\n\n\n\n<li>iPad (5th generation and later) – from 2017</li>\n\n\n\n<li>iPad mini (4th generation and later) – from 2015</li>\n</ul>\n\n\n\n<h2>How long does Apple support iPads with security updates?</h2>\n\n\n\n<p>As an example of a model that’s still supported by Apple, the iPad Air 2 made its debut in 2014, but received the iPadOS 15.7.9 update in September 2023, meaning that it’s still going almost nine years after its initial release. Another senior model that received that update was the iPad mini (4th Generation) which came out in 2015. </p>\n\n\n\n<p>And because Apple updated iOS 12 in January 2023 we could include the original iPad Air (2013), iPad mini 2 (2013) and iPad mini 3 (2014) in our list of supported devices in 2023, although we wouldn’t recommend using them. </p>\n\n\n\n<p>This means that in January 2023 Apple was supporting ten-year-old iPads with security updates, while in September 2023 the company issued a security update that was compatible with the then nine-year-old iPad Air 2. </p>\n\n\n\n<p>However, if you look at the list above, most of the iPads that are being supported by iPadOS 17 were launched in 2017 and 2019. It’s really only the iPad Pro that gets more lengthy support. </p>\n\n\n\n<h2>How long does Apple support iPads?</h2>\n\n\n\n<p>There is another factor in the question of whether an iPad is supported or not. While security updates are important because they protect the user from those with malicious intent, if your iPad goes wrong you will want to know whether it will be possible to fix it. </p>\n\n\n\n<p>Between five and seven years after Apple stops selling products it moves them into the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT201624&amp;xcust=1-1-2035481-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Vintage list</a>. Then around seven years after Apple stops selling products they are moved into the Obsolete list. </p>\n\n\n\n<p>Once considered Vintage by Apple your chance of being able to get replacement parts if required is already unlikely, but when a product is Obsolete you will not be able to get replacement parts. </p>\n\n\n\n<p>Therefore if it has been five years since Apple stopped selling an iPad you are unlikely to be able to get replacement parts if something goes wrong. </p>\n\n\n\n<p>The products considered vintage and obsolete are listed below. </p>\n\n\n\n<h3>Vintage iPads </h3>\n\n\n\n<ul>\n<li>iPad Air 2</li>\n\n\n\n<li>iPad mini 2</li>\n\n\n\n<li>Original iPad Pro 9.7-inch  </li>\n\n\n\n<li>Original iPad Pro 12.9-inch </li>\n\n\n\n<li>iPad 5th generation </li>\n</ul>\n\n\n\n<h3>Obsolete iPads</h3>\n\n\n\n<ul>\n<li>Original iPad Air</li>\n\n\n\n<li>Original iPad mini </li>\n\n\n\n<li>iPad mini 3</li>\n\n\n\n<li>Original iPad </li>\n\n\n\n<li>iPad 2nd generation </li>\n\n\n\n<li>iPad 3rd generation</li>\n\n\n\n<li>iPad 4th generation </li>\n</ul>\n\n\n\n<p>So, while Apple does support all iPad Pro models with security updates, the original iPad Pro models are already considered vintage. </p>\n\n\n\n<p>So it’s not surprising that when iPadOS 17 launches the following iPads will fall off the supported list since they are already vintage: </p>\n\n\n\n<ul>\n<li>iPad Pro 12.9-inch (1st gen) – 2015</li>\n\n\n\n<li>iPad Pro 9.7-inch (1st gen) – 2015 </li>\n\n\n\n<li>iPad (5th gen) – 2017</li>\n</ul>\n\n\n\n<h2>How long should an iPad last?</h2>\n\n\n\n<p>On the software side of things, it seems from the current examples laid out above that you can expect software security support up to nine years from when an iPad went on sale, however, we wouldn’t count on that. </p>\n\n\n\n<p>Because Apple doesn’t consider a product vintage until five years after it stopped selling it, you can expect at least six years of support (assuming the product was sold for a year – Apple often sells products for much longer than that). This is possibly the reason why iOS 12 was still being supported by the company up until January 2023. </p>\n\n\n\n<p>Of course, hardware is the other side of the equation and that can be more random as parts deteriorate or fail. Say your battery life falls off a cliff, you’ll need to still be within your one-year warranty period to have it repaired for free. Apple does have a battery replacement service though, usually costing $99/£99 for a replacement and fitting, so this could prolong the hardware side of things for a good while (essentially up until it was moved to the vintage list five years after Apple stopped selling it). </p>\n\n\n\n<p>Apple offers hardware servicing and parts for a range of older iPads, all at a cost of course. On its <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-gb/HT201624&amp;xcust=1-1-2035481-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">site</a>, the company states that, “Owners of iPhone, iPad, iPod, Mac or Apple TV products may obtain service and parts from Apple service providers, including Apple Store locations and Independent Repair Providers, for a minimum of 5 years from when Apple last distributed the product for sale”. This is clarified later in the text, saying that you can get iPads repaired up to seven years after they were last on sale from Apple. So, if you want to know if your iPad qualifies, simply Google when it was discontinued by Apple. </p>\n\n\n\n<p>Naturally, a ten-year old iPad is an impressive feat of durability, but they won’t be as fun or powerful as a new one. So, take a look at our <a href=\"https://www.macworld.com/article/670670/which-ipad-best.html\">iPad buying guide</a> to see what’s currently on offer. After all, you could be using it for a very long time.</p>\n\n\n\n<p>Want to know <a href=\"https://www.macworld.com/article/675021/how-long-does-apple-support-iphones.html\">how long Apple supports iPhones</a> and <a href=\"https://www.macworld.com/article/673939/this-is-how-long-macs-and-macbooks-last.html#:~:text=Apple%20supports%20Macs%20with%20operating,time%20to%20replace%20your%20Mac.\">how long Apple supports Macs</a>, we have that covered too. </p>\n\niOS, iPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"055e3b72e82280612f27324f4955f6aae982eccb56bc5498aa4cba2b9270ed28","category":"Apple"}