{"title":"High endemic freshwater mussel (Bivalvia: Unionida) diversity in western Borneo, with description of three new species","link":"https://academic.oup.com/zoolinnean/article/doi/10.1093/zoolinnean/zlae076/7702675?rss=1","date":1719878400000,"content":"<span><div>Abstract</div>The freshwater mussels (Bivalvia: Unionida) of the biodiversity hotspot Sundaland are experiencing severe anthropogenic threats, whilst their diversity and distribution remain poorly understood. Here, we present the first modern-day data on Unionida diversity and distribution across western Borneo. Mussels were surveyed and collected in the upper Kapuas and Pawan river basins in West Kalimantan, Indonesia, and the Sambas Besar, Sarawak and Batang Sadong river basins in Sarawak, Malaysia. DNA sequencing (<span>COI</span> + 16S + <span>ND1</span> + 18S + 28S) and morphological analyses were conducted to delineate and identify species, and reconstruct phylogenetic relationships and population genetics. Specimens belonged to six native genera and nine species, of which seven are endemic to Borneo and three are new to science, i.e. <span>Ctenodesma mawonae</span> Zieritz <span>et al</span>., sp. nov., Sarawak basin, and <span>Ctenodesma bersinara</span> Zieritz <span>et al</span>., sp. nov., and <span>Rectidens lauris</span> Zieritz <span>et al</span>., sp. nov., both Pawan basin. The monotypic genera <span>Caudiculatus</span> and <span>Discomya</span> were phylogenetically highly divergent from other known Gonideinae taxa, potentially indicating a separate tribe (for <span>Caudiculatus</span>) and subfamily (for <span>Discomya</span>). In addition, we report new records of the non-native <span>Sinanodonta pacifica</span> Heude, 1878 in the Batang Sadong and Kapuas river basins.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"0564e29dffea756f329105f7709579d17387a9f3268a8d2bf707ec54ce6127df","category":"Environment"}