{"title":"An essential role for mannan degradation in both cell growth and secondary cell wall formation","link":"https://academic.oup.com/jxb/article/75/5/1407/7426962?rss=1","date":1700265600000,"content":"<span><div>Abstract</div>Coordination of secondary cell wall deposition and cell expansion during plant growth is required for cell development, particularly in vascular tissues. Yet the fundamental coordination process has received little attention. We observed that the Arabidopsis endo-1,4-mannanase gene, <span>AtMAN6</span>, is involved in the formation of cell walls in vascular tissues. In the inflorescence stem, the <span>man6</span> mutant had smaller vessel cells with thicker secondary cell walls and shorter fiber cells. Elongation growth was reduced in the root, and secondary cell wall deposition in vessel cells occurred early. Overexpression of <span>AtMAN6</span> resulted in the inverse phenotypes of the <span>man6</span> mutant. AtMAN6 was discovered on the plasma membrane and was specifically expressed in vessel cells during its early development. The AtMAN6 protein degraded galactoglucomannan to produce oligosaccharides, which caused secondary cell wall deposition in vessel and fiber cells to be suppressed. Transcriptome analysis revealed that the expression of genes involved in the regulation of secondary cell wall synthesis was changed in both <span>man6</span> mutant and <span>AtMAN6</span> overexpression plants. AtMAN6’s C-terminal cysteine repeat motif (CCRM) was found to facilitate homodimerization and is required for its activity. According to the findings, the oligosaccharides produced by AtMAN6 hydrolysis may act as a signal to mediate this coordination between cell growth and secondary cell wall deposition.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"0568886bdd259f040bab3a4a9fca7163f4f0482ef5b77e3dc1ed07c781728723","category":"Environment"}