{"title":"Quantitative High Resolution Phase Contrast Imaging of Au-Cu Bimetallic Nanostructures","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.137/7719536?rss=1","date":1721779200000,"content":"<span>The combination of gold and copper is a potential way to reduce the cost of metallic interconnects and ameliorate the instability of copper [<a href=\"#ozae044.137-B1\">1</a>, <a href=\"#ozae044.137-B2\">2</a>]. Through shape-controlled synthesis, the synergy of these two metals can be exploited in a better fashion [<a href=\"#ozae044.137-B3\">3</a>]. The phase diagram of Au-Cu is complex in nature with appearance of several intermetallic phases such as Au<sub>3</sub>Cu, AuCu and AuCu<sub>3</sub> at lower temperatures (∼ 400˚C). Several new phases are also reported in Au-Cu system at nanometric length scale [<a href=\"#ozae044.137-B4\">4-6</a>]. In addition to that, alloying behavior of Au-Cu is not understood well when the temperature is lowered down further. In this investigation, Au-Cu intermetallic nanoparticles have been synthesized by adopting a three-step protocol in a single pot. These nanoparticles at 180˚C for 1 h led to the formation of single-phase solid solution of Cu in Au. Subsequent heat treatment at 290˚C for 2 h led to the transformation from random solid solution to intermetallic Au-Cu nanoparticles. From TEM and STEM-EDS results, it has been observed that nanoparticles are composed of Au-Cu homogeneous alloy. To understand the alloying behavior and underlying chemistry of Au-Cu nanostructures, attempts have been made to quantitatively understand the contrast and its interpretation in terms of atom column positions of Au and Cu of high-resolution phase contrast images. Multislice image simulations were performed with varying thickness and defocus values, and they were matched with the experimentally obtained high resolution phase contrast images [<a href=\"#ozae044.137-B7\">7</a>]. To understand the electron channeling behavior along Au and Cu atom columns, exit wave analysis have been carried out on high resolution phase contrast images acquired from ordered cubic Cu<sub>3</sub>Au intermetallic nanocrystals along [001] zone axis. Figure 1 shows experimentally recorded high-resolution phase contrast micrograph from an ordered cubic Cu<sub>3</sub>Au along [001] orientation and corresponding projected structure. The exit wave -potential, wave function, amplitude and phases have been retrieved over thickness ranging from 6 nm to 45 nm along Au and Cu atom columns as presented in Figure 2. The exit wave analysis revealed the contrast reversal in phase of Cu atom columns at every ∼ 9 nm thickness unlike Au atom columns where phase was observed throughout the entire thickness. Preferential imaging of Cu atom columns could be attributed to its potential and the channeling behavior of the electron wave.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"056a81b763041dcacaf22151b05c07fd9cbc430bc41914c9b2035b1dae7b281c","category":"Environment"}