{"title":"Biological mitigation of soil nitrous oxide emissions by plant metabolites","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17333?af=R","date":1716794045000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b40d31e6-e74c-4d9e-b7ae-8f8b1c27db5b/gcb17333-toc-0001-m.png\" alt=\"Biological mitigation of soil nitrous oxide emissions by plant metabolites\" />\n<p>Plant metabolites have been suggested as a nature-based solution to deal with the global climate crisis. Secondary metabolites belonging to the phenolic, terpenoid, and flavonoid classes reduced N<sub>2</sub>O emissions. Their biomitigation was closely associated with soil texture and pH, with optimum reduction achieved on soils with high clay content and near-neutral pH.</p>\n<br />\n<h2>Abstract</h2>\n<p>Plant metabolites significantly affect soil nitrogen (N) cycling, but their influence on nitrous oxide (N<sub>2</sub>O) emissions has not been quantitatively analyzed on a global scale. We conduct a comprehensive meta-analysis of 173 observations from 42 articles to evaluate global patterns of and principal factors controlling N<sub>2</sub>O emissions in the presence of root exudates and extracts. Overall, plant metabolites promoted soil N<sub>2</sub>O emissions by about 10%. However, the effects of plant metabolites on N<sub>2</sub>O emissions from soils varied with experimental conditions and properties of both metabolites and soils. Primary metabolites, such as sugars, amino acids, and organic acids, strongly stimulated soil N<sub>2</sub>O emissions, by an average of 79%, while secondary metabolites, such as phenolics, terpenoids, and flavonoids, often characterized as both biological nitrification inhibitors (BNIs) and biological denitrification inhibitors (BDIs), reduced soil N<sub>2</sub>O emissions by an average of 41%. The emission mitigation effects of BNIs/BDIs were closely associated with soil texture and pH, increasing with increasing soil clay content and soil pH on acidic and neutral soils, and with decreasing soil pH on alkaline soils. We furthermore present soil incubation experiments that show that three secondary metabolite types act as BNIs to reduce N<sub>2</sub>O emissions by 32%–45%, while three primary metabolite classes possess a stimulatory effect of 56%–63%, confirming the results of the meta-analysis. Our results highlight the potential role and application range of specific secondary metabolites in biomitigation of global N<sub>2</sub>O emissions and provide new biological parameters for N<sub>2</sub>O emission models that should help improve the accuracy of model predictions.</p>","author":"Yufang Lu, \nFangjia Wang, \nJu Min, \nHerbert J. Kronzucker, \nYao Hua, \nHaoming Yu, \nFeng Zhou, \nWeiming Shi","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"056dbef078612533003133da8b3bd342b699c9610351ea0af95b168f2a806129","category":"Environment"}