{"title":"Marc Soler is headed for UAE Team Emirates","link":"https://cyclingtips.com/2021/08/marc-soler-is-headed-for-uae-team-emirates/","date":1628416571000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/CORVOS_00033082-003-650x433.jpg\" /></div><h2>Marc Soler is headed for UAE Team Emirates</h2><p>\n</p><p>Marc Soler has signed a two-year deal with UAE Team Emirates, adding climbing talent and attacking spirit to a burgeoning 2022 lineup.</p>\n\n\n\n<p>“I’m very pleased to be joining UAE Team Emirates and looking forward to the new adventures and challenges ahead,” Soler said. “I’m coming here with a lot of excitement and with desire to work hard and and enjoy this new chapter. After 7 years at Movistar I think now is a good time in my career to look for new challenges and I thank them dearly for all our years working together and wish them all the best for the future. I’m ready for this new step.”</p>\n\n\n\n<p>The 27-year-old Catalan rider started his career at Team Movistar, and has grown into one of the peloton’s best climbers, and bigger characters, over the course of his seven years with the Spanish team. Soler took his first of five victories in 2016, winning the queen stage of the Route du Sud ahead of then teammate Nairo Quintana. Overall victory at Paris-Nice in 2018 came next, and last year he took his first Grand Tour stage win on day two of the Vuelta a España.</p>\n\n\n\n<p>Soler has lined up at eight Grand Tours so he brings a great deal of experience to UAE Team Emirates. He’s also familiar with the pressures of a high-performing team – as seen in the <a href=\"https://cyclingtips.com/2021/06/is-season-two-of-movistars-netflix-doc-worth-watching-review/\">Netflix docu-series ‘El día menos pensado’</a> (The Least Expected Day) – so he should be a valuable asset for the team of defending Tour de France champion Tadej Pogačar.</p>\n\n\n\n<p>“It’s no secret that Marc Soler is one of the finest riders in the pro peloton and we believe he carries all the key attributes and the racing mentality to fit in well to this team,” said Joxean Matxin Fernandez, team manager. “He’s an attacking rider, a fighter, and his personality and mental qualities are things that make him unique. He has his own distinctive racing style and character and we are excited to bring him on board into a team where I believe he will adapt to very well.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/marc-soler-is-headed-for-uae-team-emirates/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"057a267263b95ccafe4823b462d9bc7665c807c0411dea61a480743636841660","category":"Cycling"}