{"title":"Trek-Segafredo will race Dwars door Vlaanderen but without Pedersen: Daily News","link":"https://cyclingtips.com/2021/03/trek-segafredo-will-race-dwars-door-vlaanderen-but-without-pedersen-daily-news/","date":1617140612000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>Tuesday&#8217;s headlines include news that Trek-Segafredo and Bora-Hansgrohe will both send riders to the Dwars door Vlaanderen men&#8217;s race and Jake Stewart broke his hand when Nacer Bouhanni drove him into the barriers at Cholet-Pays de la Loire, among other news items.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Trek-Segafredo and Bora-Hansgrohe will indeed line up for the Dwars door Vlaanderen men&#8217;s race</h3>\n\n\n\n<p>Both <strong>Trek-Segafredo</strong> and <strong>Bora-Hansgrohe</strong> will field riders for the men&#8217;s race at Wednesday&#8217;s <strong>Dwars door Vlaanderen</strong> after initial uncertainty following COVID-19 positives within each team.</p>\n\n\n\n<p>Trek-Segafredo unveiled a lineup of <strong>Jasper Stuyven</strong>, <strong>Koen de Kort</strong>, <strong>Ryan Mullen</strong>, <strong>Kiel Reijnen</strong>, and <strong>Quinn Simmons</strong> for the race after those riders tested negative for COVID-19. <strong>Mads Pedersen</strong> and <strong>Alex Kirsch</strong>, however, were close contacts with someone who tested positive for COVID-19 and <strong>Edward Theuns&#8217;s</strong> test was inconclusive, and therefore those three riders will not make the start.</p>\n\n\n\n<p>As for Bora-Hansgrohe, <a href=\"https://sporza.be/nl/2021/03/30/bora-hansgrohe-mag-morgen-toch-starten-enkele-renners-zijn-nu-laagrisicocontact~1617121723848/\" target=\"_blank\" rel=\"noreferrer noopener\">Sporza</a> reports that <strong>Pascal Ackermann</strong>, <strong>Nils Politt</strong>, <strong>Patrick Gamper</strong>, <strong>Jordi Meeus</strong>, <strong>Marcus Burghardt</strong>, <strong>Daniel Oss</strong>, and <strong>Maciej Bodnar</strong> have all tested negative for COVID-19 and will thus make the start.</p>\n\n\n\n<h3>Jake Stewart broke his hand when Nacer Bouhanni rode him into the barriers at Cholet-Pays de la Loire</h3>\n\n\n\n<p><strong>Groupama-FDJ</strong> said on Tuesday that <strong>Jake Stewart</strong> would miss the <strong>Tour of Flanders</strong> due to a <a href=\"https://cyclingtips.com/2021/03/jake-stewart-broke-his-hand-when-bouhanni-drove-him-into-the-barriers/\" target=\"_blank\" rel=\"noreferrer noopener\">broken hand</a>, an injury he sustained on Sunday at <strong>Cholet-Pays de la Loire</strong> when <strong>Nacer Bouhanni</strong> drove him into the barriers in the final sprint.</p>\n\n\n\n<p>“We thought and was hoping that it was just superficial, but this morning[‘]s x-ray showed a fractured second metacarpal after Sundays Cholet Pays de la Loire,” Stewart said on Twitter. “Gutted to say the least to be missing De Ronde this week, but full focus now for recovering and getting back on the bike.”</p>\n\n\n\n<h3>Vini Zabù faces a possible suspension after another doping positive</h3>\n\n\n\n<p>Italian ProTeam <strong>Vini Zabù</strong> is facing the <a href=\"https://cyclingtips.com/2021/03/vini-zabu-faces-a-potential-suspension-after-another-doping-positive/\" target=\"_blank\" rel=\"noreferrer noopener\">possibility of a suspension</a> after a second member of the team has registered a doping positive in a 12-month period.</p>\n\n\n\n<p>After then-team member <strong>Matteo Spreafico</strong> returned adverse analytical findings for Enobosarm (ostarine) in two samples collected at last year&#8217;s <strong>Giro d&#8217;Italia</strong>, current team member <strong>Matteo de Bonis</strong> returned an adverse analytical finding for Erythropoietin (EPO) in an out-of-competition control on February 16 of 2021.</p>\n\n\n\n<p>In keeping with Article 11.3.1 of the UCI’s Anti-Doping Rules, Vini Zabù now faces a possible suspension of between 15 and 45 days. Depending on the length and the starting point of a suspension, the team could miss the Giro d&#8217;Italia, which starts on May 8.</p>\n\n\n\n<h3>Ladies Tour of Norway organizers plan for six-day Battle of the North in 2022</h3>\n\n\n\n<p>Organizers of the <strong>Ladies Tour of Norway</strong> announced on Monday that they are planning a six-day Battle of the North passing through Denmark, Norway, and Sweden in 2022. Originally, organizers had planned for a 10-day event in conjunction with the organizers of the <strong>Vårgårda WestSweden TTT</strong> and <strong>Vårgårda WestSweden RR</strong>, but the organizers of the latter two races ultimately decided to continue running their events instead.</p>\n\n\n\n<p>&#8220;We worked for a long time to bring Vårgårda&#8217;s one-day ride into the concept, but they currently want to continue their original concept,&#8221; said Ladies Tour of Norway manager Roy Moberg. &#8220;There are no &#8216;bad feelings&#8217; on our part about it, Vårgårda is a unique concept with strong local roots and we understand that they are trying to continue this.&#8221;</p>\n\n\n\n<h3>Coming up …</h3>\n\n\n\n<p>Cobbled racing continues on Wednesday with Dwars door Vlaanderen. The women&#8217;s race, a UCI 1.1-rated event, will traverse 122.2 km, starting and finishing in Waregem and taking on several cobbles and climbs along the way. The men&#8217;s WorldTour event will start in Roeselare and travel 184.1 km before finishing in Waregem.</p>\n\n\n\n<h2>In case you missed it &#8230;</h2>\n\n\n\n<ul><li>A group of industry brands is kicking off a <a href=\"https://cyclingtips.com/2021/03/meet-the-flashpoint-mvmnt-gravel-and-more-team/\" target=\"_blank\" rel=\"noreferrer noopener\">new sort of team</a>, focused on <strong>breaking down barriers</strong> to cycling.</li><li>&#8220;<a href=\"https://cyclingtips.com/2021/03/the-tipping-point-a-thank-you-letter-to-winter/\" target=\"_blank\" rel=\"noreferrer noopener\">The Tipping Point</a>&#8221; is a &#8216;<strong>thank you</strong>&#8216; letter to winter.</li><li>&#8220;<a href=\"https://cyclingtips.com/2021/03/all-bodies-on-bikes-a-film-about-body-inclusivity-and-the-cycling-community/\" target=\"_blank\" rel=\"noreferrer noopener\">All Bodies on Bikes</a>&#8221; is a film about <strong>body inclusivity</strong> and the cycling community.</li></ul>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/trek-segafredo-will-race-dwars-door-vlaanderen-but-without-pedersen-daily-news/\">Trek-Segafredo will race Dwars door Vlaanderen but without Pedersen: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"05814691695647222be951e0546b82f2d37cee58b661bc9d5348e78e640e3d70","category":"Cycling"}