{"title":"<i>SmilesUp</i> text message intervention for early childhood dental caries prevention: A protocol for a randomised controlled trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310561","date":1727704800000,"content":"<p>by Rebecca Chen, Michelle Irving, Bradley Christian, Neeta Prabhu, Harleen Kumar, Woosung Sohn, Heiko Spallek, Simone Marschner, Clara K. Chow</p>\r\nIntroduction <p>Despite improvements in health outcomes for children, early childhood dental caries (ECC) remains a chronic lifestyle-mediated disease that affects an estimated 600 million children worldwide. Parental influence on oral health-promoting behaviours is pivotal in preventing ECC. The latest WHO publications <i>Ending Early Childhood Dental Caries</i> and <i>Mobile Technologies for Oral Health</i> highlights the opportunity for mobile Health programs (including text message programs) to improve oral health behaviours and oral health self-efficacy. In response, our team of parents, oral health professionals (academics and health promotion experts), and IT specialists co-designed a 12-week, behavioural theory-informed text message program (called <i>SmilesUp</i>) to address behavioural risk factors specific to ECC. This randomised trial aims to assess whether the <i>SmilesUp</i> program improves parents’ oral health promoting behaviours (like tooth brushing twice a day with toothpaste) and oral health self-efficacy for their children compared to usual care.</p> Methods and analysis <p>A randomised controlled trial with a 1:1 parallel design will be conducted among 150 parents with children diagnosed with ECC and accessing public dental care in NSW, Australia. Patients will be stratified by hospital site, and modality of care (Dental General Anaesthetic (DGA) or not) and then randomly assigned to either immediately receive the SMILESup text messaging intervention or receive the program at the end of the study period. The primary outcome at 12 weeks is twice daily brushing with fluoride toothpaste. Secondary outcomes include changes in the intake frequency of sugared drinks and foods, oral health promoting bedtime routines and oral health self-efficacy. The primary analysis will follow an intention-to-treat principle. In addition, a process evaluation will examine barriers, enablers, and opportunities to scale the program.</p> Ethics and dissemination <p>Ethics approval has been obtained from the Western Sydney Local Health District Human Research Ethics Committee 2022/ETH01920. Study results will be disseminated via peer-reviewed publications and presentations at conferences.</p> Trial registration <p>Trial registration number: This clinical trial has been prospectively registered on the ANZCTR from the 27<sup>th</sup> of March 2023. Registration number: ACTRN12623000325606.</p>","author":"Rebecca Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0582167def16722f0aa054cfc5e62812c0de372206b576f0580eefdbf7e40342","category":"Interdisciplinary"}