{"title":"Apple libera la quinta beta para desarrolladores/as de iOS 17","link":"https://www.macworld.com/article/1963997/ios-17-beta.html","date":1691566517000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>La primera beta para desarrolladores de iOS 17 fue liberada el primer día de la WWDC, como manda la tradición. Aunque está pensada para que los desarrolladores y desarrolladoras empiecen a crear aplicaciones con los nuevos marcos y API, y para que prueben y envíen informes de errores si sus apps no funcionan con el nuevo <em>software</em>, técnicamente está disponible para cualquiera que tenga una cuenta de desarrollador.</p>\n\n\n\n<p>De hecho, la beta para desarrolladores solía requerir una suscripción de pago al programa de desarrolladores, que cuesta 99 dólares al año. Con iOS 17, Apple cambió su política para permitir que incluso aquellos con cuentas de desarrollador gratuitas (que por otra parte, solo proporcionan acceso a los foros de desarrolladores y Xcode) puedan descargar la beta de desarrollador de iOS 17.</p>\n\n\n\n<p>La primera beta pública fue liberada el 12 de julio y se corresponde con la tercera beta para desarrolladores. Ahora, Apple ha lanzado la quinta versión beta de iOS 17 para desarrolladores, junto con la de iPadOS 17, watchOS 10, macOS Sonoma y tvOS 17.</p>\n\n\n\n<h2>Nuevas funciones de iOS 17</h2>\n\n\n\n<p>iOS 17 es una actualización de <em>software</em> principal, por lo que está llena de nuevas funciones. Algunas de <a href=\"https://www.macworld.com/article/1943587/cinco-nuevas-funciones-ios-17.html\">nuestras funciones favoritas de iOS 17</a> incluyen la transcripción en tiempo real Live Voicemail, la mejora del autocorrector, la mejora de Siri (incluida la posibilidad de activarlo con “Siri” en lugar de “Oye Siri”), los carteles de contactos y StandBy. </p>\n\n\n\n<p>En nuestra <a href=\"https://www.macworld.com/article/1530492/ios-17-2.html\">guía sobre iOS 17</a>, encontrarás más información sobre todas las prestaciones que llegarán este otoño a tu iPhone. Aquí destacaremos algunos de los cambios y actualizaciones más interesantes de la última versión beta.</p>\n\n\n\n<p>Algunos de los cambios en la beta 5 incluyen:</p>\n\n\n\n<ul>\n<li><strong>Actualización del mensaje automático en Buzón de voz en vivo: </strong>A menos que hayas personalizado el mensaje de tu buzón de voz, el mensaje automático que salta cuando usas Buzón de voz en vivo ha sido actualizado para que sea un poco menos confuso que antes.</li>\n</ul>\n\n\n\n<h2>Cómo instalar la beta pública de iOS 17</h2>\n\n\n\n<p>Si quieres ser de los primeros en probar iOS 17, puedes apuntarte a la prueba beta pública. El proceso para <a href=\"https://www.macworld.com/article/1452600/instalar-ios-beta.html\">instalar una beta</a> cambió en iOS 16.4. Así es como funciona ahora el nuevo proceso:</p>\n\n\n\n<ol>\n<li>Haz clic en ‘Sign In’ (‘Registrarse’) en la <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/sp/betaprogram/&amp;xcust=1-1-1963997-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">página Beta de Apple</a> y regístrate con tu ID de Apple.</li>\n\n\n\n<li>Inicia sesión en el Programa de Software Beta.</li>\n\n\n\n<li>Haz clic en ‘Inscribe tu dispositivo iOS’.</li>\n\n\n\n<li>Abre la aplicación de ‘Ajustes’, pulsa ‘General’ y, a continuación, ‘Actualización de software’.</li>\n\n\n\n<li>En la sección ‘Actualizaciones beta’, selecciona la beta pública de iOS que quieras instalar.</li>\n</ol>\n\n\n\n<p>Después de registrarte, puede que la opción beta tarde unos instantes en aparecer en ‘Actualización de software’.</p>\n\n\n\n<p>Se espera que la primera beta pública de iOS 17 llegue en julio, por lo que sugerimos a la mayoría de los usuarios que esperen a que comience. A pesar de los errores que pueden presentar las betas públicas, las primeras betas para desarrolladores de las principales versiones de nuevos sistemas operativos suelen ser aún más propensas a errores.</p>\n\n\n\n<h2>Cómo instalar iOS 17 beta para desarrolladores</h2>\n\n\n\n<p>Necesitarás estar registrado como desarrollador de Apple. A partir de iOS 17, no es necesario estar en el <a href=\"https://www.macworld.com/article/1457585/apple-beta-software-program-o-como-ser-el-primero-en-probar-software-de-apple.html\">Programa de Desarrolladores</a> de 99 dólares al año para acceder a la beta de desarrolladores. Una cuenta de desarrollador gratuita será suficiente y podrás obtener una a través de Xcode o de la aplicación Apple Developer en iOS.</p>\n\n\n\n<p>A continuación, te explicamos cómo hacerlo a través de la app Apple Developer:</p>\n\n\n\n<ol>\n<li>Descarga la aplicación Apple Developer del <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/es/app/apple-developer/id640199958&amp;xcust=1-1-1963997-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">App Store</a>.</li>\n\n\n\n<li>Abre la aplicación.</li>\n\n\n\n<li>Pulsa en ‘Cuenta’.</li>\n\n\n\n<li>Inicia sesión con tu ID de Apple habitual. </li>\n</ol>\n\n\n\n<p>Si quieres vender aplicaciones en el App Store, tendrás que pagar 99 dólares al año para tener acceso a una cuenta de pago. Inscríbete en el Programa para Desarrolladores de Apple en la <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/enroll/&amp;xcust=1-1-1963997-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">web de Apple</a> o a través de la app para desarrolladores de Apple. Puedes comparar la cuenta gratuita y la de pago en <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/support/compare-memberships/&amp;xcust=1-1-1963997-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">esta otra página</a>.</p>\n\n\n\n<p>Los desarrolladores registrados pueden optar por obtener la beta pública seleccionando iOS Public Beta en la pantalla de actualización de <em>software</em>. Después de registrarse como desarrollador, la opción puede tardar un poco en aparecer en ‘Actualización de software’.</p>\n\n\n\n<p>Algunos desarrolladores tienen un ID de Apple registrado para el acceso de desarrolladores que es diferente del ID de Apple asociado a su cuenta y datos personales de Apple. Para utilizar un ID de Apple para el acceso a la beta diferente del que se utiliza en el resto de iOS, abre ‘Ajustes’ &gt; ‘General’ &gt; ‘Actualización de software’ &gt; ‘Actualizaciones beta’ y selecciona el ID de Apple en la parte inferior de la pantalla.</p>\n\n\n\n<h2>Riesgos y precauciones</h2>\n\n\n\n<p>Las betas son versiones de prueba de <em>software</em> que llegará de manera oficial próximamente. Por definición, están inacabadas y, aunque deberían incluir la mayoría o todas las funciones del producto final, habrá diferencias estéticas e, inevitablemente, algunos fallos y problemas que habrá que solucionar. Los fallos y problemas, de hecho, son la razón por la que Apple se molesta en hacer pruebas beta de iOS.</p>\n\n\n\n<p>En otras palabras, no esperes una experiencia de usuario perfecta. En particular, no esperes que las aplicaciones existentes (incluidas aquellas en las que sueles confiar) funcionen correctamente.</p>\n\n\n\n<p>En casos extremos, puede que incluso te encuentres con que tu dispositivo está bloqueado por la beta, y no se puede utilizar hasta que la próxima beta llegue y, con suerte, solucione el problema. Tampoco es raro que el <em>software</em> de las primeras versiones beta presente problemas como un consumo excesivo de batería.</p>\n\n\n\n<p>Cuanto más nos acerquemos al lanzamiento final y a la versión de iOS, más pulidas y completas de funciones serán las betas disponibles. La contrapartida, por supuesto, es que, de todos modos, quedará menos para el lanzamiento oficial.</p>\n\n\n\n<p>No nos cansaremos de repetir lo importante que es <a href=\"https://www.macworld.com/article/1451424/estas-son-las-4-formas-de-hacer-copia-de-seguridad-de-tu-iphone-o-ipad.html\">hacer una copia de seguridad de tu iPhone</a> antes de instalar una beta de iOS o, mejor aún, utilizar un dispositivo secundario en lugar de tu iPhone principal. No lo perderás todo si algo va mal mientras se instala la beta, y podrás <a href=\"https://www.macworld.com/article/1458606/eliminar-ios-beta-iphone.html\">volver a la última versión</a> si así lo deseas.</p>\n\n\n\n<p><em>Artículo original publicado en la edición en inglés de <a href=\"https://www.macworld.com/article/1963238/ios-17-beta-features-release-date-how-to-install.html\" target=\"_blank\">Macworld.com</a>.</em></p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"05856f0ccfb2108a293bd18a09efeb2037b406e4cf13e584a294fed739e31b9c","category":"Apple"}