{"title":"Giro d’Italia 2023 team ratings - who performed best in this year's attritional race?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-d-italia-2023-team-performances-the-best-and-the-worst","date":1685775601000,"content":"\n      <p><span>There is only ever one winner overall in Grand Tours, but the beauty of a three-week race is that it does provide ample opportunities for victory on the way to the final stage. Some teams go to races like the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> targeting the general classification, while others will hunt for stage wins from opportunistic breakaways or flat bunch sprints. Either way, no teams want to come away with nothing at all.</span></p>\n<div></div>\n<p><span>This year’s Giro was plagued with bad weather, shortened stages, crashes and Covid-19, but there were still some teams that came out on top with impressive performances and others who will need to go back to the drawing board and rethink ahead of the rest of the season. </span><span>Taking into account individual stage results and overall finishing positions as well as general entertainment factor, we rate the performances of each team across the three weeks of racing around Italy.</span></p>\n<h3>Soudal - Quick-Step - 6/10</h3>\n<p><span>It all started off so well for the Belgian team with Remco Evenepoel’s storming opening time trial where he won by 22 seconds ahead of Filippo Ganna. Back then, it seemed like this was Evenepoel’s Giro to lose, he looked to be leaps and bounds ahead of his competitors. As the first week continued though, cracks did start to appear in Soudal - Quick-Step’s line-up. For example, Evenepoel was isolated without any teammates on the second category Colle Molella climb on stage four, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/cracking-on-category-two-climbs-should-alarm-bells-be-ringing-for-evenepoel-and-soudal-quick-step-at-the-giro-d-italia\">raising questions </a>over how the team would support him in the high mountains. These were questions that were never answered, however, after Evenepoel <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-giro-d-italia-turned-on-its-head-remco-evenepoel-out-of-the-race-with-covid-19-what-s-next\">left the race with Covid-19 </a>ahead of the first rest day. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography---Giro-d_Italia---2023---Stage-6-00206_1024x1024.jpg?v=1685725531\" alt />The same day he tested positive for the illness, Evenepoel did actually win the second time trial of the race on stage nine. </span><span>Still beating the rest of the field with Covid? That surely deserves a couple of points on its own. However, Evenepoel leaving the race was the start of a series of unfortunate events for Soudal - Quick-Step as one by one their riders were taken out with Covid-19. In the end, just two, Ilan van Wilder and Pieter Serry, finished the race for the Belgium squad – we can only imagine the quiet of the team bus. Van Wilder finished a respectable 12th on general classification, an impressive result for a young rider, so he gets a couple of points for that. Overall, this Giro was a case of what could have been for Soudal - Quick-Step, before Covid came and spoiled their fun.</span></p>\n<h3>AG2R Citroën Team - 7/10</h3>\n<p><span>The Paret-Peintre brothers on AG2R Citroën Team go a long way in scoring points for AG2R Citroën Team in this Giro d’Italia. Aurélien Paret-Peintre’s win on stage four of the race was the biggest victory this team has had so far this season, and their assault at the Giro d’Italia didn’t stop there. The likes of Larry Warbasse and Valentin Paret-Peintre were regularly trying to get themselves into the breakaways of the day and were constant animators of the race, with Valentin even finishing fifth on the tough, shortened stage 13 to Crans Montana. They may have only come away with one stage win in the end, but we’ll always give praise to a bit of gusty attacking, especially from a team that isn’t one with the biggest budget in the peloton.</span></p>\n<h3>Alpecin-Deceuninck - 6/10</h3>\n<p><span>Alpecin-Deceuninck seemed to come to this Giro d'Italia with one clear focus: leading out Kaden Groves to stage victories. They did that early on in the race, with the young Aussie sprinting to the win way back on stage five in a chaotic, crash-marred finish in Salerno. Before he finally got that big win, Groves secured two third places on stages two and three, a testament to Alpecin-Deceuninck’s well-dialled and strong lead out train. The boys in blue were often the most notable at the front of the race in flat stages and were making their mark until Groves left the race after stage 11 due to struggling with illness. Only four Alpecin riders actually ended up finishing the race, plagued, like so many were, by illness and injury. Of those who remained, Stefano Oldani had some impressive showings in breakaways and secured multiple top-10 finishes in bunch sprints, but never really managed to pick up where Groves left off with stage wins. Credit should be given to Oldani for stepping up to the mark when his team’s plans went awry, but it’s a pity he wasn’t able to turn any of those top-10s into podium spots.</span></p>\n<h3>Astana - Qazaqstan Team - 8/10</h3>\n<p><span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/quintessential-cav-mark-cavendish-bows-out-of-the-giro-ditalia-at-his-very-best\">Mark Cavendish’s fairytale finish</a> on the final stage in Rome wins Astana-Qazaqstan points almost single handedly. After the Manxman’s spectacular crash on stage four to Salerno, he battled through some of the toughest mountains in the Giro’s history to have a chance to go for it on the final flat sprint stage and he won in emphatic style. You couldn’t write a better ending to Cav’s last Giro d’Italia and his team deserves points for taking a punt on the legendary sprinter and signing him in the first place at the start of this season. Astana’s lead out train for Cavendish might need some work – it took help from Geraint Thomas to get him in the right position on the final stage – but it was great to see the team rallying around him and helping the 37-year-old make the time cut through the brutal Dolomites. Team spirit, emotional endings and a big Mark Cavendish grin, what more could you want?<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-SWpix-Giro-2998_1024x1024.jpg?v=1685725430\" alt /></span></p>\n<h3>Bahrain-Victorious - 9/10</h3>\n<p><span>Winners of the overall team classification in this year’s Giro, Bahrain-Victorious deserve top marks for their performances over the three weeks. Unlike many teams, they managed to strike a good balance between having riders who could go for it on sprint stages, those who could target stage wins on hilly days and those who could target the general classification.<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/lightning-fast-the-gloriously-untapped-potential-of-jonathan-milan\"> Jonathan Milan</a> won the </span><i><span>maglia ciclamino</span></i><span> after his incredible showing in the sprint finishes – undoubtedly the revelation of this year’s Giro, coming away with a stage win and four second place finishes. The team’s Colombian climber Santiago Buitrago should also be given credit for his stage win atop Tre Cime di Lavaredo. Finally, Damiano Caruso’s fourth place on the general classification is a strong result for the experienced climber, more impressive still when you consider he didn’t have a team around him created solely to support him for general classification. Sprints, breakaway wins and a good GC showing, not bad, Bahrain.</span></p>\n<h3>Bora-Hansgrohe - 7/10</h3>\n<p><span>Nico Denz undoubtedly flew the flag the highest for Bora-Hansgrohe at this year’s Giro with two stage wins for the German rider. These came as the biggest results so far in his career, as well as perhaps a bit of a surprise to him and his team. Denz’s impressive tactical nous and ability to get himself in the breakaway on the right day, as well as finish it off at the end, shows great talent and highlights him as one to watch for the rest of the season. Denz aside, Bora’s Giro was a little quiet, with Lennard Kämna securing ninth on general classification, a solid result but some might have expected more from the 26-year-old. </span></p>\n<h3>Cofidis - 5/10</h3>\n<p><span>There is, unfortunately, little to say about Cofidis’s performance in this year’s Giro d’Italia, as we saw very little of them in the race altogether. Simone Consonni secured a couple of top-10 results in sprint finishes but was far from contesting the victory in most of them, while the team was rarely in any of the major breakaways. They did have six riders finish the race, however, perhaps sort of an achievement in a Giro with so many abandons. </span></p>\n<h3>EF Education-EasyPost - 9/10</h3>\n<p><span>Ben Healy’s devilish attacking on stage 19 of the race to the humour of Jumbo-Visma and Rohan Dennis in particular, almost gets EF Education-EasyPost full marks on its own as one of the moments of this year’s Giro d’Italia. The young Irishman was expected to do some big things in the race after his spectacular Ardennes Classics campaign and he did not disappoint, fighting hard to ensure he was in the breakaways in multiple stages and coming away with a victory on stage eight and a second place on stage 15 as a result. His cheeky stage 19 attacks which rubbed the Ineos Grenadiers up the wrong way when they were trying to control the race showed he has some serious guts too – not many people would risk messing with an angry [Ben] Swifty. Magnus Cort also put on a great show for EF Education-EasyPost, winning on stage 10 of the race and finishing third on stage 19, as did home favourite Alberto Bettiol. It seems like we can always rely on the colourful jerseys of EF Education to light up the front of a bike race and that gets a top score from us.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-Giro-2835-_1_1024x1024.jpg?v=1685725485\" alt /></span></p>\n<h3>Eolo-Kometa - 8/10</h3>\n<p><span>Wildcard ProTeam Eolo-Kometa deserve high marks for securing a stage win in a race where they were up against some much bigger teams with much bigger budgets. Davide Bais’ victory on stage seven was an impressive one for the Italian squad, and they kept to getting the names of their sponsors well seen as the race continued, regularly making appearances in breakaways. We love an underdog, especially one that outperforms people’s expectations of them. Good work, Eolo-Kometa.</span></p>\n<h3>Green Project-Bardiani CSF-Faizanè - 6/10</h3>\n<p><span>Another underdog squad who impressed us were Green Project-Bardiani CSF-Faizanè and not just because of the length of their team name. The team had a strong performance on stage 12 of this year’s Giro d’Italia with a fourth place for Alessandro Tonelli who managed to find himself in the breakaway of the day. It was a similar scenario a few days before on stage eight too, when Tonelli contested the stage win on the way to Fossombrone. Filippo Fiorelli finished off a solid race for the team with his third place in the bunch kick to Rome, rounding out a Giro that the Bardiani team should be proud of.</span></p>\n<h3>Groupama-FDJ - 8/10</h3>\n<p><span>Oh Thibaut Pinot. We’re not sure whether<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/are-you-not-entertained-in-praise-of-thibaut-pinot-s-ride-at-the-2023-giro-d-italia\"> the heartbreak you caused fans</a> at this year’s Giro is worth full marks or no marks at all, so we’ve gone somewhere in the middle. Pinot’s closeness to achieving stage wins on two occasions and being brutally upset when he didn’t get them was bike racing pulling at your heartstrings at its very best and is what we’ll miss when the Frenchman retires at the end of this season. Emotions aside, Pinot did secure a very impressive fifth place finish on the general classification and five top-10 finishes on stages, so his Giro can still be classed as a success. Bruno Armirail’s two day stint in the pink jersey was another element to Groupama-FDJ’s success story at the Giro d’Italia – the French team did well to secure the <em>maglia rosa</em> and defended it valiantly for as long as they could too. </span></p>\n<h3>Ineos Grenadiers - 9/10</h3>\n<p><span>It was heartbreak in the end for Geraint Thomas when he lost the pink jersey in the final time trial of this year’s Giro d’Italia, but the work that he and his team did to get him to that point should not be underestimated. Ineos defended pink for nine days of this year’s race, with the likes of Ben Swift, Laurens De Plus, Thymen Arensman and Salvatore Puccio all stepping up to the mark after Filippo Ganna left the race with Covid-19 and Tao Geoghegan Hart crashed out stage 11 to Tortona. Perhaps the Ineos Grenadiers took some criticism for their <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-most-boring-stage-ever-why-we-are-seeing-cagey-racing-in-the-opening-week-of-the-2023-giro-ditalia\">defensive riding during the race</a>, but Thomas’s performance during the final time trial told us that they were actually riding smart and just within the Welshman’s limits during the days leading up to that. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-SWpix-Giro-3042_1024x1024.jpg?v=1685725621\" alt />Thomas’s ability to still be fighting to win Grand Tours after such a long and illustrious career should not be underestimated, either. He continually defies expectations, able to keep believing in himself when others may not. The 37-year-old’s honesty and candid interviews are refreshing too and his grace in defeat should be applauded – not to mention his lead out for Mark Cavendish on the final stage of the race.</span></p>\n<h3>Intermarché-Circus-Wanty - 5/10</h3>\n<p><span>Only four riders from Intermarché-Circus-Wanty finished this year’s Giro d’Italia, and none of them truly managed to make a mark on the race in the way they likely would have hoped. Arne Marit spoke of struggling through the mountains so he could contest sprint stages, but was plagued by mechanicals and a general lack of speed to fight for victories there in the end. Laurenz Rex’s fourth place from the breakaway on stage 14 was notable for a young rider, but it doesn’t put this Giro into the camp of being a successful one for the Belgian squad. </span></p>\n<h3>Israel-Premier Tech - 8/10</h3>\n<p><span>Gee-wizz. Second place in both the mountains and points classifications and four second place stage finishes, as well as finishing 22nd on GC, some might say this Giro d’Italia was a frustrating one for Derek Gee. However, in his brave and gusty fights for breakaways and his seemingly never-ending enthusiasm for the race –even when it threw thunderstorms and hailstones at riders – Gee won himself a lot of fans over the three weeks. Going from a relatively unknown track rider to one of the most talked about names in the Giro d’Italia is a formidable transformation and a sure sign that Gee will be a rider to keep an eye on over the next couple of years. That victory can’t be far away. Gee aside, Israel-Premier Tech’s other young riders also stepped up to the plate in the 2023 Giro d’Italia, Marco Frigo had some impressive results, as did Matthew Riccitello – both aged 23 and 21 respectively. These are all good signs for the team that was once known for signing riders mostly at the end of their careers – the future is bright for Israel-Premier Tech.</span></p>\n<h3>Jumbo-Visma - 10/10</h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography--Giro-d_Italia-2023---Stage-20-04772_1024x1024.jpg?v=1685725315\" alt />Pink jersey winner after a final time trial that will go down for the ages, there can be no criticising Primož Roglič in this year’s Giro d’Italia. For him to win on that final mountain time trial is <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/in-the-giro-d-italia-s-craziest-day-primoz-roglic-finally-gets-his-fairytale\">a story of blissful redemption</a> following what happened in the Tour de France on Les Planche des Belles Filles three years ago, and the Slovenian’s hard work since then means it’s impossible to deny how much he deserves the <em>maglia rosa</em>. Roglič animated the race on multiple occasions, trying to ignite GC battles when he could. Jumbo-Visma should be applauded for taking the challenge to their rivals in that final week of racing, with the likes of Rohan Dennis steadily coming into stronger form as the race rolled on. If this was a Giro d’Italia of fairy tales, Jumbo-Visma might deserve their happy ending more than anyone else after the disappointment they’ve had to come back from in Grand Tours over the years. Chapeau, Roglič, a worthy winner.</span></p>\n<h3>Movistar Team - 7/10</h3>\n<p><span>Einer Rubio was undoubtedly the star of the show for Movistar with his emphatic win on stage 13 to Crans Montana. The Colombian climber impressed with his strong climbing legs, but also should be applauded for staying out of the way of Thibaut Pinot’s wrath during that stage, instead remaining calm and focused on the task at hand. There were perhaps higher hopes for Fernando Gaviria in the sprint stages who failed to produce any notable results, but the performances of Rubio and the likes of Carlos Verona as they got themselves into breakaways means that Movistar deserves some credit. We knew they were there, at least.</span></p>\n<h3>Team Arkéa Samsic - 6/10</h3>\n<p><span>Yet another team victim to losses due to illness, Arkéa Samsic might have hoped for more from this Giro d’Italia. Their sprinter, David Dekker, looked like he could be in with a chance of a stage victory when he finished a promising second on stage two of the race to San Salvo, but abandoned a few days later due to illness. That left the likes of Warren Barguil to save the team’s Giro in the mountains, and the Frenchman had a very good go at it, constantly finding himself in breakaways and at the front of the race, he just wasn’t able to finish it off and secure a stage win. Dekker and Barguil’s performances, though they didn’t bring victories, certainly show promise for the rest of the season, so all hope is not lost for Arkéa Samsic.</span></p>\n<h3>Team Corratec-Selle Italia - 6/10</h3>\n<p><span>Karel Vacek’s performance on stage seven to Gran Sasso d'Italia wins Team Corratec-Selle Italia plenty of points. The Czech rider’s three-man breakaway with Davide Bais and Simone Petilli (Intermarché-Circus-Wanty) was a brave one and he deserved that podium spot at the end of the day. Vacek wasn’t the only Corratec rider to make a name for himself in this Giro, sprinter Nicolas Dalla Valle had a couple of good top-five finishes in the sprints, while British rider Charlie Quarterman was also active in the breakaways on multiple occasions. For a team that was likely well aware before this race that it wouldn’t be able to challenge the top teams for general classification, Team Corratec-Selle Italia did the best they could with the resources they had and should be applauded for getting some formidable results out of this year’s Giro. </span></p>\n<h3>Team DSM - 8/10</h3>\n<p><span>Norwegian rider Andreas Leknessund was a breakthrough for Team DSM in this year’s Giro d’Italia, eventually finishing in eighth place on the general classification after five days valiantly defending the pink jersey which he won after getting in the breakaway on stage four. Team DSM did a great job as race leaders during those stages, helping Leknessund to the best of their ability when they found themselves in a position that they likely never expected to be in before the race. Their lead outs for Alberto Dainese in the sprint stages were also impressive – the Italian rider managed to win stage 17 to Carole after a well-dialled approach to the finish line by the team. It was also an impressive Giro d’Italia for 22-year-old Marius Mayrhofer who got himself in the breakaway and was riding strongly in multiple stages. All in all, a job well done for Team DSM.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography--Giro-d_Italia-2023---Stage-19-02213_1024x1024.jpg?v=1685725671\" alt /></span></p>\n<h3>Team Jayco-Alula - 8/10</h3>\n<p><span>Michael Matthews’ stage win when he outsprinted Mads Pedersen on the complicated roads to Melfi was a highlight in Team Jayco-Alula’s Giro – the Aussie rider <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/it-was-so-many-setbacks-i-thought-maybe-it-s-my-time-michael-matthewss-rough-road-to-the-giro-ditalia\">told <em>Rouleur</em> how much he’d struggled with the disappointment of last season, even considering retirement </a>at one point. That was the start of what can be considered a very successful Giro for the team, with Filippo Zana’s victory atop the Val di Zoldo being another highlight of the race. Eddie Dunbar also had a valiant effort at securing a good general classification finish, riding strongly throughout the race and eventually being rewarded a seventh place finish. All in all, Jayco-Alula covered all bases and deserved the two stage wins and top-10 GC finish they came away with from Italy.</span></p>\n<h3>Trek-Segafredo - 8/10</h3>\n<p><span>Mads Pedersen’s win in Napoli was Trek-Segafredo’s reward for the strong lead out train they built around the Danish powerhouse, but when Pedersen was forced to retire from the race with illness after stage 12, it left the American team without a clear focus for the remainder of the race. However, the likes of Toms Skujiņš and Bauke Mollema should be applauded for the way they raced during the remainder of the Giro d’Italia, constantly fighting for breakaway results and coming very close to stage wins on multiple occasions. It’s true that perhaps Trek could have come away with more stage wins from the Giro if Pedersen had remained in the race for longer, but credit should be given for the way the rest of the team rallied after their leader abandoned.</span></p>\n<h3>UAE Team Emirates - 9/10</h3>\n<p><span>It’s easy to wonder what becomes of UAE Team Emirates when their Tour de France champion Tadej Pogačar, isn’t present, but the Giro d’Italia showed that this is a team which is full of superstars – it’s certainly no one trick pony. João Almeida’s third place finish overall is confirmation of the Portuguese rider’s potential as a future Grand Tour winner and there were many occasions during the race where it looked like he might be the favourite to win the pink jersey overall, namely when he won the stage to Monte Bondone in impressive style ahead of Geraint Thomas. Brandon McNulty also had a great attempt at this year’s Giro, winning stage 15 to Bergamo in front of Ben Healy and Marco Frigo. Pascal Ackermann’s stage win in the sprint to Tortona makes UAE Team Emirates one of the only squads in the race to really perform to a high level across the board in all types of stages. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"05872c1d928f2360feef9f13ab3695d8c3977cd76007c27edb1c7ad8efcaf25a","category":"Cycling"}