{"title":"Withania somnifera (Ashwagandha) Improves Spatial Memory, Anxiety and Depressive-Like Behavior in the 5xFAD Mouse Model of Alzheimer&rsquo;s Disease","link":"https://www.preprints.org/manuscript/202408.1265/v1","date":1724051754000,"content":"Withania somnifera (WS), also known as ashwagandha, is a popular botanical supplement used to treat various conditions including memory loss, anxiety and depression. Previous studies from our group showed an aqueous extract of WS root (WSAq) enhances cognition and alleviates markers for depression in Drosophila. Here, we sought to confirm these effects in the 5xFAD mouse model of β-amyloid (Aβ) accumulation. Six- to seven-month-old male and female 5xFAD mice were treated with WSAq in their drinking water at 0 mg/mL, 0.5 mg/mL or 2.5 mg/mL for four weeks. In the fourth week of treatment, spatial memory, anxiety and depressive-like symptoms were evaluated. At the conclusion of behavioral testing, brain tissue was harvested, immunohistochemistry was performed, and the cortical expression of antioxidant response genes was evaluated. Both concentrations of WSAq improved spatial memory and reduced depressive and anxiety-related behavior. These improvements were accompanied by a reduction in Aβ plaque burden in the hippocampus and cortex and an attenuation of neuroinflammatory markers. Antioxidant response genes were upregulated in the cortex of WSAq treated mice. Oral WSAq treatment could be beneficial as a therapeutic option in AD for improving disease pathology and behavioral symptoms. Future studies focused on dose optimization of WSAq administration and further assessment of the mechanisms by which WSAq elicits its beneficial effects will help inform the clinical potential of this promising botanical therapy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"058a2140e4876813a1f2a9b5013a494fd835a84cb2069b86d68aaf86e9589e01","category":"Interdisciplinary"}