{"title":"Of flippers and wings: The locomotor environment as a driver of the evolution of forelimb morphological diversity in mammals","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14632?af=R","date":1723799343000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d8fc804d-ec8c-4c6f-8de7-b2e595c86d0f/fec14632-toc-0001-m.png\" alt=\"Of flippers and wings: The locomotor environment as a driver of the evolution of forelimb morphological diversity in mammals\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/31/from-limbs-to-wings-and-flippers-how-leaving-the-land-contributed-to-the-forelimb-diversity-of-mammals/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe early diversification of tetrapods into terrestrial environments involved adaptations of their locomotor apparatus that allowed for weight support and propulsion on heterogeneous surfaces. Many lineages subsequently returned to the water, while others conquered the aerial environment, further diversifying under the physical constraints of locomoting through continuous fluid media. While many studies have explored the relationship between locomotion in continuous fluids and body mass, none have focused on how continuous fluid media have impacted the macroevolutionary patterns of limb shape diversity.\n\nWe investigated whether mammals that left terrestrial environments to use air and water as their main locomotor environment experienced constraints on the morphological evolution of their forelimb, assessing their degree of morphological disparity and convergence. We gathered a comprehensive sample of more than 800 species that cover the extant family-level diversity of mammals, using linear measurements of the forelimb skeleton to determine its shape and size.\n\nAmong mammals, fully aquatic groups have the most disparate forelimb shapes, possibly due to the many different functional roles performed by flippers or the relaxation of constraints on within-flipper bone proportions. Air-based locomotion, in contrast, is linked to restricted forelimb shape diversity. Bats and gliding mammals exhibit similar morphological patterns that have resulted in partial phenotypic convergence, mostly involving the elongation of the proximal forelimb segments.\n\nThus, whereas aquatic locomotion drives forelimb shape diversification, aerial locomotion constrains forelimb diversity. These results demonstrate that locomotion in continuous fluid media can either facilitate or limit morphological diversity and more broadly that locomotor environments have fostered the morphological and functional evolution of mammalian forelimbs.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/31/from-limbs-to-wings-and-flippers-how-leaving-the-land-contributed-to-the-forelimb-diversity-of-mammals/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Priscila S. Rothier, \nAnne‐Claire Fabre, \nRoger B. J. Benson, \nQuentin Martinez, \nPierre‐Henri Fabre, \nBrandon P. Hedrick, \nAnthony Herrel","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"058c2c47067e47ea6de62c853d07d1975e21f559143530a40ffee195f9644860","category":"Environment"}