{"title":"How the EU’s new battery rule could change your iPhone and iPad forever","link":"https://www.macworld.com/article/1993926/european-union-battery-regulation-removable-iphone-ipad-macbook-2.html","date":1689330600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The European Council, a governing body that decides regulations for European Union member states, just <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.consilium.europa.eu/en/press/press-releases/2023/07/10/council-adopts-new-regulation-on-batteries-and-waste-batteries/&amp;xcust=1-1-1993926-1-0-0&amp;sref=https://www.macworld.com/feed\">adopted a massive new battery regulation</a>. Technically, it’s a set of amendments and repeals to earlier battery directives, and it’s aimed at providing a more ecologically sound energy storage infrastructure for the EU.</p>\n\n\n\n<p>Once the European Parliament and European Council sign the regulation, it will set into motion a major shift in the battery industry. Technically it only applies to EU member states, but that’s a massive part of the world economy and will have global effects.</p>\n\n\n\n<p>Notably, the regulations will require that portable devices—including phones, tablets, and laptops—have batteries that can be easily replaced by users without any special tools or training. That would necessitate a massive shift in design from Apple for iPhones, iPads, and Macs. </p>\n\n\n\n<h2>A small part of a big set of regulations</h2>\n\n\n\n<p>The full set of regulations (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://data.consilium.europa.eu/doc/document/PE-2-2023-INIT/en/pdf&amp;xcust=1-1-1993926-1-0-0&amp;sref=https://www.macworld.com/feed\">PDF link</a>) is hundreds of pages long and mostly concerns the materials, manufacture, and end-of-life treatment of batteries. Central to the new rules is the formation of a circular battery economy, with hard targets on the reclamation of waste batteries (63 percent by the end of 2027 and 73 percent by the end of 2030 for portable batteries) and lithium recovery (50 percent by the end of 2027 and 80 percent by the end of 2031). </p>\n\n\n\n<p>There are also recycling targets, including mandatory minimum levels of recycled content for industrial, SLI (standard, light, and ignition) batteries, and EV batteries. Battery material sourcing documentation is going to be a critical part of the process.</p>\n\n\n\n<p>Apple’s longstanding push to use more environmentally-friendly materials in its products and packaging makes me think that it will laud these particular initiatives. In fact, Apple will probably meet them ahead of time. But there’s one part of the new regulations that Apple, and indeed much of the rest of the phone and tablet industry, is likely to fight: Article 11.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/2023-04-16_13-02-41.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Galaxy S23 Ultra und iPhone 14 Pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/2023-04-16_13-02-41.jpg?quality=50&amp;strip=all 1280w, https://b2c-contenthub.com/wp-content/uploads/2023/04/2023-04-16_13-02-41.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/2023-04-16_13-02-41.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/2023-04-16_13-02-41.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/2023-04-16_13-02-41.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/04/2023-04-16_13-02-41.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>The phones we buy might soon need to have removable batteries.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Removability and replaceability of portable batteries</h2>\n\n\n\n<p>Article 11 concerns the “Removability and replaceability of portable batteries and LMT batteries.”  LMT is “light and medium transport” batteries, defined as weighing less than 25kg and are made specifically for smaller vehicles like scooters, electric skateboards, ATVs, and so on…not Apple’s concern. </p>\n\n\n\n<p>But the regulations define “portable batteries” as “a battery that is sealed, weighs 5 kg or less, is not designed specifically for industrial use and is neither an electric vehicle battery, an LMT battery, nor an SLI battery.” In other words, <em>nearly</em> <em>everything Apple makes</em>. That’s iPhones, iPads, MacBooks, Apple Watch, even Apple Vision Pro.</p>\n\n\n\n<p>These are the most important passages:</p>\n\n\n\n<blockquote>\n<p>Any natural or legal person that places on the market products incorporating portable batteries shall ensure that those batteries are readily removable and replaceable by the end-user at any time during the lifetime of the product. …</p>\n\n\n\n<p>A portable battery shall be considered readily removable by the end-user where it can be removed from a product with the use of commercially available tools, without requiring the use of specialized tools, unless provided free of charge with the product, proprietary tools, thermal energy, or solvents to disassemble the product.</p>\n</blockquote>\n\n\n\n<p>On its face, it says that by 2027 Apple has to make iPhones, iPads, and MacBooks such that you can buy a battery and replace it yourself without any obscure screwdrivers, heat guns, or other stuff. Further regulations state that it has to provide documentation and safety information telling users how to do it.</p>\n\n\n\n<p>There are some exemptions for certain classes of medical devices, but they don’t apply to anything Apple makes. It’s unclear whether <a href=\"https://www.macworld.com/article/1961088/self-service-repair-program-iphone-14-m2-macbook-air-pro.html\">Apple’s Self Service Repair program</a> will satisfy the EU’s rules, but it’s doubtful since specialized tools and thermal energy are required, and Apple says people should be “experienced with the complexities of repairing electronic devices.” That doesn’t sound like what the EU is proposing.</p>\n\n\n\n<h2>What will Apple do?</h2>\n\n\n\n<p>Apple, along with many of the other popular phone and tablet makers, are likely to fight the regulations in court. Don’t be surprised if the 2027 date gets pushed back as the legal battles rage.</p>\n\n\n\n<p>It’s possible that the industry will push for a compromise that allows users to have their batteries replaced by the manufacturer at no additional cost, arguing that it satisfies the goal of boosting battery reclamation and extending the life of electronics. </p>\n\n\n\n<p>If not, it’s going to mean a huge shift in the way phones and tablets are designed. There was a time when popular Android phones had removable batteries, but even companies like Samsung that once touted such features as an advantage have since moved away from it. Building a phone that can be opened up relatively easily requires the use of gaskets and connectors and such that makes phones thicker, less durable, and harder to waterproof or dustproof. </p>\n\n\n\n<p>The market has spoken, and consumers time and again did not prioritize removable batteries in their buying decisions.</p>\n\n\n<div><figure><img src=\"https://images.techadvisor.com/cmsdata/features/3810738/self_service_repair.jpg?quality=50&amp;strip=all\" alt=\"Apple Self Service Repair\" loading=\"lazy\" /><figcaption><p>Apple recently launched a self-service repair program for iPhones and Macs, but it may need to go even further.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Apple has never made removable batteries for iPhones or iPads, so conforming to the regulations while maintaining the product’s trademark rigidness and toughness would prove a huge challenge. </p>\n\n\n\n<p>Some MacBooks had removable batteries until as late as 2012. You had to remove a bunch of screws to pop off the bottom of the laptop, but it was a relatively simple thing that would satisfy the requirements of this regulation. It’s not hard to imagine that Apple could once again make laptops with removable batteries without much compromise–they aren’t waterproof, after all.</p>\n\n\n\n<p>The Apple Watch would likely be eligible for an exemption for “appliances specifically designed to operate primarily in an environment that is regularly subject to splashing water, water streams or water immersion, and that are intended to be washable or rinseable.” </p>\n\n\n\n<p>The Vision Pro design currently uses a separate battery pack. It’s unclear if that’s enough, or if said battery pack would need to allow users to open it up and replace the battery itself while keeping the shell and cable connections. Either way, it doesn’t seem like a huge hurdle for Apple.</p>\n\n\n\n<p>But for iPhones and iPads this is a major deal. Compliance will almost certainly mean a change in the thickness and weight of these devices and possibly compromises to their waterproofing. Many would say they like the idea of simply buying a battery for their three-year-old iPhone and swapping it out to regain lost battery life, but is it worth a thicker and heavier iPhone? Or one that won’t so effortlessly survive a drop in the deep end of the pool?</p>\n\n\n\n<p>The deadline is still four years away, and the regulations haven’t even been formally signed yet (though they are expected to). That’s plenty of time for Apple and other large players in the market to react, both with legal challenges and product design changes.</p>\n\n\n\n<p> </p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"05918f792db748329cbdcef2b0bf95d869f7a7c2a1285a6287a12f576a1936f9","category":"Apple"}