{"title":"Former Apple Lawyer Gene Levoff Avoids Prison After Insider Trading Conviction","link":"https://www.macrumors.com/2023/12/07/former-apple-lawyer-insider-trading-no-prison/","date":1701986004000,"content":"Former Apple director of corporate law Gene Levoff was today sentenced to a fine and four years of probation for insider trading, according to <em><a href=\"https://www.bloomberg.com/news/articles/2023-12-07/apple-s-ex-corporate-law-chief-avoids-prison-for-insider-trading\">Bloomberg</a></em>. Levoff was facing up to two years in prison, but he will avoid time behind bars.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/10/apple-logo-cash-feature.jpg\" width=\"1430\" height=\"805\" />\r<br />\nLevoff's role at Apple <a href=\"https://www.macrumors.com/2019/02/13/apples-gene-levoff-charged-insider-trading/\">was supposed to include</a> ensuring that Apple employees were compliant with the company's insider trading policies, including enforcement of \"blackout periods\" around Apple's earnings reports, but he ended up committing the crime he was meant to police.\r<br />\n\r<br />\nDue to his position, Levoff was given access to Apple's earnings results before they were made available to the public, and he used the information to buy Apple shares prior to better-than-expected results, and sell shares when there were weaker-than-expected earnings. Levoff earned around $277,000, and avoided losses of around $377,000 before he was fired by Apple in 2018.\r<br />\n\r<br />\nLevoff last June <a href=\"https://www.macrumors.com/2022/07/01/former-apple-lawyer-pleads-guilty-insider-trading/\">pleaded guilty</a> to six counts of securities fraud for insider trading, and his sentencing took place today. In addition to four years probation, Levoff will pay approximately $604,000.\r<br />\n\r<br />\nFederal prosecutors argued that Levoff should be sent to prison for insider trading to deter other corporate executives from committing a similar crime, but the judge overseeing the case said that he didn't feel it was necessary because Levoff lost his job and will no longer be able to practice law.<br />This article, \"<a href=\"https://www.macrumors.com/2023/12/07/former-apple-lawyer-insider-trading-no-prison/\">Former Apple Lawyer Gene Levoff Avoids Prison After Insider Trading Conviction</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/former-apple-lawyer-gene-levoff-avoids-prison-after-insider-trading-conviction.2413116/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0599db7e94e5af2bc3cd0ec864aa64732c57e1d5bccad03903e71227f66597b2","category":"Apple"}