{"title":"Egyptologists translate the oldest-known mummification manual","link":"https://arstechnica.com/?p=1747817","date":1615231225000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/mummy-manual-800x421.jpg\" alt=\"Battered ancient text against a white background.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/mummy-manual.jpg\" class=\"enlarge-link\" data-height=\"758\" data-width=\"1440\">Enlarge</a> (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://www.ku.dk/english/\">University of Copenhagen</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Egyptologists have recently translated the oldest-known mummification manual. Translating it required solving a literal puzzle; the medical text that includes the manual is currently in pieces, with half of what remains in the Louvre Museum in France and half at the University of Copenhagen in Denmark. A few sections are completely missing, but what’s left is a treatise on medicinal herbs and skin diseases, especially the ones that cause swelling. Surprisingly, one section of that text includes a short manual on embalming.</p>\n<p>For the text’s ancient audience, that combination might have made sense. The manual includes recipes for resins and unguents used to dry and preserve the body after death, along with explanations for how and when to use bandages of different shapes and materials. Those recipes probably used some of the same ingredients as ointments for living skin, because plants with antimicrobial compounds would have been useful for preventing both infection and decay.</p>\n<h2>New Kingdom embalming: More complicated than it used to be</h2>\n<p>The Papyrus Louvre-Carlsberg, as the ancient medical text is now called, is the oldest mummification manual known so far, and it’s one of just three that Egyptologists have ever found. Based on the style of the characters used to write the text, it probably dates to about 1450 BCE, which makes it more than 1,000 years older the other two known mummification texts. But the embalming compounds it describes are remarkably similar to the <a href=\"https://arstechnica.com/science/2018/08/ancient-egyptians-had-been-making-mummies-longer-than-anyone-thought/\">ones embalmers used 2,000 years earlier</a> in pre-Dynastic Egypt: a mixture of plant oil, an aromatic plant extract, a gum or sugar, and heated conifer resin.</p></div><p><a href=\"https://arstechnica.com/?p=1747817#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1747817&comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"05a81bd4a429548997d725c3a4a5ae889f6a7b0e9aa5a9fe8a384940cc740a70","category":"Tech"}