{"title":"Reducing nitrogen inputs mitigates Spartina invasion in the Yangtze estuary","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14580?af=R","date":1709702618000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/f11d5831-701e-4af7-928e-9f278870010f/jpe14580-toc-0001-m.png\" alt=\"Reducing nitrogen inputs mitigates Spartina invasion in the Yangtze estuary\" />\n<p>Our findings reveal that the reversal of nitrogen enrichment may shift ecosystems from being more susceptible to invasion toward successional recovery, offering a promising approach for facilitating native community recovery in the invaded ecosystems. These findings have important implications for restoring invaded ecosystems, especially as global environmental change escalates the extent and impact of invaders by exacerbating current invasions and facilitating new ones.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPlant invasions driven by global environmental changes (e.g. nutrient enrichment) increasingly threaten natural ecosystems. It is unclear whether reducing nitrogen (N) inputs helps to mitigate plant invasions in natural ecosystems.\n\nUsing ongoing, landscape-scale N reductions in the Yangtze River, we combined spatiotemporal surveys before and after reducing N inputs and manipulative experiments to explore how N reductions contributed to native community recovery in estuarine marshes degraded by plant invasions.\n\nWe found that native <i>Phragmites australis</i> patches gradually recovered in <i>Spartina alterniflora</i>-invaded marshes after reducing N inputs. The competitive advantage of <i>S. alterniflora</i> over <i>P. australis</i> decreased with N reduction, shifting the competitive outcomes away from <i>P. australis</i> exclusion to their coexistence.\n\n<i>Synthesis and applications</i>. Our findings reveal that the reversal of nitrogen enrichment may shift ecosystems from being more susceptible to invasion toward successional recovery, offering a promising approach for facilitating native community recovery in the invaded ecosystems. These findings have important implications for restoring invaded ecosystems, especially as global environmental change escalates the extent and impact of invaders by exacerbating current invasions and facilitating new ones.\n</p>","author":"Xiao Xu, \nSongshuo Li, \nYan Zhang, \nXi Zhang, \nQiang He, \nNian‐Feng Wan, \nHao Liu, \nHaiqiang Guo, \nJun Ma, \nQun Zhang, \nQing Wang, \nJihua Wu, \nBo Li, \nMing Nie","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"05ac1b12a87f974b27b23e755fcd56f51d2b25d022f35baba299e06487619c42","category":"Environment"}