{"title":"The Autofill Dark Pattern","link":"https://smashingmagazine.com/2021/10/autofill-dark-pattern/","date":1633946400000,"content":"<p>A newspaper sign-up form had fields for name, email, and password. So, I started typing on the name field, and the autofill suggested my profile. But there was something <em>funky</em>. The autocomplete suggestion included my mailing address. Needless to say, it was puzzling: the address was not a field in the form. Why was it even suggested?</p>\n<p>By the time this question started forming in my mind, my brain had already signaled my finger to click on the suggestion, and it was done. Next, I was taken to a second form page which requested additional information like address, phone, date of birth, and so on. And all those fields had been pre-populated by the autofill functionality, too.</p>\n<p>I sighed in relief. It was a “multi-stepped” form and not a trick by the website. It was a reputable newspaper, after all. I deleted all the optional information from the second page, completed the sign-up, and moved on.</p>\n<p>That (troubled) interaction highlighted one of the <strong>risks of using autocompletion features</strong>.</p>\nAutocomplete And Autofill\n<p>They may sound similar, but <strong><code>autocomplete</code> and autofill are not the same thing</strong>. Although they <em>are</em> closely related:</p>\n<ul>\n<li>Autofill is a browser feature that allows people to save information (on the browser or the OS) and use it on web forms.</li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Attributes/autocomplete\"><code>autocomplete</code> is an HTML attribute</a> that provides guidelines to the browser on how to (or not to) autofill in fields in a web form.</li>\n</ul>\n<p>We could say that autofill is the “what,” while autocomplete the “how”, i.e. <code>autofill</code> stores data and tries to match it in a web form (based on the fields’ <code>name</code>, <code>type</code>, or <code>id</code>), and <code>autocomplete</code> guides the browser on how to do it (what information is expected in each field).</p>\n<p>Autocomplete is a powerful feature with many options that allows specifying <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Attributes/autocomplete#values\">many different types of values</a>:</p>\n<ul>\n<li><strong>Personal</strong>: Name, address, phone, date of birth;</li>\n<li><strong>Financial</strong>: credit card number, name, expiration date;</li>\n<li><strong>Demographics</strong>: location, age, sex, language;</li>\n<li><strong>Professional</strong>: company and job title.</li>\n</ul>\n<p>Autofill is a widespread feature either by choice or by accident: who hasn’t accepted to let the browser save/use web form information, either on purpose or by mistake? And that could be a problem — <a href=\"https://www.netsparker.com/blog/web-security/impact-autocomplete-feature-web-security/\">especially combined with bad use of <code>autocomplete</code></a> (and the added outrageous number of phishing emails and SMS messages nowadays.)</p>\nPrivacy Risks\n<p>Both of these features present (at least) two main risks for the user, both related to their personal data and its privacy:</p>\n<ol>\n<li><strong>Non-visible fields are populated</strong> (this is not the same as fields with a hidden type);</li>\n<li><strong>Autocompleted information can be read via JavaScript</strong> even before the user submits the form.</li>\n</ol>\n<p>This means that <strong>once a user selects to autofill the information, all the fields will be available for the developer to read</strong>. Again, independently of the user submitting the form or not, without the user knowing what fields were actually populated.</p>\n<p>This last part is relative: knowing what fields are populated will depend on the browser. Safari and Firefox do a good job at this (as we’ll soon see below). On the other hand, Chrome, the most popular browser at the moment, offers a bad experience that may trick even the most knowledgeable users into sharing their personal information.</p>\n<p>If we also consider the times in which the user accidentally chooses to populate the fields, this issue becomes more relevant. Let’s check it in more detail with an example.</p>\nA Little Experiment\n<p>I ran a little experiment creating a form with many fields and attaching the <code>autocomplete</code> attribute with different values. Then, I played a little with the form’s structure:</p>\n<ul>\n<li>I hid most of the fields by putting them in a container offscreen (instead of using <code>hidden</code> or <code>type=\"hidden\"</code>);</li>\n<li>I removed the visually hidden fields from the tab order (so keyboard users would overlook the hidden fields);</li>\n<li>I tried sorting the fields in a different order (and to my surprise, this impacted the autofill!).</li>\n</ul>\n<p>In the end, the code for the form looked like this:</p>\n<div>\n <pre><code>&lt;form method=\"post\" action=\"javascript:alertData()\"&gt;\n  &lt;label for=\"name\"&gt;Full name&lt;/label&gt;&lt;input id=\"name\" name=\"name\" autocomplete=\"name\" /&gt;&lt;br/&gt;\n  &lt;label for=\"email\"&gt;Email&lt;/label&gt;&lt;input id=\"email\" name=\"email\"/&gt;&lt;br/&gt;\n  &lt;label for=\"postal-code\"&gt;ZIP&lt;/label&gt;&lt;input id=\"postal-code\" name=\"postal-code\" autocomplete=\"postal-code\"/&gt;\n  &lt;div style=\"position:absolute;top:-10000in\" class=\"hide-this\"&gt;\n    &lt;!-- Hidden --&gt;\n    &lt;label for=\"firstname\"&gt;First name&lt;/label&gt;&lt;input tabindex=\"-1\" type=\"hidden\" id=\"firstname\" name=\"firstname\" autocomplete=\"given-name\" /&gt;&lt;br/&gt;\n    &lt;label for=\"lastname\"&gt;Last name&lt;/label&gt;&lt;input tabindex=\"-1\"  id=\"lastname\" name=\"lastname\" autocomplete=\"family-name\" /&gt;&lt;br/&gt;\n\n    &lt;label for=\"honorific-prefix\"&gt;honorific-prefix&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"honorific-prefix\" name=\"honorific-prefix\" autocomplete=\"honorific-prefix\"/&gt;&lt;br/&gt;\n    &lt;label for=\"organization\"&gt;Organization&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"organization\" name=\"organization\" /&gt;&lt;br/&gt;\n    &lt;label for=\"phone\"&gt;Phone&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"phone\" name=\"phone\" autocomplete=\"tel\" /&gt;&lt;br/&gt;\n\n    &lt;label for=\"address\"&gt;address&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"address\" name=\"address\" autocomplete=\"street-address\" /&gt;&lt;br/&gt;\n    &lt;label for=\"city\"&gt;City&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"city\" name=\"city\" autocomplete=\"address-level2\" /&gt;&lt;br/&gt;\n    &lt;label for=\"state\"&gt;State&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"state\" name=\"state\" autocomplete=\"address-level1\" /&gt;&lt;br/&gt;\n    &lt;label for=\"level3\"&gt;Level3&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"level3\" name=\"state\" autocomplete=\"address-level3\" /&gt;&lt;br/&gt;\n    &lt;label for=\"level4\"&gt;Level4&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"level4\" name=\"state\" autocomplete=\"address-level4\" /&gt;&lt;br/&gt;\n    &lt;label for=\"country\"&gt;Country&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"country\" name=\"country\" autocomplete=\"country\" /&gt;&lt;br/&gt;\n\n    &lt;label for=\"birthday\"&gt;Birthday&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"birthday\" name=\"birthday\" autocomplete=\"bday\" /&gt;&lt;br/&gt;\n    &lt;label for=\"language\"&gt;Language&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"language\" name=\"language\" autocomplete=\"language\" /&gt;&lt;br/&gt;\n    &lt;label for=\"sex\"&gt;Sex&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"sex\" name=\"sex\" autocomplete=\"sex\" /&gt;&lt;br/&gt;\n    &lt;label for=\"url\"&gt;URL&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"url\" name=\"url\" autocomplete=\"url\" /&gt;&lt;br/&gt;\n    &lt;label for=\"photo\"&gt;Photo&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"photo\" name=\"photo\" autocomplete=\"photo\" /&gt;&lt;br/&gt;\n    &lt;label for=\"impp\"&gt;IMPP&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"impp\" name=\"impp\" autocomplete=\"impp\" /&gt;&lt;br/&gt;\n\n    &lt;label for=\"username\"&gt;Username&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"username\" name=\"username\" autocomplete=\"username\" /&gt;&lt;br/&gt;\n    &lt;label for=\"password\"&gt;Password&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"password\" name=\"password\" autocomplete=\"password\" /&gt;&lt;br/&gt;\n    &lt;label for=\"new-password\"&gt;Password New&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"new-password\" name=\"new-password\" autocomplete=\"new-password\" /&gt;&lt;br/&gt;\n    &lt;label for=\"current-password\"&gt;Password Current&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"current-password\" name=\"current-password\" autocomplete=\"current-password\" /&gt;&lt;br/&gt;\n\n    &lt;label for=\"cc\"&gt;CC#&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"cc\" name=\"cc\" autocomplete=\"cc-number\" /&gt;&lt;br/&gt;\n    &lt;label for=\"cc-name\"&gt;CC Name&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"cc-name\" name=\"cc-name\" autocomplete=\"cc-name\" /&gt;&lt;br/&gt;\n    &lt;label for=\"cc-expiration\"&gt;CC expiration&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"cc-expiration\" name=\"cc-expiration\" autocomplete=\"cc-expiration\" /&gt;&lt;br/&gt;\n    &lt;label for=\"cc-zipcode\"&gt;CC Zipcode&lt;/label&gt;&lt;input tabindex=\"-1\" id=\"cc-zipcode\" name=\"cc-zipcode\" autocomplete=\"cc-postalcode\" /&gt;&lt;br/&gt;\n  &lt;/div&gt;\n  &lt;button&gt;Submit&lt;/button&gt;\n&lt;/form&gt;</code></pre>\n</div>\n\n<p><strong>Note:</strong> <em>I created this demo a while back, and <a href=\"https://html.spec.whatwg.org/multipage/form-control-infrastructure.html#autofill\">the standard is a living document</a>. Since then, some of the autocomplete names have changed. For example, now we can specify <code>new-password</code> and <code>current-password</code> or more details for address or credit card that were not available before.</em></p>\n<p>That form had three visible fields (<code>name</code>, <code>email</code> and <code>zipcode</code>). While that form is common among insurance companies, cable, and other service providers, it may not be too widespread, so I reduced the form even more with a single email field. We see that everywhere to sign up to websites, newsletters, or updates. You can see a running demo <a href=\"https://jsfiddle.net/alvaromontoro/n2rp1zfe/\">here</a>:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b2e514e4-9973-49b3-a168-ea0f031d6605/1-autofill-dark-pattern.jpeg\" /></p>\n<p>A good thing: it displays all the data that will be shared as part of the form. Not only the data for the visible fields but all of them. At this point, the user may suspect something is not quite alright. There’s something fishy.</p>\n<p>When I reduced the form to just the email field, Safari did something interesting. The autofill popup was different:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d491940e-35d6-4b1f-b15a-fdfc8777d307/2-autofill-dark-pattern.jpeg\" /></p>\n<p>It states that it will only share the email (and it only does share that piece of information). But the contact info below may be trickier. When we click on that button, the browser shows a summary of the profile with its shared data. But that is not clearly stated anywhere. It simply looks like a regular contact card with some “share/do not share” options. After clicking on the “Autofill” button, the form is populated with all the data. Not only the email:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3a82f024-91e7-4f3d-bea1-b938b8951059/3-autofill-dark-pattern.png\" /></p>\n<p>So there is a way for a user to share information with the form inadvertently. It’s tricky but not too far-fetched considering that it is the one “highlighted” with an icon out of the two possible options.</p>\n<p>Funny thing, browsers separate the personal data from the credit card data, but Safari populated part of the credit card information based on the personal data (name and ZIP.)</p>\n<h3>Firefox</h3>\n<p>Using the autofill in Firefox is a bit more complex. It is not automatic like in Chrome, and there’s no icon like in Safari. Users will have to start typing or click a second time to see the autofill popup, which will have a note with every category that the browser will fill in, not only the visible fields:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e0669d8d-d5f8-4bc2-982c-052c4ee06fce/4-autofill-dark-pattern.jpeg\" /></p>\n<p>Testing with the email-only form, Firefox presented the same autofill popup stating which fields categories it would populate. No difference whatsoever.</p>\n<p>And similarly to the other browsers, after the autofill ran, we could read all the values with JavaScript.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5d3a2b3a-f5a9-428e-b867-391dd9930b7f/5-autofill-dark-pattern.png\" /></p>\n<p>Firefox was the best of the three: it clearly stated what information would be shared with the form independently of the fields or their order. And it <em>hid</em> the autofill functionality a second user interaction happened.</p>\n<p>A keyboard user could select the autofill without realizing, by getting inside the popup bubble and pressing the tab key.</p>\n<h3>Chrome</h3>\n<p>Then it came the turn for Chrome. (Here I use “Chrome,” but the results were similar for several Chromium-based browsers tested.) I clicked on the field and, without any further interaction, the autofill popup showed. While Firefox and Safari had many things in common, Chrome is entirely different: it only shows two values, and both are visible.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/07f5c223-b555-4ad5-8337-079c348b39f2/6-autofill-dark-pattern.png\" /></p>\n<p>This display was by design. I picked the order of the fields on purpose to get that particular combination of visible controls and autocomplete suggestions. However, it looks like Chrome gives some autocomplete properties more “weight” for the second value. And that makes the popup change depending on the order of the fields in the form.</p>\n<p>Testing with the second version of the form was not much better:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a9328c4b-234d-4e10-9703-89f51537e0c1/7-autofill-dark-pattern.png\" /></p>\n<p>While the popup shows a field that is not visible (the name), it is unclear what the purpose of the name is on the popup. An experienced user may know this happens because the name is shared, but an average user (and even the experienced ones) may think the email is associated with the profile with that name. There is zero indication of the data that the browser will share with the form.</p>\n<p>And as soon as the user clicks on the autofill button, the data is available for the developer to read with JavaScript:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/54fc0bba-541a-474a-b079-3319e1539b54/8-autofill-dark-pattern.jpeg\" /></p>\n<p>Chrome was the worst offender: it shared the information automatically, it was unclear what data was involved, and the autofill suggestions changed based on the controls’ order and attributes.</p>\n<p>The first two issues are common to all/many browsers, to the point that it may even be considered a feature. However, the third issue is exclusive to Chromium browsers, and it facilitates a sketchy dark pattern.</p>\n<p>This behavior would be more of an anecdote and not a problem if it wasn’t because <a href=\"https://gs.statcounter.com/browser-market-share/desktop/worldwide\">Chrome takes a considerable market share</a> of the browsers online (includes Chrome and Chromium-based).</p>\nThe Dark Pattern\n<p>As you probably know, a <em>dark pattern</em> is a deceptive UX pattern that tricks users into doing things they may not really want to do.</p>\n<blockquote>“When you use websites and apps, you don’t read every word on every page — you skim read and make assumptions. If a company wants to trick you into doing something, they can take advantage of this by making a page look like it is saying one thing when it is in fact saying another.”<br /><br />— Harry Brignull, <a href=\"https://www.darkpatterns.org/\">darkpatterns.org</a></blockquote>\n\n<p>The behavior described in the previous points is clearly a deceptive user experience. Non-experienced users will not realize that they are <strong>sharing their personal data</strong>. Even more tech-savvy people may get tricked by it as Chrome makes it look like the selected option belongs to a profile instead of clearly stating what information is being shared.</p>\n<p>The browser implementations cause this behavior, but it requires the developer to set it in place to exploit it. Unfortunately, there already are companies willing to exploit it, selling it as a feature to get leads.</p>\n<p>As long as a dark pattern goes, it may also be an illegal one. This is because it breaks many principles relating to the processing of personal data specified in article 5 of the European <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:02016R0679-20160504&amp;from=EN#tocId9\">General Data Protection Regulation</a> (GDPR):</p>\n<ul>\n<li><strong>Lawfulness, fairness, and transparency</strong><br />The process is all but transparent.</li>\n<li><strong>Purpose limitation</strong><br />The data is processed in a way incompatible with the initial purpose.</li>\n<li><strong>Data minimization</strong><br />It is quite the opposite. Data maximization: get as much information as possible.</li>\n</ul>\n<p>For example, if you want to sign up for a newsletter or request information about a product, and you provide your email, the website has no legal right to get your name, address, date of birth, phone number, or anything else without your consent or knowledge. Even if you considered that the user gave permission when clicking on the autofill, the purpose of the obtained data does not match the original intent of the form.</p>\nPossible Solutions\n<p>To avoid the problem, all actors need to contribute and help fix the issue:</p>\n<ol>\n<li><a href=\"https://www.smashingmagazine.com/2021/10/autofill-dark-pattern/#1-users\">Users</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2021/10/autofill-dark-pattern/#2-developers-and-designers\">Developers and designers</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2021/10/autofill-dark-pattern/#3-browsers\">Browsers</a></li>\n</ol>\n<h3>1. Users</h3>\n<p>The only thing on the user side would be to <strong>ensure that the data displayed in the autofill popup is correct</strong>.</p>\n<p>But we need to remember that the user is the victim here. We could <em>blame</em> them for not paying enough attention when clicking on the autofill, but that would be unfair. Plus, there are many reasons why a person could click on the button by mistake and share their data by accident. So even well-intentioned and savvy users may fall for it.</p>\n<h3>2. Developers And Designers</h3>\n<p>Let’s be honest. While the developers are not the root cause of the problem, they play a key role in exploiting the dark pattern. Either accidentally or with malicious intent.</p>\n<p>And let’s <strong>be responsible and honest</strong> (this time in a literal way), because that’s the thing that developers and designers can do to build trust and make good use of the autofill and autocomplete features:</p>\n<ul>\n<li>Only auto-complete the data that you need.</li>\n<li>State clearly which data will be collected.</li>\n<li>Do not hide form fields that will be later submitted.</li>\n<li>Do not mislead or trick users into sending more data.</li>\n</ul>\n<p>As an extreme measure, maybe try to avoid autocompleting certain fields. But, of course, this brings other issues as it will make the form less usable and accessible. So finding a balance may be tricky.</p>\n<p>All this is without considering the possibility of an XSS vulnerability that could exploit the dark pattern. Of course, that would be a completely different story and an even more significant problem.</p>\n<h3>3. Browsers</h3>\n<p>Much of the work would need to be done from the browser side (especially on the Chromium side). But let me start by stating that not all is bad with how web browsers handle autofill/autocomplete. Many things are good. For example:</p>\n<ul>\n<li><strong>They limit the data that can be shared</strong><br />Browsers have a list of fields for auto-complete that may not include all the values described in the HTML standard.</li>\n<li><strong>They encapsulate and group data</strong><br />Browsers separate personal and financial information to protect critical values like credit cards. Safari had some issues with this, but it was minor.</li>\n<li><strong>They warn about the data that will be shared</strong><br />Sometimes this may be incomplete (Chrome) or not clear (Safari), but they do alert the user.</li>\n</ul>\n<p>Still, some things can be improved by many or all of the web browsers.</p>\n<h4>Show All Fields That Will Be Autocompleted</h4>\n<p>Browsers should always show a list of all the fields that will be autocompleted within the autofill popup (instead of just a partial list.) Also, the information should be clearly identified as data to be shared instead of being displayed as a regular contact card that could be misleading.</p>\n<p>Firefox did an excellent job at this point, Safari did a nice job in general, and Chrome was subpar compared to the other two.</p>\n<h4>Do Not Trigger The <code>onChange</code> Event On Autofill</h4>\n<p>This would be a problematic request because this behavior is part of the <a href=\"https://html.spec.whatwg.org/multipage/form-control-infrastructure.html#autofill-processing-model\">Autofill definition in the HTML standard</a>:</p>\n<blockquote>“The autocompletion mechanism must be implemented by the user agent acting as if the user had modified the control’s data [...].”</blockquote>\n\n<p>This means that browsers should treat the autocompleted data as if it had been entered by the user, thus triggering all the events, showing the values, etc. Even on a non-visually available field.</p>\n<p>Preventing this behavior on non-visible elements could solve the problem. But validating if a form control is visible or not could be costly for the browser. Also, this solution is only partial because developers could still read the values even without the inputs triggering events.</p>\n<h4>Do Not Allow Devs To Read Autocompleted Fields Before Submission</h4>\n<p>This would also be problematic because many developers often rely on reading the field values before submission to validate the values (e.g., when the user moves away from the inputs.) But it would make sense: the user doesn’t want to share the information until they submit the form, so the browser shouldn’t either.</p>\n<p>An alternative to this would be providing fake data when reading autocompleted values. <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/Privacy_and_the_:visited_selector\">Web browsers already do something like this with visited links</a>, why not do the same with autocompleted form fields? Provide gibberish as the name, a valid address that matches local authorities instead of the user’s address, a fake phone number? This could solve the developer validation needs while protecting the user’s personal information.</p>\n<p>Displaying a complete list of the fields/values that the browser will clearly share with the form would be a great step forward. The other two are ideal but more of stretch goals. Still, they are initiatives that would considerably improve privacy.</p>\n<p>Would the autofill dark pattern still be possible to exploit? Unfortunately, yes. But it would be a lot more complicated. And at this point, it would be the user’s responsibility and the developer’s duty to avoid such a situation.</p>\nConclusion\n<p>We can argue that autocomplete is not a huge security issue (not even on Chrome) because it requires <strong>user interaction</strong> to select the information. However, we could also argue that the potential loss of data justifies proper action. And Chrome has done more changes for (relatively) less important security/usability concerns (<a href=\"https://www.theregister.com/2021/08/05/google_chrome_iframe/\">see <code>alert()</code>, <code>prompt()</code>, and <code>confirm()</code></a> than what could be done to protect key personal information.</p>\n<p>Then we have the issue of the dark pattern. It can be avoided if everyone does their part:</p>\n<ul>\n<li>Users should be careful with what forms/data they autofill;</li>\n<li>Developers should avoid exploiting that data;</li>\n<li>Browsers should do a better job at protecting people’s data.</li>\n</ul>\n<p>At the root, <strong>this dark pattern is a browser issue</strong> (and mainly a Chrome issue), and not a small one (privacy should be key online). But there is a choice. In the end, exploiting the dark pattern or not is up to the developers. So let’s pick wisely and do the right thing.</p>\n<h3>Further Reading On Smashing Magazine</h3>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2017/05/better-form-design-one-thing-per-page/\">Better Form Design: One Thing Per Page (Case Study)</a>, Adam Silver</li>\n<li><a href=\"https://www.smashingmagazine.com/2019/04/privacy-concerns-ux-web-forms/\">Common Concerns And Privacy In Web Forms</a>, Vitaly Friedman</li>\n<li><a href=\"https://www.smashingmagazine.com/2021/09/simplifying-form-styles-accent-color/\">Simplifying Form Styles With <code>accent-color</code></a>, Michelle Barker</li>\n<li><a href=\"https://www.smashingmagazine.com/2019/01/html5-input-types/\">HTML5 Input Types: Where Are They Now?</a>, Drew McLellan</li>\n<li><a href=\"https://www.smashingmagazine.com/2020/08/forms-validation-ionic-react/\">Forms And Validation In Ionic React</a>, Jerry Navi</li>\n<li><a href=\"https://www.smashingmagazine.com/2018/08/best-practices-for-mobile-form-design/\">Best Practices For Mobile Form Design</a>, Nick Babich</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"05adc651c4690c9c4a9f3df715fe49cda951cad51795637fbd6e8f30f270b199","category":"Tech"}