{"title":"Possibility of Total Cholesterol/High-Density Lipoprotein Ratio as a Prognostic Indicator through Correlation Analysis with Hyperlipidemia Related Diseases in Dogs","link":"https://www.preprints.org/manuscript/202408.1908/v1","date":1724746858000,"content":"In veterinary medicine, the significance of High-Density Lipoprotein (HDL) measurements is not well-documented than it is in humans. The HDL level can be measured in dogs, and through referring to the normal range, it is possible to find out what this means for various endocrine diseases and hyperlipidemia diseases. Aim of this study is to measure the HDL levels in dogs with various conditions and to evaluate whether the Total Cholesterol (TC), HDL ratio is effective as a prognostic indicator in various hyperlipidemia and endocrine diseases. Through prospective clinical trial, sixteen client-owned dogs and cats visiting a local private practice were divided into three groups; five dogs without hyperlipidemia or metabolic disease (Group 1); eight animals with Cushing's, hypothyroidism, and gallbladder sludge (Group 2) and three diabetics, urinary disorders, and healthy cats (Group 3).\nIn two dogs, the TC/HDL values were between 2 and 3; in two dogs, the values were between 3 and 4; in two dogs, the values were between 4 and 5. In three dogs, the TC/HDL values were between 5 and 6 and in three dogs, the ratio values were between 6 and 7. The other value was higher than 8. Except two dogs which showed lower value than 3, all dogs had concurrent endocrine disease including Cushing’s disease, hypothyroidism, gall bladder mucocele, hyperlipidemia. There was a difference in each group in terms of the TC/HDL value compared to the group with underlying disease. This means that TC/HDL values can be an excellent indicator of endocrine disease in dogs as well. In cats, although this is a very small sample, a high TC/HDL value of 9 points are shown in the cat which had diabetes mellitus. However, for more statistically significant results, a larger sample group for further investigation is needed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"05b877850a324dbe452cc7eccca9c206675dc22c3e471410b6469297faae38c2","category":"Interdisciplinary"}