{"title":"Use of otolith microchemistry to determine natal origin for Silver Carp Hypophthalmichthys molitrix in the lower Mississippi River basin","link":"http://link.springer.com/10.1007/s10530-024-03358-7","date":1725148800000,"content":"<h3>Abstract</h3>\n                    <p>Silver Carp (<em>Hypophthalmichthys molitrix</em>) populations have established and expanded throughout the lower Mississippi River basin (LMRB). Information pertaining to Silver Carp population mixing among rivers within the LMRB is lacking. Documented relations between Silver Carp otolith and river water barium (Ba) and strontium (Sr) microchemical signatures may enable estimation of origins of Silver Carp in the LMRB. Replicate water samples and otoliths from 308 Silver Carp were collected from the Cache, Arkansas, White, Yazoo, St. Francis, L’Anguille, and Mississippi rivers, and Merrisach Lake (situated along a canal connecting the lower reaches of the Arkansas and White rivers) within the LMRB. Water and carp otolith microchemical signatures exhibited consistent differences among water bodies. A classification and regression tree model exhibited 80% accuracy when assigning carp collected from the White, Arkansas, and Mississippi rivers based on fish-water microchemical signatures. Model accuracy decreased as smaller rivers were incorporated into models. Predicted natal origin based on otolith microchemical signatures suggested the White River (43%) and the lower Mississippi River (39%) were the likely origins for ~ 82% of the Silver Carp sampled. Despite the prevalence of adult Silver Carp within the Arkansas River system, fewer (18%) appeared to have originated there compared to the White and Mississippi rivers. Long-term water sampling and additional isotopic measurements may refine analyses to better determine the relative contributions of Silver Carp from the smaller river systems. Population mixing of Silver Carp among tributary rivers appears to be common within the LMRB, and removal efforts may benefit from evaluating the magnitude of fish movement and connectivity among rivers.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"05d1bd97a81cc4596150eb081bcb6509c1ef05b8a69ec98a54e6b6421edb4aaf","category":"Environment"}