{"title":"Report: NASA’s only realistic path for humans on Mars is nuclear propulsion","link":"https://arstechnica.com/?p=1741878","date":1613163419000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/9255078_orig-800x624.jpg\" alt=\"NASA originally studied nuclear thermal propulsion in the 1960s. Here is concept art for the Nuclear Energy for Rocket Vehicle Applications (NERVA) program.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/9255078_orig.jpg\" class=\"enlarge-link\" data-height=\"799\" data-width=\"1024\">Enlarge</a> <span class=\"sep\">/</span> NASA originally studied nuclear thermal propulsion in the 1960s. Here is concept art for the Nuclear Energy for Rocket Vehicle Applications (NERVA) program. (credit: NASA)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Getting humans to Mars and back is rather hard. Insanely difficult, in fact. Many challenges confront NASA and other would-be Mars pioneers when planning missions to the red planet, but chief among them is the amount of propellant needed.</p>\n<p>During the Apollo program 50 years ago, humans went to the Moon using chemical propulsion, which is to say rocket engines that burned liquid oxygen and hydrogen in a combustion chamber. This has its advantages, such as giving NASA the ability to start and stop an engine quickly, and the technology was then the most mature one for space travel. Since then, a few new in-space propulsion techniques have been devised. But none are better or faster for humans than chemical propulsion.</p>\n<p>That's a problem. NASA has a couple of baseline missions for sending four or more astronauts to Mars, but relying on chemical propulsion to venture beyond the Moon probably won't cut it. The main reason is that it takes a whole lot of rocket fuel to send supplies and astronauts to Mars. Even in favorable scenarios where Earth and Mars line up every 26 months, a humans-to-Mars mission still requires 1,000 to 4,000 metric tons of propellant.</p></div><p><a href=\"https://arstechnica.com/?p=1741878#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1741878&comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"05d2cc1908acedf36a5345ae3735940e5d0dd6add9dec08fecf144deb9892840","category":"Tech"}