{"title":"Wireless TVs use built-in cameras, NFC readers to sell you stuff you see on TV","link":"https://arstechnica.com/?p=1991954","date":1703108463000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Displace-800x533.jpg\" alt=\"webcam protruding out of the Displace TV\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Displace-scaled.jpg\">Enlarge</a> <span>/</span> A closeup of the webcam on the Displace TV announced in January.  (credit: Dislace)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It's no secret that TV makers are seriously invested in pushing ads. Using TVs for advertising goes back to <a href=\"https://www.guinnessworldrecords.com/world-records/first-tv-advert\">1941</a> when the first TV commercial aired. But as we trudge our way through the 21st century, TV vendors are becoming more involved in ensuring that their hardware is used to sell stuff and add to their own recurring revenue.</p>\n<p>This has taken various forms, but in some cases, we're seeing increasingly invasive strategies for turning TVs into a primary place for shopping. The latest approach catching attention comes from the startup Displace. Its upcoming TVs will use integrated webcams and NFC payment readers to make it easy for people to buy stuff they see on TV.</p>\n<p>Displace hasn't officially released a product yet, so skepticism about the TVs it says it will demo at CES 2024 in Las Vegas next month, as spotted by sites like <a href=\"https://wifihifi.com/ces-2024-displace-tv-flex-mini-shopping/\">Wifi Hifi</a>, is warranted. (Displace said it would have images of the newly announced TVs to share next year). The startup specializes in wireless TVs with hot-swappable batteries that can <a href=\"https://arstechnica.com/gadgets/2023/10/zip-lining-wireless-tv-lands-on-self-deployed-foam-if-vacuum-suction-mount-fails/\">vacuum suction-mount to a wall and zip-line</a> slowly off said wall when sensing an unstable connection or low battery. The original \"Displace TV\" that Displace announced in January is supposed to ship in mid-2024. Displace has been taking <a href=\"https://displace.tv/products/displace-tv-reserve-your-spot\">preorders</a> for those.</p></div><p><a href=\"https://arstechnica.com/?p=1991954#p3\">Read 29 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1991954&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"05df66a33e073cedb33cfea299679a5b1b06dcd64a80a7244e0f7c278945eee9","category":"Tech"}