{"title":"285 The effect of repeated lipopolysaccharide endotoxin challenge on immune response of breeding ewes","link":"https://academic.oup.com/jas/article/102/Supplement_3/429/7757027?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Infectious disease caused by exposure to the gram-negative bacterial endotoxin lipopolysaccharide (LPS) is recognized to suppress female fertility. However, the effect of varying low dose endotoxin exposure during the distinct stages of follicle development on immune response, and reproductive and lamb performance has yet to be elucidated. Therefore, the objective of this study was to evaluate acute phase response, mRNA abundance of inflammatory markers, reproductive performance and lamb growth characteristics of ewes challenged with subclinical doses of LPS. Rambouillet ewes [n = 36; body weight (BW) = 68.2 1.1 kg; age 3 to 7 yr] were stratified by BW and age and assigned to treatment groups. Ewes received subcutaneous injections of saline (CON, n = 12), 1.5 g/kg BW LPS (LOW, n = 12), or 3.0 g/kg BW LPS (HIGH, n = 12) on d 5, 10, and 15 of a synchronized follicular wave. Ewes were subsequently placed with a rattle-painted ram on d 16 for a 35-d breeding season. On treatment d 5 and 15, blood samples, peripheral blood leukocytes and rectal temperature were collected prior to and at regular intervals for 12 h after LPS challenge. Immune response to LPS was confirmed by an increase in rectal temperature and serum cortisol concentration on d 5 and 15. Endotoxin increased circulating plasma concentrations of the acute phase protein, haptoglobin, in both LPS-treated groups on d 5 and 15 at 12 h compared with control (<span>P</span> &lt; 0.05). Pro- and anti-inflammatory genes were evaluated by real time polymerase chain reaction and demonstrated no differences in gene expression for tumor necrosis factor a, superoxide dismutase 2, or peroxisome proliferator-activated receptor gamma among treatment groups. Toll-like receptor 4 was similar among treatment groups on d 5; however, ewes challenged with LPS on d 15 displayed greater expression of toll-like receptor 4 compared with controls 2 to 6 h after LPS (<span>P</span> &lt; 0.05). A robust induction of interleukin-8 was noted in low-LPS treated ewes compared with control and high-LPS treatment groups on d 5 from 2.5 to 6 h (<span>P</span> &lt; 0.05) and on d 15 at 2.5 h (<span>P</span> &lt; 0.05). First service conception rates were 80% for control ewes and 75% for both treated groups (<span>P</span> = 0.925). Lamb birth weight was reduced (<span>P</span> = 0.05) in response to LPS treatment. This reduction in birth weight resulted in reduced 60-d adjusted weaning weight (<span>P</span> = 0.09). Subacute endotoxin exposure aligning with key follicle and oocyte maturation events results in detrimental growth performance of the subsequent lamb.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"05e04414c2a90cb08a8f537e960e57e61861a0f203bc0b42166e31fb8880d4c4","category":"Environment"}