{"title":"Evaluating the Impact of Oil Refinery on Landscape Values Perception and Mental Health: A Case Study of Tehran","link":"https://www.preprints.org/manuscript/202407.1455/v1","date":1721311157000,"content":"Petrochemicals and oil refineries are industrial processes that use compounds and polymers derived directly or indirectly from natural gas or crude oil for chemical purposes. They have posed a number of short- and long-term risks to the environment and the people who live nearby. The study aims to determine how the presence of industrial areas, such as oil refineries, affects the local population's perception of their surroundings. The investigation centers on the Tehran Oil Refinery, a major refinery hub, and its perceived environmental impact. For this purpose, a Geographic Information System for Public Participation (PPGIS) covering three basic sections has been designed: socio-demographic information of the participants; self-perceived health; and landscape valuation before and after an intervention. The main observations show a complex interaction between industrial presence and the perception of landscape values. Participants' reactions to the manipulated Photographs reveal important details about the psychological impact of visual elements on emotional perception. There is also a direct relationship between the level of stress and emotional perception in the manipulated and original photos.This research adds to the larger debate about the effects of industrialization on the environment and society. It emphasizes the importance of considering public perception when planning and developing industrial projects. The goal is to strike a balance between industrial operational needs and environmental quality preservation, resulting in long-term urban growth.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"05e5263b13c3b3a42c276a3a656cf99dbddb8275d0e86093fb4c754414c73575","category":"Interdisciplinary"}