{"title":"Prospect of Hydroxyl Radical Exposure during Seawater Bathing to Treat Amoebic Gill Disease in Atlantic Salmon","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/5074580?af=R","date":1675497600000,"content":"<p>This study aims to undertake hydroxyl (<sup>\n   <b>.</b>\n</sup>OH) radical-based preliminary investigations with a view to utilising seawater as a viable alternative to freshwater for the treatment of amoebic gill disease (AGD) in aquaculture industries. The study presents <i>in vitro</i> viability studies of clonal amoebae species to examine the effects of <sup>\n   <b>.</b>\n</sup>OH radicals on both parasites and hosts. The study also assesses the toxicity to Chinook salmon cell lines (CHSE-214) in freshwater and 35 ppt seawater via continuous dosing of 35 mM <sup>\n   <b>.</b>\n</sup>OH radicals and hydrogen peroxide (H<sub>2</sub>O<sub>2</sub>) for 1.5 to 4 hr, separately at 18°C and 15°C. Comparatively high viability of CHSE-214 (60% in <sup>\n   <b>.</b>\n</sup>OH and 50% in H<sub>2</sub>O<sub>2</sub>) for a prolonged treatment of up to 4 hr in seawater at 15°C indicates suitability of low seawater temperature while using either <sup>\n   <b>.</b>\n</sup>OH or H<sub>2</sub>O<sub>2</sub> during bathing. The viability of CHSE-214 remained relatively stable in seawater (55%–60% in <sup>\n   <b>.</b>\n</sup>OH and 50%–60% in H<sub>2</sub>O<sub>2</sub>), at both temperatures of 18°C and 15°C. However, at 15°C, a drastic reduction of viability of CHSE-214 in freshwater (from 80% to 48% in <sup>\n   <b>.</b>\n</sup>OH and from 70% to 58% in H<sub>2</sub>O<sub>2</sub>) has indicated high variations in toxicity levels in freshwater at low temperature. Using DNA staining agents in flow cytometry, the <i>in vitro</i> viability study results in &gt;22.5% mortality of clonal <i>Neoparamoeba perurans</i> (NP), an AGD causative agent, in 35 ppt seawater containing 35 mM <sup>\n   <b>.</b>\n</sup>OH radicals via one-off dosing for 1 hour at 15°C. In addition, fast radical consumption is more pronounced in the case of <sup>\n   <b>.</b>\n</sup>OH radicals as compared to H<sub>2</sub>O<sub>2</sub> in both freshwater and seawater due to extreme reactivity of the former. Hence, this study suggests that <sup>\n   <b>.</b>\n</sup>OH radicals are detrimental to the viability of NP in seawater, and thereby, establishes grounds for further <i>in vivo</i> investigations of using seawater supplemented with continuous dosing of <sup>\n   <b>.</b>\n</sup>OH radicals for Atlantic salmon bathing as a treatment of AGD.</p>","author":"Parvez Mahbub, \nThomas Yeager, \nMahmoud Dawood","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"05f1e59e1328f22c8dda551a27a1871fe72331880540a9e8a2ecc70a16b1a57f","category":"Environment"}