{"title":"Hydrometeorology and geography affect hospitalizations for waterborne infectious diseases in the United States: A retrospective analysis","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000206","date":1723644000000,"content":"<p>by Victoria D. Lynch, Jeffrey Shaman</p>\r\n\r\nMeteorology, hydroclimatology, and drinking water infrastructure influence the transmission of waterborne infectious diseases in the United States, but their roles are not well-understood and may vary by pathogen type or geographic region. Waterborne pathogens can cause severe intestinal, respiratory, or systemic infections in vulnerable people. Identifying the mechanisms that underlie contamination events and disease transmission is particularly important given that climate change may lead to more extreme floods, droughts, and seasonal precipitation. The association of meteorological variables, drinking water source, geographic region, and location (rural/urban) with hospitalizations for 12 waterborne bacterial, parasitic, and viral infections was examined using 12 years of hospitalization data from 516 hospitals in 25 states. A multimodel inference approach was used to identify the most highly-weighted explanatory variables and these were included in a generalized linear mixed model (GLMM) framework. There was a 16% (95% CI: 8%-24%) decrease in hospitalizations for the bacterial pathogen group in urban compared to rural areas; for <i>Campylobacter</i>, specifically, there was a 31% (95% CI: 9%-53%) decrease in urban areas, a 27% (95% CI: 6%-48%) decrease associated with drinking water from surface water sources, and an 11% (95% CI: 4%-17%) increase with a 1-standard deviation (SD) increase in runoff. Parasitic hospitalizations increased 9% (95% CI: 4%-15%) with a 1-SD increase in precipitation, predominantly driven by <i>Cryptosporidium</i> hospitalizations. Legionnaires’ disease increased 124% (95% CI: 90%-157%) with a 1-SD increase in soil moisture. Associations between hospitalization rates and meteorological conditions, location, and drinking water source varied among the specific pathogens; the pathogen-group level analyses masked several of these findings and were largely uninformative. Precipitation, runoff, and rural locations were positively associated with hospitalizations for some enteric bacterial and parasitic infections; conversely, hospitalizations for biofilm-forming bacterial infections were associated with soil moisture and hospitalization rates were higher in urban areas.","author":"Victoria D. Lynch","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"05f28ef5f9ad77ec82cbd45b1e7bdfe4b790fa7ffd5e2e4a93a085ab7eb0a947","category":"Environment"}