{"title":"The Wall Street Journal แฉ ซีอีโอ Activision Blizzard ปิดบังบอร์ดบริหารเรื่องพฤติกรรมคุกคามทางเพศในสำนักงาน","link":"https://www.blognone.com/node/125879","date":1637127200000,"content":"<div><div><div><p>Activision Blizzard ยังเจอปัญหาไม่หยุด หลังเรื่องอื้อฉาวด้านพฤติกรรมในสำนักงานและการคุกคามทางเพศต่างๆ ยืดเยื้อมายาวนาน ล่าสุด The Wall Street Journal เขียนบทความแฉรายละเอียดเพิ่มเติมหลายประเด็น</p>\n<p><a href=\"https://www.wsj.com/articles/activision-videogames-bobby-kotick-sexual-misconduct-allegations-11637075680\">บทความของ WSJ</a> ระบุว่า Bobby Kotick ซีอีโอของ Activision Blizzard รู้ว่ามีพฤติกรรมคุกคามทางเพศเกิดขึ้นในที่ทำงาน และปิดบังบอร์ดบริหาร ทำให้บอร์ดไม่ทราบปัญหามาก่อนจนกระทั่ง<a href=\"https://www.blognone.com/node/123837\">บริษัทถูกฟ้อง</a> แถมยังระบุว่าเขาปกป้องพนักงานที่ทำความผิดในหลายๆ ครั้งอีกด้วย</p>\n<p>หนึ่งในตัวอย่างคือกรณี Dan Bunting ทีมงาน Treyarch ที่ถูกกล่าวหาว่าล่วงละเมิดทางเพศพนักงานหญิงในปี 2017 หลังทีมสืบสวนภายในพบว่าเขามีความผิดจริง และแนะนำให้ลงโทษด้วยการไล่ออก Bobby Kotick กลับลงความเห็นให้ Dan Bunting เข้ารับการบำบัด และอยู่ทำงานต่อไปแทน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2f4126c19d672373fb9930831d6ff056.jpg\" /></p>\n<p>บทความของ WSJ ยังระบุอีกว่า Jennifer Oneal ที่ขึ้นมานั่งประธานร่วมคนใหม่ของ Blizzard แล้วลาออกไปในเวลาไม่ถึงสองเดือน เขียนในอีเมลทิ้งท้ายก่อนลาออกว่าเธอเองก็เคยถูกเหยียดเพราะเป็นเอเชียนอเมริกัน และเป็นเกย์ แถมเคยถูกคุกคามทางเพศ และได้เงินในตำแหน่งน้อยกว่าเพื่อนร่วมงานชายในระดับเดียวกัน โดยเธอบอกว่าว่าการตัดสินใจลาออกครั้งนี้ดีที่สุดสำหรับเธอและครอบครัวแล้ว</p>\n<p>เธอยังบอกอีกว่าเคยเข้าร่วมปาร์ตี้บริษัทในปี 2007 ที่มี Bobby Kotick เข้าร่วมด้วย แล้วพบว่าในปาร์ตี้มีผู้หญิงแต่งกายยั่วยวนเต็มงาน แถมดีเจยังพยายามพูดให้ผู้หญิงที่เข้าร่วมงานดื่มให้หนัก เพื่อให้พนักงานชายได้สนุกขึ้นอีก แม้ Helaine Klasky โฆษกของ Activision Blizzard จะออกมาระบุว่า Bobby Kotick จำไม่ได้ว่าเคยร่วมงานแบบนี้ (“..didn’t remember attending such a party.”) ก็ตาม</p>\n<p>บทความส่งผลให้<a href=\"https://www.washingtonpost.com/video-games/2021/11/16/activision-blizzard-kotick-walkout/\">พนักงานกว่า 100 คน หยุดงานและรวมตัวประท้วงที่แคมปัสของ Blizzard Entertainment</a> จนกว่า Bobby Kotick จะประกาศลาออก และบริษัทจะถูกตรวจสอบโดยองค์กรภายนอก คงต้องติดตามกันต่อไปว่า Bobby Kotick หนึ่งในซีอีโอที่รายได้ดีที่สุดในสหรัฐฯ ที่เคย<a href=\"https://www.blognone.com/node/125541\">ประกาศลดเงินเดือนตัวเองมาก่อนหน้านี้</a> จะตัดสินใจอย่างไร</p>\n<p>ที่มา - <a href=\"https://accounts.wsj.com/login?target=https%3A%2F%2Fwww.wsj.com%2Farticles%2Factivision-videogames-bobby-kotick-sexual-misconduct-allegations-11637075680\">The Wall Street Journal</a>, <a href=\"https://www.washingtonpost.com/video-games/2021/11/16/activision-blizzard-kotick-walkout/\">The Washington Post</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/activision-blizzard\">Activision Blizzard</a></div><div><a href=\"/topics/ceo\">CEO</a></div><div><a href=\"/topics/sexual-abuse\">Sexual Abuse</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"05f811e16f591142255dd0addf0837cd7e1f2563be8f7f97e1200d211bdc706d","category":"Thai"}