{"title":"Temperature and Turgor “Limitation” and Environmental “Control” in Xylem Biology and Dendrochronology","link":"https://academic.oup.com/icb/article/63/6/1364/7238473?rss=1","date":1691366400000,"content":"<span><div>Synopsis</div>Trees and other woody plants are immensely ecologically important, making it essential to understand the causes of relationships between tree structure and function. To help these efforts, we highlight persistent traditions in plant biology of appealing to environmental factors “limiting” or “controlling” woody plant features. Examples include the idea that inevitable drops in cell turgor with plant height limit cell expansion and thus leaf size and tree height; that low temperatures prohibit lignification of cells and thus the growth of woody plants at high elevation; and notions from dendrochronology and related fields that climate factors such as rainfall and temperature “control” growth ring features. We show that notions of “control,” “limitation,” and the like imply that selection would favor a given trait value, but that these would-be favored values are developmentally impossible to produce. Such “limitation” scenarios predict trait frequency distributions that are very narrow and are abruptly curtailed at the upper limit of developmental possibility (the right-hand side of the distribution). Such distributions have, to our knowledge, never been observed, so we see little empirical support for “limitation” hypotheses. We suggest that, as a more productive starting point, plant biologists should examine adaptation hypotheses, in which developmental possibility is wide (congruent with the wide ranges of trait variation that really are observed), but only some of the possible variants are favored. We suggest that (1) the traditional the proximate/ultimate causation distinction, (2) purging scenarios of teleology/anthropomorphism, and (3) stating hypotheses in terms of developmental potential and natural selection are three simple ways of making “limitation” hypotheses clearer with regard to biological process and thus empirically testable.</span>","author":"","siteTitle":"Integrative and Comparative Biology Current Issue","siteHash":"715dd1b0fb4f45600bceadb227e9b7fdf8bd9d1d7a2fd3d5e0399d2c1f410646","entryHash":"05fd1244698fbc2e126e45aadda92f17c8bcca4274558e9cac59f214c91f9794","category":"Environment"}