{"title":"Suicide Epidemic in a Medium-Sized City in Brazil Reveals Itself as a Youth Problem: A Survey","link":"https://www.preprints.org/manuscript/202405.1791/v1","date":1716879653000,"content":"Contrary to what has been happening in most countries in the world, suicide mortality in Brazil has been increasing since 2016. To identify the epidemiological profile that may be associated with this increase in suicidal behavior in the population, we looked for a city with low rates of suicide mortality until 2016 and in which had a detectable growing epidemic wave in recent years to better elucidate the issue. This study aims to identify factors associated with suicidal ideation, suicidal planning, suicide attempts, and suicide.A validated questionnaire was used - Kaiser-Meyer-Olkin index (KMO) = .86 (acceptable greater than .7) and intraclass correlated coefficient (ICC) = .98 (acceptable greater than .9). Data collected was obtained by sampling for the convenience of the online questionnaire with a minimum sample of 400 respondents. The general population of Marília’s city, a medium-sized city in São Paulo state of Brazil, voluntarily responded to the questionnaire. Prevalence data was described in ratios and incidence was described in tables. The association was measured by factor analysis. The state government's data information platform (DataSUS) was consulted to verify the incidence of suicides from 2016 to 2023. The prevalence ratio of suicide attempts in people with mental disorders was 8.09%. There was a 600% increase in the incidence of suicide from 2016 to 2023 among young adults. Interpersonal problems were highly prevalent in people with suicidal ideation, suicidal planning, and suicide attempts. Heroism appears to be a suicidal equivalent and may be associated with most young deaths. Heroic behavior demonstrated a prevalence of 66.1% for committing tragic suicide. We get c2 of 31.4 for 18 degrees of freedom (p=0.026) of 10 representative variables in factor analysis with eight of the 10 variables demonstrating an association for one component.  The young population has demonstrated epidemically growing suicide rates. Social segregation can affect young people's social lives and increase suicidal behavior.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"060732e4a188242702c6325fc3108edf69c442eecd024d1ab606d1141753b7b5","category":"Interdisciplinary"}