{"title":"Cognitive Stimulation Therapy (CST): Exploring Perspectives of Trained Practitioners on Barriers and Facilitators to the Implementation of CST for People Living with Dementia","link":"https://www.preprints.org/manuscript/202409.2436/v1","date":1727702885000,"content":"Dementia is recognized as a disability under the United Nations Convention on the Rights of Persons with Disabilities (UNCRPD). People with disabilities like dementia have the right to access specialized health and social care services, including interventions that support independence and community participation. Cognitive Stimulation Therapy (CST) is an evidence-based psychosocial intervention that improves cognition, communication, confidence and quality of life for people living with dementia (PLwD), but an implementation gap means that CST is often not available. We recruited trained CST practitioners (n=62; 91.9% female) to a mixed methods study to examine facilitators and barriers to the implementation of CST in Ireland. Statistical analysis showed that 54.8% of practitioners had run CST following training; ratings of intervention efficacy predicted the likelihood of running CST groups (p=0.006); and seeing the benefits of CST first-hand predicted that practitioners would run a greater number of CST groups (p=0.01). Thematic analysis of qualitative data identified three key themes of ‘resources’, ‘awareness and education’, and ‘acceptability of CST’. Overall, the results show that while CST is acceptable and deemed highly effective, resources and staffing often impede implementation. The results are discussed in the context of prioritising the rights of people with disabilities and recommendations are made around improving access to evidence-based supports.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"06099ae16dfb15ccbeb69d367dfb234116381a877780bc7c264cfc0ce7e5dcd1","category":"Interdisciplinary"}