{"title":"Nearly $1 Billion Deposited by Apple Card Owners Four Days After Savings Account Launch","link":"https://www.macrumors.com/2023/05/01/apple-card-savings-account-deposits/","date":1682972808000,"content":"Apple on April 17 introduced the <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a> Savings account, and it turns out that it was highly popular with <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users. The new Apple-branded high-yield savings account saw up to $990 million in deposits during the first four days after launch, according to <em><a href=\"https://www.forbes.com/sites/emilymason/2023/05/01/apples-new-savings-account-draws-nearly-1-billion-in-deposits-in-the-first-four-days/?sh=7498e374e4a6\">Forbes</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/apple-card-savings-account-16x9.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\n<em>Forbes</em> says that it spoke with two anonymous sources with knowledge of how the Apple Savings account performed shortly after launch, but the deposit total has not been officially confirmed by Apple or by Goldman Sachs, Apple's partner on the ‌Apple Card‌ Savings venture.\r<br />\n\r<br />\nDuring the first day alone, ‌Apple Card‌ owners deposited $400 million, which is perhaps not a surprise given Apple's large ‌iPhone‌ user base in the United States. By the end of the week, approximately 240,000 accounts had been opened.\r<br />\n\r<br />\nThe Apple Savings account is limited to ‌Apple Card‌ holders, and it allows them to deposit the Apple Cash earned from the ‌Apple Card‌ directly into the account. ‌Apple Card‌ holders can also deposit additional money from a checking account into the ‌Apple Card‌ Savings account, where it will earn interest.\r<br />\n\r<br />\nApple is offering a 4.15% APR at the current time, which is appealing when combined with the ease of opening the savings account. Creating an account takes just a couple of minutes for those who already have an ‌Apple Card‌, and it works like any other savings account. There are no fees and there is no minimum balance, though accounts can't exceed the $250,000 FDIC insurance limit.\r<br />\n\r<br />\nThe competitive APR and the simplicity of the Apple Savings account will give it an edge over competing high-yield savings account providers. Getting a higher rate for a savings account typically requires dealing with a digital bank, and not many popular financial companies are able to compete with Apple on APR. Citi Bank, for example, has a 3.85% rate, and Discover is at 3.75%. American Express also offers a 3.75% APR, while Capital One is at 3.50% and Barclays is at 4%.\r<br />\n\r<br />\nLike the ‌Apple Card‌, the Apple Savings account is managed from the Wallet app, and earnings can be tracked through a simple, informative interface.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/01/apple-card-savings-account-deposits/\">Nearly $1 Billion Deposited by Apple Card Owners Four Days After Savings Account Launch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/nearly-1-billion-deposited-by-apple-card-owners-four-days-after-savings-account-launch.2388360/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0612a7e7fc0d15fb889b646bb4bb0a42ab994ebceac9ceb627a52de315ac1c33","category":"Apple"}