{"title":"Time to independence and predator–prey relationships of wild‐born, captive‐raised cheetahs released into private reserves in Namibia","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12342?af=R","date":1717036753000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/c913c007-6290-4bbd-b8ac-03c261e91c70/eso312342-toc-0001-m.png\" alt=\"Time to independence and predator–prey relationships of wild-born, captive-raised cheetahs released into private reserves in Namibia\" />\n<p>We show with data on cheetahs in Namibia that rehabilitated wild-born captive-reared cheetahs can be successfully released if prey availability and human-wildlife conflict potential are considered, and food supplementation and intensive monitoring are undertaken.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nReintroduction programmes are an important tool for the conservation of threatened and endangered carnivores, but their effectiveness has rarely been assessed when wild-born, captive-raised orphans are released.\n\nWe monitored and evaluated the success of captive-raised orphaned cheetahs (<i>n</i> = 25) that were rehabilitated and released into the wild as adults across three private reserves in Namibia. We estimated time to independence, hunting success and prey composition, and for one reserve we derived prey preference and hunting habitat use.\n\nSeventeen cheetahs achieved independence (68%) whereas eight were returned to captivity. With one exception, solitary or coalition cheetahs made their first kill 6 ± 2 days post-release. Hunting success was on average 56%, with solitary females having the highest success. We documented 13 species of wild prey killed by rehabilitated cheetahs, primarily ungulates (<i>n</i> = 170). Steenbok (<i>Raphicerus campestris</i>) were the preferred prey, although avoided by artificially formed female cheetah coalitions, which primarily killed juvenile eland (<i>Tragelaphus oryx</i>). Cheetahs used a wide range of vegetation for hunting, although coalition males appeared to use somewhat denser areas.\n\nRehabilitated wild-born captive-reared cheetahs can be successfully released if prey availability and human-wildlife conflict potential are considered, and food supplementation and intensive monitoring are undertaken.\n</p>","author":"L. Marker, \nA. Schmidt‐Küntzel, \nE. H. Walker, \nM. Nghikembua, \nB. Cristescu","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"061371be9c0d6ec4de857db6829a91a70783072397338aeb8e45ac864f777add","category":"Environment"}