{"title":"Apple Podcasts App Arriving on Tesla Vehicles Next Week","link":"https://www.macrumors.com/2023/12/08/apple-podcasts-app-arriving-on-tesla/","date":1702033106000,"content":"The <a href=\"https://www.macrumors.com/guide/apple-podcasts/\">Apple Podcasts</a> app is set to arrive on Tesla vehicles with the company's 2023 Holiday Update that rolls out next week.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/05/Podcasts-Feature.jpg\" width=\"2250\" height=\"1266\" />\r<br />\nTesla Model S, 3, X, Y, and Cybertruck owners in almost 50 countries and regions will receive the app via a free, over-the-air software update. A Premium Connectivity subscription is required to stream ‌Apple Podcasts‌ over a cellular connection.\r<br />\n\r<br />\nFollowing the update, users will see the ‌Apple Podcasts‌ app in the Tesla's App Launcher. It can be opened on top of the map or dragged to the My Apps dock at the bottom where it will remained pinned. When opening the ‌Apple Podcasts‌ app for the first time, users must use their <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> to scan an on-screen QR code to open a corresponding webpage and sign-in using their <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a>.\r<br />\n\r<br />\nThe ‌Apple Podcasts‌ app for Tesla vehicles features the Listen Now tab, Up Next queue, Latest Episodes, Recently Played episodes, Browse tab, Top Shows, and Top Episodes, just like its counterparts on Apple devices. It also contains a user's entire podcasts library, enabling users to see the shows they follow, saved episodes, and the latest episodes from shows they follow.\r<br />\n\r<br />\nPlayback is synced across devices so, when the driver arrives at their destination, they can continue listening from where they left off on another Apple device. ‌Apple Podcasts‌ is also directly integrated into Tesla's search experience, allowing users to search for specific shows, people, and topics and browse relevant results.<div>Tags: <a href=\"https://www.macrumors.com/guide/tesla/\">Tesla</a>, <a href=\"https://www.macrumors.com/guide/apple-podcasts/\">Apple Podcasts</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/08/apple-podcasts-app-arriving-on-tesla/\">Apple Podcasts App Arriving on Tesla Vehicles Next Week</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-podcasts-app-arriving-on-tesla-vehicles-next-week.2413148/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"061493efc2d6fb799d49733efa665811af29665246ad13478f795b0c23e72f13","category":"Apple"}