{"title":"Microdosimetric Simulation of Gold-Nanoparticle Enhanced Radiotherapy","link":"https://www.preprints.org/manuscript/202408.0778/v1","date":1723448515000,"content":"Conventional X-ray therapy (XRT) is commonly applied to suppress cancerous tumors, however it often inflicts collateral damage to nearby healthy tissue. In order to provide a better conformity of the dose distribution in the irradiated tumor, proton therapy (PT) is increasingly being used to treat solid tumors. Furthermore, radiosensitization with gold nanoparticles (GNPs) has been extensively studied to increase the therapeutic ratio. The mechanism of radiosensitization is assumed to be connected with an enhancement of the absorbed dose due to huge photoelectric cross-sections with gold. Nevertheless, numerous theoretical studies mostly based on Monte Carlo (MC) simulations did not provide consistent and thorough picture of dose enhancement and, therefore, radiosensitization effect. Radiosensitization by nanoparticles in PT is even less studied than in XRT. Therefore, we investigate physics picture of GNP-enhanced RT using MC simulation with Geant4 equipped with the most recent physics models, taking into account a wide range of physics processes relevant for realistic PT and XRT. Namely, we measured dose enhancement factors in the vicinity of GNP with diameters ranging from 10 nm to 80 nm. The dose enhancement in the vicinity of GNP reaches high values for XRT, while it is very modest for PT. The macroscopic dose enhancement factors for realistic therapeutic GNP concentrations are rather low for all RT scenarios, therefore other physicochemical and biological mechanisms should be additionally invoked for an explanation of the radiosensitization effect observed in many experiments.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"06247328a6bc8105b668313346192422136ef31048feafb41cdd25998e306caf","category":"Interdisciplinary"}