{"title":"Laurens ten Dam on being a Flandrien","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/laurens-ten-dam-on-being-a-flandrien","date":1616692920000,"content":"\n      <p><span>When Wout Van Aert and Mathieu van der Poel line up at the Tour of Flanders this Easter, there can be no doubt that we will witness the next instalment in what is already fast becoming one of cycling’s great rivalries. </span></p>\n<p><span>The Belgian and the Dutchman will duel it out on the cobbles of Flanders from the Koppenberg to the Kwaremont and the Molenberg to the Muur just like generations of rivals before them: Eddy Merckx and Roger De Vlaeminck, Peter Van Petegem and Johan Museeuw, Tom Boonen and Fabian Cancellara. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-2021-preview\"><em><strong>Related – Tour of Flanders 2021 Preview</strong></em></a></p>\n<p><span>But will this latest rivalry pit two more true Flandriens against each other? Let’s take nothing away from Wout and Mathieu as athletes, but as to whether they are of the breed of legendary hardmen of the flatlands, the jury is still out. </span></p>\n<p> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Buff-Flanders-LaurenstenDam-11_1024x1024.jpg?v=1616692027\" /></p>\n<p><span>“At the Tour of Flanders, Van Petegem would spend the first 150km at the back of the peloton, laughing and chatting with his friends. But when he went to the front, boom! Then the race was on,” says </span><span>former pro</span><span> Laurens ten Dam, </span><span>current ambassador of one of the new sponsors of the race, <a href=\"https://www.buff.com/tour-flanders?utm_source=Rouleur_mag&amp;utm_medium=Rouleur_magazine&amp;utm_campaign=Tour_Flanders\" target=\"_blank\">BUFF®</a>, who recently launched a new collection based on De Ronde.</span></p>\n<p><span>“Then at night, he and his teammates were famous for going partying in Ghent, drinking Belgian Tripels. He would race hard til Roubaix, then you wouldn’t see him again until the World Championships in September.</span></p>\n<p><span>“Live slow, ride fast. That was the philosophy. They weren’t like today’s riders. Let’s put it this way, I don’t think Peter Van Petegem practised a lot of yoga or mindfulness.” </span></p>\n<p><span></span><span>Ten Dam was never blessed with a body for the cobbled classics, but he was a Flandrien at heart. Inspired by the generation of Classics stars as a child in the Netherlands, his heroes were society’s outliers and risk takers: Flandriens like Van Petegem, who won De Ronde in 1999 and 2003. </span></p>\n<p><span>But now ten Dam is retired, and those cowboys rode out of town a long time ago. </span></p>\n<p><span>It’s hard to picture Wout and Mathieu, who pound a never-ending treadmill of racing, rounding off their Monuments with binge drinking party drugs. This is no bad thing. But perhaps something of that Flandrien spirit of the past generation has disappeared.  </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Buff-Flanders-LaurenstenDam-101_1024x1024.jpg?v=1616692081\" /></span></p>\n<p><span>“The romantic mentality of those riders - Van Petegem, Frank Vandenbrouck, Thomas Dekker - is gone. Cycling is more scientific, there’s more pressure on those younger riders, and I think it reflects a change in wider society.”</span></p>\n<p><span>Ten Dam only rode Flanders once – as a youngster on a ragtag band of troubadours called Unibet back in 2007 – but the experience of racing in cycling’s northern heartland – and the symbiosis between Monument and its public - lives long in the memory. </span></p>\n<p><span>“The first 150km I couldn’t piss anywhere because there were people everywhere - I had to dip in between parked cars to find a place where there was nobody watching - then the last 100km I couldn’t piss because we were going too fast,” he says. “Sometimes I miss the adrenaline that comes of being in a race like that.”</span></p>\n<p><span>Ten Dam kept his free-spirited behaviour even as his 14-year career in the WorldTour led him towards the grand tours. He was one of the first riders to cultivate a beard. He was famous amongst his peers for owning as few clothes as possible. He brought his own Tupperware to races to avoid adding to the mountain of single use plastic. And he drank Tripels. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Buff-Flanders-LaurenstenDam-55_1024x1024.jpg?v=1616692198\" /></span></p>\n<p><span>“It was one of my rules as a rider,” he explains. “Whenever I was in Belgium, doing a smaller race like Nokere Koerse or Halle-Ingooigem, I would always go to the bar after dinner and order one Tripel, like Van Petegem would have done in the day.”</span></p>\n<p><span>Now ten Dam is channelling his Flandrien spirit through his gravel rides and clothing brand, Live Slow Ride Fast (LSRF), and </span><span>collaborating with brands that follow that same spirit</span><span>. It’s an ethos that was born from a year living in Santa Cruz when he combined lycra-clad training for his WorldTour team Sunweb by day with baggy-shirted gravel rides that ended with beers and burgers at night. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Buff-Flanders-LaurenstenDam-188_1024x1024.jpg?v=1616692775\" /></span></p>\n<p><span>“I wanted to create clothing that you can start wearing in the morning at my events but that you don’t look ridiculous wearing that evening around the campfire. That’s the spirit of LSRF. Yes, we go and race Unbound [formerly known as Dirty Kanza], but we also want the best post-race barbecue afterwards.”</span></p>\n<p><span>This summer ten Dam plans to bring that spirit back to Flanders with the Tour of Flanders Gravel event, a three-day celebration of tackling the iconic bergs and pavé of Flanders from a different perspective, scheduled for July 2021. It’s an event that is about promoting a more balanced approach to riding, although that’s not to say ten Dam doesn’t focus on the little details.</span><span> That event can be a good complement to We Ride Flanders, the sportive of De Ronde (re scheduled for September 18th 2021).</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Buff-Flanders-LaurenstenDam-122_1024x1024.jpg?v=1616692268\" /></span></p>\n<p><span>“I think about clothing a lot, and a lot more since I’ve retired,” he explains. “Because as a pro you get your clothes on January 1</span><span>st</span><span>, you wear them for the next 365 days and you can’t think about anything else because it’s not allowed in the contract. </span></p>\n<p><span>“Now, for example, when I go bikepacking, I always take two BUFF® tubulars: one for your neck and the other for your head. They don’t weigh much, and at night I can pull them over my ears if somebody is snoring.” </span></p>\n<p><span>Live Slow, Ride Fast: according to ten Dam, road racing has forgotten how to live slow. The WorldTour is now a planet for box-tickers, inhabited by meticulous zealots who revel in leaving no stone unturned, from doing their stretching and yoga routines to weighing food and optimising recovery. </span></p>\n<p><span>“It’s all about </span><i><span>ride fast</span></i><span>. I remember when Dave Zabriskie wore a skinsuit in a road race for the first time, we were all like, ‘what the f**k are you wearing?’ Same with aero helmets, ‘what the f**k is this?’ Aero socks. I never wore aero socks in my life. Now they’re all just part of the job.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Buff-Flanders-LaurenstenDam-186_1024x1024.jpg?v=1616693977\" /></span></p>\n<p><span>Somewhat ironically, as he drifts further away from his life in the WorldTour, gravel riding is bringing ten Dam back to the spirit of those Flandriens he remembers. </span></p>\n<p><span>“Twice in a row, on my gravel events, we’ve run out of beer. The production team were used to roadies and ordered 250 cases of Kwaremont for 600 riders. They were gone on the first night.</span></p>\n<p><span>“In the middle of the night they had to drive to Belgium to get more cases of Kwaremont. And then it happened again the second year. </span></p>\n<p><span>“A good rule for gravel events: at least half a case per person. That’s six Kwaremonts each, 6.6%. And maybe don’t offer a discount for buying a case like I did.”</span></p>\n<p><em><span>Thanks to Buff for arranging our interview with Laurens ten Dam, discover the full collection <a href=\"https://www.buff.com/tour-flanders?utm_source=Rouleur_mag&amp;utm_medium=Rouleur_magazine&amp;utm_campaign=Tour_Flanders\" target=\"_blank\">here</a>.</span></em></p>\n\n<p><span></span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0628926fa62e0170f3051224d892db7030041d92c1835b4b20c4592630667f4a","category":"Cycling"}