{"title":"The most dramatic moments in Women’s Olympic Road Race history","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-most-dramatic-moments-in-women-s-olympic-road-race-history","date":1626950348000,"content":"\n      <p><span>There have been those heart-stopping moments, the ones that have left us on the edge of our seats with sweaty palms, tense and unnerved. There has been elation and celebration with victories that have caused us to jump off our sofas and scream at the TV. There have been moments where history has been made, and moments which have made all the hard work and sacrifice worth it.</span></p>\n<div></div>\n<p><span>There have been moments that only an event like the Olympics can create. A chance at gold comes once every four years. Unlike the world championships which run annually, riders may only have one or two shots at an Olympic medal in their entire career. In some countries, getting selected for the prestigious event is the hardest part of the battle. For others, selection may be simpler but they might be the only representative of their nation in the event, adding an extra level of pressure. </span></p>\n<p><span>The Olympic Road Race has long offered one of the most coveted prizes in cycling. A medal can change the entire trajectory of a rider’s career. For the women’s side of the sport especially, it’s one of the biggest events of the calendar, thanks to the huge exposure the event brings. Every Olympic cycle, fans all over the world will tune in and be treated to a spectacle of some incredibly tough racing, and this year in Tokyo will be no different.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/women-s-olympic-road-race-2021-will-we-see-dutch-dominance\">Related: Women's Olympic Road Race Preview</a></em></strong></p>\n\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/men-s-olympic-road-race-2021-route-predictions-and-contenders\">Related – Men's Olympic Road Race Preview</a></em></strong></p>\n<p><span>Such high stakes mean that the Olympic Road Race has given us some of the most dramatic and memorable moments in history. </span></p>\n<h4><b>Marianne Vos’s breathtaking sprint</b></h4>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Marianne_Vos_2012_01-_2_64598bea-768b-4095-9d41-cce407553efd_1024x1024.jpg?v=1626858596\" /></span></p>\n<p><em><span>Image: Offside/L'Equipe</span></em></p>\n<p><span>It had been a rain-soaked, crash-filled race. It was 2012 and the Olympics were in London. In true British style, the heavens had opened. The race snaked through the Surrey hills, taking in the famous Box Hill, South-East England’s equivalent to Sa Calobra (yes, we know...). The climbs came thick and fast, but these weren’t mountains, they required hard, short efforts, suited to the puncheurs of the women’s peloton.</span></p>\n<p><span>Marianne Vos put in a stinging attack with around 45km to go, proving that the winding roads of Surrey would present no challenge to her. She hit extreme speeds on the country lanes and drove her breakaway companions through the barriers of screaming fans, a flash of Dutch orange. Lizzie Deignan was one of the riders strong enough to latch on to the wheel of Vos when she launched her blistering move, as was Olga Zabelinskaya of Russia.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/es/blogs/the-rouleur-journal/opinion-marianne-vos-has-made-history-this-week-let-s-shout-about-it\">Related: Marianne Vos made history, let's shout about it</a></em></strong></p>\n<p><span>As the breakaway trio approached the finish line, the tension was high. With 2km to go, Deignan played things perfectly, sitting on the back of the group, refusing to give her colleagues a turn on the front. Vos and Zabelinskaya shared the work between them, precariously navigating the corners of central London and the slippery white road markings.</span></p>\n<p><span>Zabelinskaya seemed resigned to being beaten in the sprint, dragging Vos and Deignan to the line before dropping back. The rain reflected off the roads as the remaining duo began a full-gas drag race to the line, surrounded by Union Jack flags and roars of the fans who lined each side of the famous Mall.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/SW02_Cycling_1024x1024.jpg?v=1626859681\" /></span></p>\n<p><em><span>Image: SWPix</span></em></p>\n<p><span>Victory went to the Dutch as Vos’s sprint proved too powerful to contest, and Deignan settled for a commendable silver in her first ever Games. The biblical weather and incredible tension of the final sprint makes Vos’s victory in London 2012 one of the most famous moments in the sport.</span></p>\n<h4><b>Connie Carpenter-Phinney’s famous bike throw</b></h4>\n<p><span>The 1984 Olympics marked the first time a cycling event had ever been included for women. It was a momentous occasion in women’s sport, as 45 riders took to the start line. The favourite for the race was France’s Jeannie Longo, but as Longo’s chain came off in a tight sprint to the line, two American riders came to the fore.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-515564804_1024x1024.jpg?v=1626858957\" /></span></p>\n<p><em><span>Image: Getty</span></em></p>\n<p><span>It was an exceptionally close finish between two teammates, with Rebbecca Twigg looking to have the victory pretty much sealed until Connie Carpenter-Phinney came with a late surge, pipping her compatriot with a bike throw. It wasn’t even the first time Carpenter-Phinney had competed in the Olympics: she had been a speed skater before taking up cycling.</span></p>\n<p><span>The nail-biting finish and unpredictable nature of the sprint set the stage for what was to come from women’s racing as the sport developed.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/under-the-radar-riders-who-could-pull-off-a-surprise-performance-in-tokyo\">Related: Under the radar riders - who could pull off a surprise performance in Tokyo?</a></em></strong></p>\n<h4><b>Van Vleuten’s horror crash</b></h4>\n<p><span>Cycling is a tough game, and we’re often reminded of the extremely high risks that riders take to race at the professional level. While the victories are sweet, the unfortunate reality is that there are often more losses than wins. This fact hit home hard during the 2016 Rio Olympics, when Annemiek van Vleuten had a horror crash with only 11km left to race.</span></p>\n<p><span>There had been murmurings about the safety of the course among the cycling community leading up to the event. The sharp bends and steep road edges, alongside masses of road furniture, led many people to ask if the course in Brazil was fit for purpose. Nothing was done, though, and athletes had little choice but to race. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-587122864_1024x1024.jpg?v=1626858881\" /></span></p>\n<p><em><span>Image: Getty</span></em></p>\n<p><span>Annemiek van Vleuten had shown her supreme strength over the tough climbs that the course in Rio presented earlier in the race and she crested the final climb with American Mara Abbott, the only rider who could hold on to her wheel over the steep gradients. As they descended the other side, the Dutch rider began to distance Abbott, showing impressive technical ability. Until disaster struck.</span></p>\n<p><span>On one of the tightest corners of the descent, Van Vleuten lost her front wheel, slipping out and hitting the ground at speed. It was one of those moments that will stick in the memory of everyone watching that day. She was rushed to hospital with concussion and fractured vertebrae, but luckily suffered no career-threatening injuries.</span></p>\n<p><span>Later, she tweeted to say she was \"super disappointed after the best race of my career\". Van Vleuten was within touching distance of an Olympic medal, after years of hard work. Her teammate Anna van der Breggen ended up taking the eventual victory, but Van Vleuten would have to wait another 4 years for the chance again. A harsh reminder of how cruel the sport can be.</span></p>\n\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide\">Related – Women's WorldTour Calendar</a></em></strong></p>\n<h4><b>Nicole Cooke writes herself in to the history books</b></h4>\n<p><span>British rider Nicole Cooke’s victory in Beijing 2008 was one that will be remembered for the ages. She was the first British female athlete in history to win an Olympic gold medal in cycling. Lizzie Deignan has been vocal about how inspired she was by the success of Cooke, and how much motivation it gave the younger rider in her own career.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-82238545_1024x1024.jpg?v=1626950295\" /></span></p>\n<p><em><span>Image: Getty</span></em></p>\n<p><span>After winning the Olympic gold medal, Cooke became the first cyclist, male or female, of any nation to win the World Championship in the same year. Her ability to maintain her focus on the Worlds after her success in Beijing only emphasises the strength of Cooke as an athlete. To add to the deluge of impressive statistics, Cooke’s gold medal was also the 200th gold medal for Great Britain in the modern Olympic games, an important achievement for the entire nation.</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"062c24360425afe99a54e89bcb5ce206a98c77653bd85b7c651416549a9bf407","category":"Cycling"}