{"title":"Airasia Food เปิดให้บริการในกรุงเทพฯ แล้ว เริ่มต้น 4 พื้นที่ ดินแดง จตุจักร ลาดพร้าว ห้วยขวาง","link":"https://www.blognone.com/node/124263","date":1629191284000,"content":"<div><div><div><p>Airasia Food บริการส่งอาหารที่อยู่ภายใน Airasia Super App เปิดให้บริการในกรุงเทพแล้ว <a href=\"https://www.blognone.com/node/123605\">หลังซื้อ Gojek ก่อนหน้านี้</a> เริ่มต้น 4 พื้นที่นำร่อง คือ ดินแดง จตุจักร ลาดพร้าว และห้วยขวาง ช่วงเวลา 6.30 น. ถึง 19.00 น. ระบุเตรียมให้บริการครอบคลุมทั้งกรุงเทพเร็วๆ นี้  และตั้งเป้าจะเปิดบริการในพื้นที่อื่นๆ เช่น เชียงใหม่และภูเก็ตต่อไป</p>\n<p>อแมนดา วู ประธานเจ้าหน้าที่บริหาร แอร์เอเชีย ซูเปอร์แอพ กล่าวว่า “วิกฤติโควิด 19 ได้เปลี่ยนแปลงชีวิตประจำวันของเราไปอย่างถาวร จึงปฏิเสธไม่ได้เลยว่าบริการฟู้ดเดลิเวอรี่และการซื้อกลับบ้านกลายเป็นส่วนหนึ่งของพฤติกรรมการบริโภคของคนจำนวนมาก</p>\n<p>แอร์เอเชียจึงมีความยินดีเป็นอย่างยิ่งที่จะนำเสนอบริการซึ่งสามารถตอบสนองไลฟ์สไตล์แบบนิวนอร์มอลแก่คนกรุงเทพฯ และช่วยสนับสนุนคนไทย ทั้งร้านอาหารและคอมมิวนิตี้ต่างๆ ไปในเวลาเดียวกัน ความตั้งใจของพวกเราคือพัฒนา Airasia Super App ให้กลายเป็นไลฟสไตล์แอพพลิเคชันแบบครบวงจรสำหรับทุกคนและทุกความต้องการ\"</p>\n<p>ผู้ใช้ที่อยู่ใน 4 เขตที่กล่าวไปข้างต้น สามารถเริ่มใช้งานด้วยการดาวน์โหลดแอป Airasia ทั้งบนแอนดรอยด์และไอโอเอส และเข้าไปในหมวด food เพื่อใช้งานได้ทันที</p>\n<p>ที่มา - <a href=\"https://newsroom.airasia.com/news/airasia-super-app-officially-launches-in-thailand-th\">Airasia</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/24f1a4766603b7e77d8449c998cdf4e2.jpg\" /></p>\n<p><strong>ข้อมูลเปิดเผย</strong>: LINE MAN Lineman Wongnai เป็นบริษัทแม่ของบริษัท บล็อกนัน จำกัด ผู้ดำเนินการเว็บไซต์ Blognone.com ถือเป็นคู่แข่งในตลาดส่งอาหาร</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/airasia\">AirAsia</a></div><div><a href=\"/topics/delivery\">Delivery</a></div><div><a href=\"/topics/food\">Food</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"063389fb6a2b177782d449fa29c1fc5fc519daa9540e6accb2519ee41fa71dc6","category":"Thai"}