{"title":"CNBC: ‘Google to Save Money on Employee Laptops, Services, and Staplers’","link":"https://www.cnbc.com/2023/04/03/google-to-cut-down-on-employee-laptops-services-and-staplers-to-save.html","date":1684439858000,"content":"\n<p>Jennifer Elias, reporting for CNBC back in early April (sorry — I’m cleaning up old open tabs):</p>\n\n<blockquote>\n  <p>Among the equipment changes, Google is pausing refreshes for\nlaptops, desktop PCs and monitors. It’s also “changing how often\nequipment is replaced,” according to internal documents viewed\nby CNBC.</p>\n\n<p>Google employees who are not in engineering roles but require a\nnew laptop will receive a Chromebook by default. Chromebooks are\nlaptops made by Google and use a Google-based operating system\ncalled Chrome OS.</p>\n\n<p>It’s a shift from the range of offerings, such as Apple MacBooks,\nthat were previously available to employees. “It also provides the\nbest opportunity across all of our managed devices to prevent\nexternal compromise,” one document about the laptop changes said.</p>\n</blockquote>\n\n<p>Google has this backwards. They should force all their engineers to use Chromebooks, and let everyone else continue using MacBooks. Maybe then they’ll turn ChromeOS into something useable for real work.</p>\n\n<blockquote>\n  <p>Google employees have also noticed some more extreme cutbacks to\noffice supplies in recent weeks. Staplers and tape are no longer\nbeing provided to print stations companywide as “part of a cost\neffectiveness initiative,” according to a separate, internal\nfacilities directive viewed by CNBC.</p>\n\n<p>“We have been asked to pull all tape/dispensers throughout the\nbuilding,” a San Francisco facility directive stated. “If you need\na stapler or tape, the receptionist desk has them to borrow.”</p>\n\n<p>A Google spokesperson said the internal message about staplers and\ntape was misinformed. “Staplers and tape continue to be provided\nto print stations. Any internal messages that claim otherwise are\nmisinformed.″</p>\n</blockquote>\n\n<p>Please tell me they haven’t roped off all <a href=\"https://www.businessinsider.com/googles-office-slides-2012-5#8-google-detroit-1\">the slides</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/18/google-chromebooks-staplers\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"06346177cb1b85721259830a1834ade1a41b6a0304afd371a0b875d85964c84f","category":"Tech"}