{"title":"Allochthonous dissolved organic matter sources: effect of photodegradation on leaf leachates of invasive and native species from an Andean Patagonia catchment","link":"http://link.springer.com/10.1007/s10750-024-05567-6","date":1727740800000,"content":"<h3>Abstract</h3>\n                    <p>The vegetation surrounding aquatic ecosystems contributes allochthonous sources of organic matter to the water bodies. In Andean-Patagonian catchments, several non-native species grow among native ones. Different sources of dissolved organic matter (DOM) may vary in their contribution, potentially affecting aquatic functioning. This study evaluates differences in DOM contributions from native and non-native plants, analyzing DOM reactivity through its optical properties. An outdoor experiment was conducted with DOM leaf leachates from two native (<em>Maytenus boaria</em> and <em>Nothofagus dombeyi</em>) and two invasive trees (<em>Salix fragilis</em> and <em>Pinus contorta</em>). We characterized DOM concentration and quality optically by UV–Visible and fluorescence spectroscopy and found differences in both quantity and quality between the different leaf leachates. The exotic <em>S. fragilis</em> presented up to 7 times higher dissolved organic carbon (DOC) values than the other species. We found that leachates response to light exposure depended on its DOM composition. Decreasing patterns of DOC absorbance and fluorescence were observed in all leachates over time. We detected a gradient in leaf leachate photoreactivity due to solar exposure: (<em>S. fragilis</em> &gt; <em>P. contorta</em> &gt; <em>M. boaria</em> = <em>N. dombeyi)</em>. Overall, our work shows that the invasive plants studied produce larger amounts of degradable DOM than some local native species.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"063e098c5ddeec0d325cb5dd7e5294b97f179b058c9ab55fef8e6f4445e39acf","category":"Environment"}