{"title":"Mapping the existing body of knowledge on new and repurposed TB vaccine implementation: A scoping review","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002885","date":1724335200000,"content":"<p>by Joeri S. Buis, Degu Jerene, Agnes Gebhard, Roel Bakker, Arman Majidulla, Andrew D. Kerkhoff, Rupali J. Limaye, Puck T. Pelzer</p>\r\n\r\nThere is global consensus on the urgent need for a safe and effective TB vaccine for adults and adolescents to improve global TB control, and encouragingly, several promising candidates have advanced to late-stage trials. Significant gaps remain in understanding the critical factors that will facilitate the successful implementation of new and repurposed TB vaccines in low- and middle-income countries (LMICs), once available. By synthesizing the existing body of knowledge, this review offers comprehensive insights into the current state of research on implementation of these adult and adolescent vaccines. This review explores four key dimensions: (1) epidemiological impact, (2) costing, cost-effectiveness, and/or economic impact, (3) acceptability, and the (4) feasibility of implementation; this includes implementation strategies of target populations, and health system capabilities. Results indicate that current research primarily consists of epidemiological and costing/cost-effectiveness/economic studies in India, China, and South Africa, mainly modelling with M72/AS01, BCG revaccination, and hypothetical vaccines. Varying endpoints, vaccine efficacies, and vaccination coverages were used. Globally, new, and repurposed TB vaccines are estimated to save millions of lives. Economically, these vaccines also demonstrate promise with expected cost-effectiveness in most countries. Projected outcomes were dependent on vaccine characteristics, target population, implementation strategy, timing of roll out, TB burden/country context, and vaccination coverage. Potential barriers for vaccine acceptability included TB-related stigma, need for a second dose, and cost, while low pricing, community and civil society engagement and heightened public TB awareness were potential enablers in China, India, and South Africa. Potential implementation strategies considered spanned from mass campaigns to integration within existing vaccine programs and the primary target group studied was the general population, and adults and adolescents. In conclusion, future research must have broader geographical representations to better understand what is needed to inform tailored vaccine programs to accommodate diverse country contexts and population groups to achieve optimal implementation and impact. Furthermore, this review underscores the scarcity of research on acceptability of new and repurposed TB vaccines and their delivery among potential beneficiaries, the most promising implementation strategies, and the health system capabilities necessary for implementation. The absence of this knowledge in these areas emphasizes the crucial need for future research to ensure effective TB vaccine implementation in high burden settings worldwide.","author":"Joeri S. Buis","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"0640c94f6e94e8e2dd32be4183b1115c5540579141ab926293038861d5d67d6d","category":"Environment"}