{"title":"Hematological and Hemorheological Parameters of Blood Platelets as Biomarkers in Diabetes Mellitus Type 2. A Comprehensive Review","link":"https://www.preprints.org/manuscript/202403.1155/v1","date":1710933702000,"content":"Diabetes mellitus – type 2 (DM2) is a hypercoaguable state with enhanced platelets (PLTs) activation and increased clotting factor production. Simultaneously, the fibrinolytic cell system is inhibited due to formation of clots with high resistance to fibrinolysis. The stages of PLTs \"activation\" have been well-characterized microscopically, morphometrically and nanomechanically (by light microscope, transmisiion electron microscope - TEM, scanning electron microscope - SEM and atomic force microscope - AFM). Thrombocytes in \"acivated\" (pro-coagulant) state play central role in two main biological processes: hemostasis and repair of vascular vessels. Pro-coagulant PLTs participate in generation of thrombin and in development of fibrin fibers in the clot matrix. Enhanced PLTs reactivity in dibetic- (diabetes mellitus - DM2) patients is considered as a \"pro-thrombotic\" state. In the retrospective- and prospective- studies on the topic, the higher are the PLTs' hematometrical indices: PLTs (count), MPV (mean platelet volume), PDW (platelet distribution width), PCR (plateletcrit), as well as PLTs/Ly ratio. The PLТs parameters/indices are usefull biomarkers in early diagnosis and prognosis of DM2. The precise studies of PLTs' state of activation during DM2 might be useful for creation of new diabetes (DM2) treatment strategies and effective medicines. Using the amount of blood glucose, attached to hemoglobin (HbA1c values) as markers of glycemic control in diabetic patients, researchers have observed association between MPV and medications as Insulin, Metformin, sulphonyl ureas. Computational modellng of PLTs' activation in DM2 is also a controlling factor for thrombocyte distribution and margination in bood vessels, associated with micro- and macrovascular disease in DM2. PLTs-derived miRNAs are novel molecular biomarkers for diagnosis and prognosis of DM2, insulin resistance and diabetes complications. We have proposed (2010) oleic acid (OA) as a substance suppressing \"PLT hyperactivation\" and inhibiting “thrombocyte aggregation”. Antiplatelet agents, natural plant products including, could be effective in the prevention and the secondary treatment of micro- and macrovascular complications in the type 2 Diabetes mellitus. Our proposal on following up of a combination of hematological-, hemorheological- and hemostatic parameters (indices) as a new way in diagnosis, treatment, predicting and management of DM2 and its related vascular complications, probably could be more explored in future studies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"064585027e35617742de9cad318fe26e73f1c7751a7098073715e1dc8c345881","category":"Interdisciplinary"}