{"title":"Facebook Bringing Voice and Video Calling Back to Main App After Moving Them to Messenger","link":"https://www.macrumors.com/2021/08/23/facebook-video-voice-calling-main-app/","date":1629760152000,"content":"Facebook is re-adding voice and video calling features to its main Facebook app after moving the features to Messenger back in 2014, reports <em><a href=\"https://www.bloomberg.com/news/articles/2021-08-23/facebook-retools-messaging-again-by-adding-calling-to-main-app\">Bloomberg</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/Facebook-Feature.jpg\" />\r\n<br />\r\nUsers in some countries including the United States are now able to make voice or video calls directly from the Facebook app. As of now, Facebook is testing the feature, which is meant to cut down on the number of times that Facebook users need to swap over to the Messenger app.\r\n<br />\r\n\r\n<br />\r\nMessenger and Facebook used to be a single app, but in 2014, Facebook split them into separate apps and removed Messenger functionality from Facebook. Customers were forced to download the Messenger app to send private messages to other Facebook users or to make phone calls using the Facebook platform.\r\n<br />\r\n\r\n<br />\r\nFacebook has also been testing adding a limited version of the Messenger inbox to the main Facebook app, further expanding what can be done without having to switch to Messenger. \r\n<br />\r\n\r\n<br />\r\nConnor Hayes, director of product management at Messenger said that Facebook is beginning to consider Messenger as a service rather than a standalone app. \"You're going to start to see quite a bit more of this over time,\" Hayes told <em>Bloomberg</em>. He said that Messenger is the \"connective tissue\" for people to communicate regardless of which service they're using. Facebook believes that a unified messaging infrastructure will keep its users engaged in the Facebook ecosystem rather than using alternative services like iMessage.\r\n<br />\r\n\r\n<br />\r\nFacebook <a href=\"https://www.macrumors.com/2020/09/30/facebook-unifies-messenger-and-instagram/\">combined messaging</a> between Instagram and Messenger last year, a feature that the company also plans to bring to WhatsApp. Deep integrations could make it harder for the Facebook, Instagram, Messenger, and WhatsApp apps to be split should Facebook lose the antitrust lawsuit it is facing. The United States FTC <a href=\"https://www.macrumors.com/2021/08/19/ftc-facebook-amended-antitrust-complaint/\">has accused</a> Facebook of a social networking monopoly and has called for the company to divest Instagram and WhatsApp to bolster competition.<div>Tag: <a href=\"https://www.macrumors.com/guide/facebook/\">Facebook</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/23/facebook-video-voice-calling-main-app/\">Facebook Bringing Voice and Video Calling Back to Main App After Moving Them to Messenger</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/facebook-bringing-voice-and-video-calling-back-to-main-app-after-moving-them-to-messenger.2308458/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PNxQXAJehMQ:i6OwTAIUqLs:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PNxQXAJehMQ:i6OwTAIUqLs:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/PNxQXAJehMQ\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0656d0553bf9c7e8d10992fb2f866dab285e0163bb5e74f0e6f30d9cc0151db7","category":"Apple"}