{"title":"After bombshell report, Activision employees walk out, demand CEO resign","link":"https://arstechnica.com/?p=1813535","date":1637100973000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/6636815685_a302b6bd5f_o-800x532.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/6636815685_a302b6bd5f_o.jpg\">Enlarge</a> <span>/</span> Activision Blizzard CEO Bobby Kotick. (credit: <a href=\"https://www.flickr.com/photos/bobby-kotick/6636815685\">Flickr / bobby-kotick</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A group of Activision Blizzard employees staged a walkout and demanded the resignation of CEO Bobby Kotick Tuesday, in response to <a href=\"https://www.wsj.com/articles/activision-videogames-bobby-kotick-sexual-misconduct-allegations-11637075680\">a bombshell Wall Street Journal report</a> alleging Kotick failed to act decisively or inform his board of directors of widespread abuse allegations within the company.</p>\n<p>The WSJ story is the result of <a href=\"https://twitter.com/benfritz/status/1460641017586094081\">months of reporting</a>, says that Activision has received more than 500 claims of \"harassment, sexual assault, bullying, pay disparities, and other issues\" just in the few months since the state of California <a href=\"https://arstechnica.com/gaming/2021/07/ca-state-agency-sues-activision-blizzard-alleges-discrimination-against-women/\">brought a lawsuit against the company</a> over such problems. Many of those reports stem from heavy drinking at company-sponsored events, according to the Journal, including the alleged rape of one employee at the hands of Sledgehammer Games supervisor Javier Panameno (who was later fired after an internal investigation, and who has now resigned from his subsequent employer Zynga). This follows on broadly similar reports of drunken misconduct stemming from <a href=\"https://arstechnica.com/gaming/2021/07/blizzard-confirms-developer-named-in-lawsuit-was-removed-for-misconduct/\">a booze-filled \"Cosby suite\"</a> at BlizzCon 2013.</p>\n<p>The Journal report also adds new context to the sudden departure of former Blizzard co-chief Jennifer Oneal, who <a href=\"https://arstechnica.com/gaming/2021/11/blizzard-delays-diablo-iv-overwatch-2-amid-exec-departure/\">announced she was leaving the company earlier this month</a>, just three months <a href=\"https://arstechnica.com/gaming/2021/08/blizzard-president-j-allen-brack-steps-down-amid-lawsuit-fallout/\">after being promoted</a> to help fill the role of former President J. Allen Brack. Oneal reportedly complained to a company lawyer of previous sexual harassment she suffered at the company, pay disparities with her Blizzard co-chief Mike Ybarra, and a lack of faith that the company's executive leadership could change its culture. \"I have been tokenized, marginalized, and discriminated against,\" Oneal reportedly wrote.</p></div><p><a href=\"https://arstechnica.com/?p=1813535#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1813535&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"065f7bb795192ccb11e73c8f697ca341a4944553358076e0003d6edf8c25d52a","category":"Tech"}