{"title":"Kuo: Apple to Launch 8-Inch Foldable iPhone in 2023","link":"https://www.macrumors.com/2021/05/02/kuo-8-inch-foldable-iphone-2023/","date":1620013382000,"content":"Apple is working to launch a foldable <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> with an 8-inch QHD+ flexible OLED display in 2023, Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> said today in a note to investors that was seen by <em>MacRumors</em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/11/foldable-iPhone-concept-feature.jpg\" /><blockquote>Based on our latest industry survey, we forecast that Apple will likely launch a foldable ‌iPhone‌ with an 8-inch QHD+ flexible OLED display in 2023, with SDC as the exclusive display supplier and Samsung Foundry as the exclusive DDI foundry provider. Based on Apple's requested capacity plan, we predict that the foldable ‌iPhone‌ shipments will reach 15-20 million units in 2023. We expect that the foldable ‌iPhone‌ will adopt TPK's silver nanowire touch solution because of its several advantages over SDC's Y-Octa technology.</blockquote>Kuo predicts that foldable smartphones will become a \"must-have\" for all major smartphone brands and will boost the next \"super replacement cycle\" for high-end models, and he believes Apple is well positioned to be the \"biggest winner\" in the foldable device trend. Apple will ship 15 to 20 million foldable iPhones in 2023, according to Kuo.<blockquote>At present, the product position of foldable smartphones is mainly to integrate the smartphone and tablet. But we believe that the foldable smartphone is only one of the applications of the foldable design. We predict that foldable devices will blur the product segmentations between smartphones, tablets, and laptops in the future. With its cross-product ecosystems and hardware design advantages, Apple will be the biggest winner in the new foldable device trend.</blockquote>Kuo believes that the upcoming ‌iPhone‌ will adopt a silver nanowire touch solution for the device's display, which will create a \"long-term competitive advantage\" for Apple in the foldable device market. This display technology will be needed for future foldable devices that support more than a single fold.<blockquote>Future foldable devices will require touch technology that supports multiple folds (vs. only a single fold in current foldable smartphones), rollable, medium to large size display, and durability. When comparing the advantages of the above specifications, the silver nanowire is similar or superior to SDC's Y-Octa.</blockquote>Kuo says that Apple is already using silver nanowire for the touch interface of the <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a>, allowing Apple to \"master the technology\" at a lower cost using small volume production.\r\n<br />\r\n\r\n<br />\r\nThis is not the first time that we've heard rumors from Kuo about a foldable ‌iPhone‌. <a href=\"https://www.macrumors.com/2021/03/01/kuo-foldable-iphone-2023/\">Back in March</a>, Kuo said that Apple could be planning to launch a foldable ‌iPhone‌ with a 7.5 to 8-inch display in 2023, though at the time, Kuo said that this launch timeline would be dependent on Apple solving \"key technology and mass production issues.\" \r\n<br />\r\n\r\n<br />\r\nKuo said in the same note that development on a foldable ‌iPhone‌ had \"not yet officially kicked off,\" though Apple's plans may have progressed with Kuo now providing additional details about the display technology the company plans to use.\r\n<br />\r\n<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/foldable-iphone/\">Foldable iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/02/kuo-8-inch-foldable-iphone-2023/\">Kuo: Apple to Launch 8-Inch Foldable iPhone in 2023</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/kuo-apple-to-launch-8-inch-foldable-iphone-in-2023.2294553/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5-DUhjJ2nPs:90JNuTrN_9c:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5-DUhjJ2nPs:90JNuTrN_9c:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/5-DUhjJ2nPs\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"06612f7ce259d282d054a1f5703315ea79ad782601f0d0222ca8b85061f9b872","category":"Apple"}