{"title":"Sedentary behavior, physical activity, sleep duration and obesity risk: Mendelian randomization study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300074","date":1709906400000,"content":"<p>by Siqing Chen, Lili Yang, Yuting Yang, Wenmini Shi, Matthew Stults-Kolehmainen, Qiao Yuan, Chenchen Wang, Jing Ye</p>\r\nBackground <p>Observational studies have suggested associations between sedentary behaviors (SB), physical activity (PA), sleep duration (SD), and obesity, but the causal relationships remain unclear.</p> Methods <p>We used Mendelian randomization (MR) with genetic variation as instrumental variables (IVs) to assess the causality between SB/PA/SD and obesity. Genetic variants associated with SB/PA/SD were obtained from Genome-wide association study (GWAS), and obesity data came from FinnGen. The primary MR analysis used the instrumental variable weighted (IVW) method, with sensitivity tests including Cochran Q, MR-Egger intercepts, and MR-Radial. Expression Quantitative Trait Loci (eQTL) analysis was applied to identify significant genetic associations and biological pathways in obesity-related tissues.</p> Results <p>The MR analysis revealed causal relationships between four SB-related lifestyle patterns and obesity. Specifically, increased genetic liability to television watching (IVW MR Odds ratio [OR] = 1.55, [95% CI]:[1.27, 1.90], <i>p</i> = 1.67×10<sup>−5</sup>), computer use ([OR] = 1.52, [95% CI]:[1.08, 2.13], <i>p</i> = 1.61×10<sup>−2</sup>), leisure screen time (LST) ([OR] = 1.62, [95% CI] = [1.43, 1.84], <i>p</i> = 6.49×10<sup>−14</sup>, and driving (MR [OR] = 2.79, [95% CI]:[1.25, 6.21], <i>p</i> = 1.23×10<sup>−2</sup>) was found to increase the risk of obesity. Our findings indicate that no causal relationships were observed between SB at work, sedentary commuting, PA, SD, and obesity. The eQTL analysis revealed strong associations between specific genes (RPS26, TTC12, CCDC92, NICN1) and SNPs (rs10876864, rs2734849, rs4765541, rs7615206) in both subcutaneous and visceral adipose tissues, which are associated with these SBs. Enrichment analysis further revealed that these genes are involved in crucial biological pathways, including cortisol synthesis, thyroid hormone synthesis, and insulin secretion.</p> Conclusions <p>Our findings support a causal relationship between four specific SBs (LST, television watching, computer use, driving) and obesity. These results provide valuable insights into potential interventions to address obesity effectively, supported by genetic associations in the eQTL and enrichment analysis. Further research and public health initiatives focusing on reducing specific SBs may be warranted.</p>","author":"Siqing Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"06660f29236db29769ac791cf3dabf58732c2aeea239a6412261ca3cf90fc8a3","category":"Interdisciplinary"}