{"title":"A Bayesian approach for investigating the pharmacogenetics of combination antiretroviral therapy in people with HIV","link":"https://academic.oup.com/biostatistics/article/25/4/1034/7608217?rss=1","date":1707868800000,"content":"<span><div>Summary</div>Combination antiretroviral therapy (ART) with at least three different drugs has become the standard of care for people with HIV (PWH) due to its exceptional effectiveness in viral suppression. However, many ART drugs have been reported to associate with neuropsychiatric adverse effects including depression, especially when certain genetic polymorphisms exist. Pharmacogenetics is an important consideration for administering combination ART as it may influence drug efficacy and increase risk for neuropsychiatric conditions. Large-scale longitudinal HIV databases provide researchers opportunities to investigate the pharmacogenetics of combination ART in a data-driven manner. However, with more than 30 FDA-approved ART drugs, the interplay between the large number of possible ART drug combinations and genetic polymorphisms imposes statistical modeling challenges. We develop a Bayesian approach to examine the longitudinal effects of combination ART and their interactions with genetic polymorphisms on depressive symptoms in PWH. The proposed method utilizes a Gaussian process with a composite kernel function to capture the longitudinal combination ART effects by directly incorporating individuals’ treatment histories, and a Bayesian classification and regression tree to account for individual heterogeneity. Through both simulation studies and an application to a dataset from the Women’s Interagency HIV Study, we demonstrate the clinical utility of the proposed approach in investigating the pharmacogenetics of combination ART and assisting physicians to make effective individualized treatment decisions that can improve health outcomes for PWH.</span>","author":"","siteTitle":"Biostatistics Current Issue","siteHash":"d3a47065211a18721436d2ad1f713237ccbb15b7790ebb347bb018c26cfcb04f","entryHash":"067686ec9f8517a984b0c544b9fe1cd15e9b2d27ef6befb42aaac33a7b0fc047","category":"Environment"}