{"title":"The Mac at 40: Iconic, indelible, immortal","link":"https://www.macworld.com/article/2216095/40-years-mac-immortal.html","date":1706120033000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Forty years. In the world of technology, where many devices seem to evaporate after only a matter of months, lasting for a decade is an accomplishment—but <em>four</em> of them? It’s nearly unheard of.</p>\n\n\n\n<p>And yet today marks the 40th anniversary of the Macintosh. While it has certainly seen its ups and downs over the intervening years, it’s a device that has nevertheless been in constant production since the day Apple co-founder <a href=\"https://www.macworld.com/article/2215934\">Steve Jobs first took the wraps off it</a> back in 1984.</p>\n\n\n\n<p>In that time, it’s run on <em>four</em> different processor architectures and two major operating systems, making it a bit of a computer of Theseus. It’s seen challengers rise and fall, and been threatened with extinction more than once, and yet for all of that has emerged in recent years revitalized and stronger than ever.</p>\n\n\n\n<p>Amongst Apple’s products, the iPhone may be more popular, the iPad more futuristic, and the Apple Watch a more impressive feat of engineering, but none have the emotional resonance of the 40-year-old pioneer of the personal computer. Ask any user who’s been around long enough, and no doubt their own personal story is intertwined with the Mac.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/Apple_Museum_Prague_Macintosh_LC_1990_cropped.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Macintosh LC\" width=\"1200\" height=\"771\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/Apple_Museum_Prague_Macintosh_LC_1990_cropped.jpg?quality=50&amp;strip=all 3670w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Apple_Museum_Prague_Macintosh_LC_1990_cropped.jpg?resize=300%2C193&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Apple_Museum_Prague_Macintosh_LC_1990_cropped.jpg?resize=768%2C493&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Apple_Museum_Prague_Macintosh_LC_1990_cropped.jpg?resize=1200%2C771&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Apple_Museum_Prague_Macintosh_LC_1990_cropped.jpg?resize=1536%2C987&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Apple_Museum_Prague_Macintosh_LC_1990_cropped.jpg?resize=2048%2C1316&amp;quality=50&amp;strip=all 2048w\" /><figcaption>The Macintosh LC was released in  1990.</figcaption></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://commons.wikimedia.org/wiki/File:Apple_Museum_(Prague)_Macintosh_LC_(1990)_(cropped).jpg&amp;xcust=1-1-2216095-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Benoît Prieur/Wikipedia</a></div>\n\n\n\n<h2>A truly personal computer</h2>\n\n\n\n<p>Like any other user of the Mac, my own life and story are tied to it. I’m just four years the Mac’s senior, but computers have effectively been part of my entire conscious life. The first Mac I remember spending any time with was a friend’s SE/30, on which we whiled away the hours playing <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Shufflepuck_Caf%C3%A9&amp;xcust=1-1-2216095-1-0-0&amp;sref=https://www.macworld.com/feed\">Shufflepuck Cafe</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/watch?v=0F4y0J3hnrU&amp;xcust=1-1-2216095-1-0-0&amp;sref=https://www.macworld.com/feed\">MacPoker</a>, or experimenting with every tool MacPaint had to offer (of which spray paint was clearly the best).</p>\n\n\n\n<p>It wasn’t until some years later that a computer finally made its way into our household; my father resisted one of my cousin’s attempts to sell him on the Amiga and purchased a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Macintosh_LC&amp;xcust=1-1-2216095-1-0-0&amp;sref=https://www.macworld.com/feed\">Macintosh LC</a>, a lower-cost model that had the virtue of sporting a color display but was underpowered by any standard. (It shipped with the then-new System 7 software, notable for finally integrating color throughout the OS, but the LC’s 2MB of RAM weren’t sufficient to run it—one of the first things I had to do was downgrade to System 6.0.7.)</p>\n\n\n\n<p>That Mac led me down multiple paths to where I am now. One of the first things I remember doing with it was firing up the word processor (MacWrite II, originally) and writing stories. But my hours were more frequently spent tinkering with the system to see exactly what I could make it do. Years later, as an unemployed 20-something, I saved up enough to go to my first Macworld Expo in San Francisco, where I managed to convince my now friend and colleague Jason Snell, then Macworld’s editorial director, to give me a shot writing about Apple professionally.</p>\n\n\n\n<p>All these years later, I still make my living as both an author and someone who still thinks, writes, and talks about Apple. And though the Macs may have changed along the way, becoming smaller, faster, and undeniably space grayer, they’ve been a constant companion.</p>\n\n\n<div><figure><img src=\"https://images.techadvisor.com/cmsdata/features/3660031/21_5in_imac_with_iphone_23.jpg?quality=50&amp;strip=all\" alt=\"21-inch iMac and iPhone\" loading=\"lazy\" /><figcaption><p>Without the Mac, the iPhone doesn’t exist.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Straight on ’til morning</h2>\n\n\n\n<p>Much ink has been spilled on the Mac over the years: its origins are well documented–in and of itself, a testament to its significance. Its success is likewise understood: in an era of glowing text at an inscrutable command prompt, the Mac provided an intuitive system for interacting with a computer that helped take the device from the province of work into something we all use every day.</p>\n\n\n\n<p>Today, the Mac’s interface is simply <em>the way computers work</em>, but in 1984, that wasn’t a given. Without the Mac’s inspiration and influence, the iPhone and smartphones–which certainly rule the technological roost now–would simply not exist.</p>\n\n\n\n<p>Debates raged at the time as to whether the Mac’s graphical user interface was a revelation or a toy, but the fact that Microsoft followed quickly behind in adopting the conventions makes it clear that, in the places where it mattered, that debate was moot. The future had been laid out before us, and the goal was to get there as fast as possible.</p>\n\n\n\n<p>For all of that, one thing I think often gets overlooked in the story of the Mac is how long it supported Apple all on its own. It was 17 years after the Mac’s introduction before Apple had its next real hit product, the iPod—and by the time the iPhone rolled around in 2007, the Mac was hitting its 23rd birthday. And let’s not forget that, in the case of the former, the Mac has long outlived a device that seemed poised to eclipse it: the <a href=\"https://www.macworld.com/article/546753/ipod-mini-shuffle-nano-touch-complete-timeline.html\">iPod was officially discontinued in 2022</a>, though it had largely been cast into irrelevance for some years before that.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"1984 Mac team\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=1200%2C801&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=1536%2C1025&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=2048%2C1366&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"801\" /><figcaption><p>The original Mac development team. This photo originally appeared in the May/June 1984 print issue of Macworld.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Despite all the fears over the years: that Apple didn’t care about the platform, that it would be subsumed into iOS, that its best days were behind it, the Mac–as Phil Schiller notably said <a href=\"https://www.macworld.com/article/222761/apple-executives-on-the-mac-at-30-the-mac-keeps-going-forever.html\">to this very publication on the occasion of the computer’s 30th anniversary</a>—”keeps going forever.” With 40 years behind the computer, that half-century mark may seem a tantalizing prospect–but in the end, it’s just a waystation on the road to immortality.</p>\n\nApple Inc, Mac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0680e38f6ca589f6e00768d6572172f9d5d3de8b9552c49a76c45a2f7871a47f","category":"Apple"}