{"title":"PSVI-19 No apparent association between the microbiome in the distal part of the small intestine and feed efficiency in grower-finisher pigs fed three different levels of dietary crude protein","link":"https://academic.oup.com/jas/article/102/Supplement_2/322/7664971?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Improving feed efficiency (FE) of grower-finisher pigs is important considering its production, environmental and climate impact. The biological background describing variation in FE between pen mates, is difficult to establish as feed intake (FI) and FE is not estimated on an individual level. In this study advanced feeding stations were used to estimate FI and further calculate feed conversion ratio (FCR) on individual level. The study aimed to investigate the possible association between FCR and microbiome (alpha and beta diversity; observed features and Shannon index, and Bray-Curtis dissimilarity and Jaccard Distance) in the distal part of the small intestine (SI) in grower-finisher pigs fed three different levels of dietary crude protein (CP). The study included 60 newly weaned gilts divided in two series, housed as 10 pigs/pen. The 30 pigs per series were distributed between three pens (10 pigs/pen) and were balanced by body weight (BW) and litter with ad libitum access to the same diet. Pigs were redistributed among the grower-finisher pens to balance FCR levels between dietary treatments (CP levels) and to reduce any carry over effect from the weaner to the grower-finisher pens. From 30-115 kg BW, pigs were fed either a low (L; 14.8% CP), standard (Std; 15.2% CP) or high (H; 15.8% CP) CP diet equal in energy, where BW, average weekly gain (AWG), and FCR were determined on weekly basis, while FI was estimated on daily basis. Three low FE (20% least) and three high FE (20% greatest) pigs were selected based on the final 4 wk of growth within station and CP level. All low-FE and high-FE pigs within each dietary treatment were euthanized around 115 kg BW and content and mucosa scrabe from the distal part of the SI was sampled and subjected to 16S rRNA gene amplicon sequencing. Data were analyzed in R using a generalized linear mixed-effects model with FE, CP, and their interaction as explanatory variables, start BW of weaner and grower phase as covariables, and series as random effect. High-FE and H-CP pigs continuously displayed numerically greater BW, while AWG and FCR were, respectively, numerically greater, and less in L-CP than H-CP group during last 2 wk of the experimental period. While FE and CP individually had no significant impact [Pr(&gt; Chisq] &gt; 0.05), their interaction could be important in explaining the variation (Chisq = 6.42, Df = 2, Pr(&gt;Chisq) = 0.04) as expressed by observed features. But a pairwise comparison with a Benjamini–Hochberg correction showed no difference between groups. Concerning the Shannon index, no significance was found between groups, and no difference with respect to beta diversity was observed. In conclusion, the microbiome as expressed by alpha and beta diversity did not explain the variation between low and high FE in grower-finisher pigs.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"068787c212e54094d0e64c458ddb02191a2642c8435c6db3cb3a3f9427ba57c2","category":"Environment"}