{"title":"The Current Principles Define the Isolation of Health-Promoting Substances from Secondary Herbal Materials","link":"https://www.preprints.org/manuscript/202408.0020/v1","date":1722508612000,"content":"Agricultural waste is rich in bioactive molecules. In evaluating the viability of circular models for the development of health-promotional substances and final products, it is important to highlight that the processing industry of fruits and other valuable herbal materials generates a considerable number of by-products and waste containing health-promoting components. These by-products can be utilized purposefully used in pharmaceuticals and related areas for the development of health promotional products. The linear utilization of agricultural waste results in the loss of a range of valuable bioactive compounds, including polyphenols (anthocyanins, flavonoids, phe-nolic acids, and related compounds), antioxidants from other groups, as well as phytosterols, tocopherols and fatty acids. As an illustrative example, the waste materials of species belonging to the Vaccinium genus represent a notable secondary resource that can be purposefully applied to the development of health-promoting substances. The fruits of these wasted herbal materials have been found to contain reliable polyphenols, which play a pivotal role in the prevention of various chronic conditions, including precancerous conditions, inflammatory diseases and other ailments. In addition, the fruits of blackberries, elderberries, and purple corn which are similarly rich in anthocyanins also provide a promising avenue for further developments. Phenolic compounds suitable for recycling are also found in sugarcane harvesting by-products. Tomato waste contains a significant amount of the valuable carotenoid lycopene. The additional value of the above-mentioned fruit processing by-products may attribute to specified physiological functions, which, if used properly, can contribute to the prevention of certain diseases, and improving of quality of life. This review assessed the scope and gaps in the existing principles on the isolation of health-promoting substances from herbal secondary materials.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0689398cdb2d630a6abdae1cf9b892f03167dba94fef8459b92ab41112312775","category":"Interdisciplinary"}