{"title":"Spatial distribution projections of suitable environmental conditions for key Baltic Sea zooplankton species","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12705?af=R","date":1728113978000,"content":"<h2>Abstract</h2>\n<p>Environmental changes reshape biological communities, inducing cascading effects throughout the food webs. These changes pressure species either to adapt or to track favorable habitats. Estuaries represent an interesting case study to investigate such responses as species will rapidly reach physical boundaries if they cannot adapt fast enough and need to track suitable conditions. One such estuary is the Baltic Sea, characterized by a salinity and temperature gradient that shapes species distribution and imposes physiological stress on organisms. The Baltic Sea is projected to be affected by substantial modifications in environmental conditions by the end of the 21<sup>st</sup> century, which could have major consequences for species distribution and community composition. However, despite the impending changes and their potential impact, there is a gap in understanding the potential consequences on pelagic species of the Baltic Sea. This study employs long-term observations of primary zooplankton species in the pelagic food web to model changes in their distribution under future climate projections. We found that the parameters having the largest influence on habitat suitability varied across species, although maximal temperature was the most important for six out of seven species. In addition, there was a shrinkage of suitable area for several key species driven by a decrease in salinity and a rise in water temperature. We discuss the complex interplay between environmental changes and the spatial distribution of pelagic species in the Baltic Sea, highlighting the need for proactive management strategies to mitigate potential ecological impacts in the face of future climate scenarios.</p>","author":"Baptiste Serandour, \nThorsten Blenckner, \nKinlan M. G. Jan, \nBoris Leroy, \nBerta Ramiro‐Sánchez, \nEleanore Campbell, \nMonika Winder","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"0690a92be62852ae2d9f05ab5d67f163ca93db650badae618b112512bcc50fdb","category":"Environment"}