{"title":"KBTG ประกาศรับพนักงานสายเทคโนโลยี 500 คนภายในปี 64, รับเด็กจบใหม่ 30%","link":"https://www.blognone.com/node/122287","date":1618989991000,"content":"<div><div><div><p>KBTG กลุ่มบริษัทเทคโนโลยีของธนาคารกสิกรไทย ประกาศรับสมัครบุคลากรสายเทคโนโลยีเพิ่มอีก 500 คนภายในสิ้นปี 2564</p>\n<p><strong>คุณเรืองโรจน์ พูนผล ประธาน กสิกร บิซิเนส-เทคโนโลยี กรุ๊ป (KBTG)</strong> ระบุว่าต้องการเพิ่มจำนวน talent อีกจำนวนมากเพื่อไปให้ถึงเป้าหมายการเป็น \"บริษัทเทคโนโลยีที่ดีที่สุดในเอเชียตะวันออกเฉียงใต้\" (Best Tech Company in Southeast Asia) ภายในปี 2568 โดยเป้าหมายการจ้างงาน 500 คน จะแบ่งเป็นสัดส่วนคร่าวๆ คือเด็กจบใหม่ 30%, มีประสบการณ์ทำงานแล้ว 60% และพนักงานระดับบริหารอีก 10%</p>\n<p>หากแบ่งตามเชื้อชาติจะแบ่งเป็นคนไทย 70% และต่างชาติอีก 30% โดยกรณีของคนต่างชาติจะเซ็นสัญญาเป็น contract ปีต่อปีตามปริมาณงาน ส่วนตำแหน่งที่ต้องการมากที่สุด 3 อันดับแรกคือ software engineer, business analyst และ infrastructure</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7ab07520ce913a5dffb602551600bef0.jpg\" /></p>\n<p>KBTG ใช้วิธีจัดงานอีเวนต์ KBTG Inspire ที่สำนักงานของ KBTG เมืองทองธานี ระหว่างวันที่ 21-23 พฤษภาคม 2564 เพื่อให้ผู้ที่สนใจสมัครงานสามารถเข้ามาดูสถานที่ รับฟังข้อมูล ทำกิจกรรมและพูดคุยกับทีมงานปัจจุบัน ก่อนเข้าร่วมการสัมภาษณ์งานในวันเดียวกัน รายละเอียดดูได้จากเว็บไซต์ <a href=\"https://www.kbtginspire.com/\">KBTG Inspire</a></p>\n<p><strong>คุณอภิฤดี สิงหเสนี Head of People Experience &amp; Cultural Transformation ของ KBTG</strong> ระบุว่าการจ้างงานจำเป็นต้องได้คนที่เก่งและคนที่ใช่ มีวัฒนธรรมองค์กรตรงกัน จึงจัดงาน KBTG Inspire ขึ้นเพื่อให้ผู้ที่สนใจมีโอกาสเข้ามาสัมผัสการทำงานของ KBTG โดยตรง รูปแบบงานปรับบางส่วนมาจากงานแข่งขัน KBTG TechJam ที่จัดมาหลายครั้งแล้ว เป้าหมายคือต้องการจัดไตรมาสละ 1 ครั้ง แต่มีสถานการณ์โควิดทำให้จัดงานออฟไลน์ได้ยากขึ้น ในอนาคต KBTG ยังอยากขยายงาน Inspire ไปยังประเทศที่ให้ความสำคัญอย่างจีนและเวียดนามด้วย</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/kbtg\">KBTG</a></div><div><a href=\"/topics/kasikorn-bank\">Kasikorn Bank</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"069d860c7a4611289ce401351adecef0ed50ff6486143bab08872e6e9de6ff43","category":"Thai"}