{"title":"PSXI-30 Economic impact of pre-training on dairy cattle automatic milking system acclimation","link":"https://academic.oup.com/jas/article/102/Supplement_3/680/7757825?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Pre-training in automatic milking systems (AMS) has the potential to increase milk production and milk quality. In a recent study, cows that experienced pre-training (TRT; i.e. intentional training access with an AMS prior to first AMS milking) had greater milk yield and fat percentages compared with no pre-training (38.4 vs. 37.6 ± 0.2 kg/d; 4.75 vs. 4.38 ± 0.06%; <span>P</span> &lt; 0.01, and &lt; 0.01 respectively). Similarly, cows without pre-training had greater somatic cell count (SCC; 298,860 vs. 188,220 ± 10,700 cells/mL; <span>P</span> &lt; 0.001). The time required for pre-training could be a limiting factor (40 ± 10 h/wk), and the economic implications of labor versus long-term benefits must be examined. To that end, a stochastic simulation tool was developed to consider the increased costs of labor and the potential benefits of improved milk yield, milk fat percentage, and decreased somatic cell count. The GRKS distribution with minimum, mean, and maximum values was used to model increases in milk yield (0, 1.4, 1.8 kg), fat percentage (0, 3.5%, 4.5%), and labor cost ($0.0011, $0.0016, $0.0020 per h) and decreases in SCC (0, 120, 130 x 10<sup>3</sup> cells/mL) per hundredweight of milk produced. Baseline values for milk production ranged from 14.7 to 59.2 kg/cow/d in 4.4 kg increments with fat percentage of 3.5% and SCC of 312,000 cells/mL. The model assumed a minimum increase across milk yield, fat, and SCC of 0 (no change). The Simetar add-on in Microsoft Excel simulated 500 iterations across three herd size scenarios (60, 120, and 480 cows) and calculated the marginal return on investment across a 90-d period for all milk production ranges. Regardless of starting milk production level, pre-training had a positive economic impact across all levels (30 to 50 h) and herd sizes (Table 1). Financial impact per cow per d with input of 30, 40, and 50 h ranged from $0.58 to $0.73, $0.56 to $0.71, and $0.54 to $0.70. The majority of simulations returned a positive marginal impact for pre-training. If pre-training resulted in a loss, it ranged from $242 to $1,937, $323 to $2,585, $405 to $3,246, across 30, 40, and 50 hours, respectively. Based on these results, the investment in pre-training time was consistently beneficial for simulated herds.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"06a0e1c40eb777192211f1f437ecbde56a9a949bd03b617d1b2e3fd04261c6be","category":"Environment"}