{"title":"Cyclist Doorstep Rides, No1: Digital editor Joe's ride around Kent","link":"https://www.cyclist.co.uk/in-depth/9435/cyclist-doorstep-rides-no1-digital-editor-joes-ride-around-kent","date":1617273539000,"content":"<span>\n      <span><a href=\"/authors/joe-robinson\">Joe Robinson</a></span>\n  </span><div>  \n  <div>      <div><span>1 Apr 2021</span></div>    </div></div><p>\nWith some smart route planning and a little blind faith, your average road bike can go a lot further than you'd been led to believe</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/04/komoot-joe-ride.jpeg?itok=4yIalSv7\" />  </div>\n<div>\n      <p> <strong>For the next eight weeks, <em>Cyclist</em> and <em>Komoot</em> are going to share some of their favourites rides and routes that are accessible from the doorstep. First up, <em>Cyclist</em> digital editor Joe Robinson.</strong></p>\n<p>‘Everybody rides gravel now’. That’s what the cycling market and media have been telling anybody that will listen for about the past two years.</p>\n<p>Speak to some and you’ll quickly begin to believe that road riding is dead, that rolling a set of 25mm clincher tyres – that are attached to your rim brake wheels which are fitted into your carbon fibre racer while wearing your lycra bibshorts and jersey – across asphalt is a relic idea consigned to the history books.</p>\n<p>They will laugh at anything less than a set of 40mm knobbly tubeless tyres on some 650b wheels attached to a ‘gravel-specific’ frames with their stretched out wheelbases, fitted with dropper seatposts and with splayed out bars. For these people, it is now gravel all the way and no looking back.</p>\n<p>And while I must admit that riding a tricked-out gravel bike on a technical trail is a lot of fun, I can understand why plenty of you consumers consider this a pretty cynical show to sell more product. And like most of you, I’m far from ready to give up on the road bike either.</p>\n<p>But thankfully, the fact is you do not need a gravel bike to ride off-road. You can actually do it on a road bike. As long you’ve got a set of 25mm tyres and the understanding that you’re probably going to spend longer cleaning your bike post-ride than usual, half the battle is won.</p>\n<p>The other half is in the route. Because, yes, there will be moments when you venture off-road that you stumble upon a trail or track that is simply too demanding for your bike or your skillsets. But that is largely avoided with some foresight and good route planning on Komoot.</p>\n<p>My doorstop ride, which starts in finishes in Swanley, Kent, mixes in your standard tarmac roads with some of my favourite off-road paths that are more than achievable on a standard road bike.</p>\n<div>\n<blockquote>\n<div> <a href=\"https://www.instagram.com/p/B9VDxfYB-so/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"><br />\n<div>\n<div></div>\n<div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div></div>\n<div><br />\n</div>\n<div>\n<div> View this post on Instagram</div>\n</div>\n<div></div>\n<div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<p></p></a><br />\n<p><a href=\"https://www.instagram.com/p/B9VDxfYB-so/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Joseph Robinson (@joseph_p_robinson)</a></p>\n</div>\n</blockquote>\n</div>\n<p>From the compact, Strade Bianche-style white gravel along the River Darenth to the claggy mud that climbs me from Maplescombe Road to Bower Lane with the City of London as my backdrop, there is something for every occasion. The fast, flowing Pilgrims Way will have you feeling like you’re racing Tro Bro Leon and offers a tonic to the brutally steep Tinker Pot Lane which has you suffering from double-digit gradients for almost 800 metres.</p>\n<p>And the real ‘pièce de résistance’ of the ride is the climb of Old Polhill, a much-disused bridleway that thanks to its dark tunnel at the bottom and series of 7 per cent switchbacks have seen it labelled the ‘Stelvio of Sevenoaks’ by some. It’s a true hidden gem.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/04/joe-doorstop-ride-2.jpg?itok=hY5481cI\" />  </div>\n</div>\n<p>Oh, and let’s not sleep on the Kemsing Italian Deli which is en-route, either. I’ve been a regular for years now and I’m convinced Ed (from Siciliy) and Alice (from Sardinia) do the best Caprese panini and coffee outside of Italy.</p>\n<h3>The route powered by Komoot</h3>\n  </div>\n<div>  \n  <div>      <div><a href=\"/destinations\">Destinations</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"06b4b6f1987817a8f3ca7c3454c6cde704e8657592b64e788a854121c793ec66","category":"Cycling"}