{"title":"Vision Pro might launch later than Apple hoped","link":"https://www.macworld.com/article/2145968/vision-pro-set-to-arrive-march.html","date":1700515559000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Next year Apple will roll out its biggest product launch since the iPhone: <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Vision Pro</a>, the company’s long-awaited entry to the mixed-reality hardware space. But even though the product <em>has</em> been officially unveiled, and we even know the launch price, Apple has yet to say when it will be released.</p>\n\n\n\n<p>During the announcement at <a href=\"https://www.macworld.com/article/1940738/wwdc-2023-live-blog-ios-macos-headset-mac-pro-macbook-air.html\">WWDC 2023</a>, Apple told U.S. customers to expect Vision Pro “early next year,” which many pundits took to mean the spring; the company has often made major announcements at a dedicated event in March or April. (This would somewhat echo the launch of the very first Apple Watch, which was announced in September 2014 and then released in April the following year.) But five months on from WWDC, we still don’t have a clearer idea of when the launch will take place.</p>\n\n\n\n<p>Bloomberg reporter Mark Gurman, however, feels confident enough to make a prediction. In the latest edition of his <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/account/newsletters/power-on&amp;xcust=1-1-2145968-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On newsletter</a>, the leaker-analyst makes the surprising claim that Apple originally intended “early” in 2024 to mean exactly that: at one point, he says, Vision Pro was slated for what would have been a January release. </p>\n\n\n\n<p>While Apple has previously released new products in the first month of the year, as it did every year at the Macworld Conference and Expo back in the days when that ran, and as recently as 2023 when it introduced the M2 Pro and M2 Max MacBook Pro in January, it would be unusual for Apple to release significant products in the first month of the year, that being a time when many consumers are still counting the cost of the holiday season. As previously mentioned Vision Pro is <em>incredibly</em> significant for the company’s long-term prospects. This is the platform that Cupertino hopes will one day replace the iPhone.</p>\n\n\n\n<p>Mind you, the January launch plan, even assuming Gurman’s information is sound, is no longer happening. As a result of testing and distribution arrangements taking longer than originally expected, Vision Pro will now launch “sometime around March.” And we’re back to where we started.</p>\n\n\n\n<p>So much for the U.S. launch, anyway. At WWDC Apple made it clear that Vision Pro will initially launch in the U.S. only, with other countries (so far not specified) set to follow “later next year.” In a July <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2023-07-07/apple-vision-pro-headset-to-launch-in-us-stores-by-appointment&amp;xcust=1-1-2145968-1-0-0&amp;sref=https://www.macworld.com/feed\">report</a> Gurman did suggest that the Vision Pro could launch in Canada and the U.K. by the end of 2024, with Asia and other parts of Europe following “soon after”. </p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"06b6cd3447eb3a8c89806079270f62fac37efea7a63919b0ef9443cc31cdbc15","category":"Apple"}