{"title":"Pollinator diversity, pollination services, and conservation in agroecosystems: A mini‐review on the successes and challenges in China","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.46?af=R","date":1719474874000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6c6816ce-a17d-464a-95a7-f91888512428/inc346-gra-0001-m.png\" alt=\"Pollinator diversity, pollination services, and conservation in agroecosystems: A mini-review on the successes and challenges in China\" /><p>While many pollinator studies have been conducted in China, more efforts are required to conservation pollinators and pollination services. Three proposed conservation interventions were proposed in this mini-review, including long-term pollinator monitoring plan, design suitable agricultural landscapes, and wildflower strips and bee hotels.\n</p><br />\n<h2>Abstract</h2>\n<p>Pollinators provide important pollination services for crops around the world. In China, numerous studies have been conducted on pollinators within agroecosystems, yet a comprehensive review of such research remains to be completed. This study discusses the existing knowledge of pollinator diversity in Chinese agroecosystems, examines the provision of pollination services, and identifies key achievements and limitations. We propose a series of conservation and management actions to promote pollinator health and ecosystem services in these agroecosystems: (1) long-term monitoring of pollinator populations, (2) designing agricultural landscapes that are conducive to pollinators, and (3) implementing microscale habitat modifications to improve conditions for pollinators.</p>\n<h2>摘要</h2>\n<p>传粉昆虫为世界各地的农作物提供了重要的授粉服务。在中国，对农业生态系统中的传粉昆虫已经有了大量研究，但对这些研究的全面综述仍有待完成。本文讨论了现有的中国农业生态系统中传粉昆虫多样性的现有知识，探讨传粉昆虫提供的授粉服务，并指出主要成就和局限性。我们提出了一系列保护和管理行动，以促进这些农业生态系统中的授粉者健康和生态系统服务:（1）对传粉昆虫种群进行长期监测，(2) 设计有利于传粉昆虫的农业景观，以及 (3) 实施微观尺度的生境改造，以改善传粉昆虫的生存条件。【审阅:石晓宇】</p>","author":"Xiaoyu Shi, \nDunyuan Huang, \nHuanli Xu, \nZongxin Ren, \nYanhui Lu, \nJiandong An, \nYi Zou, \nYunhui Liu, \nFang Ouyang, \nDouglas Chester, \nJunpeng Mu, \nChunling He, \nA'rong Luo, \nRui Cheng, \nQingsong Zhou, \nZeqing Niu, \nXin Zhou, \nLei Zhao, \nMassimo Martini, \nChangsheng Ma, \nWenda Cheng, \nXia Chen, \nMichael Orr, \nWenjun Peng, \nChaodong Zhu","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"06bb53e0d96ef9e32535426903d5102fe4a1178e1986bed48dfe2c78afa47ffe","category":"Environment"}