{"title":"HIV preventive practice and its associated factors among street dwellers in Ethiopia: Application of health belief model","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003199","date":1714744800000,"content":"<p>by Yosef Wassihun, Zemed Hunegnaw, Tadele Fentabel Anagaw, Zeamanuel Anteneh Yigzaw, Eyob Ketema Bogale</p>\r\n\r\nStreet dwelling is the use of public space as a place of residence and nourishment for children, adolescents, and young people, revealing a complex and multifactorial situation. Moreover, homelessness facilitates HIV transmission and its progression due to the risky lifestyle of individuals. To the best of our knowledge, there is no study conducted in the study area on HIV preventive practices among street dwellers. The aim of this study was to assess HIV prevention practices and associated factors among street dwellers. A community-based cross-sectional study was conducted in Bahir Dar City from March 12, 2023 to April 30, 2023. By using the simple random sampling technique, 424 street dwellers were recruited. Bivariable and multivariable logistic regression were used for analysis. The magnitude of HIV preventive practice among street dwellers was 35.9%. Being male (AOR = 0.23, 95% CI: 0.10, 0.55), educational status (AOR = 7.53, 95% CI: 2.20, 25.6), practice of sex to earn money (AOR = 0.18, 95% CI: 0.08, 0.44), good knowledge about HIV preventive practice (AOR = 2.83, 95% CI: 1.46, 5.49), perceived susceptibility for HIV (AOR = 0.90, 95% CI: 0.81, 0.99), and perceived benefit of using HIV preventive practice (AOR = 1.09, 95% CI: 1.02, 1.17), were factors associated with HIV preventive practice. The magnitude of HIV preventive practice was low. Being male, the ability to read and write, the practice of sex to earn money, good knowledge about HIV preventive practice, perceived susceptibility to HIV, and the perceived benefit of using HIV preventive practice were significantly associated with HIV preventive practice. Therefore, responsible organizations, both governmental and non-governmental, should design inclusive strategies to improve HIV preventive practice among street dwellers by focusing on regular demand creation activities, awareness creation about HIV preventive practice, and sustainable condom distribution in the city.","author":"Yosef Wassihun","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"06bcbf6bbd6a4e409f8c6f487de5570208f123c7656c9bd16b15d9bf6b14f0c3","category":"Environment"}