{"title":"Effects of short‐term supplementation with DHA‐enriched phosphatidylcholine and phosphatidylserine on lipid profiles in the brain and liver of n‐3 PUFA‐deficient mice in early life after weaning","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13625?af=R","date":1717703638000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Lack of n-3 polyunsaturated fatty acids during the period of maternity drastically lowers the docosahexaenoic acid (DHA) level in the brain of offspring and studies have demonstrated that different molecular forms of DHA are beneficial to brain development. The aim of this study was to investigate the effect of short-term supplementation with DHA-enriched phosphatidylserine (PS) and phosphatidylcholine (PC) on DHA levels in the liver and brain of congenital n-3-deficient mice.</p>\n<h2>RESULTS</h2>\n<p>Dietary supplementation with DHA significantly changed the fatty acid composition of various phospholipid molecules in the cerebral cortex and liver while DHA-enriched phospholipid was more effective than DHA triglyceride (TG) in increasing brain and liver DHA. Both DHA-PS and DHA-PC could effectively increase the DHA levels, but DHA in the PS form was superior to PC in the contribution of DHA content in the brain ether-linked PC (ePC) and liver lyso-phosphatidylcholine molecular species. DHA-PC showed more significant effects on the increase of DHA in liver TG, PC, ePC, phosphatidylethanolamine (PE) and PE plasmalogen (pPE) molecular species and decreasing the arachidonic acid level in liver PC plasmalogen, ePC, PE and pPE molecular species compared with DHA-PS.</p>\n<h2>CONCLUSION</h2>\n<p>The effect of dietary interventions with different molecular forms of DHA for brain and liver lipid profiles is different, which may provide theoretical guidance for dietary supplementation of DHA for people. © 2024 Society of Chemical Industry.</p>","author":"Wei‐Ya Zuo, \nMin Wen, \nYing‐Cai Zhao, \nXiao‐Yue Li, \nChang‐Hu Xue, \nTeruyoshi Yanagita, \nYu‐Ming Wang, \nTian‐Tian Zhang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"06c8117efcb0213593694c5f9f5e7e28a25e42525c9285913754df037718822a","category":"Environment"}