{"title":"Open System Proposal for Supervision of Critical Adverse Processes in Patients with Implanted Ventricular Assist Devices","link":"https://www.preprints.org/manuscript/202409.2162/v1","date":1727430172000,"content":"Ventricular Assist Devices (VADs) are designed to provide adequate blood flow to patients suffering from heart failure. Once implanted, the patient becomes dependent on the VAD, making it unacceptable to have situations with the potential to cause harm to patients on circulatory support. The VADs can be categorized as Critical Systems (CS), as device malfunction or Adverse Events (AEs) can result in harm to the patient, including the risk of death. Undesirable situations can occur in two ways: deviations in the functionality of the VAD linked to failures or defects or deviations in the patient's physiological responses associated with AEs. The AEs can result in hospitalization, causing permanent harm to the patient, including the risk of death. Patient care is provided through in-person consultations, and reports of incidents are submitted through Medical Device Reports (MDRs), monitored by the Food and Drug Administration (FDA). However, the crucial issue is that there is no real-time monitoring of AEs or supervision of patients. Therefore, an Open System for Supervising Critical Adverse Processes in Patients with Implanted Ventricular Assist Devices (OSCVAD) is proposed based on horizontal and vertical integration architecture. A method for structuring the processes in this system is proposed to address its complexity, involving different domains of operation: device, patient, and medical team, as well as the possible interactions between the entities that comprise the OSCVAD. In this context, the formalism of Interpreted Petri Nets was employed to synthesize diagnostic models for AEs and intervention models based on Intervention Protocols, utilizing the medical team's knowledge.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"06cf5b7d28703da064dd650ee69c06e0c891241f6b4323907ce0d96017500124","category":"Interdisciplinary"}