{"title":"Photos Depict Alleged AirPods Pro 2 With Same Design, Case With 'Find My' Speaker Holes and Strap Attachment","link":"https://www.macrumors.com/2021/10/22/airpods-pro-2-photo-rumor/","date":1634920320000,"content":"Apple is developing second-generation <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> to follow the <a href=\"https://www.macrumors.com/roundup/airpods/\">AirPods 3</a>, with the new earbuds set to come out in 2022. We've heard little about the next-generation ‌AirPods Pro‌ so far, but a rumor from <em>Bloomberg</em>'s Mark Gurman has suggested they could be stemless.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/airpods-pro-2-2.jpg\" />\r\n<br />\r\n<em>MacRumors</em> has now received alleged images of the second-generation ‌AirPods Pro‌ that contradict the stemless design rumors, but they're from a source (\"Xerxes\") without an established track record and we can't verify their accuracy. The person who provided the images to us said that they come from an \"Apple internal source,\" and the person declined to provide additional information.\r\n<br />\r\n\r\n<br />\r\nThe ‌AirPods Pro‌ in the photos features the same design as the original ‌AirPods Pro‌, with the exception of a missing optical sensor toward the underside of each earbud. Apple has moved from optical sensors to a skin-detect sensor in the ‌AirPods 3‌, so it's possible the ‌AirPods Pro‌ 2 will follow suit in that regard.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/airpods-pro-2-1.jpg\" />\r\n<br />\r\nBeyond the earbuds themselves, there are more obvious differences in the case. There are speaker holes at the bottom, which is an unusual choice for an AirPods casing design. The source who provided the images says that these speaker holes are being introduced because in iOS 16, Apple will be adding a new feature where \"<a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> will be available for the case and buds separately.\" The speaker holes will let the case play a sound to allow it to be located.\r\n<br />\r\n\r\n<br />\r\nThe case also depicts a metal loop at the side, which is meant to be for attaching a strap, but Apple has not used this design for any of its other AirPod models and it is unclear why it would be added in this instance. That said, it does not seem out of the realm of possibility that Apple would add a strap.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/airpods-pro-2-3.jpg\" />\r\n<br />\r\nOn the topic of a stemless design, the source says that the rumors are incorrect, and that Apple will not be eliminating the stem from the next-generation ‌AirPods Pro‌.\r\n<br />\r\n\r\n<br />\r\n<em>MacRumors</em> is a rumors site, as the name suggests, so we thought we'd share these images with our readers even though we cannot verify that these are an accurate representation of the ‌AirPods Pro‌ 2 at this point. Keep in mind that these features have not been confirmed by a source with a known track record for accuracy, and the information should be viewed with some skepticism at this point in time.\r\n<br />\r\n\r\n<br />\r\nAs mentioned above, <em>Bloomberg</em>'s Mark Gurman, who often provides an accurate assessment of Apple's plans, has said that Apple is aiming to make the ‌AirPods Pro‌ 2 <a href=\"https://www.macrumors.com/2020/10/26/apple-new-airpods-2020-third-homepod/\">more compact</a> by eliminating the short stem that sticks out from the bottom. Apple has tested a more rounded shape, but getting the hardware of the ‌AirPods Pro‌ into a chassis that's reduced in size has proven difficult, so the plan could be scrapped.\r\n<br />\r\n\r\n<br />\r\nWe've heard no other rumors of new features or changes to the case design of the ‌AirPods Pro‌ 2 at this time. It is perhaps worth noting that the first refresh to the original AirPods, the AirPods 2, also did not feature a new design, instead focusing on a wireless charging addition for the case and other internal improvements. The ‌AirPods Pro‌ 2 are expected to launch at some point in 2022, but there's no word on when as of yet.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/airpods-pro-2/\">AirPods Pro 2</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AirPods-Pro\">AirPods Pro (Neutral)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/airpods.216\">AirPods</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/22/airpods-pro-2-photo-rumor/\">Photos Depict Alleged AirPods Pro 2 With Same Design, Case With 'Find My' Speaker Holes and Strap Attachment</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/photos-depict-alleged-airpods-pro-2-with-same-design-case-with-find-my-speaker-holes-and-strap-attachment.2318685/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=HxyXVAm1N1E:NDSwl8yH2qM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=HxyXVAm1N1E:NDSwl8yH2qM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/HxyXVAm1N1E\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"06dbffc38eb4d8f793f2425962fed5d93baac94912d831ef86346e44bceed5c0","category":"Apple"}