{"title":"Nothing to be done about Lotte Kopecky’s strength at the Tour of Flanders, but there has been a vibe shift in the women's peloton","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/nothing-to-be-done-in-the-face-of-kopecky-s-dominance-at-the-tour-of-flanders-but-there-has-been-a-vibe-shiift-in-the-womens-peloton","date":1680467454000,"content":"\n      <p><span>“If they drop you on the climb, there’s nothing you can do about it.”</span></p>\n<p><span>It seemed so simple when Shirin van Anrooij of Trek-Segafredo put it that bluntly in her post-race interview. Reporters were asking the Dutchwoman if there was anything she or her team could have changed about how they raced at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a> in order to put a stop to the dominance of Team SD Worx that has plagued the women’s WorldTour season so far.</span></p>\n<div></div>\n<p><span>“Lotte [Kopecky] was too strong today. We tried to close the gap but with all the SD Worx riders in our group, it was too difficult,” Van Anrooij continued. </span></p>\n<p><span>And try they did. </span></p>\n<p><span>There was a moment when all chance of victory seemed lost today for teams like Trek-Segafredo. It was on the first ascent of the Koppenberg with 40km remaining, when the peloton was floundering and hectic. There was a chaotic mix of riders toppling to the side on the slippery cobblestones with chains coming off and feet being unclipped. Although not completely unscathed, emerging from this scene of madness in an almost comical fashion, were the distinct pink jerseys of Team SD Worx.</span></p>\n<p><span>Three of the team’s riders, Marlen Reusser, Lotte Kopecky and Lorena Wiebes, alongside Silvia Persico of UAE Team ADQ, broke clear at this point, forming a strong breakaway that was three quarters full of the number one Women’s WorldTour team. It’s fair to say that the hearts of some cycling fans sunk at this point. Another race dominated by the same squad? Are things getting a little bit predictable?</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1250519823_1024x1024.jpg?v=1680466710\" alt=\"Swiss Marlen Reusser of SD Worx and Belgian Lotte Kopecky of SD Worx ride on the Koppenberg during the women's Tour of Flanders one day cycling event, 158km from and to Oudenaarde, on April 2, 2023\" /></div>\n<p><span></span><em><span>Reusser, Kopecky, Persico and Wiebes in the breakaway (Image: </span>Tom Goyvaerts/Getty)</em></p>\n<p><span>But unlike in other races so far this season, the gap between this quadruplet of riders and the remainder of the peloton didn’t continue to grow. Instead, largely thanks to the work of Trek-Segafredo, it hovered at a tantalisingly close 20 seconds – the race was not done. </span></p>\n<p><span>The likes of Elisa Longo-Borghini, Lucinda Brand and Shirin van Anrooij, all from the American team, pulled huge turns on the front of the chasing group. They continued to do so even when Kopecky dropped both Reusser and Wiebes who came back to the chase group, meaning that, at one point, there were three SD Worx riders that Trek-Segafredo were pulling to the finish line behind Kopecky up front.</span></p>\n<p><span>In other races, we’ve seen this race dynamic lead to negative tactics. With one SD Worx rider up the road and with them having numbers in the chase group – one of whom is Wiebes, arguably the fastest female sprinter in the world – it can lead other teams to wonder what the point is of putting together a cohesive chase. If they bring the race back together, Wiebes can outsprint them, anyway. This mindset is defeatist, however, and was not one that Trek-Segafredo were willing to adopt.</span></p>\n<p> </p>\n<p><span>In the end, this chasing didn’t amount to Trek-Segafredo eventually standing on the top step of the podium in Oudenaarde. It was still an SD Worx one-two eventually and a second consecutive Flanders win for home-favourite Kopecky. It didn’t matter that Trek-Segafredo had a positive approach and a die-hard attitude. They came away with a third place for Longo-Borghini after she unleashed an impressive sprint from the chase group, but as Van Anrooij explained, there’s nothing you can do if SD Worx drop you on a climb.</span></p>\n<p><span>Even after dropping the majority of the peloton, Kopecky went on to drop her own two teammates who were with her in the original breakaway; then went on to drop Persico too, her final breakaway companion, who explained after the race: “I did my best, I need to be happy.”</span></p>\n<p><span>For Kopecky, the confidence in her team’s strength was a key factor in her victory. “I was surrounded by a super strong team and that helps to to get the pressure off,” the Belgian explained after the race. “The plan was to use the dominance of the team.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1479112716_1024x1024.jpg?v=1680466906\" alt=\"Lotte Kopecky of Belgium and Team SD Worx celebrates at finish line as race winner during the 20th Ronde van Vlaanderen - Tour des Flandres 2023, Women's Elite a 156.6km one day race from Oudenaarde to Oudenaarde\" /></div>\n<p><span><em><span>Image: Tim de Waele/Getty Images</span></em></span></p>\n<p><span>The overarching narrative of today’s edition of the women's Tour of Flanders was that everyone did what they could, Kopecky was unstoppably strong, and Vollering the fastest sprinter from the chase group to pick up second place. It wasn’t a case of poor tactics or lack of trying from other teams, but instead a group of riders, all on the same team, that were the strongest in the bunch. </span></p>\n<p><span>It is clear from watching her Kopecky lives and breathes the cobbles, riding the Flandrian <em>hellingen</em> where she grew up like she was born to do so. There’s no mistaking the 27-year-old's unmatchable technique and craft. Flanders is her race, and she’s in a team currently that means it's almost impossible for her to get it wrong.</span></p>\n<p><span>However, Trek-Segafredo’s valiant performance and the close-run nature of De Ronde this year compared to some of the other races SD Worx has dominated so far this season does give glimpses of what could be to come in the next couple of weeks. </span></p>\n<p><span>This is a peloton with fight still left in it to beat the very best, and with <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix Femmes</a> around the corner (a race which Trek has won two years on the trot), we have a feeling that there has been a vibe shift in the women’s peloton. Things are hotting up, others are closing in on SD Worx. Winning streaks can't go on forever.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"06dd98cf579a9ae806835ee06e66bb2b758ae1171b67ca2883b1bfffa2b72c0c","category":"Cycling"}