{"title":"Microplastics stress alters microorganism community structure and reduces the production of biogenic dimethylated sulfur compounds","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12701?af=R","date":1728197929000,"content":"<h2>Abstract</h2>\n<p>Dimethylsulfoniopropionate (DMSP) is a plentiful organic sulfur metabolite and the primary precursor for dimethyl sulfide (DMS), which plays a crucial role in global sulfur cycling, the formation of clouds, and cooling the warming earth. The origin and fate of DMSP are intricately linked to marine microorganisms, making the variation of the microorganism community crucial for DMSP dynamics. Nonetheless, the impact of pervasive marine microplastics on microorganisms and processes related to DMSP synthesis and degradation remains insufficiently investigated. To bridge this gap, a 14-d deck-based microcosm experiment was conducted, revealing that microplastics significantly altered the composition of microorganism communities and dramatically inhibited the release of DMS and DMSP. Furthermore, multivariate analysis demonstrated that the variations both in environmental variables and microorganism communities caused by microplastics were forcing factors in reducing DMS and DMSP release. In addition, the predicted function of the bacterial community showed a significant reduction in the presence of <i>dddP</i> and <i>dmdA</i> genes when exposed to microplastics, which directly disrupted both the demethylation and cleavage pathways of DMSP. These results indicate that the release of DMS and DMSP in marine ecosystems can be significantly affected by microplastics through influencing microorganisms. Thus, it is imperative to conduct research on controlling the synthesis and degradation of DMSP in the ocean, particularly in response to these environmental pollution issues. Such research can help discern new patterns from specific phenomena and identify crucial processes.</p>","author":"Qian Liu, \nXu‐Xu Gao, \nYan Li, \nYong Jiang, \nJuan Yu, \nShan‐Shan Liu, \nXiao‐Ping Lang, \nGui‐Peng Yang","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"06e8fbbd7429f94e29bb52ccdca9db1512e796d43df62519fa4cbcabf73d742e","category":"Environment"}