{"title":"Apple ให้ทุนบริษัท II-VI ผู้ผลิตเลเซอร์ FaceID เพื่อขยายฐานผลิตในสหรัฐ","link":"https://www.blognone.com/node/122554","date":1620359372000,"content":"<div><div><div><p>Apple มีกองทุน Advanced Manufacturing Fund เพื่อสนับสนุนการจ้างงานในอุตสาหกรรมการผลิตของสหรัฐอเมริกามาตั้งแต่ปี 2017 ล่าสุดประกาศให้ทุน 410 ล้านดอลลาร์กับบริษัท II-VI ผู้ผลิต vertical-cavity surface-emitting lasers (VCSELs) เลเซอร์ที่ใช้สำหรับสแกนพื้นผิว เบื้องหลังเทคโนโลยี Face ID, Memoji, Animoji, การถ่ายภาพพอร์เทรตเซลฟี่ และเลเซอร์ใน LiDAR scanner ของ iPhone</p>\n<p>เงินทุนก้อนนี้ จะช่วยขยายฐานการผลิตของ II-VI ให้มีอัตราการผลิตสูงขึ้น และช่วยสร้างงานกว่า 700 ตำแหน่งทั่วสหรัฐอเมริกา ทั้งในเท็กซัส, นิวเจอร์ซีย์, เพนซิลเวเนีย และอิลลินอยส์ ซึ่งจะเป็นประโยชน์กับทั้ง Apple, II-VI และเศรษฐกิจท้องถิ่นของสหรัฐ โดย Apple ร่วมงานกับ II-VI ตั้งแต่ปี 2017 ในแผน Advanced Manufacturing Fund ที่เปลี่ยนให้โรงงานร้างขนาดกว่า 70,000 ตารางฟุตของ II-VI ได้กลับมาผลิตอุปกรณ์ทันสมัยอีกครั้ง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6e7ccb413bf642b79249d049ba1829a2.jpg\" /><em>ภาพจาก Apple</em></p>\n<p>การลงทุนครั้งนี้ของ Apple เป็นหนึ่งในแผนการลงทุนมูลค่า 430 พันล้านดอลลาร์ กับผู้ผลิตกว่า 9,000 รายทั่วสหรัฐ เพื่อสร้างตำแหน่งงานอีก 20,000 ตำแหน่ง ภายในห้าปีข้างหน้านี้ ทั้งในภาคการผลิตชิป การผลิตเกี่ยวกับ 5G และอื่นๆ ถือเป็นทั้งงาน CSR ช่วยสร้างตำแหน่งงานและอาชีพในประเทศบ้านเกิดของบริษัท และยังเพิ่มกำลังผลิตให้กับซัพพลายเชนของตัวเอง</p>\n<p>กระแสการผลิตชิ้นส่วนในอุปกรณ์ไฮเทคในสหรัฐ เริ่มกลับมาอีกครั้ง หลังเกิดวิกฤตชิปขาดแคลน จนโจ ไบเดน ประธานาธิบดีสหรัฐ <a href=\"https://www.blognone.com/node/121383\">ต้องลงนามคำสั่งบริหารเพื่อแก้ปัญหานี้อย่างเป็นทางการ</a> และร่วมมือกับหลายบริษัทเพิ่มเตรียมแผนเพิ่มการผลิตในประเทศ ซึ่งนอกจาก Apple แล้ว Intel ก็<a href=\"https://www.blognone.com/topics/intel\">เตรียมขยายโรงงานผลิตในสหรัฐ</a> ส่วน Samsung เองก็มี<a href=\"https://www.blognone.com/node/120780\">ข่าวลือว่ากำลังเตรียมเปิดโรงงานผลิตชิปในสหรัฐ</a>เพิ่มเช่นกัน</p>\n<p>ที่มา - <a href=\"https://www.apple.com/newsroom/2021/05/apple-awards-an-additional-410-million-from-its-advanced-manufacturing-fund-to-ii-vi/\">Apple Newsroom</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/manufacturing\">Manufacturing</a></div><div><a href=\"/topics/usa\">USA</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"06e864d5d8e963a224eb0f2939fbffbb6a293fe84fbdca56f6f9a74b9b3dfd65","category":"Thai"}