{"title":"Small wetland‐fringed estuaries deliver disproportionately large carbon loads to the ocean","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12660?af=R","date":1724837072000,"content":"<h2>Abstract</h2>\n<p>Previous estimates of dissolved carbon export from estuaries focused on larger systems in the Northern Hemisphere, with little data for smaller tropical estuaries often fringed by intertidal wetlands. We investigated lateral export (outwelling) and transformation rates of dissolved organic carbon (DOC), dissolved inorganic carbon (DIC), and total alkalinity (TA) as well as CO<sub>2</sub> emissions from 18 diverse Australian estuaries. Most estuaries acted as net sources for DOC (72%), DIC (83%), and TA (50%). On average, estuaries exported 120 ± 55 and 344 ± 150 mmol m<sup>−2</sup> catchment yr<sup>−1</sup> DOC and DIC, respectively. Estuarine CO<sub>2</sub> emissions (33 ± 20 mmol m<sup>−2</sup> estuary d<sup>−1</sup>) equalled 13% ± 16% of the dissolved lateral carbon export. Carbon export positively correlated with runoff, rain, and intertidal wetland cover, and negatively correlated with estuary and catchment area. Mangroves and saltmarshes cover &lt; 1% of all catchments but can contribute 46% ± 11% of the DOC and 67% ± 13% of the DIC exported to the ocean. Upscaling our observations, Australian estuaries export 2.8 ± 2.2 TgC yr<sup>−1</sup> DOC, 8.1 ± 6.2 TgC yr<sup>−1</sup> DIC, and 0.7 ± 0.6 Tmol yr<sup>−1</sup> TA. Small catchments (&lt; 10 ha) making up 70% of all estuaries and accounting for 18% of the total freshwater flow provided 27% to the total dissolved carbon export. Overall, small tropical estuaries fringed by highly productive intertidal wetlands are hotspots of carbon exports and should be considered in marine carbon budgets.</p>","author":"Gloria M. S. Reithmaier, \nDamien T. Maher, \nCeylena Holloway, \nRogger E. Correa, \nIsaac R. Santos","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"06ec86034a1bbbbf0866d61f45389f255613b24ad281c73f4eb3f484ffd11c58","category":"Environment"}