{"title":"Effects of hydroxyurea on fertility in male and female sickle cell disease patients. A systemic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304241","date":1717768800000,"content":"<p>by Sarah Sewaralthahab, Lujain A. Alsubki, Maram S. Alhrabi, Abdulrahman Alsultan</p>\r\nBackground <p>Evidence supports the benefits of hydroxyurea (HU) in adults with sickle cell disease (SCD), but reservations remain due to long-term concerns of fertility. Retrospective analysis of clinical records of SCD patients (haemoglobin SS genotype) have identified gender-related differences in disease progression. This could inform risk stratification during SCD at diagnosis with the possibility to guide therapeutic decisions.</p> Methods <p>This systemic review and meta-analysis evaluated fertility parameters in both children (aged ≥ 6 years) and adults with SCD receiving HU therapy. Studies were sourced from PubMed and EMBASE from inception to July 2023. A total of 160 potentially relevant articles were identified.</p> Results <p>Four studies were included that evaluated the effects of HU on sperm parameters in males. A further 4 studies assessed anti-mullerian hormone (AMH) levels and ovarian reserves in females. Differences from baseline values were used to identify compromised fertility. Amongst males, HU treatment negatively impacted the concentration of spermatozoa (MD = -15.48 million/mL; 95% CI: [-20.69, -10.26]; p&lt; 0.001), which continued following treatment cessation (MD = -20.09 million/mL; 95% CI: [-38.78, -1.40]; P = 0.04). HU treatment also led to lower total sperm counts (MD = -105.87 million; 95% CI: [-140.61, -71.13]; P&lt; 0.001) which persisted after treatment (MD = -53.05 million; 95% CI: [-104.96, -1.14]; P = 0.05). Sperm volume, initial forward motility and morphology were unaffected by HU treatment. In females, HU treatment decreased the mean AMH levels 1.83 (95% CI [1.42, 2.56]. A total of 18.2.% patients treated with HU showed reduced ovarian reserves.</p> Interpretation &amp; conclusions <p>This systemic review and meta-analysis suggest that the use of HU for SCD impacts seminal fluid parameters in males and can diminish AMH levels and ovarian reserves in females.</p>","author":"Sarah Sewaralthahab","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"06f2047cd0fde9e67d346a3c1a56983c6f8111dd4d814cfde63f5e7e3a606954","category":"Interdisciplinary"}