{"title":"Systematic review and meta-analysis: Evaluating the influence of intrahepatic cholestasis of pregnancy on obstetric and neonatal outcomes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304604","date":1717509600000,"content":"<p>by Xuexia Huang, Huifeng Gu, Pinghua Shen, Xiaoxing Zhang, Anping Fei</p>\r\nBackground <p>Intrahepatic cholestasis of pregnancy (ICP) is a serious liver conditions that negatively impacts obstetric and neonatal outcomes. Elevated levels of bile acid, particularly glycine conjugate, may compromise blood flow and cause functional hypoxia-ischemia.</p> Aims <p>This meta-analysis aims to assess the association between ICP and key pregnancy outcomes including emergency caesarian sections (C-sections), preeclampsia, hemorrhage, preterm birth, small for gestational age, admission rate to neonatal intensive care union (NICU), gestational age, and stillbirth.</p> Materials and methods <p>Literature search across five databases (PubMed, Embase, Web of Science) was done to detect relevant studies published up until June 2023. Meta-analysis of the identified studies was done using a random-effects model, and the results presented as Odds ratio (OR).</p> Results <p>A literature search identified 662 studies. Of them, 21 met the inclusion criteria. There was a significant association between ICP and odds of C-section (OR: 1.42, p &lt;0.001), preeclampsia (OR: 2.64, p &lt;0.001), NICU admission (OR: 2.1, p &lt;0.001), and pre-term birth (OR: 2.64, p &lt;0.001). ICP was not associated with postpartum hemmorhage (OR: 1.31, p = 0.13), small for gestational age (OR: 0.87, p = 0.07), stillbirth (OR: 1.49, p = 0.29).</p> Conclusions <p>Our results confirm the adverse effects of ICP on co-existing pregnancy complications, obstetric and neonatal outcomes. ICP in associated with severe complications including increased rates of preeclampsia, emergency C-sections, preterm births, l gestational periods and higher rates of NICU admissions. These results may assist healthcare professionals in formulating comprehensive care guidelines for expectant mothers and newborns.</p>","author":"Xuexia Huang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"06f56568b64701286319ec09ab3cbc9171b87d93e77374a9877cb54122282463","category":"Interdisciplinary"}