{"title":"อินเทลเตรียมตั้งโรงงานผลิตชิปแห่งใหม่ในยุโรป วงเงินลงทุน 2 หมื่นล้านดอลลาร์","link":"https://www.blognone.com/node/123661","date":1626065209000,"content":"<div><div><div><p>Pat Gelsinger ซีอีโออินเทล ให้สัมภาษณ์กับ Financial Times ถึง<a href=\"https://www.blognone.com/node/122343\">แผนการขยายโรงงานผลิตชิปในยุโรป</a> ว่าจะลงทุนเป็นเงิน 2 หมื่นล้านดอลลาร์ ตอนนี้ยังไม่ตัดสินใจว่าจะตั้งที่ประเทศไหน แต่อาจอยู่ในหลายประเทศได้ เช่น ผลิตที่ประเทศหนึ่ง และประกอบแพ็กเกจในอีกประเทศ ส่วนประเทศที่เล็งไว้คือเยอรมนี เนเธอร์แลนด์ ฝรั่งเศส เบลเยียม</p>\n<p>เบื้องต้น อินเทลมีแผนตั้งโรงงาน 2 โรงบนพื้นที่เดียวกันก่อน (มูลค่า 2 หมื่นล้านดอลลาร์) และอาจลงทุนเพิ่มขยายเป็น 8 โรงในระยะยาว</p>\n<p>อินเทลบอกว่าจะพยายามมองเป็น ecosystem ของยุโรปทั้งทวีป ไม่ใช่การตั้งโรงงานที่ไม่เกี่ยวข้องกันในแต่ละประเทศ ปัจจัยที่พิจารณามีทั้งเรื่องที่ดิน โครงสร้างพื้นฐาน ทรัพยากรบุคคล รวมถึงการสนับสนุนจากรัฐบาลแต่ละประเทศด้วย ซึ่ง Pat Gelsinger ก็เดินสายพบประธานาธิบดีฝรั่งเศส และนายกรัฐมนตรีอิตาลีเพื่อเจรจาในเรื่องนี้แล้ว</p>\n<p>นอกจากแผนการตั้งโรงงานในยุโรปแล้ว อินเทลยังมี<a href=\"https://www.blognone.com/node/121850\">แผนการสร้างโรงงานใหม่ 2 โรงในสหรัฐอเมริกา</a> (มูลค่า 2 หมื่นล้านดอลลาร์) และการขยายโรงงานเดิมในไอร์แลนด์ (มูลค่า 7 พันล้านดอลลาร์) ซึ่งเป็นยุทธศาสตร์ระยะยาวในการรับมือการแข่งขันจาก TSMC และซัมซุง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d4c57269ac25f6fb37d2ec8d2776df47.jpg\" /></p>\n<p>ภาพการขยายโรงงานที่ไอร์แลนด์ของอินเทล</p>\n<p>ที่มา - <a href=\"https://www.ft.com/content/40eda20e-17d8-4368-bdeb-a2d1b151bc34\">Financial Times</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/intel\">Intel</a></div><div><a href=\"/topics/semiconductor\">Semiconductor</a></div><div><a href=\"/topics/europe\">Europe</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"06fb1f275730b300d866d2a43de0dcba070b6c9e22c819b96af66d30dd535ba4","category":"Thai"}