{"title":"The feasibility of delivering cardiac brief intervention to patients following ST-elevation myocardial infarction: Protocol for a pilot randomised controlled trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306406","date":1719928800000,"content":"<p>by Gareth Thompson, Gemma Caughers, Judy Bradley, Patrick Donnelly, Maria Mooney, Donna Fitzsimons</p>\r\nBackground <p>Patients experience emotional distress and hold cardiac misconceptions following ST-elevation myocardial infarction. These issues informed the co-production of Cardiac Brief Intervention with patients and clinicians. The current study will establish a knowledge base for the feasibility of delivering this intervention to patients following ST-elevation myocardial infarction, with a preliminary exploration of impact on associated outcomes (ClinicalTrials.gov: NCT05848674).</p> Methods <p>A pilot randomised controlled trial incorporating a mixed-methods design will be conducted. Patients with ST-elevation myocardial infarction (number = 40) will be recruited from coronary care units at two hospital centres in Northern Ireland, with participants randomised (1:1) to the intervention or control group. Cardiac Brief Intervention constitutes a nurse-led, short (20 minutes) emotional and educational support discussion with a patient, with a leaflet that serves as a memory-aid. It will be delivered to the intervention group prior to discharge from a coronary care unit. The control group will receive standard care information. Data will be collected at baseline, post-intervention, 4 weeks from diagnosis, and 14 weeks from diagnosis. Feasibility measurements and process evaluation (quantitative and qualitative) will assess the viability of the research design and intervention delivery. Cardiac rehabilitation attendance data will be collected, and participants will complete questionnaires related to associated outcomes. Quantitative data will be reported with descriptive statistics and qualitative data will be analysed using framework analysis, with data integrated to achieve triangulation of findings.</p> Discussion <p>Educational and emotional difficulties following ST-elevation myocardial infarction may impede patient outcomes and cardiac rehabilitation participation. These issues informed the co-production of Cardiac Brief Intervention with patients and clinicians. This study will evaluate the feasibility of delivering Cardiac Brief Intervention to patients. These results will inform large-scale definitive testing of the intervention, which may lead to adoption in clinical practice to improve cardiac rehabilitation uptake and patient outcomes.</p>","author":"Gareth Thompson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"06fd5f5484d02ab5434b5cfd1f968c2be94c660eae569098e6dce9acaab5b235","category":"Interdisciplinary"}