{"title":"Factors associated with the uptake of intermittent preventive treatment for malaria during pregnancy in Cameroon: An analysis of data from the 2018 Cameroon Demographic and Health Survey","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001245","date":1711548000000,"content":"<p>by Dominique Ken Guimsop, Ange Faustine Kenmogne Talla, Haoua Kodji, Jerome Ateudjieu</p>\r\n\r\nMalaria in pregnancy is a major public health concern that contributes to a significant increase in maternal and child mortality and morbidity. Intermittent preventive treatment of malaria during pregnancy using sulfadoxine-pyrimethamine (IPTp-SP) is a key intervention recommended by the World Health Organization (WHO) and implemented in Cameroon to reduce the morbidity associated with malaria during pregnancy. This study aimed to assess the distribution of the poor uptake of IPTp-SP (i.e. fewer than three doses) in Cameroon and the factors associated. We conducted a secondary analysis of data extracted from the 2018 Cameroon Demographic and Health Survey. Data was collected using a face-to-face questionnaire administered to mothers with at least one child under the age of five. The participants were selected using a two-stage stratified sampling process. We estimated the frequencies of mothers receiving fewer than three doses of IPTp-SP. Multilevel logistic regression modeling was used to assess the associations between key suspected determinants and uptake of fewer than three doses of IPTp-SP. Crude and adjusted Odds-Ratio (ORs) were estimated. A total of 13,527 women of childbearing age were interviewed, of whom 5,528 (40.9%) met our selection criteria. Among them, 845 (15.3%) women had no antenatal consultation (ANC) visit, 1,109 (20%) had 1–3 visits, 3,379 (61.1%) had 4–7 visits, and only 195 (3.5%) had at least eight visits. Moreover, 3,398 (61.5%, CI: 60.2–62.8) had received fewer than three doses of IPTp-SP. Our findings show that the predictors of poor uptake of IPTp-SP include attending the first ANC visit after the third month of pregnancy (aOR = 1.52, CI: 1.30–1.77), attending fewer than four ANC visits (aOR = 1.29, CI: 1.06–1.56), and not being attended to by a healthcare professional during the prenatal period (aOR = 4.63, CI: 2.81–7.64). Residing in the Sahelian regions was not increasing the risk of poor IPTp-SP uptake on its own but was positively modifying the effect of not being attended by a healthcare professional (p &lt; 0.001). We did not find a significant association between a higher level of education and the uptake of IPTp-SP (aOR = 1.10, CI: 0.90–1.32). Nearly two third of the pregnant women in Cameroon have a poor uptake of IPTp-SP. Interventions focused on ANC provision ought to be explored and tested to address this gap, with priority assigned to the Sahelian region.","author":"Dominique Ken Guimsop","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"07017877aee4114eb78fdd410cc0728c8b026db20a5ec81bd5c7b6e5f7265920","category":"Environment"}