{"title":"Tree mortality and recruitment in secondary Andean tropical mountain forests along a 3000 m elevation gradient","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300114","date":1710165600000,"content":"<p>by Jenny C. Ordoñez, Esteban Pinto, Antonella Bernardi, Francisco Cuesta</p>\r\n\r\nThis study addresses the understudied dynamics of mortality and recruitment in Tropical Mountain forests, critical determinants of forest structural processes and biomass turnover. We examine how these demographic processes change with elevation and varying degrees of forest recovery by utilizing two forest censuses (2015 and 2019) from 16 plots (0.36 ha) across a 600–3500 m asl elevation gradient in the Ecuadorian Andes. Employing multivariate PCA analyses, we characterize successional forest dynamics and explore relationships between demographic rates, elevation, and indicators of forest recovery using standard linear regression and generalized additive models (GAMs). Contrary to our hypothesis, mortality exhibits a unimodal response, peaking at mid-elevations, with no significant relationship to above-ground biomass productivity (AGBp). In our successional forests, dominance by fast-growing species alters expected patterns, leading to increased mortality rates and AGBp, particularly at low-mid elevations. Forest recovery emerges as a significant driver of mortality and the sole predictor of recruitment, especially across different recovery statuses. Although forest recovery doesn’t impact mortality rates, it elucidates the identity of declining species in forests with varying recovery degrees. Our findings underscore that while forest recovery does not alter mortality rates, it provides critical insights into understanding which species are affected under varying recovery conditions. Recruitment, primarily driven by successional dynamics, exhibits higher rates in sites with less recovery. Furthermore, we demonstrate the utility of forest structure indicators, such as above-ground biomass, in inferring successional dynamics when the time since the last disturbance is unknown. The study emphasizes the importance of considering disturbances in comprehending the intricate interplay between the environment and forest dynamics in secondary forests.","author":"Jenny C. Ordoñez","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"070aae2589ea6a9692e625460394291a8b94ffcea8f40fa4fb9f622489fdcfa0","category":"Interdisciplinary"}