{"title":"Mentorship in health research institutions in Africa: A systematic review of approaches, benefits, successes, gaps and challenges","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003314","date":1727100000000,"content":"<p>by Maurine Ng’oda, Peter Muriuki Gatheru, Oyetunde Oyeyemi, Phylis Busienei, Caroline H. Karugu, Sharon Mugo, Lilian Okoth, Margaret Nampijja, Sylvia Kiwuwa-Muyingo, Yohannes Dibaba Wado, Patricia Kitsao-Wekulo, Gershim Asiki, Evelyn Gitau</p>\r\nBackground <p>In Africa, where the burden of diseases is disproportionately high, significant challenges arise from a shortage of skilled researchers, lack of research funding, and limited mentorship opportunities. The continent faces a substantial gap in research output largely attributed to the dearth of mentorship opportunities for early career researchers.</p> Objective <p>To explore existing mentorship approaches, identify challenges, gaps, successes, and benefits, and provide insights for strengthening mentorship programs in African health research institutions.</p> Methods <p>We registered the review protocol on the International Prospective Register of Systematic Reviews [CRD42021285018] and searched six electronic databases–EMBASE, AJOL, Web of Science, PubMed, DOAJ, and JSTOR from inception to 10 November 2023, for studies published in English reporting on approaches of mentorship in health research in African countries. We also searched grey literature repositories, institutional websites, and reference lists of included studies for additional literature. Two independent reviewers conducted screening of titles and abstracts of identified studies, full-text screening, assessment of methodological quality, and data extraction. We assessed study quality against the Mixed Methods Appraisal Tool (MMAT). We resolved any disagreements through discussion and consensus. We employed a narrative approach to synthesize the findings.</p> Results <p>We retrieved 1799 articles and after screening, included 21 studies in the review. The reviewers identified 20 mentorship programs for health researchers (N = 1198) in 12 African countries mostly focusing on early-career researchers and junior faculty members. A few included mid-career and senior researchers.We categorized the programs under three key mentoring approaches: international collaborative programs, regional and in-country collaborations, and specialized capacity-building initiatives. Our review highlighted the following successes and benefits of health research mentorship programs: the establishment of collaborations and partnerships, development of research programs and capacities, improvement of individual skills and confidence, increased publications, and successful grant applications. The gaps identified were limited funding, lack of a mentorship culture, negative attitudes towards research careers, and lack of prioritization of research mentorship.</p> Conclusion <p>Our review highlights a diverse landscape of health research mentorship aspects predominantly targeting early career researchers and heavily driven by the North. There is a need for locally driven mentorship initiatives in Africa to strengthen mentorship to advance health research in the region.</p> Trial registration <p>PROSPERO registration number: CRD42021285018.</p>","author":"Maurine Ng’oda","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"070ba92a18c42d991d2d1c46cf2f9e8be8827d81f78b58f99f58604f9d35460f","category":"Environment"}