{"title":"The 12 best iOS 15 features Apple didn’t mention during the keynote","link":"https://www.macworld.com/article/348265/ios-15-features-not-in-keynote-ar-walking-widgets-siri-facetime-spotlight-apple-pay-find-my-authenticator.html","date":1623151607000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>Apple crammed a lot of new stuff into its near-two-hour keynote, but not everything was able to make it to the main presentation. Here are the best <a href=\"https://www.macworld.com/article/348123/ios-15-features-facetime-notifications-sharing-live-text-compatilibity-release-beta-how-to-install.html\">iOS 15</a> features you didn’t hear about yesterday.</p>\n\n\n\n<p><strong>Immersive walking instructions</strong><br />Instead of just hearing turns, you’ll be able to see where you’re going with step-by-step directions you can view in augmented reality.</p>\n\n\n\n<p><strong>New widgets</strong><br />Apple is adding widgets for Find My, Game Center, App Store Today, Sleep, Mail, and People with Family Sharing integration.</p>\n\n\n\n<p><strong>Siri sharing</strong><br />Along with offline support, Siri can now share items that are on your screen, such as photos, web pages, news, and more. If the item can’t be shared, Siri will offer to send a screenshot instead.</p>\n\n\n\n<p><strong>FaceTime mute alerts</strong><br />There’s nothing worse than having a conversation that the other people can’t hear. Among the many changes coming to FaceTime, your phone will let you know if you start talking while muted. Then you can tap the alert to quickly unmute and make sure your voice is heard.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/facetime-android.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>When you’re muted and start talking, your phone will nudge you to turn on your microphone.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p><strong>Spotlight everywhere</strong><br />If you want to search for something, you can pull down from the Lock Screen or Notification Center to launch Spotlight.</p>\n\n\n\n<p><strong>COVID-19 vaccine passport</strong><br />iOS 15 will let you scan a QR code from your healthcare provider and securely store your COVID-19 immunizations and test results in the Health app.</p>\n\n\n\n<p><strong>Apple Pay coupons</strong><br />Among the interface changes coming to Apple Pay is the ability to enter coupon codes into the payment sheet.</p>\n\n\n\n<p><strong>Find My separation alerts</strong><br />If you leave your AirPods, AirTag, or compatible third-party item behind, your iPhone will alert you with notifications and Find My will give you directions to your item.</p>\n\n\n\n<p><strong>Drag and drop</strong><br />You can pick up images, documents, and files from one app and drag them into another on your iPhone, just as you can on the Mac.</p>\n\n\n\n<p><strong>Built-in authenticator</strong><br />Just like with your Apple ID, you’ll be able to generate verification codes needed for additional sign-in security. For example, if a site offers two-factor authentication, you’ll be able to set up verification codes under the Passwords tab in Settings to have codes autofill when you sign in to the site.</p>\n\n\n\n<p><strong>Dual software updates</strong><br />iOS now offers a choice between two software update versions in the Settings app. So, when iOS 15 is released in the fall, you can update as usual or continue on iOS 14 and still get important security updates until you’re ready to take the leap.</p>\n\n\n\n<p><strong>Temporary iCloud storage</strong><br />When you buy a new device and use iCloud Backup to transfer your data, iCloud will temporarily grant you as much storage as you need to complete a backup, free of charge, for up to three weeks. This allows you to get all your apps, data, and settings onto your device automatically without paying for storage you’ll only need once.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"070f30a1b5c167dd8605de853fad93c72d3a2506048342e0832fb8a23c5e3427","category":"Apple"}