{"title":"Amazon SageMaker Studio adds web-based interface, Code Editor, flexible workspaces, and streamlines user onboarding","link":"https://aws.amazon.com/blogs/aws/amazon-sagemaker-studio-adds-web-based-interface-code-editor-flexible-workspaces-and-streamlines-user-onboarding/","date":1701368310000,"content":"<p>Today, we are announcing an improved <a href=\"https://aws.amazon.com/sagemaker/studio/\">Amazon SageMaker Studio</a> experience! The new SageMaker Studio web-based interface loads faster and provides consistent access to your preferred integrated development environment (IDE) and SageMaker resources and tooling, irrespective of your IDE choice. In addition to JupyterLab and RStudio, SageMaker Studio now includes a fully managed Code Editor based on <a href=\"https://github.com/microsoft/vscode\">Code-OSS</a> (Visual Studio Code Open Source).</p> \n<p>Both Code Editor and JupyterLab can be launched using a flexible workspace. With spaces, you can scale the compute and storage for your IDE up and down as you go, customize runtime environments, and pause-and-resume coding anytime from anywhere. You can spin up multiple such spaces, each configured with a different combination of compute, storage, and runtimes.</p> \n<p>SageMaker Studio now also comes with a streamlined onboarding and administration experience to help both individual users and enterprise administrators get started in minutes. Let me give you a quick tour of some of these highlights.</p> \n<p><strong><u>New SageMaker Studio web-based interface<br /> </u></strong>The new SageMaker Studio web-based interface acts as a command center for launching your preferred IDE and accessing your SageMaker tools to build, train, tune, and deploy models. You can now view SageMaker training jobs and endpoints in SageMaker Studio and access foundation models (FMs) via <a href=\"https://aws.amazon.com/sagemaker/jumpstart/\">SageMaker JumpStart</a>. Also, you no longer need to manually upgrade SageMaker Studio.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-01.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-01.png\" alt=\"Amazon SageMaker Studio\" width=\"1789\" height=\"1283\" /></a></p> \n<p><strong><u>New Code Editor based on Code-OSS (Visual Studio Code Open Source)<br /> </u></strong>As a data scientist or machine learning (ML) practitioner, you can now sign in to SageMaker Studio and launch Code Editor directly from your browser. With Code Editor, you have access to thousands of VS Code compatible extensions from <a href=\"https://open-vsx.org/\">Open VSX registry</a> and the preconfigured <a href=\"https://aws.amazon.com/visualstudiocode/\">AWS toolkit for Visual Studio Code</a> for developing and deploying applications on AWS. You can also use the artificial intelligence (AI)-powered coding companion and security scanning tool powered by <a href=\"https://aws.amazon.com/codewhisperer/\">Amazon CodeWhisperer</a> and <a href=\"https://aws.amazon.com/codeguru/\">Amazon CodeGuru.</a></p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-code-editor-02.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-code-editor-02.png\" alt=\"Amazon SageMaker Studio\" width=\"1796\" height=\"906\" /></a></p> \n<p><strong><u>Launch Code Editor and JupyterLab in a flexible workspace<br /> </u></strong>You can launch both Code Editor and JupyterLab using private spaces that only the user creating the space has access to. This flexible workspace is designed to provide a faster and more efficient coding environment.</p> \n<p>The spaces come preconfigured with a SageMaker distribution that contains popular ML frameworks and Python packages. With the help of the AI-powered coding companions and security tools, you can quickly generate, debug, explain, and refactor your code.</p> \n<p>In addition, SageMaker Studio comes with an improved collaboration experience. You can use the built-in Git integration to share and version code or bring your own shared file storage using <a href=\"https://aws.amazon.com/efs/\">Amazon EFS</a> to access a collaborative filesystem across different users or teams.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-sm-studio-space-3.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-sm-studio-space-3.png\" alt=\"Amazon SageMaker Studio\" width=\"1255\" height=\"803\" /></a></p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-code-editor-01.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-code-editor-01.png\" alt=\"Amazon SageMaker Studio\" width=\"1443\" height=\"637\" /></a></p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-jupyter-01.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-jupyter-01.png\" alt=\"Amazon SageMaker Studio\" width=\"1448\" height=\"643\" /></a></p> \n<p><strong><u>Streamlined user onboarding and administration<br /> </u></strong>With redesigned setup and onboarding workflows, you can now set up SageMaker Studio domains within minutes. As an individual user, you can now use a one-click experience to launch SageMaker Studio using default presets and without the need to learn about domains or <a href=\"https://aws.amazon.com/iam/\">AWS IAM</a> roles.</p> \n<p>As an enterprise administrator, step-by-step instructions help you choose the right authentication method, connect to your third-party identity providers, integrate networking and security configurations, configure fine-grained access policies, and choose the right applications to enable in SageMaker Studio. You can also update settings at any time.</p> \n<p>To get started, navigate to the <a href=\"https://console.aws.amazon.com/sagemaker/home\">SageMaker console</a> and select either <strong>Set up for single user</strong> or <strong>Set up for organization</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-02.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-02.png\" alt=\"Amazon SageMaker Studio\" width=\"1782\" height=\"920\" /></a></p> \n<p>The single-user setup will start deploying a SageMaker Studio domain using default presets and will be ready within a few minutes. The setup for organizations will guide you through the configuration step-by-step. Note that you can choose to keep working with the classic SageMaker Studio experience or start exploring the new experience.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-03.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/20/2023-sm-studio-03.png\" alt=\"Amazon SageMaker Studio\" width=\"1377\" height=\"653\" /></a></p> \n<p><b><u>Now available<br /> </u></b>The new Amazon SageMaker Studio experience is available today in all AWS Regions where SageMaker Studio is available. Starting today, new SageMaker Studio domains will default to the new web-based interface. If you have an existing setup and want to start using the new experience, check out the <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/studio-updated-migrate.html\">SageMaker Developer Guide</a> for instructions on how to migrate your existing domains.</p> \n<p>Give it a try, and let us know what you think. You can send feedback to <a href=\"https://repost.aws/tags/TA_dl6yFpeQ_SfoM44dVKIkw/amazon-sagemaker-studio\">AWS re:Post for Amazon SageMaker Studio</a> or through your usual AWS contacts.</p> \n<p><a href=\"https://console.aws.amazon.com/sagemaker/home\">Start building your ML projects with Amazon SageMaker Studio today!</a></p> \n<p>— <a href=\"https://www.linkedin.com/in/antje-barth/\" target=\"_blank\">Antje</a></p>","author":"Antje Barth","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"071073d43a79692c0aed8a91c452052bfd09b1f8f091d41ddee06aa8eeef0f03","category":"Tech"}