{"title":"Pattern and predictor of hookworm re-infection among schoolchildren in three districts of Amhara Region, northwest Ethiopia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303502","date":1716904800000,"content":"<p>by Shegaw Belay, Getaneh Alemu, Tadesse Hailu</p>\r\nBackground <p>Despite integrated prevention and control measures, the prevalence of hookworm is still high in Ethiopia. The re-infection rates and predictors are poorly addressed. Therefore, this study aimed to determine the patterns of hookworm re-infection rates and predictors among schoolchildren in northwest Ethiopia.</p> Methods <p>A prospective follow-up study was conducted among 86 schoolchildren from May to December 2022. Data on predictors was collected using a questionnaire. Stool samples were collected and processed via Kato-Katz, McMaster, and spontaneous tube sedimentation techniques. All hookworm-infected children were treated with albendazole and followed for six months. The re-infection rates of hookworm were checked in the 4<sup>th</sup> and 6<sup>th</sup> months. Data was entered into Epi-data version 3.1 and analysed using SPSS version 25. Descriptive statistics were used to compute the re-infection rate. The associations of predictors with hookworm re-infection rates were calculated by logistic regression. Variables with a <i>p-value</i> &lt; 0.05 were considered statistically significant.</p> Results <p>Of the 86, 81 schoolchildren completed the study. The prevalence of hookworm re-infection in the 4<sup>th</sup> and 6<sup>th</sup> months was 23.5% and 33.3%, respectively. Living with family members greater than five (p = .017), poor utilization of latrine (p = .008), infrequent shoe wear (p = .039), and participating in irrigation (p = .020) were the predictors significantly associated with hookworm re-infections.</p> Conclusions <p>The re-infection rate was high during the fourth and sixth months. Participating in irrigation, infrequent shoe wear, and poor latrine utilization were predictors of hookworm re-infection. Therefore, mass drug administration, regular shoe wearing, and health education should be advocated.</p>","author":"Shegaw Belay","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0715982ee23d4d562cd35d163c9fe52035e842534eee778202cecc7b96498612","category":"Interdisciplinary"}