{"title":"MacRumors Giveaway: Win an Air Travel Backpack From WaterField Designs","link":"https://www.macrumors.com/2021/08/13/macrumors-giveaway-waterfield-designs-travel-backpack/","date":1628877600000,"content":"For this week's <a href=\"https://www.macrumors.com/guide/giveaway/\">giveaway</a>, we've teamed up with <a href=\"https://www.sfbags.com/\">WaterField Designs</a> to offer <em>MacRumors</em> readers a chance to win an <a href=\"https://www.sfbags.com/products/air-travel-backpack\">Air Travel Backpack</a> and an <a href=\"https://www.sfbags.com/products/air-caddy\">Air Caddy</a>, both of which are perfect for use with Apple's iPads and Macs.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/air-travel-backpack-main.jpg\" />\r\n<br />\r\nWaterField Designs makes a wide range of bags for Apple devices, and the Air Travel Backpack is its newest offering, announced earlier this year. Designed specifically for travel purposes, the 45L Air Travel Backpack is the maximum size allowed for a carry-on (16\" x 7.5\" x 22.5\").\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/air-travel-worn-on-back.jpg\" />\r\n<br />\r\nPriced at $419, the Air Travel Backpack has two separate compartments for tech gear and personal items, with the mobile office section equipped with padded sleeves for two laptops and a series of pockets to store your accessories.\r\n<br />\r\n\r\n<br />\r\nThe larger laptop compartment fits laptops up to 15\" x 10\", so it works with Apple's largest 16-inch MacBook Pro. The second compartment can also be usd for a tablet, and can accommodate the 12.9-inch <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> with attached Magic Keyboard.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/air-travel-office-side.jpg\" />\r\n<br />\r\nWaterField Designs created the Air Travel Backpack to serve as a mobile office, so it has a ton of pockets and compartments for organizing cables, cords, chargers, pens, earbuds, and more.\r\n<br />\r\n\r\n<br />\r\nThe personal items compartment has a large interior for holding clothing, shoes, and toiletries. Two sturdy straps are included to keep everything secure, and there are two mesh zipper pockets for smaller items.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/air-travel-personal-compartment.jpg\" />\r\n<br />\r\nBoth main compartments of the Air Travel Backpack are lined with a bright yellow material to make it easy to see what's inside and find just what you're looking for.\r\n<br />\r\n\r\n<br />\r\nEverything inside is kept secure through a D-ring that's able to attach to the double zipper pulls to keep it closed until you're ready to access it, and you can also lock the zipper pulls together as they're sized to work with a small lock. The Air Travel Backpack can be carried vertically, worn on the back, or carried horizontally like a duffel bag. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/air-travel-back.jpg\" />\r\n<br />\r\nAs with all WaterField Designs products, the Air Travel Backpack is durable, well-made, and designed to hold up to heavy usage for years to come. It is available in a black ballistic nylon with leather accents in various colors, or in a waxed canvas material that's water resistant.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/air-travel-office-open.jpg\" />\r\n<br />\r\nAs an optional accessory for the Air Travel Backpack, WaterField Designs offers the Air Caddy, a pouch that's meant to hold your in-flight entertainment options. Available for the <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a>, <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a>, or ‌iPad Pro‌ models, the Air Caddy is available in waxed canvas or ballistic nylon to match the Air Travel Backpack, and it is able to house your tablet and any accessories and add-ons you might need.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/air-caddy-in-hand.jpg\" />\r\n<br />\r\nIt's sized to fit inside the main laptop compartment of the Air Travel Backpack, and it's also the right size to tuck right into a seat back compartment, making it an ideal travel companion.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/air-travel-air-caddy.jpg\" />\r\n<br />\r\nWe have an Air Travel Backpack and an Air Caddy prize for one lucky <em>MacRumors</em> reader. To enter to win our ‌giveaway‌, use the Gleam.io widget below and enter an email address. Email addresses will be used solely for contact purposes to reach the winners and send the prizes. You can earn additional entries by subscribing to our <a href=\"https://my.leadpages.net/leadbox/145ef7173f72a2%3A104a9fa76b46dc/5754903989321728/\">weekly newsletter</a>, subscribing to our <a href=\"https://www.youtube.com/user/macrumors\">YouTube channel</a>, following us on <a href=\"https://twitter.com/macrumors\">Twitter</a>, following us on <a href=\"https://www.instagram.com/macrumors/\">Instagram</a>, or visiting the <em>MacRumors</em> <a href=\"https://www.facebook.com/MacRumors\">Facebook page</a>.\r\n<br />\r\n\r\n<br />\r\nDue to the complexities of international laws regarding giveaways, only <strong>U.S. residents who are 18 years or older and Canadian residents (excluding Quebec) who have reached the age of majority in their province or territory are eligible to enter</strong>. To offer feedback or get more information on the ‌giveaway‌ restrictions, please refer to <a href=\"http://forums.macrumors.com/threads/macrumors-giveaways-why-are-they-only-open-to-u-s-residents.1918337/\">our Site Feedback section</a>, as that is where discussion of the rules will be redirected.\r\n<br />\r\n\r\n<br />\r\n<div><a href=\"https://gleam.io/2TEtj/waterfield-designs-giveaway\">WaterField Designs Giveaway</a></div>The contest will run from today (August 13) at 11:00 a.m. Pacific Time through 11:00 a.m. Pacific Time on August 20. The winner will be chosen randomly on August 20 and will be contacted by email. The winner will have 48 hours to respond and provide a shipping address before a new winner is chosen.<div>Tag: <a href=\"https://www.macrumors.com/guide/giveaway/\">giveaway</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/13/macrumors-giveaway-waterfield-designs-travel-backpack/\">MacRumors Giveaway: Win an Air Travel Backpack From WaterField Designs</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/macrumors-giveaway-win-an-air-travel-backpack-from-waterfield-designs.2307471/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=AwjZWQdcAm8:dBcERD5a7WQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=AwjZWQdcAm8:dBcERD5a7WQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/AwjZWQdcAm8\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0721d00ae784a39b6f94cfec716fdf4e6012dcd5a140220cc5a216749e5b4845","category":"Apple"}