{"title":"New Associations with HIV Predisposing and Protective Alleles of the HLA System in a Peruvian Population","link":"https://www.preprints.org/manuscript/202410.0064/v1","date":1727780594000,"content":"Accurate determination of an individual’s unique human leukocyte antigen (HLA) allele holds important significance in evaluating the risk associated with autoimmune and infectious diseases, such as human immunodeficiency virus (HIV) infection. Several allelic variants within the HLA system have been linked to either increased protection or susceptibility in the context of infectious and autoimmune diseases. This study aimed to determine the frequency and association of HLA alleles between people living with HIV (PLHIV) as the case group and HIV-uninfected Peruvian individuals with high-risk behavior of sexual transmission diseases as the control group. Whole exome sequencing (WES) was used to determine high-resolution HLA allelotypes using OptiType and arcasHLA tools. The HLA alleles present in HLA classes I (A, B, and C loci) and II (DPA1, DPB1, DQA1, DQB1 and DRB1 loci) were determined in a cohort of 59 PLHIV (cases) and 44 HIV-uninfected individuals (controls). The most frequent HLA alleles were A*02:01, DPB1*04:02 and DQB1*03:419 at 36%, 30% and 28% prevalence in general population. \nWe found that C*07:01 (p = 0.0101; OR = 10.222, 95% IC: 1.40–74.55), DQA1*03:02 (p = 0.0051; OR = 5.297, 95% IC: 1.48–19.02) and DRB1*09:01 (p = 0.0119; OR = 4.788, 95% IC: 1.39–16.44) showed an association with susceptibility to HIV infection, while DQB1*03:419 (p = 0.0478; OR = 0.327, 95% IC: 0.11–0.96) was associated with protection from HIV infection. Our findings contribute to the knowledge of HLA allele diversity in the Peruvian population (around 70% South American indigenous ancestry), lay the groundwork for further valuable large-scale use of HLA typing and offer a novel association of HIV infection that is relevant to vaccine studies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0722ca28167155c07f89bb3390c46c7ae449add3b47a214b5eee2fbee891c74f","category":"Interdisciplinary"}