{"title":"Molecular Pathway and Immune Profile Analysis of IPMN-Derived versus PanIN-Derived Pancreatic Ductal Adenocarcinomas","link":"https://www.preprints.org/manuscript/202409.2045/v1","date":1727351234000,"content":"Introduction: Intraductal papillary mucinous neoplasms (IPMN) are commonly-detected pancreatic cysts that may transform into pancreatic ductal adenocarcinoma (PDAC). Predicting which IPMNs will progress to PDAC remains a clinical challenge. Moreover, identifying those clinically evident IPMNs for which a surveillance approach is best is a dire clinical need. Therefore, we aimed to identify molecular signatures that distinguished between PDAC with and without clinical evidence of a IPMN to identify novel molecular pathways related to IPMN-derived PDAC that could help guide biomarker development. Methods: Data from the Oncology Research Information Exchange Network (ORIEN) multi-institute sequencing project was utilized to analyze 66 PDAC cases from Moffitt Cancer Center and The Ohio State University Wexner Medical Center for which tumor whole transcriptome sequencing datasets were generated. Cases were classified based on whether a tumor had originated from an IPMN (n=16) or presumably through the pancreatic intraepithelial neoplasia (PanIN) pathway (n=50). We then performed differential expression and pathway analysis using Gene-Set Enrichment Analysis (GSEA) and Pathway Analysis with Downweighted Genes (PADOG) algorithms. We also analyzed immune profiles using the Tumor-immune Microenvironment Deconvolution Web-portal for Bulk Transcriptomics (TIMEx). Results: Both GSEA and TIMEx indicate that PanIN-derived PDAC tumors enrich inflammatory pathways (complement, hedgehog signaling, coagulation, inflammatory response, apical surface, IL-2/STAT5, IL-6/STAT3, EMT, KRAS signaling, apical junction, IFN-gamma, allograft rejection) and are comparatively richer in almost all immune cell types than those from IPMN-derived PDAC upon deconvolution. IPMN-derived tumors were enriched in metabolic and energy generating pathways (oxidative phosphorylation, unfolded protein response, pancreas beta cells, adipogenesis, fatty acid metabolism, protein secretion). Further, the metabolic-linked gene signature enriched in the IPMNderived samples is associated with a cluster of early stage and long survival (top 4th quartile) PDAC cases from the Cancer Genome Atlas (TCGA) expression database. Intriguingly, the gene most significantly upregulated for both the improved survival group and IPMN-derived PDAC was gastrokine-2 (GKN2, padj&lt;0.001), a gene upregulated in PDAC precursor lesions (compared to PDAC). Conclusions: Our data suggest that IPMN-derived and PanIN-derived PDACs differ in the expression of immune profiles and metabolic pathways. These initial findings support future studies to assess the accuracy of identifying PDACs arising from IPMN lesions based on either GKN2 expression or their metabolic or immune profiles and explore mechanisms to explain these findings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"072ecc1c79da3adc9f3cd5a286b2eab224a038f39151a1f90d15bbac2e9879a0","category":"Interdisciplinary"}