{"title":"EPA: Chemicals called PFAS will see more research and new regulations","link":"https://arstechnica.com/?p=1805774","date":1634666440000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1235404671-800x532.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1235404671.jpg\">Enlarge</a> <span>/</span> Michael Regan, administrator of the Environmental Protection Agency (EPA), has announced a major effort to handle environmental contamination by chemicals called PFAS. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/michael-regan-administrator-of-the-environmental-protection-news-photo/1235404671?adppopup=true\">Bloomberg / Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Monday, the Environmental Protection Agency announced what it called a \"comprehensive national strategy\" to handle pollution by a group of industrial chemicals that are collectively called PFAS. These chemicals are relatively inert and persist for decades in the environment; as a result, there are many sites where they pollute the ground or water. And there are some indications that they can cause health issues if they accumulate at sufficient levels.</p>\n<p>But the fact that the family of chemicals is so large has made them difficult to study—and their pollution difficult to manage. The EPA's announcement indicates that the agency has started an expansive program to handle these challenges, from expanding the study of individual PFAS chemicals to tracing contamination and limiting future pollution.</p>\n<h2>PFAS chemistry and health</h2>\n<p>\"PFAS\" stands for both per- and poly-fluoroalkyl substances. Essentially, they are large hydrocarbon chains in which some or all of the hydrogens are swapped out for fluorines. The fluorines ensure that the chemicals do not interact well with water, making them excellent options for waterproof treatments. They're also very unreactive, meaning they don't break down readily in the environment. Thus, PFAS contamination can persist for decades.</p></div><p><a href=\"https://arstechnica.com/?p=1805774#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1805774&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"072f02c0a056a13e90b73377a07fe9a162141c2113494b9cd7c72f03945ac5d5","category":"Tech"}