{"title":"Mortality risk of Severe Acute Respiratory Syndrome cases classified as COVID-19: A longitudinal study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309413","date":1725026400000,"content":"<p>by Nádia Cristina Pinheiro Rodrigues, Joaquim Teixeira-Netto, Denise Leite Maia Monteiro, Mônica Kramer de Noronha Andrade</p>\r\nBackground <p>The COVID-19 pandemic has significantly impacted global health, with diverse factors influencing the risk of death among reported cases. This study mainly analyzes the main characteristics that have contributed to the increase or decrease in the risk of death among Severe Acute Respiratory Syndrome (SARS) cases classified as COVID-19 reported in southeast Brazil from 2020 to 2023.</p> Methods <p>This cohort study utilized COVID-19 notification data from the Sistema de Vigilância Epidemiológica (SIVEP) information system in the southeast region of Brazil from 2020 to 2023. Data included demographics, comorbidities, vaccination status, residence area, and survival outcomes. Classical Cox, Cox mixed effects, Prentice, Williams &amp; Peterson (PWP), and PWP fragility models were used to assess the risk of dying over time.</p> Results <p>Across 987,534 cases, 956,961 hospitalizations, and 330,343 deaths were recorded over the period. Mortality peaked in 2021. The elderly, males, black individuals, lower-educated, and urban residents faced elevated risks. Vaccination reduced death risk by around 20% and 13% in 2021 and 2022, respectively. Hospitalized individuals had lower death risks, while comorbidities increased risks by 20–26%.</p> Conclusion <p>The study identified demographic and comorbidity factors influencing COVID-19 mortality. Rio de Janeiro exhibited the highest risk, while São Paulo had the lowest. Vaccination significantly reduces death risk. Findings contribute to understanding regional mortality variations and guide public health policies, emphasizing the importance of targeted interventions for vulnerable groups.</p>","author":"Nádia Cristina Pinheiro Rodrigues","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0732f4c6620770b1273513d489e6c033f6cf766baad92b6ced4e48498b1b8dc8","category":"Interdisciplinary"}