{"title":"Effect of excess ionospheric delay during six major geomagnetic storms on GPS positioning in Indian sector","link":"http://link.springer.com/10.1007/s11600-023-01246-7","date":1722470400000,"content":"<h3>Abstract</h3>\n                    <p>Some of the extreme space weather events like the geomagnetic storm of 17–18 March 2015 have produced dramatic effects on low-latitude ionosphere as reported in various studies. Similarly, some of the extreme storms are studied to emphasize the anomalous deviations in ionospheric delay; however, the effects of excess ionospheric delay on GPS-based positioning are rarely reported from India. This paper presents a robust analysis including estimation of GPS receiver position during 6 major geomagnetic storms using dual frequency GPS signals in L1 and L2 bands. Epoch-wise solution estimates are computed using precise orbit SP3 files for satellite orbit and clock corrections and receiver specific differential code biases are obtained from IGS-CODE center. A range domain Kalman filter has also been developed to smooth the 30 s sampled code pseudorange using carrier phase data and resolve the initial ambiguity. Then, the precise positioning residuals are estimated in two different cases of ionospheric corrected and ionospheric uncorrected error models. We then compare the results with ionospheric corrected position estimates to finally obtain the effect of excess daytime ionospheric variations during main phase of some extreme geomagnetic storms. Results from 5 GPS receivers located within 77°–80° E longitude sector are obtained for two 2-hour windows covering local noon during 6 storms including the St. Patrick’s Day storm. The effect of severity of the storms and their impact on static precise positioning are brought out by comparing the results with performance on a quiet day. It is found that the magnitude of error in estimated altitude exhibits maximum deviations due to ionospheric variations during storms, and the dip latitude of station is important in terms of magnitude of ionospheric error in positioning over the equatorial ionization anomaly region.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"074f979e39962092f20b8106bbd93fefb299f9c1272943990bd386c36913482e","category":"Environment"}