{"title":"Effect and mechanism of freezing on the quality and structure of soymilk gel induced by different salt ions","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13354?af=R","date":1718348660000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The increasing attention toward frozen soy-based foods has sparked interest. Variations exist in the quality and structure of soymilk gels induced by different salt ions, leading to diverse changes post-freezing. This study compared and analyzed the effects of calcium chloride (CC), magnesium chloride (MC) and calcium sulfate (CS) on the quality characteristics and protein structure changes of soymilk gels (CC-S, MC-S and CS-S) before and after freezing, and clarified the mechanisms of freezing on soymilk gel.</p>\n<h2>RESULTS</h2>\n<p>The formation rate of soymilk gel is influenced by the type of salt ions. In comparison to CS and MC, soymilk gel induced by CC exhibited the fastest formation rate, highest gel hardness, lowest moisture content, and smaller gel pores. However, freezing treatment deteriorated the quality of soymilk gel induced by different salt ions, leading to a decline in textural properties (hardness and chewiness). Among these, the textual state of CC-induced soymilk gel remained optimal, exhibiting the least apparent damage and minimal cooking loss. Freezing treatments prompt a transition of soymilk gel secondary structure from β-turns to β-sheets, disrupting the protein's tertiary structure. Furthermore, freezing treatments also fostered the crosslinking between soymilk gel protein, increasing the content of disulfide bonds.</p>\n<h2>CONCLUSION</h2>\n<p>The quality of frozen soymilk gel is influenced by the rate of gel formation induced by salt ions. After freezing, soymilk gel with faster gelation rates exhibited a greater tendency for the transformation of protein–water interactions into protein–protein interactions. They showed a higher degree of disulfide bond formation, resulting in a more tightly knit and firm frozen gel network structure with denser and more uniformly distributed pores. © 2024 Society of Chemical Industry.</p>","author":"Xiaoyu Xia, \nXinxin Yang, \nYing Zhu, \nYing Sun, \nXiuqing Zhu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"074f27ff1c758548dec0629a3f951d4753fcb8cf905656c4900fe27b2c831c74","category":"Environment"}