{"title":"Optimizing Spring Maize Growth and Yield through Balanced Irrigation and Nitrogen Application: A TOPSIS Method Approach","link":"https://www.preprints.org/manuscript/202406.1117/v1","date":1718604754000,"content":"The current design of irrigation and fertilization systems often depends on a single index, leading to irrational systems due to the lack of a comprehensive multi-index evaluation. The aim of this study is to optimize the irrigation and nitrogen fertilizer application levels of spring maize using the TOPSIS method, in order to achieve a balance between growth characteristics, yield, water use efficiency, and soil nitrogen content. In the typical semi-arid region of Northeast China, through precise control experiments from 2022 to 2023, we adopted a two factor quadratic saturation D-optimal design method to study the effects of different irrigation amounts (145.40, 271.70, 348.20, 436.20 mm) and nitrogen fertilizer application amounts (34.80, 185.90, 277.40, 382.80 kg·hm-2) on spring maize. Results indicate that increasing both irrigation and nitrogen application rates can enhance dry matter accumulation by 15.17% to 32.70%. The impact of irrigation and fertilization on the net photosynthetic rate (Pn) of spring maize was found to be greater for irrigation amount than nitrogen application, particularly at 9:00 am and 13:00 pm, and slightly less so at 11:00 am and 15:00 pm. Concurrently, there was a significant increase in total nitrogen (TN1 by 20.85% for 0-20 cm soil layer, TN2 by 33.33% for 20-40 cm soil layer) and alkali-hydrolyzed nitrogen (AHN1 by 14.65% for 0-20 cm, AHN2 by 28.86% for 20-40 cm). Yields improved by 12.02% to 44.09%, and water use efficiency (WUE) saw an increase ranging from 20.08% to 140.07%. The optimal water and fertilizer management mode for spring maize SBDI (shallow buried drip irrigation) in semi-arid areas was determined through comprehensive analysis using TOPSIS entropy weight method. When the irrigation amount is 436.20 mm and the nitrogen fertilizer application amount is 277.40 kg·hm-2, it can significantly promote the accumulation of dry matter, yield, water use efficiency, photosynthetic characteristics, and soil nitrogen content of spring maize. This study provides a theoretical basis for the practical application of SBDI water fertilizer coupling technology for spring maize.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"07564f63a0d871beb6eb34db037c97e4eaabc46a03c1527606c4f2617b98906a","category":"Interdisciplinary"}