{"title":"109 Evaluation of net energy, standardized ileal digestible lysine, and soybean meal content interaction in 13 to 25 kg pigs using a central composite design","link":"https://academic.oup.com/jas/article/102/Supplement_2/182/7664805?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Pigs [n = 4,683; 337 × 1050, PIC; initial body weight (BW) = 13.0 ± 0.01 kg] were used in a 21-d trial to investigate the interaction of net energy (NE), standardized ileal digestible lysine (SID Lys), and soybean meal (SBM) content used at five different levels on growth performance of nursey pigs. Pigs were housed in mixed sex pens with 35 pigs per pen and assigned in a randomized complete block design to 15 dietary treatments using a circumscribed central composite design (CCD). Factorial and axial points had 7 repetitions, and the central points had a total of 24. Eight diets were formulated to various levels of NE, SID Lys, and SBM and blended to create the 15 dietary treatments. The NE ranged from 2,334 to 2,762 kcal/kg, SID Lys from 1.08 to 1.52%, and SBM from 25.5 to 35.9%. Diets were corn-soybean meal based and soy hulls and soybean oil were added to reduce or increase NE content of the diet. Feed grade amino acids and SBM were used to adjust SBM and SID Lys content and to maintain SID Thr, Trp, Met, Val, and Ile ratios relative to SID Lys. For NE, a linear effect (<span>P</span> ≤ 0.052) was observed for average daily gain (ADG) and average daily feed intake (ADFI), and linear and quadratic effect was found (<span>P</span> ≤ 0.047) for gain to feed ratio (G:F) with a reduction in growth performance as NE increased due to reduction in SID Lys:calorie. When increasing SID Lys, ADG (<span>P</span> ≤ 0.044) and G:F (<span>P</span> ≤ 0.020) increased quadratically (Table). Increasing SBM content linearly improved ADG (<span>P</span> = 0.039) and G:F (<span>P</span> &lt; 0.001), respectively. There was also a significant interaction between SID Lys and SBM for G:F (<span>P</span> = 0.082), where SID Lys positively impacted G:F as SBM increased in the diet. When including the significant terms, the resulting models can be used to predict the ADG (kg) response = [0.579392 + (-0.0063389 × NE) + (0.0260796 × Lys) + (0.0067428 × SBM%) + (-0.0065721 × Lys²) adjusted R<sup>2</sup> = 0.36], and G:F (kg/kg) response = [0.7013215 + (0.0035198 × NE) + (0.0264389 × Lys) + (0.0060863 × SBM%) + (-0.0048012 × NE²) + (-0.0031838 × Lys²) + (-0.0034413 × Lys × SBM) adjusted R<sup>2</sup> = 0.65]. In conclusion, using a CCD, increasing SID Lys resulted in a quadratic improvement in ADG and G:F, with this improvement being greater when SBM also increased. Overall, we observed few interactions between SID Lys, SBM, and NE.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"075a821ab90362f3ebb8e2b7c148dd5ad800121854bc4b7e723e8e8b8d7ab406","category":"Environment"}