{"title":"Before Cool was Cool: Cryogenic Electron Microscopy Techniques for Materials Science","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.1072/7720351?rss=1","date":1721779200000,"content":"<span>Lena Kourkoutis was a pioneer in the electron microscopy community and among other contributions her group demonstrated the exceptional promise of cryogenic focused ion beam sample preparation [<a href=\"#ozae044.1072-B1\">1</a>] and high resolution cryogenic STEM imaging [<a href=\"#ozae044.1072-B2\">2</a>] techniques. In honor of her vision to push the frontiers of cryogenic techniques for electron microscopy in materials science, this talk will highlight some of our similar explorations into cryogenic electron microscopy technique development. Beginning with early studies using cryogenic stages for a focused ion beam instrument [<a href=\"#ozae044.1072-B3\">3</a>], we have explored cryogenic sample preparation for polymers [<a href=\"#ozae044.1072-B4\">4</a>], solid-liquid interfaces [<a href=\"#ozae044.1072-B5\">5</a>] and also <span>in situ</span> testing at cryogenic temperatures [<a href=\"#ozae044.1072-B6\">6</a>]. More recently, we have utilized the technique of cryogenic 4D-STEM (nanobeam diffraction imaging) at to directly image the structure of ‘beam-sensitive’ samples such as semicrystalline polymers. We will show how we have optimized beam parameters for these studies [<a href=\"#ozae044.1072-B7\">7</a>] and provide examples of imaging polymer structure from organic semiconductor molecular thin films [<a href=\"#ozae044.1072-B8\">8</a>], polymeric organic mixed ionic–electronic conductors, isotactic polypropylene (iPP)/ethylene-octene copolymer (EO) multilayer films [<a href=\"#ozae044.1072-B9\">9</a>], and conductive polymer binders used in Li-ion batteries [<a href=\"#ozae044.1072-B10\">10</a>]. Lastly, this talk will explore some recent developments [<a href=\"#ozae044.1072-B11\">11</a>, <a href=\"#ozae044.1072-B12\">12</a>] in terms of instrumentation for cryogenic electron microscopy and look towards the exciting future [<a href=\"#ozae044.1072-B13\">13</a>] of low temperature high resolution STEM imaging that Lena Kourkoutis championed [<a href=\"#ozae044.1072-B14\">14</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"075db6cd812a11614ee22cfb5db7fa4a8142538906b7240234d143aab8abadbd","category":"Environment"}