{"title":"Apple Discusses 15-Inch MacBook Air's Design in New Interview","link":"https://www.macrumors.com/2023/06/13/apple-discusses-15-inch-macbook-air-design/","date":1686663758000,"content":"Apple's VP of hardware engineering Kate Bergeron and marketing employee Laura Metz recently <a href=\"https://www.tomsguide.com/news/macbook-air-15-inch-exclusive-how-apple-made-the-worlds-thinnest-15-inch-laptop\">spoke with <em>Tom's Guide</em>'s Mark Spoonauer</a> about the design of the new 15-inch MacBook Air, including its larger display and two additional speakers.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/15-inch-MacBook-Air-hands-on.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nBergeron said the 15-inch MacBook Air having the same battery life as the 13-inch model is the result of \"thermal control loops and software optimizations.\"<blockquote>There's definitely thermal control loops and software optimizations that we use.\r<br />\n\r<br />\nThe workloads for a typical MacBook Air owner are fairly bursty, meaning they may do something for a few minutes and then walk away from their computer and either have a background process running that's pretty light or just doing nothing at all. And so we can go in and tweak the levers in the silicon and software to be able to take advantage of these gaps in time and really take the power down to the most minimal level.</blockquote>When asked if Apple considered adding an additional USB-C port or SD card slot to the 15-inch MacBook Air, Metz said Apple believes the existing port selection is \"very complimentary to the thin and light design of the product.\"\r<br />\n\r<br />\nThere aren't too many particularly revealing comments shared <a href=\"https://www.tomsguide.com/news/macbook-air-15-inch-exclusive-how-apple-made-the-worlds-thinnest-15-inch-laptop\">in the interview</a>, but it is a worthwhile read for those interested in Apple's design considerations for the 15-inch MacBook Air. The laptop launched today following pre-orders last week.<br />This article, \"<a href=\"https://www.macrumors.com/2023/06/13/apple-discusses-15-inch-macbook-air-design/\">Apple Discusses 15-Inch MacBook Air's Design in New Interview</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-discusses-15-inch-macbook-airs-design-in-new-interview.2392798/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"075ecba16944c5c3c6bd33177d7472970d3ccf42c2228d6f0943facd9c1f0780","category":"Apple"}