{"title":"1x, tubeless tyres and disc brakes for Lizzie Deignan’s Roubaix-winning Trek Domane SLR","link":"https://www.bikeradar.com/features/pro-bike/lizzie-deignan-paris-roubaix-femmes/","date":1633193496000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/10/Lizzie-Deignan-–-Paris-Roubaix-2-d18c6b7.jpg?quality=45&amp;resize=620,413\" />                                            <p>Paris-Roubaix has always been a proving ground for radical and experimental setups and that was no different at the inaugural edition of the Paris-Roubaix Femmes women’s race, with Lizzie Deignan winning aboard a Trek Domane with 1x gearing, 30mm tubeless tyres and disc brakes.</p>\n<p>Deignan swapped Trek’s lightweight-aero Emonda for the Domane endurance bike for the cobbles of northern France. But while we’re used to seeing riders switch frames for the pavé, the rest of Deignan’s build was less familiar.</p>\n<p>These images show Deignan’s bike straight from the finish line, caked in mud from the 17 <em>secteurs</em> of cobbles. Deignan, a former winner of the Tour of Flanders, attacked on the first section of pavé to take a dominant win, staying clear for 80km.</p>\n<h2>1x for the Hell of the North</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Fresh from the finish line: Lizzie Deignan’s Roubaix-winning Trek Domane SLR.</span></figcaption><span> <i>Jacob Kennison</i></span></div>\n<p>Disc brakes may now be standard in professional cycling, and we expect every team in Sunday’s men’s race to use discs following <a href=\"https://www.bikeradar.com/news/team-ineos-grenadiers-disc-brakes/\">Ineos-Grenadiers’ move away from rim brakes</a>, but 1x drivetrains have failed to have a significant impact on the road outside of time trials.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A 50-tooth 1x drivetrain for Deignan’s Domane.</span></figcaption><span> <i>Jacob Kennison</i></span></div>\n<p>However, Deignan’s Trek-Segafredo women’s team opted for a 1x setup for Roubaix, pairing a 50-tooth front chainring (fitted with a Quarq power meter) with a 12-speed 10-33t cassette and SRAM’s wireless electronic Red eTap AXS rear derailleur.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> SRAM’s Red eTap AXS provided 12-speed shifting across the cassette.</span></figcaption><span> <i>Jacob Kennison</i></span></div>\n<p>With the 116k Paris-Roubaix Femmes played out predominantly over flat roads, Deignan had little need for a front derailleur, though the British rider had a K-Edge chain catcher in place to provide some additional security over the harsh cobbles.</p>\n<h2>The tide is turning for tubeless</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Could the 2021 editions of Paris-Roubaix be where tubeless tyres really make their mark on the pro peloton?</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>As for tyre choice, the 2021 editions of Paris-Roubaix may be the races where <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless tyres</a> truly make their mark at road cycling’s top table.</p>\n<p>Professional cyclists have used tubular tyres since the dawn of time, with handmade Dugast and FMB tubular tyres a common sight at the cobbled Classics in years gone by, but that commitment is beginning to show signs of waning.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Deignan used a chain catcher to provide some additional security over the cobbles.</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>Julian Alaphilippe won last weekend’s men’s World Championship road race on clincher tyres and <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tubes</a> – his Deceuninck-QuickStep team have been using clinchers through the 2021 season – and tubeless tyres will see widespread use across both of this weekend’s Roubaix races, both in Saturday’s Femmes edition and Sunday’s men’s race to come.</p>\n<p>Deignan’s Bontrager Aeolus RSL 37 wheels were fitted with 30mm-wide <a href=\"https://www.bikeradar.com/reviews/components/tyres/road-bike-tyres/pirelli-p-zero-race-tlr-28mm-tyre-review/\">Pirelli P-Zero Race TLR tyres</a>, providing plenty of cushioning and flat protection over the cobbles.</p>\n<h2>No blips for Deignan’s assault on Roubaix</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Deignan used SRAM’s blip buttons for quick shifts from the tops – but there were no blips on her march to victory in Roubaix.</span></figcaption><span> <i>Jacob Kennison</i></span></div>\n<p>Other features of Deignan’s bike include SRAM’s blip shifters on the handlebar – allowing for quick shifts from the tops, where riders normally prefer to place their hands when bouncing over the pavé – and a Wahoo Elemnt Bolt computer.</p>\n<p>Details of the key cobbled sections are taped to the 2015 world champion’s stem, with the hydraulic hoses running underneath for a semi-integrated setup.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Lucky number 13 for Deignan.</span></figcaption><span> <i>Jacob Kennison</i></span></div>\n<p>Trek’s Domane frame is more familiar than the rest of the build still well worth mentioning, having been used to great effect in the Classics since it was <a href=\"https://www.bikeradar.com/news/trek-domane-a-new-bike-for-the-cobbled-classics/\">first launched in 2012</a>. The <a href=\"https://www.bikeradar.com/news/trek-domane-mk-3/\">third-generation Domane SLR</a>, launched in 2019, features Trek’s comfort-enhancing IsoSpeed technology in headset and top tube.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The 32-year-old has added Paris-Roubaix Femmes to a <em>palmares</em> that already includes the Tour of Flanders, Liège–Bastogne–Liège, Strade Bianche and UCI Road World Championships.</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>Finally, Deignan’s race number sits on the seatmast, filthy from pounding 30km of cobblestones.</p>\n<p>But, despite being handed the number 13 for the day, there was no stopping Deignan as she made history in Roubaix.</p>","author":"George Scott","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"07658a6877c335afbeb958273aaeb4cf0205c3d8f4cc15f97f4d9304567a52e1","category":"Cycling"}