{"title":"Optimization of ultrasound‐assisted pectin recovery from cocoa by‐products using response surface methodology","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13498?af=R","date":1720851246000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>This study aimed to address the significant challenges associated with agricultural and cocoa waste disposal within the context of global food waste concerns. The magnitude of global food waste is staggering, estimated at 1.6 Gt of primary product equivalents, with 1.3 Gt attributed specifically to the edible parts of food. Focusing on cocoa waste, which constitutes around 80% of total cocoa production, management poses a considerable environmental challenge, with over 60% of this waste either burnt or left to rot in plantations.</p>\n<h2>METHOD</h2>\n<p>Ultrasound-assisted extraction of pectin from cocoa pulp mucilage (CPM), cocoa pod husk (CPH), and cocoa bean shell (CBS) was achieved with a central composite design (CCD) using response surface methodology (RSM).</p>\n<h2>RESULTS</h2>\n<p>Ultrasound-assisted extraction takes into consideration independent factors such as temperature, sonication time, pH, solid–liquid ratio, and ultrasonic power intensity. This study achieved the highest yield, anhydrouronic acid content, and degree of esterification under optimum conditions – sonication time of 20 min, pH of 2.5, solid-solvent ratio of 1:40 g mL<sup>−1</sup>, and ultrasonic power intensity of 64 W cm<sup>−2</sup>. The composition and characterization of pectin showed that its anhydrouronic acid content was 68.59 ± 0.2% when extracted from CPH, 50.7 ± 0.5% when extracted from CBS, and 43.97 ± 0.17% when extracted from CPM with citric acid.</p>\n<h2>CONCLUSION</h2>\n<p>This study underscored the potential to reduce the environmental impact of cocoa waste, offering improved pectin extraction and sustainable methods for handling agricultural by-products. It is relevant for individuals interested in waste reduction and resource efficiency within the broader agricultural industry, showcasing the potential for practical and sustainable solutions in cocoa waste management. © 2024 Society of Chemical Industry.</p>","author":"K Sumana Mounya, \nAkkina Rajani Chowdary","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"076ee2e9f16ea60302be054749a6b275817e920e0ce7b19cc760efb1c05c856d","category":"Environment"}