{"title":"Individual quality overwrites carry‐over effects across the annual cycle of a long‐distance migrant","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14125?af=R","date":1717583959000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3bb7bbf1-15e2-4441-aa7b-80c1015151d3/jane14125-toc-0001-m.png\" alt=\"Individual quality overwrites carry-over effects across the annual cycle of a long-distance migrant\" />\n<p>Combining 13 years of breeding and tracking data with an experimental approach revealed that individual quality was dominant in determining seasonal interactions in a long-lived seabird. However, underlying carry-over effects were also present, although masked by quality, with breeding costs paid in higher energy expenditure and delayed onset of breeding.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nIn seasonal environments, the fitness of animals depends upon the successful integration of life-history stages throughout their annual cycle. Failing to do so can lead to negative carry-over effects where individuals are transitioning into the next season in different states, consequently affecting their future performance. However, carry-over effects can be masked by individual quality when individuals vary in their efficiency at acquiring resources year after year (i.e. ‘quality’), leading to cross-seasonal consistency in individual performance.\n\nHere we investigated the relative importance of carry-over effects and individual quality in determining cross-seasonal interactions and consequences for breeding success over the full annual cycle of a migratory seabird (black-legged kittiwake <i>Rissa tridactyla</i>).\n\nWe monitored the reproduction and annual movement of kittiwakes over 13 years using geolocators to estimate their breeding success, distribution and winter energy expenditure. We combined this with an experimental approach (clutch removal experiment, 2 years) to manipulate the reproductive effort irrespective of individual quality.\n\nPiecewise path analyses showed that successful breeders reproduced earlier and were more likely to breed successfully again the following year. This positive interaction among consecutive breeding stages disappeared after controlling for individual quality, suggesting that quality was dominant in determining seasonal interactions. Moreover, controlling experimentally for individual quality revealed underlying carry-over effects that were otherwise masked by quality, with breeding costs paid in higher energy expenditure and delayed onset of reproduction.\n\nWe highlight the need to combine an experimental approach along with long-term data while assessing apparent carry-over effects in wild animals, and their potential impact on fitness and population demography.\n</p>","author":"Don‐Jean Léandri‐Breton, \nKyle H. Elliott, \nArnaud Tarroux, \nBørge Moe, \nWilliam Jouanneau, \nFrançoise Amélineau, \nFrédéric Angelier, \nPierre Blévin, \nVegard Sandøy Bråthen, \nPer Fauchald, \nGeir W. Gabrielsen, \nAurélie Goutte, \nCharline Parenteau, \nSabrina Tartu, \nPierre Legagneux, \nOlivier Chastel","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"077b6b466f50b64fe9f6531a49b773ff2b38f5a6bcd274942f7b52e2779ec2b9","category":"Environment"}