{"title":"Biotic and abiotic factors drive multi-trophic interactions among spiders at different spatial scales in urban greenspaces","link":"https://academic.oup.com/jue/article/doi/10.1093/jue/juae008/7641575?rss=1","date":1712275200000,"content":"<span><div>Abstract</div>Urbanization is often detrimental to biodiversity, yet urban greenspaces can be managed to provide habitat for many arthropods. Understanding how anthropogenic filters influence processes of community assembly in urban ecosystems will inform conservation of species such as spiders, which provide natural pest control. Spiders are abundant in urban areas, but the relative importance of biotic and abiotic factors for structuring spider communities in urban greenspaces is unclear. We initiated the Cleveland Pocket Prairie Project in the legacy city of Cleveland, Ohio, where vacant lots and urban prairies were established across eight inner-city neighborhoods. In each greenspace, spiders were collected along with landscape and local environmental data in July 2017. Using a path analysis approach, we investigated the relative importance and strength of landscape and local environmental filters for influencing the structure of spider communities during mid-summer within this system. We found that spider community assembly was influenced by multiple abiotic and biotic drivers across spatial scales related to landscape composition, soil texture and quality, prey breadth, and habitat management designs. Web-building and active hunting spiders responded differently to these landscape and local drivers, highlighting the need to incorporate a functional perspective when studying community assembly. These findings suggest that a multi-scale approach to conservation management is needed to support biodiversity and associated biological control services in urban ecosystems.</span>","author":"","siteTitle":"Journal of Urban Ecology Current Issue","siteHash":"b2629340d80db12a388ca36fcbfe9116474ee0004e4144e67708fd2b8d69c975","entryHash":"077c977c81ea66154171188918fca9115d8e4f22054d84266bfc8f95b4f14785","category":"Environment"}