{"title":"Trends and cycles in rainfall, temperature, NDVI, IOD and SOI in the Mara-Serengeti: Insights for biodiversity conservation","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000388","date":1727877600000,"content":"<p>by Joseph O. Ogutu, Gundula S. Bartzke, Sabyasachi Mukhopadhyay, Holly T. Dublin, Jully S. Senteu, David Gikungu, Isaiah Obara, Hans-Peter Piepho</p>\r\n\r\nUnderstanding climate and vegetation trends and variations is essential for conservation planning and ecosystem management. These elements are shaped by regional manifestations of global climate change, impacting biodiversity conservation and dynamics. In the southern hemisphere, global climate change is partially reflected through trends in the hemispheric Southern Oscillation (SOI) and regional oscillations such as the Indian Ocean Dipole Mode (IOD). These phenomena influence rainfall and temperature changes, making it crucial to understand their patterns and interdependencies. Appropriately analyzing these variables and their interrelations therefore requires a robust multivariate statistical model, a tool seldom employed to extract patterns in climate and vegetation time series. Widely used univariate statistical methods in this context fall short, as they do not account for interdependencies and covariation between multiple time series. State-space models, both univariate and multivariate, adeptly analyze structural time series by decomposing them into trends, cycles, seasonal, and irregular patterns. Bivariate and multivariate state-space models, in particular, can provide deeper insights into trends and variations by accounting for interdependencies and covariation but are rarely used. We use univariate, bivariate and multivariate state space models to uncover trends and variations in historic rainfall, temperature, and vegetation for the Greater Mara-Serengeti Ecosystem in Kenya and Tanzania and potential influences of oceanic and atmospheric oscillations. The univariate, bivariate and multivariate patterns reveal several insights. For example, rainfall is bimodal, shows significant interannual variability but stable seasonality. Wet and dry seasons display strong, compensating quasi-cyclic oscillations, leading to stable annual averages. Rainfall was above average in both seasons from 2010–2020, influenced by global warming and the IOD. The ecosystem experienced recurrent severe droughts, erratic wet conditions and a 4.8 to 5.8°C temperature rise over six decades. The insights gained have important implications for developing strategies to mitigate climate change impacts on ecosystems, biodiversity, and human welfare.","author":"Joseph O. Ogutu","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"0789eedd2a0a2b2cb835b432ae06d48ae5686c21877e442087a1f67ef9f2b2c6","category":"Environment"}