{"title":"147 The ‘horse-side’ of host-microbe interactions and gastrointestinal homeostasis in the equine hindgut","link":"https://academic.oup.com/jas/article/102/Supplement_3/216/7757077?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Homeostasis is a complex physiological process that enables biological systems to maintain balanced internal environments in response to internal and external stimuli. In the equine gastrointestinal (GI) tract, homeostasis involves a network of factors that regulate gene expression, maintain the integrity of the mucosal barrier, and modulate immune responses to pathogenic microorganisms while supporting commensal bacteria that provide benefits to the host (Figure 1). These factors work together and respond to changes in diet, environment, external stress, and challenges by infectious agents or toxins. Proper gastrointestinal function is dependent on maintaining homeostasis in the system, and the dynamic interactions between the microbial population (the microbiota) and the equine host are central to this equilibrium. The regulation and interplay between the equine host and GI microbiota are evident in the distribution of distinct microbial communities within the various compartments of the equine hindgut. The contributions of each compartment to digestive physiology and the overlap with various stages of microbial fermentation in the equine hindgut are well-researched. What remains to be documented is gene expression in tissues of the equine GI and the underlying role this might play in the processes of digestion, physiology, and homeostasis in the GI. To better understand the roles that host gene expression plays in the interactions with the microbiota, it is critical that we investigate gene expression in the different tissues along the intestinal tract. Protein-coding genes are crucial in maintaining the health of the gastrointestinal tract. They direct the synthesis of various structural elements, molecular transporters, and digestive enzymes, which support digestion, nutrient absorption, and gut integrity. Non-coding genes also play an important role in regulating protein-coding gene expression, modulating immune responses, and maintaining gut barrier function. Moreover, there is evidence that non-coding transcripts regulate the composition of microbial communities in the GI tract. The presentation will focus on the current research and future directions for investigating protein-coding and non-coding gene expression to understand the mechanisms involved in the host-microbe interaction in the equine hindgut and their potential role in maintaining GI homeostasis.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"078e056b3452090c35fb4958bb3984ec1d6aab8a3b9bf9bb96c4cbf9c9f8f173","category":"Environment"}