{"title":"Chronology of drill cores and the inferred coastal environmental evolution on Haitan Island, South China","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3606?af=R","date":1709552061000,"content":"<h2>ABSTRACT</h2>\n<p>Southeastern China's coastal region is considered one of the key areas for studying prehistoric human–land relationships in the Western Pacific region. This region, which is rich in records of marine civilization, provides an ideal location for recording coastal environmental evolution. In this study, the chronological framework of three borehole cores recovered from Haitan Island, South China, near the Keqiutou group of sites, was established using both optically stimulated luminescence (OSL) and accelerator mass spectrometry radiocarbon (AMS <sup>14</sup>C) dating techniques. Various analyses, including lithologic characteristics, chroma, clay–water electric conductivity (EC), grain size and elemental geochemistry, were conducted to elaborate the sedimentary sequence and its paleoenvironmental implications. The findings suggest that (i) since the late Quaternary, the Haitan Island sedimentary sequence can be divided into three deposition stages: Old Red Sand formed during Marine Isotope Stage 3 (MIS3), intermittent sedimentation during the Last Glacial Maximum and coastal aeolian deposition during the Holocene. Furthermore, the study reveals that terrestrial debris was significant as a material source for Haitan Island. (ii) Due to the absence of tectonic uplift, Haitan Island has no thick marine sedimentary record during the Holocene period of high sea level. The Luyangpu coastal sand sheet can be dated to 2.78 ka, which is consistent with previous reports giving dates of 2.4 ka. Prior to the formation of the sand sheet, the sedimentary environment in the area was characterized by lagoon or marsh facies. (iii) Paleoanthropological activities were influenced by sedimentary environmental evolution and geomorphic processes, among others. The Keqiutou Culture experienced high sea levels, which created an intertidal environment near the site and facilitated fishing. However, regression at 5.7 ka led to terrestrial environments, which prompted the inhabitants to migrate. Approximately 3 ka ago, sea levels rose again, coinciding with the initiation of rice cultivation. These factors may have influenced the transition from the Neolithic to Bronze Age culture. This study reconstructs evolution of the sedimentary sequence since the late Quaternary, enhancing our understanding of past human–terrestrial relationship in the region.</p>","author":"Junjie Qiu, \nJianhui Jin, \nXinxin Zuo, \nXuechun Fan, \nJunjie Wei, \nDaiyu Xu, \nChenyang Hou","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"0793ecdfeba3566398bed61f207e71b6f4d004efa1823b3ddaaf966b28bda397","category":"Environment"}