{"title":"แอคเตือนภัยพิบัติในญี่ปุ่น ติดลิมิตโพสต์ใน X/Twitter ตอนเกิดเหตุแผ่นดินไหว - X แก้ไขให้ในเวลาต่อมา","link":"https://www.blognone.com/node/137475","date":1704283713000,"content":"<div><div><div><p>จากเหตุการณ์แผ่นดินไหวที่มีศูนย์กลางใกล้เมืองอิชิกาวะ ประเทศญี่ปุ่น เมื่อวันที่ 1 มกราคม ที่ผ่านมา มีประเด็นหนึ่งที่เกิดขึ้นคือบัญชี X หรือ Twitter เดิม ของ NERV แพลตฟอร์มเตือนภัยพิบัติในญี่ปุ่น ได้<a href=\"https://twitter.com/EN_NERV/status/1741752434635186344\">โพสต์ข้อความ</a>ว่าบัญชีของ NERV ตอนนี้ติดลิมิตในการโพสต์บน X แล้ว ทั้งบัญชีภาษาอังกฤษและภาษาญี่ปุ่น เนื่องจากมีการโพสต์อัพเดตสถานการณ์แผ่นดินไหวและสึนามิถี่มากเกินไป โดยข้อความนี้ถูกโพสต์ 2 ชั่วโมง หลังเกิดเหตุการณ์แผ่นดินไหว</p>\n<p>เวลาต่อมา NERV <a href=\"https://twitter.com/EN_NERV/status/1741795901239431196\">โพสต์อัพเดต</a>ว่าทาง X/Twitter ได้ติดต่อมาเพื่อทำการลงทะเบียนฉุกเฉินให้บัญชีของ NERV เป็นแบบสาธารณูปโภค (Public Utility) จึงทำให้ไม่ติดลิมิตการใช้ API โพสต์ข้อความ ซึ่งโพสต์นี้เกิดขึ้น 3 ชั่วโมงหลังจากโพสต์แจ้งติดลิมิต</p>\n<p>NERV เป็นแพลตฟอร์มเตือนภัยพิบัติต่าง ๆ ในญี่ปุ่น ซึ่งมีบัญชี Twitter เพื่อรายงานข้อมูลคู่ขนานไปกับช่องทางแอปของ NERV เอง บัญชีมีผู้ติดตามกว่า 2 ล้านคน อย่างไรก็ตามหลังจาก Twitter หรือ X ได้<a href=\"https://www.blognone.com/node/133228\">ปรับเงื่อนไข</a>การใช้งาน API ทำให้ NERV เลือกใช้งานแพ็คเพจราคา 100 ดอลลาร์ต่อเดือน ที่โพสต์ได้ 100 ข้อความภายใน 24 ชั่วโมง ซึ่งในเวลาปกติก็คงไม่มีปัญหา แต่หากเกิดภัยพิบัติรุนแรงที่มีข้อมูลเข้ามาตลอดเช่นกรณีดังกล่าว ก็จะเกิดเหตุการณ์ติดลิมิตได้</p>\n<p>ตามแนวทางของ X/Twitter จะเปิดให้บัญชีรายงานข้อมูลฉุกเฉินสามารถโพสต์ข้อความได้ไม่มีข้อจำกัด หากเป็นองค์กรรัฐบาลหรือหน่วยงานสาธารณะที่ยืนยันตัวตน แต่สำหรับ NERV อาจแตกต่างออกไปเพราะแม้จะใช้ข้อมูลจากหน่วยงานรัฐบาล แต่ตัวแอปถูกพัฒนาโดยบริษัทเอกชนระบบความปลอดภัย Gehirn จึงทำให้ X บอกว่าเป็นบัญชีภาคธุรกิจนั่นเอง</p>\n<p>ก่อนหน้านี้ NERV ก็ได้เพิ่มทางหนีทีไล่ไว้เองแล้วโดย<a href=\"https://unnerv.jp/@UN_NERV\">เปิดบัญชีบน Mastodon</a> ไว้ด้วย</p>\n<p>ที่มา: <a href=\"https://mashable.com/article/twitter-japan-earthquake-tsunami-alert-restricted\">Mashable</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/9fd59d2cd8d23cf4a652a2b12e706a6a.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/x-company\">X.com</a></div><div><a href=\"/topics/japan\">Japan</a></div><div><a href=\"/topics/natural-disaster\">Natural disaster</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"07972983c4417d74507dbb5b234fbc3840b5d335e7913352720108418ef01b57","category":"Thai"}