{"title":"Investigation of the impact of papain on the volatile and non‐volatile metabolites of soybean meal yogurt","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13873?af=R","date":1725872092000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Soybean meal yogurt was prepared from soybean meal using papain and <i>Bifidobacterium animalis</i> subsp. <i>lactis.</i> A non-targeted metabolomics approach was employed to analyze the relevance of papain to the differences in volatile and non-volatile metabolites of soybean meal yogurt.</p>\n<h2>Results</h2>\n<p>The results showed that the main up-regulated metabolites and metabolic pathways after enzymatic digestion were dominated by amino acids and their derivatives. Conversely, the main down-regulated metabolites and pathways were predominantly associated with flavonoid metabolism. Amino acids and their derivatives, as well as flavonoids, were found to be highly correlated with the formation of sweet, umami, astringent, and bitterness. The addition of papain enriched the content of aromatic compounds in soybean meal yogurt. Aromatic components such as 2-heptanone, naphthalene, and <i>p</i>-xylene increased in concentration. Synthetic peptide of aspartate and serine, gramine, geissospermine, <i>N</i>-desmethyl vinblastine, and 3,7-dihydroxyflavone were the major non-volatile differential metabolites distinguishing the soybean meal yogurt.</p>\n<h2>Conclusion</h2>\n<p>This study provided a comprehensive analysis of the metabolic traits of products co-fermented by papain and <i>Bifidobacterium animalis</i> subsp. <i>lactis</i>, offering insights for the application of papain in fermented goods. © 2024 Society of Chemical Industry.</p>","author":"Yaxin Yan, \nDong Hua, \nXiaoqing Liu, \nXiangrong Fan, \nMiao Bai, \nHe Liu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"079cb412691b7515caa05fb1a5e22c9de59babf1ed674bb2aaf668d4d32595b9","category":"Environment"}