{"title":"You can finally send direct and group messages on Strava","link":"https://www.bikeradar.com/news/strava-messaging/","date":1701698430000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/12/Messaging-GTM-UI-Screen01-Hero-en-US1560x624-a1a0ba0.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/12/Messaging-GTM-UI-Screen01-Hero-en-US1560x624-a1a0ba0.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/12/Messaging-GTM-UI-Screen01-Hero-en-US1560x624-a1a0ba0.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/12/Messaging-GTM-UI-Screen01-Hero-en-US1560x624-a1a0ba0.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/12/Messaging-GTM-UI-Screen01-Hero-en-US1560x624-a1a0ba0.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"screenshot of conversation on Strava Messaging\" title=\"Messaging-GTM-UI Screen01-Hero-en-US@1560x624\" />                                            <p>Strava has introduced messaging to its popular ride recording and sharing app.</p>\n<p>Through Strava Messaging, you will be able to chat directly with another user or in a group.</p>\n<p>Strava says Messaging will be available to all users in the mobile version of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-apps/\">cycling app </a>from early December, with new features to follow in 2024.</p>\n<section>\n    <div>\n        \n<h3>All you need to know about Strava Messaging</h3>\n<ul>\n<li>\n<p>Private and group chats possible</p>\n</li>\n<li>\n<p>Available for free and premium users</p>\n</li>\n<li>\n<p>Mobile only (for now)</p>\n</li>\n<li>\n<p>Activities and routes can be shared</p>\n</li>\n<li>\n<p>Privacy settings will replicate the user’s profile visibility, but can be customised in the app</p>\n</li>\n<li>\n<p>More features, including photo uploads, coming in 2024</p>\n</li>\n</ul>\n<p>\n\n    </p></div>\n    </section>\n\n<h2>How does Strava Messaging work?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Strava home page Messaging feature\" title=\"stravamessaging4\" />\n\n</div><div><figcaption><span><i></i> The Messaging tab is located on the right of the Activity Feed.</span></figcaption><span> <i>Strava</i></span></div>\n<p>On the home page of the mobile app, clicking on the speech bubble to the left of the notification alert tab opens the Messaging feature.</p>\n<p>You can then search the name of the user you want to message.</p>\n<p>Alternatively, you can message an athlete from their profile page. However, it’s not possible to turn a comment on an activity into a direct message.</p>\n<p>Speaking to BikeRadar, Zipporah Allen, Strava’s chief business officer, said the feature will be available only on the mobile app for the time being.</p>\n<p>“We are looking forward to seeing how athletes adopt Messaging on mobile first – and to make adjustments based on their feedback and experience,” said Allen.</p>\n<h2>What if I don’t want people to slide into your Strava DMs?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Screenshot of 'new message' tool on Strava Messaging\" title=\"stravamessaging1\" />\n\n</div><div><figcaption><span><i></i> You can adjust privacy settings to only exchange messages between people who follow you.</span></figcaption><span> <i>Strava</i></span></div>\n<p>Strava says privacy settings for Messaging will automatically mirror a user’s profile visibility. For example, if your profile is private, you’ll only receive messages from followers.</p>\n<p>But Strava says you can customise this further in the Strava app settings tab. You can choose to receive messages from followers, ‘mutuals’ or no one at all.</p>\n<h2>Wait, you can’t send photos?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Strava Messaging group chat screen shot\" title=\"stravagroupchat\" />\n\n</div><div><figcaption><span><i></i> You can share routes and activities but not yet images.</span></figcaption><span> <i>Strava</i></span></div>\n<p>For the time being, you can’t send images on Strava Messaging, but it will be possible to send reactions and GIFs.</p>\n<p>The company says the option to upload photos will follow in early 2024, alongside messaging within Strava clubs.</p>\n<p>You’ll also be able to share clubs, posts and events via Strava Messaging.</p>\n<h2>Why has Strava introduced messaging?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Graphic showing what the new Strava Personalised Progress Chart will look like\" title=\"Strava progress chart news\" />\n\n</div><div><figcaption><span><i></i> Along with fitness tracking, Strava has always been about interaction between users.</span></figcaption><span> <i>Strava</i></span></div>\n<p>Since its launch in 2009, Strava has been a social network where athletes can follow others, give kudos and comment on their activities.</p>\n<p>More recently, Strava added the functions to tag athletes in comments and for individuals to post without recording an activity.</p>\n<p>Suggesting Strava responded to user demand for messaging, Allen said: “Our Strava community has been asking for Messaging for some time and we are so excited to deliver the first iteration of this feature.”</p>\n<p>Strava claims Messaging will enhance the amount of encouragement athletes can give each other, until now limited to kudos and comments.</p>\n<p>Allen added that Messaging will make it easier to organise group rides and share advice “all on one platform”.</p>\n<p>Currently, users would have to move in-depth, one-to-one discussions to another form of messaging.</p>\n<p>So a sceptic might say Strava has added Messaging to make users spend more time on the app, as other social media platforms attempt.</p>\n<p>If you feel this way and/or primarily use Strava to track your own progress, not interact with others, you can adjust your Messaging settings to make you uncontactable.</p>","author":"Jack Evans","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"079f9f8cdab1b9c7a0059e8941ef6cfa90676598e7244a822df906e2f5ed6868","category":"Cycling"}