{"title":"Trajectory-driven computational analysis for element characterization in <i>Trypanosoma cruzi</i> video microscopy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304716","date":1717423200000,"content":"<p>by Geovani L. Martins, Daniel S. Ferreira, Claudia M. Carneiro, Nivia C. Nogueira-Paiva, Andrea G. C. Bianchi</p>\r\n\r\nOptical microscopy videos enable experts to analyze the motion of several biological elements. Particularly in blood samples infected with <i>Trypanosoma cruzi</i> (<i>T. cruzi</i>), microscopy videos reveal a dynamic scenario where the parasites’ motions are conspicuous. While parasites have self-motion, cells are inert and may assume some displacement under dynamic events, such as fluids and microscope focus adjustments. This paper analyzes the trajectory of <i>T. cruzi</i> and blood cells to discriminate between these elements by identifying the following motion patterns: collateral, fluctuating, and pan–tilt–zoom (PTZ). We consider two approaches: i) classification experiments for discrimination between parasites and cells; and ii) clustering experiments to identify the cell motion. We propose the trajectory step dispersion (TSD) descriptor based on standard deviation to characterize these elements, outperforming state-of-the-art descriptors. Our results confirm motion is valuable in discriminating <i>T. cruzi</i> of the cells. Since the parasites perform the collateral motion, their trajectory steps tend to randomness. The cells may assume fluctuating motion following a homogeneous and directional path or PTZ motion with trajectory steps in a restricted area. Thus, our findings may contribute to developing new computational tools focused on trajectory analysis, which can advance the study and medical diagnosis of Chagas disease.","author":"Geovani L. Martins","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"07a40995efca0249b7be1e56f2fe8c904858d362e74f786f53e12277c28b07b5","category":"Interdisciplinary"}