{"title":"Electric Bike Incentive Kickstart for the Environment Act | Federal tax bill could save you $1,500 on your next ebike","link":"https://www.bikeradar.com/news/us-ebike-tax-credit-bill/","date":1679500675000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1191027345-3555db6.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1191027345-3555db6.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1191027345-3555db6.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1191027345-3555db6.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1191027345-3555db6.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1191027345-3555db6.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1191027345-3555db6.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1191027345-3555db6.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1191027345-3555db6.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1191027345-3555db6.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Student on his e-bike at Goethe University in Frankfurt, Germany\" title=\"Student on his e-bike at Goethe University in Frankfurt, Germany\" />                                            <p>Federal lawmakers in the USA have reintroduced a bill that would give you a tax break on the purchase of a new electric bike.</p>\n<p>The Electric Bike Incentive Kickstart for the Environment (E-BIKE) Act would cover 30 per cent of the cost of an <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">electric bike</a>, up to $1,500.</p>\n<p>The refundable tax credit would apply to new ebikes under $8,000, which is double the $4,000 cap proposed in president Joe Biden’s scrapped Build Back Better campaign.</p>\n<p>The bill would provide the maximum credit of $1,500 to people with incomes up to $150,000 for a single filer or $300,000 for a joint filer.</p>\n<p>Cycling UK has urged the UK government to follow the USA’s lead, stating subsidies are a cost-effective way to maximise the carbon-reducing potential of ebikes.</p>\n<h2>A “commonsense” bill</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The bill is said to incentivise people to use ebikes.</span></figcaption><span> <i>Leonardo Munoz / Getty Images</i></span></div>\n<p>The bill was introduced on 21 March by Californian Representatives Jimmy Panetta, Mike Thompson and Adam Schiff, as well as Congressional Bike Caucus Chairman Earl Blumenauer, to encourage the use of ebikes.</p>\n<p>Panetta described the bill as a “commonsense way to encourage the ownership of e-bikes”.</p>\n<p>“By incentivizing Americans to own and use e-bikes, we are allowing them the chance to help improve the quality of life in our communities and tackle the climate crisis in our country,” Panetta said in a <a href=\"https://panetta.house.gov/media/press-releases/reps-panetta-blumenauer-thompson-and-schiff-reintroduce-e-bike-act\" target=\"_blank\">statement published on his website</a>.</p>\n<p>Blumenauer, who championed the original ebike credit, says he is excited by the ebike bill because it helps tackle the high cost of ebikes, which can discourage consumers.</p>\n<p>“Cycling is the most efficient form of human transportation ever devised. By burning calories instead of fossil fuels, we can make our communities healthier and more liveable,” said Blumenauer.</p>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>Senator Brian Schatz, chairman of the Senate Appropriations Subcommittee on Transportation, Housing and Urban Development, says transitioning to clean energy economies requires us to change how we travel.</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>“That means transit, rail, and electric buses, cars, and bikes. Our bill will make it more affordable for working people to buy an e-bike and help get cars off the road,” said Schatz.</p>\n<h2>A stronger case?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> An ebike rebate scheme in Denver is said to have cut 2,040 metric tons of carbon dioxide in 2022.</span></figcaption><span> <i>RJ Sangosti / Getty Images</i></span></div>\n<p>A tax credit for ebikes was originally part of Biden’s Build Back Better act, which included measures related to climate change, family aid and Medicare.</p>\n<p>The act failed to win support, stalling the ebike tax credit plan.</p>\n<p>A reworked version of the Build Back Better Act did not include the ebike tax credit, despite including subsidies for technologies such as wind turbines, solar panels and electric cars.</p>\n<p>Panetta’s statement is intended to build a stronger case for an ebike tax credit. It points to the success of an ebike rebate scheme in Denver, Colorado, which offered residents $400 off an ebike or $900 off an <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-cargo-bike/\">e-cargo bike</a>.</p>\n<p>The scheme saw 4,700 ebike rebates issued, with close to half going to low-income households, according to the statement.</p>\n<p>In a survey of residents, 71 per cent of those who rode an ebike said it helped them cut down their car usage.</p>\n<p>It is said to have cut 2,040 metric tons of carbon dioxide in 2022, according to the Rocky Mountain Institute.</p>\n<p>David Zipper, in Bloomberg’s CityLab, also reported the scheme to have <a href=\"https://www.bloomberg.com/news/articles/2023-02-09/denver-s-e-bike-rebate-program-has-a-hidden-power\" target=\"_blank\">amplified calls for street safety</a> as more residents were exposed to the dangers (and joys) of cycling.</p>\n<p>The proposed E-BIKE Act is endorsed by more than a dozen organisations, including PeopleForBikes, the League of American Bicyclists, the Sierra Club and the Outdoor Industry Association.</p>\n\n<h2>UK governments urged to follow lead</h2>\n<p>There are currently <a href=\"https://www.bikeradar.com/features/opinion/electric-bike-subsidy-is-a-no-brainer/\">no subsidies specifically for ebikes</a> in the UK, although the cost of a new ebike can be subsidised through the <a href=\"https://www.bikeradar.com/advice/buyers-guides/cycle-to-work-scheme-everything-you-need-to-know/\">Cycle to Work scheme</a>.</p>\n<p>Speaking to BikeRadar, Cycling UK’s policy director Roger Geffen says the UK should follow the USA’s lead, as well as Scotland’s, where Transport for Scotland has provided ebike loans to help with the purchase of new electric bikes, including cargo bikes and <a href=\"https://www.bikeradar.com/advice/buyers-guides/adaptive-bikes/\">adaptive bikes</a>.</p>\n<p>“Cycling UK urges UK governments to follow the lead of the US, Scotland and other European countries, as e-cycle subsidies are a highly cost-efficient way to maximise the carbon saving and other benefits of cycling,” said Geffen.</p>\n<p>“We also need to see more targeted support for people with health conditions or disabilities that make cycling difficult, but particularly beneficial.</p>\n<p>“Electric assist or non-standard pedal cycles could really help many of these people, but they are often the least able to afford an e-cycle, particularly if are they excluded from the government’s Cycle to Work scheme, due to not being in work,” said Geffen.</p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"07b561f8f6782b265bdd9b6e60f00cc815f18a765d69ec76ad9901647de74c3b","category":"Cycling"}