{"title":"Old PCs are getting booted out of the Windows 11 Insider Preview","link":"https://arstechnica.com/?p=1791124","date":1630510466000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/DSC00346-800x533.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/DSC00346.jpeg\">Enlarge</a> <span>/</span> Older-but-still-functional PCs like this Dell Latitude with a 6th-generation Intel processor can currently access Windows 11 Insider Preview builds, but that may end soon. (credit: Andrew Cunningham)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Many older PCs have been happily running the Windows 11 previews for months now despite Microsoft's stringent official system requirements, but that's about to change. ZDNet <a href=\"https://www.zdnet.com/article/microsoft-is-moving-insider-testers-off-windows-11-if-their-pcs-are-deemed-ineligible/\">reports</a> that some users of unsupported PCs are beginning to see a message telling them to reinstall Windows 10 when they attempt to enroll older PCs in the Insider program after <a href=\"https://arstechnica.com/gaming/2021/08/windows-11-isos-make-it-easier-to-test-the-betas-with-a-clean-install/\">performing a clean install</a> of the Windows 11 preview.</p>\n<p>Neither of the two unsupported PCs I'm running the Insider Preview on—a Dell Latitude 3379 with a Core i3-6100U and a Dell XPS 13 9333 with a Core i5-4210U—have received this message yet, and they continue to download and install new updates on the Dev and Beta channels. I was also still able to opt in to the Windows 11 preview builds after reinstalling Windows 10 on the old XPS 13, albeit with the typical \"Your PC does not meet the minimum hardware requirements and there may be issues and bugs\" warning message. Presumably, this will change as we get closer to Windows 11's release date.</p>\n\n<p>Microsoft has <a href=\"https://arstechnica.com/gadgets/2021/08/why-windows-11-has-such-strict-hardware-requirements-according-to-microsoft/\">made efforts to explain its reasoning</a> for why older processors won't be officially supported by Windows 11, but it has added only <a href=\"https://arstechnica.com/gadgets/2021/08/loosened-windows-11-requirements-cover-the-surface-studio-2-but-not-much-else/\">a small handful of older chips</a> to the original compatibility list it announced in June. If you've been happy with the performance of Windows 11 on your \"unsupported\" PC and you'd like to install Windows 11 anyway, Microsoft <a href=\"https://arstechnica.com/gadgets/2021/08/youll-be-able-to-run-windows-11-on-older-pcs-if-you-install-the-update-manually/\">won't go out of its way to prevent manual upgrades on older PCs</a>, but the company has suggested that it <a href=\"https://arstechnica.com/gadgets/2021/08/microsoft-may-withhold-security-updates-from-unsupported-windows-11-pcs/\">might withhold security updates</a> from those PCs going forward.</p></div><p><a href=\"https://arstechnica.com/?p=1791124\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1791124&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"07b7e421b5ecfd1d27f01a488fc2604dfa06b5c005ae6977330ce6cc82bc8108","category":"Tech"}