{"title":"Growth Rate, Competition, Understory Diversity, and Understory Species Richness in Pure Versus Mixed Cunninghamia lanceolata (Lamb.) Hook Ecological Plantations in Guangdong Province, China","link":"https://www.preprints.org/manuscript/202410.1428/v1","date":1729225970000,"content":"This research investigated the growth performance and understory dynamics of Chinese fir (Cunninghamia lanceolata) in two ecological plantations 10 km apart in Guangdong Province, China. One ecological plantation was a monoculture comprised solely of Chinese fir. In contrast, the other ecological plantation featured a mix of 30% Chinese fir and 22 other species, encompassing three exotic, five shade-tolerant, six shade-intolerant, and eleven neutral species. Both ecological plantations utilized 1-year-old seedlings planted at 2m × 2m spacing. After 16 years, soil analysis revealed no disparities between the two ecological plantations in total nitrogen, phosphorus, potassium, or pH. Chinese fir in the mixed ecological plantation displayed superior growth, with a 13% increase in diameter, an 18% increase in height, and a 33% increase in crown width compared to those in the monoculture. The leaf area index was higher, and canopy openness was lower in the mixed ecological plantation, indicating an improved canopy structure. Competition indices indicated reduced competition for diameter and increased competition for crown width in the mixed ecological plantation, with no significant difference in competition for height. The monoculture ecological plantation showed higher understory shrub diversity and richness, but no differences were observed in herb diversity and richness between the two ecological plantations. These findings underscore the advantages of mixed-species ecological plantation in enhancing the growth performance of Chinese fir while demonstrating differing effects on shrub and herbaceous understory layers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"07b79b850f948d01f031683f0279cfa54a939028fba489e708eb2319e836d315","category":"Interdisciplinary"}