{"title":"A comparative study on flaxseed lignan biotransformation through resting cell catalysis and microbial fermentation by β‐glucosidase production Lactiplantibacillus plantarum","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13412?af=R","date":1708944202000,"content":"<h2>ABSTRACT</h2>\n<h2>Background</h2>\n<p>Flax lignan has attracted much attention due to its potential bioactivities. However, the bioavailability of Secoisolariciresinol diglucoside(SDG), the main lignan in flaxseed, depends on the bioconversion by the colon bacteria. Lactic acid bacteria (LAB) with β-glucosidase activity found wide application in preparing bioactive aglycone.</p>\n<h2>Results</h2>\n<p>LAB strains with good β-glucosidase activity were isolated from fermented tofu. Their bioconversion of flax lignan extract was investigated by resting cell catalysis and microbial fermentation, and the metabolism of SDG by <i>Lactiplantibacillus plantarum</i> C5 following fermentation was characterized by widely targeted metabolomics. Five <i>L. plantarum</i> strains producing β-glucosidase with broad substrate specificity were isolated and identified, and they all can transform SDG into Secoisolariciresinol (SECO). <i>L. plantarum</i> C5 resting cell reached a maximum SDG conversion of 49.19 ± 3.75%, and SECO generation of 21.49 ± 1.32% (0.215 ± 0.013 mM) at an SDG substrate concentration of 1 mM and 0.477 ± 0.003 mM SECO was produced at 4 mM within 24 h. While sixteen flax lignan metabolites were identified following the fermentation of SDG extract by <i>L. plantarum</i> C5, among them, four were produced following the fermentation: SECO, demethyl-SECO, demethyl-dehydroxy-SECO, and isolariciresinol. Moreover, seven lignans increased significantly.</p>\n<h2>Conclusion</h2>\n<p>Fermentation significantly increased the profile and level of flax lignan metabolites, and the resting cell catalysis benefits from higher bioconversion efficiency and more straightforward product separation. Resting cell catalysis and microbial fermentation of flax lignan extract by the isolated β-glucosidase production <i>L. plantarum</i> could be potentially applied in preparing flax lignan ingredients and fermented flaxseed.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Chengcheng Feng, \nYou Wu, \nZizhe Cai, \nZiliang Song, \nYoun Young Shim, \nMartin T.J. Reaney, \nYong Wang, \nNing Zhang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"07bcdd8c6dfb228ee2012497c2d25230bf336b6db9bde52825484da82e79b4ad","category":"Environment"}