{"title":"Assessing the Degree of Social Responsibility Integration in Socially Responsible Public Procurement in Korea","link":"https://www.preprints.org/manuscript/202403.1454/v1","date":1711352462000,"content":"This study delves into the critical domain of public procurement, specifically focusing on Sustainable Public Procurement (SPP) and Environmental, Social, and Governance (ESG) considerations within the context of South Korea. The aim of this research is to empirically scrutinize the factors influencing the impact index of SPP, with a particular emphasis on services related to labor standards. The investigation spans three years, from January 1, 2019, to July 31, 2021, encompassing state agency orders and post-implementation legal changes. Leveraging the comprehensive Korea On-line E-Procurement Sys-tem(KONEPS) platform, we meticulously collected data, ultimately culminating in 21,573 services meeting our criteria, from which 250 cases underwent an in-depth analysis. The study sheds light on the influence of social responsibility evaluation cri-teria on overall procurement scores, while also uncovering the moderating effects of various factors.\nThe outcomes of this study offer valuable insights into the impact index of social responsibility evaluation criteria within South Korea's public procurement landscape. Factors including procurement year, classification, service period, and estimated price were identified as significant influencers. Moreover, the number and location of evalu-ation criteria items, inclusion of sincerity elements, and the evaluating agency were deemed pivotal determinants of the influence index. These findings hold profound implications for policymakers, procurement practitioners, and researchers and provide a roadmap for optimizing the utilization of social responsibility evaluation criteria to advance responsible and sustainable procurement practices.\nFuture research avenues include conducting further study of additional moderat-ing variables, expanding datasets to encompass a broader spectrum of procurement contexts, and evaluating the long-term repercussions of social responsibility evaluation on procurement outcomes. These endeavors promise to further refine and advance public procurement practices in South Korea and beyond.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"07bfc84d1f6372e79bb19b21076c55496f1c17687d839f19f857d5498f05868e","category":"Interdisciplinary"}