{"title":"Is there any forgiving Gianni Moscon?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/is-there-any-forgiving-gianni-moscon","date":1634028903000,"content":"\n      <p>It was a hell of a ride. Having broken away alone with 50 kilometres to go, Gianni Moscon made light work of Paris-Roubaix’s treacherous cobblestones and extended his lead. At one point, he held an 87 seconds’ lead over Mathieu van der Poel and the chasers, with just two tough sectors to come. It looked like game over. Had it not been for a puncture and crash, the Italian would probably have won the mud-spattered 2021 edition.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/faces-of-a-roubaix-finish\">Related – Faces of a Roubaix Finish</a></strong></em></p>\n<div></div>\n<p>However, there were few eulogies or commiserations because his name is mud. Arguably the strongest rider in the race was also the most unpopular. Here’s a quick rundown of why the Ineos Grenadier is so disliked:</p>\n<ul>\n<li>He used racially abusive language toward Kevin Réza at the 2017 Tour de Romandie, was suspended for six weeks by Team Sky and went on a diversity awareness course.</li>\n<li>He punched French rider Elie Gesbert during the 2018 Tour de France and was disqualified.</li>\n<li>He threw his bike at another racer at the 2020 Kuurne-Brussels-Kuurne and was disqualified.</li>\n</ul>\n<p>Those actions cannot be condoned. “Gianni knows that there is no excuse for his behaviour and that any repeat will result in termination of his contract,” a Team Sky statement read after the initial 2017 incident. Yet after each subsequent expulsion, he was not fired.</p>\n<p>Why? Because he’s very good at bike racing, basically. Any rider who can finish top five in Il Lombardia and Paris-Roubaix, win Italian time-trial titles and finish top-25 in Grand Tours while supporting leaders is one hell of an asset. It sends out a bad message: if you’re versatile and strong enough, you can get away with that rap sheet.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/mosters-comments-are-part-of-a-wider-problem-in-the-sport\">Related – Patrick Moster's comments are part of a wider problem in cycling</a></strong></em></p>\n<h4>Schadenfreude writ large</h4>\n<p>So, when Moscon had his unfortunate flat and fall in the race’s finale, the public reaction was not just relief, but unrestrained joy. My Twitter feed saw GIFs of stadiums celebrating. The word “karma” written in various forms. Schadenfreude writ large. His loss was cycling social media’s victory.</p>\n<p>It’s not my place to tell people who to support or not support. It’s clear that someone with Moscon’s history will probably never win a popularity contest. But openly cheering his crash, any rider’s crash? Two wrongs don’t make a right. Would it still have been karma if Moscon had shattered his pelvis on the cobblestones?</p>\n<p>It’s worth going back to 2017 to explore the depth of the ill feeling towards Moscon. Most of his offences could be put down to hot-headedness or the heat of the moment, but not the racist comments. They are bad enough, but the apparent lack of contrition shown afterwards is also problematic.</p>\n<p><a href=\"https://www.rouleur.cc/pages/subscribe\"><em><strong>Subscribe to Rouleur magazine</strong></em></a></p>\n\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1344614004_1024x1024.jpg?v=1633975227\" /></p>\n<p><em>Moscon was viewed by some as the antagonist of 2021 Paris-Roubaix (Photo: Jorge Luis Alvarez Pupo/Getty Images)</em></p>\n<p>Kevin Réza apparently accepted his apology after the incident and Moscon does not appear to have addressed the issue since. If he learned a lot on that diversity course or evolved, we wouldn’t know. (Also, perhaps fearing scrutiny, the shy Moscon also gives few interviews to non-Italian press.) So, many fans appear to have decided he doesn’t deserve another chance.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/cover-stories-issue-106-empower\">Cover story: Rouleur Issue 107 - Empowerment</a></strong></em></p>\n<h4>Sorry seems to be the hardest word</h4>\n<p>It raises a pertinent question which is down to every individual: what would it take to change your view of Gianni Moscon, or even forgive him? Another Monument opportunity erased by bad luck? Or maybe real proof of change, like an apology and/or commitment to an anti-racist charity. It’s not too late to say sorry, Gianni – to be reflective, to talk about what happened, the lessons learned and hold your hands up. And in the same vein, for fans, it’s never too late for a 27-year-old to be given another opportunity.</p>\n<p>Because there is a multi-dimensional Gianni Moscon out there. With a terrific nickname (The Tractor of Val di Non). A hard-headed farmer’s boy from the north-east of Italy whose passion for fruit picking is only matched by his love of the pavé. A very talented cyclist who is rarely admired without a caveat or negative prefix.</p>\n<p>Surely something has to change because Moscon isn’t going anywhere (apart from to Astana in 2022, which is hardly a shot in the arm for his popularity). The 27-year-old is approaching his prime and will likely be at the forefront of other Monument races in the future.</p>\n<p>Moscon and his management team should acknowledge his bad image and act from a place of genuine feeling. Otherwise, in the English-speaking cycling world at least, he may well spend his entire career as a villain.</p>\n<p><em>Cover image by <a href=\"https://www.instagram.com/peterstuart3/\">Peter Stuart</a></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"07c902e19a14600bfbcb77ae39df9a87450ac8c22cce3bb7335312aebcb13333","category":"Cycling"}