{"title":"Tim Cook Attends Opening of Apple BKC Store in Mumbai, India","link":"https://www.macrumors.com/2023/04/18/tim-cook-opening-apple-bkc-store-mumbai-india/","date":1681809986000,"content":"Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> today officially inaugurated the company's <a href=\"https://www.apple.com/newsroom/2023/04/apple-bkc-now-open-in-mumbai/\">first retail store in India</a>, opening its doors, welcoming the first customers, and posing for selfies outside <a href=\"https://www.apple.com/in/retail/bkc/\">Apple BKC</a>. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/Apple-BKC-Mumbai-India-media-preview-hero.jpg\" alt width=\"2880\" height=\"1620\" />\r<br />\nThe new flagship store is situated in the country's financial capital of Mumbai, located in a high-end shopping mall at Bandra-Kurla Complex – hence 'BKC' in the title – in the city's main business district. Apple says it is one of the most energy-efficient <a href=\"https://www.macrumors.com/guide/apple-store/\">Apple Store</a> locations in the world, with a dedicated solar array and zero reliance on fossil fuels for store operations. The store is operationally carbon neutral, running on 100% renewable energy.\r<br />\n\r<br />\nThe store opening is the culmination of sustained efforts by Apple to meet regulators' demands, which included making some of its products locally. Apple is set to open another store in the capital New Delhi on Thursday, and Cook is scheduled to attend. Cook is also expected to meet Prime Minister Narendra Modi during his visit. It is the Apple CEO's first trip to India in seven years.\r<br />\n\r<br />\nUntil now, Apple products have been sold in India either online or through Apple's regional website or through a network of resellers. Beyond bringing Apple branding cachet, the physical stores will offer a premium buying experience in a country where the premium smartphone market is relatively untapped. Only about 4% of India's nearly 700 million smartphone users have iPhones, with the majority owning low-cost Android phones.\r<br />\n\r<br />\n<div><blockquote><p>The energy, creativity, and passion in Mumbai is incredible! We are so excited to open Apple BKC — our first store in India. <a href=\"https://t.co/talx2ZQEMl\">pic.twitter.com/talx2ZQEMl</a></p>— Tim Cook (@tim_cook) <a href=\"https://twitter.com/tim_cook/status/1648218538778439681?ref_src=twsrc%5Etfw\">April 18, 2023</a></blockquote>  </div>\r<br />\nApple's sales in India hit a new high of almost $6 billion in the year through March. Revenue in India grew by nearly 50%, from $4.1 billion a year earlier, according to a source with knowledge of the matter cited by <em><a href=\"https://www.bloomberg.com/news/articles/2023-04-17/apple-s-india-sales-near-6-billion-as-cook-begins-retail-push\">Bloomberg</a></em>.\r<br />\n\r<br />\nApple has been working to build out a manufacturing supply chain in India, which is home to the world's second biggest smartphone market. In an indication of the country's perceived importance as a production hub, Apple shifted <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> assembly from China to India in the weeks following its release.<div>Tags: <a href=\"https://www.macrumors.com/guide/retail/\">Retail</a>, <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a>, <a href=\"https://www.macrumors.com/guide/india/\">India</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/18/tim-cook-opening-apple-bkc-store-mumbai-india/\">Tim Cook Attends Opening of Apple BKC Store in Mumbai, India</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/tim-cook-attends-opening-of-apple-bkc-store-in-mumbai-india.2387099/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"07dd4394d3b030672e39644dba1cce6328a2072ec8917c4f5c44b0dbb5910e22","category":"Apple"}