{"title":"PSVI-21 The effects of soybean meal concentration and Yucca schidigera extract supplementation on growth performance of nursery swine","link":"https://academic.oup.com/jas/article/102/Supplement_2/321/7664972?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Soybean meal (SBM) is the primary plant-protein source for swine in the USA. However, SBM might not be suitable to be fed at high levels, particularly in the early post-weaning period. To offset these effects, pigs are gradually transitioning to diets with greater concentrations of SBM. Whereas, greater SBM concentrations can be detrimental, peer-reviewed studies have indicated that pigs fed diets with 30% SBM and supplemented with 125 ppm <span>Yucca schidigera</span> extract (YSE) from d 0-14 post-wean performed similarly to pigs fed diets with 15 and 20% SBM, from d 0-7 and d 7-14 post wean, respectively. Suggesting that pigs can be fed greater SBM concentrations without compromising performance. To confirm these findings, a total of 972 pigs [initial body weight (BW) = 5.4 kg) were used in a 38-d experiment. Pens of 27 pigs were randomly allotted to 1 of 4 dietary treatments with 9 replications per treatment. Dietary treatments were arranged in a 2 × 2 factorial with main effects of SBM concentration (15 or 31%) and YSE (0 or 125 ppm; DeOdorase Alltech, Inc., Nicholasville, KY). Pigs were fed a nursery program comprised of two phases. Phase 1 from d 0 to 21 (experimental feeding period) and Phase 2 from d 22 to -38 (common period). Phase 1 diets were formulated to contain 1.38% SID Lys and 2,600 kcal/kg NE. Phase 2 diets were formulated to contain 1.30% SID Lys and 2,565 kcal/kg NE. Data were analyzed using the GLIMMIX procedure of SAS (Cary, NC) in a randomized complete block design with pen serving as the experimental unit and initial BW serving as blocking factor. No significant SBM × YSE interactions (<span>P</span> &gt; 0.10) were observed in growth performance in this study (Table 1). From d 0 to 21, pigs fed diets supplemented with YSE increased (<span>P</span> = 0.006) average daily feed intake (ADFI), which numerically improved (<span>P</span> = 0.16) average daily gain (ADG) and thus (<span>P</span> = 0.12) BW, despite SBM concentration. From d 21 to 38, pigs previously fed diets supplemented with YSE, maintained a marginally higher (<span>P</span> = 0.08) ADFI, which numerically increased (<span>P</span> = 0.12) ADG, resulting in marginally higher (<span>P</span> = 0.08) BW, despite SBM concentration. From d 0 to 38, pigs fed diets supplemented with YSE increased (<span>P</span> = 0.03) ADFI, which numerically improved (<span>P</span> = 0.10) ADG, resulting in marginally greater (<span>P</span> = 0.08) BW, despite SBM concentration. In conclusion, whereas pigs fed with greater SBM concentrations did not compromise performance, diet supplementation with YSE increased ADFI during the experimental and common periods, resulting in improved growth performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"07e7f96fdf1969356ff9caf57bd1760a53fd8eb5f66a68e10a93ec5898ff8e3c","category":"Environment"}