{"title":"The Girl’s 2021 Swim/Bike/Run Gear I Use List","link":"https://www.dcrainmaker.com/2021/12/girls-2021-gear-i-use.html","date":1639051967000,"content":"<p><img src=\"https://media.dcrainmaker.com/images/2021/12/Run-720x540.jpg\" /></p>\n<p>Hey there, this is The Girl , Ray’s other half. After Ray’s latest <a href=\"https://www.dcrainmaker.com/2021/12/gear-i-use-swim-bike-run-list.html\">Gear I Use post</a>, some of you commented that you wanted an updated Gear List from me as well. So I sat down at the laptop and several coffees later, I have an updated list for you. So, if you’re interested, scroll on down to see what stuff I have hanging around to help keep me movin’ and groovin’!</p>\n<p>Just so we are all on the same page here, I am now post third pregnancy. So the spacing between Gear I Use posts is mostly contributed to the fact I have been in and out of baby-growing and postpartum recovery. You might notice a lot of the same players on this list as the last <a href=\"https://www.dcrainmaker.com/2018/10/the-girls-2018-swim-bike-run-gear-i-use-list.html\">Gear I Use Post</a>, and that is both because I like what I like (so if it ain’t broke don’t fix it) annnnnd did I mention there’s been a third pregnancy? I don’t have too much time for shopping around, so I’m either still wearing 5+ year old shorts or I just pressed re-order on the most recent model of the same brand. Call me a creature of habit if you want!</p>\n<p>So, I apologize if this is a bit of step down for some of you who have followed me since the Great Triathlon Adventures of Ray and “The Girl”. I hope to get back to that level someday. But for the moment, this is an honest list of what keeps me grinding away each week!</p>\n<p>Incase you just got distracted with the idea of babies, be sure to check out the “<a href=\"https://www.dcrainmaker.com/child-gear\">Gear I Use: Kids Post</a>”. I updated that post shortly after Peanut 3 arrived and have tried to keep that one narrowed down to the more critical pieces! Otherwise the baby industry will have you believing humans can’t be trusted to raise tiny hoomans without 10,000 items!</p>\n<p>Anyways, on to this list. I have it separated into Running, Cycling, Swimming, and Weight Room/ Gym Accessories. So you can scroll past sections as they may or may not pertain to you. I’ll do my best to keep an eye on the comment section as well in case anyone has questions or of course better suggestions!</p>\n<h3><strong>Running:</strong></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/12/Ray-Run-720x540.jpg\" /></p>\n<p> </p>\n<p><strong>Shoes:</strong> <a href=\"https://www.amazon.com/ASICS-Womens-Gel-DS-Trainer-Running/dp/B08XWFT6ZN?keywords=asics%2Bgel%2Bds%2Btrainer%2Bwomen&amp;qid=1638913130&amp;sr=8-6&amp;th=1&amp;psc=1&amp;linkCode=sl1&amp;tag=dcr-thegirlnews-20&amp;linkId=fec2f5c2bd928a012576492f5beea94a&amp;language=en_US&amp;ref_=as_li_ss_tl\">Asics Gel-DS Trainer 26</a> – These have been my go to running shoes for years. I have literally popped a new pair out of the box the day before a half marathon and ran the race without a hot spot or blister to be felt! Consistently awesome for my feet!</p>\n<p><strong>Sunglasses:</strong> I’ve really gotten in the the <a href=\"https://amzn.to/31FsN6m\">Goodr Polarized</a> Running sunglasses. Compared to my custom Oakley glasses from a decade ago, they are a fraction of the cost. I love that they have so many wild colors. As well, they do NOT slip off my face nor do they bounce even with intense track workouts. The ones in the pic above are called “Flamingos on a Booze Cruise”… who can say no to that?</p>\n<p><strong>GPS Watch:</strong> <a href=\"https://www.dcrainmaker.com/2017/03/garmin-fenix5-5s-5x-review.html\">Garmin Fenix 5S</a> – This has been hands down my favorite watch. I wear it all day everyday. I think it looks nice, straps are exchangeable for exercise vs style, and it just does all the things. I have been known to throw on the <a href=\"https://www.amazon.com/Garmin-Forerunner-Premium-Triathlon-Smartwatch/dp/B07QTVMWVL?keywords=forerunner+945&amp;qid=1638913440&amp;sr=8-3&amp;linkCode=sl1&amp;tag=dcr-thegirlnews-20&amp;linkId=201ccc2b34c8dda560a8f463a709243a&amp;language=en_US&amp;ref_=as_li_ss_tl\">Garmin Forerunner 945</a> on days I have forgotten said exercise strap. Doh!</p>\n<p><strong>Running Shorts:</strong> These are the latest edition of my favorite <a href=\"https://www.amazon.com/New-Balance-Impact-Short-Medium/dp/B07SZK4B1X?keywords=new+balance+shorts+women&amp;qid=1638913701&amp;sr=8-5&amp;linkCode=sl1&amp;tag=dcr-thegirlnews-20&amp;linkId=4b7669818180239bd04b182f5cc61e7e&amp;language=en_US&amp;ref_=as_li_ss_tl\">New Balance shorts</a>. I have found these shorts to be the best all-around shorts for both long distance and track workouts. I think it has to do with the wider elastic waistband not letting them slide and bunch, but I don’t over think it! No wedgies and no chafing for the win! If you prefer a longer short, but same concept, they come in 4” &amp; 5” as well.</p>\n<p><strong>Running Shirts:</strong> I finally ponied up and bought some new dry fits this year. My top favorite is this <a href=\"https://amzn.to/3IsDF8O\">Under Armour Women’s V-Neck</a> (as seen above).</p>\n<p><strong>Running Socks:</strong> <a href=\"https://www.amazon.com/Feetures-Elite-Light-Cushion-Large/dp/B08SQD42LC?keywords=feetures%2Bsocks&amp;qid=1638914727&amp;sr=8-15&amp;th=1&amp;psc=1&amp;linkCode=sl1&amp;tag=dcr-thegirlnews-20&amp;linkId=4597f42a7b053bc606e3221de73cff50&amp;language=en_US&amp;ref_=as_li_ss_tl\">Feetures</a> brand socks are the only thing you’ll see me in for everyday training. I LOVE these socks. Santa can stick them in my stocking and Cupid can attach them to a box of chocolates any day. These are my jam! I love both the really thin ones and the thicker cushion ones depending on the season; both varieties have amazing arch support! Also, they last the test of time, I don’t want to admit how old some of mine are!</p>\n<p><strong>Compression Socks:</strong> These are the only exception to my love for Feetures running socks- <a href=\"https://amzn.to/2v6djFw\">CEP compression socks</a>. I used to get calf cramps and tightness that would last days and these were the best thing for both training and recovery. I raced in them. Recovered in them. I wore them all day long. And, they also proved SOOOO good during the last few weeks of all three pregnancies!</p>\n<p><strong>Sports Bra:</strong> Any female reading this section knows this is 1000% personal preference. There are so many “boob” decisions to make here. Unlike my mile long list of considerations I need to take for my injury prone feet/shoe decisions, the chest department hasn’t given me too much grief. I’ve been using this <a href=\"https://amzn.to/3yhzGHD\">Nike</a> sports bra for a few years now and have about 4 of the same one. Sorry to say, it’s about half price here in <a href=\"https://www.amazon.de/-/en/gp/product/B083BRQB2J/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&amp;psc=1\">Europe</a>!</p>\n<p><strong>Anti-Chafing Products:</strong> Even though I swear by my shorts, there is always a day or two that the sun is heating up just right and the humidity just itching to toy with you… or your shorts. Not willing to play with running-fate, nor willing to do the shower dance as the water burns your thigh rub, I just go ahead and swipe on some <a href=\"https://amzn.to/3pyo9j3\">Glide</a> pre summer runs. There’s no loss of ego here. Thigh rub is a thing, and it’s a bully! So. Yeah. Glide.</p>\n<p><strong>Hair Restraint System:</strong> it seems postpartum has a long tail of cruelness. Hair loss and regrowth has left me with quite a mess of hair frizz! I love <a href=\"https://amzn.to/2vbVuov\">these headbands</a>, the keep the hair out of my eyes and don’t give me pressure headaches.</p>\n<p><strong><u>Cold Weather Running Gear:</u></strong></p>\n<p>Not sure how often you come by the website, or if you follow our <a href=\"https://www.dcrainmaker.com/support\">Quarantine Corner</a> episodes, but if you’re a long time reader, you KNOW I hate being cold. I’m waiting for the day Ray caves and we move to a beach somewhere. In the meantime, these are my three favorite cold weather items. Disclaimer, they are OLD! I knew when paying for the better quality products that the price tag might hurt… but I never imagined these three products would have lasted so long! They have been a fantastic investment and have lasted way beyond their life expectancy!</p>\n<p><strong>Gore Mythos Windstopper Running Vest:</strong> I like layers, and I don’t like to overheat. So <a href=\"https://amzn.to/2OEyfeK\">this vest</a> is the perfect piece! Keeps my chest and back toasty as it is windproof and has a very light microfleece lining. I have seriously been wearing this vest for over 6 years! (Doubles for on the bike too!)</p>\n<p><strong>Running Tights:</strong> I remember winning my AG trail running series in Virginia over ten years ago, and I received a $100 gift card to the local running store. Ray talked me into buying these <a href=\"https://amzn.to/3EQ6GJv\">Sugoi Midzero tights</a>, but I was a young professional, first year of teaching, without a lot of money, and I was so so stressed about spending $100… on anything! I wish I could go back to my younger self and tell her they are worth every penny!</p>\n<p>Ice and Snow insurance: Finally, the last piece of winter running gear that I have on the shelf is the all mighty <a href=\"https://amzn.to/2v9NxQA\">YakTraks</a>. I have used these puppies during the Snow-Zilla winter running season in Virginia in 2010, in the Zermatt, Switzerland ski village, and even at the North Pole (well almost) while on a trip chasing the northern lights. This one pair has hundreds of miles on them. The gift that keeps on giving!</p>\n<h3><span><strong>Cycling:</strong></span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2018/10/CyclingPIcBobbie-720x480.jpg\" /></p>\n<p>This section seems a bit controversial to write. Honestly, I haven’t ridden my triathlon bike in what seems like a lifetime. Poor girl is at the office, atop the gondola, wondering when she’ll hit the pavement again. As well, since moving to the Netherlands, I purchased a road bike… not that that has had much use either, doh! So if you want to know what I USED to ride and train with competitively, you can check out an archive “<a href=\"https://www.dcrainmaker.com/2015/05/girls-swimbikerun-gear-list.html\">Gear I Use</a>” post… updated 2015. If you want to know what I’m using now, it’s basically the <a href=\"https://www.dcrainmaker.com/2021/02/peloton-bike-plus-in-depth-review.html\">Peloton</a>! If the spring time rolls around and I’m still nursing my bummed calf, then the gear below is what I’ll be rollin’ along on!</p>\n<p><strong>Road Bike:</strong> <a href=\"https://www.isaac-cycle.com/en/collection/road/graviton\">Isaac Graviton</a> We have a great local bike shop nearby our house, and the owner helped me pick it out. He knew my budget wasn’t huge, and that I didn’t NEED a carbon frame. So we checked out several different frame sizes, and finally decided this was a great bike to get me back on the road again. I definitely don’t know a lot about bike frame comparisons, so all I can say is for me personally, this was a great choice!</p>\n<p><strong>Indoor Smart Trainer:</strong> Wahoo <a href=\"https://www.dcrainmaker.com/2018/07/first-look-wahoo-fitness-kickr-core-direct-drive-smart-trainer.html\">KICKR Core</a> and <a href=\"https://www.dcrainmaker.com/2018/08/wahoo-kickr-climb-in-depth-review.html\">KICKR Climb</a>. Let’s be honest, I’m going to ride on whatever Ray sets up for me.</p>\n<p><strong>Pedals:</strong> Much like any bike technology you will see here, <a href=\"https://www.dcrainmaker.com/2017/09/favero-assioma-in-depth-review.html\">these were chosen by Ray</a>. I like them, they connect with everything they are supposed to. Better said, these pedals “Just Work”!</p>\n<p><strong>Power meter:</strong> The power meter and the pedals are one and the same. So see above for info.</p>\n<p><strong>Bike Computer:</strong> I’ve always been a Garmin girl. The <a href=\"https://amzn.to/3GmIgre\">Edge 520 Plus</a> just does the job. I like that it has some mapping features, so when Ray drops me on a ride I’ll know how to get home again!</p>\n<p><strong>Helmet:</strong> I’ve been using this <a href=\"https://amzn.to/2NTwNrJ\">Giro Atmos</a> helmet for many years now. Maybe I should check if it expires? I like it because I apparently have a knobby head and most helmets give me headaches or sore spots. But I think helmets are much like other items (shoes, bras, socks), you have to try a bunch to see what fits your body best. This one just happens to work for me.</p>\n<p><strong>Cycling Shoes:</strong> <a href=\"https://amzn.to/2QLqntj\">These girls</a> are OAF!!! But what an investment! I officially purchased these Shimano triathlon shoes on the same day I bought my original TT Bike. I believe that was 13 years ago now (Fall 2008?). Honestly there isn’t even a thread loose on the shoes!</p>\n<p><strong>Bike shorts:</strong> If I’m feeling like an indoor training ride and not wanting to don an entire kit,  <a href=\"https://amzn.to/2OI9deD\">these</a> are my go-to bike short.</p>\n<p><strong>Cold Weather Bottom:</strong> I purchased <a href=\"https://amzn.to/3EJPFjV\">these pants</a> a long long time ago. Still in great condition, so I couldn’t be happier with the purchase.</p>\n<h3><span><strong>Swimming:</strong></span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/12/Swim-720x405.jpg\" /></p>\n<p>Swimming happens about once or twice a year for me now. Shameful really, but Ray is always swimming out on the lake, and I already told you guys my feelings on being cold. Ray drags me out swimming when we are closer to the equator, and I can deal with that. However, back up, I’m at swimming classes with my kids twice a week, but that’s more along the line of blowing bubbles and keeping from sinking.</p>\n<p><strong>Swim Suit:</strong> When I was swimming 4 days a week in the pool, the <a href=\"https://amzn.to/3ozOL43\">TYR Dimondback</a> were always my go to. The elastics lasted really well over time, and by the looks of the Amazon reviews, nothing has changed, still a great option. The swim suit I’m wearing above is from a European sports store chain called <a href=\"https://www.decathlon.nl/browse/c0-zwemkleding/c1-zwemkleding-dames/_/N-qqg5c5?Ndrc=3\">Decathalon</a>, and it’s from a few years ago when I was pregnant on P2 and needed a two-piece for my belly!</p>\n<p><strong>Goggles:</strong> The last pair I had, according to Amazon purchase history, are these <a href=\"https://amzn.to/3rIQGoM\">Speedo Woman’s Vanquisher Mirrored goggles</a>. Zero complaints about them, I’ll just press re-order once these ones get too scratched up.</p>\n<p><strong>Swim cap:</strong> <a href=\"https://amzn.to/2ppDmnI\">This is a classic</a>. I hope this swim cap lasts forever.</p>\n<h3><span><strong>Weight Room / Gym Equipment:</strong></span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/11/DSC_6632-720x480.jpg\" /></p>\n<p>I love being in the gym. Like love, love lifting. Outside of running, weight training is my favorite form of exercise. Just before the notorious Lock Down 2020 I started to build out my own gym at the office. I don’t have a crazy set up, mostly kettle bells, resistance bands, medicine balls, a few heavy plates, and some dumbbells. As well as a few “recovery” products that keep me moving.</p>\n<p><strong>Lacrosse Balls for Myofascial release:</strong> <a href=\"https://amzn.to/2LUmi6f\">Pure torture</a>, and yet so good. These are for the IT bands and other fun areas that are hard to get at.</p>\n<p><strong>Theragun:</strong> I got this puppy just before covid made it difficult to see a physical therapist. And while I’m not claiming the <a href=\"https://amzn.to/3DDvi6G\">Theragun</a> is a replacement for PT, it certainly helped me knead out those brutal knots and kept me limber for longer stretches with out ART Therapy or other manual therapies for tight and knotted muscles.</p>\n<p><strong>Resistance Band Set:</strong> I’m really happy with <a href=\"https://amzn.to/31GTgAG\">this brand</a> and got them for a good deal!</p>\n<p><strong>Medicine Ball:</strong> <a href=\"https://amzn.to/3dEAQmE\">The Amazon Basics</a> line has been pretty good so far. Best price for the weighted balls that I could find. Mind you mine are all in kgs.</p>\n<p>The rest of the gym equipment I don’t think the brands matter so much. An iron hex dumbbell isn’t going to vary too much… as long as you read the reviews and make sure it’s not a total scam. As well as the kettle bells, foam rollers, resistance bands… just start off small and get moving. You can buy things as you go and get your exercises increase!</p>\n<p>And that’s it! No matter what your current goals are, I want to wish you the best of luck and health getting there! I’ll try to keep an eye on the comments, so any questions OR suggestions you have on items, I’d love to hear from you!</p>\n<p><strong>UPDATE:</strong> It was brought to my attention that I forgot to list our favorite <a href=\"https://amzn.to/3EKnNfp\">coffee machine</a>, which I have so often mentioned as a valuable training partner! So for those of you wondering, Ray and I are big Nespresso fans. We don’t have any convenient Starbucks handy here, and every time we travel to the USA we realize how much we unconsciously spend on drive up coffee spots. For us, we pop 2 espresso pods in the machine, short cup pours, and then we max line the <a href=\"https://amzn.to/31IFZHP\">milk frother</a> et voila!</p>\n<h3><strong>Support the site!</strong></h3>\n<p>As always, Ray and I really appreciate it when you support the site! You can do that several ways, one being making your Amazon purchases using our affiliate links. Even if you click a link and move on to a new product, you can support the site by making any purchase via that link.</p>\n<p>Amazon isn’t your thing? That’s fine too. Did you know that Ray and I sit down every other week and record a behind-the-scenes video of the latest happenings in the DC Rainmaker world? It’s called the <a href=\"https://www.dcrainmaker.com/support\">Quarantine Corner</a> and it’s a lot of fun. You can <a href=\"https://www.dcrainmaker.com/support\">click here</a> to sign up and become a DCR Supporter- just look for the big red button at the bottom of the page!<br />\nYour support is always appreciated around these parts, good luck in your training endeavors!</p>","author":"The Girl","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"07fa1474c3983aca62d393c46c4b42ffe6522c2ba47d8f5cc6e879297e54e960","category":"Cycling"}