{"title":"PSXII-6 Canopy height as a predictor of forage biomass in native rangelands and bermudagrass pastures","link":"https://academic.oup.com/jas/article/102/Supplement_3/605/7757658?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Accurate and less laborious estimates of forage biomass are needed for research and management decisions in grazing lands. Our objective was to develop linear regressions to estimate forage biomass using canopy height in both native rangelands and introduced bermudagrass [<span>Cynodon dactylon</span> (L.) <span>Pers.</span>] pastures in the Cross Timbers and Southern Tallgrass Prairie Ecoregion. Twelve pastures averaging 26 acres each were equally distributed in two ranches located in the Love County, Southern Oklahoma. The native rangelands comprise native tall- and mid-grasses along with forbs and some woody shrub species. Little bluestem [<span>Schizachyrium scoparium</span> (<span>Michx</span>.) <span>Nash</span>] is the dominant species, with brome (<span>Bromus L</span>.), broomsedge bluestem (<span>Andropogon virginicus L</span>.), ragweed (<span>Ambrosia psilostachya DC</span>.), purpletop tridens [<span>Tridens flavus</span> (<span>L</span>.) <span>Hitchc</span>.), dropseed (<span>Sporobolus R. Br.</span>), and Indiangrass [<span>Sorghastrum nutans</span> (<span>L.</span>) <span>Nash</span>] commonly found. The introduced pastures are dominated by bermudagrass with cereal rye (<span>Secale cereale L.</span>) and horseweed [<span>Conyza canadensis</span> (<span>L.</span>) <span>Cronquist</span>] commonly found as well. Samples occurred at pre- and post-grazing conditions from summer 2022 to fall 2023. Measurements included canopy height and hand-clipping all herbaceous vegetation in a 0.25-m<sup>2</sup> frame. Forage samples were fresh weighed then dried for 72 h at 60°C and reweighed. There were 760 and 786 samples collected at native and introduced pastures, respectively. Data were analyzed using PROC GLM of SAS (SAS Inst., Cary, NC) including canopy height (cm) and forage biomass [kg of dry matter (DM)/ha] as independent and dependent variables, respectively. Only regressions including all parameters as significant (<span>P</span> &lt; 0.05) were selected, and coefficient of determination (R<sup>2</sup>) and root mean square error (RMSE) were used to evaluate the predictive ability of the regressions. There was a pasture type (native or introduced) × season interaction (<span>P</span> &lt; 0.001). This interaction is likely explained by the dominant species in each pasture type across seasons as well as their phenological stage. For the native rangeland, the spring linear regression including the quadratic term had the best fit with the greatest R<sup>2</sup> (0.56) and the least RMSE (944 kg DM/ha; Table 1). Summer and fall regressions had R<sup>2</sup> of 0.45 and 0.24 and RMSE of 1139 and 1343, respectively. No regressions were selected for winter because parameters were not significant (<span>P</span> = 0.53 and <span>P</span> = 0.18). For the introduced bermudagrass pasture, regressions presented R<sup>2</sup> ranging from 0.24 and 0.30 except during the winter (R<sup>2</sup> = 0.09). These results indicate that forage biomass can be acceptably estimated using canopy height only during spring in the native rangeland.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"080625ffc68b60c2a939eaeb04b2f4f415eae29cc6ab9fa91f475759ed1fe6cf","category":"Environment"}