{"title":"Comparing two protocols of shock wave therapy for patients with plantar fasciitis: A pilot study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302553","date":1715004000000,"content":"<p>by Fatima A. L. Kalbani, Reime Shalash, Raneen Qadah, Tamer Shousha</p>\r\nObjectives <p>This pilot study primarily aimed to detect the adherence as well as the effect size required to estimate the actual sample size needed for a larger scale study to compare and evaluate the effectiveness of two extracorporeal shock wave therapy (ESWT) protocols along, with a physical therapy program in reducing pain and improving function among patients suffering from plantar fasciitis. The study also aimed to report the effects of the ESWT protocols used on pain and function.</p> Methods <p>A total of 26 participants took part in the study, including 17 females and 9 males. The average age of the participants was 34 years with a body mass index (BMI) of 23 kg/m<sup>2</sup>. Participants were divided into three equal groups; Group A received ESWT at a frequency of 15 Hz and intensity of 3, Group B received ESWT at a frequency of 10 Hz and intensity of 4, while Group C underwent the selected physical therapy program along with sham shock wave therapy as a control. Pain levels were assessed using the Visual Analog Scale (VAS) while functional improvements were evaluated using the Foot Function Index (FFI). Data was collected prior to treatment, after three sessions and at the end of six weeks (after six sessions).</p> Results <p>The three groups were well matched, and the results revealed high adherence rates (90%, 90% and 80% respectively). Results also indicated reductions in pain levels and improvements in function for both intervention groups when compared to the control group. Group A demonstrated better outcomes compared to Group B while Group C showed relatively less improvement.</p> Conclusion <p>The study concluded a high adherence rate for the three groups as well as a small effect size detected of 0.282 that would suggest a total of 123 participants to be required to replicate the study on a larger scale. With regards to the findings of this pilot, the combination of ESWT and a targeted physical therapy program revealed a possible effective therapeutic approach for plantar fasciitis, with a higher frequency potentially yielding more favourable results.</p>","author":"Fatima A. L. Kalbani","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"08076ae5727582ca2799810ea046f554def860469249531035164b877e909a80","category":"Interdisciplinary"}