{"title":"Infection Prevention and Control (IPC) Strategies According to the Type of Multidrug Resistant (MDR) Bacteria and Candida Auris in Intensive Care (ICU): A Pragmatic Resume, Pathogens R0, and Cost-Effectiveness Analysis","link":"https://www.preprints.org/manuscript/202407.0360/v1","date":1720015880000,"content":"Multidrug resistant organisms (MDROs) outbreaks have been steadilyincreasing in Intensive care units (ICUs). Still, healthcare institutions and workers (HCW) reached no unanimity on how and when implementing infection prevention and control (IPC) strategies. We aimed to provide a pragmatic, physician practice-oriented, resume of strategies towards different MRDOs outbreaks in ICU. We performed a narrative review on IPC in ICUs, investigating patient-to-staff ratios, education, isolation, decolonization, screening and hygiene practices, outbreak reporting, cost-effectiveness, reproduction-number(R0), and future perspectives. The most effective IPC strategy remains unknown. Most studies focus on a specific pathogen or disease, making the clinician losing the big picture. IPC strategies proved their cost-effectiveness regardless typology, country, or pathogen. A standardized, universal, pragmatic protocol for HCW education should be elaborated. Likewise, a rapid outbreak recognition tool elaboration (i.e., an easy-to-use mathematical model) would improve early diagnosis and spreading prevention. Further studies are needed to express in favor or against MDROs decolonization. New promising strategies are emerging and need to be tested in the field. The lack of IPC strategies application has made, and still makes ICUs a major MDROs reservoir into the community. In a not-too-distant future genetic engineering and phage therapies could represent a plot-twist in MDROs IPC strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0811493e092c20007155e8642f4d8b17235c9d76c2fc8db9e92a98b5afadae65","category":"Interdisciplinary"}