{"title":"PSLBII-4 The effect of standardized ileal digestible sulfur amino acid intake during late gestation on gilt whole-body nitrogen retention and subsequent litter performance","link":"https://academic.oup.com/jas/article/102/Supplement_3/666/7757584?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Gestating gilts [n = 27; body weight (BW) = 158 ± 5.5 kg] were used to determine the effect of standardized ileal digestible (SID) sulfur amino acid (SAA) intake during late gestation on whole-body nitrogen (N) retention and subsequent litter performance. Gilts were assigned to one of two experimental diets that provided SAA at 60 or 200 % of estimated requirements during late gestation (0.29 and 0.92 % SID SAA, respectively; n = 15 and 12, respectively; Table 1 and 2). Each gilt received 2.53 kg of the assigned diet between gestation d 90 and farrowing; standard lactation and nursery diets were provided to gilts after farrowing and offspring after weaning, respectively. Gilt whole-body N balance was determined between d 107 and 109 of gestation using total urine collection and fecal grab-sampling. After farrowing, litters were standardized to 13 piglets and were not offered creep feed. Whole-body N retention was greater in gilts fed the diet containing 0.92 vs. 0.29 % SID SAA in late gestation (27.2 vs. 19.3 ± 1.8 g/d; <span>P</span> &lt; 0.05; Table 3), but the number of piglets born alive, litter birth weight, subsequent piglet growth rates, and litter size at weaning were not different between treatment groups. The post-weaning growth performance of offspring was also not influenced by maternal dietary treatment in late gestation (Table 4). At farrowing, the post-absorptive plasma concentration of Cys tended to be less (<span>P</span> = 0.072) and taurine was greater (<span>P</span> &lt; 0.01) for gilts fed 0.92 vs. 0.29 % SID SAA in late gestation; however, there were no differences in plasma SAA metabolites concentrations for gilts at weaning or offspring at birth (Table 5. At weaning, offspring from gilts fed 0.92 % SID SAA had greater plasma homocysteine (<span>P</span> &lt; 0.05) and plasma Cys concentrations (tendency; <span>P</span> = 0.072) vs. offspring from gilts fed 0.29 % SID SAA in late gestation. Three weeks after weaning, plasma taurine concentration was less (<span>P</span> &lt; 0.05) for offspring from gilts fed 0.92 vs. 0.29 % SID SAA in late gestation (Table 6). Six weeks after weaning, plasma glutathione concentration tended to be less (<span>P</span> = 0.057) for offspring from gilts fed 0.92 vs 0.29 % SID SAA in late gestation. When SAA were fed below estimated requirements during late gestation, whole-body N retention was reduced, but fetal growth appeared to be maintained, likely at the expense of maternal N retention. Such divergences in dietary SAA supply in late gestation had no effect on subsequent offspring growth performance, but it appeared that offspring SAA metabolism was impacted until at least 6 wk after weaning. The influence of differences in sulfur AA metabolites on offspring performance beyond the nursery phase remains unknown. Therefore, carry-over effects of maternal SAA supply in late gestation should be considered when developing feeding recommendations for gestating gilts.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"081508000d8ac1a98ce93549ec12ff408efbc86e99f24dbe8108e281d4156360","category":"Environment"}