{"title":"Review: Castelli’s new Premio Black bib shorts","link":"https://cyclingtips.com/2021/05/review-castellis-new-premio-black-bib-shorts/","date":1621930033000,"content":"<p>Castelli has a new bib short, the Premio Black, which it designed with one goal in mind: “to be the most comfortable performance short for your longest ride.” That’s a lofty claim. Can Castelli deliver? </p>\n\n\n\n<p>The new bibs feature a weave specifically designed by Castelli, the same Progetto X² seat pad as the <a target=\"_blank\" href=\"https://cyclingtips.com/2020/01/castelli-launches-ultralight-superleggera-bib-short-and-climbers-3-0-jersey/\">Superleggera bib short</a>, lightweight bib straps, subtle branding, and a seamless waist. </p>\n\n\n\n<p>Castelli says the new bibs are “not a race” short, but rather “a performance short for your own challenges.” Castelli seemingly wants to cover every base, claiming the shorts are at home in ultra-endurance events and long gravel rides over rough surfaces. Castelli goes on to say it tested the bibs on Zwift rides, hot summer days, winter rides, mountain biking, and under baggies. The brand adds: “We say it’s not a race short, but that’s only because we can’t print team graphics on this fabric.</p>\n\n\n\n<h2>Less is more </h2>\n\n\n\n<p>Castelli has taken a “less is more approach” to deliver this claimed comfort: fewer panels, fewer seams – less of everything bar comfort. Just three panels make up the shorts (not including the bibs) compared to three times as many in some traditional shorts. </p>\n\n\n\n<p>Each leg is just a single large panel from the hips down. This panel wraps around the thigh connected by a single seam. The leg panels then meet under the shorts along the centre line of the chamois. </p>\n\n\n\n<p>A third smaller panel sits at the lower back panel, bridging the gap between the two leg panels across the rear. Castelli has added a thin liner inside this rear panel to combat complaints that some of its previous bib shorts became too transparent. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-short-202-1340x754.jpg\" /><figcaption>The three panels meet under the chamois.</figcaption></figure>\n\n\n\n<p>These panels feature a stretch-woven fabric that appears very similar to that used in the <a target=\"_blank\" href=\"https://cyclingtips.com/2020/01/castelli-launches-ultralight-superleggera-bib-short-and-climbers-3-0-jersey/\">Superleggera bib short</a> we reviewed last year. </p>\n\n\n\n<p>Woven fabrics are becoming more common and differ from the knit style fabrics typically used in shorts. The weaving process is said to create a thinner, denser and more durable fabric. However, woven fabrics are typically not as elastic as knit, so Castelli added 35% Lycra to give the stretch required in cycling bibs. </p>\n\n\n\n<p>The thinner and denser woven fabric is said to offer better temperature regulation – in warm weather, the thinner fabric means moisture can evaporate closer to the skin. In an apparent contradiction, Castelli claims that the fabric is also great in cool weather, as the tighter weave means less wind can come through the fabric. </p>\n\n\n\n<p>Castelli says the new Premio Black bibs are only possible thanks to this engineered-weave fabric that was created exclusively for the Italian brand. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-short-200-1340x754.jpg\" /><figcaption>The gripper area transitions into a ribbed mid thigh area and finally into the chamois area.</figcaption></figure>\n\n\n\n<p>While the leg of the short features just one panel, the fabric varies to provide compression, support, and grip where needed. </p>\n\n\n\n<p>Starting at the end of the leg, Castelli has utilised a specific weave that brings the Lycra to the inner surface and keeps the shorts in place without the need for a silicone gripper or traditional leg band. This means the leg end gets that laser-cut modern look, with 7 cm of gripper area on the men’s shorts and 6 cm on the women’s. </p>\n\n\n\n<p>The thighs feature a lighter fabric to enhance breathability and include a ribbed area to retain compressiveness. Designers increased compression and support further in the hip area to, as Castelli says, “keep the seat pad and everything else in place.” </p>\n\n\n\n<h2>The upper</h2>\n\n\n\n<p>Speaking of keeping everything in place, Castelli has opted for a lighter-weight bib strap, as is common now. Minimalist straps can go either way – too narrow and they can dig into your shoulders and bunch up or fold over too easily. Get it right, though, and the result is a bib that is almost unnoticeable when worn. </p>\n\n\n\n<p>Castelli has added a tab to the upper front of the bibs to combat that wrinkling issue with narrower straps. This tab adds a small section of zero flex to the very thin and stretchy straps.  </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-shorts-27-1340x754.jpg\" /><figcaption>Castelli has added these reinforcement tabs to the upper bib straps.</figcaption></figure>\n\n\n\n<p>The two front straps merge into one super stretchy, soft, and perforated rear panel. The level of attention to detail in every aspect of the bibs is evident here, with Castelli opting for a “no-sew” border for increased comfort on the edges of this panel.  </p>\n\n\n\n<p>Moving back to the front of the bibs, Castelli has created a seamless waist at the front by simply folding over a section at the top of the leg panels. This means the seam ends where the bib straps meet the leg panels and leaves the front area seamless and more flexible. While the theory and function are sound, some may miss the support a high waist with some compression can offer. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-short-231-1340x754.jpg\" /><figcaption>The higher waist line ends at the bib junction and drops to a seamless fold over round the front</figcaption></figure>\n\n\n\n<h2>The same but different</h2>\n\n\n\n<p>As mentioned already, the attention to detail across the entire short is evident. Castelli says this attention to detail extends to the design of the men’s- and women’s-specific options. The design of both versions was independent from the start to develop what Castelli says is the “ideal fit”. </p>\n\n\n\n<p>The obvious difference is the seat pad, which differs in both shorts to deliver comfort for different anatomies. Additionally, though, Castelli says the legs on the men’s shorts are longer, whereas the bib straps on the women’s are wider. Castelli is also offering a bib-less version of the women’s shorts. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-shorts-201-1340x754.jpg\" /><figcaption>The women’s bibs look the same, but differ in key areas. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-shorts-202-1340x754.jpg\" /><figcaption>A bibless version is available in the women’s shorts.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-shorts-200-1340x754.jpg\" /></figure></li></ul><figcaption>Photos – Castelli</figcaption></figure>\n\n\n\n<h2>End result? </h2>\n\n\n\n<p>Bib shorts are a notoriously personal area, so what follows now is entirely subjective. What I can say though is this subjective view is shared by a number of my colleagues here at CyclingTips. These shorts are good. Very good!</p>\n\n\n\n<p>The shorts have a modern and premium look to them. The classic black-all-over styling never gets old. Castelli has kept its branding logos very subtle by laser-etching the scorpion and Rossa Corsa logo rather than adding the traditional large red transfer. This means the shorts will go with anything, even for the most fashion-conscious. </p>\n\n\n\n<p>I was slightly sceptical when I first lifted the shorts. The fabric has a very papery feel to it, and they look tiny. I was thinking “these things are tiny, and I’m not sure they will stretch too much to fit”. </p>\n\n\n\n<p>Things only slightly improved as I tried the shorts for the first time. Admittedly the legs felt great and fit almost perfectly from the word go. That woven fabric is so nice to touch, and the stretch is ample. The compression is sufficient to hold everything in place but, crucially, not enough to be noticeable. However, the bib straps are really tight when standing off the bike. So much so they almost force me to hunch over.</p>\n\n\n\n<p>That’s kind of the point though; Castelli designed these shorts to be comfortable on the bike, not off it. Hop on the bike, lean over into a riding position, and that tightness around the bibs is noticeably less, although they could and perhaps should still be a bit longer. </p>\n\n\n\n<p>I noticed on one Zwift ride when the straps got a bit wet from sweat, they started to shift about a bit due to this tightness. It wasn’t enough to hurt or dig into me, but just enough to be a bit annoying. </p>\n\n\n\n<p>That strap reinforcement tab is a nice addition and helps with setting the straps in position. The tabs also help keep the straps in place, and I found no folding over of the bibs during my rides in the shorts. </p>\n\n\n\n<h2>On the bike</h2>\n\n\n\n<p>Out on the bike, the Premio Blacks really come into their own. “Second skin” is an often overused term, but it it is quite fitting (pardon the pun) in this case. The bib straps aside, the whole short seems at one with the body. There are no tight areas, no restrictive seams, no chafing, and plenty of breathability. </p>\n\n\n\n<p>The gradient fabric is noticeably more supportive around the hips, while the compression around the leg end is ample to hold the leg in place with no riding up. </p>\n\n\n\n<p>I found the two-layer Progetto X2 Air seamless pad provided more than ample support in a pad minimal enough to go unnoticed, both seated and standing. </p>\n\n\n\n<p>The pad features a soft and stretchy upper “skin care layer”, designed to move with the skin. Beneath that upper layer is a “cushioning layer” with medium density foam and 3 mm gel pads that sit under the sit bones and perineum. </p>\n\n\n\n<p>This twin layer pad construction combines with, at least for me, perfect pad positioning to make a very comfortable chamois.</p>\n\n\n\n<p>The seamless front waist area worked well for me. The extra flexibility was most noticeable on the indoor trainer, where this extra stretch was useful in combating the lack of movement typically experienced while riding on a fixed trainer. </p>\n\n\n\n<p>That low-cut waistline won’t be to everyone’s pleasing, but I did like it, and it made for easy comfort breaks. </p>\n\n\n\n<p>While I don’t have eyes on the back of my head, and nor did I even have anyone sitting in my wheel last week, the lined back panel seems to solve any transparency issue in the rear of the shorts. Stretching the fabric in my hands and checking in the mirror showed no signs of any transparency when the fabric is under stretch. The real test for this will only come with months of riding and wear. </p>\n\n\n\n<p>The second layer liner solves the transparency issue but may have a slight impact on breathability in this area. While not warm enough to test this thoroughly in Ireland at the moment (or ever), myself and a colleague both felt a slight built-up of heat in this area. </p>\n\n\n\n<p>All things considered, I can say these are the most comfortable on-the-bike bib shorts I have ever worn. </p>\n\n\n\n<p>Admittedly this is a somewhat limited sample size; I have mainly used just three clothing brands in the last 13 years. But, I have ridden many noticeably comfortable shorts in that time. The difference with the Premio Black shorts is that they are so comfortable they become unnoticeable.  </p>\n\n\n\n<p>The only thing I could pick flaws in is those bib straps, which, as mentioned earlier, could be a little longer. Otherwise, the shorts are perfect for my riding. </p>\n\n\n\n<p>I have had the shorts for a little over a week and ridden them five times in that short period. It will take a much longer review to accurately comment on their durability. </p>\n\n\n\n<p>The lightweight and paper-like feel of the fabric hints at somewhat limited life, but Castelli claims the woven fabric is actually much more durable and highly abrasion-resistant. Only time will tell.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-short-204-1340x754.jpg\" /><figcaption>A few worrying stray threads after just a handful of rides.</figcaption></figure>\n\n\n\n<p>Somewhat surprisingly, after just a handful of rides, I have found a few stray threads. This is another area I will have to keep a close eye on over a full summer of riding.</p>\n\n\n\n<p>Castelli has a history of pushing cycling clothing tech forward. The fabrics, the construction, and the attention to detail in these new bibs feel like another one of those steps forward. </p>\n\n\n\n<p>The Premio Black is available now at <a target=\"_blank\" href=\"https://www.castelli-cycling.com/gb/men/bottoms/cycling-bib-shorts\">Castelli-Cycling.com</a> at the not-so-budget price of US$259.99 / AU$369 / £220 / €229.95.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-short-232-1340x754.jpg\" /><figcaption>The lower front waist line. Note also the stretch on the bibs.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-shorts-249-1340x754.jpg\" /><figcaption>The ribbed fabric on the mid-thigh.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-shorts-752-1340x754.jpg\" /><figcaption>This scorpion logo is laser-etched for a very subtle look.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-shorts-301-1340x754.jpg\" /><figcaption>I stood on what?</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-shorts-waist-1340x754.jpg\" /><figcaption>The Premio Blacks provide ample support around the waist to hold the shorts and seat pad in place.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-short-236-1340x754.jpg\" /><figcaption>The only flash of red is this very small scorpion logo which even hides beneath the jersey while on the bike.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-short-237-1340x754.jpg\" /><figcaption>The seamless construction and subtle branding give a classic look </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-short-235-1340x642.jpg\" /><figcaption>No sign of any transparency, thankfully! The real test for this will be how the new shorts handle wear months down the road.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Castelli-Premio-Black-Bib-shorts-52-1-1340x860.jpg\" /><figcaption>The bibs are the only negative I can point to in these bibs.</figcaption></figure></li></ul></figure>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/review-castellis-new-premio-black-bib-shorts/\">Review: Castelli’s new Premio Black bib shorts</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0821a129d9bae493a84df8c4236c77e1bf2ae1a061a0940647cc816fb1d83b07","category":"Cycling"}