{"title":"เตือนผู้ซื้อ iPhone 15 ใหม่ อัพเดตเป็น iOS 17.0.2 ก่อนถ่ายโอนข้อมูลตรงจาก iPhone เก่า","link":"https://www.blognone.com/node/135884","date":1695394538000,"content":"<div><div><div><p>แอปเปิลเริ่มส่งมอบและขาย iPhone 15 วันนี้วันแรกในประเทศไทย และดูเหมือนจะเกิดปัญหาเล็ก ๆ กันตั้งแต่วันแรก หากผู้ใช้งานเลือกวิธีการถ่ายโอนข้อมูลจาก iPhone เครื่องเก่าด้วยการถ่ายโอนโดยตรง (From Another iPhone) โดยอาจพบปัญหาโลโก้แอปเปิลค้างและไม่สามารถใช้งานต่อได้</p>\n<p>ปัญหานี้แอปเปิลบอกว่ามีผลกับ iPhone 15 ทุกรุ่นทั้ง iPhone 15, iPhone 15 Plus, iPhone 15 Pro และ iPhone 15 Pro Max</p>\n<h3>กรณียังไม่ได้ถ่ายโอนข้อมูล</h3>\n<p>สำหรับคนที่ยังไม่ได้เริ่มทำอะไรกับ iPhone 15 คำแนะนำคือให้<a href=\"https://www.blognone.com/node/135867\">อัพเดต iOS</a> ที่ติดมากับ iPhone เครื่องใหม่ซึ่งเป็น iOS 17 <strong>ให้เป็นเวอร์ชันล่าสุด iOS 17.0.2</strong> ก่อน ซึ่งแอปเปิลระบุว่าได้แก้ไขปัญหาที่เกิดระหว่างการถ่ายโอนข้อมูลตรงจาก iPhone เครื่องเก่าแล้ว</p>\n<h3>กรณีถ่ายโอนข้อมูลตรงและเจอปัญหาแล้ว</h3>\n<p>วิธีแก้ไขปัญหาคือรีเซตอุปกรณ์ มีขั้นตอนดังนี้ (<a href=\"https://support.apple.com/en-us/HT213933\">รายละเอียดเต็มในเว็บแอปเปิล</a>)</p>\n<ol>\n<li>รีสโตร์ iPhone ด้วยคอมพิวเตอร์ โดยเชื่อมต่อ iPhone เข้ากับคอมพิวเตอร์ด้วยสาย กดปุ่มเพิ่มเสียงและปล่อย กดปุ่มลดเสียงและปล่อย จากนั้นกดปุ่มด้านขวาค้าง จนกระทั่งขึ้นโลโก้แอปเปิล ให้กดค้างต่อไปจนกว่าจะขึ้นรูปสายเชื่อมต่อกับคอมพิวเตอร์ จากนั้นใช้ Finder (Mac) หรือ iTunes (PC) เพื่อสั่งรีสโตร์และอัพเดต</li>\n<li>เมื่อขึ้นหน้า Hello ให้เลือกตั้งค่าโทรศัพท์ใหม่ และอัพเดตซอฟต์แวร์ iOS</li>\n<li>เมื่ออัพเดตแล้ว สามารถเลือกถ่ายโอนข้อมูลตามวิธีที่ต้องการ</li>\n</ol>\n<p>ที่มา: <a href=\"https://www.macrumors.com/2023/09/22/warning-update-your-iphone-15-to-ios-17-0-2/\">MacRumors</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1d20982392850fb8e989121a5f134e1b.jpg\" /></p>\n<p>คำเตือนขณะตั้งค่า iPhone 15 ใหม่ ระบุให้อัพเดตซอฟต์แวร์ก่อนหากจะถ่ายโอนข้อมูลตรงจาก iPhone เครื่องเก่า แต่ถ้าใช้ iCloud Backup ยังไม่ต้องอัพเดตตอนนี้ก็ได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/9109ae8339dcb5a6b6cf14d94e868e20.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/iphone-15-pro\">iPhone 15 Pro</a></div><div><a href=\"/topics/iphone-15\">iPhone 15</a></div><div><a href=\"/topics/bug\">Bug</a></div><div><a href=\"/topics/ios-17\">iOS 17</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0822bfb853099e882659dfa56f9bd8fa24e0bb5c7cbbd30c00855cfcaa3ba41b","category":"Thai"}