{"title":"รับพรก่อนสอบ ครูคณิตจากไต้หวัน ลงวิดีโอสอนแคลคูลัสบน Pornhub ยอดวิวรวมเกือบ 1.7 ล้าน","link":"https://www.blognone.com/node/125453","date":1635158841000,"content":"<div><div><div><p>Changsu คุณครูสอนวิชาคณิตศาสตร์จากไต้หวัน อัพโหลดคลิปสอนแคลคูลัสและคณิตศาสตร์อื่นๆ เป็นภาษาจีนกลางบน Pornhub ปัจจุบันมียอดวิวรวมเกือบ 1.7 ล้านวิว ในชื่อช่อง Changsumath666 พร้อมสโลแกน “Play Hard, Study Hard!”</p>\n<p>เขาระบุว่าทำแบบนี้เพราะไม่เห็นมีใครสอนคณิตศาสตร์บนเว็บหนังผู้ใหญ่เลย และเขาเคยลองอัพบนเว็บอื่น เช่น Xvideos.com แล้ว แต่เหมือนเว็บเหล่านั้นจะไม่อนุญาตให้อัพวิดีโอนอกเหนือจากวิดีโอผู้ใหญ่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f063789ef9b09fbe6c983cb7055b163a.png\" /></p>\n<p>Changsu ประเมินว่ายอดวิวกว่าครึ่งมาจากคนที่แค่อยากดูครูสอนคณิตบน Pornhub เท่านั้น แต่เขาก็บอกอีกว่าถึงคนจะไม่สนใจวิดีโอของเขาก็ไม่เป็นไร เพราะอย่างน้อยคนก็ได้รู้ว่ามีครูคนนึงมาสอนแคลคูลัสอยู่บนแพลตฟอร์มหนังผู้ใหญ่อยู่ดี</p>\n<p>จุดประสงค์หลักของการลงคลิปแบบนี้คือการทำการตลาด เพื่อให้มีคนลงเรียนคอร์สติวของเขามากขึ้น ซึ่งปัจจุบันเขาทำรายได้กว่า 250,000 ดอลลาร์สหรัฐฯ จากการเปิดติวคณิตศาสตร์ซึ่งใช้เป็นค่าจ้างให้กับทีมงาน และทำวิดีโอออกมาเรื่อยๆ</p>\n<p>เขาทิ้งท้ายว่าเขาไม่ได้อยากสอนคณิตบน Pornhub แค่อยากให้โลกรู้ว่าเขาเป็นคุณครูชาวไต้หวันที่สอนคณิตศาสตร์ได้เก่งเท่านั้น ผู้ที่สนใจสามารถติดตามช่องทางอื่นของ Changsu ได้ที่ <a href=\"https://www.instagram.com/changhsumath/\">Instagram</a> และ <a href=\"https://www.youtube.com/channel/UCxBv4eDVLoj5XlRKM4iWj9g\">Youtube</a> (ภาษาจีนกลางทั้งคู่)</p>\n<p>ที่มา - <a href=\"https://melmagazine.com/en-us/story/math-lessons-on-pornhub\">Mel Magazine</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/pornhub\">Pornhub</a></div><div><a href=\"/topics/mathematics\">Mathematics</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0825daf9e5ac150902bd508f70896361ee811515ab30357f9120d73e58c05795","category":"Thai"}