{"title":"A changing river: Long‐term changes of sinuosity and land cover in the Navasota River Watershed, Texas","link":"https://onlinelibrary.wiley.com/doi/10.1002/rvr2.85?af=R","date":1715072378000,"content":"<h2>Abstract</h2>\n<p>The Navasota River Basin, itself a tributary of the Brazos River in Texas, is a dynamic watershed undergoing many natural and anthropogenic changes. Local stakeholder involvement in this watershed is quite high, and many landowners in the southern portion of the watershed have concerns regarding the increasing frequency and duration of flooding on private property adjacent to the river, often attributing these impacts to the construction of the Lake Limestone dam. In this study, we examine historical flow data, channel morphology, land use/land cover, and precipitation. Our findings indicate that while there appears to be increasing flow in the northern portion of the watershed, temporal data gaps near the watershed outfall prevent the indication of such a trend in the southern portion of the watershed. Nevertheless, other natural and anthropogenic factors are evident in the watershed that may have a significant influence on downstream flooding. Overall river sinuosity (meandering) declined over the study period, with some river segments encountering significant straightening. Total river length declined by 4.3 km from 1972 to 2020. The number and length of offtake channels also decreased substantially during this period. Land use/land cover use shifted dramatically, with a 39.2% increase in impervious cover and a 12.5% decrease in herbaceous cover since 1972. Finally, yearly precipitation increased, with the change point occurring in 1972. Our findings suggest that the shortening and straightening of the river has reduced its volumetric capacity over time. Coupled with increasing impervious surface cover and precipitation, more water is being delivered downstream at a rate exceeding the watershed's ability to discharge it, thereby contributing to flooding issues expressed by stakeholders. We recommend that bathymetric data and supplemental flow monitoring and modeling within the watershed is needed to fully understand how anthropogenic and natural forces may further affect streamflow in the future.</p>","author":"Edward C. Rhodes, \nRocky Talchabhadel, \nTaylor Jordan","siteTitle":"Wiley: River: Table of Contents","siteHash":"0b74d58d2572beb2996093d38ec1aeffad4d7646e8152f056f56cbe7cdd98b36","entryHash":"08286f9732f31ebe894b60eb9a5500ad7a093d30a40804bdadcb88f458af707b","category":"Environment"}