{"title":"Apple อาจต้องเปลี่ยนชื่อ Vision Pro ในจีนหลัง Huawei ชิงจดเครื่องหมายการค้าตั้งแต่ 2019","link":"https://www.blognone.com/node/134350","date":1686731383000,"content":"<div><div><div><p>HuaweiCentral (HC) Newsroom เปิดเผยว่า HUAWEI เคยจดเครื่องหมายการค้า <a href=\"https://www.blognone.com/node/134223\">Vision Pro</a> หมายเลขจดทะเบียน 38242888 ไว้ตั้งแต่ปี 2019 ซึ่งอาจทำให้ Apple ต้องทำการเปลี่ยนชื่อผลิตภัณฑ์ในประเทศจีน</p>\n<p>HUAWEI ได้ยื่นจดเครื่องหมายการค้า ที่มีอายุตั้งแต่ 28 พฤศจิกายน 2021 - 27 พฤศจิกายน 2031 ครอบคลุมสินค้าพวก อุปกรณ์จัดเก็บข้อมูล, คอมพิวเตอร์, คีย์บอร์ด, เมาส์, ปากกาและอื่นๆ ซึ่งรวมไปถึงอุปกรณ์ VR Headset แบบสวมศีรษะ และ Wearable Video Displays</p>\n<p>ถึงแม้ว่าหน้าเว็บของ HUAWEI EYEWEAR จะระบุชื่อกลุ่มผลิตภัณฑ์ว่า Huawei Vision ได้แก่สินค้า แว่นตาอัจฉริยะรุ่นแรก Vision Glass และ HUAWEI Vision Smart Screen Series ก็ตาม แต่ยังสงวนสิทธิ์ชื่อว่า Vision Pro ไว้สำหรับผลิตภัณฑ์แว่นตาที่อาจจะปล่อยในอนาคตด้วย</p>\n<p>จีนถือเป็นหนึ่งในตลาดใหญ่ของ Apple ดังนั้นการขายสินค้าในชื่อ Vision Pro อาจจะทำให้เกิดปัญหาขึ้นได้ในอนาคตหรือแม้กระทั่งการเพิ่มคำนำหน้า Apple ไว้ข้างหน้า Vision Pro ก็อาจจะไม่ได้ผลเช่นเดียวกัน</p>\n<p>ต้องรอดูต่อไปว่า Apple จะรีแบรนด์ชื่อก่อนเปิดตัว Vision Pro ในประเทศจีนหรือไม่ หรืออีกทางอาจจะต้องเจรจากับทาง HUAWEI ในเชิงกฎหมายเพื่อขอใช้ชื่อ Vision Pro แต่ทางเลือกสุดท้ายที่หลายคนคาดการณ์คือ การที่ Apple ตัดสินใจไม่นำ Apple Vision Pro เข้ามาขายในจีน ซึ่งจะเป็นการสูญเสียรายได้จากตลาดใหญ่อย่างจีนไป</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1beb56a10e3bec521d2369ec9518f666.jpg\" alt /><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5437a4eed8e649fc12fc50c415544560.jpg\" /></p>\n<p>ที่มา: <a href=\"https://www.patentlyapple.com/2023/06/opps-huawei-filed-for-the-vision-pro-trademark-in-china-back-in-2019-which-will-likely-force-apple-to-rebrand-their-headset.html\">Patentlyapple</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple-vision-pro\">Apple Vision Pro</a></div><div><a href=\"/topics/huawei\">Huawei</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"08383d6639f6a0a2cdd49e5b4ad1d8f46b56c4cb541175b82d9b74160814f264","category":"Thai"}