{"title":"Forest stand dynamics of a short‐stature tree species: Ecological knowledge for sustainable forest management","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14662?af=R","date":1719985341000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/f5bde3b4-53d4-45ea-a07c-8acf552b53de/jpe14662-toc-0001-m.png\" alt=\"Forest stand dynamics of a short-stature tree species: Ecological knowledge for sustainable forest management\" />\n<p>The acknowledgement that short-stature tree species follow a stand dynamic different from tall tree species necessarily implies that they must be managed differently. This recognition, along with the implementation of ecology-based silvicultural recommendations, represents strong arguments to make modifications to forest legislation that, together, must be aimed at conservation and sustainable forest management.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nWorldwide, the implementation of forest management guidelines has tried to mimic natural forest dynamics. The Oliver forest stand dynamics model has been successful in bridging natural forest dynamics associated with the disturbances of various spatial scales and silviculture also related to various spatial scales of management. However, the application of this model (and others) is restricted to tall forests.\n\nWe claim here that the general research and commercial interest bias towards tall tree species has permeated silviculture and forest management, and that both the stand dynamics of short-stature tree species and their treatment have remained largely unexplored and unknown.\n\nUsing one short-stature tree species, <i>Nothofagus antarctica</i>, as a model system, we show that this species indeed follows a stand dynamic different from other tall <i>Nothofagus</i>-dominated forests in southern South America. This species forms short, mature, even-aged stands without large canopy gaps that promote tree regeneration. With this in mind, we propose a conceptual ecology-based silvicultural guideline focusing on the creation of strip cuts or gaps along with topsoil scarification to ensure regeneration and forest reorganization after disturbances.\n\n<i>Policy implications</i>. The acknowledgement that short-stature tree species follow a stand dynamic different from tall tree species necessarily implies that they must be managed differently. This recognition, along with the implementation of ecology-based silvicultural recommendations, represents strong arguments to make modifications to forest legislation that, together, must be aimed at conservation and sustainable forest management.\n</p>","author":"Alex Fajardo, \nPaulo Moreno‐Meynard, \nDaniel P. Soto","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"083a9a7797a65320b020caa4a5c28fbbf3f749e48adac3d5e28ecf15b84489dd","category":"Environment"}