{"title":"Stakeholders’ perspectives on capturing societal cost savings from a quality improvement initiative: A qualitative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310799","date":1727100000000,"content":"<p>by Daniëlle Kroon, Simone A. van Dulmen, Niek W. Stadhouders, Jonas Rosenstok, Baukje van den Heuvel, Gert P. Westert, Rudolf B. Kool, Patrick P. T. Jeurissen</p>\r\nBackground <p>Besides improving the quality of care, quality improvement initiatives often also intend to produce cost savings. An example is prehabilitation, which can reduce complication rates and the length of stay in the hospital. However, the process from utilization reductions to actual societal cost savings remains uncertain in practice. Our aim was to identify barriers and facilitators throughout this process. We used the implementation of prehabilitation in a Dutch hospital as a test case.</p> Methods <p>We held 20 semi-structured interviews between June and November 2023. Eighteen stakeholders were affiliated with the hospital and two with different health insurers. Nine interviews were held face-to-face and 11 via Microsoft Teams. The interviews were recorded and transcribed. The first transcripts were inductively coded by two authors, the subsequent transcripts by one and checked by another. Differences were resolved through discussion.</p> Results <p>We identified 20 barriers and 23 facilitators across four stages: reducing capacity, reducing departmental expenses, reducing hospital expenses and reducing insurer expenses. All participants expected that the excess capacity will be used for other priorities. This was perceived as highly valuable and as an efficiency gain. Other barriers to capture savings included the fear of losing resilience, flexibility, status and revenue. Misalignment between service contracts among hospitals and insurers can hinder the ability to financially incentivize cost reductions. Additionally, some contract types can hinder the transfer of hospital savings to insurers. Identified facilitators included shared savings agreements, an explicit strategy targeting all stages, and labor shortage, among others.</p> Conclusion <p>This study systematically describes barriers and facilitators that prevent translating quality improvement initiatives into societal cost savings. Stakeholders expect that any saved capacity will be used for other priorities, including providing care due to the increasing demand. Capturing any cash savings does not occur automatically, emphasizing the need for a strategy targeting all stages.</p>","author":"Daniëlle Kroon","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"083e361f26e18820779220a53e7b18fb0c7d8959c723b7006c8f7ae60082c2db","category":"Interdisciplinary"}