{"title":"DaVinci Resolve Video Editor Gains New Processing Engine That's Up to 3 Times Faster on M1 Macs","link":"https://www.macrumors.com/2021/08/20/davinci-resolve-new-processing-engine-m1-macs/","date":1629457023000,"content":"Blackmagic Design has <a href=\"https://www.blackmagicdesign.com/media/release/20210819-02\">announced</a> a new update to its professional video editing and color correction software, DaVinci Resolve, that includes a new processing engine offering significantly better performance on Apple silicon Macs.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/DaVinci-Resolve-17-3-Color.jpg\" />\r\n<br />\r\nThanks to the completely reworked engine, DaVinci Resolve 17.3 can work up to 3 times faster on Apple Mac models with the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> chip, according to the company. The speed increase should make playback, editing, and grading of 4K and 8K projects faster using the software. \r\n<br />\r\n\r\n<br />\r\nThe new processing engine also uses tile based rendering, which can give users on notebooks up to 30% longer battery when working in DaVinci Resolve.\r\n<br />\r\n\r\n<br />\r\nIn addition, version 17.3 supports a new option on Mac computers with ‌M1‌ for H.265 hardware encoding. It's now possible to prioritize speed or quality when rendering, with render times potentially improved by up to 65%. DaVinci Resolve now also decodes AVC Intra files using the media engine built into the Apple ‌M1‌ chip, making decoding and playback faster when working with these file formats.\r\n<br />\r\n\r\n<br />\r\nMeanwhile, new FX controls have been added, including new grid shapes and greater precision when using mosaic blur, allowing users to finely adjust the amount and appearance of pixellation. \r\n<br />\r\n\r\n<br />\r\nKeyer garbage mattes now have rotation controls, making it easier to remove unwanted items from view, and new saturation and gamma controls on the glow plugin allow greater control and subtlety over lighting effects. Also, aperture diffraction in DaVinci Resolve Studio has new anamorphic aperture controls, allowing a wider range of lenses to be emulated.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/DaVinci-Resolve-17-3-Edit.jpg\" />\r\n<br />\r\nElsewhere, new drivers offer improved latency, and more Fairlight export options make it easier and faster to pass on audio for further processing or inclusion in a larger project.\r\n<br />\r\n<blockquote>\"This is truly an amazing update that gives customers huge performance and power efficiency gains on Mac models with M1, and it totally transforms your computer, simply by downloading this free of charge DaVinci Resolve software update\" said Blackmagic Design CEO Grant Petty in a press release. \"This speed increase is stunning and it's hard to believe. I have not seen a speed improvement this large since the original 68000 to Power PC transition back in the 1990s and it is just amazing. Who would have thought just a year ago that multiple 4K streams could be played back and edited natively on a MacBook Air, but it's easy now on DaVinci Resolve with M1. The engineering team has worked so hard on this new image processing engine for DaVinci Resolve, and it is an incredibly exciting time to be developing software for the Mac!\" </blockquote>The DaVinci Resolve and DaVinci Resolve Studio 17.3 update is now available for download from the <a href=\"https://www.blackmagicdesign.com/products#\">Blackmagic Design website</a> for all current DaVinci Resolve users. DaVinci Resolve is a <a href=\"https://apps.apple.com/app/davinci-resolve/id571213070?mt=12\">free download on the Mac App Store</a> for individual users; <a href=\"https://www.blackmagicdesign.com/products/davinciresolve/\">Resolve Studio</a>, the enhanced group collaboration editing suite, costs $295.<div>Tag: <a href=\"https://www.macrumors.com/guide/davinci-resolve/\">DaVinci Resolve</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/20/davinci-resolve-new-processing-engine-m1-macs/\">DaVinci Resolve Video Editor Gains New Processing Engine That's Up to 3 Times Faster on M1 Macs</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/davinci-resolve-video-editor-gains-new-processing-engine-thats-up-to-3-times-faster-on-m1-macs.2308127/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=IzP3WyNqog8:3nLaZcq2eBI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=IzP3WyNqog8:3nLaZcq2eBI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/IzP3WyNqog8\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"08412c2bb8795facd501dda70bbd6c9ebe5cb4fc39de20289461c34e1611c653","category":"Apple"}