{"title":"Driven Technologies unveils Orbit Drive chainless electric bike motor system","link":"https://www.bikeradar.com/news/driven-technologies-orbit-drive/","date":1687449263000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Driven-Orbit-Drive-17-of-6-1cf5fb4.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Driven-Orbit-Drive-17-of-6-1cf5fb4.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Driven-Orbit-Drive-17-of-6-1cf5fb4.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Driven-Orbit-Drive-17-of-6-1cf5fb4.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Driven-Orbit-Drive-17-of-6-1cf5fb4.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Driven-Orbit-Drive-17-of-6-1cf5fb4.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Driven-Orbit-Drive-17-of-6-1cf5fb4.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Driven-Orbit-Drive-17-of-6-1cf5fb4.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Driven-Orbit-Drive-17-of-6-1cf5fb4.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Driven Orbit Drive (17 of 6)\" title=\"Driven Orbit Drive (17 of 6)\" />                                            <p>Driven Technologies has unveiled the Orbit Drive, a new all-in-one drive system for electric bikes.</p>\n<p>If you feel you’ve seen something similar before, you’re correct because the Orbit Drive is a development from CeramicSpeed’s chainless Driven drivetrain, first unveiled in 2018. Driven, as a company, is an offshoot of CeramicSpeed and was formed in 2021.</p>\n<p>On the original version, the chain and derailleurs were replaced with a drive shaft that had ceramic bearings on either end, which engaged the teeth of the chainring and cassette.</p>\n<p>At the time, CeramicSpeed claimed the system created 49 per cent less friction than the pinnacle <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-r9100-review/\">Shimano Dura-Ace R9100</a> drivetrain, at 250W.</p>\n<p>As for the new Orbit Drive, a 3D-printed prototype of the new system was on show at <a href=\"https://www.bikeradar.com/events/eurobike-show/\">Eurobike</a>, where we got a closer look, so let’s dive in.</p>\n<h2>What is Orbit Drive?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Driven Orbit Drive\" title=\"Driven Orbit Drive (15 of 6)\" /></div><div><figcaption><span><i></i> Driven Technologies says the design was inspired by the automotive industry.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>The Orbit Drive is a bevel-gearbox <a href=\"https://www.bikeradar.com/advice/buyers-guides/electric-bike-motors/\">electric bike motor</a> system with no exposed gears or derailleurs. A bevel system sees toothed gears intersected by two shafts to generate energy.</p>\n<p>Driven says it is trying to create a system that combines almost no maintenance, a more intuitive riding experience, high efficiency and simple installation for manufacturers of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">electric bikes</a>.</p>\n<p>The system comprises a variable-speed ‘bevel differential’ configuration of planetary gears, which Driven says allows for a seamless mesh of two inputs (from the rider and motor) to deliver power to the rear wheel.</p>\n<p>The system is claimed to weigh 4.6kg and it can be configured to produce up to 90Nm of torque.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Driven Orbit Drive (16 of 6)\" title=\"Driven Orbit Drive (16 of 6)\" /></div><div><figcaption><span><i></i> This 3D prototype is still a way from production.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>The brand says it’s a bolt-on solution for electric bike manufacturers and it can be retrofitted into existing frames. Driven says the system will work neatly with common Q-factors and existing chainring bolt patterns, but didn’t provide any further details.</p>\n<p>The design was inspired by automobile manufacturers Toyota, Ford and Stellantis, according to Driven.</p>\n<p>Driven claims the Orbit Drive translates into a smoother riding experience because you can simply set the pace in automatic mode and the stepless gearing adds speed, with the assist motor delivering power when needed.</p>\n<p>There’s also a manual mode, so you can shift through the gears as on a non-assisted bike.</p>\n<p>Driven says you can change your cadence or torque while riding, with the motor responding in turn.</p>\n<h2>Little to no maintenance</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Driven Orbit Drive (14 of 6)\" title=\"Driven Orbit Drive (14 of 6)\" /></div><div><figcaption><span><i></i> The system requires an oil change every 10,000 miles.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>Driven claims the system not only “brings the highest level of efficiency”, but there is also little to no maintenance because it only requires an oil change every 10,000 miles.</p>\n<p>Speaking to BikeRadar, Ryan Norris, director of engineering, explained a shaft drive is an improvement over a chain or belt because it’s one-piece, bolted on and can more simply be installed onto the bike, without having to worry about tensioning.</p>\n<p>Norris also said you don’t need to worry about contamination because the system is completely sealed.</p>\n<h2>Shaft, chain or belt – the choice is yours</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"No chain or belt to be seen with this Direct Drive version.\" title=\"Driven Orbit Drive (13 of 6)\" /></div><div><figcaption><span><i></i> There’s no chain or belt to be seen with this Direct Drive version.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>Driven says it hopes to offer three variations of the Orbit Drive.</p>\n<p>The Direct Drive variation uses a shaft drive to deliver power from the Orbit drive to the rear wheel. A shaft drive essentially replaces the chain and belt by using a fixed shaft to drive the rear wheel.</p>\n<p>The brand also intends to offer a Chain Drive and a Belt Drive, which will use partially enclosed chains and belts respectively.</p>\n<h2>Why has Driven gone electric?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"There is not yet a shifting system developed, but CeramicSpeed says an electronic motor inside the drive shaft could execute the shifts\" title=\"ceramicspeed_driven_05-1531048060041-5y1nc6vcah8t-160c6c2\" /></div><div><figcaption><span><i></i> CeramicSpeed’s original Drive concept was designed for triathlon bikes.</span></figcaption><span> <i>CeramicSpeed</i></span></div>\n<p>Norris explained the brand took a long, hard look at where the market was, and said the original CeramicSpeed Driven concept was designed for triathlon bikes.</p>\n<p>However, Norris said the brand realised this would be a niche audience and decided to develop the system for electric bikes, because the brand believes they represent the future.</p>\n<p>Norris said the brand is yet to decide whether it will manufacture all of the components in-house when the system is production-ready or whether it will license the technology to other manufacturers.</p>\n<p>The maintenance-free nature of the system will likely appeal to riders and brands alike, but only time will tell whether this design makes it into production and gains traction on electric bikes.</p>","author":"Oscar Huckle","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"08441b0874424e34a7a4f6ca8795ed0d304bd23ca25de67c77279e2719bb2a1b","category":"Cycling"}