{"title":"A Real-World Analysis of Total Neoadjuvant and Other Therapies for Locally-Advanced Rectal Cancer","link":"https://www.preprints.org/manuscript/202406.1214/v1","date":1718702586000,"content":"In recent years, the treatment of locally-advanced rectal cancer (LARC) has been spotlighted in a number of landmark, practice-changing trials, heralding in the age of so-termed “total neoadjuvant therapy” (TNT). However, the lack of a common control arm, standard inclusion criteria, or, indeed, definition of TNT necessitates further study in this field, particularly using real-world data. \nWe conducted a retrospective analysis of all patients treated for LARC at a single Canadian academic cancer centre between July 1st 2019 and July 14th 2022. This includes the June 2020 incorporation of TNT. 290 patients were included in the final analysis, and 124 variables were collected on each patient, including demographics, treatment type, adverse events, response to treatment, surgery versus watchful waiting and survival. \nOur findings demonstrate that both TNT and non-TNT regimens are highly toxic, with regards to both overall toxicity and grade 2+ adverse effects. 62 (96.9%) of patients on TNT experienced toxicities, compared to 186 (82.3%) of the non-TNT patients. Grade 2+ toxicities were 46 (71.9%) and 143 (63.3%), respectively. TNT, however, was associated with improved rates of complete response, compared to non-TNT treatment regimens (44% vs 24%).\nThese findings suggest that TNT harbours both benefit and risk in a real-world population, and both of these aspects should be considered when deciding on a treatment approach for an individual patient. More work in the area is needed to determine longer term survival, as well as impact of surgery versus organ preservation approach on patient outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"084b5623ca27e3bbca80fdb9f65130f36cde5e2bedd002d82124b6bf07c26901","category":"Interdisciplinary"}