{"title":"PSLBI-3 The use of meloxicam oral suspension (15 mg/mL) to control post-partum pain and inflammation in dairy cattle following dystocia","link":"https://academic.oup.com/jas/article/102/Supplement_3/643/7757892?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Dystocia is painful, given the increased time, tissue damage, and stress associated with handling and forced extraction. Around parturition, dry matter intake is reduced, and cows experience increased inflammatory mediators. This could lead to subsequent health issues, including an increased risk of metabolic disease, reduced reproductive performance, and decreased milk production. Controlling pain and disease are important for animal welfare so it is critical to alleviate dystocia pain and inflammation. The administration of a non-steroidal anti-inflammatory drug (NSAID) could aid in alleviating the negative sequelae of dystotic parturition. Meloxicam (MOS) is an NSAID with greater oral bioavailability and inhibits cyclooxygenase, the enzyme responsible for converting arachidonic acid to prostaglandin. The reduction in prostaglandin, specifically prostaglandin F2α, resulting from meloxicam administration following a dystotic calving could minimize pain and control systemic inflammation. Objectives were: 1) to demonstrate post-partum administration of MOS in dystotic lactating dairy cows reduces pain (for up to 3 d) as measured by a significant reduction in plasma substance P expression levels (<span>P</span> &lt; 0.05); 2) to demonstrate post-partum administration of MOS in dystotic lactating dairy cattle reduces inflammation (for up to 14 d) as measured by a significant reduction in plasma haptoglobin expression levels (<span>P</span> &lt; 0.05); and 3) to evaluate the safety of administering MOS in post-partum dairy cattle, especially as it pertains to reproductive health. The study included dairy farms in three geographical areas in Canada, with nine farms and 145 cows. Primiparous and multiparous cows identified as having dystotic calvings were enrolled based on observation by the producer or study technician. Cows were randomly assigned to a treatment group of MOS or the placebo within each farm site. Animals received test or control treatment 0 to 12 h post-dystotic calving. The calving and treatment times were recorded. No analgesics was given before calving. Data collected included: 1) pain-related behaviors; 2) physiological markers of pain; 3) physiological markers of inflammation measured as acute phase proteins; 4) vulvovaginal inflammation; 5) physical evaluation including daily observations, body weight, rumination, blood and urinalysis, reproductive evaluation, time to first insemination and daily milk weights. The data are being evaluated and initial results show favorable responses to the treatment.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"08539d4ccfa99593f4efaa5dbf8addc949082c36f71a769dfa57f898070ff651","category":"Environment"}