{"title":"Desire Discrimination Determination | Dr Marlon Lee Moncrieffe’s new book reframes cycling through the history and perspectives of Black cyclists","link":"https://www.bikeradar.com/features/long-reads/desire-discrimination-determination-marlon-lee-moncrieffe-book/","date":1629466242000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/08/Desire-Discrimination-Determination-1-19c2b0f.jpg?quality=45&amp;resize=620,413\" />                                            <p>For Dr Marlon Lee Moncrieffe, how the world of cycling responded to the wave of Black Lives Matter protests in 2020 was a peculiar thing to witness.</p>\n<p>Cycling had started to talk about racism in the sport and its <a href=\"https://www.bikeradar.com/features/long-reads/diversity-in-cycling/\">lack of diversity</a>. But, as a Black man and former racing cyclist, Moncrieffe was reminded of being in school where he would be asked to leave the room for speaking about issues from a Black perspective and would return to find his white classmates being praised for giving a second-hand interpretation of what he had been saying.</p>\n<p>Cycling may have started looking at itself in a way it hadn’t before, but the voices and experiences of Black athletes were conspicuous by their absence.</p>\n<p>Moncrieffe’s new book <em>Desire Discrimination Determination – Black Champions in Cycling</em> looks to change that by bringing together the stories of Black athletes in the history of competitive cycling and highlighting the experiences of Black cyclists.</p>\n<p>Speaking to Moncrieffe he says: “there are very few books about grassroots and competitive cycling written about Black people, let alone written by a Black person.” And that <em>Desire Discrimination Determination</em> “offers a new paradigm for knowing cycling; a new way of seeing the sport of cycling through the histories and lenses of Black people.”</p>\n<p>Co-published by <a href=\"https://www.bikeradar.com/brand/rapha/\">Rapha</a> and Bluetrain Publishing, the book weaves together Moncrieffe’s own experiences as a bike racer, oral testimony and reflections from other cyclists, and research to tackle questions of access, diversity, inclusion and anti-racism in the sport.</p>\n<h2>The book’s beginnings</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Moncrieffe wanted to know why Marshall ‘Major’ Taylor was one of the few celebrated Black cyclists.</span></figcaption><span> <i>Rapha</i></span></div>\n<p>The book started life as a research project Moncrieffe, a senior lecturer at the University of Brighton, began in 2009.</p>\n<p>Moncrieffe had raced on the road and track in the UK for much of the early 2000s and late 1990s. He came to ask why despite many successful Black cyclists, Marshall ‘Major’ Taylor – the first African American to win a cycling world title and the second African American to win a world championship in any sport in 1899 – appeared to be the only Black cyclist representing success for Black people in the sport.</p>\n<p>This was an issue compounded by nationality: “If you are African American, at least there is someone. If you are Black British, there is no one being showcased like Taylor.” It was also compounded by gender. Moncrieffe knew of Black male cyclists, but not Black female professional cyclists.</p>\n<p>So he wanted to tell the stories not just of more Black cyclists, but specifically of Black cyclists from the UK across genders.</p>\n<p>Moncrieffe says seeing how white cyclists discussed Black cyclists also spurred him to start researching Black athletes in the sport.</p>\n<p>“I came across an internet forum discussion where there was so much ignorance being spewed about Black people in cycling, their abilities and potential. I needed to set things straight.</p>\n<p>“So, all of this got me thinking about which Black riders I had known of; seen and raced with on the road and track in the UK elite level. The likes of Maurice Burton, Russell Williams, David Clarke, Mark McKay and Christian Lyte came to mind.”</p>\n<p>Moncrieffe began to gather oral testimony, photographs and memorabilia from these cyclists. He also spoke to other cyclists who he was introduced to during his research, including Tre Whyte, whose brother Kye Whyte recently won silver in BMX at the <a href=\"https://www.bikeradar.com/events/tokyo-2020\">Tokyo Olympics</a>.</p>\n<p>This research came to form an exhibition in 2018 to 2019 called <em><a href=\"https://research.brighton.ac.uk/en/publications/made-in-britain-uncovering-the-life-histories-of-black-british-ch-2\" target=\"_blank\">Made in Britain</a> </em>which looked at the lives, stories and successes of Black British champions in the sport, while asking what prevented them from reaching the iconic status of white British cyclists such as Mark Cavendish and Bradley Wiggins.</p>\n<p>But Moncrieffe was interested in expanding the scope of the project beyond Black British cyclists and an encounter on social media led to just this, as well as working with Rapha.</p>\n<p>“Guy Andrews of Bluetrain Publishing and I started to follow each other on Twitter. I had seen Bluetrain’s unique approach to book production, but I did not know of their partnership with Rapha at the time.</p>\n<p>“Guy and I discussed the possibility of broadening my work to an international account of the Black experience in the sport. A huge task, but doable. So, I took that research and writing challenge on.”</p>\n<h2>Overlooked stories</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The book is full of illustrations, including this one of Charlotte Cole-Hossain racing at Herne Hill Velodrome, south London.</span></figcaption><span> <i>Rapha</i></span></div>\n<p>As well as an opportunity to set things straight, Moncrieffe used his time researching and writing <em>Desire Discrimination Determination</em> as a way to reflect on his own time as a bike racer.</p>\n<p>“I wanted to get a deeper meaning about my own experiences,” he says, “the truth about my own thoughts on the sport – whether illusion or reality.</p>\n<p>“The best way for me to do this was to place myself amongst Black elite cyclists who had lived before me [and] who were current to get to know them so that I could get to know about myself as a cyclist.”</p>\n<p>The book starts by telling the overlooked stories of some of the earliest Black cyclists and the discrimination they faced as well as the determination they had, from Kittie Knox, defying Jim Crow law in the late 1800s to race her bike, to Abdel-Kader Zaaf, who first raced the <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> in 1948 and was a household name in France at the time.</p>\n<p>From discussing the history of bike racing in apartheid South Africa where Black-only races proved so popular white riders would defy the law to compete to the acceptance of Black cyclists from the Windrush generation in the UK, Moncrieffe shows how Black cyclists have always been involved in the sport and how there was at times possibly greater acceptance of Black cyclists than there is today.</p>\n<p>The following chapters turn to Moncrieffe’s contemporaries as well as the current generation of Black cyclists at the top of the sport including the likes of Justin Williams and Corey Williams of L39ION of LA, Kévin Reza and Nicholas Dlamini, as well as British riders Charlotte Cole-Hossain and Tre Whyte.</p>\n<p>The voices of these cyclists come together to explore different aspects of their sport, from how they got into the sport, how they rose to the top, and the discrimination they faced at all levels of the sport.</p>\n<h2>“Nothing really surprised me”</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Rahsaan Bahati talks about how adversity was the fuel behind his winning streak as a junior.</span></figcaption><span> <i>Rapha</i></span></div>\n<p>Many of the cyclist’s in <em>Desire Discrimination Determination</em> speak of having the same experiences of racism in the sport. Slurs and abuse while out cycling or at races litter the accounts and stories of disqualifications based on phoney reasoning or no reasoning at all are common too.</p>\n<p>Russell Williams, an 18 times national champion, speaks in-depth of his experiences of how selectors at British Cycling would pick riders slower than him preventing him from reaching major competitions like the Olympics – decisions he has alleged were influenced by the colour of his skin.</p>\n<p>Maurice Burton also talks of his experiences of racism and lack of support that persisted regardless of his success in winning National championships and representing Britain at the 1974 Commonwealth Games. When he realised he wasn’t going to be selected for the 1976 Olympics, he moved to Belgium, frustrated at the racism in British cycling.</p>\n<blockquote><div> <a href=\"https://www.instagram.com/p/CSIJRGbsjuw/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CSIJRGbsjuw/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Black Champions in Cycling (@blackchampions_)</a></p></div></blockquote><p>These stories aren’t just in the past, either, with many of the rider’s who are racing today sharing their experiences of racism and abuse.</p>\n<p>Nicholas Dlamini, for instance, recounts witnessing a white cyclist push Natnael Berhane off the road, and Kévin Reza expresses his shock at being the target of racist abuse from Gianni Moscon during the 2017 Tour of Romandie.</p>\n<p>Tre Whyte talks about how his other brother Daniel had to leave the British Cycling talent team because he was treated differently to others, and how when he joined the team he had people accusing him of having stolen a car that he, in fact, owned.</p>\n<p>“Nothing really surprised me about the racism that I would discover from the cyclist’s experiences,” Moncrieffe says.</p>\n<p>But he does say that by weaving together the personal stories and reflections from different cyclists, Moncrieffe found there was a congruency of lived experiences among the cyclists he spoke to, which in turn helped many of the people he spoke to understand their own experiences.</p>\n<p>“This is how I have been able to make meaning,” Moncrieffe says. “For those cyclists who took part, I know it was an education and process of making new discoveries on their experiences for them as well.”</p>\n<p>Some of the incidents of racism in the book he still found shocking, but he is also keen to point out how many remarkable stories there are in the book too.</p>\n<p>Russell Williams describes falling in love with cycling as a kid and how visiting Herne Hill Velodrome, south London, was like “walking into his heaven”. Moncrieffe reflects on this as “the beauty of childhood innocence”, which he also sees in Luli Adeyemo’s story: “Her rise from not being able to ride a BMX bike at the beginning of the year,” Moncrieffe says, “to becoming World Champion at the end of that same year – phenomenal!”</p>\n<p>There are many incredible stories in <em>Desire Discrimination Determination</em>, but the book paints a picture of a sport that doesn’t look particularly close to leaving discrimination behind.</p>\n<h2>The future</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Williams brothers have become role models in cycling with their team L39IOn of Los Angeles.</span></figcaption><span> <i>Rapha</i></span></div>\n<p><em>Desire Discrimination Determination</em> closes by considering what the future of cycling will look like, how cycling can possibly take steps to end racism in the sport, as well as improve representation at elite levels.</p>\n<p>The response of the cycling world to the Black Lives Matter protests following the murder of George Floyd puts quite how far there is to go into perspective.</p>\n<p>In the book, Moncrieffe points out how in Britain the Football Association, the England and Wales Cricket Board and the Rugby Football Union all publicised their solidarity with the Black Lives Matter protests that followed the murder of George Floyd, but we heard nothing from the national body for cycling.</p>\n<p>This was particularly disappointing for Moncrieffe who had worked with the organisation.</p>\n<p>“I produced educational materials for their staff and for dissemination amongst their membership,” he writes. “I provided them with Black British histories in cycling for promotion of anti-racist education.”</p>\n<p>Some organisations and individuals did come forward to speak out about racism in the sport.</p>\n<p>Brian Cookson, president of British Cycling 1997 to 2013, admitted to not having addressed the whiteness of the sport. USA Cycling released a statement saying how it understands “we have been part of the problem in the inequality and representation of our sport” stating that it would use its positions to fight for equality.</p>\n<p>But Moncrieffe also documents how many at a grassroots level felt that the statements released by organisations like USA Cycling didn’t go far enough, and needed to be followed up with concrete action and change.</p>\n<p>In the professional ranks, little acknowledgement was made of the protests apart from at the Tour de France where Kévin Reza, the only Black rider at the race, rode at the front of the peloton on the final day and some riders wore face masks with ‘No to Racism’ written on them at the start of the Stage.</p>\n<p>Moncrieffe highlights that organisations like the <a href=\"https://www.instagram.com/blackcyclistsnetwork/\" target=\"_blank\">Black Cyclist Network</a> and the <a href=\"https://www.instagram.com/blackridersassociation/\" target=\"_blank\">Black Riders Association</a> in the UK, alongside many others in the USA, are changing cycling from a grassroots level.</p>\n<p>He also points out the positive impact the likes of the Williams brothers are having, acting as role models for young Black people and pushing for change from the top of podiums. But he is less hopeful about representation at the top of the sport changing any time soon.</p>\n<p>“It will take acceptance, money, and long-term investment,” he says, elaborating that the research in <em>Desire Discrimination Determination</em> shows how “recent and current opportunities given to Black African riders have been diminishing and have been to some extent superficial.”</p>\n<p>“Black-British or African-American representation on a regular basis in the ‘Classics’ and Grand Tours,” he feels, “is unlikely very soon.”</p>\n<p>To change this, cycling needs to change from the ground up by taking steps such as diversifying leadership, investing in anti-racist education, setting up projects to get more people from diverse backgrounds into the sport, as well as providing the support and mechanisms to protect them.</p>\n<p>This would hopefully help to remove the barriers the likes of Maurice Burton and Russell Williams faced in the past and shift the presence of Black people in the sport away from novelty and towards normality.</p>\n<p>Moncrieffe ends the book by saying how the rise of cycling in Africa could be one place where the seeds of change could be found and a genuine revolution could take place.</p>\n<p>The Tour of Rwanda already attracts WorldTour teams and the UCI World Road Race Championships are set to take place on the continent in 2025. Moncrieffe also says long-term high-level investment could lead to the same world-leading excellence in cycling that Kenya and Ethiopia have achieved in track and field athletics.</p>\n<p><em>Desire Discrimination Determination – Black Champions in Cycling</em> feels like it sows the seeds of change itself. It draws together many voices putting Black cyclists in control of their own narrative, creating a record that is greatly needed. It reveals how cycling is a sport that has always struggled with racism and representation, overlooked its own champions, and still has much work to do.</p>\n<p>There is much to learn and unravel from Moncrieffe’s work, as it documents some of the most appalling moments in the history of the sport and challenges the perspective many have of cycling. But the book is also a celebration of some of the greatest champions the sport has ever seen and shines a light on some of the sport’s most marvellous moments too.</p>\n<p>As Moncrieffe says: “Enjoy it.”</p>\n<p> </p>\n<p><em>You can purchase</em> Desire Discrimination Determination – Black Champions in Cycling v<em>ia the <a href=\"https://www.awin1.com/cread.php?id=489797&amp;clickref=bikeradar-0&amp;awinmid=18515&amp;p=https%3A%2F%2Fwww.rapha.cc%2Fgb%2Fen%2Fshop%2Fdesire%2C-discrimination%2C-determination-black-champions-in-cycling%2Fproduct%2FALI01XX\" target=\"_blank\">Rapha website</a>. </em></p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"0856b97e75d50de267fd8e9800d8f07b4f91a865679198253fca9466f966ec11","category":"Cycling"}