{"title":"Kurt Refsnider Answers Your Questions About Riding Across Alaska on the Iditarod Trail – Kurt Refsnider","link":"https://theradavist.com/what-to-know-about-touring-the-iditarod-trail-kurt-refsnider/","date":1704456052000,"content":"<p><em>With its high consequences and steep gear-barrier to entry, winter bikepacking and backcountry travel can be an intimidating pursuit. After touring the complete, nearly 1,000-mile Iditarod Trail across Alaska in early 2023, <a href=\"https://theradavist.com/tag/kurt-refsnider/\" target=\"_blank\">Kurt Refsnider</a> answers the questions he got from followers along the trail. Read on for a brief history of this legendary trail, Kurt’s complete gear list, and the challenges you can expect to encounter along the way.</em></p>\n<p><span></span></p>\n<p>Late this past winter, I had the opportunity to tour the full length of the famed Iditarod Trail across Alaska, a 950-mile-long ride that had me feeling seriously intimidated beforehand. This trail was originally commissioned by the federal Alaska Roads Commission in the early 1900s to connect Seward to the gold fields in Iditarod and Nome – it was a winter freight and mail trail traveled using dog teams.</p>\n<p>In the early 1970s, the annual <a href=\"https://iditarod.com/#\" target=\"_blank\">Iditarod Trail Sled Dog Race</a> began using the trail as freight traffic ended; in the 1980s, the 2,500-mile-long <a href=\"https://www.irondog.org/\" target=\"_blank\">Iron Dog snowmachine race</a> began; and in the late 1990s, human-powered racing appeared, first as the Iditasport Extreme and later the <a href=\"https://itialaska.com/\" target=\"_blank\">Iditarod Trail Invitational</a> (ITI; with 350- and 950-mile distances). There are quite a few ways to seek big, remote winter adventures on this National Historic Trail.</p>\n<p>I had raced the 350-mile-long ITI a few years ago, and a subsequent attempt to ride to Nome with Anchorage resident Nicholas Carman got cut short by the arrival of Covid-19 to Alaska and the closing of Native Villages to visitors.</p>\n<p><img loading=\"lazy\" width=\"1970\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-15.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-15.jpg?w=1970&amp;quality=75 1970w, https://media.theradavist.com/uploads/2023/12/Iditarod-15.jpg?resize=1024,693&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-15.jpg?resize=768,520&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-15.jpg?resize=1800,1218&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-15.jpg?resize=1335,903&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-15.jpg?resize=700,474&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-15.jpg?resize=1536,1039&amp;quality=75 1536w\" /></p>\n<p>I had some desire to return to the trail to pedal to Nome, but I didn’t have plans to do so anytime soon. Then my Scottish friend <a href=\"https://www.instagram.com/topofests/\">Huw Oliver</a> reached out late last year—he was racing the ITI350 and wondered if I wanted to continue to Nome with him after the race. I jumped at the opportunity since I knew he’d be a fantastic companion.</p>\n<p>I was out on the trail for just over three weeks: the first week was solo en route to McGrath, and then I was with Huw for two weeks for the 600 miles from McGrath to Nome. Nicholas ended up joining us upon leaving McGrath as we played hopscotch with some of the handful of ITI racers also en route to Nome—they were always fun to encounter along the trail. Before long, sled dog teams in the Iditarod started passing us—that was a real highlight, spectating the sled dog race as it gradually passed us by.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-1.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-1.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-1.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-1.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-1.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-1.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-1.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-1.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>The story of the trip is one for another day, though. For now, I’m excited to answer a suite of questions that folks reached out to me with following the adventure. These questions cover a range of topics, and bear in mind that my perspective is that of a fellow from Arizona who doesn’t spend a lot of time in winter! The questions are generally organized about the trail and experience first, followed by skills and gear. At the very end, I also include a general packing list for all the clothing and equipment that was stuffed into my bags.</p>\n<p></p>\n<h3>Was it scary riding by yourself?</h3>\n<p>I got dropped off by my friend Eric Parsons (adventurer extraordinaire and founder of Revelate Designs), and after a day fraught with setback after setback, I finally got riding just before sunset. It was already cold, at around 80 pounds my bike felt like an absolute tank, and as I rolled away and turned south onto the Susitna River, I felt like Eric was probably still standing back there, shaking his head and wondering what this guy from Arizona was doing headed out onto the trail alone.</p>\n<p>I wasn’t sure it was the best idea myself, but I felt (mostly) confident in my relatively limited winter bikepacking experience, gear, and planning. By the third day, I felt like I’d settled into the rhythm of winter travel and was re-learning the best ways to keep my hands and feet warm at camp, in my boots, etc. By the time I reached McGrath, I was quite proud of myself for making it there despite some challenging conditions and without making any major mistakes, camping out every night, and even managing to have a pretty great time along the way.</p>\n<p><img loading=\"lazy\" width=\"1777\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-4.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-4.jpg?w=1777&amp;quality=75 1777w, https://media.theradavist.com/uploads/2023/12/Iditarod-4.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-4.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-4.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-4.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-4.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<h3>What was your favorite part?</h3>\n<p>The sunsets. I found so much enjoyment in riding through the long, gradual sunsets, or—in some cases—watching them from the door of my tent as I cooked dinner. We had some absolutely stunning ones along the way. There was also an unforgettable night of aurora. And the remoteness of the Southern Route section of the trail was a different type of highlight: beautiful mountains and frozen meandering rivers in what was certainly one of the most remote places I’ve ever ridden a bike. I also really enjoyed conversations with folks in the Native villages along the trail. And spending one day riding and pushing my bike with a gusty 50 mph tailwind at times—talk about exhilarating (and cold)!</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-2.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-2.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-2.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-2.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-2.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-2.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-2.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-2.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>What were trail conditions like (how much rideable packed trail, ice, hike-a-bike, etc.)?</h3>\n<p>Each day and section of the trail can be completely different. Morning to afternoon to evening trail conditions in the exact same spot can vary dramatically. Just the passing of a single snowmobile can turn an unrideable trail into a rideable one or vice versa. I had decent riding conditions for the first four days, then two days of all-day on-and-off-the-bike on a trail that was drifted-in during a passing storm, and then the final day to McGrath was essentially 25 miles of hiking followed by a gloriously rideable final 15 miles into town.</p>\n<p>Beyond McGrath, riding was decent for a couple of days, absolutely abysmal one day in the rain (yes, horrible, horrible winter rain; we covered 12 miles in six hours, holed up in a shelter cabin, and called it a day). Post-rain, the trail turned concrete-hard for three days; we got incredibly lucky with our timing on the Yukon River relative to windy days and had good conditions with minimal drifting; and then we were back to great trail conditions nearly all the way to Nome. But “great” and “good” are so relative—nothing is groomed on the Iditarod!</p>\n<h3>Were there ever times you thought, “What am I doing out here?” If so, how did you keep yourself in a positive mindset?</h3>\n<p>Honestly, not really. On the toughest days when the fun factor was low (i.e., hiking all day, in the middle of 150 miles of riding on the flat, wide, windy Yukon River, in the rain, etc.), I just reminded myself of the fact that I chose to be out there. Winter adventures can be wildly unpredictable, and tough conditions can be so much tougher (and be very consequential). By choosing to be out there, one needs to acknowledge that reality and be prepared to work through whatever that reality becomes. I’m not out there to be frustrated at slow miles or get annoyed by hiking all day—that’s just going to be part of the experience.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-16.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-16.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-16.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-16.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-16.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-16.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-16.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-16.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>What was the most mentally challenging part of the ride?</h3>\n<p>The day that Nicholas, Huw, and I crossed Norton Sound, the broadest expanse of sea ice, when we pushed into a 25+ mph headwind for the entire 30 miles in temperatures that were hovering around 0 F. Out on the sea ice, there’s nowhere to hide from the wind, all skin needed to be covered to avoid frostbite, and only holding a 4 or 5 mph pace gets quite tedious and moderately concerning in such an exposed icescape. But like any other challenging riding, a lot of patience and prioritizing self-care (i.e., eating, drinking, keeping skin covered, and trying to avoid sweating) was what it took to make it across.</p>\n<h3>What was the most physically challenging part of the tour?</h3>\n<p>For me, the final couple days brought the biggest physical challenge. After three weeks on heavy bikes and on snow, my body was simply fatigued. I had taken a few days off in McGrath, but after that, we rode every day for two weeks straight. And those final two days turned into a race to reach Nome ahead of a major storm, so we rode until 2 am the second-to-last day, leaving my body pretty dang empty for that final day’s 70 miles. And by then, it didn’t matter how much I ate—calories were barely enough to keep the energy up.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-25.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-25.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-25.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-25.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-25.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-25.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-25.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-25.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>How tiring is riding a loaded bike on an ungroomed trail like that?</h3>\n<p>It’s dang tiring! In decent conditions, a bike that heavy is still a lot of work to move. In soft and unrideable conditions, it’s a ton of work to push the bike, especially if you’re breaking trail. But you can’t let yourself work too hard or you’ll start sweating and get your layers wet, so the reality is that you’re never pushing hard, and that makes everything a little more sustainable. Long nights of sleep also help quite a bit inside the cozy cocoon of a warm winter bag and tent.</p>\n<h3>How much food did you carry? How did you resupply?</h3>\n<p>The most I carried was on the first section of the trail; I packed enough to get me all the way to McGrath, some 300 miles from where I started at Deshka Landing. I anticipated six days of riding and carried an extra day’s worth of calories. With the goal of eating 5,500+ calories per day, I started out with 38,000 calories (19 pounds of food!). It ended up taking me six-and-a-half days, and I reached McGrath with just 1,000 calories to spare.</p>\n<p>Farther down the trail, there were some sections where carrying five days of food was required or most convenient, but we could have certainly bought more of our food in stores in the villages along the trail or shipped drop boxes to post offices more frequently. We each mailed drop boxes with food to four post offices along the trail and then grabbed some more food in stores as needed. It would actually be entirely possible to simply buy all one’s food along the way in stores and not ship any drop boxes.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-5.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-5.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-5.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-5.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-5.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-5.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-5.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-5.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>How much fuel did you carry?</h3>\n<p>I carried two liters of white gas for my MSR XKG stove for the first week, another two for the next section, and then I just needed one additional liter farther down the trail. White gas is available in some of the stores, and gasoline can also be purchased in those villages.</p>\n<h3>How do you keep your water from freezing while riding?</h3>\n<p>I carried a couple of well-insulated thermoses for water and hot drinks. I think these were ~1.5 L in total volume, and usually, I’d have to melt some snow in the afternoon for a bit more water. Using a low-profile hydration pack beneath your insulating layers and keeping the hose and mouthpiece inside your layers can work quite nicely for day rides, but keeping the bladder and hose from freezing at camp can be a challenge.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-31.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-31.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-31.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-31.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-31.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-31.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-31.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-31.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>How did touring compare to racing?</h3>\n<p>I enjoyed both styles of travel! Racing the ITI350 in 2020 was an incredible experience (winning was icing on the cake), and had I not done that with the support structure and aid stations provided by the race organizers, I likely wouldn’t have gotten out on the trail at all! In the race, the ability to send drop bags with food to a couple of aid stations is a huge help, heated tents and cabins for sleeping are luxurious, and being out there with the other riders (and runners and skiers!) can be quite fun.</p>\n<p>But I also really enjoyed the solitude of solo and small group travel on the trail, and of not feeling rushed (unless it was by weather). Having the time to relax in villages along the way and enjoy long conversations with local residents provided insightful glimpses into their culture, something that’s entirely missed when in the racing mode of travel.</p>\n<h3>How is breathing in that weather?</h3>\n<p>My lungs seem to do fine down to -30 F, and then it’s important for me to breathe through a couple of layers of fabric. Some folks prefer some sort of mask to breathe warmer air, but I haven’t personally found that necessary.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-7.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-7.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-7.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-7.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-7.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-7.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-7.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-7.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>What are all the preparations and daily practices you took to mitigate moisture accumulation in your sleeping systems?</h3>\n<p>This is a great question, and I don’t claim to be any expert on this. But I slept outside all six nights en route to McGrath with my -45 F down sleeping bag. For three of those nights, I set up my little tent, and for three I just slept on my two foam sleeping pads (no tent or bivy). I went to sleep each night with generally dry clothing and tried as best as I could to not breathe into my sleeping bag. By the third night, there was a little crunchy film of ice building up on the inside of the exterior fabric of the sleeping bag, and by the sixth night, the bag had lost a noticeable amount of loft and gained quite a bit of weight in ice!</p>\n<p>I didn’t use any sort of vapor barrier liner inside the bag—I’ve been told those can get rather uncomfortable and smelly. After McGrath, I had the opportunity to dry my bag out every few nights (either in a cabin with a wood stove or on the few nights we stayed in a school or community center). I think if I was to do a trip that required five or more nights out, I’d experiment with a thin sleeping bag cover with synthetic insulation with the goal of trapping the moisture in that rather than in my down bag.</p>\n<h3>What distance per day would you suggest for someone planning it?</h3>\n<p>When Huw and I worked out our potential timeline for the tour, we planned on 50 miles per day on average, a pretty ambitious distance. But with so much reliance on the trail breakers associated with the dogsled race to open up the route past McGrath, it’s ideal to leave McGrath shortly after them (and they try to stay a day or two ahead of the lead dog teams). Then trail traffic associated with the sled dog race keeps the trail open as the race moves through.</p>\n<p>But once the final dog teams pass, the trail can get drifted shut, and with little to no traffic that could be it for the season! So one’s pace definitely needs to be a motivated touring pace if doing the whole trail. If doing the southern 300 miles between Knik/Deshka Landing and McGrath, timing and pace are a little less critical. Planning around 35-40 miles per day probably would be a reasonable goal.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-24.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-24.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-24.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-24.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-24.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-24.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-24.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-24.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>What tips do you have for learning cold weather travel skills and testing gear if you don’t live in Alaska?</h3>\n<p>Given the potential consequences if anything doesn’t go or work as planned in winter environments, especially in remote ones like so much of the Iditarod, there’s simply no substitute for time in the cold. Living in Arizona, I made sure to spend a few weeks in Idaho in January before racing the Iditarod Trail Invitational a few years ago, gear testing, camping, experimenting with different clothing combinations, etc.</p>\n<p>I still didn’t get to experience anything colder than -15 F, but it was the best I was able to do. And spending a week on the Iditarod Trail that winter in some especially cold temperatures (-45 F!) gave me the confidence to head back into touring mode this year. I wouldn’t recommend that anyone without a fair bit of winter riding, winter camping, and winter backcountry experience strike out on the Iditarod Trail unless it’s on the southern 150 miles where there are numerous lodging options in case things go poorly.</p>\n<h3>Exactly how fat of a tire do you need? What about rims?</h3>\n<p>In my opinion, the wider the rims and the wider the tires, the better. On a fully loaded bike with winter gear and ample food and fuel, it’s a heavy load to float on snow! I ran 100 mm rims with studded Terrene Johnny 5 tires—a true 5” tire—and I really liked that combination. Huw was on 80 mm rims with some 45NRTH 5” tires (more like a 4.7” true width, I think), and that setup worked well for him most of the time, although it was a bit more of a challenge for him when conditions were especially soft. Studs were also hugely important to have as there can be a lot of glare ice on some sections of the trail.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-8.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-8.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-8.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-8.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-8.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-8.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-8.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-8.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>What lights did you use?</h3>\n<p>I rode a fair bit in the dark the first week on the trails – the days were still relatively short, and I was racing to get over the Alaska Range ahead of a major storm that was headlining the weather forecasts. But on snow, you don’t need nearly as much light as on dirt. I carried a Fenix HM65R-T headlamp and used that on the low setting, and then I had a smaller headlamp I carried as a backup but never even pulled it out of the depths of my frame bag.</p>\n<h3>What were your favorite foods that you carried?</h3>\n<p>Trail Butter nut butter packets, Bobo’s Bars, Gu Stroopwafels, Cheez-Its, hot chocolate, instant grits breakfasts (900 calories each), and big, savory dinners (1,000+ calories each) were my favorites! I couldn’t get enough of any of those.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-26.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-26.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-26.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-26.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-26.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-26.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-26.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-26.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>What was your favorite gear?</h3>\n<p>A little folding saw for cutting firewood, my Nose Hat for keeping my face warm, my Patagonia R2 TechFace Hoody that I wore nearly every minute on the trail, some synthetic insulated over shorts that I bought a the very last minute, my Revelate Designs Expedition pogies, and a Tamron 16-200mm camera lens that I carried along.</p>\n<h3>What hubs did you use? How was the engagement?</h3>\n<p>I used the same wheelset I’ve been on for snowy adventures for a few years now: Industry Nine Hydra hubs laced to some 100-mm-wide HED rims. The engagement on the hubs feels virtually instantaneous, something that makes a big difference when the riding gets challenging on soft snow and ratchet pedals are needed to quickly get a bit of power to the tires or to navigate deep ruts. The more technical the riding became, the more advantageous that quick engagement was for me.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-30.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-30.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/12/Iditarod-30.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-30.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-30.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-30.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-30.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-30.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Don’t you want to race to Nome?</h3>\n<p>Not particularly, no. I really enjoyed racing the ITI350 to McGrath and encourage folks to take part in the race if that kind of support structure feels appropriate or the competitive atmosphere is attractive, but racing the full 1,000 miles to Nome on a bike just doesn’t seem like the kind of experience I want to have on that trail.</p>\n<h3>What did you carry for clothing/layering options?</h3>\n<p>See my complete gear list below!</p>\n<p><img loading=\"lazy\" width=\"1965\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/12/Iditarod-33.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/12/Iditarod-33.jpg?w=1965&amp;quality=75 1965w, https://media.theradavist.com/uploads/2023/12/Iditarod-33.jpg?resize=1024,695&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/12/Iditarod-33.jpg?resize=768,521&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/12/Iditarod-33.jpg?resize=1800,1221&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/12/Iditarod-33.jpg?resize=1335,906&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/12/Iditarod-33.jpg?resize=700,475&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/12/Iditarod-33.jpg?resize=1536,1042&amp;quality=75 1536w\" /></p>\n<h3>Where can I learn more about riding the Iditarod Trail?</h3>\n<p>I’ve created <a href=\"https://backcountry-mtb.com/routes/iditarod/\" target=\"_blank\">a short planning guide and a GPS data resource</a> since nothing of the sort exists for the Iditarod. Hopefully, this helps some more folks get out on the trail, whether that’s on short lodge-to-lodge trips along the trail’s eastern end or adventures on longer stretches of the trail.</p>\n<p>The post <a href=\"https://theradavist.com/what-to-know-about-touring-the-iditarod-trail-kurt-refsnider/\">Kurt Refsnider Answers Your Questions About Riding Across Alaska on the Iditarod Trail</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"085bee1e8cda9ab7125a6dffb6f2783133e5b74d93527e38c174cab750c3c06c","category":"Cycling"}