{"title":"Paris-Roubaix 2021 Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-2021-preview","date":1615553738000,"content":"\n      <p><em><strong>\"The Hell of the North\"</strong></em></p>\n<p><span style=\"font-weight: 400;\">Very few bike races are nicknamed with such marked connotations. But Paris-Roubaix, set to take place this year on <strong>Sunday 11th April</strong>, really is a Sunday in Hell, for those riding at least. </span>For those lucky enough to be watching from the sofa, a ‘Sunday in Paradise’ would perhaps be more accurate.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related – The 2021 Men's Early Season: The Rouleur Racing Guide</a> <br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">Related – </a></strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\"><strong><span class=\"s1\">The Women's 2021 Early Season: The Rouleur Racing Guide</span></strong></a></em></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><span style=\"font-weight: 400;\"><span>Throughout the day, t</span>he riders must tackle some of the most difficult cobblestones around. The Trouee d’Arenberg sector has become infamous in cycling folklore and is the most difficult sector of the race. In 2019, there was over 50km of cobblestones — no surprise then that only 100 riders finished.</span></p>\n<p><span style=\"font-weight: 400;\">Paris-Roubaix is one of cycling’s five monuments and is one of the oldest races around — the first edition took place in 1896. </span>Roger De Vlaeminck and Tom Boonen hold the record for the most wins with four apiece.</p>\n<p>In 2020, for the first time since World War II, no edition of Paris-Roubaix took place due to the global pandemic. This fact alone makes us even more excited about The Hell of the North this year.</p>\n<p><span style=\"font-weight: 400;\">We are also thrilled to see the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-femmes-2021-preview\">inaugural Women’s Paris-Roubaix this year.</a> </span></p>\n<h4>Route</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_4782_1024x1024.jpg?v=1615469975\" alt=\"\"><i><span style=\"font-weight: 400;\">Image credit: </span></i><i><span style=\"font-weight: 400;\">Alex Broadway/SWpix</span></i></p>\n<p><span style=\"font-weight: 400;\">Despite it's name, Paris-Roubaix has started in Compiègne in recent years, which is located north-east of Paris and closer to the finish-line.</span></p>\n<p><span style=\"font-weight: 400;\">The first 100km features no cobblestones. The breakaway will form and establish a lead in this phase of the race.</span></p>\n<p><span style=\"font-weight: 400;\">We still await the finalised 2021 route, but we can expect it to be similar to the 2019 race. Here, there were 29 cobblestone sectors in total. The <span>Trouee d’Arenberg arrived with eighteen sectors and around 100km still to follow. A race of attrition, it's all about staying out of trouble and staying to the front, but the cobbles can throw up surprises at any moment. The </span></span>Carrefour de l'Arbre is another sector to note which arrives within the final 25km of the race.</p>\n<p><span style=\"font-weight: 400;\">The finish remains in Roubaix, just metres from the France-Belgium border, and is one of the most romantic yet epic finishes in cycling. The riders enter the Roubaix velodrome, where unless led by a solo breakaway, the final sprint for victory will take place. Four riders have won solo since 2010, but none since 2014 where Niki Terpstra claimed victory.</span></p>\n<h4><b>Contenders</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_5329_1024x1024.jpg?v=1615470091\" alt=\"John Degenkolb\"></b></p>\n<p><i><span style=\"font-weight: 400;\">John Degenkolb, the 2015 Paris-Roubaix winner (Image credit: </span></i><i><span style=\"font-weight: 400;\">Alex Broadway/ASO/SWpix)</span></i></p>\n<p><span style=\"font-weight: 400;\">The startlist for 2021 is yet to be confirmed, but we know many of the riders that are audacious enough to take part.</span></p>\n<p><span style=\"font-weight: 400;\">We’ll start with a team synonymous with the cobblestones — Deceuninck-Quick-Step. The Belgian outfit won the most recent edition in 2019 with Philippe Gilbert, who has since moved on to Lotto-Soudal — more on him later. But Deceuninck are undoubtedly the team with the most depth when it comes to cobbled classics. Any of <span>Florian Sénéchal</span>, Yves Lampaert, <span>Zdeněk Štybar,</span> Kasper Asgreen could feasibly win. Having so much strength at the top-end of a team is crucial in a race where a puncture or crash could end an individual's chance in an instant. Looking further down the teamsheet, 'The Tractor' Tim Declerq can ride on the front of the peloton all day to ensure the breakaway is in Deceuninck’s favour.</span></p>\n<p><span style=\"font-weight: 400;\">Away from DQS, there are two riders that stand above the rest on the favourites list, Mathieu van der Poel and Wout Van Aert. The two cyclo-cross stars have already displayed elite form on the road in 2021, with Van der Poel winning Strade Bianche in stunning fashion and Van Aert a stage at Tirreno-Adriatico. The two riders seemingly have no weaknesses — they are strong enough to attack away from the others and if anyone goes to the line with them, they are almost impossible to beat in a sprint. Van Aert is one of the fastest riders in the world right now, he beat Caleb Ewan in a bunch sprint at Tirreno, whilst Van der Poel beat Van Aert himself in a sprint at the Tour of Flanders last year. If you have any tips on how the duo can be beaten we’re all ears because we are stumped.</span></p>\n<p><span style=\"font-weight: 400;\">Lotto-Soudal have an intriguing team, even though the defending champion Philippe Gilbert may not be on the startline. Now 38-years-old, Gilbert has one monument left to win in his illustrious career — Milan-San Remo. The Belgian is focusing on that and we wait to see whether he’ll attempt to defend Paris-Roubaix. They have another former winner in their ranks in John Degenkolb. The 2015 victor is dangerous in a sprint should he be there in the finale. Lotto’s rider to watch is Florian Vermeersch, who is just 22-years-old, but he has a bright future in the classics.</span></p>\n<p><span style=\"font-weight: 400;\">On paper, Trek-Segafredo have one of the stronger cobble classics lineups, though they can be unpredictable. They didn’t even finish in the top 50 at Omloop earlier this year, yet won Kuurne-Brussels-Kuurne with Mads Pedersen the following day. Jasper Stuyven and Mads Pedersen make up the heart of their team and like Degenkolb, both are quick in a sprint. Rivals must be aware of Quinn Simmons though, who despite his age (he’s 19), is developing rapidly and has spoken before about his endearment to the classics.</span></p>\n<p><span style=\"font-weight: 400;\">BORA-Hansgrohe have rebuffed their classics squad with the 2019 Paris-Roubaix runner-up Nils Politt. The German has displayed fair form in 2021, too. He will work in conjunction with Peter Sagan, one of the best classics riders of his generation. Sagan has had a delayed start to his 2021 campaign, so we will wait to see what type of form he produces before adjudging his chances.</span></p>\n<p><em><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_5352_1024x1024.jpg?v=1615484418\" alt=\"Peter Sagan\">Peter Sagan (</span></em><em><span style=\"font-weight: 400;\">Image credit: Alex Broadway/SWpix)</span></em></p>\n<p><span style=\"font-weight: 400;\">AG2R-Citroen have turned their focus from the Grand Tours to the classics after losing Romain Bardet to sign Greg Van Avermaet, Bob Jungels and Stan Dewulf. GVA won the Hell of the North in 2017 in a five-man sprint. At 35, he is still a perennial contender. Oli Naesen has never finished in the top 10 at Paris-Roubaix, but is one of the best cobble riders in the peloton. Whether it's GVA, Naesen or even Stan Dewulf, AG2R will look to be in the running here.</span></p>\n<p><span style=\"font-weight: 400;\">When you think of Movistar, the last race that comes to mind is Paris-Roubaix. The team have always been GC-centric with a focus on the Grand Tours. However, the addition of Ivan Garcia Cortina does give them some impetus on the cobbles. The Spaniard is 25 and although he has no notable results at Roubaix to this point, he is developing quickly and is very fast in a sprint.</span></p>\n<p><b>Favourites: </b><span style=\"font-weight: 400;\">Wout Van Aert, Mathieu van der Poel, <span>Florian Sénéchal</span>, Yves Lampaert</span></p>\n<p><b>Outsiders:</b><span style=\"font-weight: 400;\"> Ivan Garcia Cortina, Quinn Simmons, John Degenkolb, Dylan van Baarle</span></p>\n<p><i><span style=\"font-weight: 400;\">Cover image credit: </span></i><i><span style=\"font-weight: 400;\">Alex Broadway/SWpix</span></i></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0862830d065c09b9b31b159db3692b535c2305f94a5af2175de3290be7a76a7d","category":"Cycling"}