{"title":"Do better coders swear more, or does C just do that to good programmers?","link":"https://arstechnica.com/?p=1923937","date":1678818907000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-182884083-800x533.jpg\" alt=\"A person screaming at his computer.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-182884083.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/crazy-businessman-frustrated-with-his-computer-royalty-free-image/182884083?phrase=cursing&amp;adppopup=true\">dasilvafa</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Ever find yourself staring at a tricky coding problem and thinking, “shit”?</p>\n<p>If those thoughts make their way into your code or the associated comments, you’re in good company. When undergraduate student Jan Strehmel from Karlsruhe Institute of Technology analyzed open source code written in the programming language C, he found no shortage of obscenity. While that might be expected, Strehmel’s overall finding might not be: The average quality of code containing swears was significantly higher than the average quality of code that did not.</p>\n<p>“The results are quite surprising!” Strehmel said. Programmers and scientists may have a lot of follow-up questions. Are the researchers sure there aren’t certain profanity-prone programmers skewing the results? What about other programming languages? And, most importantly, why would swears correlate with high-quality code? The work is ongoing, but even without all the answers, one thing’s for sure: Strehmel just wrote one hell of a bachelor’s thesis.</p></div><p><a href=\"https://arstechnica.com/?p=1923937#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1923937&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"086314b965a99903c10157d94c5b01f0c658379dfcae839459136a17feee0b0a","category":"Tech"}