{"title":"State of the season: what can we expect going into the last women's races of 2021?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/state-of-the-season-what-can-we-expect-going-into-the-last-races-of-2021","date":1631113001000,"content":"\n      <p><span>The past five weeks have seen a concentrated period of WorldTour racing for the women’s peloton. The post-Tokyo calendar was already underway just one week after the road race at Donostia San Sebastian Klasikoa on the 31st July. Next, came the Ladies Tour of Norway swiftly followed by Simac Ladies Tour, GP de Plouay and the Ceratizit Challenge by La Vuelta — all taking place during the month of August. </span></p>\n<div></div>\n<p><span>The Tour Cycliste Féminin International de l'Ardèche starting today may not be a Women’s WorldTour race but it has attracted some of the best WorldTour riders including Lizzie Deignan. Deignan and her Trek-Segafredo squad are one of five WWT teams at the race and will be hoping to use the tough 2.1 event for a pre-Worlds form boost. </span></p>\n<p><span>Many of those who aren’t in France will be in Trento for the European Continental Championships — with the notable exception of Anna van der Breggen. The World Champion revealed that she is, in fact, human — posting on her Instagram after the Ceratizit Challenge by La Vuelta: “</span><span>a very strange race for me. Mentally I was happy to race and tried to do well but physically it was far from normal. Resulting in being dropped on most climbs.” As a result, she won’t be taking to any start lines until it comes to defending her rainbow stripes, adding that she will: “try to find the good legs back for worlds.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1338429282_1024x1024.jpg?v=1631112133\" /></span></p>\n<p><em><span>Image: Getty/</span>Gonzalo Arroyo Moreno<span>/</span><span>Stringer</span></em></p>\n<p><span>Van der Breggen did a stint in the director’s seat at the Simac Ladies Tour in preparation for her career change at the end of the season where she will move into that role for Team SD Worx. Given the long and decorated career she has enjoyed, nobody could begrudge the 31-year-old a slower transition towards retirement — it’s hardly as if she needs to add to her palmares. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide\">Women's WorldTour Calendar 2021: The Rouleur Racing Guide</a></em></strong></p>\n<p><span>Thanks to the sheer volume of racing and the length of the season, the difference between riders who have mapped out their racing schedule and rest periods — or been afforded the luxury of doing so by teams — and those who haven’t will likely show in the late-season races. </span></p>\n<p><span>Annemiek van Vleuten is taking her usual approach by lining up for anything and everything on offer — and winning. In the absence of an in-form van der Breggen, the Movistar leader has gone virtually unchallenged in recent races. That’s not to take away from the level of the women’s peloton at the moment, rather, it is testament to a lack of harmony both within and between teams that has been evident in the way recent events have played out. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1331611962_2d7fb9a4-c53e-4ef6-a1a2-5ef4b878c460_1024x1024.jpg?v=1631112238\" /><em><span>Image: Getty</span></em></span></p>\n<p><span>The discord isn’t confined to trade teams, however. Given that the string of confusion started at the Tokyo Olympics and was blamed on lack of radios, let’s hope that national teams have been brushing up on their communication ahead of the world championships — which are also raced without radios. The Dutch in particular have a lot to learn from the Olympics and will be looking to right that wrong. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/double-dutch-what-happened-to-communication-in-the-women-s-olympic-road-race\">Related: What happened to communication in the Women's Olympic Road Race?</a></em></strong></p>\n<p><span>While van der Breggen and van Vleuten go into every race they start with targets on their backs, one rider carrying a huge amount of expectation heading into the world championships this year is home favourite Lotte Kopecky. The course looks tailor made for the fast-finishing 25-year-old who recently returned after her crash in the Omnium in Tokyo to win the final stage of the Ceratizit Challenge. Of course, Marianne Vos, and a host of other riders will be hoping to spoil the party.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1338423054_1024x1024.jpg?v=1631112410\" /></span></p>\n\n<p><em><span>Kopecky wins the final stage of Ceratizit Challenge ahead of Elisa Longo Borghini (Image: Getty/</span>Gonzalo Arroyo Moreno<span>/</span><span>Stringer)</span></em></p>\n<p><span>Amidst all the excitement for the Flanders World Championships, one race that can’t be forgotten is the inaugural edition of Paris Roubaix Femmes. By the time the 2nd October comes around it will have been eighteen months since the last edition of the men’s race was held and just over a year since the UCI and ASO casually dropped the women’s race into a revised, Covid-affected calendar. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/preview-womens-road-race-world-championships\">Related: Women's World Championship Road Race Preview</a></em></strong></p>\n<p><span>There’s no race quite like the so-called Hell of the North and, like most of the Classics, trying to predict the outcome can be like plaiting fog. The World Championships might go some way to defining who is ready to take on the cobbles but look out for those who moonlight in off-road disciplines to handle the cobbles with aplomb — especially if the weather takes a turn for the wet. </span></p>\n<p><span>For many, Roubaix might spell the end of their season, either by choice or — an unfortunate possibility in that race — not. For those who aren’t inclined towards bone-shaking pavé then The Women’s Tour the following week brings six days of racing — although the disrepair of some British roads can be just as bad. </span></p>\n\n<p><span><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-femmes-2021-preview\">Related: Paris Roubaix Femmes 2021 Preview</a></em></strong></span></p>\n<p><span>The final stage race on the Women’s WorldTour calendar and one of the most popular events with riders and fans hasn’t taken place since 2019. With the race coming at the end of a long and drawn-out season we might see it raced differently to previous years. As with most stage races, it’s likely that we’ll see some unexpected rides from up-and-coming talents. For the first time since its inception The Women’s Tour will feature an individual time trial and, without big mountains for the likes of van Vleuten to rampage their way up, the terrain in general lends itself to close racing. </span></p>\n<p><span>Barring the odd one-day French race there’s very little going on between The Women’s Tour and the final WWT event of the season, Ronde van Drenthe. Coming, as it does, on 23rd October, it might be a case of whoever is left standing at that point in the season, although in the absence of the sprint-fest races in China the likes of Lorena Wiebes might just hang on for a final blowout — unless a breakaway gets there first. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"087ba62f8f655d3943019bd9e525c4b97f7e7a50a01bf928ca8d1b0321590406","category":"Cycling"}