{"title":"A Novel Local‐Inertial Formulation Representing Subgrid Scale Topographic Effects for Urban Flood Simulation","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035334?af=R","date":1715006689000,"content":"<h2>Abstract</h2>\n<p>The local-inertial approximations of the shallow water equations (SWEs) have been used for flood forecasting at larger spatial scales owing to the improved computational efficiency and similar accuracy compared to the full 2D SWEs. With the availability of high-resolution elevation data, the complex terrain of urban areas with various small-scale features is represented well. Even for a local-inertial model, utilizing such high-resolution elevation data in flood simulations of urbanized areas increases the computational cost. A subgrid-based local-inertial formulation that permits large numerical grid size for computations while preserving the within-grid topography is proposed to circumvent this. The subgrid topography can be incorporated into the coarse numerical grid computations by estimating the hydraulic properties, namely, volume and face area, based on water surface elevation variations of the associated high-resolution terrain. The pre-stored hydraulic properties are then used to dynamically update the hydraulic variables during the execution of the local-inertial model. Idealized and real-world test cases were simulated to illustrate the advantages of the proposed model. The proposed subgrid model performs better in capturing flood depth around subgrid-scale features such as streets, highways, minor canals, etc., than the simple grid-averaged local-inertial models of the same grid size. The proposed model is faster than the existing local-inertial model (e.g., LISFLOOD-FP) (∼21–34 times) and the full 2D model (e.g., HEC-RAS 2D) (∼361–660 times) of similar accuracy in the slow-rising flood applications. Thus, the subgrid local-inertial model holds promise in real-time flood inundation forecasting, resolving smaller urban features.</p>","author":"N. Nithila Devi, \nSoumendra Nath Kuiry","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"08825db163b547bbcf97fe23c0a0d3d2620545fcdf79872119baa2d8428b7dc8","category":"Environment"}