{"title":"Buffering and phenological mismatch: A change of perspective","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17294?af=R","date":1715583600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/9ad078df-cd3f-4adf-a915-a08b4a5ce954/gcb17294-toc-0001-m.png\" alt=\"Buffering and phenological mismatch: A change of perspective\" />\n<p>Climate change can shift the seasonal timing of many species, and potentially disrupt feeding interactions between species that were formally synchronized in time. We identify a variety of mechanisms that could act to buffer consumer species against temporal disruption with their resources, highlighting the ubiquity of these mechanisms and their implications for the resilience of ecosystems under climate change. We stress the need for further work to identify the significance of ‘buffering’ in nature and hence which species may be most at risk from this threat.</p>\n<br />\n<h2>Abstract</h2>\n<p>The potential for climate change to disrupt phenology-mediated interactions in interaction networks has attracted considerable attention in recent decades. Frequently, studies emphasize the fragility of ephemeral seasonal interactions, and the risks posed by phenological asynchrony. Here, we argue that the fitness consequences of asynchrony in phenological interactions may often be more buffered than is typically acknowledged. We identify three main forms that buffering may take: (i) mechanisms that reduce asynchrony between consumer and resource; (ii) mechanisms that reduce the costs of being asynchronous; and (iii) mechanisms that dampen interannual variance in performance across higher organizational units. Using synchrony between the hatching of winter moth caterpillars and the leafing of their host-plants as a case study, we identify a wide variety of buffers that reduce the detrimental consequences of phenological asynchrony on caterpillar individuals, populations, and meta-populations. We follow this by drawing on examples across a breadth of taxa, and demonstrate that these buffering mechanisms may be quite general. We conclude by identifying key gaps in our knowledge of the fitness and demographic consequences of buffering, in the context of phenological mismatch. Buffering has the potential to substantially alter our understanding of the biotic impacts of future climate change—a greater recognition of the contribution of these mechanisms may reveal that many trophic interactions are surprisingly resilient, and also serve to shift research emphasis to those systems with fewer buffers and towards identifying the limits of those buffers.</p>","author":"Jamie C. Weir, \nAlbert B. Phillimore","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"0888caf05172a802ad3ec291201ecdf5fd2a3b9526dd0190b8c181d5756b6acd","category":"Environment"}