{"title":"The Martian’s Andy Weir is back to form with Project Hail Mary","link":"https://arstechnica.com/?p=1761902","date":1620129610000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/phm-800x506.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/phm.jpg\">Enlarge</a> <span>/</span> Cover art from <em>Project Hail Mary</em>. (credit: Ballantine Books)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p><em>Project Hail Mary,</em> the latest from science fiction author Andy Weir, is a lot like Weir’s first novel, <em>The Martian.</em> It’s a rapid-fire romp through insurmountable problem after insurmountable problem, focusing on a protagonist who quips his way through each issue with snappy first-person narration and a never-ending supply of Science<img src=\"https://s.w.org/images/core/emoji/11/72x72/2122.png\" />.</p>\n<p>Saying more about it while avoiding spoilers is very difficult. As with <em>The Martian,</em> the book opens on a lone human in dire straits—our narrator awakens with total memory loss and has no idea who he is, where he is, or what he’s supposed to be doing. The process by which he pieces together his identity and mission takes up the first chunk of the book, and none of that stuff can really be discussed without spoiling things.</p>\n<h2>Spoiler-free thoughts: Should you buy it?</h2>\n<p>The quick version is that if you enjoyed <a href=\"https://arstechnica.com/science/2014/11/stuck-on-mars-with-nothing-but-disco-ars-talks-with-the-martians-andy-weir/\"><em>The Martian</em>’s style of storytelling</a>, you’ll probably enjoy <em>Project Hail Mary.</em> The two books are cut from the same cloth—a scientist finds himself alone and has to science the you-know-what out of the situation. If that conceit works for you, the book will work for you. (And, as with <em>The Martian</em>, there's already <a href=\"https://www.slashfilm.com/project-hail-mary/\">a movie deal in the works</a>, with a screenplay by Drew Goddard.)</p></div><p><a href=\"https://arstechnica.com/?p=1761902#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1761902&amp;comments=1\">Comments</a></p>","author":"Lee Hutchinson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"088af323b22b6e7c86af575dbc99a61b95d215b4cc402449b3b38661a6b7f739","category":"Tech"}