{"title":"Development of a fast‐response system with integrated calibration for high‐resolution mapping of dissolved methane concentration in surface waters","link":"https://onlinelibrary.wiley.com/doi/10.1002/lom3.10609?af=R","date":1715404866000,"content":"<h2>Abstract</h2>\n<p>Dissolved gas concentrations in surface waters can have sharp gradients across marine and freshwater environments, which often prove challenging to capture with analytical measurement. Collecting discrete samples for laboratory analysis provides accurate results, but suffers from poor spatial resolution. To overcome this limitation, water equilibrators and gas membrane contactors (GMCs) have been used for the automated underway measurement of dissolved gas concentrations in surface water. However, while water equilibrators can provide continuous measurements, their analytical response times to changes in surface water concentration can be slow, lasting tens of minutes. This leads to spatial imprecisions in the dissolved gas concentration data. Conversely, while GMCs have proven to have much faster analytical response times, often lasting only a few minutes or less, they suffer from poor accuracy and thus require routine calibration. Here we present an analytical system for the high accuracy and high precision spatial mapping of dissolved methane concentration in surface waters. The system integrates a GMC with a cavity ringdown spectrometer for fast analytical response times, with a calibration method involving two Weiss-style equilibrators and discrete measurements in vials. Data from both the GMC and equilibrators are collected simultaneously, with discrete vial samples collected periodically throughout data collection. We also present a mathematical algorithm integrating all data collected for the routine calibration of the GMC dataset. The algorithm facilitates comparison between the GMC and equilibrator datasets despite the substantial differences in response times (0.7–2.1 and 4.1–17.6 min, respectively). This measurement system was tested with both systematic laboratory experiments and field data collected on a research cruise along the US Atlantic margin. Once calibrated, this system identified numerous sharp peaks of dissolved methane concentration in the US Atlantic margin dataset that would be poorly resolved, or outright missed with previous measurement techniques. Overall, the precision and accuracy for the technique presented here were determined to be 11.2% and 10.4%, respectively, the operating range was 0–1000 ppm methane, and the <i>e</i>-folding response time to changes in dissolved methane concentration was 0.7–2.1 min.</p>","author":"Jesse T. Dugan, \nThomas Weber, \nJohn D. Kessler","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"08905381845d825413cea33c31cc8f01da012910c430651d9b844728ee3ee42d","category":"Environment"}