{"title":"Satisfaction of chronic patients with community-based health insurance schemes and related factors: Explanatory sequential mixed methods study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003374","date":1723039200000,"content":"<p>by Desalew Birhan, Zewudie Aderaw, Eskeziaw Agdew, Melkamu Siferih</p>\r\n\r\nChronic disease poses a serious threat to accessible, high-quality healthcare. Community-based health insurance (CBHI) schemes provide the poor with financial security. However, there is no evidence in Ethiopia on how satisfied chronic patients are with the schemes. The objective of the current study was to evaluate the satisfaction of chronic patients with the schemes and identify contributing factors. A hospital-based explanatory sequential mixed methods study on 632 chronic patients and 12 key informants was carried out between February 28 and May 31, 2022, in the hospitals of East Gojjam, Northwest Ethiopia. Hospitals and study participants were selected using multistage sampling methods. Quantitative data was entered using Epi Data 3.1 and exported to SPSS version 25 for analysis. P value &lt;0.05 was used to consider significant association in multivariable binary logistic regression. Thematic analysis was a method to manually review qualitative data. A narrative approach was used for integrating the two data. The mean age of study participants was 46.1 (46.1± 5.2, range: 25–82). Patients aged 45 to 64 made up the majority of the population (60.6%). Rheumatoid arthritis affected the preponderance of individuals (36.4%). The overall level of satisfaction of chronic patients with the CBHI scheme was 31% (95% CI; 27–35%). Respect and friendliness (AOR = 7.05; CI: 3.71–13.36), knowledge of benefits packages (AOR = 2.02; CI: 1.24–3.27), partial or non-availability of drugs (AOR = 0.24, AOR = 0.21, respectively), waiting times (AOR = 1.84; CI: 1.12–3.0), and availability of laboratory tests (AOR = 1.59; CI: 1.01–2.48) were significantly associated with participants’ satisfaction with the schemes. Our study revealed that the overall satisfaction of chronic patients was quite low and affected by the availability of drugs and laboratory tests, caregivers’ respect and friendliness, waiting times, and participant knowledge. Therefore, stakeholders must concentrate on reducing waiting times, improving the availability of drugs and laboratory tests at each hospital, opening back up community pharmacies, and promoting awareness about benefits packages primarily through health education. The main focus of researchers needs to be on nationally representative studies that include more important factors.","author":"Desalew Birhan","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"089b1532c1131eeb8bdf228e09731fc4aca7f0a7a41d9240645ce14e13e48943","category":"Environment"}