{"title":"220 Effect of silage inoculants containing different combinations of homo- and heterofermentative strains on fermentation, aerobic stability, and hydrocyanic acid content of sorghum whole-plant silage","link":"https://academic.oup.com/jas/article/102/Supplement_3/393/7757349?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Hydrocyanic acid (HCN) is regulated in the European Union to max. 57 mg/kg dry matter (DM) in complete feed. The study evaluated the effect of two commercial silage inoculants on fermentation, dry matter loss, aerobic stability and the level of hydrocyanic acid of whole-plant sorghum. Sorghum [<span>Sorghum bicolor (L.) Moench</span>] variety Vilom ene was harvested at the soft dough maturity stage at 29.8 % DM. Ten mini-silos (1.5 l volume) for each treatment were filled with crop (193 kg DM/m<sup>3</sup>). Control forage (CON) was not inoculated. AS treatment was inoculated with SiloSolve AS (150,000 total CFU/g of forage), containing <span>Lentilactobacillus buchneri</span> (DSM22501), <span>Lactiplantibacillus plantarum</span> (DSM26571) and <span>Enterococcus faecium</span> (DSM22502). FC treatment was inoculated with SiloSolve FC (150,000 total CFU/g of forage), containing <span>Lentilactobacillus buchneri</span> (DSM22501) and <span>Lactococcus lactis</span> (DSM11037). After 60 d of fermentation at room temperature, five mini-silos per treatment were opened and sampled for proximate analysis, forage hygiene, and the fermentation profile. The content from the other five mini-silos was subjected to an aerobic stability test. Aerobic stability was defined as the time (hours) for the silage temperature to exceed 3.0°C above the ambient temperature. The data were analyzed as a completely randomized design using GLM of Minitab with treatments as a fixed effect. No significant effect of treatments was observed on dry matter loss. Both inoculants increased acetic acid levels in the silages compared with CON; <span>P</span> &lt; 0.05), where FC showed a significantly greater level than AS (3.1, 2.5 and 1.7 % DM for FC, AS, and CON, respectively; Table 1). Both inoculants produced 1,2-propanediol (<span>P</span> &lt; 0.05). FC silage had a greater level of 1,2-propanediol than AS (1.0, 0.4 and 0.0 % DM for FC, AS, and CON, respectively). The concentrations of lactic acid, ammonia-N and ethanol were not different between treatments. FC significantly reduced the count of yeasts (3.1, 4.1, and 4.3 Log<sub>10</sub> CFU/g for FC, AS, and CON, respectively). The count of molds was below the detection level (&lt; 2.0 Log<sub>10</sub> CFU/g) in all silages. The FC silage markedly improved aerobic stability, extending it to 231 h, compared with 112 and 80 h for the AS and CON treatments (<span>P</span> &lt; 0.001). AS tended to improve aerobic stability compared with CON (<span>P</span> = 0.08). No differences were observed in the concentration of the hydrocyanic acid between treatments. The ensiling process significantly reduced (<span>P</span> &lt; 0.0001) the hydrocyanic acid from 86.4 mg/kg DM in the fresh crop to 58.4 mg/kg DM in silages. Such silage should be fed only together with HCN-free ingredients in a TMR. However, these results demonstrate that only the combination of <span>L. buchneri</span> (DSM22501) and <span>Lactococcus lactis</span> (DSM11037) effectively decreased the yeast count and consequently improved aerobic stability in whole-plant sorghum silage.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"089fb8e5529d3c0b3a3bab4be9129af403b23c5084546895fa2e0cec10c3982c","category":"Environment"}