{"title":"Game developer survey: 50% work at a studio already using generative AI tools","link":"https://arstechnica.com/?p=1997119","date":1705605053000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-1418934535-800x533.jpg\" alt=\"The future of game development?\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-1418934535-scaled.jpg\">Enlarge</a> <span>/</span> The future of game development? (credit: <a href=\"https://www.gettyimages.com/detail/photo/robot-controlling-future-hologram-ui-royalty-free-image/1418934535\">Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A new survey of thousands of game development professionals finds a near-majority saying generative AI tools are already in use at their workplace. But a significant minority of developers say their company has no interest in generative AI tools or has outright banned their use.</p>\n<p>The <a href=\"https://gdconf.com/news/gdc-2024-state-game-industry-devs-discuss-layoffs-generative-ai-and-more\">Game Developers Conference's 2024 State of the Industry report</a>, released Thursday, aggregates the thoughts of over 3,000 industry professionals as of last October. While the annual survey (conducted in conjunction with research partner Omdia) has been running for 12 years, this is the first time respondents were asked directly about their use of generative AI tools such as ChatGPT, DALL-E, GitHub Copilot, and Adobe Generative Fill.</p>\n<p>Forty-nine percent of the survey's developer respondents said that generative AI tools are currently being used in their workplace. That near-majority includes 31 percent (of all respondents) that say they use those tools themselves and 18 percent that say their colleagues do.</p></div><p><a href=\"https://arstechnica.com/?p=1997119#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1997119&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"08a16183aa1c171660aa992fdaf9d316bac7fa91bec38d8c6ddeef46741d7452","category":"Tech"}