{"title":"For reasons no one can fathom, McDonald’s has released a new Game Boy Color game","link":"https://arstechnica.com/?p=1947557","date":1686687205000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/IMG_7519-800x600.jpg\" alt=\"We couldn't get it on genuine hardware on short notice, but the game runs fine on the Analogue Pocket using a Game Boy Color FPGA core.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/IMG_7519.jpg\">Enlarge</a> <span>/</span> We couldn't get it on genuine hardware on short notice, but the game runs fine on the Analogue Pocket using a Game Boy Color FPGA core. (credit: Andrew Cunningham)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Infinite monkeys working at infinite typewriters would have trouble coming up with the sentence I am about to write: Fast food giant McDonald's has released a new retro-style game featuring Grimace, the purple milkshake blob. While it's clearly meant to be played in a browser on a phone or computer, it's also a fully working Game Boy Color game that you can download and play on the original hardware.</p>\n\n<p><em>Grimace's Birthday </em>was developed by Krool Toys, a Brooklyn-based independent game studio and \"creative engineering team\" with <a href=\"https://www.complex.com/style/a/mike-destefano/krool-toys-video-games-lil-uzi-vert-playboi-carti\">a history of creating playable Game Boy games</a> as unique PR for music artists and brands. The game assumes you're playing in an emulator via a browser window—you can play that version of the game <a href=\"https://grimacesbirthday.com/\">here</a>—but we also got it running on an Analogue Pocket thanks to a Game Boy Color FPGA core and a downloadable ROM <a href=\"https://archive.org/details/grimaces-birthday\">hosted on the Internet Archive</a>.</p>\n<p>The game is so period-authentic that there's even a screen telling original monochrome Game Boy owners that the game \"<a href=\"https://twitter.com/nickisonlinet/status/1668424701436100609?ref_src=twsrc%5Etfw\">requires a color device to play</a>.\" Even on Game Boy hardware, it still makes references to people \"playing on mobile devices.\"</p></div><p><a href=\"https://arstechnica.com/?p=1947557#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1947557&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"08a645b9bdc0c59a45a320b4eaf3b6ae112095258f196316056781790d4bcbe4","category":"Tech"}