{"title":"Spontaneous symmetry breaking of cooperation between species","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae326/7730428?rss=1","date":1723161600000,"content":"<span><div>Abstract</div>In mutualistic associations, two species cooperate by exchanging goods or services with members of another species for their mutual benefit. At the same time, competition for reproduction primarily continues with members of their own species. In <span>intra</span>-species interactions, the prisoner’s dilemma is the leading mathematical metaphor to study the evolution of cooperation. Here we consider <span>inter</span>-species interactions in the spatial prisoner’s dilemma, where members of each species reside on one lattice layer. Cooperators provide benefits to neighbouring members of the other species at a cost to themselves. Hence, interactions occur across layers but competition remains within layers. We show that rich and complex dynamics unfold when varying the cost-to-benefit ratio of cooperation, <span>r</span>. Four distinct dynamical domains emerge that are separated by critical phase transitions, each characterized by diverging fluctuations in the frequency of cooperation: <span>(i)</span> for large <span>r</span> cooperation is too costly and defection dominates; <span>(ii)</span> for lower <span>r</span> cooperators survive at equal frequencies in both species; <span>(iii)</span> lowering <span>r</span> further results in an intriguing, spontaneous symmetry breaking of cooperation between species with increasing asymmetry for decreasing <span>r</span>; <span>(iv)</span> finally, for small <span>r</span>, bursts of mutual defection appear that increase in size with decreasing <span>r</span> and eventually drive the populations into absorbing states. Typically, one species is cooperating and the other defecting and hence establish perfect asymmetry. Intriguingly and despite the symmetrical model set-up, natural selection can nevertheless favour the spontaneous emergence of asymmetric evolutionary outcomes where, on average, one species exploits the other in a dynamical equilibrium.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"08a782a81afdf2467b1f34da53bd6686df7db8d5843ddc6890804b29079ad303","category":"Interdisciplinary"}