{"title":"Innovative Alkanediol-Based Eutectic Solvents for Extracting/Pre-Formulating Dermatologically Valuable Free Fatty Acids from Spirulina and Porphyridium Cakes","link":"https://www.preprints.org/manuscript/202405.1747/v1","date":1716809715000,"content":"The growing demand for phycobiliproteins from microalgae generates a significant volume of by-products, such as extraction cakes. These cakes are enriched with products of interest for the cosmetic market, namely free fatty acids, particularly polyunsaturated (PUFA). In this work, two cakes, one of spirulina and one of Porphyridium cruentum, were valorized using innovative natural hydrophobic deep eutectic solvents (NaDES) based on alkanediols. The most promising NaDES, as determined by physicochemical properties and screening, are mixtures of alkanediol and fatty acid. These include the mixture of 1,3-propanediol and octanoic acid (1:5, mol/mol) and 1,3-propanediol and octanoic and decanoic acid (1:3:1, mol/mol). Two extractive processes were implemented: ul-trasound-assisted extraction and an innovative mechanical process by dual asymmetric centrifu-gation. The second process resulted in the production of extracts significantly enriched in PUFA, ranging from 65 to 220 mg/g dry matter with the two cakes. The extracts and NaDES demonstrated good safety with respect to epidermal keratinocyte viability. The study of their impact on com-mensal and pathogenic cutaneous bacteria demonstrated significant effects on viability of Staphy-lococcus aureus and Staphylococcus epidermidis while preserving Corynebacterium xerosis and Cuti-bacterium acnes. These results highlight the potential of valorizing these co-products using al-kanediol-based NaDES, in a strategy combining an active vector (NaDES) and a growth regulator extract, for the management of cutaneous dysbiosis involving staphylococci.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"08b513721cbc878fb2f503518e320670ac394e4d8691ce24060b4fc1005bdf30","category":"Interdisciplinary"}