{"title":"Chitosan and Grifola Frondosa nanoparticles insulate liver dysfunction in EAC-bearing mice","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae050/7636986?rss=1","date":1711584000000,"content":"<span><div>Abstract</div><div>Background</div>Ehrlich ascites carcinoma (EAC) is a rapidly growing and undifferentiated tumor that can prompt oxidative stress and liver toxicity, whereas chitosan and <span>Grifola Frondosa</span> have widely recognized biological qualities. Therefore, our study designed to assess the potential ameliorative ability of chitosan nanoparticles (CS NPs) and Grifola Frondosa nanoparticles (GF-loaded casein NPs) on EAC-induced hepatic injury in mice.<div>Methods</div>A total of 60 female albino mice were segregated into 6 groups (10 mice each), G1, control group; G2, CS NPs group; G3, GF-loaded casein NPs group; G4, EAC group; G5, EAC treated with CS NPs; G6, EAC treated with GF-loaded casein NPs.<div>Results</div>According to the findings, EAC considerably increased serum activities of ALT, AST, ALP as well as LDL, cholesterol, and triglycerides levels coincided with marked decrease in albumin and total protein content in liver tissue. At the same time, it drastically lowered GSH levels and catalase activity while significantly elevating MDA levels. In addition, EAC caused DNA damage and apoptosis by decreasing Bcl-2 while increasing p53 expressions. However, either CS NPs or GF-loaded casein NPs therapy improved liver architecture and functioning, increased antioxidant parameters, and prevented hepatocyte death in EAC mice.<div>Conclusions</div>Our findings concluded that CS NPs and GF-loaded casein NPs have insulating functions against EAC-induced hepatic damage in mice.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"08bfc4f2844c4ea9993333cb4ae6c95288664990a33388969967e428eb30b5f8","category":"Environment"}