{"title":"Effect of Terraces and Rainfall on Water and Soil Loss in Pinus tabulaeformis Plantations in the Semiarid Loess Hilly Region of China","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2720?af=R","date":1726114044000,"content":"<h2>ABSTRACT</h2>\n<p>The Loess Plateau is one of the most severely eroded areas in the world. A series of ecological measures (e.g., terracing, afforestation and reforestation) have been implemented to rehabilitate the environment. However, consecutive field observations are still inadequate regarding the benefits of eco-measures on erosion reductions. In this study, surface runoff and soil loss were monitored at the plots of <i>Pinus tabulaeformis</i> with two different terraces and natural slope, including fish scale pits with <i>Pinus tabulaeformis</i> (F–P.t), control slope (natural slope) with <i>Pinus tabulaeformis</i> (C–P.t) and zig terraces with <i>Pinus tabulaeformis</i> (Z–P.t) in the growing season of 2015–2021. Results showed that terraces played a key role in reducing water and soil loss compared to natural slopes. The zig terraces had the greatest runoff and soil loss reduction benefits (43.38% and 67.75%, respectively). Maximum runoff and sediment occurred under the rainfall with high intensity and short duration. Runoff depth was better explained by rainfall depth and rainfall duration compared to soil loss rate. Compared with the natural slope, the degree of explanation of multiple regression models for terrace plots dropped to 36.1%–41.2% for runoff depth and declined to 12.7%–19.5% for soil erosion rate. This study revealed that different terracing measures with afforestation can effectively contribute to soil and water conservation in the Loess Plateau of China. The combination of zig terraces and <i>P. tabulaeformis</i> is recommended as it has the best potential for improving the micro-topography, storing rainfall and decreasing soil erosion. These results can help evaluate ecological restoration projects on the Loess Plateau and provide a scientific basis for the implementation of terracing projects in similar areas.</p>","author":"Yue Huang, \nWei Wei, \nShengnan Chen","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"08d2b81870f61b611b0fc72fa58bb7751559e91d2d484381bef0be4616031a14","category":"Environment"}