{"title":"Exploring the Prevalence and Severity of Global Hunger and Food Insecurity: Recent Dynamics and Sub-Saharan Africa&rsquo;s Burden","link":"https://www.preprints.org/manuscript/202404.1907/v1","date":1714377096000,"content":"One of today’s most critical challenges is ensuring a sufficient food production and supply for the ever-expanding global population. Recently, many countries around the world, particularly those in Africa, grapple with severe hunger and food insecurity, frequently exacerbated by escalating global prices, persistent insecurity, and the repercussion of the COVID-19 pandemic. However, this study undertook an extensive review of the prevalence and severity of hunger and food insecurity across diverse countries and regions. The review utilised several metrics, including Global Hunger Index (GHI) scores, Global Food Security index (GFSI) scores, 2023 data (related to two Sustainable Development Goal 2 (SDG2) target) from the Food and Agriculture Organization (FAO), and other pertinent sources to assess the current status of the countries included in this study. The 20 countries with 2023 GHI scores below 5 were collectively ranked from 1 to 20, signifying low hunger levels. However, Central African Republic (CAR) received the lowest ranking at 125 out of 125, with a score of 42.3, indicating an alarming level of hunger. Finland achieved the highest GFSI score of 83.7, with Oman showing the most notable GFSI improvement at +13.8, while Syria experienced a significant decline in GFSI score by -10.5. Over time, many countries, particularly the developed ones, witnessed significant improvement in their GHI and GFSI scores. Meanwhile, most countries in sub-Saharan Africa experienced the most deterioration in their GFSI scores and notable increases in their GHI scores. The review documented the significant progress made by countries and regions in reducing levels of hunger and food insecurity, while highlighting the substantial burden borne by sub-Saharan Africa (SSA) in combating global hunger and food insecurity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"08e5be50f3b405b0c469215f77f762e3307a21df8a35f6bb41355c41ef7a9a2b","category":"Interdisciplinary"}