{"title":"Preview: Your stage-by-stage guide to the 2021 Giro Donne","link":"https://cyclingtips.com/2021/06/preview-your-stage-by-stage-guide-to-the-2021-giro-donne/","date":1625030280000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/CORVOS_00032516-031-650x433.jpg\" /></div><h2>Preview: Your stage-by-stage guide to the 2021 Giro Donne</h2><p>\n</p><p>Despite no longer being a WorldTour race, the Giro Donne – formerly the Giro Rosa – still draws the top riders in the women’s peloton. For most, the demotion doesn’t make much difference – a win at the Giro Donne is still a lifetime achievement. Over the span of 10 days, the women’s peloton will take on blistering heat, mountains, twisty Italian roads, time trials, and secret climbs in the fight for pink. </p>\n\n\n\n<p>Earlier in the year Giro Donne organisers promised 30 minutes of live coverage for each of the 10 stages. On the eve of the race, though, they’ve announced that only the final 15 km will be shown live. It’s not a good start for a race that lets us down time and time again. Still, it’s a race with history and stories to tell at parties long after retirement. It’s a race that has earned its reputation as the only women’s ‘Grand Tour’, or as close as we are going to get. </p>\n\n\n\n<p>On July 1 there’ll be a team time trial in Fossano. Ten days later the riders will roll into Cormons, some with smiles and dreams fulfilled, others barely able to taste their gelato over the bitter sting of disappointment. Here’s a breakout of every stage.</p>\n\n\n\n<h2>Stage 1: Fossano team time trial (26.7 km) | Thursday, July 1</h2>\n\n\n\n<p>The Giro Donne has a history of kicking off proceedings with a team time trial. This is one of only two TTTs the women do during the year. The other – the standalone Postnord Vårgårda – was unfortunately cancelled for 2020 and 2021. </p>\n\n\n\n<p>Trek-Segafredo won the 2020 opening TTT in Fossano, finishing only three seconds ahead of Boels-Dolmans. In 2019 it was Canyon-SRAM who took top honours. </p>\n\n\n\n<p>In 2021 it’s a game between a handful of top teams. FDJ Nouvelle Aquitaine Futuroscope had a special team trial training camp ahead of the race, while other teams are flying by the seat of their pants. For some general classification hopefuls, a disorganized team could put an end to their goals before the road racing has even kicked off.</p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Stage 2: Boves to Prato Nevoso (100 km) | Friday, July 2</h2>\n\n\n\n<p>A team time trial to start and then directly into a real general classification stage. With the 19 km climb to Prato Nevoso ski resort there is no messing around on stage 2 of the Giro Donne.</p>\n\n\n\n<p>The climb is one thing, but it’s not an easy run-in. All day the road will ascend or descend, making it one of the most crucial days of the race. Luckily for any climbers whose teams couldn’t deliver a day before, the long climb lends itself to a comeback. Although, with the way Anna van der Breggen (SD Worx) rode at <a href=\"https://cyclingtips.com/2021/05/anna-van-der-breggen-wins-vuelta-a-burgos-final-stage-and-overall/\" target=\"_blank\">Vuelta a Burgos</a>, it’s hard to see anyone beating her to the top. </p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Stage 3: Casale Monferrato to Ovada (135 km) | Saturday, July 3</h2>\n\n\n\n<p>Another hilly day is on tap for the peloton for stage 3. With a flat(ish) start to the stage a breakaway is near-inevitable. The final half of the stage is where the real fun hits, with little climb after little climb. If some adventurous souls can get enough time before reaching Prasco, 70 km into the stage, it’s hard to see the peloton bringing them back. </p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Stage 4: Formazza to Cascate ITT (11 km) | Sunday, July 4</h2>\n\n\n\n<p>Another day for some general classification action! This individual time trial calls back to that of the 2019 Giro Rosa when Annemiek van Vleuten won by nearly a minute over 12 km. Although the 2019 ITT looked gradual it harboured a secret brutal climb through a small village. The Giro Donne is famous for its faulty stage profiles. </p>\n\n\n\n<p>Could the stage 4 ITT this year feature something similar? Only time will tell. </p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Stage 5: Milano to Carugate (120 km) | Monday, July 5</h2>\n\n\n\n<p>The first day for the sprinters comes five stages into the race. With so few options for the fast women, the day will surely come down to the bunch. Once the race gets outside of the city they will complete four 26 km circuits before sprinting for the win. </p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Stage 6: Colico to Colico (155 km) | Tuesday, July 6</h2>\n\n\n\n<p>At 155 km stage 6 is the longest stage of the 2021 Giro Donne, but it will not be a flat cruise to the finish. All day the peloton kicks up over small steep climbs – the perfect stage for a breakaway. </p>\n\n\n\n<p>By this stage in the race the legs are tired, the general classification has had a few hard days, and the big teams will happily let a group slip away. </p>\n\n\n\n<p>Riders from small teams, or domestiques who haven’t been able to fight for themselves, will bookmark this stage for glory. Luckily that makes for exciting viewing at the start. Oh wait, there is no live viewing of the first 140 km. </p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Stage 7: Soprezzocco di Gavardo to Puegnago del Garda (109.6 km) | Wednesday, July 7</h2>\n\n\n\n<p>Who doesn’t love a circuit race? Stage 7 starts with a descent into a circuit the peloton will complete five times before finishing atop a 690-meter kicker. </p>\n\n\n\n<p>A day like this has Marianne Vos’s name written all over it, and with one potential breakaway day immediately in the rearview, teams with punchy uphill sprinters will make stage 7 a fun one. Bonus? The stage is short, sweet, and to the point. </p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Stage 8: San Vendemiano to Mortegliano (129.4 km) | Thursday, July 8</h2>\n\n\n\n<p>The second stage for the sprinters and possibly the last.</p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Stage 9: Tavagnacco to Matajur (122.6 km) | Friday, July 9</h2>\n\n\n\n<p>Barring any crazy complications from stages 5-8, stage 9 will be the next big GC fight. Two monstrous climbs lend themselves to the top climbers, with the finish coming after a 14 km ascent. </p>\n\n\n\n<p>Compared to other editions of the Giro Donne, the 2021 race isn’t actually that climbing heavy, so stage 9 will be an even bigger deal for those playing the long game. The Matajur climb hasn’t been featured in the Giro Donne before, at least not for the last 15 years. </p>\n\n\n\n<p>Only one stage remains after stage 9. For any rider who hopes to be within spitting distance of pink, Friday is their last chance.</p>\n\n\n\n<figure><img /></figure>\n\n\n\n<h2>Stage 10: Capriva del Friuli to Cormons (113 km) | Saturday, July 10</h2>\n\n\n\n<p>The final day of the Giro Donne is another day for the sprinters, or a breakaway, depending on how the race has gone so far. There’s a few short and punchy climbs thrown in but a downhill run to Cormons will make for a speedy end to the 2021 Giro Donne.</p>\n\n\n\n<p>Just like in 2020, the final day will be a circuit race, and in 2020 the peloton gave it to the breakaway. That stage was won by young Evita Muzic, who is now the French national champion. </p>\n\n\n\n<p>At this point, the top general classification will be done and dusted, but for those who only need to find a few seconds to make all the difference, there’s a sliver of hope. </p>\n\n\n\n<figure><img /></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/06/preview-your-stage-by-stage-guide-to-the-2021-giro-donne/\">Read More</a>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"08ea4d9a99fe3b0b4e1be84440ec2d43a1d0566cbda16eb27d1a458a780c0042","category":"Cycling"}