{"title":"Phylogenomic analysis reveals five independently evolved African forage grass clades in the genus Urochloa","link":"https://academic.oup.com/aob/article/133/5-6/725/7608115?rss=1","date":1707868800000,"content":"<span><div>Abstract</div><div>Background and Aims</div>The grass genus <span>Urochloa</span> (<span>Brachiaria</span>) <span>sensu lato</span> includes forage crops that are important for beef and dairy industries in tropical and sub-tropical Africa, South America and Oceania/Australia. Economically important species include <span>U. brizantha</span>, <span>U. decumbens</span>, <span>U. humidicola</span>, <span>U. mutica</span>, <span>U. arrecta</span>, <span>U. trichopus</span>, <span>U. mosambicensis</span> and <span>Megathyrsus maximus</span>, all native to the African continent. Perennial growth habits, large, fast growing palatable leaves, intra- and interspecific morphological variability, apomictic reproductive systems and frequent polyploidy are widely shared within the genus. The combination of these traits probably favoured the selection for forage domestication and weediness, but trait emergence across <span>Urochloa</span> cannot be modelled, as a robust phylogenetic assessment of the genus has not been conducted. We aim to produce a phylogeny for <span>Urochloa</span> that includes all important forage species, and identify their closest wild relatives (crop wild relatives). Finally, we will use our phylogeny and available trait data to infer the ancestral states of important forage traits across <span>Urochloa s.l.</span> and model the evolution of forage syndromes across the genus.<div>Methods</div>Using a target enrichment sequencing approach (Angiosperm 353), we inferred a species-level phylogeny for <span>Urochloa s.l.</span>, encompassing 54 species (~40 % of the genus) and outgroups. Phylogenies were inferred using a multispecies coalescent model and maximum likelihood method. We determined the phylogenetic placement of agriculturally important species and identified their closest wild relatives, or crop wild relatives, based on well-supported monophyly. Further, we mapped key traits associated with <span>Urochloa</span> forage crops to the species tree and estimated ancestral states for forage traits along branch lengths for continuous traits and at ancestral nodes in discrete traits.<div>Key Results</div>Agricultural species belong to five independent clades, including <span>U. brizantha</span> and <span>U. decumbens</span> lying in a previously defined species complex. Crop wild relatives were identified for these clades supporting previous sub-generic groupings in <span>Urochloa</span> based on morphology. Using ancestral trait estimation models, we find that five morphological traits that correlate with forage potential (perennial growth habits, culm height, leaf size, a winged rachis and large seeds) independently evolved in forage clades.<div>Conclusions</div><span>Urochloa s.l.</span> is a highly diverse genus that contains numerous species with agricultural potential, including crop wild relatives that are currently underexploited. All forage species and their crop wild relatives naturally occur on the African continent and their conservation across their native distributions is essential. Genomic and phenotypic diversity in forage clade species and their wild relatives need to be better assessed both to develop conservation strategies and to exploit the diversity in the genus for improved sustainability in <span>Urochloa</span> cultivar production.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"08facac35e761a3bc647f7249abaa8e5bbe26af29521105aaa81f0134be7f43e","category":"Environment"}