{"title":"Outsiders with a chance at Paris-Roubaix 2021","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/outsiders-with-a-chance-at-paris-roubaix-2021","date":1633025655000,"content":"\n      <h4><b></b></h4>\n<p><span>Paris-Roubaix is notorious for its unpredictable nature. 55km of cobblestones await the 175 starters - which can throw up punctures, crashes, or any other unfortunate surprises at any moment.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-2021-preview\"><b><i>Related – Men's Paris-Roubaix 2021 Preview<br /></i></b></a><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-femmes-2021-preview\"><b><i>Related - Paris-Roubaix Femmes 2021 Preview</i></b></a></p>\n<p><span>Often, this leads to results that just don't make sense.</span><span> </span><span>Matt Hayman had never been in the top five in fourteen attempts before winning in 2016, while Philippe Gilbert had only entered twice before he won the most recent edition in 2019. <br /></span></p>\n<p><span>Here, we pick out four riders who could spring a surprise in the 2021 edition of Paris-Roubaix.</span></p>\n<div></div>\n<h4><b>Taco van der Hoorn</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CorVos-SWpix.com1778-min_1024x1024.jpg?v=1632997889\" />Taco van der Hoorn wins stage 3 of the Giro d'Italia. (Image credit: </span></i><i><span>CorVos/SWpix)</span></i></p>\n<p><span><span>When Taco van der Hoorn soloed to victory on stage 3 of the Giro d’Italia, he</span> created one of the memorable </span>images of the 2021 season. That was his first victory in almost three years, yet his rejuvenated form has continued into the second half of the campaign.</p>\n<p><span>Taco is a breakaway specialist — he joined the break</span><span> on stage 3 of the Benelux Tour, and although he didn’t drop his breakaway partners this time, he was the fastest in a sprint. His second victory</span><span> of the season at WorldTour level — the first time he's achieved that particular feat.</span></p>\n<p><span></span><span> September continued to be a prosperous month for Van der Hoorn. </span><span>He was the only rider able to follow <span>Mathieu van der Poel at the Antwerp Port Epic before picking up a third victory of the season at Omloop van het Houtland. </span></span><span>Crucially, Van der Hoorn also demonstrated strong legs on the cobblestones at Grand Prix de Denain. The race includes numerous sectors that will also feature at Paris-Roubaix.</span></p>\n<p><span>Van der Hoorn’s form — he had never accumulated three wins in a season before 2021 — means he must be considered as a contender for Paris-Roubaix. Although he hasn't finished within the time limit in two attempts at the Hell of the North, he’s confident on the cobbles, can mix it up in a heavily reduced group sprint, and has an engine which can hold onto the slimmest of advantages.</span></p>\n<h4><b>Mike Teunissen</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CFB_2125-min_1024x1024.jpg?v=1632998178\" /></b><em>Mike Teunissen at the 2019 World Championships (Image credit: Charlie Forgham-Bailey/SWpix)</em></p>\n<p><span>Wout Van Aert leads Jumbo-Visma, which means there have been few talking up their other </span><span>contenders, despite Mike Teunissen’s pedigree. He has ridden Paris-Roubaix four times compared to Van Aert’s two appearances. Of all races on the calendar, experience cannot be undervalued at Paris-Roubaix — no debutant has won since Felice Gimondi in 1966.</span></p>\n<p><span>Teunissen’s form at Paris-Roubaix speaks for itself. He has improved his finishing position in his previous three starts</span><span>, finishing eleventh in 2018 and seventh in 2019. The Dutchman has picked up unexpected victories in the past — he won stage 1 of the Tour de France in 2019, seizing the opportunity after his team’s leading sprinter, Dylan Groenewegen, crashed.</span></p>\n<p><span>Perhaps, Jumbo-Visma can take note of Belgium’s tactical display at the World Championships. The team rode solely for Wout Van Aert until Julian Alaphilippe vanished up the road. Van Aert is a leading contender, and for good reason. However, keeping numerous options open can only be beneficial, particularly in a race that can throw up sudden surprises.</span></p>\n<h4><b>Anthony Turgis</b></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1340521775-min_1024x1024.jpg?v=1632998693\" /><em>Anthony Turgis on the attack at the Tour of Luxembourg (Bas Czerwinski/Getty Images)</em></p>\n<p><span>Anthony Turgis’ form at the cobble classics in Belgium earlier this season make him an intriguing prospect. He finished in the top ten of the Tour of Flanders, Dwars door Vlaanderen and Gent-Wevelgem. He also demonstrated his sprinting prowess when he was second at Kuurne-Brussels-Kuurne behind Mads Pedersen. </span></p>\n<p><span>More recently, Turgis played an important role in Julian Alaphilippe’s successful rainbow jersey defence, with multiple attacks placing France on the front foot early. An attack on stage 2 of the Tour of Luxembourg, although ultimately unsuccessful, shows that he’s riding aggressively and with confidence. </span></p>\n<p><span>Th</span><span>e Frenchman put forward his Roubaix credentials</span><span> in 2019, when he finished a respectable eighteenth on race debut. Adding to this strong performance at senior level, he was second at the junior Paris-Roubaix in 2012.</span></p>\n<p><span>Team TotalEnergies also have former winner Niki Terpstra, and top-five finisher Edvald Boasson Hagen in their ranks. However, both riders' form has waned in recent seasons. TotalEnergies' best chance is with Anthony Turgis.</span></p>\n<h4><b>Marco Haller</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1310798527-min_1024x1024.jpg?v=1632998290\" /></b><em>Marco Haller racing at the Tour of Flanders 2021 </em><span><em>(Nico Vereecken - Pool/Getty Images</em><em>)</em></span></p>\n<p><span>Bahrain-Victorious enter Paris-Roubaix with two of the notable in-form riders in the peloton: double Tour de France stage winner Matej Mohorič and European Champion Sonny Colbrelli. However, their lack of Roubaix experience raises question marks — Mohorič finished 70th in his only start in 2019, whilst Colbrelli is making his debut at the Hell of the North.</span></p>\n<p><span>This leads us towards the team’s veterans. Heinrich Haussler is a cobble specialist, and although he’s now 37 years old, fourth place at Omloop Het Nieuwsblad earlier this season shows he’s still got it. However, we are looking out for Marco Haller. The 30-year-old was a commendable 10th in the uber-selective edition of the E3 Saxo Bank Classic earlier this season. Additionally</span><span>, 16th place in 2019 was Haller's best performance yet in his seven Roubaix appearances.</span></p>\n<p>If the Austrian can work his way into the early breakaway, as he did at the <span>E3 Saxo Bank Classic, </span>he has a chance of influencing the latter stages of the race.</p>\n<p><i><span>Cover image: <span>Alex Broadway/SWpix</span></span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0900f192ec1335f0c21f4b0982b6c01a2e55db4bdbde8f17cce74a2498558dcb","category":"Cycling"}