{"title":"New UEFI vulnerabilities send firmware devs across an entire ecosystem scrambling","link":"https://arstechnica.com/?p=1996543","date":1705489212000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1294855961-800x544.jpg\" alt=\"New UEFI vulnerabilities send firmware devs across an entire ecosystem scrambling\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1294855961.jpg\">Enlarge</a> (credit: Nadezhda Kozhedub)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>UEFI firmware from five of the leading suppliers contains vulnerabilities that allow attackers with a toehold in a user's network to infect connected devices with malware that runs at the firmware level.</p>\n<p>The vulnerabilities, which collectively have been dubbed PixieFail by the researchers who discovered them, pose a threat mostly to public and private data centers, and their users of course. People with even minimal access to such a network—say a paying customer, a low-level employee, or an attacker who has already gained limited entry—can exploit the vulnerabilities to infect connected devices with a malicious UEFI. Short for <a href=\"https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface\">Unified Extensible Firmware Interface</a>, UEFI is the low-level and complex chain of firmware responsible for booting up virtually every modern computer. By installing malicious firmware that runs prior to the loading of a main OS, UEFI infections can’t be detected or removed using standard endpoint protections. They also give unusually broad control of the infected device.</p>\n<h2>Five vendors, and many a customer, affected</h2>\n<p>The nine vulnerabilities that comprise PixieFail reside in <a href=\"https://en.wikipedia.org/wiki/TianoCore_EDK_II\">TianoCore EDK II</a>, an open source implementation of the UEFI specification. The implementation is incorporated into offerings from Arm Ltd., Insyde, AMI, Phoenix Technologies, and Microsoft. The flaws reside in functions related to IPv6, the successor to the IPv4 Internet Protocol network address system. They can be exploited in what’s known as the PXE, or <a href=\"link\">Preboot Execution Environment</a>, when it’s configured to use IPv6.</p></div><p><a href=\"https://arstechnica.com/?p=1996543#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1996543&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"09051a0a25164212b271f084e0942425edf694e0d5738ffa8de83950efe4c47f","category":"Tech"}