{"title":"One final twist in the Bad Sagan Shoe saga","link":"https://cyclingtips.com/2021/05/one-final-twist-in-the-bad-sagan-shoe-saga/","date":1620956781000,"content":"<p>I get it. There’s a Grand Tour on. The Spring Classics have wrapped up. There have been these trifling distractions. </p>\n\n\n\n<p>But I know that, really, you’ve been hanging out for the conclusion to the narrative that has gripped CyclingTips for a month. I’m talking, of course, about the epic saga of the <a href=\"https://cyclingtips.com/2021/04/we-tried-to-get-scammed-by-peter-sagan/\">Bad Sagan Shoes</a>. </p>\n\n\n\n<p>Step 1: Go and reread that article. </p>\n\n\n\n<p>Can’t be bothered? Fine – I’ll recap. I tried to get CyclingTips scammed with some fake Peter Sagan-themed Air Jordan basketball shoes. </p>\n\n\n\n<p>I came across a shadowy entity called Luxpu – based in Texas, or San Francisco, or London, or Ho Chi Minh City, or maybe none of the above – who had some ugly shoes that definitely infringed on multiple different intellectual properties. </p>\n\n\n\n<p>Obviously, I bought some, half-expecting that it was just a clumsy cover for credit card theft.</p>\n\n\n\n<p>But they actually showed up. They were terrible. I was equal parts surprised and pleased. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/PXL_20210415_001733274-1340x1005.jpg\" /></figure>\n\n\n\n<p>But the story doesn’t end there.</p>\n\n\n\n<h2>The second pair</h2>\n\n\n\n<p>Simultaneously, my colleague in Boulder, Mikey, ordered an even worse-looking pair. His money whooshed across to Luxpu’s bank account, whatever country it’s located in. Neither of us received any shipping confirmation or tracking information, but unlike me, Mikey also received no invoice. </p>\n\n\n\n<p>Quite understandably, he’d given up hope. But here’s the thing about Luxpu – they keep you guessing to the bitter end. </p>\n\n\n\n<p>Yesterday, more than a month after my own Bad Sagan Shoes arrived, Mikey’s faith was finally rewarded. And, well, would you just look at this cursed footwear:</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Image-from-iOS-5-1340x1005.jpg\" /><figcaption>It’s the wayward stitching that’s the real clue that these are a quality item. </figcaption></figure>\n\n\n\n<p>There are multiple competing fonts. The runs of stitching are imprecise, and sometimes overlapping. There’s a weird wrinkly bit molded on the toe of one foot. The Peter Sagan brandmark, which has always looked a <em>little</em> bit fascist, is exponentially more sinister on this backdrop. </p>\n\n\n\n<p>You’ve got eyes. You don’t need me to tell you any of this. They’re awful. </p>\n\n\n\n<h2>Back down the rabbit hole</h2>\n\n\n\n<p>For four weeks, Peter Sagan has been watching me from the side of a pair of shoes perched above my desk monitor. Perhaps predictably, I haven’t been able to stop wondering about how we both ended up here. </p>\n\n\n\n<p>I’ve tagged Peter Sagan in the story on Twitter. I’ve tried to trace the shoe’s tracking information – with the only clue being a suggestion deep on the Luxpu website that they might have hailed from “FF-CHINA”. I’ve tried to find the shipping company. I’ve discovered that however my Bad Sagan Shoes got to me and wherever from, it was apparently via a US logistics company that forfeited its own trademark in 2012, and otherwise doesn’t seem to exist on the internet. </p>\n\n\n\n<p>Happily, the origins of Mikey’s shoes were, if anything, even more mysterious. </p>\n\n\n\n<p>His arrived in a blank white box with a Californian return address – neither of which was the case with mine, which were packaged simply in plastic bags and with no other identifying details.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Image-from-iOS-1-1340x1787.jpg\" /></figure>\n\n\n\n<p>Spectacularly for Mikey, Luxpu also sent him <em>completely the wrong size</em>. </p>\n\n\n\n<p>Here’s the kicker: because Mikey didn’t receive any confirmation of his purchase, he has no way of opening a dispute with the seller … if they were inclined to respond to emails, which I know from bitter experience they are not. </p>\n\n\n\n<p>It’s a classic Luxpu Catch-22. </p>\n\n\n\n<h2>A happy ending </h2>\n\n\n\n<p>Despite all of this, Mikey is inexplicably happy with how his Bad Sagan Shoe adventure turned out:</p>\n\n\n\n<figure><img src=\"https://lh4.googleusercontent.com/aSuWZITsQbddmf-uHxbwbiE1S5kWjWHX-vMBmkfd7UHB7aBbbEUQe7uFS4zq_oAfP--W8w18uVYI2Oj0xb5vtPx8QCF3HamQRAICpLPyUUlBKte8exQTcaP0dpMGOsCZWc3E3o9j\" /></figure>\n\n\n\n<p>Which leaves us in the strange situation of both having expensive, fake Peter Sagan-themed shoes that will definitely do our feet a mischief, while both being happy with how everything turned out. </p>\n\n\n\n<p>Mikey and I are bound forever by our adventures in online shopping, Luxpu will keep producing terrible products that plagiarise Peter Sagan’s intellectual property, and I got to write <a href=\"https://cyclingtips.com/2021/04/we-tried-to-get-scammed-by-peter-sagan/\" target=\"_blank\">my favourite story of the year</a>. </p>\n\n\n\n<p>To summarise: Flawless transaction, 10/10, would enthusiastically recommend this seller. </p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/one-final-twist-in-the-bad-sagan-shoe-saga/\">One final twist in the Bad Sagan Shoe saga</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"09065e18d126a9a365e2db49bcb0bf6cec510369f866507a85575617e358f6cb","category":"Cycling"}