{"title":"Intellectual Capital and Bank Stability in Saudi Arabia: Navi-gating the Dynamics in a Transforming Economy","link":"https://www.preprints.org/manuscript/202404.0862/v1","date":1712929547000,"content":"This research investigates the intricate dynamics between intellectual Capital (VAIC) and the stability of banks in the evolving context of Saudi Arabia's banking sector. Against the backdrop of rapid economic reforms under Vision 2030 and the challenges imposed by the COVID-19 pan-demic, the research provides a nuanced analysis of how intellectual capital and intellectual capital's components—Human Capital Efficiency (HCE), Structural Capital Efficiency (SCE), and Capital Employed Efficiency (CEE)—affect the financial stability of Saudi banks. The research analyses a decade-long panel dataset from 2012 to 2022, utilizing both fixed effects and cross-section random effects models to discern the impact of intellectual capital on bank stability. The findings reveal a positive overall influence of intellectual capital on bank stability; however, individual compo-nents present a complex relationship, with CEE showing a positive association and HCE and SCE demonstrating unexpected negative correlations with bank stability. The research identifies lev-erage (LEV) as a significant factor negatively impacting stability. Operational efficiency (OPEF) and size (SIZE) also negatively affect stability. Surprisingly, macroeconomic indicators and bank size exhibit non-significant effects on bank stability. Similarly, the direct impact of the COVID-19 pandemic was found to be non-significant, suggesting a resilient banking environment or the presence of effective mitigating strategies. \nAs Saudi Arabia continues its ambitious economic transformation, this research underscores the critical role of effectively managed intellectual capital in ensuring the banking sector's stability. It provides a foundation for ongoing research in this vital area.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0907545c832f084ca35102293e6a025d765c4f52f6bd7afcf36f34199d622463","category":"Interdisciplinary"}