{"title":"This may be the earliest evidence that Neanderthals hunted cave lions","link":"https://arstechnica.com/?p=1975358","date":1697643954000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/lion1CROP-800x534.jpg\" alt=\"Artist's depiction of Neanderthals after taking down a lion.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/lion1CROP.jpg\">Enlarge</a> <span>/</span> Artist's depiction of Neanderthals after taking down a lion. (credit: Julio Lacerda/NLD)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Neanderthal hunters living 48,000 years ago in what is now Germany killed a large cave lion in what might be the earliest example of lion hunting yet known, according to a <a href=\"https://www.nature.com/articles/s41598-023-42764-0#:~:text=We%20report%20new%20evidence%20of,predator%20kill%20in%20human%20history.\">recent paper</a> published in the journal Scientific Reports. Gabriele Russo of the University of Tubingen and co-authors based their conclusions on a close forensic analysis of a cave lion skeleton showing evidence of injury by a wooden spear. They also examined recently discovered cave lion claw bones showing evidence of having been skinned around 190,000 years ago.</p>\n<p>Now extinct, cave lions were apex predators, larger than today's mountain lions. They were frequently depicted in Paleolithic art, and their body parts were used as ornaments, according to the authors—part of a long-standing relationship between carnivores and hominids that shaped cultural behaviors. Although it's known that hominins have been interacting with lions since the animals first arrived in Europe, less is known about the relationships between carnivores and hominims like Neanderthals from earlier periods.</p>\n<p>Neanderthals were expert hunters known to kill bears and other carnivores, but evidence of them interacting with cave lions has remained scarce. A pair of lion fibula from the Middle Paleolithic found in eastern Iberia with cut marks indicates the lion was butchered, while other lion bones found in Southwestern France from the same period had cut marks indicative of skinning. This latest paper focused on a re-evaluation of a medium-sized male cave lion skeleton found at Siegsdorf, in Central Germany, in the 1980s.</p></div><p><a href=\"https://arstechnica.com/?p=1975358#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1975358&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"090db82b0fea6cfe7b7995a3c381ad1148d190580b1a708596638e2d32cf7cc4","category":"Tech"}