{"title":"Code Geass: Lelouch of the Re;surrection","link":"https://markpeak.net/code-geass-lelouch-of-the-resurrection/","date":1635578461000,"content":"<p>[spoiler alerted]</p>\n<p>ต้องยอมรับว่า <strong>Code Geass: Lelouch of the Rebellion</strong> เป็นการ์ตูนหุ่นยนต์ที่น่าจะสนุกที่สุดเท่าที่เคยดู ด้วยเหตุผลว่าเป็นเรื่องการเมืองระหว่างประเทศที่ซับซ้อน และการต่อสู้กันด้วยแทคติกการรบ (เพราะพระเอกบู๊ไม่เป็น) มากกว่าการขี่หุ่นปะทะกันในเชิงกายภาพเหมือนการ์ตูนเรื่องอื่นๆ</p>\n<p>ซีรีส์ Code Geass ทางทีวี 50 ตอน ฉายระหว่างปี 2006-2008 จบลงไปนานกว่าสิบปีแล้ว เนื้อเรื่องจบเคลียร์ไม่มีอะไรคาใจ ยกเว้นตอนจบสุดท้ายที่เราเห็น C.C. นั่งเกวียนแล้วมีผู้ชายอีกคนที่มองไม่เห็นหน้าว่าเป็นใคร ทิ้งให้แฟนๆ ถกเถียงกันว่าพระเอก Lelouch ตายหรือรอด</p>\n<p>เวลาผ่านมา 10 ปีกว่าๆ Sunrise ก็ทำภาคต่อเป็นหนังโรง 2 ชั่วโมงในชื่อว่า <strong>Code Geass: Lelouch of the Re;surrection</strong> ฉายเมื่อปี 2019 จากชื่อก็ชัดเจนในตัวว่า พระเอกรอด</p>\n<p>โจทย์ของหนังจึงเป็นว่าทำอย่างไรให้เนื้อเรื่องที่จบลงไปหมดแล้วในซีรีส์ ยังน่าสนใจต่อไปในภาคหนัง</p>\n<p>มีโอกาสได้ดูภาค Re;surrection ทาง Netflix ในฐานะแฟนๆ ก็ต้องยอมรับว่าดีใจที่ได้เห็นภาคต่อ แม้ลืมตัวละครรองๆ ไปเกือบหมดแล้วก็ตาม (ต้องนั่งระลึกชาติอยู่นานว่า คนนี้ใครนะ) และการเขียนบทภาคต่อของ Sunrise ก็ทำได้ดีทีเดียว</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/10/article01_01.jpg\" /></p>\n<p>เนื้อเรื่องของภาค Re;surrection เป็นเหตุการณ์ 2 ปีถัดมาต่อจากภาคทีวีซีรีส์ โลกหลังเหตุการณ์ Zero Requiem (จักรพรรดิ Lelouch สละชีวิตตัวเองเป็นคนร้ายให้ Zero ฆ่า) สงบสุขดี</p>\n<p>น้องสาวของพระเอกคือ Nunnally เป็นทูตสันติภาพไปเยือนหมู่บ้านคนอพยพที่ประเทศสมมติ Zilkhistan แถวเอเชียกลาง และมี Suzaku ในคราบ Zero ตามไปคุ้มครอง แต่กลับเจอการโจมตีจากกองทหารหุ่นยนต์ลึกลับ โดย Suzaku ที่น่าจะเป็นคนขับหุ่น Knightmare Frame ที่เก่งที่สุดในยุคสมัยกลับแพ้ เพราะหุ่นไม่ได้เตรียมอาวุธไปดีพอ และโดนศึกษาวิธีการเคลื่อนไหวอย่างละเอียด ทำให้สองคนถูกจับตัวไป</p>\n<p>ในอีกทาง C.C. ที่เดินทางไปทั่วโลกก็พาเอา Lelouch ที่ไร้ความทรงจำไปด้วย โดยอธิบายว่า Lelouch รอดมาจากเหตุการณ์ในภาคซีรีส์ แต่วิญญาณยังค้างอยู่ในโลกแห่ง C ทำให้ไร้ความทรงจำ แถมช่วงท้ายๆ ภาคซีรีส์นั้น Lelouch ดันใช้ Geass ฆ่าพระเจ้าในโลกวิญญาณไปแล้ว ทำให้ C.C. ไม่สามารถข้ามกลับไปโลกวิญญาณเพื่อนำวิญญาณของ Lelouch กลับมาได้ ทางเดียวที่ทำได้คือต้องไปตามหาประตูโลกวิญญาณที่ยังหลงเหลืออยู่</p>\n<p>ประตูที่ว่านั้นอยู่ใน Zilkhistan เพราะราชวงศ์ของประเทศนี้ก็มี Geass โดยเป็นสาขาย่อยขององค์กรที่ C.C. เคยสังกัดอยู่ และยังสืบทอดกันต่อมา เรื่องเฉลยว่าประเทศ Zilkhistan ส่งออกนักรบและอาวุธเป็นหลัก เมื่อโลกสงบสุขทำให้เศรษฐกิจฝืดเคือง พระราชินีซึ่งเป็นตัวร้ายของภาคนี้จึงต้องการตัว Nunnally ที่มีสายเลือดของ Lelouch เพื่อเปิดประตูสู่โลกวิญญาณ</p>\n<p>ฝ่ายจักรวรรดิ Britannia เลยส่งนักรบที่ประกอบด้วย Kallen และพวกมาชิงตัว Nunnally และ Suzaku กลับคืนแบบลับๆ เพื่อไม่ต้องให้เปิดสงครามเต็มขั้น เลยบังเอิญได้มาเจอกับ C.C./Lelouch ที่อยู่ใน Zilkhistan ด้วยเช่นกัน</p>\n<p></p>\n<p>ครึ่งแรกของเรื่องจึงเป็นการพยายามฟื้นฟูความจำของ Lelouch ในคุกใต้ดินของ Zilkhistan ที่มีประตูวิญญาณเก่าแก่ซ่อนอยู่ (ซึ่งย่อมต้องฟื้นฟูสำเร็จ) ส่วนครึ่งหลังของเรื่องคือคณะของ Lelouch ต้องพยายามชิงตัว Nunnally กลับคืนมา ด้วยปฏิบัติการลับทางทหาร ที่มีตัวละครเดิมๆ บางตัว (เช่น องค์หญิง Cornelia พี่ต่างแม่ของพระเอก) มาช่วยเหลือ</p>\n<p>ใน Code Geass ภาคซีรีส์เป็นสงครามขนาดใหญ่ระดับโลก ที่มหาอำนาจโลก (ญี่ปุ่น vs Britannia) ต่อสู้กันด้วยกองทหารขนาดใหญ่ แต่เมื่อสงครามสงบไปหมดแล้ว โจทย์ของภาคหนังจึงเป็นว่าทำอย่างไรที่การต่อสู้ในภาคนี้จึงน่าสนใจ เพราะศัตรูรายใหม่กระจอกกว่าเดิมมาก (ฮา)</p>\n<p>ภาคหนังทำได้ดีตรงที่บีบให้เป็นสงครามจำกัดวง เช่น ช่วงแรกฝ่ายพระเอกไม่มีหุ่นของตัวเอง ต้องขโมยมา หรือนักบินเทพๆ อย่าง Suzaku ก็ไม่เต็มร้อย เพราะบาดเจ็บตอนถูกจับขัง แม้ตอนหลังฝ่ายพระเอกมีคนมาช่วยเหลือบ้าง แต่ก็เป็นกองกำลังขนาดเล็กที่มีหุ่นเพียงไม่กี่ตัว ไม่ใช่กองทัพใหญ่ของ Britannia ที่ตามมาช่วยในภายหลัง</p>\n<p>อีกประเด็นที่ทำได้ดีคือ ตัวร้าย ราชินี Shamna ก็มี Geass ที่ทรงพลังคือรีเซ็ตเวลาได้เมื่อแพ้ (ข้อจำกัดคือรีเซ็ตได้ 6 ชั่วโมง) ทำให้กลายเป็นคู่ต่อสู้ที่สูสีกับ Lelouch เจ้าแทคติกที่สร้างความเป็นไปได้หลายทาง แม้สุดท้าย Lelouch ทุ่มเสี่ยงจาก 2 ตัวเลือกที่เหลืออยู่ จนประชิดตัว Shamna และเอาชนะได้ก็ตาม (ตรงนี้สนุกดี น่าเสียดายว่าหนังรวบรัดไปหน่อย ถ้าขยายเรื่องการสู้กันด้วยแทคติกระหว่าง 2 คนนี้จะสนุกกว่านี้อีกมาก)</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/10/img02.jpg\" /></p>\n<p>ข้อเสียของภาคนี้คือฉากบู๊เพราะไม่มีอะไรให้ต้องลุ้นมากนัก สองนักบินที่เก่งที่สุดทั้ง Suzaku และ Kallen ไม่มีคู่ต่อสู้ที่สูสี (แถมดูแล้วรำคาญเล็กน้อยว่าสู้อะไรกันนานจนเช้า) และตัวละครฝ่ายร้ายที่เพิ่มเข้ามาก็ไม่มีใครน่าสนใจ น่าดึงดูดเลยสักคน</p>\n<p>ฉากจบของเรื่องเป็นการตอบคำถามแฟนๆ เรื่องคู่จิ้น ว่าสุดท้ายแล้ว Lelouch เลือกไปอยู่กับ C.C. เอาชนะสาวๆ อีกหลายคนในเรื่อง (ซึ่งน่าสงสารเพราะผมเชียร์ Kallen) แถมยังเปลี่ยนชื่อตัวเองเป็น L.L. ให้เข้ากับ C.C. ด้วยอีกต่างหาก</p>\n<p>ดูจบแล้วอ่านบทวิจารณ์ในเน็ต มีคนบอกว่าตอนจบนั้น C.C. และ L.L. ผันตัวเองไปเป็นผู้ค้นหาและคัดเลือกคนที่เหมาะกับการมี Geass (คนที่ตายในตอนจบคือคนที่ไม่ผ่านเกณฑ์) ซึ่งถ้า Sunrise จะทำภาคต่อในจักรวาล Code Geass อีก ตัวเอกรุ่นหน้าก็คือคนที่ผ่านการปลูกฝัง Geass จากสองคนนี้ ซึ่งก็เป็นแนวทางที่เข้าท่าดี</p>\n<p>ในฐานะแฟนของซีรีส์ การได้ดูภาคต่อก็ถือเป็นเรื่องดีอยู่แล้ว แม้เนื้อเรื่องออกฝืนๆ ไปบ้างเพราะเรื่องในซีรีส์มันจบไปหมด ก็ถือว่าทำได้ดีกว่าที่หวังไว้ (แม้เนื้อเรื่องบางจุดในหนังมันยังฝืนๆ อยู่ดีแหละ)</p>The post <a href=\"https://markpeak.net/code-geass-lelouch-of-the-resurrection/\">Code Geass: Lelouch of the Re;surrection</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"0926d5ec2a8e2bce641b56bc3a293099a234a6c76af9332f3e87ce450e4bb8b3","category":"Thai"}