{"title":"Effect of salinity on growth, survival, haemato‐biochemical and antioxidative status of Anabas testudineus (Bloch, 1792) juveniles reared in inland saline water","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16149?af=R","date":1668758400000,"content":"<h2>Abstract</h2>\n<p>A 60-day feeding trial was conducted to evaluate the growth, survival, physio-metabolic and haemato-biochemical responses of <i>Anabas testudineus</i> reared in (ISW) of varying salinity. Fingerlings (initial weight 6.55 ± 0.08 g) were randomly stocked in triplicate in five treatment groups viz., T1 (0 ppt), T2 (3 ppt), T3 (6 ppt), T4 (9 ppt) and T5 (12 ppt) following a completely randomized design (CRD) with 40/m<sup>2</sup> stocking density. No mortality of fish was recorded in any of the treatments during the experimental period. Growth parameters such as weight gain (WG), percentage weight gain (PWG), specific growth rate (SGR) and protein efficiency ratio (PER) were highest (<i>p</i> &lt; 0.05) at 3 ppt salinity followed by 6 and 0 ppt and lowest at 9 and 12 ppt, respectively. Lowest (<i>p</i> &lt; 0.05) feed conversion ratio (FCR) and highest feed efficiency ratio (FER) were observed at 6 ppt salinity with no significant difference from fish at 0 and 3 ppt, respectively. Lowest (<i>p</i> &lt; 0.05) moisture and highest protein and lipid contents were recorded at 3 ppt salinity. Digestive enzyme (protease and amylase) and oxidative stress enzyme (superoxide dismutase, SOD and catalase, CAT) activities were significantly (<i>p</i> &lt; 0.05) higher in high saline groups (T4 and T5). Haemoglobin (Hb), haematocrit (Hct), erythrocytes and leukocytes were higher (<i>p</i> &lt; 0.05) up to 6 ppt (T3) and reduced thereafter. Highest (<i>p</i> &lt; 0.05) serum protein and globulin were recorded at 0 ppt salinity. T5 (12 ppt) group exhibited the highest (<i>p</i> &lt; 0.05) serum glucose, aspartate aminotransferase (AST) and alanine aminotransferase (ALT) activity. The present study concluded that <i>A</i>. <i>testudineus</i> can be reared in ISW within an acceptable range of 0–12 ppt salinity. However, salinity above 6 ppt had a negative effect on growth, feed utilization and various physiological parameters related to the well-being of the fish. Therefore, it can be opined that <i>A</i>. <i>testudineus</i> can be safely considered as a potential cultivable species for inland saline aquaculture up to a salinity of 6 ppt.</p>","author":"Subam Debroy, \nNarinder Kumar Chadha, \nSatya Prakash, \nParamita Banerjee Sawant, \nVungurala Harikrishna, \nMujahid A. Pathan, \nRamjanul Haque, \nPrasanta Jana, \nUdipta Roy","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"092ebb8d217ff283b601e0e60bf2bbb1cd013af5f6106c67c0920ccf3d2a1f8b","category":"Environment"}