{"title":"The Pink Hat Lady’s Path to Insurrection (Spoiler: Through Facebook)","link":"https://www.newyorker.com/news/news-desk/a-pennsylvania-mothers-path-to-insurrection-capitol-riot","date":1613185441000,"content":"\n<p>“Pink hat lady” was one of the most-noted rioters in the January 6 Capitol insurrection mob. The New Yorker’s Ronan Farrow identified her, and got her to speak for an extensive interview:</p>\n\n<blockquote>\n  <p>Before the pandemic, Rachel Powell, a forty-year-old mother of\neight from western Pennsylvania, sold cheese and yogurt at local\nfarmers’ markets and used Facebook mostly to discuss yoga, organic\nfood, and her children’s baseball games. But, last year, Powell\nbegan to post more frequently, embracing more extreme political\nviews. Her interests grew to include conspiracy theories about\ncovid-19 and the results of the Presidential election, filtered\nthrough such figures as Donald Trump, Rudy Giuliani, and the\nInfowars founder Alex Jones. On May 3, 2020, Powell wrote on\nFacebook, “One good thing about this whole CV crisis is that I\nsuddenly feel very patriotic.” Expressing outrage at the\nrestrictions that accompanied the pandemic, she wrote, “It isn’t\nto late to wake up, say no, and restore freedoms.” Several days\nlater, she posted a distraught seven-minute video, shot outside a\nlocal gym that had been closed. “Police need to see there’s people\nthat are citizens that are not afraid of you guys showing up in\nyour masks. We’re going to be here banded together, and we’re not\nafraid of you,” she said. “Maybe they should be a little bit\nafraid.”</p>\n\n<p>On January 6th, during the storming of the United States Capitol,\nPowell made good on that threat. Videos show her, wearing a pink\nhat and sunglasses, using a battering ram to smash a window and a\nbullhorn to issue orders. “People should probably coördinate\ntogether if you’re going to take this building,” she called out,\nleaning through a shattered window and addressing a group of\nrioters already inside. “We got another window to break to make\nin-and-out easy.”</p>\n</blockquote>\n\n<p>It’s a fascinating interview. But what jumps out, electrically, is the role Facebook clearly played in Powell’s radicalization.</p>\n\n<div>\n<a  title=\"Permanent link to ‘The Pink Hat Lady’s Path to Insurrection (Spoiler: Through Facebook)’\"  href=\"https://daringfireball.net/linked/2021/02/12/pink-hat-lady\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"093205cc17b2dcf417d10579e2414407bf882b14f8f5ca03daa692e2c847f778","category":"Tech"}