{"title":"Free long-chain fatty acids trigger early postembryonic development in starved <i>Caenorhabditis elegans</i> by suppressing mTORC1","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002841","date":1729605600000,"content":"<p>by Meiyu Ruan, Fan Xu, Na Li, Jing Yu, Fukang Teng, Jiawei Tang, Cheng Huang, Huanhu Zhu</p>\r\n\r\nPostembryonic development of animals has long been considered an internally predetermined program, while macronutrients were believed to be essential solely for providing biomatters and energy to support this process. However, in this study, by using a nematode <i>Caenorhabditis elegans</i> (abbreviated as <i>C</i>. <i>elegans</i> hereafter) model, we surprisingly discovered that dietary supplementation of palmitic acid alone, rather than other abundant essential nutrients such as glucose or amino acid mixture, was sufficient to initiate early postembryonic development even under complete macronutrient deprivation. Such a development was evidenced by changes in morphology, cellular markers in multiple tissues, behaviors, and the global transcription pattern and it occurred earlier than the well-known early L1 nutrient checkpoint. Mechanistically, palmitic acid did not function as a biomatter/energy provider, but rather as a ligand to activate the nuclear hormone receptor NHR-49/80, leading to the production of an unknown peroxisome-derived secretive hormone in the intestine. This hormonal signal was received by chemosensory neurons in the head, regulating the insulin-like neuropeptide secretion and its downstream nuclear receptor to orchestrate global development. Additionally, the nutrient-sensing hub mTORC1 played a negative role in this process. In conclusion, our data indicate that free fatty acids act as a primary nutrient signal to launch the early development in <i>C</i>. <i>elegans</i>, which suggests that specific nutrients, rather than the internal genetic program, serve as the first impetus for postembryonic development.","author":"Meiyu Ruan","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"0933de3039b66ce2992d1b8b72cea1bb9cb4348697ac74154d2496909c6854ac","category":"Environment"}