{"title":"Prosthetic Valve Endocarditis: A Retrospective Cohort Study Conducted at &ldquo;Dr. Carol Davila&rdquo; Central Military Emergency University Hospital in Bucharest","link":"https://www.preprints.org/manuscript/202406.1503/v1","date":1718959025000,"content":"Objective: Evaluation of patients with prosthetic valves who developed infective endocarditis by comparing treatment outcomes in both early- and late-onset IE episodes following prosthetic valve replacement surgery. This study sought to conduct a comprehensive assessment of the efficacy of these methodologies. The insights derived from this assessment will be utilized to enhance the quality of care for individuals with infective endocarditis who have received prosthetic valve replacement surgery.\nResults: During the period of investigation (January 2018 - December 2022), 78 patients diagnosed with infective endocarditis (IE) on prosthetic valve were admitted to the Infectious Diseases Department of the \"Dr. Carol Davila\" Central Military Emergency University Hospital in Bucharest. In 28 cases (35.8%), the onset of PVE occurred within 12 months of surgery (early onset), whereas in 50 patients (64.2%), the onset occurred more than 12 months after surgery (late onset). The mortality rate was 35.9% (53.6% among the early onset patients and 26% among the late-onset patients). Among patients who received surgical and medical therapy, the mortality rate was 29.6%, whereas among those who underwent only medical therapy, a 39.2% mortality rate was reported. According to the extracted data, antibiotic therapy was successful in 72.6% of patients. In contrast, a combination of surgical and drug-based approaches resulted in a cure in 76.1% of the patients. The most common etiological agent was Staphylococcus aureus (38.5%), followed by Enterococcus faecalis (26.9%), and Streptococcus mitis (10.3%). The mortality rate of patients with S. aureus was 29.2%, indicating the severity of this infectious agent.\nConclusions: Prosthetic valve endocarditis (PVE) is a serious condition associated with a high mortality rate both in the short and long term. Regardless of the therapy used, the risk of death remains high. All patients with PVE who survived received effective early treatment, highlighting the need for prophylactic measures.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0939c7655ad4318d4916947af21e519a83e05ac8aed205ef383400affacc5de9","category":"Interdisciplinary"}