{"title":"Cold mountain stream chironomids (Diptera) of the genus Diamesa indicate both historical and recent climate change","link":"https://academic.oup.com/ee/article/53/4/604/7692858?rss=1","date":1718236800000,"content":"<span><div>Abstract</div>Chironomids of the genus <span>Diamesa</span> (Meigen, 1835, Diptera: Chironomidae) inhabit cold, oxygen-rich running waters. We have investigated the presence of <span>Diamesa</span> and other freshwater macroinvertebrates at 22 stream sampling sites in 3 European high mountain regions (the Central Pyrenees, the Ötztal Alps, and the Tatra Mountains) to establish suitable temperature conditions for <span>Diamesa</span> dominance. It has been generally accepted that their high abundance was linked to the presence of glaciers; however, we have shown that in the Tatra Mountains, where there are no glaciers, the conditions for the dominance of <span>Diamesa</span> species are created due to permanent snowfields, the geographical orientation of the valley and shading by the surrounding high peaks. The historical connection of <span>Diamesa</span> to glaciers was investigated from the paleolimnological records of subfossil chironomid assemblages from the Bohemian Forest, where glaciers disappeared before or during the Late Glacial period.As expected, water temperature seems to be the main driver of <span>Diamesa</span> distribution, and we determined that the relative abundance of <span>Diamesa</span> species was significantly higher at the sites with a mean July water temperature below 6.5 °C. The <span>Diamesa</span>-dominated stream communities seems to be endangered due to ongoing climate warming and this assumption is supported by our paleolimnological results from the Bohemian Forest lakes, where <span>Diamesa</span> has disappeared due to warming of lake inflows at the beginning of the Holocene. These findings strengthen the former suggestions that some <span>Diamesa</span> species could be used as an indicator for tracking recent environmental changes in vulnerable ecosystems of cold mountain streams.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"093a64728f74d61d9465080d3f8402b4daeb639cd74b70cc1d65db8f2c0f6b5a","category":"Environment"}