{"title":"How to watch Paris-Roubaix 2023 | Global options for live TV, streaming and highlights","link":"https://www.bikeradar.com/news/how-to-watch-paris-roubaix/","date":1680418800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1137319291-f3045b8.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1137319291-f3045b8.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1137319291-f3045b8.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1137319291-f3045b8.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1137319291-f3045b8.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1137319291-f3045b8.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1137319291-f3045b8.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1137319291-f3045b8.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1137319291-f3045b8.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/GettyImages-1137319291-f3045b8.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"llustration picture shows the pack of riders in action on a cobblestone sector during the 117th edition of the 'Paris-Roubaix' one day cycling race, from Compiegne, near Paris to Roubaix, Sunday 14 April 2019.\" title=\"CYCLING PARIS ROUBAIX 2019\" />                                            <p>The women’s Paris-Roubaix rolls out on Saturday 8 April 2023, while the men’s race follows a day later on Easter Sunday, 9 April 2023. It’s the culmination of the cobbled Classics before the one-day racing heads to smoother ground for the Amstel Gold race, La Flèche Wallonne and Liège-Bastogne-Liège.</p>\n<p>The men’s Paris-Roubaix is notorious for its 29 cobbled secteurs spread over 256.6km, although these only start after almost 100km have been ridden and, despite its name, the race starts north of Paris in Compiègne. The women’s race starts in Denain, covers 145.4km, but still includes 17 cobbled secteurs.</p>\n<p>When it’s dry, as it has been for most of the recent races, the riders arrive for the ritual lap of the velodrome in Roubaix covered in dust; wet weather, as in 2021 when the race was rescheduled to October, swaps that for mud.</p>\n<p>The parcours is fairly flat so some riders, notably Lizzy Deignan, who won the <a href=\"https://www.bikeradar.com/features/pro-bike/lizzie-deignan-paris-roubaix-femmes/\">inaugural women’s race</a> in 2021, run single-ring groupsets to lower complexity and reduce the risk of mechanical issues.</p>\n<p>This year, the weather in northern France has been wet. With only a couple of weeks to dry out, we may see a rerun of some of the epic muddy editions of Paris-Roubaix.</p>\n<h2>Race schedule and favourites</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The women’s Paris-Roubaix route is 145.7km and includes 17 cobbled secteurs.</span></figcaption><span> <i>https://www.paris-roubaix-femmes.fr/</i></span></div>\n<p>Last year’s women’s Paris-Roubaix was won by Elisa Longo-Borghini of Trek-Segafredo – the team has won both editions of the women’s race to date.</p>\n<p>Longo-Borghini is a favourite to win again this year, although Lotte Kopecky of SD Worx looks to be in great form after already winning Omloop het Nieuwsblad and Danilith Nokere Koerse. She also secured a second place at Strade Bianche from a two-up sprint with teammate Demi Vollering.</p>\n<p>The women’s race starts at 1.35pm CET on Saturday 8 April with television coverage from 1.45pm CET and the first pavé secteur scheduled from 3.20pm CET.</p>\n<p>The scheduled earliest  finish is 5:23pm CET and the race will be contested by 24 teams: the 15 Women’s WorldTour teams, plus nine wildcards. The full list of teams and riders will be updated on the <a href=\"https://www.paris-roubaix-femmes.fr/en\" target=\"_blank\">race site</a>.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The men’s Paris-Roubaix route is 256.6km and starts in Compiègne.</span></figcaption><span> <i>paris-roubaix.fr</i></span></div>\n<p>Following years as a faithful domestique at Ineos Grenadiers, Dylan van Baarle won the men’s race in 2022.</p>\n<p>Van Baarle has now moved to Jumbo-Visma and with that team’s domination of the cobbled Classics, he could be a hot favourite for this year’s race too if he starts as team leader. However, he’s likely to be up against stiff competition from Mathieu van der Poel and Tadej Pogačar.</p>\n<p>The men’s race starts at 9.25am CET on Sunday 9 April, with television coverage from 9.40am CET and is scheduled to hit the first pavé secteur at around 1.30pm CET. The scheduled earliest finish time is 5.07pm CET. There will be 25 teams competing: the 18 <a href=\"https://www.bikeradar.com/features/pro-bike/worldtour-bikes/\">WorldTour teams</a> plus seven wildcards. The full list of teams and riders will be published <a href=\"https://www.paris-roubaix.fr/en\" target=\"_blank\">here</a>.</p>\n<h2>How can I watch Paris-Roubaix 2023 live in the UK?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Elisa Longo-Borghini won the 2022 Paris-Roubaix Femme.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<p><a href=\"https://www.eurosport.co.uk/watch/schedule.shtml\" target=\"_blank\">Eurosport</a> will show live coverage of the Paris-Roubaix 2023 women’s and men’s races and, as usual, there’s an on-demand option. Coverage times are to be confirmed.</p>\n<p>Eurosport is being merged with Discovery+, with a subscription costing £6.99 per month or £59.99 per year. It’s available on a range of platforms including tablets, mobile, TV with Chromecast or AirPlay, Android TV or Apple TV.</p>\n<p>You can also watch the Paris-Roubaix 2023 women’s and men’s races on <a href=\"https://welcome.globalcyclingnetwork.com/\" target=\"_blank\">GCN+</a>, with coverage times to be confirmed. A monthly subscription to GCN+ costs £6.99, the same as Discovery+; an annual subscription to GCN+ costs £39.99.</p>\n<h2>How can I watch Paris-Roubaix 2023 live in the US?</h2>\n<p>The racing is available on <a href=\"https://www.flobikes.com/events\" target=\"_blank\">Flobikes</a> in the US, both live and on demand, with a subscription costing $150 for the whole year, which will also give you access to a wide range of other races. Coverage starts at 9:15am EDT on Saturday for the women’s race and 5am EDT on Sunday for the men’s race.</p>\n<h2>How can I watch Paris-Roubaix 2023 live in Australia?</h2>\n<p><a href=\"https://www.sbs.com.au/sport/topic/cycling\" target=\"_blank\">SBS</a> will be covering the women’s and men’s racing live and on demand, while GCN+ will also have coverage of Paris-Roubaix 2023 for viewers in Australia. Scheduled times are to be announced.</p>\n<h2>How else can I watch Paris-Roubaix 2023?</h2>\n<p>There’s live terrestrial coverage in many European countries, with <a href=\"https://www.france.tv/chaines/\" target=\"_blank\">france.tv</a> showing the race live and on demand on France 3, times TBA. If you have a VPN, you may be able to sign in to watch.</p>\n<h2>How can I watch Paris-Roubaix 2023 if I can’t watch live coverage?</h2>\n<p><a href=\"https://www.youtube.com/results?search_query=paris-roubaix\" target=\"_blank\">YouTube</a> is a good option if you want shorter highlights and you don’t have on-demand access to any of the above sources. It’s also a good source for highlights of previous editions to get you geared up for the racing.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"093c2d97422e1ab86dea58304fff7b53613f3b28c48dc741826c913c7b4755e6","category":"Cycling"}