{"title":"153 Use of probiotics in feedlot diets","link":"https://academic.oup.com/jas/article/102/Supplement_3/392/7757350?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The Food and Agricultural Organization of the United Nations and World Health Organization classifies probiotics as live microorganisms that have health benefits when fed to animals. While the original purpose of probiotic use in beef cattle was to enhance rumen health and to establish a healthy gastrointestinal tract microflora in young calves, probiotic use in finishing cattle has been steadily increasing. The reason for this increase in use of probiotics in feedlot cattle diets is primarily due to public health concern with antimicrobial resistance from the use of antimicrobial technologies in feedlot cattle diets to improve performance and reduce the incidence of disease. Feedlot cattle consuming high concentrate diets for extended periods of time can experience shifts in rumen microflora that may be detrimental to rumen health which can impact overall animal performance. There are several different strains of probiotics (e.g., lactic acid producing, lactic acid utilizing bacteria,) that can function to optimize the microbial populations within the gastrointestinal tract to improve gut health. With improved gut health, improvements in nutrient digestion, absorption, immune function, and barrier function are possible. Several recent experiments supplementing feedlot cattle with probiotics have reported improved ADF digestibility, increased ruminal pH, improved ruminal lactic acid clearance, inhibited <span>C. perfringens</span> Types A and C growth in vitro, increased red blood cell superoxide dismutase activity, and improved average daily gains during certain portions of the feeding period. However, other probiotic supplementation experiments have not observed improvements in growth and health responses in feedlot cattle. The reason for the discrepancies between the experiments may be due to differences in animal production scenarios, the ingredient and nutrient composition of the basal diet, dosage of the probiotic, and the bacterial composition of the probiotic. Future research investigating the impact of individual strains of probiotics and combinations of different probiotic bacteria is warranted.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"09413fda7c162468e0fa5d46f9a3a392e6cd49c1cf7ae4a4eeb56df9468ffe16","category":"Environment"}