{"title":"Two‐Decadal Variability of Lacustrine Groundwater Discharge: Coupled Controls From Weather and Hydrologic Changes","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037173?af=R","date":1727419112000,"content":"<h2>Abstract</h2>\n<p>Lacustrine groundwater discharge (LGD) is a vital water and solute source for lakes. However, the understanding of the long-term temporal variability of LGD remains limited owing to insufficient insights into driving mechanisms, such as climatic and hydrologic changes. In this study, we examined the oxbow lake group in the central Yangtze River (YR) and assessed the LGD rates from 2000 to 2022 using <sup>222</sup>Rn combined with meteorological and hydrological data. The findings revealed that groundwater was recharged during the wet season and discharged to the lakes during the dry season. We established a mathematical model to link the LGD rates to the meteorological and hydrological factors of the lakes, which accounted for 98.70% of the LGD rate variance. Using a predictive model combined with meteorological and hydrological data to assess the LGD rate over the past two decades, it was found that in wet years with higher precipitation and higher average YR water levels, the LGD rate was higher. The gradual increase in precipitation during the rising water and wet seasons, along with a slow rise in the YR water levels, will cause the LGD rate to exhibit a slightly increasing trend with fluctuations in the future. This study proposed an innovative approach to investigate the long-term temporal variation in LGD and identify the weather and hydrological influences on LGD.</p>","author":"Xiaoliang Sun, \nYao Du, \nJing Wu, \nJiawen Xu, \nHao Tian, \nYamin Deng, \nYiqun Gan, \nYanxin Wang","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"0948912941ddb15bdb2813136015c14d3ea604c4b5d7597063058218712d6957","category":"Environment"}