{"title":"Interactions of Logjams, Channel Dynamics, and Geomorphic Heterogeneity Within a River Corridor","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036512?af=R","date":1718433286000,"content":"<h2>Abstract</h2>\n<p>Natural rivers are inherently dynamic. Spatial and temporal variations in water, sediment, and wood fluxes both cause and respond to an increase in geomorphic heterogeneity within the river corridor. We analyze 16 two-km river corridor segments of the Swan River in Montana, USA to examine relationships between logjams (distribution density, count, and persistence), channel dynamism (total sinuosity and average channel migration), and geomorphic heterogeneity (patch density) in the river corridor. We hypothesize that (a) more dynamic river segments correlate with a greater presence, persistence, and distribution of logjams; (b) higher annual peak discharges correspond with greater channel dynamism and logjam presence and distribution; and (c) greater logjam distribution densities and channel dynamism are predictive of more spatially heterogeneous sections of the river corridor. Our results suggest that, first, decadal-scale channel dynamism, as reflected in total sinuosity, corresponds to greater numbers of logjams and greater persistence of logjams through time. Second, higher peak discharges correspond to greater presence and distribution of logjams, but not to greater channel dynamism. Third, greater geomorphic heterogeneity in the river corridor, as reflected in the spatial distribution of landscape patch density, is explained by greater logjam distribution density, total sinuosity, and proportions of beaver meadows. Our results reflect the complex interactions of water, sediment, and wood in river corridors; the difficulties of interpreting causal relationships among these variables through time; and the importance of spatial and temporal analyses of past and present river processes to understand future river conditions.</p>","author":"Anna Marshall, \nEllen Wohl, \nEmily Iskin, \nLucas Zeller","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"094d71fbf35bfe6fd48cc65c031c2d379a85edabb6af3ac55f7e32cd43c0265b","category":"Environment"}