{"title":"Survey of antimicrobial and probiotic use practices in wildlife rehabilitation in the United States","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308261","date":1722520800000,"content":"<p>by Elizabeth A. Miller, Rachel Amato, Julia B. Ponder, Irene Bueno</p>\r\n\r\nAntimicrobial resistance is a global health concern. As such, there have been increased efforts to monitor and standardize antimicrobial prescribing practices in humans and domestic animals. In contrast, there is relatively little known about specific prescribing practices in wild animals despite the wide use of antimicrobials and other microbial interventions, such as probiotics to treat captive wildlife. Therefore, the goal of this study was to examine current antimicrobial and probiotic use from a cross-section of wildlife rehabilitation facilities in the United States. An anonymous electronic survey was sent to 105 United States permitted wildlife facilities to collect information about admissions, current antimicrobial and probiotic use practices, and current staff knowledge and attitudes surrounding antimicrobial resistance and probiotic effectiveness. Respondents from over 50% of facilities participated in the survey (54/105), including 45 facilities that treated birds. All facilities reported using antimicrobials, including some from groups considered critically important for human medicine, for a wide range of medical conditions and prophylaxis. Among antibiotics, enrofloxacin and amoxicillin-clavulanic acid were the most commonly used. Antifungals were not as widespread, but itraconazole was the most commonly used. Over 75% of respondents said that their facilities would benefit from having standardized antimicrobial guidelines in place. Probiotics were also used in more than 50% of facilities, but there was notable disparity in opinions regarding their efficacy. The results of this survey are a first step towards understanding antimicrobial and probiotic use practices in the treatment of captive wildlife and developing an antimicrobial stewardship program for wildlife rehabilitation.","author":"Elizabeth A. Miller","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"09597b2b9f1be48a44160d6e02d95fc341134cb5c3b810e3385ebf662d02b11f","category":"Interdisciplinary"}