{"title":"'Categorically Terrible,' and Other Early Reactions to Apple's New FineWoven Accessories","link":"https://www.macrumors.com/2023/09/21/apples-finewoven-iphone-cases-poor-reviews/","date":1695290324000,"content":"Apple has <a href=\"https://www.macrumors.com/2023/09/12/apple-announces-finewoven/\">stopped selling leather accessories</a>, and the company claims its \"FineWoven\" range of iPhone cases and accessories are overall more environmentally friendly. But in the court of public opinion, early reactions to Apple's alternative material choice appear to be trending towards the negative end of the spectrum.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/finewoven-case-the-verge.jpg\" alt width=\"1440\" height=\"960\" /><div><em>Image credit: Nilay Patel of <em>The Verge</em></em></div>\r<br />\nApple calls the new fabric option a \"luxurious and durable microtwill,\" and has priced FineWoven iPhone cases at $59, MagSafe Wallets at $59, AirTag holders at $35, and Apple Watch bands at $99.\r<br />\n\r<br />\nThe quality of the iPhone cases in particular seems to have riled some customers, with several <em>MacRumors</em> forum members stating they have returned the cases. \"After holding it in person\", said poster <a href=\"https://forums.macrumors.com/threads/returned-my-finewoven.2403255/\">inducecurrent</a>, \"it feels more like a $10 cheapo case from Amazon rather than Apple-quality, especially at this price point.\"\r<br />\n\r<br />\n\"Received and returned,\" said <a href=\"https://forums.macrumors.com/threads/finewoven-case-is-disappointing.2403253/post-32507989\">another forum member</a>. \"Felt cheap almost like cardboard.\" <a href=\"https://forums.macrumors.com/threads/finewoven-case-is-disappointing.2403253/post-32507999\">EvanEiga</a> replied: \"The case itself is nice IMO, but I'm not sure if the premium cost is worth it. Leather cases felt so much nicer. I am all for mother nature but when it comes to bang for the buck, FineWoven case is just subpar.\" Most respondents to a <a href=\"https://forums.macrumors.com/threads/finewoven-wear-tear-aging.2402559/\"><em>MacRumors</em> forum poll</a> thus far seemed to agree.\r<br />\n\r<br />\nPositive customer reactions are just as hard to find on Twitter (X). \"I've been using Apple's cases for my phones since the iPhone 7,\" said X user <a href=\"https://twitter.com/eggbutspam/status/1704183389811560809\">@eggbutspam</a>, \"but I've never returned a case so fast like I did with the FineWoven case I preordered last Friday. FineWoven looks like absolute trash.\" \r<br />\n\r<br />\n\"Just got mine in the mail,\" reported <a href=\"https://www.reddit.com/r/apple/comments/16ns7ol/comment/k1gwki8/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3\">one Reddit user</a>. \"It's basically like a polyester pillowcase sandwiched in a plastic shell. I don't hate it, but $60 is kind of insulting.\" \r<br />\n\r<br />\n\"Same here,\" replied <a href=\"https://www.reddit.com/r/apple/comments/16ns7ol/comment/k1h2yf0/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3\">another Redditor</a>. \"The material looks and feels pretty nice, although it's 0% like leather or suede and definitely not worth $60.\"\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/finewoven-bands-2023.jpg\" alt width=\"1996\" height=\"848\" />\r<br />\nPerhaps the most vehement criticism has come from <em><a href=\"https://www.theverge.com/2023/9/20/23882255/apple-iphone-15-finewoven-case-wallet-bad\">The Verge</a></em>'s Alison Johnson, who called the new iPhone cases \"<em>really</em> bad\" and described Apple's FineWoven accessory line in general as \"categorically terrible.\"\r<br />\n<blockquote>When I popped the MagSafe wallet out of its box, I could clearly see some places where it was already showing wear along the edges. Little bits of lint immediately caught on the fabric, too. And then there’s the fingernail test.\r<br />\n\r<br />\n...When you scratch FineWoven, the results are seemingly permanent. When we first inspected the cases after picking them up at Apple Park, Verge editor-in-chief Nilay Patel picked one up and ran his fingernails across it five times — and that was all it took to leave a trail of indelible scuffs on the fabric. The scratches are still there a week later, no matter how many times I've tried \"buffing\" it out by rubbing my finger over it.</blockquote>With many iPhone 15 and Apple Watch Series 9 customers yet to pick up their FineWoven accessories, it's too early to conclude that these early adopter opinions reflect a broad consensus, but so far it has not been the best advert for Apple's new FineWoven accessory range. Have you bought one of the new cases or bands? Let us know what you think of them in the comments.<div>Tags: <a href=\"https://www.macrumors.com/guide/theverge-com/\">The Verge</a>, <a href=\"https://www.macrumors.com/guide/finewoven/\">FineWoven</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/21/apples-finewoven-iphone-cases-poor-reviews/\">'Categorically Terrible,' and Other Early Reactions to Apple's New FineWoven Accessories</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/categorically-terrible-and-other-early-reactions-to-apples-new-finewoven-accessories.2403610/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"095e9d17cefec39226eb40371066eafc093f46baac51890506489950de1f81e8","category":"Apple"}