{"title":"Postmanufacturing techniques for mitigation of viral pathogens in porcine-derived feed ingredients: a review","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae009/7578359?rss=1","date":1705622400000,"content":"<span><div>Abstract</div>African swine fever virus (ASFV) is a highly infectious virus known to cause substantial mortality and morbidity in pigs. The transmissibility and severity of disease within pigs, as well as the potentially resultant catastrophic trade ramifications, warrant its status as a foreign animal disease of substantial concern to the United States. The ASFV virus can survive for extended periods of time outside its host, and its greatest concentration is often observed in blood and organs, products that are frequently used as raw materials to manufacture porcine-derived ingredients fed to animals in the United States. Unlike ruminant-based proteins that cannot be fed to ruminant animals, it is permissible to feed porcine-derived ingredients to pigs in the United States. However, the increased threat of ASFV entry into the United States and our evolving understanding of viral transmission by feedstuffs warrant further investigation into this practice. The objectives of this review are to describe the current knowledge of ASFV survival in raw materials used to produce porcine-based ingredients, identify priorities for future research, and summarize potential options for managing risk until additional knowledge can be gained. While limited data is available for ASFV-specific mitigation, the temperatures used in both spray-drying and rendering have proven to effectively reduce viral concentrations of multiple swine viruses below detectable limits. However, some of these procedures may not eliminate the risk of recontamination, which necessitates the need for additional prevention or mitigation measures. Most published research in this area relies on direct inoculation of raw ingredient, not the finished porcine-derived ingredient. Currently, three published studies report ASFV mitigation in either thermally processed conditions (&gt;40 °C) or ingredient quarantine (&lt;40 °C). Virus inactivation, or the reduction of viral concentrations below detectable levels, was observed in the thermally processed study and one of the two ingredient quarantine studies. In conclusion, there is little knowledge to eliminate the risk of recontamination in porcine-derived ingredients; therefore, future research should aim to support and validate the currently available literature for the continued and safe production of porcine-derived ingredients in the event of a foreign animal disease outbreak.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"0962511b5fcc293fa72972b050a9d9ec3b6c5c106f6cd15484feb9843cbc1b84","category":"Environment"}