{"title":"Bacillus paralicheniformis 809 and Bacillus subtilis 810 support in vitro intestinal integrity under hydrogen peroxide and deoxynivalenol challenges","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae061/7645328?rss=1","date":1712966400000,"content":"<span><div>Abstract</div>We designed and conducted two in vitro experiments to evaluate the effects of two <span>Bacillus</span> spp. probiotics on gut barrier integrity using the transepithelial electrical resistance (<strong>TEER</strong>) assay under two different challenge models. In Exp. 1, intestinal epithelial cells received or not (<strong>CON</strong>) <span>B. paralicheniformis</span> 809 (<strong>BLI</strong>) or <span>B. subtilis</span> 810 (<strong>BSU</strong>) at a rate of 1 × 10<sup>8</sup> colony forming units (<strong>CFU</strong>)/transwell. Two hours after treatment application (CON, BLI, or BSU), 5 mM of the reactive oxygen species hydrogen peroxide, mimicking mucosal oxidative stress, was added alone (<strong>HYP</strong>) or with each of the <span>Bacillus</span> spp. (HYP + BLI or HYP + BSU). In Exp. 2, cells were assigned to the same treatments as in Exp. 1 (CON, BLI, and BSU), or mycotoxin deoxynivalenol (<strong>DON</strong>), which was added alone or in combination with BLI or BSU, resulting in another two treatments (DON + BLI and DON + BSU). Transepithelial electrical resistance was measured for 14 h postchallenge. In Exp. 1, a treatment × hour interaction was observed for TEER (<span>P</span> &lt; 0.0001). Adding BLI and BSU resulted in greater TEER values vs. CON for most of the experimental period (<span>P</span> &lt; 0.02), whereas HYP reduced mean TEER and area under the curve (<strong>AUC</strong>), while increasing the amount of sugar that translocated through the monolayer cells (<span>P</span> &lt; 0.001). A treatment × hour interaction was also observed in Exp. 2 (<span>P</span> &lt; 0.0001), as DON led to an immediate and acute drop in TEER that lasted until the end of the experimental period (<span>P</span> &lt; 0.0001). Both BLI and BSU alleviated the DON-induced damaging effects on the integrity of intestinal epithelial cells, whereas both <span>Bacillus</span> spp. alleviated the damage caused by DON alone and the proportion of sugar that translocated through the monolayer cells was not different between CON and DON + BLI (<span>P</span> = 0.14) and DON + BLI and DON + BSU (<span>P</span> = 0.62). In summary, both <span>Bacillus</span> spp. strains (<span>B. paralicheniformis</span> 809 and <span>B. subtilis</span> 810) were able to counteract the damaging effects of the challenge agents, hydrogen peroxide and deoxynivalenol, on gut barrier integrity.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"0962f1c503c83088fc63b83af88deaed1b715fd611fa390e6585c4b155478161","category":"Environment"}