{"title":"Judge forces Apple to make major App Store changes within weeks","link":"https://www.macworld.com/article/551203/apple-epic-anti-steering-app-store-external-payments.html","date":1636558788000,"content":"<div>\n<section><div></div></section><p>While the <a href=\"https://www.macworld.com/article/357268/epic-v-apple-judge-rules-apple-must-allow-apps-to-offer-other-payment-methods.html\">Epic-Apple court battle</a> is sure to continue for years thanks to appeals, Apple might have to implement a major change long before the case is settled. After the judge in the case denied the company’s motion for a stay over <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.documentcloud.org/documents/21060631-apple-epic-judgement&amp;xcust=1-1-551203-1-0-0&amp;sref=https://www.macworld.com/feed\">a ruling targeting</a> its so-called “anti-steering policies,” Apple may need to scramble to bring “live links” to outside payment sites by December 9.</p>\n\n\n\n<p>In the order, Judge Yvonne Gonzalez Rogers said Apple’s motion, which sought to delay the ruling until the conclusion of the appeal, “is based on a selective reading of this Court’s findings and ignores all of the findings which supported the injunction.” She ordered that Apple comply with the injunction as written.</p>\n\n\n\n<p>Apple <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reuters.com/legal/litigation/apple-asks-judge-pause-epic-games-antitrust-orders-it-appeals-ruling-2021-10-08/&amp;xcust=1-1-551203-1-0-0&amp;sref=https://www.macworld.com/feed\">argued that the stay</a> would give the company time “to protect consumers and safeguard its platform while the company works through the complex and rapidly evolving legal, technological, economic issues.” Furthermore, Apple attorney Mark Perry said the “exceedingly complicated” rule change will “harm” consumers and developers and will “take months to figure out the engineering, economic, business, and other issues.” </p>\n\n\n\n<p>In her ruling, Judge Gonzalez Rogers flatly said Apple “has provided no credible reason for the Court to believe that the injunction would cause the professed devastation.”</p>\n\n\n\n<p>In August, <a href=\"https://www.macworld.com/article/354272/apple-allows-developers-to-promote-outside-payments-in-softening-of-app-store-terms.html\">Apple rolled out several changes to its App Store terms</a>, including the ability for developers to promote outside payment methods to its customers. However, it has <a href=\"https://www.macworld.com/article/354291/developers-arent-impressed-with-apples-app-store-changes.html\">stopped short</a> of making any meaningful in-app changes to the way purchases are made.</p>\n\n\n\n<p>Apple plans to appeal the ruling and “believes no additional business changes should be required to take effect until all appeals in this case are resolved.” If that appeal is denied, the changes are due to be implemented by December 9.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"096937a3f9a4d7b3bad263aa2e55aea3cfffa22202655ef3bb44cf8234b5dbb7","category":"Apple"}