{"title":"Elisa Longo Borghini: ‘We have a strong team and Paris-Roubaix is a race where things can quickly change and happen’","link":"https://www.cyclingtips.com/2023/04/elisa-longo-borghini-we-have-a-strong-team-and-paris-roubaix-is-a-race-where-things-can-quickly-change-and-happen/","date":1680801731000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1391808527-1.jpg?width=1200\" alt=\"Elisa Longo Borghini: 'We have a strong team and Paris-Roubaix is a race where things can quickly change and happen'\" /></figure><p><span>Team SD Worx may have dominated recent races, but for Paris Roubaix Femmes all eyes are on Trek-Segafredo to continue their winning streak.</span></p>\n<p><span> There is every chance that the team can pull off a ‘third time lucky’ result at the Roubaix race, but defending champion and third place at last week’s Tour of Flanders Elisa Longo Borghini was playing down her own chances on Thursday ahead of the race. </span></p>\n<p><span>Longo Borghini had a strong start to the season, taking an emphatic overall victory at the UAE Tour Women after a commanding display on Jebel Hafeet alongside teammate Gaia Realini, but the 31-year-old tested positive for Covid-19 after Omloop Het Nieuwsblad and continued to return positive results for 15 days. </span></p>\n<p><span>It took another few weeks before the Italian could return to racing at Dwars door Vlaanderen where, despite her hiatus from training and racing, she was active right into the latter stages of the race. She continued that form at Flanders last weekend, eventually securing third place in a sprint behind the lone winner, Lotte Kopecky.  </span></p>\n<p><span>“Surely I was not thinking about being on the podium last Sunday,” Longo Borghini said to media on Thursday. “It was something really special and unexpected for me and I was kind of emotional after the race because after the Covid and after being so long positive and only having base training I would never, ever expected to be on the podium in Oudenaarde.”</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1479105434-1-1340x894.jpg?width=730\" alt width=\"1340\" height=\"894\" /><figcaption><span>OUDENAARDE, BELGIUM – APRIL 02: (L-R) Katarzyna Niewiadoma of Poland and Team Canyon//SRAM Racing, Demi Vollering of The Netherlands and Team SD Worx (celebration), Elisa Longo Borghini of Italy and Team Trek-Segafredo and Silvia Persico of Italy and UAE Team ADQ sprint at finish line during the 20th Ronde van Vlaanderen – Tour des Flandres 2023, Women’s Elite a 156.6km one day race from Oudenaarde to Oudenaarde / #UCIWWT / on April 02, 2023 in Oudenaarde, Belgium. (Photo by Tim de Waele/Getty Images)</span></figcaption></figure>\n<p><span>However, despite her emphatic comeback, Longo Borghini insists that she cannot rely on her form going into Saturday’s race. </span></p>\n<p><span>“I’m very happy about it and I’m looking forward to Saturday’s race, but my expectations are still really low. I don’t want to make it up too much because I basically don’t know where I am standing right now. I will start and I will try to enjoy my number one,” she said. </span></p>\n<p><span>“I still have some problems in recovering from the races and I still feel that I’m not on my normal level. I don’t know how to explain. Covid is such a weird illness that I still feel a little bit more fatigued than I should be after some training or races. So I’m just trying to get back to my normal level and then focusing ahead and looking forward to all the other racing that is waiting for me.”</span></p>\n<p><span>Still, going into the race as defending champion “means a lot to me to be honest,” Longo Borghini continued. “Yesterday we were doing the recon and I also recognized the place where I attacked. So it was pretty special. And I had a smile on my face during the recon and especially entering the Roubaix Velodrome. I will try to take this joy into the race before all the hell happens. So it’s always a little bit more of motivation and then I will try to do a good race with my team and teammates and we will try our best.” </span></p>\n<p><span>Despite her enforced break from racing, the former Italian champion came back into the peloton with purpose. Watching other riders and teams acquiesce to SD Worx and their dominance over recent months, Longo Borghini’s frustration grew. </span></p>\n<p><span>“I respect SD Worx and I recognize their strength and the fact that they have really, really strong riders. But I don’t like the fact that every time there is an SD Worx [rider] to the front it seems like the entire peloton just gives up,” she said. </span></p>\n<p><span>“I was watching television for a long time [with Covid] and in many situations they could have easily closed the gap … Okay not easily but you know, they had numbers for sure. And they didn’t do that because they were scared because [Lorena] Wiebes maybe was in the peloton or second group and they didn’t want her to win the race and they were happy with second. But our team, this is not our politics. We try our best to just win the race.” </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1477829471-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>WAREGEM, BELGIUM – MARCH 29: (L-R) Elisa Longo Borghini of Italy and Team Trek – Segafredo, Laura Tomasi of Italy and UAE Team Adq, Vittoria Guazzini of Italy and Team FDJ-Suez, Noemi Rüegg of Switzerland and Team Jumbo-Visma compete during the 11th Dwars door Vlaanderen 2023 – Women’s Elite a 114.9km ine day race from Waregem to Waregem / #DDV23 / on March 29, 2023 in Waregem, Belgium. (Photo by Luc Claessen/Getty Images)</span></figcaption></figure>\n<p><span>Indeed, Trek-Segafredo is one of few teams who have taken SD Worx on recently, riding as a team to try and pull back moves from the Dutch squad. </span></p>\n<p><span>“I would really like to see all the teams thinking the same as us because then the races would get much more exciting,” Longo Borghini said. </span></p>\n<p><span>“I’m not saying that they are not exciting enough. But then you know, for example in Flanders: If we would have caught Kopecky then Vollering would have had an amazing attack and then the race would even be much more exciting. I have nothing against SD Worx at all, they play a very good tactic. They win everything so they are the strongest at the moment, but I’m also saying that we could also be a bit better sometimes in chasing.” </span></p>\n<p><span>Asked why she thought other teams were reluctant to fight SD Worx, the Italian countered: “I don’t know, I don’t think I’m the right person to ask this because I’m the one that is chasing actually, we should go and ask this to the ones that are not doing that.” </span></p>\n<p><span>While SD Worx is the team to beat at the moment, the defending champion insists that Trek Segafredo will focus on their own tactics on Saturday, riding out the chaos as it unfolds.</span></p>\n<p><span>“Lotte Kopecky is surely outstanding, yes. For me she’s in a brilliant shape. But I also think that we have a strong team and Paris-Roubaix is such a race where things can quickly change and happen. We just start with our plan and we follow it and then we try to get home a good result. We don’t have always to look at the others.”</span></p>\n<p><span>The conditions at the race are set to be very different to those of a year ago. The dry, dusty cobbles over which Longo Borghini rode to the win are likely to be slick and mud-coated, although not to the extreme of the inaugural edition won by Lizzie Deignan. It is terrain that favors Trek’s cyclocross stars Lucinda Brand and Shirin van Anrooj. </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1479113142-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>OUDENAARDE, BELGIUM – APRIL 02: (L-R) The race winner Lotte Kopecky of Belgium and Team SD Worx and third classified Elisa Longo Borghini of Italy and Team Trek-Segafredo congratulate each other at podium in the 20th Ronde van Vlaanderen – Tour des Flandres 2023, Women’s Elite a 156.6km one day race from Oudenaarde to Oudenaarde / #UCIWWT / on April 02, 2023 in Oudenaarde, Belgium. (Photo by Tim de Waele/Getty Images)</span></figcaption></figure>\n<p><span>“Lucinda is really strong on the cobbles especially if they are wet and muddy. So surely she will be up in the classification in my opinion, and she will be on top of stuff when things happen,” Longo Borghini said. </span></p>\n<p><span>“I think it’s going to be a very muddy race because it has rained today. It will rain a little bit tomorrow, and he’s going to be cloudy on Saturday. So I don’t know. Some of the sectors will be dry, but some not in my opinion. For example, Mons en Pévèle probably will be really muddy. It was already really muddy yesterday. So it’s going to be a tough race because of this and we have just to pray for the best.”</span></p>\n<p><span>It’s not all just a wing and a prayer, though. Longo Borghini said that Trek-Segafredo’ director Ina Teutenberg “is really organized and she has a very good plan A,B,C already from a long time I can tell you.”</span></p>\n<p><span>“Surely we have a very strong team but as I said, Roubaix is so unpredictable that all of a sudden maybe you find yourself lost without your leader for example, and then you need to quickly change plan. So I think in Roubaix you make the difference if you have a really good plan, A, a really good plan B and a really good plan C. That’s the main thing. And you have to embrace the chaos.” </span></p>\n<p><span>“Every year is different, every year there are many more competitors and this year is another year and another story, another race.”</span></p>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"097fb03a2a04c696f081db72c4824751c56bf984cb79219e6042e49b626ff431","category":"Cycling"}