{"title":"Cytoskeleton remodeling: a central player in plant–fungus interactions","link":"https://academic.oup.com/jxb/article/75/11/3269/7643923?rss=1","date":1712793600000,"content":"<span><div>Abstract</div>The eukaryotic cytoskeleton is a complex scaffold consisting of actin filaments, intermediate filaments, and microtubules. Although fungi and plants lack intermediate filaments, their dynamic structural network of actin filaments and microtubules regulates cell shape, division, polarity, and vesicular trafficking. However, the specialized functions of the cytoskeleton during plant–fungus interactions remain elusive. Recent reports demonstrate that the plant cytoskeleton responds to signal cues and pathogen invasion through remodeling, thereby coordinating immune receptor trafficking, membrane microdomain formation, aggregation of organelles, and transport of defense compounds. Emerging evidence also suggests that cytoskeleton remodeling further regulates host immunity by triggering salicylic acid signaling, reactive oxygen species generation, and pathogenesis-related gene expression. During host invasion, fungi undergo systematic cytoskeleton remodeling, which is crucial for successful host penetration and colonization. Furthermore, phytohormones act as an essential regulator of plant cytoskeleton dynamics and are frequently targeted by fungal effectors to disrupt the host’s growth–defense balance. This review discusses recent advances in the understanding of cytoskeleton dynamics during plant–fungus interactions and provides novel insights into the relationship between phytohormones and cytoskeleton remodeling upon pathogen attack. We also highlight the importance of fungal cytoskeleton rearrangements during host colonization and suggest directions for future investigations in this field.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"097fe7c0793f73b23c1ec903efdf7820c9b0e30704acb12abc0e610e3aeb03a1","category":"Environment"}