{"title":"Sodium arsenite impairs sperm quality via downregulating the ZMYND15 and ZMYND10","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24327?af=R","date":1716792223000,"content":"<h2>Abstract</h2>\n<p>Zinc finger MYND-type containing 15 (ZMYND15) has been documented to play important roles in spermatogenesis, and mutants contribute to recessive azoospermia, severe oligozoospermia, non-obstructive azoospermia, teratozoospermia, even male infertility. ZMYND10 is involved in sperm motility. Whether environmental pollutants impair male fertility via regulating the expression of ZMYND15 and ZMYND10 has not been studied. Arsenic exposure results in poor sperm quality and male infertility. In order to investigate whether arsenic-induced male reproductive toxicity is related to the expression of ZMYND15, ZMYND10 and their target genes, we established a male rat model of sodium arsenite exposure-induced reproductive injury, measured sperm quality, serum hormone levels, mRNA and protein expressions of intratesticular ZMYND15 and ZMYND10 as well as their target genes. The results showed that, in addition to the increased mRNA expression of Tnp1, sodium arsenite exposure reduced sperm quality, serum hormone levels, and mRNA and protein expression of intratesticular ZMYND15 and ZMYND10 and their target genes in male rats compared with the control group (<i>p</i> &lt; .05). Therefore, our study first showed that the environmental pollutant arsenic impairs sperm quality in male rats by reducing the expression of ZMYND10 and ZMYND15 and their regulatory genes, which provides a possible diagnostic marker for environmental pollutants-induced male infertility.</p>","author":"Xiangli Li, \nKaina Shen, \nDunxuan Yuan, \nXi Li, \nJinrou Quan, \nFangzhou Tian, \nYan Yang, \nLi Zhang, \nJunling Wang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"0981ea61607b491facd5ba2fcf3fdd3b89178feb0d6781429de9991de9f7087a","category":"Environment"}