{"title":"Landscape Dynamics Revealed by Multiscale Land Cover, Use, Vegetation and Soil Analyses: The Megalopolis of Mexico as a Case Study","link":"https://www.preprints.org/manuscript/202403.0983/v1","date":1710742524000,"content":"Urban sprawl is recognized as one of the most critical drivers disrupting the functional integrity of rural and natural landscapes. A systematic multiscale study has yet to be conducted to measure the Megalopolis of Mexico City's regional extent, comprising ca. 23 million inhabitants. This paper investigates land cover, land use, vegetation and soil changes at macro-regional, regional, local and site scales. Land cover/use data from the 1970s and 2018 were used as the primary input to analyze changes using remote sensing and geographical information systems. At the local scale, fieldwork data from the 1970s, 1990s, and 2020 served as the primary input and were subjected to multivariate analyses. At site scale, soils profiles and hydrological balance analyses at micro-basin level were conducted. Furthermore, social perception of changes was investigated among local residents/stakeholders using semi-structured interviews with four communities. Outcomes were validated to reach 85 percent accuracy in cartographic and 95 % statistical outputs. At the regional scale, land-use changes, especially human settlements, increased from about four to almost 40 % between 1970 and 2018 , with significant incursion into rural landscapes. At the local scale, analyses revealed significant decline in predominantly cold-humid vegetation types and conversion of agricultural fields into peri-urban landscapes. Site scale revealed the predominant importance of soils as the core landscape component for water infiltration and carbon sequestration. Nested multi-scale analyses revealed different disrupting processes which are hidden at one scale and evident at another. Poorly implemented, disconnected urban and environmental policies prevail as the main driving force, with implications for the weak local governance of rural communities. Regional integrated analyses are discussed in light of the relevance of urban resilience theory.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0981edd82606cb416c78caa17a7afb53d8134cc28c699ef160fe9ed8148beae7","category":"Interdisciplinary"}