{"title":"Acute Myocardial Infarction Due to Spontaneous Coronary    Artery Dissection at 36 weeks of Pregnancy: A Case Report","link":"https://www.preprints.org/manuscript/202407.0548/v1","date":1720183650000,"content":"(1) Background: Acute myocardial infarction in pregnancy (pAMI) is a rare event, often caused by non-classical factors rather than atherosclerosis. The management of such a complicationrequires a multidisciplinary team and it is important to bring together the specialities involved to ensure that these teams are coordinated and ready to respond. The management of pAMI poses unique challenges as it requires considering both maternal and fetal well-being. (2) Methods: We present the case of a 36-week pregnant woman who presented with antero-lateral ST elevation myocardial infarction (STEMI) complicated by cardiogenic shock. To ensure comprehensive decision-making, an emergency Pregnancy Heart Team meeting was convened, comprising interventional cardi-ologists, gynecologists, and anesthesiologists. The team prioritized interventional treatment for pAMI, according to ESC guidelines, and opted for primary percutaneous coronary intervention (PCI) due to the unstable maternal condition.; (3) Results: The patient underwent primary PCI as the chosen intervention for pAMI. A rapid response gynecology team closely monitored the procedure and was prepared to intervene in case of irreversible hemodynamic compromise leading to cardiac arrest. An emergency caesarean section was deemed necessary if cardiac ac-tivity was not restored within 4 minutes.; (4) Conclusions: Managing pAMI requires a multidis-ciplinary approach that balances the maternal and fetal well-being. In this particular case, the Pregnancy Heart Team decided to prioritize interventional treatment with primary PCI due to the unstable maternal condition. The presence of a closely monitored gynecology team ensured prompt action in case of complications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0982cbbc0ac737656d817ea148d664e5765bc82946fb3fe38bda73575956c0f5","category":"Interdisciplinary"}