{"title":"Apple Seeds macOS Sonoma 14.4 Release Candidate","link":"https://www.macrumors.com/2024/03/04/apple-seeds-macos-sonoma-14-4-release-candidate/","date":1709575599000,"content":"Apple today seeded the release candidate version of an upcoming <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">macOS Sonoma</a> 14.4 update to developers for testing purposes, with the software coming a week after the <a href=\"https://www.macrumors.com/2024/02/27/apple-seeds-macos-sonoma-14-4-beta-5/\">release of the fifth beta</a>. The release candidate marks the final version of the ‌macOS Sonoma‌ 14.4 update that will be provided to the public. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/sonoma-desktop-wwdc.jpg\" width=\"1600\" height=\"900\" />\r<br />\nRegistered developers can opt-in to the beta through the Software Update section of the System Settings app. Note that an <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a> associated with an Apple Developer account is required to get the beta.\r<br />\n\r<br />\n‌macOS Sonoma‌ 14.4 introduces new emoji characters, podcast episode text, and an option to only show icons for websites in the Safari Favorites Bar. The update also supports the new <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a> models that were introduced today.<blockquote>macOS Sonoma 14.4 introduces new emoji as well as other features, bug fixes, and security updates for your Mac.\r<br />\n\r<br />\n<strong>Emoji</strong>\r<br />\n- New mushroom, phoenix, lime, broken chain, and shaking heads emoji are now available in emoji keyboard\r<br />\n- 18 people and body emoji support facing the opposite direction\r<br />\n\r<br />\n<strong>This update also includes the following improvements and bug fixes:</strong>\r<br />\n- Podcasts Episode text can be read in full, searched for a word or phrase, clicked to play from a specific point and used with accessibility features such as Text Size, Increase Contrast, and VoiceOver\r<br />\n- Business Updates in Messages for Business let you get updates that you've opted into, like order status, flight notifications, fraud alerts or other transactions from trusted businesses\r<br />\n- Safari Favorites Bar adds an option to show only icons for websites\r<br />\n\r<br />\nSome features may not be available for all regions, or on all Apple devices.\r<br />\n\r<br />\nFor detailed information about the security content of this update, please visit: https://support.apple.com/kb/HT201222</blockquote>macOS Sonoma 14.4 could see a public release as soon as this week.\r<br />\n\r<br />\n<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">macOS Sonoma</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macos-sonoma.243\">macOS Sonoma</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/04/apple-seeds-macos-sonoma-14-4-release-candidate/\">Apple Seeds macOS Sonoma 14.4 Release Candidate</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-seeds-macos-sonoma-14-4-release-candidate.2421033/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0988959799d26c409c1fe21a1603e0e5782cf468dceda2e13281345049e911c5","category":"Apple"}