{"title":"Making sense of wildlife habitat use on active oil sands mines: Quasi‐experiments, occupancy models, trends assessments and upland habitat reclamation","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12367?af=R","date":1721442556000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/361a4748-ca49-4506-ace1-1e70c687ed28/eso312367-toc-0001-m.png\" alt=\"Making sense of wildlife habitat use on active oil sands mines: Quasi-experiments, occupancy models, trends assessments and upland habitat reclamation\" />\n<p>A quasi-experiment and an innovative occupancy model were used to assess trends in wildlife species over a 15-year period. Results are consistent with expectations and point to the use of camera trap data to reliably assess reclamation success.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nIntensive resource extraction activity in the oil sands of Canada alters the quantity, structure and distribution of native ecosystems, which in turn creates substantive challenges for conservation, land management and habitat reclamation. Progressive reclamation occurs on active mine sites in the Athabasca oil sands region (AOSR) of Canada, along with concurrent assessments of reclamation effectiveness. Yet, little is known about the ability of reclaimed habitats to mitigate for the short- and long-term impacts associated with open-pit mines and provide functional habitat for wildlife.\n\nWe used a robust quasi-experiment that combined camera trap data from an observational study with an innovative occupancy model to assess the effectiveness of upland reclamation to provide habitat for wildlife in the AOSR. The dynamic occupancy models were applied to 15 years of camera trap data to assess wildlife usage patterns of nine species of wildlife over seven types of habitats. The habitats sampled ranged from mining-disturbed habitats reclaimed to upland forest ecosites common in the region, habitats disturbed by natural (fire) and human disturbances (clear-cut logging), with comparisons to mostly intact mature forests.\n\nOur results indicate that the nine species of wildlife assessed used habitats in a manner consistent with expectations: some preferred disturbance-dominated habitats while others used mature forest to a higher degree. We demonstrate that the application of dynamic occupancy models to camera trap data reliably discerned these trends, providing the means to predict wildlife usage patterns in an ever-changing landscape, including one containing bitumen extraction as a contributor to landscape-level modifications.\n\n<i>Practical implication</i>: Our work illustrates how continued monitoring of wildlife using camera traps contributes to assessments of reclamation effectiveness with respect to wildlife occurrence, distribution and usage patterns in anthropogenically and naturally disturbed landscapes. Evaluating the effectiveness of reclamation is especially important given the expected increase in habitat reclamation on active oil sands mines over the next several decades, coupled with the need to ensure that disturbed habitats regain ecological function able to sustain wildlife in the future.\n</p>","author":"Virgil C. Hawkes, \nPascale Gibeau, \nWendell Challenger","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"098c63a62836c4165ca85a9da514f115a2bbb045ea394fa4a6d0ac21a7681a28","category":"Environment"}