{"title":"Detection and prediction of drought by utilizing integrated geo-spatial and Markov approach in Balochistan, Pakistan","link":"http://link.springer.com/10.1007/s13762-024-05474-2","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>Pakistan is exposed to variety of hazards. Drought is one of the hydro-meteorological hazards causing loss of life and soil moisture, reduction in agricultural production and decline in groundwater level. Balochistan is the largest province of Pakistan which has been severely affected by drought. This study is an effort to analyze and forecast the spatial pattern of drought in Balochistan using Markov Model. Both primary and secondary data were utilized in Geographical Information System (GIS) environment to model the current and predict the future pattern of drought in the region. The main input spatial layers included land cover, natural difference vegetation index (NDVI), natural difference water index (NDWI), groundwater level, precipitation and current drought. The spatial pattern of drought is delineated into extreme, moderate and low/no drought zones. The analysis reveals that the currently, the extreme, moderate and low/no drought zones are spatially extended over 9.9% (37,053 km<sup>2</sup>), 83.11% (288,553 km<sup>2</sup>) and 6.21% (21,584 km<sup>2</sup>), respectively. While the predicted drought presents shocking results, where the prevalence of extreme, moderate and low/no drought zones may spatially extend over to 51.14% (191,364 km<sup>2</sup>),28.78% (99,945 km<sup>2</sup>) and 16.09 (55,881 km<sup>2</sup>). The extreme drought may encroach current moderate drought into predicted extreme drought. Additionally, the occurrence of drought in Chaghi district may be more in future, where chances of extreme drought occurrence is 20.15%. Second most prone region is Kharan, where chances of drought are 11.35% and finally, third region is Khuzdar, where the probability of extreme drought is 8.90%. However, Awaran, Panjgur, Kech, Zhob and Sherani districts are also prone to moderate drought in future. There is dire need to build mini and micro dams to conserve rain water and farmers should plant less water dependent crops. The results and findings of this study have potential to assist disaster management authorities and decision makers to formulate zone specific drought risk reduction strategies.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"099306a2a505c2d05659c2b2af30af37d862f700c2420e8f0a81e5572d4a4a95","category":"Environment"}