{"title":"Forest fragmentation and edge effects impact body condition, fur condition and ectoparasite prevalence in a nocturnal lemur community","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae042/7702477?rss=1","date":1719878400000,"content":"<span><div>Abstract</div>Forest fragmentation and edge effects are two major threats to primate populations. Primates inhabiting fragmented landscapes must survive in a more degraded environment, often with lower food availability compared to continuous forests. Such conditions can have deleterious effects on animal physiological health, yet some primates thrive in these habitats. Here, we assessed how forest fragmentation and associated edge effects impact three different components of physiological health in a nocturnal primate community in the Sahamalaza-Iles Radama National Park, northwest Madagascar. Over two periods, 6 March 2019–30 October 2019 and 10 January 2022–17 May 2022, we collected data on body condition, fur condition scores and ectoparasite prevalence for 125 <span>Mirza zaza</span>, 51 <span>Lepilemur sahamalaza</span>, 27 <span>Cheirogaleus medius</span> and 22 <span>Microcebus sambiranensis</span> individuals, and we compared these metrics between core and edge areas of continuous forest and fragmented forest. Body condition scores for all species varied between areas, with a positive response to fragmentation and edge effects observed for <span>M. zaza</span> and <span>L. sahamalaza</span> and a negative response for <span>C. medius</span> and <span>M. sambiranensis</span>. Fur condition scores and ectoparasite prevalence were less variable, although <span>M. zaza</span> and <span>L. sahamalaza</span> had a significantly negative response to fragmentation and edge effects for these two variables. Interestingly, the impacts of fragmentation and edge effects on physiological health were variable-specific. Our results suggest that lemur physiological responses to fragmentation and edge effects are species-specific, and body condition, fur condition and ectoparasite prevalence are impacted in different ways between species. As other ecological factors, including food availability and inter/intraspecific competition, likely also influence physiological health, additional work is required to determine why certain aspects of lemur physiology are affected by environmental stressors while others remain unaffected. Although many nocturnal lemurs demonstrate resilience to fragmented and degraded habitats, urgent conservation action is needed to safeguard the survival of their forest habitats.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"0997636853fc6e103f6ba6a8fcf745cd2c8b5874be0a1e853aff38a0a93cd3ea","category":"Environment"}