{"title":"เน็ตที่ออฟฟิศช้าเกินไปหรือไม่? Cloudflare เปิดให้ต่อตรงจากตึกเข้าเครือข่าย CDN","link":"https://www.blognone.com/node/125075","date":1633315824000,"content":"<div><div><div><p>Cloudflare เปิดบริการใหม่ Cloudflare for Offices เป็นการเชื่อมเครือข่ายของ Cloudflare เข้าไปที่ตึกสำนักงานโดยตรง เพื่อให้บริษัทหรือหน่วยงานในตึกสำนักงานนั้นๆ ได้อินเทอร์เน็ตความเร็วสูงกว่าใครๆ เพราะต่อตรงกับเครือข่าย CDN ของ Cloudflare ที่ครอบคลุมเว็บไซต์สำคัญๆ จำนวนมาก</p>\n<p>Cloudflare บอกว่าพัฒนาฮาร์ดแวร์แบบคัสตอมของตัวเองเพื่อวางไว้ที่ตึกสำนักงาน แล้วจับมือกับบริษัทไฟเบอร์ในแต่ละพื้นที่เพื่อเชื่อมสายเข้ากับระบบของ Cloudflare โดยตรง ข้อดีนอกจากเรื่องความเร็วในการเชื่อมต่อตรง CDN แล้วยังได้บริการด้านความปลอดภัย ประสิทธิภาพ การจัดการเครือข่ายทั้งหมดของ Cloudflare โดยไม่ต้องทำอะไรเพิ่มเลย แค่เสียบสายก็ได้ทุกอย่างอัตโนมัติ</p>\n<p>Cloudflare อธิบายว่าโมเดล Cloudflare for Offices ออกแบบมาเพื่อแก้ปัญหาของระบบจัดการเครือข่ายยุคเก่า เช่น MPLS, WAN, VPN, Hardware Firewall ที่เกิดขึ้นต่างยุคสมัย และถูกใช้มาเรื่อยๆ โดยไม่เปลี่ยนแปลง เกิดความซับซ้อนในแง่การจัดการขึ้นเรื่อยๆ จึงออกฮาร์ดแวร์ใหม่ตัวเดียวมาแทนระบบเดิมทั้งหมด ย้ายงานด้านการจัดการ-ความปลอดภัยไปอยู่ที่เครือข่ายของ Cloudflare แทนการรันที่ปากทางเข้าองค์กร</p>\n<p>เป้าหมายของ Cloudflare คือเชื่อมสายไปยังตึกสำนักงานใหญ่ๆ กว่า 1,000 แห่งทั่วโลก (ไม่บอกว่ามีประเทศไหนบ้าง) เบื้องต้นยังมีเฉพาะบางตึกในเมืองใหญ่ๆ ของสหรัฐ เช่น นิวยอร์ก ชิคาโก ซานฟรานซิสโก บอสตัน</p>\n<p><img src=\"https://blog.cloudflare.com/content/images/2021/09/image3.jpg\" /></p>\n<p>ที่มา - <a href=\"https://blog.cloudflare.com/cloudflare-for-offices/\">Cloudflare</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/cloudflare\">Cloudflare</a></div><div><a href=\"/topics/network\">Network</a></div><div><a href=\"/topics/enterprise\">Enterprise</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0999a4e7cbf8db62dab0b494525a1edab6eec822c0f53c0c8934b9f4a899b9b6","category":"Thai"}