{"title":"Apple begins beta testing for macOS Sonoma 14.3","link":"https://www.macworld.com/article/2170985/macos-sonoma-14-3-beta-features-update-release.html","date":1702483189000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple has released the macOS Sonoma 14.3 beta to developers. The beta comes after Apple officially <a href=\"https://www.macworld.com/article/2117732/apple-releases-macos-sonoma-14-2-beta.html\">released Sonoma 14.2</a> to the general public on Monday. A public beta of 14.3 should be coming in the next few days.</p>\n\n\n\n<h2>macOS Sonoma 14.3: New features</h2>\n\n\n\n<p>Apple has not made any announcements as to the contents of 14.3 and there is no information in the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/documentation/macos-release-notes/macos-14_3-release-notes&amp;xcust=1-1-2170985-1-0-0&amp;sref=https://www.macworld.com/feed\">14.3 release notes to developers</a>. There aren’t any major new features that haven’t already been released so 14.3 will likely be heavy on fixes and security patches.</p>\n\n\n\n<h2> macOS Sonoma 14.3: How to install the beta</h2>\n\n\n\n<p>Developer betas are available to anyone who has enrolled in Apple’s Developer Program. Apple usually issues a public beta a day or two after the developer beta has been released. We have a complete <a href=\"https://www.macworld.com/article/671123/how-to-install-macos-beta.html\">guide to downloading and installing the Sonoma betas</a> if you are interested.</p>\n\n\n\n<p>While betas give early access to fixes and features to the operating system, they are issued with the idea that users will test the software and check for bugs. This means that the betas have some instability to them and may cause issues with your Mac. If you can’t afford to take the risk of a possible crash or a disruption of usability, you should not run the beta and wait for the release to the general public.</p>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"099a819ef91af16e27d5f24af4eb5a05f219ff0fec239be52552ad6d550b33e5","category":"Apple"}