{"title":"Apple Watch X: All the Rumors So Far","link":"https://www.macrumors.com/guide/apple-watch-x/","date":1692397996000,"content":"The original Apple Watch was released in April 2015, and we are coming up on the 10th anniversary of Apple's first wearable device. With such a landmark anniversary on the horizon, rumors are coalescing around a notable 10-year anniversary update that we could see in 2024 or 2025.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/Apple-Watch-X-Feature.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nApple in 2017 unveiled the \"<a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> X\" to celebrate the 10th anniversary of the ‌iPhone‌, so Apple could have similar plans for the Apple Watch.\r<br />\n\r<br />\n<h2>Design</h2>\r<br />\nAccording to <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>, Apple is planning a major redesign for the Apple Watch that will coincide with the 10th anniversary of the device. Apple is aiming to make the Apple Watch thinner than it is now, with a slimmer casing.\r<br />\n\r<br />\n<h2>Bands</h2>\r<br />\nApple is working on new ways for bands to attach to the Apple Watch, says Gurman. A magnetic attachment system that Apple is considering would free up space that is taken up by the cutouts for the current band attachment points.\r<br />\n\r<br />\nRemoving the band cutouts would provide more space for other internal components, which could lead to the slimmer case.\r<br />\n\r<br />\nAn Apple Watch with a new band attachment system would likely not be compatible with older bands. Since the 2015 launch of the Apple Watch, Apple has made sure that new Apple Watch models continue to be compatible with existing bands.\r<br />\n\r<br />\nIt is not yet clear if the magnetic band system will be ready for debut with the so-called Apple Watch X, nor if Apple will move ahead with plans to change band design.\r<br />\n\r<br />\n<h2>Display</h2>\r<br />\nThere are rumors that Apple is working on <a href=\"https://www.macrumors.com/guide/microled-apple-watch/\">microLED display technology</a> for the Apple Watch, and those rumors suggest a microLED watch will come out in 2025. That lines up closely with when Apple is planning to launch the Apple Watch X, so it would make sense for the Apple Watch X to be the first watch with the new display.\r<br />\n\r<br />\nMicroLED Apple Watch rumors have suggested that it is a feature being designed for the larger <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra</a> because Apple is testing a 2.1-inch diagonal display, but there could be multiple sizes or the Apple Watch X could be a larger-sized watch with a new case design and slimmer bezels. One analyst, for example, has said Apple is working on <a href=\"https://www.macrumors.com/2023/02/08/apple-watch-series-x-larger-display-rumor/\">1.89 and 2.04-inch display sizes</a> for 2024 Apple Watch models.\r<br />\n\r<br />\nMicroLED is a relatively new technology that uses microscopic LEDs for individual pixels. MicroLED is more energy efficient than LED technology, and while it has some of the same benefits of OLED, it has a longer lifetime and there's less risk of screen burn-in.\r<br />\n\r<br />\nBecause of the pixel-level individual lights, microLED displays have faster response times and better contrast than other display types, plus the color is better and brighter. Apple has been investing <a href=\"https://www.macrumors.com/2015/12/14/apple-thinner-display-taiwan/\">a whole lot of money</a> in microLED technology since 2015.\r<br />\n\r<br />\n<h2>Health Features</h2>\r<br />\nThere are no rumors about new health features for the Apple Watch X, but Apple has a couple of major advancements that are in the works and could potentially be ready in time.\r<br />\n\r<br />\nBlood pressure monitoring is one such function that Apple has been developing, and 2022 rumors suggested that it would be <a href=\"https://www.macrumors.com/2022/07/24/apple-watch-pro-redesign-no-flat-sides/\">ready for a 2025 launch</a>. There are already wrist-worn blood pressure monitoring devices, including one from Samsung, so it isn't too far-fetched to imagine that Apple is close to being ready to launch this technology. Rather than wearing a blood pressure cuff, the Apple Watch would be able to detect blood pressure from the wrist using infrared light.\r<br />\n\r<br />\nApple is also trying to create an Apple Watch that can measure blood glucose, but that technology is further off and would probably not be ready in time for the launch of a 10th anniversary watch. Apple wants to measure blood glucose without needing to prick the skin (using infrared and other sensors), but no one has figured out how to do that reliably as of yet. Glucose monitoring is life or death and needs to be super precise, which is tough to do without breaking the skin.\r<br />\n\r<br />\n<em>Bloomberg</em>'s ‌Mark Gurman‌ has said it's functionality that will be coming to the Apple Watch closer to the end of the decade.\r<br />\n\r<br />\n<h2>Release</h2>\r<br />\nGurman says it is not yet clear if Apple will release the new watch in 2024 or 2025. The original Apple Watch was unveiled in September 2014, but it did not release until April 2015, so Apple could use either date for the Apple Watch anniversary.\r<br />\n\r<br />\n2023 will mark the debut of the <a href=\"https://www.macrumors.com/guide/apple-watch-series-9/\">Apple Watch Series 9</a>, so a Series 10 or \"X\" would be more appropriate for 2024, not 2025, but the X naming is just speculation at this point.<br />This article, \"<a href=\"https://www.macrumors.com/guide/apple-watch-x/\">Apple Watch X: All the Rumors So Far</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-watch-x-all-the-rumors-so-far.2399029/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"099eca12826abb5c7d651195d11f0280f2e2e1b200a5f2b75f371081974635c9","category":"Apple"}