{"title":"Show-through removal with sparsity-based blind deconvolution","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305208","date":1718200800000,"content":"<p>by Sota Kawakami, Hiroyuki Kudo</p>\r\n\r\nWhen scanning a document printed on both sides by using an electronic scanner, the printed material on the back (front) side may be transmitted to the front (back) side. This phenomenon is called show-through. The problem to remove the show-through from scanned images is called the show-through removal in the literature. In this paper, we propose a new method of show-through removal based on the following principle. The proposed method uses two scanned images with the front side and with the back side as input images. The proposed method is based on Ahmed’s Blind Image Deconvolution method discovered in 2013, which succeeded in formulating Blind Image Deconvolution as a nuclear norm minimization. Since the structure of show-through removal resembles that of Blind Image Deconvolution, we discovered that the show-through removal can be reformulated into a nuclear norm minimization in the space of outer product matrix constructed from an image vector and a point spread function vector of blurring. Using this key idea, we constructed the proposed method as follows. First, our cost function consists of the following three terms. The first term is the data term and the second term is the nuclear norm derived from the above reformulation. The third term is a regularization term to overcome the underdetermined nature of show-through removal problem and the existence of noise in the measured images. The regularization term consists of Total Variation imposed on the images. The resulting nuclear norm minimization problem is solved by using Accelerated Proximal Gradient method and Singular Value Projection with some problem-specific modifications, which converges fast and requires a simple implementation. We show results of simulation studies as well as results of real image experiments to demonstrate the performances of the proposed method.","author":"Sota Kawakami","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"09a0e9b70d9a9ea73656f6760691e5b0fac74a64cb9738ce9788de0eb6c393dc","category":"Interdisciplinary"}