{"title":"Best mountain bike disc brakes | Top-rated hydraulic brakes and buying advice","link":"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-disc-brakes/","date":1633359600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/11/mountain_bike_disc_brake_tile-cb70e1b.jpg?quality=90&amp;resize=620,413\" />                                            <p>Looking for new brakes for your mountain bike? Our list of the best mountain bike disc brakes has put popular hydraulic disc systems head-to-head.</p>\n<p>Having good brakes on your bike makes you go faster. Sound like an oxymoron? Maybe, but it’s true. The fact is, if you know you can quickly and efficiently bring your speed under control, you’re more likely to let it creep up into the red zone. You become a faster and more controlled rider.</p>\n<p>For more bike control, you want not only power, but also effective modulation of that power, where subtle variations in lever force give a much more controllable braking force, rather than an on/off feel.</p>\n<p>That way, you’ll reduce unintentional skidding and the resultant reduction in braking power and bike control.</p>\n<p>Some brakes come with four pistons in the caliper and others with two pistons. Four pistons offer more braking power but can increase weight.</p>\n<p>A level of adjustability at the lever is helpful for effective control and to reduce hand fatigue. Riders with smaller hands will want a shorter lever reach, an adjustment which most sets have as standard, but the ability to change the bite point of the brake can also help get it in the sweet spot where your fingers have the most leverage.</p>\n<p>Practically speaking, you want stoppers with low maintenance requirements, which hydraulic units generally bring (save for the occasional <a href=\"https://www.bikeradar.com/features/give-any-hydraulic-brake-the-bleed-of-its-life/\">bleed</a>), and easy <a href=\"https://www.bikeradar.com/advice/workshop/how-to-change-the-disc-brake-pads-on-your-bike/\">swapping out of brake pads</a> when the time comes.</p>\n<p>When we take the best mountain bike disc brakes out for testing, we keep all this in mind: checking for power, feel, fade, modulation and reliability. There are plenty of fitting and dismantling sessions too, to figure out how easy the brakes are to maintain and service.</p>\n<p>You can find out more about what to look for when buying disc brakes at the end of this article, but otherwise keep reading to see our pick of the best mountain bike disc brakes, as reviewed and rated by the expert team here at BikeRadar.</p>\n<section><div>\n        <h2>The best mountain bike disc brakes, as rated by our expert testers</h2>\n<ul><li><strong>Formula Cura 4:</strong> £150 / AU$295</li>\n<li><strong>Hope Tech 3 E4: </strong>£175 / €220 / $220 / AU$350</li>\n<li><strong>Shimano BL-Mt501/Mt502:</strong> £100 / $145 / €132</li>\n<li><strong>Shimano Deore M6000:</strong> £75 / $103</li>\n<li><strong>SRAM Code RSC:</strong>  £230 / $245 / €270</li>\n<li><b>Clarks Clout 1: </b>£25 inc. rotor</li>\n<li><strong>Formula Cura:</strong> £114 / €124</li>\n<li><strong>Hayes Dominion A4:</strong> £200</li>\n<li><strong>Hope Tech 3 X2:</strong> £155 / €195 / $195 / AU$320</li>\n<li><strong>Hope XCR Pro X2:</strong> £250 / $320 / AU$450 / €315</li>\n<li><strong>Magura MT5:</strong> £95 / $139 / €110</li>\n<li><strong>Magura MT Trail SL:</strong> £497 / $599 / €580</li>\n<li><strong>Shimano SLX M7120:</strong> £160 / $180</li>\n<li><strong>SRAM G2 Ultimate:</strong> £265 / $280 / €295</li>\n</ul><p>\n\n    </p></div>\n    </section><h3>Formula Cura 4</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> There’s power in spades, but the smooth, progressive way it’s applied is even more impressive.</span></figcaption><span> <i>Andy Mccandish / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Four</li>\n<li><strong>Fluid:</strong> Mineral oil</li>\n<li><strong>Weight:</strong> 246g</li>\n<li><strong>Adjustments:</strong> Reach (TD)</li>\n<li><strong>Price:</strong> £150 / AU$295</li>\n</ul><p>Without much experience of Formula brakes in recent years, we tried the Cura 4 with no expectations. Fitting and bleeding were slightly fiddly, with tight pad clearances making a rub-free result hard to achieve, and the fixed hose angle at the caliper meant hose routing was a bit untidy, but once resolved (or accepted) we really liked the sleek lever and caliper. The weight is good too.</p>\n<p>There’s power in spades, but the smooth, progressive way it’s applied is even more impressive, making it easy to achieve that magical ‘just below’ pressure before braking traction.</p>\n<p>There’s no bite point adjustment, but once reach was set (with an Allen key), we didn’t think about it anyway.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Hope Tech 3 E4</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Hope’s Tech 3 E4 brakes are powerful, well modulated and feature useful adjustment.</span></figcaption><span> <i>Andy McCandish / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Four</li>\n<li><strong>Fluid:</strong> DOT 5.1</li>\n<li><strong>Weight:</strong> 256g (front)</li>\n<li><strong>Adjustments:</strong> Reach (TF), bite point (TF)</li>\n<li><strong>Price:</strong> £175 / €220 / $220 / AU$350</li>\n</ul><p>With a choice of levers and calipers that can be mixed and matched in the Hope range, we opted for the Tech 3 lever with the four-pot E4 caliper.</p>\n<p>The Tech 3 is slightly heavier than the more pared-back Race option (by around 40g), but what it loses in weight and titanium hardware it gains in on-the-fly adjustment, via tool-free reach and bite-point dials.</p>\n<p>It’s compatible with Shimano I-Spec A shifters, to cut down handlebar clutter, and other standards are available as optional extras. This is a thoroughly solid, industrial bit of kit, built to last a lifetime.</p>\n<p>The E4, meanwhile, is a one-piece caliper, CNC-machined from T6 alloy, with four phenolic pistons pushing out serious stopping power. Top-loading pads make for easier replacement, and the whole DOT fluid system is bled using the old-school open reservoir method, which is easy once you’ve got the hang of it.</p>\n<p>Together, the lever and caliper are nothing short of excellent, with oodles of power to call upon through superbly engineered and adjustable components. The lever feel is firm, with maybe slightly less feedback than the best of the rest – however, a consistent, smooth action more than makes up for this.</p>\n<p>Everything, from the solid, dimpled lever blade to the large, glove-friendly bite point and reach-adjust dials, is well thought out and easy to tweak, and fitting and bleeding are a breeze, too.</p>\n<p>With an impressive weight of 256g, the price feels very reasonable indeed, so we found the Tech 3/E4 combination hard to see beyond.</p>\n<p>Add customisation options such as shifter adaptors and a variety of brake pad materials, and you have a winner on your hands. All that remains is to choose between the black, purple, red, orange, blue and silver-anodised finishes, and buy a matching £45 to £50 floating rotor to really colour-coordinate your precious steed.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/hope-tech-3-e4-brake-review/\">Read the full review of the Hope Tech 3 E4 brake</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Shimano BL-MT501/MT502</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Sub-Deore level brakes, yet plenty of stopping power from Shimano.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Four</li>\n<li><strong>Fluid:</strong> Mineral oil</li>\n<li><strong>Weight:</strong> 297g (front), 315g (rear)</li>\n<li><strong>Adjustments:</strong> Reach (TD)</li>\n<li><strong>Price:</strong> £100 / $145 / €132 as tested</li>\n</ul><p>The Shimano BL-Mt501/Mt502 brakes may cost half the price of some more premium hydraulic mountain bike brakes, but this doesn’t stop them from performing remarkably well.</p>\n<p>A hinged clamp makes attaching the brakes to your handlebars easy and that’s a great feature at this price point.</p>\n<p>The left/right-specific levers also get Shimano’s ServoWave linkage, which means the early part of the lever’s stroke pushes the pads in further than the later stroke. This helps give plenty of control and also enables Shimano to create more space between the pads and rotors – ideal for mucky conditions.</p>\n<p>The pads are held in place with a split pin, which is easier to produce but potentially makes for fiddlier pad changes.</p>\n<p>The tubes come out of the brakes at a fixed angle and the tubing for the rear brake is 1700mm, which might not be long enough for the most progressive downhill or enduro bikes.</p>\n<p>Despite a few minor quirks, it’s hard to fault these four-pot brakes from Shimano. They bring plenty of stopping power and have a crisp, positive lever feel.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/shimano-bl-mt501-mt520-disc-brake-review/\">Read our full Shimano BL-MT501/MT502 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Shimano Deore M6000</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Shimano bleeds more functionality into its budget stoppers.</span></figcaption><span> <i>Andy Mccandish / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Two</li>\n<li><strong>Fluid:</strong> Mineral oil</li>\n<li><strong>Weight:</strong> 278g (front)</li>\n<li><strong>Adjustments:</strong> Reach (TD)</li>\n<li><strong>Price:</strong> £75 / $103 as tested</li>\n</ul><p>Shimano’s Deore brakes have long been our go-to budget discs. They just work well, at a fraction of the cost of others, so why look elsewhere?</p>\n<p>This latest version, the M6000, benefits from features trickled down from higher up the Shimano ladder, such as hinged bar clamps and reach adjustment via Allen key bolts behind the lever, so it’s far from the basic setup you might expect.</p>\n<p>Power and modulation are more than adequate too, with a good blend of positive lever action and smooth power feed with increased lever pressure. Add the particularly solid-feeling, wide-bladed lever and, for the money, you simply can’t go wrong.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/shimano-deore-br-m6000-brakes-review/\">Read our full review of the Shimano Deore M6000</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>SRAM Code RSC</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> SRAM’s top-level Code RSC is one of the most powerful brakes around, with a great lever feel.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Four</li>\n<li><strong>Fluid:</strong> DOT 5.1</li>\n<li><strong>Weight:</strong> 326g (front), 352g (rear)</li>\n<li><strong>Adjustments:</strong> Reach (TD), bite point (TF)</li>\n<li><strong>Price:</strong> £230 / $245 / €270 as tested</li>\n</ul><p>The SRAM Code is one of the most popular brakes for downhill and enduro racing, as well as for <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">electric bikes</a>, thanks to its big stopping power. This RSC version is the same as the Code R but provides extra adjustment.</p>\n<p>The lever is super versatile, as it can be used on either side of your handlebar and comes with a detachable hinged bar clamp. It also has tool-free adjustment for the lever position and bite point. Inside, a large reservoir helps increase heat resistance.</p>\n<p>The lever also provides quick engagement of the pads and eases off the further into the stroke you go for increased modulation.</p>\n<p>The caliper is a four-piston design with pads secured via a screw. In testing, we found these helped to deliver as much power as any other on the market.</p>\n<p>Bleeding is easy, even though there might be a few extra steps than with other brakes, and the screw-in barb and screw-on olive make cutting and refitting hoses a straightforward affair.</p>\n<p>Overall, these brakes have an excellent feel, top-quality construction and easy maintenance.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/sram-code-rsc-brake-review/\">Read our full SRAM Code RSC disc brakes review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Clarks Clout 1</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Don’t expect aggressive performance, but for the price they’re outstanding.</span></figcaption><span> <i>Andy Mccandish / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Two</li>\n<li><strong>Fluid:</strong> Mineral oil</li>\n<li><strong>Weight:</strong> 304g</li>\n<li><strong>Adjustments:</strong> Reach (TD)</li>\n<li><strong>Price:</strong> £25 inc. rotor as tested</li>\n</ul><p>Hats off to Clarks for producing an effective hydraulic disc brake for £24.99, or even less if you buy two (£44.99). And that price includes a 160mm or 180mm rotor.</p>\n<p>It even comes with an olive and barb for trimming the hose (the front hose was already too short for our longer-travel trail bikes, but that’s not the sort of use this is really designed for). Because the bar clamp isn’t hinged, you need to slide the grip off, but the lever fits easily and has a solid feel for the price.</p>\n<p>While lacking in bite and power relative to more expensive models, the Clout works passably well. If you’re upgrading a basic bike from cheap cable-operated discs, it’ll be far ahead of what you currently have. Don’t expect aggressive performance, but for the price it’s outstanding.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Formula Cura</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Formula has built one of our favourite trail brakes.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Two</li>\n<li><strong>Fluid:</strong> Mineral oil</li>\n<li><strong>Weight: </strong>239g (front), 251g (rear)</li>\n<li><strong>Adjustments:</strong> Reach (TF/TD)</li>\n<li><strong>Price:</strong> £114 / €124 as tested</li>\n</ul><p>The Formula Cura is a classy-looking two-piston brake that’s well suited to light and fast trail mountain bikes and downcountry bikes.</p>\n<p>The lever has a flip flop design, so it can be used as a lever for either a front or rear brake. It has a split clamp to attach it to the bar with a nice finish, like the whole of the brake.</p>\n<p>Long 2000mm hoses should provide enough length for the largest of bikes and these attach to the calipers at fixed points.</p>\n<p>When it comes to performance, the well-shaped levers have a light, soft feel with little effort needed to squeeze them and while braking force isn’t up to the most powerful four-piston brakes, there’s still plenty of clamping force from the large 24mm pistons.</p>\n<p>Lever setup and lack of lever adjustment is a sticking point, but ultimately these are good-looking and great performing brakes.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/formula-cura-disc-brake-review/\">Read our full Formula Cura disc brake review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Hayes Dominion A4</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Hayes Dominion A4 has four big 17mm pistons and semi-metallic pads.</span></figcaption><span> <i>Mick Kirkman / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Four</li>\n<li><strong>Fluid:</strong> DOT 5.1</li>\n<li><strong>Weight:</strong> 310g</li>\n<li><strong>Adjustments:</strong> Reach (TF)</li>\n<li><strong>Price:</strong> £200 as tested</li>\n</ul><p>Hayes dominated the brake scene in the early 2000s before dropping off the radar for a while. It came back with the Hayes Dominion A4, a brake that offers easy bleeding, full adjustability and a consistent lever feel.</p>\n<p>Each brake is tuned for prompt and consistent pad engagement. The combination of four large 17mm pistons with semi-metallic pads means braking is progressive rather than sudden.</p>\n<p>Elewhere, Hayes has included two bleed ports. This is a neat feature allowing you to flush bubbles out from either side of the brake block.</p>\n<p>You do have to drop the wheel out to change the brake blocks, which is frustrating.</p>\n<p>While this is a brake packed full of features, and promises easy setup, it does come with a high price.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/hayes-dominion-a4-brakes-review/\">Read our full Hayes Dominion A4 brakes review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Hope Tech 3 X2</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> More single-piece wizardry from the Lancashire machinists.</span></figcaption><span> <i>Andy McCandish / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Two</li>\n<li><strong>Fluid:</strong> DOT 5.1</li>\n<li><strong>Weight:</strong> 242g (front)</li>\n<li><strong>Adjustments:</strong> Reach (TF), bite point (TF)</li>\n<li><strong>Price:</strong> £155 / €195 / $195 / AU$320 as tested</li>\n</ul><p>An evolution of the good old Hope Mini brake, the X2 was designed to take all the performance of that well-known stopper and shave off a few more grams.</p>\n<p>It’s the lightest on test and, from our experience, not at the expense of performance. The Tech 3 lever is excellent, with bite point and reach adjusted easily via large glove-friendly dials.</p>\n<p>Fitting and adjustment are simple too, with a rotating banjo-shaped hose attachment and top-entry pads making maintenance a breeze.</p>\n<p>Our only negative is that for just £20 and 14g more, you could upgrade to the four-pot E4 and get a punchy power upgrade. It would double the number of pistons to go wrong, but Hope’s spares and service are second-to-none.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/hope-tech-3-x2-mountain-bike-disc-brakes-review/\">Read our full review of the Hope Tech 3 X2</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Hope XCR Pro X2</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Hope’s latest race-focused cross-country brakes pair a modified X2 two-piston caliper with an all-new XCR Pro lever, featuring a carbon fibre blade and radial body.</span></figcaption><span> <i>Russell Burton / Immediate media</i></span></div>\n<ul><li><strong>Pistons: </strong>Two</li>\n<li><strong>Fluid:</strong> DOT 5.1 or DOT 4</li>\n<li><strong>Weight:</strong> 213g (rear)</li>\n<li><strong>Adjustments:</strong> Caliper via an adjustable banjo</li>\n<li><strong>Price:</strong> £250 / $320 / AU$450 / €315  as tested</li>\n</ul><p>The Hope XCR Pro X2 cross-country brakes are lightweight with plenty of power, and exhibit Hope’s characteristically good build quality and its backup service.</p>\n<p>The lever’s hinged clamp is compatible with Hope’s Tech 3 mounts, so Shimano and SRAM shifters can be attached. The carbon fibre lever blade also has reach adjustment accessed with an Allen key, but doesn’t have bite adjustment like some other high-end XC brakes.</p>\n<p>The brake has two pistons housed in a CNC-machined caliper. They have a classic Hope feel with less bite than Shimano and less power build-up than SRAM.</p>\n<p>While we did notice some squealing in wet conditions, this didn’t hamper the stopping performance.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/hope-xcr-pro-x2-brakes-review/\">Read our full Hope XCR Pro X2 brakes review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Magura MT5</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Magura’s cheapish MT5 brake offers powerful performance and good feel.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Four</li>\n<li><strong>Fluid:</strong> Mineral oil</li>\n<li><strong>Weight:</strong> 250g (front), 265g (rear)</li>\n<li><strong>Adjustments:</strong> Reach (TD)</li>\n<li><strong>Price:</strong> £95 / $139 / €110 as tested</li>\n</ul><p>Built for gravity-orientated and electric bikes, these four-piston Magura MT5 brakes provide heaps of power and easy modulation.</p>\n<p>In the caliper, the four pistons press onto one pad, and once bedded in, this system provides plenty of grunt, particularly towards the end of the brake stroke, which is perfect for riding on steep terrain.</p>\n<p>Magura offers a range of levers with these brakes and in testing we had the two-finger levers, which exhibited a plasticky feel and flexed slightly. The brakes had a spongier feel than others, but this could be down to the extra length and flex at the lever. This might not seem ideal, but it does allow you to feather speed when you’re going fast.</p>\n<p>When it comes to maintenance, bleeding the brakes is easy and the long hoses should fit almost all bikes. Changing the pads requires removing the wheel and there is a knack to it.</p>\n<p>Overall, the MT5s pack a punch when it comes to power and won’t make a huge dent in your wallet, but costs clearly have been saved with the lever.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/magura-mt5-disc-brakes-review/\">Read our full Magura MT5 disc brakes review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Magura MT Trail SL</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Magura has built a very light, very powerful pair of brakes.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Four front, two rear</li>\n<li><strong>Fluid:</strong> Mineral oil</li>\n<li><strong>Weight:</strong> 239g (front), 220g (rear)</li>\n<li><strong>Adjustments:</strong> Reach (TD)</li>\n<li><strong>Price:</strong> £497 / $599 / €580 (for pair) as tested</li>\n</ul><p>The Magura MT Trail SL differs from other trail and enduro brakes by having a four-piston front caliper and a two-piston rear caliper.</p>\n<p>The front caliper provides the high braking power and modulation you need for top-level performance, while fewer pistons on the rear caliper helps save weight. The two pistons on the rear caliper are oversized, so there’s still a good chunk of stopping power.</p>\n<p>The lever has a flip-flop design and reach adjustment and Magura offers different lever blade types, which can alter the interface between finger and brake. The single-finger design we tested gave a reasonably sharp initial bite and in the mid-stroke it offered plenty of modulation.</p>\n<p>Magura has made the lever body from a material it calls ‘carbontecture’, which appears to be a carbon-infused composite. This helps the brakes achieve their low weight but at the bar, in general, the construction quality of these brakes doesn’t seem to match the price. However, this doesn’t stop these brakes from ultimately offering loads of manageable power.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/magura-mt-trail-sl-disc-brakes-review/\">Read our full Magura MT Trail SL disc brakes review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Shimano SLX M7120</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Shimano’s mid-priced SLX brakes offer almost as much performance as their pricier siblings.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Four</li>\n<li><strong>Fluid:</strong> Mineral oil</li>\n<li><strong>Weight:</strong> 307g (front), 320g (rear)</li>\n<li><strong>Adjustments:</strong> Reach (TF)</li>\n<li><strong>Price:</strong> £160 / $180 as tested</li>\n</ul><p>Sitting between the budget Shimano Deore and higher-end Shimano XT groupsets, Shimano SLX is sometimes overlooked. But, SLX has plenty of great features and performs admirably, as these mid-price SLX M7120 brakes prove.</p>\n<p>The lever attaches to the bar with a hinged clamp, and although the lever takes up more room than others, the fact it’s compatible with Shimano I-Spec mounting options means you can maintain a clean cockpit. The lever itself is 70mm long with no flex, making the brakes feel assured and firm.</p>\n<p>The four-piston calipers provide excellent stopping power, even on heavier electric bikes. Pair this with the lever feel and these brakes are super-positive, engaging power almost instantly, and giving that trademark Shimano brake feel.</p>\n<p>Arguably, this makes applying power with finesse harder than other brakes, but it does give you plenty of confidence that things are working as they should. However, getting the right bleed is critical to the performance of these brakes.</p>\n<p>The SLX M7120 might not have the same functions as Shimano’s pricier brakes, notably Free Stroke adjustment, but we didn’t miss this a great deal in testing.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/shimano-slx-m7120-disc-brakes-review/\">Read our full Shimano SLX M7120 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>SRAM G2 Ultimate</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> SRAM’s G2 Ultimate brakes come with all the bells and whistles.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li><strong>Pistons:</strong> Four</li>\n<li><strong>Fluid:</strong> DOT 5.1</li>\n<li><strong>Weight:</strong> 281g (front), 290g (rear)</li>\n<li><strong>Adjustments:</strong> Reach (TF), bite point (TF)</li>\n<li><strong>Price:</strong> £265 / $280 / €295 as tested</li>\n</ul><p>The trail-focused G2 replaces the popular Guide brake in SRAM’s line-up and the Ultimate is the top-tier version, with rainbow-coloured hardware, lever pivot bearings and tool-free adjustment.</p>\n<p>The 80mm carbon lever has a smooth, contoured shape. The lever provides lots of control, making it easy to correct speed on faster sections or apply a load of stopping power when needed. The action is smooth, but it’s a bit more resistant than other brakes.</p>\n<p>The four pistons push on a long pad that’s held in place with a threaded pin. There’s less power than SRAM’s Code brakes, but that isn’t too much of a surprise considering the small caliper body.</p>\n<p>Overall, we found the G2 Ultimate offers a lovely lever action, and while it has ample power it doesn’t have quite as much as the best brakes. This might make the premium price tag hard to justify for some, but it might also point to just how good SRAM Code brakes and others truly are.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/sram-g2-ultimate-disc-brakes-review/\">Read our full SRAM G2 Ultimate disc brakes review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<hr /><div></div>\n<hr /><h2>What to look for when buying mountain bike disc brakes</h2>\n<h3>Rotor size</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Cannondale Jekyll has a whopping 220mm rotor.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>Bigger <a href=\"https://www.bikeradar.com/features/6-of-the-best-disc-brake-rotors/\">disc brake rotors</a> exert more force at the tyre and have a larger area to cool down on sustained descents, which keeps them working optimally, but they’re heavier.</p>\n<p>You’ll often find that the more gravity-orientated a bike is, the larger the rotor size. <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cross-country-bikes/\">Cross-country mountain bikes</a> might come with 160mm rotors, trail bikes with 180mm and downhill bikes with 200mm rotors, but rotor sizes extend above the 200mm mark too.</p>\n<p>Some riders opt to use a mix of rotor sizes, with a larger rotor on the front for greater braking force and a smaller one on the rear to save weight.</p>\n<h3>Four-piston brakes vs two-piston brakes</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Magura MT Trail brakes use four-piston calipers for the front and two pistons at the back, where you don’t need quite the same amount of stopping power.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>It used to be that only gravity riders would consider four-piston calipers – known as four-pot brakes – and everyone else would stick to two-piston calipers, known as two-pot brakes.</p>\n<p>Four pistons deliver more braking force and better heat dissipation, so they’ve steadily crept their way into the mainstream, as <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-trail-bikes/\">trail mountain bikes</a> have become more capable, and the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-downcountry-mountain-bikes/\">downcountry bike</a> category has boomed.</p>\n<p>Of course, two-piston brakes still have acres of power on hand. So don’t write them off if you prefer a simpler setup with fewer pistons to get sticky or malfunction, less weight (although this is marginal) and a lower cost.</p>\n<h3>Lever adjustment</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The SRAM Code RSC has bite-point and lever-reach adjustment.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Most brakes offer reach adjustment, which allows you to set the lever distance from the bar to suit your hand size. Some offer bite point (or free stroke) adjustment too, varying the amount of lever-free travel before the pad connects with the rotor. This can be either tool-free or tool-driven.</p>\n<p>As you might expect, the more you pay for a set of brakes the more likely it is that they’ll have these features.</p>\n<h3>Brake pad material</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Organic pads give good bite, but sintered pads wear better.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>Most <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-pads/\">disc brake pads</a> are organic pads made of resin, glass, rubber and other non-metallic materials. They give a good ‘bite’ from cold, but can lose power when overheated and wear quickly. Sintered pads have more metallic fragments in the compound and can sound harsh, but wear far better and don’t suffer from overheating as much.</p>\n<h3>Pad removal</h3>\n<p>If pads are removable from the top of the caliper, they can be cleaned or replaced without the hassle of removing the wheel first. You don’t have to do this often, but it’s handy and far easier when you do.</p>\n<h3>Brake fluid</h3>\n<p>Hydraulic brakes use mineral oil or DOT fluid to drive their pistons. DOT fluid is bad for skin and paintwork, and needs more careful handling than mineral oil, but deals with water absorption better. Both are effective, but they need to be changed on a regular basis for best performance.</p>\n<p>If you’re looking to get your disc brakes back to their best performance, we also have guides on <a href=\"https://www.bikeradar.com/advice/workshop/how-to-bleed-shimano-disc-brakes/\">how to bleed Shimano disc brakes</a> and <a href=\"https://www.bikeradar.com/advice/workshop/how-to-bleed-hope-disc-brakes/\">how to bleed Hope disc brakes</a>.</p>","author":"Andy McCandlish","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"09a5e97dd413e4573c6ee6de6e53c0716964b63c684e5af752d9cd046f67feed","category":"Cycling"}