{"title":"[ลือ] Apple มีไอเดียพัฒนาอุปกรณ์สวมใส่ใหม่หลายอย่าง, HomePod จอทัช ยังไม่มาในปีนี้","link":"https://www.blognone.com/node/138395","date":1708871855000,"content":"<div><div><div><p>Mark Gurman แห่ง Bloomberg รายงานข้อมูลสินค้าใหม่แอปเปิลอีกเช่นเคย ในจดหมายข่าว Power On ประจำสัปดาห์ คราวนี้เขาเน้นไปที่อุปกรณ์สวมใส่ (Wearable Devices) และ HomePod รุ่นใหม่</p>\n<p>เขาบอกว่าทีมออกผลิตภัณฑ์ของแอปเปิลนั้น มีไอเดียสินค้าอุปกรณ์สวมใส่ใหม่ออกมาเรื่อย ๆ โดยปัจจุบันสินค้าหลักก็คือ Apple Watch และ AirPods ส่วนล่าสุดคือ Vision Pro แต่แอปเปิลก็มองหาสินค้าใหม่เพิ่มเติม ส่วนใหญ่ยังเป็นไอเดียที่กำลังพัฒนา</p>\n<p>สินค้าแรกคือแหวนอัจฉริยะ (Smart Ring) ซึ่ง<a href=\"https://www.blognone.com/node/138299\">เพิ่งมีข่าว</a>ออกมา แนวคิดคือเป็นสินค้าทางเลือกสำหรับคนต้องการอุปกรณ์วัดสุขภาพ แต่ไม่สะดวกที่จะใช้ Apple Watch ด้วยหลายเหตุผล เช่น ไม่ต้องการชาร์จทุกคืน, ต้องการใส่นาฬิกาอื่น แหวนจึงเป็นอุปกรณ์สวมใส่ใหม่ ที่ไม่ต้องทับซ้อนกับของอื่น สถานะตอนนี้มีทีมออกแบบพัฒนาในช่วงเริ่มต้นแล้ว</p>\n<p>สินค้าต่อมาคือแว่นตาอัจฉริยะ (Smart Glasses) แนวทางคือทดแทน AirPods และทำงานได้หลายอย่างมากกว่า จึงแตกต่างไปจากแว่นตาอัจฉริยะอื่นที่มี รวมถึงเฮดเซต Vision Pro สถานะโครงการนี้ยังอยู่ในช่วงศึกษาความเป็นไปได้ทางเทคโนโลยี</p>\n<p>แอปเปิลยังมีไอเดียพัฒนาอุปกรณ์สวมใส่อีกหลายอย่าง รวมทั้ง AirPods เวอร์ชันมีกล้องถ่ายวิดีโอด้วย</p>\n<p>สุดท้ายเป็นข่าว HomePod ก่อนหน้านี้<a href=\"https://www.blognone.com/node/137410\">มีรายงาน</a>ว่าจะมีรุ่นจอสัมผัสออกมาในปีนี้ แต่ล่าสุด Gurman ที่เคยให้ข่าวนี้เอง เขาบอกว่าสินค้าน่าจะมีออกมาเร็วที่สุดในปีหน้า (2025) ไม่มี HomePod ใหม่ออกมาในปีนี้แน่</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/newsletters/2024-02-25/apple-ponders-making-new-wearables-ai-glasses-airpods-with-cameras-smart-ring-lt1kb7cd\">Bloomberg</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/cf828411e251120265c6b7af70acc833.jpeg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/rumors\">Rumors</a></div><div><a href=\"/topics/wearable\">Wearable</a></div><div><a href=\"/topics/homepod\">HomePod</a></div><div><a href=\"/topics/smart-glass\">Smart Glass</a></div><div><a href=\"/topics/smart-ring\">Smart Ring</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"09a7f01798d6dfebf514f13a62b0f20c6572e38092a3e5cad82d48162583a566","category":"Thai"}