{"title":"Enhancing fabrication of hybrid microfluidic devices through silane‐based bonding: A focus on polydimethylsiloxane‐cyclic olefin copolymer and PDMS‐lithium niobate","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300116?af=R","date":1723441144000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e755a0c9-27e0-45d0-bf70-124f1385e958/appl202300116-gra-0001-m.png\" alt=\"Enhancing fabrication of hybrid microfluidic devices through silane-based bonding: A focus on polydimethylsiloxane-cyclic olefin copolymer and PDMS-lithium niobate\" /><p>A simple three-step process to bond polydimethylsiloxane (PDMS) microchannels with cyclic olefin copolymer and lithium niobate (LiNbO3) substrates. Overcoming PDMS's low surface energy, it enables robust bonding, vital for fluid control. Optimized conditions result in impressive hybrid microchannels (600 mL/h flow, 562 kPa strength) and PDMS-LiNbO3 assembly (216 mL/h flow, 334 kPa strength).\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Effective manipulation and control of fluids in microfluidic channels requires robust bonding between the different components. Polydimethylsiloxane (PDMS) is widely employed in microchannel fabrication due to its affordability, biocompatibility, and straightforward fabrication process. However, PDMS's low surface energy poses challenges in bonding with many organic and inorganic substrates, hindering the development of hybrid microfluidic devices. In this study, a simple and versatile three step process is presented for bonding PDMS microchannels with organic (cyclic olefin copolymer (COC)) and inorganic substrates (lithium niobate (LiNbO<sub>3</sub>)) using plasma activation and a silane coupling agent. Initially, the PDMS surface undergoes oxygen/argon plasma activation, followed by functionalization with (3-aminopropyl) triethoxysilane (APTES). Subsequently, the COC or LiNbO<sub>3</sub> is plasma activated and brought into contact with PDMS under a load at a specific temperature. Characterization by Fourier transform infrared, scanning electron microscopy, atomic force microscopy, and contact angle measurements confirmed the successful treatment of the substrates. In addition, bonding strength of the fabricated hybrid devices was assessed through leakage and tensile tests. Under optimized conditions (100°C and 4% v/v APTES), PDMS-COC hybrid microchannels achieved a flow rate of 600 mL/h without leakage and a tensile strength of 562 kPa. Conversely, the PDMS- LiNbO<sub>3</sub> assembly demonstrated a flow rate of 216 mL/h before leakage, with a tensile strength of 334 kPa. This bonding method exhibits significant potential and versatility for various materials in microfluidic applications, ranging from biomedical research to enhanced oil recovery.</p>","author":"Abdulrahman Agha, \nFadi Dawaymeh, \nNahla Alamoodi, \nAnas Alazzam","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"09ac82de6621a5850a7b071c8403dc60d143c5bef10d8607d547a2f7cb6d35ae","category":"Environment"}