{"title":"PSXII-18 Nitrogen balance and ruminal bacterial diversity indexes of Nellore cattle fed with amylolytic and fibrolytic enzymes in feedlot","link":"https://academic.oup.com/jas/article/102/Supplement_3/782/7757713?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>This study was carried out to evaluate the use of dietary exogenous enzyme (ENZ) products with amylolytic and fibrolytic activity on nitrogen balance and ruminal alpha and beta diversity of Nellore cattle in feedlot. Rumen cannulated Nellore steers [n = 10; body weigh (BW) = 543 kg ± 28.6 kg] were distributed in a replicate 5 × 5 Latin-square design using individual pens. The treatments consisted of a negative control (CON; without ENZ); Amylase [AML, Amaize, Alltech; 0.5 g/kg of diet dry matter (DM); Xylanase (FBL, Fibrozyme, Alltech; 0.9 g/kg of diet DM]; Half dose (HD; AML 0.25 g/kg of diet DM and FBL 0.45 g/kg of diet DM); and Full dose (FD; AML 0.5 g/kg of diet DM and FBL 0.90 g/kg of diet DM; Table 1). The experimental period lasted 19 d (14 d of adaptation and 5 d of collection). Between d 15 and 18, total urine collection was performed to calculate the nitrogen balance. On d 19 a mixed ruminal sample (6 mL of solid and liquid content) was taken 4 h after feeding and stored at -80 ºC until DNA extraction. Total genomic DNA was extracted using the ZymoBIOMICS DNA Miniprep Kit. The library was prepared using primers for the region V3V4 of the16S rRNA gene; 341F (5’-CCTAYGGGRBGCASCAG-3’) x 806R (5’- GGACTACNNGGGTATCTAAT-3’). The amplicons (~ 470 bp) were sequenced with the Illumina NovaSeq 6000 PE 250 platform. The sequences were analyzed using qiime2 with the SILVA database for the taxonomic assignment. Alpha and beta diversities were calculated in Rstudio using phyloseq. All data were analyzed as orthogonal contrasts assuming treatment as a fixed effect: 1) CON vs. ENZ, 2) AML vs. FBL, 3) HD vs. FD, and 4) AML + FBL vs. HD + FD. Animals that received ENZ had reduced fecal nitrogen excretion (FNE, <span>P</span> = 0.014) and greater efficiency of nitrogen utilization (ENU, <span>P</span> = 0.031) than animals in the CON group. The FBL treatment resulted in greater CP/DOM ratio (<span>P</span> = 0.049), nitrogen balance (<span>P</span> = 0.089), and ENU (<span>P</span> = 0.015) compared with AML treatment. No differences were observed between HD and FD for any nitrogen balance variable (<span>P</span> &gt; 0.10). Animals supplemented with both enzymes (HD + FD) had greater values of N intake (<span>P</span> = 0.018), greater CP/DOM ratio (<span>P</span> = 0.006), and greater FNE (<span>P</span> = 0.002) than animals fed either enzyme alone (AML + FBL). The ENZ supplementation did not impact alpha diversity index or beta diversity (<span>P</span> &gt; 0.10). In conclusion, the addition of exogenous enzymes affected nitrogen balance but not ruminal alpha and beta diversity of Nellore cattle in feedlot.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"09b1a70db9512a729009400e36669b0e8064e3a2dce30a74e51d02e46aff842f","category":"Environment"}