{"title":"Researchers Discover AirDrop Security Flaw That Could Expose Personal Data to Strangers","link":"https://www.macrumors.com/2021/04/23/airdrop-researchers-security-flaw/","date":1619177817000,"content":"AirDrop is a feature that allows Apple devices to securely and conveniently transfer files, photos, and more between each other wirelessly. Users can share items with their own devices, friends, family, or even strangers. The convenience and ease of use, however, may be undermined by a newly discovered security flaw.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/airdrop-logo.jpg\" />\r\n<br />\r\nResearchers at <a href=\"https://www.informatik.tu-darmstadt.de/fb20/ueber_uns_details_231616.en.jsp\">TU Darmstadt have discovered</a> that the process which AirDrop uses to find and verify someone is a contact on a receiver's phone can expose private information. AirDrop includes three modes; Receiving Off, Contacts Only, Everyone. The default setting is Contacts Only, which means only people within your address book can AirDrop photos, files, and more to your device.\r\n<br />\r\n\r\n<br />\r\nThe researchers discovered that the mutual authentication mechanism that confirms both the receiver and sender are on each other's address book could be used to expose private information. The researchers claim that a stranger can use the mechanism and its process within the range of an iOS or macOS device with the share panel open to obtain private information. As the researchers explain: \r\n<br />\r\n<blockquote>As an attacker, it is possible to learn the phone numbers and email addresses of AirDrop users – even as a complete stranger. All they require is a Wi-Fi-capable device and physical proximity to a target that initiates the discovery process by opening the sharing pane on an iOS or macOS device.\r\n<br />\r\n\r\n<br />\r\nThe discovered problems are rooted in Apple's use of hash functions for \"obfuscating\" the exchanged phone numbers and email addresses during the discovery process. However, researchers from TU Darmstadt already showed that hashing fails to provide privacy-preserving contact discovery as so-called hash values can be quickly reversed using simple techniques such as brute-force attacks.\r\n<br />\r\n\r\n<br />\r\nTo determine whether the other party is a contact, AirDrop uses a mutual authentication mechanism that compares a user's phone number and email address with entries in the other user's address book.</blockquote>According to the researchers, Apple was informed of the flaw in May of 2019, and despite several software updates since then, the flaw remains.<div>Tag: <a href=\"https://www.macrumors.com/guide/airdrop/\">AirDrop</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/23/airdrop-researchers-security-flaw/\">Researchers Discover AirDrop Security Flaw That Could Expose Personal Data to Strangers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/researchers-discover-airdrop-security-flaw-that-could-expose-personal-data-to-strangers.2292911/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=GRFTzrLJEPA:WhFfBjGyxsY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=GRFTzrLJEPA:WhFfBjGyxsY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/GRFTzrLJEPA\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"09c439813c150dcb1c0e5236633f823b63e1dfaecc525e8ac5b739ed6db97ef2","category":"Apple"}