{"title":"ผู้ใช้ Android บางเครื่องพบปัญหาติดตั้ง Teams แล้วโทรเบอร์ฉุกเฉินไม่ได้ Microsoft ออกอัพเดตแล้ว","link":"https://www.blognone.com/node/126271","date":1639281809000,"content":"<div><div><div><p>มีผู้ใช้ Reddit ที่ใช้ชื่อ KitchenPicture5849 รายงานผ่าน /r/GooglePixel ว่า มือถือ Google Pixel 3 ที่รัน Android 11 ของเขาไม่สามารถโทรเบอร์ฉุกเฉิน 911 ได้ หลังจากที่แม่ของเขามีอาการโรคหลอดเลือดในสมอง โดยโทรศัพท์จะระบุเหมือนต่อสัญญาณได้และมีเสียงสัญญาณดัง 1 ครั้ง แต่ตัวโทรศัพท์ไม่มีการต่อสัญญาณจริง แต่โชคดีที่ผู้ใช้รายนี้มีโทรศัพท์บ้านจึงสามารถโทร 911 ได้ในที่สุด</p>\n<p>กระทู้นี้ได้รับการโหวตจากผู้ใช้จำนวนมาก หลังจากนั้นตัวแทนของ Google ได้ติดต่อไปหาผู้ใช้คนนี้ พบว่าปัญหาเกิดจากติดตั้ง Microsoft Teams ไว้บนเครื่องแต่ไม่ได้ล็อกอิน โดยจะพบปัญหาบน Android 10 หรือใหม่กว่า แม้ว่าจำนวนผู้ใช้ที่ได้รับผลกระทบจะมีค่อนข้างน้อยแต่เพราะโทรฉุกเฉินไม่ได้ประเด็นนี้จึงสำคัญมาก ทำให้ Google และ Microsoft ต้องร่วมมือกันเพื่อแก้ปัญหานี้อย่างเร่งด่วน</p>\n<p>ล่าสุด Microsoft ได้ออกอัพเดตแอป Teams เวอร์ชันใหม่แล้ว ส่วน Google เองก็กำลังเตรียมออกอัพเดต Android เพื่อแก้บั๊กนี้ โดยกำหนดออกพร้อมกับแพลตฟอร์มอัพเดตของ Android วันที่ 4 มกราคมปีหน้า</p>\n<p>ในข้อมูลเชิงเทคนิค Microsoft Teams จะสร้างอินสแตนซ์ชื่อ PhoneAccount และ register ไว้กับ Android ซึ่งเป็นปกติสำหรับแอปที่ต้องการ handle ระบบโทรศัพท์ แต่ปัญหาของแอป Teams คือสร้างอินสแตนซ์แบบเดียวกันทุกครั้งที่เปิดแอปและยังไม่ได้ล็อกอิน</p>\n<p>ส่วน Android เอง จะมี method ชื่อ sortSimPhoneAccountforEmergency หน้าที่ของ method นี้คือจะเรียง PhoneAccount โดยไล่เช็คทีละค่า โดยรายการสุดท้ายที่เช็คคือ hashcode ซึ่งเป็นจุดที่มีโอกาสเกิด integer overflow/underflow ได้ แต่โอกาสเกิดน้อยมากเนื่องจาก PhoneAccount มีจำนวนน้อยมาก โดยการเปรียบเทียบจะจบตั้งแต่ยังไม่ลงมาถึงบรรทัด hashcode และแม้จะลงมาถึงบรรทัด hashcode โอกาสจะเกิด integer overflow/underflow ก็ไม่ได้ง่ายนัก</p>\n<p>อย่างไรก็ดี เมื่อรวม 2 ปัญหานี้เข้าด้วยกัน คือ Teams ไป register ตัว PhoneAccount เหมือน ๆ กันจำนวนมาก (เพราะ register ทุกครั้งที่เปิดแอป) จึงเป็นการเพิ่มโอกาสให้ลงมาถึงบรรทัดเช็ค hashcode ทำให้ integer overflow/underflow เกิดได้ง่ายกว่าเดิม</p>\n<p>ส่วนผู้ที่สนใจปัญหาเชิงเทคนิคฉบับเต็ม สามารถอ่านได้จากโพสต์ของ <a href=\"https://medium.com/@mmrahman123/how-a-bug-in-android-and-microsoft-teams-could-have-caused-this-users-911-call-to-fail-6525f9ba5e63\">Mishaal Rahman (Medium)</a></p>\n<p>ที่มา - <a href=\"https://www.engadget.com/microsoft-teams-911-call-android-bug-fix-201139753.html\">Engadget</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9bde8cfd5e70c58fce1736cd4f497ba4.jpg\" /><br />\nภาพจาก <a href=\"https://pixabay.com/photos/emergency-emergency-services-1137137/\">ElasticComputeFarm/Pixabay</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/microsoft-teams\">Microsoft Teams</a></div><div><a href=\"/topics/android\">Android</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"09c75286488d10c4238b09d6f2908221d5728d8bf16dd6be3ed846bc907f1fb1","category":"Thai"}