{"title":"Mark Gurman’s New ‘Power On’ Newsletter","link":"https://www.bloomberg.com/news/newsletters/2021-06-27/big-ipads-apple-car-changes-amazon-ar-glasses-inside-big-tech-labs","date":1624924370000,"content":"\n<p>Mark Gurman, in the premiere edition of his newsletter for Bloomberg, Power On:</p>\n\n<blockquote>\n  <p>Let’s get right to the point: I wrote this newsletter on an iPad\nPro. That might not sound like some shocking revelation, but trust\nme, I had all but relegated the tablet to video watching and light\ngaming duties. Since this month’s release of the iPadOS 15 beta,\nhowever, I’ve left my laptop mostly behind and have done the vast\nmajority of my work from the iPad.</p>\n\n<p>Now I have even stronger feelings for what Apple Inc. needs to\nchange about the iPad — and it goes beyond software. It’s time\nfor a giant screen, one in the 14-inch to 16-inch range. I love\nthe speed, touchscreen, versatility and Magic Keyboard, but the\n12.9-inch display is far too small for someone accustomed to a\n16-inch MacBook Pro.</p>\n\n<p>And I’m not the only one who thinks that: I’m told that Apple has\nengineers and designers exploring larger iPads that could hit\nstores a couple of years down the road at the earliest. They’re\nunlikely for next year — with Apple’s attention on a redesigned\niPad Pro in the current sizes for 2022 — and it’s possible they\nnever come at all. But a big iPad would be the perfect device for\nmany people, including me, and would continue to blur the lines\nbetween tablet and laptop.</p>\n</blockquote>\n\n<p>I dig the conversational tone here. Gurman is, indisputably, the best and most accurate Apple rumor reporter. But his writing feels held back by Bloomberg’s restrictive house style for reporting. With this newsletter he’s freed from all the repetitive boilerplate about “<em>people familiar with the matter, who spoke on the condition of anonymity because blah blah blah</em>”.</p>\n\n<p>As for bigger iPads, would a 16-inch iPad still be hand-holdable? If not, would it be in a true laptop enclosure? Or could they make it hand-holdable by making it even thinner?</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/06/28/gurman-power-on\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"09ce045215828a0c4dbb884e4fd1155eca56c47e6d8a4c8026c49b35bb9eca56","category":"Tech"}