{"title":"EU Probes Apple's Decision to Shut Down Epic's Developer Account","link":"https://www.macrumors.com/2024/03/07/eu-probes-apple-termination-epic-account/","date":1709804915000,"content":"The European Commission has requested \"further explanations\" from Apple over its decision yesterday to <a href=\"https://www.epicgames.com/site/en-US/news/apple-terminated-epic-s-developer-account\">terminate the developer account</a> of Epic Games, the <em><a href=\"https://www.ft.com/content/b0655af4-833e-4434-a6f4-5e198f914537\">Financial Times</a></em> reports.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/App-Store-vs-EU-Feature-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe EC said it was investigating under the Digital Markets Act (DMA), a new law aimed at curbing the power of the biggest online platforms. Tech companies faced a March 7 deadline to comply with the legislation. The Commission added that it was also evaluating whether Apple's actions might have breached other EU laws. \r<br />\n\r<br />\nApple on Wednesday <a href=\"https://www.macrumors.com/2024/03/06/apple-explains-terminating-epic-games-account/\">announced</a> the termination of Epic Games Sweden's developer account on a global scale, citing the game developer's recurrent untrustworthy actions. Apple said courts had previously granted Apple the authority to end the accounts of any of Epic's subsidiaries due to contractual infractions.\r<br />\n\r<br />\nThe move thwarted Epic's plan to launch an Epic Games Store on iOS in the EU and bring its Fortnite game back to the iPhone, which it claimed was in line with new EU regulations allowing for alternative app marketplaces on iOS. Starting with iOS 17.4, Apple allows alternative app marketplaces on the iPhone in the EU, as part of its compliance with the DMA. Epic argues that Apple's account termination violates the DMA and significantly limits competition on iOS devices.\r<br />\n\r<br />\nEpic condemned Apple's decision as a violation of competitive principles, interpreting it as evidence of Apple's unwillingness to allow legitimate competition on its platform. The company claimed Apple's action was an attempt to eliminate a major potential rival to the App Store.\r<br />\n\r<br />\nApple's action was the latest in a broader legal conflict that started in 2020 when Apple removed Fortnite from the App Store for bypassing its payment system rules. In retaliation, Epic launched lawsuits in the U.S. and Australia, accusing Apple of anti-competitive behavior. <div>Tags: <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/european-commission/\">European Commission</a>, <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/07/eu-probes-apple-termination-epic-account/\">EU Probes Apple's Decision to Shut Down Epic's Developer Account</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/eu-probes-apples-decision-to-shut-down-epics-developer-account.2421267/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"09cf6781b160bb531d49795167492199220154f63f16c8f38714a0154a1c6a3a","category":"Apple"}