{"title":"Genetic Mechanism of Geothermal Water in Huichang Fault Depression Basin, Southern Jiangxi Province, China: Based on Hydrochemical Characteristics","link":"https://www.preprints.org/manuscript/202405.0268/v1","date":1714983265000,"content":"The Huichang fault Basin in Jiangxi Province exhibits high terrestrial heat flow values and a dense concentration of hot springs. However, existing research is limited to individual geothermal fields without a comprehensive basin-wide analysis of geothermal water origins. This study investigates the source of geothermal water across five representative geothermal fields using hydrochemical components and isotopic analyses. The findings indicate: (1) The hydrochemical type transitions from bicarbonate sulphate-sodium-calcium in the north to bicarbonate sodium-calcium in the south; (2) Major chemical components of the geothermal water derive from evaporative salt rocks (Cretaceous sand conglomerate cover) and siliceous formations (granite/metamorphic rock basement); (3) The recharge elevation for geothermal water is approximately 1 km, sourced from adjacent hills. The central basin's geothermal water has an apparent age of about 26,000 years, with δ¹³C indicating participation in deep circulation; (4) Thermal reservoir temperatures range from 74 to 113℃, with the lowest temperatures at the basin's edges (Anzishan and Shangjin geothermal fields) and higher temperatures towards the center, suggesting increased warming and a circulation depth of 1.5 to 2.5 km; (5) Simulation results of reverse water-rock interaction indicate that mineral precipitation-dissolution processes are governed by the basin's main thermal control structures. The geothermal fields are predominantly influenced by reduction alterations associated with granite and are closely linked to paleo-geothermal waters in the enclosed basin, with the formation of these fields heavily reliant on the heat production or conduction from radioactive elements in granite.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"09ebb05851fbc66d27688c33f11ac9343830378ddff28c031994becca485b795","category":"Interdisciplinary"}