{"title":"Contrast mechanism at landing energy near 0 eV in super low-energy scanning electron microscopy","link":"https://academic.oup.com/jmicro/article/73/3/243/7250156?rss=1","date":1692835200000,"content":"<span><div>Abstract</div>In recent years, the technique of scanning electron microscopy (SEM) observation with low landing energy of a few keV or less has become common. We have especially focused on the drastic contrast change at near 0 eV. Using a patterned sample consisting of Si, Ni and Pt, threshold energies where the total reflection of incident electrons occurs were investigated by SEM at near 0 eV. In both the cases of <span>in-situ</span> and <span>ex-situ</span> sample cleaning, drastic changes in the brightness of each material were observed at near 0 eV, with threshold energies in the order Si &lt; Ni &lt; Pt. This order agreed with the order of the literature values of the work functions and the surface potentials measured by Kelvin force probe microscopy. This result suggests that the difference of the threshold energy is caused by the difference in surface potential due to the work function difference of each material. Although the order of the threshold energies also agreed with those of work functions reported in the literature, the work functions of air-exposed surfaces should be rather considered as ‘modified work functions’, since they could be significantly altered by the adsorbates, etc. Nevertheless, the difference of the threshold energy for each material was observed with commercial SEM at landing energy near 0 eV, which opens a new possibility to distinguish materials, although the difference should be rather recognized as ‘fingerprints’, since surface potentials are sensitive to conditions of surface treatments and atmospheric exposure.</span>","author":"","siteTitle":"Microscopy Current Issue","siteHash":"60a1297b225cb0d11d4d9bb729ba33f4e93147012db6d6a2eafbfc087077a550","entryHash":"09f789956e5f0e81e7784b0a2492c1b46b45ffaf9d09dcd2794b052336279ce0","category":"Environment"}