{"title":"Identifying freshness of various chilled pork cuts using rapid imaging analysis","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13865?af=R","date":1725873551000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Determining the freshness of chilled pork is of paramount importance to consumers worldwide. Established freshness indicators such as total viable count, total volatile basic nitrogen and pH are destructive and time-consuming. Color change in chilled pork is also associated with freshness. However, traditional detection methods using handheld colorimeters are expensive, inconvenient and prone to limitations in accuracy. Substantial progress has been made in methods for pork preservation and freshness evaluation. However, traditional methods often necessitate expensive equipment or specialized expertise, restricting their accessibility to general consumers and small-scale traders. Therefore, developing a user-friendly, rapid and economical method is of particular importance.</p>\n<h2>RESULTS</h2>\n<p>This study conducted image analysis of photographs captured by smartphone cameras of chilled pork stored at 4 °C for 7 days. The analysis tracked color changes, which were then used to develop predictive models for freshness indicators. Compared to handheld colorimeters, smartphone image analysis demonstrated superior stability and accuracy in color data acquisition. Machine learning regression models, particularly the random forest and decision tree models, achieved prediction accuracies of more than 80% and 90%, respectively.</p>\n<h2>CONCLUSION</h2>\n<p>Our study provides a feasible and practical non-destructive approach to determining the freshness of chilled pork. © 2024 Society of Chemical Industry.</p>","author":"Haoran Cheng, \nJinglei Li, \nYulong Yang, \nGang Zhou, \nBaocai Xu, \nLiu Yang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"09f86c1c0f8112f4c8f3ad6c5dcc5e234e3c5a77568069099ab0aca94cb27a6e","category":"Environment"}