{"title":"Tour de France Femmes 2023 Route: Time trial and the Tourmalet","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-2023-route-time-trial-and-the-tourmalet","date":1689753600000,"content":"\n      \n<div>\n<p>After a huge successful inaugural edition, the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> will return this year with a similar format that worked so well last year.</p>\n<p><span>Once again there will be a total of eight stages, beginning on the day the men’s Tour de France finishes, and once again the key GC contests will take place during the final weekend of racing.</span></p>\n<div></div>\n<p><span>But there are also several tweaks from last year’s race that will make the contest for overall victory significantly different, as well as taking more steps to establish a distinct identity for the race.</span></p>\n<h3><span>Tour de France Femmes 2023 map and route</span></h3>\n<div><span>Firstly, the race will break the shackles that tie it to the men’s race by beginning in Clermont-Ferrand rather than Paris, meaning it will open as a stand-alone event rather than one held concurrently with the finale of the men on the Champs-Élysées. This will also make for a less predictable opener, with enough climbs to encourage attacks and swing the advantage away from the sprinters, giving the punchier c<span>ompetitors </span>a chance to wear the first yellow jersey handed out. </span></div>\n<div><span></span></div>\n<div><span>As for the long-term race for yellow, this time anyone hoping to win it will need to negotiate a time trial stage. A 22km route in Pau will end the Tour after last year’s edition was notably lacking in any kilometres against the clock, giving this year’s route a more complete, rounded feel to it.</span></div>\n<br />\n<p><span>Above all, though, it’s the Col du Tourmalet that will decide the final outcome of the overall classification. That’s the feature of the route that has attracted the headlines, and understandably so — though last year’s Planche des Belles Filles came with a reputation due to its recent inclusions in the men’s Tour, it pales in comparison to the truly legendary Tourmalet in terms of both difficulty and history.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/4ade4_1024x1024.jpg?v=1667013456\" alt />That stage is likely to be the deafening moment of the race, but to get there the riders must trek through the hilly terrain of the Massif Central for several difficult stages. It’s hard to find any nailed-on days for the sprinters, with most stages featuring at least some climbing to complicate matters. Though there’s no single climbing test that can even come close to comparing with the Tourmalet, there are opportunities here for plenty of exciting GC action. </span></p>\n<p><span>For anyone who is not confident of winning on the Tourmalet (in other words, anyone who’s not defending champion Annemiek van Vleuten), attacks in these stages, whether opportunist or carefully planned-out, might just be their best chance of glory. The final weekend is the box office attraction, but this is a Tour where the battle for the yellow jersey will be conducted from start to finish. </span></p>\n<h3><span>TOUR DE FRANCE FEMMES 2023 - STAGE ONE: CLERMONT-FERRAND &gt; CLERMONT-FERRAND, 124KM</span></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/905de_1024x1024.jpg?v=1667013492\" alt />As well as a change of location from Paris to Clermont-Ferrand, the opening stage of the second Tour de France Femmes will also see a different outcome from last year’s bunch sprint, with the steep slopes of the Côte de Durtol situated just 9km from the finish likely to determine the first leader of the race. </span></p>\n<h3><span>TOUR DE FRANCE FEMMES 2023 - STAGE TWO: CLERMONT-FERRAND &gt; MAURIAC, 148KM</span></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ca443_1024x1024.jpg?v=1667013524\" alt />Constant undulations make this a real testing day in the Massif Central that could even spark some significant GC action, despite the lack of a single really tough climb. Crested just 1.5km from the finish, the Côte de Merlac is going to be pivotal in deciding the day's winner. </span></p>\n<h3><span>TOUR DE FRANCE FEMMES 2023 - STAGE THREE: COLLONGES-LA-ROUGE &gt; MONTIGNAC-LASCAUX, 147KM</span></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/9478b_1024x1024.jpg?v=1667013556\" alt />Following two unappealing days for the sprinters, stage three is the first probable finish of the race. There are still some tough roads for them to survive early on though, with five categorised climbs included during the first half of the stage. </span></p>\n<h3><span>TOUR DE FRANCE FEMMES 2023 - STAGE FOUR: CAHORS &gt; RODEZ, 177KM</span></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/13f85_1024x1024.jpg?v=1667013584\" alt />The longest stage by a significant margin, stage five seems designed to be an attritional test of endurance. The first 130km will wear the riders down without seeing much action, after which they must haul their weary legs up a succession of hills favourable to the puncheurs. </span></p>\n<h3><span>TOUR DE FRANCE FEMMES 2023 - STAGE FIVE: ONET-LE-CHÂTEAU &gt; ALBI, 126KM</span></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/53896_1024x1024.jpg?v=1667013619\" alt />There’s yet more rolling terrain on the menu during stage five, particularly during the middle section, but a flat final 24km run-in to the finish could mean the sprinters are triumphant in Albi. </span></p>\n<h3><span>TOUR DE FRANCE FEMMES 2023 - STAGE SIX: ALBI &gt; BLAGNAC, 122KM</span></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/51773_1024x1024.jpg?v=1667013652\" alt />The second-shortest road stage of the Tour is also one of the flattest. There are four small categorised climbs en route, but not many unclassified rises in between, meaning this should be one last bunch finish for the sprinters. </span></p>\n<h3><span>TOUR DE FRANCE FEMMES 2023 - STAGE SEVEN: LANNEMEZAN &gt; TOURMALET BAGNERES-DE-BIGORRE, 90KM</span></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/0cb44_1024x1024.jpg?v=1667013683\" alt />Whatever time gaps might separate the GC are likely to be obliterated on the mighty Col du Tourmalet, where we can confidently say the overall title will be determined. The stage has been limited to just 90km to ease the difficulty, but there’s still room to include another Pyrenean monster, the Col d’Aspin. </span></p>\n<h3><span>TOUR DE FRANCE FEMMES 2023 - STAGE EIGHT: PAU &gt; PAU, 22KM ITT</span></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/48bee_1024x1024.jpg?v=1667013719\" alt />Unlike last year’s edition, a time trial will feature in the second Tour de France Femmes. Its mostly flat terrain will aid the specialists, and at 22km, it’s long enough to generate late changes if there are still close time gaps despite the Tourmalet.</span></p>\n<div></div>\n</div>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0a05acf0653544d6228e216e8eb0883e7a0fc157c855f89d0c0b3e6396992e28","category":"Cycling"}