{"title":"Stimulatory effect of peritrophin on vitellogenesis in female banana shrimp, Fenneropenaeus merguiensis","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16097?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>Glass bottom boat (Gbb) is a member of the transforming growth factor β family that plays several physiological roles in arthropods, including in reproduction. Recently, <i>Fenneropenaeus merguiensis</i>'s Gbb (FmGbb) was demonstrated to play a stimulatory role in vitellogenesis of the banana shrimp, but potential partners of FmGbb have not been identified. Therefore, this study aimed to identify proteins that interact with FmGbb and characterize their gonad-regulating function. A yeast two-hybrid assay revealed three potential candidates: peritrophin (FmPT), polehole-like protein (FmPhl), and an uncharacterized protein. Expressions of <i>FmPT</i> and <i>FmPhl</i> were found mainly in the ovaries and significantly increased in the developing stages. However, in a GST-pull down assay, there was no protein–protein interaction between soluble recombinant glutathione-S transferase-fused FmPT (GST-rPT) protein and the recombinant FmGbb protein (His-TF-rgbb). The vitellogenesis stimulatory role of FmPT was then investigated both in vitro and in vivo. Ovarian explants treated with GST-rPT showed no significant change of vitellogenin (<i>Vg</i>) expression, but the injection of GST-rPT in ovaries and hepatopancreas of previtellogenic shrimp did induc <i>Vg</i> expression, suggesting a vitellogenesis stimulating activity of FmPT. Our findings show that FmPT has a novel role in vitellogenesis stimulation and has the potential to be developed as a gonad-stimulating bioproduct for use in shrimp aquaculture.</p>","author":"Ponsit Sathapondecha, \nManita Nonsung, \nWilaiwan Chotigeat","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"0a17950cc1dad1ac3447d614de61802f703f71ac7619424a46fa61a7aad7c908","category":"Environment"}