{"title":"Effectiveness of Atezolizumab in Metastatic Large Cell Neuroendocrine Carcinoma of the Lung and the Predictive Value of miR-375. The LANCE Trial, a Pilot Study","link":"https://www.preprints.org/manuscript/202403.0593/v1","date":1710175778000,"content":"Background: Large-cell neuroendocrine carcinoma presents significant treatment challenges owing to its rarity and limited therapeutic options. The LANCE study was designed to explore the survival benefits of incorporating atezolizumab in chemotherapy for metastatic LCNEC.\nMethods: In this non-randomized study, patients with metastatic LCNEC were treated with ei-ther standard chemotherapy plus atezolizumab or standard chemotherapy alone. The primary outcomes measured were progression-free survival (PFS) and overall survival (OS), with an ex-ploratory analysis of miR375 in plasma as a potential biomarker.\nResults: Of the 22 screened patients, 17 met the inclusion criteria and were stratified into the atezolizumab and chemotherapy (n=10) or chemotherapy alone(n=7) groups. After a median follow-up of 23.3 months, the 12-month survival rate for the atezolizumab group was 57.1% (95% CI: 32.6%-100%) and 45.7% at 24 months (95% CI: 22.4%-93.2%). In contrast, the chemotherapy group had a 14.3% survival rate at both 12 and 24 months (95% CI: 2.33%-87.7%). The log-rank test for survival showed a statistically significant difference in the atezolizumab-treated group (chi-squared = 4, df = 1, p = 0.04). A non-significant correlation was found between disease pro-gression and elevated levels of miR375.\nConclusions: This pilot study suggests that atezolizumab combined with chemotherapy may be effective in treating metastatic LCNEC. The non-significant correlation between plasma miR375 levels and disease progression suggests its biomarker potential, warranting further validation research.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0a1b134e0a82f33a44b2a59520e109426b835fe8b5335c2edce359a49d39e4ca","category":"Interdisciplinary"}