{"title":"Proteome profiling reveals opportunities to investigate biomarkers of oxidative stress and immune responses in blubber biopsies from free-ranging baleen whales","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae059/7735810?rss=1","date":1724025600000,"content":"<span><div>Abstract</div>Over 25% of cetacean species worldwide are listed as critically endangered, endangered or vulnerable by the International Union for Conservation of Nature. Objective and widely applicable tools to assess cetacean health are therefore vital for population monitoring and to inform conservation initiatives. Novel blubber biomarkers of physiological state are examples of such tools that could be used to assess overall health. Proteins extracted from blubber likely originate from both the circulation and various cell types within the tissue itself, and their expression is responsive to signals originating from other organs and the nervous system. Blubber proteins can therefore capture information on physiological stressors experienced by individuals at the time of sampling. For the first time, we assess the feasibility of applying shotgun proteomics to blubber biopsy samples collected from free-ranging baleen whales. Samples were collected from minke whales (<span>Balaenoptera acutorostrata</span>) (<span>n</span> = 10) in the Gulf of St Lawrence, Canada. Total protein was extracted using a RIPA cell lysis and extraction buffer-based protocol. Extracted proteins were separated and identified using nanoflow Liquid Chromatography Electrospray Ionization in tandem with Mass Spectrometry. We mapped proteins to known biological pathways and determined whether they were significantly enriched based on the proteome profile. A pathway enrichment map was created to visualize overlap in tissue-level biological processes. Amongst the most significantly enriched biological pathways were those involved in immune system function: inflammatory responses, leukocyte-mediated immunity and the humoral immune response. Pathways associated with responses to oxidative stress were also enriched. Using a suite of such protein biomarkers has the potential to better assess the overall health and physiological state of live individuals through remote biopsy sampling. This information is vital for population health assessments to predict population trajectories, and ultimately guide and monitor conservation priorities and initiatives.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"0a209bc1670c1cd86f3571a3357a2be445c955350a9c572a8343572adbb07796","category":"Environment"}