{"title":"Widespread breakdown in masting in European beech due to rising summer temperatures","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17307?af=R","date":1715005723000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/85830d88-4d3e-4cad-a86c-9347858956c2/gcb17307-toc-0001-m.png\" alt=\"Widespread breakdown in masting in European beech due to rising summer temperatures\" />\n<p>As summer temperatures rise, annual seed crop size is becoming less variable over time in European beech, and the decline in variability is greatest where temperatures are increasing fastest. Additionally, years with no or few seeds became less common during the last four decades, signalling that seed predators may no longer be suppressed by cycles of starvation and satiation. The decline in variability may hinder beech regeneration under climate change despite an overall increase in seed production, and has broader implications for the functioning of forest ecosystems.</p>\n<br />\n<h2>Abstract</h2>\n<p>Climate change effects on tree reproduction are poorly understood, even though the resilience of populations relies on sufficient regeneration to balance increasing rates of mortality. Forest-forming tree species often mast, i.e. reproduce through synchronised year-to-year variation in seed production, which improves pollination and reduces seed predation. Recent observations in European beech show, however, that current climate change can dampen interannual variation and synchrony of seed production and that this masting breakdown drastically reduces the viability of seed crops. Importantly, it is unclear under which conditions masting breakdown occurs and how widespread breakdown is in this pan-European species. Here, we analysed 50 long-term datasets of population-level seed production, sampled across the distribution of European beech, and identified increasing summer temperatures as the general driver of masting breakdown. Specifically, increases in site-specific mean maximum temperatures during June and July were observed across most of the species range, while the interannual variability of population-level seed production (CVp) decreased. The declines in CVp were greatest, where temperatures increased most rapidly. Additionally, the occurrence of crop failures and low seed years has decreased during the last four decades, signalling altered starvation effects of masting on seed predators. Notably, CVp did not vary among sites according to site mean summer temperature. Instead, masting breakdown occurs in response to warming local temperatures (i.e. increasing relative temperatures), such that the risk is not restricted to populations growing in warm average conditions. As lowered CVp can reduce viable seed production despite the overall increase in seed count, our results warn that a covert mechanism is underway that may hinder the regeneration potential of European beech under climate change, with great potential to alter forest functioning and community dynamics.</p>","author":"Jessie J. Foest, \nMichał Bogdziewicz, \nMario B. Pesendorfer, \nDavide Ascoli, \nAndrea Cutini, \nAnita Nussbaumer, \nArne Verstraeten, \nBurkhard Beudert, \nFrancesco Chianucci, \nFrancesco Mezzavilla, \nGeorg Gratzer, \nGeorges Kunstler, \nHenning Meesenburg, \nMarkus Wagner, \nMartina Mund, \nNathalie Cools, \nStanislav Vacek, \nWolfgang Schmidt, \nZdeněk Vacek, \nAndrew Hacket‐Pain","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"0a2bc3b8a68701bae231c138e386f7542c3cb29924a96a6b189b52165335fa53","category":"Environment"}