{"title":"Endophytic and epiphytic metabarcoding reveals fungal communities on cashew phyllosphere in Kenya","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305600","date":1721224800000,"content":"<p>by Dennis Wamalabe Mukhebi, Colletah Rhoda Musangi, Everlyne Moraa Isoe, Johnstone Omukhulu Neondo, Wilton Mwema Mbinda</p>\r\n\r\nPlants intimately coexist with diverse taxonomically structured microbial communities that influence host health and productivity. The coexistence of plant microbes in the phyllosphere benefits biodiversity maintenance, ecosystem function, and community stability. However, differences in community composition and network structures of phyllosphere epiphytic and endophytic fungi are widely unknown. Using Illumina Miseq sequencing of internal transcribed spacer (ITS) and 28S rRNA gene amplicons, we characterised the epiphytic and endophytic fungal communities associated with cashew phyllosphere (leaf, flower and fruit) from Kwale, Kilifi and Lamu counties in Kenya. The ITS and 28S rRNA gene sequences were clustered into 267 and 108 operational taxonomic units (OTUs) at 97% sequence similarity for both the epiphytes and endophytes. Phylum <i>Ascomycota</i> was abundant followed by <i>Basidiomycota</i>, while class <i>Saccharomycetes</i> was most dominant followed by <i>Dothideomycetes</i>. The major non-ascomycete fungi were associated only with class <i>Tremellales</i>. The fungal communities detected had notable ecological functions as saprotrophs and pathotrophs in class <i>Saccharomyectes</i> and <i>Dothideomycetes</i>. The community composition of epiphytic and endophytic fungi significantly differed between the phyllosphere organs which was statistically confirmed by the Analysis of Similarity test (ANOSIM Statistic R: 0.3273, for 28S rRNA gene and ANOSIM Statistic R: 0.3034 for ITS). The network analysis revealed that epiphytic and endophytic structures were more specialized, modular and had less connectance. Our results comprehensively describe the phyllosphere cashew-associated fungal community and serve as a foundation for understanding the host-specific microbial community structures among cashew trees.","author":"Dennis Wamalabe Mukhebi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0a35832e41d4abca359a3f21e85cbd694b34afdc93909e05d5f237c31681deda","category":"Interdisciplinary"}