{"title":"True เปิดตัวแอป TrueX แพลตฟอร์มรวมโซลูชันที่ตอบโจทย์การใช้ชีวิต","link":"https://www.blognone.com/node/133473","date":1681810452000,"content":"<div><div><div><p>True เดินหน้าสู่เทคคอมปานีเต็มรูปแบบ ประกาศเปิดตัวแบรนด์ใหม่ทรูเอ็กซ์ (TrueX) เป็นแพลตฟอร์มแอปที่ True บอกว่านำเสนอเทคโนโลยีการใช้ชีวิตอัจฉริยะที่จะยกระดับการใช้ชีวิตของคนไทยด้วย Digital infrastucture โดยเชื่อมโยงการทำงานของ AI, Cloud รวมอุปกรณ์ IoT ผสานเข้ากับเครือข่าย 5G</p>\n<p>แอปพลิเคชัน TrueX มาพร้อมคอนเซปต์ “LifeOS เทคโนโลยีเพื่อชีวิตอัจฉริยะ” แอปฯ เดียวตอบโจทย์ทุกการบริการและตอบโจทย์ทุกด้านการใช้ชีวิต โดยรวมโซลูชัน 6 ด้านสำหรับการใช้ชีวิต ตั้งแต่บ้าน (สมาร์ตโฮม), สุขภาพ, การเรียนออนไลน์, พลังงาน, ช็อปปิ้งและเอ็นเตอร์เทนเมนต์ ดังนี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/835887412cdb510ad6451213b6680ced.jpg\" /></p>\n<p>-X Home: โซลูชันและแพ็กเกจดูแลบ้าน เทคโนโลยีควบคุมบ้านอัจฉริยะที่เชื่อมต่ออุปกรณ์ IoT ภายในบ้านได้จากทุกที่ ผ่านระบบสั่งการด้วยเสียงและระบบแจ้งเตือนแบบเรียลไทม์เพื่อความปลอดภัยตลอด 24 ชั่วโมง</p>\n<p>-X Health: โซลูชันและแพ็กเกจเพื่อสุขภาพ ปรึกษาหมอผ่านแอปฯ MorDee (หมอดี) พร้อมบริการจัดส่งยาถึงบ้าน</p>\n<p>-X Learning: โซลูชันและแพ็กเกจเพื่อการเรียนรู้ ผ่านคอร์สเรียนออนไลน์ VCourse ครอบคลุมทุกทักษะในอนาคต การตลาดออนไลน์ ทักษะด้านภาษา เทคโนโลยี การเงิน การลงทุนเป็นต้น</p>\n<p>-X Utility &amp; Energy: โซลูชันและแพ็กเกจประหยัดพลังงาน เพื่อคุณภาพชีวิตที่ดีขึ้น เช่น เครื่องกรองน้ำอัจฉริยะสามารถตั้งค่าและอ่านผลกรองน้ำผ่านแอปฯ, Solar Rooftop และ EV Charger ที่ออกแบบให้เหมาะสมกับพื้นที่และปริมาณการใช้ไฟฟ้าของแต่ละบ้าน</p>\n<p>-X Shopping: โซลูชันและแพ็กเกจช้อปคุ้ม ดีลพิเศษทั้งสินค้า IT, อุปโภคและบริโภคผ่านร้านค้าชั้นนำภายในแอปฯ เดียว</p>\n<p>-X Entertainment: โซลูชันและแพ็กเกจความบันเทิง เชื่อมต่อ True5G VR</p>\n<p>TrueX จะให้บริการแบบ All in one ครบวงจรตั้งแต่ติดตั้งไปจนถึงหลังการขาย มีบริการเปลี่ยนเครื่องหรืออุปกรณ์ให้ใหม่เมื่อชำรุด พร้อมผู้เชี่ยวชาญที่ให้คำปรึกษาตลอด 24 ชั่วโมง TrueX เปิดให้ดาวน์โหลดใช้งานได้แล้วทั้งระบบ<a href=\"https://play.google.com/store/apps/details?id=com.truedigitaltdg.smartlivingtechint&amp;hl=th&amp;gl=US&amp;pli=1\">Android</a> และ <a href=\"https://apps.apple.com/th/app/livingtech/id1590630747\">iOS</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b8d0b8de60ac61421086a50ae9ca4254.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/true\">True</a></div><div><a href=\"/topics/truex\">TrueX</a></div><div><a href=\"/topics/iot\">IoT</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0a3e7905fd29cde27bc204eaa46e612e624b339a8204075506898eb095859b94","category":"Thai"}