{"title":"A17 preview: Will Apple’s first 3nm chip deliver a quantum leap for the iPhone 15?","link":"https://www.macworld.com/article/1532925/a17-bionic-preview-benchmarks-performance-ram-neural-engine.html","date":1678985557000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Every year, Apple introduces a new A-series processor with its iPhone upgrades in the fall. We don’t expect anything different this year. In fact, the jump to a new manufacturing process technology—TSMC’s 3nm process—gives the A17 an opportunity to be the most significant leap in performance and features in several years.</p>\n\n\n\n<p>By looking at the past decade of in-house Apple-designed A-series chips, together with what we know about the manufacturing technology available and the company’s direction and goals, we can piece together a pretty good educated guess about what to expect from the A17.</p>\n\n\n\n<h2>Just for iPhone 15 Pro (or Ultra)</h2>\n\n\n\n<p>Last year, the A16 was exclusive to the iPhone 14 Pro, while the standard iPhone 14 used the A15. We expect a repeat of that pattern this year, where the new A17 is exclusive to the <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15 Pro and iPhone 15 Pro Max</a> (or <a href=\"https://www.macworld.com/article/1487037/iphone-15-ultra-design-display-camera-specs-price.html\">iPhone 15 Ultra</a>, if the rumors are true) and the standard iPhone 15 gets the A16 used in the iPhone 14 Pro models.</p>\n\n\n\n<p>Is this the way forward for Apple for the foreseeable future? With smartphone features and quality reaching something of a plateau and Apple’s phone chips running circles around most Android phones, there’s little reason to change. For Apple, it reduces costs and helps create a bigger differentiator between regular and Pro models, which tends to push customers toward the more expensive iPhone.</p>\n\n\n\n<h2>Apple’s first 3nm chip</h2>\n\n\n\n<p>The A14, A15, and A16 were all made using a 5nm manufacturing process from TSMC. Granted, that process has evolved over time, producing chips that are denser and have improved power efficiency, but there’s nothing quite like the leap to the next major process node. And that’s what we’re almost certainly going to get with the A17—the first large-scale consumer chip made with TSMC’s 3nm process.</p>\n\n\n\n<p>I wrote at length about the advantage Apple will enjoy with a 3nm process, and the big one is more density–while the A16 was about 16 billion transistors, we can expect well over 20 billion for the A17, perhaps as high as about 24 billion.</p>\n\n\n\n<p>The 3nm process offers more power efficiency, with a comparable chip at a comparable speed, but Apple isn’t going to make a comparable chip at a comparable speed. Maximum power draw will be limited by battery size, thermal dissipation, and other factors, and I don’t think we can expect a massive shift in battery life from the move to 3nm alone. At least, not for active use under full power–not only will the chip likely consume nearly as much power in that scenario, but the display and radios also contribute so much to the power drain.</p>\n\n\n\n<p>Where we may see some improvement is in standby mode, which may get noticeably better with the move to the 3nm process.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/01/a17-graphic.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"A17 chip graphic\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/01/a17-graphic.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/01/a17-graphic.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/01/a17-graphic.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/01/a17-graphic.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/01/a17-graphic.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/01/a17-graphic.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/01/a17-graphic.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/01/a17-graphic.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>CPU performance and features</h2>\n\n\n\n<p>ARM <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.arm.com/company/news/2021/03/arms-answer-to-the-future-of-ai-armv9-architecture&amp;xcust=1-1-1532925-1-0-0&amp;sref=https://www.macworld.com/feed\">launched its v9 architecture in 2021</a>, and we thought the A16 might be Apple’s first chip to support the new v9 instruction set. Instead, it supports ARM v8.6 with plenty of Apple’s own extensions. This year, with a higher transistor budget, it seems ARM v9 support is likely.</p>\n\n\n\n<p>What advantages do the ARM v9 instruction set and architecture provide? Apple designs its own CPU cores, and many of the performance benefits promised by the v9 architecture are already realized in Apple’s designs and ARM extensions. Indeed, the Snapdragon 8 Gen 1 was one of the first high-end smartphone CPUs with ARM’s Cortex-X2 core with support for ARM v9, and Apple’s A15 outperformed it by a wide margin.</p>\n\n\n\n<p>You’ll see a lot of claims that ARM v9 offers a 30 percent performance improvement over ARM v8, but that’s for ARM’s own core designs, and doesn’t take into account the use of custom extensions. Apple’s in a whole other league here–we probably won’t see 30 percent faster CPU performance from the A17.</p>\n\n\n\n<p>Apple’s new CPU cores for the A17 will almost certainly be faster, but not <em>necessarily</em> because of the shift to ARM v9. CPU core performance is influenced by the instruction set, branch prediction, instruction decode, execution units, cache structure and size, clock speeds, and many other factors.</p>\n\n\n\n<p>As far as general core count goes, there doesn’t seem to be much reason for Apple to move beyond the 4 efficiency cores and 2 performance cores that have been with us since the A11 Bionic. We just expect a good 15 percent more performance out of them.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-single.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple A17 projections geekbench\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-single.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-single.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-single.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-single.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /><figcaption>A projected Geekbench score for the A17, following the trend of the last several years.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Simply projecting the last several years of CPU performance improvement, we can probably expect a Geekbench 5 single-core score between 2,100 and 2,200, and a multi-core score of just over 6,000. Geekbench 6 was just released and we don’t have years of benchmark data to create an accurate projection, but a single-core score of over 2,800 and a multi-core score of 7,300 or more seems justifiable. A <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/Tech_Reve/status/1635500693531525120&amp;xcust=1-1-1532925-1-0-0&amp;sref=https://www.macworld.com/feed\">recent leak</a> that claims a single-core score of 3019 and a multi-core score of 7,860 isn’t out of the realm of possibility—especially since we saw a larger-than-expected leap when Apple moved from a 7nm process to a 5nm one with the A14—but numbers this early are likely completely made up.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-multi.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple A17 projections geekbench\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-multi.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-multi.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-multi.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-multi.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /><figcaption>A projected Geekbench score for the A17, following the trend of the last several years.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>In case you’re wondering how that stacks up to other processors, that would give the A17 a single-core score similar to the latest Ryzen high-end desktop CPUs and 13th-gen Core i7 Intel processors, but a far lower multi-core score (which makes sense, as we’re talking about only two high-performance cores versus 12 or more in those desktop processors). The A16 already soundly beats Android phones with the top-tier Snapdragon 8 Gen 2, and the A17 should only widen the gap.</p>\n\n\n\n<p>If we’ve learned anything over the years, it’s just how <em>steady</em> the performance improvement is for Apple’s CPUs. Single- and multi-core performance goes up at a nearly straight line, no matter which years have big architectural changes or manufacturing process leaps. It’s very reasonable to expect a similar improvement this year.</p>\n\n\n\n<h2>GPU performance and features</h2>\n\n\n\n<p>The GPU is one area where the A17 could potentially be very interesting. Apple has been increasing GPU performance by an average of around 20 percent or so with each new A-series chip, though it can be anywhere from 15 percent to 30 percent. What hasn’t changed a whole lot is the overall feature set of the GPU. It’s getting faster, and there have been some minor new features like variable rasterization rates and SIMD improvements for GPU compute, but Apple is <em>years</em> behind desktop GPUs in important features like ray tracing acceleration.</p>\n\n\n\n<p>A sketchy rumor said that the A16 was intended to have a major GPU architecture but it wasn’t ready in time, so it got the same GPU as the A15 (but more memory bandwidth improves performance). I don’t know if that’s true, but Apple hasn’t updated its <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/metal/Metal-Feature-Set-Tables.pdf&amp;xcust=1-1-1532925-1-0-0&amp;sref=https://www.macworld.com/feed\">Metal feature set tables for developers</a> to include the A16, which is telling.</p>\n\n\n\n<p>I think it’s likely that Apple has an updated GPU architecture ready to go for A17. Features like ray tracing acceleration may not be critical for iPhone, but this GPU design will find its way into future M-series Mac processors, where the lack of advanced GPU features like ray tracing acceleration put them far behind state of the art.</p>\n\n\n\n<p>We can also expect improved performance in current 3D games and applications that use the GPU for computation. When the architecture changes, the speedup tends to be variable–some things get a lot faster, and other things not so much. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-compute.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple A17 projections geekbench\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-compute.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-compute.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-compute.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-GB5-compute.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /><figcaption>No Android device comes close to Apple in Geekbench compute scores.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Staying the course with a roughly 20 percent speedup produces a Geekbench 5 GPU compute score of over 18,000. Remember, that benchmark measures the <em>computational</em> performance of the GPU, not its ability to render 3D graphics.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-3DM-wildlife.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple A17 projections 3Dmark\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-3DM-wildlife.jpg?quality=50&amp;strip=all 1368w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-3DM-wildlife.jpg?resize=300%2C218&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-3DM-wildlife.jpg?resize=768%2C558&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/A17-preview-3DM-wildlife.jpg?resize=1200%2C872&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"872\" /><figcaption>We expect better performance out of the A17 GPU, but it’s new features we hope for the most.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>For 3D graphics, a 20 percent speedup would result in the modern 3DMark Wild Life Unlimited test running at around 88fps versus 74fps with the A16. Currently, the Snapdragon 8 Gen 2 is faster than the A16 in this test (and other 3D graphics tests), but this would put Apple slightly ahead.</p>\n\n\n\n<p>Relative to CPU improvements, GPU performance is more varied from year to year. The improvement from A15 to A16 was muted, owing mostly to slight clock speed improvements and improved memory bandwidth. This year, if we get both a new GPU architecture and a major manufacturing process improvement, the leap could be much larger.</p>\n\n\n\n<p>The media engine is often loosely associated with the GPU, and so this is as good a time as any to say we will once again hope for hardware to accelerate encode and decode of the AV1 format. It’s in most of the new generation of PC GPUs, after all. We expect Apple to continue to invest in the performance and power efficiency of its encoders for H.264, HEVC, and ProRes formats.</p>\n\n\n\n<h2>A continued focus on ML and AI</h2>\n\n\n\n<p>Apple is big into machine learning and AI. While it doesn’t appear to be pushing as hard as its competitors in the <a href=\"https://www.macworld.com/article/1507282/generative-ai-chatgpt-midjourney-bard-bing-siri.html\">generative AI race</a> led by projects like ChatGPT, Midjourney, and Stable Diffusion, the company has used AI and machine learning throughout its operating system and apps for years. New features like the ability to select text in photos are implemented all the time, and Apple dedicates a lot of area to its Neural Engine (the accelerator for machine learning tasks).</p>\n\n\n\n<p>In the A16, Apple didn’t seem to change the Neural Engine much at all. It’s still 16 cores, and at 17 trillion operations per second is only 8% faster than the A15’s Neural Engine. That’s a small enough leap to assume it simply runs at a higher clock speed. Frankly, we expected much more.</p>\n\n\n\n<p>With the 3nm process making a much bigger transistor budget possible, the Neural Engine will probably take a significant leap. It could be just more cores, big design changes to the way the cores operate, or both. I’d be surprised if it doesn’t deliver over 20 trillion operations per second, though there is some argument over whether “trillions of operations per second” is really the best way to measure performance.</p>\n\n\n\n<h2>Faster LPDDR5x RAM</h2>\n\n\n\n<p>With the A16, Apple boosted the RAM to LPDDR5 (from LPDDR4x in the A15). Competing top-tier chips like the Snapdragon 8 Gen 2 use LPDDR5x, which delivers about 33 percent more bandwidth and lower memory latency while using the same power.</p>\n\n\n\n<p>More memory bandwidth is good for everything, especially when it doesn’t use more power. The most obvious beneficiary will be high-end 3D games, which stress both CPU and GPU in ways that push the limits of memory bandwidth.  </p>\n\n\n\n<p>Apple’s not always the fastest to jump on new memory standards, but it does prioritize memory bandwidth and big caches and seems to recognize the benefit of <em>moving things around</em> faster instead of just <em>processing</em> things faster. I give it 50/50 odds that we’ll see LPDDR5x RAM in the A17.</p>\n\n\n\n<h2>Still a Snapdragon modem (for now)</h2>\n\n\n\n<p>Apple is expected to start using <a href=\"https://www.macworld.com/article/1528478/qualcomm-5g-modem-2024-iphones.html\">its own 5G modems</a> starting next year, probably with the iPhone SE in the spring and, if things go well, later in the iPhone 16 line in the fall.</p>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/618603/apples-first-5g-modem-may-compete-with-qualcomms-snapdragon-x70.html\">Snapdragon X70</a> is probably the modem Apple will use for the iPhone 15 line (at least the Pro models). Most of the X70’s top-line features sound basically the same as the X65 that you find in the iPhone 14 Pro, but it has a small integrated AI processor that constantly monitors and optimizes connection states, which is supposed to result in more stable and optimal connections. That it is supposed to improve real-world speed and boost battery life as well.</p>\n\nCPUs and Processors, iPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0a4457469c030e99bd8a494d0530140566f621240bff425f2c4089ea8d9daeb3","category":"Apple"}