{"title":"Where to get the best custom case for your iPhone","link":"https://www.macworld.com/article/224887/where-to-get-the-perfect-custom-iphone-case.html","date":1703077985000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section><p>Your iPhone case says a lot about you—a  <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.speckproducts.com/iphone-case/iphone-6-cases/candyshell-cases-for-iphone-6.html&amp;xcust=1-1-224887-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Speck CandyShell</a>, for example, tells the world that you’re fun, bright, and quirky-yet-practical when it comes to protection and usability. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.twelvesouth.com/product/bookbook-for-iphone-6&amp;xcust=1-1-224887-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">TwelveSouth’s BookBook</a>, on the other hand, says you love books—even fake books.</p><p>So, here’s the question: If your iPhone case is a window to your soul, do you really want to settle for something mass produced and inherently un-unique, when you <em>could</em> spring for a custom case? If the answer is no, you’re in luck: Thanks to a myriad of custom case-makers, personalized cases are relatively inexpensive and easy to come by.</p><p>But you’re not looking for just any custom case—you want one that’s easy to make, attractive in build and print quality, and, of course, protective against drops and scratches.</p><p>If you are happy to go with the widest choice of designs and features on offer , check out our recommendations for the <a href=\"https://www.macworld.com/article/2064242/best-iphone-15-cases.html\" target=\"_blank\">best iPhone 15 cases</a>, which will also work for older iPhone models.</p><p>To help you find the perfect custom case-maker, I tested out several services from start to finish: I designed custom cases using the services’ online software, I tracked the time it took for the cases to be produced and shipped, and I used the cases on my own iPhone to judge build quality, usability, and protection. While all of the services I tested were decent, there was a clear winner.</p><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/Zazzle-Custom-iPhone-Case-Design-Your-Own.jpg?quality=50&amp;strip=all\" alt=\"Zazzle Custom iPhone Case design\" loading=\"lazy\" /></figure><p>Foundry</p></div><h2>Best choice: Zazzle</h2><p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.zazzle.com/custom/cases&amp;xcust=1-1-224887-1-0-0&amp;sref=https://www.macworld.com/feed\">Zazzle</a> is an online retailer that specializes in producing custom-printed products, such as iPhone cases, t-shirts, hats, stickers, and laptop bags. Zazzle doesn’t actually produce most of the products in its lineup—they’re imported from other brands (Case-Mate, Speck, OtterBox, and others) and simply printed by Zazzle.</p><p>Zazzle won our custom case-maker roundup for several reasons: Its online building tool was intuitive and easy to use (if a bit sparse), it had a large selection of custom cases to choose from, and its printing quality was excellent. </p><p><strong>Building tool: </strong>Zazzle’s building tool is simple and straightforward, but it doesn’t have quite as many features as some of the other tools I used did. There are no templates, for example, so any fancy designs you want to feature will have to be created in an external program like Adobe Photoshop.</p><p>But if you’re just looking to add a photo, image, or some text to your case, Zazzle’s tool works nicely. The tool lets you add as many photos or images as you want to the case and lets you resize them, center them, or size them to fit the available space (with cropping). There’s also an advanced option that lets you show whites as transparent, which is a great way to let the background case shine through (without having to upload a transparent PNG). Zazzle’s building tool may not have any templates, but it gives you the most freedom to play with your design and add as many elements as you want.</p><p><strong>Case selection: </strong>Of the services tested, Zazzle has the largest selection of case options, starting at $23 for a generic slim polycarbonate shell and going up to $75 for an OtterBox Defender case. While most of the services tested offered three case options at most, Zazzle offers 8 options for the iPhone 15. Zazzle’s choices open up your design options because you can use the case backgrounds as part of your design. For one of my Zazzle cases, I uploaded a transparent PNG file of the Tokyo skyline against a gold-brushed aluminum case. </p><p><strong>Quality: </strong>As I mentioned, Zazzle’s cases aren’t made by Zazzle, they’re made by big-name case-makers such as Case-Mate and Speck. So the cases’ build quality is what you’d expect—sturdy, usable, and relatively easy to put on and take off. Zazzle’s printing quality is also excellent, though none of the case-makers tested were less than excellent in this category.</p><p>If you’re looking to design your own custom case, Zazzle is the best all-around case-maker, thanks to its easy-to-use building tool and impressive selection of case options. While Zazzle doesn’t offer any templates for complete design newbies, the website does have a design tutorial section where you can brush up on your design skills. Even with the lack of templates, Zazzle’s building tool is simple enough for beginners to figure out but broad enough that it won’t limit the creativity of more advanced designers.</p><h2>Runner-up: Casetify</h2><p><a href=\"https://www.awin1.com/cread.php?awinmid=6743&amp;awinaffid=531979&amp;clickref=1-1-224887-1-0-0&amp;ued=https://www.casetify.com/\">Casetify</a> is a smartphone and tablet case-making website that specializes in transparent, or “shine through” case designs (which let your device “shine through”). The company designs and produces all of its cases, including its famous translucent polycarbonate classic snap shell. Casetify’s custom case-making service is not quite as broadly defined as Zazzle’s—Casetify started out as “Casetagram,” a service for creating custom cases using Instagram photos. Now, you can use any photo, image, or design you want, but their building tool still largely has the Instagram crowd in mind. </p><p>Casetify offers multiple case options for iPhones from the iPhone 7 Plus to the iPhone 15 Pro Max, starting at $68. You can choose your level of case phone protection and MagSafe compatibility, plus ring stands and other options. There are 17 colors and patterns to start your designs, and then you can add text in different styles, fonts and layouts.</p><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/Casetify-custom-iPhone-case.jpg?quality=50&amp;strip=all\" alt=\"Casetify Custom iPhone Cases\" loading=\"lazy\" /></figure><p>Foundry</p></div><p>Casetify’s building tool is very different from Zazzle’s and is better for design newbies who have no idea what they’re doing. The building tool has several layouts and templates to choose from, so you’ll be able to make a cool case even if you have no design background at all. The templates are for “shine through” cases, or cases where your iPhone can be seen through the design. </p><p>If you have no design experience at all, and you’re just looking to make a fun custom case with some photos from your Instagram account, Casetify is probably a better choice than Zazzle. Casetify’s building tool is certainly feature-rich, though the rigidity of the templates will frustrate more advanced designers. </p><h2>Runner up: SkinIt</h2><p><strong>SkinIt</strong>: <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.skinit.com/collections/custom-iphone-cases&amp;xcust=1-1-224887-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">SkinIt</a> makes its own custom cases at a very affordable price point—$25 for a clear case, $29 for a MagSafe case, and $40 for an Impact case. There are options from the iPhone 7 to the iPhone 15.</p><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/SkinIt-Custom-iPhone-case-design-1.jpg?quality=50&amp;strip=all\" alt=\"SkinIt Custom iPhone Case Design Photo\" loading=\"lazy\" /></figure><p>Foundry</p></div><p>SkinIt uses a very easy-to-use building tool that lets you upload photos from all over the web, including Facebook, Instagram, and Flickr. The tool has a lot of features, including the ability to add text, change the background color of your case, and apply filters to your images. You can also move, scale, rotate, and quickly fit your pictures, and move images forward and back (if you have multiple images). It’s a great tool for non-designers, but designers will still find it straightforward and easy to use.</p><p>SkinIt is a good choice if you’re not too picky about case quality—while SkinIt’s cases are acceptable, they’re not as meticulously designed as Casetify’s or some of the premium options on Zazzle. </p>\nMobile Phone Accessories</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0a5c4682bb512150b3a55ef471bfcf8fcf885094a2241fa5077a430d2c18b54e","category":"Apple"}