{"title":"Commensal <i>E</i>. <i>coli</i> limits <i>Salmonella</i> gut invasion during inflammation by producing toxin-bound siderophores in a <i>tonB</i>-dependent manner","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002616","date":1718200800000,"content":"<p>by Yassine Cherrak, Miguel Angel Salazar, Koray Yilmaz, Markus Kreuzer, Wolf-Dietrich Hardt</p>\r\n\r\nThe gastrointestinal tract is densely colonized by a polymicrobial community known as the microbiota which serves as primary line of defence against pathogen invasion. The microbiota can limit gut-luminal pathogen growth at different stages of infection. This can be traced to specific commensal strains exhibiting direct or indirect protective functions. Although these mechanisms hold the potential to develop new approaches to combat enteric pathogens, they remain far from being completely described. In this study, we investigated how a mouse commensal <i>Escherichia coli</i> can outcompete <i>Salmonella enterica</i> serovar Typhimurium (<i>S</i>. Tm). Using a salmonellosis mouse model, we found that the commensal <i>E</i>. <i>coli</i> 8178 strain relies on a trojan horse trap strategy to limit <i>S</i>. Tm expansion in the inflamed gut. Combining mutants and reporter tools, we demonstrated that inflammation triggers the expression of the <i>E</i>. <i>coli</i> 8178 antimicrobial microcin H47 toxin which, when fused to salmochelin siderophores, can specifically alter <i>S</i>. Tm growth. This protective function was compromised upon disruption of the <i>E</i>. <i>coli</i> 8178 <i>tonB</i>-dependent catecholate siderophore uptake system, highlighting a previously unappreciated crosstalk between iron intake and microcin H47 activity. By identifying the genetic determinants mediating <i>S</i>. Tm competition, our work not only provides a better mechanistic understanding of the protective function displayed by members of the gut microbiota but also further expands the general contribution of microcins in bacterial antagonistic relationships. Ultimately, such insights can open new avenues for developing microbiota-based approaches to better control intestinal infections.","author":"Yassine Cherrak","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"0a70fb66c67eacb9a3e1da5a5247e001a167517c563d450e9843e259ac27f9d5","category":"Environment"}