{"title":"Nanofibrous Conductive Sensor for Limonene: One-Step Synthesis via Electrospinning and Molecular Imprinting","link":"https://www.preprints.org/manuscript/202405.1676/v1","date":1716785694000,"content":"Detecting volatile organic compounds (VOCs) emitted from different plant species and their or-gans can provide valuable information about plant health and environmental factors that affect them. For example, limonene emission can be a biomarker to monitor plant health and detect stress. Traditional methods for VOC detection encounter challenges, prompting the proposal of  novel approaches. In this study, we proposed integrating electrospinning, molecular imprinting, and conductive nanofibers to fabricate limonene sensors. In detail, polyvinylpyrrolidone (PVP) and polyacrylic acid (PAA) served here as fiber and cavity formers, respectively, with multi-walled carbon nanotubes (MWCNT) enhancing conductivity. We developed one-step monolithic molecularly imprinted fibers, where S(-)-limonene was the target molecule using electrospinning technique. The functional cavities were fixed using UV curing method, followed by a target mol-ecule washing. This procedure enabled the creation of recognition sites for limonene within the nanofiber matrix, enhancing sensor performance and streamlining manufacturing. Humidity was crucial for sensor working, with optimal conditions at about 50% RH. The sensors rapidly re-sponded to S(-)-limonene, reaching a plateau within 200 seconds. Enhancing fiber density im-proved sensor performance, resulting in a lower limit of detection (LOD) of 137 ppb. However, excessive fiber density decreased accessibility to active sites, thus reducing sensitivity. Remarka-bly, the thinnest mat on the fibrous sensors created provided the highest selectivity to limonene (Selectivity Index: 72%) compared to other VOCs, such as EtOH (used as a solvent in nanofiber development), aromatic compounds (toluene), and two other monoterpenes (α-pinene and linalo-ol) with similar structure. These findings underscored the potential of the proposed integrated approach for selective VOC detection in applications such as precision agriculture and environ-mental monitoring.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0a79f03d6899480a73b0ba096e6b3fb64fa88543a85ff9dbc9ff7e962f53ffcb","category":"Interdisciplinary"}