{"title":"Report: Apple Continues to Explore Health Capabilities of Vision Pro","link":"https://www.macrumors.com/2023/10/25/apple-explores-vision-pro-health-capabilities/","date":1698241487000,"content":"Apple has explored using its Vision Pro headset to diagnose and treat mental health problems, among other health monitoring capabilities, <a href=\"https://www.theinformation.com/articles/apple-has-discussed-using-vision-pro-for-mental-health-diagnosis-treatment\"><em>The Information</em></a>'s Wayne Ma reports.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Vision-Pro-Person.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nCiting sources with direct knowledge of the matter, Ma explains that Apple has experimented with using the Vision Pro to track a user's facial expressions to detect depression, anxiety, stress, post-traumatic stress disorder (PTSD), and other mental health issues. Specifically, eye-tracking, pupil dilation, and external cameras can measure a person's \"affect,\" a psychological term that refers to how an individual expresses emotions.\r<br />\n\r<br />\nA so-called \"flat affect,\" otherwise known as an emotionless facial expression, can be a sign of specific mental health difficulties. Upon detection of such a problem, the Vision Pro would then display relevant images and play sounds that could improve the wearer's mental state. Virtual reality headsets have already been used by researchers to diagnose and treat phobias and PTSD by safely exposing patients to their fears.\r<br />\n\r<br />\nApple has also apparently discussed using the Vision Pro's infrared eye tracking-cameras to detect swelling in the blood vessels of the eyes to spot an early sign of heart failure. The company explored using the headset to detect weight changes and evaluate a user's movement over time, using this data to screen for health issues such as Parkinson's disease, but the feature had a major setback when Apple removed the full body-tracking capabilities from the Vision Pro due to unreliability.\r<br />\n\r<br />\nFeatures that claim to diagnose or treat health issues would need to undergo clinical studies and receive approval from health regulators before being released to the public, but some Apple employees are apparently concerned about the legal liability of making more health-related claims, which could limit the scope of the features. Other employees are said to be skeptical that the Vision Pro will be as effective as other methods of treatment, such as medicine.\r<br />\n\r<br />\nTeams and significant individuals inside Apple are said to have extensively discussed or explored health, wellness, and fitness features for the Vision Pro, including Mike Rockwell, the head of Apple's Vision Products Group. The company has reportedly hired health experts to explore features for the device. <em>The Information</em> was unable to learn whether mental health features will arrive on the first-generation Vision Pro headset, or if it will be reserved for future models. The sources added that such features may never launch at all, but the company continues to brainstorm health-related uses for the headset.\r<br />\n\r<br />\nMa added that Apple has also explored the mental health detection capabilities of other devices such as the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, using the front-facing camera to track a user's mood, as well as monitor app usage and typed words to detect early signs of Alzheimer's disease.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/theinformation-com/\">The Information</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/25/apple-explores-vision-pro-health-capabilities/\">Report: Apple Continues to Explore Health Capabilities of Vision Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/report-apple-continues-to-explore-health-capabilities-of-vision-pro.2408633/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0a87a2adf2bdd6edadb94c64f745fe3d5ff5f05b2cc02c99b389a8a771f8e26d","category":"Apple"}