{"title":"Fostering voice behavior in correctional institutions: Investigating the role of organizational support and proactive personality","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303768","date":1715954400000,"content":"<p>by Dodot Adikoeswanto, Siti Nurjanah, Saparuddin Mukhtar, Anis Eliyana, Andika Setia Pratama, Rachmawati Dewi Anggraini, Nurul Liyana Mohd Kamil</p>\r\n\r\nThis research delves into the intricate interplay between perceived organizational support, proactive personality, and voice behavior. Furthermore, it establishes the pivotal role of work engagement as a mediating factor within the articulated research model. The study engaged 287 healthcare professionals within correctional institutions and detention centers in Indonesia, employing a dual-phase questionnaire distribution to capture the dynamic aspects of the participants’ experiences. Utilizing the statistical technique of Partial Least Square—Structural Equation Modeling with the SmartPLS 4 program as an analysis tool, the collected data underwent comprehensive analysis. The outcomes reveal that proactive personality significantly influences voice behavior both directly and indirectly through its impact on work engagement. Conversely, perceived organizational support directly influences work engagement but does not exhibit a direct impact on voice behavior. These findings underscore the significance of proactive personality in fostering a conducive environment for constructive organizational change from a grassroots perspective. The study suggests that organizations prioritize the cultivation of proactive personality traits to stimulate voice behavior, thereby facilitating ongoing improvements and sustainable organizational progress.","author":"Dodot Adikoeswanto","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0a89ecd489de0b5b2a628fae61eb657782befcb5875b858388842215bc6f6f61","category":"Interdisciplinary"}