{"title":"Effects of climate change and deep fertilization on the growth and yield of winter wheat in the Loess Plateau of China","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13798?af=R","date":1723208055000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Global temperature is projected to rise continuously under climate change, negatively impacting the growth and yield of winter wheat. Optimizing traditional agricultural measures is necessary to mitigate potential winter wheat yield losses caused by future climate change. This study aims to explore the variations in winter wheat growth and yield on the Loess Plateau of China under future climate change, identify the key meteorological factors affecting winter wheat growth and yield, and analyze the differences in winter wheat yield and root characteristics under different fertilization depths.</p>\n<h2>RESULTS</h2>\n<p>Meteorological data from 20 General Circulation Models were applied to drive the Decision Support System for Agrotechnology Transfer model, simulating the future growth characteristics of winter wheat under various fertilization depths. The Random Forest model was used to determine the relative importance of meteorological factors influencing winter wheat yield, root length density and leaf area index. The results showed that temperature and high emission concentration were primary factors influencing crop yield under future climate change. The temperature increase projected from 2021 to 2100 would be anticipated to shorten the phenology period of winter wheat by 2–16 days and reduce grain yield by 2.9–12.7% compared to the period from 1981 to 2020. Conversely, the root length density and root weight of winter wheat would increase by 1.2–10.9% and 0.2–24.1%, respectively, in the future, and excessive allocation of root system resources was identified as a key factor contributing to the reduction in winter wheat yield. Compared with the shallow fertilization treatment (N5), the deep fertilization treatments (N15 and N25) increased the proportion of roots in the deep soil layer (30–60 cm) by 2.7–10.2%. Because of the improvement in root structure, the decline in winter wheat yield under deep fertilization treatments in the future is expected to be reduced by 1.2% to 6.5%, whereas water use efficiency increases by 1.1% to 2.4% compared to the shallow fertilization treatment.</p>\n<h2>CONCLUSION</h2>\n<p>The deep fertilization treatment can enhance the root structure of winter wheat and increase the proportion of roots in the deep soil layer, thereby effectively mitigating the decline in winter wheat yield under future climate change. Overall, optimizing fertilization depth effectively addresses the reduced winter wheat yield risks and agricultural production challenges under future climate change. © 2024 Society of Chemical Industry.</p>","author":"Cuiping Yang, \nZhiyuan Qiu, \nShuxian Wang, \nHongzheng Shen, \nXiaoyi Ma","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"0a8d6d3456af461844c9720ed59b928c60811bddd59a8632d145330b5578720d","category":"Environment"}