{"title":"Possible remediation of impact-loading debris avalanches via fine long rooted grass: an experimental and material point method (MPM) analysis","link":"http://link.springer.com/10.1007/s10346-023-02178-5","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Debris avalanches often originate along steep unsaturated slopes and have catastrophic consequences. However, their forecast and mitigation still pose relevant scientific challenges. This is also due to the variety of mechanisms observed near high sub-vertical bedrock outcrops, such as the impact loading of soil failed upslope the outcrop, the build-up of pore water pressures in the inception zone, and the bed entrainment along the landslide propagation path. At the University of Salerno, an experimental and numerical investigation campaign started some years ago to explore the feasibility of using long-root grass to mitigate or even inhibit the inception of debris avalanches. Previous laboratory results were achieved through two twin 2-m-long columns (one bare, one vegetated), where the change in soil retention curve and soil mechanical response was assessed. As follow-up, an experimental field setup was installed in 2020 first, and in an improved configuration in 2021. Here, three different species of long-root grass were grown. In situ soil suction and water content measurements were periodically collected in the vegetated and in the original soils. In both cases, soil specimens were also collected, and laboratory geotechnical tests were performed to individuate the changes in both the water retention and strength response. Increased values of soil suction and shear strength were outlined, despite some differences, for all the grown species compared to the original soil. Using these novel experimental data, advanced large-deformation stress–strain hydro-mechanically coupled analyses were recently performed through a material point method (MPM) approach. The original slope conditions were compared to various slope configurations engineered via long-root grass. The benefits and the open issues related to this novel green technology for landslide mitigation are discussed. Some insights are outlined for the possible reduction of the soil volumes mobilized inside the inception zone of debris avalanches.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"0a8da551f9c2551444452e17075e6888f3a0cbf7750f36fd0f415358d04d4089","category":"Environment"}