{"title":"Illi Gardner breaks Emma Pooley’s Everesting record in 8 hours 33 minutes","link":"https://cyclingtips.com/2021/08/illi-gardner-breaks-everesting-record-in-8-hours-33-minutes/","date":1628988894000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/illi-gardner-everesting-1-of-1-650x488.jpg\" /></div><h2>Illi Gardner breaks Emma Pooley's Everesting record in 8 hours 33 minutes</h2><p>\n</p><p>Illi Gardner has broken the Everesting World Record, besting Emma Pooley’s time by twenty minutes with a time of 8:33:47. Pooley’s record stood at 8:53:36. </p>\n\n\n\n<p>Gardner is a 21-year-old British rider who races for continental team CAMS-Basso. She completed the attempt on a climb in Wales called Bwlch y Groes (Hellfire Pass), which is <a href=\"https://www.strava.com/segments/29083082\">.69 km long averaging 17.4%</a>. Her complete ride is <a href=\"https://www.strava.com/activities/5792342126\">viewable on Strava</a> and has been validated by Integrated Informatics.</p>\n\n\n\n<p>CyclingTips’ Andy van Bergen caught up with Gardner after her effort. </p>\n\n\n\n<p><strong>CyclingTips:  How does it feel to have set a new Everesting record?</strong></p>\n\n\n\n<p>Gardner: Really great, was thinking it would be difficult to even complete the Everest for a large portion of the ride — I knew Emma’s time would be very tough to get close to so I was very happy to finish, then it was amazing to get the confirmation!</p>\n\n\n\n<p><strong>CT: Can you talk us through the bike/special prep that you made for this attempt?</strong></p>\n\n\n\n<p>IG: It was my regular training bike setup but with a 34 chainring and a Shimano M7000 SLX 11-46 Cassette and a Wolf Tooth Roadlink hanger extension to get things to work. I did a half everesting on the same hill a month ago where I soon realised that a lot more gearing was needed if I was going to survive a full one!</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/illi-gardner-everesting-1-of-2.jpg\" /></figure>\n\n\n\n<p><strong>CT: What was your strategy for the ride?</strong></p>\n\n\n\n<p>IG: The hill I rode was so steep that my strategy was just to find a sustainable rhythm/cadence and just plough through, trying to fuel constantly – I roughly knew the kind of times I’d need to be going to get close to the record, but with the steep gradient it kind of forces you to go hard just to get up the hill.</p>\n\n\n\n<p><strong>CT: Why this hill, what did you like about it?</strong></p>\n\n\n\n<p>IG: I tried to find the steepest localish hill that wasn’t too technical – one section kicks up above 20% for a while which became mentally difficult as I was crawling along at barely 4mph. But in terms of efficiency it was ideal and also quite straight/exposed with decent visibility</p>\n\n\n\n<p><strong>CT: Looks like you had great support from your dad, can you talk about that?</strong></p>\n\n\n\n<p>IG: I wouldn’t have been able to do even a portion of it without my dad – he helped get my bike set up and was at the top of the hill handing me food and drink in small portions almost every lap. He also woke up at 4:30 and drove us the three hours to the climb!!</p>\n\n\n\n<p><strong>CT: How did you celebrate?</strong></p>\n\n\n\n<p>IG: We celebrated with some great homemade pizza which was absolutely delicious after eating nonstop cereal bars all day!</p>\n\n\n\n<p><strong>CT: What happened with the sheep!?</strong><br />There was a rough patch about 5 hours in where everything bad seemed to happen at once – the fog rolled in, my legs stopped working and two descents in a row I nearly got taken out by sheep. There were a few lurking on the roadside which decided to dart out right in front of me…luckily I’m quite a slow descender so managed to stay upright but it caused quite a bit of swearing.</p>\n\n\n\n<p><em>More to come.</em></p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/illi-gardner-breaks-everesting-record-in-8-hours-33-minutes/\">Read More</a>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0a909e3fd3b61c97d0e647d918033eaf7b3641683c3ea4bdf743e3f59822da86","category":"Cycling"}