{"title":"Exploring the scalability and sustainability of community-based agroforestry to achieve planetary health benefits in Haiti’s Lower Artibonite Valley","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000406","date":1727791200000,"content":"<p>by Gloria C. Blaise, Shorna B. Allred, Stephen J. Morreale, Genevive R. Meredith, Starry Sprenkle-Hyppolite, Louise E. Buck, Arundhati Jagadish, Mark A. Constas</p>\r\n\r\nCommunity-based agroforestry, as a planetary health solution, can rebuild fertile soils, minimize climate risk, diversify farmer incomes, and provide a source of food, raw materials, and other vital ecosystem functions. Utilizing focus groups, individual semi-structured interviews, and field observations, we studied how the Haiti Timber Reintroduction Program (HTRIP), an agroforestry program operating in Haiti since 2005, leveraged institutional infrastructures and social networks to facilitate the adoption, scaling, and sustainability of community-based agroforestry as a solution for planetary health. Results show that the adoption and scaling of community-based agroforestry was facilitated by support from institutional and social networks. The results underscore the importance of cross-sector collaboration and coordination in creating the enabling conditions necessary for successful community-based agroforestry implementation. Additionally, strengthened social networks, cultivated through long-term participation in the HTRIP, contributed to the program’s sustainability. While competing socio-political problems in some low-income settings may seem insurmountable—particularly those in fragile states, where our study took place—our research demonstrates that community-based agroforestry solutions are possible. Where culturally relevant, this ecologically and socially based practice could be scaled up to amplify its benefits to more communities. We encourage further research to explore the scaling up of regenerative practices such as agroforestry for climate resilience and planetary health.","author":"Gloria C. Blaise","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"0a937bd4ee567583c6f61e58db6dc5366ff0effa96bbaf55198b7bce9e1d2151","category":"Environment"}