{"title":"Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USA","link":"https://www.macrumors.com/2023/05/23/apple-announces-deal-to-make-components-in-the-usa/","date":1684847106000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2023/05/apple-announces-multibillion-dollar-deal-with-broadcom/\">announced</a> a multibillion-dollar deal with American technology company Broadcom to make several key components for its devices in the United States.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/09/r.jpeg\" alt width=\"800\" height=\"533\" />\r<br />\nThe multi-year agreement with Broadcom will see Apple use 5G radio frequency and wireless connectivity components, including FBAR filters, that are designed and manufactured in the U.S. Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> said: <blockquote>We're thrilled to make commitments that harness the ingenuity, creativity, and innovative spirit of American manufacturing. All of Apple's products depend on technology engineered and built here in the United States, and we'll continue to deepen our investments in the U.S. economy because we have an unshakable belief in America's future.</blockquote>\r<br />\n\r<br />\nApple has collaborated with Broadcom for many years, with the company providing important chips for devices like the AirPort and <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> 5S. Apple noted that it already supports over 1,100 jobs in Broadcom's Fort Collins FBAR filter manufacturing facility, and the partnership will see continued investment in automation projects and training programs for technicians and engineers.\r<br />\n\r<br />\nThe investments are part of the commitment Apple made in 2021 to invest $430 billion in the U.S. economy over a period of five years. The company today said that it is on track to meet its target through direct spending with American suppliers, data centers, capital expenditures, and more.<div>Tags: <a href=\"https://www.macrumors.com/guide/united-states/\">United States</a>, <a href=\"https://www.macrumors.com/guide/5g/\">5G</a>, <a href=\"https://www.macrumors.com/guide/broadcom/\">Broadcom</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/23/apple-announces-deal-to-make-components-in-the-usa/\">Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USA</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-announces-multibillion-dollar-deal-with-broadcom-to-make-components-in-the-usa.2390291/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0a998a7c91a65e7fef5a392b2562b7611f017e1cda4fc0abab4ccc30e9bb599a","category":"Apple"}