{"title":"Correlates of viral suppression among sexual minority men and transgender women living with HIV in Mpumalanga, South Africa","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003271","date":1721656800000,"content":"<p>by Akua O. Gyamerah, Alexander Marr, Kabelo Maleke, Albert E. Manyuchi, Ali Mirzazadeh, Oscar Radebe, Tim Lane, Adrian Puren, Wayne T. Steward, Helen Struthers, Sheri A. Lippman</p>\r\n\r\nSexual minority men (SMM) and transgender women in South Africa engage in HIV care at lower rates than other persons living with HIV and may experience population-specific barriers to HIV treatment and viral suppression (VS). As part of a pilot trial of an SMM-tailored peer navigation (PN) intervention in Ehlanzeni district, South Africa, we assessed factors associated with ART use and VS among SMM at trial enrolment. A total of 103 HIV-positive SMM and transgender women enrolled in the pilot trial. Data on clinical visits and ART adherence were self-reported. VS status was verified through laboratory analysis (&lt;1000 copies/ml). We assessed correlates of VS at baseline using Poisson generalized linear model (GLM) with a log link function, including demographic, psychosocial, clinical, and behavioral indicators. Among participants, 52.4% reported ART use and only 42.2% of all participants had evidence of VS. Of the 49.5% who reported optimal engagement in HIV care (consistent clinic visits with pills never missed for ≥ 4 consecutive days) in the past 3-months, 56.0% were virally suppressed. In multivariable analysis, SMM were significantly more likely to be virally suppressed when they were ≥ 25 years of age (Adjusted prevalence ratio [APR] = 2.0, CI 95%:1.0–3.8); in a relationship but not living with partner, as compared to married, living together, or single (APR = 1.7, CI 95%:1.0–2.7), and optimally engaged in care (APR = 2.1, 95% CI:1.3–3.3). Findings indicate a need for targeted treatment and care support programming, especially for SMM and transgender women who are young and married/living with their partners to improve treatment outcomes among this population.","author":"Akua O. Gyamerah","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"0a9c04acd888539878dadfe7e298615cb15148da7240b804ecdf817c406ab61d","category":"Environment"}