{"title":"CES 2024: Belkin Launching Qi2 Chargers, GaN Chargers, and First Apple-Certified Auto Tracking iPhone Stand","link":"https://www.macrumors.com/2024/01/07/ces-2024-belkin-chargers-auto-tracking-stand/","date":1704675720000,"content":"At CES this week, <a href=\"https://www.belkin.com\">Belkin</a> is making a number of Apple-related announcements, including confirmation that several wireless chargers based on the new Qi2 standard derived from <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> are just about ready to come to market. Belkin is also making announcements about several wired charging products with GaN technology and an innovative <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> stand that keeps you in the camera frame as you move.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/belkin-ces-2024-announcements.jpg\" width=\"1600\" height=\"900\" />\r<br />\nBelkin's initial Qi2 chargers were <a href=\"https://www.macrumors.com/2023/08/31/belkin-qi2-wireless-chargers/\">announced In August</a> and have been working their way through Qi2 certification among the first products supporting the standard. These products include the BoostCharge Convertible Qi2 Wireless Pad to Stand and the BoostCharge Pro 3-in-1 Wireless Charging Pad with Qi2, as well as a similar 2-in-1 Wireless Charging Pad without the Apple Watch charger. As Qi2 chargers, all of these devices support up to 15-watt charging for iPhones, just like with ‌MagSafe‌.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/08/belkin-qi2-convertible.jpg\" width=\"2000\" height=\"1125\" /><em>BoostCharge Convertible Qi2 Wireless Pad to Stand</em></div>\r<br />\nThe Convertible Qi2 Wireless Pad to Stand collapses to a flat pad for convenience and travel, but can then be extended to a stand mode at adjustable angles for easy viewability such as with StandBy mode. It comes with a 5-foot USB-C cable and a 20-watt USB-C power adapter.\r<br />\n\r<br />\nThe BoostCharge Pro 3-in-1 Wireless Charging Pad with Qi2 is a flat charging pad with one 15-watt Qi2 spot for charging an ‌iPhone‌ and a second 5-watt Qi spot for another phone or AirPods. A detachable Apple Watch charging puck offers fast charging on supported Apple Watch models, and a 5-foot USB-C to USB-C cable is included along with a 30-watt USB-C power adapter on most SKUs.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/08/belkin-qi2-wireless-charger.jpg\" width=\"2000\" height=\"1125\" /><em>BoostCharge Pro 3-in-1 Wireless Charging Pad with Qi2</em></div>\r<br />\nThe BoostCharge Pro 2-in-1 Magnetic Wireless Charging Pad with Qi2 offers a similar setup with a flat design, a 15-watt Qi2 pad, and a 5-watt Qi pad for AirPods or another device, but does not include an Apple Watch charging puck. A 5-foot USB-C to USB-C cable is included, as is a 30-watt power adapter on most SKUs.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2024/01/belkin-2-in-1-magnetic-charging-pad.jpg\" width=\"1600\" height=\"900\" /><em>BoostCharge Pro 2-in-1 Magnetic Wireless Charging Pad with Qi2</em></div>\r<br />\nIn addition to the previously announced Qi2 chargers, Belkin is announcing a few more products in its Qi2 lineup at CES, including a tree-style 3-in-1 stand that's very similar to other 3-in-1 chargers Belkin has been offering for a number of years. The new BoostCharge Pro 3-in-1 Magnetic Stand includes a flat base with a charging spot for AirPods, and then an elevated arm with a Qi2 pad for charging an ‌iPhone‌ at up to 15 watts and an Apple Watch puck with fast charging support.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2024/01/belkin-qi2-3-in-1-stand.jpg\" width=\"1600\" height=\"900\" /><em>BoostCharge Pro 3-in-1 Magnetic Stand</em></div>\r<br />\nUnlike Belkin's past tree-style chargers, this new one includes swivel support on the Qi2 pad to allow you to easily adjust the angle of your phone while it's on the charger. This stand will be priced at $149.99 and is launching in March.\r<br />\n\r<br />\nFinally for the Qi2 family, there's the BoostCharge Pro Magnetic Power Bank, which will be available in a 5,000 mAh model for $59.99, an 8,000 mAh model for $79.99, and a 10,000 mAh model for $99.99 starting in March. All three models include Qi2 support for up to 15 watts of wireless charging, with passthrough charging to simultaneously recharge the power bank and an attached phone.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2024/01/belkin-qi2-power-banks.jpg\" width=\"1600\" height=\"900\" /><em>BoostCharge Pro Magnetic Power Banks</em></div>\r<br />\nThe power banks also include a kickstand to make it easy to prop your phone up while watching video, reading, or chatting. USB-C ports are included for both recharging and for wired charging from the power banks.\r<br />\n\r<br />\nIn addition to Qi2 wireless charging products, Belkin is also announcing a pair of wired charging products that use GaN technology for more efficient charging in compact designs. First up is the BoostCharge Pro 4-Port USB-C GaN Charger 200W, which includes four USB-C ports to recharge a variety of high-power devices. Two of the ports support up to 140 watts of charging power while the other two support up to 60 watts, but the maximum total output at any given time is limited to 200 watts. This charger will be priced at $129.99 and is launching in March.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2024/01/belkin-4-port-gan-charger-200w.jpg\" width=\"1600\" height=\"900\" /><em>BoostCharge Pro 4-Port USB-C GaN Charger 200W</em></div>\r<br />\nSecond, Belkin is introducing the 6-in-1 Core GaN Dock, which it says is 50% smaller than other 6-in-1 solutions. It includes an HDMI port with support for up to a 4K display, a pair of USB-A ports for legacy devices, a pair of USB-C ports (one with 96-watt power delivery), and a Gigabit Ethernet port. It's priced at $139.99 and it is available to order today with a launch coming soon.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2024/01/belkin-6-in-1-core-dock.jpg\" width=\"1600\" height=\"1024\" /><em>6-in-1 Core GaN Dock</em></div>\r<br />\nAnd finally, Belkin is announcing what it says is the world's first accessory to take advantage of <a href=\"https://developer.apple.com/documentation/DockKit\">Apple's DockKit framework</a> introduced in <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> for face and object tracking. The Auto Tracking Stand Pro is a ‌MagSafe‌ charging stand for your ‌iPhone‌ that includes a motorized base which supports full 360º swivel and up to 90º tilt. Once paired with your ‌iPhone‌ via NFC, the DockKit framework allows your phone and the stand to work together to register your face and then automatically track to keep you in frame as you move.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2024/01/belkin-auto-tracking-stand-pro.jpg\" width=\"1600\" height=\"900\" /><em>Auto Tracking Stand Pro</em></div>\r<br />\nIt works in both portrait and landscape orientations and with both front and rear cameras, and it supports <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>, the native Camera app, and other videoconferencing apps. The stand has a built-in rechargeable battery that allows it to operate for up to five hours while on the go for vlogging and other scenarios where you may not have ready access to fixed power. While connected to wall power, it can charge your phone via ‌MagSafe‌ at up to 15 watts, keeping everything powered up.\r<br />\n\r<br />\nThe Auto Tracking Stand Pro will be priced at $179.99 and Belkin is currently listing it as \"coming soon\" with customers able to sign up to be notified about availability.<div>Tags: <a href=\"https://www.macrumors.com/guide/belkin/\">Belkin</a>, <a href=\"https://www.macrumors.com/guide/ces-2024/\">CES 2024</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/07/ces-2024-belkin-chargers-auto-tracking-stand/\">CES 2024: Belkin Launching Qi2 Chargers, GaN Chargers, and First Apple-Certified Auto Tracking iPhone Stand</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ces-2024-belkin-launching-qi2-chargers-gan-chargers-and-first-apple-certified-auto-tracking-iphone-stand.2415724/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0aa2504162dd6c37a4dab982e832fce5f864cd9456254e3daab25d4d8f65152d","category":"Apple"}