{"title":"Corsair is buying DIY mechanical keyboard brand Drop","link":"https://arstechnica.com/?p=1954545","date":1689633216000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/20211020_134945-1-800x450.jpg\" alt=\"Drop Signature Series Islay Night on tan table\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/20211020_134945-1.jpg\">Enlarge</a> <span>/</span> Drop has made some pretty expensive keyboards, like this $349 Islay Night that is no longer in stock.  (credit: Scharon Harding)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Corsair is acquiring Drop, the companies announced today. Corsair is already the parent company of other gaming peripherals and PC brands it previously acquired, including Elgato and Origin PC. The latest acquisition adds a brand to the company's catalog that's well-known among <a href=\"https://arstechnica.com/gadgets/2022/03/the-ars-technica-guide-to-mechanical-keyboards/\">mechanical keyboard</a> builders.</p>\n<p>Drop used to be called Massdrop and was founded in 2011. Based in California (like its soon-to-be parent company), its bread and butter has traditionally been parts for DIY mechanical keyboard enthusiasts, including bare-bone kits and premium keycaps. However, the company's selection has expanded to <a href=\"https://arstechnica.com/gadgets/2021/10/drop-signature-series-islay-night-hands-on-a-349-arrow-free-experience/\">prebuilt mechanical keyboards</a>, including some high-end, <a href=\"https://arstechnica.com/gadgets/2021/10/drops-500-mechanical-keyboards-pay-homage-to-the-moon-and-samurai/\">supremely expensive ones</a>. The company also sells more mainstream-friendly keyboard parts, like <a href=\"https://arstechnica.com/gadgets/2022/08/lord-of-the-rings-mechanical-keyboards-are-perfect-for-people-who-speak-elvish/\"><em>Lord of the Rings</em> prebuilt keyboards</a> and <a href=\"https://arstechnica.com/gadgets/2021/11/lord-of-the-rings-65-artisan-keycap-makes-your-keyboard-more-precious/\">keycaps</a>, and other PC peripherals, like headphones and desk mats. Beyond Drop products, the site also sells other enthusiast-brand products.</p>\n<p>Today, we learned that Corsair reached an agreement to buy Drop, although the terms of the \"non-material, all-cash transactions\" haven't been published yet. Once the deal closes, people can still shop on Drop's website, and Drop will be a separate brand within Corsair. Drop warranties and customer support will still be handled by Drop, for example. However, Corsair \"will be able to offer specialized Corsair and Elgato products to the enthusiast community that Drop is engaged with,” Corsair CEO Andy Paul said in a statement. The stated parameters are similar to how brands Corsair has acquired—Elgato, Origin PC, and Scuf—operate.</p></div><p><a href=\"https://arstechnica.com/?p=1954545#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1954545&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0aa4db5e4f88efbe1d4af9537930e97af0187e8f3cd07e4cb6831bc1799ef094","category":"Tech"}