{"title":"Continuous quality evaluation of the Asanté rapid test for recent infection for robust kit lot quality verification","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003195","date":1715695200000,"content":"<p>by Amy Zheng, Mervi Detorio, Trudy Dobbs, Vedapuri Shanmugam, Xiaojuan Tan, Jeni Vuong, Robert A. Domaoal, Kemba Lee, LaTasha Williams, Keisha Jackson, Bharat Parekh, Ernest L. Yufenyuy</p>\r\n\r\nThe Sedia Biosciences Asanté rapid test for recent infection (RTRI) can identify HIV infections and characterize HIV-1 as recent or long-term infection via the positive verification (V) line and long-term line (LT) line, respectively. Tracking with Recency Assays to Control the Epidemic (TRACE) program uses RTRI assays. Successful implementation of TRACE requires high-quality test performance. The goal of this study is to evaluate the additional quality practices established for new kit lots prior to field use. Asanté lot quality control data from the manufacturer is reviewed by the Centers for Disease Control and Prevention International Laboratory Branch (CDC-ILB) in the Division of Global HIV and TB using. If a lot passes manufacturer quality control and CDC-ILB review, test kits are sent to CDC-ILB for further evaluation. Evaluation by CDC includes inter-rater reliability and linear regressions comparing the V and LT lines against reference data as well as V and LT line data between testers. A Bland-Altman analysis was conducted to assess bias and systematic error. Overall, CDC-ILB passed 29 (91%) out of 32 Sedia Biosciences Asanté kit lots that initially passed manufacturing quality control from July 2017 to May 2020. Regression analyses demonstrate that test kits are performing as expected with consistent R<sup>2</sup>≥0.92 for both V and LT lines. On average, inter-rater reliability kappa was 0.9, indicating a strong level of agreement. Bland-Altman analyses demonstrate high agreement with little to no systematic error and bias. Ongoing evaluation of new RTRI kit lots is important to ensure high quality test performance. Rejecting 9% of kit lots highlight the importance of continuing to work with manufacturers to ensure consistent kit production and quality assurance (QA) activities. Investing in effective QA measures, conducting both pre- and post-market performance data reviews, could help improve RTRI accuracy and outcomes in similar testing programs.","author":"Amy Zheng","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"0ab040ed8ea42ce55273cf96e214ff1e440150dd988dc9ddcb9eff603b18dac0","category":"Environment"}