{"title":"A noninvasive BCG skin challenge model for assessing tuberculosis vaccine efficacy","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002766","date":1724076000000,"content":"<p>by Nitya Krishnan, Miles Priestman, Iria Uhía, Natalie Charitakis, Izabella T. Glegola-Madejska, Thomas M. Baer, Albin Tranberg, Alan Faraj, Ulrika SH Simonsson, Brian D. Robertson</p>\r\n\r\nWe report here on the characterisation in mice of a noninvasive bacille Calmette-Guérin (BCG) skin challenge model for assessing tuberculosis (TB) vaccine efficacy. Controlled human infection models (CHIMs) are valuable tools for assessing the relevant biological activity of vaccine candidates, with the potential to accelerate TB vaccine development into the clinic. TB infection poses significant constraints on the design of a CHIM using the causative agent <i>Mycobacterium tuberculosis</i> (Mtb). A safer alternative is a challenge model using the attenuated vaccine agent <i>Mycobacterium bovis</i> BCG as a surrogate for Mtb, and intradermal (skin) challenge as an alternative to pulmonary infection. We have developed a unique noninvasive imaging system based on fluorescent reporters (FluorBCG) to quantitatively measure bacterial load over time, thereby determining a relevant biological vaccine effect. We assessed the utility of this model to measure the effectiveness of 2 TB vaccines: the currently licenced BCG and a novel subunit vaccine candidate. To assess the efficacy of the skin challenge model, a nonlinear mixed effect model was built describing the decline of fluorescence over time. The model-based analysis identified that BCG vaccination reduced the fluorescence readout of both fluorophores compared to unvaccinated mice (<i>p</i> &lt; 0.001). However, vaccination with the novel subunit candidate did not alter the fluorescence decline compared to unvaccinated mice (<i>p</i> &gt; 0.05). BCG-vaccinated mice that showed the reduced fluorescent readout also had a reduced bacterial burden in the lungs when challenged with Mtb. This supports the fluorescence activity in the skin as a reflection of vaccine induced functional pulmonary immune responses. This novel noninvasive approach allows for repeated measurements from the challenge site, providing a dynamic readout of vaccine induced responses over time. This BCG skin challenge model represents an important contribution to the ongoing development of controlled challenge models for TB.","author":"Nitya Krishnan","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"0abb5361b885414c3ade77db0de602e43cb039a7a0563543482445c3d2f339cd","category":"Environment"}