{"title":"Could Exposure to SARS-CoV-2 Be a Risk Factor for Alterations in Functional Vision Parameters in Infants?: A Cross-sectional Study","link":"https://www.preprints.org/manuscript/202408.2052/v1","date":1724942767000,"content":"Background/Objectives: To compare functional vision parameters - related to the perception of movement - of children who were exposed to SARS-CoV-2 with those who had no contact with the virus in the womb, in postnatal life, or through the family context; Methods: A cross-sectional study was conducted with children aged from 0 to 24 months. An initial assessment was performed through a caregiver interview and participants were divided into four groups considering the nature of their contact with COVID-19. Functional parameters of vision were recorded and two independent blinded researchers performed their analysis. Statistical analysis was conducted using the software SPSS®. Data normality was verified by the Shapiro-Wilk test. The prevalence and the odds ratio of visual changes according to coronavirus exposure were analyzed, considering a p-value &amp;lt; 0.05; Results: The Gestational COVID Group presented an increased risk for unstable fixation time, convergent strabismus, and looking discontinuity; the Familiar COVID Group was more inclined to look discontinuity on horizontal tracking. However, there were no statistically significant differences in the prevalence and odds ratios between the exposure and control groups; Conclusions: Children exposed to SARS-CoV-2 during pregnancy or in the family environment had a higher incidence of gaze discontinuity, as well as a higher rate of unstable fixation and convergent strabismus in those exposed during pregnancy. However, there were no statistically significant differences between the groups.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0ac1e0b615114d4181954c251dfb000ac5a51bd4e3e237172837f3d64156b423","category":"Interdisciplinary"}