{"title":"Confidence, attitude, and practice of scientific research among health professions’ students in the United Arab Emirates","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304357","date":1717164000000,"content":"<p>by Anan S. Jarab, Walid Al-Qerem, Karem H. Alzoubi, Shrouq R. Abu Heshmeh, Mays Hayek, Yazid N. Al Hamarneh, Salahdein Aburuz</p>\r\nObjective <p>This study aimed to assess the confidence, attitude, and scientific research practices of undergraduate students of different health profession specialties.</p> Methods <p>In this cross-sectional study, an online-based questionnaire was distributed as a Google Form via groups and pages of medical universities available on social media sites such as Facebook, WhatsApp, and Twitter to the second- to sixth-year students of different health profession specialties in different universities across the United Arab Emirates (UAE) in the period from October through December 2023 using the convenience sampling technique. The questionnaire included four parts that assessed socio-demographics and custom-designed research-related questions (6 items), perceived confidence (8 items), attitudes (14 items), and the practice in the context of scientific research and its implementation (9 items). Multivariate logistic regression analyses were conducted to explore the variables associated with the study outcomes, including confidence, attitudes, and practice levels.</p> Results <p>The study included 522 undergraduate students. The participants reported low confidence, a negative attitude, and low scientific research practice. Regression results revealed that individuals without prior research experiences were less likely to have high confidence and practice compared to those with previous research experience (OR = 0.634, 95% CI: 0.426–0.945, p = 0.025; and OR = 0.139, 95%Cl: 0.090–0.216, P&lt;0.001, respectively). Additionally, participants who reported difficulty in differentiating between various literature resources were less likely to have high confidence and practice compared to those who reported the ability to differentiate (OR = 0.627, 95% CI: 0.42–0.935, p = 0.022, and OR = 0.370, 95%Cl: 0.237–0.579, p&lt;0.001, respectively). Furthermore, individuals who had not taught research methods in their undergraduate studies were less likely to have high practice (OR = 0.505, 95%Cl: 0.309–0.823, p = 0.06).</p> Conclusions <p>Undergraduates of different medical specialties in the UAE demonstrated acceptable levels of confidence and attitude toward scientific research, with several areas for practice improvement. Education and training courses focusing on various aspects of scientific research should be incorporated into the medical curricula in order to enhance students’ confidence and practice of scientific research.</p>","author":"Anan S. Jarab","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0ac5fcdb3ee9b27d2df089d6b19e29e13fb272db7ef07c6730fd5136d14f5d04","category":"Interdisciplinary"}