{"title":"Pogačar and Yates co-leadership: A Tour winning blueprint for UAE Team Emirates?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/pogacar-and-yates-co-leadership-at-the-2023-tour-de-france","date":1688238453000,"content":"\n      \n<p>When UAE Team Emirates general manager Mauro Gianetti announced that Tadej Pogačar and Adam Yates would enter the 2023 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> as co-leaders, it was taken with a large dose of salt. Kidology is always a large rife in the weeks running up to the Grand Départ, with the top contenders bending over backwards to explain why their rivals, rather than themselves, are the ones to watch. Nobody wants the pressure of being perceived as the favourite, and so the comments from the UAE Team Emirates camp just seemed like a classic deflection tactic to downplay Pogačar’s hype. </p>\n<div></div>\n<p><span>Sure, there were legitimate doubts about Pogačar's fitness following the injuries sustained in his crash at Liège-Bastogne-Liège in April, from which he only just returned to racing at the Slovenian national championships, and Gianetti did cite concerns that his wrist wasn’t yet completely recovered as a reason for the co-leadership status. But that didn’t convince anybody that Pogačar really was anything other than the outright leader. </span></p>\n<p><span>In light of what happened today, perhaps they were telling the truth after all. The UAE Team Emirates rider who crossed the finish line in Bilbao with victory aloft in celebration was not Pogačar, but rather Yates, who was granted some freedom in the finale to go out on the attack, and then work with his twin Simon before taking the stage victory in a familial two-up sprint. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_2471.jpg?v=1688237778\" alt />Initially, it seemed UAE were indeed all riding with only Pogačar’s fate in mind. On the decisive final climb of Côte de Pike, they set a fierce pace with the Slovenian in tow. First Felix Großschartner and then Yates himself shredding the peloton to bits. Only defending champion Jonas Vingegaard and surprise of the day Victor Lafay were able to follow Yates, who pulled off after a rapid 250-metre turn to allow Pogačar to attack. The action, it seemed, of a super-domestique and not a co-leader. </span></p>\n<p><span>But when the impetus went out of the group after Vingegaard declined to take a turn, Yates bridged back up to them with a few other GC contenders (David Gaudu, Mattias Skjelmose, and his brother Simon), and what happened next was the first indication that the team are indeed trying a new double-headed approach. Rather than set the pace again for Pogačar, and inflict more damage on their GC rivals who had been dropped, Yates instead capitalised on the slowdown to fire himself up the road. </span></p>\n<p>Then, when Adam was joined by his twin Simon, and he radioed into his team for instructions as to what to do, he was given the go ahead: he was free to ride with Simon and go for the stage win. This was especially significant as Simon Yates, a former Grand Tour winner and quality climber, is a legitimate yellow jersey contender and a rival to Pogačar. If UAE Team Emirates were indeed only thinking about Pogačar, Adam would surely have been told to have sat on Simon’s wheel so as not to help him gain time.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_2393.jpg?v=1688237801\" alt />After winning the stage, Yates talked more about his role in the team, which he described as being like something in-between a co-leader and a domestique. “I'm sure people doubted having two guys as leaders. I might be a leader, but more in support. When I can do things like this when the team is under pressure and it works out like this, it's perfect. Over the next few weeks I'm 100% for Tadej.”</p>\n<p><span>The idea seems to be to use Yates to help Pogačar when necessary, but to also keep him high up on GC to give the team another option. That was how today played out, with Yates first setting up Pogačar for his attack, and then riding for himself when his teammate failed to drop Vingegaard. </span></p>\n<p><span>It’s an approach we’ve seen Ineos Grenadiers use successfully in past Tours, as in 2018 when Chris Froome fulfilled the role to finish third place behind Geraint Thomas, and the following year when Thomas did the same behind Egan Bernal in an Ineos one-two. And intriguingly, it was also the approach Jumbo-Visma used last year to successfully defeat Pogačar, when Vingegaard memorably teamed up with Primož Roglič on the Col du Galibier to repeatedly attack and ultimately break the Slovenian, laying the foundations for Vingeagaard’s ultimate triumph. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-04196.jpg?v=1688237862\" alt />In this sense, the roles between UAE Team Emirates and Jumbo-Visma have reversed since last year, with Jumbo, in the absence of Roglič, not including a co-leader this year. Whereas UAE rode very aggressively today, first with Pogačar wanting to push on and then Yates attacking, Jumbo were much more conservative, and Vingegaard waited for his teammates to catch up after the climb to start chasing the two Yates. </span></p>\n<p><span>It was another impressive display of strength-in-depth from the team, as the familiar duo of Sep Kuss and Wout van Aert, plus new recruit Wilco Kelderman, bridged up to him and led a peloton reduced to just a dozen riders to the finish in Bilbao. Yet the inability of any of these riders to follow Yates’ pace might be a concern, and does make them look weaker than last year. As a rider who has finished on the Giro d’Italia podium in the past and was fifth at his last Tour appearance in 2021, Kelderman is the one who could fulfil a similar role to Roglič, but the evidence early on is that Yates will make for a much more potent co-leader-cum-superdomestique than him.</span></p>\n<p><span>Yates will now wear the yellow jersey, and it will be interesting to see how committed UAE are in defending it. Although he acts as a useful placeholder for Pogačar, who is shielded from having to take the demanding media duty that comes with the jersey, the obligation is still now on the team to defend it, which could use up precious energy while Jumbo-Visma and other rivals get to rest more. But only one day into the Tour, they’ll be happy to have given Jumbo-Visma and all of their other rivals something else to think about in the form of a very dangerous looking and well-placed Adam Yates.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0ad0ae9242b5e34442c63fe4f9ef051355e027e18aa37662eff8dfe1167f7446","category":"Cycling"}