{"title":"BMC’s new URS LT adds front suspension to the forward-thinking gravel bike","link":"https://cyclingtips.com/2021/09/bmcs-new-urs-lt-adds-front-suspension-to-the-forward-thinking-gravel-bike/","date":1632706222000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-gravel-Suspension-fork-information-cyclingtips-5-650x366.jpg\" /></div><h2>BMC's new URS LT adds front suspension to the forward-thinking gravel bike</h2><p>\n</p><p>Released in 2019, the <a href=\"https://cyclingtips.com/2019/07/bmc-unrestricted-urs-2020-first-ride-review/\" target=\"_blank\">URS</a> was BMC’s official entry into the gravel space and it did so in a number of forward-thinking ways. Now, BMC has released the URS LT – a bike that adds a proprietary front suspension fork to the front of one of our <a href=\"https://cyclingtips.com/2020/05/our-favourite-bikes-from-the-2020-gravel-bike-field-test/\" target=\"_blank\">favourite off-road-focussed gravel bikes</a>. </p>\n\n\n\n<p>With 20mm of coil-sprung and oil damped front suspension, BMC’s new gravel-specific MTT fork is quite intriguing and creates a full suspension gravel bike of sorts. The aesthetic design also sure has us reminiscing about the early <a href=\"https://cyclingtips.com/2020/04/road-suspension-and-innovation-paris-roubaix/\" target=\"_blank\">Cannondale HeadShock</a>. </p>\n\n\n\n<p>Between Road World Championships and lockdowns we weren’t able to attend the launch of this new bike, but will hopefully get one to review in the near future. In the meantime, here’s what to know of BMC’s new “Long Travel” URS. </p>\n\n\n\n<h2>A recap of the URS</h2>\n\n\n\n<p>The Unrestricted, or URS for short, is a gravel bike that blends a number of BMC’s concepts from both the road and mountain bike worlds. Our coverage and first-ride review from the original <a href=\"https://cyclingtips.com/2019/07/bmc-unrestricted-urs-2020-first-ride-review/\" target=\"_blank\">URS launch</a> takes a deep dive into much of the tech, and our more recent <a href=\"https://cyclingtips.com/2020/03/2020-bmc-urs-three-gravel-bike-review/\" target=\"_blank\">review of the URS Three</a> backs many of those initial findings. </p>\n\n\n\n<figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/BMC-URS-Unrestricted-gravel-bike-2020-electric-first-ride-review-cyclingtips-3.jpg\" /><figcaption>Launched two years ago, the original URS was a groundbreaking bike in the gravel space.  </figcaption></figure>\n\n\n\n<p>Designed with modern mountain bike geometry principles, the URS offers a longer front centre matched with a shorter stem. At front sits a slacker 70-degree head angle and a pretty long trail figure. </p>\n\n\n\n<p>The URS balances 425 mm chainstays with clearance for 700×45 mm rubber, but the trade-off is that the frame is only compatible with 1x drivetrains. This was certainly a polarising design decision but suitable 1x gearing range options have since improved. </p>\n\n\n\n<div><figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/BMC-URS-geometry.jpg\" /><figcaption>The new URS LT shares the same geometry chart as the original URS. </figcaption></figure></div>\n\n\n\n<p>First used on BMC’s Teamelite 01 hardtail, the URS features an elastomer-based damper built into the seatstays of the frame. Dubbed MTT, this provides 10mm of rear wheel ‘travel’ that’s designed to aid in traction and comfort at the rear of the bike. It’s a feature that makes a difference in energy-sapping terrain. </p>\n\n\n\n<p>Other features of the original URS include the use of BMC’s ICS integrated cable routing through the headset, a D-shaped seatpost that adds further ride comfort, plenty of mounting points, and a relatively low frame weight. </p>\n\n\n\n<figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/BMC-Unrestricted-URS-Three-2020-gravel-bike-review-cyclingtips-field-test-17.jpg\" /><figcaption>BMC’s original MTT is an elastomer-based soft tail design. </figcaption></figure>\n\n\n\n<p>The 407mm fork length is fairly long and two years ago BMC hinted that the bike was designed to work with a suspension fork. Options were pretty limited then, but it’s now apparent that BMC was busy cooking up something in the kitchen. </p>\n\n\n\n<p>And that brings us to the URS LT (Long Travel) – a new model that shares the identical carbon fibre URS frame, but features a novel fork. </p>\n\n\n\n<h2>URS LT and MTT </h2>\n\n\n\n<p>Only available with the URS LT, BMC’s new MTT fork offers 20mm of coil-sprung and oil-damped suspension with many of the working components hidden within the steerer tube. And yes, it can be locked out. </p>\n\n\n\n<p>BMC enlisted the help of HiRide for the design, the same Italian company responsible for the <a href=\"https://cyclingtips.com/2019/04/ridden-and-rated-the-full-suspension-road-bike-system-used-by-team-sky/\" target=\"_blank\">micro-suspension found in Pinarello’s Dogma FS road bike</a> that was made with Roubaix in mind. However, BMC is the first to bring the tech to the gravel world. </p>\n\n\n\n<div>\n<div>\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-gravel-Suspension-fork-information-cyclingtips-3.jpg\" /><figcaption>The new MTT fork moves by 20 mm below the head tube. </figcaption></figure>\n</div>\n\n\n\n<div>\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-gravel-Suspension-fork-information-cyclingtips-1.jpg\" /></figure>\n\n\n\n<p>A lockout knob sits above the stem, and offers progressive adjustment rather than a binary on/off setting. </p>\n</div>\n</div>\n\n\n\n<p>The suspension unit is made of aluminium and steel construction, with the hydraulic damper in the lower section and the steel springs stacked above. Compared to a more typical suspension fork, BMC’s design aims to reduce stiction in order to be effective over high-frequency bumps. This helps to explain the choice of the coil spring versus an air spring, and also why the system telescopes on needle bearings versus bushings that are often used in suspension forks. </p>\n\n\n\n<p>On paper, the design sounds somewhat like the <a href=\"https://cyclingtips.com/2020/06/2021-specialized-diverge-in-depth-review/\" target=\"_blank\">FutureShock found in Specialized’s Diverge</a>, but being placed below the head tube means BMC’s design should aid in both traction and comfort, as opposed to just the latter. </p>\n\n\n\n<p>With the original MTT concept found in the rear end of a number of BMC’s bikes, the company obviously has experience in integrating lightweight elastomers. However, when it came to the fork, BMC decided elastomers were too limiting with the amount of suspension travel and tuning options they sought.  </p>\n\n\n\n<p>The MTT suspension unit bolts to the aluminium crown of the fork, and below this sit carbon fibre fork blades that share a similar aesthetic to the URS’ rigid fork. The Swiss company says it adds around 800 g over the URS’s rigid fork and is designed to be competitive with other market options. While the company hasn’t provided a specific figure, I expect the fork to sit around the 1,250-1,300 g mark. </p>\n\n\n\n<p>Without an adjustable air spring, the spring rate and spring preload (firmness) are tuneable via three different springs and three different plastic preload shims. Making such an adjustment requires a special tool, something your local BMC dealer will apparently have.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-suspension-fork-sag-1340x754.jpg\" /><figcaption>The MTT fork is designed to run on 25% sag (5 mm). Tap the arrow for some more tech details.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-suspension-fork-internals-1340x754.jpg\" /><figcaption>A look at the MTT internals. The hydraulic damper sits above the crown, while the steel springs are within the upper portion of the steerer tube. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-suspension-fork-preload-1340x754.jpg\" /><figcaption>The system is tuneable to different rider weights and riding styles. BMC will offer three coil spring weights and three preload inserts which assist to compress and firm up the springs.</figcaption></figure></li></ul></figure>\n\n\n\n<p>With moving components inside, the steerer tube is a larger 1 1/4in diameter. This is a size that has slowly become the industry’s second most common offering with the likes of Canyon and Giant using it on many of their performance road bikes, and as a result, brands such as Zipp and Ritchey offer compatible aftermarket stem options, too. BMC state that the system allows up to 4 cm of stem height adjustment, the steerer tube can apparently be cut by a similar amount, and headset compression is achieved via a threaded nut that sits beneath the lockout knob. </p>\n\n\n\n<p>With suspension components filling the headtube, the URS LT doesn’t feature wholly concealed brake hoses and gear cables (if relevant), instead, those are left exposed between the handlebar and the modular port on the downtube. </p>\n\n\n\n<p>The MTT fork is the same length as the URS’ original rigid fork and so the bike geometry is unchanged. </p>\n\n\n\n<h2>Questions about servicing </h2>\n\n\n\n<p>There are typically three obvious downsides that come with the added complexity of moving components. Additional weight is the easy one to measure. The added cost is another. However, introduced maintenance and wear is a downside often overlooked in the bike buying process. </p>\n\n\n\n<p>“Due to the design of the system the service intervals are very long, exceeding two years under heavy use,” said a representative from BMC on the matter. That is indeed a long timeframe for a suspension component, especially when the likes of RockShox and Fox typically suggest services every 50-100 hours of use. However given a special tool is required to swap springs, it’s expected the eventual service of this fork may be somewhat involved. </p>\n\n\n\n<p>Related to this point, when asked about retro-fitting the MTT fork to pre-existing URS bikes, BMC suggested that while it is possible, it is an advanced task and so they’ve decided not to offer the fork as a separate item for now. </p>\n\n\n\n<h2>Two model options </h2>\n\n\n\n<p>BMC has two models of the new URS LT, sharing the same frameset and available in four size options. Both models are available now. </p>\n\n\n\n<p>The URS LT One (US$7,999 / €7,999) tops the range with a SRAM Force AXS ‘Mullet’ groupset that employs a X0 Eagle rear derailleur to span the 10-52T cassette range. The bike rolls on BMC’s own brand of tubeless-ready carbon wheels, which are wrapped with 40 mm WTB Raddler tyres. By comparison, the similarly-equipped rigid URS 01 Two retails for €7,499, trading in the MTT front suspension for concealed cabling. </p>\n\n\n\n<p>At US$6,299 / €5,999, the URS LT Two moves to a SRAM Rival/GX AXS ‘Mullet’ groupset to provide the same gearing range as above. The wheels are DT Swiss’ G1800 Spline which spin the fellow Swiss company’s 370-series hub. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-gravel-Suspension-fork-information-cyclingtips-8-1340x754.jpg\" /><figcaption>The BMC LT One.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-gravel-Suspension-fork-information-cyclingtips-12-1340x754.jpg\" /><figcaption>The BMC LT Two. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-gravel-Suspension-fork-information-cyclingtips-9-1340x754.jpg\" /><figcaption>The suspension unit is wholly contained within the steerer tube and so has little impact on the bike’s component compatibility. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-gravel-Suspension-fork-information-cyclingtips-7-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/BMC-URS-LT-MTT-gravel-Suspension-fork-information-cyclingtips-4-1340x754.jpg\" /></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/09/bmcs-new-urs-lt-adds-front-suspension-to-the-forward-thinking-gravel-bike/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0ad9981caeab81b5bbc7949128b1e319f945dc3c11ca379d6ea696d88acfb79e","category":"Cycling"}