{"title":"There’s a new way to flip bits in DRAM, and it works against the latest defenses","link":"https://arstechnica.com/?p=1976765","date":1697718600000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/data-corruption-800x600.jpg\" alt=\"There’s a new way to flip bits in DRAM, and it works against the latest defenses\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/data-corruption.jpg\">Enlarge</a> </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In 2015, researchers reported a surprising discovery that stoked industry-wide security concerns—an attack called RowHammer that could corrupt, modify, or steal sensitive data when a simple user-level application repeatedly accessed certain regions of DDR memory chips. In the coming years, memory chipmakers scrambled to develop defenses that prevented the attack, mainly by limiting the number of times programs could open and close the targeted chip regions in a given time.</p>\n<p>Recently, researchers devised a new method for creating the same types of RowHammer-induced bitflips even on a newer generation of chips, known as DDR4, that have the RowHammer mitigations built into them. Known as RowPress, the new attack works not by “hammering” carefully selected regions repeatedly, but instead by leaving them open for longer periods than normal. Bitflips refer to the phenomenon of bits represented as ones change to zeros and vice versa.</p>\n<p>Further amplifying the vulnerability of DDR4 chips to read-disturbance attacks—the generic term for inducing bitflips through abnormal accesses (i.e., activations) to memory chips—RowPress bitflips can be enhanced by combining them with RowHammer accesses. Curiously, raising the temperature of the chip also intensifies the effect.</p></div><p><a href=\"https://arstechnica.com/?p=1976765#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1976765&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0af8540118c1c493d6bdc2aa5deaeb73f08f9d27469d28aa29a9bd0d9c4a9325","category":"Tech"}