{"title":"Factors associated with sexual violence against reproductive-age women in Ghana: A multilevel mixed-effects analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311682","date":1727964000000,"content":"<p>by Yohannes Mekuria Negussie, Angwach Abrham Asnake, Zufan Alamrie Asmare, Bezawit Melak Fente, Mamaru Melkam, Meklit Melaku Bezie, Hiwot Atlaye Asebe, Beminate Lemma Seifu</p>\r\nBackground <p>Sexual violence against women is a pervasive public health challenge and human rights violation, with global prevalence rates of approximately one in three women affected, notably prevalent in African countries. Understanding its multifaceted determinants is crucial for developing targeted intervention strategies. Thus, this study aimed to investigate factors associated with sexual violence against reproductive-age ever-married women in Ghana.</p> Methods <p>A weighted sample of 3,816 reproductive-age ever-married women from the 2022 Ghana Demographic and Health Survey (DHS) was included. To accommodate the hierarchical nature of the DHS data and the binary outcome variable ‘sexual violence’, a multilevel mixed-effect logistic regression model was employed. The deviance value was utilized for selecting the best-fitted model. In the multivariable multilevel binary logistic regression analysis, adjusted odds ratios (AORs) along with their respective 95% confidence intervals (CIs) were utilized to gauge the association strength, with statistical significance set at a p-value &lt; 0.05.</p> Result <p>The prevalence of sexual violence was found to be 8.80% (95% CI: 7.94–9.74). Factors positively associated with sexual violence included women’s decision-making autonomy (AOR = 1.39, 95% CI: 1.08–1.74), husband/partner’s alcohol consumption (AOR = 3.88, 95% CI: 2.98–5.06), sex of household head (AOR = 1.31, 95% CI: 1.02–1.68), and justification of beating (AOR = 1.35, 95% CI: 1.01–1.81). Conversely, women’s age showed a negative association with sexual violence (AOR = 0.68, 95% CI: 0.48–0.98).</p> Conclusion <p>In conclusion, prioritizing initiatives that empower women in decision-making roles, provide support for those struggling with alcohol consumption, and raise awareness about its impact on interpersonal relationships and the risk of sexual violence is essential. Furthermore, addressing harmful gender norms, particularly those justifying violence, and considering demographic characteristics are vital components of comprehensive strategies to prevent and mitigate sexual violence.</p>","author":"Yohannes Mekuria Negussie","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0afe3490de43ee460b56285c096eeabea5d373cd8e07aa1084f1d5c752e15cbc","category":"Interdisciplinary"}