{"title":"Apple 'Tracking Employee Attendance' in Crackdown on Remote Working","link":"https://www.macrumors.com/2023/03/23/apple-tracking-staff-office-attendance/","date":1679568098000,"content":"Apple is tracking the attendance of its employees at offices using badge records in order to ensure they are coming in at least three times a week, according to <em>Platformer</em>'s Zoë Schiffer.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/05/apple-park-at-night-1.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nSince April 2022, Apple employees have been operating on a <a href=\"https://www.macrumors.com/2022/04/11/apple-employees-returning-to-offices/\">hybrid home/office work policy</a> as part of a gradual return strategy following the pandemic, with staff required to work from the office at least three days per week. \r<br />\n\r<br />\nEmployees are required to be in the office on Mondays, Tuesdays, and Thursdays, with most able to work remotely on Wednesdays and Fridays. However, it appears that Apple is doubling down on this strategy as it looks for ways across the company to cut costs.\r<br />\n\r<br />\nIn a <a href=\"https://twitter.com/ZoeSchiffer/status/1638677318104408064\">post</a> on Twitter, Schiffer said that Apple is now actively tracking in-person attendance using badge records and will give employees \"escalating warnings\" if they don't come in the required three times per week.\r<br />\n\r<br />\nAccording to Schiffer, some Apple offices have even warned staff that failure to comply could result in job termination, although that \"doesn't appear to be a company-wide policy.\"\r<br />\n\r<br />\nThe development follows a <a href=\"https://www.bloomberg.com/news/newsletters/2023-03-19/apple-cost-cutting-efforts-no-layoffs-but-less-travel-and-delayed-bonuses-lffgahkd\">recent report</a> by <em>Bloomberg</em>'s Mark Gurman in which he outlined several cost-cutting measures being newly enacted by Apple, including managers becoming \"as strict as ever\" about office attendance, with some staff believing it to be a harbinger of Apple firing employees who don't meet the requirement.\r<br />\n\r<br />\nIn this regard, Gurman has also reported an overlap in retail stores, with Apple taking a closer look at work attendance and hours, and the company ditching its \"special sick time\" for time missed due to Covid, asking staff to use their normal sick time instead.\r<br />\n\r<br />\nAccording to the report, Apple isn't always filling positions when employees leave, suggesting the crackdown on staff who do not fulfill the in-person work requirements is at least in part one aspect of its wider strategy to cut costs while avoiding the sort of mass layoffs that have recently befallen other tech giants, including Meta, Microsoft, Google, and Amazon. <br />This article, \"<a href=\"https://www.macrumors.com/2023/03/23/apple-tracking-staff-office-attendance/\">Apple 'Tracking Employee Attendance' in Crackdown on Remote Working</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-tracking-employee-attendance-in-crackdown-on-remote-working.2384530/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0b03bff3ed0fddb5fe15705459ef961075f39f53b51b980fb00822874153dd9f","category":"Apple"}