{"title":"Diatom abundance in the polar oceans is predicted by genome size","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002733","date":1723125600000,"content":"<p>by Wade R. Roberts, Adam M. Siepielski, Andrew J. Alverson</p>\r\n\r\nA principal goal in ecology is to identify the determinants of species abundances in nature. Body size has emerged as a fundamental and repeatable predictor of abundance, with smaller organisms occurring in greater numbers than larger ones. A biogeographic component, known as Bergmann’s rule, describes the preponderance, across taxonomic groups, of larger-bodied organisms in colder areas. Although undeniably important, the extent to which body size is the key trait underlying these patterns is unclear. We explored these questions in diatoms, unicellular algae of global importance for their roles in carbon fixation and energy flow through marine food webs. Using a phylogenomic dataset from a single lineage with worldwide distribution, we found that body size (cell volume) was strongly correlated with genome size, which varied by 50-fold across species and was driven by differences in the amount of repetitive DNA. However, directional models identified temperature and genome size, not cell size, as having the greatest influence on maximum population growth rate. A global metabarcoding dataset further identified genome size as a strong predictor of species abundance in the ocean, but only in colder regions at high and low latitudes where diatoms with large genomes dominated, a pattern consistent with Bergmann’s rule. Although species abundances are shaped by myriad interacting abiotic and biotic factors, genome size alone was a remarkably strong predictor of abundance. Taken together, these results highlight the cascading cellular and ecological consequences of macroevolutionary changes in an emergent trait, genome size, one of the most fundamental and irreducible properties of an organism.","author":"Wade R. Roberts","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"0b04a8676f86d94e2917399eeeb39f7b40c3fa19255fe36fc4d8c5fc25922a1f","category":"Environment"}