{"title":"How Can 4D-STEM Inform Atom Probe Experiments? Relating Structure and Composition of Multiferroic Oxides at the Atomic Scale","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.021/7719386?rss=1","date":1721779200000,"content":"<span>The functional properties of transition metal oxide thin films are largely governed by the emergence and manipulation of features such as ferroelectric and magnetic domains, domain walls and higher order structures such as polar vortices or magnetic skyrmions, exotic phenomena which show great promise for future low-power nanoelectronics and memory-storage applications [<a href=\"#ozae044.021-B1\">1-3</a>]. These properties almost always manifest themselves due to atomic-scale structural and compositional variations. STEM and APT offer unparalleled resolution, both spatially and compositionally, which make them invaluable techniques for the study of these atomic-scale features. While the advantage of APT lies in its 3D nanoscale mapping of compositional variation, STEM additionally provides the ability to probe the reciprocal space through electron diffraction. Most recently with the advent of fast pixelated detectors, techniques like 4D-STEM are now widely used and provide information-rich datasets at large fields of view for picometer-resolution imaging, strain and orientation mapping, polarization and magnetic field mapping, and much more[<a href=\"#ozae044.021-B4\">4</a>]. By implementing a correlative approach (Figure 1), structural information from diffraction experiments in STEM can be correlated to 3-dimensional compositional mapping from APT, providing exciting new pathways for probing nanoscale volumes of materials and emerging physical properties at this scale.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"0b0ac3c449ff9b8f4eb471678237e57f80d2a1d83a8ae52d302f2b729cd8e5c4","category":"Environment"}