{"title":"Tour de France 2021 - The Hardest Climbs","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-most-difficult-climbs","date":1622822893000,"content":"\n      <p><span>The Tour de France 2021 route may suit the time-trialists more than the pure climbers. For that very reason, we saw some of the best climbers in the world, including Egan Bernal, Mikel Landa and Romain Bardet head to the Giro d’Italia last month, which featured fewer total kilometres on the time trial bike. </span></p>\n<p><span>But the Tour wouldn't be the Tour without some of France's most stunning and intimidating climbs. So, despite many of the pure climbers favouring the Giro, the Tour winner will still have to conquer some of the most famous Tour de France mountains.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Related – Tour de France 2021 Preview</a></strong></em></p>\n<h4><b>Montée de Tignes - Stage 9</b></h4>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/download_4_a70c604e-e24a-46ca-9be9-47683fd37687_600x600.png?v=1622744268\" /></div>\n<p><em>Montée de Tignes (via La Flamme Rouge)</em></p>\n<p><span>The first potentially decisive mountain test comes ahead of the first rest day, on stage 9 to Tignes. Over 20 kilometres in length, the Montée de Tignes is renowned for its length rather than its severe gradients. The winner must also be adept at riding in high altitude, as the top of the climb peaks at almost 2,100 metres above sea level. </span></p>\n<p><span>The climb was last ascended in the 2007 Tour de France, where Michael Rasmussen won by an astonishing two minutes and 47 seconds. He went on to win another stage at that year’s race — stage 16 on the Col d'Aubisque. </span></p>\n<h4><b>Mont Ventoux - Stage 11</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Mont-Ventoux_002_1024x1024_b0629279-135c-4571-badb-b2a52073a843_1024x1024.jpg?v=1622818383\" /></span></i></p>\n<p>When you think of mountains at the Tour do France, Mont Ventoux immediately springs to mind. The famous mountain has been passed on five occasions since 2000, and previous winners have included Marco Pantani, Richard Virenque and Chris Froome. </p>\n<p>In French, ‘<em>venteux’ </em>means<em> ‘windy’. </em>This isn’t by coincidence, the summit of the climb is susceptible to exceptionally strong winds which can have a significant impact on the riders. There is little vegetation on the top of Mont Ventoux. Instead, limestone can be seen, which makes the climb instantly recognisable. </p>\n<p>A memorial to Tom Simpson lies near the summit. The British rider died tragically whilst climbing Mont Ventoux at the 1967 Tour de France.</p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-545345387_1024x1024.jpg?v=1622819492\" /></span></i></p>\n<p><i><span>Image credit: Beucher/Andia/Universal Images Group via Getty Images</span></i></p>\n<p>Mont Ventoux has been the scene for many incredible victories throughout Tour de France’s history. En route to his first yellow jersey in 2013, Chris Froome blew the opposition away on the iconic climb. Nairo Quintana was the only rider to finish within a minute of the Team Sky man and the result meant that Froome extended his advantage in yellow to four minutes. Froome will also remember the climb for the chaotic stage 12 in the 2016 Tour, where he ended up running up the mountain.</p>\n<p>The peak of Mont Ventoux reaches an altitude of 1,900 metres. The climb is both long and steep at 15.8km and 8.5% average gradient. However, for the first occasion in Tour de France history, Mont Ventoux will be ascended twice within the same stage. The first ascent is actually longer at a leg-sapping 24.6km but it averages less than 5%. A long descent follows before returning to climb the shorter, more difficult route up the mountain. Stage 11 doesn’t finish at the mountain’s peak. Instead, a 17-kilometre descent will carry the riders to the finish town of Malaucène.</p>\n<h4><b>Col du Portet - Stage 17</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1005203248_1024x1024.jpg?v=1622822780\" /></span></i></p>\n<p><i><span>Image credit: Marco Bertorello/Getty Images</span></i></p>\n<p><span>Part of the French Pyrenees mountain range, the Col du Portet was introduced to the Tour de France in 2018. The stage was just 65 kilometres in length and Nairo Quintana claimed the stage. Almost six minutes separated the first 20 finishers that day, which demonstrates just how challenging the Col du Portet is.</span></p>\n<p><span>Over 16 kilometres in length, the ascent is also a punishing 8.6% on average. In 2021, the climb is preceded by the Col du Peyresourde and the Col d’Azet. These two climbs add up to over 20km uphill at an average of over 7%. Part of one of the most challenging stages at the 2021 Tour de France, we’ll likely see riders all over the road by the top of the Col du Portet.</span></p>\n<b></b>\n<h4><b>Col du Tourmalet - Stage 18</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1163204820_1024x1024.jpg?v=1622822338\" /></span></i></p>\n<p><i><span>Image credit: Tim de Waele/Getty Images</span></i></p>\n<p><span>The Col du Toumalet is ever present at the Tour de France — since 2000, the Tourmalet has been passed on an incredible 14 separate occasions. </span></p>\n<p><span>The peak of the Col du Tourmalet is over 2,100 metres above sea level. The ascent features a steady gradient well over 7%, giving the riders no chance to recover until the top. Stage 18 doesn’t finish atop the Tourmalet. Instead, the riders descend the mountain before heading into Luz Ardiden. </span></p>\n<p><span>The most recent winner atop the Tourmalet was Thibaut Pinot in 2019. It was Pinot’s first stage victory at the Tour de France since 2015 and looked like it could be his chance to win the yellow jersey. The third week didn’t go Pinot’s way though, he withdrew on stage 19. </span></p>\n<p><em><span>Cover image: Tim De Waele/Getty Images</span></em></p>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0b1cadb04ca38fa535f4c5b5397e9aa2c222c80e9f600a03c92603fabcbafe0c","category":"Cycling"}