{"title":"Quantification of airborne particulate matter and trace elements deposition on Hedera helix and Senecio cineraria leaves","link":"https://www.preprints.org/manuscript/202407.1414/v1","date":1721206363000,"content":"Both, in developed and developing countries, atmospheric pollution with particulate matter (PM) remains an important issue. Despite the health effects of poor air quality, studies on air pollution are often limited by the high costs of continuous monitoring and the need of extensive sampling. Furthermore, these particles are often enriched in potentially toxic trace elements and organics pollutants. This study evaluates both, the composition of atmospheric dust accumulated during a certain time-span on leaves of Hedera helix and Senecio cineraria, as well as the potential to use them as bio-monitors. The test plants were positioned nearby automatic air quality monitoring stations at four different sites with respectively high, moderate and low traffic intensity. Gravimetric deposition of PM10 and PM2.5 on leaves was consistent with data recorded by the monitoring stations and related to the weather conditions reported by Argentina´s National Meteorological service. To determine the presence of trace elements enriching the PM deposited on leaves, two analytical techniques were applied, XRF (not destructive) and ICP (destructive). The results indicated that only in the unpaved street location (site 2), PM10 and PM2.5 concentrations in the air exceeded WHO guidelines. However, several trace elements were found enriching PM deposited on leaves from all sites. Predominantly, increased concentrations of Cd, Cu, Ti, Mn, Zn and Fe were found, which were associated to construction, traffic and unpaved street sources. Furthermore, based on its high capability to sequester PM and trace elements Senecio cineraria can be take into consideration to be adopted as a bio-monitor or even for PM mitigation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0b2049ba6106268ee9b955352af36c981ba483d24b0199a1ce1337c44a690380","category":"Interdisciplinary"}