{"title":"Climate Change, Environment, and Health: The implementation and initial evaluation of a longitudinal, integrated curricular theme and novel competency framework at Harvard Medical School","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000412","date":1716991200000,"content":"<p>by Madeleine C. Kline, Julia R. Malits, Natalie Baker, Hugh Shirley, Ben Grobman, William Éamon Callison, Stephen Pelletier, Kari Nadeau, David S. Jones, Gaurab Basu</p>\r\n\r\nClimate change, air pollution, and ecological degradation impact health through numerous, complex mechanisms. To train future physicians to understand these impacts, medical schools can deliver longitudinal climate curricula in undergraduate medical education, but the field remains nascent. This report describes the development, implementation, and evaluation of the longitudinal, integrated Climate Change, Environment, and Health curricular theme and novel competency framework at Harvard Medical School (HMS). A group of HMS students collaborated with faculty to integrate climate content into the pre-clerkship curriculum. The team subsequently pursued institutional recognition as a formal HMS curricular theme and created a new competency framework that guided curriculum integration mapping and evaluation tool development. The competencies cover the impact of climate change, air pollution, and ecological degradation on health in the context of historical and structural inequities and explore the role of healthcare in contributing to both climate change and solutions. A retrospective, eight-item survey using a seven-point Likert scale and two open-ended questions was administered at the end of the pre-clerkship curriculum. HMS approved a required, four-year Climate Change, Environment, and Health curricular theme in January 2023. Survey data from 100/134 (74.6%) study participants showed that most students agreed (somewhat agree/agree/strongly agree) the curricular theme was valuable (76.0%) and improved their understanding of the health impacts of climate change (80.0%). Most students agreed that their abilities in the five competencies improved because of exposure to the curricular theme. Qualitative comments indicated that students found the curriculum valuable, and also provided constructive feedback. Efforts to expand the curriculum to all four years of medical school and conduct further evaluation continue. Further scholarship is needed to present different curricular approaches and competency frameworks, which can ultimately support effective training of future physicians to understand and respond to the impacts of climate change on health and health equity.","author":"Madeleine C. Kline","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"0b2fc2b4edbc831643792f1f30e43d38664e5cb8d713e64622658e469b4adff2","category":"Environment"}