{"title":"The Effect of Heat Stress on Energy Metabolism, Immune Function, and Oxidative Stress of Juvenile Greater Amberjack Seriola dumerili","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/4406151?af=R","date":1720439391000,"content":"<p>In an era of striking climate change, increased marine temperature severely affects aquatic animals and cause significant ecological and socioeconomic impacts. At present, there is little information about the effects of heat stress on the physiology of greater amberjack (<i>Seriola dumerili</i>). This study explores the mechanisms whereby juvenile greater amberjacks cope with heat stress. An increase in water temperature (25 to 28째C and 31째C) changed the activity levels of enzymes responsible for antioxidant defense, immune function, and energy metabolism. When water temperatures increased from 25 to 28째C and 31째C, the levels of malondialdehyde (MDA) and glucose (GLU) in the greater amberjacks increased, suggesting that the fish suffered oxidative stress. During the early stage of heat stress, the levels of triglycerides (TG) and glutathione (GSH) and the activities of superoxide dismutase (SOD), catalase (CAT), alkaline phosphatase (ALP), acid phosphatase (ACP), lysozyme (LYZ), alanine aminotransferase (ALT), aspartate aminotransferase (AST), lactate dehydrogenase (LDH), and succinate dehydrogenase (SDH) increased significantly suggesting that juvenile greater amberjacks adapt to heat stress by enhancing their antioxidant defense, energy metabolism, and immune defense. However, long-term exposure to heat stress decreased the levels of TG and GSH; decreased the activities of SOD, CAT, ALP, ACP, LYZ, and AST; and increased the levels of MDA and GLU, suggesting that the energy metabolism and immune function of juvenile greater amberjack <i>S. dumerilis</i> are suppressed by oxidative damage. This study provides insights into the physiological adaptation of juvenile greater amberjacks to heat stress.</p>","author":"Ruijuan Hao, \nHaiping Li, \nYali Tian, \nXiaoying Ru, \nQiuxia Deng, \nKunfeng Zhu, \nTonglin Yang, \nYang Huang, \nChunhua Zhu, \nFemi Fawole","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"0b35d665f2fed00097a2495577c989bd7c8b97a3b4195a81b5b90cfbcc50528b","category":"Environment"}