{"title":"Chess on wheels: mastering the Tour de France breakaway","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/chess-on-wheels-mastering-the-tour-de-france-breakaway","date":1689102862000,"content":"\n      <p>The Polish chess grandmaster Savielly Tartakower once said, “The winner of a chess game is the player who makes the next-to-last mistake.”</p>\n<div></div>\n<p>With 600m to go in stage 10 of the 2023 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, Bahrain Victorious rider Pello Bilbao found himself with the kind of decision that will win or lose a bike race, but which also only becomes clear with the benefit of hindsight. The situation was this: Bilbao was in the wheel of Intermarché-Circus-Wanty’s Georg Zimmerman, a little clear of a quartet of riders. However, the key information was that Zimmerman and Bilbao were slowing, and the four riders behind were gaining, especially Ben O’Connor of Ag2r Citroën, who had separated him from the other three. Six hundred metres is too far from the line to sprint, too close to the line to decelerate, and the perfect distance to give the rider you’re considering passing a really great leadout, especially as by the time you’ve read this far, they were 550 metres from the line. Five hundred and twenty-five metres is a great distance for chasing riders to not only close gaps, but slingshot past.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/stage-10-of-the-2023-tour-de-france-the-weird-and-the-wonderful\"><strong><em>Read more: Stage 10 of the 2023 Tour de France: The weird and the wonderful</em></strong></a></p>\n<p>Bilbao went through, which was risky, because it’s safe to say that if he’d stayed on the front, he would not have won the stage. However, with O’Connor still gaining, Zimmerman panicked and went through, with 400m to go. This gave Bilbao shelter at the perfect moment, and when Zimmerman launched the sprint with 250m to go, the Basque rider was able to jump past and take the victory. He’d made the next-to-last mistake, but thankfully for him, Zimmerman had made the last one.</p>\n<p>Stage 10 was the archetypal day for the break. It had a hilly parcours through the Massif Central that was too hard for any sprinters to hope to win, though Alpecin-Deceuninck spent a portion of the third quarter of the stage riding as if they thought Jasper Philipsen might have a chance. It was, on paper, too straightforward for a real GC battle, though in the very early stages, Jonas Vingegaard, Tadej Pogačar and his team-mate Adam Yates, and Simon Yates, found themselves riding hard in a break, 40 seconds clear of a peloton being led by a panicking Bora-Hansgrohe and Ineos Grenadiers. It was lucky for Ineos that Bora’s Jai Hindley had missed the split, and lucky for Bora that Ineos’ Carlos Rodríguez and Tom Pidcock had done the same – if either team had got a leader up there with the Yates twins, Pogačar and Vingegaard, the other team might have been in for a long, long chase.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_8999.jpg?v=1689102621\" alt /></p>\n<p>But in the end two breaks went, and coalesced at the front to form an escape of 14 riders, representing 12 teams. The interesting thing is that these two groups took a long time to come together, which would have repercussions later, because four of the six riders who contested the finish – O’Connor, Bilbao, Zimmerman and Esteban Chaves of EF Education-EasyPost – had also been in the front group through the middle part of the stage. The exceptions were Krists Neilands, who had his Israel-Premier Tech team-mate Nick Schultz up ahead, and could therefore get away with taking fewer turns if he wanted, and Movistar’s Antonio Pedrero, who ended up coming sixth from six in the final sprint.</p>\n<p>Natural erosion brought the size of the group down over the course of the day, then it split under the impetus of Neiland’s attack with just over 30km to go.</p>\n<p>Often in bike races, when a lone attacker or small group of attackers goes, a larger group behind will fail to gel, for any number of reasons. Wrong composition, too many riders from one team, a team-mate of the rider or riders up ahead, or simply not wanting to pull a good sprinter to the finish. However, the feng shui in both groups that set off in pursuit of Neilands when he’d made his move was very good.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-01859.jpg?v=1689102753\" alt /></p>\n<p>With 25km to go, Neilands was alone in the lead, 30 seconds ahead of a quintet of Pedrero, Zimmerman, Bilbao, Chaves and O’Connor. The next group, Michał Kwiatkowski of Ineos Grenadiers, Lidl-Trek rider Matthias Skjelmose, Arkéa-Samsic’s Warren Barguil and Julian Alaphilippe of Soudal-Quick-Step.</p>\n<p>In that first group, all five were motivated, came from different teams, and none was particularly known as a fast finisher. In the second group, perhaps Kwiatkowski and Alaphilippe are fast at the end of a hard race, but the quartet nevertheless gelled very well and shared turns. There were 10 different riders involved, from 10 different teams, and no games being played, which was unusual. At 12km to go, the gaps had more or less halved to 15 seconds and 35 seconds respectively, and it was only at three kilometres to go, when the first chasing group finally caught Neilands, that the riders started looking at each other.</p>\n<p>Cycling is often described as chess on wheels, but that was only true in the final few kilometres of this stage.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0b385cd34bab6d9c92edda70c7998e3e22108217ef4d89dd460b9f18501341a1","category":"Cycling"}