{"title":"Towards a more effective REACH legislation in protecting human health","link":"https://academic.oup.com/toxsci/article/199/2/194/7616131?rss=1","date":1709078400000,"content":"<span><div>Abstract</div>There is growing evidence indicating the substantial contribution of man-made products to an increase in the risk of diseases of civilization. In this article, the Belgian Scientific Registration, Evaluation, Authorization and Restriction of Chemicals (REACH) Committee gives a critical view on the working of REACH. The current regulatory framework needs to further evolve taking into account data generated using modern science and technology. There is a need for improved assessment process not only before but also after entering the market. Objectivity, transparency, and the follow-up after market access can be optimized. Additionally, no guidance documents exist for regulation of mixture effects. Further, the lengthiness before regulatory action is a big concern. Decision-making often takes several years leading to uncertainties for both producers and end users. A first proposed improvement is the implementation of independent toxicity testing, to assure objectivity, transparency, and check and improve compliance. A “no data, no market” principle could prevent access of hazardous chemicals to the market. Additionally, the introduction of novel testing could improve information on endpoints such as endocrine disrupting abilities, neurotoxicity, and immunotoxicity. An adapted regulatory framework that integrates data from different sources and comparing the outputs with estimates of exposure is required. Fast toxicology battery testing and toxicokinetic testing could improve speed of decision-making. Hereby, several improvements have been proposed that could improve the current REACH legislation.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"0b39d854fce76fccfa6f6476619aba9098031433a827d2bb78daeba55d00842a","category":"Environment"}