{"title":"Asymptomatic infections with <i>Chlamydia trachomatis</i>, <i>Neisseria gonorrhoeae</i>, and <i>Trichomonas vaginalis</i> among women in low- and middle-income countries: A systematic review and meta-analysis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003226","date":1716472800000,"content":"<p>by Camille Fortas, Elisabeth Delarocque-Astagneau, Rindra Vatosoa Randremanana, Tania Crucitti, Bich-Tram Huynh</p>\r\n\r\nSyndromic management of sexually transmitted infections (STIs) is common in settings with limited access to diagnostic testing. However, this approach does not capture asymptomatic STIs. Untreated asymptomatic infections may result in serious complications and sequelae in women. We aimed to estimate the proportion and the prevalence of asymptomatic <i>Chlamydia trachomatis</i> (CT), <i>Neisseria gonorrhoeae</i> (NG), and <i>Trichomonas vaginalis</i> (TV) infections among women in low- and middle-income countries. We searched Medline, Scopus, and Web of Science for articles published between 2000 and 2022. We used random effect models to compute the proportion and prevalence estimates and performed sub-group analysis. We evaluated the quality of each article using the Appraisal tool for Cross-Sectional Studies and performed sensitivity analyses. This study was registered with PROSPERO, CRD42022286673. Forty-eight eligible studies were included. The proportion of asymptomatic CT, NG, and TV infections were: 60.7% [95% Confidence Interval (CI): 50.4; 70.5], 53.3% [37.1; 69.1], and 56.9% [44.6; 68.9], respectively. The proportion of women with asymptomatic infections was the highest in Africa for the three pathogens. The pooled prevalence of asymptomatic CT, NG, and TV infection was 4.70 per 100 women [95%CI: 3.39; 6.20], 3.11 [1.34; 5.54], and 5.98 [3.46; 9.12], respectively. More than half of the women infected by CT, NG, or TV were asymptomatic. To avoid undiagnosed and untreated asymptomatic infections leading to complications, alternative approaches to syndromic management urgently need to be considered.","author":"Camille Fortas","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"0b4a9effa411de410923a644829669108c9d1803509c6a8d9da37987c5025026","category":"Environment"}