{"title":"PSII-8 The effects of diet and finishing phase on the behavioral time budgets of feedlot cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/434/7757022?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Feedlot cattle undergo many transitions in diet, social group structure, and environment during the finishing period. Little is known about how their behavior may be altered by these transitions. The objective of our pilot project was to compare the behavior of younger feedlot cattle fed a low-concentrate diet to that of finishing cattle, and to create 24-h time budgets for activity and oral behaviors in these groups. Cattle [n = 20; body weight (BW) = 305 ± 21 kg, mean ± SD] were fed a low-concentrate feedlot diet (60:40, concentrate:forage; ST) and cattle (n = 20; BW = 522 ± 45 kg) received a finishing diet (90:10, concentrate:forage; FI) twice daily. Animals were separated by diet and housed in groups of 10. Trained observers recorded behaviors of each group by live instantaneous recording every 5 min for a continuous 48 h, resulting in 192 h of data collected. We predicted that ST cattle would spend more time eating and ruminating due to the higher forage diet. We also expected that FI animals would rest more and spend less time standing and walking as a result of being more familiar with the environment and their social group structure. We also quantified a wide range of oral behaviors including rumination, grooming and manipulation of non-feed items in the pen. Behaviors were summarized by 24-h period, animal, group, and diet, then averaged by animal, and then averaged again by group (n = 2/diet). Missing values accounted for 3% of the activity data and 11% of the oral behaviors. T-tests revealed that ST cattle ruminated more than FI (352 ± 3 vs. 304 ± 1 min/d, mean ± SE, <span>P</span> = 0.02), but differences between treatments were not detected for time spent eating (196 ± 15 vs. 131 ± 3 min/d), standing (584 ± 13 vs. 588 ± 29 min/d), walking (46 ± 10 vs. 35 ± 5 min/d), or lying (768 ± 16 vs. 772 ± 7 min/d; <span>P</span> ≥ 0.13). When fed the ST diet, cattle spent 5 ± 2 min/d grooming group mates, while FI cattle groomed others for 11 ± 1 min/d, although this was not analyzed statistically because it was rare. Similarly, there were numerical differences in the amount of time spent orally manipulating non-food items (8 ± 3 and 18 ± 1 min/d for ST and FI animals, respectively) that have not been previously described. These results suggest that behavioral differences might be more apparent with larger sample sizes, but with the present experimental design, the predictions were not supported. Nonetheless, these are the first behavioral observations of feedlot cattle and provide a comprehensive time budget of their activity, including a range of oral behaviors over a 48-h period.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0b594bb921c088ae4753be227c40fb26aadbe46634bb560f882d5051993a7014","category":"Environment"}