{"title":"Rhythmic lipid and gene expression responses to chilling in panicoid grasses","link":"https://academic.oup.com/jxb/article/75/18/5790/7684596?rss=1","date":1716940800000,"content":"<span><div>Abstract</div>Chilling stress threatens plant growth and development, particularly affecting membrane fluidity and cellular integrity. Understanding plant membrane responses to chilling stress is important for unraveling the molecular mechanisms of stress tolerance. Whereas core transcriptional responses to chilling stress and stress tolerance are conserved across species, the associated changes in membrane lipids appear to be less conserved, as which lipids are affected by chilling stress varies by species. Here, we investigated changes in gene expression and membrane lipids in response to chilling stress during one 24 h cycle in chilling-tolerant foxtail millet (<span>Setaria italica</span>), and chilling-sensitive sorghum (<span>Sorghum bicolor</span>) and <span>Urochloa</span> (browntop signal grass, <span>Urochloa fusca</span>, lipids only), leveraging their evolutionary relatedness and differing levels of chilling stress tolerance. We show that most chilling-induced lipid changes are conserved across the three species, while we observed distinct, time-specific responses in chilling-tolerant foxtail millet, indicating the presence of a finely orchestrated adaptive mechanism. We detected rhythmicity in lipid responses to chilling stress in the three grasses, which were also present in <span>Arabidopsis thaliana</span>, suggesting the conservation of rhythmic patterns across species and highlighting the importance of accounting for time of day. When integrating lipid datasets with gene expression profiles, we identified potential candidate genes that showed corresponding transcriptional changes in response to chilling stress, providing insights into the differences in regulatory mechanisms between chilling-sensitive sorghum and chilling-tolerant foxtail millet.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"0b5c7a6ebcd08d7ca1b2d931949da350b5b03fcfe5cc85546fffd78b6055586b","category":"Environment"}