{"title":"Is your iPhone Weather app flaking out? It’s not you, it’s Apple","link":"https://www.macworld.com/article/1682239/weather-app-ios-ongoing-system-issues.html","date":1680624031000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you’re like us, one of the first things you do each morning is to check the weather app on your iPhone. If it returned a blank screen this morning, it’s not an issue with your Wi-Fi—Apple’s systems are having serious problems.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/support/systemstatus/&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Apple’s System Status page</a>, the Weather app has had “ongoing” issues since 11:00 pm ET Monday and the service “may be slow or unreliable.” Apple notes that “some users are affected,” but based on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/__Casanova_____/status/1643224924616523777&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\">anecdotal</a> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/cocolileeee/status/1641891732051853312&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\">evidence</a>—including Macworld’s own experience—the issue appears to be fairly widespread. It also appears to affect the Weather widget, which reports “No weather data” even when the weather properly shows in the app. The status page also explicitly notes that next-hour precipitation may be unavailable for Alaska due to a data provider outage.</p>\n\n\n\n<p>Some Macworld staffers have experienced on-and-off issues with the Weather app over the past several weeks. At times, the app is slow to load or doesn’t load at all. Quitting the app and relaunching has been a quick workaround, but even that doesn’t always work. So we’re in a holding pattern until Apple gives us the green light (literally, it’s yellow on Apple’s status page at the moment). Some reports suggest that an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/04/04/ios-16-4-1-expected-soon/&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\">iOS 16.4.1 update</a> could be imminent to fix the issue, but that could take days.</p>\n\n\n\n<p>Of course, it’s not the end of the world since there are numerous ways to get weather conditions and forecasts on your phone. However, after Apple <a href=\"https://www.macworld.com/article/1440719/dark-app-weather-app-shutting-down-january-1.html\">shuttered the popular Dark Sky app</a> on January 1, the stock iOS Weather app—which picked up many of the Dark Sky features—is likely the go-to source for weather information for many more users.</p>\n\n\n\n<p>We’ll update this story as we receive more information about the issue.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0b6b64fe3360bd4c1dc999e772c517e41e63df747a3005eeceaab389877276e1","category":"Apple"}