{"title":"Saudi Arabia's Middle East Respiratory Syndrome Coronavirus (MERS-CoV) Outbreak: Consequences, Reactions, and Takeaways","link":"https://www.preprints.org/manuscript/202404.0588/v1","date":1712589805000,"content":"Global public health systems have continuously faced challenges from the advent of novel infectious illnesses, necessitating quick and efficient actions to stop their spread.First discovered in Saudi Arabia in 2012, Middle East respiratory syndrome (MERS) is a viral respiratory disorder caused by the Middle East respiratory syndrome coronavirus (MERS-CoV). Since then, the nation has reported most cases and fatalities related to this sickness, with occasional outbreaks happening in other nations and regions. Severe sickness and high mortality are caused by MERS-CoV, especially in older persons and those with underlying chronic conditions. Through intimate contact, the virus can spread from people to dromedary camels and vice versa. It has sparked multiple epidemics both domestically and abroad in the Middle East, raising the possibility of fatalities and widespread transmission, especially in susceptible groups. The Riyadh region was the main target of the most current MERS-CoV outbreak in Saudi Arabia, which began in 2023 and ended on September 1, 2023, with 312 confirmed cases and ninety-seven fatalities. With the use of published studies and their contributions to the field, we hope to present a thorough overview of the MERS-CoV outbreak in Saudi Arabia in this review of the literature, including its epidemiological investigation, public health response, impact, and lessons learned. In addition to highlighting the importance and continued relevance of this problem, our work suggests ways to lower the risk of MERS-CoV transmission and avert further outbreaks.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0b87f4b20695253f33fb1f4b78d99090e28658baa834ba24a0cb9fb085d3c01d","category":"Interdisciplinary"}