{"title":"Sonication-Assisted Decellularization of Waste Tilapia (Oreochromis niloticus) Heads for Extracellular Matrix Extraction","link":"https://www.preprints.org/manuscript/202408.0088/v1","date":1722513557000,"content":"Tilapia, the second most extensively farmed fish in the Philippines, generates significant amounts of waste that are often underutilized, leading to environmental concerns. One specific waste material is tilapia heads, which contain a valuable extracellular matrix (ECM) and an abundant source of bioactive materials that have a potential application in various fields, including biomaterials for wound healing and nutraceuticals. This study aims to evaluate the effects of sonication as a viable decellularization method for extracting ECM from tilapia fish heads. Histological analyses, employing H&amp;E staining, revealed a higher reduction in basophilic components in the sonication-assisted (dWS) samples compared to those without sonication (dNS), as confirmed by DNA quantification. Notably, dWS samples subjected to 1% SDS sonication for 10 minutes exhibited the lowest DNA content with a removal rate of 93.7%. However, the same dWS sample also manifested the highest protein removal with a retained protein of 33.86%. The SDS-PAGE analysis of both dWS and dNS samples exhibited a uniform pattern, featuring identical four subunit bands—namely, the β-dimer (225-227 kDa), γ bands (228-230 kDa), and two alpha chains (α1 and α2 chains) (116-120 kDa)—indicating that sonication did not introduce discernible alterations in the helical structure of collagen. ATR-FTIR spectra further confirmed the presence of collagen as indicated by the detection of collagen type I indicators, including amides A, B, I, II, and III, in all decellularized samples. The above findings highlight the potential of sonication to aid in the decellularization of waste tilapia heads with future research targeting practical applications in wound healing, nutraceuticals, and sustainable environmental preservation through waste utilization.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0b893b02df662cde2fb40d65817a494496c21775cb2a9e3122d7ba8711c64910","category":"Interdisciplinary"}