{"title":"Satisfaction and Workload as Predictors of Psychological Distress in Professionals of Psychosocial Care Centers During the COVID-19 Pandemic","link":"https://www.preprints.org/manuscript/202410.1701/v1","date":1729591566000,"content":"Background and aims: The COVID-19 pandemic significantly impacted the mental health of healthcare professionals, especially those working in Psychosocial Care Centers (CAPS), which are crucial services in the Brazilian mental health system. This study aimed to analyze satisfaction and workload as predictive factors for psychological distress among CAPS professionals during the pandemic. Methods: A cross-sectional study was conducted with 53 professionals from seven CAPS. The Workload Impact Scale (IMPACTO-BR) and Job Satisfaction Scale (SATIS-BR), the General Health Questionnaire (GHQ-12), and a sociodemographic questionnaire were used. Descriptive and analytical statistical analyses were performed. Results: Professionals reported moderate satisfaction (3.67 ± 0.45) and mild workload (1.82 ± 0.63). One-third of the sample showed scores indicative of psychological distress. Logistic regression analysis revealed that workload (OR = 1.39, 95% CI = 0.0025) and low job satisfaction (OR = 1.23, 95% CI = 0.0495) were significant predictors of psychological distress. Conclusions: Low job satisfaction and high professional workload were predictive variables of psychological distress. These findings highlight the need for investments in promoting the quality of life at work for mental health professionals, especially during crises. The implications for human resource management and public policy development emphasize the importance of an integrated approach that considers the well-being of professionals for the effectiveness and sustainability of the psychosocial care model.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0b89c5e5bc0a417528bafd7e66deecef27d5bed250601b32776446bf966f0955","category":"Interdisciplinary"}