{"title":"Android sends 20x more data to Google than iOS sends to Apple, study says","link":"https://arstechnica.com/?p=1753357","date":1617142686000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/phone-privacy-800x534.jpeg\" alt=\"A woman under a thick blanket looks at her smartphone.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/phone-privacy.jpeg\" class=\"enlarge-link\" data-height=\"667\" data-width=\"1000\">Enlarge</a> <span class=\"sep\">/</span> Insomnia people and mobile-addiction concepts. (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://www.gettyimages.com/\">Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Whether you have an iPhone or an Android device, it’s continuously sending data including your location, phone number, and local network details to Apple or Google. Now, a researcher has provided a side-by-side comparison that suggests that, while both iOS and Android collect handset data around the clock—even when devices are idle, just out of the box, or after users have opted out—the Google mobile OS collects about 20 times as much data than its Apple competitor.</p>\n<p>Both iOS and Android, researcher Douglas Leith from Trinity College in Ireland said, transmit telemetry data to their motherships even when a user hasn’t logged in or has explicitly configured privacy settings to opt out of such collection. Both OSes also send data to Apple and Google when a user does simple things such as inserting a SIM card or browsing the handset settings screen. Even when idle, each device connects to its back-end server on average every 4.5 minutes.</p>\n<h2>Apps and more</h2>\n<p>It wasn’t just the OSes that sent data to Apple or Google. Preinstalled apps or services also made network connections, even when they hadn’t been opened or used. Whereas iOS automatically sent Apple data from Siri, Safari, and iCloud, Android collected data from Chrome, YouTube, Google Docs, Safetyhub, Google Messenger, the device clock, and the Google search bar.</p></div><p><a href=\"https://arstechnica.com/?p=1753357#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1753357&comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0b9b8d2cca297007a45e258373d2d4ff32b34850912e6ca364fc4cb8ca9671b2","category":"Tech"}