{"title":"Correlative Electron and X-ray Spectroscopy of Processing Battery Materials","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.858/7719954?rss=1","date":1721779200000,"content":"<span>Lithium-ion battery technology provides critical energy-storage needs for society, ranging from everyday electronics to electrified transportation and power grids. The demand for lighter devices and longer-duration storage continues to fuel the need for safer and higher-energy batteries. This need, in turn, requires designing new battery materials, understanding how they function and, ultimately, synthesizing them at scale – specifically, through large-scale manufacturing. Technical advances in characterization and computation over the past decade have greatly facilitated the discovery and design of battery materials, but manufacturing them at a large scale with the required capacity, power, lifespan, and safety presents another layer of complexity and has been a hurdle to their commercial deployment. The difficulty largely lies in the knowledge gap in understanding the synthesis and processing processes, wherein reactions occur at multiple length scales and often follow elusive kinetic pathways [<a href=\"#ozae044.858-B1\">1</a>]. To investigate the kinetic reaction pathways involved in synthesis/processing, synchrotron X-ray based <span>in situ</span> spectroscopies are preferentially employed, offering high throughput along with high temporal resolutions and chemical sensitivity. However, their spatial resolution is generally limited, necessitating correlative characterization using techniques like scanning/transmission electron microscopy (S/TEM), which provides high spatial resolution (down to sub-Å scale) and analytical capability in imaging, diffraction, and spectroscopy within a single instrument.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"0badea33d3a2b21f3b0fb5f1ca961649a08e9a49dcc50242e30d6e1dc738cba3","category":"Environment"}