{"title":"Review: James Gunn’s The Suicide Squad is like The Boys on steroids","link":"https://arstechnica.com/?p=1784974","date":1628380822000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/harleyLIST-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/harleyLIST.jpg\">Enlarge</a> <span>/</span> Don't call it a reboot: Margot Robbie stars in James Gunn's <em>The Suicide Squad</em> (credit: Warner Bros.)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Fan enthusiasm has been high leading up to the premiere of <em>The Suicide Squad</em>, James \"Don't Call It a Reboot\" Gunn's band-of-misfit-supervillains homage to the classic 1967 film <a href=\"https://en.wikipedia.org/wiki/The_Dirty_Dozen\"><em>The Dirty Dozen</em></a> (among many other influences).  That enthusiasm was not misplaced. This tenth installment in the DCEU is a fast-paced, blood-soaked, wildly irreverent escapade that skillfully balances gore and goofiness, with equal amounts of irreverence and sincerity. Think <a href=\"https://arstechnica.com/gaming/2020/10/review-dont-call-it-a-comeback-the-boys-returns-better-than-ever-in-s2/\"><em>The Boys</em></a> pumped up on a steroids.</p>\n<p><strong>(Some spoilers below but no major reveals.)</strong></p>\n<p>As <a href=\"https://arstechnica.com/gaming/2021/03/harley-quinn-has-new-bad-guy-allies-in-the-suicide-squad-red-band-trailer/\">I've written previously</a>, <em>The Suicide Squad</em> is not a direct sequel to the 2016 film directed by David Ayers. Gunn wanted to take the franchise in a new direction and introduce new characters. But Joel Kinnaman and Viola Davis do reprise their 2016 roles as Col. Rick Flag, the squad's understandably jaded field leader, and Intelligence Officer Amanda Waller, respectively. Steve Agee plays John Economos, prison warden and aide to Waller.  As with the 2016 film, the titular squad is composed entirely of criminal supervillains, led by Flag, under the authority of Waller. Waller plants nanite bombs in their necks to keep them reasonably under control, promising to shorten their sentences if their missions are successfully fulfilled.</p></div><p><a href=\"https://arstechnica.com/?p=1784974#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1784974&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0baf286d971561ad090ce7fae61f6416d9ec95fa9e7f0e98aa1d51e79539e7db","category":"Tech"}