{"title":"The impact of ultrasonic‐assisted extraction on the in vitro hypoglycemic activity of peach gum polysaccharide in relation to its conformational conversion","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13527?af=R","date":1712746086000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Peach gum (PG) is an exudate of the peach tree (<i>Prunus persica</i> of the Rosaceae family), which consists primarily of polysaccharides with a large molecular weight and branching structure. Consequently, PG can only swell in water and not dissolve directly, which severely limits its application. Current conventional extraction methods for PG polysaccharide (PGPS) are time-consuming and inefficient. This study investigated the impact of ultrasonic-assisted extraction (UAE) on PGPS structure and conformation, as well as their relationship to hypoglycemic activity <i>in vitro</i>.</p>\n<h2>Results</h2>\n<p>Compared to conventional aqueous extraction, UAE enhanced PGPS yield from 28.07%–32.83% to 80.37%–84.90% (<i>w/w</i>) in 2 h. It drastically decreased the molecular size and conformational parameters of PGPS, including <i>M</i>\n<sub>w</sub>, <i>M</i>\n<sub>n</sub>, <i>R</i>\n<sub>\n   <i>g</i>\n</sub>, <i>R</i>\n<sub>\n   <i>h</i>\n</sub> and [<i>η</i>] values. PGPS conformation converted from extended molecules to flexible random coil chains or compact spheres with no obvious primary structure alteration. Furthermore, UAE altered the flow behaviour of PGPS solution from non-Newtonian fluid to Newtonian fluid. As a result, PGPS treated with ultrasonic displayed weaker inhibitory activity than those untreated, mostly because UAE weakens the binding strength of PGPS to α-glucosidase. However, this negative effect of UAE on PGPS activity was compensated by the increased solubility of polysaccharide. This enabled PGPS to achieve a wider range of doses.</p>\n<h2>Conclusion</h2>\n<p>UAE is capable of degrading PGPS efficiently while preserving its primary structure, resulting in a Newtonian fluid solution. The degraded PGPS conformation display a consistent correlation with their inhibitory effect on α-glucosidase activity.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Jiaxin Chen, \nMo Zhou, \nGuang Xin, \nJinfeng Bi","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"0bb3cfc6007641d4db159c04c39c9e271a7dd5f20f3004128cdd3a9238c833d6","category":"Environment"}