{"title":"New – Amazon Lightsail for Research with All-in-One Research Environments","link":"https://aws.amazon.com/blogs/aws/new-amazon-lightsail-for-research-with-all-in-one-research-environments/","date":1677630612000,"content":"<p>Today we are announcing the general availability of <a href=\"https://aws.amazon.com/lightsail/research/\"><strong>Amazon Lightsail for Research</strong></a>, a new offering that makes it easy for researchers and students to create and manage a high-performance CPU or a GPU research computer in just a few clicks on the cloud. You can use your preferred integrated development environments (IDEs) like preinstalled <a href=\"https://docs.jupyter.org/en/latest/\">Jupyter</a>, <a href=\"https://posit.co/products/open-source/rstudio/\">RStudio</a>, <a href=\"https://www.scilab.org/\">Scilab</a>, <a href=\"https://vscodium.com/\">VSCodium</a>, or native <a href=\"https://releases.ubuntu.com/focal/\">Ubuntu</a> operating system on your research computer.</p> \n<p>You no longer need to use your own research laptop or shared school computers for analyzing larger datasets or running complex simulations. You can create your own research environments and directly access the application running on the research computer remotely via a web browser. Also, you can easily upload data to and download from your research computer via a simple web interface.</p> \n<p>You pay only for the duration the computers are in use and can delete them at any time. You can also use budgeting controls that can automatically stop your computer when it’s not in use. Lightsail for Research also includes all-inclusive prices of compute, storage, and data transfer, so you know exactly how much you will pay for the duration you use the research computer.</p> \n<p><strong><u>Get Started with Amazon Lightsail for Research</u></strong><br /> To get started, navigate to the <a href=\"http://lfr.console.aws.amazon.com/\">Lightsail for Research console</a>, and choose <strong>Virtual computers</strong> in the left menu. You can see my research computers naming “<code>channy-jupyter</code>” or “<code>channy-rstudio</code>” already created.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/16/2023-lightsail-for-research-1.jpg\" alt /></p> \n<p>Choose <strong>Create virtual computer</strong> to create a new research computer, and select which software you’d like preinstalled on your computer and what type of research computer you’d like to create.</p> \n<p>In the first step, choose the application you want installed on your computer and the AWS Region to be located in. We support Jupyter, RStudio, Scilab, and VSCodium. You can install additional packages and extensions through the interface of these IDE applications.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/27/2023-lightsail-for-research-2-new-1.jpg\" alt width=\"2766\" height=\"1957\" /></p> \n<p>Next, choose the desired virtual hardware type, including a fixed amount of compute (vCPUs or GPUs), memory (RAM), SSD-based storage volume (disk) space, and a monthly data transfer allowance. Bundles are charged on an hourly and on-demand basis.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/27/2023-lightsail-for-research-3-1.jpg\" alt width=\"2808\" height=\"1981\" /></p> \n<p>Standard types are compute-optimized and ideal for compute-bound applications that benefit from high-performance processors.</p> \n<table> \n <tbody> \n  <tr> \n   <td><strong>Name</strong></td> \n   <td><strong>vCPUs</strong></td> \n   <td><strong>Memory</strong></td> \n   <td><strong>Storage</strong></td> \n   <td><strong>Monthly data<br /> transfer allowance*</strong></td> \n  </tr> \n  <tr> \n   <td>Standard XL</td> \n   <td>4</td> \n   <td>8 GB</td> \n   <td>50 GB</td> \n   <td>0.5TB</td> \n  </tr> \n  <tr> \n   <td>Standard 2XL</td> \n   <td>8</td> \n   <td>16 GB</td> \n   <td>50 GB</td> \n   <td>0.5TB</td> \n  </tr> \n  <tr> \n   <td>Standard 4XL</td> \n   <td>16</td> \n   <td>32 GB</td> \n   <td>50 GB</td> \n   <td>0.5TB</td> \n  </tr> \n </tbody> \n</table> \n<p>GPU types provide a high-performance platform for general-purpose GPU computing. You can use these bundles to accelerate scientific, engineering, and rendering applications and workloads.</p> \n<table> \n <tbody> \n  <tr> \n   <td><strong>Name</strong></td> \n   <td><strong>GPU</strong></td> \n   <td><strong>vCPUs</strong></td> \n   <td><strong>Memory</strong></td> \n   <td><strong>Storage</strong></td> \n   <td><strong>Monthly data<br /> </strong><strong>transfer allowance*</strong></td> \n  </tr> \n  <tr> \n   <td>GPU XL</td> \n   <td>1</td> \n   <td>4</td> \n   <td>16 GB</td> \n   <td>50 GB</td> \n   <td>1 TB</td> \n  </tr> \n  <tr> \n   <td>GPU 2XL</td> \n   <td>1</td> \n   <td>8</td> \n   <td>32 GB</td> \n   <td>50 GB</td> \n   <td>1 TB</td> \n  </tr> \n  <tr> \n   <td>GPU 4XL</td> \n   <td>1</td> \n   <td>16</td> \n   <td>64 GB</td> \n   <td>50 GB</td> \n   <td>1 TB</td> \n  </tr> \n </tbody> \n</table> \n<p><em>* AWS created the Global Data Egress Waiver (GDEW) program to help eligible researchers and academic institutions use AWS services by waiving data egress fees. To learn more, see the <a href=\"https://aws.amazon.com/blogs/publicsector/data-egress-waiver-available-for-eligible-researchers-and-institutions/\">blog post</a>.</em></p> \n<p>After making your selections, name your computer and choose <strong>Create virtual computer</strong> to create your research computer. Once your computer is created and running, choose the <strong>Launch application</strong> button to open a new window that will display the preinstalled application you selected.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/16/2023-lightsail-for-research-4.jpg\" alt /></p> \n<p><strong><u>Lightsail for Research Features</u></strong><br /> As with existing Lightsail instances, you can create additional block-level storage volumes (disks) that you can attach to a running Lightsail for Research virtual computer. You can use a disk as a primary storage device for data that requires frequent and granular updates. To create your own storage, choose <strong>Storage</strong> and <strong>Create disk</strong>.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/16/2023-lightsail-for-research-5.jpg\" alt /></p> \n<p>You can also create <strong>Snapshots</strong>, a point-in-time copy of your data. You can create a snapshot of your Lightsail for Research virtual computers and use it as baselines to create new computers or for data backup. A snapshot contains all of the data that is needed to restore your computer from the moment when the snapshot was taken.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/16/2023-lightsail-for-research-6.jpg\" alt /></p> \n<p>When you restore a computer by creating it from a snapshot, you can easily create a new one or upgrade your computer to a larger size using a snapshot backup. Create snapshots frequently to protect your data from corrupt applications or user errors.</p> \n<p>You can use <strong>Cost control</strong> rules that you define to help manage the usage and cost of your Lightsail for Research virtual computers. You can create rules that stop running computers when average CPU utilization over a selected time period falls below a prescribed level.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/16/2023-lightsail-for-research-7.jpg\" alt /></p> \n<p>For example, you can configure a rule that automatically stops a specific computer when its CPU utilization is equal to or less than 1 percent for a 30-minute period. Lightsail for Research will then automatically stop the computer so that you don’t incur charges for running computers.</p> \n<p>In the <strong>Usage</strong> menu, you can view the cost estimate and usage hours for your resources during a specified time period.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/02/16/2023-lightsail-for-research-8.jpg\" alt /></p> \n<p><strong><u>Now Available</u></strong><br /> <a href=\"https://aws.amazon.com/lightsail/research/\">Amazon Lightsail for Research</a> is now available in the US East (Ohio), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Paris), and Europe (Stockholm) Regions.</p> \n<p>Now you can start using it today. To learn more, see the <a href=\"https://docs.aws.amazon.com/lightsail-for-research/latest/ug/what-is-lfr.html\">Amazon Lightsail for Research User Guide</a>, and please send feedback to <a href=\"https://repost.aws/tags/TAG40l8mpESXKixja2uhSvgQ/amazon-lightsail\">AWS re:Post for Amazon Lightsail</a> or through your usual AWS support contacts.</p> \n<p>– <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"0bb385abd4ffd013cf5da7fc108e491097ac024430f154b0c63431","category":"Tech"}