{"title":"HashiCorp Teams with AWS on New Control Tower Account Factory for Terraform","link":"https://www.hashicorp.com/blog/hashicorp-teams-with-aws-on-new-control-tower-account-factory-for-terraform","date":1638229500000,"content":"<p>HashiCorp Terraform lets practitioners provision Amazon Web Services (AWS) infrastructure in minutes. But many enterprises also want to maintain multiple AWS accounts in order to create a strong isolation barrier between workloads, each with their own security, access controls, and auditability. The AWS Control Tower team and HashiCorp have been working on a new way to accommodate these needs and today, we are pleased to support AWS as it announces the launch of <a href=\"https://aws.amazon.com/about-aws/whats-new/2021/11/aws-control-tower-terraform/\">AWS Control Tower Account Factory for HashiCorp Terraform (AFT</a>).</p>\n<h2><a href=\"#what-is-aws-control-tower-aft\">»</a><a></a>What is AWS Control Tower AFT?</h2>\n<p><a href=\"https://aws.amazon.com/controltower\">AWS Control Tower</a> provides an easy way to set up and govern secure, multi-account AWS environments, often referred to as landing zones. AWS Control Tower AFT is a Terraform pipeline to provision and customize your AWS Control Tower-governed accounts. AFT adds the Terraform provision and management option to AWS Control Tower’s multi-account provisioning, meaning that infrastructure engineers can accelerate velocity by using the familiar tool they already know.</p>\n<p>This solution is the evolution of <a href=\"https://www.hashicorp.com/resources/aws-terraform-landing-zone-tlz-accelerator\">AWS Terraform Landing Zones (TLZs)</a> and couples the governance of an AWS-managed service with a Terraform-based account provisioning pipeline.</p>\n<h2><a href=\"#what-does-aws-control-tower-aft-do\">»</a><a></a>What Does AWS Control Tower AFT Do?</h2>\n<p>AWS Control Tower AFT allows for centralized AWS account vending with security, compliance controls, and consistent operating procedures baked in from the point of account creation. Account Factory for Terraform includes best practices such as centralized audit and logging, programmatic security configuration, and account isolation with controls for shared services.</p>\n<p>AWS and HashiCorp customers can customize AWS Control Tower AFT to meet their organization’s standard procedures and guidelines. AFT customization can include additional guardrails, network configurations, roles and permissions, and more. You can conﬁgure the pipeline to use your own custom Terraform modules, or choose from <a href=\"https://registry.terraform.io/namespaces/aws-ia\">pre-published Terraform modules</a> for common products and conﬁgurations. Using public or private Terraform modules, customers can target the customization to specific accounts or globally across their organizations.</p>\n<p>AFT includes feature options owned and supported by AWS and built to AWS’ prescriptive guidance, such as AWS CloudTrail data events for Amazon S3, automated enterprise support enrollment, and deletion of default VPCs in all regions.</p>\n<p>AWS Control Tower AFT works with Terraform open source, Terraform Cloud, and Terraform Enterprise. Organizations can use vended accounts from AWS Control Tower combined with governance, policy as code, and self-service infrastructure capabilities within Terraform Cloud or Terraform Enterprise.</p>\n<p>The compliance and management functionality found in Terraform Cloud and Terraform Enterprise is complementary to AWS Control Tower’s governance applied via service control policies and AWS Config. HashiCorp Terraform Cloud and Enterprise empower self-service infrastructure by managing state, variables, workspaces, and approved Terraform modules. <a href=\"https://www.hashicorp.com/sentinel\">HashiCorp Sentinel</a>’s embeddable policy as code framework provides the additional capability to create and enforce policy during each Terraform workflow.</p>\n<p>Control Tower Account Factory for Terraform makes it easier for customers to efficiently provision vetted, secured, and standardized infrastructure and achieve consistent governance and compliance requirements across all AWS accounts.</p>\n<h2><a href=\"#getting-started-with-aws-control-tower-aft\">»</a><a></a>Getting Started with AWS Control Tower AFT</h2>\n<p>You can get started with AWS Control Tower AFT today by following the HashiCorp Learn tutorial: <a href=\"https://learn.hashicorp.com/tutorials/terraform/aws-control-tower-aft\">Provision AWS Accounts Using Account Factory for Terraform</a>. In addition, the <a href=\"https://docs.aws.amazon.com/controltower/latest/userguide/taf-account-provisioning.html\">AWS Control Tower User Guide</a> now includes AFT. For more information, read the <a href=\"https://aws.amazon.com/blogs/aws/new-aws-control-tower-account-factory-for-terraform/\">AWS  blog</a>.</p>\n<p>If your enterprise is new to Terraform and would like to take advantage of AWS Control Tower AFT as well as the variety of enterprise features in HashiCorp Terraform Cloud and Terraform Enterprise, please <a href=\"https://www.hashicorp.com/contact-sales/terraform\">contact our sales team</a>.</p>\n<p>We would love to hear your feedback about AWS Control Tower Account Factory for HashiCorp Terraform; please share your comments on the <a href=\"https://discuss.hashicorp.com/c/terraform-providers/tf-aws/33\">HashiCorp Discuss Forum</a>. For issues and feature requests, please visit the <a href=\"https://github.com/aws-ia/terraform-aws-control_tower_account_factory\">AFT GitHub repository</a>.</p>","author":"K.G. Nesbit","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"0bbbd82d34d3a41d5fd26f4b87f36477eaf55b7d7f722abf84d799cbb97e754b","category":"Tech"}