{"title":"Can Demi Vollering do the Ardennes double (or triple)?","link":"https://www.cyclingtips.com/2023/04/can-demi-vollering-do-the-ardennes-double-or-triple/","date":1681825984000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1482598559-scaled.jpg?width=1200\" alt=\"Can Demi Vollering do the Ardennes double (or triple)?\" /></figure><p><span>If anyone knows how to win Flèche Wallonne it’s seven-time back-to-back winner Anna van der Breggen. From her first win in 2016 until her retirement year in 2021, Van der Breggen remained the reigning Queen of the Mur. </span></p>\n<p><span>Now in her position as directeur sportif at Team SD Worx, Van der Breggen is hoping for another Flèche Wallonne victory with the team’s star rider, Demi Vollering. The 26-year-old, who became Van der Breggen’s protégé while they were teammates before stepping into the leadership role after her retirement, has a strong track record at the Ardennes. </span></p>\n<p><span>As early as 2019, while racing for Parkhotel Valkenburg, Vollering burst onto the scene with a third at Liege-Bastogne-Liege (and also memorably burst into tears in her post-race interview), before going on to win that race in 2021. After struggling to fend off a dominant Marta Cavalli and a surging Annemiek van Vleuten throughout the Ardennes in 2022 Vollering took her first Amstel Gold Race victory on Sunday. </span></p>\n<p><span>With her closest rivals from last year looking far from their best and Vollering’s SD Worx team having been clinically ticking off the wins all spring, the 26-year-old is in her best position yet to take the win at Fleche Wallonne and – whisper it –  the first Ardennes hat-trick since, yes, Van der Breggen in 2017. </span></p>\n<p><span>Team SD Worx are heading into the race without Tour of Flanders winner Lotte Kopecky, but rejoining the squad for the Ardennes is their time trial powerhouse and Gent-Wevelgem winner, Marlen Reusser. Vollering also has talented young climbers Niamh Fisher Black and Mischa Bredewold for support as well as the experienced Elena Cecchini. It may not be their strongest ever lineup but in a race that is decided by one final, leg-breaking climb the onus is mostly on Vollering, as Van der Breggen well knows. </span></p>\n<p><span>“I find it hard to say whether Demi can win the Flèche. I think there’s a possibility. It’s a combination of feeling your body very well and pacing the final climb perfectly so you don’t collapse. After all, you not only have to judge how fast you should start the climb, but also whether you will go with them when someone attacks,” she said via a team press release. </span></p>\n<p><span>“In fact, it is the ultimate suffer festival. You are completely acidified and you know you have to attack to win. That’s what makes it so tough to win Flèche Wallonne.”</span></p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1277597616-1340x928.jpg?width=730\" alt width=\"1340\" height=\"928\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1277597616.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1277597616.jpg?width=190 190w\" /><figcaption>Van der Breggen won Flèche a record seven times in a row. (Photo: Getty Images)</figcaption></figure></figure>\n<p><span>Van der Breggen can give Vollering her advice, she says, but once the race hits the final ascent of the Mur, there’s nothing more she can do. </span></p>\n<p><span>“When you really believe someone can win and you explain how to do it, it makes a difference,” she said. “Once the girls are well positioned and they start the Mur de Huy, there’s nothing more I can do for them. I struggled with that in my first year as a sport director. As a rider it starts then, but from the car you can only encourage then. The rider who is very strong conditionally, makes the right decisions tactically and schedules the climb well physically will triumph on the Mur de Huy.”</span></p>\n<p><span>There’s little doubt surrounding Vollering’s current form, she looked far more composed than her rivals on the final ascent of the Cauberg before launching a convincing attack to take her solo victory. If Vollering gets her positioning into the bottom of the Mur right the race is hers to lose. It is a pressure that Van der Breggen is familiar with, but one that she never allowed to get the better of her. </span></p>\n<p><span>“I never had a love-hate relationship with it. Also because I never lost there. This race was written on my body. After all, it is more than just the Mur de Huy,” she said. “The succession of climbs makes it tough. Recuperating in between is impossible. I got better and better at dealing with the pressure. Experience taught me that I could win even when the feeling in the race was not super.”</span></p>\n<p><span>Still, while Vollering will be hard to beat on Wednesday it is not an impossible task. The strongest challenge is likely to come from Trek-Segafredo, who have two very strong climbers in Gaia Realini and Amanda Spratt as well as the evergreen all-rounder that is Elisa Longo Borghini. The team also bring Trofeo Alfredo Binda winner and Amstel Gold third place Shirin van Anrooij – who has made these races a target –  and Lizzie Deignan who is making an early return from maternity leave after the birth of her second child. </span></p>\n<p><span>While Deignan’s form is unknown – although she is not a rider to return to the peloton unless she is in good shape – her presence in the team adds experience and fire power that will be invaluable to the likes of Van Anrooij and gives the team more weight in the balance against SD Worx. </span></p>\n<p><span>Should a rider from Trek-Segafredo take the win, it would be the team’s first victory at Flèche Wallonne and only their second Ardennes win after Deignan took Liege-Bastogne-Liege in 2020. </span></p>\n<p><span>Annemiek van Vleuten has spoiled the party for Vollering on multiple occasions but in her current form she is no match for the younger rider. The world champion has seemed far from her dominant best so far this season, raising the question of whether it is her waning form or a stronger peloton that is to blame, while Vollering and her teammates have run amok. </span></p>\n<p><span>Van Vleuten’s teammates, Liane Lippert and Floortje Mackaij are in line to take up the mantle, with German champion Lippert in particular looking strong. But neither seem strong enough to pose a serious challenge to Vollering. Ditto Canyon//SRAM’s line-up which, while they had a strong showing at Amstel with Kasia Niewiadoma, Soraya Paladin and Elise Chabbey, still haven’t been able to put it together to get the better of SD Worx. </span></p>\n<p><span>Thanks to the continuously rising level within the women’s peloton, Vollering faces more rivals than Van der Breggen ever did. Despite that, however, the arrows are pointing towards another SD Worx win but, in the words of Shirin van Anroooij: “with Amstel and Fleche sometimes weird things can happen.”</span></p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1392511380-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1392511380-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1392511380-scaled.jpg?width=190 190w\" /><figcaption>Who will follow in Marta Cavalli’s tracks in 2023? (Photo: Getty Images)</figcaption></figure></figure>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0bc09e6908415d6fcc3ad90bb6b6aabb8bf8426e1637dce89b0543b3e80f894e","category":"Cycling"}