{"title":"Back to his best: Has Primož Roglič timed things to perfection at this Giro d’Italia?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/back-to-his-best-has-primoz-roglic-timed-things-to-perfection-at-this-giro-d-italia","date":1685036861000,"content":"\n      <p><span>It’s become hard to believe that not long ago, the rhetoric surrounding this year’s <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> was about how boring the race was turning out to be. Now, as we head into the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-stage-19-preview-the-toughest-day\">final mountain road stage</a>, the general classification is so finely poised you could almost cut the tension with a knife as the top three watch each other like hawks up the mountains. There is Geraint Thomas who, at 37 years old, is surprising everyone with perhaps his best legs ever. There is João Almeida who is playing with the biggest opportunity of his career so far. Then, there is Primož Roglič, who after some tough days over the last two weeks, looks to be slowly, calmly and methodically sharpening his weapons for tomorrow’s stage. </span></p>\n<div></div>\n<p><span>As things stand, stage 19 will be crucial to the outcome of this race and Roglič seems acutely aware of this – it is so important that it could well decide who leaves Italy with that shiny gold trophy glistening in their suitcase. For fans, it will be epic. For riders, it will be brutal.</span></p>\n<p><span>The difficulty of tomorrow’s stage is inevitable for all who roll out from the start line in Tarvisio, what is unknown, though, is which rider will find themselves able to put the pain on others, rather than being tested to the limits himself. Who this rider is has varied over the last two stages of the Giro. On stage 17, it was Almeida who launched attacks and put Roglič in difficulty and a day later the roles were reversed, as Roglič and his Jumbo-Visma teammates put time into the UAE Team Emirates rider. On both occasions, pink jersey wearer Thomas has managed to hang on to his rivals through gritted teeth, impressively not losing time on either of the two days.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography--Giro-d_Italia-2023---Stage-15-08091_1024x1024.jpg?v=1685036760\" alt />But if Thomas is proving his ability to ride consistently and reliably through this Giro d’Italia, Roglič is playing things very differently. Thomas is yet to have a bad day over the last few weeks, while Roglič has shown weakness on multiple occasions, so much so that pundits were almost counting him out of contention for victory this morning. But Roglič has surely taught us now that he possesses an incredible ability to fight in the face of adversity. Think of the time he crashed twice during the final stage of Paris-Nice in 2021 and battled valiantly to the finish, covered in raw road rash down his left side. He’s not a rider who gives up easily.</span></p>\n<p><span>The 33-year-old proved that today in stage 18 of the Giro as he attacked Thomas and Almeida bravely on the final climb of the day. Perfectly set-up by his teammate Sep Kuss, Roglič put the pressure on his rivals and showed he is still very much in the fight to win this bike race. It was an attack that surprised many, as Roglič even seemed to be slipping back earlier in the day with over 120km of the stage still remaining. Was this a clever decoy by Jumbo-Visma to trick Ineos into burning their matches? To lure his rivals into a false sense of security?</span></p>\n<p><span>While Thomas and Almeida have both made headlines in this race so far, be it for attacking performances, strong teammates, bad crashes or unexpectedly good rides in the time trial stages, Roglič has remained eerily quiet up until now, perhaps biding his time for this brutally challenging final week. Today was really the first show of Roglič’s hand in this race, and he managed to move himself up one position in the general classification as a result, now lying in second place. If he does the same thing tomorrow, could he go one better and find himself in pink heading into the final mountain time trial before Rome?</span></p>\n<p><span></span><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography--Giro-d_Italia-2023---Stage-14-06761_1024x1024.jpg?v=1685036779\" alt />Speaking after the stage, Jumbo-Visma sports director Marc Reef said, in no uncertain terms, that the team would continue their attacking style in tomorrow’s stage. “We will keep trying to make moves on those steep parts of climbs,” he explained. “Until now Thomas has shown he is also strong and in a perfect condition. But only one moment of weakness is necessary in order to crack him, that's what we will keep fighting for.”</span></p>\n<p><span>This is what Roglič needs to do in order to give himself a chance at victory in the Giro. He’s crumbled under the pressure in final time trial stages in Grand Tours before – who can forget that painful watch during stage 20 of the 2020 Tour de France as the yellow jersey slipped out of his grasp atop La Planche des Belles Filles – so he needs to gain more time on Thomas before the Giro's time trial stage to give himself a buffer if he has a subpar day. Tomorrow’s tough mountain stage is the final chance to do that.</span></p>\n<p><span>There’s a famous saying in bike racing: ‘sometimes you’re the hammer, sometimes you’re the nail.’ Roglič was the nail yesterday and Almeida the hammer, today it was the other way round. Thomas hasn’t been either so far, but that’s because he doesn’t need to be, he has an upper hand with a 29 second buffer on Roglič, able to follow the wheels rather than make the moves himself. Tomorrow, Roglič and his team have stated they will, like they did today, try to be the hammers, but just how far down can they grind the rest? The road will decide eventually and, as fans, we could have an epic showdown on the cards in the final mountainous road stage of this Giro d’Italia.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0bc38859aab87d9b8c907209da56f677ec82dc18f999e0f7b591d77b430ec7a7","category":"Cycling"}