{"title":"Vinokourov’s return to Astana was ‘forced’ by Kazakhstan’s Prime Minister","link":"https://cyclingtips.com/2021/09/vinokourovs-return-to-astana-was-forced-by-kazakhstans-prime-minister/","date":1631859337000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Kramon_Vuelta2019_st18_12599-650x433.jpg\" /></div><h2>Vinokourov's return to Astana was 'forced' by Kazakhstan’s Prime Minister</h2><p>\n</p><p>The last couple of months have been a particularly turbulent time in Team Astana’s long, turbulent lifespan. On the eve of the Tour de France, team founder and principal <a href=\"http://The last couple of months have been a particularly turbulent time in Team Astana’s long, turbulent lifespan. On the eve of the Tour de France, team founder and principal Alexandre Vinokourov was ousted from the squad LINK https://cyclingtips.com/2021/06/vinokourov-ousted-from-leadership-at-astana/\">Alexander Vinokourov was ousted from the squad</a>. About a month later, the team’s co-title sponsor – Canadian peat-packing company Premier Tech – <a href=\"https://cyclingtips.com/2021/08/premier-tech-will-no-longer-be-a-co-title-sponsor-for-the-astana-team-after-2021/\">pulled out of its sponsorship</a>, citing a difference in “vision”. A few days after that, <a href=\"https://cyclingtips.com/2021/08/vinokourovs-return-to-astana-is-the-reason-for-premier-techs-departure/\">the real reason was revealed</a>: Vino was back.   </p>\n\n\n\n<p>Now, in a revealing interview with Quebecois publication <a href=\"https://www.lapresse.ca/sports/cyclisme/2021-09-13/jean-belanger-patron-de-premier-tech/le-kazakhstan-a-choisi-vinokourov.php\">La Presse</a>, Premier Tech’s president and CEO <strong>Jean Bélanger</strong> has spilled the beans. And what spicy beans they are. </p>\n\n\n\n<h2>The team structure</h2>\n\n\n\n<p>Astana–Premier Tech – as the team is currently known – took on its current guise at the start of this season, splitting ownership 50/50 between the title sponsors. </p>\n\n\n\n<p>The <strong>‘Astana</strong>’ half is owned by Samruk-Kazyna – a collective of state-owned companies in Kazakhstan, effectively making the Kazakh government the team’s naming rights sponsor. Astana used to be the name of Kazakhstan’s capital city, before it was rebranded as Nur-Sultan in honour of authoritarian leader, Nursultan Nazarbayev. Nursultan – the man, not the city – is no longer president, but is the leader of the ruling party and wields enormous power behind the scenes.</p>\n\n\n\n<p>The ‘<strong>Premier Tech</strong>’ half is owned by Premier Tech, a Canadian company that does, oh, <a href=\"https://www.premiertech.com/what-we-do\">loads of things</a>. They hold a special place in my heart because of their pioneering use of the corporate catch-phrase ‘<a href=\"http://The ‘Premier Tech’ half is owned by Premier Tech, a Canadian company that does, oh, loads of things. They hold a special place in my heart because of their pioneering use of corporate catch-phrase ‘glocal’ LINK https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/06/Screen-Shot-2021-06-22-at-10.49.55-am-1340x575.jpg .\">glocal</a>‘ .   </p>\n\n\n\n<p><strong>Alexandre Vinokourov</strong> – who has enjoyed a long career in cycling as an athlete, team manager and occasional arch-villain – is a national hero in Kazakhstan, as well as an <a href=\"https://www.reddit.com/r/peloton/comments/d7rlvl/til_aleksandr_vinokurov_is_a_colonel_in_the/\">honorary army colonel</a>. He has had his ups and downs – Olympic silver in Sydney, Olympic gold in London, a blood-doping positive at the 2007 Tour de France that forced the withdrawal of the entire Astana squad, a race-fixing allegation at Liège–Bastogne–Liège, and as of a few months ago, getting booted from the team he founded. </p>\n\n\n\n<p>You know, swings and roundabouts. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/CORVOS_00019651-142-1340x892.jpg\" /><figcaption>The London 2012 road race podium – Colombia’s biggest vibe Rigoberto Uran (silver), Alexander Vinokourov (gold), and Alexander ‘The Stavanger Stallion’ Kristoff (bronze).</figcaption></figure>\n\n\n\n<h2>Who’s pulling the strings? </h2>\n\n\n\n<p>Vinokourov’s ‘national hero’ status apparently proved too compelling a drawcard for the Kazakh half of Team Astana’s leadership to overlook, with orders given from the upper echelons of the Kazakh government that engineered Vinokourov’s triumphant return. </p>\n\n\n\n<p>“The prime minister [Askar Mamin] forced him to come back,” Bélanger said, confirming that the fracture between Premier Tech and Astana is all due to Vinokourov’s presence at the team. </p>\n\n\n\n<p>It is, Bélanger says, based on “the return/non-return of Vino for 2022 that everything has been decided.”</p>\n\n\n\n<p>“It’s unfortunate, Vino is a friend, although we may have different visions of how to operate the team,” Bélanger told La Presse. “[The dispute] is really around Vinokourov’s presence and the philosophy he wanted in terms of strategy and tactics in the squad. Kazakhstan had to choose: do we go with the Vinokourov approach or do we go with the international, professional, transparent approach?”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/CORVOS_00028812-004-1340x956.jpg\" /><figcaption>Another calling card of the Vinokourov approach – selfie-sticks. </figcaption></figure>\n\n\n\n<p>That’s not the only startlingly candid comment made by Bélanger, who explained that Premier Tech was faced with “a battle of life, of death” with the Kazakh faction “which would have taken two or three years to settle. We had no appetite for that.</p>\n\n\n\n<p>“Our decision was: we are not going to destroy the team. There are 85 people in the team. Riders, management, staff. We can’t do that. You have to put yourself above the fray. You can’t fall in the mud.”</p>\n\n\n\n<p>Bélanger explains that Premier Tech’s vision was ideologically opposed to Vinokourov’s. </p>\n\n\n\n<p>The Canadian contingent wanted to seek more sponsors to allow it to compete with the top-funded teams, while bringing more “transparency” and “professional management” to the squad. </p>\n\n\n\n<p>Vinokourov disagreed. For him, Bélanger claimed, it was a philosophy of “’We don’t have to have other sponsors. We’re okay with each other. We keep that a tight, select little club. The less we say, the better. No staff meeting, no explanations to the staff on the strategy for the year, where we want to put the funds, what do we want to promote.’ Really manage the cards very close to the chest. It’s okay, it’s two ways of managing, but we wanted to move towards change.”</p>\n\n\n\n<p>“I am able to live in “coopetition”, to cooperate and to be in competition,” Bélanger said (ah, so that’s where ‘glocal’ came from). “[Vinokourov] is a friend, but I don’t think he had a good idea.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/CORVOS_00005835-018-1340x893.jpg\" /><figcaption>You know when Vinokourov <em>did</em> have a good idea? Putting this look and pose together, that’s when. </figcaption></figure>\n\n\n\n<p>Bélanger refers to Vinokourov as a ‘friend’ at various points throughout the interview – but also directly juxtaposes “the Vinokourov approach” with the “professional, transparent approach”, which strikes me as a little loaded. </p>\n\n\n\n<p>But what do I know.</p>\n\n\n\n<h2>Some bonus context</h2>\n\n\n\n<p>Kazakhstan’s single-minded commitment to the resurrection of Vinokourov seems a strange hill to die on, but the country’s government is used to getting its way. </p>\n\n\n\n<p>Kazakhstan is the powerhouse economy of Central Asia, having ascended to wealth off the back of its vast oil and gas reserves. Like its similarly resource-rich neighbour to the south, <a href=\"http://www.cyclingtips.com/tag/turkmenistan\">Turkmenistan</a> – which has also dabbled in cycling – observance of human rights is poor. </p>\n\n\n\n<p>In 2020, Kazakhstan was ranked 128th out of 167 countries in the Economist Intelligence Unit’s Democracy Index, and 157th (out of 180) in the Press Freedom Index. That’s better than Turkmenistan on both fronts, but also, isn’t exactly something to brag about.  </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/1._Аскар_Мамин_с_президентом_Туркменистана_Гурбангулы_Бердымухаммедовым-1340x894.jpg\" /><figcaption>Two great lovers of cycling: Turkmenistan’s dentist dictator Gurbanguly Berdimuhamedov (left) meets with Kazakh prime minister – and Vinokourov benefactor – Askar Mamin (right). Also in frame: just so much tasteful furniture, a coathanger on a pedestal, a big picture of an Akhal Teke horse with a necklace, and a carpet that’ll make your eyes bleed. </figcaption></figure>\n\n\n\n<p>Having driven Premier Tech away from continued sponsorship of the team, Vinokourov will be able to pursue his vision – or, at least, the vision handed down to him by the authoritarian rulers of his homeland. </p>\n\n\n\n<p>Premier Tech, meanwhile, isn’t finished with cycling. Bélanger confirmed that his company has been in talks with other teams. </p>\n\n\n\n<p>CyclingNews reports that <a href=\"https://www.cyclingnews.com/news/jakob-fuglsang-set-to-leave-astana-for-team-bikeexchange/\">a leading candidate is BikeExchange</a> – who would also pick up Jakob Fuglsang from Astana. Links with Israel Start-Up Nation, Qhubeka-NextHash and Rally Cycling have also been rumoured. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/vinokourovs-return-to-astana-was-forced-by-kazakhstans-prime-minister/\">Read More</a>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0bd1ef139d8ebe763c4a93609266a087ce932e12be08a2c5751dcb8f8712f7a1","category":"Cycling"}