{"title":"Battery? What Battery? Oh, That Battery.","link":"https://www.wired.com/story/one-part-of-apple-vision-pro-apple-doesnt-want-you-to-see/","date":1705647780000,"content":"\n<p>Lauren Goode, writing at Wired:</p>\n\n<blockquote>\n  <p>Apple seems to not want you to notice the battery. The external \nbattery pack barely appears on the <a href=\"https://www.apple.com/apple-vision-pro/\">product page</a> on Apple’s \nwebsite, showing up only at the end of a photo gallery at the \nbottom of the page. And in demo sessions this week, Apple told \njournalists they were not allowed to snap photos or capture any \nvideo of the hardware, an unusual rule for a press briefing. \nInstead, the company had its own photographer take photos during \nthe Vision Pro demos. Every photo you’ve seen this week of \nreporters sitting on a couch while wearing the headset were shot \nby Apple. </p>\n\n<p>Notably, the battery pack doesn’t appear in any of them. One \nattendee chose to run the attached cable down the back of his \nsweatshirt. In <a href=\"https://www.threads.net/@reckless1280/post/C2K7mzQxXru?hl=en\">another shared image</a>, of The Verge’s Nilay \nPatel, the cable is clearly visible, but the photo is cropped to \navoid showing the battery pack. Chokkattu experienced this too; he \nset the Vision Pro’s battery pack on the couch cushion next to him \nduring his demo, but in the photo Apple shared with us, the \noffending pack is cropped out of the frame. </p>\n</blockquote>\n\n<p>To Apple’s credit, they weren’t at all cagey about this when they took <a href=\"https://mastodon.social/@gruber/111767493035111862\">my picture</a> <a href=\"https://www.threads.net/@gruber/post/C2LKPu5P0Wu\">using Vision Pro</a> Tuesday. They asked if I’d like photos taken by their photographer (who used an iPhone 15 Pro), I said sure, and they suggested draping the battery cable behind my back. It’s not just Apple being weird about the external battery; it’s that the external battery <em>is</em> weird. So of course their photography is going to de-emphasize it.</p>\n\n<p>Almost every first-generation product has things like this<sup>*</sup> — glaring deficiencies dictated by the limits of technology. The original Mac had far too little RAM (128 KB) and far too little storage (a single <a href=\"https://lowendmac.com/2016/floppy-disk-compatibility-and-incompatibility-in-the-mac-world/\">400 KB single-sided floppy disk drive</a>). The original iPhone only supported 2G EDGE cellular networking, which was <a href=\"https://en.wikipedia.org/wiki/Enhanced_Data_rates_for_GSM_Evolution#:~:text=EDGE%20can%20carry%20a%20bandwidth,much%20traffic%20as%20standard%20GPRS.\">unfathomably slow</a> and didn’t work at all while you were on a voice call. The original Apple Watch was very slow and couldn’t last a full day on a single charge. The external battery pack — which only supplies 2 to 2.5 hours of battery life — is that for this first-gen Vision Pro. Also, the Vision Pro headset itself — without any built-in battery — is still too big and too heavy.</p>\n\n<p><a href=\"https://paulgraham.com/really.html\">Paul Graham has a wonderful adage</a>:</p>\n\n<blockquote>\n  <p>Don’t worry what people will say. If your first version is so \nimpressive that trolls don’t make fun of it, you waited too long \nto launch. </p>\n</blockquote>\n\n<p><small>* The original iPod is the exception that proves the rule. That little thing was, as <a href=\"https://www.amazon.com/Perfect-Thing-Shuffles-Commerce-Coolness/dp/0743285239/?tag=df-amzn-20\">Steven Levy’s excellent book aptly declared</a>, perfect.</small></p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/19/vision-pro-battery\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"0bd7ca388c8f4188a47b091bceed71036d78c1e4d6b59c6c6e40d487cba9cb09","category":"Tech"}