{"title":"Characterising a diversity of coastal community fisheries in Kiribati and Vanuatu","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12849?af=R","date":1723397108000,"content":"<h2>Abstract</h2>\n<p>Understanding what diversity of small-scale fisheries translates to in practice, and what this means for management regimes seeking sustainability, continues to be a challenging undertaking. This is particularly so in the tropical Pacific Islands region, where small-scale coastal fisheries play a significant role in domestic food and livelihood systems. A renewed regional policy focus on supporting coastal fisheries, combined with momentum built from a decades-long ‘Pacific renaissance’ in community-based fisheries management approaches, has increased resourcing and support for coastal fishery data collection and knowledge production. In this context, there is growing demand to explicitly characterise diversity and complexity of community-based coastal fisheries to inform how national co-management programs can adequately support the many communities within national constituencies. This study presents findings from a community-based coastal fisheries monitoring programme implemented in ten communities across Kiribati and Vanuatu between 2019 and 2021. Findings illustrate the intra- and inter-country diversity of contextual drivers, fishing practices, and fisher participation. We discuss the implications of this enhanced understanding of community-based fisheries for applied co-management practice in these two countries. In doing so, we add to a growing knowledge base about fishing practices in Pacific Island coastal communities and elucidate avenues through which to incorporate this knowledge into adaptive co-management practice.</p>","author":"Brooke Campbell, \nDirk Steenbergen, \nOwen Li, \nAbel Sami, \nBeia Nikiari, \nAurélie Delisle, \nPita Neihapi, \nTarateiti Uriam, \nNeil Andrew","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"0bdf403ebe7fd51ca67591c857c77b7f1832e20e0852c84d085f63e507b37ad3","category":"Environment"}