{"title":"The Defense Response of Sanchezia nobilis against Biotic and Abiotic Stresses","link":"https://www.preprints.org/manuscript/202405.0760/v1","date":1715580663000,"content":"In order to understand the defense response of Sanchezia nobilis to biotic and abiotic stresses, this study investigated the phenomenon of S. nobilis under biotic of feeding by Achatina fulica, and measured the temporal changes of malondialdehyde content, catalase and peroxidase activities under biotic of feeding by Achatina fulica and abiotic stress of garden pruning conditions on S. nobilis. The results showed that: 1) S. nobilis was seriously damaged by A. fulica and the average hourly food intake of A. fulica is 0.22 ± 0.01 g. 2) Leaf cutting stimulation and snail feeding stress significantly affected the content of malondialdehyde, the activities of catalase and peroxidase in the leaves of S. nobilis. 3) Compared with the control group, the snail feeding and leaf cutting stimulated stress could induce the leaf of S. nobilis to synthesize more malondialdehyde under varying durations, and the activities of catalase and peroxidase were significantly enhanced in a short time, and the induction response of snail feeding biological stress was faster than that of leaf cutting stimulated abiotic stress. 4) After the defense enzyme was strengthened, the activities of catalase and peroxidase in the feeding stress group of snails showed a gradual downward trend, while the activities of catalase and peroxidase in the leaf cutting stimulation stress group showed a first upward and then downward trend, indicating that abiotic stress had more lasting effects on plants than biological stress. It can be seen that biotic stress and abiotic stress significantly affect the defense response of plants, and the defense-related substances malondialdehyde, catalase and peroxidase play an important role in plants' response to biotic and abiotic stress. This study has important production guidance significance for carrying out stress resistance breeding or cultivation management of garden plants.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0bea88bda1ec3ce8b83bbce9d4ab41bcb946f0fbc8d36915d29385e39a28f712","category":"Interdisciplinary"}