{"title":"Science confirms it: The best kimchi is made in traditional clay jars (onggi)","link":"https://arstechnica.com/?p=1931767","date":1681763042000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/kimchi1-800x549.jpg\" alt=\"Empty traditional jars (onggi, 옹기), used for storing kimchi, gochujang, doenjang, soy sauce and other pickled banchan (side dishes).\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/kimchi1.jpg\">Enlarge</a> <span>/</span> Empty traditional jars (onggi, 옹기), used for storing kimchi, gochujang, doenjang, soy sauce, and other pickled banchan (side dishes). (credit: <a href=\"https://creativecommons.org/licenses/by-sa/3.0/\">OlkhichaAppa/CC BY-SA 3.0</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The fermented spicy cabbage known as <a href=\"https://en.wikipedia.org/wiki/Kimchi\">kimchi</a> is a staple of Korean cuisine, traditionally made in earthenware vessels known as <a href=\"https://en.wikipedia.org/wiki/Onggi\">onggi</a>. These days most Korean households have kimchi refrigerators for that purpose, while on a commercial scale, kimchi is made via mass fermentation in glass, steel, or plastic containers. But is the kimchi made with these modern contraptions of equal quality to the traditional fermentation method? Many kimchi <em>aficionados</em> would argue that it is not, and now the pro-onggi faction has some science to back up that assertion.</p>\n<p>It turns out that the porosity of the onggi's walls help the most desired bacteria proliferate during the fermentation process, according to a <a href=\"https://royalsocietypublishing.org/doi/10.1098/rsif.2023.0034\">recent paper</a> published in the Journal of the Royal Society Interface. “We wanted to find the ‘secret sauce’ for how onggi make kimchi taste so good,” <a href=\"https://www.eurekalert.org/news-releases/985865\">said co-author David Hu</a> of Georgia Tech. “So we measured how the gases evolved while kimchi fermented inside the onggi—something no one had done before.”</p>\n<p>The handmade clay vessels known as onggi have long been used by Korean chefs to ferment foods, including <em>ganjang</em> (soy sauce), <em>gochujang</em> (red pepper paste), and <em>doenjang</em> (soy bean paste), as well as kimchi. The cabbage or daikon is sliced into small uniform pieces, which are coated with salt as a preservative. The salt draws out the water and inhibits the growth of many undesirable microorganisms. Then the excess water is dried and seasonings are added, often including sugar, which further serves to bind any remaining free water. Finally the brined cabbage is placed into an airtight canning jar, where it remains for the next 24 to 48 hours at room temperature. The jar is \"burped\" occasionally to release carbon dioxide formed during the fermentation process.</p></div><p><a href=\"https://arstechnica.com/?p=1931767#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1931767&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0bebd33fd0a04ef6eb1dc812cd570553873eb7c18a5f4ce5eb85a762222f3c6e","category":"Tech"}