{"title":"Stock Evaluation of the Euryhaline Cichlid, Etroplus suratensis (Bloch, 1790), from Significant Brackish and Freshwater Regions of India","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/7208918?af=R","date":1707465600000,"content":"<p>The present study evaluates stocks of <i>Etroplus suratensis</i> concerning length-weight relationships (LWRs), condition factor (<i>K</i>), and truss analysis from different habitats, <i>viz.</i>, West Bengal (freshwater hatchery), Gujarat (brackish water grow-out pond), and Odisha (Chilika lagoon) in India. All the stocks were collected using gill nets with various mesh sizes of 20–50 mm and cast nets with mesh size of 15 mm from February 2021 to September 2021. The total length (<i>L</i>), weight (<i>W</i>), and digital pictures were taken for LWRs and principle component analysis (PCA). The total length (<i>L</i>) and total weight (<i>W</i>) were measured to the nearest 0.1 cm and 0.01 gm, respectively, followed by regression analysis. The values of parameters “<i>b</i>” in the LWRs equation were estimated within the range of 2.50–3.82 and intercept “<i>a</i>” values (0.235–0.779) and “<i>K</i>” (1.07–3.37), respectively, for all different habitats and ecosystems with significant correlation values (<i>R</i>\n<sup>2</sup> ≥ 0.85). In truss morphometric analysis, principal component 1 (PC1) contributed the highest (93.1%) and principal component 2 (PC2) contributed 4.6% to the size and shape variation amongst the stocks from different habitats and ecosystems. The scatter plot analysis and canonical variate analysis (CVA) have shown that the Gujarat and West Bengal stocks are closely placed and separated from the Chilika-Odisha stock. Similar variations were also observed in the ANOSIM boxplot analysis, where Chilika-Odisha stock scored higher than the other two stocks. Since data available regarding LWRs and truss morphometry studies of <i>E. suratensis</i> from different habitats are limited, the present study will provide a clear insight into the differentiation of <i>E. suratensis</i> stocks from different habitats in India. The overall findings of the present study could be utilized for the conservation and sustainable management of <i>E. suratensis.</i></p>","author":"Ramjanul Haque, \nParamita Banerjee Sawant, \nJitendra Kumar Sundaray, \nRajesh Kumar, \nNarinder Kumar Chadha, \nGouranga Biswas, \nAvinash Rasal, \nPriyanka Nandanpawar, \nJackson Debbarma, \nJorge Paramo","siteTitle":"Wiley: Journal of Applied Ichthyology: Table of Contents","siteHash":"411fbab4e21e579add0b45892c8bae33151f2fc1dcfa886f71382f3516ee5117","entryHash":"0bee6540fae98073186e4562314d9e81ffcdb59893ffcbf107863d341a9640e5","category":"Environment"}