{"title":"Using integrative taxonomy to delimit species in the plant bug genus Pseudoloxops (Hemiptera: Miridae) in French Polynesia","link":"https://academic.oup.com/isd/article/doi/10.1093/isd/ixae012/7769620?rss=1","date":1727222400000,"content":"<span><div>Abstract</div>We use integrative taxonomy to elucidate species boundaries of the plant bug genus <span>Pseudoloxops</span> (<a href=\"#CIT0033\">Kirkaldy 1905</a>) in the Austral and Society archipelagos of French Polynesia. We operationalize the unified species concept by treating each individual as a potential species and then establish initial groupings (putative species) following statistically highly-supported reciprocal monophyly of individuals in a phylogenetic analysis of CO1, 16S, and 28S gene fragments. We then test our species hypotheses against additional lines of evidence from geometric morphometrics, genetic distance, discrete genitalic morphology, plant association, and geographic distribution partitions. Twenty species endemic to French Polynesia are recognized as follows: <span>Pseudoloxops aama</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops anaana</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops baileyi</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops chastaoliancai</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops harrisonfordi</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops kamalaharrisae</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops oboyskii</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops papepihaa</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops puarata</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops raimana</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops ravataputuarai</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops simberloffi</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops tairoto</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops temehanirahi</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops tiapai</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops toparaamahana</span> Balukjian &amp; Van Dam, sp. nov., <span>Pseudoloxops tupapaau</span> Balukjian &amp; Van Dam, sp. nov. New synonyms are proposed for <span>Pseudoloxops flavus</span> (Knight, 1937) [=<span>Pseudoloxops rubrocuneatus</span> (Knight, 1937)] and <span>Pseudoloxops adamsoni</span> (Knight, 1937) [= <span>Pseudoloxops nigribasicornis</span> (Knight, 1937) and = <span>Pseudoloxops tahiticus</span> (Knight, 1937)]. <span>Pseudoloxops rubroclavus</span> (Knight, 1937) is redescribed.</span>","author":"","siteTitle":"Insect Systematics and Diversity Current Issue","siteHash":"d4d59e2090793e303021830a9c164d689828dc5448b6052be7ec32e87f45cab0","entryHash":"0bf6602f377bbbfe9ac75dadf16b4bc7633485ce2c9bfc9e205bb350bf866e53","category":"Environment"}