{"title":"It’s all in the ink: Vinland Map is definitely a fake, new analysis finds","link":"https://arstechnica.com/?p=1793985","date":1631657511000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/vinlandTOP-800x530.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/vinlandTOP.jpg\">Enlarge</a> <span>/</span> The Vinland Map purports to be a 15th-century map with a pre-Columbian depiction of the North American Coast. A new analysis has confirmed that the map is, in fact, a modern-day forgery. (credit: <a href=\"https://news.yale.edu/2021/09/01/analysis-unlocks-secret-vinland-map-its-fake\">Yale University</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Scholars have questioned the authenticity of a purported 15th-century map housed in Yale University's Beinecke Rare Book &amp; Manuscript Library since it was first unveiled to the public in 1965. About the size of a placemat, the Vinland Map is an intriguing document because, in addition to Africa, Asia, and Europe, the map depicts a section of the North American coastline identified as \"Vinlandia Insula\" just southwest of Greenland. This suggested that Norsemen may have been the first Europeans to discover the Americas, well before the first voyage of Christopher Columbus.</p>\n<p>That would have major historical significance, if proven. But evidence that the map is a hoax has been steadily accumulating, particularly over the last few years. And the <a href=\"https://news.yale.edu/2021/09/01/analysis-unlocks-secret-vinland-map-its-fake\">latest scientific analysis</a> has definitively put an end to the controversy once and for all: the inks used to draw the map are of modern origin.</p>\n<p>\"The Vinland Map is a fake,\" <a href=\"https://news.yale.edu/2021/09/01/analysis-unlocks-secret-vinland-map-its-fake\">said Raymond Clemens</a>, curator of early books and manuscripts at the Beinecke. \"There is no reasonable doubt here. This new analysis should put the matter to rest.\"</p></div><p><a href=\"https://arstechnica.com/?p=1793985#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1793985&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0bf7d2d8845185c89164946eb640f8536e30ceeb62eb126e9efaa36253901827","category":"Tech"}