{"title":"The Impact of Soil and Water Conservation Measures on Base Flow Modification in the Northeastern Highland of Ethiopia","link":"https://www.preprints.org/manuscript/202403.0701/v2","date":1714036531000,"content":"Abstract: Severe land degradation is the principal environmental problem in Ethiopian highlands in the form of soil erosion, and soil fertility loss, which is caused by human intervention for food, shelter, and energy demands. Soil erosion contributes to the loss of precious soil and water resources which are the basis of agricultural production and provide numerous other eco-system services. The Ethiopian highlands are one of the most degraded regions in the world. To combat such problems, the government of Ethiopia has been implementing massive soil and water conservation works at the watershed scale since 2010 to conserve soil and water resources. Mount Yewel is one of the highlands in Northeastern Ethiopia where intensive soil and water conserva-tion has been implemented. Despite the massive investment in soil and water conservation measures, most of the rivers in the highlands of Ethiopia carry huge amounts of sediment with high flood risks in the wet season and streams are dried up in the dry period. Nonetheless, the impact of soil and water conservation measures on flood reduction and dry season flow en-hancement has not yet been quantified and evaluated. This research was then conducted on paired micro-catchments of Mount Yewel with the main objective of evaluating the impact of soil and water conservation measures on base flow modification. Stream flow and rainfall data were col-lected from 22/11/2020 to 8/11/2022 on paired micro-catchments of Mount Yewel at their outlets and centers respectively. Base flow separation was done from the stream hydrograph using Sp. Hydro base flow separation tool and SPSS Ver.21 statistical software were employed for data analysis. Flow duration curves (FDC) for both watersheds were developed to compare the stream flow patterns between treated and untreated micro-catchments of Mount Yewel. The FDC indi-cated that the base flow from treated micro-catchment is higher and sustained in the dry season while it is low and unsustained in untreated micro-catchment. From statistical analysis, there is a significant (P","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0c01ce681aee53f9c2f526bd6e9acf631063b715dd6c7c3152f59a86383b6b58","category":"Interdisciplinary"}