{"title":"Top Stories: Final Cut Pro for iPad, iOS 17 Rumors, WWDC Schedule","link":"https://www.macrumors.com/2023/05/27/top-stories-final-cut-pro-ipad-ios-17-rumors/","date":1685192400000,"content":"We're just over a week away from the WWDC keynote where Apple will reportedly finally reveal its long-rumored mixed-reality headset, and there are undoubtedly a number of other announcements planned for the event.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/top-stories-27may2023.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nAhead of WWDC, Apple this week released Final Cut Pro and Logic Pro for iPad, bringing versions of the company's professional video and audio apps to the tablet for the first time. This week also saw various rumors about the iPhone 15 and 16 lineups, plus some fresh news about the upcoming iOS 17 update, so read on for details on these stories and more!\r<br />\n\r<br />\n<h2>Apple Releases Final Cut Pro and Logic Pro for iPad</h2>\r<br />\nApple this week <a href=\"https://www.macrumors.com/2023/05/23/apple-releases-final-cut-pro-logic-pro-for-ipad/\">released Final Cut Pro and Logic Pro for select iPad models</a>. Apple says both apps have been designed to take advantage of the iPad’s touch-first interface, providing the \"ultimate mobile studio for video and music creators.\" Both apps have subscription-based pricing set at $4.99 per month or $49 per year in the U.S. after a one-month free trial.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Apple-iPad-Final-Cut-Pro-Logic-Pro-hero-feature-actual-icons.jpg\" alt width=\"2499\" height=\"1406\" />\r<br />\nFinal Cut Pro is compatible with iPads with the M1 chip or later, and Logic Pro is available for iPads with the A12 Bionic chip or later. We <a href=\"https://www.macrumors.com/2023/05/23/hands-on-final-cut-pro-ipad/\">went hands-on with Final Cut Pro for iPad</a> earlier this week, and <a href=\"https://www.macrumors.com/2023/05/23/final-cut-pro-for-ipad-reviews/\">reviews were shared by other media outlets and YouTubers</a>.\r<br />\n\r<br />\n<h2>iOS 17 to Turn iPhone's Lock Screen Into Smart Home Display</h2>\r<br />\niOS 17 will include a <a href=\"https://www.macrumors.com/2023/05/24/ios-17-smart-home-display-lock-screen/\">new interface that shows information such as calendar appointments</a>, the weather, and notifications in the style of a smart home display, according to <em>Bloomberg</em>'s Mark Gurman. His report said the new view will appear when an iPhone is locked and positioned horizontally.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/01/iOS-17-Icon-Mock-Feature-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nGurman also reported that iOS 17 will <a href=\"https://www.macrumors.com/2023/04/21/apple-launching-journaling-app/\">feature a new journaling app</a>, as well as enhancements to the <a href=\"https://www.macrumors.com/2023/05/24/ios-17-wallet-find-my-shareplay-airplay-upgrades/\">Wallet app, Find My app, SharePlay, and AirPlay</a>.\r<br />\n\r<br />\n<h2>Apple Shares WWDC 2023 Schedule, Including Keynote Time</h2>\r<br />\nWWDC 2023 is fast approaching! Apple this week <a href=\"https://www.macrumors.com/2023/05/23/apple-announces-wwdc-2023-schedule/\">shared a schedule for the first day of the annual developers conference</a>, confirming that the opening keynote will be on June 5 at 10 a.m. Pacific Time.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/wwdc-2023.jpeg\" alt width=\"2048\" height=\"1151\" />\r<br />\nAhead of WWDC, the <a href=\"https://www.macrumors.com/2023/05/25/apple-developer-app-wwdc-2023-update/\">Apple Developer app has been updated</a> with new stickers and other preparations. 175 coding session videos will be available in the app for anyone to watch, free of charge, starting June 6.\r<br />\n\r<br />\n<h2>iPhone 15 to Support 15W Wireless Fast Charging Using Non-MagSafe Chargers</h2>\r<br />\nApple's upcoming iPhone 15 and iPhone 15 Pro models will <a href=\"https://www.macrumors.com/2023/05/25/iphone-15-expected-to-support-qi2/\">support the new Qi2 wireless charging standard</a>, according to ChargerLAB, a reliable source of charging-related information.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/magsafe-blue-2.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nQi2 is based on Apple's MagSafe standard, meaning that Qi2 chargers will likely be <a href=\"https://www.macrumors.com/2023/05/24/iphone-15-15w-wireless-fast-charging-non-certified/\">able to charge iPhone 15 models at up to 15W speeds</a> like Apple's MagSafe Charger, as first reported earlier this week.\r<br />\n\r<br />\n<h2>Alleged iPhone 16 Pro Max CAD Model Reveals Significantly Taller Display</h2>\r<br />\nNext year's iPhone 16 Pro and iPhone 16 Pro Max are rumored to <a href=\"https://www.macrumors.com/2023/05/08/iphone-16-pro-larger-display-sizes/\">feature larger 6.3-inch and 6.9-inch displays</a>, respectively. Based on an <a href=\"https://www.macrumors.com/2023/05/22/iphone-16-pro-max-taller-display-rendering/\">alleged CAD for the Pro Max model</a>, it appears the devices will have significantly taller displays vs. existing models.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/iphone-15-16-pro-max-render.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\niPhone 16 Pro models are expected to be released in September 2024, so they are still far away from launching, and Apple's plans could change before then.\r<br />\n\r<br />\n<h2>2023 Pride Band for Apple Watch Now Available to Order</h2>\r<br />\nThe <a href=\"https://www.macrumors.com/2023/05/23/apple-watch-2023-pride-band-orders/\">new Pride Edition band for the Apple Watch is now available to order</a> for $49 on Apple.com and in the Apple Store app. The band is compatible with the Apple Watch Series 3 and newer.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Apple-Watch-Pride-Edition-Band-2023-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nInspired by the LGBTQ+ community, the new Pride band features a sprinkles-like design showcasing the original Pride flag colors and five others. Apple continues to support LGBTQ+ advocacy organizations around the world.\r<br />\n\r<br />\n<h3>MacRumors Newsletter</h3>\r<br />\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r<br />\n\r<br />\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/may-25-2023\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/27/top-stories-final-cut-pro-ipad-ios-17-rumors/\">Top Stories: Final Cut Pro for iPad, iOS 17 Rumors, WWDC Schedule</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-final-cut-pro-for-ipad-ios-17-rumors-wwdc-schedule.2390658/\">Discuss this article</a> in our forums<br /><br />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0c04807f028c07025a46cef7af58c57c49a8e9eb3a3042f89df64b438d001087","category":"Apple"}