{"title":"Vegetation discrimination based on chlorophyll prediction in Marshy wetland using Unmanned Aerial Vehicles","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4170?af=R","date":1716359131000,"content":"<h2>Abstract</h2>\n<p>\nWetlands are an integral part of our global ecosystems and play crucial roles in ecological functions such as carbon sequestration, flood mitigation, water purification, and recreational activities. The Ramsar Convention is the most significant wetland protection pact and is doing tremendous work in conserving wetlands worldwide. However, the wetlands area is still under threat due to anthropogenic activity.\nThe current study utilized drone images, chlorophyll measurements and machine leaning to discriminate and map vegetation at marsh wetland area—the Ramsar site. The high-resolution, multispectral imagery is acquired using a drone-mounted MICAsense sensor.\nEight spectral indices such as Normalized Difference Water Index (NDWI), Two-Band Algorithm (2BDA), Normalized Difference Chlorophyll Index (NDCI), Normalized Difference Vegetation Index (NDVI) Enhanced Normalized Difference Vegetation Index (ENDVI), Green Normalized Difference Vegetation Index (GNDVI), and Normalised Difference RedEdge (NDRE) were calculated on the acquired imagery in order to discriminate the different vegetation covers such as floating aquatic vegetation (FAV), open water, and other vegetations types. These include the following: Eichhornia, Nymphea, Oleracea, Paspalam, and Oryza from agriculture land at the study site.\nTwo models (viz., the Taylor plot and the Lek Profile methods) were employed to assess the sensitivity of the spectral indices for prediction of chlorophyll and vegetation discrimination. It is inferred from both methods that NDCI was most sensitive for chlorophyll prediction of vegetation followed by NGRDI/ ENDVI/ 2BDA and NDVI for chlorophyll prediction in wetland ecosystems. Further, three machine learning algorithms, support vector machine (SVM), random forest (RF), and gradient tree boost (GTB), were utilized for classification, and the performance accuracy of GTB was found to be the highest (0.893), followed by RF (0.851) and SVM (0.723). The GTB algorithm was applied over NDCI for vegetation discrimination.\nThe study revealed that <i>Eichhronia</i> sp. is abundantly present at the study site; hence, strategic management plans should be carried out for the eradication of invasive species and proper management of wetland vegetation.\n</p>","author":"Smrutisikha Mohanty, \nPrem C. Pandey, \nPrachi Singh, \nVikas Dugesar, \nPrashant K. Srivastava","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"0c08a549628a4fc672202812fef91d78dba40576a0f4db7841b3c7e1e3101297","category":"Environment"}