{"title":"Citizens’ perspectives on relocating healthcare","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309382","date":1724940000000,"content":"<p>by L. J. Damen, J. D. De Jong, L. H. D. Van Tuyl, J. C. Korevaar</p>\r\nBackground <p>Healthcare systems around the globe are facing challenges. There are increasing demands and costs at the same time as a diminishing health workforce. Without change, healthcare will become unsustainable. The Dutch government is searching for solutions, one of which is relocating healthcare. Relocating healthcare from expensive institutions to sites closer to patients’ homes is an important part of this. This relocation is expected to reduce costs and lessen shortages of personnel. However, although citizens have an important stake in this, little is known about how they think about this topic. This research aims at investigating citizens’ perspectives on relocating care.</p> Methods <p>In December 2021, three open-ended questions were sent to 1,500 members of Nivel’s Dutch Healthcare Consumer Panel, 796 respondents responded. In addition, two citizen platforms were organised in March and April 2022. A total of 23 citizens participated.</p> Results <p>Our results indicated that the following aspects are important for citizens in healthcare delivery: being treated by someone with expertise in the area of their need, familiarity with the healthcare provider and the treatment of less complex care close to home. When certain conditions are met, citizens prefer treatment for less complex care from their general practitioner rather than in a hospital. The most important condition is that the general practitioner has the right expertise regarding their health question. The willingness to relocate care from the general practitioner to other healthcare providers or to self-care is also present. One of the problems, however, is that citizens often do not know to which healthcare provider they should go or what they should do to increase self-care.</p> Conclusion <p>From a citizens’ perspective, relocating care is an acceptable solution for keeping healthcare sustainable in the future, provided that certain conditions are met.</p>","author":"L. J. Damen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0c0c43f9424b6cf6347602b0f8fe721b8fc2019b5461eb5a9d21dbfea670a0cf","category":"Interdisciplinary"}