{"title":"I found David Lynch’s lost Dune II script","link":"https://arstechnica.com/?p=1995271","date":1704983095000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/dune-1984-800x542.jpg\" alt=\"Kyle MacLachlan in Dune\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/dune-1984.jpg\">Enlarge</a> <span>/</span> Kyle MacLachlan in Dune, 1984. (credit: Everett)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>David Lynch’s 1984 sci-fi epic <i>Dune</i> is—in many ways—a misbegotten botch job. Still, as with more than a few ineffectively ambitious films before it, the artistic flourishes Lynch grafted onto Frank Herbert’s sprawling Machiavellian narrative of warring space dynasties have earned it true cult classic status. Today, fans of the film, which earned a paltry $30 million at the box office and truly bruising reviews upon its release, still wonder what Lynch would have done if given the opportunity to adapt the next two novels in Herbert’s cycle: <i>Dune Messiah</i> and <i>Children of Dune</i>.</p>\n<p>Franchising was the plan before the first film crashed and burned, with Lynch and star Kyle MacLachlan (playing Paul Atreides) set to shoot both <i>Dune</i> sequels back-to-back in 1986. Miniature spaceship models, costumes, and props from the first film were placed in storage by producer Dino De Laurentiis for use on these follow-ups, while the director hammered away on a <i>Dune II</i> script. “I wrote half a script for the second <i>Dune</i>. I really got into it because it wasn’t a big story,” he says in <a href=\"https://www.goodreads.com/book/show/80195.Lynch_on_Lynch\"><i>Lynch on Lynch</i></a>, “more like a neighborhood story. It had some really cool things in it.”</p>\n<p>During the two years I spent putting together my book <a href=\"https://www.wired.com/story/masterpiece-in-disarray-david-lynchs-dune-an-oral-history-excerpt/\"><i>A Masterpiece in Disarray: David Lynch’s Dune—An Oral History</i></a>, I had no luck uncovering Lynch's script for <i>Dune II</i>, despite Frank Herbert telling <i>Prevue</i> magazine in December 1984 that he possessed a copy and was advising Lynch on it. “Now that we speak the same ‘language,’ it’s much easier for both of us to make progress, especially with the screenplays,” Herbert told the publication. Then, in July 2023, within the Frank Herbert archives at California State University, Fullerton, I came across a slim folder with a sticky note declaring “Dune Messiah script revisions,” addressed to the second floor of VFX man Barry Nolan’s office in Burbank where Lynch supervised the final effects shoots and editing on <i>Dune</i>.</p></div><p><a href=\"https://arstechnica.com/?p=1995271#p3\">Read 44 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1995271&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0c0fcf02c81c3daa46a51cbb323e613971ea079aebdc8e505e0ac34d1b47bce1","category":"Tech"}