{"title":"Diploid and tetraploid cytotypes of the flagship Cape species Dicerothamnus rhinocerotis (Asteraceae): variation in distribution, ecological niche, morphology and genetics","link":"https://academic.oup.com/aob/article/133/5-6/851/7220634?rss=1","date":1688601600000,"content":"<span><div>Abstract</div><div>Background and Aims</div>The Greater Cape Floristic Region is one of the world’s biodiversity hotspots and is considered poor in polyploids. To test this assumption, ploidy variation was investigated in a widespread Cape shrub, <span>Dicerothamnus rhinocerotis</span> (renosterbos, Asteraceae). The aim was to elucidate the cytotype distribution and population composition across the species range, and to assess differences in morphology, environmental niches and genetics.<div>Methods</div>Ploidy level and genome size were determined via flow cytometry and cytotype assignment was confirmed by chromosome counting. Restriction site-associated DNA sequencing (RADseq) analyses were used to infer genetic relationships. Cytotype climatic and environmental niches were compared using a range of environmental layers and a soil model, while morphological differences were examined using multivariate methods.<div>Key Results</div>The survey of 171 populations and 2370 individuals showed that the species comprises diploid and tetraploid cytotypes, no intermediates and only 16.8 % of mixed populations. Mean 2C values were 1.80–2.06 pg for diploids and 3.48–3.80 pg for tetraploids, with very similar monoploid genome sizes. Intra-cytotype variation showed a significant positive correlation with altitude and longitude in both cytotypes and with latitude in diploids. Although niches of both cytotypes were highly equivalent and similar, their optima and breadth were shifted due to differences mainly in isothermality and available water capacity. Morphometric analyses showed significant differences in the leaves and corolla traits, the number of florets per capitulum, and cypsela dimensions between the two cytotypes. Genetic analyses revealed four groups, three of them including both cytotypes.<div>Conclusions</div><span>Dicerothamnus rhinocerotis</span> includes two distinct cytotypes that are genetically similar. While tetraploids arise several times independently within different genetic groups, morphological and ecological differences are evident between cytotypes. Our results open up new avenues for questions regarding the importance of ploidy in the megadiverse Cape flora, and exemplify the need for population-based studies focused on ploidy variation.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"0c1141a96cfc110eec4976690ece866bd0970c700d489656b6e0dc1f96ac2a9d","category":"Environment"}