{"title":"Daily Journaling App Day One Acquired by Wordpress Owner Automattic","link":"https://www.macrumors.com/2021/06/14/day-one-acquired-by-automattic/","date":1623702296000,"content":"Popular iOS and Mac-based journaling app Day One has been acquired by Automattic, a company best known for running WordPress.com. News of the acquisition was announced today <a href=\"https://dayoneapp.com/blog/day-one-at-automattic\">on the Day One blog</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/day-one-automattic-acquisition.jpg\" />\r\n<br />\r\nThe Day One app will continue to be run separately, and Day One founder Paul Mayne will continue to lead the Day One team. Day One will be updated in the future with integrations with WordPress.com and Tumblr, but will otherwise remain largely the same.<blockquote>When a small software company is acquired by a larger company, the original team is often swallowed up by the larger company. That's not the case here. I'll be remaining at the helm of Day One, leading the same passionate team that has been responsible for the development and design behind the app today. This means that the Day One you rely on to save your thoughts, photos, videos, audio recordings, and more isn't going away. Instead, it'll only get better, with future integrations with Tumblr and WordPress.com. Rest assured there are no current plans to change the privacy of Day One; safely protecting memories and creating a 100% personal space is the foundation upon which this company was built.</blockquote>Day One's privacy policies will remain in place, as will all of the app features for recording thoughts, photos, videos, and more. Day One offers cross-platform compatibility, end-to-end encryption, and Markdown support, and it's long been a key app on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and Mac.\r\n<br />\r\n\r\n<br />\r\nDay One is free to use, but there is a premium membership that adds unlimited photos and videos, plus audio recordings. Day One Premium is priced at $3.99 per month and the app can be downloaded from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. [<a href=\"https://apps.apple.com/us/app/day-one-2-journal-notes/id1044867788\">Direct Link</a>]<div>Tag: <a href=\"https://www.macrumors.com/guide/day-one/\">Day One</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/14/day-one-acquired-by-automattic/\">Daily Journaling App Day One Acquired by Wordpress Owner Automattic</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/daily-journaling-app-day-one-acquired-by-wordpress-owner-automattic.2300909/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=MTsRjKAs1Sc:mEs_ERi1hsM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=MTsRjKAs1Sc:mEs_ERi1hsM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/MTsRjKAs1Sc\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0c1245a6e823cb1922589a72ad2de833ef30ee27403f2cdb67d546962469ccf9","category":"Apple"}