{"title":"AirPower Cancelled Four Years Ago, But Remains on Apple's Long-Term Roadmap","link":"https://www.macrumors.com/2023/03/28/airpower-cancelled-four-years-ago/","date":1680022211000,"content":"Apple cancelled its planned AirPower accessory <a href=\"https://www.macrumors.com/2019/03/29/apple-officially-cancels-airpower/\">four years ago this week</a>, but a similar solution is said to remain on the company's long-term roadmap.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/AirPower-16x9.jpeg\" alt width=\"1725\" height=\"1038\" />\r<br />\nAnnounced at the iPhone X event in 2017, AirPower was a wireless charging mat designed to charge an iPhone, Apple Watch, and AirPods case simultaneously, regardless of each device's position on the mat. Apple said the accessory would be available in 2018, but it never launched and was ultimately cancelled in a rare move by Apple.\r<br />\n\r<br />\n\"After much effort, we've concluded AirPower will not achieve our high standards and we have cancelled the project,\" said Apple's former hardware engineering chief Dan Riccio, in a statement shared on March 29, 2019. \"We continue to believe that the future is wireless and are committed to push the wireless experience forward.\"\r<br />\n\r<br />\nApple never provided a specific reason for the cancellation, but it is believed that the overlapping charging coils inside the AirPower led to overheating.\r<br />\n\r<br />\nIn his newsletter last October, <em>Bloomberg</em>'s Mark Gurman said he still believes that an AirPower-like accessory will \"<a href=\"https://www.macrumors.com/2022/10/09/gurman-airpods-and-mac-accessories-usb-c-by-2024/\">eventually come to fruition</a>,\" but it might be years away. In the meantime, the only multi-device charging mat sold by Apple is the <a href=\"https://www.apple.com/shop/product/MHXF3AM/A/magsafe-duo-charger\">MagSafe Duo Charger</a>, which only works with two devices at once and has fixed charging positioning.<div>Tag: <a href=\"https://www.macrumors.com/guide/airpower/\">AirPower</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/28/airpower-cancelled-four-years-ago/\">AirPower Cancelled Four Years Ago, But Remains on Apple's Long-Term Roadmap</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/airpower-cancelled-four-years-ago-but-remains-on-apples-long-term-roadmap.2385097/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0c13fdfa86964ff0cee8eff6cc765f13a388e6e22bf8e8fdab304ee276b82ac3","category":"Apple"}