{"title":"Apple CEO Tim Cook: Sideloading Apps Would 'Destroy the Security' of the iPhone","link":"https://www.macrumors.com/2021/06/16/tim-cook-vivatech-conference-interview/","date":1623865784000,"content":"Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> this morning participated in a virtual interview at the VivaTech conference, which is described as Europe's biggest startup and tech event. Cook was interviewed by Guillaume Lacroix, CEO and founder of <a href=\"https://www.brut.media/us\">Brut</a>, a media company that creates short-form video content.\r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\nMuch of the discussion centered on privacy, as it often does in interviews that Cook participates in. He reiterated once again how important privacy is to Apple.<blockquote>We've been focused on privacy for over a decade. We see it as a basic human right. A fundamental human right. And we've been focused on privacy for decades. Steve used to say privacy was stating in plain language what people are signing up for and getting their permission. And that permission should be asked repeatedly. We've always tried to live up to that. [...]\r\n<br />\r\n\r\n<br />\r\nIf everyone is worried someone else is watching them, they begin to do less, think less. And no one wants to live in a world where freedom of expression narrows. Privacy goes to the heart of just one of the key values of Apple.</blockquote>Talk of privacy values led to a discussion of \"GAFA,\" an acronym used in France that lumps Google, Apple, Facebook, and Amazon together. Cook said he doesn't like that particular acronym because it paints a picture that \"all companies are monolithic in nature,\" and those companies have \"different business models and different values.\"<blockquote>If you look at Apple and look at what we do, we make things. We make hardware, software, and services, and we try to make sure that at that intersection, they work seamlessly together. We focus on making the best, not the most.</blockquote>Cook was also asked about regulation, specifically in Europe because the event was taking place in France. He commented on the GDPR, and said Apple would support even stronger privacy laws.<blockquote>There's very good regulation coming out of Europe like the GDPR. The GDPR set not only a standard, but really set the stage for the world to adopt GDPR because most of the companies are multinational companies and are implementing this around the world regardless of the regulations in those places. We were big supporters of GDPR from the beginning, and we would support going even further than the GDPR in privacy because there's still so much left to do in the privacy world.</blockquote>Cook spoke about current regulatory changes that are being discussed in Europe, and would force sideloading on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>. Cook said that such a move would destroy the security of the ‌iPhone‌.<blockquote>Current Digital Services Act language that is being discussed would force sideloading on the ‌iPhone‌. This would be an alternate way of getting apps onto the ‌iPhone‌. As we look at that, that would destroy the security of the ‌iPhone‌ and a lot of the privacy initiatives that we've built into the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, where we have privacy nutrition labels and App Tracking Transparency that forces people to get permission to track across apps.\r\n<br />\r\n\r\n<br />\r\nThese things would not exist anymore, except in people that stuck with our ecosystem, and so I worry deeply about privacy and security. What we're going to do is constructively take part in the debate and hope that we can find a way forward. As I said, there are good parts of the regulation... like there are parts of the DSA that are right on. I think it's just one of those areas where we have the responsibility to say when it's not in the best interest of our user, that it's not.</blockquote>Cook went on to point out that Android has 47x more malware than iOS. \"Why is that?\" he asked. \"Because we've designed iOS in such a way that there's one ‌App Store‌ and all of the apps are reviewed prior to going on the store.\" Cook said that he's \"optimistic\" about the discussions, and that Apple will be \"standing up for the user.\"\r\n<br />\r\n\r\n<br />\r\nCook was also asked about how Apple reconciles its environmental goals with shipping a new ‌iPhone‌ every year, but he mostly skirted the question with a discussion of Apple's environmental efforts and plans to make the entire supply chain carbon neutral by 2030. \"A great product for the user and a great product for the planet can be one in the same,\" said Cook. \"And that's the objective we set for ourselves.\"\r\n<br />\r\n\r\n<br />\r\nOn the topic of future technology, Cook was asked about what he expects to see in the ‌iPhone‌ 30, 20 years in the future.<blockquote>Well, it will be better than the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a>. You can count on that. It will solve more problems for people. At the root of it, what Apple is all about is making the best products that really enrich people's lives. We won't work on one that where we don't feel like we can meet that mission. And so we only do a few things.</blockquote>Cook said that he's excited about \"so many things\" coming in the future, including AR and AI.<blockquote>In terms of what I'm excited about, I'm excited about so many things. I'm a great believer in the power of technology to help people. We approach the future with great humility because we know we can't predict it. I'm not one of those people that can say I can see 20 years out or 30 years out and tell you what is going to happen. I really don't believe anyone can. We approach it with great humility.\r\n<br />\r\n\r\n<br />\r\nI get excited about AR because I see it as technology that can enhance life in a broad way. We've been working on AR first with our iPhones and iPads, and later we'll see where that goes in terms of our products. The key thing is that it can enrich people's lives.\r\n<br />\r\n\r\n<br />\r\nI get excited about AI and the ability to remove some of the things that keep people down and do work and free up leisure time for people.</blockquote>Cook said that he's \"exceedingly optimistic\" about the intersection of technology and health. Apple initially looked at the Apple Watch from a wellness point of view, but then started getting emails from people who had discovered heart problems from the heart rate sensor, which led to Apple adding more health features into the Apple Watch.<blockquote>I'm exceedingly optimistic about the intersection of technology and health. when we started shipping the watch we did so with thinking about it from a wellness point of view. but we put a heart rate sensor on it... and I was getting tons of emails from people who found heart problems that they didn't know about. So we started adding more function to the watch.</blockquote>Cook said that the \"idea of continually monitoring the body\" is a \"big idea that has a long roadmap ahead of it.\"\r\n<br />\r\n\r\n<br />\r\nCook was asked about Apple's failures, and he says that Apple fails all the time, but tries to do so internally as to not impact customers.<blockquote>I fail daily at something. We do allow ourselves to fail. We try to fail internally instead of externally because we don't want to involve customers in the failure, but we develop things and subsequently decide not to ship. We begin going down a certain road and sometimes adjust significantly because of a discovery that we make in that process. And so absolutely, failing is a part of life and it's a part of it whether you're a new company, a startup, or you're a company that's been around awhile and trying different things. If you're not failing, you're not trying enough different things.</blockquote>At the end of the discussion, Cook was asked about the <a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a>, and he of course declined to comment. \"In terms of a car, I've got to keep some secrets,\" Cook said. \"There always has to be something up our sleeve, so I don't think I'll comment on the car rumor.\"\r\n<br />\r\n\r\n<br />\r\nOther topics of discussion included working through COVID, Apple's efforts to create face shields, disinformation, climate change, taxes, and more, all of which can be found in the full interview.<div>Tag: <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/16/tim-cook-vivatech-conference-interview/\">Apple CEO Tim Cook: Sideloading Apps Would 'Destroy the Security' of the iPhone</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-ceo-tim-cook-sideloading-apps-would-destroy-the-security-of-the-iphone.2301178/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=qbx2_pf1wr4:wUymGUA9F-k:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=qbx2_pf1wr4:wUymGUA9F-k:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/qbx2_pf1wr4\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0c140646215b5784dc9bf6a3c78b77bbb62497ac45e3486e0bc86e3db2d59dae","category":"Apple"}