{"title":"Lockdown Mode Expanding to Apple Watch With watchOS 10","link":"https://www.macrumors.com/2023/06/15/lockdown-mode-apple-watch/","date":1686859671000,"content":"With iOS 16, iPadOS 16, and macOS Ventura last year, Apple introduced <a href=\"https://www.macrumors.com/2022/07/06/ios-16-lockdown-mode/\">Lockdown Mode</a>, an optional security setting designed to protect the \"very small number\" of users who may be at risk of \"highly targeted cyberattacks\" from companies developing state-sponsored spyware, such as journalists, activists, and government employees.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/07/Lockdown-Mode-Feature.jpg\" alt width=\"2125\" height=\"1196\" />\r<br />\nStarting with iOS 17 and watchOS 10, enabling Lockdown Mode on an iPhone also turns on Lockdown Mode on a paired Apple Watch. Apple says Lockdown Mode provides an \"extreme\" level of security, with strict limitations on apps, websites, and features.\r<br />\n\r<br />\nAt launch, Lockdown Mode included the following protections:<ul><li>In the Messages app, most message attachment types other than images are blocked, and some features like link previews are unavailable.</li>\r<br />\n<li>Incoming FaceTime calls from people you have not previously called are blocked. Incoming invitations for other Apple services from people you have not previously invited are also blocked.</li>\r<br />\n<li>In Safari and other WebKit browsers, some complex web technologies and browsing features, including just-in-time (JIT) JavaScript compilation, are disabled unless the user excludes a trusted site from Lockdown Mode.</li>\r<br />\n<li>Shared albums are removed in the Photos app, and shared album invitations are blocked.</li>\r<br />\n<li>When a device is locked, wired connections with other devices/accessories are blocked.</li>\r<br />\n<li>Configuration profiles cannot be installed, and the device cannot enroll into mobile device management (MDM), while Lockdown Mode is turned on.</li></ul>In a <a href=\"https://www.apple.com/newsroom/2023/06/apple-announces-powerful-new-privacy-and-security-features/\">press release</a> last week, Apple said it is expanding Lockdown Mode's protections to encompass \"safer wireless connectivity defaults, media handling, media sharing defaults, sandboxing, and network security optimizations.\"<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 8</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Caution)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/15/lockdown-mode-apple-watch/\">Lockdown Mode Expanding to Apple Watch With watchOS 10</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/lockdown-mode-expanding-to-apple-watch-with-watchos-10.2393138/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0c1e15685cde0ce4ef199eb8bfe9f4c04d3cdc7963e60b1632c1494ec3d274c7","category":"Apple"}