{"title":"Ocean Alkalinity Enhancement in Deep Water Formation Regions Under Low and High Emission Pathways","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004213?af=R","date":1728127496000,"content":"<h2>Abstract</h2>\n<p>Ocean Alkalinity Enhancement (OAE) is an ocean-based Carbon Dioxide Removal (CDR) method to mitigate climate change. Studies to characterize regional differences in OAE efficiencies and biogeochemical effects are still sparse. As subduction regions play a pivotal role for anthropogenic carbon uptake and centennial storage, we here evaluate OAE efficiencies in the subduction regions of the Southern Ocean, the Northwest Atlantic, and the Norwegian-Barents Sea region. Using the ocean biogeochemistry model FESOM2.1-REcoM3, we simulate continuous OAE globally and in the subduction regions under high (SSP3-7.0) and low (SSP1-2.6) emission scenarios. The OAE efficiency calculated by two different metrics is higher (by 8%–30%) for SSP3-7.0 than for SSP1-2.6 due to a lower buffer factor in a high-CO2 ${\\mathrm{C}\\mathrm{O}}_{2}$ world. All subduction regions show a CDR potential (0.23–0.31; PgC CO2 ${\\mathrm{C}\\mathrm{O}}_{2}$ uptake per Pg alkaline material) consistent with global OAE for both emission scenarios. Calculating the efficiency as the ratio of excess dissolved inorganic carbon (DIC) to excess alkalinity shows that the Southern Ocean and the Northwest Atlantic are as efficient as the global ocean (0.79–0.85), while the Norwegian-Barents Sea region has a lower efficiency (0.65–0.75). The subduction regions store a fraction of excess carbon below 1 km that is 1.9 times higher than the global ocean. The excess surface alkalinity and thus CO2 ${\\mathrm{C}\\mathrm{O}}_{2}$ uptake and storage follow the mixed-layer depth seasonality, with the majority of the excess CO2 ${\\mathrm{C}\\mathrm{O}}_{2}$ flux occurring in summer at shallow mixed layer depths. This study therefore highlights that subduction regions can be efficient for OAE if optimal deployment strategies are developed.</p>","author":"Tanvi Nagwekar, \nCara Nissen, \nJudith Hauck","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"0c1e32d75ea0588f1d5ef88febcbdb2443b6f62cd6afb8ccb5993d7a036c430b","category":"Environment"}