{"title":"Atlantic currents seem to have started fading last century","link":"https://arstechnica.com/?p=1745781","date":1614435019000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/gulfstream_amo_2005108_sst-800x492.jpg\" alt=\"Image of a white, meandering band separating purple areas from grey ones.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/gulfstream_amo_2005108_sst.jpg\" class=\"enlarge-link\" data-height=\"889\" data-width=\"1445\">Enlarge</a> <span class=\"sep\">/</span> The Gulf Stream, as imaged from space. (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://visibleearth.nasa.gov/images/5432/the-gulf-stream\">NASA images courtesy Norman Kuring, MODIS Ocean Team.</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The major currents in the Atlantic Ocean help control the climate by moving warm surface waters north and south from the equator, with colder deep water pushing back toward the equator from the poles. The presence of that warm surface water plays a key role in moderating the climate in the North Atlantic, giving places like the UK a far more moderate climate than its location—the equivalent of northern Ontario—would otherwise dictate.</p>\n<p>But the temperature differences that drive that flow are expected to fade as our climate continues to warm. A bit over a decade ago, measurements of the currents seemed to be indicating that temperatures were dropping, suggesting that we might be seeing these predictions come to pass. But a few years later, it became clear that there was just too much year-to-year variation for us to tell.</p>\n<p>Over time, however, researchers have figured out ways of getting indirect measures of the currents, using material that is influenced by the strengths of the water's flow. These measures have now let us look back on the current's behavior over the past several centuries. And the results confirm that the strength of the currents has dropped dramatically over the last century.</p></div><p><a href=\"https://arstechnica.com/?p=1745781#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1745781&comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0c2147a4f6f8e67ae43c93fbc14939df0598f24ece90f0c0f627552e0ae027be","category":"Tech"}