{"title":"Latest WhatsApp Beta Features Native iPad Support","link":"https://www.macrumors.com/2023/09/20/whatsapp-beta-native-ipad-support/","date":1695202309000,"content":"WhatsApp for iPad finally appears to be nearing a release. In the latest version of WhatsApp Beta for TestFlight, Meta has introduced an option to use WhatsApp on an iPad independently of an iPhone, thanks to an update to its <a href=\"https://www.macrumors.com/how-to/use-whatsapp-account-multiple-phones/\">Link a Device</a> feature.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/whatsapp-ipad.jpeg\" alt width=\"1825\" height=\"1027\" />\r<br />\nWhatsApp currently allows users of the encrypted messaging platform to link up to four devices to their account even when their main smartphone is not connected to the internet. Each linked device connects to WhatsApp independently, ensuring that personal messages, media, and calls are end-to-end encrypted. The feature also supports Macs, but not iPads – until now.\r<br />\n\r<br />\nAs spotted by code researcher <a href=\"https://wabetainfo.com/whatsapp-beta-for-ios-23-19-1-71-whats-new/\">WABetaInfo</a>, WhatsApp has started testing a facility to use iPads as a linked device in the latest beta. The new companion mode also means that any messages sent or received on iPad are synced to the account's primary phone, regardless of whether it is an iPhone or an Android device.\r<br />\n\r<br />\nIn order to test the companion mode, WhatsApp previously released a native iPad app built with Catalyst so that users could start testing the feature and the app. A beta version compatible with iPad can now be installed via the TestFlight app by all testers with the iOS beta app.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/whatsapp-ipad-wabetainfo.jpg\" alt width=\"768\" height=\"576\" /><div><em>Screenshot from WhatsApp for iPad (Image credit: WaBetaInfo)</em></div><ul><li><a href=\"https://www.macrumors.com/how-to/use-whatsapp-account-multiple-phones/\">How to Use Your WhatsApp Account Across Multiple Phones</a></li></ul>\r<br />\nWhatsApp parent company Meta has made Facebook available on ‌iPad‌, but WhatsApp and Meta's Instagram app have never had native ‌iPad‌ availability, despite many users asking for the feature. It's not clear exactly when WhatsApp for iPad will be available to the general public, but its inclusion in the beta is a good indicator that it will arrive soon.<div>Tags: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a>, <a href=\"https://www.macrumors.com/guide/wabetainfo/\">WABetaInfo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/20/whatsapp-beta-native-ipad-support/\">Latest WhatsApp Beta Features Native iPad Support</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/latest-whatsapp-beta-features-native-ipad-support.2403425/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0c261be178c6f37c2b5048ca2e98ec2b5c6a8e2895b0e7131b16591314914b4f","category":"Apple"}