{"title":"Microsoft Xbox Chief Phil Spencer Wanted to Buy Nintendo in 2020","link":"https://www.polygon.com/23880422/xbox-phil-spencer-nintendo-acquisition-ftc-email-leak","date":1695335939000,"content":"\n<p>Michael McWhertor, reporting for Polygon on what I consider the most eye-catching of the revelations from Microsoft’s <a href=\"https://www.nbcnews.com/tech/video-games/microsofts-xbox-plans-revealed-emails-tied-ftc-case-rcna105766\">botched document upload to the FTC</a>:</p>\n\n<blockquote>\n  <p>But Xbox head Phil Spencer said in 2020 — a month before \nMicrosoft announced its plan to acquire ZeniMax and subsidiary \nBethesda Softworks — that his No. 1 pick for an acquisition or \nmerger is Nintendo. In emails leaked as part of the Federal Trade \nCommission’s case to <a href=\"https://www.polygon.com/23500417/microsoft-activision-blizzard-deal-ftc-lawsuit-acquisition\">block the Microsoft-Activision Blizzard deal \nin court</a>, Spencer named Nintendo as “THE prime asset for us \nin Gaming.” </p>\n\n<p>Spencer discussed the possibility of an acquisition or merger with \nNintendo in an email with Microsoft executive Takeshi Numoto. \nSpencer said that he’d “had numerous conversations with the \n[leadership team] of Nintendo about tighter collaboration and feel \nlike if any US company would have a chance with Nintendo we are \nprobably in the best position.” </p>\n\n<p>Two things stood in Microsoft’s way, according to Spencer: “The \nunfortunate (or fortunate for Nintendo) situation is that Nintendo \nis sitting on a big pile of cash,” and “they have a [board of \ndirectors] that until recently has not pushed for further \nincreases in market growth or stock appreciation.” </p>\n</blockquote>\n\n<p>I can’t imagine things going well for Nintendo — a company whose entire existence is based on their unique style, design, and taste — under Microsoft, a company infamous for having <a href=\"https://www.youtube.com/watch?v=rsyOlwmHt5E\">no taste</a>.</p>\n\n<p>And the translation for that last paragraph quoted above is that Nintendo is (a) profitable and (b) run by a board of directors who are interested <em>not</em> in a quick buck, but instead on stewarding the company’s continuing long-term success as a distinct and independent company.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/09/21/microsoft-nintendo\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"0c3576e08bd81c0606fb18c1c5cebc66063a04626a6723f94283b58f73994f23","category":"Tech"}