{"title":"Persistent high mortality rates for Diabetes Mellitus and Hypertension after excluding deaths associated with COVID-19 in Brazil, 2020–2022","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002576","date":1715263200000,"content":"<p>by Rodrigo Moreira, Leonardo S. Bastos, Luiz Max Carvalho, Laís Picinini Freitas, Antonio G. Pacheco</p>\r\nIntroduction <p>The outbreak of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) posed a significant public health challenge globally, with Brazil being no exception. Excess mortality during this period reached alarming levels. Cardiovascular diseases (CVD), Systemic Hypertension (HTN), and Diabetes Mellitus (DM) were associated with increased mortality. However, the specific impact of DM and HTN on mortality during the pandemic remains poorly understood.</p> Methods <p>This study analyzed mortality data from Brazil’s mortality system, covering the period from 2015 to 2022. Data included all causes of death as listed on death certificates, categorized by International Classification of Diseases 10th edition (ICD-10) codes. Population data were obtained from the Brazilian Census. Mortality ratios (MRs) were calculated by comparing death rates in 2020, 2021, and 2022 to the average rates from 2015 to 2019. Adjusted MRs were calculated using Poisson models.</p> Results <p>Between 2015 and 2022, Brazil recorded a total of 11,423,288 deaths. Death rates remained relatively stable until 2019 but experienced a sharp increase in 2020 and 2021. In 2022, although a decrease was observed, it did not return to pre-pandemic levels. This trend persisted even when analyzing records mentioning DM, HTN, or CVD. Excluding death certificates mentioning COVID-19 codes, the trends still showed increases from 2020 through 2022, though less pronounced.</p> Conclusion <p>This study highlights the persistent high mortality rates for DM and HTN in Brazil during the years 2020–2022, even after excluding deaths associated with COVID-19. These findings emphasize the need for continued attention to managing and preventing DM and HTN as part of public health strategies, both during and beyond the COVID-19 pandemic. There are complex interactions between these conditions and the pandemic’s impact on mortality rates.</p>","author":"Rodrigo Moreira","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"0c36e72313bd901143ecf616ba15def8c5d57fa299c7411cb560df9e8e7e5eb1","category":"Environment"}