{"title":"Burger King is entering professional cycling with Italian ProTeam Eolo-Kometa","link":"https://cyclingtips.com/2021/12/burger-king-is-entering-professional-cycling-with-italian-proteam-eolo-kometa/","date":1639323174000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/GettyImages-1233043867-650x433.jpg\" /></div><h2>Burger King is entering professional cycling with Italian ProTeam Eolo-Kometa</h2><p>\n</p><p>Burger King is joining the long list of eyebrow-raising sponsors of professional cycling via the Italian ProTeam Eolo-Kometa, the Giro stage-winning outfit headed up by Alberto Contador and Ivan Basso.</p>\n\n\n\n<p>“From next year Burger King Italia will be with us,” Basso told La Gazzetta dello Sport, “seeing such an important company get on board our team and cycling in general makes us all very happy.”</p>\n\n\n\n<p>The sponsorship came about after Alessandro Lazzaroni, CEO of Burger King Italia, joined the Italian ProTeam at their debut Giro d’Italia this year, where they stirred up a huge amount of interest and publicity thanks to Lorenzo Fortunato’s <a href=\"https://cyclingtips.com/2021/05/lorenzo-fortunato-wins-on-the-zoncolan-bernal-gains-more-time-in-the-gc/\">stage 14 victory atop the Monte Zoncolan</a>. As sales pitches go, that’s a pretty good one.</p>\n\n\n\n<p>“It will still be called Eolo-Kometa,” Basso confirmed, “while the new sponsor will occupy a space on the jersey.”</p>\n\n\n\n<p>The fast food giant is not the first food company on the team’s list of sponsors; Kometa is a Hungarian organisation that specialises in sausages, meat and cheese, and is responsible for the #HonestFood hashtag that you might have seen on the team’s social media. Eolo, on the other hand, is a communications company much like Movistar. Fast food and internet: a match made in heaven.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/GettyImages-1317270170-1340x893.jpg\" /><figcaption>KOM classification-leader Vincenzo Albanese represents Eolo-Kometa in the breakaway on stage 3 of the 2021 Giro d’Italia.</figcaption></figure>\n\n\n\n<p>Eolo-Kometa started life as a Continental development team in 2018 and ‘turned pro’ in time for the 2021 season, scoring a wild card entry for the Italian Grand Tour at first time of asking. It was by all accounts a remarkable debut, with Vincenzo Albanese taking ownership of the KOM jersey for a couple of days, a handful of stage top-10s and then Fortunato’s stage win, not to mention repeated breakaway appearances. Though Fortunato’s is the only WorldTour win up to now, the team continued to show their talents through to the last races of the season.</p>\n\n\n\n<p>“I like to keep my feet on the ground,” Basso said of the team’s future. “We don’t have to make fancy flights, we need to grow and we will do it only thanks to our professionalism, results and seriousness.</p>\n\n\n\n<p>“If we are able to demonstrate all this, the sponsors will remain and we will be able to grow. We are slowly doing it: after three years of Continental [level] we have finished first out of the Professionals with satisfactory results.”</p>\n\n\n\n<p>Looking ahead to next season, though reported negotiations with both Elia Viviani and Vincenzo Nibali obviously came to nothing, Eolo-Kometa (powered by Burger King) will start 2022 with justifiably high expectations.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/burger-king-is-entering-professional-cycling-with-italian-proteam-eolo-kometa/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0c39dc3aab2f9bdf77b8d99486d29842be1ed22ecc3021e7fdc5f985e7d6fbc0","category":"Cycling"}