{"title":"Recruitment dynamics of juvenile salmonids: Comparisons among populations and with classic case studies","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15748?af=R","date":1721274433000,"content":"<h2>Abstract</h2>\n<p>Understanding recruitment, the process by which individuals are added to a population or to a fishery, is critical for understanding population dynamics and facilitating sustainable fisheries management. Important variation in recruitment dynamics is observed among populations, wherein some populations exhibit asymptotic productivity and others exhibit overcompensation (i.e., compensatory density-dependence in recruitment). Our ability to understand this interpopulation variability in recruitment patterns is limited by a poor understanding of the underlying mechanisms, such as the complex interactions between density dependence, recruitment, and environment. Furthermore, most studies on recruitment are conducted using an observational design with long time series that are seldom replicated across populations in an experimentally controlled fashion. Without proper replication, extrapolations between populations are tenuous, and the underlying environmental trends are challenging to quantify. To address these issues, we conducted a field experiment manipulating stocking densities of juvenile brook trout <i>Salvelinus fontinalis</i> in three wild populations to show that these neighboring populations—which exhibit divergent patterns of density dependence due to environmental conditions—also have important differences in recruitment dynamics. Testing against four stock-recruitment models (density independent, linear, Beverton-Holt, and Ricker), populations exhibited ~twofold variation in asymptotic productivity, with no overcompensation following a Beverton-Holt model. Although environmental variables (e.g., temperature, pH, depth, substrate) correlated with population differences in recruitment, they did not improve the predictive power in individual populations. Comparing our patterns of recruitment with classic salmonid case studies revealed that despite differences in the shape and parameters of the curves (i.e., Ricker vs. Beverton-Holt), a maximum stocking density of about five YOY fish/m<sup>2</sup> emerged. Higher densities resulted in very marginal increases in recruitment (Beverton-Holt) or reduced recruitment due to overcompensation (Ricker).</p>","author":"Jean‐Michel O. Matte, \nDylan J. Fraser, \nJames W. A. Grant","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"0c3dd49ff08c7837809b30533262e56e5060de9d2c83e572bf861ef371541bc0","category":"Environment"}