{"title":"Rocket Report: SLS not available for science, OneWeb reaches milestone","link":"https://arstechnica.com/?p=1778927","date":1625828402000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/STS-135_begins_takeoff-800x525.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/STS-135_begins_takeoff.jpg\">Enlarge</a> <span>/</span> Space shuttle <em>Atlantis</em> launched on Friday, July 8, 2011, at NASA's Kennedy Space Center. This was the final launch of the space shuttle program. (credit: <a href=\"https://www.nasa.gov/\">NASA</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 4.06 of the Rocket Report! After years and years of promises, the era of suborbital space tourism is really and truly upon us. What a weekend we have coming up in launch: Richard Branson is set to make his long-awaited spaceflight aboard the rocket-powered VSS <em>Unity</em> on Sunday morning. I'll be onsite, in New Mexico, to take in the scene and report back.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Astra unveils plans for growth as it goes public</strong>. One week has passed since Astra became a publicly traded stock as part of a special-purpose acquisition company, or SPAC. (The company's stock, <a href=\"https://www.google.com/finance/quote/ASTR:NASDAQ?sa=X&amp;ved=2ahUKEwihqJCnltTxAhWMKM0KHWoZDtUQ3ecFMAF6BAgUEBI\" target=\"_blank\">ASTR</a>, is up about 10 percent during that time). In an interview with Ars, Astra CEO Chris Kemp said the company is using the funds raised from this transaction—about a half-billion dollars—to continue operations, accelerate growth toward a larger launch vehicle, and to become a space services company. The company's next launch of its Rocket 3 series is on track for later this summer, and there are plans for two more launches this year. The company hopes to reach a monthly cadence by the end of 2021, Kemp said, and it is targeting a total of 15 launches next year.</p></div><p><a href=\"https://arstechnica.com/?p=1778927#p3\">Read 20 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1778927&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0c42f9a5fff30cba3d198288ab77ed7045de25101fa193585b274032e0e74a53","category":"Tech"}