{"title":"ลามมาทุบวงการไอดอลแล้ว จีนแบนชาร์ตจัดอันดับความนิยมดารา ชี้มอมเมาเยาวชน","link":"https://www.blognone.com/node/124475","date":1630139870000,"content":"<div><div><div><p>วันศุกร์ที่ 27 ส.ค. Cyberspace Administration of China หรือหน่วยงานควบคุมอินเทอร์เน็ตในจีนประกาศแบนการจัดอันดับความนิยมคนดังรวมถึงไอดอล โดยมีประเด็นเริ่มมาจากข่าวคราวเสียหายของดาราจีนเช่น Zheng Shuang โดนข้อหาหลบเลี่ยงภาษี และ Kris Wu ในข้อหาข่มขืน นอกจากนี้ยังห้ามจัดกิจกรรมส่งเสริมการโปรโมทไอดอลทุกรูปแบบ</p>\n<p>จากคำสั่งดังกล่าว พบว่าแพลตฟอร์มวิดีโอหลายรายในจีนตอบรับกฎใหม่ อย่าง iQiyi ได้ยกเลิกการแสดงความสามารถด้านไอดอลในสัปดาห์นี้ ก่อนหน้านี้ยังเคยมีกรณีแฟนคลับแห่ซื้อนมที่ไอดอลเป็นพรีเซนเตอร์เพื่อเพิ่มคะแนนให้ไอดอล จนมีภาพนมถูกเททิ้งลงท่อระบายน้ำออกมา</p>\n<p>ในมุมมองของรัฐบาล มองว่าวัฒนธรรมแฟนคลับที่มีการบูชาคลั่งไคล้ไอดอลนั้นส่งผลเสียและเป็นการมอมเมาเยาวชน รัฐบาลคาดหวังว่าจะช่วยลดวัฒนธรรมคลั่งไคล้ไอดอลในทางที่ผิด อย่างกรณี Kris Wu ก็มีแฟนคลับบางส่วนพยายามระดมเงินเพื่อช่วยเหลือเขาให้หลุดพ้นคดี</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3c05959b7a4ed651d9bc099f1809d364.jpg\" /></p>\n<p>ภาพโดย <a href=\"https://th.m.wikipedia.org/wiki/%E0%B9%84%E0%B8%9F%E0%B8%A5%E0%B9%8C:Wai_Tan,_Shanghai,_China_(Unsplash).jpg\">Li Yang</a></p>\n<p>กฎใหม่กระทบกิจกรรมออนไลน์ที่เกี่ยวข้องอย่างการเข้าไซน์ที่มีการเสียเงินเพื่อแลกกับคอนเทนต์ไอดอล หรือการโปรโมทกิจกรรมออนไลน์เพื่อพบปะไอดอลด้วย</p>\n<p>จีนมีแนวทางคุมเข้มเนื้อหาโซเชียลมีเดีย, เกม และวงการบันเทิงที่กระทบต่อความมั่นคงสถาบันทางการเมือง จากกฎใหม่แสดงให้เห็นว่า จีนพยายามควบคุมพฤติกรรมของดาราไอดอลด้วย</p>\n<p>ข่าวนี้มาพร้อมๆ กับกระแสทุบวงการเทคโนโลยีตั้งแต่อาลีบาบา, Tencent ไปจนถึงวงการกวดวิชาและวงการคริปโตด้วย</p>\n<p>ที่มา - <a href=\"https://www.nytimes.com/2021/08/27/business/media/china-celebrity-culture.html?smtyp=cur&amp;smid=tw-nytimes\">The New York Times</a>, <a href=\"https://www.globaltimes.cn/page/202108/1232634.shtml\">Global Times</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/entertainment\">Entertainment</a></div><div><a href=\"/topics/freedom-information\">Freedom of Information</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0c43dd387373bc20867b325a806609cc609b176da0000b247436ebaaffc38256","category":"Thai"}