{"title":"The milk float was the first truly successful last-mile delivery EV","link":"https://arstechnica.com/?p=1957345","date":1690559118000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-672881708-800x533.jpg\" alt=\"A white and green milk float\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-672881708-scaled.jpg\">Enlarge</a> <span>/</span> Milk float in Earlsfield in London, England, United Kingdom. In Britain, a milk float is a vehicle specifically designed for the delivery of fresh milk.  (credit: Mike Kemp/In Pictures via Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Electric delivery vehicles are big business. These \"last-mile\" solutions from companies like UPS and Amazon are a way around restrictions on freight vehicle emissions in cities and provide green credentials at the point where customers interact with a service.</p>\n<p>In Europe, electric van sales went up 74 percent over the first five months of 2023, with EV powertrains becoming the second-favorite propulsion behind diesel, leapfrogging gasoline. Delivery EV production is massively accelerating as companies head toward 2025 commitments for fleet transformation and Ford and Stellantis bring more vehicles to market. Nissan has even been using Nikola battery-electric heavy-duty car transports to deliver Ariyas to customers in California.</p>\n<p>But these electric delivery vehicles not especially new. In fact, a very significant proportion of electric road vehicles for most of the 20th century were working in suburbs, small towns, and villages in the UK as \"milk floats.\"</p></div><p><a href=\"https://arstechnica.com/?p=1957345#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1957345&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0c4ab96e93dbe65ed5c9a781bf8ff9cc0900902087f1ccb17c0f70157ed1d4d7","category":"Tech"}