{"title":"A Preliminary Fuzzy Inference System for Predicting Atmospheric Ozone in an Intermountain Basin","link":"https://www.preprints.org/manuscript/202408.0185/v1","date":1722596773000,"content":"Unhealthy concentrations of ozone in the Uinta Basin, Utah, can occur after sufficient snowfall and a strong atmospheric anticyclone creates a persistent cold pool that traps atmospheric ozone and its precursors emitted from oil and gas operations. The winter-ozone system has two clear outcomes—occurrence or not—that is well understood by domain experts and supported by archives of atmospheric observations. Rules of the system can be formulated in natural language (“sufficient snowfall and high pressure leads to high ozone\"), lending itself to analysis with a fuzzy-logic inference system. This method encodes human expertise as machine intelligence in a more constrained manner than alternative, more complex inference methods such as neural networks, increasing user trustworthiness of our model prototype before further optimization. Herein, we develop an ozone-forecasting system, Clyfar, based on knowledge of system dynamics and informed by an archive of meteorological conditions and ozone concentration. The inference system demonstrates proof-of-concept despite rudimentary tuning. We describe our framework for predicting future ozone concentrations if input values are drawn from numerical weather prediction forecasts as a proxy for observations as the system’s initial conditions. Our model is computationally cheap, allowing us to sample uncertainty with substantially more ensemble members than in traditional NWP. We evaluate hindcasts for one winter, finding our prototype demonstrates promise to deliver useful guidance for users concurrent with optimization of system parameters using machine learning.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0c5ad8486b7d74ae7be6a71271363f0522808f88e43c117854d917110d75bc32","category":"Interdisciplinary"}