{"title":"Facebook Says Impact of iOS 14.5's App Tracking Transparency Will Be 'Manageable'","link":"https://www.macrumors.com/2021/04/28/facebook-att-impact-manageable/","date":1619653233000,"content":"Facebook today announced its earnings for the first calendar quarter of 2021, and during the call discussing the results, Facebook executives confirmed that Apple's App Tracking Transparency will have a \"manageable\" impact on Facebook's business starting in the second quarter.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/Apple-vs-Facebook-feature.jpg\" />\r\n<br />\r\nAs highlighted by <em><a href=\"https://www.zdnet.com/article/facebook-tops-q1-estimates-as-ad-prices-rise/\">ZDNet</a></em>, Facebook CFO Dave Wehner said that Facebook is expecting \"increased ad targeting headwinds in 2021 from regulatory and platform changes, notably the recently launched iOS 14.5 update.\" iOS 14.5 is the update that includes App Tracking Transparency, and it requires app developers to ask for express permission before accessing the IDFA for tracking users across apps and websites.\r\n<br />\r\n\r\n<br />\r\nFacebook COO Sheryl Sandberg went on to explain that Facebook is doing a \"huge amount of work\" to prepare for the changes to personalized advertising, including rebuilding elements of its advertising platform and making the case that \"personalized advertising is good for people and businesses.\"<blockquote>We're doing a huge amount of work to prepare. We're working with our customers to implement Apple's API and our own aggregated events measurement API to mitigate the impact of the <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a> changes. We're rebuilding meaningful elements of our ad tech so that our system continues to perform when we have access to less data in the future.\r\n<br />\r\n\r\n<br />\r\nAnd we're part of long-term collaborations with industry bodies like the W3C on initiatives like privacy enhancing technologies that provide personalized experiences while limiting access to people's information. It's also on us to keep making the case that personalized advertising is good for people and businesses, and to better explain how it works so that businesses don't have to understand the alphabet soup of acronyms they'll need to comply with. But they do need to have confidence that they can still use our tools to reach the people who want to buy what they're selling in a privacy-safe way. We're confident they can and that they can continue to get great results as digital advertising evolves.</blockquote>Wehner said that he believes the impact to Facebook's \"own business\" will be manageable, and that the company's goal is to maintain and improve ad performance with less data. He also took the opportunity to criticize Apple's platform, and said that Facebook is also facing problems from Apple's private APIs that advantage Apple's own products and services.<blockquote>Overall, the impact of these specific ‌iOS 14‌ changes are one element of some of the challenges with Apple, but we think the impact of the Apple approach is really much bigger than this particular update. Apple has a number of private APIs on hardware and software that advantage their own products and services in ways that are challenging. We face that issue in places like our messaging products, and even with the hardware products we're launching. So we generally don't think this closed approach is the best one for the industry from an innovation perspective.</blockquote>Prior to the enforcement of App Tracking Transparency, Facebook launched a campaign attempting to position Apple as an <a href=\"https://www.facebook.com/business/apple-ios-14-speak-up-for-small-business\">enemy of small businesses</a>, going as far to take out <a href=\"https://www.macrumors.com/2020/12/16/facebook-takes-out-full-page-ads-to-attack-apple/\">full page newspaper ads</a> decrying the new feature. \"Apple's latest update threatens the personalized ads that millions of small businesses rely on to find and reach customers,\" reads Facebook's site encouraging small businesses to \"add their voice\" and speak out against ATT.\r\n<br />\r\n\r\n<br />\r\nThere had been questions about Facebook's narrative and how much of an impact the changes <a href=\"https://www.macrumors.com/2021/03/11/facebook-employees-app-tracking-transparency/\">would actually have</a> on small businesses, and even <a href=\"https://www.macrumors.com/2020/12/23/facebook-employees-criticize-apple-campaign/\">Facebook employees</a> felt that Facebook was just using a sympathetic message to \"justify doing a bad thing.\"\r\n<br />\r\n\r\n<br />\r\nFacebook CEO Mark Zuckerberg in March began downplaying the potential impact of App Tracking Transparency and said that the changes could ultimately benefit Facebook if Apple's new policies encourage businesses to <a href=\"https://www.macrumors.com/2021/03/18/zuckerberg-anti-tracking-benefit-facebook/\">advertise and sell</a> exclusively through Facebook platforms.\r\n<br />\r\n\r\n<br />\r\nFacebook has already begun rolling out its App Tracking Transparency prompt to Facebook users, but the rollout will take a few weeks, so not everyone will see the prompt at the current time.<div>Tag: <a href=\"https://www.macrumors.com/guide/facebook/\">Facebook</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/28/facebook-att-impact-manageable/\">Facebook Says Impact of iOS 14.5's App Tracking Transparency Will Be 'Manageable'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/facebook-says-impact-of-ios-14-5s-app-tracking-transparency-will-be-manageable.2293797/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ybi1FRZLZGc:mXXsEzYbwoQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ybi1FRZLZGc:mXXsEzYbwoQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ybi1FRZLZGc\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0c67418b9a9897b09693610980ac85b417f31a4b0f962123a1995c864abcb815","category":"Apple"}