{"title":"Wout van Aert swapped mud for snow, and still no one could come close","link":"https://cyclingtips.com/2021/12/wout-van-aert-swapped-mud-for-snow-and-still-no-one-could-come-close/","date":1639321290000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/GettyImages-1358587186-650x433.jpg\" /></div><h2>Wout van Aert swapped mud for snow, and still no one could come close</h2><p>\n</p><p>Wout van Aert (Jumbo-Visma) took his second dominant victory in as many days at World Cup Val di Sole, adding ‘snowcross’ to his long list of talents.</p>\n\n\n\n<p>The CX World Cup returned with a first-of-its-kind event in the snow-covered mountain resort of Val di Sole, part of an effort to show that cyclocross could become a winter Olympic discipline. </p>\n\n\n\n<p>There were long straights, steep corners, a lot of running sections, and snow – lots and lots of snow. What’s more, while the <a href=\"https://cyclingtips.com/2021/12/fem-van-empel-takes-a-spectacular-victory-in-snow-covered-val-di-sole/\">women’s race</a> was partially lit by a weak sun that was beginning to duck behind the mountains, a cold and flat light lay over the men’s race, making it particularly hard to pick through the tricky all-white terrain.</p>\n\n\n\n<p>The sprint off the start line was as fast as ever, and Michael Vanthourenhout (Pauwels Sauzen-Bingoal) won the battle to hit the snow first. His teammate and World Cup-leader Eli Iserbyt was also up there, while Van Aert fought his way up through the top ten, held up only by his lowly starting position.</p>\n\n\n\n<p>Vanthourenhout rode a blistering first lap, but the looming presence of Van Aert was gaining all the while, and the blow was finally dealt a minute or two into the second lap.</p>\n\n\n\n<p>The pressure of Vanthourenhout meant that the Belgian national champion couldn’t quite create the lead he enjoyed at <a href=\"https://cyclingtips.com/2021/12/van-aert-obliterates-the-field-in-his-first-cyclocross-race-of-the-season/\">his first race of the season</a>, but even so, all Van Aert had to do was ride the 45 minutes or so that separated him from the finish line without making too many mistakes.</p>\n\n\n\n<p>Van Aert’s ride to victory wasn’t without contact with the white stuff, but his advantage was unassailable. Vanthourenhout was best of the rest, crossing the line within a minute of his fellow Belgian, while Tom Pidcock (Ineos Grenadiers) beat Iserbyt in the hard-fought battle for third.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/GettyImages-1358600436-1340x893.jpg\" /><figcaption>A lone Van Aert on his way to victory in Val di Sole, as the three riders fighting for third shlep their bikes up the slope over a minute behind.</figcaption></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/12/wout-van-aert-swapped-mud-for-snow-and-still-no-one-could-come-close/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0c86d3f48a7254e2e9aa99a1f480052db4d2ffe58ce0d6140098456e26523861","category":"Cycling"}