{"title":"Postnatal maternal care moderates the effects of prenatal bisphenol exposure on offspring neurodevelopmental, behavioral, and transcriptomic outcomes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305256","date":1718114400000,"content":"<p>by Samantha C. Lauby, Hannah E. Lapp, Melissa Salazar, Sofiia Semyrenko, Danyal Chauhan, Amy E. Margolis, Frances A. Champagne</p>\r\n\r\nBisphenols (BP), including BPA and “BPA-free” structural analogs, are commonly used plasticizers that are present in many plastics and are known endocrine disrupting chemicals. Prenatal exposure to BPA has been associated with negative neurodevelopmental and behavioral outcomes in children and in rodent models. Prenatal BPA exposure has also been shown to impair postnatal maternal care provisioning, which can also affect offspring neurodevelopment and behavior. However, there is limited knowledge regarding the biological effects of prenatal exposure to bisphenols other than BPA and the interplay between prenatal bisphenol exposure and postnatal maternal care on adult behavior. The purpose of the current study was to determine the interactive impact of prenatal bisphenol exposure and postnatal maternal care on neurodevelopment and behavior in rats. Our findings suggest that the effects of prenatal bisphenol exposure on eye-opening, adult attentional set shifting and anxiety-like behavior in the open field are dependent on maternal care in the first five days of life. Interestingly, maternal care might also attenuate the effects of prenatal bisphenol exposure on eye opening and adult attentional set shifting. Finally, transcriptomic profiles in male and female medial prefrontal cortex and amygdala suggest that the interactive effects of prenatal bisphenol exposure and postnatal maternal care converge on estrogen receptor signaling and are involved in biological processes related to gene expression and protein translation and synthesis. Overall, these findings indicate that postnatal maternal care plays a critical role in the expression of the effects of prenatal bisphenol exposure on neurodevelopment and adult behavior. Understanding the underlying biological mechanisms involved might allow us to identify potential avenues to mitigate the adverse effects of prenatal bisphenol exposure and improve health and well-being in human populations.","author":"Samantha C. Lauby","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0c9120f97b72cddab6abecf9f94e8957a00049f37ac63c26b166aff599037869","category":"Interdisciplinary"}