{"title":"Google’s language model “NotebookLM” app hits public testing","link":"https://arstechnica.com/?p=1953394","date":1689194946000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/02/google-office-800x533.jpg\" alt=\"The lobby of Google's new campus and office in Singapore.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/02/google-office.jpg\">Enlarge</a> <span>/</span> The lobby of Google's new campus and office in Singapore. (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google has a <a href=\"https://arstechnica.com/gadgets/2023/03/google-dusts-off-the-failed-google-playbook-to-fight-chatgpt/\">company-wide mandate</a> to pump out products that use a ChatGPT-style language model, and the latest is Google NotebookLM. This is Google's third notebook app, after <a href=\"https://arstechnica.com/uncategorized/2006/05/6841-2/\">Google Notebook</a> (2008-2012) and <a href=\"https://arstechnica.com/information-technology/2013/03/google-keep-is-live-and-ready-to-take-your-notes/\">Google Keep</a> (2013-). This was originally announced at Google I/O as \"Project Tailwind,\" but now it's hitting limited public testing. Google doesn't quite describe this as a finalized product, calling it \"an experimental offering from Google Labs.\"</p>\n<p>The \"LM\" in \"NotebookLM\" stands for \"language model,\" indicating this wants to apply ChatGPT-style smarts to your notes. It's hard to know exactly what Google is planning without access to it, but here's the full pitch:</p>\n<blockquote>\n<p>NotebookLM is an experimental product designed to use the power and promise of language models paired with your existing content to gain critical insights, faster. Think of it as a virtual research assistant that can summarize facts, explain complex ideas, and brainstorm new connections—all based on the sources you select.</p>\n<p>A key difference between NotebookLM and traditional AI chatbots is that NotebookLM lets you “ground” the language model in your notes and sources. Source-grounding effectively creates a personalized AI that’s versed in the information relevant to you. Starting today, you can ground NotebookLM in specific Google Docs that you choose, and we’ll be adding additional formats soon.</p>\n</blockquote>\n<p>\"Grounding\" is language model lingo that means the AI will scan a document of your choosing and will treat the information contained therein as more important than the rest of the information in its training set. Google says, \"While NotebookLM’s source-grounding does seem to reduce the risk of model 'hallucinations,' it’s always important to fact-check the AI’s responses against your original source material. When you're drawing on multiple sources, we make that fact-checking easy by accompanying each response with citations, showing you the most relevant original quotes from your sources.\"</p></div><p><a href=\"https://arstechnica.com/?p=1953394#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1953394&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0c917129e474066668afee7262680faa551545c74c3f023375df35c0f7eea70d","category":"Tech"}