{"title":"After months of competition complaints, Sony agrees to 10-year Call of Duty deal","link":"https://arstechnica.com/?p=1954258","date":1689598007000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/cod-800x469.jpg\" alt=\"Artist's conception of Microsoft marching toward a final Activision deal after mooting competition concerns from Sony and the FTC.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/cod.jpg\">Enlarge</a> <span>/</span> Artist's conception of Microsoft marching toward a final Activision deal after mooting competition concerns from Sony and the FTC. (credit: Activision)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Sony and Microsoft signed a binding agreement over the weekend ensuring that Call of Duty will remain on PlayStation for at least 10 years after Microsoft's proposed purchase of Activision is complete. The agreement, which Sony had resisted signing for months, effectively ends a bitter battle between the two console giants over the alleged anti-competitive effects of Microsoft's $69 billion Activision purchase, which was first proposed <a href=\"https://arstechnica.com/gaming/2022/01/microsoft-set-to-purchase-activision-blizzard-in-68-7-billion-deal/\">in January 2022</a>.</p>\n<p>The new agreement also effectively moots one of the most significant arguments made by the Federal Trade Commission in its federal case to block the merger, which <a href=\"https://arstechnica.com/gaming/2023/07/judge-denies-ftc-injunction-improving-microsofts-activision-purchase-prospects/\">failed to earn an FTC-sought injunction last week</a>. And it's likely not a coincidence that the agreement with Sony was announced just one day after a federal appeals court denied <a href=\"https://arstechnica.com/gaming/2023/07/ftc-appeal-in-microsoft-activision-case-shows-us-regulator-isnt-giving-up-yet/\">the FTC's request for an appeal</a> over that injunction decision.</p>\n<p>The deal, as announced over the weekend <a href=\"https://twitter.com/XboxP3/status/1680578783718383616\">by Xbox Chief Phil Spencer</a> and <a href=\"https://twitter.com/BradSmi/status/1680579462369353730\">Microsoft Vice Chair and President Brad Smith</a>, doesn't seem to include a promise of PlayStation access to any of Activision Blizzard's other popular franchises (including Crash Bandicoot, Spyro, Overwatch, Diablo, and more). But the fate of Call of Duty has long been <em>the</em> major focus of both Sony and regulators. <a href=\"https://arstechnica.com/gaming/2023/06/major-sony-playstation-budget-figures-leaked-because-of-poor-sharpie-redactions/\">Court documents revealed</a> that Call of Duty alone is worth at least $800 million in annual revenue to Sony and that up to 20 million PlayStation owners spend a significant portion of their console playtime on the series (including 1 million PlayStation owners who literally play no other games on the system).</p></div><p><a href=\"https://arstechnica.com/?p=1954258#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1954258&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0c9575ab49cd110e916bcc11012f289c8485ca83c37452cea968829c658736b4","category":"Tech"}