{"title":"PSXII-21 How does the inclusion of dried distillers grains plus soluble affect short-chain fatty acid and methane production in feedlot diets?","link":"https://academic.oup.com/jas/article/102/Supplement_3/777/7757899?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The inclusion of the coproduct dry distillers grains plus soluble (DDGS) in the diet of finishing cattle can lead to changes in the nutritional profile of the diets, causing an increase in protein content and a reduction in starch. It is necessary to understand how changes in rumen substrates affect rumen metabolic activity, acids, and enteric methane (CH4) production. Five treatments were used, considering levels of DDGS inclusion in the dry matter (DM) of 1) 0 g/kg of DDGS, 2) 150 g/kg of DDGS, 3) 300 g/kg of DDGS, 4) 450 g/kg DDGS, or 5) 600 g/kg DDGS in finishing diets. The metabolism experiment was conducted with rumen-cannulated Nellore bulls (n = 20) with initial body weight (BW) of 401.8 ± 27.0 kg. The production of short-chain fatty acids (SCFA) and CH4 were determined using the ex-situ ruminal fermentation technique. Rumen content was manually collected from 0, 4, 8 and 12 h post-feeding. The liquid and solid fractions of rumen content were used in four 50 mL penicillin-type flasks per animal. Of the four flasks prepared, two are called “blank” and inactivated in boiling water to stop fermentation, and the other two (microrumen) are incubated in a thermostatic bath, simulating the conditions existing in the rumen of animals (presence of microorganisms, anaerobes, temperature of 39ºC, natural animal saliva, physiological pH) for 30 min. After 30 min, incubated flasks were also inactivated in boiling water to stop fermentation. Subsequently, measurements of the final products of rumen fermentation (SCFA and CH<sub>4</sub>) were carried out in each bottle. Total rumen emptying was performed to determine the rumen pool of DM. The data will be analyzed in the SAS software, the mean of the treatments will be compared using test of mean and orthogonal contrasts. The declared significance is <span>P</span> ≤ 0.05. The inclusion or levels of DDGS did not affect CH<sub>4</sub> production of gּ kg DM<sup>-1</sup>ּ d<sup>-1</sup> and gּ kg DM<sup>-1</sup>ּ d<sup>-1</sup> (<span>P</span> &gt; 0.05). There was an effect of the treatments on the production of propionate (gּ kg DM<sup>-1</sup>ּ d<sup>-1</sup>; <span>P</span> = 0.0448), with a decreasing linear effect (<span>P</span> = 0.0087) with the increase in the inclusion of DDGS in diet (0; 150; 300; 450; 600 g/kg of DDGS; means 137.20; 160.32; 117.60; 87.09; 91.52 gּ kg DM<sup>-1</sup>ּ d<sup>-1</sup> propionate, respectively). There was no effect of DDGS levels on the production of Acetate, Butyrate, or total SCFAs (gּ kg DM<sup>-1</sup>ּ d<sup>-1</sup>). In summary, DDGS inclusion affects rumen metabolic activity, decreasing propionate production, but does not affect the production of other SCFAs nor CH4 production.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0ca540307da0b2d0ff28607970a62d5a0288f7ba7c777676714b4d787f2978f1","category":"Environment"}