{"title":"Three-dimensional fruit growth analysis clarifies developmental mechanisms underlying complex shape diversity in persimmon fruit","link":"https://academic.oup.com/jxb/article/75/7/1919/7439721?rss=1","date":1700524800000,"content":"<span><div>Abstract</div>The determination of fruit size and shape are of considerable interest in horticulture and developmental biology. Fruit typically exhibits three-dimensional structures characterized by geometric features that are dependent on the genotype. Although minor developmental variations have been recognized, few studies have fully visualized and measured these variations throughout fruit growth. Here, a high-resolution 3D scanner was used to investigate the fruit development of 51 persimmon (<span>Diospyros kaki</span>) cultivars with various complex shapes. We obtained 2380 3D models that fully represented fruit appearance, and enabled precise and automated measurements of shape features throughout fruit development, including horizontal and vertical grooves, length-to-width ratio, and roundness. The 3D fruit model analysis identified key stages that determined the shape attributes at maturity. Typically, genetic diversity was found in vertical groove development, and these grooves could be filled by tissue expansion in the carpel fusion zone during fruit development. In addition, transcriptome analysis of fruit tissues from groove and non-groove tissues revealed gene co-expression networks that were highly associated with groove depth variation. The presence of <span>YABBY</span> homologs was most closely associated with groove depth and indicated the possibility that this pathway is a key molecular contributor to vertical groove depth variation. Overall, our results revealed deterministic patterns of complex shape traits in persimmon fruit and showed that different growth patterns among tissues are the main factor contributing to the shape of both vertical and horizontal grooves.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"0caf2b5f977028c2e3c91f38e1c17dc558175ef56180307acd7bf9edf47bff43","category":"Environment"}