{"title":"Mobile Government Use and Crisis Management: The Moderating Role of Techno-Skepticism","link":"https://www.preprints.org/manuscript/202405.0921/v1","date":1715660947000,"content":"Providing user confidence in Mobile Government Services (MGS) is essential for the success of mobile government. This study aimed to test the moderating role of techno-skepticism in the impact of crisis management on mobile government. Some scholars have stated that government investment in mobile government services for public administration during the financial crisis is a critical issue for crisis management. In the constantly evolving and changing world, the rapid advancement of technology in modern societies has prompted an acceleration in investments in information and communication technologies. However, due to several inadequacies, citizens seem to respond negatively to the use of certain public technological services, leading them to develop a perspective of techno-skepticism. This issue has been cited in numerous scholarly studies as a critical subject for the effective implementation of technological innovations. The effectiveness of digital technology in the procurement of public services is highly dependent on the perceptions and behaviors of users. In this context, this study measured the attitudes of the participants and the connections between techno-skepticism, mobile government use, and crisis management among Northern Cyprus residents over 18 years old. The study employed a quantitative approach. A 5-point Likert scale was used to collect data by modifying the survey questions to fit the scope of the study. The study participants were selected using the random sampling method to acquire data from a total of 402 citizens. The study findings revealed that techno-skepticism mediates the impact of crisis management on mobile government. As a result, techno-skepticism is a critical and decisive factor in citizens’ mobile government use, affecting its utilization frequency. Techno-skepticism was also found to play a vital role in mobile government use. The current study represents a pioneering effort in testing the moderating role of techno-skepticism in the impact of crisis management on mobile government. It also provides various contributions to theory and practice, particularly in the fields of mobile government and the use of digital technologies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0cb140190a579f5d4a24c0d5c820536421a3bebfa7d76b30c98ca7ee7a9c5470","category":"Interdisciplinary"}