{"title":"Ford CEO Jim Farley Seems Very Happy That GM Is Dropping CarPlay","link":"https://www.wsj.com/video/ford-ceo-on-apple-google-and-elon-musk/B6D8BC45-1C4A-45D3-97AC-933A57B76E31.html","date":1683334742000,"content":"\n<p>Great 3-minute clip from Joanna Stern’s interview with Ford CEO Jim Farley at the WSJ’s Future of Everything Festival. She asks him about GM’s plan to drop CarPlay from their future EVs, and Farley starts by saying “Yeah, how about that?” and laughing.</p>\n\n<p>Farley says, “The interior has to be really well done. But in terms of content? We kind of lost that battle 10 years ago. So get real with it, because you’re not going to make a ton of money on content inside the vehicle. It’s going to be safety/security, partial autonomy, and productivity in our eyes. [...] 70 percent of our Ford customers in the U.S are Apple customers. Why would I go to an Apple customer and say ‘Good luck!’? That doesn’t seem customer centric.”</p>\n\n<p>Farley and Ford have it exactly right. New car buyers, even from mainstream brands like Ford, are overwhelmingly iPhone users — exactly <a href=\"https://www.theverge.com/2022/6/6/23156741/ios-16-carplay-apple-wwdc-hvac-deeper-integration\">as Apple bragged at WWDC last June</a>, and what iPhone users want in their cars is CarPlay. If anything, Farley is being kind to GM and GM CEO Mary Barra when he says their message to iPhone users is “Good luck” — it’s really more like “Fuck you.” And again, the most telling part of the whole exchange is the way Farley laughs at the start. You really have to hear it — his laugh implies a certain <em>I can’t believe our good fortune that GM is doing this.</em> It’s enough to make you think Mary Barra is a mole from Ford, planted to steer would-be Chevy buyers into Ford dealerships.</p>\n\n<p>If you’re asking how it can be that 70 percent of Ford’s customers are iPhone users when the iPhone has maybe just over 50 percent market share in the U.S., the key is <em>new</em> car buyers. The Android masses are buying used cars, either because they don’t have the budget for a new car or because they don’t care about buying nice things (or both). So even a non-luxury brand like Ford has an overwhelming majority of customers with iPhones.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/05/ford-ceo-jim-farley-carplay\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"0cb5af07adae4e2512f7fd7684c20b9ab145fb778b65d1a27bb376f36d88e1a5","category":"Tech"}