{"title":"How to use Terminal to securely erase free space on a Mac’s drive","link":"https://www.macworld.com/article/195806/erasefreespace.html","date":1632036300000,"content":"<div>\n<section><div></div></section><p>If you’re selling an old Mac, a spare hard drive, or you’re just quite paranoid about your deleted data, you’re either familiar with—or should be familiar with—the Erase Free Space button on the Erase tab in Disk Utility (found in your Applications -&gt; Utilities folder).</p>\n\n\n\n<p>When you click this button, you’re presented with three options for securely erasing the free space on your hard drive: write over the free space with zeros (fast and relatively safe), write over the free space three times (more secure, very slow), or write over the free space seven times (extremely slow).</p>\n\n\n\n<p>I use this feature whenever I sell an old machine. First I format the drive and install a fresh copy of macOS, then I use Disk Utility to erase the free space (typically the one-time write-with-zeros option). This gives me a good sense of security, as it would take a team of dedicated professionals, and possibly special hardware, to have some chance of recovering any of my deleted data—though I really only care about a few financial files, and those are kept on an encrypted disk image, so they’re probably safe anyway.</p>\n\n\n\n<h2>Use Terminal to securely erase a drive</h2>\n\n\n\n<p>What if you want to do this from Terminal instead? In Terminal, a program named <code>diskutil</code> provides most of the features of macOS’s Disk Utility.</p>\n\n\n\n<p>(Please note that, as with many Terminal commands, there’s a chance of Really Bad Things happening if you make a mistake with the following instructions. Proceed with caution, and make sure your backups are current before you try any of the following.)</p>\n\n\n\n<p>To find out about <code>diskutil</code> in detail, type <code>man diskutil</code> at the Terminal prompt. Within the <code>man</code> pages, you’ll find the explanation for how to securely erase a disk’s free space using <code>diskutil</code>:</p>\n\n\n\n<pre>secureErase [freespace] level device\n\nErase, using a \"secure\" (but see the NOTE below) method, either a whole-disk (including all of its partitions if partitioned), or, only the free space (not in use for files) on a currently-mounted volume.  Secure erasing makes it harder to recover data using \"file recovery\" software.\n\nErasing a whole-disk will leave it useless until it is partitioned again.  Erasing freespace on a volume will leave your files intact, indeed, from an end-user perspective, it will appear unchanged, with the exception that it will have attempted to make it impossible to recover deleted files.\n\nIf you need to erase all contents of a partition but not its hosting whole-disk, use the zeroDisk or randomDisk verbs.  Ownership of the affected disk is required.\n \nLevel should be one of the following:\n  o   0 - Single-pass zero fill erase.\n  o   1 - Single-pass random fill erase.\n  o   2 - Seven-pass erase, consisting of zero fills and all-ones fills plus a final random fill.\n  o   3 - Gutmann algorithm 35-pass erase.\n  o   4 - Three-pass erase, consisting of two random fills plus a final zero fill.\n \nNOTE: This kind of secure erase is no longer considered safe. Modern devices have wear-leveling, block-sparing, and possibly-persistent cache hardware, which cannot be completely erased by these commands. The modern solution for quickly and securely erasing your data is encryption. Strongly-encrypted data can be instantly \"erased\" by destroying (or losing) the key (password), because this renders your data irretrievable in practical terms.  Consider using APFS encryption (FileVault).</pre>\n\n\n\n<p>But how do you figure out what to list for <code>device</code>, which is the disk (or partition) that has the free space you’re trying to securely erase? <code>diskutil</code> can provide that information, too. Just use <code>diskutil list</code> to see a list of all drives and partitions. On the far right, you’ll see an <code>IDENTIFIER</code> column; that column contains the identifier that <code>diskutil</code> needs. Here’s an example of the <code>list</code> output on my machine:</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/terminal-erase-freespace.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>There’s just one last bit of information you need to know to erase the free space on a drive from the command line. In Unix, all devices appear as part of the file system tree, and in macOS, they’re all listed in the <code>/dev</code> directory. So if I want to use <code>diskutil</code> to erase the free space on my <code>Apple_HFS Untitled</code> volume on my external drive, using the single-pass method, the final command would look like this:</p>\n\n\n\n<p><code>diskutil secureErase freespace 1 /dev/disk2s1</code></p>\n\n\n\n<p><strong>Warning!</strong> It’s <em>critically important</em> that you include the <code>freespace</code> portion of that command. If you don’t, <code>diskutil</code> will happily start securely erasing the entire disk, instead of just the free space! Yes, that’s a Really Bad Thing, especially because it will be securely erased, meaning there’s no chance you’ll be able to recover the data.</p>\n</div>","author":"Rob Griffiths","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0cb7c7d656566388d3c1972509a5bf90c8af7e679d1392fa9efe9c5d281bc243","category":"Apple"}