{"title":"Identifying Geographic Inequities in Family Planning Service Uptake in Pakistan: A Comparative Study of PDHS 2006 to 2017 Using Cluster Hotspot Analysis","link":"https://www.preprints.org/manuscript/202407.0316/v1","date":1719989518000,"content":"Family planning (FP) services are crucial interventions for improving maternal and child health outcomes and promoting gender equity. However, ensuring equitable access to these services remains a significant challenge, particularly in countries like Pakistan, where sociocultural norms, economic disparities, and geographic barriers hinder FP uptake. This study utilized spatial analysis techniques, including hotspot analysis, to investigate geographic disparities in FP uptake in Pakistan using data from Pakistan Demographic and Health Surveys (PDHS) conducted between 2006 and 2017. ArcMap 10.1 was used for spatial analysis and Stata 12.0 for statistical analysis. Results revealed significant spatial variations in FP uptake, with urban areas generally exhibiting higher uptake rates than rural regions. Hotspot analysis identified dynamic changes in contraceptive prevalence rates (CPR), with significant clustering in some regions and dispersion in others. It also identified areas with high unmet need and their low intention to use FP services and preference for family size (&amp;gt;3 children), highlighting the need for targeted behavioral change interventions. This innovative spatial approach provides nuanced insights for policymakers and program planners to develop targeted interventions based on localized data to improve FP service delivery, mitigate disparities, and ultimately advance efforts to improve maternal and child health outcomes. The application of geospatial analysis is an effective tool for enhancing program planning, evaluation, and resource allocation in diverse geographical contexts.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0cbb0bc0b33b043d316f6c0c86c2206ba58dba8fac406c6a46b0a0b849d71f59","category":"Interdisciplinary"}