{"title":"Air‐sea carbon dioxide equilibrium: Will it be possible to use seaweeds for carbon removal offsets?","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13405?af=R","date":1708105134000,"content":"<h2>Abstract</h2>\n<p>To limit global warming below 2°C by 2100, we must drastically reduce greenhouse gas emissions and additionally remove ~100–900 Gt CO<sub>2</sub> from the atmosphere (carbon dioxide removal, CDR) to compensate for unavoidable emissions. Seaweeds (marine macroalgae) naturally grow in coastal regions worldwide where they are crucial for primary production and carbon cycling. They are being considered as a biological method for CDR and for use in carbon trading schemes as offsets. To use seaweeds in carbon trading schemes requires verification that seaweed photosynthesis that fixes CO<sub>2</sub> into organic carbon results in CDR, along with the safe and secure storage of the carbon removed from the atmosphere for more than 100 years (sequestration). There is much ongoing research into the magnitude of seaweed carbon storage pools (e.g., as living biomass and as particulate and dissolved organic carbon in sediments and the deep ocean), but these pools do not equate to CDR unless the amount of CO<sub>2</sub> removed from the atmosphere as a result of seaweed primary production can be quantified and verified. The draw-down of atmospheric CO<sub>2</sub> into seawater is via air-sea CO<sub>2</sub> equilibrium, which operates on time scales of weeks to years depending upon the ecosystem considered. Here, we explain why quantifying air-sea CO<sub>2</sub> equilibrium and linking this process to seaweed carbon storage pools is the critical step needed to verify CDR by discrete seaweed beds and nearshore and open ocean aquaculture systems prior to their use in carbon trading.</p>","author":"C. L. Hurd, \nJ.‐P. Gattuso, \nP. W. Boyd","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"0cbda3e8107a4f969f9341e372d26e302b36529f0f1736e9a618311678b17fc4","category":"Environment"}