{"title":"PSVI-18 Low and high feed efficiency grower-finisher pigs fed three different levels of dietary crude protein showed no immediate difference in blood metabolomics profile","link":"https://academic.oup.com/jas/article/102/Supplement_2/320/7664975?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Improving feed efficiency (FE) of grower-finisher pigs is of great importance considering its impact on production economy, nutrient excretions as well as carbon-footprint. The biological background describing variation in FE between pen mates, is difficult to establish as feed intake (FI) and FE are not estimated on an individual level. In this study advanced feeding stations were used to estimate FI and further calculate feed conversion ratio (FCR) on individual level. The study aimed to investigate the possible difference in the blood metabolic profile between low and high FE grower-finisher pigs fed three different levels of dietary crude protein (CP). The study included 60 newly weaned gilts divided in two series, housed as 10 pigs/pen. The 30 pigs per series were distributed between three pens (10 pigs/pen) and were balanced by body weight and litter. Throughout the entire weaner period all pigs had ad libitum access to the same diet. Pigs were redistributed among the grower-finisher pens to balance FCR levels between dietary treatments (CP levels) and to reduce any carry over effect from the weaner to the grower-finisher pens. From 30-115 kg body weight (BW), pigs were fed either a low (L; 14.8% CP), standard (15.2% CP) or high (H; 15.8% CP) CP diet equal in energy, where BW, average weekly gain (AWG), and FCR were determined on weekly basis, while FI was estimated on daily basis. Three low FE (20% least) and three high FE (20% greatest) pigs were selected based on the final 4 wk of growth within station and CP level. On the final day of the experimental period all low-FE and high-FE pigs within each dietary treatment were euthanized and blood plasma was sampled and subjected to a nontargeted LC-MS metabolomics analysis. Growth performance and metabolite data were, respectively, analyzed in R and MetaboAnalyst 5.0 with FE and CP as fixed effects. High-FE and H-CP pigs continuously displayed numerically greater BW, while AWG and FCR were, respectively, numerically greater, and less in L-CP than H-CP group during last 2 wk of the experimental period. Principal Component Analysis (PCA) showed no grouping (<span>P</span> &gt; 0.05) of metabolites and no specific pattern of the metabolic profile from either the two FE categories or the three dietary CP levels. Furthermore, no correlation (<span>P</span> &gt;0.05) of metabolites to any other observation was found, and only little variation, measured by distance to model showing deviation of each pig to overall model, was observed. In conclusion, at first glance the metabolomics profile did not appear to present any specific pattern between low and high feed efficiency grower-finisher pigs or between pigs exposed to different levels of dietary CP in the grower finisher period.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0cc0bbadba25c4d99a717ac05c7ab3ee2d8e02f066a7d2acf9b278f4d9d6ceee","category":"Environment"}