{"title":"Real-World Effectiveness, Persistence, Adherence, and Safety of Janus Kinase Inhibitor Baricitinib in Rheumatoid Arthritis: A Long-Term Study","link":"https://www.preprints.org/manuscript/202403.1760/v1","date":1711618228000,"content":"Background/Aim: Baricitinib (BAR) is the first oral selective Janus kinase inhibitor approved in Europe for rheumatoid arthritis (RA). Real-world data are still needed to clarify its long-term benefit/risk profile. This study aimed to evaluate the effectiveness, persistence, adherence, and safety of BAR in a real-world setting. Methods: An ambispective study was conducted between October 2017 and December 2021 in RA patients starting BAR. Effectiveness was evaluated by change from baseline in the Disease Activity Score using 28-joint counts-C reactive protein (DAS28CRP), and achievement of low disease activity/remission. Drug persistence was evaluated by Kaplan-Meier analysis. Adherence was estimated by medication possession ratio (MPR) and the 5-item Compliance Questionnaire for Rheumatology. Safety was assessed by global incidence proportion and adjusted incidence rates of adverse events. Results: 61/64 recruited patients were finally analyzed, 83.6% female, 78.7% seropositive, mean age of 58.1 (15.4) years, and disease duration of 13.9 (8.3) years. 32.8% were naïve to biologics and 16.4% received BAR on monotherapy. After a median exposure to BAR of 12.4 (6.6-31.2) months (range 3.1-51.4), a significant change in DAS28CRP was observed (difference -1.2, p=0.000). A total of 70.5% and 60.7% patients achieved low disease activity or remission, respectively and 50.8% (31/61) patients remained on BAR during follow-up with a median persistence of 31.2 (9.3-53.1) months. The average MPR was 0.96 (0.08) and all patients were “good adherents” by questionnaire. 21.3% patients discontinued baricitinib due to toxicity. Conclusion: In our real-world practice, BAR demonstrated effectiveness, large persistence, high adherence to treatment and acceptable safety profile.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0cc308a9b6974ba06080bda740cf430246c66f0c626552d2a07a72e0e78a350b","category":"Interdisciplinary"}