{"title":"Forage Soybean: Unveiling Its Potential in the Wheat-Based Rainfed Cropping Systems","link":"https://www.preprints.org/manuscript/202405.1472/v1","date":1716425754000,"content":"The Midwestern region of the United States has been experiencing periodic forage shortages due to frequent droughts, a growing livestock population, and reliance on traditional farming practices. This study evaluated the dry matter yield (DMY), forage nutritive value, water use efficiency (WUE), and economic viability of forage soybean [Glycine max (L.) Merr.] in a no-till winter wheat-based rainfed cropping system in the Midwest, USA. The research aimed to identify alternative summer forage crops that are drought-resilient, require lower inputs, mitigate seasonal gaps, and provide higher DMY and forage nutritive value compared to traditional forages. A four-year field experiment in a randomized complete block design with four replications assessed these parameters at various growth stages and planting dates. Results showed that forage soybean had a high DMY (~13 Mg ha-1), especially when optimally planted and harvested at the R3 stage. Forage nutritive value, including crude protein (CP), in vitro dry matter digestibility (IVDMD), and relative feed value (RFV), was highest at early vegetative stages (V2-V3), meeting livestock nutritional requirements. Forage soybean also demonstrated good WUE (21 kg ha-1 mm-1), making it suitable for water-limited regions. Economic analysis indicated substantial net profits ($322 per hectare), confirming its economic viability. The study concludes that forage soybean is a promising summer forage option for Midwest growers, offering high-quality forage, efficient water use, and economic benefits. Further research, particularly animal feeding trials, is recommended to validate its potential for widespread adoption in cropping systems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0cde88baa7cc76252599722bc40db3b52c2cb1e2ac4657c123673e3392d4a460","category":"Interdisciplinary"}