{"title":"Enhancing Radiologist Efficiency with AI: A Multi-Reader Multi-Case Study on Aortic Dissection Detection and Prioritisation","link":"https://www.preprints.org/manuscript/202410.1263/v1","date":1729071492000,"content":"Background and Objectives: Acute aortic dissection (AD) is a life-threatening condition and early detection can significantly improve patient outcomes and survival. This study evaluates the clinical benefits of integrating a deep-learning (DL)-based application for automated detection and prioritisation of AD on chest CT angiographies (CTAs), focusing on the reduction of scan-to-assessment (STAT) and interpretation times (IT). Materials and Methods: This retrospective Multi-Reader, Multi-Case (MRMC) study compared AD detection with and without artificial intelligence-(AI) assistance. Ground truth was established by two U.S. board-certified radiologists, while three additional expert radiologists participated as readers. All participants assessed the same CTAs without AI-assistance (pre-AI arm) and, after a 1-month washout period, with the help of the device outputs (post-AI arm). STAT and IT were compared between the two phases. Results: The study included 285 CTAs (95 per reader, per arm), with a mean patient age of 58.5 years ±14.7(SD), 52% men, 37% prevalence. AI assistance significantly reduced STAT for detecting 33 true positive AD cases, from 15.84 minutes (95% CI: 13.37–18.31min) without AI to 5.07 minutes (95% CI: 4.23–5.91min) with AI, a 68% reduction (p&lt;0.01). IT also decreased significantly, from 21.22 seconds (95% CI: 19.87–22.58s) without AI to 14.17 seconds (95% CI: 13.39–14.95s) with AI (p&lt;0.05). Conclusions: Integrating a DL-based algorithm for AD detection on chest CTAs significantly reduces both STAT and IT. By prioritising the most urgent cases, AI ensures faster diagnosis and improves the workflow efficiency in clinical radiology practice, compared to standard First-In First-Out (FIFO) workflow.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0cdf1416181be9ff71bc93f4f071280a69e9d1a9f6b7d55247b1f601aa7cd8ae","category":"Interdisciplinary"}