{"title":"Oppo’s Find N3 Flip fashion phone is ready for its close-up","link":"https://arstechnica.com/?p=1963982","date":1693330165000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/12-980x668.jpg\" alt /></div>\n          <p>\n            The Oppo Find N3 Flip, with its bigger camera bump and rounded-over corners.                           [credit:\n                              Oppo                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Oppo's newest flip phone is the<a href=\"https://www.oppo.com/cn/smartphones/series-find-n/find-n3-flip/\"> Oppo Find N3 Flip</a>, a 6,799 yuan (~$932) foldable debuting in China but heading to the rest of the world soon. The Find N3 Flip will be taking on the likes of the <a href=\"https://arstechnica.com/gadgets/2023/07/samsung-makes-the-galaxy-z-fold-5-and-z-flip-5-official/\">Samsung Galaxy Z Flip 5</a> and <a href=\"https://arstechnica.com/gadgets/2023/05/rumor-roundup-motorolas-2023-razr-foldable-packs-a-huge-front-display/\">Motorola Razr</a>, and while both of those phones have tried to power up with a big front screen, the N3 Flip's front display is basically the same size <a href=\"https://arstechnica.com/gadgets/2022/12/oppos-foldable-phones-take-on-samsung-with-a-flip-phone-and-a-tablet/\">as last year</a>. Oppo is making up for that with a pretty big spec sheet, though.</p>\n<p>This is a normal-size phone, with a 6.8-inch, 2520×1080, 120 Hz inner OLED display, and the whole thing folds in half, becoming a smaller, 16.45-mm-thick square. When closed up, you can casually poke around on the tiny 3.26-inch front screen. The fun bit of this design is that the front 720×382, 60 Hz OLED looks just like a mini phone, and you'll have a few proprietary mini apps to play with, like a media player, a notification view, a weather app, a fitness app, plus a few more. The front screen is not as big as Oppo's competitors because you'll be getting a big, round camera bump, featuring three sensors, a 50 MP main camera, 48 MP ultra-wide, and a 32 MP 2x telephoto camera.</p>\n<p>The SoC is a Mediatek Dimensity 9200, which means it features a 4 nm SoC with one 3.05 GHz Arm Cortex X3 core, three 2.85 GHz Cortex A715 cores, and four Cortex A510 cores, plus an Arm Mali-G715 Immortalis MP11 GPU. It also comes with 12GB of RAM, 256GB or 512GB of UFS 4.0 storage, a side-fingerprint reader, Wi-Fi 7 support, and NFC.</p></div><p><a href=\"https://arstechnica.com/?p=1963982#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1963982&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0ce84dad6bc12af7bb03d5e8a16642418b9b8c4f5bbebbe319cd547e1157b6f9","category":"Tech"}