{"title":"Predictors of self-care in patients with cancer treated with oral anticancer agents: A systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307838","date":1727186400000,"content":"<p>by Silvia Ucciero, Federica Lacarbonara, Angela Durante, Francesco Torino, Izabella Uchmanowicz, Ercole Vellone, Marco Di Nitto</p>\r\nBackground <p>In the last two decades, the use of oral anticancer agents (OAAs) has increased in cancer patients. Despite this, patients and their caregivers face some challenging issues (side effects, drug-to-drug interactions, etc.) related to OAA administration. The three dimensions of self-care by Riegel et al., self-care maintenance (i.e., stability of patient condition), self-care monitoring (i.e., detection of side effects), and self-care management (i.e., management of side effects), may be implemented to avoid negative outcomes. However, knowledge of self-care determinants is necessary to recognise people at risk of poor self-care behaviours.</p> Aims <p>Determine which are the predictors of self-care maintenance, self-care monitoring and self-care management in patients with cancer taking OAA.</p> Methods <p>A systematic review with narrative synthesis was conducted. We included studies on adult patients with cancer using any kind of oral anticancer agent and describing a predictor of self-care. The search was performed on PubMed, CINAHL/PsycINFO, and Web of Science.</p> Results <p>Of 3,061 records, 45 studies were included in this review. Forty-six predictors organised into 14 categories were identified. In general, all studies focused only on adherence, considered as a self-care maintenance component, and none of them focused on other dimensions of self-care. The predictors of OAA adherence most reported were age, side effects, and socioeconomic factors (e.g., insurance status, and annual income).</p> Conclusions <p>This systematic review highlighted the literature gap on the analysis of determinants of self-care behaviours in patients taking OAAs. This element could be a starting point for future research that can provide elements to support the oncology nursing research agenda, aimed at recognising patients at risk of poor self-care.</p>","author":"Silvia Ucciero","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0cf3112d6e83eee476ed5a17648dc332a6bbd2a6bf496d634d6a05dccd162a2a","category":"Interdisciplinary"}