{"title":"Comparative analyses of the information content of letters, characters, and inter‐word spaces across writing systems","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15178?af=R","date":1721138454000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/fe4f2077-a9fd-4210-baa1-86c66023ef7f/nyas15178-gra-0001-m.png\" alt=\"Comparative analyses of the information content of letters, characters, and inter-word spaces across writing systems\" />\n<p>The different methods for marking word boundaries that have been adopted by various writing systems are not arbitrary but are instead co-determined by other orthographic properties of the writing systems and have been adopted to increase reading efficiency. \n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>One difference among writing systems is how orthographic cues are used to demarcate words; although most alphabetic scripts use inter-word spaces, some Asian scripts do not explicitly mark word boundaries (e.g., Chinese). It is unclear whether these differences are arbitrary or whether they are designed to maximize reading efficiency. Here, we show that spaces inserted between words in non-demarcated scripts provide less information about word boundaries than spaces in demarcated scripts. Furthermore, despite the fact that less information is contained by inter-word spaces than characters/letters of the same size, the information content of inter-word spaces in demarcated scripts is closer to that of characters/letters compared to the information content of inter-word spaces that are inserted in non-demarcated scripts. These results suggest that the conventions used to demarcate word boundaries are sufficient to support efficient reading. Our findings provide new insights into the universals and variation across writing systems and shed light on the mental processes that support skilled reading.</p>","author":"Linjieqiong Huang, \nErik D. Reichle, \nXingshan Li","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"0cfabba71a63a8be4b1f7fc59283d99576e43149c876c20f42588df583ca512a","category":"Environment"}