{"title":"If you break your new iPhone 15 Pro, it’ll be a lot cheaper to fix it now","link":"https://www.macworld.com/article/2072703/apple-slashes-cost-iphone-back-glass-repairs.html","date":1695044095000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It might feel like Apple’s products get more expensive with each passing year, but one thing at least has plunged in cost: the fee the company charges for repairing an iPhone’s broken back panel. While no references were made to this fact during the Wonderlust keynote last week, Apple’s site has been updated to reflect the cost is roughly a third of the equivalent for the iPhone 14 Pro.</p>\n\n\n\n<p>We should quickly note that this isn’t solely a charitable gesture from the world’s richest company. Rather, the price drop reflects a change in the way recent iPhones have been designed. In 2022, Apple rolled out a new design for the iPhone 14 and 14 Plus which made them <a href=\"https://www.macworld.com/article/1070547/iphone-14-ifixit-teardown-redesign-repairability.html\">far easier to repair</a>. Essentially, whereas some phones open from the front, which makes it difficult to access the battery, and others open from the back, which is awkward if you want to replace the screen, the 14 and 14 Plus open from either direction.</p>\n\n\n\n<p>This change, which iFixit described as “the most significant design change to the iPhone in a long time,” resulted in an immediate reduction in relevant repair fees. Whereas Apple currently asks $349/£369 to repair an iPhone 13 with back glass damage, it charges just $169/£169 for the same repair on an iPhone 14.</p>\n\n\n\n<p>The design change, however, did not apply to that year’s Pro models, and they consequently did not get a corresponding cut in repair bills. Apple charges $449/£459 to replace the back glass of an iPhone 13 Pro, and slightly more ($499/£519) for an iPhone 14 Pro. Unusually, the Pro line had to wait an extra year to get an upgrade which had already landed on the standard models, but <a href=\"https://www.macworld.com/article/2013337/iphone-15-pro-easier-repair-new-report.html\">as rumored</a>, the iPhone 15 Pro models caught up this year.</p>\n\n\n\n<p>This was confirmed this weekend, when <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/ianzelbo/status/1703439723400667246&amp;xcust=1-1-2072703-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Ian Zelbo</a> noticed that the estimated price given on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/iphone/repair&amp;xcust=1-1-2072703-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Apple’s support website</a> for repairing/replacing the back glass on an iPhone 15 Pro is just $169, down from $499 on the 14 Pro. (The price in the U.K. has gone down even more sharply, from £519 to £169.) The price for repairs if you’ve got AppleCare+, however, is unchanged, at an essentially nominal $29/£25 for every iPhone model we checked.</p>\n\n\n\n<h3>Back glass damage cost estimate (as of 18 September 2023):</h3>\n\n\n\n<ul>\n<li>iPhone 13: $349/£369</li>\n\n\n\n<li>iPhone 13 Pro: $449/£459</li>\n\n\n\n<li>iPhone 14: $169/£169</li>\n\n\n\n<li>iPhone 14 Pro: $499/£519</li>\n\n\n\n<li>iPhone 15: $169/£169</li>\n\n\n\n<li>iPhone 15 Pro: $169/£169</li>\n</ul>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0d118323ed21a380b377d038ea00e0b988fc500a0de4d0779fe8790030d0ebf4","category":"Apple"}