{"title":"Liveblog—All the fun stuff from Apple’s “Unleashed” event","link":"https://arstechnica.com/?p=1804900","date":1634575215000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/apple-event-oct21-800x775.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/apple-event-oct21.jpg\">Enlarge</a> <span>/</span> This is happening. (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><a href=\"https://live.arstechnica.com/apple-october-18-unleashed-event/\" target=\"_blank\">View Liveblog</a></div>\n<p>We've rounded the bend in 2021 to October, and you know what that means: it's time for a second fall Apple event! Last month, we got <a href=\"https://arstechnica.com/gadgets/2021/09/liveblog-all-the-news-from-apples-california-streaming-event/\">new portables</a>—new watches, new iPhones, new iPads—but folks eager for more Apple Silicon-powered Macs were left wanting. If that was you last month, then take heart: Today's event might be more your speed.</p>\n<p>While we can never predict with full accuracy everything that Apple will reveal—the company prefers to hold its PR cards annoyingly close to the chest—there have been <a href=\"https://arstechnica.com/gadgets/2021/10/what-to-expect-from-apples-mac-focused-october-18th-event/\">some solid clues and leaks</a>. We believe we'll see some redesigned MacBooks of the 13- and 16-inch variety, and we're pretty sure those new MacBooks will be powered by a fancy new version of Apple's in-house SoC. That new SoC will probably be called the \"M1X,\" according to the rumor mill, and we expect it to contain more cores and more on-board RAM than the M1 SoC that can be found in current-generation MacBooks and Mac minis.</p>\n<p>Speaking of minis, they're also on the \"maybe\" list—there's a chance we might end up seeing an M1X mini, which would give the small desktop a pretty big punch. If M1X-powered minis do make an appearance, it will mark the next step in Apple pushing Apple Silicon out to all its computing products. The company had previously noted in 2020 that this rollout process was expected to take two years, and we're approaching the halfway point.</p></div><p><a href=\"https://arstechnica.com/?p=1804900#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1804900&amp;comments=1\">Comments</a></p>","author":"Lee Hutchinson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0d1d4e3b4905de664dc74560cee551901458a27e679324fc6b2cf400d323ec1b","category":"Tech"}