{"title":"Impacts of cyanobacterial metabolites on fish: Socioeconomic and environmental considerations","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12891?af=R","date":1718694827000,"content":"<h2>Abstract</h2>\n<p>The increasing global population has led to rising demand for food, particularly protein. As an excellent source of protein, fish play a crucial role in meeting this demand, making aquaculture a highly impactful industry. Floating cages have been developed as a method of fish management and production to achieve high productivity and volume. However, these intensive fish farming practices can contribute to eutrophication, leading to changes in primary producers and promoting the excessive proliferation of cyanobacteria. Cyanobacteria blooms pose significant consequences to aquatic ecosystems, including potential risks to fish exposed to harmful cyanobacterial metabolites. Cyanobacterial metabolites encompass various chemical classes, such as terpenoids, carotenoids, alkaloids, cyanopeptides, amino acids, organophosphates, macrolides, and lipopolysaccharides. Some of these compounds' toxicity and impact on fish farms still need to be better understood. Cyanotoxins and off-flavour compounds in fish farms can pose risks to water and fish quality and potential health hazards for humans throughout the food chain. Therefore, cyanobacteria in fish farms can have significant economic, environmental, and public health implications. This review examines the concerns associated with cyanobacterial natural products in fish farming, including off-flavours, known cyanotoxins, and other potentially toxic compounds, while exploring their socioeconomic and environmental risks.</p>","author":"Éryka Costa de Almeida, \nLarissa Souza Passos, \nPaloma Nathane Nunes de Freitas, \nAlexander Ossanes de Souza, \nErnani Pinto","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"0d1f04dcb51dc3dfd23d4eaa79fa1513c7294ac9f8485881dac45cce94c444ee","category":"Environment"}