{"title":"Defining a malaria diagnostic pathway from innovation to adoption: Stakeholder perspectives on data and evidence gaps","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002957","date":1715868000000,"content":"<p>by Bryony Simmons, Elisa Sicuri, Jane Carter, Asrat Hailu, Francois Kiemde, Petra Mens, Davis Mumbengegwi, Bakri Nour, René Paulussen, Henk Schallig, Halidou Tinto, Norbert van Dijk, Lesong Conteh</p>\r\n\r\nMalaria, a major global health concern, requires effective diagnostic tools for patient care, disease control, and elimination. The pathway from concept to the adoption of diagnostic products is complex, involving multiple steps and stakeholders. To map this process, our study introduces a malaria-specific diagnostic pathway, synthesising existing frameworks with expert insights. Comprising six major stages and 31 related activities, the pathway retains the core stages from existing frameworks and integrates essential malaria diagnostic activities, such as WHO prequalification processes, global stakeholder involvement, and broader health systems considerations. To understand the scope and availability of evidence guiding the activities along this pathway, we conducted an online survey with 113 participants from various stages of the malaria diagnostic pathway. The survey assessed perceptions on four critical attributes of evidence: clear requirements, alignment with user needs, accuracy and reliability, and public and free availability. It also explored the types of evidence used and the challenges and potential solutions related to evidence generation and use. Respondents reported using a broad range of formal and informal data sources. Findings indicated differing levels of agreement on the attributes across pathway stages, with notable challenges in the <i>Approvals and Manufacturing</i> stage and consistent concerns regarding the public availability of data/evidence. The study offers valuable insights for optimising evidence generation and utilisation across the malaria diagnostic pathway. It highlights the need for enhanced stakeholder collaboration, improved data availability, and increased funding to support effective evidence generation, sharing, and use. We propose actionable solutions, including the use of public data repositories, progressive data sharing policies, open-access publishing, capacity-building initiatives, stakeholder engagement forums, and innovative funding solutions. The developed framework and study insights have broader applications, offering a model adaptable for other diseases, particularly for neglected tropical diseases, which face similar diagnostic challenges.","author":"Bryony Simmons","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"0d2cbbdfabe28ca95ab2f433f42488ee0fd00c661541f4bfc89508348ea11a0b","category":"Environment"}