{"title":"Tour de France jersey colours and classifications: what do the yellow, green, polka dot and white jerseys mean?","link":"https://www.bikeradar.com/features/tour-de-france-jersey-colours/","date":1624377600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/09/GettyImages-1228622398-0fc52c7.jpg?quality=45&amp;resize=620,413\" />                                            <p><span>To a first-time viewer, the <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> can be a minefield. It’s not just as simple as the first rider across the finish line in Paris. How can a rider win multiple stages and not wear the yellow jersey? What is that polka dot jersey about? And what’s with <a href=\"https://www.bikeradar.com/features/tour-de-france-jargon-buster/\" target=\"_blank\">all the unfamiliar words</a> they use?</span></p>\n<p><span>Here’s our full guide to how the Tour de France is won: the classifications, the jerseys and previous winners.</span></p>\n<h2>Tour de France classifications explained – what do the different jersey colours mean?</h2>\n<p><span>The Tour de France consists of four classifications that individual riders can win: the general classification (GC), mountains classification, points classification and young rider classification. There is also a team classification. </span></p>\n<p><span>The classifications are essentially different categories that riders compete for</span><span>. </span></p>\n<p><span>This is done on a stage-by-stage basis (whoever is leading the classification after each stage), as well as overall at the end (whoever tops the classification after the final stage in Paris).</span></p>\n<p><span>The different classifications are signified by coloured jerseys – yellow, polka dot, green and white – with the leader of the classification after each stage wearing the jersey on the following day. </span></p>\n<p><span>If they continue to lead, they continue to wear the jersey until someone knocks them from the top of the classification. The leader of the classification at the end of the race is the overall winner of that particular classification.</span></p>\n<h2>What is the Tour de France general classification (GC)?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Tadej Pogačar won the GC in the 2020 Tour de France.</span></figcaption><span> <i>MARCO BERTORELLO/AFP via Getty Images</i></span></div>\n<p><span>This is the oldest and most coveted classification in the Tour de France, and is led by the rider with the fastest cumulative time.</span></p>\n<p><span> Each rider’s time is recorded on every stage and the GC ranks the entire field. The leader of the general classification after the final stage in Paris is the overall winner of the Tour de France.</span></p>\n<h3>Tour de France yellow jersey explained</h3>\n<p><span>The GC comes with the coveted yellow jersey – or </span><i><span>maillot jaune</span></i><span>, as it’s known in French</span><span> – which is worn by the leader of the classification until their overall cumulative time is bettered by another rider at the end of a stage. </span></p>\n<p><span>The yellow jersey then passes on to the new leader of the GC, and so on.</span></p>\n<h3>Previous Tour de France winners</h3>\n<p>Tadej Pogačar (Team UAE Emirates) won last year, following Egan Bernal ‘s (Team Ineos-Grenadiers) triumph the previous year.</p>\n<p>Team Ineos-Grenadiers (formerly Team Sky) has had a rider win the yellow jersey in seven of the last nine Tours. Geraint Thomas won in 2018 and Chris Froome won four out of the five previous editions before that, after Bradley Wiggins had set the ball rolling in 2012.</p>\n<p><span>Since the beginning of the Tour, four riders have won the general classification five times in their career: Jacques Anquetil, Eddy Merckx, Bernard Hinault and Miguel Indurain. </span></p>\n<p><span>Meanwhile, Fabian Cancellara is the rider who has worn the yellow jersey for the most days without ever winning the Tour (29). Julian Alaphillipe held the jersey for 14 days in 2019, but fell away in the general classification in the final few stages.</span></p>\n<h2>Tour de France mountains classification</h2>\n<h3>What is the mountains classification?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The polka-dot jersey, which was also won by Tadej Pogačar in 2020, signifies the leader of the mountains classification, also known as the King of the Mountains.</span></figcaption><span> <i>KENZO TRIBOUILLARD/AFP via Getty Images</i></span></div>\n<p><span>The mountains classification was introduced in 1933 as a secondary competition within the Tour de France. </span></p>\n<p><span>The first riders to reach the top of categorised climbs in the Tour are awarded a certain number of points according to their position across the summit. </span></p>\n<p><span>The climbs are categorised by a number, from 1 (difficult) to 4 (least difficult), and measured based on factors such as the climb’s length and gradient, with more points up for grabs on harder climbs.</span></p>\n<p><span>As well as categories 1 to 4, there are climbs listed as </span><i><span>hors catégorie,</span></i><span> which used to mean ‘uncategorised’ but now effectively refers to climbs that are more difficult than category 1. <em>HC</em> climbs carry the most points, while summit finishes – a stage that finishes atop a climb – are worth double points.</span></p>\n<p>The rider with the highest cumulative points total leads the mountains classification and wears the polka dot jersey. <span>At the end of the Tour, the overall winner of the classification is the King of the Mountains.</span></p>\n<ul><li><a href=\"https://www.bikeradar.com/features/routes-and-rides/2021-tour-de-france-climbs/\" target=\"_blank\">5 key climbs from the 2021 Tour de France route</a></li>\n</ul><h3>Tour de France polka dot jersey explained</h3>\n<p><span>The mountains classification is signified by a white jersey with red polka dots (known as the polka dot jersey or <em>maillot a pois</em>). </span></p>\n<p><span>Vicente Trueba was the first winner of the King of the Mountains competition in 1933. </span></p>\n<h3>Previous Tour de France mountains classification winners</h3>\n<p>Tadej Pogačar took the mountains classification in 2020 (as well as the GC and young rider classification in 2020) following Romain Bardet in 2019 and following Julian Alaphilippe in 2018.</p>\n<p><span>Another Frenchman, Richard Virenque, won the title seven times in his career between 1994 and 2004, while both Federico Bahamontes and Lucien Van Impe have won it six times, from 1954 to 1964 and 1971 to 1983 respectively.</span></p>\n<p><span>Eight cyclists have now won the mountains classification and general classification in the same year: Gino Bartali, Sylvère Maes, Fausto Coppi, Federico Bahamontes, Eddy Merckx, Carlos Sastre, Chris Froome and Tadej Pogačar. Bartali, Coppi and Merckx have all done it twice.</span></p>\n<h2>Tour de France points classification</h2>\n<h3>What is the points classification?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Sam Bennett took the points classification in 2020.</span></figcaption><span> <i>Tim de Waele/Getty Images</i></span></div>\n<p><span>The points classification was introduced in 1953 as an incentive for sprinters, with Fritz Schär being the first rider to win it.</span></p>\n<p><span>The first 15 riders to complete each stage are awarded points, with the most points going to the first rider and the following 14 receiving successively fewer points.</span></p>\n<p><span> More points are on offer for flat stages, again as an incentive to the sprinters. R</span><span>iders can also gain points by winning intermediate sprints (sprints that take place at designated points part-way through a stage).</span></p>\n<h3>Tour de France green jersey explained</h3>\n<p><span>The leader of the points classification is indicated by a green jersey (<em>maillot vert</em>), and the overall prize is awarded to the rider with the most points at the end of the Tour.</span></p>\n<h3>Previous Tour de France points classification winners</h3>\n<p>The green jersey went to Irishman Sam Bennett in 2020, but in previous years the award had become synonymous with one man: Slovakian superstar Peter Sagan. He claimed the prize for a record-breaking seventh time in 2019.</p>\n<h2>Tour de France young rider classification</h2>\n<h3>What is the young rider classification?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Tadej Pogačar took the young rider classification, as well as the GC and polka dot jersey.</span></figcaption><span> <i>Tim de Waele/Getty Images</i></span></div>\n<p><span>The young rider classification was introduced to the Tour in 1975. This year it applies only to cyclists born on or after January 1, 1996.</span></p>\n<p><span>Just like the general classification, it’s calculated using each rider’s cumulative overall time but is aimed at rewarding young riders in the early stages of their careers.</span></p>\n<h3>Tour de France white jersey explained</h3>\n<p><span>The youth classification is signified by a white jersey, and much in the same way as the other categories, the rider currently topping the classification wears it until someone else overtakes their lead.</span></p>\n<h3>Previous Tour de France young rider classification winners</h3>\n<p>Tadej Pogačar became the sixth man to win both the white and yellow jersey in the same year when he rode to victory at the 2020 Tour de France.</p>\n<p>He joined Egan Bernal (2019), Laurent Fignon (1983), Jan Ullrich (1997), Alberto Contador (2007) and Andy Schleck (2010) in achieving that feat.</p>\n<p>Pierre Latour won the young rider classification in 2018, while British twins Adam and Simon Yates were triumphant in the previous two years.</p>\n<h2>What is the Tour de France team classification?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Movistar has dominated the team classification in recent years.</span></figcaption><span> <i>Tim de Waele/Getty Images</i></span></div>\n<p><span>The team classification has been part of the Tour de France since 1930 but awards no coloured jersey. Instead, the team is given race numbers with a yellow background, rather than white.</span></p>\n<p><span>It’s not considered to be as important as the individual classifications, and teams don’t normally set out with an ambition to win it, though they may change their tactics during the race if they are in a good position to do so.</span></p>\n<p>The team classification takes the time of each squad’s top three finishers on every stage (apart from in a<span> team time trial, when the time of the fifth rider to cross the finish is counted, or the last if there are fewer than five riders remaining). </span></p>\n<p>The team with the lowest cumulative time across the race so far leads the classification.</p>\n<h3>Previous Tour de France team classification winners</h3>\n<p><span>Movistar Team has dominated the classification in recent years, topping the team rankings in 2015, 2016, 2018, 2019 and 2020. This is despite none of its riders winning the Tour in those years. </span></p>\n<p><span>Generally, the team with the rider leading the Tour will be more inclined to sacrifice team-mates to protect the individual’s lead, making winning both the individual and team classification – as Team Sky did in 2017 – a rare feat.</span></p>","author":"Colin Henrys","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"0d2eeac6e3ce9be2ac6acc8c28e81521ab998eb7795dd1cf1533d68b0024924f","category":"Cycling"}