{"title":"459 A new approach to measuring dry matter intake, from drylot to pasture: Activities of the alliance for regenerative livestock","link":"https://academic.oup.com/jas/article/102/Supplement_3/298/7757052?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The current state of feed intake measurement for cattle in confinement relies on expensive monitoring systems. There is no effective method for measuring feed intake in grazing animals. To address these limitations, our research aims to tap into the potential of passively collected data, such as data from the Internet of Things (IoT), to address practical challenges in animal agriculture. This includes improving livestock management, optimizing resource allocation, and reducing ecological footprints. The benefits of our research extend beyond improved livestock management to include reducing ecological footprints, such as water, carbon, and environmental footprints. Grazing livestock have a crucial role in nutrient cycling in grasslands and advancing more sustainable livestock production systems. This requires innovation of research methods for quantifying intakes of animals housed in a variety of systems including confinement facilities that lack expensive feed intake systems and for grazing animals. Currently, the industry standard for determining feed intake are equations published in the Nutrient Requirements of Beef Cattle (NASEM, 2016). Our recent efforts using machine learning approaches (Blake et al., 2023) dramatically outperforms the equations. Using the same dataset, the NASEM (2016) approach overestimates intake by 34%. We have developed a predictive algorithm utilizing data collected from animals in confinement where individual feed intake (ground truth) is known. We have developed machine learning models such as Repeated Measures Random Forests (RMRF) and Extreme Gradient Boosting (XGB) to better predict feed intake in confined cattle. We have also used these predictive algorithms to determine feed intake of grazing animals and animals in confinement without feed intake systems and validated the predictive value of the approach.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0d4330c0c5ff840a00fec51fc11051aca344de85afd32bfc96bff713674c4dad","category":"Environment"}