{"title":"PSA: If You Run Windows, Make Sure to Update iTunes to Fix Security Vulnerability","link":"https://www.macrumors.com/2023/06/01/itunes-windows-vulnerability/","date":1685657250000,"content":"Windows users will want to make sure that they are running the latest version of iTunes, iTunes 12.12.9, in order to gain protection from a recently uncovered security vulnerability.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/05/itunes-for-windows.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nApple released iTunes 12.12.9 on May 23, and it <a href=\"https://support.apple.com/en-us/HT213763\">fixes an issue</a> that could allow malicious apps to gain elevated privileges to install malware on a Windows machine. While the vulnerability was addressed last week, Synopsys, the security company that discovered the problem, today <a href=\"https://www.synopsys.com/blogs/software-security/cyrc-vulnerability-advisory-cve-2023-32353\">shared some details</a> on how it worked.\r<br />\n\r<br />\niTunes had a privileged folder with weak access control, allowing a malicious person to redirect the folder creation to the Windows system directory, which could then be used to obtain a higher-privileged system shell.<blockquote>The iTunes application creates a folder, SC Info, in the C:\\ProgramData\\Apple Computer\\iTunes directory as a system user and gives full control over this directory to all users. After the installation, the first user to run the iTunes application can delete the SC Info folder, create a link to the Windows system folder, and re-create the folder by forcing an MSI repair, which can be later used to gain Windows SYSTEM level access.</blockquote>All versions of iTunes prior to 12.12.9 are impacted by this vulnerability, and so iTunes users who are running older versions of the software should make sure to update.\r<br />\n\r<br />\nSynopsys first discovered the problem in September 2022, and told Apple about it at that point. Apple confirmed the vulnerability in November, and then patched it in May. Apple did not say that this exploit was known to have been used in the wild so it is not as critical as some other vulnerabilities, but it is still a good idea to install the latest version of iTunes right away.<div>Tags: <a href=\"https://www.macrumors.com/guide/itunes/\">iTunes</a>, <a href=\"https://www.macrumors.com/guide/windows/\">Windows</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/mac-apps.2\">Mac Apps</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/01/itunes-windows-vulnerability/\">PSA: If You Run Windows, Make Sure to Update iTunes to Fix Security Vulnerability</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/psa-if-you-run-windows-make-sure-to-update-itunes-to-fix-security-vulnerability.2391306/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0d4795372ff978c22918578562493b0200d3e74848d92648098a1c1adfda910e","category":"Apple"}