{"title":"Tree belowground biomass in Congo Basin forests: allometric equations and scaling with aboveground biomass","link":"https://academic.oup.com/forestry/article/97/5/703/7618952?rss=1","date":1709510400000,"content":"<span><div>Abstract</div>Many allometric models to predict tree aboveground biomass have been developed in tropical moist forests, but few models are available for tree belowground biomass. Theory predicts that belowground biomass scales in an isometric way with aboveground biomass. Estimates of belowground biomass could then be derived from aboveground biomass using the root:shoot ratio. Using a dataset of 118 tropical trees for which both aboveground and belowground biomass and other tree and species characteristics were measured in Gabon and Cameroon, we found a near isometric, yet significantly allometric, relationship between belowground biomass (<span>B</span>, in kilograms) and aboveground biomass (<span>A</span>, in kilograms): <span>B</span> = 0.324 <span>A</span><sup>0.939</sup>. The root:shoot ratio was 0.20–0.22, regardless of tree size. An efficient model to predict belowground biomass from tree diameter (<span>D</span>, in centimeters), height (<span>H</span>, in meters) and wood density (ρ, in grams per cubic centimeter) was <span>B</span> = 0.0188 (ρ<span>D</span><sup>2</sup><span>H</span>)<sup>0.977</sup>. A significant residual effect of species and leaf habit was found in this model, indicating that further tree and species characteristics are likely to explain additional variation in belowground biomass. Yet, the future development of belowground allometric models can benefit from the many models already developed for aboveground biomass. On the basis of this unprecedented sampling effort on tree belowground biomass in the dense tropical forests of the Congo Basin, we conclude that the scaling of belowground biomass with aboveground biomass should be the relationship to focus on.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"0d4a4010819e9309ef08d50cb21f6a054292c5ae96c93c612e08a64f8960f8ad","category":"Environment"}