{"title":"Apple is reportedly prepping the 15-inch MacBook Air for an imminent release","link":"https://www.macworld.com/article/1781245/15-inch-macbook-air-production-release-april.html","date":1681183279000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s rumored 15-inch MacBook Air was a hot topic at the beginning of the year, but then the rumors have since died down while all attention has turned to <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Apple’s AR headset</a>. But display guru Ross Young has rekindled the laptop rumors, and it’s looking like it might be ready for release very soon.</p>\n\n\n\n<p>On Monday, Young, who monitors the supply chain of displays, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/DSCCRoss/status/1645454528031096833&amp;xcust=1-1-1781245-1-0-0&amp;sref=https://www.macworld.com/feed\">tweeted</a> to his super followers that Apple began production of the 15-inch MacBook Air in February and ramped it up in March, leading Young to conclude that Apple could release the laptop in late April or early May. While he doesn’t have information on the “precise launch timing,” rumors have repeatedly suggested that the 15-inch MacBook Air could ship in April.</p>\n\n\n\n<p>As you may recall, Apple <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">announced</a> last week that its Worldwide Developers Conference will kick off with a keynote address on June 5. And since it looks like Apple will not have a spring event this year, it’s a logical conclusion that Apple will unveil the 15-inch MacBook Air at WWDC, much like the <a href=\"https://www.macworld.com/article/807892/m2-macbook-air-review.html\">M2 model</a> last year. </p>\n\n\n\n<p>However, Apple shipping the 15-inch MacBook Air sometime before WWDC seems more likely. As it has numerous times over the past several months, Apple could do a press release announcement for the laptop without tying it to an event, especially if it’s identical to the current model other than the larger display. Essentially, its announcement will be like that of the 10-generation iPad <a href=\"https://www.macworld.com/article/678387/ipad-10th-generation-2022-design-specs-price-release.html\">last October</a>–a product that, while new and slightly different from previous models, doesn’t have major significant changes that warranted an unveiling at an event.</p>\n\n\n\n<p>Also, the word is that Apple wants the WWDC keynote to spotlight the rumored headset. While there will be plenty of Mac talk during the keynote, if Apple were to reveal a new Mac at that time, it’s much more likely to be the Mac Pro.</p>\n\nMac, MacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0d5bc847b15f4e3c7fb83ff6c554f8073cc316ff487dffc505995488ab989fa6","category":"Apple"}