{"title":"268 Effect of soybean gums and soybean soapstocks on weanling pig growth performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/164/7664720?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Currently, the soybean processing industry has not fully characterized the composition or nutritional value of certain processing by-products (e.g., gums, phospholipid) and their effect on soybean meal (SBM) quality. Depending on the processing plant, soybean gums and soapstocks may be added back to SBM during manufacturing. There is potential for these by-products to serve as an affordable energy source for swine due to their residual oil content. For this study, pigs [n = 350; Line 241 × 600, DNA; initial body weight (BW) = 5.3 ± 0.02 kg] were weaned at approximately 19 d of age and used in a 42-d experiment. At weaning, pigs were randomly assigned to pens and allotted to 1 of 5 dietary treatments. There were 5 pigs per pen and 14 pens per treatment. Diets were fed in 3 phases: phase 1 from weaning to d 11, phase 2 from d 11 to 23, and phase 3 from d 23 to 42. Treatments included a control diet containing SBM with no added soybean by-products. Two additional diets contained gums or soapstocks at 4% of the SBM level in the diet. Another treatment diet contained SBM with 2% added soybean gums and 2% added soybean soapstocks. Lastly, a negative control contained 4% less SBM with no added by-products to have equal protein from soybeans as the diets with added gums or soapstocks. From d 0 to 11 (phase 1) and d 11 to 23 (phase 2), there was no evidence of differences (<span>P</span> &gt; 0.10) for any growth response criteria (Table). From d 23 to 42 (phase 3), feeding SBM with added gums increased (<span>P</span> = 0.05) average daily gain (ADG). However, there was no evidence for differences (<span>P</span> &gt; 0.10) in average daily feed intake (ADFI) or gain to feed ratio (G:F). For the overall experimental period (d 0 to 42), there was no evidence of differences (<span>P</span> &gt; 0.10) due to dietary treatment in ADG, ADFI, or G:F. In summary, these data suggest that adding soybean processing by-products such as gums or soapstocks had minimal impacts on nursery pig growth performance. However, there is a potential for improved ADG in the late nursery period when SBM containing added gums is included in the diet.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0d6090831c529e84dd639c08fb5f040b704dea37538e9c869eb0ddfcb1152361","category":"Environment"}