{"title":"Amazon packages reportedly overwhelm small post offices, delaying other mail","link":"https://arstechnica.com/?p=1986856","date":1701203593000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/amazon-post-office-800x533.jpg\" alt=\"A large pile of Amazon boxes inside a postal service building.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/amazon-post-office.jpg\">Enlarge</a> <span>/</span> Amazon boxes sit at a United States Postal Service facility in Fairfax, Virginia, on Tuesday, May 19, 2020.  (credit: Getty Images | Bloomberg)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Amazon packages are overwhelming mail carriers in Minnesota, causing delays of other mail, according to news reports and complaints from a US senator. Amazon packages are being prioritized ahead of non-Amazon mail, postal workers have said.</p>\n<p>Similar complaints have been made elsewhere, but reports suggest the problems are particularly severe in Bemidji, Minnesota, where carriers recently held early morning protests before their shifts began. A <a href=\"https://www.bemidjipioneer.com/news/local/postal-workers-in-bemidji-protest-unsustainable-working-conditions-amazon-prioritization\">Bemidji Pioneer article</a> on November 15 said that \"rural mail carriers stood outside of the Bemidji Post Office before sunrise Monday and Tuesday carrying signs and protesting what they describe as unsustainable working conditions and the prioritization of Amazon deliveries over actual mail.\"</p>\n<p>The US Postal Service has been delivering Amazon packages for years, but this month's protest reportedly came in response to local implementation of a new agreement with Amazon at the beginning of November.</p></div><p><a href=\"https://arstechnica.com/?p=1986856#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986856&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0d6052bbbfe23592508002d4bfd0e35f841d67200b9ae1a308d06ae6d8e1f37e","category":"Tech"}