{"title":"Peng Shuai: U.N. Calls for Proof of Chinese Tennis Star’s Whereabouts; W.T.A. Chairman Willing to Pull Out of China","link":"https://www.cnn.com/2021/11/18/china/wta-ceo-peng-shuai-steve-simon-intl-hnk/index.html","date":1637355458000,"content":"\n<p>CNN:</p>\n\n<blockquote>\n  <p>Peng, who is one of China’s most recognizable sports stars, <a href=\"https://www.cnn.com/videos/world/2021/11/17/peng-shuai-tennis-star-china-ivan-watson-pkg-vpx.cnn\">has\nnot been seen</a> in public since she accused former Vice Premier\nZhang Gaoli of coercing her into sex at his home, according to\nscreenshots of a since-deleted social media post dated November 2.</p>\n\n<p>“What we would say is that it would be important to have proof of\nher whereabouts and wellbeing, and we would urge that there be an\ninvestigation with full transparency into her allegations of\nsexual assault,” Liz Throssell, the spokesperson of the UN Human\nRights office, told reporters in Geneva on Friday. [...]</p>\n\n<p>The head of the Women’s Tennis Association (WTA) Steve Simon has\nsaid he is willing to lose hundreds of millions of dollars worth\nof business in China if Peng is not fully accounted for and her\nallegations are not properly investigated.</p>\n\n<p>“We’re definitely willing to pull our business and deal with all\nthe complications that come with it,” Simon said in an interview\nThursday with CNN. “Because this is certainly, this is bigger than\nthe business,” added Simon.</p>\n</blockquote>\n\n<p>Chinese state media released an email yesterday, purportedly written by Peng and addressed to Simon, <a href=\"https://twitter.com/CGTNOfficial/status/1461025491842916358/\">that reads as preposterously fake</a>.</p>\n\n<p>Bravo to Simon and the WTA for taking this no-bullshit fuck-the-money stance. The NBA cowardly prostrated itself to the CCP two years ago, when Daryl Morey — then GM of the Houston Rockets — <a href=\"https://www.vox.com/2019/10/7/20902700/daryl-morey-tweet-china-nba-hong-kong\">tweeted “Fight for freedom, stand with Hong Kong.”</a> (Morey is now president of my hometown 76ers.)</p>\n\n<p>The International Olympics Committee will be tested next: the 2022 Winter Olympics are slated to be hosted in China, starting in February.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/11/19/peng-shuai-china-wta\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"0d61ea23df620e3fd81c8e2008a53c090a02bf77c944f8ce42aa0022aa030c00","category":"Tech"}