{"title":"Five things to expect from the Giro d’Italia Donne","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/what-can-we-expect-from-the-giro-d-italia-donne","date":1625145554000,"content":"\n      <p>While one of a triad of three-week men’s grand tours is well underway in France, the women will be lining up in Italy this week for their one-and-only stage race over more than six days: the Giro d’Italia Donne (née Giro Rosa). The race is under new management, and promises to be better than ever, but in an Olympic year, with some of the top competitors absent, what can we expect to see? </p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-d-italia-donne-preview-a-new-leaf\">Related: Giro d'Italia Donne 2021: route, predictions and contenders</a></em></strong></p>\n<h4>\n<strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/women-s-olympic-road-race-2021-will-we-see-dutch-dominance\"></a></em></strong><strong>The Olympic effect </strong>\n</h4>\n<p><span>With the Olympics in such close proximity to the Giro d’Italia Donne, the effects of the Tokyo Games have already been felt as both Annemiek van Vleuten and Kasia Niewiadoma have decided to skip the race to focus on training. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1273318387_1024x1024.jpg?v=1625143032\" /></span></p>\n<p><em><span>Lizzie Deignan in the 2020 Giro Rosa leader's jersey, Photo: Luc Claessen/Getty Images</span></em></p>\n<p><span>Plenty of other Olympic contenders, however, will be taking to the start line in Italy and, with just two weeks between the final stage of the Giro and the Olympic road race, we could see some supreme form start to show. </span></p>\n\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/women-s-olympic-road-race-2021-will-we-see-dutch-dominance\">Related: Women's Olympic Road Race 2021 – will we see Dutch dominance?</a></em></strong></p>\n<p><span>Defending Giro Rosa and Olympic champion Anna van der Breggen will be the one to beat at this year’s race, particularly in the absence of her nearest rival, Van Vleuten. If Van der Breggen isn’t up to the task for whatever reason, then SD Worx have current Women’s World Tour leader Demi Vollering to take up the mantle. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/question-time-with-demi-vollering\">Related: \"I want a lot, I want to win every race, I think\" – Question Time with Demi Vollering</a></em></strong></p>\n<p><span>Elsewhere, Elisa Longo Borghini and her Trek Segafredo team will be looking to improve on her third place finish from last year and she will have none other than Lizzie Deignan working for her as she also prepares for Tokyo. Deignan has been on the comeback from an early season marred by illness but will be looking to ride into form as the Giro goes on.</span></p>\n<h4><strong>Young riders making their mark </strong></h4>\n<p><span>Last year’s Giro Rosa saw the emergence of some of the most talented young riders in the women’s peloton who are now regular race animators. Mikayla Harvey won the young rider classification whilst also netting 5th overall at the 2020 edition and this year looks set to lead Canyon//SRAM in Niewiadoma’s absence. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Canyon-Sram-Mikayla-Harvey_1024x1024.jpg?v=1625142811\" /></span></p>\n<p><em><span>Mikayla Harvey, Photo Credit: Thomas Maheux/ Canyon Sram</span></em></p>\n<p><span>Elsewhere, FDJ Nouvelle Aquitaine Futuroscope’s Evita Muzic who won last year’s brutal final stage into Motta Montecorvino, is fresh off the back of her French national Championships win and is more than capable of taking another stage and performing well on GC if she isn't put to work for teammate Cecilie Uttrup Ludwig. </span></p>\n<p><span>Harvey’s former teammate and fellow Kiwi Niamh Fisher Black had an impressively consistent race last year, finishing second behind Muzic on the final stage and 21st overall. This year, the 20-year-old will no doubt be present in breaks and at the front in her usual workhorse role at SD Worx.  </span><span><br /></span><span></span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/mikayla-harvey-canyon-sram\">Related: \"I'm actually on my dream team\" – Mikayla Harvey on joining Canyon Sram</a></em></strong></p>\n<p><span>A.R Monex’s 21-year-old Maria Novolodskaia will also be one to look out for after animating the 2020 edition of the race. Coming from a smaller Continental team means she probably won’t threaten the GC but she could be up there for a stage result.</span></p>\n<h4><strong>Teamwork will be vital </strong></h4>\n<p><span>It might seem obvious, but teamwork hasn’t always been such a factor in women’s racing. Through the introduction of a minimum salary for Women’s WorldTeams and the increasing professionalisation of the women’s side of the sport, more teams are able to field rosters full of strong riders who can work for a leader.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-growth-of-womens-worldteams-a-delicate-balance\">Related: Women's WorldTeams Salaries – a delicate balance</a></em></strong></p>\n<p><span>Of course, one reason that teamwork is key at this race comes in the very first stage: the TTT. A fixture of the Giro in recent years, the opening TTT could cause upset from the very beginning if one or two teams with a GC leader don’t have the collective time trialling prowess of their rivals. Last year saw FDJ Nouvelle Aquitaine Futuroscope lose over one minute which put their leader Uttrup Ludwig straight on the back foot</span><span>.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1273483101_57045ed8-910f-4f52-84f4-eb821f6b51b2_1024x1024.jpg?v=1625143102\" /></span></p>\n\n<p><em><span>FDJ Nouvelle Aquitaine Futuroscope’s Evita Muzic, Photo: Luc Claessen/Getty Images</span></em></p>\n<p><span>Team tactics have also been affecting riders such as Marianne Vos, who hasn’t needed to lean so heavily on a team in the past, but has found herself singled out by squads who are able to have multiple riders represented in the finale of a race. </span></p>\n<p><span>Trek is one such standout team, and they have already declared their intention to go all in at the Giro d’Italia Donne. “It's one of the most important and prestigious races of the season, we have a big focus on it. The construction of the team reflects this. We want to be ambitious and aggressive to the maximum,” said director Ina Yoko-Teutenberg. </span></p>\n<p><span>Canyon//SRAM have also shown impressive cohesion in recent races and with Mikayla Harvey being able to call on the likes of Elise Chabbey, Tiffany Cromwell and Hannah Barnes in her GC bid they will pose a real collective threat. </span></p>\n<div></div>\n<h4><strong>Variation</strong></h4>\n<p><span>This year’s route provides opportunities for all kinds of riders, from sprinters on Stage 8 into Mortegliano, to pure climbers on stage 9’s finish up Monte Montajur. There are rolling stages in between and even a mountain ITT for the riders to contest. The winner of the GC at the Giro d’Italia Donne will really need to have it all. </span></p>\n<p><span>Stage racing provides a rare chance for domestiques to take their chances and with a dearth of multi-day events on the women’s calendar this year they will be itching to show off their form. Expect the likes of Tayler Wiles, Tiffany Cromwell, Anna Santesteban and Marta Cavalli to get into moves that might stick. </span></p>\n<p><span>Of course, it’s not only domestiques who can take their chances, riders from Continental teams will be looking to get their names out there too. We can expect to see Rally Cycling’s Heidi Franz get herself up the road — she was one of the main animators at the Vuelta a Burgos Feminas in May, battling for the QOM jersey. Elsewhere, Team Tibco-SVB will be looking to throw a spanner in the works for the WorldTeams alongside the usual Italian squads such as Valcar Travel &amp; Service.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-burgos-feminas-debrief-clash-of-the-titans\">Related: Clash of the Titans – Vuelta a Burgos Feminas Debrief </a></em></strong></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1272298720_1024x1024.jpg?v=1625143291\" /></span></p>\n<p><em><span>Marianne Vos at the 2020 Giro Rosa, Photo: Luc Claessen/Getty Images</span></em></p>\n<p><span>Also this year, there are more chances for pure sprinters should the flatter stages come down to a bunch kick to the line. Team DSM and Movistar must think there’s a good opportunity as they are bringing their super fast finishers, Lorena Wiebes and Emma Norsgaard who have been battling between themselves for the pan-flat finishes this season. The points jersey went to Marianne Vos in 2020 but we could see a real fight for bonuses between the fast-finishers this year. Add Sandra Alonso, Elena Cecchini and Alexis Ryan into the mix and the competition is fierce.</span></p>\n<h4><strong>Just 15km of live coverage </strong></h4>\n<p><span>Unfortunately, for all the fanfare around the new-and-improved race and organisers, fans will only be able to watch the final 15km of each stage live. Part of what makes stage racing so special is following the narrative of the battle for the GC, the gutsy stage wins, the textbook teamwork that pays off, and the many attacks throughout the stages. Sure, there can be plenty of action in the last 15km of a stage but unfortunately, plenty more will go unseen. </span></p>\n<p><span>Following a race via Twitter isn’t the same as seeing the action unfold in real time but it looks like we’ll be spending more time on #girodonne online than we’d like. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0d665fe086630b05c1f7e8a85c5a4e8f8f9369008f759cdacccd53bfb2e247e7","category":"Cycling"}