{"title":"Pharmacological intervention of behavioural traits and brain histopathology of prenatal valproic acid-induced mouse model of autism","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308632","date":1727186400000,"content":"<p>by Sharmind Neelotpol, Rifat Rezwan, Timothy Singh, Iffat Islam Mayesha, Sayedatus Saba, Mohd Raeed Jamiruddin</p>\r\n\r\nAutism spectrum disorder (ASD) is one of the leading causes of distorted social communication, impaired speech, hyperactivity, anxiety, and stereotyped repetitive behaviour. The aetiology of ASD is complex; therefore, multiple drugs have been suggested to manage the symptoms. Studies with histamine H3 receptor (H3R) blockers and acetylcholinesterase (AchE) blockers are considered potential therapeutic agents for the management of various cognitive impairments. Therefore, the aim of this study was to evaluate the neuro-behavioural effects of Betahistine, an H3R antagonist, and Donepezil, an acetylcholinesterase inhibitor on Swiss <i>albino</i> mouse model of autism. The mice were intraperitoneally injected with valproic acid (VPA) on the embryonic 12.5th day to induce autism-like symptoms in their offspring. This induced autism-like symptoms persists throughout the life. After administration of different experimental doses, various locomotor tests: Open Field, Hole-Board, Hole Cross and behavioural tests by Y-Maze Spontaneous Alternation and histopathology of brain were performed and compared with the control and negative control (NC1) groups of mice. The behavioural Y-Maze test exhibits significant improvement (<i>p</i> &lt;0.01) on the short term memory of the test subjects upon administration of lower dose of Betahistine along with MAO-B inhibitor Rasagiline once compared with the NC1 group (VPA-exposed mice). Furthermore, the tests showed significant reduction in locomotion in line crossing (<i>p</i> &lt;0.05), rearing (<i>p</i> &lt;0.001) of the Open Field Test, and the Hole Cross Test (<i>p</i> &lt;0.01) with administration of higher dose of Betahistine. Both of these effects were observed upon administration of acetylcholinesterase inhibitor, Donepezil. Brain-histopathology showed lower neuronal loss and degeneration in the treated groups of mice in comparison with the NC1 VPA-exposed mice. Administration of Betahistine and Rasagiline ameliorates symptoms like memory deficit and hyperactivity, proving their therapeutic effects. The effects found are dose dependent. The findings suggest that H3R might be a viable target for the treatment of ASD.","author":"Sharmind Neelotpol","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0d667525d297d1b4d5d8304d51a091b2e00ed3657811da76f0d092109c309086","category":"Interdisciplinary"}