{"title":"A multi‐scenario analysis of climate impacts on plankton and fish stocks in northern seas","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12834?af=R","date":1718259140000,"content":"<h2>Abstract</h2>\n<p>Globally, impacts of climate change display an increasingly negative development of marine biomass, but there is large regional variability. In this analysis of future climate change on stock productivity proxies for the North Sea, the Norwegian Sea, and the Barents Sea, we have provided calculations of accumulated directional effects as a function of climate exposure and sensitivity attributes. Based on modelled changes in physical and biogeochemical variables from three scenarios and knowledge of 13 different stocks' habitats and response to climate variations, climate exposures have been weighted, and corresponding directions these have on the stocks have been decided. SSP1-2.6 gives mostly a weak cooling in all regions with almost negligible impacts on all stocks. SSP2-4.5 and SSP5-8.5 both provide warmer conditions in the long term but are significantly different in the last 30 years of the century when the SSP5-8.5 warming is much stronger. The results show that it is the current stocks of cod and <i>Calanus finmarchicus</i>in the North Sea, and polar cod and capelin in the Barents Sea that will be most negatively affected by strong warming. Stocks that can migrate north into the northern seas such as hake in the Norwegian Sea, or stocks that are near the middle of the preferred temperature range such as mackerel and herring in the Norwegian Sea and cod and <i>Calanus finmarchicus</i> in the Barents Sea, are the winners in a warmer climate. The highly different impacts between the three scenarios show that multiple scenario studies of this kind matter.</p>","author":"Anne Britt Sandø, \nSolfrid S. Hjøllo, \nCecilie Hansen, \nMorten D. Skogen, \nRobinson Hordoir, \nSvein Sundby","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"0d79cfba8bea6e94fb563e8859da711458bf2326d6ad6e6df8af605383e6c2fc","category":"Environment"}