{"title":"Clinical, Laboratory, Imaging and Electrocardiographic Differences between Patients with Lyme Disease and Patients with Lyme Disease and B. divergens Antibodies","link":"https://www.preprints.org/manuscript/202401.1739/v2","date":1711019851000,"content":"Clinical and analytical differences between adult patients monoinfected with Borrelia burgdorferi sensu lato (s.l.) and patients infected with B. burgdorferi s.l. who also had IgG antibodies against Babesia divergens have not been reported so far. Both Lyme disease caused by B. burgdorferi and babesiosis caused by B. divergens, endemic in Asturias, Northwestern Spain, are transmitted by Ixodes tick bites. Clinical, laboratory and other diagnostic tests characteristics (imaging, electro-cardiographic-ECG) of 120 residents of Asturias with confirmed B. burgdorferi s.l. infection, di-agnosed during 2015-2017, of whom 47 (39.2%) had B. divergens IgG antibodies, were retrospec-tively compared. Cardiorespiratory symptoms were reported in 9/47 (19.2%) patients with Lyme disease and B. divergens IgG antibodies compared to 4/73 (5.5%) patients with B. burgdorferi s.l. monoinfection (P=0.02). Dyspnea was recorded in 4/47 (8.5%) patients with Lyme disease and B. divergens IgG antibodies compared to 1/73 (1.4%) monoinfected (P=0.07). In addition ECG atri-oventricular (AV) block, mostly 1st degree, was detected in 5/47 (15.6%) patients with Lyme dis-ease and B. divergens IgG antibodies compared to 1/73 (2.6%) B. burgdorferi s.l. monoinfected (P=0.09). No other clinical, laboratory or other tests differences were observed between B. burgdorferi and B. divergens IgG antibodies carriers and B. burgdorferi monoinfected. We con-cluded that patients with Lyme disease and B. divergens IgG antibodies had more frequent car-diorespiratory symptoms, mainly dyspnea, compared to B. burgdorferi monoinfected patients. These symptoms were unrelated to anemia. ECG AV block, perhaps induced by summative myo-cardial damage due to either infections or B. divergens induced lung microcirculation slow-ing-down, might play a role in the cardiorespiratory dysfunction.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0d809658cf04c7601c3d7ebe4b079d79eef0348250e2d40f4fc8e9bffa6baf0f","category":"Interdisciplinary"}