{"title":"Ignoring Plant Physiological Responses to Elevated CO2 Will Overestimate Terrestrial Vertebrate Biodiversity Loss Under Global Climate Change","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003800?af=R","date":1711087539000,"content":"<h2>Abstract</h2>\n<p>Rising CO<sub>2</sub> is accelerating Earth warming and drying by altering the radiation budget (CO<sub>2</sub> radiative effect), and it is commonly thought that future biodiversity will be greatly threatened. However, elevated CO<sub>2</sub> also modifies plant physiology including photosynthesis rate and water use efficiency (CO<sub>2</sub> physiological effect), the impacts of which have been usually ignored. By coupling machine learning techniques and Earth system models, this study considered both of the two effects and simulated terrestrial vertebrate biodiversity changes under moderate CO<sub>2</sub> emission pathway. Our results show that the CO<sub>2</sub> radiative effect positively impacts terrestrial vertebrate biodiversity at high latitudes but has a negative impact at low latitudes, whereas the physiological effect generally has a positive impact that peaks near the equator. Between 45°N and 45°S, 15% of areas with diminishing terrestrial vertebrate biodiversity due to radiative effect experience a reversal in trend when physiological effect is also considered; species migration pressure is also mitigated. Additionally, the protection priority rankings of 36 biodiversity hotspots need to be readjusted with the consideration of CO<sub>2</sub> physiological effect, for which the impacts on terrestrial vertebrate biodiversity are important and varied greatly over space. Overall, our findings highlight the critical impacts of vegetation physiology on terrestrial vertebrate biodiversity in response to elevated atmospheric CO<sub>2</sub>, which can provide a reference for resource allocation and biodiversity conservation policymaking.</p>","author":"Chuanlian Sun, \nXiaoming Feng","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"0d859d8d5241aa7c5cb17f786f97df9b998301525f6ab72d8b0f194c3a6662dd","category":"Environment"}