{"title":"Substitution of acidic residues near the catalytic Glu131 leads to human HYAL1 activity at neutral pH via charge-charge interactions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308370","date":1723212000000,"content":"<p>by Tu Anh Nguyen, Trang Hoang, Thu-Thuy Nguyen, ChanSu Jeong, Trang Van Tran, Mal-Gi Choi, ChangWoo Lee</p>\r\n\r\nHuman hyaluronidase 1 (HYAL1) and PH20 play vital roles in degrading hyaluronic acids through the substrate-assisted double displacement mechanism. While HYAL1, a lysosomal enzyme, functions optimally under acidic conditions, PH20, a sperm surface hyaluronidase, displays a broader pH range, from acidic to neutral. Our objective was to extend HYAL1’s pH range towards neutral pH by introducing repulsive charge-charge interactions involving the catalytic Glu131, increasing its p<i>K</i><sub>a</sub> as the proton donor. Substituting individual acidic residues in the β3-loop (S77D), β3′-β3″ hairpin (T86D and P87E), and at Ala132 (A132D and A132E) enabled HYAL1 to demonstrate enzyme activity at pH 7, with the mutants S77D, P87E, and A132E showing the highest activity in the substrate gel assay. However, double and triple substitutions, including S77D/T86D/A132E as found in the PH20 configuration, did not result in enhanced activity compared to single substitutions. Conversely, PH20 mutants with non-acidic substitutions, such as D94S in the β3-loop and D103T in the β3′-β3″ hairpin, significantly reduced activity within the pH range of 4 to 7. However, the PH20 mutant E149A, reciprocally substituted compared to A132E in HYAL1, exhibited activity similar to PH20 wild-type (WT) at pH 7. In a turbidimetric assay, HYAL1 mutants with single acidic substitutions exhibited activity similar to that of PH20 WT at pH 7. These results suggest that substituting acidic residues near Glu131 results in HYAL1 activity at neutral pH through electrostatic repulsion. This study highlights the significance of charge-charge interactions in both HYAL1 and PH20 in regulating the pH-dependent activity of hyaluronidases.","author":"Tu Anh Nguyen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0d871bfbc5475cba1a288dc97dff7f08f766be0311ddeec1cfa06553b10275cb","category":"Interdisciplinary"}