{"title":"Google Pays $700 Million to Settle Play Store Antitrust Lawsuit","link":"https://www.macrumors.com/2023/12/19/google-settles-play-store-antitrust-lawsuit/","date":1703028120000,"content":"Google parent company Alphabet has agreed to pay $700 million and update the Google Play app in order to settle a 2021 U.S. antitrust lawsuit over the Play Store, reports <em><a href=\"https://www.reuters.com/legal/google-pay-700-mln-us-consumers-states-play-store-settlement-2023-12-19/\">Reuters</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/03/play-store-google.jpeg\" width=\"1280\" height=\"720\" />\r<br />\nThe United States Department of Justice and all 50 states accused Google of charging unnecessary fees for in-app purchases and restricting the distribution of apps on Android devices, resulting in higher fees for consumers.\r<br />\n\r<br />\nGoogle will pay $630 million in restitution to customers, and $70 million into a fund that will be used by states should the settlement get final approval from a judge. Customers who purchased an app on Google Play between August 16, 2016 and September 30, 2023 will receive at least $2.\r<br />\n\r<br />\nNews of a settlement was announced in September, but the terms were kept under wraps to avoid impacting the Google vs. <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> lawsuit. Google <a href=\"https://www.macrumors.com/2023/12/12/epic-wins-antitrust-trial-against-google/\">lost that lawsuit</a> last week after a nine-member jury unanimously agreed that Google had abused its power by operating an app store monopoly.\r<br />\n\r<br />\nIn addition to paying money to consumers, Google will make several changes to its Play Store under the terms of the settlement with the government. Developers will be able to pay through in-app billing systems other than Google Play Billing for at least five years, and will be able to direct consumers to non-Google billing systems by advertising cheaper prices in their apps. Google's full concessions are listed below [<a href=\"https://ag.hawaii.gov/wp-content/uploads/2023/12/522-2-Blizzard-Ex.-A-Settlement-and-Release.pdf\">PDF</a>]:\r<br />\n<blockquote>- Give all developers the ability to allow users to pay through in-app billing systems other than Google Play Billing for at least five years.\r<br />\n- Allow developers to offer cheaper prices for their apps and in-app products for consumers who use alternative, non-Google billing systems for at least five years.\r<br />\n- Permit developers to steer consumers toward alternative, non-Google billing systems by advertising cheaper prices within their apps themselves for at least five years.\r<br />\n- Not enter contracts that require the Play Store to be the exclusive, pre-loaded app store on a device or home screen for at least five years.\r<br />\n- Allow the installation of third-party apps on Android phones from outside the Google Play Store for at least seven years.\r<br />\n- Revise and reduce the warnings that appear on an Android device if a user attempts to download a third-party app from outside the Google Play Store for at least five years.\r<br />\n- Maintain Android system support for third-party app stores, including allowing automatic updates, for four years.\r<br />\n- Not require developers to launch their app catalogs on the Play Store at the same time as they launch on other app stores for at least four years.\r<br />\n- Submit compliance reports to an independent monitor who will ensure that Google is not continuing its anticompetitive conduct for at least five years.</blockquote>\r<br />\n‌Epic Games‌ CEO Tim Sweeney today <a href=\"https://twitter.com/TimSweeneyEpic/status/1736981953105035444\">shared several tweets</a> decrying the terms of the settlement. He said that it is an \"injustice to all Android users and developers,\" and that the decision \"endorses Google's misleading and anticompetitive scare screens.\"\r<br />\n\r<br />\nWhile Google has agreed to these terms to settle the antitrust lawsuit, ‌Epic Games‌ will also be able to make recommendations for changes to the Play Store as part of its separate lawsuit against Google. ‌Epic Games‌ policy head Corie Wright told <em>Reuters</em> that the ruling \"did not address the core of Google's unlawful and anticompetitive behavior\" and that ‌Epic Games‌ will push to \"truly open up the Android ecosystem\" in the next phase of its trial.\r<br />\n\r<br />\nGoogle plans to appeal the decision in the ‌Epic Games‌ case, and the company said it will \"continue to defend the Android business model.\"\r<br />\n\r<br />\nGoogle's settlement and loss in the ‌Epic Games‌ case could have implications for Apple in the future. Apple was successful in its lawsuit against ‌Epic Games‌, but the company has been ordered to change its \"anti-steering\" rule that prevents iOS developers from directing users to make purchases outside of the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, circumventing Apple's 15 to 30 percent cut of in-app purchases.\r<br />\n\r<br />\nApple and ‌Epic Games‌ have both filed appeals in their dispute, and the Supreme Court will need decide whether to hear the case.<div>Tag: <a href=\"https://www.macrumors.com/guide/google/\">Google</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/19/google-settles-play-store-antitrust-lawsuit/\">Google Pays $700 Million to Settle Play Store Antitrust Lawsuit</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/google-pays-700-million-to-settle-play-store-antitrust-lawsuit.2414204/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0d890da84e8a7bc7fb325de42cbe1e975cb063489dc6d661520ead45f5f52c49","category":"Apple"}