{"title":"Northeastern Caribbean Rainfall Variability Linked to Solar and Volcanic Forcing","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004720?af=R","date":1712914193000,"content":"<h2>Abstract</h2>\n<p>We present a 500-year precipitation-sensitive record based on co-varying speleothem δ<sup>18</sup>O values and Mg/Ca ratios from Larga cave in Puerto Rico. This multi-proxy record shows that the evolution of rainfall in the northeastern Caribbean was characterized by alternating centennial dry and wet phases corresponding to reduced versus enhanced convective activity. These phases occurred synchronous with relatively cool and warm tropical Atlantic sea-surface temperatures (SSTs), respectively. While the observed pattern suggests a close link of northeastern Caribbean rainfall to the Atlantic Multidecadal Variability, a regional comparison reveals intermittent regional heterogeneity especially on decadal timescales, which may be related to a superimposing influence of the Pacific and Atlantic basins. Furthermore, the speleothem-based hydroclimate reconstruction indicates a significant volcanic impact during the past two centuries, and further reveals a potential solar signal in the preceding three centuries. We posit that the forcing likely shifted from solar to volcanic during the eighteenth century in being an important source of multidecadal to centennial Caribbean rainfall variability. The link between convective rainfall and natural forcing may be explained through a modulation of SST variations in the tropical Atlantic and Pacific oceans.</p>","author":"Rolf Vieten, \nSophie F. Warken, \nDavide Zanchettin, \nAmos Winter, \nDenis Scholz, \nDavid Black, \nGabriella Koltai, \nChristoph Spötl","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"0d8d46bb2fe9bab20948f3b03a553e1a18f1aa21b2d86c588d261cc1f2e5ad22","category":"Environment"}