{"title":"Multi-Dimensional Factors of Psychosomatic Health Disparities under the COVID-19 in Japan: Towards Communitarian Interventions","link":"https://www.preprints.org/manuscript/202410.1409/v1","date":1729232796000,"content":"Which measure is the most effective for solving health disparities, biological or economic? It is indispensable to delve into the factors of health disparities to answer this question. Our last paper in this journal analyzed the multi-dimensional factors of psychological health disparity under COVID-19 in Japan. This paper extends the analysis to physical health to explore the issue and proposes the concept of psychosomatic health, bridging the physical and psychological dimensions. It was found that　the factors of physical health disparities were close to those of psychological health. According to this new analysis concerning psychosomatic health disparity, not only biological factors but also socio-economic-political factors are essential for the psychosomatic health disparities in the static analysis． In addition, the ethico-political factor of justice/fairness plays a critical role in the dynamic analysis concerning the suppression of the damage to well-being by COVID-19.\nThe result suggests the importance of multi-dimensional communitarian interventions, utilizing the term in political philosophy: it evaluates societal-community intervention as well as biological, political, and economic measures. Therefore, this study implies that, on this empirical basis, public deliberation with the ethical dimension and counting the relative weight of these factors with the temporal dimension in allocating resources is proposed as a theoretically desirable method of the new comprehensive intervention.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0d8dc4b8d4d72d08cffd9b5bde48f11c3beb94e11cf81284aab1a9bf65872858","category":"Interdisciplinary"}