{"title":"Unique Project Brings Transparent Design to AirPods Pro Charging Case","link":"https://www.macrumors.com/2023/08/24/transparent-airpods-pro-charging-case/","date":1692885074000,"content":"Hardware prototyping consultant Ken Pillonel has created <a href=\"https://kenp.io/clear-airpods-pro/\">a transparent AirPods Pro charging case</a> with a repairable design using 3D printing technology and transparent SLA resin, as part of his ongoing efforts to highlight repairability and sustainability issues in modern consumer electronics.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/airpods_pro_clear_2-2.jpg\" alt width=\"5858\" height=\"3295\" />\r<br />\nThe project began with Pillonel downloading 3D files and employing transparent SLA resin to create the <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> case. Using a Formlabs Form 3+ printer, Pillonel printed the parts, cleaned them with IPA, and carefully dried them using compressed air. He then cured the parts and undertook a labor-intensive phase of sanding carried out in sequence using 400, 600, 800, and 1000 grit sandpaper, with the parts regularly dipped in tap water to aid in cleanliness and progress assessment.\r<br />\n\r<br />\nThe process continued with a cleansing in new IPA and drying with hot air to prevent mineral residue deposits from water. To finalize the aesthetic, Pillonel applied a clear spray varnish to the parts. The spray transformed the parts from opaque to entirely clear, achieving the desired transparent look.\r<br />\n\r<br />\n<div></div>\r<br />\n\r<br />\nThe transparent design also taps into a nostalgic aesthetic, reminiscent of transparent gadgets from the past. Beyond the visual appeal, the project represents Pillonel's continued effort to highlight repairability issues in contemporary consumer electronics and encourage a move towards more sustainable design practices. By using screws and nuts instead of adhesive and a USB-C port, Pillonel's ‌AirPods Pro‌ case can easily be taken apart and repaired.\r<br />\n\r<br />\nApple recently <a href=\"https://www.macrumors.com/2023/05/17/beats-studio-buds-plus-launch/\">introduced a transparent variant</a> of the Beats Studio Buds +, while Nothing's transparent Buds (1) and (2) have sought to <a href=\"https://www.macrumors.com/2023/03/22/nothing-launches-ear-2-wireless-earbuds/\">compete with AirPods</a>, indicating something of a revival of interest in transparent electronics.<div>Tag: <a href=\"https://www.macrumors.com/guide/ken-pillonel/\">Ken Pillonel</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/24/transparent-airpods-pro-charging-case/\">Unique Project Brings Transparent Design to AirPods Pro Charging Case</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/unique-project-brings-transparent-design-to-airpods-pro-charging-case.2399518/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0d8f4b6e72b68825255552a44aa911a3b9348505ab9cf19e9563a911b56bec9b","category":"Apple"}