{"title":"Horizontal-Vertical Interpretation of Mangrove Using Data Unmanned Aerial Vehicles in Tongke-tongke Indonesia","link":"https://www.preprints.org/manuscript/202406.0254/v1","date":1717556258000,"content":"This research explores the application of Support Vector Machine (SVM) and Digital Surface Models (DSM) derived from Unmanned Aerial Vehicle (UAV) data for a vertical-horizontal classification of mangrove ecosystems in Tongke-tongke and Samataring Village. The study focuses on integrating high-resolution DSM subtracted from Digital Terrain Models (DTM) to classify mangrove vegetation into sixteen distinct vertical-horizontal classes based on vegetation type and elevation. The analysis revealed that older mangroves, particularly those within the 25-35 meters elevation range, dominate the landscape, accounting for 43.40% of the total classified area. This dominance suggests a mature and ecologically stable mangrove ecosystem, which is crucial for biodiversity conservation and carbon storage. The study demonstrates the effectiveness of SVM and UAV technologies in providing detailed and accurate ecological assessments of mangrove forests. The classification results contribute valuable insights into the structural diversity and health of mangrove ecosystems, facilitating targeted conservation and management strategies. Additionally, the research highlights the utility of advanced remote sensing and machine learning techniques in enhancing the precision of environmental monitoring and the assessment of carbon sequestration capabilities within mangrove ecosystems. The findings underscore the potential of UAV-based remote sensing for ecological studies, offering a replicable method for similar assessments in other regions, thereby supporting global environmental management and climate action initiatives.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0d93531c2fbabc943e4b7015399110d6accd08e214a6017969feaf569156d227","category":"Interdisciplinary"}