{"title":"Identification and Expression Analysis of Suppressors of Cytokine Signaling from Spotted Seabass (Lateolabrax maculatus)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/6611206?af=R","date":1704787200000,"content":"<p>The suppressor of cytokine signaling (SOCS) plays a negative role in the cytokine signaling pathway, preventing excessive signaling from interfering with the metabolic homeostasis of the body. By regulating the Janus kinase-signal transducer and activator of transcription pathway through negative feedback, SOCS have a significant impact on the regulation of both innate and adaptive immunity against pathogens, thus playing a crucial role in the immune response, growth, and development of the body. In this study, the cDNA sequences of SOCS1, 2, 3a, 3b, 4, 5b, 6, 7, 8, 9, and CISH genes of spotted seabass (<i>Lateolabrax maculatus</i>), an important marine economic fish in China, were cloned using RT-PCR, nested PCR, and RACE techniques. Multiple sequence alignment showed that the SOCS family members shared highly conserved functional structural domains, including the SRC homology 2 domain (SH2 domain) and the SOCS-box domain. The phylogenetic analysis showed that SOCS1, 2, 3a, 3b, 8, and CISH belonged to the type II subfamily of SOCS genes, while SOCS4, 5b, 6, 7, and SOCS9 belonged to the type I subfamily. Furthermore, gene organization and syntenic analysis confirmed the phylogenetic analysis and protein annotation of the SOCS gene family in spotted seabass. Constitutive expression of spotted seabass SOCS genes was observed in various tissues of healthy fish, with varying expression levels. Following the lipopolysaccharide and <i>Edwardsiella tarda</i> challenge, the expression profiles of spotted seabass SOCS genes were differently regulated in the gill, head kidney, intestine, and spleen. These findings provide a basis for future research on the functional properties of SOCS genes in spotted seabass.</p>","author":"Chuanguo Cai, \nJiasong Xie, \nJiaqi Gao, \nZhitao Qi, \nKe Fan, \nZhaosheng Sun, \nLina Lei, \nQian Gao, \nJianguang Qin","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"0da7fa41dcd0b8536f27ac78d5aa8ada93b1a859422711a7dcd4662c6034a484","category":"Environment"}