{"title":"Picolinamide Fungicides for Controlling Cercospora-Leaf Spot (CLS) of Sugar Beet","link":"https://www.preprints.org/manuscript/202408.2199/v1","date":1725008309000,"content":". Studies were initiated to find new effective fungicides to use under field conditions to identify novel options for improved disease management in sugar beet. Cercospora-leaf spot (CLS) of sugar beet, caused by Cercospora beticola Sacc., is a major foliar disease of sugar beet in all sugar beet growing areas, worldwide. The disease is now dominant in almost all sugar beet growing areas of Europe, including Hungary. The epidemic spread of this disease can cause up to 50% yield loss. The use of fungicides has been being an integral part of the control of CLS of sugar beet, due to lack of efficacy from non-chemical alternatives. In recent decades, the emergence of resistant strains in C. beticola Sacc. populations have reduced the efficacy of some fungicides (Quinoine inside Inhibitors (QoI) – FRAC Group 11; and DeMethylation-Inhibitors (DMI) – FRAC Group 3) because of repeated use over many uears. Resistance of CLS to fungicides belonging to different groups of active substances has been described in many countries of the world, including Hungary. The picolinamides are a new distinct group of fungal respiration inhibitors (Inhibition of Complex III) belonging to Quinoine inside Inhibitors (QiI). Two novel fungicides from the group of picolinamides (Qil – FRAC Group 21) – fenpicoxamid and florylpicoxamid– were tested and evaluated over two seasons, in vegetation period of 2020 and 2021 for controlling CLS of sugar beet in Hungary. Both fungicides were applied as straight formulated products at a range of dose rates, and they showed very effective control of CLS compared to the untreated control check plots and the reference fungicide product difenoconazole. The results consistently showed all tested dose rates of fenpicoxamid and florylpicoxamid provided effective control against CLS of sugar beet in addition to a clear dose response curve. Disease severity, in terms of area under the disease progress curve values (AUDPC), was significantly correlated with yield decrease, while no significant context existed between disease severity and sugar content of the roots. Additionally, the results showed in two investigated years, the efficacy of both picolinamide fungicides applied at 75 g ai/ha provided significantly better % control on CLS of sugar beet than the DMI fungicide difenoconazole applied at 100 g ai/ha dose rate. Fenpicoxamid is already registered in Europe in cereals and label extension is planned in sugar beet and other crops. Florylpicoxamid is not yet registered in Europe but is beginning to be approved in countries across the globe in a range of crops and is continuously under evaluation for potential markets.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0dad2a650acd441137a8a6e2032679b24986df02a564729d600575361b34aeb9","category":"Interdisciplinary"}