{"title":"186 Evaluating the interaction between divergent genomic selection for heat stress tolerance in the F1 generation and in utero heat stress on piglet growth performance following weaning and transport","link":"https://academic.oup.com/jas/article/102/Supplement_3/316/7757422?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>In utero heat stress (IUHS) has long-term negative-effects on pigs during postnatal life. Specifically, IUHS pigs display greater stress responses following weaning and transport and have reduced growth performance among other issues. Although efforts have been made to mitigate IUHS through management and nutrition, the use of genomic selection to improve heat stress tolerance (TOL) in gestating sows and reduce the impacts of IUHS on developing offspring has not been extensively studied. Therefore, the study objective was to determine whether genomic selection for TOL or heat stress sensitivity (SEN) in F1 gilts would impact the postnatal growth performance of IUHS piglets following weaning and transport. We hypothesized that IUHS piglets derived from TOL gilts would have improved growth performance relative to IUHS piglets derived from SEN gilts, but that overall, IUHS piglets would have reduced growth performance when compared with IUTN piglets following weaning and transport. Twenty-eight TOL (n = 15) and SEN (n = 13) pregnant gilts were exposed to either thermoneutral (TN; 17 to 20ºC; n = 7 TOL and 6 SEN) or heat stress (HS; cycling 26 to 36ºC; n = 8 TOL and 7 SEN) conditions from d 6 to 70 of gestation, and then all gilts were exposed to TN conditions until farrowing. At weaning, mixed sex piglets were selected from each litter resulting in the following treatment combinations: TOL+ in utero thermoneutral (IUTN; n = 60), TOL+IUHS (n = 60), SEN+IUTN (n = 59), and SEN+IUHS (n = 58). Piglets were then transported for 12 h to simulate commercial conditions and then group housed in 40 nursery pens (n = 6 pigs/pen) for 5 wk. All pigs were fed a standard nursery diet containing primarily corn and soybean meal and feed and water were provided ad libitum. Body weights (BW) and feed disappearance were measured on d 1, 7, 14, 21, 28, and 35 post-weaning and transport and used to calculate average daily gain (ADG), average daily feed intake (ADFI), and Gain:Feed. Data were analyzed in R using a generalized linear mixed model with pen as the experimental unit for ADFI and Gain:Feed, and individual piglet was the experimental unit for BW and ADG. Overall, IUHS piglets had a reduction (<span>P</span> &lt; 0.01) in ADG (6.3%), Gain:Feed (4.4%), and final BW (2.5%) when compared with IUTN piglets. Additionally, TOL piglets had an overall improvement (<span>P</span> &lt; 0.01) in ADG (6.0%), ADFI (13.6%), and final BW (3.9%), but a decrease in Gain:Feed (5.8%) when compared with SEN piglets. No genomic by in utero treatment effects were observed with any comparison. In conclusion, IUHS had a negative impact and selection for TOL had a generally positive impact on postnatal growth performance, but genomic selection for TOL or SEN did not interact with IUHS or IUTN in the F1 generation.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0db558b1d3faddeacb5c5e75b70b5652a5fd77202534d4a8956966638608c673","category":"Environment"}