{"title":"Sony reverses course, keeps legacy PlayStation online stores open","link":"https://arstechnica.com/?p=1758095","date":1618860595000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/psstore.png\" /><p>The store has received a stay of execution on the PS3 and Vita... (credit: <a href=\"https://www.playstation.com/en-us/\">Playstation</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Just three weeks ago, Sony <a href=\"https://arstechnica.com/gaming/2021/03/sony-will-shut-down-online-stores-for-legacy-playstation-games-this-summer/\">announced its plans</a> to shut down the digital stores for the PlayStation 3, PlayStation Portable, and PlayStation Vita, effective this summer. Today, Sony partially reversed course, with Sony Interactive Entertainment President and CEO Jim Ryan <a href=\"https://blog.playstation.com/2021/04/19/playstation-store-on-ps3-and-ps-vita-will-continue-operations/\">writing in a blog post</a> that \"it's clear that we made the wrong decision here.\"</p>\n<p>As such, the PS4 and Vita online stores will continue operations, Ryan said, while the PSP store will still shut down as planned on July 2. PS3 and Vita players will continue to be able to purchase games through the hardware itself, while web-based versions of those stores will seemingly remain closed <a href=\"https://www.eurogamer.net/articles/2021-03-29-sony-quietly-kills-old-web-version-of-the-playstation-store-that-let-people-buy-ps3-vita-and-psp-games\">following their shutdown last month</a>.</p>\n<p>\"When we initially came to the decision to end purchasing support for PS3 and PS Vita, it was born out of a number of factors, including commerce support challenges for older devices and the ability for us to focus more of our resources on newer devices where a majority of our gamers are playing on,\" Ryan wrote. \"We see now that many of you are incredibly passionate about being able to continue purchasing classic games on PS3 and PS Vita for the foreseeable future, so I’m glad we were able to find a solution to continue operations.\"</p></div><p><a href=\"https://arstechnica.com/?p=1758095#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1758095&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0dc2265556f193c1b9f962207220fd9d9ae10818c917e5333c32fbbaebf1ba8e","category":"Tech"}