{"title":"Chrome for Mac gets another critical update after new zero-day exploit found in the wild","link":"https://www.macworld.com/article/1791698/chrome-for-mac-update-zero-day-version-112-0-5615-137.html","date":1681928253000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It was only a few days ago when Google pushed out an <a href=\"https://www.macworld.com/article/1789494/google-chrome-mac-zero-day-update.html\">emergency update to Chrome</a> for Mac that fixed a vulnerability that was actively exploited. Less than a week later, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://chromereleases.googleblog.com/2023/04/stable-channel-update-for-desktop_18.html&amp;xcust=1-1-1791698-1-0-0&amp;sref=https://www.macworld.com/feed\">a second update has arrived</a> to fix another flaw that exists in the wild.</p>\n\n\n\n<p>The 112.0.5615.137 update for Chrome for Mac fixes eight security flaws, including at least one that may have been actively exploited. That vulnerability (CVE-2023-2136) is described as an integer overflow in Skia and is listed as a high-risk bug. Unlike Apple’s security updates, Google doesn’t disclose how the flaw was fixed.</p>\n\n\n\n<p>Four other flaws are also outlined in the blog post on Google’s Chrome Releases site:</p>\n\n\n\n<p><strong>CVE-2023-2133:</strong> Out of bounds memory access in Service Worker API. Reported by Rong Jian of VRI on 2023-03-30</p>\n\n\n\n<p><strong>CVE-2023-2134:</strong> Out of bounds memory access in Service Worker API. Reported by Rong Jian of VRI on 2023-03-30</p>\n\n\n\n<p><strong>CVE-2023-2135:</strong> Use after free in DevTools. Reported by Cassidy Kim(@cassidy6564) on 2023-03-14</p>\n\n\n\n<p><strong>CVE-2023-2137:</strong> Heap buffer overflow in sqlite. Reported by Nan Wang(@eternalsakura13) and Guang Gong of 360 Vulnerability Research Institute on 2023-04-05</p>\n\n\n\n<p>All of the flaws are listed as “high” risk except for CVE-2023-2137, which has a “medium” risk. In all, there are eight security fixes. Google says the update should be rolling to all users “over the coming days/weeks.”</p>\n\n\n\n<p>To update Chrome, click on the Chrome menu, then <em>About Chrome</em>. Check the version number to see if it’s been updated to v112.0.5615.137. If not, wait for the update to download and click <em>Relaunch</em>.</p>\n\n\n\n<p>For more advise about staying secure on your Mac read: <a href=\"https://www.macworld.com/article/668710/how-secure-mac.html\">How secure is a Mac and are Macs really more secure than Windows?</a> and <a href=\"https://www.macworld.com/article/1432223/mac-security-tips-password-find-my-users-lockdown-mode.html\">10 ways to protect your Mac from malware and theft</a>.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0dc42d1d43dbcf979576984084489366f37c090f49b8817d8ed2c6b6cb02e8a1","category":"Apple"}