{"title":"ผู้กำกับ Smash Bros. Ultimate ยืนยัน ตัวละครใหม่ต่อจาก Kazuya จะเป็นตัวละครสุดท้ายของเกมภาคนี้","link":"https://www.blognone.com/node/123486","date":1624967279000,"content":"<div><div><div><p>Nintendo เตรียมเพิ่มตัวละคร Kazuya จากเกม Tekken มาเป็นอีกหนึ่งตัวละครในเกม Smash Bros. Ultimate เกมต่อสู้ข้ามแฟรนไชส์ยอดฮิตของ Nintendo บนเครื่อง Nintendo Switch ภายในวันที่ 29 มิถุนายนนี้</p>\n<p>หลังจากนี้จะมีตัวละครอีกตัวเดียวใน Fighters Pass Vol. 2 ที่จะเพิ่มเข้ามา ซึ่งยังไม่เปิดเผยว่าจะเป็นตัวละครใด แต่ Masahiro Sakurai ผู้กำกับเกม ยืนยันในวิดีโอเปิดตัวว่าตัวละครถัดไปนั้น จะเป็นตัวละครสุดท้ายที่ถูกเพิ่มเข้ามาในเกมภาคนี้</p>\n<p>อย่างไรก็ตาม Nintendo ยังสามารถเพิ่มตัวละครอื่นเข้าอย่างไม่เป็นทางการในรูปแบบชุดแต่งตัว Mii Fighters ได้เรื่อยๆ ในอนาคต ตัวละคร Mii Fighters คือตัว Avatar ของผู้เล่นที่มีรูปแบบการต่อสู้สามแบบคือ Mii Brawler แบบเตะต่อย Mii Swordfighter ใช้ดาบ และ Mii Gunner ใช้ปืน และสามารถแต่งให้เป็นตัวละครจากเกมต่างๆ ได้ตามลักษณะการต่อสู้นี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/19ac05d94a75eb559ebaf80fe4f62a9b.jpg\" /></p>\n<p>Super Smash Bros. Ultimate เปิดตัวช่วงเดือนธันวาคม ปี 2018 ตัวละครทั้ง 63 ตัวกลับมาจากภาคเก่าแบบครบถ้วน (ตัวละครที่มาเป็นหมู่คณะเช่นโปเกม่อนกับเทรนเนอร์นับเป็น 1) และมีตัวละครใหม่ 23 ตัว แบ่งเป็น 11 ตัวในเกมหลัก และ DLC อีก 12 ตัว (เปิดเผยแล้ว 11 ตัว เหลือตัวสุดท้ายเท่านั้น)</p>\n<p>DLC ตัวละครของเกมนี้ซื้อแยกได้ Challenger Pack ละ 5.99 ดอลลาร์ แถม Stage ใหม่มาด้วย (ยกเว้น ้ต้นไม้กินคน Piranha จาก Super Mario Bros. ที่มาแต่ตัวและไม่รวมอยู่ใน Fighters Pass)</p>\n<p>ผู้เล่นสามารถซื้อ Fighters Pass เหมาตัวละครและ Stage ของตัวละครนั้นๆ ที่มีสองชุด ในราคาชุดละ 29.99 ดอลลาร์ได้ โดย Vol.1 ประกอบด้วย Joker จาก Persona 5, Hero จาก DQ XI, Banjo และ Kazooie จาก Banjo &amp; Kazooie, Terry จาก King of Fighters และ Byleth จาก Fire Emblem</p>\n<p>ส่วน Vol. 2 ประกอบด้วย Min Min จาก ARMS, Steve และ Alex จาก Minecraft, Sephiroth จาก FFVII, Kazuya จาก Tekken และตัวละครสุดท้ายที่ยังไม่เปิดเผย</p>\n<p>ที่มา - <a href=\"https://www.youtube.com/watch?v=e-eQJ8HCg4I\">Nintendo</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/super-smash-bros\">Super Smash Bros.</a></div><div><a href=\"/topics/nintendo\">Nintendo</a></div><div><a href=\"/topics/nintendo-switch\">Nintendo Switch</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0dc6b436528748bebe904636b1836789accc6318dd1d647d26a87ad34e24b351","category":"Thai"}