{"title":"Nursery areas of Micromesistius poutassou and Sardina pilchardus unveil their reproductive strategies in the northwestern Mediterranean Sea","link":"https://onlinelibrary.wiley.com/doi/10.1111/fog.12661?af=R","date":1707108047000,"content":"<h2>Abstract</h2>\n<p>Winter conditions in the NW Mediterranean cause instability of the water column and non-geostrophic dynamics, such as vertical mixing and convection are significant. These events involve nutrient supply to the photic zone that can sustain high productivity. In this study, we aim to investigate the role of winter hydrodynamics on the spawning strategies of <i>Sardina pilchardus</i> and <i>Micromesistius poutassou</i>. Data were obtained on two oceanographic cruises (February 2017 and 2018) off the Catalan coast. The occurrence of <i>S. pilchardus</i> eggs very close to the coast indicated a clear preference of the species for spawning in coastal areas. Preflexion and postflexion larvae exhibited a slightly wider distribution showing a clear association with the cold, less saline and more productive coastal waters. Preflexion larvae of <i>M. poutassou</i> were found on the upper slope and over the shelf, being offshore limited by the shelf/slope front present all along the slope. The front would act as a barrier preventing their dispersion towards the open sea. <i>M. poutassou</i> larvae in advanced developmental stages were located close to the coast in the productive shelf waters, with instabilities of the front contributing to larval transport from offshore waters to the coast. The vertical distribution of both species showed high variability, not only related with the daily cycle or developmental stage, but also with the vertical structure of the water column. Overall, the results provide some clues on how the spawning strategies of both species may evolve under future scenarios of higher winter-stratification, because of the global warming.</p>","author":"Ana Sabatés, \nVanesa Raya, \nJordi Salat, \nJoan Mir‐Arguimbau, \nM. Pilar Olivar","siteTitle":"Wiley: Fisheries Oceanography: Table of Contents","siteHash":"ddf10675d11d4e916ea2c59904318f6a27094a133dc6841be0937d77cc7558c9","entryHash":"0dc9a67f45573afcf22a5e823531f16ec9004994f90f71acb7e6166fa9456ae4","category":"Environment"}