{"title":"The implications of estimating rarity in Brazilian reptiles from GBIF data based on contributions from citizen science versus research institutions基于公众科学和研究机构的贡献从GBIF数据中估算巴西爬行动物稀有性的意义Implicações da estimativa de raridade de espécies de répteis brasileiros baseada nas contribuições da ciência cidadã versus instituições de pesquisa","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.53?af=R","date":1719474874000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6320d4e4-eb5b-4d28-be76-2efb44e1d24e/inc353-gra-0001-m.png\" alt=\"The implications of estimating rarity in Brazilian reptiles from GBIF data based on contributions from citizen science versus research institutions 基于公众科学和研究机构的贡献从GBIF数据中估算巴西爬行动物稀有性的意义 Implicações da estimativa de raridade de espécies de répteis brasileiros baseada nas contribuições da ciência cidadã versus instituições de pesquisa\" /><p>\n</p><p>Integrating data collected by citizen scientists with data from traditional surveys improves our knowledge of reptile species distribution and richness.</p>\n<p>Data contributed by citizen scientist can inform reptile species abundance and rarity patterns in Brazil.</p>\n<p>Further combined efforts between professional and citizen scientists can fill gaps on reptile species occurrence at the national scale</p>\n<p></p><br />\n<h2>Abstract</h2>\n<p>Understanding the distribution of rare species is important for conservation prioritisation. Traditionally, museums and other research institutions have served as depositories for specimens and biodiversity information. However, estimating abundance from these sources is challenging due to spatiotemporally biased collection methods. For instance, large-bodied reptiles that are found near research institutions or in popular, easily accessible sites tend to be overrepresented in collections compared to smaller species found in remote areas. Recently, a substantial number of observations have been amassed through citizen (or community) science initiatives, which are invaluable for monitoring purposes. Given the unstructured nature of this sampling, these datasets are often affected by biases, such as taxonomic, spatial and temporal preferences. Therefore, analysing data from these two sources can lead to different abundance estimates. This study compiled data on Brazilian reptile species from the Global Information Biodiversity Facility (GBIF). It employed a community-ecology approach to analyse data from research institutions and citizen science initiatives, separately and collectively, to assess taxonomic and spatial species coverage and predict species rarity. Using a 1-degree hexagonal grid, we analysed the spatial distribution of reptile communities and calculated rarity indices for 754 reptile species. Our findings reveal that 87 species were exclusively recorded in the citizen science subset, while 212 were recorded only by research institutions. The number of observations per species in the citizen science data followed a Gambin distribution, which aligns with the expected pattern of abundance in natural communities, unlike the data from research institutions. This suggests that citizen science data may be a more accurate source for estimating species abundance and rarity. The discrepancies in rarity classifications between the datasets were likely due to differences in sample size and potentially other sampling parameters. Nevertheless, combining data collected by both research institutions and citizen science initiatives can help to fill knowledge gaps in reptile species occurrence, thus enhancing the foundation for conservation efforts on a national scale.</p>\n<h2>摘要</h2>\n<p>了解珍稀物种的分布对保护优先具有重要意义。传统上，博物馆和其他研究机构一直作为标本和生物多样性信息的储存库。然而，由于时空有偏的收集方法，从这些来源估计丰度是具有挑战性的。例如，在研究机构附近或在受欢迎的、容易到达的地点发现的大型爬行动物，与在偏远地区发现的较小物种相比，在收集中的代表性往往较高。最近，通过公民(或社区)科学倡议积累了大量的观测数据，这些数据对于监测目的来说是非常有价值的。考虑到这种采样的非结构化性质，这些数据集通常会受到偏差的影响，例如分类、空间和时间偏好。因此，分析这两种来源的数据可以得到不同的丰度估计。本研究从全球信息生物多样性设施(GBIF)中整理了关于巴西爬行动物物种的数据。它采用群落生态学的方法，分别和共同分析来自研究机构和公民科学倡议的数据，以评估分类学和空间物种覆盖率，并预测物种稀有性。采用1度六边形网格，分析了754种爬行动物群落的空间分布，并计算了稀有性指数。我们的研究发现，有87个物种仅在公民科学子集中被记录，212个物种仅在研究机构中被记录。公民科学数据中每个物种的观测数量服从Gambin分布，这与自然群落中的预期丰度模式一致，而不是来自研究机构的数据。这表明，公民科学数据可能是估计物种多度和稀有度更准确的来源。数据集之间稀有性分类的差异可能是由于样本量和潜在的其他采样参数的差异造成的。尽管如此，结合研究机构和公民科学倡议收集的数据，有助于填补爬行动物物种出现方面的知识空白，从而为国家尺度的保护工作奠定基础。【审阅:杨毅】</p>\n<h2>Resumo</h2>\n<p>Conhecer a distribuição de espécies raras é importante para definir áreas prioritárias para conservação. Tradicionalmente, museus e outras instituições de pesquisa têm sido utilizados como acervos de espécimes e outras informações sobre biodiversidade. No entanto, é difícil estimar a abundância a partir dessa fonte de dados, considerando a tendência de métodos de coleta enviesados espacial e temporalmente. Por exemplo, répteis de grande porte que ocorrem próximos a instituições de pesquisa ou em locais populares e de fácil acesso são melhor representados em coleções científicas do que espécies menores localizadas em áreas remotas. Recentemente, um grande número de observações foi acumulado por iniciativas de ciência cidadã que podem ser usadas para biomonitoramento. Dada a amostragem não estruturada, esses conjuntos de dados também são afetados por vieses, como as preferências taxonômicas, espaciais e temporais. Portanto, analisar dados dessas duas fontes pode levar a diferentes estimativas de abundância de espécies. Compilamos dados para espécies de répteis brasileiros do <i>Global Biodiversity Information Facility</i> (GBIF). Utilizando uma abordagem de ecologia de comunidades, analisamos dados de instituições de pesquisa e de ciência cidadã separadamente e em conjunto para descrever a cobertura taxonômica e espacial das espécies e prever a raridade das mesmas. Utilizando uma grade hexagonal de 1 grau, analisamos a organização espacial das comunidades de répteis e calculamos índices de raridade para 751 espécies de répteis. Descobrimos que 87 espécies estavam presentes apenas no subconjunto de dados da ciência cidadã, enquanto 212 foram registradas apenas por instituições de pesquisa. O número de observações por espécie nos dados de ciência cidadã se ajustou à distribuição de Gambin, o padrão esperado para abundância em comunidades naturais, ao contrário dos dados de instituições de pesquisa, sugerindo que o primeiro é uma fonte mais precisa para estimar a abundância e a raridade das espécies. A razão por trás das diferentes classificações de raridade provavelmente se deve a diferenças no tamanho da amostra nos dois subconjuntos de dados e possivelmente também em outros parâmetros de amostragem. No entanto, combinar dados coletados por instituições de pesquisa e iniciativas de ciência cidadã pode ajudar a preencher lacunas no conhecimento sobre a ocorrência de espécies de répteis, fornecendo melhores evidências para a conservação em escala nacional.</p>","author":"Lucas Rodriguez Forti, \nJandson Lucas Camelo da Silva, \nEveline Almeida Ferreira, \nJudit K. Szabo","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"0dc9dec64c7e4a88ec96a6f640adabee854a850dfe68dde1985cac7454a3a863","category":"Environment"}