{"title":"Les Mis meets Le Tour: The man behind the West End’s Gino Bartali musical","link":"https://www.cyclist.co.uk/in-depth/glory-ride-todd-buchholz","date":1685463973000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/glory-ride-todd-buchholz\">Les Mis meets Le Tour: The man behind the West End’s Gino Bartali musical</a></p>\n\n<p>‘You know, politics is about storytelling,’ says Todd Buchholz. ‘So as an economic advisor to the President, if I wanted to persuade him to adopt a certain policy – like an incentive to buy new cars – I could do a PowerPoint presentation with a bunch of statistics and graphs. But ultimately you need to get somebody’s attention. So, you tell a story.’</p>\n\n\n\n<p>We’ve started with the obvious question: how on Earth does a man who was a trusted guide to George Bush (the first one) on the small matter of steering the world’s largest economy end up writing a musical about <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-history-bartali-rescues-italy\" target=\"_blank\">Gino Bartali</a>?</p>\n\n\n\n<p>‘You have to explain how others will see it,’ Buchholz continues. ‘Then the President might say: “Okay, I think this is a good idea, but what am I going to say when I’m interviewed on television? I’m not going to tell them Todd Buchholz says 3.7 per cent will be the square root of whatever.”</p>\n\n\n\n<p>‘I’ve also taught economics in various places, and some professors will just go by the textbook, draw the graph and so on. But I’d take the time to think: “How am I gonna explain this in a way students will remember?” That’s just the way my mind works. There’s a lot of storytelling to everything.’</p>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-970x647.jpg\" alt=\"Left to right: Victoria and Todd Buchholz\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-1536x1024.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-2048x1365.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Victoria-and-Todd-Buchholz-350x233.jpg 350w\" /><figcaption>Todd Buchholz</figcaption></figure>\n\n\n\n<p>Buchholz and his co-writer, daughter Victoria, have picked a great story. <em>Glory Ride</em>, which runs until the end of July at London’s Charing Cross Theatre, tells how Bartali used his fame as Italy’s most celebrated sportsman to help save hundreds of Jewish children by smuggling counterfeit identity papers hidden in his bike frame while out on ‘training rides’ during the Second World War.</p>\n\n\n\n<p>Bartali risked his life by doing so, and even alienated his family by keeping up the pretence he was Benito Mussolini’s man. His parents didn’t find out until after the war that their son had been part of the resistance, hiding child refugees in his own home and even using a bike trailer to smuggle others around Italy and over the border with Switzerland. Had he not, those children might have faced being deported to concentration camps.</p>\n\n\n\n<p>The product of nine years’ graft, <em>Glory Ride</em> (tagline: Some medals hang on the soul) honours Bartali with unashamed <em>spicy-meat-a-ball</em> Italian accents in song and electric guitar riffs that ‘We Will Rock You’ would be proud of. </p>\n\n\n\n<p>We’ve seen it. We had our doubts before we did so. But mamma mia! It’s excellent.</p>\n\n\n\n<h2>No business like show business</h2>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-970x647.jpg\" alt=\"Two men performing in theatre, left man has both hands on face of right man\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-1536x1024.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-2048x1365.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-350x233.jpg 350w\" /><figcaption>Glory Ride</figcaption></figure>\n\n\n\n<p>This is not the first musical Buchholz has brought to the stage, he was a producer of <em>Jersey Boys</em> back in the 2000s and he has also ‘written a bunch of non-fiction books and a novel’.</p>\n\n\n\n<p>‘So I’d written to entertain,’ he explains. ‘I wasn’t involved in a creative role for <em>Jersey Boys</em>, but it got me into the world of Broadway and musicals. I listened a lot, and studied a lot. How exactly does this work? Say you have an idea for a show – so what? What’s the next step? And people told me the same thing: it’s the worst possible thing you can do in your life! And I scoffed at that. But I’ve learned there’s a lot of truth to their explaining what a steep hill it was.’</p>\n\n\n\n<p>Buchholz pauses to excuse the pun. So, how did they land on Bartali?</p>\n\n\n\n<p>‘We were discussing writing a musical based on historical events, and looking at the US Civil War and the First World War. Victoria was travelling in Tuscany. She read a sentence or two in a book without much elaboration, and called me up: “I’ve found the most amazing story.” But we’d never heard of Gino Bartali.</p>\n\n\n\n<p>‘I’m not a cycling fan. So we started doing the research on him in Florence. She visited <a href=\"https://www.visittuscany.com/en/attractions/gino-bartali-cycling-museum/\" target=\"_blank\">his museum</a>, which was a very modest place, and started working on it and talking to people about it. We’ve also been taking Italian lessons for the past four years.</p>\n\n\n\n<p>Their level of fluency meant the pair could look at original documents and diary entries from the people with whom Bartali was in cahoots, as well as inject a little Italian into the show in the appropriate way.</p>\n\n\n\n<p>‘We had an Italian cultural advisor who went through the script – we weren’t naive enough to think that four years of studying would enable us to do it justice,’ says Buchholz. ‘And, actually, more than a third of our cast members are Italian. So we had discussions with them and we wanted to show respect for the language and the culture. We didn’t want to be the Americans coming in telling the story in our own language. I mean, obviously it’s all in English with Italian phrases.’</p>\n\n\n\n<h2>The winner takes it all</h2>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-970x647.jpg\" alt=\"silhouette on theatre stage of man on bike with trailer attached and smoke behind\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-1536x1024.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-2048x1365.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Joshua-St.-Clair-as-Gino-Bartali-Photographer-Marc-Brenner-350x233.jpg 350w\" /><figcaption>Glory Ride</figcaption></figure>\n\n\n\n<p>Known as ‘Gino the Pious’, Bartali was a devout Catholic whose career straddled he Second World War. His two victories in the Giro d’Italia (1936 and 1937) and his first <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\" target=\"_blank\">Tour de France</a> win (1938) alongside two Milan-San Remo titles, a Lombardia hat-trick and countless other one-day races were more than enough to make him a national celebrity before the fighting that tore Europe apart made racing a bike seem trivial. His status as Italy’s favourite son meant he was granted permission to come and go from Florence as he pleased to continue training rides throughout the war – a freedom he put to remarkable clandestine use, working with Cardinal Della Costa, who was the Archbishop of Florence, and an accountant, Giorgio ‘Nico’ Nissim.</p>\n\n\n\n<p>Bartali added a third Giro in 1946 and his second Tour de France in 1948, a victory that helped unite a country staggering towards civil war when Palmiro Togliatti – the leader of the Italian Communist Party – was shot in the neck by a sniper. The wave of national pride after Bartali’s success meant fractures could instead begin to heal. Legend has it Togliatti awoke from his coma to ask how the Tour was going and, on hearing the news, called for calm. That Tour win also means Bartali remains the rider with the longest gap between his first and his final <a href=\"https://www.cyclist.co.uk/in-depth/in-celebration-of-the-yellow-jersey\" target=\"_blank\">maillot jaune</a>.</p>\n\n\n\n<div></div>\n\n\n\n<p>That’s all context. <em>Glory Ride</em>’s focus is how Bartali helped save 800 souls from Mussolini’s fascist Blackshirts. It’s a story of heroism and courage. But it’s not a story people necessarily know, as Buchholz explains:</p>\n\n\n\n<p>‘From a commercial point of view, it’s much easier to start with [writing a musical based on] a movie than sitting down with people and saying: “OK, I know you’ve never heard of him; I know you’re not a cycling fan; I know you’ve never heard of me, but have I got a story for you!”</p>\n\n\n\n<p>‘But Bartali’s story inspired us to keep writing and get it on stage. And once the West End producer community hears what the story is, they realise: “Wow!” There’s an attitude change. You start with: “How are we going to get people to come and see a story about a cyclist in Italy?”</p>\n\n\n\n<p>‘I could go to Florence or elsewhere in Italy and say: have you ever heard of Gino Bartali? And a super-high percentage of people will know he won the Tour twice, the Giro three times; he and Fausto Coppi were big rivals. But they won’t necessarily know about his heroics during the war. And that’s one of the amazing parts of it. Until he died in 2000, virtually nobody knew what he’d done. Then some older people turned to their friends or relatives and said: “Gino saved my life.” People were incredulous. It didn’t make sense.’</p>\n\n\n\n<p>Bartali never talked about his heroics much. His son Andrea told the BBC in 2014: ‘When I asked my father why I couldn’t tell anyone, he said, “You must do good, but you must not talk about it. If you talk about it, you’re taking advantage of others’ misfortunes for your own gain.” It was only a year prior to that Bartali was posthumously recognised as a Righteous Among the Nations, bestowed by the State of Israel on people who are not themselves Jewish, but who risked their lives during the Holocaust to save Jewish people.</p>\n\n\n\n<h2>Ticket to ride</h2>\n\n\n\n<figure><img width=\"970\" height=\"570\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-and-the-Company-Photographer-Marc-Brenner-970x570.jpg\" alt=\"Theatre production with World War Two dress\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-and-the-Company-Photographer-Marc-Brenner-970x570.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-and-the-Company-Photographer-Marc-Brenner-300x176.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-and-the-Company-Photographer-Marc-Brenner-768x451.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-and-the-Company-Photographer-Marc-Brenner-1536x902.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-and-the-Company-Photographer-Marc-Brenner-2048x1203.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-and-the-Company-Photographer-Marc-Brenner-750x440.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/Glory-Ride-Fed-Zanni-as-Mario-Carita-and-the-Company-Photographer-Marc-Brenner-1140x670.jpg 1140w\" /><figcaption>Glory Ride</figcaption></figure>\n\n\n\n<p>It’s the most serious of subjects. But that doesn’t mean the father-and-daughter combo and their cast don’t have an awful lot of fun with ‘Glory Ride’, too. This is a musical, after all.</p>\n\n\n\n<p>‘There is comic relief,’ says Buchholz. ‘Daniel Robinson is brilliant as Nico, the accountant who helped stitch things together… Every time I see it, I genuinely laugh at what he does with his lines and his scenes. Some might say: “That doesn’t belong in your show. This is a very serious show.” But we have moments that work because Gino’s story takes place in Italy, somewhere British audiences associate with food, family, an upbeat sense of life. If our show took place in Nuremberg and was “Schindler’s List the Musical”, it would be different to have that kind of feeling.</p>\n\n\n\n<p>‘<em>Glory Ride</em> is not simply a story about cycling or about helping persecuted people. It’s a heist. It’s a con! They’re fooling Blackshirts… So there’s an element of fun we hope audiences appreciate.’</p>\n\n\n\n<p>The production is at times gloriously hammy – the cast relish carving off one delicious slice of prosciutto after another. Take these sample lyrics from the first 10 minutes that help set the scene, with Mussolini’s Blackshirts in charge and Bartali choosing which side he’s on:</p>\n\n\n\n<p><em>See that point? See that peak? It’s calling out to me.<br />A secret I can’t keep inside<br />No I can’t stop moving<br />So I guess I’m choosing<br />My destiny<br />I was born to ride!</em></p>\n\n\n\n<p><em>All it takes is one wheel for revolution<br />One man with the resolution<br />To defy the institution<br />Rev-rev-rev-rev-revolution…<br />(I might have a solution!)</em></p>\n\n\n\n<p>That number is sung by Josh St Clair, who includes <em>Frozen</em> among the highlights of West End palmares and plays Bartali with pride and a panache the man himself was not known for. He’s clearly spent some time on the turbo trainer, too, and even shaved his legs (presumably for the role).</p>\n\n\n\n<p>‘We had a scene in the original script about shaving legs,’ says Buchholz. ‘We thought it’d be fun to have a scene where they [Bartali and his best friend Mario] shave each other’s legs. But then we thought it might just seem too odd to people, so it didn’t make it.’</p>\n\n\n\n<div> </div>\n\n\n\n<p>Buchholz is full of praise for his cast, but we have to single out Amy Di Bartolomeo’s show-stopping turn as Adriana, who would become Bartali’s wife.</p>\n\n\n\n<p>‘When she walked into the auditions, we were staggered,’ Buchholz agrees. ‘She looks like the poster from the Italian tourist bureau. She sings gloriously… In the song Promises, people screamed and applauded to interrupt. Great!’</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/reviews/film-review-the-racer\">Film Review: The Racer</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-history-bartali-rescues-italy\">Tour de France history: Bartali rescues Italy</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Men’s Tour de France 2023: 3,404km route announced</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>Don’t rain on my parade</h2>\n\n\n\n<p>Buchholz has also faced some theatreland criticism that his version of Bartali’s story lacks depth. He’s happy to defend it, ‘This is not a 12-hour mini-series! Within the constraints we had to choose to tell the most entertaining and authentic story we could… this is told in less than two hours. If people are begging for the six- or 60-hour version, I’m happy to provide that. We could do it over the course of a month, during the Tour de France.’</p>\n\n\n\n<p>This is not a criticism, but one element absent is the other side of Bartali’s character: he is still remembered by those who competed against him, according to author Herbie Sykes, as a ‘ruthless bastard’. </p>\n\n\n\n<p>‘I interviewed about 20 riders when I did my Coppi book,’ Sykes told Eurosport’s Re-Cycle podcast in 2021. ‘A lot of them were very scathing where Bartali was involved. And these were octogenarians… You tend to find as people get older, they soften a bit… But there were a lot of them who really, really didn’t like Bartali.’</p>\n\n\n\n<p>On ruthless bastards, then – one more question. Buchholz is American. He’s co-written a production about one famous cyclist. Every good story needs a villain. We have to ask: has he thought about making Lance Armstrong musical?</p>\n\n\n\n<p>‘That’s funny!’</p>\n\n\n\n<p>What would he call it? (Tyler) Hamilton?</p>\n\n\n\n<p>‘Falling on your own Lance? Interesting. But it’s hard to know whether he’s really the hero or the villain.</p>\n\n\n\n<p>‘I won’t get into politics, but there are people who’d say that if Richard Nixon didn’t have his psychological demons, if you can put that aside, he was a great President. History’s filled with people who had the devil on their shoulder who get more screen [or stage] time than maybe they should.’</p>\n\n\n\n<p><em>Glory Ride is on at Charing Cross Theatre until July 29. Book now at <a href=\"https://www.gloryridemusical.com/\" target=\"_blank\">gloryridemusical.com</a>. Cyclist readers can get 10% off with the code GRCMAG</em> </p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/glory-ride-todd-buchholz\">Les Mis meets Le Tour: The man behind the West End’s Gino Bartali musical</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Will Strickson &#124; Deputy Website Editor","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"0ddb2dea289656deef29421473578ad522d5b518f4b06d34fb257f71d84f4243","category":"Cycling"}