{"title":"Methane Emissions From the Qinghai‐Tibet Plateau Ponds and Lakes: Roles of Ice Thaw and Vegetation Zone","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024GB008106?af=R","date":1712211321000,"content":"<h2>Abstract</h2>\n<p>Comprehensive seasonal observation is essential for accurately quantifying methane (CH<sub>4</sub>) emissions from ponds and lakes in permafrost regions. Although CH<sub>4</sub> emissions during ice thaw are important and highly variable in high-latitude freshwater ponds and lakes (north of ∼50°N), their contribution is seldom included in estimates of aquatic-atmospheric CH<sub>4</sub> exchange across different alpine ecosystems. Here, we characterized annual CH<sub>4</sub> emissions, including emissions during ice thaw, from ponds and lakes across four alpine vegetation zones in the Qinghai-Tibet Plateau (QTP) permafrost region. We observed significant spatial variability in annual CH<sub>4</sub> emission rates (8.44−421.05 mmol m<sup>−2</sup> yr<sup>−1</sup>), CH<sub>4</sub> emission rates during ice thaw (0.26−144.39 mmol m<sup>−2</sup> yr<sup>−1</sup>), and the contribution of CH<sub>4</sub> emissions during ice thaw to annual emissions (3−33%) across different vegetation zones. Dissolved oxygen concentration under ice, along with substrate availability and water salinity, played critical roles in influencing CH<sub>4</sub> flux during ice thaw. We estimated annual CH<sub>4</sub> emissions from ponds and lakes in the QTP permafrost region as 0.04 (0.03−0.05) Tg CH<sub>4</sub> yr<sup>−1</sup> (median (first quartile−third quartile)), with approximately 20% occurring during ice thaw. Notably, the average areal CH<sub>4</sub> emission rate from ponds and lakes in the QTP permafrost region amounts to only 8% of that from high-latitude waterbodies, primarily due to the dominance of large saline lakes with lower CH<sub>4</sub> emission rates in the alpine permafrost region. Our findings emphasize the significance of incorporating comprehensive seasonal observation of CH<sub>4</sub> emissions across different vegetation zones in better predicting CH<sub>4</sub> emissions from alpine ponds and lakes.</p>","author":"Yang Li, \nGenxu Wang, \nShouqin Sun, \nShan Lin, \nPeng Huang, \nJinwang Xiao, \nLinmao Guo, \nJinlong Li, \nChunlin Song","siteTitle":"Wiley: Global Biogeochemical Cycles: Table of Contents","siteHash":"a2d4e750daa5e386ca7dda0c54cc50454a723cbd123b964bfed1d56a4712b632","entryHash":"0ddb91e7dc97f1e96f06ff72aec65723febc941f5cb9c5b356a97f9b3966d8e9","category":"Environment"}