{"title":"Multifractal Analysis of Standardized Precipitation Evapotranspiration Index in Serbia in the Context of Climate Change","link":"https://www.preprints.org/manuscript/202407.0618/v1","date":1720489357000,"content":"In this study the impact of climate change on drought conditions in Serbia is investigated trough the multifractal analysis of standardized precipitation evapotranspiration index (SPEI). The SPEI time series for accumulation time scale of 1, 3, 6 and 12 months were calculated using the high resolution meteorological gridded dataset E-OBS with a resolution of 0.10 in regular latitude/longitude coordinates and time span from 1961 to 2020. The multifractal analysis was performed for two standard climatic periods (1961−1990 and 1991−2020) using multifractal detrended fluctuation analysis method (MFDFA) which is suitable for nonstationary temporal series. In each of 1278 grid cells that cover Serbian territory we analyzed 4 SPEI time series for two 30 years periods (which totals 10224 MFDFA runs) and calculated multifractal spectrum parameters that describe persistence, degree of multifractality and the influence of small/large fluctuations. We found that all the analyzed SPEI series show multifractal properties with the dominance of small fluctuations. The short and medium drought conditions described by SPEI-1, SPEI-3 and SPEI-6 are persistent (the position of maximum of multifractal spectrum is in the range 0.5&amp;lt;α0&amp;lt;1), stronger persistence is found at higher accumulation time scales, while SPEI-12 time series are antipersistent (0&amp;lt;α0-1&amp;lt;0.5). The degree of multifractality (width of multifractal spectrum W) increases from SPEI-1 to SPEI-6 and decreases for SPEI-12. For all series multifractal spectrum is right skewed (skew parameter r&amp;gt;0) indicating that small SPEI temporal fluctuations contribute more to multifractality than large fluctuations. In the second period SPEI-1 SPEI-3 and SPEI-6 series become more persistent with weaker multifractality, indicating that short and medium drought conditions (which are related to soil moisture and crop stress) become easier to predict, while SPEI-12 changed toward random regime and stronger multifractality in eastern and central part of country, indicating that long term drought conditions (related to streamflow, reservoir levels, and groundwater levels) become more difficult for modeling and prediction.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0ddd960db620bd052633e7ba9aeef8329998ece58445f1e0664c5e8c002e19a1","category":"Interdisciplinary"}