{"title":"Want improved fast travel in Skyward Sword HD? Buy this $25 Amiibo!","link":"https://arstechnica.com/?p=1766030","date":1621440134000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/zeldaamiibo1-980x501.png\" /></div>\n        <p>\n          Your gateway to the skies.                  </p>\n        </div>\n      </li>\n      </ul><p>The July release of <a href=\"https://arstechnica.com/gaming/2021/02/latest-nintendo-direct-event-led-by-zelda-skyward-sword-hd-remaster/\"><em>The Legend of Zelda: Skyward Sword HD</em> on the Switch</a> will include an expanded fast-travel system that removes the need for players to trudge to specific save points before taking to the sky. But Nintendo is locking that helpful new feature behind an Amiibo figurine the company plans to sell for $25. Nintendo revealed both the Amiibo and its in-game functionality <a href=\"https://www.nintendo.com/whatsnew/detail/2021/new-zelda-and-loftwing-amiibo-figure-launches-alongside-the-legend-of-zelda-skyward-sword-hd-on-july-16/\">in an official blog post late Tuesday</a>.</p>\n<p>In the 2011 Wii release of <em>Skyward Sword</em>, Link could only transition between the surface areas and the airborne world of Skyloft at specific Bird Statues, which also served as save points. In the upcoming remake, Nintendo says players will be able to tap <a href=\"https://www.nintendo.com/amiibo/detail/zelda-and-loftwing-amiibo-the-legend-of-zelda-series/\">a new Zelda and Loftwing Amiibo</a> to the controller to hit the sky \"from anywhere on the surface world... even within the depths of a dungeon. Scan it again above the clouds to return to the same spot on the surface.\"</p>\n<p>That's bound to be a welcome feature for many players, alleviating <a href=\"https://www.gamasutra.com/view/news/167821/Analysis_Skyward_Sword_proves_that_Zelda_needs_to_evolve.php\">what Gamasutra called</a> \"boring bits of navigation back-to-back with other boring bits of navigation\" upon the game's release. Nintendo itself suggests at least one practical use for the new ability: \"If you run out of items while exploring the surface, for example, you can quickly return to the Bazaar in Skyloft to replenish your supplies. Once you’re done shopping, the Amiibo allows you to quickly zip back to the surface and pick up where you left off!\"</p></div><p><a href=\"https://arstechnica.com/?p=1766030#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1766030&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0de035dfbfcbedb6cdb0b7e3dcf0532b79d34bd8c2b4e704ad6818820ca7e295","category":"Tech"}