{"title":"Experimental Aerodynamics of a Small Fixed-Wing UAV Coated with Bio-Inspired Microfibers Under Static and Dynamic Stall","link":"https://www.preprints.org/manuscript/202410.1381/v1","date":1729231767000,"content":"A passive flow control technique in the form of microfiber coatings with diverging pillar cross-section area was applied to the wing suction surface of a small tailless unmanned aerial vehicle (UAV). The coatings are inspired from ‘gecko feet’ surfaces and their effect on aerodynamic and control surface performance is analyzed via wind tunnel experiments in static and dynamic conditions. The static angle of attack was set at a range of angles from -2◦ to 17◦, and the elevon control surface was deflected from -18.7◦ to 24.7◦. In forced oscillation, various combinations of mean angle of attack, frequency and amplitude were explored. The aerodynamic coefficients were calculated from load cell measurements for experimental variables such as microfiber pillar height, the region of the wing coated with microfibers, Reynolds number and angle of attack. Microfibers with a 140µm pillar height, when compared to the smooth wing case, provide drag reduction of up to 24.7% for CL = 0.9 at the cruise Reynolds number, whereas shorter 70µm microfibers perform better at the stall Reynolds number, with a 24.2% CD reduction for the same CL. Control surface experiments show pitch moment authority is significantly improved at higher angles of attack near stall when microfibers cover the elevon and its upstream wing region, with an increase in CM magnitude of up to 22.4%. Dynamic experiments showed that microfibers marginally increase dynamic damping in pitch, improving load factor production in response to control surface actuation at low angles of attack, but reducing it at higher angles. In general, the microfiber pillars are within the laminar boundary layer, and create a periodic slip condition on the top surface of the pillars which increases the near-wall momentum over the wing surface. This mechanism is particularly effective in mitigating flow separation at high angles of attack, reducing pressure drag and restoring pitching moment authority provided by control surfaces.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0de28205bf2a87774eed7e9cd49d7dda08d48dcd15af6dfabf16e8cef9d727c4","category":"Interdisciplinary"}