{"title":"9th-Generation iPad Reviews: An Even Better Value With More Storage and a Better Front Camera","link":"https://www.macrumors.com/review/ipad-2021/","date":1632326964000,"content":"In addition to the sixth-generation <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a>, the ninth-generation <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> also saw its review embargo lift today, with reviewers generally feeling that the iterative update hits most of the right notes in terms of prioritizing upgrades to storage, performance, and the front camera.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/ipad-2021-cnet.jpg\" /><em>Photo via CNET</em></div>\r\n<br />\r\nAs an overall take, <a href=\"https://www.cnet.com/tech/computing/apple-ipad-9th-gen-review-the-safest-ipad-bet-makes-more-sense-than-ever/\"><em>CNET</em>'s Scott Stein</a> argues that the \"good enough\" entry-level ‌iPad‌ actually \"covers all the bases best\" out of Apple's entire ‌iPad‌ lineup at the moment.\r\n<br />\r\n\r\n<br />\r\nStein notes that iPads are most often secondary devices and especially popular with families, and pricing on the entry-level ‌iPad‌ makes it a compelling product that offers much of the functionality people are looking for in an ‌iPad‌ without breaking the bank.<blockquote>Seriously: The iPad Mini costs more, lacks the same keyboard support and is probably too small. Last year's iPad Air is good but lacks Center Stage (but if it's on sale, it may be worth snapping up). And the iPad Pro is great but it's expensive.\r\n<br />\r\n\r\n<br />\r\nFor 2021, I think the basic unexciting iPad wins out. Especially for the price, which usually hits $300 for holiday season sales.</blockquote>\r\n<br />\r\n<h3>Storage</h3>\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/ipad-2021-toms-guide.jpg\" /><em>Photo via Tom's Guide</em></div>\r\n<br />\r\nOne of the most welcome improvements in the new ‌iPad‌ is an increase in the base storage from 32 to 64 GB, although even that may not be enough for some users, as <a href=\"https://www.tomsguide.com/reviews/ipad-2021\">highlighted by <em>Tom's Guide</em></a>:<blockquote>Apple has doubled the storage capacity of the iPad compared to previous generations, bumping the entry-level $329 model up from 32 to 64 GB and the $479 upgraded storage model up from 128 to 256 GB.  [...] The storage upgrade is a significant and welcome change, as it’s hard to enjoy all the functionality of an iPad when you have less than 32 GB of storage for all your photos, movies, apps, and games. [...]\r\n<br />\r\n\r\n<br />\r\nOf course, the price of upgrading to the model with more has storage also increased, up to $150 instead of the $100 it used to cost. Still, we recommend paying the upgrade cost if you plan to be downloading a lot of apps and HD media, as 64 GB still isn’t an impressive amount of storage space.</blockquote>\r\n<br />\r\n<h3>Front camera</h3>\r\n<br />\r\n\r\n<br />\r\n<a href=\"https://gizmodo.com/apples-cheapest-ipad-is-its-most-reliably-good-one-1847713113\"><em>Gizmodo</em>'s Caitlin McGarry</a> highlights the improvements to the front-facing camera, which include vastly improved resolution and the Center Stage feature that uses the Ultra Wide front camera lens to automatically keep you centered on camera even as you move.<blockquote>One of the biggest upgrades on the ninth-gen iPad over last year’s model is the front-facing camera, which has been jacked up from a 1.2-MP lens to a 12-MP one. The difference is huge. Huge! I no longer look like a grainy, 2004-era me when I make video calls on the new iPad, and the Neural Engine-powered Center Stage feature makes it so I can move around while chatting (perfect for calls while cooking).</blockquote>McGarry doesn't love that the front camera remains positioned to the left of the display when the ‌iPad‌ is used in landscape orientation, but that's obviously a criticism that would apply to Apple's entire ‌iPad‌ lineup rather than this model specifically.\r\n<br />\r\n\r\n<br />\r\n<h3>A13 Bionic chip</h3>\r\n<br />\r\n<a href=\"https://arstechnica.com/gadgets/2021/09/2021-329-ipad-review-the-good-enough-ipad-gets-a-little-better/\"><em>Ars Technica</em>'s Andrew Cunningham</a> looks at the A13 Bionic chip in the new ‌iPad‌, up from the A12 chip in the previous-generation model, calling it a \"nice generational bump\" but \"not transformative.\"<blockquote>The 8th-gen iPad’s jump from the Apple A10 to the A12 was a major improvement that made a meaningful difference in day-to-day use. The jump from A12 to A13 isn’t as big. You’re looking at a 20 or 30 percent improvement in processor speed and between 25 and 40 percent faster performance in games and other 3D-heavy apps. That’s a nice generational bump, but it’s not transformative—the A12 and A13 both feel like a big jump if you’re upgrading from an older iPad with an A9 or A10 in it, though.</blockquote>\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/ipad-2021-ars-geekbench.jpg\" /><em>Geekbench multi-core results via Ars Technica</em></div>\r\n<br />\r\n<a href=\"https://www.cnn.com/2021/09/22/cnn-underscored/apple-ipad-9-gen-review/index.html\"><em>CNN</em>'s Jacob Krol</a> agrees, noting that performance is \"not a night and day upgrade\" but that the new ‌iPad‌ handles everything but the most intense tasks smoothly and will offer a bit more futureproofing compared to the A12 in the eighth-generation model.\r\n<br />\r\n\r\n<br />\r\n<h3>Battery life</h3>\r\n<br />\r\nSeveral reviewers looked at battery life, with <em>Gizmodo</em> finding that the entry-level ‌iPad‌ lasted just a bit longer than the <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a> in a video-streaming test at 10 hours and 42 minutes, also handily beating the 12.9-inch <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>. <em>CNN</em>'s video-streaming battery test yielded 9 hours and 45 minutes, a 25-minute increase compared to the previous-generation ‌iPad‌.\r\n<br />\r\n\r\n<br />\r\n<h3>Wrap-up</h3>\r\n<br />\r\nOverall, reviewers found that the ninth-generation ‌iPad‌ continues to offer the solid value that has made Apple's cheapest ‌iPad‌ its most popular model over the years. With its closest competitors the ‌iPad Air‌ and ‌iPad mini‌ having both received significant updates recently, the base ‌iPad‌ is definitely looking a bit dated with its big bezels, traditional Home button, Lightning connector, and unchanged overall design, but it continues to get the job done at the right price for many.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPad\">iPad (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ipad.137\">iPad</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/ipad-2021/\">9th-Generation iPad Reviews: An Even Better Value With More Storage and a Better Front Camera</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/9th-generation-ipad-reviews-an-even-better-value-with-more-storage-and-a-better-front-camera.2312650/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=_wupo5sryjE:QRtCdLN4IPg:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=_wupo5sryjE:QRtCdLN4IPg:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/_wupo5sryjE\" />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0de3152ad65f9981adaa14cbeb31f0624d242ef1344f9778d5760fe2e0245428","category":"Apple"}