{"title":"iPad Mini 6 Screen Distortion Complaints Surface, But No Evidence Yet That It's a Widespread Issue","link":"https://www.macrumors.com/2021/10/06/ipad-mini-6-screen-discoloration-distortion/","date":1633514523000,"content":"Following complaints of \"<a href=\"https://www.macrumors.com/2021/09/27/ipad-mini-6-jelly-scroll-issue-vertical/\">jelly scrolling</a>\" on the <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a> 6 display, another issue has gained traction online that also has to do with the device's 8.3-inch Liquid Retina LCD panel.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iPad-mini-6-orange-BG.jpg\" />\r\n<br />\r\nA <a href=\"https://www.reddit.com/r/apple/comments/q1zpj6/ipad_mini_6_screen_clearance_issue_causing/\">poster on Reddit</a> brought attention to a discoloration and distortion issue that they were having when touching the screen with the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> in portrait orientation.\r\n<br />\r\n<blockquote>I got my 64gb Wi-Fi iPad Mini 6 just about a week ago and noticed that there seems to be an LCD clearance issue – if you put your mini in vertical orientation (with the power button on the top right) push very lightly on the screen and you will see distortion and discoloration about an inch down and in from the top right. On most models this will happen in three spots along the top of the display (when vertical).</blockquote>The Redditor claims they received a replacement from Apple, except the new device had the same problem, \"but worse.\" While a handful of users replied to the original poster saying they were experiencing a similar issue – although for one or two, it was reportedly evident in another part of the display – most users who engaged with the post were unable to replicate it on their own device. \r\n<br />\r\n\r\n<br />\r\nFor what it's worth, <em>MacRumors</em> was unable to reproduce a similar distortion effect around the area suggested in the top-right corner of the ‌iPad mini‌'s screen. It is possible to create distortion where the finger makes contact anywhere on the display, but only by exerting unwarranted pressure. But then the same effect is demonstrable on any LCD panel when applying undue pressure, so we were unconvinced that what we were seeing was evidence of a mass defect with the panel in the ‌iPad mini‌ 6. \r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\nUsers seeing a similar issue as to the one demonstrated in the above video have the option of taking their ‌iPad mini‌ 6 to an <a href=\"https://www.macrumors.com/guide/apple-store/\">Apple Store</a> or Repair Center to ask for a replacement unit.\r\n<br />\r\n\r\n<br />\r\nAs for the jelly scrolling issue, Apple has <a href=\"https://www.macrumors.com/2021/09/28/apple-jelly-scrolling-normal-behavior/\">said</a> that the effect is normal behavior for an LCD screen, and that likely means the company does not plan to offer replacements for users who are seeing this issue. For that reason, those unhappy with the ‌‌iPad mini‌‌'s display should make sure to return the tablet within its 14 day return window.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPad_Mini\">iPad Mini (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ipad.137\">iPad</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/06/ipad-mini-6-screen-discoloration-distortion/\">iPad Mini 6 Screen Distortion Complaints Surface, But No Evidence Yet That It's a Widespread Issue</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ipad-mini-6-screen-distortion-complaints-surface-but-no-evidence-yet-that-its-a-widespread-issue.2315631/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=X54XjFB8KpY:2G4BOumdVQs:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=X54XjFB8KpY:2G4BOumdVQs:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/X54XjFB8KpY\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0de7ad3cff8fe196a60dbdb91749f5c602c72f4575cdf4a69f5c565044c2f904","category":"Apple"}