{"title":"Down‐regulating lncRNA KCNQ1OT1 relieves type II alveolar epithelial cell apoptosis during one‐lung ventilation via modulating miR‐129‐5p/HMGB1 axis induced pulmonary endothelial glycocalyx","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24201?af=R","date":1710506132000,"content":"<h2>Abstract</h2>\n<h2>Objective</h2>\n<p>Endothelial glycocalyx (EG) maintains vascular homeostasis and is destroyed after one-lung ventilation (OLV)-induced lung injury. Long noncoding RNAs (lncRNAs) are critically involved in various lung injuries. This study aimed to investigate the role and regulatory mechanism of KCNQ1 overlapping transcript 1 (KCNQ1OT1) in OLV-induced lung injury and LPS-induced type II alveolar epithelial cell (AECII) apoptosis.</p>\n<h2>Methods</h2>\n<p>The rat OLV model was established, and the effects of KCNQ1OT1 on OLV-induced ALI in vivo were explored. Bax and Caspase-3 expression in rat lung tissues was measured by immunochemistry (IHC). AECIIs were isolated from rat lungs and treated with LPS or normal saline (control) for in vitro analysis. The expression of KCNQ1OT1, miR-129-5p, and HMGB1 was measured by quantitative real-time PCR (qRT-PCR) or Western blot (WB). Cell proliferation and apoptosis were examined by 3-(4,5)-dimethylthiahiazo (-z-y1)-3,5-di- phenytetrazoliumromide (MTT) and flow cytometry. The downstream targets of KCNQ1OT1 were predicted by bioinformatics, and the binding relationship between KCNQ1OT1 and miR-129-3p was verified by dual-luciferase reporter assays. The potential target of miR-129-5p was further explored on the Targetscan website and revealed to target HMGB1. Enzyme-linked immunosorbent assay (ELISA) or WB was adopted to determine the levels of IL-1β, TNF-α, MDA, SOD, heparanase (HPA), matrix metalloproteinase 9 (MMP9), heparan sulfate (HS) and syndecan-1 (SDC-1).</p>\n<h2>Results</h2>\n<p>KCNQ1OT1 and HMGB1 were up-regulated during OLV-induced lung injury, and their expression was positively correlated. KCNQ1OT1 knockdown reduced OLV-induced pulmonary edema and lung epithelial cell apoptosis, increased vascular permeability, reduced IL-1β, TNF-α, MDA, and SOD levels and glycocalyx markers by targeting miR-129-5p or upregulating HMGB1. Overexpressing KCNQ1OT1 promoted cell apoptosis, reduced cell proliferation, aggravated inflammation and oxidative stress, and up-regulated HMGB1, HPA and MMP9 in LPS-treated AECIIs, while the HMGB1 silencing showed the opposite effects. MiR-129-5p mimics partially eliminated the KCNQ1OT1-induced effects, while recombinant HMGB1 restored the effects of miR-129-5p overexpression on AECIIs. Additionally, KCNQ1OT1 was demonstrated to promote the activation of the p38 MAPK/Akt/ERK signaling pathways in AECIIs via HMGB1.</p>\n<h2>Conclusion</h2>\n<p>KCNQ1OT1 knockdown alleviated AECII apoptosis and EG damage during OLV by targeting miR-129-5p/HMGB1 to inactivate the p38 MAPK/Akt/ERK signaling. The findings of our study might deepen our understanding of the molecular basis in OLV-induced lung injury and provide clues for the targeted disease management.</p>","author":"Zhenghuan Song, \nZhongqiu Wang, \nJiaqin Cai, \nYihu Zhou, \nYueyi Jiang, \nJing Tan, \nLianbin Gu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"0dea27c097fe38733073c63fb840e651ae5828ae252bd212865a664722dbaced","category":"Environment"}