{"title":"A specific and sensitive GC–MS-MS method for the quantitative determination of 2-phenoxyethanol and selected metabolites in human blood and urine","link":"https://academic.oup.com/jat/article/48/6/419/7658300?rss=1","date":1713916800000,"content":"<span><div>Abstract</div><strong>2-Phenoxyethanol (PhE) is widely used as a preservative in consumer products such as cosmetics as well as at the workplace as a component of metal-working fluids and hydraulic fluids. Therefore, both industry workers and consumers may potentially be exposed to PhE. An analytical method for the quantification of PhE and three selected metabolites, namely phenoxyacetic acid (PhAA), 4-hydroxyphenoxyacetic acid (4-OH-PhAA), and 4-hydroxyphenoxyethanol (4-OH-PhE), in human urine and blood was developed and validated. The sample preparation includes enzymatic hydrolysis of urine samples or protein precipitation of blood samples, followed by liquid</strong>–<strong>liquid extraction and silylation of the target analytes. Analyses of the extracts were carried out by gas chromatography with tandem mass spectrometry (GC</strong>–<strong>MS-MS). 3,4-Hydroxyphenoxyethanol, a probably minor PhE metabolite, could not be reliably analyzed due to its instability. The limits of quantification (LOQ) of the analytes ranged between 0.5 and 6.1 μg/L and 2.0 and 3.9 μg/L in urine and blood, respectively. The method was successfully applied to spot urine samples of 50 individuals without occupational exposure to PhE and additionally to blood samples from seven volunteers. In urine, PhAA and 4-OH-PhAA could be quantified in all analyzed samples, whereas 4-OH-PhE and unchanged PhE were found in 36% and 32% of the samples, respectively. In blood, PhAA was also found in every sample in levels above the LOQ, whereas PhE itself was detected in three of seven samples only. Neither 4-OH-PhAA nor 4-OH-PhE was found in any of the analyzed blood samples. The developed method promises to be a valuable tool for PhE monitoring of urine and blood samples and may also enable an advanced investigation of PhE biotransformation pathways in humans</strong>.</span>","author":"","siteTitle":"Journal of Analytical Toxicology Current Issue","siteHash":"684cff8c881f5537e121ec409f4017c5ba6630e2a004f9595c9e918ac4254c23","entryHash":"0deb0f3c900edbef73c193c7ea2dfc62cc937de35dfe0cd7648cea2047f33ed7","category":"Environment"}