{"title":"Popular Cat Adventure Game 'Stray' Coming to the Mac","link":"https://www.macrumors.com/2023/06/01/stray-game-coming-to-mac/","date":1685660520000,"content":"\"Stray,\" an adventure game that lets players take on the role of a cat, will soon be available on the Mac. Introduced in 2022, Stray has previously been limited to Windows machines and PlayStation consoles.\r<br />\n\r<br />\n<div></div>\r<br />\nIn Stray, a stray cat finds himself stuck in a walled city filled with robots and mutant bacteria. The cat must make his way back up to the surface with the help of B-12, his drone companion.\r<br />\n\r<br />\nStray offers third-person gameplay and it requires players to solve puzzles, bypass obstacles, and complete quests while avoiding monsters like Zurks (evil bacteria) and Sentinels (security bots). Much of the game is platform-based, involving climbing up various obstacles and interacting with the environment to open up new pathways. There are cat behaviors too, of course, such as sneaking, sleeping, meowing, and nuzzling up to NPCs to get pets.\r<br />\n\r<br />\nOn the Mac, Stray will take advantage of MetalFX Upscaling for accelerated graphics performance with high quality visuals, and it will be available to play on Apple silicon Macs.\r<br />\n\r<br />\nThere is no launch date for Stray as of yet, but it is coming to the Mac \"this year.\"\r<br />\n\r<br />\nStray for Mac will follow the <a href=\"https://www.macrumors.com/2023/06/01/no-mans-sky-for-mac-now-available/\">launch of No Man's Sky for Mac</a>, which is available on Apple silicon machines as of today.<br />This article, \"<a href=\"https://www.macrumors.com/2023/06/01/stray-game-coming-to-mac/\">Popular Cat Adventure Game 'Stray' Coming to the Mac</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/popular-cat-adventure-game-stray-coming-to-the-mac.2391309/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0dfd8b6a2bae905b68066388ab493e11f311fdaa8fd0b4b4001a84bdea1a5505","category":"Apple"}