{"title":"Experimental Investigation of Steel-Borne Acoustic Pulses for Fault Pinpointing in Pipe-Type Cable Systems: A Scaled-Down Model Approach","link":"https://www.preprints.org/manuscript/202410.1461/v1","date":1729254052000,"content":"Pipe-type cable systems, including high-pressure fluid-filled (HPFF) and high-pressure gas-filled (HPGF) cables, are widely used for underground high-voltage transmission. These systems consist of insulated conductor cables within steel pipes, filled with pressurized fluids or gases for insulation and cooling. Despite their reliability, faults can occur due to insulation degradation, thermal expansion, and environmental factors. As many circuits exceed their 40-year design life, efficient fault localization becomes crucial. Fault location involves pre-location and pinpointing. Therefore, a novel fully pinpointing approach for pipe-type cable systems is proposed, utilizing accelerometers mounted on the steel pipe to capture fault-induced acoustic signals and employing a time difference of arrival (TDOA) method to accurately pinpoint the location of the fault. Experimental investigations utilized a scaled-down HPFF pipe-type cable system model, featuring a carbon steel pipe, high-frequency accelerometers, and both mechanical and capacitive discharge methods for generating acoustic pulses. Tests evaluated propagation velocity, attenuation, and pinpointing accuracy with the pipe in various embedment conditions. Results demonstrated accurate fault pinpointing within centimeters, even in fully embedded pipes, with acoustic pulse velocities close to theoretical values. These findings highlight the potential of the novel acoustic pinpointing technique presented in this study to improve fault localization in underground systems, enhance grid reliability, and reduce outage. Further research is recommended to validate this technique on full-scale systems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0dff3690db39ad4bbe4e08d9f4e38bf9153ff4a221e77bde03b9b317b2bac178","category":"Interdisciplinary"}