{"title":"Polestar 2 gets new motor and battery for MY24 refresh, and it’s a winner","link":"https://arstechnica.com/?p=1965481","date":1694001630000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/2024-Polestar-2-1-800x600.jpg\" alt=\"A white polestar 2 parked next to a colorful sculpture of a triceratops\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/2024-Polestar-2-1-scaled.jpg\">Enlarge</a> <span>/</span> When you see a brightly colored triceratops by the side of the road you should probably check it out. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Polestar provided flights from Washington, DC, to Denver and back and two nights in a hotel so we could drive the model-year 2024 Polestar range. Ars does not accept paid editorial content.</aside>\n<p>DENVER—A car's midlife refresh is, more often than not, a mostly cosmetic affair—new light clusters or a changed front fascia, perhaps a new interior. Truth be told, the styling tweaks to the model year 2024 Polestar 2 are subtle—you might notice new wheel designs, and the ersatz front grille has been replaced with a body-colored panel. Instead, Polestar concentrated on tweaking the bits you can't see, making the car more efficient and, in the case of the cheaper, single-motor version, a lot more fun to drive, too.</p>\n<p>When Polestar first launched the Polestar 2 in 2020, it did so with <a href=\"https://arstechnica.com/cars/2020/08/the-2021-polestar-2-has-a-great-cabin-and-deep-android-integration/\">a dual-motor all-wheel drive version</a>, followed by <a href=\"https://arstechnica.com/cars/2022/06/the-2023-polestar-2-single-motor-proves-basic-doesnt-mean-boring/\">a more affordable single-motor model</a>. Although the more expensive, more powerful version was faster, as is often the case with electric vehicles, I found the supposedly lesser car the one to go for. It's this version that has had the most attention paid to it in the refresh, most notably the fact that its single motor now powers the rear wheels, not the front.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/2024-Polestar-2-2-scaled.jpg\"><img alt=\"The Polestar 2's interior is little changed, but that's good because we already loved it. The Android Automotive infotainment system includes Apple CarPlay and Android Auto.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/2024-Polestar-2-2-980x735.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/2024-Polestar-2-2-scaled.jpg\">The Polestar 2's interior is little changed, but that's good because we already loved it. The Android Automotive infotainment system includes Apple CarPlay and Android Auto.</a> (credit: Jonathan Gitlin)</p></div>\n<p>Polestar has developed a new electric motor that's significantly more powerful than the one it replaces, outputting 299 hp (220 kW) and 361 lb-ft (490 Nm). That's a 29 percent boost in power and 48 percent more torque than the previous single-motor model.</p></div><p><a href=\"https://arstechnica.com/?p=1965481#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1965481&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0e03f1cc606962948a5eb122938d85003b339d4f4bd387b202618a8c910d2941","category":"Tech"}