{"title":"Challenges and advances in measuring phenotypic convergence","link":"https://academic.oup.com/evolut/article/78/8/1355/7678876?rss=1","date":1716249600000,"content":"<span><div>Abstract</div>Tests of phenotypic convergence can provide evidence of adaptive evolution, and the popularity of such studies has grown in recent years due to the development of novel, quantitative methods for identifying and measuring convergence. These methods include the commonly applied <span>C</span>1–<span>C</span>4 measures of <a href=\"#CIT0054\">Stayton (2015a)</a>, which measure morphological distances between lineages, and Ornstein–Uhlenbeck (OU) model-fitting analyses, which test whether lineages converged on shared adaptive peaks. We test the performance of <span>C</span>-measures and other convergence measures under various evolutionary scenarios and reveal a critical issue with <span>C</span>-measures: they often misidentify divergent lineages as convergent. We address this issue by developing novel convergence measures—<span>Ct</span>1–<span>Ct</span>4-measures—that calculate distances between lineages at specific points in time, minimizing the possibility of misidentifying divergent taxa as convergent. <span>Ct</span>-measures are most appropriate when focal lineages are of the same or similar geologic ages (e.g., extant taxa), meaning that the lineages’ evolutionary histories include considerable overlap in time. Beyond <span>C</span>-measures, we find that all convergence measures are influenced by the position of focal taxa in phenotypic space, with morphological outliers often statistically more likely to be measured as strongly convergent. Further, we mimic scenarios in which researchers assess convergence using OU models with a priori regime assignments (e.g., classifying taxa by ecological traits) and find that multiple-regime OU models with phenotypically divergent lineages assigned to a shared selective regime often outperform simpler models. This highlights that model support for these multiple-regime OU models should not be assumed to always reflect convergence among focal lineages of a shared regime. Our new <span>Ct</span>1–<span>Ct</span>4-measures provide researchers with an improved comparative tool, but we emphasize that all available convergence measures are imperfect, and researchers should recognize the limitations of these methods and use multiple lines of evidence to test convergence hypotheses.</span>","author":"","siteTitle":"Evolution Current Issue","siteHash":"a2040112c8b98efe6d76767c53ee42b7ea8ce26086ad99269623cfcce66a3405","entryHash":"0e0d6eaff76810ec02dfedb91bcc49e9e36479c25e4bb38cbb4cc9428834cfd9","category":"Environment"}