{"title":"PSV-7 greatOPlus (extruded blend of flaxseed and Nannochloropsis oculata biomass) improves finishing cattle performance and carcass characteristics","link":"https://academic.oup.com/jas/article/102/Supplement_2/339/7664782?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Our objective was to investigate impact of feeding greatOPlus (GOP), an extruded mixture of flaxseed and <span>Nannochloropsis</span> microalgae biomass (NBO3 Technologies LLC; Manhattan, KS) on feedlot cattle performance and carcass characteristics. Yearling steers (n = 700; 374 ± 8.2 kg initial body weight) were blocked by initial body weight and assigned randomly, within block, to 28 feedlot pens containing 25 animals/pen. Cattle were vaccinated against viral and clostridial pathogens and treated for internal and external parasites (Bovishield Gold 5, Ultrabac 7 Somubac, and Dectomax injectable; Zoetis Animal Health), and implanted with a combination implant (Component TE-200; Elanco USA). The control diet (CON) consisted of 58.3% steam-flaked corn, 20% wet corn gluten feed, 2.56% soybean meal, and 4.17% vitamin/mineral/feed additive premix. For the GOP diet, a portion of the corn and all of the soybean meal were replaced with 10% GOP (dry basis) to create isonitrogenous diets. Cattle were fed once daily, ad libitum. After 175 d on feed, animals were weighed and transported to a commercial abattoir for harvest. Animal performance measurements included average daily gain (ADG), dry matter intake (DMI), and gain to feed ratio (G:F). Hot carcass weight (HCW) and incidence of abscessed livers were assessed on the day of harvest, and marbling score, 12th rib fat thickness, longissimus muscle area, and USDA yield and quality grades were determined following 48 hours of refrigeration. Cattle fed GOP had greater DMI and ADG (<span>P</span>&lt; 0.05) compared with cattle fed CON, but G:F was not affected by treatment (<span>P</span> &gt; 0.10). Cattle fed GOP had greater HCW compared with those fed CON (422.8 vs 409.5 kg; <span>P</span> &lt; 0.01) and tended to produce more Prime and Choice carcasses (87.4 vs 83.0%; <span>P</span> = 0.11) with greater 12th rib backfat (1.55 vs 1.49 cm; <span>P</span> &lt; 0.02) and greater yield grades (2.91 vs 2.75; <span>P</span> &lt; 0.01). Marbling score (488 vs 491), longissimus muscle area (94.1 vs 93.4 cm<sup>2</sup>) and liver abscess incidence (12 vs 16% for CON and GOP, respectively) were unaffected by treatment (<span>P</span> &gt; 0.10). Carcass values were calculated using base prices, premiums, and discounts published by USDA, and were greater for cattle fed GOP compared with cattle fed the control diet ($2,122 vs $2,059; <span>P</span> &lt; 0.01). Including greatOPlus at 10% of the diet dry matter improved cattle performance, largely as a result of its impact on DMI and ADG.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0e192fcf755e20ac4d317cfe6f419924b70ab536185ea5823bef518105b613a8","category":"Environment"}