{"title":"Mammal taphonomy from a singular Late Pleistocene debris‐flow tank deposit in northeastern Brazil","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3558?af=R","date":1690202161000,"content":"<h2>ABSTRACT</h2>\n<p>An integrated taphonomic analysis was applied to a tank deposit from the Zabelê Palaeontological Site (ZPS) in northeast Brazil. The unique sedimentological evidence documents the origin of the mammal assemblage via debris flow. Optically stimulated luminescence (OSL) dates put the ZPS in the later Marine Isotope Stage (MIS) 3, which was a time when it was colder and there were fewer trees. The study revealed that the Zabelê's periphery accumulation was the result of the short transport of specimens and their entrainment by debris flow. This hydraulic transport caused the preferential orientation of the bioclasts (north–southwest). Comparisons were made with other Pleistocene tank deposits, suggesting the occurrence of common megamammal taxa. Temporal mixing was evidenced by the long time interval recorded by OSL ages and the co-occurrence of distinct degrees of fragmentation, weathering, and fossil diagenesis. Permineralization and staining of Fe<sup>3+</sup> and Mn colour patterns were identified as fossilization processes with preservation of the original bone hydroxyapatite without substitution. The comparison with other tank deposits revealed common signatures (disarticulated and fragmented with moderate abrasion) and signs of reworking. Finally, the savanna-adapted herbivore megamammals from ZPS, such as <i>Eremotherium</i>, <i>Notiomastodon, Toxodon</i>, and <i>Glyptotherium</i>, are congruent with the forest decline from MIS 3 to the Last Glacial Maximum.</p>","author":"Luana Cardoso De Andrade, \nÉdison Vicente Oliveira, \nHermínio Ismael De Araújo Júnior, \nFernando Henrique De Souza Barbosa","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"0e1bd69ecf295709548fead28a0710134613eccc4948da2de156cf1b6ebb187e","category":"Environment"}