{"title":"Protective effect of the branched short‐chain fatty acid isobutyrate on intestinal damage in weaned piglets through intestinal microbiota remodeling","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13930?af=R","date":1729085958000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Postweaning intestinal damage in piglets is a challenging issue in the livestock industry. Short-chain fatty acids (SCFAs) are important metabolic products of the gut microbiota and are widely recognized for their role in maintaining normal colonic function and regulating the intestinal immune system. However, the effects of branched short-chain fatty acid (BSCFA) isobutyrate on intestinal health remain largely unknown. This study aims to explore the potential of isobutyrate for alleviating postweaning intestinal damage.</p>\n<h2>RESULTS</h2>\n<p>This study indicates that isobutyrate can alleviate diarrhea in weaned piglets, enhance their growth performance, and optimize the gut microbiota. This is mainly achieved through increasing the relative abundance of probiotic bacteria such as <i>Lactobacillus</i>, <i>Megasphaera</i>, and <i>Prevotellaceae_UCG-003</i>, while concurrently reducing the relative abundance of potentially harmful bacteria such as <i>Clostridium_sensu_stricto-1</i> and <i>Escherichia-Shigella</i>. It promotes the production of SCFAs, including acetate, isobutyrate, and butyrate. Furthermore, it activates G-protein-coupled receptors (GPR43/109A), inhibits the TLR4/MyD88 signaling pathway, strengthens the intestinal barrier function, and regulates the expression of related cytokines.</p>\n<h2>CONCLUSION</h2>\n<p>In summary, exogenous isobutyrate can be considered a promising feed additive for improving the intestinal microbiota and regulating intestinal health in piglets. © 2024 Society of Chemical Industry.</p>","author":"Xiuyu Fang, \nZhengyi Wang, \nQinrui Chen, \nYongqing Du, \nHaowen Sun, \nHaiyang Liu, \nYe Feng, \nZhongyu Li, \nTeng Teng, \nBaoming Shi","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"0e1cbbfb929e91ef2f911d138f2f703d3cadcbe27f2293af51129cb3d38e8f5d","category":"Environment"}