{"title":"Optimization of cultivar, germination time and extraction for radish sprout extract with high sulforaphene content","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13357?af=R","date":1718348660000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Cruciferous vegetable sprout has been highlighted as a promising functional material rich in bioactive compounds called isothiocyanates (ITCs) and it can be grown in very short periods in controlled indoor farms. However, because ITCs content depends on multiple factors such as cultivar, germination time and myrosinase activity, those variables need to be controlled during germination or extraction to produce functional materials enriched in ITCs. Sulforaphene (SFEN), an ITC found primarily in radishes (<i>Raphanus sativus</i> L.), exerts beneficial effects on obesity. However, the optimal germination and extraction conditions for radish sprout (RSP) to increase SFEN content remain unascertained, and the extract's anti-obesity effect has yet to be evaluated.</p>\n<h2>RESULTS</h2>\n<p>The present study found that the SFEN content was highest in purple radish sprout (PRSP) among the six cultivars investigated. Optimal SFEN content occurred after 2 days of PRSP germination (2 days PRSP). To maximize the dry matter yield, total ITCs and SFEN contents in RSP extract, we found the optimal conditions for extracting PRSP [27.5 °C, 60 min, 1:75.52 solute/solvent (w/v), no ascorbic acid] using response surface methodology. Consistent with high SFEN content, 2 days PRSP extract significantly outperformed 3 days or 4 days PRSP extract in inhibiting lipid accumulation in 3T3-L1 cells. Moreover, 2 days PRSP extract suppressed adipogenesis and lipogenesis-related protein expression.</p>\n<h2>CONCLUSION</h2>\n<p>Regarding the cultivar, germination time and extraction conditions, optimally produced PRSP extract contains high SFEN content and exerts anti-obesity effects. Thus, we suggest PRSP extract as a potent functional material for obesity prevention. © 2024 Society of Chemical Industry.</p>","author":"Gi Hyun Hur, \nTae Kyung Lee, \nYeon‐Jin Cho, \nJong Hun Kim, \nJung Han Yoon Park, \nHee Yang, \nKi Won Lee","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"0e2f73d07b81aae6038e85b96a9c0bc2d408268d2c6393396211f199094745a5","category":"Environment"}