{"title":"Data analysis and inflection point generation algorithm for RPN intermediate range detectors in active nuclear power plants","link":"https://www.preprints.org/manuscript/202406.1156/v1","date":1718620870000,"content":"The nuclear reactor measurement system is a crucial component of the nuclear measurement system in a nuclear power plant. Its primary function is to measure the power distribution within the reactor core using detectors, calibrate, and provide data on core fuel consumption. Therefore, the study of the detectors' reliability is crucial for ensuring the safe operation of the nuclear power system. The article describes the operational mechanism of the gas ionization chamber detector utilized in the intermediate-range detector of the off-board nuclear measurement system. It also analyzes the movement of particles between the plates during the ionization process of the nuclear reaction taking place in the detector. The functional relationship between the current in the recombination region and the ionization region involved in the actual working condition, and the change with the increase of voltage between the plates, is deduced. A mathematical model is established for the number of pulses generated between the plates and the magnitude of the voltage between the plates. Subsequently, the change in the offset of the voltage corresponding to the inflection point of the ping curve and the change rule of the slope of the ping curve are investigated. Combined with the analysis of experimental data, the results show that the initial particle energy of Ar+, the primary sensitive particle on the detector surface, follows a normal distribution and is influenced by the energy loss associated with the initial velocity and the voltage between the plates. The trends of the inflection points and slopes of the ping curves can be utilized to evaluate the performance and operational status of the detector. Combined with the results of the experimental data analysis, the fit is good, and the inflection point currents in the normal state decrease by about 1.5% annually. The intelligent diagnostic system, based on the method studied in this paper, has been successfully implemented in the RPN digital retrofit and upgrade project at Qinshan No. 2 Plant.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0e34af8e706cb1b7b910d20b8f86c0d4fabd3d46d45c985224c6caeb86970b52","category":"Interdisciplinary"}