{"title":"The Effectiveness of Nerve Regeneration with Decellularized Xenogeneic Nerve Grafts in a Rat Sciatic Nerve Model","link":"https://www.preprints.org/manuscript/202405.1447/v1","date":1716375007000,"content":"This study aimed to evaluate the effectiveness of decellularized nerves for promoting nerve regeneration by transplanting them from the sciatic nerve of a rabbit to that of a rat. The Sciatic nerves were harvested from New Zealand White Rabbits (n=4). A 1-cm segment of each nerve was decellularized by Sondell’s protocol and preserved at –4℃ in Roswell Park Memorial Institute (RPMI) 1640 medium for one week. Subsequently, a defect of a similar size was created in the sciatic nerves of rats. The decellularized nerves treated with detergent were then transplanted into these defects in the rats. The study included the three following groups: Group 1 (n=4) was the decellularized xenogeneic nerve group; Group 2 (n=7) was the negative control group in which the defect remained un-repaired; and Group 3 (n=5) was composed of the positive control group where the nerve was immediately transplanted from one rat to another. The sciatic functional index (SFI) was considered to evaluate the motor function by comparing it with the normal side at 1, 2, 3, and 4 weeks, and 1, 2, and 3 months postoperatively. Furthermore, electrophysiological and immunohistochemical assessments were conducted at 4 months. Immunohistochemically, at 16 weeks postoperative, the experimental group did not show statistically significant differences compared to controls in terms of schwann cell comparison, yet exhibited favorable outcomes when compared to the positive control group. Additionally, analysis of motor function test confirmed recovery of latency and nerve conduction velocity to levels similar to those of the normal side. While the nerve allograft demonstrated superior nerve regeneration in motor function test at 3 months, markedly low values were observed in all groups. When reconstructing peripheral nerves using detergent-based decellularized xenogenic nerves, analysis of immuno-histochemistry and motor nerve conduction study reveals a promising degree of nerve regeneration. However, when compared with fresh allograft group at 3 months after operation, the sciatic functional index was lower. Significantly lower values observed across all groups compared to previous assessments indicate the need for further research into potentially influential alternative factors.Histologically, at 16 weeks postoperative, the experimentally treated group did not show statistically significant differences compared to the controls in terms of a Schwann cell comparison, but exhibited favorable outcomes when compared to the positive control group. Additionally, an analysis of the motor function testing confirmed recovery of the latency and nerve conduction velocity to levels similar to those of the normal side. While the nerve allograft demonstrated superior nerve regeneration in the motor nerve examination at 3 months, notably low values were observed in all the groups. When reconstructing the peripheral nerves using detergent-based decellularized xenogeneic nerves, an analysis of immunohistochemistry and motor nerve conduction study reveals a promising degree of nerve regeneration. However, when compared with the fresh allograft group at 3 months post-operation, the sciatic functional index was lower. The significantly lower values observed across all groups compared to those of the previous assessments indicate the need for further research of potentially influential alternative factors.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0e3544fff3e335f0da270e8c75a4d5e7ac8d450e3e1700914a82d6aabadae65f","category":"Interdisciplinary"}