{"title":"How does sleep quality affect your cycling?","link":"https://www.cyclist.co.uk/in-depth/sleep-quality-cycling","date":1695894282000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/sleep-quality-cycling\">How does sleep quality affect your cycling?</a></p>\n\n<p>Team Sky popularised the idea of sleep as the greatest recovery tool a rider possesses. A week in July wouldn’t pass without tales of a van pulling up outside a French Ibis and some poor driver offloading a team’s worth of bespoke mattresses and toppers so that Bradley Wiggins and Chris Froome could have the same sleep setup as they had at home, which would hopefully result in a rapid ride the next day. Fast-forward to 2023 and the whole peloton is at it.</p>\n\n\n\n<p>Mattress company Dorelan supports – literally – Mads Pedersen and the crew at Lidl-Trek; Latexco sponsors Soudal-QuickStep, while Jumbo-Visma aim even higher thanks to Australian company Box Altitude’s rarefied-air sleep systems. With a sprinkling of irony, Team Sky (now Ineos Grenadiers) awoke the competition to the benefits of greater shut-eye, and in the process inspired sports scientist Dr Sarah Gilchrist to dig deeper into the recuperative powers of sleep.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/best-foods-for-cycling\">10 essential foods for cyclists</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/how-do-i-get-a-good-night-s-sleep-before-a-big-ride\">How do I get a good night’s sleep before a big ride?</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 144: on sale now!</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>‘You mention Team Sky,’ she says when speaking to <em>Cyclist</em>. ‘My doctorate specialised in sleep and athletic performance so I was interested in what they were doing, but they really focussed on the practical side of sleeping. There was no data I could find on “athletic sleep”. </p>\n\n\n\n<p>‘I was working with British Rowing in the lead-up to the 2012 London Olympics and we were worried about recovery with the expected increase in media requests. We’d seen an increase in media demand in 2011 and we realised we didn’t have objective data on sleep.’</p>\n\n\n\n<h2>The gold standard</h2>\n\n\n\n<p>Dr Gilchrist has spent over 20 years working in the high-performance sport industry, latterly as technical lead for the English Institute of Sport and senior physiologist with British Rowing, and now runs her own consultancy Gilchrist Performance. </p>\n\n\n\n<p>But the frenzy of a home Games arguably proved one of the most fertile periods of her career, with napping one of the key interventions she introduced (see ‘Siesta for speed’ boxout for more on napping). It clearly worked, with Great Britain picking up nine rowing medals, four of which were gold.</p>\n\n\n\n<p>‘We also looked at chronotypes of elite athletes to see if “larks” [morning people] were predisposed to being rowers, swimmers or canoeists because those sports demand an early start. As it transpired, you simply couldn’t draw conclusions because so many factors come into play with elite performance. But what’s clear for all levels of athlete, including recreational cyclists, is that there are myriad health and performance benefits of sufficient sleep.’</p>\n\n\n<div>\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/07/02113847/sleep1-970x647.jpg\" alt=\"sleep1\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/07/02113847/sleep1-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/07/02113847/sleep1-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/07/02113847/sleep1-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/07/02113847/sleep1-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/07/02113847/sleep1-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/07/02113847/sleep1-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/07/02113847/sleep1-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/07/02113847/sleep1.jpg 1200w\" /><figcaption></figcaption></figure></div>\n\n\n<p>There’s much unknown about sleep, but psychological, emotional and physiological health will improve if you do it right.</p>\n\n\n\n<p>‘You’ll enjoy better cognitive function for a start,’ says Gilchrist. ‘That includes memory consolidation. If you’re not sleeping well, you’re more likely to be moody, irritable, anxious and depressed. There’s a pretty strong link between mental health and sleep. Long-term, if you sleep well your immune function is strengthened, so you’re less likely to suffer from cardiovascular disease, dementia and certain cancers.’</p>\n\n\n\n<p>When it comes to performance, a series of sleepless nights affects reaction times – not ideal if you’re descending a twisty Alpine mountain. You’re more likely to fight off common cyclists’ ailments such as upper respiratory infections if you sleep well too. Conversely, you’ll raise the spectre of injury if sleep time gives way to other commitments.</p>\n\n\n\n<p>‘Now I’m freelance, I work with a lot more weekend warriors,’ says Gilchrist. ‘They’ll be training 20 hours a week, have a demanding job and then have a baby. They try to do what they did before but it’s just not possible. They sleep badly, their immune system plummets and they become frustrated. We teach them that they have to train, and recover, smarter.’</p>\n\n\n\n<p>Gilchrist points out that sleep deficiency can affect metabolism, as hormones that regulate appetite, such as ghrelin and lectin, become erratic, meaning you make poor food choices and pile on the pounds. Your aerobic system and power output suffers as well.</p>\n\n\n\n<h2>Delaying the downfall</h2>\n\n\n\n<p>These physiological parameters of cycling performance were of interest to a group of researchers led by Jose Antonio Rodriguez-Marroyo, who tested seven Continental-level riders before and after the Vuelta a España to see just how much fatigue hurt performance.</p>\n\n\n\n<p>The distance covered each stage averaged 155.5km at altitudes up to 2,257m for a total of 3,265km. On average, VO2 max dropped 9% from 81.8ml/kg/min to 74.4; functional threshold fell 10.3% from 437.8W to 391.5W and maximum heart rate dipped by 6.7% from 191 to 179bpm. Overall, the seven riders endured a 10% physiological drop due to difficulty in maintaining muscle glycogen levels, reduced cardiac output and muscle damage. Although the scientists didn’t directly study sleep, all three of these decrements are improvable by sleep.</p>\n\n\n<div>\n<figure><img width=\"915\" height=\"610\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/12/02121055/bikes_september162587.jpg\" alt=\"bikes_september162587\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/12/02121055/bikes_september162587.jpg 915w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/12/02121055/bikes_september162587-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/12/02121055/bikes_september162587-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/12/02121055/bikes_september162587-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/12/02121055/bikes_september162587-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2015/12/02121055/bikes_september162587-350x233.jpg 350w\" /><figcaption></figcaption></figure></div>\n\n\n<p>‘That makes sense,’ says Dr Kevin Sprouse, head of medicine at EF Education-EasyPost. ‘Some guys seem to get fresher as a Grand Tour rolls on. At the start of the first week, they’re labouring down to breakfast and gagging for a coffee. By the end of the second week, they’re the first ones down.’</p>\n\n\n\n<p>EF has a sponsorship deal with tech company Whoop, one of the more popular wearables on the market. While Dr Gilchrist has her reservations about the accuracy of wearables (see ‘Are wearables worth it?’ for more), Sprouse says they have benefits.</p>\n\n\n\n<p>‘One of the things Whoop has opened my eyes to is that often the guys adapting to the race are the ones who are sleeping very well. Left unchecked, many riders will lose valuable sleep time by watching films or reading. They’ll average six-and-a-half to seven hours’ sleep a night. But show them Whoop and how long others are sleeping and their performance score encourages them to have better control over their sleep, which can nudge them up to eight to nine hours.’</p>\n\n\n\n<p>Which raises the question: how much is enough? Back to Dr Gilchrist. ‘I need to work back to answer that. Basically, you have what’s called a 90-minute sleep cycle comprising four stages. Your first two stages are light sleep. That’s up to around 30 minutes. You’re kind of twitchy, jerky, but you can be woken up quite easily and that’s why this is good for a nap.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"970\" height=\"347\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-300x107.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-768x275.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1536x550.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-750x269.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1140x408.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4.jpg 1818w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p>‘You then hit stage three, or slow-wave sleep. Your brainwaves are low-frequency; your heart rate, blood pressure and breathing rate drops; your body’s in a really deep stage of sleep. If you’re in a heavy endurance training programme, this is where many of your adaptions take place as you’ll release growth hormone and repair muscle damage.</p>\n\n\n\n<p>‘And then you go into stage four sleep, which is when you dream. This is REM [rapid eye movement] sleep and is important for emotional stability. Then you transition out of that and start another 90-minute cycle.’</p>\n\n\n\n<p>So, when it comes to what is optimum, it’s more about ticking off full cycles than total time slept. In theory, the more cycles you can work through, the more rejuvenated you’ll feel. So five 90-minute cycles equates to seven-and-a-half hours’ sleep; six cycles equals nine hours. ‘But again, everyone’s individual,’ says Gilchrist.</p>\n\n\n\n<p>This individualism is influenced by many factors including puberty, the menopause and pregnancy. But one thing unites all cyclists: put the same effort into sleep as into your hill repeats and you’ll ride stronger and be healthier. Happy snoozing.</p>\n\n\n\n<h2>Sleep myths busted</h2>\n\n\n\n<p><em>Your parents were fibbing all along</em></p>\n\n\n<div>\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/03025233/sleep2-970x647.jpg\" alt=\"sleep2\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/03025233/sleep2-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/03025233/sleep2-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/03025233/sleep2-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/03025233/sleep2-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/03025233/sleep2-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/03025233/sleep2-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/03025233/sleep2-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/03025233/sleep2.jpg 1200w\" /><figcaption></figcaption></figure></div>\n\n\n<p><strong>‘Cheese gives you nightmares’</strong></p>\n\n\n\n<p>There is no evidence for this (unless, of course, you enter the annual and very dangerous Cheese Rolling contest at Cooper’s Hill, Gloucestershire, and knock yourself out chasing the wheel of Double Gloucester down the vertiginous grass slopes). </p>\n\n\n\n<p>One theory suggests the amino acid tyramine triggers the release of the neurotransmitter noradrenaline in an area of the brain linked to dreams. It’s found in cheese but in chocolate too, and chocolate’s not tarred with the same brush.</p>\n\n\n\n<p><strong>‘Never wake a sleepwalker’</strong><strong></strong></p>\n\n\n\n<p>Apparently, at least 40% of us have sleepwalked in our lifetime, although it’s rarer as you age. Incredible sleepwalking tales abound, including the case of a 15-year-old girl who in 2005 was found curled up asleep at the top of a 130ft crane. But would it have led to her death if you’d woken her? In short, no.</p>\n\n\n\n<p>A study at Niguarda Hospital in Milan examined the brainwaves of people prone to sleepwalking and found that some parts of the brain are awake, while others are sound asleep, suggesting sleepwalking is caused by an imbalance between these two states. This mixed state can cause shock if woken but won’t lead to a heart attack. Ideally, lead them gently back to bed where they can do no harm.</p>\n\n\n\n<p><strong>‘Counting sheep helps you fall asleep’</strong></p>\n\n\n\n<p>According to a study from the University of California, the opposite is true – focussing on counting sheep actually stimulates your mind. Where the strategy came from isn’t certain, but some suggest it originated centuries ago with sheep herders, who couldn’t sleep until they’d counted all their sheep to ensure none were missing. Better advice, says that California study, is to visualise a relaxing walk you do often (ideally in the countryside).</p>\n\n\n\n<h2>Siesta for speed<strong></strong></h2>\n\n\n\n<p><em>Having a nap is proven to improve performance and health. And now with many of us hybrid-working, there’s no one to stop you</em></p>\n\n\n<div>\n<figure><img width=\"970\" height=\"534\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/07103525/sleep_alarm_clock-970x534.jpg\" alt=\"sleep_alarm_clock\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/07103525/sleep_alarm_clock-970x534.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/07103525/sleep_alarm_clock-300x165.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/07103525/sleep_alarm_clock-768x423.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/07103525/sleep_alarm_clock-750x413.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/07103525/sleep_alarm_clock-1140x628.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/06/07103525/sleep_alarm_clock.jpg 1200w\" /><figcaption></figcaption></figure></div>\n\n\n<p>‘If you’ve got the motivation and the opportunity to nap, go for it, and ideally between two and four in the afternoon,’ says performance consultant Dr Sarah Gilchrist. ‘If you can manage 20 to 30 minutes that’s good because you’ll be in the first two stages of sleep. If you want more than that, aim for 90 minutes because that’s the length of the full sleep cycle. Wake up in the deep-sleep stage – in-between these times – and you’ll feel awful.’</p>\n\n\n\n<p>But don’t force it, warns Gilchrist. ‘I used to say to the rowers, you don’t need to sleep but as long as at some point in the day your feet are at the same level as your head and you’re in a rested state, it will be beneficial for the subsequent training session, whether it’s later in the day or the next day.’</p>\n\n\n\n<p>Studies show that a ten-minute nap can result in immediate improvements in cognitive performance, energy and reduced feelings of fatigue and sleepiness, with benefits maintained for around two and a half hours. And a 20-minute nap improves endurance performance (in terms of longer time to exhaustion and lower rating of perceived exertion) in athletes who slept at night for less than seven hours.</p>\n\n\n\n<p>Studies have also looked into the effect of mixing coffee with a nap, known by some as a ‘napuccino’. Caffeine takes around 30 minutes to peak in the bloodstream, so the idea is you knock back a caffeinated beverage (a brewed cup or espresso typically contains around 90mg), enjoy a 20-minute nap and when you rise from your brief slumber, you’ll be more alert and ready to go.</p>\n\n\n\n<p>Just be careful not to indulge in a napuccino too late in the day, as the caffeine kick, combined with the extra snooze time, could have a detrimental effect on your overnight sleep, thereby cancelling out the benefits.</p>\n\n\n\n<h2>Welcome to snoozeville</h2>\n\n\n\n<p><em>Dr Sarah Gilchrist on creating the right environment for a good night’s sleep</em></p>\n\n\n<div>\n<figure><img width=\"724\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Gus_scott_3-724x970.jpg\" alt=\"The importance of sleep for cyclists\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Gus_scott_3-724x970.jpg 724w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Gus_scott_3-224x300.jpg 224w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Gus_scott_3-768x1029.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Gus_scott_3-1146x1536.jpg 1146w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Gus_scott_3-750x1005.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Gus_scott_3-1140x1528.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/Gus_scott_3.jpg 1200w\" /><figcaption>Gus Scott</figcaption></figure></div>\n\n\n<p>• The perfect temperature is 18-20°C. Make sure your duvet’s the right tog for the season and use cool cotton sheets in summer.</p>\n\n\n\n<p>• Darkness is good. Photo receptors in your eyes pick up whether it’s light or dark and send messages to the brain to release (or not to release) melatonin, which helps you sleep.</p>\n\n\n\n<p>• Your body likes to be in a balanced state, so get into a sleep routine, rising and hitting the pillow at roughly the same time each day.</p>\n\n\n\n<p>• Avoid large meals for at least two hours before bedtime. This wakes your body instead of calming it down.</p>\n\n\n\n<p>• Keep technology and screentime out of the bedroom.</p>\n\n\n\n<p>• If you’re training late, go to bed an hour later. Your adrenaline and cortisol levels will be up from the exercise so better to spend that hour chilling on the sofa than struggling to sleep.</p>\n\n\n\n<h2>Sleep like a pro<strong></strong></h2>\n\n\n\n<p><em>Manchester company Levitex helps Mathieu van der Poel and his teammates sleep better at Alpecin-Deceuninck</em></p>\n\n\n<div>\n<figure><img width=\"970\" height=\"646\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck-970x646.jpeg\" alt=\"cyclist raising fist in celebration after stage with sunglasses on helmet\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck-970x646.jpeg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck-300x200.jpeg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck-768x512.jpeg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck-1536x1023.jpeg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck-750x500.jpeg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck-1140x759.jpeg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck-465x310.jpeg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck-620x413.jpeg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck-350x233.jpeg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/05/alpecin-deceuninck.jpeg 2048w\" /><figcaption>Alpecin-Deceuninck</figcaption></figure></div>\n\n\n<p><strong>What’s your involvement with the Belgian WorldTour team?</strong></p>\n\n\n\n<p>We provide the Alpecin team with sleep consultations to better understand the riders’ specific needs, as each one will be different. From this, we’re able to provide solutions in terms of sleep hygiene, sleeping position and sleep surface. Some riders have mattresses and pillows in their own home; some have pillows that travel with them during the race season.</p>\n\n\n\n<p><strong>What makes a good pillow?</strong></p>\n\n\n\n<p>Our specialist foam pillows come in four sizes. We match the athlete with a pillow based on their individual shape and size, taking into account the position they tend to sleep in most (back or side). For any athlete we work with who sleeps on their front, we give them the tools to transition to a more optimal lying position. Sleeping on your front is a major no-no; it’s bad for your spine health and affects your overall sleep quality.</p>\n\n\n\n<p><strong>Are there any posture issues that commonly affect cyclists that sleep can help?</strong></p>\n\n\n\n<p>We’ve found a prevalence of sacroiliac joint pain across most of the athletes we work with. In cycling, so much focus is applied to aerodynamics and leaning over. That’s why it’s even more important to address night-time posture. It’s also why we recommend you check hotel mattresses and pillows you’re sleeping on ahead of your trip. </p>\n\n\n\n<p>One of the Alpecin riders was flown home from Flanders with back spasms. Following three clinical assessments it was established that the cause of his debilitating lower back pain was a hotel mattress ‘made from cotton wool’.</p>\n\n\n\n<h2>Are wearables worth it?<strong></strong></h2>\n\n\n\n<p><em>Your smartwatch can monitor your sleep, but how much should you rely on it?</em></p>\n\n\n<div>\n<figure><img width=\"970\" height=\"498\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/11/06014545/wahoo_elemnt_rival_watch_pair_standalone_crop-970x498.jpg\" alt=\"wahoo_elemnt_rival_watch_pair_standalone_crop\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/11/06014545/wahoo_elemnt_rival_watch_pair_standalone_crop-970x498.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/11/06014545/wahoo_elemnt_rival_watch_pair_standalone_crop-300x154.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/11/06014545/wahoo_elemnt_rival_watch_pair_standalone_crop-768x395.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/11/06014545/wahoo_elemnt_rival_watch_pair_standalone_crop-750x385.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/11/06014545/wahoo_elemnt_rival_watch_pair_standalone_crop-1140x586.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/11/06014545/wahoo_elemnt_rival_watch_pair_standalone_crop.jpg 1349w\" /><figcaption></figcaption></figure></div>\n\n\n<p>‘I refer to them as “wearables, nearables and unbearables”,’ says Dr Sarah Gilchrist. ‘The gold standard is polysomnography [PSG], which is in the sleep lab with all the electrodes hooked to your head. Most of the gadgets and gizmos out there haven’t been validated against PSG.</p>\n\n\n\n<p>‘What I would say is that they are useful to monitor change. So if you want to increase your sleep time by ten minutes a night over the next two weeks, they’re good to monitor that. But in terms of the data they give you on your sleep architecture – your non-REM and REM sleep – I would take it with a pinch of salt and would focus more on how you feel when you wake up.</p>\n\n\n\n<p>‘If you’re waking up with your alarm and feeling a little groggy, that’s pretty normal. But if you’re drinking caffeine straight away and still feel exhausted, chances are you need to address your sleep hygiene.’</p>\n\n\n\n<h2>Booze is bad news<strong></strong></h2>\n\n\n\n<p><em>Caffeine and alcohol are off the menu when it comes to sleep</em></p>\n\n\n<div>\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/islay-pete-muir-970x647.jpg\" alt=\"Islay UK ride\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/islay-pete-muir-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/islay-pete-muir-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/islay-pete-muir-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/islay-pete-muir-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/islay-pete-muir-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/islay-pete-muir-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/islay-pete-muir-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/islay-pete-muir-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/islay-pete-muir.jpg 1200w\" /><figcaption>Patrik Lundin / Cyclist</figcaption></figure></div>\n\n\n<p>Coffee and cycling have a rich history, but, says Dr Sarah Gilchrist, avoid them after lunchtime or you’ll struggle to sleep.</p>\n\n\n\n<p>‘That’s very much general advice though, because we all metabolise caffeine at different rates,’ she adds. ‘But on the whole, try to taper off and drink something else like decaffeinated coffee or herbal tea.’</p>\n\n\n\n<p>Why caffeine is so dream-dentingly bad is down to inhibiting the ‘flip-flop switch’ that sends you from being awake to asleep. ‘This switch is triggered by a chemical build-up throughout the day, but caffeine blocks the receptors so that your waking state takes over for longer and your sleep is compromised,’ says Gilchrist. </p>\n\n\n\n<p>As for alcohol – which let’s not forget pro cyclists used to quaff freely at the Tour de France until Tom Simpson died with a mix of alcohol and amphetamine in his blood in 1967 – there’s more bad news: ‘We know that it prevents you getting your REM sleep, the part of your sleep cycle that’s linked to your emotion. Unfortunately, even just a couple of glasses affects your sleep quite significantly.’</p>\n\n\n\n<p><strong>• This article originally appeared in issue 143 of <em>Cyclist </em>magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/sleep-quality-cycling\">How does sleep quality affect your cycling?</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"0e37b2fccb49e9843febc41aece7d4d5ed9ce81c26c0e61bf31654eac1fbff1f","category":"Cycling"}