{"title":"Reintroducing Atlantic salmon in the river Rhine for decades: Why did it not result in the return of a viable population?","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4284?af=R","date":1713755102000,"content":"<h2>Abstract</h2>\n<p>Freshwater species biodiversity is under threat. The average global decline for migratory fish species is estimated to be more than 75% since 1970. Atlantic salmon is one of these species with a steep decline in north-western Europe and it even went extinct in the river Rhine in the 1950s. The causes for this decline have been posted to habitat loss, pollution, climate change and overfishing. Annual stocking in the Rhine since the late 1980s resulted in an initial increase in the Atlantic salmon numbers after which numbers collapsed again. In this paper, we lay out the recent decline, estimate losses of smolts and adults at different sections in the freshwater habitat and elaborate on potential causes of the recent decline and these losses. We found that the salmon population of the river Rhine has declined rapidly over the past two decades, with a current estimated spawning population of only ~350–800 individuals. The percentage of salmon smolts returning as adults to spawning grounds is estimated at 0.5%–0.6%, well below the 3% supposedly needed to maintain a self-sustaining population. Many individuals disappear during their migrations, with the highest percentage of smolts disappearing in the German tributaries (44%) and the Dutch lower Rhine (71%), while the percentage of disappearing adults is highest in both the Dutch (74%) and the German (78%) Rhine. Causes for the losses per river section remain unclear and possible threats, some specific to the river Rhine, are being discussed. The large losses of smolts and adults in inland waters, compared with open sea losses, indicate that restocking the river Rhine might only result in a self-sustaining population with more ecological restoration than carried out so far along the intensively shipped and highly regulated river course and associated high levels of predation, and might be increasingly limited by future climate change.</p>","author":"J. C. van Rijssel, \nA. W. Breukelaar, \nJ. J. de Leeuw, \nM. E. B. van Puijenbroek, \nK. Schilder, \nA. Schrimpf, \nF. T. Vriese, \nH. V. Winter","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"0e3859f2151d926f0de766b8b21dd47e1aeedf4c8392088fc648226ad1b2a98c","category":"Environment"}