{"title":"Google will kill off very old versions of Android next month","link":"https://arstechnica.com/?p=1784786","date":1628017778000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/android-gingerbread-cookies-ars-2-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/android-gingerbread-cookies-ars-2.jpg\">Enlarge</a> <span>/</span> Delicious gingerbread Android cookies.  </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Google has started emailing users of very old Android devices to tell them it's time to say goodbye.</p>\n<p>Starting September 27, devices running Android 2.3.7 and lower will no longer be able to log in to Google services, effectively killing a big portion of the on-rails Android experience. As Google puts it in an official <a href=\"https://support.google.com/android/thread/118703101/sign-in-on-android-devices-running-android-2-3-7-or-lower-will-not-be-allowed-starting-september-27?hl=en\">community post</a>, \"If you sign in to your device after September 27, you may get username or password errors when you try to use Google products and services like Gmail, YouTube, and Maps.\"</p>\n<p>Android is one of the most cloud-based operating systems ever. Especially in older versions, many included apps and services were tied to your Google login, and if that stops working, a large chunk of your phone is bricked. While Android can update many core components without shipping a full system update today, Android 2.3.7 Gingerbread, released around 10 years ago, was not so modular. The individual Google apps <a href=\"https://arstechnica.com/gadgets/2014/12/android-2-3-gingerbread-four-years-later-the-os-just-wont-die/\">started to be updatable</a> through the Android Market/Play Store, but signing in to Google was still a system-level service and is frozen in time. Any Google services wanting to allow sign-ins from those versions would have to conform to 2011-era security standards, which means turning off two-factor authentication (2FA) and enabling a special \"<a href=\"https://support.google.com/accounts/answer/6010255?hl=en#zippy=%2Cif-less-secure-app-access-is-on-for-your-account\">allow less-secure access</a>\" setting in your Google account. Really, these old Android versions have to die eventually because they're just too insecure.</p></div><p><a href=\"https://arstechnica.com/?p=1784786#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1784786&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0e42c21221a4671a72134bc6cb7536b95c174d3c4b6ecc4d109a83f366028a7d","category":"Tech"}