{"title":"Profiling genome‐wide methylation in two maples: Fine‐scale approaches to detection with nanopore technology","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13669?af=R","date":1713357556000,"content":"<h2>Abstract</h2>\n<p>DNA methylation is critical to the regulation of transposable elements and gene expression and can play an important role in the adaptation of stress response mechanisms in plants. Traditional methods of methylation quantification rely on bisulfite conversion that can compromise accuracy. Recent advances in long-read sequencing technologies allow for methylation detection in real time. The associated algorithms that interpret these modifications have evolved from strictly statistical approaches to Hidden Markov Models and, recently, deep learning approaches. Much of the existing software focuses on methylation in the CG context, but methylation in other contexts is important to quantify, as it is extensively leveraged in plants. Here, we present methylation profiles for two maple species across the full range of 5mC sequence contexts using Oxford Nanopore Technologies (ONT) long-reads. Hybrid and reference-guided assemblies were generated for two new <i>Acer</i> accessions: <i>Acer negundo</i> (box elder; 65x ONT and 111X Illumina) and <i>Acer saccharum</i> (sugar maple; 93x ONT and 148X Illumina). The ONT reads generated for these assemblies were re-basecalled, and methylation detection was conducted in a custom pipeline with the published <i>Acer</i> references (PacBio assemblies) and hybrid assemblies reported herein to generate four epigenomes. Examination of the transposable element landscape revealed the dominance of <i>LTR Copia</i> elements and patterns of methylation associated with different classes of TEs. Methylation distributions were examined at high resolution across gene and repeat density and described within the broader angiosperm context, and more narrowly in the context of gene family dynamics and candidate nutrient stress genes.</p>","author":"Susan L. McEvoy, \nPatrick G. S. Grady, \nNicole Pauloski, \nRachel J. O'Neill, \nJill L. Wegrzyn","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"0e433022f0e38ab9e5dff29ba69d153f49e80da1255daf6193f4c39554b13676","category":"Environment"}