{"title":"Apple’s upcoming AR headset is the riskiest product it’s ever launched","link":"https://www.macworld.com/article/1922099/reality-pro-ar-headset-development-delays-glasses-confidence-tim-cook.html","date":1684429524000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The big reveal at Apple’s <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC keynote</a> on June 5 will reportedly be the Reality Pro, an <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">AR headset</a> that looks to what <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.meta.com/quest/&amp;xcust=1-1-1922099-1-0-0&amp;sref=https://www.macworld.com/feed\">Meta</a>, <a href=\"https://click.linksynergy.com/deeplink?id=*l6kYCuH720&amp;mid=24542&amp;u1=1-1-1922099-1-0-0&amp;murl=https://www.microsoft.com/en-us/hololens\">Microsoft</a>, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.magicleap.com/en-us/&amp;xcust=1-1-1922099-1-0-0&amp;sref=https://www.macworld.com/feed\">Magic Leap</a>, and others haven’t: make mixed reality a viable and popular platform. The excitement is palpable, but this isn’t the iPhone or iPad. And according to a new report, it has a very real chance of failing.</p>\n\n\n\n<p>On Thursday, Bloomberg’s Mark Gurman posted an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/features/2023-05-18/apple-s-mixed-reality-headset-may-define-tim-cook-s-legacy&amp;xcust=1-1-1922099-1-0-0&amp;sref=https://www.macworld.com/feed\">extensive report</a> based on anonymous sources of people involved in the headset. Much of what’s in Gurman’s article has been previously reported, but he offers a comprehensive look at the changing vision for the project and the uncertainty within the company as to how successful it can be.  Some of the key points in the report include:</p>\n\n\n\n<ul><li>Apple will brand the headset with the <strong>Reality brand</strong>. Most reports say this first model will be the higher-end Reality Pro, with the more affordable Reality Once to come in 2025.</li><li>Apple originally wanted the headset to have more of an augmented reality (AR) focus, designed “as a <strong>pair of unobtrusive eyeglasses</strong>” that “would feel more like a fashion accessory than a computer strapped to your face.” However, the technology hasn’t developed enough to allow that, and the headset will reportedly be more like virtual reality (VR) “<strong>ski goggles</strong>.”</li><li>The headset will have <strong>hand and eye controls</strong>, with cameras used for “video pass through” to display the user’s surroundings on screen. An <strong>outward-facing display</strong> will show eye movement and facial expressions.</li><li>Users will be able to play <strong>games</strong>, make <strong>FaceTime calls</strong>, work out, <strong>meditate</strong>, and access <strong>email</strong> and the web while wearing the device. Many Apple apps will be part of <strong>xrOS</strong>, the headset’s operating system, but the company is pinning its hopes on third-party apps “will save it,” not unlike the infusion of early apps for the iPhone and iPad.</li><li>Apple VIPs such as Craig Federighi and Johny Srouji are <strong>skeptical</strong> about the headset becoming a success. Apple realizes it needs to have patience with the growth of this new product, and it adjusted its internal goal of selling three million units a year down to 900,000.</li><li>The company has spent over<strong> $1 billion annually</strong> since 2017 on its development. Apple CEO Tim Cook’s approach has reportedly been very much hands-off, a stark contrast to how Steve Jobs worked. That approach hindered the ability for developers to get resources and led to delays sources told Gurman.</li><li>Apple <strong>postponed development</strong> for “stand-alone glasses” to focus on the headset, and that product is at least four years away. Such a product needs to “replicate the performance of an iPhone while using only a tenth of the power, to keep from getting too hot,” while fitting in a sleek, comfortable, and small package.</li></ul>\n\n\n\n<p>When Cook makes his pitch during the WWDC keynote, don’t expect many comparisons to other headsets. While Jobs was confident the iPhone was light-years ahead off the competition from Palm and Treo, AR is much less of an established category. Much like the Apple Watch, which was the first truly new product, under Cook’s tenure as CEO, the Reality headset will define much of his legacy. And based on this extremely in-depth report, it’s anything but certain to be a hit.</p>\n\nApple, Virtual Reality, Wearables</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0e440c4c157a3793b3d18dbd563f9a7d8a62b2cc5adcabbee8d6e39c47dbaf08","category":"Apple"}