{"title":"Beryl chosen to run Greater Manchester's bike hire scheme","link":"https://www.cyclist.co.uk/news/9777/beryl-chosen-to-run-greater-manchesters-bike-hire-scheme","date":1624361771000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>22 Jun 2021</span></div>    </div></div><p>\nBee Bikes will start to be rolled out in November with the first phase consisting of 1,500 bikes and e-bikes and over 200 docking stations</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/06/beryl_-_tfgm.jpg?itok=kdh1Wg33\" />  </div>\n<div>\n      <p> Beryl has been chosen to provide and operate Bee Bikes, Transport for Greater Manchester's new bike hire scheme set to launch in November.</p>\n<p>The British company, which is also a bike light innovator, already has experience providing bike and e-scooter hire schemes in Norwich, Watford, Hereford, Bournemouth and the Isle of Wight with its technology also used on London's Santander Cycles and Transport for West Midlands hire bikes.</p>\n<p>The Bee Bikes scheme, part of Mayor of Greater Manchester Andy Burnham's Bee Network plans for an affordable, accessible and integrated transport network, will see an initial 1,500 bikes and e-bikes available from over 200 docking stations across Manchester, Trafford and Salford.</p>\n<p>That rollout beginning in November means at the end of the first phase bikes will be available within a five-minute walk of 198,000 households with full planning and implementation to be carried out alongside the local community.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/9607/cyclist-magazine-podcast-episode-30-chris-boardman-the-politician\">Cyclist Magazine Podcast Episode 30 – Chris Boardman, the politician</a></div>      <div><a href=\"/news/5852/beryl-pixel-front-or-rear-bike-light-review\">Beryl Pixel front or rear bike light review</a></div>      <div><a href=\"/news/6630/beryl-introduces-new-rental-fleet-to-north-london\">Beryl introduces new rental fleet to North London</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 115: on sale now!</a></div>    </div></div><p>\nBurnham said, 'We're fully integrating our public transport system – The Bee Network – and building the UK's largest cycling and walking network, so I am very pleased to announce that Beryl has been named as our delivery partner for cycle hire, with the first bikes going on the ground later this year.</p>\n<p>'Our cycle hire will be one of the largest docked systems outside London and I cannot wait to use the new bikes myself as a way to get from A to B.'</p>\n<p>It's also worth noting the involvement of Chris Boardman, Greater Manchester's cycling and walking commissioner since 2017, in helping to realise the scheme. For more about his role check out our chat with Boardman on <a href=\"https://www.cyclist.co.uk/in-depth/9607/cyclist-magazine-podcast-episode-30-chris-boardman-the-politician\" target=\"_blank\">Cyclist Magazine Podcast Episode 30</a>.</p>\n<p>Beryl CEO, Philip Ellis said, 'Andy Burnham, Chris Boardman and Transport for Greater Manchester have fantastic ambition when it comes to active travel, and we're excited to be playing our role and bringing our experience in delivery world-class cycle hire.</p>\n<p>'There is huge appetite for this scheme and we can't wait to see people on our bikes and e-bikes later this year.' </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"0e45fc1faddb535656ad333cfbffb7e49e62972fa170c539d009bd00ad15b62c","category":"Cycling"}