{"title":"212 Accuracy of genomic prediction for indicator traits of resistance to gastrointestinal nematode parasites in grazing Arcott Rideau sheep","link":"https://academic.oup.com/jas/article/102/Supplement_3/404/7757318?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Gastrointestinal nematodes (GINs) parasites are a major problem in the sheep industry. To mitigate their impact, combined approaches need to be applied, which may include the implementation of genomic evaluation for indicator traits of resistance to GIN to increase genetic gain. This study aimed to investigate the impact of including genomic information in the genetic evaluation of indicator traits of resistance to GIN in grazing Arcott-Rideau sheep in Ontario. Fecal egg count (FEC) was counted using Triple Chamber (FEC-TC; n = 1,626) and McMaster (FEC-MM; n = 790) methods from samples collected from ewes and rams between 15 to 20 mo of age from 2012 to 2023. Trait values were transformed using a natural log. Two-trait analysis was performed using a repeatability model and the blupf90+ family programs to estimate variance components and predict breeding values. The models included month and year of evaluation, as fixed effects, and animal, permanent environment, and contemporary group, defined as animals of the same sex evaluated in the same year and month of evaluation, as random effects. The analysis was performed twice; 1) using a traditional model, in which pedigree information was used to calculate the relationship matrix (A), and 2) using a genomic model fitting a hybrid genomic relationship matrix (H). Quality control was performed, which included excluding SNPs with MAF &lt; 0.05 and Call rate &lt; 0.90 and samples with Call rate&lt; 0.90; animals with parent-progeny conflicts were also removed. A total of 50,486 SNPs and 950 genotyped animals were included in the analysis to create the H matrix. The prediction accuracies were calculated as √1-SEP<sub>i</sub><sup>2</sup>/(1+f<sub>i</sub>)σ<sub>a</sub><sup>2</sup>, where SEP<sub>i</sub> is the standard error of prediction of the estimated breeding value (EBV) of the i<sup>th</sup> animal; f<sub>i</sub> is the inbreeding coefficient of the i<sup>th</sup> animal; and σ<sub>a</sub><sup>2</sup> is the population additive genetic variance. Four groups of animals were considered: i) where all animals were used; n = 14,626; ii) rams with progeny; n = 125; iii) ewes with progeny; n = 1,741; and iv) genotyped animals without phenotype information; n = 501. The average accuracy for all scenarios was greater when the genomic information was considered in the model for both traits (i = 0.77; ii = 0.82; iii = 0.79; and iv = 0.77 versus i = 0.45; ii = 0.56; iii = 0.49; and iv = 0.44 with the traditional model). The moderate Spearman rank correlation for the top 5% of animals (731) between the EBVs from the traditional and genomic models for both FEC traits (0.68) indicated a considerable re-ranking of the animals, which can be expected since the genomic information accounts for the Mendelian sampling. These results indicate that the inclusion of genomic information in the genetic evaluation of FEC-MM and FEC-TC improves the accuracy of prediction and would help in a more accurate selection of animals for breeding, resulting in an increased genetic gain for GIN resistance in sheep.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0e4ad825e202e0bd711edb0270a6365ef9016feec02581693cd619e87060a878","category":"Environment"}