{"title":"Quantitative imaging and semiotic phenotyping of mitochondrial network morphology in live human cells","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301372","date":1711634400000,"content":"<p>by Sophie Charrasse, Victor Racine, Charlotte Saint-Omer, Titouan Poquillon, Loïc Lionnard, Marine Ledru, Christophe Gonindard, Sandrine Delaunois, Karima Kissa, Richard E. Frye, Manuela Pastore, Christelle Reynes, Mathilde Frechet, Hanane Chajra, Abdel Aouacheria</p>\r\n\r\nThe importance of mitochondria in tissue homeostasis, stress responses and human diseases, combined to their ability to transition between various structural and functional states, makes them excellent organelles for monitoring cell health. There is therefore a need for technologies to accurately analyze and quantify changes in mitochondrial organization in a variety of cells and cellular contexts. Here we present an innovative computerized method that enables accurate, multiscale, fast and cost-effective analysis of mitochondrial shape and network architecture from confocal fluorescence images by providing more than thirty features. In order to facilitate interpretation of the quantitative results, we introduced two innovations: the use of Kiviat-graphs (herein named MitoSpider plots) to present highly multidimensional data and visualization of the various mito-cellular configurations in the form of morphospace diagrams (called MitoSigils). We tested our fully automated image analysis tool on rich datasets gathered from live normal human skin cells cultured under basal conditions or exposed to specific stress including UVB irradiation and pesticide exposure. We demonstrated the ability of our proprietary software (named MitoTouch) to sensitively discriminate between control and stressed dermal fibroblasts, and between normal fibroblasts and other cell types (including cancer tissue-derived fibroblasts and primary keratinocytes), showing that our automated analysis captures subtle differences in morphology. Based on this novel algorithm, we report the identification of a protective natural ingredient that mitigates the deleterious impact of hydrogen peroxide (H2O2) on mitochondrial organization. Hence we conceived a novel wet-plus-dry pipeline combining cell cultures, quantitative imaging and semiotic analysis for exhaustive analysis of mitochondrial morphology in living adherent cells. Our tool has potential for broader applications in other research areas such as cell biology and medicine, high-throughput drug screening as well as predictive and environmental toxicology.","author":"Sophie Charrasse","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0e4c058ecd9e9acae44614e056624d8823cfab9dc7e3caad6f5ae6e35bd1656e","category":"Interdisciplinary"}