{"title":"The Role of Southeast Asian Island Topography on Indo‐Pacific Climate and Silicate Weathering","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004672?af=R","date":1710831600000,"content":"<h2>Abstract</h2>\n<p>The geography of the Southeast Asian Islands (SEAI) has changed over the last 15 million years, as a result of tectonic processes contributing to both increased land area and high topography. The presence of the additional land area has been postulated to enhance convective rainfall, facilitating both increased silicate weathering and the development of the modern-day Walker circulation. Using an Earth System Model in conjunction with a climate-silicate weathering model, we argue instead for a significant role of SEAI <i>topography</i> for both effects. SEAI topography increases orographic rainfall over land, through intercepting moist Asian-Australian monsoon winds and enhancing land-sea breezes. Large-scale atmospheric uplift over the SEAI region increases by ∼14% as a consequence of increased rainfall over the SEAI and enhancement through dynamical ocean-atmosphere feedback. The atmospheric zonal overturning circulation over the Indo-Pacific increases modestly arising from dynamical ocean-atmosphere feedback, more strongly over the tropical Indian Ocean. On the other hand, the effect of the SEAI topography on global silicate weathering is substantial, resulting in a ∼109 ppm reduction in equilibrium <i>p</i>CO<sub>2</sub> and decrease in global mean temperature by ∼1.7ºC. The chemical weathering increase comes from both enhanced physical erosion rates and increased rainfall due to the presence of SEAI topography. The lowering of <i>p</i>CO<sub>2</sub> by SEAI topography also enhances the Indo-Pacific atmospheric zonal overturning circulation. Our results support a significant role for the progressive emergence of SEAI topography in global cooling over the last several million years.</p>","author":"John. C. H. Chiang, \nPierre Maffre, \nNicholas L. Swanson‐Hysell, \nFrancis A. Macdonald","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"0e4e95465d62da975fccf854813719badb331dac141e8e0ece3e660021288557","category":"Environment"}