{"title":"WhatsApp Usernames May Let You Keep Your Phone Number Private","link":"https://www.macrumors.com/2023/05/25/whatsapp-usernames-in-development/","date":1685023639000,"content":"WhatsApp appears to have a username feature in the works that could potentially provide people on the messaging service with an additional layer of privacy.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/03/Whatsapp-Feature.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nAs things stand, if someone wants to add you as a WhatsApp contact, you're required to share your phone number with them, even if they add you via the QR code method. \r<br />\n\r<br />\nThat's how it's always worked in WhatsApp, but it looks as if Meta's developers understand that users might sometimes prefer to add certain contacts without revealing their phone number.\r<br />\n\r<br />\n<em><a href=\"https://wabetainfo.com/whatsapp-beta-for-android-2-23-11-15-whats-new/\">WABetaInfo</a></em> has spotted a WhatsApp username field in the latest beta Android app, allowing users to choose unique usernames for their accounts. The likelihood is that WhatsApp intends to let users reach other people by entering a username instead, much like Telegram.\r<br />\n\r<br />\nAs the feature is still in development, it's too early to tell how usernames will work when they are rolled out. They may allow users to safeguard their phone numbers when communicating with particular accounts, like businesses, but the hope is that they will provide more general private communication between users. \r<br />\n\r<br />\nWhatsApp has been on a roll recently in announcing new features, including the ability to <a href=\"https://www.macrumors.com/how-to/edit-sent-messages-whatsapp/\">edit sent messages</a>, a new <a href=\"https://www.macrumors.com/2023/05/16/whatsapp-locked-chats/\">chat Lock feature</a>, and the ability to <a href=\"https://www.macrumors.com/how-to/use-whatsapp-account-multiple-phones/\">use the same account on multiple phones</a>. There's still no sign of an <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> app, though.<div>Tags: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a>, <a href=\"https://www.macrumors.com/guide/wabetainfo/\">WABetaInfo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/25/whatsapp-usernames-in-development/\">WhatsApp Usernames May Let You Keep Your Phone Number Private</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whatsapp-usernames-may-let-you-keep-your-phone-number-private.2390501/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0e4ffdd25ca31f8be49cc712820f035d48d0894252eae6663f9d71e0b5fd1508","category":"Apple"}