{"title":"America’s first lunar lander in a half-century won’t reach the Moon","link":"https://arstechnica.com/?p=1994369","date":1704749381000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/peregrineone-1-800x533.jpeg\" alt=\"Astrobotic's Peregrine lander carries 20 payloads, including five NASA-funded science instruments.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/peregrineone-1.jpeg\">Enlarge</a> <span>/</span> Astrobotic's Peregrine lander carries 20 payloads, including five NASA-funded science instruments. (credit: <a href=\"https://x.com/astrobotic/status/1743278744490365183?s=20\">Astrobotic</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A few hours after a successful liftoff on United Launch Alliance's Vulcan rocket, Astrobotic's first commercial lunar lander ran into serious trouble. The robotic Peregrine lander, still in orbit around Earth, appears to have a propellant leak that will prevent it from reaching the Moon.</p>\n<p>There are 20 payloads aboard the Peregrine lunar lander, including five from NASA, which is paying Astrobotic about $108 million for delivery of its science instruments to the Moon's surface. Peregrine was the first US-owned lunar lander to launch to the Moon in more than 50 years, and Astrobotic is one of 14 companies selected by NASA to deliver the agency's scientific instruments to the lunar surface.</p>\n<p>This program, called Commercial Lunar Payload Services (CLPS), is aimed at flying robotic precursor missions to the Moon before NASA astronauts land on the lunar surface in the agency's Artemis program. Astrobotic's CLPS mission was first to the launch pad.</p></div><p><a href=\"https://arstechnica.com/?p=1994369#p3\">Read 30 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1994369&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0e52262f0cfd8363decd480dedfe96a1738b73ed6f00e4da6722a1a82638c932","category":"Tech"}