{"title":"Sonny Colbrelli emerges out of the mud victorious at Paris-Roubaix","link":"https://cyclingtips.com/2021/10/sonny-colbrelli-emerges-out-of-the-mud-victorious-at-paris-roubaix/","date":1633274801000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/GettyImages-1344597677-650x433.jpg\" /></div><h2>Sonny Colbrelli emerges out of the mud victorious at Paris-Roubaix</h2><p>\n</p><p>Sonny Colbrelli (Bahrain-Victorious) survived the grizzly conditions to take Paris-Roubaix victory after a brutal battle across northern France. Not only was it his first ever appearance at the Monument, but he is also the first Italian winner in 22 years.</p>\n\n\n\n<p>The 118th Paris-Roubaix (Hommes) covered 257.7 km, starting in Compiègne (about 50 miles north of Paris) and traversing 55 km of pavé between the start line and the Vélodrome André-Pétrieux in Roubaix. The race hit the first of 30 cobbled sectors after 96.3 km of flat, wet country roads, and from there, the infamous cobbles came thick and fast.</p>\n\n\n\n<p>After an aggressive opening 40 km, a split in the peloton became a 31-strong breakaway that included some huge names, including former winner Greg van Avermaet (AG2R-Citroën), Jasper Philipsen (Alpecin-Fenix), Tim Declercq and Davide Ballerini (Deceuninck-QuickStep), Luke Durbridge and Robert Stannard (BikeExchange).</p>\n\n\n\n<p>The front group – now less than 30 thanks to crashes and punctures – reached the first cobbled sector of Troivilles à Inchy with a 1:40 advantage. It was here that the conditions really tested the riders, and by the end of the first four sectors, a strong quartet led the race: Florian Vermeersch (Lotto Soudal), Nils Eekhoff (DSM), Max Walscheid (Qhubeka-NextHash) and Luke Rowe (Ineos Grenadiers).</p>\n\n\n\n<p>As expected, the weather continued to play a major role, really earning the race its ‘Hell of the North’ styling. Among those who crashed out of contention were former winners Peter Sagan (Bora-Hansgrohe) and John Degenkolb (Lotto Soudal), while at the front of the race, Walscheid hit the deck shortly after Rowe was also caught out, leaving just two at the head of affairs.</p>\n\n\n\n<p>The young debutants – Vermeersch a former cyclocross rider and Eekhoff the winner of Paris-Roubaix Espoirs in 2017 – stayed away for almost 50 km, allowing them freedom of the infamous Trouée d’Arenberg.</p>\n\n\n\n<p>Meanwhile, the peloton behind had been blown apart, but many of the key players were still there. After a couple of hold-ups earlier on, Mathieu van der Poel (Alpecin-Fenix) led what was left of the bunch on the most iconic cobbles of the race that cut through the Arenberg Forest. Wout van Aert (Jumbo-Visma) was caught behind a nasty crash, but he was able to regain contact with the group once back on the tarmac.</p>\n\n\n\n<p>As the favourites regrouped (and Van der Poel stretched his back…) the attacks continued with Colbrelli and Guillaume Boivin (Israel Start-Up Nation) particularly active.</p>\n\n\n\n<p>Eekhoff and Vermeersch were finally caught by the diminished chase group shortly before the Hornaing cobbles (82 km to go), with Colbrelli and a few companions stuck between the front and the favourites around a minute behind.</p>\n\n\n\n<p>A bike change for Van der Poel just inside 75 km to go was followed by 15 km of almost relentless attacking from the Dutch cyclocross superstar. His repeated efforts and the persistently dreadful terrain put an end to the hopes of many, and before long, he had ridden away from his rivals, taking only Boivin and Colbrelli with him.</p>\n\n\n\n<p>Just outside 50 km to go, a weak sun now offering the riders back their shadows, Gianni Moscon (Ineos Grenadiers) – 5th at Paris-Roubaix in 2017 – dropped his two fellow breakaway survivors, Vermeersch and Tom Van Asbroeck (Israel Start-Up Nation), and headed for a lonely assault of Mons-en-Pévèle, one of the toughest, and most mud-covered, sectors of the race. </p>\n\n\n\n<p>With the Van der Poel/Colbrelli group now up to five having caught Moscon’s jettisoned companions, the Italian still led by over a minute, but then two distinct incidents of bad luck struck the leader within just 5 km. A puncture-and-bike-change just inside 30 km to go was followed by a crash on a greasy cobbled section, and by 25 km to go, the five pursuers were within 15 seconds of their prey.</p>\n\n\n\n<p>Moscon was eventually caught by Van der Poel, Vermeersch and Colbrelli on the cobbles at 16 km to go, and the European champion went straight on the attack. This dispatched Moscon and the trio took on the last 15 km with about a minute over what was left of the favourites group, which included Van Aert, Heinrich Haussler (Bahrain-Victorious) and Yves Lampaert (Deceuninck-QuickStep).</p>\n\n\n\n<p>After six hours of racing, one thing was certain: three debutants would occupy every step of the podium. </p>\n\n\n\n<p>The trio entered the velodrome together, and Vermeersch tried to go long with half a lap to go, but it was Colbrelli who took the win before collapsing under the weight of emotion. The 22-year-old Vermeersch held on for second, and Van der Poel took third.</p>\n\n\n\n<p></p>\n\n\n    <div>\n\t\t            <div>\n                <div>\n                    <p>\n\t\t\t\t\t\tParis-Roubaix (1.UWT)\n\t\t\t\t\t\t                            <span>Compiègne → Roubaix</span>\n\t\t\t\t\t\t                    </p>\n                    <div>\n                        <div>\n                            <a href=\"/race-result?race=255695\">Full\n                                results</a>\n                        </div>\n                    </div>\n                </div>\n                <div>\n\t\t\t\t\t                        <img />\n\t\t\t\t\t                </div>\n                <div>\n                    <div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t                                <div>\n                                    <div>\n                                        <span>1</span>\n                                        <div>\n                                            <a href=\"#\">COLBRELLI Sonny</a>\n                                            <span>Bahrain - Victorious</span>\n                                        </div>\n                                    </div>\n                                    <time>06:01:57</time>\n                                </div>\n\t\t\t\t\t\t\t                                <div>\n                                    <div>\n                                        <span>2</span>\n                                        <div>\n                                            <a href=\"#\">VERMEERSCH Florian</a>\n                                            <span>Lotto Soudal</span>\n                                        </div>\n                                    </div>\n                                    <time>00:00:00</time>\n                                </div>\n\t\t\t\t\t\t\t                                <div>\n                                    <div>\n                                        <span>3</span>\n                                        <div>\n                                            <a href=\"#\">VAN DER POEL Mathieu</a>\n                                            <span>Alpecin-Fenix</span>\n                                        </div>\n                                    </div>\n                                    <time>00:00:00</time>\n                                </div>\n\t\t\t\t\t\t\t                                <div>\n                                    <div>\n                                        <span>4</span>\n                                        <div>\n                                            <a href=\"#\">MOSCON Gianni</a>\n                                            <span>INEOS Grenadiers</span>\n                                        </div>\n                                    </div>\n                                    <time>00:00:44</time>\n                                </div>\n\t\t\t\t\t\t\t                                <div>\n                                    <div>\n                                        <span>5</span>\n                                        <div>\n                                            <a href=\"#\">LAMPAERT Yves</a>\n                                            <span>Deceuninck - Quick Step</span>\n                                        </div>\n                                    </div>\n                                    <time>00:01:16</time>\n                                </div>\n\t\t\t\t\t\t\t                                <div>\n                                    <div>\n                                        <span>6</span>\n                                        <div>\n                                            <a href=\"#\">LAPORTE Christophe</a>\n                                            <span>Cofidis, Solutions Crédits</span>\n                                        </div>\n                                    </div>\n                                    <time>00:01:16</time>\n                                </div>\n\t\t\t\t\t\t\t                                <div>\n                                    <div>\n                                        <span>7</span>\n                                        <div>\n                                            <a href=\"#\">VAN AERT Wout</a>\n                                            <span>Team Jumbo-Visma</span>\n                                        </div>\n                                    </div>\n                                    <time>00:01:16</time>\n                                </div>\n\t\t\t\t\t\t\t                                <div>\n                                    <div>\n                                        <span>8</span>\n                                        <div>\n                                            <a href=\"#\">VAN ASBROECK Tom</a>\n                                            <span>Israel Start-Up Nation</span>\n                                        </div>\n                                    </div>\n                                    <time>00:01:16</time>\n                                </div>\n\t\t\t\t\t\t\t                                <div>\n                                    <div>\n                                        <span>9</span>\n                                        <div>\n                                            <a href=\"#\">BOIVIN Guillaume</a>\n                                            <span>Israel Start-Up Nation</span>\n                                        </div>\n                                    </div>\n                                    <time>00:01:16</time>\n                                </div>\n\t\t\t\t\t\t\t                                <div>\n                                    <div>\n                                        <span>10</span>\n                                        <div>\n                                            <a href=\"#\">HAUSSLER Heinrich</a>\n                                            <span>Bahrain - Victorious</span>\n                                        </div>\n                                    </div>\n                                    <time>00:01:16</time>\n                                </div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t                    </div>\n                </div>\n                <div>\n                    <a href=\"/race-result?race=255695\">Full results →</a>\n                </div>\n\t\t\t\t            </div>\n\t\t    </div>\n\t\n<p></p><a href=\"https://cyclingtips.com/2021/10/sonny-colbrelli-emerges-out-of-the-mud-victorious-at-paris-roubaix/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"0e54cb4d4425a5bac30906e11324a42970775d7586f915305bafa18a9aefd979","category":"Cycling"}