{"title":"Analysis of changes in volatile compounds and evolution in free fatty acids, free amino acids, nucleotides, and microbial diversity in tilapia (Oreochromis mossambicus) fillets during cold storage","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13188?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Aquatic products are rich in nutrients and unique in flavor, and are popular among the public. However, aquatic products are extremely susceptible to quality degradation during storage, of which odor deterioration is the most obvious and influential aspect. Odor deterioration in aquatic products is widespread and severely affects overall flavor and quality. In this study, odor deterioration and flavor-related quality degradation of tilapia during cold storage are discussed, focusing on the changes in volatile compounds and the evolution of free fatty acids (FFAs), free amino acids (FAAs), nucleotides, and microbial diversity.</p>\n<h2>RESULTS</h2>\n<p>A total of 63 volatile compounds were detected by gas chromatography–mass spectrometry, including 11 hydrocarbons, 10 alcohols, 6 aldehydes, 8 ketones, 6 esters, 9 aromatics, 3 phenols, and 10 other compounds. Microbial diversity analysis revealed that <i>Acinetobacter</i>, <i>Psychrobacter</i>, <i>Vagococcus</i>, and <i>Myroides</i> were the main dominant species of tilapia at the end of cold storage and predicted that microorganisms could influence the flavor of tilapia by participating in important metabolic pathways. Meanwhile, the evolution of FFAs, FAAs, and nucleotides also had a significant impact on odor deterioration, as evidenced by the contribution of unsaturated fatty acids (such as oleic acid and linoleic acid), Lys, and off-flavor nucleotides (HxR and Hx) to the undesirable flavor. Oxidation of oleic acid and linoleic acid resulted in changes in aldehydes, with Lys, HxR, and Hx being key flavor precursors and off-flavor contributors.</p>\n<h2>CONCLUSION</h2>\n<p>This study contributes to a comprehensive overview of odor deterioration and the evolution of flavor-related quality in tilapia during cold storage, providing new insights into the regulation of overall flavor and quality. © 2023 Society of Chemical Industry.</p>","author":"Hao Cheng, \nJun Mei, \nJing Xie","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"0e58bac590a0ccbc43a9fe06c128377da97ff4e941f62f3846c7c607606df5c1","category":"Environment"}