{"title":"Assessing the COVID-19 pandemic’s impact on pediatric baseball and basketball-related craniofacial and neck injuries treated in United States emergency departments, 2003–2022","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302232","date":1713276000000,"content":"<p>by R. Constance Wiener, Eric W. Lundstrom</p>\r\nBackground <p>A large proportion of United States (U.S.) youth play basketball, baseball, softball, or T-ball. Each of the activities poses a documented risk of craniofacial and neck injuries. However, few studies have assessed the national prevalence of pediatric craniofacial and neck injuries in this population, particularly following the COVID-19 pandemic.</p> Methods <p>The National Electronic Injury Surveillance System (NEISS) dataset was used to identify pediatric craniofacial and neck injuries associated with basketball, baseball, softball, or T-ball from 2003–2022 in a cross-sectional study. The annual number of injuries before and after the onset of the COVID-19 pandemic with 95% confidence intervals were calculated. Interrupted time series analysis (ITSA) was used to estimate the pandemic’s impact on the monthly number of injuries incurred nationally.</p> Results <p>Both overall and stratified by sport involvement, the annual number and rate of injuries identified in NEISS decreased significantly after the COVID-19 pandemic. ITSA demonstrated that the monthly number of injuries decreased -4094.4 (95% CI = -5100, -3088.7) immediately after the beginning of the pandemic. The number of injuries began increasing towards pre-pandemic levels at a rate of 110.6 (95% CI = 64, 157.2) injuries per month after the initial plunge.</p> Conclusion <p>Prior to the-pandemic, there was a steady decline in craniofacial and neck injuries due to basketball, baseball, softball and T-ball among children, aged &lt;18 years. The shutdown during the initial months of the COVID-19 pandemic resulted in a precipitous drop in such injuries. Current rates are approaching pre-pandemic levels and may exceed them. Continued efforts are needed to keep the pre-pandemic progress.</p>","author":"R. Constance Wiener","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0e5d2ebb79922a80e892cf0bfdbc20ccf584615c4d61f195d41b12ce3bafd183","category":"Interdisciplinary"}