{"title":"Qualcomm Announces Plans for ‘M-Series Competitive’ PC CPU’s in 2023","link":"https://www.theverge.com/2021/11/16/22785181/qualcomm-next-gen-cpu-pc-apple-m1-competitor-2023","date":1637114467000,"content":"\n<p>Chaim Gartenberg, reporting for The Verge:</p>\n\n<blockquote>\n  <p>The new chip will be <a href=\"https://www.theverge.com/2021/1/13/22229497/qualcomm-apple-nuvia-acquisition-cpu-chip-design-data-center\">designed by the Nuvia team</a>, which\nQualcomm had bought earlier this year in a massive $1.4 billion\nacquisition. Nuvia, notably, was founded in 2019 by a <a href=\"https://techcrunch.com/2019/11/15/three-of-apple-and-googles-former-star-chip-designers-launch-nuvia-with-53m-in-series-a-funding/\">trio of\nformer Apple employees</a> who had previously worked on the\ncompany’s A-series chips.</p>\n\n<p>The company is making big promises, too: in addition to offering\ncompetition to Apple’s <a href=\"https://www.theverge.com/22751921/apple-macbook-pro-14-16-inch-2021-m1-pro-max-review\">stellar M-series chips</a> (which power\nits latest MacBook Pro and MacBook Air laptops and iMac and Mac\nMini desktops), Qualcomm is aiming to lead the field for\n“sustained performance and battery life,” too. Additionally,\nQualcomm promised that it would be scaling up its Adreno GPUs,\ntoo, with the goal of offering desktop-class gaming capabilities\nfor its future PC products.</p>\n</blockquote>\n\n<p>When they debuted, Apple-silicon-powered Macs were these crazy new machines that offered performance-per-watt far above the industry state-of-the-art. One year later, though, with pro-caliber laptops shipping, Apple silicon <em>is</em> the industry state-of-the-art, and everything else is behind.</p>\n\n<p>Based on mobile chips, however, I have doubts about Qualcomm’s ability to catch up to Apple’s M-series — especially as entire SoCs, including GPUs — any time soon. If Qualcomm hasn’t caught up to Apple in SoCs <em>for phones</em> (ostensibly Qualcomm’s bread and butter) how will they catch up in SoCs for high-end PCs (an area where Qualcomm has never made a dent)? Maybe the answer is the Nuvia acquisition — perhaps Nuvia will be to Qualcomm what PA Semi was for Apple. Or maybe the answer is that it’ll play out like phone chips have, and Qualcomm will never catch up.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/11/16/qualcomm-m-series-competitive-cpus\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"0e607038aa4d19ec71f7ef8aab1d6b73269076e64700abbe3d83a80aff54f19b","category":"Tech"}