{"title":"Startup hopes the world is ready to buy quantum processors","link":"https://arstechnica.com/?p=1779515","date":1626124952000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/QuantWare_Processor_CROPPED-800x593.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/QuantWare_Processor_CROPPED.jpeg\">Enlarge</a> (credit: <a href=\"https://www.quantware.eu/\">QuantWare</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Early in its history, computing was dominated by time-sharing systems. These systems were powerful machines (for their time, at least) that multiple users connected to in order to perform computing tasks. To an extent, quantum computing has repeated this history, with companies like Honeywell, IBM, and Rigetti making their machines available to users via cloud services. Companies pay based on the amount of time they spend executing algorithms on the hardware.</p>\n<p>For the most part, time-sharing works out well, saving companies the expenses involved in maintaining the machine and its associated hardware, which often includes a system that chills the processor down to nearly absolute zero. But there are several customers—companies developing support hardware, academic researchers, etc.—for whom access to the actual hardware could be essential.</p>\n<p>The fact that companies aren't shipping out processors suggests that the market isn't big enough to make production worthwhile. But a startup from the Netherlands is betting that the size of the market is about to change. On Monday, a company called QuantWare announced that it will start selling quantum processors based on transmons, superconducting loops of wire that form the basis of similar machines used by Google, IBM, and Rigetti.</p></div><p><a href=\"https://arstechnica.com/?p=1779515#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1779515&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0e646185def665b269d13332884f5607836bb1771dd1bca82bb5c830d84518da","category":"Tech"}