{"title":"248 Effects of feeding finishing pig diets differing in Ca:P ratio, added phytase and 25(OH)D3 on growth performance, serum 25(OH)D3, carcass characteristics, and bone characteristics","link":"https://academic.oup.com/jas/article/102/Supplement_2/152/7664748?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>A total of 2,160 pigs [337 × 1050, PIC; initial body weight (BW) = 33.2 ± 1.4 kg] were used in a 114-d trial to determine the effects of feeding diets differing in Ca:P ratio and added phytase or phytase and 25(OH)D<sub>3</sub> (Hy-D, DM Nutritional Products, Parsippany, NJ) on growth performance, carcass characteristics, serum 25(OH)D<sub>3</sub>, and bone characteristics. Pigs were housed in mixed sex pens with 27 pigs per pen and 20 pens per treatment. The four treatments were assigned to pens in a randomized complete block design and consisted of 1) a high phosphorus (HP) diet with standardized total tract digestibility (STTD) P at 115% of NRC (2012) requirement estimate without added phytase and formulated to a 1.25:1 Ca to P ratio; 2) low phosphorus (LP) diet with STTD P at 80% of NRC requirement without added phytase and formulated to a 1.25:1 Ca to P ratio; 3) HP with phytase (HP+phytase) diet with STTD P at 115% of NRC requirement using 0.125% STTD P release from 600 FYT/kg HiPhorius and 1.1:1 Ca to P ratio; and 4) Diet 3 except 25(OH)D<sub>3</sub> replaced most of the vitamin D<sub>3</sub> in the diet (HP+25(OH)D<sub>3</sub>). Diets were fed in 4 phases from 32 to 50, 50 to 75, 75 to 100, and 100 to 133 kg. For overall growth performance, source of vitamin D had no impact on performance. Pigs fed HP diets had improved (<span>P</span> &lt; 0.05) average daily gain (ADG), average daily feed intake (ADFI) and gain to feed ratio (G:F) compared with those fed LP diets, and increased ADFI compared with those fed the HP+phytase diets (Table 1). For 25(OH)D<sub>3</sub> measured on d 50, pigs fed the HP diets had increased (<span>P</span> &lt; 0.05) serum 25(OH)D<sub>3</sub> compared with pigs fed the LP diets and pigs fed the HP+25(OH)D<sub>3</sub> diets had increased (<span>P</span> &lt; 0.05) serum 25(OH)D<sub>3</sub> compared with pigs fed the HP+phytase diets. Pigs fed the HP diets had greater (<span>P</span> &lt; 0.05) HCW and percentage lean than those fed LP diets. For bone analysis, pigs fed HP diets had greater (<span>P</span> &lt; 0.05) bone ash (g) and breaking strength than pigs fed LP or HP+phytase and 1.1:1 Ca to P ratio. In conclusion, compared with pigs fed LP diets, HP-fed pigs had improved performance and HCW. Dietary 25(OH)D<sub>3</sub> replacing D<sub>3</sub> did not impact performance but increased circulating 25(OH)D<sub>3</sub>.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0e6ae6ef83be72d3e5ca76ba7f42a9b65fefa30572bcb7e99d4d1eb7f06f0a72","category":"Environment"}