{"title":"Case fatality among people with drug-susceptible TB enrolled in a private health sector TB treatment support program in Bihar, India during the first year of the COVID-19 pandemic","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003277","date":1726149600000,"content":"<p>by Lena Faust, Ayushi Ranjan, Nita Jha, Madhukar Pai, Sophie Huddart</p>\r\n\r\nExperiencing 27% of the global tuberculosis (TB) burden, India’s TB epidemic is the largest in the world. Due to COVID-19-related disruptions to TB programs, India has also seen the largest drop in TB case notifications of any country globally. We estimated case fatality among people treated for TB in India during the pandemic and compared these to pre-pandemic estimates. A random sample of 4,000 adults enrolled in World Health Partners (WHP), a private sector TB treatment support program (enrolling only people with drug-susceptible TB) in Bihar, India in the first year of COVID-19 (Mar 2020-Mar 2021) were contacted via phone to collect information on TB case fatality and other relevant covariates. Inverse probability of selection (IPS) weighting was used to obtain selection-bias-corrected in-treatment and post-treatment case fatality estimates. Covariates associated with (but not necessarily causal of) case fatality were identified by estimating adjusted hazard ratios (HRs) using the Cox proportional hazards model. WHP enrolled 19,826 adult drug-susceptible TB patients in the first year of COVID-19 (Mar 2020 to Mar 2021). Of our random sample of 4,000 patients, n = 2,962 (74.1%) answered the follow-up call. Unweighted and IPS-weighted in-treatment case fatality in the primary analysis were 6.12% (95%CI: 5.31–6.97%) and 6.07% (95%CI: 5.22–6.93%), respectively. Post-treatment case fatality estimates were 0.97% (95%CI: 0.61–1.33%) (unweighted) and 1.27% (95%CI: 0.79–1.79) (IPS-weighted). Our IPS-weighted estimates for in-treatment and post-treatment case fatality were similar to pre-pandemic IPS-weighted estimates (in-treatment: 7.27%, 95%CI: 5.97%- 8.49% and 12 months post-treatment: 1.23, 95%CI: 0.75–1.73). Although not higher than pre-pandemic estimates, the observed case fatality in this private sector cohort of people treated for drug-susceptible TB during COVID-19 in Bihar, India is above the level needed to reach the 2025 and 2030 End TB Strategy targets for reductions in TB deaths, underlining the extent of pandemic-related setbacks to TB elimination.","author":"Lena Faust","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"0e6dbc530c05e9d241b0040a6ce1fbbca6f2b7e294fc79094c99fe6c76577a00","category":"Environment"}