{"title":"“I just love to race” Tadej Pogačar on winning the Tour at 22 and what the future holds","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-just-love-to-race-tadej-pogacar-on-winning-the-tour-at-22-and-what-the-future-holds","date":1618581681000,"content":"\n      <p><span>Since he took his maiden victory at the Tour de France last year, Tadej Pogačar has taken two further stage race wins in both Tirreno-Adriatico and the UAE Tour, as well as impressing in one-day races such as Liege-Bastogne-Liege, where he finished 3rd in 2020’s postponed autumn race.</span></p>\n<div></div>\n<p><span>His understated attitude and humble demeanour means that the gravity of what this rider has achieved in his young career could easily be overlooked. As the second youngest winner in the Tour’s history, he admits that even he doesn’t quite realise what he has done.</span></p>\n<p><span>“In a couple of years, I will look at this totally differently to how I do now. I’m taking it slowly but I don’t want to waste too much time thinking about what it was, but more about what it’s going to be. I’m focused on the future,” he says.</span></p>\n<p><span>The future looks busy for Pogačar. He’ll be taking part in the Ardennes classics then aiming to defend his Tour de France crown in July. Following the Tour, he’ll head to Spain and attempt to conquer the Vuelta a Espana. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_582725_tdf_278_1024x1024.jpg?v=1618581200\" /></span></p>\n<p><span>With the calibre of climbing talent this year, he knows that these races won’t be easy – the Tour in particular. “It will be one of the biggest, strongest, fields to compete against. It will be a very hard race this year,” he says.</span></p>\n<p><span>One of his main competitors is his fellow countryman Primoz Roglic. We’ve only seen the two of them race against each other once so far this season – in Itzulia Basque Country – and Roglic reigned supreme. Although the relationship between the two Slovenians seems amicable, Roglic certainly won’t have forgotten how Pogačar snatched victory from him in that dramatic closing time-trial last year. </span></p>\n<p><span>Pogačar is nine years Roglic’s junior, and the young rider admits he still has a lot to learn. He explains that he’s worked on improving his mental strength since last year, allowing him to keep calm during races. “I think it’s important not to stress too much about everything,” he says. “Every race I learn how to handle the pressure and stress for myself, and every race it’s getting a little better.”</span></p>\n<p><span>Despite taking the victory overall, last year’s Tour de France was still a steep learning curve, and Pogačar didn’t race without mistakes. In the crosswinds of stage 7, he lost over a minute to Adam Yates, the race leader at that point. This could well have been down to his lack of experience in Grand Tours, the only other he’d raced being the Vuelta the year before. </span></p>\n<p><span>“I learnt a lot about myself and racing. I’m learning slowly and I’ll never stop learning, because this is the sport and this is life. I’ve taken away so much from last year and I’m really happy with the experience,” he says.</span></p>\n<p><span>Despite his focus on what’s to come and attempts to not dwell on the past, Pogačar allows himself to briefly reminisce about his victory last year. “When I saw my family after the finish, and then I hugged my girlfriend, that was such a special moment that I will never forget,” he explains. “I think this was the nicest memory,” he says. “And then when I saw my team-mates after the time-trial and I realised just how happy they were for me. It was spectacular.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_582850_tdf_010_1024x1024.jpg?v=1618581314\" /></span></p>\n<p><span>So what does the future hold for this bright young talent? “I want to train to improve myself in one day races,” he explains. Liege-Bastogne-Liege and Il Lombardia are Classics that could play into his strengths as an exceptional climber. “I will just try my best and we’ll see what we have,” he says.</span></p>\n<p><span>But Pogačar’s goals for the future extend beyond the bike. He explains that he helps young cyclists in Slovenia alongside his old team, giving them the same opportunities he had when he was young. “I want to make sure they have everything they need for development, and I want to continue this and expand it into other fields to help other people, especially children,” he says.</span></p>\n<p><span>In truth, at the age of only 22 he’s had a career that most professional riders would be happy to retire on. For Pogačar that's done a lot to settle the nerves that many riders face at the start of their careers. \"I'm already there alongside the biggest names,\" he says. \"So if I don't improve as much, that's not a problem. I think that's not such a big fear for me anymore.\" </span></p>\n<p><span>Of course, while he could sit back now and enjoy this glory, his youthful passion for the sport suggests that he’ll continue pushing to achieve more and further his palmarès. He puts it quite simply, “Honestly, I just love to race.”</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0e733875087f9bae5f75ec7fac7c0ac9ef3b1ca0b6fd0a2e06f1312b48ec9327","category":"Cycling"}