{"title":"It’s not just Gmail, Apple will delete your inactive iCloud account faster than Google","link":"https://www.macworld.com/article/1920668/google-icloud-account-gmail-delete-inactivity.html","date":1684334005000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>People are upset with Google this week over a change in its policy. While the company previously let people open and keep accounts forever, starting in December, an account that “has not been used or signed into for at least 2 years” <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blog.google/technology/safety-security/updating-our-inactive-account-policies/&amp;xcust=1-1-1920668-1-0-0&amp;sref=https://www.macworld.com/feed\">may be deleted</a>.</p>\n\n\n\n<p>Google says it will send multiple notifications over the months leading up to account deletion to both the account email address and the recovery email to make sure the person has a chance to log in and save their account. Once deleted, accounts will not be recycled and the email address will remain out of circulation.</p>\n\n\n\n<p>It might seem like a drastic change, but it’s not unreasonable. Nor is it out of step with what Apple does. In fact, Apple will delete an inactive account a lot quicker than Google will and seemingly with less warning. Here’s what Apple says in its <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-1920668-1-0-0&amp;u=https://www.apple.com/legal/internet-services/icloud/en/terms.html\">iCloud terms</a>:</p>\n\n\n\n<blockquote><p>In addition, Apple may terminate your Account upon 30 days’ prior notice via email to the address associated with your Account if (a) your Account has been inactive for one (1) year; or (b) there is a general discontinuance of the Service or any part thereof.</p></blockquote>\n\n\n\n<p>Apple explains that terminated accounts “may lose all access to the Service and any portions thereof, including, but not limited to, your Account, Apple ID, email account, and Content. In addition, after a period of time, Apple will delete information and data stored in or as a part of your account(s). Any individual components of the Service that you may have used subject to separate software license agreements will also be terminated in accordance with those license agreements.”</p>\n\n\n\n<p>There are <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://discussions.apple.com/thread/253375168#:~:text=B%20%22In%20addition%2C%20Apple%20may,Contact%20Apple.&amp;xcust=1-1-1920668-1-0-0&amp;sref=https://www.macworld.com/feed\">several</a> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://discussions.apple.com/thread/252558780?&amp;previousThread=253375168021&amp;xcust=1-1-1920668-1-0-0&amp;sref=https://www.macworld.com/feed\">reports</a> on Apple’s forums of Apple following through on this threat, so if you have an older Apple ID, it’s best to log in every few months to make sure Apple won’t delete it.</p>\n\niCloud</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0e78c9945a685381d1f0ee2f7ba6aa4aeb1cd1bd80482bb81d30eced8d0bd098","category":"Apple"}