{"title":"Structure of Genes Encoding Oxidosqualene Cyclases &ndash; Key Enzymes of Triterpenoid Biosynthesis from Sea Cucumber Eupentacta fraudatrix","link":"https://www.preprints.org/manuscript/202410.1310/v1","date":1729085276000,"content":"Oxidosqualene cyclases (OSCs), enzymes are responsible for converting linear triterpenes into teracyclic ones, which known as precursors of other important and bioactive metabolites. Two OSCs genes encoding parkeol synthase and lanostadienol synthase have been found in representatives of the genera Apostichopus and Stichopus (family Stichopodidae, order Synallactida). Since the limited number of sea cucumber OSCs were so far studied, OSCs encoding gene(s) of the sea cucumber Eupentacta fraudatrix (family Sclerodactylidae, order Dendrochirotida) were investigated to fill this gap. Here we employed RACEs, molecular cloning and Oxford Nanopore Technologies to identify candidate OSC mRNAs and genes. The assembled cDNAs were 2409 bp (OSC1) and 3263 bp (OSC2) which were shared the same CDS size of 2163 bp encoding a 721-amino-acid protein. The E. fraudatrix OSC1 and OSC2 had higher sequence identity to each other (77.5%) than to other holothurian OSCs (64.7–71.0%). According to the sequence and molecular docking analyses, OSC1 with L436 is predicted as parkeol synthase, while OSC2 with Q439 is predicted as lanostadienol synthase. Based on the phylogenetic analysis, E. fraudatrix OSCs cDNAs clustered with other holothurian OSCs forming the isolated branch. As a result of gene analysis, high polymorphism and larger size of the OSC1 gene suggest that this gene may be an ancestor of the OSC2 gene. These results implied that E. fraudatrix genome contains two OSC genes with different from Stichopodidae OSCs genes evolutionary pathway.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0e80365eab56d9d42d9412910007849639cf06fb33a3b5f2d393fd30732df79e","category":"Interdisciplinary"}