{"title":"Spotify Using AI to Translate Podcasters' Original Voices to Additional Languages","link":"https://www.macrumors.com/2023/09/26/spotify-ai-voice-translation/","date":1695760952000,"content":"Spotify <a href=\"https://newsroom.spotify.com/2023-09-25/ai-voice-translation-pilot-lex-fridman-dax-shepard-steven-bartlett/\">this week announced</a> an AI translation feature for podcasters that could give it an edge over Apple's podcasting platform. <a href=\"https://open.spotify.com/genre/0JQ5DAqbMKFFE3WXPvSulX\">Voice Translation for podcasts</a> uses artificial intelligence to translate podcasts into additional languages using the original podcaster's voice.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/08/General-Spotify-Feature.jpg\" alt width=\"2500\" height=\"1407\" />\r<br />\nWhile Spotify developed the tool, it is using OpenAI's latest voice generation technology. It learns the original speaker's voice and style and then translates the podcast into another language. Spotify says that this system will provide a \"more authentic listening experience\" that is more natural and personal than standard dubbing. Podcasts translated this way will retain the speaker's distinctive speech characteristics.\r<br />\n\r<br />\nSpotify is testing Voice Translation at the current time, and is working with podcasters like Dax Shepard, Monica Padman, Bill Simmons, Steven Bartlett, and Lex Fridman to create AI-powered voice translations in languages like Spanish, French, and German for both existing episodes and future podcast episodes.\r<br />\n\r<br />\nVoice-translated episodes are available worldwide to Premium and Free users. An initial bundle of translated episodes in Spanish are available now, with French and German rolling out \"in the coming days and weeks.\" According to Spotify, the pilot program will provide \"important insights\" for future expansion and iteration.\r<br />\n\r<br />\nWhile Apple does not have a competing tool at this time for the Podcasts platform, it is experimenting with AI voice technology. In <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, Apple <a href=\"https://www.macrumors.com/2023/06/05/ios-17-personal-voice/\">added a Personal Voice feature</a> that allows you to use AI to create a replica of your voice. Right now, this is an accessibility feature that Apple has designed for those who are at risk of losing their ability to speak, but it stands to reason that Apple could use voice replication in other areas in the future.<div>Tags: <a href=\"https://www.macrumors.com/guide/spotify/\">Spotify</a>, <a href=\"https://www.macrumors.com/guide/apple-podcasts/\">Apple Podcasts</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/26/spotify-ai-voice-translation/\">Spotify Using AI to Translate Podcasters' Original Voices to Additional Languages</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/spotify-using-ai-to-translate-podcasters-original-voices-to-additional-languages.2404883/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0e93e43d078ab8089c73f1c7e86aa685fdc952528e24647755112edfa956d1f9","category":"Apple"}