{"title":"Transcending borders: Remarkable genetic homogeneity among Barred mudskipper (Periophthalmus argentilineatus) populations in the southwestern Indian Ocean","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13259?af=R","date":1708794294000,"content":"<h2>Abstract</h2>\n<p>In the past 24 years, the Southwestern Indian Ocean (SWIO) region has lost about 4% of its mangroves due to unsustainable extraction, land clearance for agriculture and climate change impacts. Since this loss risks fragmenting mangrove fauna, this study analysed 179 D-loop sequences (329 base pairs) of Barred mudskipper (<i>Periophthalmus argentilineatus</i>) sampled from estuarine mangroves in the SWIO to test two hypotheses: (1) whether Barred mudskipper populations in the region display genetic connectivity along the fragmented mangroves and (2) whether these populations have experienced demographic declines in recent history. The populations showed low and insignificant indices of genetic differentiation (<i>F</i>\n<sub>ST</sub> = −0.00068, <i>p</i> &gt; 0.05; Φ<sub>ST</sub> = 0.005, <i>p</i> &gt; 0.05), and haplotypes from different localities did not cluster according to their geographical origins. Similarly, Bayesian phylogenetic analysis grouped all SWIO haplotypes into one cluster, suggesting the hypothesis of genetic interconnectedness could not be rejected. Furthermore, the populations showed high haplotype diversity (0.96 ± 0.007) combined with low nucleotide diversity (1.09 ± 0.61%). They also showed significant negative Tajima's <i>D</i> values (−1.71, <i>p</i> &lt; 0.02) and a unimodal mismatch distribution, indicating the hypothesis of demographic expansion post a historical bottleneck could not be rejected. Nevertheless, the Bayesian skyline plot indicated an increase in population size post-bottleneck, suggesting an ongoing recovery. These findings indicate that, despite varying management approaches in the SWIO, Barred mudskipper populations exhibit genetic exchange that transcends geographical and administrative borders. This implies that their populations should be considered a single stock within the region. These findings underscore the need for coordinated management approaches among the SWIO countries. This is crucial because inconsistencies in conservation measures across borders could disrupt the population's interconnectedness, potentially impacting their genetic integrity and long-term survival.</p>\n<h2>Résumé</h2>\n<p>Au cours des 24 dernières années, la région du sud-ouest de l'océan Indien (SWIO) a perdu environ 4 % de ses mangroves en raison de l'extraction non durable, du défrichement pour l'agriculture et des effets du changement climatique. Puisque cette perte risque de fragmenter la faune des mangroves, cette étude a analysé 179 séquences de boucles D (329 paires de bases) de mudskippers argentés (Periophthalmus argentilineatus) échantillonnées dans les mangroves estuariennes du SWIO pour tester deux hypothèses : (1) si les populations de mudskippers argentés de la région présentent une connectivité génétique le long des mangroves fragmentées et (2) si ces populations ont connu des déclins démographiques au cours de l'histoire récente. Les populations présentaient des indices de différenciation génétique faibles et négligeables (<i>F</i>\n<sub>ST</sub> = −0,00068, <i>p</i> &gt; 0,05; Φ<sub>ST</sub> = 0,005, <i>p</i> &gt; 0,05), et les haplotypes provenant de différentes localités ne se regroupaient pas en fonction de leurs origines géographiques. De même, l'analyse phylogénétique bayésienne a regroupé tous les haplotypes du SWIO en un seul groupe, ce qui suggère que l'hypothèse de l'interconnexion génétique ne pouvait pas être rejetée. En outre, les populations présentaient une grande diversité haplotypique (0,96 ± 0,007) associée à une faible diversité nucléotidique (1,09 ± 0,61 %). Elle a également montré d’importantes valeurs négatives importantes du D de Tajima (−1,71, <i>p</i> &lt; 0,02) et une distribution unimodale de l'inadéquation, ce qui indique que l'hypothèse d'une expansion démographique après un goulot d'étranglement historique ne pouvait pas être rejetée. Néanmoins, la ligne d'horizon bayésienne indiquait une augmentation de la taille de la population après le goulot d'étranglement, ce qui laisse supposer une reconstitution en cours. Ces résultats indiquent que, malgré les différentes approches de gestion dans le SWIO, les populations de mudskippers argentés présentent des échanges génétiques qui transcendent les frontières géographiques et administratives. Cela implique que leurs populations doivent être considérées comme un seul stock dans la région. Ces résultats soulignent la nécessité d'adopter des approches de gestion coordonnées entre les pays du SWIO. Ce point est crucial, car les incohérences des mesures de conservation au niveau transfrontalier pourraient perturber l'interconnexion des populations, ce qui pourrait avoir une incidence sur leur intégrité génétique et leur survie à long terme.</p>","author":"Cyrus Rumisha","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"0e938241dc51591f2f4bff10758a9dbac262a97b24eee48f34699979441c8776","category":"Environment"}