{"title":"Forget the M3, Apple is already eyeing 2nm chips for 2025","link":"https://www.macworld.com/article/2172559/apple-processor-2nm-1-4nm-process-tsmc.html","date":1702573256000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s first 3 nanometer chips, the A17 Pro and M3, are not even three months old, but technology is always moving forward, and Apple is already looking towards the next fabrication process. The Financial Times <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.ft.com/content/e9be182f-ec9e-4426-9cd2-d5181fd64778&amp;xcust=1-1-2172559-1-0-0&amp;sref=https://www.macworld.com/feed\">reports</a> (subscription required) that the Taiwan Semiconductor Manufacturing Company (TSMC) is developing a 2nm chip process that has been demonstrated to Apple and other clients.</p>\n\n\n\n<p>TSMC, which manufactures Apple’s chips, projects that mass production of 2nm chips could be ready by 2025, and the company told the Financial Times that the process “will be the most advanced semiconductor technology in the industry in both density and energy efficiency when it is introduced.”</p>\n\n\n\n<p>The evolution of the fabrication process increases the transistor density in the chip and allows for more chip cores, more cache, and other features. For example, Apple’s M1 Mac chip and A14 Bionic iPhone chip were manufactured with the 5nm process. When Apple switched to the 3nm process for the M3 and A17, Apple was able to fit more transistors onto the silicon, which increased the chips’ performance, boosted core counts, and allowed for other features. The newer process also improves power efficiency.</p>\n\n\n\n<p>If TSMC and Apple can meet the 2025 goal, that could mean that the iPhone 17 Pro could sport an A19 Pro chip (if Apple sticks to the current naming convention) made with a new 2nm process. Apple generally debuts new chip designs in its iPhone first, so 2nm M-series Mac chips could follow in late 2025 or early 2026.</p>\n\n\n\n<p>But technology is always moving forward, and so is TSMC. Analyst Dylan Patel posted on X that TSMC already has a 1.4nm process in development.  A TSMC representative did not provide a timeline as to when 1.4nm will be ready for mass production, but it’s presumably many years away.</p>\n\n\n\n<figure><div>\n<blockquote><p>Geoffrey Yeap of TSMC talking<br />N2 mass production 2025<br />A14 in development (first time they've said the name??)<br />Talking about backside power delivery network<br />PPACt – Power, Performance, Area, Cost, Time to market <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/7ngKVRSSfK&amp;xcust=1-1-2172559-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/7ngKVRSSfK</a></p>— Dylan Patel @ Neurips (@dylan522p) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/dylan522p/status/1734766944774193291?ref_src=twsrc%5Etfw&amp;xcust=1-1-2172559-1-0-0&amp;sref=https://www.macworld.com/feed\">December 13, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Interestingly, TSMC refers to the 1.4nm process as “A14,” which can be confusing when considering how Apple names its iPhone chips. TSMC has previously referred to its 5nm, 3nm, and upcoming 2nm processes as N5, N3, and N2–the “N” stands for <em>nanometer</em>. As <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/josefandos&amp;xcust=1-1-2172559-1-0-0&amp;sref=https://www.macworld.com/feed\">Jose Fandos on X</a> points out, an <em><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.checkyourmath.com/convert/length/angstrom.php&amp;xcust=1-1-2172559-1-0-0&amp;sref=https://www.macworld.com/feed\">angstrom</a></em> is a unit of measurement that is equal to 0.1 nanometers. So instead of calling it N1.4, TSMC has decided to use the name “A14,” where the “A” stands for angstrom. But since it’s very early, it’s likely for the nomenclature to change between now and release.</p>\n\nCPUs and Processors</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0e9fe4167cad8bdbf3c18c6bf12244e7d52f2b8b5fbc9828aa4fccd241794742","category":"Apple"}