{"title":"Apple’s mixed-reality headset needs a reality distortion field","link":"https://www.macworld.com/article/2211381/apple-vision-pro-steve-jobs-reality-distortion-field.html","date":1706790606000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The growing hype ahead of Vision Pro’s launch has reminded me how much fun it can be when Apple launches something genuinely new. (Goodness knows it doesn’t happen often.) But the world, as Anton Ego explains at the end of <em>Ratatouille</em>, is often unkind to new creations. The new needs <em>friends</em>.</p>\n\n\n\n<p>Who will be friendly to Vision Pro? The critical response, in fact, has been pretty positive, with our own Roman Loyola’s <a href=\"https://www.macworld.com/article/1944516/apple-vision-pro-hands-on-feaures-design-fit.html\">first impressions</a> described as an “emotional, immersive, and completely captivating” experience. Just this week, the first <a href=\"https://www.macworld.com/article/2222047/apple-vision-pro-reviews-roundup.html\">real-world reviews</a> arrived and largely agreed, with reviewers calling it “the best wearable display” ever made.</p>\n\n\n\n<p>However, there’s more criticism out there than usual. Reviews were peppered with questions about the device’s purpose and appeal. Unlike something like the 1st-gen Apple Watch or iPhone, Vision Pro doesn’t have an obvious killer app and isn’t the kind of device people are going to buy on impulse. You can justify a $349 smartwatch or $599 phone, but $3,499 on a headset you might not use every day is a much taller order—and makes the usual first-gen issues that much more glaring. </p>\n\n\n\n<p>And let’s be clear, Vision Pro has its fair share of issues. Read between the lines of even the most glowing reviews and you start spotting the red flags: heavy weight, large size, poor battery life, and lack of a clear killer app (and some <a href=\"https://www.macworld.com/article/2201774/apple-vision-pro-youtube-netflix-spotify-native-apps.html\">important third-party ones</a>). It all points to something that is wildly impressive to try out but scarcely likely to justify its lofty price tag over the long term. Or even the slightly less short term: several reviewers noted that the headset can make your neck tired and your head sweaty after around half an hour of use, which might be why the product demo is scheduled to last <a href=\"https://www.macworld.com/article/2201946/if-you-want-to-try-apple-vision-pro-get-ready-to-wait-a-while.html\">precisely 25 minutes</a>. (I should point out, however, that Roman did <em>not</em> report such symptoms after a full hour with the device. It’s all subjective.)</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3808399/diff_think.jpg?quality=50&amp;strip=all\" alt=\"Different Think artwork\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<p>What Apple could use right now is a bit of the old Steve Jobs magic. (I promise I’m not one of those journalists who always say that. In a separate article I’ve argued, at significant risk to my person, that Tim Cook <a href=\"https://www.macworld.com/article/677877/different-think-tim-cook-not-steve-jobs-is-apples-mvp.html\">is a better CEO</a>.) If you ever needed someone to gloss over the imperfections of a flawed but intriguing product, to charm the customer into absorbing the official marketing line, Jobs was the man for the, well, job. You can imagine him on stage with Vision Pro, teasing it out, and playing with the audience’s expectations. And winning over a roomful of hardened journalists through sheer force of will.</p>\n\n\n\n<p>But more importantly, with Jobs at the helm, it’s hard to imagine that Vision Pro would have had quite so many limitations in the first place. The famous reality distortion field that buzzed and crackled around him was most powerful when repelling the pessimistic reports of his employees. “I’m sorry, Steve, it’s simply impossible for us to ship the iPod with all the features you want. What’s that, you simply refuse to believe me? And you’re being kind of weird about the whole thing, and frankly a bit of a bully? I guess I’ll just go and achieve the impossible, then. See you for the iPhone launch.”</p>\n\n\n\n<p>There are elements of Jobcraft in the way Cook has overseen the Vision Pro project, namely, in his regal refusal to accept that the technology <a href=\"https://www.macworld.com/article/1655723/ar-vr-headset-2023-launch-design-team-tim-cook.html\">wasn’t ready for a 2023 launch</a>, despite warnings to that effect from the design team. But it’s difficult to imagine that Jobs would have left things at,”Yes we <em>will</em> launch this year, and I suppose we shall see whether or not you were right.” He would have made the design team recant their warnings and work ludicrous hours creating a product that was so fantastic it made their warnings look silly in retrospect.</p>\n\n\n\n<p>Some of my concerns with Vision Pro are likely to fade in the future. There will probably be a significantly cheaper version a year or so after the Pro model, while chassis weight and battery performance are factors that only move in one direction in the tech industry. Developers can probably be depended upon to come up with an impressive library of third-party apps, and users themselves, if the Apple Watch is any precedent, may steer the product in a direction Apple wasn’t expecting, potentially helping to discover the use case that will make it essential.</p>\n\n\n\n<p>The question is whether Apple is willing to support the Vision ecosystem financially for long enough to get through the growing pains: whether it will happily launch generation after generation of low-selling headsets, plowing a huge proportion of its developmental and marketing resources into the project without seeing anything like an adequate return on its investment. All for a slice of a potentially important future pie, when nobody actually knows how big the pie will be or whether the public is even hungry. </p>\n\n\n\n<p>Apple, like the restaurant in <em>Ratatouille</em>, may have a talented Cook, but it may be beyond even his powers to ensure that Vision Pro is a success.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0eb035a2efdcdaa0e18edf674fc5e403f35691de0c4ad0086aaab73c20f5872d","category":"Apple"}