{"title":"Face Off: The Socio-Political Background of the COVID-19 Syndemic in USA","link":"https://www.preprints.org/manuscript/202409.1160/v1","date":1726473771000,"content":"Background: \nThe Covid-19 pandemic was in reality a syndemic there the balance between a multitude of biological (Nature-made) and socio-political (men-made) factors determined individually the outcome of every single infection, on a scale of nothing-to-fatal. Blaming the virus for everything bad that happened to us after January 2020 is incorrect. Now, in ~ 2 years distance from the syndemic, it may be timely and possible to uncover the human contribution to this historical event and learn of it. \n\t\t\t\t\t\t\t\nObjective:  \nTo identify and use some qualitative approach to estimate the objective, statistical / epidemiological ‘value’ of the virus-selected individuals (in age-normalized groups) for the rest of the society. This non-political, non-religious approach may be the only way to understand the benefit / cost ratio of actions and emergency orders we had to survive in addition to the virus itself.   \n\nMethods:\nStatistical data were obtained from publicly available official databases, including the relevant actuarial tables and evaluated by widely used statistical methods. The estimation of statistical/epidemiological ‘value of life’ was based, strictly and exclusively, on the real age and the statistically calculated Residual Life Expectancy (RLE, i.e. remaining years alive at a given age). \n\nThe American healthcare expenses were compared to the corresponding healthcare costs/capita in other similarly well-developed west-European countries. This was the only available method to get some ideas about the magnitude of the well-established (rational) healthcare spending and compare it to the American standards.\n\nResults\n1)\tLife expectancy uninterruptedly increased in USA since 1933, due to continuous reduction of Mortality Rate of the youngest and oldest citizens. COVID didn’t stop the population growth (+8.2 M /2020-2023). \n2)\tThe total count of Excess COVID associated Deaths (XCD) is ~ 2-times as much as the official statistic was able to explain by virus infection. It is speculated that these Complementary Covid Deaths (CCD) are probably the unexpected side-effects of the pandemic related emergency orders. \n3)\t The worldwide ‘longevity’ trend exponentially increased the healthcare expenses, especially the care of elderly. However the USA is unique in this aspect and the healthcare costs are irrationally much higher than in any other country. \n4)\tWe can see a large economic incentive in the development of excesses under COVID syndemic. \n\nConclusions\nThe harm of the COVID virus - as well as the benefits of the mandatory, emergency actions during the pandemic - were grossly over-estimated. Professional, unbiased (non-religious, non-political) and independent reviews are strongly recommended.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0eb42812650b4861af2e9fc76d064cea4f015f1a543f685505ea68771ff4b475","category":"Interdisciplinary"}