{"title":"Combined Use of Multiple Cloud‐Free Snow Cover Products in China and Its High‐Mountain Region: Implications From Snow Cover Identification to Snow Phenology Detection","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036274?af=R","date":1717512279000,"content":"<h2>Abstract</h2>\n<p>Accurate snow phenology detection, including snow cover days (SCD), snow start date (SSD), and snow end date (SED), is increasingly important for understanding mountain hydrology such as snow heterogeneity and snowmelt seasonality. Multiple cloud-free daily snow cover products have recently been developed in China, employing diverse retrieval algorithms and cloud-gap-filling methods, resulting in varying accuracy levels. However, comprehensive analysis of differences among products and their impact on snow phenology detection is lacking. This study systematically evaluates eight state-of-the-art snow cover products in China, focusing on the challenging Tibetan Plateau (TP). We introduce a novel metric, the consistency-weighted correlation coefficient (CWR), customized for SSD and SED detection, and propose product-combining schemes like “ensemble voting” and “sensor preference” to enhance reliability. Our findings highlight the prime influence of retrieval algorithms under clear-sky conditions on accuracy, surpassing the importance of cloud-gap-filling methods. Specifically, a product optimizing normalized difference snow index thresholds for diverse landcover types consistently outperforms others in detecting all three snow phenology parameters, with correlation coefficients for SCD of 0.82 and 0.69, and CWR values for SSD of 0.54 and 0.40, and for SED of 0.53 and 0.37 in both China and the TP, respectively. Moreover, our proposed scheme combining three high-accuracy products significantly enhances snow cover identification and SCD detection, especially when the best-performing product alone faces substantial uncertainty. These findings provide immediate, crucial implications for optimizing the use of multiple cloud-free products to enhance snow phenology detection, ultimately advancing the applicability of derived snow parameters in mountain hydrology research.</p>","author":"Longhui Zhang, \nHongbo Zhang, \nXueyan Sun, \nLun Luo","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"0eb526cdfeb2349797868b7fd774fe17d7ffd786d38b87eaacfe398d253a3a30","category":"Environment"}