{"title":"เจาะลึกภารกิจ ซีพี-ทรู ใช้เทคโนโลยีสนับสนุนสาธารณสุขสู้ภัยโควิด-19","link":"https://www.blognone.com/node/123311","date":1624263114000,"content":"<div><div><div><p>นับตั้งแต่เกิดวิกฤตโรคระบาด โควิด-19 เรามองเห็นความเคลื่อนไหวของซีพีในการใช้ทรัพยากรที่มี สร้างโซลูชันเร่งด่วนเพื่อแก้วิกฤตมาโดยตลอด ยกตัวอย่างเช่น <a href=\"https://www.blognone.com/node/121071\">การใช้ AI มาเพิ่มประสิทธิภาพในการตรวจสอบคุณภาพหน้ากากอนามัยที่เครือซีพีตั้งโรงงานผลิตเพื่อส่งมอบให้แก่บุคลากรทางการแพทย์และผู้เปราะบางตั้งแต่โควิดรอบแรกจนถึงปัจจุบัน</a></p>\n<p>วิกฤตโควิดรอบนี้ เครือซีพีผนึกกำลังกับบริษัทในเครือร่วมทำโครงการซีพีร้อยเรียงใจ สู้ภัยโควิด-19 สนับสนุนภารกิจโรงพยาบาลสนาม โดย Blognone ได้พูดคุยกับ คุณณัฐวุฒิ อมรวิวัฒน์ กรรมการผู้จัดการใหญ่ (ร่วม) บมจ. ทรู คอร์ปอเรชั่น เกี่ยวกับการผนึกกำลังของซีพีและทรู ร่วมนำทรัพยากรและเทคโนโลยีมาสนับสนุนภารกิจภาคสาธารณสุข อำนวยความสะดวกด้านการสื่อสาร พัฒนาซอฟต์แวร์ใหม่ๆ  เสริมประสิทธิภาพการทำงานของบุคลากรทางการแพทย์และช่วยเหลือคนไทยให้เข้าถึงบริการทางการแพทย์ได้ในสถานการณ์โควิด-19</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c76e1a1a9a0e30614ae93cd1528d1e20.jpeg\" /></p>\n<p>คุณณัฐวุฒิ เล่าจุดเริ่มต้นว่า ทันทีที่เกิดโควิด-19 ระบาดระลอกใหม่ในประเทศไทย คุณธนินท์ เจียรวนนท์ ประธานอาวุโสเครือเจริญโภคภัณฑ์ ได้กำหนดนโยบายตั้งโครงการช่วยเหลือและสนับสนุนบุคลากรทางการแพทย์ พัฒนาโครงการในชื่อ “ซีพีร้อยเรียงใจ สู้ภัยโควิด-19”</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/62ef4fd85ac2e5282163b1f878d05d9d.png\" /><br />\nคุณณัฐวุฒิ อมรวิวัฒน์ กรรมการผู้จัดการใหญ่ (ร่วม) บมจ. ทรู คอร์ปอเรชั่น</p>\n<h3>โอกาสที่มาพร้อมกับวิกฤต</h3>\n<p>เทคโนโลยีที่ทางเครือซีพีและบริษัทในเครือฯ ช่วยสนับสนุนโรงพยาบาลมีหลากหลาย เพราะบริษัทมีทรัพยากรอยู่แล้ว จึงเป็นโอกาสที่จะนำไปประยุกต์กับการใช้งานของโรงพยาบาลได้ ยกตัวอย่างเช่น การนำ engine ที่บริษัทมีไปเชื่อมต่อเข้ากับระบบของโรงพยาบาลที่มีอยู่ ช่วยประหยัดเวลาในการสร้างแพลตฟอร์มซอฟต์แวร์ขึ้นมาใหม่ หรือการที่ทรูนำระบบ Analytic เข้าไปช่วยกรมควบคุมโรค วิเคราะห์การกระจายตัวของโรคระบาด ให้สามารถหาทางรับมือได้ว่าโรคจะกระจายไปยังพื้นที่ใดต่อไป ซึ่งโครงการและกิจกรรมต่างๆ มาจากการทำงานร่วมกันของหลายภาคส่วน คาดการณ์เทรนด์อนาคตว่าเป็นโลกของการทำงานร่วมกันในการพัฒนาโซลูชันเพื่อปรับปรุงคุณภาพชีวิต จึงเป็นโอกาสที่บริษัทจะผลักดันเป็นโมเดลต่อไปในอนาคตแน่นอน</p>\n<h3>เร่งเพิ่มประสิทธิภาพเครือข่าย True 5G ในโรงพยาบาลและโรงพยาบาลสนาม รองรับความต้องการด้านการสื่อสาร</h3>\n<p>ในโครงการซีพีร้อยเรียงใจ สู้ภัยโควิด-19 ซึ่งเป็นโครงการใหญ่ที่ซีพีทุ่มงบร่วม 200 ล้านบาท ได้ให้ความช่วยเหลือครอบคลุมด้านต่างๆ โดยเน้นสิ่งที่เครือซีพีทำได้ดี เช่น อาหาร เครื่องดื่ม เสริมอุปกรณ์การแพทย์ที่ขาด และด้วยการผนึกกำลังกับทรู ทำให้สามารถส่งมอบเทคโนโลยีและบริการสื่อสารต่างๆ แก่โรงพยาบาลหลักและโรงพยาบาลสนาม รวมถึงศูนย์ฉีดวัคซีนในหลายๆ แห่งด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/451eeeda9b08045be31ad0d761aef375.jpg\" /><em>โครงการซีพีร้อยเรียงใจ สู้ภัยโควิด-19 ให้ความช่วยเหลือแก่โรงพยาบาลต่างๆ</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f4d02b01d8c151f7dfd212cdc9e15e08.jpg\" /><em>หุ่นยนต์ต้อนรับผู้มารับบริการฉีดวัคซีน</em></p>\n<p>กลุ่มทรู ได้เร่งส่งมอบบริการและอุปกรณ์สื่อสารให้แก่โรงพยาบาลและโรงพยาบาลสนาม เนื่องจากการแพร่ระบาดของโควิด-19 ระลอก 3 มีผู้ป่วยจำนวนมากต้องเข้ารักษาในโรงพยาบาลสนามทั่วประเทศ โดยขยายสัญญาณทั้ง True 5G, 4G และ WiFi ให้แก่โรงพยาบาลสนามแล้ว 205 แห่ง รวมถึงโรงพยาบาลบุษราคัม อาคารชาเลนเจอร์ เมืองทองธานี ซึ่งสามารถ รองรับการใช้งานสื่อสารไร้สายของผู้ป่วย 5,000 เตียง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1125d157eac9bffd92ba3b842ab95974.jpeg\" /></p>\n<p><em>รถโมบายล์ชุมสายเคลื่อนที่เร็ว ทรูมูฟ เอช ขยายสัญญาณเครือข่ายอัจฉริยะ True 5G และ Wi-Fi</em></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2db49e4a22a3754d0d30d90614fe30fd.png\" /><em>หุ่นยนต์อัจฉริยะ True 5G เทมิ ช่วยดูแลผู้ป่วย แบ่งเบาภาระแพทย์และพยาบาล</em></p>\n<p>นอกจากนี้ กลุ่มทรู ยังเพิ่มความผ่อนคลายจากอาการเจ็บป่วยขณะพักรักษาตัว ให้ผู้ป่วยเข้าถึงความบันเทิงออนไลน์ ดูคอนเทนต์หลากหลาย ทั้งสาระและบันเทิง พร้อมทั้งเปิดคอลล์ เซ็นเตอร์เฉพาะกิจ รับแจ้งปัญหาบริการและเครือข่ายสื่อสาร สำหรับบุคลากรทางการแพทย์ และผู้ป่วยใน รพ.สนาม โดยเฉพาะด้วย</p>\n<h3>ขยายบริการปรึกษาแพทย์ออนไลน์ ลดความแออัดในโรงพยาบาล</h3>\n<p>นอกจากการดูแลและเพิ่มประสิทธิภาพเครือข่ายสื่อสารแล้ว ทรูยังนำแพลตฟอร์มดูแลสุขภาพอัจฉริยะ True HEALTH ยกระดับคุณภาพชีวิตให้คนไทยให้เข้าถึงบริการทางการแพทย์ออนไลน์ โดยร่วมกับทีมแพทย์อาสาชีวี จัดแคมเปญ \"Together We Care\" ให้คนไทยทุกคนปรึกษาเรื่องสุขภาพเบื้องต้นกับทีมแพทย์อาสาจากชีวีบริรักษ์คลินิกเวชกรรม ผ่านแอปพลิเคชัน True HEALTH โดยไม่เสียค่าใช้จ่าย ไม่ต้องเดินทางไปโรงพยาบาล ช่วยลดความเสี่ยงติดเชื้อ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7e10b0de19b115e3c2e4dd5ed0e0c9dd.jpeg\" /></p>\n<p><em>แพลตฟอร์มดูแลสุขภาพอัจฉริยะ True HEALTH</em></p>\n<p>พร้อมกันนี้ ทรูยังเปิดมุมสุขภาพ True Health แห่งแรก ที่ โลตัส เลียบด่วนรามอินทรา ให้บริการปรึกษาเรื่องสุขภาพกับผู้เชี่ยวชาญด้านสุขภาพจากชีวี ผ่านกระจกอัจฉริยะ (Smart Mirror) ที่เชื่อมต่อผ่านเครือข่ายอัจฉริยะทรู 5G สามารถเข้าไปใช้บริการได้ง่ายๆ สะดวกสบาย และปลอดภัย  ทั้งยังลดความหนาแน่นในโรงพยาบาลได้เช่นกัน</p>\n<h3>เทรนด์ในอนาคต</h3>\n<p>คุณณัฐวุฒิ บอกว่า เทคโนโลยี 5G เป็นเทรนด์ที่มีมาระยะหนึ่งแล้ว แต่โควิดช่วยเร่งการใช้ 5G ให้ขยายไปเร็วขึ้น ในแง่การเชื่อมต่อทำให้ชีวิตดีขึ้นและราบรื่นขึ้นอยู่แล้ว แต่ 5G ยังมาพร้อมกับแบนด์วิธกว้าง ช่วยให้งานยากๆ อย่างการผ่าตัดทางไกลนั้นเป็นไปได้ หากการใช้ 5G เป็นไปอย่างกว้างขวางแล้ว คนก็จะไม่หันกลับไปใช้ของเดิมที่ช้ากว่าแน่นอน</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/cp-group\">CP Group</a></div><div><a href=\"/topics/true\">True</a></div><div><a href=\"/topics/5g\">5G</a></div><div><a href=\"/topics/covid-19\">COVID-19</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0eb6c211cc5a78ffbe0204b99d0ebc9aa9b2358087527f607fc39f754145db72","category":"Thai"}