{"title":"The photon‐electrical conversion efficiency of dye‐sensitive solar cells fabricated using a highly conductive silver‐nanoparticle/titania photocathode","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300044?af=R","date":1707196547000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/35fab36e-e538-40e9-b64e-eb7d900202cb/appl202300044-gra-0001-m.png\" alt=\"The photon-electrical conversion efficiency of dye-sensitive solar cells fabricated using a highly conductive silver-nanoparticle/titania photocathode\" /><p>A p-type architecture for dye sensitized solar cells where the active region is sandwiched between 75% Ag/25%TiO<sub>2</sub> highly conductive photocathode thin film on quartz glass and activated carbon-FTO film.\n\n</p><br />\n<h2>Abstract</h2>\n<p>The TiO<sub>2</sub> thin film, Ag NP and three Ag-NP/TiO<sub>2</sub> composite thin films (COMP-Ag<sub>n;</sub>\n<i>n</i> = 20, 50, and 75 Ag mol%) were successfully fabricated on quartz glass. The optical properties of the composite electrodes were investigated, and the results indicate a surface plasmonic resonance peak at 410 nm while the electrical resistivity of the composite thin films improved up to 6.9 × 10<b>\n   <sup>−</sup>\n</b>\n<sup>5</sup> Ω cm. The photo-response threshold of the Ag-NP/TiO<sub>2</sub> composite thin films was enhanced and shifted into the visible and near-infrared when the chlorophyll dye was adsorbed onto them. The hall effect was performed on the fabricated thin films and the charge carrier concentrate value confirmed that the Ag/TiO<sub>2</sub> with Ag concentrate &gt;45% are found to be p-type. The n-types were observed till the Ag content in TiO<sub>2</sub> was increased up to 45 mol%. COMP-Ag75 has a charge carrier concentration of 1.3 × 10<sup>−19</sup> cm<sup>−3</sup> as a p-type electrode was then employed to construct a p-DSSC. Such enhancement on photovoltaic activity can be attributed to the generated Z-scheme system in the anatase/rutile phase-junction Ag/TiO<sub>2</sub> photocathode enhances the separation, diffusion, and transformation of electron/hole pairs inside the structure. This p-DSSC exhibits a photon-electrical conversion efficiency (PCE) of 0.37%. The PCE recorded is equal to or greater than those of traditional high-efficiency n-DSSCs. This allows the creation of a new generation of photocathodic p-DSSCs with previously unheard-of unprecedentedly high concentrations of Ag (up to 80 mol%) evenly scattered in a TiO<sub>2</sub> matrix, and this efficacy is the highest ever reported for a p-type working Ag/TiO<sub>2</sub>/chlorophyll/iodine electrode. This may enable the use of this electrode as a component of photosensitizer tandem devices.</p>","author":"Likius S. Daniel, \nRocha T. Kaffer, \nLoini M. Kalipi, \nAteeq Rahman, \nMbela Kalengay, \nVeikko Uahengo","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"0eb6a0a4479e06f027ef84d94720d21d69cc79c03dc5336a3a514d9b7d09464d","category":"Environment"}