{"title":"U.S. Pay-TV Subscriptions Fall to Lowest Levels Since 1992","link":"https://variety.com/2023/tv/news/cord-cutting-all-time-high-q1-2023-pay-tv-losses-1235610939/","date":1685559289000,"content":"\n<p><a href=\"https://daringfireball.net/linked/2023/05/31/bally-sports-stiffs-the-padres\">Speaking of the demise of regional sports networks</a>, here’s Todd Spangler reporting for Variety:</p>\n\n<blockquote>\n  <p>As streaming video continues its ascendancy, cable, satellite and\ninternet TV providers in the U.S. turned in their worst subscriber\nlosses to date in the first quarter of 2023 — collectively\nshedding 2.3 million customers in the period, according to analyst\nestimates. [...] With the Q1 decline, total pay-TV penetration of\noccupied U.S. households (including for internet services like\nYouTube TV and Hulu) dropped to 58.5% — its lowest point since\n1992, two years before DirecTV launched as a new rival to cable\nTV, according to Moffett’s calculations. [...]</p>\n\n<p>Google’s YouTube TV was the only provider tracked by\nMoffettNathanson that picked up subs in Q1, adding an estimated\n300,000 subscribers in the period (to reach about 6.3 million) and\nnetting 1.4 million subscribers over the past year. [...]</p>\n\n<p>Pay TV is suffering from what Moffett calls “the impoverishment\ncycle,” in which higher sports-broadcast fees have driven retail\nprices higher — thereby fueling cord-cutting and forcing\ndistributors to increase prices to compensate. Even ESPN, one-time\nstalwart of the traditional ecosystem, has conceded that there\nwill be a day when a la carte streaming is a viable option,\nMoffett noted.</p>\n</blockquote>\n\n<p>It’ll be interesting to see how much YouTube TV growth is juiced by <a href=\"https://tv.youtube.com/learn/nflsundayticket/\">NFL Sunday Ticket later this year</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/31/pay-tv-decline\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"0ec08bf2a2765642953ecff7bdd64a92d22d478f934f39d66f28fcd4cf59c056","category":"Tech"}