{"title":"Investigating the mediating role of food involvement in the relationship between eating restrictions, nutritional knowledge, and dietary patterns in adults","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301533","date":1711980000000,"content":"<p>by Kiyana Saadati, Mohammad Reza Kordbageri, Fakhreddin Chaboksavar, Khadije Jahangasht Ghoozlu, Shabnam Parvizi, Abbas Shamsalinia, Reza Ghadimi, Zeinab Porasgari, Fatemeh Ghaffari</p>\r\n\r\nPeople’s Dietary Patterns (DPs) are influenced by culture and ethnicity, and their identification requires a holistic assessment of diet. DP reflects dietary behaviors, and its analysis may provide further details about the dietary etiology of chronic diseases. By examining people’s DP and related factors, more practical solutions can be proposed to prevent overweight, obesity, and related diseases. This study aimed to describe DP, Eating Restrictions (ER), Food Involvement (FI), Nutrition Knowledge (NK), and anthropometric indices in Iranian adults and determine the mediating role of FI in the relationship between ER, NK, and DP. A descriptive cross-sectional study was conducted using the structural equation modeling approach. The study was conducted on 2421 adults in Mazandaran Province, northern Iran. The Eating Restrictions Questionnaire (ERQ), the Food Involvement Inventory (FII), the komPAN questionnaire, and a demographic characteristics and anthropometric indices questionnaire were used to collect data. We also measured the seven major food groups, the Diet Quality Scores (DQS), and the six dietary indices, including the pro-Healthy-Diet-Index (pHDI-15), non-Healthy Diet-Index (nHDI-16), high-Glycemic-Diet-Index-7 (hGIDI-7), low-Glycaemic-Diet-Index-4 (lGIDI-4), high-Sugar-Diet-Index-4 (hSDI-4), and high-sugar product (hSFDI-6) and compared their values by gender and four BMI groups. The prevalence of ER and FI was 6.25% and 49.1%, respectively. NK was insufficient for 43.1% of the participants. Most participants (71.2%) had low DQS scores on pHDI-15 and moderate scores (52.9%) on nHDI-16. DQS scores were low in 64.8% of participants in the lGIDI-4 food group, while 71.7%, 92.6%, and 77.2% possessed moderate scores in the hGIDI-7, hSFDI-6, and hSDI-4 food groups, respectively. The mean pHDI-15 and lGIDI-4 indices were higher in women than in men. The amount of unhealthy food indices (nHDI-16, hGIDI-7, hSDI-4, and hSFDI-6) was higher in lean, overweight, and obese people than in people with a normal BMI. The structural model assumed between ER and DP and the mediating role of FI fit well with Iranian adults. Moreover, FI had a mediating role in the relationship between NK and pHDI_15 (Indirect Effects = 0.05, P&lt;0.05) and nHDI_16 (Indirect Effects = -0.07, P&lt;0.01). Most participants are small portions of the healthy food groups and the low glycemic foods, and FI plays a mediating role in the relationship between NK and ER with DP. Therefore, it is necessary to pay attention to the role of FI as a mediating variable in interventions based on reducing ER, increasing NK, and shifting DP from unhealthy to healthy.","author":"Kiyana Saadati","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0ec05de010595c1aff09da7b436fa62d588b47c49bf528ee49b15b6c10e506ba","category":"Interdisciplinary"}