{"title":"The Carbon Footprint of Spanish University Websites","link":"https://www.preprints.org/manuscript/202407.0396/v1","date":1720065465000,"content":"first_pagesettingsOrder Article ReprintsOpen AccessArticleThe Carbon Footprint of Spanish University Websitesby Sonia Sanchez-Cuadrado 1 andJorge Morato 2,*1Department of Library and Information Science, Complutense University of Madrid, 28010 Madrid, Spain2Department of Computer Science, Carlos III University of Madrid, Leganes, 28911 Madrid, Spain*Author to whom correspondence should be addressed.Sustainability 2024, 16(13), 5670; https://doi.org/10.3390/su16135670 (registering DOI)Submission received: 31 May 2024 / Revised: 22 June 2024 / Accepted: 23 June 2024 / Published: 3 July 2024(This article belongs to the Special Issue Sustainable Education in the Digital Society: Applying Communication Technologies and Digital Tools to Education) Downloadkeyboard_arrow_down Browse Figures Versions NotesAbstractThe consumption of digital content is essential for economic and scientific development, leading to a high dependence on information and communication technologies, which significantly impacts the environment. Quantifying this ecological impact is challenging due to its intangible nature and the diversity of factors. This research focuses on assessing the energy consumption and CO2 production of Spanish university websites to evaluate their levels of digital pollution and environmental impact. The calculation of the carbon footprint considers factors related to energy consumption and the use of green or renewable energies. The findings indicate that only 17% of university websites can be considered environmentally friendly. There are significant differences in CO2 consumption and emissions depending on whether the websites implement environmentally sound practices. This study highlights the lack of initiatives aimed at reducing energy consumption and greenhouse gas emissions associated with web information management. The study shows that Spanish universities have the potential to contribute to the reduction in CO2 emissions by implementing sustainable development practices on their websites. Furthermore, it fosters awareness about technology usage and its environmental impact, promoting the adoption of green and sustainable approaches.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0ec1140c678aa82ae47876c7632d9333be237a1e978047e244079f68841e4086","category":"Interdisciplinary"}