{"title":"Graph neural networks are promising for phenotypic virtual screening on cancer cell lines","link":"https://academic.oup.com/biomethods/article/doi/10.1093/biomethods/bpae065/7748407?rss=1","date":1725321600000,"content":"<span><div>Abstract</div>Artificial intelligence is increasingly driving early drug design, offering novel approaches to virtual screening. Phenotypic virtual screening (PVS) aims to predict how cancer cell lines respond to different compounds by focusing on observable characteristics rather than specific molecular targets. Some studies have suggested that deep learning may not be the best approach for PVS. However, these studies are limited by the small number of tested molecules as well as not employing suitable performance metrics and dissimilar-molecules splits better mimicking the challenging chemical diversity of real-world screening libraries. Here we prepared 60 datasets, each containing approximately 30 000–50 000 molecules tested for their growth inhibitory activities on one of the NCI-60 cancer cell lines. We conducted multiple performance evaluations of each of the five machine learning algorithms for PVS on these 60 problem instances. To provide even a more comprehensive evaluation, we used two model validation types: the random split and the dissimilar-molecules split. Overall, about 14 440 training runs aczross datasets were carried out per algorithm. The models were primarily evaluated using hit rate, a more suitable metric in VS contexts. The results show that all models are more challenged by test molecules that are substantially different from those in the training data. In both validation types, the D-MPNN algorithm, a graph-based deep neural network, was found to be the most suitable for building predictive models for this PVS problem.</span>","author":"","siteTitle":"Biology Methods and Protocols Current Issue","siteHash":"69c994dba77628d461517adf354c299799d03c68fbf0494d0a5619d40a95f351","entryHash":"0ec4a162b1a6fb30dbf42e0c124a02c16fe5c46de37ec7d8ca8bf2c5c8dd9e77","category":"Environment"}