{"title":"Do climate change, access to electricity and renewable energy consumption matter in aquaculture production in Africa?","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12427?af=R","date":1708302687000,"content":"<h2>Abstract</h2>\n<p>The contribution of aquaculture to economic development cannot be overemphasized. Several factors affect aquaculture production. However, few studies document the impact of climate change, electricity and other macroeconomic covariates on aquaculture production in Africa. The present research's objective is to examine the impact of rainfall, temperature, access to electricity, per capita national income, renewable energy consumption, employment in agriculture, and carbon emissions on aquaculture production in 32 African countries. We rely on panel data using rigorous estimation techniques involving the fixed effects and method of moment quantile regression approaches. Our fixed effects model result indicates that an increase in temperature reduces aquaculture production, while renewable energy consumption, net per capita income, employment in agriculture, and carbon emissions increase aquaculture production. Similarly, the 75th and 90th quantiles of the method of moment quantile regression results indicated that both rainfall and temperature decrease aquaculture production, while renewable energy consumption, employment in agriculture, and carbon emissions increase aquaculture production. The study provides useful insight into the climate, economic, and technological factors that might increase or decrease aquaculture production in Africa and similar contexts. Overall, our findings are important for improving aquaculture production in Africa, particularly with the current low production relative to the global north. The results have implications on the current and future climate action that calls for increased reliance on renewable energy and targeting improvements in agricultural employment, and net national income. Additional efforts are needed to achieve carbon neutrality while ensuring sustainable aquaculture production in Africa.</p>","author":"Jane Onuabuchi Munonye, \nRobert Ugochukwu Onyeneke, \nDaniel Adu Ankrah, \nFred Fosu Agyarko, \nChinenye Judith Onyeneke, \nJalil Ghassemi Nejad, \nComfort Chikezie","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"0ec5b4dc7d43fc312841035c513c4807f7258fc8f0f0e464b8be599d927911c1","category":"Environment"}