{"title":"Unveiling the positive impact of biofloc culture on Vibrio parahaemolyticus infection of Pacific white shrimp by reducing quorum sensing and virulence gene expression and enhancing immunity","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13932?af=R","date":1708362236000,"content":"<h2>Abstract</h2>\n<p>This study aimed to evaluate and unveil the positive impact of biofloc culture on <i>Vibrio parahaemolyticus</i> infection of Pacific white shrimp by reducing quorum sensing (QS) and virulence gene expression and enhancing shrimp's immunity. The shrimp with an average body weight of 0.50 ± 0.09 g were reared in containers with a volume of 2.5 L, 21 units, and a density of 20 shrimp L<sup>−1</sup>. The shrimp were cultured for 5 days, with each treatment including biofloc system maintenance with a C/N ratio of 10 and a control treatment without biofloc, followed by a challenge test through immersion using <i>V</i>. <i>parahaemolyticus</i> at densities of 10<sup>3</sup>, 10<sup>5</sup>, and 10<sup>7</sup> CFU mL<sup>−1</sup> initially. The results of the in vitro experiment showed that biofloc suspension can inhibit and disperse biofilm formation, as well as reduce the exo-enzyme activity (amylase, protease, and chitinase) of <i>V</i>. <i>parahaemolyticus</i>. Furthermore, the biofloc treatment significantly reduced the expression of the QS regulatory gene OpaR, the PirB toxin gene, and the virulence factor genes T6SS1 and T6SS2 in both in vitro and in vivo. The biofloc system also increased the expression of shrimp immunity-related genes (LGBP, proPO, SP, and PE) and the survival rate of white shrimp challenged with <i>V</i>. <i>parahaemolyticus</i>.</p>","author":"Widanarni Widanarni, \nMuhamad Gustilatov, \nJulie Ekasari, \nPande Gde Sasmita Julyantoro, \nDiana Elizabeth Waturangi, \nSukenda Sukenda","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"0ecaa802b7c85f4588f450611813f797b26633b1666bee47bf504ba39929d536","category":"Environment"}