{"title":"How to Screen Record On the Wahoo BOLT V2","link":"https://www.dcrainmaker.com/2021/07/screen-record-wahoo.html","date":1625676503000,"content":"<p></p>\n<p>Here’s a quick (and totally awesome) tip for Wahoo BOLT V2 users. You can now screen record what you’re Wahoo ELEMNT BOLT V2 is doing, which is useful for approximately two of us: Me and <a href=\"https://www.youtube.com/channel/UCbcwZ8hm18GK6on_S_CgmFA/videos\">GPLAMA</a>. Actually, three if we <a href=\"https://www.youtube.com/channel/UCmVhS0qulkRshtLrXMeMToQ\">include DesFit</a>. Four to five if we include <a href=\"https://www.youtube.com/channel/UC9Kc2_2gZW0YoFOKClYVOlw\">Matt LeGrand</a> and <a href=\"https://www.youtube.com/c/smartbiketrainers\">Tariq</a>, and oh heck – any other YouTuber. Even TrainerRoad, and <a href=\"https://www.youtube.com/watch?v=2HQ7fT4FTz4&amp;list=PLrKJ0zeMQrI5Bj3IUaHX0VPjNthpfFNhD\">their race analysis video series</a>.</p>\n<p>But in reality, this can also be super useful for product support too. If someone is having a really weird bug that’s hard to repro, or even just doing something themselves that’s weird and need to explain it to Wahoo support, there’s often no better way than a video recording. It’s just that this simply takes the complexity of pointing a phone at it.</p>\n<p>In fact, it’s entirely plausible this may have also been hurried along after all the issue I had on <a href=\"https://www.dcrainmaker.com/2021/05/wahoo-elemnt-bolt-v2-2021-with-color-screen-maps-a-review-in-progress.html/\">my BOLT V2 at launch</a>, allowing them to see what I’m seeing. And, since you’re probably curious there, things are definitely better in the last week or so. Today’s ride was the first flawless ride, with no sensor dropouts. So, we’re getting’ there. More later.</p>\n<p>Oh, and it may come to other Wahoo ELEMNT series units, but the BOLT V2 has some additional API’s, so they’re seeing if they can pull it off on other units too. How could would it be to also see it on the <a href=\"https://www.dcrainmaker.com/2020/11/wahoo-rival-multisport-gps-watch-review.html\">Wahoo ELEMNT RIVAL watch</a>?</p>\n<h3><span>Setting it up:</span></h3>\n<p>Getting it configured is silly easy. Though, it takes take a computer. Essentially we’re just creating a folder on the BOLT2, and then it knows to start capturing files. Maybe down the road there will be a secret menu option or something, but for now this is perfect (and somewhat reminiscent of the nifty Varia radar trick allowing you to change the <a href=\"https://www.dcrainmaker.com/2019/08/hands-on-wahoo-adds-radar-support-for-elemnt-bolt-roam-confirms-trainerroad-connectivity.html\">car icons to chickens or whatever</a>).</p>\n<p>In any case, here’s the steps:</p>\n<p>1) Plug your Wahoo BOTL V2 into a computer</p>\n<p>2) Navigate to it on your computer, here’s what it looks like on Windows:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-14.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-14.png\" /></a></p>\n<p>On a Mac, you’ll need to first grab the Android File Transfer app, as like many devices these days, that’s required for your Mac to see it.</p>\n<p>3) Create a folder called <strong>capture</strong> on the BOLT:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-15.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-15.png\" /></a></p>\n<p>4) Now <strong>unplug your BOLT and power it off</strong>, then<strong> turn it back on</strong>.</p>\n<p>5) Go into the BOLT menu, and scroll to the very bottom, and you’ll see<strong> ‘Debug Menu’ to open </strong>(or, if not in a beta group, it sounds like it’ll simply show as an option at the bottom, without opening a Debug menu), then you’ll see <strong>Adv User: Screen Record</strong>, with a toggle for <strong>OFF or ON</strong> (default is OFF). Simply switch it to ON, by choosing the start option:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-16.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-16.png\" /></a></p>\n<p>6) At this point, it’s now recording. It’s as simple as that. The recording rate is about 75MB/hour, so pretty small. My BOLT V2 with full EU/US/Australian maps has 865MB of space remaining, so that’d be 13 hours of recording, or even more if I vote Australia off the island, since it appears I won’t be able to travel there till 2028 or something. Or any other country I don’t plan to travel to.</p>\n<p>You can validate it’s recording (or stopping it) by going back to that menu option, and you’ll see the current recording time, along with the ability to stop it:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-17.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-17.png\" /></a></p>\n<p>7) Finally, to grab the file (after stopping it), you’ll plug it back in your computer and in the capture folder you’ll see the MP4 video file:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-18.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-18.png\" /></a></p>\n<p>The file renders at 230w by 320h, at a whopping 1.95fps. Obviously, that sounds low by 4K/60FPS standards, but realistically it doesn’t matter. You’re not blowing that up to full screen size (or, I’d assume you aren’t anyway).</p>\n<p>In my case, for my videos, I’ll record footage on a GoPro or such, and then overlay them together:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/vlcsnap-2021-07-07-18h05m41s523.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/vlcsnap-2021-07-07-18h05m41s523_thumb.png\" /></a></p>\n<p>Some very quick pro tips on doing that, that apply to both Wahoo &amp; Hammerhead, from someone who has had to piece these videos together:</p>\n<p>1) Don’t shoot a lot of clips. You’re FAR better off shooting really long clips than 12 little one-minute ones. The reason? You have to merge them together, and since the bike computer ones don’t include audio to sync on, you’ll need to do that manually.</p>\n<p>2) To make your life easier there, once your GoPro is recording (and the BOLT recording), audibly count what’s on the screen. So, either on your ride timer (how long you’ve ridden), or, on the screen recording timer (in the settings menu), count out 3-5 seconds worth. The reason? You can use that to match up. the timers.</p>\n<p>3) Next, to get super precise on matching the screen recording with the video, hold up the BOLT in front of the GoPro for a moment, and press some buttons, so that you can get the exact frames matched. This is harder to do when the BOLT is far away from the GoPro, so put it about a book length away.</p>\n<p>4) That’s all the tips I have.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/07/image-19.png\"><img src=\"https://media.dcrainmaker.com/images/2021/07/image_thumb-19.png\" /></a></p>\n<p>Finally, fun, the the background on this is that both <a href=\"https://www.youtube.com/channel/UCbcwZ8hm18GK6on_S_CgmFA/videos\">GPLAMA</a> and myself were talking to one of Wahoo’s original engineers, Murray, back a month or so ago. You may remember him from the <a href=\"https://www.dcrainmaker.com/2020/02/bikes-beer-and-tech-live-podcast-video-from-tdu-posted.html\">Tour Down Under Bikes &amp; Beer panel we did</a>, where he dropped all sorts of neat behind the scenes tidbits. In any event, I was pointing out that one of my favorite features of the Hammerhead Karoo series is the ability to screen-capture/record (due to it just being an Android device). That allows me to make far better videos, and even photos for the review, since I’m not dealing with the glare of camera equipment. And more notably, in the last 2 years here in the Netherlands, it’s illegal to hand-hold a camera/phone while cycling. So I’ve had to create all sorts of creative rigs to overcome that, none of which yield great video results.</p>\n<p>For Murray, the same restriction actually recently came into effect in his area too in Australia, thus, adding more reason to build it in. He put it in some test builds first, and then now it’s in the production builds as an Easter-egg of sorts. Perhaps it’ll grow up to get it’s own menu option some day.</p>\n<p>Speaking of perhaps, perhaps we’ll see other companies add this in too. I casually noticed that in a YouTuber’s sponsored video (by Garmin) the other day, they had created real watch renders of what she had workout-wise on her watch. I don’t now if that was done automatically, or if she gave them a list of workouts after the fact, and they just whipped them up and sent them back. But there’s no way I know of to do that today on any Garmin devices.</p>\n<p>Thus as reviews and content continues to slowly shift towards YouTube (for better or worse), being able to get/show exactly what’s on the screen, especially small screens while working out, is more and more important. And equally, it’s just as useful for support/helpdesk/engineering folks to troubleshoot quirky problems.</p>\n<p>With that – thanks for reading!</p><div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase. These posts generally take a lot of time to put together, so if you're shopping for the Wahoo ELEMNT BOLT V2/2021 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n\r\n\r\n<div><img src=\"https://media.dcrainmaker.com/images/2021/05/Wahoo-BOLT-V2-Transparent-720x720.png\" /><div><h4><a href=\"https://www.dcrainmaker.com/2017/03/wahoo-elemnt-bolt-in-depth-review.html\" target=\"_blank\">Wahoo ELEMNT BOLT V2/2021</a></h4><div><a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2Fwahoo-fitness-wahoo-fitness-elemnt-bolt-computer\"><span>Backcountry</span> <span>$280</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2Fwahoo-fitness-wahoo-fitness-elemnt-bolt-computer\"><span>Competitive Cyclist</span> <span>$280</span></a> <a target=\"_blank\" href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=609955&amp;ued=https%3A%2F%2Fwww.wiggle.co.uk%2Fwahoo-elemnt-bolt-20-gps-cycling-computer\"><span>Wiggle</span> <span>280 €</span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p></div>\n<p></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"0eca5e93d4a7854f651a53aa2c170c22d32a196375edca6ef228198276e48696","category":"Cycling"}