{"title":"Announcing AWS Data Exchange for APIs: Find, Subscribe to, and Use Third-party APIs with Consistent Authentication","link":"https://aws.amazon.com/blogs/aws/data-exchange-for-apis-find-subscribe-use-third-party-apis-consistent-authentication/","date":1638229988000,"content":"<p>Data is at the center of many processes and products, whether it’s a large-scale dataset used to train machine learning models, a relational database, or an API-based integration. <a href=\"https://aws.amazon.com/data-exchange\">AWS Data Exchange</a> lets you discover, subscribe to, and use hundreds of file-based datasets via <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> offered by third parties such as Reuters, Foursquare, Change Healthcare, Vortexa, IMDb, and many more. Additionally, <a href=\"https://aws.amazon.com/redshift/features/aws-data-exchange-for-amazon-redshift/\">AWS Data Exchange for Amazon Redshift</a> makes it even easier to ingest third-party data <a href=\"https://aws.amazon.com/blogs/aws/new-aws-data-exchange-for-amazon-redshift/\">in your Amazon Redshift data warehouse</a>, without any manual processing or transformation.</p> \n<p>However, in many cases your data projects require more than static datasets because you need frequent and synchronous retrieval of small amounts of information – for example, you might need to fetch a stock price every hour. Data APIs let you answer specific questions quickly and without having to build ad-hoc data pipelines to ingest, process, and analyze bulk datasets. But each API provider has its own ease of use, SDK, documentation, and authentication mechanisms, which makes this harder than it needs to be.</p> \n<p>Today, I’m happy to announce the general availability of AWS Data Exchange for APIs, a new capability that lets you find, subscribe to, and use third-party APIs with a consistent access using <a href=\"https://aws.amazon.com/tools/\">AWS SDKs</a>, as well as consistent AWS-native authentication and governance. This simplifies the lives of developers and IT administrators who have to integrate and secure the access to multiple third-party APIs.</p> \n<p>Now you can make RESTful or GraphQL API calls directly to AWS Data Exchange and receive synchronous responses that contain the information you need, using the AWS SDK in the programming language of your choice. We take care of integrating with the API provider, implementing proper authentication, managing the API subscription, and ensuring charges appear on your AWS bill. You can manage API access centrally with <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a>.</p> \n<p>As a data provider, you make your API discoverable by millions of AWS customers by listing it in the AWS Data Exchange catalog using an <a href=\"https://spec.openapis.org/oas/latest.html\">OpenAPI specification</a> and fronting it with an <a href=\"http://aws.amazon.com/apigateway\">Amazon API Gateway</a> endpoint.</p> \n<p><span><strong>AWS Data Exchange for APIs in Action</strong></span><br /> First, I look for an API product in the AWS Data Exchange catalog, review its subscription terms, support information, and auto-renewal. Each API product might include multiple public or private subscription offers and periods.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/22/data-exchange-apis-test-product-1-617x1024.png\" /></p> \n<p>I select <strong>Subscribe</strong> and a couple of minutes later I’m successfully subscribed.</p> \n<p>Within the API product, I select an entitled data set and its latest revision.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/22/data-exchange-api-entitled-datasets-1024x307.png\" /></p> \n<p>Each API revision contains one or more API assets that correspond to a specific API endpoint and a unique Asset ARN.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/30/aws-data-exchange-api-assets-1024x186.png\" /></p> \n<p>AWS Data Exchange takes care of invoking API endpoints with the correct authentication.</p> \n<p>All I need to do is check the <strong>Integration notes</strong>, which include instructions and code snippets based on the <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (CLI)</a>.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/23/data-exchange-api-integration-notes-2-1024x549.png\" /></p> \n<p>Of course, I could implement the very same API call with my favorite programming language using one of the <a href=\"https://aws.amazon.com/tools/\">AWS SDKs</a>.</p> \n<p>For example, here’s how I’d implement a simple wrapper function in Python:</p> \n<pre><code>import json\nimport urllib\nimport boto3\n\nadx = boto3.client('dataexchange')\n\ndef get_api_response(path, method=\"GET\", querystring={}, headers={}, body={}):\n    return adx.send_api_asset(\n        DataSetId=\"4b3fbabc31171662851531b8576a3411\",\n        RevisionId=\"e8e78e921af12c76499edc40f92e3082\",\n        AssetId=\"557d858c317efdfb5b6c9a2860ec4a03\",\n        Method=method,\n        Path=path,\n        QueryStringParameters=urllib.urlencode(querystring),\n        RequestHeaders=urllib.urlencode(headers),\n        Body=json.dumps(body),\n    )</code></pre> \n<p>Please note that there are no hard-coded credentials in the code above because all the authorization happens via <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a>.</p> \n<p>And that’s how you make your first API call via AWS Data Exchange for APIs.</p> \n<p><strong><span>Available Today</span></strong><br /> AWS Data Exchange for APIs is generally available in all AWS Regions where AWS Data Exchange is available. We’re looking forward to helping you simplify and centralize the management and governance of third-party APIs while we take care of the undifferentiated heavy lifting for you.</p> \n<p>Today you can start integrating third-party APIs such as Infutor, Variety Business Intelligence, IMDb, PeopleDataLabs, Neustar, Experian, Foursquare, PredictHQ, WeatherTrends International, and many more.</p> \n<p>If you’re a developer, <a href=\"https://docs.aws.amazon.com/data-exchange/latest/userguide/what-is.html\">check out the new AWS Data Exchange for APIs documentation</a> to learn more about subscribing and using APIs. If you’re an API provider, <a href=\"https://docs.aws.amazon.com/data-exchange/latest/userguide/publishing-products.html#publish-API-product\">check out the new publishing documentation</a> to learn more about publishing new APIs on the AWS Data Exchange catalog.</p> \n<p>— <a href=\"https://twitter.com/alex_casalboni\">Alex</a></p>","author":"Alex Casalboni","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"0ecfd7ae7757ddfb31d175d05a226477f745048b7569e35f6245f110c782c33d","category":"Tech"}