{"title":"Diagnostic Tools for the Assessment of the Mammalian Mammary Gland: Challenges and Future Directions for Cetacean Medicine","link":"https://www.preprints.org/manuscript/202406.0915/v1","date":1718269034000,"content":"One characteristic of mammalian species is their capacity to produce and secrete milk from their mammary glands to feed and provide vital nutrients for the growth of their offspring. Even though mammary glands provide the same function in different species, their development, shape, and structure can vary according to their reproductive and ecological adaptations. Reproduction studies are important for cetacean conservation because they provide essential information to assess the dynamics of populations and species, particularly in relation to the management of animals under human care. A vast majority of literature on the female cetacean reproductive anatomy and physiology has focused on the ovaries, which can be used to infer life history characteristics, or genital diseases and anomalies. However, literature regarding the morphology, physiology, and developmental pattern of their mammary glands is scarce, with few anatomical and histological descriptions in species such as baleen whales; and more recently it has been assessed with the use of ultrasound in finless porpoises (Neophocaena asiaeorientalis). The aim of this review is to describe the current diagnostic tools applied in human and veterinary medicine to assess the mammary glands and how marine mammal medicine could benefit from these tools to evaluate the mammary glands in free-ranging and captive cetaceans. With the use of imaging techniques such as B-mode ultrasound, non-invasive studies could be performed to assess the mammary tissues, as what has been done to characterize the morphology of other organs in cetaceans, such as the reproductive tract of Indo-Pacific bottlenose dolphins under human care. By understanding and revising the current diagnostic tools to assess the mammary gland of humans and domestic animals, such as ultrasonography, it might be possible to determine which techniques could be applied by marine mammal veterinarians to enhance the evaluation of the cetacean mammary gland morphology and physiology.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0ed3625a1c916e9a4d506854e6df240a8ac0ea79edbd907de037531eab5bd948","category":"Interdisciplinary"}