{"title":"Sevoflurane augments neuroinflammation by regulating DUSP6 via YTHDF1 in postoperative cognitive dysfunction","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae100/7705550?rss=1","date":1719964800000,"content":"<span><div>Abstract</div><div>Background</div>Postoperative cognitive dysfunction (POCD) is a generally recognized complication experienced by patients who receive anesthesia during surgery. Sevoflurane, the most commonly used inhaled anesthetic, has been shown to trigger neuroinflammation that promotes to POCD.<div>Objective</div>This study examined the pathological mechanism by which sevoflurane causes neuroinflammation, participating in POCD.<div>Methods</div>To establish a neurocyte injury model, the human neuroblastoma cell lines SH-SY5Y and SK-N-SH were treated with sevoflurane. Cell viability was determined using 3-(4,5-dimethyl-2-thiazolyl)-2,5-diphenyl-2-H-tetrazolium bromide (MTT) assays. The reactive oxygen species (ROS) level was evaluated by DCFH-DA assays. A lactate dehydrogenase (LDH) Cytotoxicity Assay Kit was used to measure LDH levels. Inflammatory cytokine levels were measured using enzyme-linked immunosorbent assay assays. Gene expression densities and protein abundance were evaluated using quantitative real-time polymerase chain reaction (qRT-PCR) or western blotting. The interaction between YTHDF1 and dual specific phosphatase 6 (DUSP6) was validated using RNA immunoprecipitation (RIP)-qPCR and methylated RIP (MeRIP)-qPCR assays. Flow cytometry was performed to determine apoptosis.<div>Results</div>Sevoflurane promoted apoptosis, oxidative stress, and neuroinflammation and repressed the expression levels of YTHDF1 and DUSP6. Furthermore, YTHDF1 overexpression reversed sevoflurane-induced neuroinflammation in neurocytes. DUSP6 overexpression could alleviate the neuroinflammation induced by sevoflurane via regulating the extracellular signal-regulated kinase (ERK)1/2 signaling pathway. Moreover, YTHDF1 enhanced DUSP6 expression.<div>Conclusion</div>Sevoflurane-stimulated neuroinflammation by regulating DUSP6 via YTHDF1. Sevoflurane promoted neuroinflammation by regulating DUSP6 via YTHDF1 in an in vitro model of POCD.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"0eddfbc60c7dfd347cc4ed79fffd484487c646fe101d9183d1921bf69fccab74","category":"Environment"}