{"title":"Plant trait dissimilarity increases competitive interactions among co‐occurring plants","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14561?af=R","date":1712924022000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/5dea2037-67e8-419c-ae54-4a8911df23db/fec14561-toc-0001-m.png\" alt=\"Plant trait dissimilarity increases competitive interactions among co-occurring plants\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/04/05/plant-trait-dissimilarity-increases-competition/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPlant–plant interactions, often studied in the context of plant traits, are considered crucial assembly mechanisms for plant communities and offer insights into how neighbours affect growth. Three key questions regarding these interactions have theoretical importance but limited empirical support: (1) does similarity in plant traits enhance competitive interactions among species, (2) is the “competitive environment” determined through plant traits of the resident species, and (3) do greater species diversity and niche use result in increased competition among co-occurring species. Here we use a simple experimental design to directly test these foundational questions.\n\nIn a mesocosm experiment using native grassland fragments, we investigated our questions simultaneously by manipulating trait relationships among resident and colonizing plants. To assess the net impact of neighbours on plant growth, we measured the degree of suppression experienced by focal plants compared to growth in the absence of neighbours. We further tested whether trait-function relationships are context-dependent by modifying available resources.\n\nContrary to the limiting similarity hypothesis, we found that reduced overall dissimilarity mitigated neighbour-induced growth suppression, with more negative effects occurring among dissimilar neighbours. The influence of trait dissimilarity depended on nutrient context and was stronger under increased resource availability. We found little support for the idea that specific plant traits are “functional” in creating competitive environments: no community traits (community weighted means) were associated with net neighbour effects. In contrast, resource supply significantly affected species interactions, with increased resources exacerbating negative neighbour effects on plant growth.\n\nWe found that plant trait dissimilarity does function in competition but is contingent on resource context. However, trait values were not inherently competitive: traits may have physiological functions but did not function in focal plants' competitive response. We provide some of the limited data directly testing the core mechanisms of community assembly. We encourage such direct experimental tests as they are essential to building an understanding of ecological processes.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/04/05/plant-trait-dissimilarity-increases-competition/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Emily M. Holden, \nJames F. Cahill Jr","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"0ee52d04ee88a598f5ad68a13871c5e0a7c16f4509ada84a25ceeb4403aad006","category":"Environment"}