{"title":"Alexandera Houchin’s Ultra Racing Hacks – Alexandera Houchin","link":"https://theradavist.com/alexandera-houchins-ultra-racing-hacks/","date":1709725013000,"content":"<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks13.jpeg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks13.jpeg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks13.jpeg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks13.jpeg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks13.jpeg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>If you follow ultra racing, then you have most likely heard of <a href=\"https://www.instagram.com/alexanderahouchin/?hl=en\" target=\"_blank\">Alexandera Houchin</a>. Today we’re sharing a few hacks she’s tried over the year, from her beginning roots bike touring all the way through bikepacking races. Read on for a bit of self-deprecating humble pie and innovation, rolled in one!<span></span></p>\n<p><img loading=\"lazy\" width=\"2560\" height=\"1707\" src=\"https://media.theradavist.com/uploads/2022/02/Alexandera-Houchin-11-scaled.jpg?fit=1200,1707&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2022/02/Alexandera-Houchin-11-scaled.jpg?w=2560&amp;quality=75 2560w, https://media.theradavist.com/uploads/2022/02/Alexandera-Houchin-11-scaled.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2022/02/Alexandera-Houchin-11-scaled.jpg?resize=2000,1333&amp;quality=75 2000w, https://media.theradavist.com/uploads/2022/02/Alexandera-Houchin-11-scaled.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2022/02/Alexandera-Houchin-11-scaled.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2022/02/Alexandera-Houchin-11-scaled.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2022/02/Alexandera-Houchin-11-scaled.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2022/02/Alexandera-Houchin-11-scaled.jpg?resize=1536,1024&amp;quality=75 1536w, https://media.theradavist.com/uploads/2022/02/Alexandera-Houchin-11-scaled.jpg?resize=2048,1365&amp;quality=75 2048w\" /></p>\n<h3>I Thought it Would Make Me Faster; It just Ended up Being a Bad Idea</h3>\n<p>A Few Things I<span>’</span>ve Tried to Try to Win an Ultra Race</p>\n<p>Ultra-racing found me. There was not one bone in my body that would have predicted I<span>’</span>d become a bike racer. I mean, I had never been genuinely competitive with anything in my entire life. I<span>’</span>d wanted to fight for <i>something</i> but had felt useless my whole adolescence. I<span>’</span>d hoped that I would win, could win. But I never <i>believed</i> I could. To be clear, those hopes of winning applied to intellectual victories, essay contests, art shows, and the like. I had considered, for a slight moment, when I was a young girl, that maybe someday I could be a gymnast and perhaps even compete in the Olympics. That idea was squashed very early on when my grandmother told me I was too tall and too big to even consider it. From then on, I have no memory of ever thinking I could be an athlete.</p>\n<p>My self-confidence was growing by the time I entered my first bikepacking race. It wasn’t that I considered “winning” a possibility, but the confidence in my ability to complete the route was where the growth occurred. I’d spent a few summers touring around the Great Lakes states and a little bit in the western United States but was growing lonely as my friends aged out of playing bikes. Riding bikes on missions I drafted up alone and grew empty. <i>Misery loves company</i>.</p>\n<p><img loading=\"lazy\" width=\"890\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2019/06/DSC_3791.jpg?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2019/06/DSC_3791.jpg?w=890&amp;quality=75 890w, https://media.theradavist.com/uploads/2019/06/DSC_3791.jpg?resize=768,1150&amp;quality=75 768w, https://media.theradavist.com/uploads/2019/06/DSC_3791.jpg?resize=700,1048&amp;quality=75 700w\" /><img loading=\"lazy\" width=\"890\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2019/06/DSC_4337.jpg?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2019/06/DSC_4337.jpg?w=890&amp;quality=75 890w, https://media.theradavist.com/uploads/2019/06/DSC_4337.jpg?resize=768,1150&amp;quality=75 768w, https://media.theradavist.com/uploads/2019/06/DSC_4337.jpg?resize=700,1048&amp;quality=75 700w\" /></p>\n<p>I<span>’</span>d heard of these long-distance bike pack <span>“</span>races”. They were <span>“</span>free”; anyone could show up, and I was sure to be on my bicycle for a few days, at least. Most of all, I yearned to be surrounded by people who valued the growth that comes from self-supported bike travel. I wanted to ride through the wind and the rain but also commiserate about the storm we weathered. I wanted to learn from people who had been riding bikes longer than I had. I wanted to grow as a person. The only competition in my mind during that first Smoke-n-Fire was me versus me. I wanted to try as hard as I could.</p>\n<p>I believe that to be competitive is to have, or build, self-confidence. Deep down, we must hold on to the inner voice that tells us, <span>“</span>We can.” Without confidence, that voice gets pushed deep down into the pits of our being. As I began signing up for races, my confidence in my athletic ability waned. My confidence in my resilience grew.</p>\n<p>The amazing thing about ultra-racing bikes is that one’s result depends not solely on one’s fitness but on one’s resourcefulness and ability to endure. Ultimately, it<span>’</span>s the brain that gets her to the finish line. And for what I lacked in fitness, I made up for with hacks I thought would save me time or energy expenditure. Looking back now, I<span>’</span>ve made a million rookie mistakes. And as I grow older, I reflect on the innocence behind the <span>“</span>this is definitely going to deliver my win” hacks.</p>\n<p>Of all the things I sought to get out of bikepack racing, community prevails. I used to want to win the race for glory and validation, to prove something to the greater world, or to simply prove something to myself. (You know, and to break the hearts of my super strong bike brothers.)</p>\n<p><img loading=\"lazy\" width=\"1618\" height=\"1080\" src=\"https://media.theradavist.com/uploads/2019/07/radavist-post-5-108.jpg?fit=1200,1080&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2019/07/radavist-post-5-108.jpg?w=1618&amp;quality=75 1618w, https://media.theradavist.com/uploads/2019/07/radavist-post-5-108.jpg?resize=1024,684&amp;quality=75 1024w, https://media.theradavist.com/uploads/2019/07/radavist-post-5-108.jpg?resize=768,513&amp;quality=75 768w, https://media.theradavist.com/uploads/2019/07/radavist-post-5-108.jpg?resize=1335,891&amp;quality=75 1335w, https://media.theradavist.com/uploads/2019/07/radavist-post-5-108.jpg?resize=700,467&amp;quality=75 700w\" /></p>\n<p>Winning, as the outcome, matters less and less to me, especially after the experience I had racing the women in this year<span>’</span>s Triple Crown Challenge. I loved seeing the media about Katya and her accomplishments. I was stoked to see Hannah getting podcast time. I was cheering when John noted that Katie wrapped up her career triple crown. I feel like these strong women are showing the world something, and the narrative is changing from just one or two solid bike racer ladies out there, but a freaking bunch of us. Having bikepacking land believe in me brought so much to my life; I genuinely want that for other girls, BIPOC folk and women. I authentically mean every word of this; winning would mean nothing to me if I didn<span>’</span>t have people to hug after the whole ordeal, to share tips and tricks with, to pass on the culture, if you will.</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2020/06/RugileKaladyte_2019TourDivide_TheRadavist_028.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2020/06/RugileKaladyte_2019TourDivide_TheRadavist_028.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2020/06/RugileKaladyte_2019TourDivide_TheRadavist_028.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2020/06/RugileKaladyte_2019TourDivide_TheRadavist_028.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2020/06/RugileKaladyte_2019TourDivide_TheRadavist_028.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2020/06/RugileKaladyte_2019TourDivide_TheRadavist_028.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2020/06/RugileKaladyte_2019TourDivide_TheRadavist_028.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2020/06/RugileKaladyte_2019TourDivide_TheRadavist_028.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>However, I am a still a competitive asshole. My effort in the pursuit of the win holds more value than ever. I love racing my friends, my community. I start each race envisioning that I could be the fastest, but as an invitation instead of a battle. I try to be the fastest singlespeed, the fastest woman, and the fastest overall and in that order. With that, I perhaps, try <i>harder </i>than I ever had in order to pursue the win<i>.</i> I train and race to relate to my competitors. I train to dare them to beat me to the finish line, giving everything I have to meet them at that place. The journey— not the outcome. So, in the spirit of sportsmanship, I share with you the dumb things I<span>’</span>ve tried to save time in the ultra race—so you don<span>’</span>t have to.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks6.jpg?fit=1200,1500&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks6.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks6.jpg?resize=1200,900&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks6.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks6.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<h3>The Time I Filled My Frame Bag Entirely with Cliff Bars and Lara Bars</h3>\n<p>Bars are fantastic, dense, high-calorie fuel. But I also can<span>’</span>t stomach another one of those damn things.</p>\n<p>The first time I raced in the Colorado Trail Race, I brought a jar of peanut butter and a bunch of Clif bars to power me to the finish line. By the time I made it to the third day of the race, I was squatting behind a tree for 45 minutes (or maybe two hours), trying to force a poop out of me. I was concerned for my life. Ready to quit, my stomach cramped in turmoil. I knew I needed to eat, but the altitude and dehydration compounded to plug my guts up. After I managed to blast that turd out, I turned to see how big it surely was. To my surprise (and heartbreak), it was only the size of a quarter and looked precisely like the Clif bar I was eating (yes, eating while you poop does save time.)</p>\n<p>I decided that I needed to eat all the blueberry Lara Bars I<span>’</span>d packed to get some fiber working in my favor. Every time I tried to eat a Clif bar for the duration of the race, I envisioned my little tiny crap wrapped in a foil wrapper and gagged. I ended up giving away my Clif Bars to hikers along the route— which almost felt like a crime because they were practically constipation cookies. Now, I will bring a Clif bar or two with me during races to be used only in life-or-death situations— like when I need a brick to throw at a grizzly bear threatening my life.</p>\n<p><img loading=\"lazy\" width=\"2316\" height=\"3088\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks15.jpg?fit=1200,3088&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks15.jpg?w=2316&amp;quality=75 2316w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks15.jpg?resize=1200,1600&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks15.jpg?resize=2000,2667&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks15.jpg?resize=768,1024&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks15.jpg?resize=1152,1536&amp;quality=75 1152w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks15.jpg?resize=1536,2048&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2448\" height=\"3060\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks5.jpg?fit=1200,3060&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks5.jpg?w=2448&amp;quality=75 2448w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks5.jpg?resize=1200,1500&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks5.jpg?resize=2000,2500&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks5.jpg?resize=768,960&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks5.jpg?resize=1229,1536&amp;quality=75 1229w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks5.jpg?resize=1638,2048&amp;quality=75 1638w\" /></p>\n<h3>The Time I Brought Six Maxi-Pads to Save Time (and Not Smell Like Crotch) and Other Vagina Person <span>“</span>Hacks”</h3>\n<p>They are not as good as toilet paper, a chamois, or good for managing your period on the bike.</p>\n<p>To bring or not to bring. That is the question. Or at least that was the question I asked myself when packing socks and underwear. I<span>’</span>m aware that underwear weigh almost nothing. My logic was, however, that less stuff to rummage through would lead to less stopped time and, therefore, a faster race. Genius. So, I nixed my second pair of undies with a perfect solution: I would bring six maxi-pads to change out of my panties each day.</p>\n<p>When it came to bike touring, I would bring a wipe to get the drips off my crotch when I peed. Or I would use baby wipes and could spend all the time in the world digging for my baby wipes, pulling one out, wiping my bits all spic-and-span. Then, I would tuck the used wipe into my garbage and bask at the view. But racing— who has time to wipe after EACH urination stop? I already have to completely get off my bike and dip into the trees so passing riders wouldn<span>’</span>t see my whole ass. Men in these races seem to have no problem just pulling to the side of the trail, bike in hand, to pee and drip dry.</p>\n<p>So, I figured I should give that a go. I started standing trailside, ass out for the world to see, and I<span>’</span>d drip, drip, drip until I pulled up my pants and hit the trail again. Except, vaginas are super, uh, <i>messy</i>. And <b>one</b> day of drip-drying led me to smell like a one-woman fish factory. This is where the maxi-pad came in. I<span>’</span>d drip dry, and the maxi-pad would soak up all the drips, keeping my undies clean! At the end of the day, I would tuck the used pee rag (maxi-pad) into my garbage.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks18.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks18.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks18.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks18.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks18.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>The only thing the maxi-pad did was mess my whole undercarriage up. My bits from front to back chaffed. I was pulling tiny bits of exploded maxi-pad from all the sweaty creases down there. The glue ripped out unsuspecting pubic hair. Even if I needed the maxi-pad (which I do if I want to prevent my period blood from spilling all over the one pair of shorts I have for up to a couple weeks of racing), riding bikes with one is brutal.</p>\n<p>I<span>’</span>ve also tried to prevent the underwear <i>mess</i> situation by wearing my Diva cup when I <b>didn</b><span>’</span><b>t </b>have my period to keep all my mystery fluids from soiling my undies. That didn<span>’</span>t work and I ended up racing with a roaring yeast infection. There was another race where my period thought a visit was due, and I shoved a dirty sock in my panties. Or that other time, I just let the blood flow all over my shorts; it just hardened and stuck to my butt, giving me saddle sores that were out of this world. There are really, no shortcuts I want to take around vagina detail. I bring baby wipes, extra undies, and a Diva cup every single time I race now. I get off my bike, squat by a tree, and appreciate the break. There<span>’</span>s nothing like the confidence of a clean vagina brings…</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks16.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks16.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks16.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks16.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks16.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>The Time I Cut Off the Lower Half of My Rain Pants</h3>\n<p>We all know how many grams rain pants have from the knee to the ankle.</p>\n<p>It<span>’</span>s a lot. Obviously, I should cut them at my knee. Plus, come on, when was the last time my calves were cold? For the 2021 Colorado Trail Race, I chopped my bulky, uncomfortable rain pants just above my knee. For those of you who raced that year— day one of the race was practically a kayak trip. Late afternoon storms blasted the race field and when it came time for me to put my rain <i>shorts</i> on, I realized I<span>’</span>d made a horrible mistake. Being at 12,000 feet when thunder grumbled in the sky and waters turned the single-track riding into surfing made me long for the lower half of my rain pants. It turns out that if you need rain pants, you <b><i>need </i></b>rain pants. They don<span>’</span>t keep you dry. Nothing out there will keep you dry when it<span>’</span>s raining. Things get saturated, and people sweat. <b>Rain gear keeps you warm. </b>And I was frozen up there on Rolling Pass. I was so cold that I couldn<span>’</span>t keep pedaling into the night and had to stop to set up camp and get into my sleeping bag. Saving grams did not make me faster, it made me softer.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks8.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks8.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks8.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks8.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks8.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>The Time(s) I Didn<span>’</span>t Bring a Proper Sleep Kit (or Warm Enough Clothes)</h3>\n<p>Bring a freaking sleeping bag, a shelter, and enough clothes get you to the finish line.</p>\n<p>On a spring ITT attempt of the Arizona Trail 300, I went sans sleep kit and brought no pants—just leg warmers and a wind jacket to keep me warm at night. And when the rain came at me whilst pedaling through the Tiger Mine segment, it didn<span>’</span>t occur to me that I<span>’</span>d be greeted by a snowstorm in a few hours.</p>\n<p>I dressed in my usual desert race kit— booty shorts and earrings. Having raced the Arizona Trail 300 several times in the spring, I was sure I could ride the entire thing without real sleep. Especially because I already had— I<span>’</span>d gone sub three days on a singlespeed effort in 2021. I had not considered that the AZT 300 route that we were racing included all of the trail on Lemmon, the new sections near El Pilar and the monster hike-a-bike up from Oracle State Park (I race my spring efforts southbound.) As the rain continued to pour from the sky, I had no sleep kit and needed a break. But could not take one as it was freezing and spitting rain. There was not a single tree to hide beneath. By the time I made it to the rocky-road-hike-a-bike headed up Oracle Ridge, the water was turning to snow.</p>\n<p>I was absolutely toast, and had I not spent so much time on this course, I would have turned around. But I knew there was a heated bathroom in Summerhaven and I told myself I could not stop moving until I made it there. As I dragged my feet through six inches of snow, I thought about how stupid it was that I didn<span>’</span>t bring the one-pound sleep kit I ditched in the name of going fast. Anyway, although I felt sexy and wanted to be really fast, I quit at Hope Camp and pity-partied my way home. I think we have a responsibility as adventure racers to be prepared for anything and to anticipate reaching the finish line; I think it<span>’</span>s irresponsible to race routes that take more than two days to complete without any sleep setup. To be fair— it took me almost eight years to come to this conclusion, so take that as you will.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks19.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks19.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks19.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks19.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks19.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>The Time(s) I’ve Raced Against Geared Bikes on a Singlespeed</h3>\n<p>And then got bummed when I didn<span>’</span>t win.</p>\n<p>What kind of purist asshole egomaniac chooses to nix the gears and try to flex on their competitors, choosing one single gear ratio for multi-day efforts? Me. That<span>’</span>s me. Entirely. <span>“</span>Look what I can do with less than you…” I am so playfully competitive.</p>\n<p>The first reason I got into bikes with one gear was solely a financial decision. I had no idea how <i>cool</i> it would make me. Kidding. It didn<span>’</span>t make me cool, but it earned me respect. There were three years in a row that I won the women<span>’</span>s Colorado Trail Race outright, on my singlespeed racing the most badass ladies out there. I<span>’</span>d had some other strong race finishes out there despite the <span>“</span>handicap” of the singlespeed. But come 2023, a handful of other women legit trained their guts out and raced super hard and I didn<span>’</span>t win a single women<span>’</span>s race all year! I kept asking myself; do you think you<span>’</span>d be faster if you ran gears. I resented myself for not <i>really</i> laying it all out there. I resented myself for not feeling like I could defend my title. A profound question lingered in my bones; was I just not racing gears because, if I lost, I<span>’</span>d have no excuse? Oh, and I thought, and thought, and thought about that!</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2021/10/Alexandera-Houchin-and-Her-Chumba-Stella-Ti-Hardtail-3.jpg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2021/10/Alexandera-Houchin-and-Her-Chumba-Stella-Ti-Hardtail-3.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2021/10/Alexandera-Houchin-and-Her-Chumba-Stella-Ti-Hardtail-3.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2021/10/Alexandera-Houchin-and-Her-Chumba-Stella-Ti-Hardtail-3.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2021/10/Alexandera-Houchin-and-Her-Chumba-Stella-Ti-Hardtail-3.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2021/10/Alexandera-Houchin-and-Her-Chumba-Stella-Ti-Hardtail-3.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2021/10/Alexandera-Houchin-and-Her-Chumba-Stella-Ti-Hardtail-3.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2021/10/Alexandera-Houchin-and-Her-Chumba-Stella-Ti-Hardtail-3.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>The answer <i>finally</i> came to me: no. Truly. My <i>why</i> behind the singlespeed is complex and beautiful and worthy of a novella on it’s own. I<span>’</span>ve been dreaming of a singlespeed Triple Crown Challenge effort since pedaling my first Tour Divide. My why behind the singlespeed goes back, like way, way back to my youth.</p>\n<p>Bike racing is extremely important to me, and most of the writing that comes after efforts is heavy because it<span>’</span>s a heavy experience, often a spiritual quest. But, despite being bummed when I <span>“</span>lose” to a geared racers, I wouldn<span>’</span>t actually ever change my decision to race singlespeed. And I will continue racing singlespeed whenever I want. Because I <b>enjoy</b> it. And the commitment. And the humility. And the hope that comes with it. I think singlespeeding is the ultimate bike racing hack because all the single speeders I<span>’</span>ve ever met are among the most incredible humans on this planet. And that<span>’</span>s a family I want to be a part of. So, of all the hacks that went wrong, sticking with the single cog has been the hack I tried that I can recommend.</p>\n<p><img loading=\"lazy\" width=\"2316\" height=\"3088\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks25.jpg?fit=1200,3088&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks25.jpg?w=2316&amp;quality=75 2316w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks25.jpg?resize=1200,1600&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks25.jpg?resize=2000,2667&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks25.jpg?resize=768,1024&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks25.jpg?resize=1152,1536&amp;quality=75 1152w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks25.jpg?resize=1536,2048&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks14.jpeg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks14.jpeg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks14.jpeg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks14.jpeg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks14.jpeg?resize=1536,1024&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"1737\" height=\"2172\" src=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks7.jpg?fit=1200,2172&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks7.jpg?w=1737&amp;quality=75 1737w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks7.jpg?resize=1200,1501&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks7.jpg?resize=768,960&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks7.jpg?resize=1228,1536&amp;quality=75 1228w, https://media.theradavist.com/uploads/2024/02/Alexandera_Houchin-hacks7.jpg?resize=1638,2048&amp;quality=75 1638w\" /></p>\n<h3>I Love Ultra-Racing With All My Guts</h3>\n<p>I close out this <span>“</span>hacks” list with reflection. Thinking about all this brings me so much joy. Getting older is wild. I am filled with more and more gratitude each day. I can<span>’</span>t escape messages from my body (not as <i>rubbery</i> as I used to be), my grey hairs are POPPIN<span>’</span>, and the next generation of racers are gettin<span>’ </span>it. Bikepack ultra racing has so few rules, and that really leaves space for us to come to conclusions in our own time. Don<span>’</span>t cheat; do it self-supported, and if it feels wrong, it probably is. Or at least that<span>’</span>s the ethos I vibe out there. (Duh, each race has its own rules, so know them when you sign up.)</p>\n<p>We get to try stupid ideas out, get humbled by our actions, and find our people along the journey. A million things go <span>“</span>wrong” in each race, but that<span>’</span>s where the growth happens because that<span>’</span>s how real life is. Life is hard. These races are hard. There are loads of things that seem like <span>“</span>good ideas” until they<span>’</span>re put into practice. So, I share a little of my trip with you, so maybe you don<span>’</span>t have to race with a roaring yeast infection. But also, I half expect all of you to come to me at some point to tell me you, too, tried wearing a maxi-pad instead of packing an extra pair of underwear. Because the best way to learn is the hard way. There is no correct answer…</p>\n<p>Except for the answer to the question: should I eat a Clif Bar or my left arm?</p>\n<p>Definitely, my left arm.</p>\n<p>The post <a href=\"https://theradavist.com/alexandera-houchins-ultra-racing-hacks/\">Alexandera Houchin’s Ultra Racing Hacks</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"John Watson","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"0eebf2edd246aa03cb4613b6ee2cae74f6f44eb769d1b145e560487912e6bc11","category":"Cycling"}