{"title":"Report: Pegasus Spyware Sold to Governments Uses Zero-Click iMessage Exploit to Infect iPhones Running iOS 14.6","link":"https://www.macrumors.com/2021/07/19/pegasus-spyware-imessage-targets-activists/","date":1626680106000,"content":"Journalists, lawyers, and human rights activists around the world have been targeted by authoritarian governments using phone malware made by Israeli surveillance firm NSO Group, according to multiple media reports.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2019/07/nso-israeli-surveillance-firm.jpg\" />\r\n<br />\r\nAn investigation by 17 media organizations and Amnesty International's Security Lab uncovered a <a href=\"https://www.amnesty.org/en/latest/research/2021/07/forensic-methodology-report-how-to-catch-nso-groups-pegasus/\">massive data leak</a>, indicating widespread and continuing abuse of the commercial hacking spyware, Pegasus, which can infect iPhones and Android devices and enable attackers to extract messages, emails, and media, and record calls and secretly activate microphones. \r\n<br />\r\n\r\n<br />\r\nThe leak contains a list of over 50,000 phone numbers that are believed to have been identified by clients of NSO as possible people of interest. Forbidden Stories, a Paris-based nonprofit media organization, and Amnesty International had access to the leaked list and shared that access with media partners as part of reporting consortium the Pegasus project. Forensic tests on some of the phones with numbers on the list indicated that more than half had traces of the spyware.\r\n<br />\r\n\r\n<br />\r\nThe company behind the software, NSO, denies any wrongdoing and claims its product is strictly for use against criminals and terrorists, and is made available only to military, law enforcement and intelligence agencies.\r\n<br />\r\n\r\n<br />\r\nIn a <a href=\"https://www.theguardian.com/news/2021/jul/18/response-from-nso-and-governments\">statement</a> given to media organizations in response to the Pegasus project, NSO said the original investigation which led to the reports was \"full of wrong assumptions and uncorroborated theories.\"\r\n<br />\r\n<blockquote>NSO does not operate the systems that it sells to vetted government customers, and does not have access to the data of its customers' targets. NSO does not operate its technology, does not collect, nor possesses, nor has any access to any kind of data of its customers. Due to contractual and national security considerations, NSO cannot confirm or deny the identity of our government customers, as well as identity of customers of which we have shut down systems.</blockquote>In an earlier version of the spyware, surveillance activity depended on the phone user clicking on a malicious link sent to them in a text or email (so-called \"spear-phishing\"). However, the most recently discovered version doesn't require interaction from the user and can instead exploit \"zero-click\" vulnerabilities – bugs or flaws in the OS – to succeed. \r\n<br />\r\n\r\n<br />\r\nFor example, Amnesty's Security Lab and Citizen Lab found an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> running iOS 14.6 could be hacked with a zero-click iMessage exploit to install Pegasus. Apple has been contacted for comment and we'll update this article if we hear anything.\r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>It also indicates that Apple has a MAJOR blinking red five-alarm-fire problem with iMessage security that their BlastDoor Framework (introduced in <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a> to make zero-click exploitation more difficult) ain't solving.</p>— Bill Marczak (@billmarczak) <a href=\"https://twitter.com/billmarczak/status/1416801637104902146?ref_src=twsrc%5Etfw\">July 18, 2021</a></blockquote> </div>\r\n<br />\r\nMeanwhile, media organizations involved in the project plan to reveal the identities of people whose number appeared on the list in the coming days. They are said to include hundreds of business executives, religious figures, academics, NGO employees, union officials and government officials. Disclosures which began on Sunday have already revealed that the numbers of more than 180 journalists are already known to be among the data.\r\n<br />\r\n\r\n<br />\r\nWhatsApp sued NSO in 2019 after it alleged the company was behind cyber-attacks on thousands of mobile phones involving Pegasus. NSO denied any criminal wrongdoing, but the company has been banned from using WhatsApp.<div>Tag: <a href=\"https://www.macrumors.com/guide/security/\">security</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/19/pegasus-spyware-imessage-targets-activists/\">Report: Pegasus Spyware Sold to Governments Uses Zero-Click iMessage Exploit to Infect iPhones Running iOS 14.6</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/report-pegasus-spyware-sold-to-governments-uses-zero-click-imessage-exploit-to-infect-iphones-running-ios-14-6.2304716/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Hsex3ieNcZA:0ky5CUU5sOg:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Hsex3ieNcZA:0ky5CUU5sOg:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/Hsex3ieNcZA\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0eedbf5480f31da931a8dc417b6f109758bdcbf89f5d5f157a07b8977f5eae7c","category":"Apple"}