{"title":"Prevalence and risk factors of depression, anxiety, and stress among the Bangladeshi construction workers: A cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307895","date":1724076000000,"content":"<p>by Nitai Roy, Kallol Deb Paul, Sumaiya Sultana Tamanna, Anup Kumar Paul, Moneerah Mohammad Almerab, Mohammed A. Mamun</p>\r\nBackground <p>Construction workers are a population that is at risk for mental illnesses such as depression, anxiety, and even suicide due to the high stress and physical demands of their work. This study aimed to determine the prevalence and risk factors for depression, anxiety, and stress among Bangladeshi construction workers.</p> Methods <p>From February 2022 to June 2022, community-based cross-sectional research was conducted among construction workers. Survey data was gathered using interviewer administered questionnaires with 502 participants from the construction sites. Data were collected based on the information related to socio-demographics, lifestyle, occupation, health hazards, and mental health (i.e., depression, anxiety, and stress). The results were interpreted using the chi-square test and logistic regression utilizing SPSS statistical software.</p> Results <p>The study revealed the prevalence rates of depression, anxiety, and stress among construction workers to be 17.9%, 30.3%, and 12%, respectively. Key findings indicate that construction workers who maintained a healthy sleep duration were 64% less likely to be depressed compared to those with poor sleep (AOR = 0.36; 95% CI: 0.21–0.61, <i>p</i>&lt;0.001). Workers who did not experience breathing issues upon starting construction work had a 45% lower likelihood of experiencing depression (AOR = 0.55; 95% CI: 0.32–0.97, <i>p</i> = 0.037) and an 82% lower likelihood of experiencing anxiety (AOR = 0.18; 95% CI: 0.11–0.30, <i>p</i>&lt;0.001). Bricklayer construction workers were 72% less likely to experience stress (AOR = 0.28; 95% CI: 0.08–0.95, <i>p</i> = 0.041), and workers without breathing issues after starting construction work were 66% less likely to experience stress (AOR = 0.34; 95% CI: 0.17–0.66, <i>p</i> = 0.001).</p> Conclusions <p>The study found that depression, anxiety, and stress are prevalent among construction workers in Bangladesh, with breathing issues as a significant risk factor. Thus, there is a need for effective measures to reduce these problems and provide a safe working environment for construction workers to ensure their productivity and the country’s overall growth.</p>","author":"Nitai Roy","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"0eee7489bcedf669cccaff9dcde562b3199bdd9789612d1a183f2ea72d709ce4","category":"Interdisciplinary"}