{"title":"Independent statistical validation of the New Zealand Seafloor Community Classification","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4114?af=R","date":1709107200000,"content":"<h2>Abstract</h2>\n<p>\nThe New Zealand Seafloor Community Classification (NZSCC) is a national-scale numerical community classification which depicts compositional turnover of 1716 taxa (demersal fish, reef fish, benthic invertebrates and macroalgae) classified into 75 groups representing seafloor communities. To ensure the continual use of the NZSCC for spatial planning and reporting, a robust maintenance framework must be set in place; key to this is being able to assess the ability of the classification to represent (discriminate between) different seafloor communities.\nHere we describe an approach for validating the NZSCC using temporally independent evaluation data for demersal fish and benthic invertebrates (the latter sampled via a different method), which identifies whether the NZSCC represents different seafloor communities (i.e., assesses classification strength), evaluates the underlying statistical model, and considers heterogeneity in environmental coverage and statistical uncertainty. Additionally, the availability of abundance estimates for these evaluation datasets provides an opportunity to test whether the NZSCC—which was developed using presence-absence data—can reflect abundance-weighted seafloor communities.\nThe ANOSIM global R values (measuring classification strength) were 0.53 and 0.46 (and significant at the 1% level) for demersal fish and benthic invertebrates, respectively, indicating that the NZSCC groups define biologically distinctive environments.\nThe proportion of significant inter-group differences were very high (95% and 97% for demersal fish and benthic invertebrates, respectively) suggesting NZSCC groups were distinct from each other in their taxonomic composition.\nThere were positive relationships between the evaluation datasets and the underlying statistical model. There was no evidence of these relationships being affected by the statistical uncertainty of the NZSCC.\nNZSCC model validation metrics using abundance evaluation data were also moderately high (albeit lower than for presence-absence for invertebrates) suggesting that the NZSCC, can at least in part, represent variation in abundance-weighted communities. Results presented here suggest that the existing NZSCC is currently fit-for-purpose for informing management decisions.\n</p>","author":"Fabrice Stephenson, \nJordi Tablada, \nAshley A. Rowden, \nRichard Bulmer, \nDavid A. Bowden, \nShane W. Geange","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"0efa6fa8be23ff6396e4379195ec3bb6e5d5e4f490dc28acdd5b74cc83601774","category":"Environment"}