{"title":"New contributions to the knowledge of two riparian mosquitoes in northwestern Spain: Anopheles petragnani and Culex mimeticus (Diptera: Culicidae)","link":"https://academic.oup.com/ee/article/53/4/619/7697646?rss=1","date":1719100800000,"content":"<span><div>Abstract</div>A study was carried out in 345 water ecosystems (rivers, streams, ditches, lagoons, ponds, puddles, rockpools, and artificial containers) throughout the autonomous community of Galicia (NW Spain) during different seasons between 2020 and 2023. The results revealed the first detections of <span>Anopheles (Anopheles) petragnani</span> Del Vechio, 1939 (<span>n</span> = 185) and <span>Culex (Culex) mimeticus</span> Noè, 1899 (<span>n</span> = 12) in the territory, allowing to update and expand the overall knowledge about their distribution and ecology. The breeding preferences of the species were analyzed considering habitat characteristics (land use, water body type, and degree of insolation), geographical variables (latitude, longitude, and altitude), and physical–chemical water parameters (temperature, pH, dissolved oxygen, electrical conductivity, salinity, total dissolved solids, and turbidity). In addition, the relationship between the occurrence of these species and other mosquitoes present in the study area was discussed. <span>Anopheles petragnani</span> is widely distributed in the region and shows breeding preferences for water bodies of fluvial origin, forest environments, and shaded situations. <span>Culex mimeticus</span> was detected sporadically breeding in a pond and in a river in the south of the region, both in industrial and agricultural land uses, and always exposed to the sun. Although the presence of these species may not currently pose a health risk in the region, it is important not neglecting their study since the adequate characterization of their larval biotopes is relevant regarding vector surveillance and control measures.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"0f01a26b5df54db8a120b61516f842245aec1136c1bb594fbc486751b65ecd6d","category":"Environment"}