{"title":"Impact of the semolina‐barley mixture on the volatolomic profile of dough and pasta: characterization by multivariate chemometric approach","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13446?af=R","date":1709906324000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Barley flour, known to be rich in various phytochemicals, has been demonstrated to improve technological and nutritional properties of pasta; however, its volatile profile, from which its aromatic properties depend, also plays an important role in the acceptance of barley enriched pasta. In the present work, volatile organic compounds (VOCs) of semolina doughs enriched with different percentages of barley and of the related pasta were characterized by solid phase micro-extraction (HS-SPME) coupled to gas-chromatography/mass spectrometry (GC/MS) and evaluated using a multivariate statistical approach, including Principal Component Analysis (PCA), cluster-heatmap- Pearson's- and Spearman's Correlations and finally Partial Least Square Correlation (PLSC).</p>\n<h2>Results</h2>\n<p>The effects of single raw materials, as well as their interaction effects, were studied to establish the weight on the volatile profile of the samples and the correlation between the dough VOCs and the processed product VOCs was assessed. The presence of barley flour markedly affected the volatile profile compared to the dough obtained with only durum wheat. For alcohols, esters, terpenes, and some aldehydes there was a clear correlation with the percentage of barley while for others, this correlation depended almost exclusively on the ingredients interaction effect due to the mixing stage.</p>\n<h2>Conclusion</h2>\n<p>Heatmap allowed a good graphic visualization of the linkage between molecules and barley percentage offering the possibility to select the amounts to add the two raw materials according to the desired volatolomic footprint. Pasta with 40% of barley was shown to allow pasta with the most complex volatile profile.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Lorenzo Palombi, \nSandra Pati, \nCarmela Lamacchia, \nRoberta Montebello, \nMaria Luisa Savastano, \nMaria Tufariello","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"0f05d12e5503ff8e644c3fbfa8ca36d8df1f0b794a61474bde502bd994a2bb3e","category":"Environment"}