{"title":"MG เปิดโรงงานผลิตแบตเตอรี่สำหรับรถ EV ในไทย ตั้งเป้าเป็นศูนย์กลางการผลิตในภูมิภาคอาเซียน","link":"https://www.blognone.com/node/136514","date":1698825356000,"content":"<div><div><div><p>บริษัท เอสเอไอซี มอเตอร์ – ซีพี จำกัด และ บริษัท เอ็มจี เซลส์ (ประเทศไทย) จำกัด ผู้ผลิต และผู้จำหน่ายรถยนต์ MG ในประเทศไทย ประกาศเปิดโรงงานแบตเตอรี่ EV แห่งแรกในภูมิภาคอาเซียน พร้อมเข้าสู่บทบาทการเป็นผู้ผลิตรถยนต์ไฟฟ้าในประเทศไทย และปักหมุดให้ประเทศไทยเป็นศูนย์กลางการผลิตอีวีแห่งภูมิภาคอาเซียน</p>\n<p>MG ได้เปิดโรงงานแบตเตอรี่สำหรับรถ EV ภายใต้ชื่อ HASCO-CP BATTERY SHOP บนพื้นที่ NEW ENERGY INDUSTRIAL PARK ครอบคลุมพื้นที่ทั้งหมดประมาณ  75 ไร่ โดยแบ่งพื้นที่เป็น 2 ส่วนใหญ่ ๆ ได้แก่</p>\n<ul>\n<li><strong>ส่วนการประกอบแบตเตอรี่</strong> ประกอบด้วยสายการผลิตอัตโนมัติที่นำหุ่นยนต์ (Robotic) เข้ามาช่วยในการผลิต เชื่อมโดยเลเซอร์ (Laser Welding) ตรวจสอบด้วย CCD (Charge Coupled Device) ในทุกขั้นตอนก่อนนำไปใส่ในตัวรถยนต์พลังงานไฟฟ้า 100%</li>\n<li><strong>ส่วนการทดสอบมาตรฐานของแบตเตอรี่</strong> ที่ทดทอบกว่า 60 ขั้นตอน อาทิ การตรวจสอบค่าการเก็บการคายประจุ (Charge &amp; Discharge), การตรวจสอบน้ำรั่วซึมเข้าสู่แบตเตอรี่ (Air Leak test), ทดสอบความเป็นฉนวน (Insulation Test) และทดสอบการควบคุมพลังงาน (Static Test) เป็นต้น</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/597b2471df0006d27befdfdd3599a512.jpg\" /></p>\n<p>โรงงาน HASCO-CP BATTERY SHOP สามารถประกอบแบตเตอรี่ Cell-To-Pack ได้สูงสุดมากกว่า 50,000 ก้อนต่อปี ซึ่งแบตเตอรี่ที่ประกอบในประเทศไทยจะเป็นมาตรฐานเดียวกับสายการผลิตระดับโลก สำหรับแบตเตอรี่ที่ออกจากสายการผลิตนี้จะถูกนำไปติดตั้งในรถยนต์ไฟฟ้ารุ่น MG4 ELECTRIC เป็นรุ่นแรก ซึ่งโรงงานดังกล่าวอยู่ในระหว่างการเตรียมความพร้อมของสายการผลิตเพื่อเตรียมเปิดตัวอย่างเป็นทางการในปี 2024</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/52036a939348ba0b26ff872537cea706.jpg\" /></p>\n<p>ที่มา - ข่าวประชาสัมพันธ์</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/mg\">MG</a></div><div><a href=\"/topics/battery\">Battery</a></div><div><a href=\"/topics/ev-car\">EV car</a></div><div><a href=\"/topics/automobile\">Automobile</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"0f0ac3def5af342ec17cdf17d713e1b619bd2e84816e06dee9e5c8596b861e97","category":"Thai"}