{"title":"The evolution of mountain bikes in two decades | How have trail bikes changed from 2005 to 2023?","link":"https://www.bikeradar.com/features/tech/how-mountain-bikes-have-evolved/","date":1686416439000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/2023-Rocky-Mountain-Element-vs-2005-Rocky-Mountain-Element-4-of-18-108b388.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/2023-Rocky-Mountain-Element-vs-2005-Rocky-Mountain-Element-4-of-18-108b388.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/2023-Rocky-Mountain-Element-vs-2005-Rocky-Mountain-Element-4-of-18-108b388.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/2023-Rocky-Mountain-Element-vs-2005-Rocky-Mountain-Element-4-of-18-108b388.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/2023-Rocky-Mountain-Element-vs-2005-Rocky-Mountain-Element-4-of-18-108b388.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/2023-Rocky-Mountain-Element-vs-2005-Rocky-Mountain-Element-4-of-18-108b388.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/2023-Rocky-Mountain-Element-vs-2005-Rocky-Mountain-Element-4-of-18-108b388.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/2023-Rocky-Mountain-Element-vs-2005-Rocky-Mountain-Element-4-of-18-108b388.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/2023-Rocky-Mountain-Element-vs-2005-Rocky-Mountain-Element-4-of-18-108b388.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (4 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (4 of 18)\" />                                            \n<p>Modern mountain bikes look very different from their predecessors.</p>\n<p>But appearances aside, just how different are they? Do they ride that differently? And have they actually got better?</p>\n<p>I pitted two <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike/\">mountain bikes</a> in a head-to-head test to find out.</p>\n<p>Both bikes are <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/rocky-mountain-element-c70-29-first-ride-review/\">Rocky Mountain Elements</a> – the brand’s full-suspension cross-country/trail bike.</p>\n<p>The first Element is a silver and black model from 2005 and was provided courtesy of my dad.</p>\n<p>The second is a 2022-spec model, but it shares an identical frame with the latest 2023 bike.</p>\n<p>They’re also the same ‘70’ version. While the spec is, of course, very different, the two bikes sit at roughly equivalent points in the brand’s overall model hierarchy.</p>\n<p>But just how different are they? In this head-to-head test, I compare the frame design, geometry and specs before pitting the two head to head out on the trail.</p>\n<h2>How much have mountain bike frames changed in nearly 20 years?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"My dad bought his Rocky Mountain Element (left) in 2005.\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (5 of 18)\" /></div><div><figcaption><span><i></i> My dad bought his Rocky Mountain Element (left) in 2005.</span></figcaption><span></span></div>\n<p>My dad bought his Rocky Mountain Element 70 back in 2005. He still rides the bike to this day.</p>\n<p>It’s very much a product of its time, with an <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-frame-materials/\">aluminium frame</a>, 26in wheels and geometry that is best described as old-school.</p>\n<p>Without even diving into the geometry charts, it’s visually obvious how much shorter and smaller it is than the much newer bike.</p>\n<p>The frame tubes were made by Easton, but unlike its famous square-profiled RAD tubing of the time, the Element was made from 7005 Ultralite Taperwall aluminium round tubes.</p>\n<p>Compared to modern <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-trail-bikes/\">trail bikes</a>, there’s not much going on in terms of tube shaping – straight round tubes are welded to big forged or machined sections around the <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket</a> and main pivot.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2005 Rocky Mountain Element\" title=\"2005 Rocky Mountain Element\" /></div><div><figcaption><span><i></i> The bike was manufactured in Canada.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>The bike was, however, handmade in Canada and signed by the person who welded and painted it – a nice touch often missing from many modern bikes.</p>\n<p>This is all a far cry from the latest Element C70 and its Smoothwall carbon frame.</p>\n<p>While Rocky Mountain does still produce an aluminium Element, these top out at the <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/rocky-mountain-element-50-review/\">Element 50</a> model – the C70 is the only model that uses the same ‘70’ designation as our older, 2005 bike.</p>\n<p>The carbon C70 has some pretty fancy tube shapes, and different carbon layups are used across the size range to provide optimal strength and stiffness in the desired areas.</p>\n<h2>29er takeover</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (11 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (11 of 18)\" /></div><div><figcaption><span><i></i> 2.1in tyres are a rare sight on mountain bikes these days.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>The switch to <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-a-29er/\">29er wheels</a> on the contemporary bike is another key difference.</p>\n<p>The old bike rolls on 26in wheels and 2.1in-wide tyres. The new Element bowls along on 29in hoops and wider 2.4in tyres.</p>\n<p>29in wheels are perhaps the most common size of wheel you’ll find on mountain bikes these days, particularly for shorter-travel bikes.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-tyres/\">Mountain bike tyres</a> have also increased in width – it would be rare to find a 2.1in-wide tyre on a trail bike these days. Even tyres on <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cross-country-bikes/\">cross-country bikes</a> are now typically 2.4in wide.</p>\n<h2>Travel through time</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (17 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (17 of 18)\" /></div><div><figcaption><span><i></i> The travel of the 2023 bike sits at 120mm.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>Like other bikes that share a common lineage – such as the <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/trek-top-fuel-8/\">Trek Top Fuel</a> or the <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/2022-specialized-stumpjumper-comp-review/\">Specialized Stumpjumper</a> – the Element has seen a bump in <a href=\"https://www.bikeradar.com/advice/buyers-guides/how-much-suspension-travel-do-i-need-on-my-mountain-bike/\">suspension travel</a> since 2005.</p>\n<p>The 2005 Element sports 100mm of travel at both ends, which was pretty common for cross-country and shorter-travel all-rounder mountain bikes at the time.</p>\n<p>The current Element features 120mm of rear-wheel travel and 130mm up-front.</p>\n<p>The <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-mountain-bike-rear-suspension-systems/\">suspension layout</a> is similar between both bikes. Although the pivot has moved from the chainstay to the seatstay, the shock is still driven by a small linkage.</p>\n<h2>Longer, lower, slacker…</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (4 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (4 of 18)\" /></div><div><figcaption><span><i></i> Geometry has come along leaps and bounds in the last two decades.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>Side by side, it’s easy to see the modern bike is substantially bigger, despite being the same medium size.</p>\n<p>The sheer length of the 2023 Element is the most obvious change.</p>\n<p>The wheelbase has grown from 1,066mm for the 2005 Element to 1,202mm on the 2023 bike.</p>\n<p>Most of that growth has come from the front centre of the bike – the 2023 bike’s chainstays are only 8mm longer than the 2005 bike, despite that using 26in wheels.</p>\n<p>Cramming a wheel that’s 3in bigger into a similar-sized space is an impressive achievement.</p>\n<p>While you want enough length to keep the bike stable, shorter chainstays help to keep it agile.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Rocky Mountain Element C70 29 full suspension mountain bike\" title=\"Rocky Mountain Element C70 29 - 04\" /></div><div><figcaption><span><i></i> 1x drivetrains have had a significant impact on the design of modern mountain bikes.</span></figcaption><span> <i>Andy Lloyd / Our Media</i></span></div>\n<p>This also speaks to how wider trends, such as the shift to <a href=\"https://www.bikeradar.com/advice/buyers-guides/1x-drivetrains/\">1x drivetrains</a> (more on that in a moment), have impacted the overall design of bikes.</p>\n<p>All that means the remaining 136mm difference between the two bikes comes from the front end of the bike.</p>\n<p>Part of that is down to the much slacker head angle.</p>\n<p>The latest Element uses Rocky Mountain’s Ride4 geometry adjustment. In the slackest setting, the bike is raked out with a 65-degree head angle. The old bike was fixed at 71.5 degrees.</p>\n<p>In the context of <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-bike-geometry-and-handling/\">bicycle geometry</a>, 6.5 degrees is a massive difference.</p>\n<p>I couldn’t find official reach measurements for the 2005 Element (these weren’t commonly published back then).</p>\n<p>However, by our rough measurements, the 2005 bike has a reach of around 400mm. The 2023 comes in at 450mm.</p>\n<p>Because of this, and the near 3-degree steeper seat angle of the new bike (76 degrees vs 73.5 degrees), the effective top tube of the current bike is 25mm longer at 605mm.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (1 of 1)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (1 of 1)\" /></div><div><figcaption><span><i></i> The layback seatpost and long stem mean the ride position of the 2005 Element is actually longer than the modern bike.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>However, the laid-back seatpost and 100mm-long stem mean the 2005 Element’s seated position is actually longer. That long stem is paired with a narrow 610mm handlebar.</p>\n<p>The 2023 bike has a short 50mm stem and 780mm-wide bar – around standard for a modern trail bike.</p>\n<p>The bar and stem themselves are also the much older 25.4mm clamp size, compared to the 35mm setup that’s fairly commonplace in 2023.</p>\n<h2>Component differences (and similarities)</h2>\n<p>While there are some obvious differences between the bikes in terms of geometry and suspension travel, there’s also a clear familial resemblance between them.</p>\n<p>Despite the nearly 20-year gap, the spec of the two bikes is not all that dissimilar in terms of brand and level.</p>\n<p>This 2005 Element originally shipped with an RP3 rear shock and a Fox F100 Terralogic fork.</p>\n<p>The RP3 is an ancestor of the Float DPS that features on the latest Element.</p>\n<p>Back in 2005, the Fox F-Series fork was seen on everything from cross-country bikes to longer-travel trail bikes, in its longest 150mm-travel form.</p>\n<p>Sadly, the old F100 succumbed to a worn-out steerer tube a number of years ago, so a RockShox SID sits in its place.</p>\n<p>Even now, the SID is still a popular fork, so there’s a link from the 2005 bike to the present day, even in its slightly modified state.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (10 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (10 of 18)\" /></div><div><figcaption><span><i></i> Dual Control levers – mercifully gone and hopefully soon-to-be forgotten.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>The same can be said about the Shimano XT drivetrain.</p>\n<p>While the derailleur on my dad’s bike has been swapped out for XTR and the XT Dual Control levers replaced with LX models, the original featured a full XT groupset, just like the current Element.</p>\n<p>For those who have never come across it, Dual Control was Shimano’s first attempt to integrate the brake levers and shifters into one unit.</p>\n<p>Dual controls required you to use the brake lever blade to change gear, flicking it up or down to move across the cassette. For the roadies reading this, think of Shimano STI road bike levers, but sideways.</p>\n<p>The design was not the most intuitive to use – you could find yourself braking while changing gear or, worse still, changing gear while braking over rough ground.</p>\n<p>It’s not difficult to see why these didn’t stick around. Modern brake levers and gear shifters can integrate just as neatly, but are far more ergonomic to use and look less of an eyesore to boot.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (13 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (13 of 18)\" /></div><div><figcaption><span><i></i> 3×9 drivetrains were the norm in 2005.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">rear derailleur</a> is also different, coming nearly a decade before clutches became commonplace.</p>\n<p>The derailleur works in the opposite way to most derailleurs. Without any cable tension, the derailleur would default to the biggest sprocket on the cassette, rather than the smallest. This is known as a ‘low normal’ derailleur, with Shimano branding it Rapid Rise.</p>\n<p>Dual Control and Rapid Rise rear derailleurs never caught on, and we now have easy-to-use 1x systems, like that fitted to the new Element, rather than the 3×9 systems of old.</p>\n<p>While the drivetrain is substantially different between the generations of XT, the basic design of the XT brake calipers is very similar, a testament to the quality of Shimano’s original design.</p>\n<h2>Ride comparison – have bikes really improved since 2005?</h2>\n<p>To find out how they ride on the trail, I devised a short loop around the Forest of Dean, in the southwest of England.</p>\n<p>This featured smooth climbs, fast, flowy descents and some rougher, steeper sections – a fair test of any trail bike.</p>\n<p>While I did get the stopwatch out, this was far from a scientific test.</p>\n<p>First of all, both bikes are medium sizes, so were a little on the small side for my 6ft frame. I also didn’t use a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meter</a>.</p>\n<p>As such, you should take these times with a ladle of salt – this test is more about how each bike felt. How much, or how little, confidence do they inspire on the trail? And how much fun are they to ride?</p>\n<h3>2023 Rocky Mountain Element</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (2 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (2 of 18)\" /></div><div><figcaption><span><i></i> The 2023 Element felt poised and controllable on most terrain.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>I started out by setting a time on the newer Element.</p>\n<p>The bike felt very efficient on the climbs, even with the shock left open.</p>\n<p>The 29in wheels carried speed over rougher parts of the climb well and maintained traction comfortably.</p>\n<p>The handling while climbing was pretty relaxed, but I could place the front wheel where I wanted, even on steep switchbacks.</p>\n<p>The Shimano XT drivetrain shifted perfectly, with the 10-51T cassette providing all the gear range I needed.</p>\n<p>On the descents, the same precise handling I noticed on the climbs carried through.</p>\n<p>The Fox 34 fork and wide handlebar gave me the confidence to push the bike pretty hard and it flew down the flow section before sucking up the steeper trails with ease.</p>\n<p>The cockpit setup really helps, with the dropper post enabling you to slam the saddle out of the way to really feel comfortable rolling into the descents.</p>\n<p>The only fly in the ointment was the two-piston XT brakes, which lacked a little bit of power considering how capable the rest of the bike felt.</p>\n<p>Overall though, the newer Element felt very good and posted a time of 5mins 56secs.</p>\n<h3>2005 Rocky Mountain Element</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (7 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (7 of 18)\" /></div><div><figcaption><span><i></i> The 2005 Element is… quite an exciting ride.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>Moving over to the 2005 Element immediately felt very different.</p>\n<p>Despite the longer distance between the end of the saddle and the handlebar, the bike felt short.</p>\n<p>The front wheel seemed as if it was right under my chest, rather than out in front of me. This resulted in a comparatively twitchy ride, even on the flat.</p>\n<p>It felt fairly efficient on the climbs, only really losing out to the newer Element in terms of rollover ability on the rougher sections of the climb.</p>\n<p>I could feel the rocks and roots sucking my speed, whereas the bigger wheels rolled over them far more easily and carried speed better.</p>\n<p>On the techier switchbacks, the front end of the older bike was very difficult to handle. I was having to work hard to keep the front wheel tracking where I wanted.</p>\n<p>Despite that, the times of both bikes were very similar on the climbs, with the new bike coming out on top by only a few seconds.</p>\n<p>The 2005 bike feels pretty efficient, doubly so when running the shock in Propedal mode. This reduced pedal-induced bobbing quite significantly – when left open, the suspension’s kinematics weren’t providing a lot of anti-squat, so there was a fair amount of suspension movement as a result.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (12 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (12 of 18)\" /></div><div><figcaption><span><i></i> The older bike climbs surprisingly well.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>Again, this test is hardly scientific, so there’s not much to be taken from that result. However, it does suggest that on the climbs at least, there could be very little in it between modern and much older bikes. This comes as a bit of a surprise.</p>\n<p>Although the new bike is close to a kilo heavier, I really thought the better rollover from the 29in wheels would make more of a difference on the rougher, rockier sections of the climb – maybe 26in isn’t dead after all.</p>\n<p>Though the bike felt slightly more at home on flatter, smoother sections, it really came unstuck on steeper parts of the lap.</p>\n<p>As soon as the speed picked up, the bike felt twitchy and edgy.</p>\n<p>The super-steep head angle, long stem, narrow bar and lack of a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">dropper post</a> really hold it back. Compared to the confidence-inspiring ride of the old bike, it was a case of holding on and hoping for the best.</p>\n<p>It certainly felt as though I was having to put more effort into keeping the bike upright.</p>\n<p>The Dual Control levers also make life a little more difficult. They are, put simply, difficult to use.</p>\n<p>The lever blades are not a nice shape, with a really narrow, flat cross-section that doesn’t end with a big hook. This made it feel as though my fingers were going to fall off the ends of the levers.</p>\n<p>Like the newer Element, the two-piston brakes lacked power, even more than the latest XTs thanks to the 160mm rotors front and rear. Thanks to the steep head angle though, they still felt as if they had enough power to throw me over the bars at a moment’s notice.</p>\n<p>The quick-release SID fork also felt very flexy in comparison to the Fox 34, so line choice was vague, rather than a precision move.</p>\n<p>Unsurprisingly, the clock showed the bike’s deficiencies, as it logged a time of 7mins 9secs.</p>\n<h2>2005 Rocky Mountain Element vs 2023 Rocky Mountain Element bottom line</h2>\n<div></div>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (18 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (18 of 18)\" /></div><div><figcaption><span><i></i> They may share the same name but these are two very different bikes.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>First off, this was not a scientific test – I didn’t use a power meter and relied on Strava for timing, so it’s by no means accurate.</p>\n<p>That said, I had a good range of trail conditions to test both bikes on.</p>\n<p>I wasn’t really surprised to find the newer Element was quicker than its 20-year-old predecessor.</p>\n<p>Most of this was made up on the descents. The small gap on the climbs was surprising, however.</p>\n<p>That said, the older bike was also very twitchy on techy climbs, with the front wheel lifting easily. This made it difficult to keep the front end down and track the ground to keep it going on the line I wanted.</p>\n<p>A wider handlebar would help here, just to give me more leverage to keep the bike in check, as would an inline seatpost.</p>\n<p>The new bike felt much more planted in comparison.</p>\n<p>The front end was easier to weight, and it didn’t feel there was anywhere it lost out to the older bike, even if the longer wheelbase means it can feel a little cumbersome on really tight turns.</p>\n<p>It would be nice if the 2023 bike could lose a kilo of weight to match it up to the older bike, but that’s the price you pay for bigger wheels, wider tyres, a burlier fork and a dropper post.</p>\n<p>However, I was certainly glad I had all those things on the way back down – the newer bike could really stretch its legs on the descents.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (3 of 18)\" title=\"2023 Rocky Mountain Element vs 2005 Rocky Mountain Element (3 of 18)\" /></div><div><figcaption><span><i></i> With the right upgrades, the 2005 bike could be a great ride, but its geometry will always hold it back.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>The much longer, slacker geometry, teamed with a much beefier fork and wider handlebar, gives the front end much more authority.</p>\n<p>Being able to get the saddle out of the way thanks to the dropper was certainly a massive boost – the geometry and dropper make more of a difference than the moderate boost in travel.</p>\n<p>More travel can help on rougher sections, but it’s no compensation for good geometry. I’d much rather have a rigid bike with modern geometry than a lot of travel and the angles of yesteryear.</p>\n<p>As it stands, I would prefer to be on the newer bike, but with a few simple modifications, the gap between them could be much smaller.</p>\n<p>There’s not much I can do about the 2005 bike’s geometry, but there would be nothing stopping me adding a wider bar and dropper post, and ditching the 3×9 drivetrain for something more modern.</p>\n<p>A stiffer fork would also be possible, even if straight-steerer 26in suspension forks are something of a rarity in 2023.</p>\n<p>I’m not sure my old man would be too happy with me tearing his beloved bike apart, but in the name of pseudo-science, it might just have to be done to see if there is life left in the old dog yet.</p>\n<p> </p>","author":"Tom Law","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"0f127cfc13d4564ab0c78979c8daaa6b52a3aa91732f28b4df55b70a3691b68e","category":"Cycling"}