{"title":"Effects of zinc supplementation and implant abscess on the immune system and growth performance of growing beef steers","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae075/7661063?rss=1","date":1714608000000,"content":"<span><div>Abstract</div>Seventy-two Angus-cross steers (261 ± 14 kg) were utilized to determine the effects of supplemental Zn sulfate on growth, trace mineral status, circulating immune cells, and functional innate immune responses. Steers were stratified by weight and implanted with a Component E-S with Tylan implant (Elanco Animal Health, Greenfield, IN) on day 0. Dietary treatments included: control (CON; no supplemental Zn), Zn100 (100 mg supplemental Zn/kg DM), and Zn150 (150 mg supplemental Zn/kg DM). Analyzed dietary concentrations of Zn were 58, 160, and 207 mg Zn/kg DM, respectively. On days 13 and 57, blood from nine steers per treatment was collected for immune analyses (cell phenotyping and response to stimulus). On day 16, implant abscesses were evaluated by palpation and visual appraisal. Sixty percent of steers had abscesses; however, there were no differences in abscess prevalence due to treatment (<span>P</span> = 0.67). Data were analyzed as a split-plot design using the Mixed procedure of SAS 9.4 (Cary, NC) with effects of dietary treatment, abscess, and their interaction. There was a tendency (treatment × abscess; <span>P</span> ≤ 0.09) for steers without abscesses to have greater average daily gain (ADG; treatment × abscess <span>P</span> = 0.06) and gain:feed (G:F; treatment × abscess <span>P</span> = 0.09) from d 14 to 27 in CON and Zn100 while within Zn150 steers without abscesses tended to have lesser ADG and G:F than abscessed steers. There were no other treatment × abscess effects for growth performance, but steers with abscesses tended to have decreased final body weight (<span>P</span> = 0.10) and overall G:F (days 0 to 57; <span>P</span> = 0.08). There was no interaction of treatment and abscess on immune cell populations on days 13 or 58 (treatment × abscess <span>P</span> ≥ 0.11). On day 13, Zn150 steers had increased CD45RO + gamma delta (<span>P</span> = 0.04) T cells. Abscessed steers had increased CD21 + B cells (<span>P</span> = 0.03) and tended to have increased CD21 + (<span>P</span> = 0.07) and CD21 + MHCII<sup>hi</sup> (<span>P</span> = 0.07) B cells in circulation. This study shows zinc supplementation and implant abscesses can alter the immune system and growth performance of growing beef steers.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"0f1d56ee7b096aec2a460ca11469ce3b0439687ad437fcbf25e955a859d81778","category":"Environment"}