{"title":"Effects of Chemical Fertilizer Application upon the Water Quality Parameters of a Rice–Eel (Monopterus albus) Coculture System","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/9341799?af=R","date":1675756800000,"content":"<p>The excessive use of chemical fertilizers causes many problems for which solutions are being sought in a variety of agricultural production systems. From the perspective of paying attention to the health requirements of aquatic animals in terms of water quality, this study investigated the impact of chemical fertilizer application on water quality in a rice (Oryza sativa L.; Cultivar “Qingxiangruangeng,” accession number: 2014004)–eel (<i>Monopterus albus</i>) coculture system in Shanghai, China. Chemical fertilizer was applied four times—as base fertilizer, rejuvenated fertilizer, tiller fertilizer, and ear granule fertilizer—during the production process of a rice–eel coculture system (June to October 2020). Changes in the water quality parameters of rice field’s surface water and ring ditch water in the regular chemical fertilizer group (RF) and no chemical fertilizer group (NF, the control) were compared before and at 24 h, 48 h, and 72 h after the chemical fertilizer application. The results for the analyzed physical and chemical indexes of each water area before and after four fertilizations revealed several consistent trends. First, the pH, dissolved oxygen (DO), water temperature (T), and chemical oxygen demand (COD) of either water area were similar between the NF and RF groups, whereas their total nitrogen (TN), total ammonia nitrogen (TAN), and total phosphorus (TP) levels differed significantly. After adding the above fertilizer containing nitrogen and phosphorus, 24 h later, the TN, TAN, and TP content had already increased significantly in comparison with the control. The maximum average content of TAN and nitrite nitrogen (NO<sub>2</sub>\n<sup>−</sup>-N) in the ring ditch water reached 12.30 mg/L and 0.37 mg/L, respectively, at 24 h after the chemical fertilizer application. Nonlinear regression analysis results showed that there was a significant positive relationship TN (<i>δ</i>TN) and TAN (<i>δ</i>TAN) vis-à-vis the nitrogen content of the fertilizer. The results of this study provide a timely empirical reference and data support for improving fertilizer management in rice–eel coculture systems.</p>","author":"Quan Yuan, \nWeiwei Lv, \nXiaolin Sun, \nWeiwei Huang, \nWenzong Zhou, \nMohamed Abdelsalam","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"0f1ee3bd16ee2df54ef924ea04d97f1e6c442ce20fa1e962260902170c88eaac","category":"Environment"}