{"title":"Learning the Physics of Liquid Phase TEM Nanoparticle Trajectories Using Physics-Informed Generative AI","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.850/7720183?rss=1","date":1721779200000,"content":"<span>Visualizing and characterizing the diffusion of single nanoparticles in various chemical and biological environments enables us to infer the underlying material properties of the environment. The advent of liquid phase transmission electron microscopy (LPTEM) has introduced a novel avenue for high spatial and temporal resolution single particle tracking at the nanoscale, enabling us to investigate diffusion dynamics at a scale inaccessible before [<a href=\"#ozae044.850-B1\">1-4</a>]. Understanding and interpreting the underlying physics of single nanoparticle trajectories has traditionally been approached with canonical statistical methods such as time-averaged mean squared displacement. However, these methods fail on single short trajectories, especially the ones with non-gaussian and non-ergodic characteristics – common features of LPTEM trajectories. These challenges have led to a body of computational research on classifying short single particle trajectories into classes of anomalous diffusion and determining their anomalous diffusion exponents (<span>α</span>) using supervised machine learning and deep learning models that are trained on simulated trajectories with known α [<a href=\"#ozae044.850-B5\">5-7</a>]. This problem has also been handled with unsupervised deep learning approaches to learn the properties of simulated trajectories of known diffusion classes but without labels of physical parameters like α [<a href=\"#ozae044.850-B8\">8</a>, <a href=\"#ozae044.850-B9\">9</a>]. However, experimental data from single particle tracking experiments remains a largely unknown mixture of different anomalous diffusion classes with unknown diffusion parameters, making it difficult to classify them into ideal stochastic models. Furthermore, learning the dynamics of real experimental nanoparticle trajectories is a crucial step in advancing electron microscopy into the space of fully automated workflows.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"0f368da6f6d621b1222a627ca57bd1b1e6680bf4ab99b7a1c091c819fb1d56b5","category":"Environment"}