{"title":"82 Impact of visual dark-cutting severity and wet aging on the bloom and retail color stability of beef longissimus lumborum steaks","link":"https://academic.oup.com/jas/article/102/Supplement_3/220/7757166?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>A dark red to coffee bean color present within the ribeye between the 12<sup>th</sup> and 13<sup>th</sup> rib of a beef carcass at the time of grading is the hallmarking characteristic of dark-cutting (DC) beef. However, the degree of darkness within the ribeye can vary. Limited studies have evaluated DC beef of varying visual severity throughout aging and retail display. Therefore, the objective was to evaluate the impact of varying degrees of dark-cutting severity on the bloom and retail color of beef longissimus lumborum subjected to 0, 21, or 39 d of aging. Beef strip loins (IMPS #180; n = 8/treatment) were collected from commercial beef processors based on the visual degree of SC at the time of grading. Strip loins represented one-half dark, two-thirds dark, full dark, and a normal, cherry-red colored control. At 48 to 60 h postmortem, loins were fabricated by slicing two 2.54 cm steaks from the anterior end of each loin for retail display (unaged) or biochemical analysis. The remaining portion of the strip loin was segmented into two sections and assigned to 21 or 39 d of wet aging. Following aging, one 2.54 cm steak from the anterior end of each loin was cut for retail display. All steaks designated for retail display were placed into Styrofoam trays and overwrapped with polyvinyl chloride film and placed into retail display following aging. Bloom, metmyoglobin reducing activity, and pH were evaluated for biochemical analysis. Color measurements were taken each day of display using a HunterLab MiniScan EZ spectrophotometer. The data were analyzed using the Glimmix procedure of SAS. One-half and normal steaks had a lower (<span>P</span> &lt; 0.05) initial pH than two-thirds and full steaks. Unaged full steaks had greater (<span>P</span> &lt; 0.05) metmyoglobin reducing activity than unaged normal and half steaks. Steaks aged for 21 and 39 d were more (<span>P</span> &lt; 0.05) red initially following bloom than unaged steaks. Full and two-thirds steaks aged for 0 d had a decreased (<span>P</span> &lt; 0.05) a* value on d 0 of display than normal and half steaks aged for 0 d. Similarly, following 21 and 39 d of aging full and two-thirds dark steaks had a lower (<span>P</span> &lt; 0.05) a* value and were less red in color than normal and half steaks on the initial day of retail display. By d 4 of display, normal and one-half steaks aged for 21 d had a greater (<span>P</span> &lt; 0.05) a* value than two-thirds steaks aged for 21 d. When aged for 39 d, all treatments were similar (<span>P</span> &lt; 0.05) in redness by the end of display. Results from this study indicate that the visual severity of dark-cutting can impact color throughout aging and retail display.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0f38cae595453b2cb4e189148e1888cb81a00e27860384920a02c7d2651f8115","category":"Environment"}