{"title":"Review: 2022 Jeep Wagoneer Offers Wireless CarPlay and Up to Nine Screens","link":"https://www.macrumors.com/review/2022-jeep-wagoneer-carplay/","date":1631040725000,"content":"One of the splashier car introductions for this year is the <a href=\"https://www.jeep.com/wagoneer.html\">relaunch of the iconic Jeep Wagoneer brand</a> as an all-new full-size SUV to compete against the likes of the Cadillac Escalade and Lincoln Navigator. The new 2022 Jeep Wagoneer is also available as a Grand Wagoneer, but rather than being a larger version of an already large SUV, the \"Grand\" designation is used to represent higher trim lines and some minor changes to styling.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/2022-wagoneer.jpg\" />\r\n<br />\r\nJeep invited me up to New York City recently to take a look at the Wagoneer and Grand Wagoneer, which have gone all-in on technology with up to nine LCD screens scattered throughout the vehicle and new Fire TV integration that takes rear entertainment to the next level. And of course, there's wireless <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a> through the beefed-up Uconnect 5 infotainment system.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-cockpit.jpg\" /><em>Overall dashboard view</em></div>\r\n<br />\r\n<h3>Main Infotainment Screens</h3>\r\n<br />\r\nKicking things off with the main infotainment experience, the Wagoneer certainly isn't the only vehicle on the market to feature two screens in the center stack and console area, but Jeep is definitely doing some interesting things with the setup.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-dual-screens.jpg\" /><em>Dual main infotainment screens</em></div>\r\n<br />\r\n\r\n<br />\r\nSimilar to other systems like those seen on some Audi models, the 12-inch top screen on the Grand Wagoneer trims (10.1-inch on Wagoneer) focuses on primary infotainment functions, while the 10.25-inch bottom screen offers controls for various vehicle functions such as climate settings for front and rear, as well as seat controls including massage settings for both driver and passenger. \r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-lower-screen.jpg\" /><em>Massage controls on lower screen</em></div>\r\n<br />\r\nThe unique thing Jeep has done here is that at the touch of a button below the bottom screen, it turns off and automatically flips up under the main part of the dashboard, revealing a spacious cavity with a wireless phone charging pad and a bunch of charge-and-data ports in three sets of both USB-C and USB-A, two for the front and one for delivering a USB connection to the rear. There's also a 12V power port and an aux jack under there, as well as an HDMI port on some trims, making it easy to tuck things away.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-qi-empty.jpg\" /><em>Qi phone charging pad and USB ports</em></div>\r\n<br />\r\nEven with that lower screen turned off and flipped up, you don't lose access to the most important functions housed there. A row of buttons below the main screen can handle most of the climate adjustments you need, while capacitive buttons on either side of the main screen offer quick access to controls for the heated and ventilated seats and heated steering wheel. Anything else can be controlled through pages on the main infotainment system.\r\n<br />\r\n\r\n<br />\r\nWireless phone chargers in vehicles are frequently finicky due to the need to fit a variety of phone sizes in an environment with a decent amount of movement. Every manufacturer seems to have a different solution for trying to tackle this problem, and I like the one Jeep has implemented here.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-qi-phone.jpg\" /><em><a href=\"https://www.macrumors.com/roundup/iphone-12-pro/\">iPhone 12 Pro Max</a> on the charger</em></div>\r\n<br />\r\nThe charger is an angled pad coated in a rubber-like material that makes it easy to just plop your phone down on it without needing to worry too much about getting things lined up perfectly. The pad has a ledge at the bottom to support the phone, while the grippy rubber surface keeps the phone from sliding side to side. In my time with the vehicle, I had no problems initiating or maintaining charging on the pad.\r\n<br />\r\n\r\n<br />\r\nIf you prefer wired charging, there is an array of additional USB-A and USB-C ports scattered around the cabin, including some charge-only ports in the center console compartment.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-siriusxm.jpg\" /><em>Uconnect 5 media functions with SiriusXM</em></div>\r\n<br />\r\nGetting back to the main infotainment screen, many aspects of the system are similar to the more standard Uconnect 5 system found in other recent Fiat Chrysler (now Stellantis following a merger with PSA Groupe earlier this year) models such as the Chrysler Pacifica I <a href=\"https://www.macrumors.com/review/2021-chrysler-pacifica-uconnect-5-wireless-carplay/\">tested a few months ago</a>, albeit with a differentiated skin that feels more appropriate in a Jeep. There are also some enhanced functionalities to support off-roading and other capabilities of the Wagoneer.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-dynamics.jpg\" /><em>Vehicle dynamics and other advanced Jeep options in vehicle settings</em></div>\r\n<br />\r\nThe spacious 12-inch main screen on the Grand Wagoneer offers plenty of room for a persistent status bar across the top and a control strip at the bottom, and the 10.1-inch screen on the Wagoneer still works quite well.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-status-bar-configure.jpg\" /><em>Configuration options for top status bar</em></div>\r\n<br />\r\nThe top status bar can be configured with various bits of information and controls, while the bottom control strip lets you easily jump among ‌CarPlay‌, the native audio system, advanced climate controls, built-in navigation, overall vehicle settings, and more. A configurable Uconnect home screen lets you set up <a href=\"https://www.macrumors.com/guide/home-screen/\">widgets</a> and shortcuts across multiple pages to keep a variety of information and apps visible at once.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-uconnect-home.jpg\" /><em>Uconnect 5 home screen with customizable widget layout</em></div>\r\n<br />\r\n<h3>CarPlay</h3>\r\n<br />\r\nI've remarked before how Uconnect does a great job of integrating ‌CarPlay‌ into the native system to make it super easy to switch back and forth, and that's true here in the Wagoneer as well.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-carplay-dashboard.jpg\" /><em>‌CarPlay‌ dashboard view</em></div>\r\n<br />\r\nWhile many infotainment systems feel very much as if ‌CarPlay‌ and the native functionality exist as separate systems, Uconnect really makes ‌CarPlay‌ feel like a fundamental part of the overall system. ‌CarPlay‌ feels like a core app alongside features like audio, built-in navigation, and climate controls, and the layout makes it simple to keep tabs on what's going on with Uconnect even while ‌CarPlay‌ is active.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-carplay-home.jpg\" /><em>‌CarPlay‌ home screen</em></div>\r\n<br />\r\nThe large palette of the 12-inch screen on Grand Wagoneer means that ‌CarPlay‌ looks great with a wide aspect ratio, allowing navigation apps like <a href=\"https://www.macrumors.com/guide/maps/\">Apple Maps</a> able to present expansive views. The high-quality display also lets the vivid colors of ‌CarPlay‌ icons and other content really shine.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-carplay-maps.jpg\" /><em>‌Apple Maps‌ in ‌CarPlay‌</em></div>\r\n<br />\r\n\r\n<br />\r\nWireless ‌CarPlay‌ setup in the Wagoneer was simple as usual, and performance was rock solid in my testing. I didn't notice any lag when swiping around the interface, and everything was smooth and responsive.\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-carplay-now-playing.jpeg\" /><em>‌CarPlay‌ \"Now Playing\" screen</em></div>\r\n<br />\r\n<h3>Instrument Cluster With Apple Maps Navigation</h3>\r\n<br />\r\nThat takes care of the main infotainment system, but there are a lot more screens scattered throughout this vehicle. In front of the driver, the instrument cluster consists of an all-digital 12.3-inch screen that offers a number of different views to suit your preferences.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-cluster-4wd.jpg\" /><em>Instrument cluster with 4WD mode settings</em></div>\r\n<br />\r\nOne of the features is the ability to display basic directions from ‌Apple Maps‌ in ‌CarPlay‌, a feature that's becoming more and more common in the latest vehicles. As with other implementations, it's barebones directional guidance, and hopefully these types of second-screen ‌CarPlay‌ experiences will become more powerful in the future.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-apple-maps-cluster.jpg\" /><em>‌Apple Maps‌ navigation in instrument cluster</em></div>\r\n<br />\r\nAt a minimum, I'd love to see widespread instrument cluster integration of a <a href=\"https://www.macrumors.com/2021/09/03/bmw-i4-integrated-carplay-instrument-cluster/\">full Apple Maps view as BMW has teased</a> in iDrive 8 for its upcoming i4.\r\n<br />\r\n<h3>Front Passenger Screen</h3>\r\n<br />\r\nOne of the most talked-about technology features on the Grand Wagoneer is a dedicated 10.25-inch passenger screen, which includes a filter to prevent the driver from being able to view the screen, limiting potential distractions.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-passenger-rear-sources.jpg\" /><em>Monitoring rear entertainment screens from front passenger screen</em></div>\r\n<br />\r\nWith this screen, the front passenger can monitor and assist with setup for the two rear screens to help smaller kids watch their desired content. The front passenger can also plug in a phone or other device over USB or HDMI to view their own video, while there are several other functions for assisting the driver such as navigation integration to help look up destinations and send them to the main infotainment screen, as well as the ability to view various vehicle cameras to assist while off-roading or in other situations.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-passenger-nav.jpg\" /><em>Navigation assistance using front passenger screen</em></div>\r\n<br />\r\nThe filter greatly limits the viewing angle of the screen while the plastic cover material can create a bit of glare, and those factors together make the screen appear a little bit dim and a bit tricky to capture on camera, but in real life, I didn't have any trouble viewing content on the screen.\r\n<br />\r\n\r\n<br />\r\nI do wish there was a way to display robust ‌CarPlay‌ content on the passenger screen, but Apple does not support this capability, with second-screen ‌CarPlay‌ still limited to select data feeds like ‌Apple Maps‌ navigation information for the instrument cluster.\r\n<br />\r\n\r\n<br />\r\n<h3>Rear Screens</h3>\r\n<br />\r\nWith Fire TV integration on the rear-seat entertainment system, both 10.1-inch screens can operate independently or interact with each other, allowing passengers to watch a broad array of content including Netflix, Amazon Prime, HBO Max, YouTube, and more.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-rear-fire-tv.jpg\" /><em>Fire TV for Auto on rear screen</em></div>\r\n<br />\r\nWhile the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> app is supported on many Fire TV devices, I wasn't able to find it on the system in the Wagoneer, but hopefully that's coming at some point as there's no reason it couldn't be supported.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-rear-youtube.jpg\" /><em>YouTube available on rear screen</em></div>\r\n<br />\r\nOther rear-seat entertainment options include casual games that can be played using the included hardware remote or an on-screen controller (I recommend the former), and an \"Are We There Yet?\" app for kids to help them track progress toward their destination without continually bugging their parents.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-fire-tv-remote.jpg\" /><em>Fire TV remote – one for each rear screen</em></div>\r\n<br />\r\nAs if two screens in the second row weren't enough, some trims include a third 10.25-inch screen located on a console between the seats, which puts climate control and heated and ventilated seat controls within easy reach. \r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-rear-comfort.jpg\" /><em>Rear climate control screen</em></div>\r\n<br />\r\n<h3>But Wait, There's More</h3>\r\n<br />\r\nIf you've been counting, that adds up to seven screens, but there are actually two more available screens on some Wagoneer trims and option packages, making a grand total of nine screens: one for the instrument cluster, one for the driver's head-up display, two for the main infotainment system, one for the front passenger, two for the rear entertainment system, one for the rear climate controls, and one integrated into the rear-view mirror for better visibility on such a large vehicle.\r\n<br />\r\n\r\n<br />\r\n<h3>Wrap-up</h3>\r\n<br />\r\nMy focus in this overview is on the technology and infotainment capabilities of the new Wagoneer and Grand Wagoneer, but this is obviously a high-end SUV with a variety of capabilites for off-roading, towing, and more, some of which I was able to test out and found it handled well.\r\n<br />\r\n\r\n<br />\r\n<div><img src=\"https://images.macrumors.com/article-new/2021/09/2022-wagoneer-offroad.jpg\" /><em>Driving the offroad course</em></div>\r\n<br />\r\nThe Wagoneer certainly doesn't come cheap, with the base Series I trim of the Wagoneer coming in at about $58,000 with four-wheel drive and stepping up to the Series III trim at $73,000. The Grand Wagoneer versions start with Series I at $87,000 and go up to the Series III at $104,000 with additional options available beyond that.\r\n<br />\r\n\r\n<br />\r\nAt the low-end, the Wagoneer is intended to compete against popular mainstream large SUVs like the Ford Expedition, while higher-end Grand Wagoneer trims go up against the premium large SUV segment with vehicles like the Cadillac Escalade, so there's a wide breadth of features and pricing.\r\n<br />\r\n\r\n<br />\r\nThere's no question that the new Jeep Wagoneer and Grand Wagoneer are on the cutting edge of technology, as is evident in just a glance with the multitude of screens throughout the cabin. Fortunately, most of these screens aren't available to the driver or are used in such a way as to minimize distraction.\r\n<br />\r\n\r\n<br />\r\nThe front passenger screen is a novel way to bring some technology functionality to the traditional \"copilot's seat,\" while Fire TV for Auto on the rear entertainment system finally delivers an experience to rival what you might get on an <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> or a TV.\r\n<br />\r\n\r\n<br />\r\nThe games are rather simplistic and control methods aren't ideal, and I did see a bit of lag here and there with the overall system, but with over-the-air updates I expect things to improve over time. The ability to watch most of your favorite streaming services right on the car's entertainment screens without needing a separate device and cable should make family road trips more fun for everyone.\r\n<br />\r\n\r\n<br />\r\nWireless ‌CarPlay‌ is quickly becoming a table-stakes feature for connectivity in all but the lowest-end vehicles, and the Wagoneer integrates it well. The Uconnect 5 system does a fantastic job of marrying ‌CarPlay‌ to the rest of the vehicle's technology, which is especially important in vehicles like this with advanced technology features you'll likely want to access alongside ‌CarPlay‌.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/wireless-carplay/\">wireless CarPlay</a>, <a href=\"https://www.macrumors.com/guide/jeep/\">Jeep</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/homepod-homekit-carplay-home-auto-technology.193\">HomePod, HomeKit, CarPlay, Home &amp; Auto Technology</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/2022-jeep-wagoneer-carplay/\">Review: 2022 Jeep Wagoneer Offers Wireless CarPlay and Up to Nine Screens</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-2022-jeep-wagoneer-offers-wireless-carplay-and-up-to-nine-screens.2309995/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=KX_fVZtvny8:lvEWL3IYqxU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=KX_fVZtvny8:lvEWL3IYqxU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/KX_fVZtvny8\" />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0f421719249aa91258493788927fb1b203148dd359db84caa89842e26e4bbef7","category":"Apple"}