{"title":"0252 | ปี 2022 ลง Linux Server ตัวไหนดี…","link":"https://www.icez.net/blog/167486/0252-linux-server-distro-selection","date":1644134831000,"content":"<h1>สาย Redhat</h1>\n<h2>RHEL/CentOS 6</h2>\n<ul>\n<li>หมดอายุไปสองปีแล้ว</li>\n<li>ถ้ายังมีอยู่ หาทาง migrate ไปใช้ตัวอื่นด้านล่างเถอะ</li>\n</ul>\n<h2>RHEL/CentOS 7</h2>\n<ul>\n<li>เปิดตัวครั้งแรก ปี 2014</li>\n<li>จะหมดอายุ และไม่มี security update อะไรอีกในปี 2024 (อีก 2 ปี)</li>\n</ul>\n<h2>CentOS 8</h2>\n<ul>\n<li>เปิดตัวครั้งแรกปี 2019</li>\n<li>หมายถึงเฉพาะ CentOS 8 เท่านั้น ไม่รวม RHEL 8 หรือ CentOS 8 Stream</li>\n<li>หมดอายุ (EOL) ไปแล้ว เนื่องจากการเปลี่ยนนโยบายของ RedHat ย้ายไป CentOS 8 Stream แทน ซึ่งเป็นคนละตัวกัน</li>\n<li>ตัวเลือกทดแทนที่เทียบเท่ากันเป๊ะคือ AlmaLinux / RockyLinux / Oracle Linux</li>\n</ul>\n<h2>RHEL8 / AlmaLinux 8 / RockyLinux 8 / Oracle Linux 8 / ….</h2>\n<ul>\n<li>ในรายการนี้เทียบเท่ากันหมด คือ RHEL build มาจาก CentOS 8 Stream แล้วตัวที่เหลือดึง Source จาก RHEL 8 ไปออกเป็นชื่อตัวเองต่อ</li>\n<li>RockyLinux 8 เกิดจากคนทำ CentOS คนแรกมาตั้ง ส่วนใหญ่ก็น่าจะย้ายมาใช้ทางนี้</li>\n<li>Software เข้ากันเกือบทั้งหมด คือถ้าบอกว่าลงใน RHEL8 ได้ก็แปลว่าใช้งานใน Distro ใกล้เคียงใน list นี้ได้เหมือนกันหมด</li>\n<li>“คาดว่า” จะ support ไปได้ถึงปี 2029</li>\n</ul>\n<h2>สรุปสาย RedHat</h2>\n<ul>\n<li>เหมาะกับคนที่ลงทีเดียวแล้วใช้ยาวๆ ไม่อยาก upgrade ไม่ต้องการ feature ใหม่ และรับได้กับการต้องลงใหม่แล้วย้ายข้อมูลไปทุกครั้งที่จะ upgrade เพราะโอกาสอัพเกรดข้าม major version ได้น้อยมาก</li>\n</ul>\n<h1>สาย Debian</h1>\n<ul>\n<li>ออก version ใหม่ทุกๆ ประมาณ 2 ปีในปีเลขคี่ https://endoflife.software/operating-systems/linux/debian</li>\n<li>Support 2 รุ่นล่าสุดเสมอ หลังจากรุ่นใหม่ออก รุ่นที่เก่ากว่า 2 รุ่นล่าสุดจะหมดอายุ</li>\n<li>Upgrade ข้าม major version ได้ยาวๆ ไม่ต้องลงใหม่ (ที่ยืนยันแล้วคือตั้งแต่ debian 6 upgrade ยาวมาจนถึง 11 ได้) แต่อาจต้องแก้ไขการตั้งค่า software บางตัวใหม่ตามการ upgrade software นั้นๆ</li>\n<li>รุ่นปัจจุบันคือ Debian 11 (bullseye) ออกปีที่แล้ว แปลว่า support ถึงแค่ Debian 10 (buster)</li>\n<li>รุ่นเก่ากว่า 2 รุ่นล่าสุดอาจเข้าสถานะ LTS เพิ่มได้ แต่ได้ประมาณ 5-7 ปี</li>\n<li>เหมาะกับคนที่ต้องการความต่อเนื่องในการใช้งาน เปลี่ยนแปลง stack อย่างค่อยเป็นค่อยไป แต่อัพเกรดถี่ๆ เพราะทุกๆ สองปีต้องมานั่ง upgrade ทีนึง — ส่วนใหญ่ก็ใช้งานได้ต่อเนื่อง</li>\n<li>เป็น base distro ให้กับอีกหลายตัว รวมถึงการเอาไปใช้นอกสาย Server อย่างฝั่ง SDN ส่วนมากก็จะใช้ Debian เป็น Base กันเป็นส่วนใหญ่ หัดทีเดียวใช้ได้หมด</li>\n</ul>\n<h1>สาย Ubuntu</h1>\n<ul>\n<li>อายุกี่ปีดูได้จากเลข version เลย เพราะมันคือปี.เดือนที่ออก</li>\n<li>แบ่งเป็น 2 สายคือ LTS กับ Non-LTS แยกได้โดย LTS เป็นรุ่นที่ออกในปีเลขคู่ + เดือน 4 (เช่น 14.04 / 16.04 / 18.04 / 20.04 และกำลังจะออก 22.04)</li>\n<li>รุ่นที่ไม่ใช่ LTS จะมี support แค่ 2 รุ่นล่าสุด ถ้าตอนนี้ก็ 21.10 กับ 21.04 เท่านั้น เก่ากว่านั้นไม่มี support แล้ว</li>\n<li>รุ่นที่เป็น LTS ตอนนี้ support ยาว 10 ปีทั้งหมด แปลว่า 14.04 ก็ยังมี support อยู่… แต่จะลง os อายุ 8 ปีในปีนี้ แล้วใช้ได้อีก 2 ปี (เท่ากับ RHEL/CentOS 7) ก็กระไรอยู่ แนะนำให้ใช้ขั้นต่ำ 18.04</li>\n<li>แต่ upgrade ข้ามมาได้เรื่อยๆ ไม่ค่อยมีปัญหา* เช่น ลง 14.04 ก็อัพเกรดต่อเป็น 16.04 ได้เลยไม่ต้องลงใหม่แล้วย้ายข้อมูล</li>\n<li>เหมาะกับคนที่ต้องการการ support ยาวกว่าปกติ แต่เผื่อช่องหนีให้ตัวเองอัพเกรดได้</li>\n</ul>\n<h1>ทางเลือกอื่นๆ</h1>\n<ul>\n<li>SLES/OpenSUSE: เหมาะกับคนชอบความท้าทาย มั่นใจว่าจะไม่เผลอพิมพ์ชื่อ distro ด้วย key ภาษาไทย</li>\n<li>ArchLinux</li>\n<li>ClearLinux</li>\n<li>*BSD: ไม่ใช่ Linux</li>\n</ul>","author":"icez","siteTitle":"icez network","siteHash":"5f9deb5660f47c4b8baf580eb765815e4a6d536737656e8ab8bde4","entryHash":"0f42640216dd2b1ab0731f3dff80e7c992d23a857eaeda19c474a2","category":"Thai"}