{"title":"Machine Learning-Based Model for Preoperative Assessment and Malignancy Prediction in Patients with Atypia of Unde-termined Significance Nodules","link":"https://www.preprints.org/manuscript/202409.0660/v1","date":1725877787000,"content":"Purpose: This study aimed to investigate useful preoperative clinical and hematologic variables in predicting malignancy in patients with the atypia of undetermined significance (AUS) nodules, and to suggest a machine learning-based prediction model. Methods: We enrolled 280 patients who underwent surgery for the AUS nodules at Wonju Severance Christian Hospital between 2018 and 2022. We evaluated preoperative hematologic indices, including Delta Neutrophil Index (DNI), Neutrophil-to-Lymphocyte Ratio (NLR), and Platelet-to-Lymphocyte Ratio (PLR), as well as preoperatively identifiable clinical variables such as age and sex at diagnosis, history of radiation exposure, familial history of thyroid cancer, primary tumor size, and the 2016 Korean Thyroid Imaging Reporting and Data System (K-TIRADS) classification. Results: A total of 116 patients (41.4%) were finally diagnosed with various types of thyroid malignancy, excluding 32 patients (11.4%) with thyroid cancer incidentally identified. Age at diagnosis (p = 0.012), primary tumor size (p = 0.048), and the K-TIRADS classification (p = 0.003) were independent risk factors to predict the diagnosis of malignancy in patients with AUS nodules younger than 55 years, not in those aged of 55 years or older. Adding the NLR to these risk factors significantly improved the predictability for malignancy in the same patient group (p &lt; 0.001). Conclusions: The inclusion of NLR in the ma-lignancy prediction model enhances the predictive accuracy for malignancy in younger patients with AUS nodules. This finding suggests that incorporating NLR into preoperative assessment could refine management strategies and improve decision-making for surgical interventions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0f4585ea62df1f9fddb8e8d1672632e50dce2e956355db1f978f1b070cc0eff3","category":"Interdisciplinary"}