{"title":"Hydrostatic Pressure as a Tool for the Study of Semiconductor Properties &ndash; an Example of III-V Nitrides","link":"https://www.preprints.org/manuscript/202406.1392/v1","date":1718865051000,"content":"Using the example of III-V nitrides crystallizing in a wurtzite structure (GaN, AlN, InN), this review presents the special role of hydrostatic pressure in studying semiconductor properties. Starting with a brief description of high pressure techniques for growing bulk crystals of nitride compounds, we focus on the use of hydrostatic pressure techniques in both experimental and theoretical investigations of special properties of nitride compounds, their alloys and quantum structures. The band gap pressure coefficient is one of the most important parameters in semiconductor physics. Trends in its behavior in nitride structures, together with trends in pressure-induced phase transitions, are discussed in the context of the behavior of other typical semiconductors. Using InN as an example, the pressure-dependent effects typical of very narrow bandgap materials, such as conduction band filling or effective mass behavior, are described. Interesting aspects of bandgap bowing in In-containing nitride alloys, including pressure and clustering effects, are discussed.Hydrostatic pressure also plays an important role in the study of native defects and impurities, as illustrated by the example of nitride compounds and their quantum structures. Experiments and theoretical studies on this topic are reviewed. Special attention is given to hydrostatic pressure and strain effects in short periods nitride superlattices. The explanation of the discrepancies between theory and experiment in the optical emission and its pressure dependence from InN/GaN superlattices led to the well-documented conclusion that InN growth on the GaN substrate is not possible. The built-in electric field present in InGaN/GaN and AlGaN/GaN heterostructures crystallizing in wurtzite lattice can reach several MV/cm, leading to drastic changes in the physical properties of these structures and related devices. It is shown how hydrostatic pressure modifies these effects and helps to understand their origin.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0f5b689b3f84b0008a19c1e9e7dad54c647ae58caab608264d95eb17d6b7bf75","category":"Interdisciplinary"}