{"title":"First Impressions From New MacBook Pro Owners: Benchmarks, Weight, ProMotion","link":"https://www.macrumors.com/2021/10/26/macbook-pro-owners-first-impressions/","date":1635278458000,"content":"It's officially MacBook Pro launch day, and customers around the world who pre-ordered after last Monday's event are receiving their devices today. We've already <a href=\"https://www.macrumors.com/review/macbook-pro/\">seen reviews</a> of the new MacBook Pro models from media sites, but now first impressions from everyday users are available.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2013/09/macbook-pro-sizes-space-gray.jpg\" />\r\n<br />\r\nNew 14 and 16-inch MacBook Pro owners are sharing their opinions on the <em>MacRumors</em> forums and Reddit, and their insights are useful for those awaiting their own MacBook Pros and for those who are still considering a purchase.\r\n<br />\r\n\r\n<br />\r\n<em>MacRumors</em> reader James C received a 16-inch M1 Pro model with 16GB of memory, which is likely to be a popular configuration. He <a href=\"https://forums.macrumors.com/threads/new-16-m1-pro-mbp-compared-with-m1-mba-2016-mbp-and-2014-imac.2319622/\">ran several benchmarks</a> comparing it to a M1 MacBook Air, a 2014 iMac, and a 2016 MacBook Pro. His results are useful for those who are upgrading from an older machine and want to see the possible gains.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/macrumors-forums-james-c-benchmarks-1.jpg\" />\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/macrumors-forums-james-c-benchmarks-2.jpg\" />\r\n<br />\r\n<em>MacRumors</em> reader Rkuda highlighted <a href=\"https://forums.macrumors.com/threads/first-macbook-pro-orders-arriving-to-customers-in-new-zealand-australia-and-asia.2319339/?post=30512719#post-30512719\">how the Menu Bar works</a> with full screen apps on the new models. On older Macs, the Menu Bar would always pop up when you moused up toward it, but on the new MacBook Pro models, that doesn't happen.\r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>Cool video by Rkuda showing improved menu behavior in full screen on new MacBook Pro. <br /><br />\"I always hated when my cursor got too close to the top of the screen it would constantly shift up and down to show the menubar.\" - Rkuda<a href=\"https://t.co/qa5rotGHDD\">https://t.co/qa5rotGHDD</a> <a href=\"https://t.co/HQcLTYfMOx\">pic.twitter.com/HQcLTYfMOx</a></p>— MacRumors.com (@MacRumors) <a href=\"https://twitter.com/MacRumors/status/1452807968442011648?ref_src=twsrc%5Etfw\">October 26, 2021</a></blockquote> </div>\r\n<br />\r\nFor those curious about the weight of the new machines compared to older models, <em>MacRumors</em> forum members <a href=\"https://forums.macrumors.com/threads/for-the-16-crowd-hows-the-weight-too-much-fine.2319601/\">are discussing the differences</a>. GrindedDown <a href=\"https://forums.macrumors.com/threads/for-the-16-crowd-hows-the-weight-too-much-fine.2319601/post-30518901\">gave a good overview</a> and said that the weight is more manageable than you might think.<blockquote>For as big as it is, I was actually shocked at the weight picking it up just now. It's way more manageable than a lot of people seem to be making it out to be. If portability is a high, high priority for you, the 14 is great. The 16 is still plenty portable and because my highest priority is having an optimized workstation laptop for video production, the 16 fits the bill. I'll take the added weight and slightly less portability, for bigger screen, better battery, high power mode and more.</blockquote>Some readers have been <a href=\"https://forums.macrumors.com/threads/new-m1-max-16-pro-motion-is-bad-also-sound-isnt-as-good.2319607/\">discussing the ProMotion feature</a> of the mini-LED displays on the new MacBook Pro models. Kylo83 said that the ProMotion feature is \"really bad\" and scrolling in Safari is more choppy than it was on his older 16-inch machine.<blockquote>Just got the 16 M1 max model and the pro motion is really bad, it's good on the ui like swiping pages but on safari it's actually more choppy than my old 16\" i9 also the speakers are not as loud as the older MacBook Pro and it doesn't sound better if anything the highs are better on the last model, also the display is the exact same brightness than the 2019 MacBook and using 4k hdr on YouTube it's only slightly better, so to be honest everything apple said about it is minor I expected a big change with the display but it's just not there; anyone have any views on this</blockquote>Other readers have also said that there are issues with lag in Safari, so this could be a bug that will be addressed in the future. Still other MacBook Pro owners have had no complaints about the display and the ProMotion.\r\n<br />\r\n\r\n<br />\r\n<em>MacRumors</em> reader LFC2020, who was one of the first to get the new machines in Australia, said that ProMotion is <a href=\"https://forums.macrumors.com/threads/macbook-pros-14-inch-and-16-inch-pre-orders-orders-and-delivery-status-thread-usa-other-countries-2021.2315434/post-30519352\">not as noticeable</a> on the MacBook Pro as it is on the iPhone and the iPad, and that the mini-LED screen is \"not as good\" as the display from the iPad Pro. He also said that the battery life is \"awesome\" and that overall, it's a great machine.\r\n<br />\r\n\r\n<br />\r\n<em>MacRumors</em> reader Prism, who upgraded <a href=\"https://forums.macrumors.com/threads/my-first-impressions-with-the-mbp14-entry-config.2319598/post-30518724\">from a 2020 MacBook Air</a> with an Intel Core i5 chip, said that the new 14-inch model is \"simply night and day\" when it comes to responsiveness, display, look, and feel.\r\n<br />\r\n<blockquote>I am coming from a 2020 MBA intel i5 and I have to say that responsiveness, display, look and feel are simply day and night.\r\n<br />\r\n\r\n<br />\r\nI am so impressed by the build quality of this \"tank\" and I am so happy to have chosen silver as it contrasts beautifully with the black keyboard and apple logo! I am also glad of not having purchased the M1 MBA or MBP of last year, I would have felt terrible right about now! All this to say that I am in my element, a happy camper, this machine has pretty much everything I was dreaming of which is why I say good riddance to Jonny Ive, you certainly won't be missed</blockquote>Over on Reddit, the-cats-pajamas said that the biggest standout on the new MacBook Pro <a href=\"https://www.reddit.com/r/macbookpro/comments/qfuln5/new_16_mbp_next_to_my_trusty_old_mid2012_just_a/hi288g9/?context=3\">is the display</a>.<blockquote>The biggest standout so far is the display, I have an LG C8 OLED TV and this easily tops it when it comes to colours and contrast. Using the mouse on the 2012 60hz display almost feels laggy now. Most of my usage has been installing software at this point so I don't have much to talk about performance wise yet, but with regards to the basic user experience it's been nothing but smooth, responsive sailing so far.</blockquote>Do you have a new MacBook Pro? Let us know your thoughts and first impressions in the comments below.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">14 &amp; 16\" MacBook Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_16\">14\" &amp; 16\" MacBook Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macbook-pro.90\">MacBook Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/26/macbook-pro-owners-first-impressions/\">First Impressions From New MacBook Pro Owners: Benchmarks, Weight, ProMotion</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/first-impressions-from-new-macbook-pro-owners-benchmarks-weight-promotion.2319635/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=fHYYi0XYsVU:OLdTahT9mEI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=fHYYi0XYsVU:OLdTahT9mEI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/fHYYi0XYsVU\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0f63f54348d29a6c107d0327037560d1abb802a4ed9480a8d56eb10d58374a0a","category":"Apple"}