{"title":"Exploring the Adaptation of Native Shrub Species to Different Levels of Shading: Augmenting their Sustainable Exploitation Framework","link":"https://academic.oup.com/forestscience/article/70/4/323/7688424?rss=1","date":1717545600000,"content":"<span><div>Abstract</div>The environmental adaptation potential of regional wild germplasm resources should be investigated in a species-specific manner in terms of the sustainable exploitation of underutilized native species. In the current work, three fruit/ornamental shrub species (<span>Rosa canina</span> L., <span>Sambucus nigra</span> L. and <span>Cornus sanguinea</span> L.) originating from regional wild germplasm of Greece with a previously set domestication framework have been investigated in terms of their environmental adaptation to different levels of shading. To this end, targeted experimentation was conducted on ex situ adapted material by applying different shading levels (0%, 30% and 60% shading) in purpose-built netting tunnels. <span>Rosa canina</span> showed similar growth patterns among the shading levels applied but with increased chlorophyll fluorescence patterns and increased abaxial leaf stomatal density with increased shading. <span>Sambucus nigra</span> showed similar results to <span>R. canina</span> in photosynthetic efficiency and leaf stomatal density but with additional effects on plant growth patterns. <span>Cornus sanguinea</span>, on the other hand, was not affected by shading level in the measured parameters. These results outline the adaptation potential in a species-specific manner of the studied species to shading in terms of adding novel exploitation options for agroecosystems, agroforestry, and landscape management in peri-urban green spaces and peri-urban forest understory enrichment to mitigate climate change impacts in temperate and semi-arid climates.<strong>Study Implications</strong>: This study explores the adaptation potential to increasing levels of shading of ex situ adapted germplasm of wild origin of three underutilized shrub species with known multifaceted value. The work builds on the sustainable utilization framework of the focal species in terms of novel exploitation options in landscape management for peri-urban green spaces and peri-urban forest understory enrichment for enhancing biodiversity and soil erosion protection. Therefore, this work offers an example of an underlying research line towards systematized screening and utilization of wild plant species for climate change impact mitigation in agroecosystems, agroforestry, and landscape management in temperate semi-arid climates.</span>","author":"","siteTitle":"Forest Science Current Issue","siteHash":"05e2fee9ae6a27cd288c89ae75adf607539d339849a171c4fab1eaa2f11b4162","entryHash":"0f7275f2a7338063c4e4de8ff6ff59c17bc75c46591f6eafbc55f99d4639385b","category":"Environment"}