{"title":"Kuo: Apple Watch Series 7 to Ship Later This Month After Production Issues Fixed","link":"https://www.macrumors.com/2021/09/10/kuo-apple-watch-series-7-ship-late-sept/","date":1631255992000,"content":"Apple has resolved its <a href=\"https://www.macrumors.com/guide/apple-watch-series-7/\">Apple Watch Series 7</a> production issues and will start mass producing the new model in mid to late September, with a launch later the same month still on schedule, according to a new investor note by analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> seen by <em>MacRumors</em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/Apple-Watch-7-Unreleased-Feature-Flat-red.jpg\" /><blockquote>The production issue of the Apple Watch 7 is mainly related to the panel side. However, it has been resolved, and mass production of panel modules will begin in mid-September.</blockquote>The ‌Apple Watch Series 7‌ will feature a new design with a flat-edged look that's similar to the flat edges used for the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> and <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>. According to Kuo, the new Apple Watch had to go through more production processes than previous models because of this \"dramatic\" change in the design. \r\n<br />\r\n\r\n<br />\r\nSpecifically, the new more durable display panel uses a contact design instead of the old cable design, and also requires a low injection pressure overmolding (LIPO) process for the first time. Apple is also using a new OLED production line that can improve efficiency and reduce panel costs, but that required new suppliers like LGF, Young Poong, and Jabil to come on board, which in itself could have contributed to the delays. \r\n<br />\r\n<blockquote>Due to the adoption of many new panel-related production processes for the first time, the Apple Watch 7 panel module encountered reliability issues during the risk-ramp phase before Jabil started mass production, mainly including blinking panel and touch insensitivity. This complicated production issue may be related to LGD, Jabil, or Young Poong.</blockquote>The good news is Apple has solved the panel module reliability issues by going through different designs of experiments (DOE) to find the best production configuration and adjusting the qualification standards on the panel and assembly sides.\r\n<br />\r\n\r\n<br />\r\n\"We expect Jabil to start mass production of Apple Watch 7 panel modules in mid-September,\" said Kuo in the note. Based on this new schedule, the analyst says the end product will start mass shipments in late September.\r\n<br />\r\n\r\n<br />\r\nBoth <em>Nikkei Asia</em> and <em>Bloomberg</em> previously reported that <a href=\"https://www.macrumors.com/2021/08/31/apple-watch-series-7-production-delay/\">production issues</a> due to the more complicated design meant the launch of the ‌Apple Watch Series 7‌ was likely to be delayed. Separately, <em>Bloomberg</em> journalist Mark Gurman recently reported that the device could be available in <a href=\"https://www.macrumors.com/2021/09/06/apple-watch-series-7-limited-quantities-launch/\">limited quantities</a> at launch. Gurman reiterated has this in a <a href=\"https://twitter.com/markgurman/status/1436226530598817815\">tweet</a> following Kuo's latest investor note.\r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>On Watch 7 from last weekend: “We’ll see an announcement during the usual September event alongside the iPhone, but there will be a mix of the models shipping late or in small quantities.” <a href=\"https://t.co/xkvN14Mv3O\">https://t.co/xkvN14Mv3O</a></p>— Mark Gurman (@markgurman) <a href=\"https://twitter.com/markgurman/status/1436226530598817815?ref_src=twsrc%5Etfw\">September 10, 2021</a></blockquote> </div>\r\n<br />\r\nIn his note, Kuo also mentions his optimism for 2022 Apple Watch shipments, due to the Series 8 offering \"new health management features (e.g., temperature measurement, etc.)\" – a reference to the recently reported thermometer function that Apple is said to be considering adding to the device <a href=\"https://www.macrumors.com/2021/09/01/multiple-new-apple-watch-health-features/\">as soon as next year</a>.\r\n<br />\r\n\r\n<br />\r\nApple plans to unveil the redesigned watch alongside its new <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> lineup at next week's digital-only event on Tuesday, September 14. We have a full rundown on everything that we expect to see from the ‌Apple Watch Series 7‌ in our <a href=\"https://www.macrumors.com/guide/apple-watch-series-7/\">dedicated guide</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Don't Buy)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/10/kuo-apple-watch-series-7-ship-late-sept/\">Kuo: Apple Watch Series 7 to Ship Later This Month After Production Issues Fixed</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/kuo-apple-watch-series-7-to-ship-later-this-month-after-production-issues-fixed.2310246/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0nZ5hdBbzYA:_BiCUIV7sTI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0nZ5hdBbzYA:_BiCUIV7sTI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/0nZ5hdBbzYA\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0f7499af79538c87612117947f19ea2ccc5d453bfc8024c72fb2579cfb1b0b7d","category":"Apple"}