{"title":"Apple’s $3,499 Vision Pro will hit stores on February 2—with a free Polishing Cloth","link":"https://www.macworld.com/article/2194939/apples-3499-vision-pro-will-hit-stores-on-february-2-with-a-free-polishing-cloth.html","date":1704726506000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple has announced that the <a href=\"https://www.macworld.com/article/557878/apple-vision-pro-release-date-headset-specs-price.html\">Vision Pro headset</a>, that was unveiled in June at WWDC, will be <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2024/01/apple-vision-pro-available-in-the-us-on-february-2/&amp;xcust=1-1-2194939-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">available to preorder</a> on Friday, January 19 before hitting stores on Friday, February 2. The headset costs $3,499 and will be available exclusively in the U.S. through Apple’s online and retail stores.</p>\n\n\n\n<p>The announcement likely means Apple won’t hold an event to officially launch the device. The press release contains several pieces of new information that answer many of the questions we had about the device:</p>\n\n\n\n<ul>\n<li>The ZEISS Optical Inserts will cost $99 for “readers” and $149 for prescription lenses.</li>\n\n\n\n<li>Vision Pro will come with two head straps, a Solo Knit Band that attaches around the back of the user’s head and an optional Dual Loop Band that goes around the head.</li>\n\n\n\n<li>VisonOS supports more than 250 titles on Apple Arcade, movies and TV shows from Apple TV+, Disney+, Max, and other services, new interactive experiences like Encounter Dinosaurs, and “key productivity and collaboration apps” including Fantastical, Freeform, JigSpace, Microsoft 365, and Slack.</li>\n\n\n\n<li>Vision Pro has support for “popular game controllers” for games like NBA 2K24 Arcade Edition and Sonic Dream Team. Some games, including Game Room, What the Golf?, and Super Fruit Ninja will include new “spatial” versions that “transform the space around players, offering unique and engaging gameplay experiences.”</li>\n\n\n\n<li>Each Vision Pro comes with two Light Seal cushions and will be available in “a range of shapes and sizes.”</li>\n\n\n\n<li>In addition to the extra Light Seal, the Vision Pro also includes an Apple Vision Pro Cover for the front of the device, a battery, a USB-C charging cable and power adapter, and a polishing cloth, which Apple sells for $19. Apple doesn’t say what an extra battery costs or how long it can power the device.</li>\n\n\n\n<li>Apple didn’t announce anything about Vision Pro launching in other countries. It originally said Vision Pro would be launching outside the U.S. later in 2024.</li>\n</ul>\n\n\n\n<p>Apple hasn’t updated its Vision Pro site with tech specs, so we don’t yet know how much the device weighs. A banner on its home page touts the beginning of “the era of spatial computing.” </p>\n\n\n\n<p>We run through everything you need to know in our <a href=\"https://www.macworld.com/article/557878/apple-vision-pro-release-date-headset-specs-price.html\">Guide to Apple’s Vision Pro headset</a>. </p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0f7c0314b876249168e3bb9a43941dbee84f04d2475f34d2f8ec934401f1b066","category":"Apple"}