{"title":"ProLid is the Kid-Specific Helmet with the Reversible Brim","link":"https://bikerumor.com/prolids-kid-helmet/","date":1680703231000,"content":"<p>Here’s a universal truth, if ever there was one: kids don’t want to wear helmets. </p>\n\n\n\n<p>But if there’s anyone who <em>needs</em> to be wearing a <a href=\"https://bikerumor.com/lazer-red-bull-helmet/\" target=\"_blank\">helmet</a>, it’s a 10-year-old in possession of a hastily built backyard ramp and an undeveloped prefrontal cortex. The newly launched helmet company ProLids hopes to help with this conundrum. </p>\n\n\n\n<p>ProLids’ theory is that if helmets don’t look quite so dorky, kids might be more prone to wear them. To that effect, the brand designed a helmet with a removable, reversible brim to mimic a hat-like appearance. The helmet ships with three interchangeable brim styles. With options to attach the brims to the front and back, that means there are six ways to wear the helmet.</p>\n\n\n\n<figure><a href=\"https://bikerumor.com/wp-content/uploads/2023/03/ProLid-Helmet-1.jpg\"><img width=\"800\" height=\"800\" src=\"https://bikerumor.com/wp-content/uploads/2023/03/ProLid-Helmet-1.jpg\" alt srcset=\"https://bikerumor.com/wp-content/uploads/2023/03/ProLid-Helmet-1.jpg 800w, https://bikerumor.com/wp-content/uploads/2023/03/ProLid-Helmet-1-297x297.jpg 297w, https://bikerumor.com/wp-content/uploads/2023/03/ProLid-Helmet-1-120x120.jpg 120w, https://bikerumor.com/wp-content/uploads/2023/03/ProLid-Helmet-1-768x768.jpg 768w\" /></a><figcaption>The ProLid ships with a “lid” and three interchangeable brims that can be worn backwards or forwards. </figcaption></figure>\n\n\n\n<p>“I have dealt with the fallout from a childhood head injury for most of my life,” ProLids founder Brett Baker wrote in a press release. “My main goal in starting ProLids is to help prevent today’s kids from having to go through the same experience. To do that, we had to design a helmet that was safe, and that looked cool enough for kids to want to wear it.”</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>The Oklahoma-based brand also plans to donate ProLids helmets to organizations that promote bicycle safety to children, starting with <a href=\"https://bikeclubtulsa.com/\" target=\"_blank\">Bike Club Tulsa</a>. </p>\n\n\n\n<p>The CPSC-certified helmets fit individuals eight and up, “as well as small to medium adults.” The “lid” and three brims are available directly from ProLids or through participating retailers for MSRP $60. Replacement brims are also available. </p>\n\n\n\n<p><a href=\"https://prolids.com/\" target=\"_blank\"><em>prolids.com</em></a></p>\n<p>The post <a href=\"https://bikerumor.com/prolids-kid-helmet/\">ProLid is the Kid-Specific Helmet with the Reversible Brim</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Andrew Marshall","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"0f8ecf638f05869d8ac8fc78f59551ac9c686c160613d61d54f0b4f2ebedb073","category":"Cycling"}