{"title":"Researchers Develop New Tactile Technology That Could Enable a Pop-Up Keyboard on a Flat Smartphone Display","link":"https://www.macrumors.com/2023/04/27/pop-up-keyboard-display-technology/","date":1682637120000,"content":"Researchers in the Future Interfaces Group at Carnegie Mellon this week highlighted a breakthrough in display technology that could make future screens more tactile through raised haptics. As noted by <em><a href=\"https://techcrunch.com/2023/04/27/tactile-push-notifications/\">TechCrunch</a></em>, the Future Interfaces Group shared a video and a <a href=\"https://drive.google.com/file/d/1--KfMTvkerE1dZxiXC6Uf-zRVMtbA6YY/view?pli=1\">research paper</a> demonstrating a display that can grow small, physical bumps that can be felt under the fingers.\r<br />\n\r<br />\n<div></div>\r<br />\nThe technology could be used for tactile notifications, a pop-up keyboard that feels different under the fingers than the standard screen, buttons that remain inflated until pressed, pop-up custom-shaped buttons for controlling system functions, and more. One of the concepts demonstrated includes a pop-up music interface that displays raised music controls for playback, while another features a button on a smartphone that pulses up and down until it's pressed.\r<br />\n\r<br />\nResearchers developed a flat panel that's using miniaturized hydraulic pumps to raise the surface through fluid. Each pump is individually controllable and can be activated separately to create dynamic, tactile bumps in a compact form factor.\r<br />\n\r<br />\nThe hardware is self-contained, lightweight, relatively slim at 5mm, and able to withstand the force of a normal touchscreen interaction.\r<br />\n\r<br />\nAt the current time, this is emergent technology that's owned by Carnegie Mellon, but it isn't hard to imagine future smartphones that use this kind of functionality. Apple has adopted haptic vibrations for touch-based feedback that's used for notifications and other system feedback, but raised haptics would add another dimension to the display.\r<br />\n\r<br />\nApple could use this kind of technology for a device that folds flat but has a pop-out keyboard when in use, plus there are likely multiple accessibility use cases for those who have sight problems. It's impossible to say whether this is functionality that we will see in Apple devices in the future, but it is an interesting concept.<br />This article, \"<a href=\"https://www.macrumors.com/2023/04/27/pop-up-keyboard-display-technology/\">Researchers Develop New Tactile Technology That Could Enable a Pop-Up Keyboard on a Flat Smartphone Display</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/researchers-develop-new-tactile-technology-that-could-enable-a-pop-up-keyboard-on-a-flat-smartphone-display.2388015/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"0f94689f8629003194e9da559f965519a9e8be8f52ee35b9621c87f597661557","category":"Apple"}