{"title":"How to bleed Shimano disc brakes","link":"https://www.bikeradar.com/advice/workshop/how-to-bleed-shimano-disc-brakes/","date":1680530400000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2018/08/7RA7461-dc449dd.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2018/08/7RA7461-dc449dd.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2018/08/7RA7461-dc449dd.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2018/08/7RA7461-dc449dd.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2018/08/7RA7461-dc449dd.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2018/08/7RA7461-dc449dd.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2018/08/7RA7461-dc449dd.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2018/08/7RA7461-dc449dd.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2018/08/7RA7461-dc449dd.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2018/08/7RA7461-dc449dd.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Oscar Huckle bleeding a Shimano brake\" title=\"Oscar Huckle bleeding a Shimano brake\" />                                            <p>If the hydraulic disc brakes on your bike are feeling spongy at the lever or lack power, it may be a sign they need to be bled.</p>\n<p>Brake bleeding is the process of removing any bubbles of air from a hydraulic system and replacing old <a href=\"https://www.bikeradar.com/advice/buyers-guides/brake-fluid-mineral-oil-vs-dot/\">brake fluid</a>.</p>\n<p>Over time, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-disc-brakes/\">hydraulic disc brake</a> systems take in air, affecting performance and lever feel.</p>\n<p>Even if the brakes don’t feel spongy, it’s worth bleeding your brakes annually so the fluid is kept fresh.</p>\n<p>In this guide, we’ll take you through the bleed process. We’ve also included a guide to burp-bleeding, which is effectively a shorter version of the bleed process. This might work as a half-way house solution if the system was recently fully bled or if you’ve shortened the hose on your bike.</p>\n<h2>How to bleed Shimano disc brakes</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Brake bleeding is the process of flushing out any old brake fluid and air bubbles from the system.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>This guide follows Shimano’s official method for 12-speed drop-bar hydraulic disc brakes, with a few small tips and tricks to improve the quality and ease of the bleed.</p>\n<p>The bleeding process is largely identical to all other modern Shimano disc brake systems, including flat-bar mountain bike brakes.</p>\n<p>The levers need to be rotated to certain angles (this is referred to as ‘burp positions’) during different points of the bleed process. These positions differ across levers. You can check the specific positions required for your lever on Shimano’s technical documentation.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Only use genuine Shimano mineral oil.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Shimano brakes use mineral oil. Because mineral oil is not regulated, we recommend you use genuine Shimano brake fluid for the best performance.</p>\n<p>Do not use DOT fluid or use a bleed kit that was used previously with a different fluid. Using the wrong fluid can destroy the seals and lead to brake failure.</p>\n<h3>Tools required</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A Shimano bleed kit will include most of the tools required for the job.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<ul><li>Isopropyl alcohol</li>\n<li>Safety glasses and protective gloves</li>\n<li>Shop towel/rags</li>\n<li>Shimano mineral oil</li>\n<li>Hex keys (2/2.5mm for bleed port screw, 3mm or flat-blade screwdriver to remove disc brake pads)</li>\n<li>7mm open-ended spanner for caliper syringe</li>\n<li>Torque wrench and relevant sockets (optional)</li>\n<li>Bleed block</li>\n<li>Piston press (or a plastic tyre lever)</li>\n<li>A Shimano-compatible bleed kit</li>\n<li>Oil-collecting bottle or bag (may come as part of kit)</li>\n</ul><h4>Step 1</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Keep the disc brake pads safe and free from contaminants.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Remove the wheel and the <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-pads/\">disc brake pads</a>.</p>\n<p>When removing the pads, make sure you only handle them on the backing plate to reduce the risk of contamination. It’s also worth giving the caliper a clean to reduce the risk of contamination.</p>\n<p>If your brake has free stroke adjustment, make sure it is wound fully out and the lever reach returned to its original position.</p>\n<h4>Step 2</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Push the pistons back.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Push the caliper pistons back using a piston press or plastic <a href=\"https://www.bikeradar.com/features/6-of-the-best-tyre-levers/\">tyre lever</a> and install a compatible bleed block, reusing the pad retaining bolt. If the bleed block doesn’t fit, the pistons are not pushed back completely. It may also be the system was overfilled previously.</p>\n<p>Take care when pushing the pistons back, particularly with the ceramic pistons found on high-end Shimano brakes – these can crack easily.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Bleed blocks come in all shapes and sizes.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>If you are bleeding the rear caliper, although not essential, you could consider removing it from the frame and letting it dangle vertically. This is so the caliper becomes the lowest part of the system and provides a cleaner path for any bubbles to escape.</p>\n<p>Pull on the brake lever 10 times to stabilise the piston position.</p>\n<h4>Step 3</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> There’ll be a bleed port screw somewhere on the shifter body, but its location can differ across Shimano’s shifters.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>If you’re working on a drop-bar shifter, peel back the rubber hood. Rotate the bike on the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-repair-stand/\">repair stand</a> or the handlebar so the bleed screw is parallel with the ground and the highest part of the system.</p>\n<p>This is important so the master cylinder is parallel and air can move into the funnel.</p>\n<p>If you’re working on a flat-bar brake lever, reposition the brake lever so the bleed port is the highest part of the brake system.</p>\n<h4>Step 4</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The task can very quickly go south if you round off this soft bolt.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Remove the bleed screw, making sure the O-ring comes out with it, and install the bleed kit funnel.</p>\n<p>On some shifters, you may need to use an adaptor to attach the bleed funnel. Remove the plunger.</p>\n<p>The <a href=\"https://www.bikeradar.com/features/bleed-screw-y0mx98020/\">bleed port screws</a> are so soft they feel as if they’re made of chocolate and very easy to accidentally round. Make sure you use a good quality <a href=\"https://www.bikeradar.com/features/allen-keys-everything-you-need-to-know/\">Allen key</a> and avoid using the ball-end to undo it.</p>\n<p>You should also take caution when installing the bleed funnel into the threads because they too are easy to strip.</p>\n<h4>Step 5</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> By holding the syringe vertically, the bubbles will rise to the top.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Prepare a syringe full of mineral oil.</p>\n<p>Make sure you eliminate any air bubbles to avoid introducing air into the system. Hold the syringe vertically and plunge to remove the bubbles, holding a rag over the top to catch any oil.</p>\n<h4>Step 6</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The latest Shimano calipers feature a separate bleed boss and port.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Undo the caliper bleed port screw and attach the syringe.</p>\n<p>On Shimano’s 12-speed road calipers, you’ll first need to remove the bleed boss cap and bleed screw cap. Connect the syringe to the bleed boss and loosen the bleed screw by half a turn.</p>\n<p>Other calipers feature a ‘nipple cap’. Remove the cap, position a 7mm spanner over the bleed screw and then attach the hose. This screw only requires loosening by a quarter-turn.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Some kits come with a ‘hose clip’ to keep it attached to the caliper.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>If you aren’t using a bleed kit with Shimano’s latest hose-end fitting, the older hose won’t have the most stable connection with the caliper. Some kits also include ‘hose clips’ you can position over the hose at its connection, otherwise keep one hand on the hose to keep it in place.</p>\n<h4>Step 7</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Push the oil into the caliper.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Slowly push the fresh oil into the caliper. Watch the oil come into the funnel and stop pushing once you see air bubbles coming through.</p>\n<p>If it’s difficult to push the oil through the system, the caliper bleed screw isn’t undone enough.</p>\n<p>If the old fluid is discoloured, you’ll need to discard it and refill the syringe with new fluid until the fluid coming out of the funnel is no longer discoloured.</p>\n<p>Once there are no more air bubbles coming into the funnel, close the caliper bleed screw and pull the brake lever ten times.</p>\n<h4>Step 8</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Adjust the bleed funnel to the next position.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Now place the lever so the top of the funnel is 20 degrees to the ground. This helps move trapped air from the reservoir to the funnel.</p>\n<p>Actuate the levers slowly and stop operating when you no longer see air bubbles coming through into the funnel.</p>\n<h4>Step 9</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> If the syringe isn’t at least half full, lock off the caliper bleed port screw and refill it.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Loosen the caliper bleed scew to reopen the system. Push oil into the caliper a second time – if the syringe is not at least half full, refill it with mineral oil before proceeding.</p>\n<p>Watch the oil come into the funnel and stop pushing when there are no longer any bubbles.</p>\n<p>Close the bleed screw on the caliper and remove the syringe. If you want to avoid the syringe spraying fluid as you remove it, once the bleed screw is closed, gently draw air out of the syringe when removing.</p>\n<h4>Step 10</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The lever should become firm.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Pull on the lever until the actuation becomes firm. If it doesn’t, there is still air in the system. Repeat the above process if this is the case.</p>\n<h4>Step 11</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Let the oil flow into the bag or bottle.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Place the lever so the funnel top is parallel with the ground.</p>\n<p>Attach a bottle or an oil-collecting bag into the caliper bleed port screw and open the system.</p>\n<p>Let oil flow naturally into the bottle or bag. You may need to tap on the shifter, hose and caliper to encourage any rogue air bubbles to move down. Make sure you do not press on the lever.</p>\n<p>Add oil to the funnel as needed so air does not get pulled into the lever.</p>\n<p>Close the caliper bleed screw when you no longer see air bubbles in the caliper and torque to between 4 and 6Nm.</p>\n<h4>Step 12</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> It’s a common sight to see the nipple cap missing when out on the road. Make sure you replace it.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Remove the bottle or bag and clean the caliper with a rag and isopropyl alcohol. Reinstall the bleed boss and bleed screw cap, or the nipple cap if it’s an older caliper.</p>\n<h4>Step 13</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Don’t use the ball-end of the hex key.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Insert the plunger in the funnel and remove it. Install the lever bleed screw. Be very careful because the bolt is easy to round. Shimano recommends a torque of 0.5 to 0.7Nm.</p>\n<p>Clean the shifter with isopropyl alcohol and reinstall the hoods.</p>\n<h4>Step 14</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Reinstall the brake pads and give everything a clean.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Install the brake pads and rear wheel and check your work. You may need to <a href=\"https://www.bikeradar.com/advice/workshop/how-to-silence-disc-brakes/\">realign your brakes</a>.</p>\n<p>It’s worth test-riding the bike in a safe environment before heading out on a ride.</p>\n<p>Finally, make sure you clean the brake bleeding kit thoroughly before putting it away. Remove the hose from the syringe and any adaptors, and clean with isopropyl alcohol.</p>\n<h2>How to burp-bleed Shimano disc brakes</h2>\n<p>If you’ve recently bled your brakes and they feel a little spongy, or if you’ve shortened the hydraulic hose, you could try burp-bleeding the brakes. This is a shorter, less involved process.</p>\n<h3>Tools required</h3>\n<ul><li>Isopropyl alcohol</li>\n<li>Safety glasses and protective gloves</li>\n<li>Shimano mineral oil</li>\n<li>Hex keys</li>\n<li>Shimano bleed funnel</li>\n</ul><h4>Step 1</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Level the bleed port screw.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Make sure the bleed port is parallel to the ground and the highest point in the braking system.</p>\n<p>You can leave the wheel and disc brake pads in for this job, but it’s wise to cover them with a rag and be careful to avoid spilling any fluid.</p>\n<h4>Step 2</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Take care when installing the bleed funnel because the threads are easy to round.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Undo the lever bleed screw and attach the bleed funnel with the plunger installed.</p>\n<h4>Step 3</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Lay the plunger to rest inside the bucket.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Pour a small amount of Shimano mineral oil into the bleed funnel, so it’s around a quarter full. Remove the plunger.</p>\n<h4>Step 4</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Tapping the hose can encourage any rogue air bubbles to find their way to the brake lever.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Pull on the brake lever repeatedly, keeping an eye on the funnel for any bubbles. If there are bubbles, this is a good thing.</p>\n<p>Tap on the caliper, hose and lever to force any rogue air bubbles up the system. You can also rotate the bike on the workstand or the handlebars to encourage any rogue air bubbles up.</p>\n<p>Because we’ve left the brake pads and wheel installed, you’ll know if this process does the job because you should be able to feel an improvement in the lever.</p>\n<h4>Step 5</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> It’s worth persevering for the best result.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Once there are no more bubbles, install the plunger in the bleed funnel.</p>\n<h4>Step 6</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> It’s easy for the O-ring to go walkies – make sure it is installed on the bleed port screw.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Remove the plunger and replace the bleed screw. If the brake still feels spongy, you’ll need to do a full bleed.</p>\n<p>Make sure you clean the bleeding kit thoroughly before putting it away.</p>","author":"Oscar Huckle","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"0f9b258b86e1fb43bf50c97ee9861ac1a871da3044fd999c4daf9000bf0b058d","category":"Cycling"}