{"title":"PSIV-A-1 Comparing early and late spring grazing of cereal rye utilizing a high-density, short-duration grazing system","link":"https://academic.oup.com/jas/article/102/Supplement_2/358/7664849?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to compare forage yield, nutritive value, grazing forage disappearance, in situ dry matter (DM) disappearance, and neutral detergent fiber (NDF) digestibility between late- and early-grazed cereal rye. Cover crop grazing time varies from year to year due to environmental and management conditions. Cereal rye is a high-yielding forage cover crop; however, rye matures quickly and subsequently declines in nutritive value. This experiment was conducted at Western Illinois University Kerr Farm, Macomb, IL. The late-grazed rye was planted October 9, 2020, while the early-grazed rye was planted November 8, 2022. Rye was planted at a rate of 90 kg/ha with a no-till drill following corn harvest. In yr 1, cereal rye was grazed and sampled during anthesis (mid to late May). In yr 2, cereal rye was grazed and sampled during the late boot stage (in mid to late April). A high-density, short-duration grazing system was used in both years. Cow-calf pairs (n = 58 pairs) grazed 0.40-ha plots for 24 h per plot. Plots were randomly sampled in four locations before and after grazing within a 0.40 m<sup>2</sup> forage ring to determine forage nutritive value, height, and yield. All grass within the ring was clipped at approximately 12 cm to mimic grazing. Samples were analyzed at Rock River Laboratories (Watertown, WI) for crude protein (CP), neutral detergent fiber (NDF), acid detergent fiber (ADF), and neutral detergent fiber digestibility (NDFD) at 12, 30, and 48 h. In situ DM disappearance was determined using ruminally cannulated beef heifers. Data were analyzed using the MIXED procedure of SAS 9.4. Early-grazed rye had a greater (<span>P</span> &lt; 0.01) CP and less (<span>P</span> &lt; 0.01) NDF and ADF than late-grazed rye. Accordingly, early-grazed rye had more than 50% greater (<span>P</span> &lt; 0.01) DM disappearance at 24 and 48 h compared with late-grazed rye. Moreover, early-grazed rye had greater (<span>P</span> &lt; 0.01) NDFD at 12, 30, and 48 h. However, late-grazed rye was 108 cm taller (<span>P</span> &lt; 0.01) before grazing and remained 10 cm taller (<span>P</span> = 0.04) than early-grazed rye after grazing. Late-grazed rye yielded (<span>P</span> &lt; 0.01) more DM than early-grazed rye, 3,873 vs. 1,079 kg/ha, respectively. After grazing, more DM (<span>P</span> &lt; 0.01) remained on early-grazed rye plots than late-grazed rye plots, 496 vs. 2,445 kg/ha, respectively. Cows consumed 20% more DM (<span>P</span> = 0.04) of the early-grazed rye compared with late-grazed rye. Overall, an early-grazed rye cover crop was more digestible with a greater nutritive value and resulted in greater grazing consumption using a high-density, short-duration grazing system.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"0f9d6f4ceb54b7c6e192aeae7f7e4c90045fb81e63a121b6e10a8747e5da5b8d","category":"Environment"}