{"title":"Hardware-Efficient Configurable RO-Based PUF/TRNG Module for Secure Key Management","link":"https://www.preprints.org/manuscript/202407.1670/v1","date":1721631687000,"content":"The use of Physical Unclonable Functions (PUFs) linked to the manufacturing process of the electronic devices supporting applications that exchange critical data over the Internet has made these elements essential to guarantee the authenticity of said devices, as well as the confidentiality and integrity of the information they process or transmit. This paper describes the development of a configurable PUF/TRNG module based on Ring Oscillators (ROs) that takes full advantage of the structure of modern programmable devices offered by Xilinx 7 Series families. In this work, the increase in hardware efficiency of the proposed architecture is used with a double objective. On the one hand, perform an exhaustive statistical characterization of the results derived from the exploitation of RO configurability. On the other hand, undertake the development of a new version of the module that requires a smaller amount of resources while considerably increasing the number of output bits compared to other proposals previously reported in the literature. The design as a highly parameterized Intellectual Property (IP) module connectable through a standard interface to a soft- or hard-core general-purpose processor greatly facilitates its integration into embedded solutions, while accelerating the validation and characterization of this element on the same electronic device that implements it. The studies carried out reveal adequate values of reliability, uniqueness and unpredictability when the module acts as a PUF, as well as acceptable levels of randomness and entropy when it acts as a True Random Number Generator (TRNG). They also illustrate the ability to obfuscate and recover identifiers or cryptographic keys of up to 4 096 bits using an implementation of the PUF/TRNG module that requires only a 4×4 CLB array to accommodate the RO bank.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0f9f9dae94cf3ec8e54087c578b6426d27abe4e90e9046abe254b65c5682e798","category":"Interdisciplinary"}