{"title":"Spatiotemporal Assessment Model for Manual Operation Systems' Technical Performance in Surface Water Distribution Under Water Scarcity Scenarios","link":"http://link.springer.com/10.1007/s11269-024-03832-w","date":1722470400000,"content":"<h3>Abstract</h3>\n                    <p>The research presents an innovative and practical technical performance evaluation method to analyze surface water distribution adequacy, equity, efficiency, and dependability across various water scarcity scenarios within an irrigation district (ID). The method uses an integral-delay simulation model to simulate hydraulic flow in main, secondary, and tertiary irrigation canals. The temporal analysis employs three indices: Adequacy, Dependability, and Efficiency, while the Equity of water distribution index is used for spatial analysis of the simulated agricultural water distribution among farmers' cooperatives. The method also uses two commonly used multicriteria decision-making methods, the Analytic Hierarchy Process (AHP) and Shannon Entropy (SE), to develop a Holistic Appraisal Index (HAI) to assess the overall performance of the operational system. The study applies the developed method to the NekooAbad ID in Isfahan, comprising thirteen United Farmers' Cooperative Companies and 149 farmers' cooperatives through secondary and tertiary canals, serving as a case study. The hydraulic flow simulation model has been calibrated and verified based on three operational periods from 2000–2001, 2010–2011, and 2021–2022. Temporal analysis reveals that adequacy decreases and dependability increases downstream in the main and lateral canals. The daily average variability range of the adequacy and dependability indices for surface water distribution ranged from 95–64%, 56–90%, 54–89%, 50–89%, 49–86%, 46–86%, and 77–33% for normal scenarios to water scarcity scenarios of &gt; 10%, 10–15%, 15–20%, 20–30%, 30–40%, and &lt; 40%, respectively. According to the HAI's spatiotemporal evaluation, the reliability of the MOS decreases significantly in water scarcity scenarios. Smart ID managers can use the proposed spatiotemporal performance evaluation approach to identify and prioritize vulnerable areas at risk of surface water distribution failure.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"0fa002d03b07a4eeaec767389734f76057d255dc35792d621c115845255b1419","category":"Environment"}