{"title":"Effect of an algae feed additive on reducing enteric methane emissions from cattle","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae109/7725533?rss=1","date":1722470400000,"content":"<span><div>Abstract</div>Alga 1.0, a product containing bromoform, was fed to cattle to evaluate its effects on methane (<strong>CH</strong><sub><strong>4</strong></sub>) and carbon dioxide (<strong>CO</strong><sub><strong>2</strong></sub>) emissions and diet digestibility. Twelve nonlactating, nonpregnant Jersey cows (490 ± 19 kg body weight) were used in four replicated 3 × 3 Latin squares with three periods, each consisting of 21 d. Cows were blocked by feed intake (averaged intakes over 4 wk prior to trial) and assigned randomly to one of three treatments. Treatments included Alga 1.0 fed at 0, 69, and 103 g/d in a 0.454 kg/d dry matter (<strong>DM</strong>) top-dress daily in a modified distillers grains plus solubles (<strong>MDGS</strong>) carrier. Diet consisted of 60% dry-rolled corn, 20% corn silage, 15% modified distillers grains, and 5% supplement (DM basis). Headbox-style indirect calorimeters were utilized to evaluate gas production from individual cows with two nonconsecutive 23-h collections in each period. Data were analyzed using the GLIMMIX procedure of SAS with cow within square as experimental unit and as a random effect, and treatment and period as fixed effects. Linear and quadratic contrasts were used to compare treatments. Feeding Alga 1.0 linearly reduced dry matter intake (<strong>DMI</strong>, <span>P</span> &lt; 0.01) by 10.1% for 69 g/d inclusion and 13.3% for 103 g/d inclusion compared to the control. Nutrient intakes decreased linearly (<span>P</span> &lt; 0.01) due to lower DMI, but nutrient digestibility was not impacted (<span>P</span> ≥ 0.28). Inclusion of Alga 1.0 did not impact gross energy or digestible energy concentration of the diets expressed as Mcal/kg DM (<span>P</span> ≥ 0.22) but did linearly reduce energy intake (Mcal/d; <span>P</span> &lt; 0.01). Feeding Alga 1.0 linearly reduced enteric CH<sub>4</sub> emissions measured as g/kg DMI (<span>P</span> &lt; 0.01) by 39 and 64% for 69 g/d and 103 g/d inclusion, respectively. Linear reductions (<span>P</span> &lt; 0.01) of 64% to 65% were also observed in enteric CH<sub>4</sub> emissions when expressed per kilogram of DM or organic matter digested. Respired CO<sub>2</sub> as g/d linearly decreased (<span>P</span> = 0.03) for cattle fed Alga 1.0 but did not differ when expressed as g/kg of DMI (<span>P</span> ≥ 0.23). Oxygen consumption did not differ between treatments for g/d and g/kg DMI (<span>P </span>≥ 0.19). In conclusion, feeding Alga 1.0 reduced DMI up to 13.3%, did not impact digestibility, and significantly reduced CH<sub>4</sub> emissions up to 63%.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"0fb25b556e4c2bfb2a63850e13f876757c99a16320673b348cdcfcf77cf02ed9","category":"Environment"}