{"title":"The cysteine-rich receptor-like kinase CRK10 targeted by Coniella diplodiella effector CdE1 contributes to white rot resistance in grapevine","link":"https://academic.oup.com/jxb/article/75/10/3026/7601507?rss=1","date":1707177600000,"content":"<span><div>Abstract</div>Grape white rot is a devastating fungal disease caused by <span>Coniella diplodiella</span>. The pathogen delivers effectors into the host cell that target crucial immune components to facilitate its infection. Here, we examined a secreted effector of <span>C. diplodiella</span>, known as CdE1, which has been found to inhibit Bax-triggered cell death in <span>Nicotiana benthamiana</span> plants. The expression of <span>CdE1</span> was induced at 12–48 h after inoculation with <span>C. diplodiella</span>, and the transient overexpression of <span>CdE1</span> led to increased susceptibility of grapevine to the fungus. Subsequent experiments revealed an interaction between CdE1 and <span>Vitis davidii</span> cysteine-rich receptor-like kinase 10 (VdCRK10) and suppression of VdCRK10-mediated immunity against <span>C. diplodiella</span>, partially by decreasing the accumulation of VdCRK10 protein. Furthermore, our investigation revealed that <span>CRK10</span> expression was significantly higher and was up-regulated in the resistant wild grapevine <span>V. davidii</span> during <span>C. diplodiella</span> infection. The activity of the <span>VdCRK10</span> promoter is induced by <span>C. diplodiella</span> and is higher than that of <span>Vitis vitifera VvCRK10</span>, indicating the involvement of transcriptional regulation in <span>CRK10</span> gene expression. Taken together, our results highlight the potential of <span>VdCRK10</span> as a resistant gene for enhancing white rot resistance in grapevine.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"0fb9187a4791cb8e70e5a1f7be7e38178717bd22ea1cd45081cdab62f1489a85","category":"Environment"}