{"title":"The dimorphic diaspore model Aethionema arabicum (Brassicaceae): Distinct molecular and morphological control of responses to parental and germination temperatures","link":"https://academic.oup.com/plcell/article/36/7/2465/7633287?rss=1","date":1710979200000,"content":"<span><div>Abstract</div>Plants in habitats with unpredictable conditions often have diversified bet-hedging strategies that ensure fitness over a wider range of variable environmental factors. A striking example is the diaspore (seed and fruit) heteromorphism that evolved to maximize species survival in <span>Aethionema arabicum</span> (Brassicaceae) in which external and endogenous triggers allow the production of two distinct diaspores on the same plant. Using this dimorphic diaspore model, we identified contrasting molecular, biophysical, and ecophysiological mechanisms in the germination responses to different temperatures of the mucilaginous seeds (M<sup>+</sup> seed morphs), the dispersed indehiscent fruits (IND fruit morphs), and the bare non-mucilaginous M<sup>−</sup> seeds obtained by pericarp (fruit coat) removal from IND fruits. Large-scale comparative transcriptome and hormone analyses of M<sup>+</sup> seeds, IND fruits, and M<sup>−</sup> seeds provided comprehensive datasets for their distinct thermal responses. Morph-specific differences in co-expressed gene modules in seeds, as well as in seed and pericarp hormone contents, identified a role of the IND pericarp in imposing coat dormancy by generating hypoxia affecting abscisic acid (ABA) sensitivity. This involved expression of morph-specific transcription factors, hypoxia response, and cell wall remodeling genes, as well as altered ABA metabolism, transport, and signaling. Parental temperature affected ABA contents and ABA-related gene expression and altered IND pericarp biomechanical properties. Elucidating the molecular framework underlying the diaspore heteromorphism can provide insight into developmental responses to globally changing temperatures.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"0fbc4a2aa9afcef56548d403feb23556388bccc9eacc16d0f5b4fccf48c51286","category":"Environment"}