{"title":"Bioelement Concentrations in Follicular Fluid and Their Im-pact on In Vitro Fertilization Outcomes","link":"https://www.preprints.org/manuscript/202408.2042/v1","date":1724834793000,"content":"Introduction: The balance of bioelements is crucial as it ensures the organism's homeostasis and proper execution of reactions within the body, nerve conductivity, and correct polarity of cell membranes, but it is also very important for fertility. It is known that disturbances in the balance of bioelements lead to reproductive dysfunction. In women, changes in the composition of follicular fluid can occur, which can lead to limited follicular growth and lack of oocyte activation. Objective: The main objective was to examine whether the concentration of bioelements Na, K, Ca, Mg, and Fe in follicular fluid influences the outcome of the in vitro fertilization process. Methods: The study involved 120 female patients undergoing in vitro fertilization. Follicular fluid obtained after follicle aspiration in the ovaries was used as biological material for analysis. The values of Na (selective electrode method), K (selective electrode method), Ca (arenajo method), Mg (spectrophotometric method), and Fe (colorimetric method) in follicular fluid were determined using the AU 680 apparatus, Beckman Coulter. Istanbul Consensus criteria for clinical embryologists were used to assess embryo quality. Statistical analysis was performed using the SPSS 20 software package. Results: Analysis of follicular fluid samples showed no correlation between the concentration of bioelements in follicular fluid and the quality of oocytes or the outcome of in vitro fertilization. Conclusion: Based on our results, it can be concluded that the concentration of bioelements in follicular fluid does not affect the outcome of in vitro fertilization.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0fbced468053c3881dc52b1e76db54d304ceae1cc4d589e8b58563558151b2a6","category":"Interdisciplinary"}