{"title":"A study of inflammatory biomarkers in crystalline silica exposed rock drillers","link":"http://link.springer.com/10.1007/s00420-024-02070-2","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <span>\n                      <h3>Background</h3>\n                      <p>Crystalline silica (CS) exposure can cause serious lung disease in humans, but mechanisms of pulmonary toxicity have not been completely elucidated.</p>\n                    </span>\n                    <span>\n                      <h3>Aims</h3>\n                      <p>To assess pro-inflammatory and anti-inflammatory biomarkers and biomarkers related to the development of chronic obstructive pulmonary disease and fibrosis in serum of rock drillers exposed to CS.</p>\n                    </span>\n                    <span>\n                      <h3>Methods</h3>\n                      <p>Rock drillers (<em>N</em> = 123) exposed to CS and non-specified particulate matter (PM) were compared to 48 referents without current or past exposure to PM in a cross-sectional study.</p>\n                    </span>\n                    <span>\n                      <h3>Results</h3>\n                      <p>The rock drillers had been exposed to CS for 10.7 years on average. Geometric mean (GM) current exposure was estimated to 36 µg/m<sup>3</sup>. Their GM concentration of matrix metalloproteinase 12 (MMP-12) was significantly higher (16 vs. 13 ng/L; <em>p</em> = 0.04), while interleukin (IL) 6 and IL-8 were significantly lower compared to the referents. Also pentraxin 3 was significantly lower (3558 vs. 4592 ng/L; <em>p</em> = 0.01) in the rock drillers. A dose-response relationship was observed between cumulative exposure to CS and MMP-12, the highest exposed subgroup having significantly higher MMP-12 concentrations than the referents.</p>\n                    </span>\n                    <span>\n                      <h3>Conclusion</h3>\n                      <p>Exposure to CS may increase circulating MMP-12 concentrations in a dose-response related fashion. The results may also suggest a down-regulation of pro-inflammatory pathways.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"0fc09e866742afaf359a665d990be7bc69b98b148d2b30a7c34e1f5dd179e152","category":"Environment"}