{"title":"TIL you can use the iPhone’s camera flash for silent notification alerts","link":"https://www.macworld.com/article/1534598/how-to-camera-flash-led-notifications-accessibility.html","date":1678362300000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>Notifications for phone calls, texts, and alerts may be critical, but sometimes all that buzzing, pinging, and vibrating can be a pain. Conversely, you may be in such a noisy environment that you miss a call or text even with your phone’s ringer at full blast. And constantly checking your screen is not a desirable workaround.</p>\n\n\n\n<p>Recently, I discovered a brilliant solution: my iPhone’s LED camera flash. Even if you never use it when taking photos, there’s a simple setting that lets the flash alert you to notifications instead of a distracting noise or annoying vibration. And it has the added advantage of being viewable when my iPhone is locked and lying face down.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/Camera-Flash-Notifications.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iOS camera flash notification\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/Camera-Flash-Notifications.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Camera-Flash-Notifications.jpg?resize=300%2C160&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Camera-Flash-Notifications.jpg?resize=768%2C410&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Camera-Flash-Notifications.jpg?resize=1200%2C640&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Camera-Flash-Notifications.jpg?resize=1536%2C819&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Camera-Flash-Notifications.jpg?resize=2048%2C1092&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"640\" /></figure><p>Foundry</p></div>\n\n\n\n<p>Setting up LED Flash for Alerts, which is designed for the hearing impaired who struggle with audible alerts, is simple. First, open the Settings app and tap <em>Accessibility</em>. Under the Hearing section, tap <em>Audio/Visual</em> and scroll down to the <em>LED Flash for Alerts</em> control. If it’s off (which it likely is) tap it to access the controls. In the next pane, you’ll see toggles for <em>Flash While Unlocked</em> and <em>Flash in Silent Mode</em>. Flash While Unlocked will let the flash still blink while your phone is unlocked, and Flash in Silent Mode will allow your iPhone to flash even when your device is set to Silent.</p>\n\n\n\n<p>With those controls in place, every time you get a notification, you won’t be able to miss the blinking flash. Note that you can’t pick and choose which notifications get flashed because the feature treats all notifications the same way. If you’re constantly turning off the beeps and buzzes that accompany notifications, it’ll quickly become your favorite new feature (even if it’s about 10 years old). </p>\n\n\n\n<p><em>Today I Learned is a Macworld column that spotlights lesser-known but useful tips and tricks for Apple users. If you have any ideas for future columns, send an email to michael_simon@idg.com.</em></p>\n\niOS, iPad, iPhone</div>","author":"","siteTitle":"Macworld","siteHash":"1fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"0fc8997b736e766e5109a462be73c14e17f985361d1fbbb85c750b","category":"Apple"}