{"title":"Amazon’s plan to avoid lawsuits: Pay customers $1,000 when products injure people","link":"https://arstechnica.com/?p=1786130","date":1628621093000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-amazon-box-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-amazon-box.jpg\">Enlarge</a> (credit: Getty Images | Jorge Villalba)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Amazon today announced a new policy in which it will pay customers up to nearly $1,000 when a third-party product causes property damage or personal injury. Payments of any amount less than $1,000 will be made at no cost to sellers who hold valid insurance, but Amazon said it will also pay customers more than that when a seller refuses a valid claim.</p>\n<p>When \"a defective product sold through Amazon.com causes property damage or personal injury, Amazon will directly pay customers for claims under $1,000—which account for more than 80 percent of cases—at no cost to sellers, and may step in to pay claims for higher amounts if the seller is unresponsive or rejects a claim we believe to be valid,\" <a href=\"https://www.aboutamazon.com/news/how-amazon-works/new-a-to-z-guarantee-better-protects-amazon-customers-and-sellers?tag=wwwfccom-20\">Amazon's announcement said</a>.</p>\n<p>Today's announcement came less than a month after the US Consumer Product Safety Commission (CPSC) <a href=\"https://arstechnica.com/tech-policy/2021/07/amazon-shipped-flammable-kids-sleepwear-and-hair-dryers-that-can-electrocute-you/\">filed a complaint against Amazon</a> over the sale of hundreds of thousands of hazardous products, including carbon monoxide detectors that fail to detect carbon monoxide, hair dryers without required protection from shock and electrocution, and flammable sleepwear meant for children. The CPSC wants Amazon to take more responsibility for dangerous products offered by third parties under the Fulfilled by Amazon (FBA) program, in which Amazon stores products in its warehouses and ships them to customers while taking a cut of the proceeds. As the CPSC noted, people \"who purchase FBA consumer products on amazon.com may reasonably believe they are purchasing the products from Amazon.\"</p></div><p><a href=\"https://arstechnica.com/?p=1786130#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1786130&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0fc8b8e5b8d2fa12310aa50ffaebfad50050baad4d541d9627c51cf5e2a0deb8","category":"Tech"}