{"title":"Investigation of the Possibility of Using Coal Flotation Waste in the Production of Agglomerate","link":"https://www.preprints.org/manuscript/202404.1589/v1","date":1713941916000,"content":"Involving industrial waste into economic circulation, in particular flotation waste from coal enrichment, is an urgent task. The coal preparation waste of ArcelorMittal Temirtau JSC was studied with a view to the possibility of using it as an alternative substitute for coke breeze in the sintering process. During a thermoanalytical study on a synchronous thermal analyzer STA 449 NETZSCH in dynamic mode with a heating rate of 10, 20, 30 °C/min in an air flow of 30 cm3/min in the temperature range 30–1000 °C, we determined the lower heat of combustion of carbon-containing material, change mass during calcination, change and rate of change in the mass of the sample, thermal effect of the process, the temperature of the beginning, end and maximum development of thermal effects. It has been established that the greatest mass loss is observed in the temperature range 580 °C- 610 °C, which is about 65–67% of the total mass of the organic component of coal. The maximum burnout rate corresponds to a temperature of 540–563 °C. The lowest calorific value of the studied waste was 15.9 MJ/kg. The results of thermal analytical research and technical analysis substantiate the possibility of using flotation waste in a mixture of up to 10% with coke breeze for combustion in the sintering layer for the production of sinter. Analysis of the composition of flotation waste showed that they have a high specific surface area (56.8∙103 m2/kg), are highly dispersible, soggy, and capable of swelling, and the predominant amount of clay substance makes them a plastic material. The possibilities of using coal flotation waste as an alternative substitute for coke breeze have been studied after the regimes of its preparation for sintering have been developed and a rational regime of layer-by-layer combustion in the sintering layer has been established. The optimal ratio of coke and OPC in the fuel mixture of the sintering charge was determined.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"0fdaaa47d0f2d46a9177e1146923c3a5a9238b22a6d322f82b33f286a144086d","category":"Interdisciplinary"}