{"title":"Tussles with mussels: mytiloidean phylogeny revisited (Bivalvia: Pteriomorphia)","link":"https://academic.oup.com/mollus/article/doi/10.1093/mollus/eyae039/7808490?rss=1","date":1727913600000,"content":"<span><div>ABSTRACT</div>Our understanding of mytiloid phylogenetic relationships at the suprageneric level is still fragmentary despite previous attempts to make sense of their diverse but nevertheless characteristic body plan. The increasing availability of DNA barcode data for a wide range of mytilid taxa however now offers an unprecedented opportunity to examine their relatedness across the group. Here, we analysed publicly accessible sequences together with data from our own recent work on tropical shallow water marine, estuarine and freshwater species to construct molecular phylogenies involving key genera. Based on the tree topologies obtained from single- and multiple-gene analyses, a revised classification of the extant Mytiloidea is proposed, comprising two families Modiolidae and Mytilidae. This dichotomy is strongly supported in most trees generated. The Modiolidae encompasses mostly smooth-shelled taxa including Modiolinae, Bathymodiolinae, Limnoperninae and Xenostrobinae, together with <span>Leiosolenus, Botula, Ciboticola, Lioberus, Jolya</span> and <span>Modiolula</span>. Interestingly, the excavating <span>Leiosolenus</span> and freshwater Limnoperninae formed a group that is sister to the rest of the modiolid taxa. In contrast, the Mytilidae is a more varied group consisting of a wider range of taxa, amongst which <span>Lithophaga</span> and <span>Dacrydium</span> formed a sister clade to two well-supported clades, associated with the following genera: (1) <span>Austromytilus, Brachidontes, Geukensia, Ischadium, Mytilaster, Mytilisepta, Perumytilus</span> and <span>Semimytilus</span>; and (2) <span>Arcuatula, Byssogerdius, Crenella, Gregariella, Musculus, Mytella, Mytilus, Parabrachidontes, Septifer</span> and <span>Trichomya</span>. The first clade comprised exclusively of ribbed forms, whereas the second included both smooth and ribbed forms. <span>Amygdalum, Aulacomya, Dacrydium, Lithophaga</span> and <span>Urumella</span> were amongst several genera with unstable or uncertain affinities. In a cytochrome <span>c</span> oxidase subunit I tree, <span>Amygdalum</span> and <span>Aulacomya</span> formed a sister clade to the Modiolidae and Mytilidae. Shell morphology and anatomy are discussed in the light of these findings.</span>","author":"","siteTitle":"Journal of Molluscan Studies Current Issue","siteHash":"50e5bd74f9c9bc6ffdefd16d0eef1528d858cc544080b551025ae62157896b1d","entryHash":"0ff281430bb82b88b77b51921164d1651d88d538713efdc1a544c431cd298e2f","category":"Environment"}