{"title":"Planes, trains, but not automobiles—why GM is developing fuel cells","link":"https://arstechnica.com/?p=1775080","date":1624298141000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/GettyImages-504917346-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/GettyImages-504917346.jpg\">Enlarge</a> <span>/</span> Using hydrogen in some of these applications probably makes more sense than building out a network of hydrogen filling stations for passenger cars.  (credit: Scharfsinn86/Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>In just the last week, General Motors signed agreements with not one but two companies to develop applications for its Hydrotec hydrogen fuel cell systems. At first glance, that might seem a little surprising, since last week we also saw <a href=\"https://www.autoweek.com/news/green-cars/a36751587/honda-clarity-fuel-cell-vehicle-discontinued/\">Honda discontinue its hydrogen fuel cell-powered version of the Clarity</a>. That move was just the latest bit of support for the hypothesis that hydrogen power might join Betamax and the Zune in the history books.</p>\n<p>In fact, the history books are where you'll find GM's first hydrogen fuel cell electric vehicle, <a href=\"https://www.gmheritagecenter.com/featured/Fuel_Cell_Vehicles.html\">the 1966 Electrovan</a>. And in recent years we've seen some <a href=\"https://arstechnica.com/cars/2016/10/this-beast-of-a-chevy-colorado-is-hydrogen-powered-will-be-tested-by-the-army/\">fuel cell EVs developed by GM for military applications</a>. But neither of these new deals involves making a hydrogen-powered car.</p>\n<p>Instead, last Tuesday the automaker announced it would work with Wabtec—<a href=\"https://www.greencarcongress.com/2021/05/20210518-wabtech.html\">which has already developed a battery-electric locomotive</a>—to engineer freight locomotives powered by GM's fuel cells and batteries. Then, on Thursday, GM revealed it was working with Liebherr-Aerospace to develop aerospace applications (like auxiliary power generation) for fuel cells. Intrigued, I spoke to Charlie Freese, GM's executive director for Global Hydrotec and the man in charge of GM's fuel cell program. Why does the company still think the lightest gas only has room to expand?</p></div><p><a href=\"https://arstechnica.com/?p=1775080#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1775080&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"0ffc3b7c46859f0753f7ff3d285cc4b06e17a958801829522e8de6e311d02759","category":"Tech"}