{"title":"Healthcare consumers’ perceptions of incentive-linked prescribing: A scoping review","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003026","date":1719496800000,"content":"<p>by Muhammad Naveed Noor, Haider Safdar Abbasi, Nina van Der Mark, Zahida Azizullah, Janice Linton, Afifah Rahman-Shepherd, Amna Rehana Siddiqui, Mishal Sameer Khan, Rumina Hasan, Sadia Shakoor</p>\r\n\r\nIncentive-linked prescribing (ILP) is considered a controversial practice universally. If incentivised, physicians may prioritise meeting pharmaceutical sales targets through prescriptions, rather than considering patients’ health and wellbeing. Despite the potential harms of ILP to patients and important stakeholders in the healthcare system, healthcare consumers (HCCs) which include patients and the general public often have far less awareness about the practice of pharmaceutical incentivisation of physicians. We conducted a scoping review to explore what existing research says about HCCs’ perceptions of the financial relationship between physicians and pharmaceutical companies. To conduct this scoping review, we followed Arksey and O’Malley’s five-stage framework: identifying research questions, identifying relevant studies, selecting eligible studies, data charting, and collating, summarising, and reporting results. We also used the Preferred Reporting Items for Systematic Reviews and Meta-Analyses’ extension for scoping reviews (PRISMA-ScR), as a guide to organise the information in this review. Quantitative and qualitative studies with patients and the general public, published in the English language were identified through searches of Scopus, Medline (OVID), EMBASE (OVID), and Google Scholar. Three themes emerged through the analysis of the 13 eligible studies: understanding of incentivisation, perceptions of hazards linked to ILP, and HCCs’ suggestions to address it. We found documentation that HCCs exhibited a range of knowledge from good to insufficient about the pharmaceutical incentivisation of physicians. HCCs perceived several hazards linked to ILP such as a lack of trust in physicians and the healthcare system, the prescribing of unnecessary medications, and the negative effect on physicians’ reputations in society. In addition to strong regulatory controls, it is critical that physicians self-regulate their behaviour, and publicly disclose if they have any financial ties with pharmaceutical companies. Doing so can contribute to trust between patients and physicians, an important part of patient-focused care and a contributor to user confidence in the wider health system.","author":"Muhammad Naveed Noor","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"0ffd228193789a943bb9b0f07eee17ea2f5e20cb9f9032819fc6236bfa2f70cf","category":"Environment"}