{"title":"Cyclist’s 31 Inspirational Women No16: Emily Chappell","link":"https://www.cyclist.co.uk/sponsored/9306/cyclist-s-31-inspirational-women-no16-emily-chappell","date":1614710884000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/maria-david\">Maria David</a></span>\n      <span class=\"field-item odd\"><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-03-16T11:55:00+00:00\">16 Mar 2021</span></div>    </div></div><p class=\"short-teaser\">\nA Transcontinental winner and ultra-distance athlete who wants others to follow in her wheeltracks</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/03/emily_chappell_please_credit_furtherjournal.jpeg?itok=IvAPoaru\" />  </div>\n<div class=\"field field-name-body\">\n      <p> <a href=\"https://www.cyclist.co.uk/tags/zwift-womens-history-month\"><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/02/31_inspirational_women_clickable_logo_new.jpg\" alt=\"Cyclist's 31 Inspirational Women\" border=\"0\" /></a></p>\n<p><strong>To celebrate International Women's Month, we have partnered with Zwift to tell the stories of 31 inspirational women across 31 days</strong></p>\n<p><strong>Words</strong>: Maria David <strong>Photo</strong>: Further Journal</p>\n<p>In 2016 former bike courier <a href=\"https://www.cyclist.co.uk/authors/emily-chappell\" target=\"_blank\">Emily Chappell</a> hit the headlines when she was the first woman over the line in the Transcontinental Race, a gruelling 4,000km challenge from Geraadsbergen in Belgium to Canakkale in Turkey.</p>\n<p>Having failed to finish her first attempt at the ultra-distance event the year before, Emily was determined to learn from the experience and ride a better race second time around.</p>\n<p>She arrived at the finish nearly two weeks after setting out from Belgium, but nearly two full days before her nearest challenger.</p>\n<p>Her Transcontinental win may rank as her standout success, but Emily has done plenty of other ultra-distance races and tours over the past seven years. Now 39. these days Emily prefers leading groups and motivating people, especially women, to take up ultra-distance cycling. She also writes regularly for <em>Cyclist</em>.</p>\n<p>‘I had always had the ambition to do long-distance cycle touring,’ Emily says. ‘[Fellow ultra-distance cyclist] Juliana Buhring was the main person who wrestled it out of me, and convinced me that this was something I might possibly be capable of doing it.</p>\n<blockquote><p>I was so proud and happy that all these women were about to race the Transcon. For me, getting 30 women to the start line felt much better than me getting to the finish line</p></blockquote>\n<p>‘My first race was the 2015 Transcontinental race, and I was one of three women to enter it that year. We all dropped out, but I wanted to challenge myself and went back the following year.</p>\n<p>‘I didn’t go into the 2016 race thinking that I could win it. I just wanted to push myself and do well. Apart from a couple of Alley Cat events, I didn’t see myself as a racer.</p>\n<p>‘But as I got into the riding during the Transcontinental race, I started to realise I was OK at it, and began to think, “Maybe I am one of the ones who could win.” So I just kept going, and I won!</p>\n<p>‘I had fantasised about winning races, and I thought it would be one of those Hollywood moments. But in fact it was a damp squib. There was just no energy to feel anything, and I just fell apart from being so tired.</p>\n<p>‘Everyone else was going around, saying, “Dude you just won the Transcon!” But I just wasn’t able to emotionally keep up with that, and it felt unsettling. I felt ungrateful saying winning was an anti-climax, but it was.</p>\n<p>‘Then, the following year I entered the Transatlantic Way and the Transcon and dropped out of both races. One of the reasons was because I didn’t feel I had enough incentive to finish.</p>\n<p>‘Racing is great, but because I’d got to the finish of a race and felt a bit “meh”, when things started to get really hard on about day nine of an ultra cycle race, I just didn’t feel like pushing myself to reach that anticlimactic moment. I was thinking, “I’ve got what I came for, I’ve had a great few days on the bike – I think I’ll go home now.”</p>\n<p>‘Riding the Transcon is like this massive hit of capability, power and confidence. And I’d like to bottle that and hand it out. But I can’t, so I just encourage people to do the Transcon and experience it for themselves. After the [2016] race I went on the offensive, encouraging women to do it, as it’s empowering and you can take over the world in any way that you want.</p>\n<p><strong>Find the rest of <a href=\"https://www.cyclist.co.uk/tags/zwift-womens-history-month\"><em>Cyclist's 31 Inspirational Women</em></a> here</strong></p>\n<p>‘In 2017, thirty solo women entered. We had a group photo at the start with all these amazing women. I was so proud and happy that all these women were about to race the Transcon. For me, getting 30 women to the start line felt much better than me getting to the finish line.</p>\n<p>‘I think more women are getting into long-distance bike riding because of representation and role models. Of course, there are people who know what they want and can just get out there and do it, but many people just don’t have that self-knowledge.</p>\n<p>‘If they have never seen a woman doing a long adventurous bike ride, they may not think they can do it. But now many women are even winning races, and it is becoming a normal thing, because they see people they can identify with?</p>\n<p>‘One of my sisters has got into road biking in lockdown and she’s smashing it. She’s more athletic than me, and is enjoying finding her powers.</p>\n<p>‘If she did the Transcon I think she would do well. If she beat me I would be so proud of her – I’d be like, \"Get my sister!\"</p>\n<p>‘In 2015 when I first entered the Transcon I had never met anyone who had done ultra rides. But now most of my friends are female ultra cyclists. It’s amazing.</p>\n<p>‘For me, having people around who have stories you can relate to inspires people to have a go. I have come to realise I am not the only one who goes through periods on the bike where you feel terrible, pathetic, whingy and slow.</p>\n<p>‘I used to feel ashamed of that. But the first time I rode with women who were going through bad patches themselves, I thought, “What, you get that too?”</p>\n<p>‘To any keen cyclists who would like to do long-distance cycling I’d say you’re probably capable of doing a lot more than you’ve done.</p>\n<p>‘Try some audaxes. You can do 150km audaxes or 200km. There’s a generous time cutoff. If you come first no one cares; if you come last no one cares. If you miss the cutoff no one cares.</p>\n<p>‘You won’t get a stamp, but you will still have cake at the end!’</p>\n<p><strong>For more from Zwift this International Women's Month</strong>, <a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5638725484&amp;iu=/359/impcount.co.uk\" target=\"_blank\">visit here</a>. </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/cyclists\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Cyclists</a></div>    </div></div>","author":"mjames","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"0ffdee686f5ba284d4e6509990c784ffcdec4bb25d0f1406f69fc61b951f1516","category":"Cycling"}