{"title":"Trump EPA sidelined its own scientists when rewriting fuel economy rules","link":"https://arstechnica.com/?p=1759134","date":1619034955000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/03/GettyImages-631981142-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/03/GettyImages-631981142.jpg\">Enlarge</a> <span>/</span> Former EPA Administrator Scott Pruitt. (credit: <a href=\"https://www.gettyimages.com/search/photographer?family=editorial&amp;photographer=Aaron+P.+Bernstein\">Aaron P. Bernstein / Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The Trump administration effectively muffled scientific staffers at the Environmental Protection Agency when it rewrote automobile pollution rules, the agency’s watchdog said.</p>\n<p>When drafting fuel economy and greenhouse gas pollution rules for cars and light trucks, former EPA Administrator Scott Pruitt decided to cede various EPA duties to the National Highway Transportation Safety Administration in what is typically a collaborative process, the independent inspector general said in a <a href=\"https://www.epa.gov/sites/production/files/2021-04/documents/_epaoig_20210420-21-e-0125.pdf\">report</a> released yesterday. Though Pruitt signed the final report for the EPA, he allowed NHTSA staff to write a significant portion of the rules and to complete all modeling and analysis for both agencies.</p>\n<p>The NHTSA’s modeling efforts did not use the EPA’s established tools that had been created to evaluate greenhouse gas emissions standards. Instead, the NHTSA hacked its own Corporate Average Fuel Economy models and sent EPA experts the results late in the process. “Technical personnel were unable to fully collaborate on rule development,” the report said.</p></div><p><a href=\"https://arstechnica.com/?p=1759134#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1759134&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"10010937d4a7a49951a554fe2048231f44811ba47899a61188fcb992b1b66be3","category":"Tech"}