{"title":"Water addition but not reduction alters plant biomass–diversity relationship","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17430?af=R","date":1721390038000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/eb4fe1a3-8d5e-4de1-a3c2-a1963eac8897/gcb17430-toc-0001-m.png\" alt=\"Water addition but not reduction alters plant biomass–diversity relationship\" />\n<p>Our study, based on a field experiment and a meta-analysis, suggests that water addition not only delays the declining phase of the unimodal biomass–species richness curve but also shifts it upward. Nutrient limitation post-water addition reduces the dominance of super-competitors, delaying the negative plant biomass–biodiversity relation typical in resource-rich habitats. The scarcity of one resource due to the addition of another delays the expected negative plant biomass−diversity relationship typical in resource-rich habitats. Water reduction, causing parallel decreases in biomass and species richness in semiarid and arid sites, does not significantly alter the unimodal biomass–species richness curve.</p>\n<br />\n<h2>Abstract</h2>\n<p>The relationship between plant aboveground biomass and diversity typically follows a unimodal pattern, showing a positive correlation in resource-poor habitats and a negative correlation in resource-rich environments. Precipitation is a crucial resource for both plant biomass and diversity in terrestrial ecosystems. However, the impact of precipitation changes on the relationship between plant biomass and diversity remains unclear. We conduct a water addition field experiment in a semiarid grassland and identify a unimodal relationship between plant biomass and species richness under ambient conditions. Water addition delays the declining phase of this unimodal curve and shift it upward compared to ambient conditions. Our meta-analysis of water addition experiments conducted across major biomes worldwide (grassland, shrubland, desert, and forest) supports this finding, while water reduction does not alter the biomass–diversity relationship. Water addition increases biomass in all climate but only increases species richness in arid and semiarid climate. Similarly, water reduction decreases biomass in all climate but only reduces species richness in arid and semiarid climate. Species richness in dry subhumid and humid climate does not change significantly. Furthermore, our field experiment shows that water addition increases plant diversity while decreasing soil inorganic nitrogen levels. The increase in one resource, such as water, leads to the scarcity of another, such as nutrient, thus postponing the declining phase of the plant biomass–diversity relationship typically observed in resource-rich habitats. Our research contributes to predicting the plant biomass–diversity relationship under changing precipitation conditions and highlights the complex interplay between water availability, nutrient level, and plant diversity.</p>","author":"Yan Yu, \nJosep Peñuelas, \nJordi Sardans, \nJiu‐ying Pei, \nGe Li, \nGuo‐lin Liu, \nJian‐Sheng Ye","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"1006574d8c3b9b504fbb826fa2881b4e7f3292d8d8550821cedf638e1f9ab155","category":"Environment"}