{"title":"Everything New in the iOS 15 Photos App: Metadata Editing, Memories Improvements, Live Text, Visual Lookup and More","link":"https://www.macrumors.com/guide/ios-15-photos-app/","date":1625256281000,"content":"Apple made some major improvements to the <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a> app in <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, adding some long-awaited and requested features along with unique capabilities that enable you to do more with your images than ever. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/iOs-15-Photos-Feature.jpg\" />\r\n<br />\r\nThere's a new Memories feature that lets you relive your favorite moments, metadata info can be viewed and edited, Visual Lookup lets you identify plants, landmarks, and more, and with Live Text, you can copy and paste the text from any image on your <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>. This guide highlights all of the new features that are available in the ‌Photos‌ app. \r\n<br />\r\n\r\n<br />\r\n<h2>Memories</h2>\r\n<br />\r\nThe Memories section of the ‌Photos‌ app has been overhauled in ‌iOS 15‌, making it easier than ever to resurface your favorite memories.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/photos-memories-app.jpg\" />\r\n<br />\r\nThe Memories feature has a new look that includes animated cards with adaptive titles, new animation and transition styles, and multiple image collages for a more cinematic feel. There are new memory looks that are added to Memories based on each photo and video, with Apple using machine learning to apply the right contrast and color adjustment for a consistent look. Apple says that this feature is designed to mimic what colorists at film studios do.\r\n<br />\r\n\r\n<br />\r\nWhen playing a Memory, there's an interactive interface that lets you tap to pause, replay the last photo, skip to the next photo, or jump ahead, with the music designed to keep playing. Changing a song, removing or adding photos, or adjusting a Memory look is done in realtime with no need to recompile. To make it easier to make adjustments to Memories, there's a new Browse view so you can see all of the photos and videos in a bird's eye view.\r\n<br />\r\n\r\n<br />\r\n<ul><li><a href=\"https://www.macrumors.com/how-to/use-memory-looks-photos-app/\">iOS 15: How to Enhance Photos App Memories With 'Memory Looks'</a></li>\r\n<br />\r\n<li><a href=\"https://www.macrumors.com/how-to/select-images-photos-memory-ios/\">iOS 15: How to Select the Images That Appear in a Photos Memory</a></li></ul>\r\n<br />\r\n\r\n<br />\r\n<h3>Apple Music Integration</h3>\r\n<br />\r\nWhen creating and viewing Memories, the ‌Photos‌ app has always supported integrated music, but now <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> subscribers can choose to add any ‌Apple Music‌ song to a Memory.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/memories-apple-music.jpg\" />\r\n<br />\r\nThe Memories feature makes personalized ‌Apple Music‌ song suggestions based on your music tastes and the content of your photos and videos. Song suggestions can include songs that were popular at the time and location of the memory, songs that you listened to while you were traveling, or a song from an artist if the memory includes a concert.\r\n<br />\r\n\r\n<br />\r\nYou can customize a Memory by swiping through various Memory mixes, which lets you experiment with different songs, pacing, and Memory looks.\r\n<br />\r\n\r\n<br />\r\n<ul><li><a href=\"https://www.macrumors.com/how-to/add-apple-music-songs-memories-photos/\">iOS 15: How to Add Apple Music Songs to Your Memories in Photos</a></li></ul>\r\n<br />\r\n\r\n<br />\r\n<h3>New Memory Types</h3>\r\n<br />\r\nThere are new kinds of Memories that are built from your ‌Photos‌ library, with Apple adding new international holidays, child-focused memories, and trends over time. Pet Memories have been improved and iOS devices can recognize individual dogs and cats.\r\n<br />\r\n\r\n<br />\r\n<h3>Watch Next</h3>\r\n<br />\r\nAfter you've finished a Memory, Memories will suggest related content so that you can keep going through your photo content.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/photo-memory-suggestions.jpg\" />\r\n<br />\r\n<h3>Suggest Less Often</h3>\r\n<br />\r\nIf there's someone popping up in your Memories or in Featured ‌Photos‌, you can use a new quick access \"Feature Less\" button to see less of that specific person.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/feature-less-photos.jpg\" />\r\n<br />\r\nThis \"Feature Less\" option also works for dates, places, and holidays.\r\n<br />\r\n\r\n<br />\r\n<h2>Live Text</h2>\r\n<br />\r\nAny text that's in a photograph or an image on your ‌iPhone‌ is now recognized by the ‌iPhone‌ through the new Live Text feature.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/photos-live-text.jpg\" />\r\n<br />\r\nText that is in a photo is selectable, can be copied and pasted, can be used with the Lookup feature, and can even be translated. You can take a photo of an item that has text in a foreign language and have it translated right from the photo.\r\n<br />\r\n\r\n<br />\r\nThis works with all of the images in the ‌Photos‌ app, and is also compatible with screenshots, Safari, and the live camera viewer.\r\n<br />\r\n\r\n<br />\r\n<h2>Visual Lookup</h2>\r\n<br />\r\nIn certain photos, the ‌iPhone‌ can now recognize various objects, landmarks, animals, books, plants, works of art, and more. If you have a photo of a flower on your ‌iPhone‌, for example, you can use Visual Lookup to determine what it might be based on a web search of images that Apple conducts automatically.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/photos-visual-lookup.jpg\" />\r\n<br />\r\nWhen viewing an image, if the \"I\" icon has a little star over it, it means there's a Visual Lookup you can examine. Tap on the Info icon and then tap on the little leaf icon to open up a search.\r\n<br />\r\n\r\n<br />\r\n<h2>Metadata Viewing and Editing</h2>\r\n<br />\r\nIn ‌iOS 15‌, if you tap on the new \"Info\" icon below a photo, you can view the camera that was used to take it, the lens, shutter speed, megapixels, size, aperture, and more, which is all of the EXIF info you can get from the desktop ‌Photos‌ app.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/photos-app-metadata.jpg\" />\r\n<br />\r\nIn this interface, you can add captions and adjust the date and time of a photo through an added \"Adjust\" button. Prior to ‌iOS 15‌, none of this information was available on iOS devices.\r\n<br />\r\n\r\n<br />\r\n <ul><li><a href=\"https://www.macrumors.com/how-to/view-exif-metadata-photos-app/\">iOS 15: How to View EXIF Metadata in the Photos App</a></li><li><a href=\"https://www.macrumors.com/how-to/adjust-ios-photos-metadata/\">iOS 15: How to Adjust the Date and Time of Photos</a></li></ul>\r\n<br />\r\n<h2>Faster iCloud Photos Library Syncing</h2>\r\n<br />\r\nApple says that when you upgrade to a new device, <a href=\"https://www.macrumors.com/guide/icloud-photo-library/\">iCloud Photos</a> syncs more quickly than before, making it faster than ever for you to get access to your photo library.\r\n<br />\r\n\r\n<br />\r\n<h2>People Identification and Naming Improvements</h2>\r\n<br />\r\nThe \"People\" album on the ‌iPhone‌ has improved recognition for the various individuals that are in your photos.\r\n<br />\r\n\r\n<br />\r\nApple has also added a full workflow for correcting naming mistakes. When selecting a person, if you tap on the \"...\" icon and then choose \"Manage Tagged ‌Photos‌,\" you can untag any photos that might not be that person. This is also the interface used to tag additional photos if iOS finds untagged images.\r\n<br />\r\n\r\n<br />\r\n<h2>Selection Order for Photos Picker</h2>\r\n<br />\r\nThe ‌Photos‌ image picker that's available across iOS lets you select photos in a certain order for sharing purposes, so if you have a photo sequence, you can be sure they're shared in the order that you intend.\r\n<br />\r\n\r\n<br />\r\n<h2>Shared With You</h2>\r\n<br />\r\nIf someone shares a photo or video with you in the Messages app, it will show up in a new \"Shared With You\" section in the ‌Photos‌ app.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/photos-shared-with-you.jpg\" />\r\n<br />\r\nIf it's a photo that was taken when you were present, it will appear in the All ‌Photos‌ view and in the Days, Months, and Years view, as well as in Featured ‌Photos‌ and Memories.\r\n<br />\r\n\r\n<br />\r\n‌Photos‌ in the Shared With You section can easily be saved to the ‌Photos‌ Library, and you can respond to a message with a tap right from the ‌Photos‌ app.\r\n<br />\r\n\r\n<br />\r\n<h2>Spotlight Photos Search</h2>\r\n<br />\r\nIn ‌iOS 15‌, you can search through your entire ‌Photos‌ library using Spotlight. You can search by locations, people, scenes, or things in the photos like plants or pets thanks to Visual Lookup.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/spotlight-search-photos-app.jpg\" />\r\n<br />\r\n<h2>Guide Feedback</h2>\r\n<br />\r\nHave questions about ‌Photos‌ in ‌iOS 15‌, know of a feature we left out, or want to offer feedback on this guide? <a href=\"mailto:guides@macrumors.com\">Send us an email here</a>.<br />This article, \"<a href=\"https://www.macrumors.com/guide/ios-15-photos-app/\">Everything New in the iOS 15 Photos App: Metadata Editing, Memories Improvements, Live Text, Visual Lookup and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/everything-new-in-the-ios-15-photos-app-metadata-editing-memories-improvements-live-text-visual-lookup-and-more.2303059/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=3av3f40R0HE:gA_GC2jSG0A:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=3av3f40R0HE:gA_GC2jSG0A:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/3av3f40R0HE\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"100ea2766ac8b2f62ac22da488cd89f181ddb38cdf419f5b5b3d9684b4e92364","category":"Apple"}