{"title":"Plant–soil interactions alter nitrogen and phosphorus dynamics in an advancing subarctic treeline","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17200?af=R","date":1709452800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3ac5407d-73f2-437c-98b7-15f1e85e6ba8/gcb17200-toc-0001-m.png\" alt=\"Plant–soil interactions alter nitrogen and phosphorus dynamics in an advancing subarctic treeline\" />\n<p>Globally, treelines are shifting due to climate warming. We studied how this shift affects nitrogen and phosphorus in plants and soils along tundra–forest transects on Kola Peninsula, Russia. Despite stable total nitrogen and phosphorus stocks, their distribution among pools changed. From high elevation tundra to low elevation forest, phosphorus stocks in stones decreased signaling stronger weathering, while biomass nitrogen and phosphorus stocks tripled. Available soil phosphorus and nitrogen increased fivefold toward the forest due to greater nutrient release during decomposition of nutrient-rich forest litter. Forest expansion mobilized nutrients through enhanced weathering and positive plant–soil feedbacks, potentially promoting forest growth.</p>\n<br />\n<h2>Abstract</h2>\n<p>Treelines advance due to climate warming. The impacts of this vegetation shift on plant–soil nutrient cycling are still uncertain, yet highly relevant as nutrient availability stimulates tree growth. Here, we investigated nitrogen (N) and phosphorus (P) in plant and soil pools along two tundra–forest transects on Kola Peninsula, Russia, with a documented elevation shift of birch-dominated treeline by 70 m during the last 50 years. Results show that although total N and P stocks in the soil–plant system did not change with elevation, their distribution was significantly altered. With the transition from high-elevation tundra to low-elevation forest, P stocks in stones decreased, possibly reflecting enhanced weathering. In contrast, N and P stocks in plant biomass approximately tripled and available P and N in the soil increased fivefold toward the forest. This was paralleled by decreasing carbon (C)-to-nutrient ratios in foliage and litter, smaller C:N:P ratios in microbial biomass, and lower enzymatic activities related to N and P acquisition in forest soils. An incubation experiment further demonstrated manifold higher N and P net mineralization rates in litter and soil in forest compared to tundra, likely due to smaller C:N:P ratios in decomposing organic matter. Overall, our results show that forest expansion increases the mobilization of available nutrients through enhanced weathering and positive plant–soil feedback, with nutrient-rich forest litter releasing greater amounts of N and P upon decomposition. While the low N and P availability in tundra may retard treeline advances, its improvement toward the forest likely promotes tree growth and forest development.</p>","author":"Jasmin Fetzer, \nPavel Moiseev, \nEmmanuel Frossard, \nKlaus Kaiser, \nMathias Mayer, \nKonstantin Gavazov, \nFrank Hagedorn","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"10167a21a88cd9dd4acfbdc8d6679aa28c16b6b6371975517a563e9af593090b","category":"Environment"}