{"title":"Coral mucus promotes the carbon metabolic potency of microorganisms in the coral reef ecosystem","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12673?af=R","date":1729618018000,"content":"<h2>Abstract</h2>\n<p>Coral mucus, teeming with organic matter, releases nutrients and microorganisms, affecting element cycling and microbial communities in coral reefs. While terrestrial ecosystems exhibit well-studied priming effects from root exudates, the influence of mucus in marine environments, particularly in coral reefs, remains underexplored. We hypothesize that coral mucus, through its nutrients and microbes, stimulates the surrounding microorganisms, regulating carbon metabolism and thus contributing to high coral reef productivity. Initially, natural samples (<i>Acropora pruinosa</i> mucus, seawater, and sediment) were collected for metagenomic assessment of microbial communities and functions. Results showed significant differences in microbial diversity, community structures, co-occurrence modes, and unique functions among mucus, seawater, and sediment. Subsequent laboratory experiments demonstrated mucus's substantial influence on surrounding microorganisms. Analyses, including 16S rRNA sequencing and Eco-plate results, revealed that mucus regulates microbial composition and activities. Quantitative gene-chip analysis showed significant increase in the functional genes related to carbon fixation (e.g., the 3-hydroxypropionate cycle) and degradation (e.g., pectin and hemicellulose hydrolysis) by 55.81% and 65.48%, respectively. Partial least squares path modeling identified mucus nutrients and microbial community composition as key contributors to carbon metabolic potential. This research confirms that mucus acts as a trigger, reshaping microbial profiles around corals and enhancing carbon utilization efficiency, highlighting its essential role in carbon metabolism and the maintenance of high productivity in coral reef ecosystems.</p>","author":"Xiaoyu Zhang, \nKeke Cheng, \nYuke Qin, \nXinyang Li, \nZhonghua Cai, \nBo Yang, \nMui‐Choo Jong, \nHuina Zheng, \nBaohua Xiao, \nJin Zhou","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"101beb802a283374981b3def0a41fd20f8362c6289553bab8b8bf948549c9fff","category":"Environment"}