{"title":"Unreleased MacBook Schematics Stolen in $50 Million Ransomware Attack on Apple Supplier","link":"https://www.macrumors.com/2021/04/21/apple-supplier-ransomware-attack/","date":1618998473000,"content":"As Apple held its \"Spring Loaded\" event where it unveiled brand new <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> Pros, a redesigned <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a>, and the long-awaited release of <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a>, one of its main MacBook suppliers was undergoing a ransomware attack worth $50 million.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2018/06/apple-park-drone-june-2018-2.jpg\" />\r\n<br />\r\nAs reported by <em><a href=\"https://www.bloomberg.com/news/articles/2021-04-21/apple-targeted-in-50-million-ransomware-hack-of-supplier-quanta\">Bloomberg</a></em>,  the ransomware group called REvil, publicly declared early on Tuesday that it had accessed the internal computers of Apple supplier Quanta Computer Inc, based in Taiwan. Through the attack, REvil managed to obtain 15 images/schematics of unreleased MacBooks which include \"specific component serial numbers, sizes and capacities detailing the many working parts inside\" of a MacBook, per documents and blog posts seen by <em>Bloomberg</em>.\r\n<br />\r\n\r\n<br />\r\nWhile Quanta Computer, the supplier at the center of attacks, works with HP, Facebook, and other tech companies, the ransomware group is specifically targeting Apple. In its blog, the group is demanding that Apple pay an undisclosed ransom for the images/schematics they obtained via the supplier by May 1.\r\n<br />\r\n<blockquote>REvil is now attempting to shake-down Apple in its effort to profit off the stolen data. They've asked Apple to pay their ransom by May 1, as was first reported by Bleeping Computer. Until then, the hackers will continue to post new files every day, REvil said on its blog.</blockquote>An Apple spokesperson declined to comment. However, Quanta Computer acknowledged the attack and said that it had no \"material impact\" on its business operations.<blockquote>Quanta Computer’s information security team has worked with external IT experts in response to cyber attacks on a small number of Quanta servers,” the company said in a statement. “We've reported to and kept seamless communications with the relevant law enforcement and data protection authorities concerning recent abnormal activities observed. There's no material impact on the company’s business operation.</blockquote>As a response to the ordeal, the supplier is bolstering its cybersecurity infrastructure. Ultimately, REvil, in a chat with Quanta during negotiations for the attack, said it had stolen and encrypted \"all local network data\" and that it will not give it up until the $50 million ransom is paid.\r\n<br />\r\n\r\n<br />\r\nApple famously takes the secrecy of unreleased products extremely seriously, and it's still not known how much confidential data the ransom group has obtained, and whether Apple will pay the ransom. <div>Tag: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">bloomberg.com</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/21/apple-supplier-ransomware-attack/\">Unreleased MacBook Schematics Stolen in $50 Million Ransomware Attack on Apple Supplier</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/unreleased-macbook-schematics-stolen-in-50-million-ransomware-attack-on-apple-supplier.2292553/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=xPMhgiePdRg:zZnRDRU79Vw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=xPMhgiePdRg:zZnRDRU79Vw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/xPMhgiePdRg\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"101e1511cfe51bea669cc78dca06a433266fec8429052b4ae8f797d340856ae7","category":"Apple"}