{"title":"Firefly toxin lucibufagins evolved after the origin of bioluminescence","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae215/7695494?rss=1","date":1719273600000,"content":"<span><div>Abstract</div>Fireflies were believed to originally evolve their novel bioluminescence as warning signals to advertise their toxicity to predators, which was later adopted in adult mating. Although the evolution of bioluminescence has been investigated extensively, the warning signal hypothesis of its origin has not been tested. In this study, we test this hypothesis by systematically determining the presence or absence of firefly toxin lucibufagins (LBGs) across firefly species and inferring the time of origin of LBGs. We confirm the presence of LBGs in the subfamily Lampyrinae, but more importantly, we reveal the absence of LBGs in other lineages, including the subfamilies of Luciolinae, Ototretinae, and Psilocladinae, two <span>incertae sedis</span> lineages, and the Rhagophthalmidae family. Ancestral state reconstructions for LBGs based on firefly phylogeny constructed using genomic data suggest that the presence of LBGs in the common ancestor of the Lampyrinae subfamily is highly supported but unsupported in more ancient nodes, including firefly common ancestors. Our results suggest that firefly LBGs probably evolved much later than the evolution of bioluminescence. We thus conclude that firefly bioluminescence did not originally evolve as direct warning signals for toxic LBGs and advise that future studies should focus on other hypotheses. Moreover, LBG toxins are known to directly target and inhibit the α subunit of Na<sup>+</sup>, K<sup>+</sup>-ATPase (ATPα). We further examine the effects of amino acid substitutions in firefly ATPα on its interactions with LBGs. We find that ATPα in LBG-containing fireflies is relatively insensitive to LBGs, which suggests that target-site insensitivity contributes to LBG-containing fireflies' ability to deal with their own toxins.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"10210cd4574170ca3d6fc611063cc31564fa315f5112f66287d79c7a394f0504","category":"Interdisciplinary"}