{"title":"Evolution of volatile compounds of baked dried tofu during infrared baking process and their correlation with relevant physicochemical properties","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13469?af=R","date":1710761705000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Energy-saving and low-carbon baking processes, as well as the need to determine the flavor-forming mechanisms of baked dried tofu, were becoming increasingly necessary. The application of emerging catalytic infrared radiation (CIR) technology in baking of dried tofu is considered of high interest due to the low energy consumption and high baking efficiency compared to traditional baking methods. Hence, this study aimed to investigate the evolution of aroma compounds in baked dried tofu during CIR baking process and reveal relevant relationships between physical qualities, potential flavor precursors and key volatile compounds.</p>\n<h2>Results</h2>\n<p>The results showed that the surface color of dried tofu gradually turned an appetizing golden yellow color during the rapid heating process caused by the uniform infrared radiation from the upper and lower radiant emitters. Meanwhile, the moisture of dried tofu experienced minimal reduction and the hardness of dried tofu gradually increased with the formation of crust on the surface. In addition, 49 volatile compounds were identified by HS-SPME-GC–MS and 13 substances, including 1-hexanol, 1-octen-3-ol, 1-pentanol, heptanal, nonanal, hexanal, (E,E)-2,4-decadienal, (E,Z)-2,4-decadienal, octanal, (E)-2-octenal, (E)-2-nonenal, 2-heptanone, and 2-pentyl-furan, were confirmed as key aroma compounds. Moreover, the amino acids including aspartic, glutamic, isoleucine, lysine, and arginine acid and fatty acids including butyric, caprylic, capric, tridecanoic, stearic, oleic, and linolenic, were responsible for the unique flavor of the CIR baked dried tofu.</p>\n<h2>Conclusions</h2>\n<p>Consequently, the findings can provide the scientific basis for manufacturers to achieve precise quality control and large-scale production of CIR baked dried tofu products.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Wenqing Chen, \nHaile Ma, \nQunhui Jiang, \nChen Shen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"10297c79ee703fe7a3d22613a8792b7ae058742b4d9c0767105644e152ba63e5","category":"Environment"}