{"title":"Facial Pain Detection Using Multilinear Subspace Learning","link":"https://www.preprints.org/manuscript/202405.0659/v2","date":1717073206000,"content":"Detection and measurement of pain are crucial in designing effective pain management interventions to alleviate suffering and prevent functional decline in the medical domain. Traditional methods of pain identification rely on verbal patient reports or observable signs, which can be imprecise or subjective due to variability in patient self-assessments. Hence, there is a pressing need for automated methods to standardize pain measurement procedures. This paper proposes a novel facial expression-based automated pain assessment system as a behavioral indicator for pain evaluation. Our system integrates a fusion structure comprising Convolutional Neural Networks (CNNs) and Tensor-based extended Quantitative Expression Descriptors Analysis (TXQEDA). This innovative approach allows for joint learning of robust pain-related facial expression features from raw facial images, combining RGB appearance with shape-based latent representation. We extensively evaluated our proposed model using the UNBC-McMaster dataset for pain classification and intensity estimation. Our results demonstrate the efficacy of the proposed technique, achieving an impressive accuracy of 99.10% for pain level classification. Furthermore, our system excels in pain intensity estimation, showcasing its potential to provide precise and reliable assessments of pain severity. Overall, our research underscores the importance of automated pain assessment systems in improving patient care and clinical outcomes. By leveraging advanced deep learning techniques and fusion strategies, our proposed model offers a promising approach for standardizing pain measurement\nprocedures and enhancing the quality of pain management interventions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1030ee92b1c8f0a91f348b177bfe47fee4d5a5535df2ef0a915beb8638d4d4f6","category":"Interdisciplinary"}