{"title":"Microsoft is testing a built-in cryptocurrency wallet for the Edge browser","link":"https://arstechnica.com/?p=1924980","date":1679084070000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/edge-crypto-1-980x534.jpeg\" alt /></div>\n          <p>\n            A built-in cryptocurrency wallet is the latest finance-related feature to pop up in Microsoft's Edge browser.                          [credit:\n                              <a href=\"https://twitter.com/thebookisclosed/status/1636761695216451588\">@thebookisclosed/Twitter</a>\n                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Microsoft appears to be testing a built-in cryptocurrency wallet for Edge, according to screenshots pulled from a beta build of the browser. The feature, which the screenshots say is strictly for internal testing, was unearthed by <a href=\"https://twitter.com/thebookisclosed/status/1636759487829917698\">Twitter user @thebookisclosed</a>, who has a history of digging up present-but-disabled features in everything from <a href=\"https://arstechnica.com/gadgets/2023/02/windows-11-could-replace-bad-gamer-apps-with-built-in-rgb-lighting-controls/\">new Windows 11 builds</a> to <a href=\"https://arstechnica.com/gadgets/2021/12/testers-dig-up-an-early-2003-era-version-of-windows-vistas-aero-theme/\">ancient Windows Vista betas</a>.</p>\n<p>This is only one of many money and shopping-related features that Microsoft has bolted onto Edge since it was reborn as a Chromium-based browser a few years ago. In late 2021, the company faced backlash after <a href=\"https://arstechnica.com/information-technology/2021/11/microsoft-plans-to-integrate-a-buy-now-pay-later-app-into-edge/\">adding a \"buy now, pay later\" short-term financing feature</a> to Edge. And as an Edge user, the first thing I do in a new Windows install is disable the endless coupon code, price comparison, and cash-back pop-ups generated by <a href=\"https://www.microsoft.com/en-us/edge/features/shopping?form=MT00D8\">Shopping in Microsoft Edge</a> (many settings automatically sync between Edge browsers when you sign in with a Microsoft account; the default search engine and all of these shopping add-ons need to be changed manually every time).</p>\n\n<p>According to the screenshots, the crypto wallet is \"embedded in Edge, making it easy to use without installing any extension,\" and it can handle multiple types of cryptocurrency. It will also record transactions and the value of your individual currencies as they fluctuate. An \"explore\" tab offers news stories relevant to cryptocurrency, and an \"assets\" tab will let you stare lovingly at your NFTs. The wallet is \"non-custodial\" (also called \"self-custodial\"), meaning that you have sole ownership of and responsibility for the passwords and recovery keys that allow access to your funds. Microsoft won't be able to let you back in if you lose your credentials.</p></div><p><a href=\"https://arstechnica.com/?p=1924980#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1924980&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1031c4ab4a1dcda8b37674b34621f1d203ead70e8dba282a0f29de00125f9e1c","category":"Tech"}