{"title":"A p53 Intron-Encoded lncRNA and the Maintenance of the Proliferative Undifferentiated State of Myeloid Leukemia Cells","link":"https://www.preprints.org/manuscript/202407.1372/v1","date":1721196716000,"content":"Acute myeloid leukemias are characterized by genetic alterations that lead to a complete or partial block at various stages of myeloid differentiation, leading to continual proliferation of myeloid progenitor cells. These alterations can include a well-documented chromosomal translocation that leads to the synthesis of the PML-retinoic acid receptor fusion protein that leads to a block in differentiation and the ability to induce differentiation with all-trans retinoic acid and other small molecules. In essence, in large part, the disease is due to stem cell-like cells that are blocked in their ability to undergo terminal differentiation to more mature, non-proliferative cell types. We discovered a long non-coding RNA (lncRNA), lncRNAp53int1, encoded from the first intron of the p53 tumor suppressor gene.  Interestingly, lncRNAp53int1 appears to play an important regulatory role in maintaining the undifferentiated and proliferative state in a manner independent from p53 gene expression.  lncRNAp53int1 is expressed at high levels in proliferating, undifferentiated promyelocytes and its levels fall significantly during their terminal differentiation to non-proliferating granulocytes or macrophages.  Furthermore, forced overexpression of lncRNAp53int1 blocks terminal differentiation.  The observation that the expression of this lncRNA is repressed during terminal differentiation of human leukemic cells and its expression blocks differentiation of leukemic myeloid progenitor cells, is likely to have clinical implications with regards to differentiation therapy for myeloid leukemia.  Ongoing research aims to identify the molecular partners that it associates with and the signaling pathways that this lncRNA participates in with the long-term goal of identifying molecules that inhibit lncRNAp53int1 activity and serve as potential therapeutic drugs. The goal of this mini-review is to disseminate these novel and interesting findings to readers and to describe where we think this research is headed and the impact it can have on myeloid leukemias.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"103a0b4d888896626f3b7cbaba78a5d7a99d68ad0262e86f9b05b9bddc3b814c","category":"Interdisciplinary"}