{"title":"Quinoa alleviates osteoporosis in ovariectomized rats by regulating gut microbiota imbalance","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13339?af=R","date":1718348660000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Postmenopausal osteoporosis (PMO) is associated with dysregulation of bone metabolism and gut microbiota. Quinoa is a grain with high nutritional value, and its effects and potential mechanisms on PMO have not been reported yet. Therefore, the purpose of this study is to investigate the bone protective effect of quinoa on ovariectomy (OVX) rats by regulating bone metabolism and gut microbiota.</p>\n<h2>Results</h2>\n<p>Quinoa significantly improved osteoporosis-related biochemical parameters of OVX rats and ameliorated ovariectomy-induced bone density reduction and trabecular structure damage. Quinoa intervention may repair the intestinal barrier by upregulating the expression of tight junction proteins in the duodenum. In addition, quinoa increased the levels of Firmicutes, and decreased the levels of Bacteroidetes and <i>Prevotella</i>, reversing the dysregulation of the gut microbiota. This may be related to estrogen signaling pathway, secondary and primary bile acid biosynthesis, benzoate degradation, synthesis and degradation of ketone bodies, NOD-like receptor signaling pathway and biosynthesis of tropane, piperidine and pyridine alkaloids. Correlation analysis showed that there is a strong correlation between gut microbiota with significant changes in abundance and parameters related to osteoporosis.</p>\n<h2>Conclusion</h2>\n<p>Quinoa could significantly reverse the high intestinal permeability and change the composition of gut microbiota in OVX rats, thereby improving bone microstructure deterioration and bone metabolism disorder, and ultimately protecting the bone loss of OVX rats. © 2024 Society of Chemical Industry.</p>","author":"Jinfang Dou, \nZhengting Liang, \nJiaxian Liu, \nNannan Liu, \nXuehong Hu, \nSiyu Tao, \nXianjie Zhen, \nLihua Yang, \nJinghua Zhang, \nGuangjian Jiang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"10409af9d748b7e2962a52d3f463da2719eff33e27a442514471b1dddbde21ee","category":"Environment"}