{"title":"13 Effects of an acclimation protocol during the handling events of the 7 d CO-synch + CIDR protocol on temperament and reproductive performance of Bos taurus commercial beef heifers","link":"https://academic.oup.com/jas/article/102/Supplement_1/54/7617913?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>It has been previously reported that cattle temperament significantly impacts fertility to estrous synchronization (ES) protocols. In addition, enrolling heifers to acclimation protocols following weaning resulted in improved reproductive parameters with an increased proportion of acclimated heifers reaching puberty earlier when compared with non-acclimated cohorts. The objective of the present experiment was to assess the effects of an acclimation protocol during the handling events of an ES on changes in temperament and fertility to the ES protocol in Bos taurus commercial beef heifers. A total of 361 Angus-influenced commercial heifers from 5 different locations were enrolled in the experiment. Before enrolling heifers in the 7-d CO-Synch + CIDR protocol (d -10), individual heifers were evaluated for reproductive tract score (RTS), and chute score (CS) and stratified to receive acclimation (TRT) or to serve as control (CTRL). On d -10, heifers from TRT and CTRL groups received ear tags of different colors and individuals from CTRL and TRT were kept together in their pastures. Before each handling event of the ES (d 0,7,10), TRT heifers were sorted from CTRL and submitted to acclimation, which consisted of running heifers through the handling facilities without catching individuals in the restraining chute. Treatment heifers were then comingled with CTRL heifers, and all heifers were brought to the handling facilities for the ES event. Individual CS and exit velocities (EV) were recorded for all animals at all days (-10,0,7,10). Chute scores were recorded in a 1 to 5 scale, where 1 = calm, no movement; 2 = restless movements; 3 = frequent movement, vocalization; 4 = constant moving, vocalization, shaking of the chute; 5 = violent, continuous struggling. Individual estrus detection patch scores were assessed at the day of fixed-time artificial insemination (FTAI) based on percentage of activation, where 0 = lost; 1 = less than 25% activated, 2 = less than 50% activated, 3 = less than 75% activated, 4 = more than 75% activated. Pregnancy status was determined by rectal ultrasonography approximately 40 d after FTAI. Estrus detection patch scores did not differ between CTRL and TRT heifers (P = 0.1906). In addition, pregnancy rates to FTAI did not differ between TRT and CTRL heifers (56.81% and 52.74%; P = 0.3563). Reproductive tract scores (P = 0.777), EV (P = 0.9607) and CS (P = 0.990) did not differ between CTRL and TRT on d -10. However, CS, but not EV was decreased on d 7 (P = 0.001) and 10 (P = 0.0002) for TRT heifers when compared with CTRL. We conclude that enrolling heifers to an acclimation protocol during the handling events of the ES protocol was effective at decreasing excitability of heifers by the day of FTAI, as evidenced by decreased CS observed for TRT heifers on d 7, and 10 but did not support an increase in fertility to the ES protocol.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"105c9a1fc442b34d6aea30b0815d5ee0bd704d0e4a37a98c8bf3850b615eec25","category":"Environment"}