{"title":"Estimation of the lost productivity to the GDP and the national cost of correcting visual impairment from refractive error in Kenya","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300799","date":1711375200000,"content":"<p>by Shadrack Muma, Kovin Shunmugam Naidoo, Rekha Hansraj</p>\r\nBackground <p>In developing countries such as Kenya, minimal attention has been directed towards population based studies on uncorrected refractive error (URE). However, the absence of population based studies, warrants utilization of other avenues to showcase to the stakeholders in eye health the worth of addressing URE. Hence this study estimated the lost productivity to the Gross Domestic Product (GDP) as a result of URE and the national cost required to address visual impairment from URE in Kenya.</p> Methods <p>The lost productivity to the GDP for the population aged 16–60 years was calculated. Thereafter the productivity loss of the caregivers of severe visual impaired individuals was computed as a product of the average annual productivity for each caregiver and a 5% productivity loss due to visual impairment. The productivity benefit of correcting refractive error was estimated based on the minimum wage for individuals aged between 16–60 years with URE. Estimation of the national cost of addressing URE was based on spectacle provision cost, cost of training functional clinical refractionists and the cost of establishing vision centres. A cost benefit analysis was undertaken based on the national cost estimates and a factor of 3.5 times.</p> Results <p>The estimated lost productivity to the GDP due to URE in in Kenya is approximately US$ 671,455,575 -US$ 1,044,486,450 annually for population aged between 16–60 years. The productivity loss of caregivers for the severe visually impaired is approximately US$ 13,882,899 annually. Approximately US$ 246,750,000 is required to provide corrective devices, US$ 413,280- US$ 108,262,300 to train clinical refractionists and US$ 39,800,000 to establish vision centres. The productivity benefit of correcting visual impairment is approximately US$ 41,126,400 annually. Finally, a cost benefit analysis showed a return of US$ 378,918,050 for human resources, US$ 863,625,000 for corrective devices and US$ 139,300,000 for establishment of vision centres.</p> Conclusion <p>The magnitude of productivity loss due to URE in Kenya is significant warranting prioritization of refractive error services by the government and all stakeholders since any investment directed towards addressing URE has the potential to contribute a positive return.</p>","author":"Shadrack Muma","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1070a43786b889ae593a27ebec513fa5e8263af15758e23ead1e9a91453514e3","category":"Interdisciplinary"}