{"title":"Immunization of turkeys with <i>Clostridium septicum</i> alpha toxin-based recombinant subunit proteins can confer protection against experimental Clostridial dermatitis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302555","date":1714399200000,"content":"<p>by Feba Ann John, Valeria Criollo, Carissa Gaghan, Abigail Armwood, Jennifer Holmes, Anil J. Thachil, Rocio Crespo, Raveendra R. Kulkarni</p>\r\n\r\nClostridial dermatitis (CD), caused by <i>Clostridium septicum</i>, is an emerging disease of increasing economic importance in turkeys. Currently, there are no effective vaccines for CD control. Here, two non-toxic domains of <i>C</i>. <i>septicum</i> alpha toxin, namely ntATX-D1 and ntATX-D2, were identified, cloned, and expressed in <i>Escherichia coli</i> as recombinant subunit proteins to investigate their use as potential vaccine candidates. Experimental groups consisted of a Negative control (NCx) that did not receive <i>C</i>. <i>septicum</i> challenge, while the adjuvant-only Positive control (PCx), ntATX-D1 immunization (D1) and ntATX-D2 immunization (D2) groups received <i>C</i>. <i>septicum</i> challenge. Turkeys were immunized subcutaneously with 100 μg of protein at 7, 8 and 9 weeks of age along with an oil-in-water nano-emulsion adjuvant, followed by <i>C</i>. <i>septicum</i> challenge at 11 weeks of age. Results showed that while 46.2% of birds in the PCx group died post-challenge, the rate of mortality in D1- or D2-immunization groups was 13.3%. The gross and histopathological lesions in the skin, muscle and spleen showed that the disease severity was highest in PCx group, while the D2-immunized birds had significantly lower lesion scores when compared to PCx. Gene expression analysis revealed that PCx birds had significantly higher expression of pro-inflammatory cytokine genes in the skin, muscle and spleen than the NCx group, while the D2 group had significantly lower expression of these genes compared to PCx. Peripheral blood cellular analysis showed increased frequencies of activated CD4+ and/or CD8+ cells in the D1 and D2-immunized groups. Additionally, the immunized turkeys developed antigen-specific serum IgY antibodies. Collectively, these findings indicate that ntATX proteins, specifically the ntATX-D2 can be a promising vaccine candidate for protecting turkeys against CD and that the protection mechanisms may include downregulation of <i>C</i>. <i>septicum</i>-induced inflammation and increased CD4+ and CD8+ cellular activation.","author":"Feba Ann John","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"107015c5cdb3a28970ed24e270835afad2423f10bcb419d94264539e78684000","category":"Interdisciplinary"}