{"title":"Phony Stark Stiffed Amazon on Twitter’s AWS Bill, So Amazon Threatened to Pull Its Ads","link":"https://www.theinformation.com/articles/musk-delayed-paying-twitters-amazon-cloud-bill-sparking-ad-threat?rc=jfy0lk","date":1678158561000,"content":"\n<p>Erin Woo, reporting for The Information (paywalled, alas):</p>\n\n<blockquote>\n  <p>Elon Musk is running into an obstacle in his relentless drive to\ncut costs at Twitter: some of the same vendors that Twitter is\nsqueezing to save money are also its advertising clients.</p>\n\n<p>As recently as last month, Twitter sales and marketing staff were\ntold by their colleagues that Amazon had threatened to withhold\npayment for advertising it runs on Twitter because the social\nnetwork for months refused to pay its Amazon Web Services bills\nfor cloud computing services, according to two people familiar\nwith the discussions.</p>\n\n<p>The ad threat may have had an impact. A couple of weeks ago,\nTwitter paid AWS $10 million for cloud services it used, but\nthat’s a drop in the bucket compared to what Twitter owes AWS\nbased on a long-term contract the companies struck, said a person\nfamiliar with the situation. [...] Twitter’s shortfall on what it\nis supposed to have spent on AWS services, under a five and a half\nyear contract signed in 2020, is now at least $70 million. And\nAmazon has resisted renegotiating the contract, the person said.</p>\n</blockquote>\n\n<p>It’s a lot easier to bully around smaller companies, and stiff them on their bills. Not so much a bigger company. Renegotiating a contract like this is like asking to renegotiate your poker bet after you’ve lost the hand. I would imagine the negotiations have been going something like this:</p>\n\n<p><strong>Twitter:</strong> We’d like to renegotiate our AWS contract.</p>\n\n<p><strong>Amazon:</strong> Fuck you, pay us.</p>\n\n<p><strong>Twitter:</strong> But we’re not utilizing...</p>\n\n<p><strong>Amazon:</strong> Fuck you, pay us.</p>\n\n<p><strong>Twitter:</strong> OK, but can we...</p>\n\n<p><strong>Amazon:</strong> Fuck you, pay us.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/06/twitter-stiffed-amazon\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"5dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"107db555d6db6d5729d1067ad1bd60ccf5d4db7987fa8b40160ed9","category":"Tech"}