{"title":"The aggregation effect of offshore mussel farming on pelagic fishes","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.165?af=R","date":1712640351000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/7172d806-5085-4207-9c26-f4fb596df6e2/aff2165-gra-0001-m.png\" alt=\"The aggregation effect of offshore mussel farming on pelagic fishes\" />\n<p>As well as adding hard structure to the seabed, mussel aquaculture adds rope droppers and anchor lines to the water column, where such structure would otherwise be absent. This paper aims to monitor the effects of mussel headlines on the pelagic fish community over time, as well as to investigate whether there is an interaction between the age of cultivated mussels with the number of epibiota species and the abundance of pelagic fishes. The older and larger the mussels become, the greater numbers of epibiota taxa that can colonise, coupled with a greater abundance of pelagic fish recorded around the ropes.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The increase in hard artificial structures in the marine environment is contributing to ocean sprawl. As well as adding hard structure to the seabed, mussel aquaculture adds rope droppers and anchor lines to the water column, where such structure would otherwise be absent. This paper aims to monitor the effects of mussel headlines on the pelagic fish community over time, as well as to investigate whether there is an interaction between the age of cultivated mussels with the number of epibiota species and the abundance of pelagic fishes. Two surveys were carried out: a time series monitoring survey to assess whether the mussel headlines change the surrounding fish species relative to control areas over time, and a fish aggregation device effect survey to investigate whether older and larger mussels support greater abundances of pelagic fishes and epibiota. The most abundant fish species was Atlantic horse mackerel, <i>Trachurus trachurus</i>, with significantly greater numbers recorded around ropes growing older mussels. Results from the surveys show that the physical farm infrastructure has provided a substrate for colonisation by a variety of epibiota: A total of 21 species were recorded growing on the mussel ropes. Furthermore, the older and larger the mussels become, the greater the numbers of epibiota taxa that can colonise, coupled with a greater abundance of pelagic fish recorded around the ropes. The sustainable development of offshore Blue Industries is essential to produce renewable resources. This study brings essential evidence for marine managers and regulators that offshore mussel farming can provide benefits for pelagic and benthic species of both conservation and commercial importance while producing sustainable protein to feed a growing population.</p>","author":"Danielle Bridger, \nMartin J. Attrill, \nSiân E. Rees, \nEmma V. Sheehan","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"108bd376d857b5914c7e9fb16b5033e2cbe9fc5dac23268374b409d762dfa0ff","category":"Environment"}