{"title":"Women's WorldTeams salaries: a delicate balance","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-growth-of-womens-worldteams-a-delicate-balance","date":1622135545000,"content":"\n      <p><em><span></span></em><span>Earlier this month, we asked the question <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/5-years-on-what-impact-has-the-introduction-of-the-women-s-world-tour-had\">‘Is the women’s WorldTour working?</a>’ The UCI certainly thinks so. Last week, the governing body issued a press release heralding a \"significant increase in UCI Women’s WorldTeams’ salaries and budgets for 2021\". This was according to a report by an external auditing firm, EY Lausanne, who were appointed by the UCI to keep tabs on WorldTeams (who are subject to audit as part of registering their license).</span></p>\n<p><span>There have been undeniable advances in the state of women’s pro cycling since the introduction of the Women’s WorldTour in 2016. However it is the most recent changes that have made a significant difference. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/iris-slappendel-interview\">Related – \"We can change the culture of the sport\": Iris Slappendel interview</a></strong></em></p>\n<p><span>These changes came into place in 2020 and included the introduction of a two-tier structure consisting of top-level WorldTeams and second-tier Continental teams. Within that structure, Women’s WorldTeams must pay their riders a minimum salary as well as giving other benefits such as maternity pay.</span></p>\n<p><span>The EY Lausanne audit for the UCI found that the average salary of a Women’s WorldTeam had risen 25% from 2020 to 2021 which the press release claimed was down to the UCI-enforced minimum salary. That salary was €15,000 in 2020, and has risen to €20,000 in 2021. Next year, it will be upped to €27,500 and in 2023 is due to match the men’s second-tier — or ProTeam — minimum of €32,100.</span></p>\n<div></div>\n<p><span>The report also explained that, in 2020, male ProTeam riders earned 67.53% more than Women’s WorldTeam riders, but that this year, the gap has been reduced to 44.21%. A significant improvement, but also a stark reminder of how far women’s teams still have to go. </span></p>\n<p><span>UCI President David Lappartient was, of course, keen to attribute the growth to the UCI’s ‘Agenda 2022’. “The rise in UCI Women’s WorldTeams salaries and budgets shows that the reform of professional women’s road cycling, as set out in cycling’s Agenda 2022, is having a positive impact on women riders and their teams,” he is quoted as saying in the press release. </span></p>\n<p><span>Lappartient also acknowledged the need for improvement saying: “There is still work to be done to strengthen the sector and to continue to develop it, but the creation of the UCI Women's WorldTeams, four years after the creation of the UCI Women's WorldTour, is a central element for the growth of women's cycling.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_6669_1024x1024.jpg?v=1622119422\" /></div>\n<p><em><span>Photo credit: Alex Whitehead/SWPix.com</span></em></p>\n<p><span>While the creation of this system and the introduction of WorldTeams has created growth, one factor that the UCI failed to mention in their press release was the initiative taken by some of these individual Women’s WorldTeams to increase the salaries of their riders beyond the required minimums. </span></p>\n<p><span>In January, Trek-Segafredo announced that they would be matching the minimum salary for their women’s squad to that of the men’s which — because their men’s team is a WorldTeam — surpasses even the stipulated minimum set out by the UCI for 2023. The minimum salary for a men’s WorldTeam rider is €40,045 (employed) or €65,673 (self-employed). In March, Team BikeExchange followed suit. </span></p>\n<p><span>Of course, for Women’s WorldTeams who benefit from the structures of being run in tandem with a men’s squad it’s a no-brainer. If the budget allows, there is no excuse. Indeed, the EY Lausanne audit also revealed that the average budget of the nine Women’s WorldTeams has increased by 22% between 2020 and 2021. </span></p>\n<p><span>Given that the full results of the audit were not released, it’s difficult to discern whether this increase is due to additional support from organisations like Trek-Segafredo and BikeExchange, or whether all Women’s WorldTeams have seen their budgets grow. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_7475_1024x1024.jpg?v=1622119088\" /></div>\n<p><em>Photo credit: Alex Whitehead/SWPix.com</em></p>\n<h4>Tipping the scales</h4>\n<p><span>While there may be a disparity between the top and bottom of the WorldTeams, there is an even greater one between the WorldTeams and their Continental counterparts. </span></p>\n<p><span>The figures laid out by the UCI and EY Lausanne are promising for the 160 Women’s WorldTeam riders who benefit from the changes, however many were wondering about the fate of the 771 Continental riders who have no such rights or support. </span></p>\n<p><span>The two-tier system may have led to better conditions for those at the top, but as the WorldTeams and their riders continue to grow and benefit from increased financial and structural support, the second-tier has seen no changes or additional requirements introduced. There is no policing of the conditions on Continental squads by the UCI, no audits carried out or minimum benefits enforced.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\"><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Le_Col_banner_9e1286a5-7454-4cc0-aa96-06ace7457145_1024x1024.jpg?v=1622135416\" /></span></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\"><em><strong>Sign up to our weekly women's cycling newsletter</strong></em></a></p>\n<p><span>When the women’s cycling union, The Cyclists’ Alliance, released the details of their <a href=\"https://cyclistsalliance.org/wp-content/uploads/2020/10/TCA-Rider-Survey_2020.pdf\">2020 Rider Survey</a> the report revealed that 25% of riders who responded do not receive a salary, 34% have to reimburse their team for expenses such as equipment or travel and 33% work a second job while racing professionally. Figures which paint far less of a rosy picture than the UCI’s press release would have people believe. </span></p>\n<p><span>One of the additional key findings from the survey was that: “For the second consecutive year rider salaries have risen in general but alarmingly the wage disparity is increasing. This reflects a trend where teams to [sic] spend large sums of money to attain the very best riders, pushing down the salary of other riders.” </span></p>\n<p><span>The existence of WorldTeams — while overall a positive step — is contributing to widening the gap between the upper and lower tier of the peloton. Something which the UCI did not address in its statement. “There is a need to push the UCI for greater protection of the more vulnerable athletes,” The Cyclists' Alliance report said. </span></p>\n<p><span>For Women’s WorldTeams, the introduction of the two-tier system has been largely a success thus far.  It is now beholden on the UCI to balance the scales so they are not tipped so profoundly in favour of WorldTeams at the expense of the grassroots riders who they will rely on to feed into them.</span></p>\n\n<p><em><span>Cover image: Thomas Maheux/SWPix.com</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"108ddf8b3a7765c6242ed3c214b8622072038fabe2495630213b07eec91c2548","category":"Cycling"}