{"title":"Cyclist’s 2023 Tour de France Femmes predictions","link":"https://www.cyclist.co.uk/in-depth/tour-de-france-femmes-predictions-2023","date":1689955546000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-femmes-predictions-2023\">Cyclist’s 2023 Tour de France Femmes predictions</a></p>\n\n<p>The second <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-femmes\" target=\"_blank\">Tour de France Femmes</a> begins on Sunday and we at <em>Cyclist </em>couldn’t be more excited. Last year’s edition was wall-to-wall action and the 2023 race looks set to be even more dramatic with a tricky <em>parcours </em>that finishes with a climb of the Col du Tourmalet and the first time-trial of this incarnation of the women’s Tour de France.</p>\n\n\n\n<p>After a stunning set of predictions for the men’s Tour de France proved the expertise of our experts, we’ve gathered the troops once more to reveal who will win each of the jerseys at the 2023 Tour de France Femmes.</p>\n\n\n\n<h2>Will Strickson, deputy web editor</h2>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-970x647.jpg\" alt=\"Claire Steels Israel-PremierTech Roland\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-1536x1024.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-2048x1365.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Claire_steels_israel_premiertech-350x233.jpg 350w\" /><figcaption>Dario Belingheri/Getty Images</figcaption></figure>\n\n\n\n<p>Fresh off a stunning run in our last predictions, here I am again with the current answers.</p>\n\n\n\n<h3>Yellow jersey: Demi Vollering (SD Worx)</h3>\n\n\n\n<p>I’ve been a fan of Demi Vollering for a few years now and being a single day her senior I feel a strong responsibility to have her back. She’s been far and away the world’s best rider in 2023 and even beat Annemiek van Vleuten on the Queen Stage of the Vuelta to Lagos de Covadonga. It won’t be easy to be Van Vleuten on the Col du Tourmalet but this is Vollering’s year. Pass the baton over, Annemiek.</p>\n\n\n\n<h3>Green jersey: Lorena Wiebes (SD Worx)</h3>\n\n\n\n<p>As you’ll find out through my colleagues’ selections, Lorena Wiebes’ climbing capability has become underrated. Yes she was one of the peloton’s few out-and-out sprinters, but she has shown on several occasions this season that she can not only make it over climbs but she can win on short punchy finishes. It obviously won’t be easy against Vos but Wiebes has the added benefit of being on the best team in the race.</p>\n\n\n\n<h3>Polka dot jersey: Ricarda Bauernfeind (Canyon-SRAM)</h3>\n\n\n\n<p>The inclusion of the Tourmalet makes this one difficult as the winner of that stage will get a huge amount of points, so it’ll need to be a concerted effort throughout the race as well as a strong finish on that stage. Step up Ricarda Bauernfeind. The 23-year-old is an incredibly talented climber, finishing fifth on that stage to Lagos de Covadonga, but with Kasia Niewiadoma leading the team she won’t have the pressure to save legs for the GC fight. That means she can sneak points in early stages before finishing strong on the Tourmalet.</p>\n\n\n\n<h3>White jersey: Eleonora Gasparrini (UAE Team ADQ)</h3>\n\n\n\n<p>With the Tour de France Femmes being under-23 rather than under-25, the field is incredibly small, but that means anyone could win it. The race will split constantly with so many hard stages. UAE Team ADQ’s Eleonora Gasparrini didn’t make it to the two mountain stages at last year’s race but she’s a strong all-rounder with a big sprint, recently winning Stage 3 of the Tour de Suisse and missing out on that white jersey by a second. Riding in support of Silvia Persico will see Gasparrini rack up an advantage over her contenders to maintain it over the Tourmalet.</p>\n\n\n\n<h3>Bonus round: Claire Steels on the podium</h3>\n\n\n\n<p>Israel-Premier Tech’s 36-year-old Brit Claire Steels (above) only stepped up to the top level of women’s racing this year but she’s been growing into really good form with sixth overall at the Tour de Suisse and second in the super-hilly British National Championships road race. She’ll stick with the main contenders as the splits happen on the first six stages before putting in a breakthrough ride on the Col du Tourmalet to catapult herself onto the podium. It’ll be a hard task to keep it on the time-trial but I think she’ll hold on for a famous British podium in Pau.</p>\n\n\n\n<h2>Robyn Davidson, editorial assistant</h2>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-970x647.jpg\" alt=\"Silvia Persico UAE ADQ\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-1536x1024.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-2048x1365.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/silvia_persico_uae_adq-350x233.jpg 350w\" /><figcaption>TOM GOYVAERTS/Belga/AFP via Getty Images</figcaption></figure>\n\n\n\n<p>After failing to turn up for the men’s race predictions, Robyn has finally got her priorities straight and even delivered one actually interesting pick.</p>\n\n\n\n<h3>Yellow jersey: Annemiek van Vleuten (Movistar)</h3>\n\n\n\n<p>Annemiek van Vleuten had an uncharacteristically quiet first half of the season, which had me assuming Demi Vollering would be an absolute lock for the Tour de France Femmes title. Then, Van Vleuten sprung into action and won both La Vuelta Feminina and the Giro d’Italia Donne. That’s me told. She’s done the double, but can she complete the triple? Or technically, the double-triple, seeing as she won all three Grand Tours in 2022 as well. She’s got the momentum, the legs and the drive to secure her second (and final) Tour de France Femmes title ahead of his retirement at the end of the season. Which I still refuse to believe. </p>\n\n\n\n<h3>Green jersey: Silvia Persico (UAE Team ADQ)</h3>\n\n\n\n<p>Silvia Persico (above) moved up to WorldTour at the beginning of the year with UAE Team ADQ and long before that, I was enjoying her <em>puncheur</em> power at Valcar-Travel &amp; Service. She’s had a consistent season so far with multiple top 10s and a victory at Brabantse Pijl, she also finished top ten on every non-bunch sprint stage in 2022, with such a hilly <em>parcours </em>underestimate her at your peril.  </p>\n\n\n\n<h3>Polka dot jersey: Demi Vollering (SD Worx)</h3>\n\n\n\n<p>Second in the general classification standings if my prediction above is accurate, but surely the winner of the polka dot jersey by the time the race gets to Pau for a final day individual time-trial. Hopefully there won’t be any loose horses on course.  </p>\n\n\n\n<h3>White jersey: Julie de Wilde (Fenix-Deceuninck)</h3>\n\n\n\n<p>I had prepared to write a few paragraphs on the craziness of Lidl-Trek’s Shirin van Anrooij only being 21 years old still, then clicked she’s not at the Tour de France Femmes. This classification has been the hardest to nail down for me, with so many names a welcoming challenge to decide from. So, I’ll go for Julie de Wilde. She fractured her scapula at De Panne which impacted her Classics campaign, but has been back riding since the end of May, delivering a steady performance at the Thüringen Ladies Tour followed by a win at the Flanders Diamond Tour.</p>\n\n\n\n<h3>Bonus round: Continental team will win a stage</h3>\n\n\n\n<p>Every time a Grand Tour rolls around, I ask for a few things, but a Continental team winning a stage is one of them. I love the disbelief and happiness on their faces, say, if they last out front in a breakaway with impending sprint trains breathing down their neck. 100 more metres and they would’ve been absorbed into the mass. But they didn’t. To me, that’s what’s so damn good about cycling. Anything can happen. </p>\n\n\n\n<h2>Pete Muir, editor</h2>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03042250/tour_de_france_femmes_stage_7_gallery_09-970x647.jpg\" alt=\"Annemiek van Vleuten celebrates winning a stage at the Tour de France Femmes 2022\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03042250/tour_de_france_femmes_stage_7_gallery_09-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03042250/tour_de_france_femmes_stage_7_gallery_09-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03042250/tour_de_france_femmes_stage_7_gallery_09-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03042250/tour_de_france_femmes_stage_7_gallery_09-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03042250/tour_de_france_femmes_stage_7_gallery_09-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03042250/tour_de_france_femmes_stage_7_gallery_09-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03042250/tour_de_france_femmes_stage_7_gallery_09-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/07/03042250/tour_de_france_femmes_stage_7_gallery_09.jpg 1200w\" /><figcaption>Cyclingimages</figcaption></figure>\n\n\n\n<p>Let’s hope Pete’s writing into form with his choices as his last outing wasn’t his strongest showing. His bonus pick should get him off to a nice start early on.</p>\n\n\n\n<h3>Yellow jersey: Annemiek van Vleuten (Movistar)</h3>\n\n\n\n<p>Fresh from a crushing victory at the Giro Donne, Annemiek van Vleuten (above) will be dominant in the mountains (the Tourmalet stage will be key) and will end her career on an epic high. Almost makes you wonder why she’s retiring.</p>\n\n\n\n<h3>Green jersey: Lotte Kopecky (SD Worx)</h3>\n\n\n\n<p>Someone has to knock Marianne Vos off her perch sooner or later, and the Belgian powerhouse is the one to do it (I’d still be happy if Vos won again, though).</p>\n\n\n\n<h3>Polka dot jersey: Demi Vollering (SD Worx)</h3>\n\n\n\n<p>If it wasn’t for the Tourmalet, I’d have pitched Vollering for the overall. She’ll win at least one of the two hilly stages on offer. Possibly both.</p>\n\n\n\n<h3>White jersey: Alice Towers (Canyon-SRAM)</h3>\n\n\n\n<p>She was a British national champion at the age of 19, so she’s going to be a force to be reckoned with now that she’s the ripe old age of 20.</p>\n\n\n\n<h3>Bonus round: Jazzy jersey overload</h3>\n\n\n\n<p>There will be so many Tour-specific-funky-patterned-splatter-effect jerseys on display that it will be impossible to tell the teams apart, and the whole peloton will strobe slightly as it passes.</p>\n\n\n\n<h2>Martin James, production editor</h2>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20220731TDFFAZ1068-A.S.O._Fabien_Boukla-970x647.jpg\" alt=\"CYclist in red and white polka dot jersey climbing up hill with motorbike lights coming behind\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20220731TDFFAZ1068-A.S.O._Fabien_Boukla-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20220731TDFFAZ1068-A.S.O._Fabien_Boukla-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20220731TDFFAZ1068-A.S.O._Fabien_Boukla-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20220731TDFFAZ1068-A.S.O._Fabien_Boukla-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20220731TDFFAZ1068-A.S.O._Fabien_Boukla-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20220731TDFFAZ1068-A.S.O._Fabien_Boukla-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20220731TDFFAZ1068-A.S.O._Fabien_Boukla-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20220731TDFFAZ1068-A.S.O._Fabien_Boukla-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/20220731TDFFAZ1068-A.S.O._Fabien_Boukla.jpg 1500w\" /><figcaption>A.S.O./Fabien Boukla</figcaption></figure>\n\n\n\n<p>Although he joins Pete in picking the wrong SD Worx rider for the green jersey competition, Martin does manage to throw in a curveball. Kudos.</p>\n\n\n\n<h3>Yellow jersey: Demi Vollering (SD Worx)</h3>\n\n\n\n<p>Annemiek van Vleuten is the favourite for good reason, but Vollering pushed her all the way at La Vuelta Feminina and has all the tools to finally step out of Van Vleuten’s GC shadow as the Dutch legend prepares to bow out of the sport.  </p>\n\n\n\n<h3>Green jersey: Lotte Kopecky (SD Worx)</h3>\n\n\n\n<p>Kopecky narrowly missed out on both a stage win and the green jersey last year, but given her excellent 2023 form and the might of her SD Worx team, expect her to tick off both targets this time around. </p>\n\n\n\n<h3>Polka dot jersey: Annemiek van Vleuten (Movistar)</h3>\n\n\n\n<p>Even if she doesn’t win the Tour overall, you just know Van Vleuten will be at or near the front the moment the race hits any serious climbs. There are an awful lot of points up for grabs on the Tourmalet this year… </p>\n\n\n\n<h3>White jersey: Cédrine Kerbaol (Ceratizit-WNT)</h3>\n\n\n\n<p>Kerbaol comes into her first Tour de France Femmes fresh from winning the French national TT champs and placing top 10 in the Road Race. It remains to be seen whether she has the legs for the high mountains, but the 22-year-old has been in solid form throughout 2023, and won’t be short of motivation with the French fans cheering her on.</p>\n\n\n\n<h3>Bonus round: The end of an era</h3>\n\n\n\n<p>With two of cycling’s most dominant names, Annemiek van Vleuten and Marianne Vos, approaching the end of their long careers, and others such as Lizzie Deignan now among the peloton’s elder stateswomen, there’s a real sense of a changing of the guard at the very top of women’s cycling. This should result in closer, more unpredictable racing, which can only be a good thing. </p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-femmes-predictions-2023\">Cyclist’s 2023 Tour de France Femmes predictions</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Will Strickson &#124; Deputy Website Editor","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"10a0c8af4b5e6fddb2ad62bd84459abc13d2a247f10823b4313dac0d7dbb07dc","category":"Cycling"}