{"title":"Raiders of the Lost Ark turns 40, and it’s still an unqualified masterpiece","link":"https://arstechnica.com/?p=1771845","date":1623617790000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/ark13-980x654.jpg\" /></div>\n        <p>\n          Indiana Jones (Harrison Ford) relishes the challenge of stealing a Peruvian fertility idol.                      [credit:\n                        Lucasfilm                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>I still remember the thrill of watching <a href=\"https://en.wikipedia.org/wiki/Raiders_of_the_Lost_Ark\"><em>Raiders of the Lost Ark</em></a> for the first time in the summer of 1981. I spilled my popcorn at the very first jump scare: our hero, Indiana Jones, triggered a booby trap while tracking a Peruvian fertility idol, and a skewered, decaying skeleton popped into the frame. From then on, it was a nonstop ride of thrills, chills, and more than a few spills, with enough humor, romance, and supernatural mysticism thrown in to capture anyone's imagination. Snakes! Spiders! A Nazi monkey spy! Plus plenty of explosions and a gross-out melting face! Next to the first <em>Star Wars</em> movie, it was the best movie I had yet seen in my relatively young life.</p>\n<p>I wasn't alone in my enthusiasm, despite <a href=\"https://www.youtube.com/watch?v=gz4crpFaW4M\">a tepid trailer</a> that captured none of the action/adventure flick's enduring magic. Critics (mostly) raved, and audiences flocked to theaters to see <em>Raiders</em> again and again for several months after its release on June 12, 1981. It was the top-grossing film of that year and didn't leave theaters until the following March, ultimately grossing $354 million globally. <em>Raiders</em> was nominated for multiple Oscars, winning five (for film editing, art direction, sound, sound editing, and visual effects). The Library of Congress selected it for preservation in the National Film Registry, and it is widely considered to be one of the greatest movies of all time. Even director Steven Spielberg has said he considers it the most perfect film in <a href=\"https://en.wikipedia.org/wiki/Indiana_Jones\">the franchise</a>.</p>\n<p><strong>(Major spoilers below because it's been 40 years, and who even are you if you haven't seen this movie yet?)</strong></p></div><p><a href=\"https://arstechnica.com/?p=1771845#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1771845&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"10ac8d4e89ae6a1ca5c6d31a70459f0fa35e128d67d8a0438a93ea03ded18937","category":"Tech"}