{"title":"Experimental and Simulation Studies on the Mn Oxidation State Evolution of a Li2O-MnOx-CaO-SiO2 Slag Analogue","link":"https://www.preprints.org/manuscript/202406.0194/v1","date":1717498567000,"content":"A better understanding of high temperature processes in slags contributes to facilitate knowledge based design of the solidified product. Here, a slag analogue with a nominal composition of 17 wt% LiMnO2 and 83 wt% Ca2SiO4 was synthesized encountering fairly high cooling rates. The Mn species from 1223 K to 1773 K was simulated using a thermodynamic model assuming a homogeneous melt. The micro-composition including the Mn species of the solidified slag was determined experimentally and was used as basis for molecular dynamics (MD) simulation. The MD simulation provides information on structure and viscosity at high temperatures, otherwise difficult to access. These parameters significantly influence oxidation state of redox-active elements and the solidified product. The micro-composition analyzed by electron probe micro analysis (EPMA) and synchrotron based micro-X-ray fluorescence (micro-XRF) showed that Mn-rich and Ca-Si-rich phases are separated. While the Mn-O phases did not contain noticeable Ca, the Ca2SiO4 phase had incorporated 0.6 wt% of Mn. The slag solidified into round shaped and droplet shaped grains of a Li-Mn-oxide, some Mn3O4 and Ca2SiO4. The powder X-ray diffraction (PXRD) confirmed the formation of larnite, the identity of the Li-Mn-oxide however remained inconclusive. The Mn oxidation state (OS) was identified using synchrotron based micro-X-ray absorption near edge spectroscopy (micro-XANES). The Mn-O grains, matched well with Li-Mn-oxides and a Mn OS: +3 e.g. LiMn3+O2. Small areas matching Hausmannite (Mn2+Mn23+O4) were also identified. The OS of Mn in the silicate phase could not be identified. For comparison a slowly cooled slag analogue with similar composition however higher Si content, was also subjected to micro-XANES. The slowly cooled slag formed long Mn-rich needles in a matrix of large calcium silicate crystals. The Mn-rich crystals matched well with the XANES spectrum of a Mn3+ Li-oxide like LiMn3+O2. At the rim of the needles the Mn-spectra matched well the Hausmannite (Mn2+Mn23+O4) reference. In the silicate phases Mn had a OS: +2, unambiguously. The melt structure at different temperatures of two compositions i.e. LiMn3+O2 and Ca2SiO4 was simulated using molecular dynamics (MD). They serve as model compositions assuming a heterogeneous melt. The results show significant different degrees of polymerization and viscosity. Information from MD simulations can support the identification of potentially different oxygen permeability and with that prediction of oxidation states. The bulk composition was identified by inductively coupled plasma optical emission spectrometry (ICP-OES), bulk structure by PXRD and bulk species by lab-XANES. The synchrotron micro analysis including micro-XRD were performed at the microfocus beamline I18 at the Diamond Light Source. Pure reference compounds were prepared and characterized with the same multi-modal approach.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"10ac8126dc04fe66818955b27693b25c641f5bccddf3531994a5563845d5b888","category":"Interdisciplinary"}