{"title":"Exploration of Agronomic Efficacy and Drought Amelioration Ability of Municipal Solid Waste-Derived Co-Compost on Lettuce and Maize","link":"https://www.preprints.org/manuscript/202406.1008/v1","date":1718358440000,"content":"Organic soil amendments, such as composts, mitigate the environmental burdens associated with wasting organic resources. Although compost application to soil enhances an agroecosystem's capacity to store carbon and produce food, studies investigating the agronomical efficacy and their ability to ameliorate drought stress when used as a soil amendment are minimal. In this study, we produced and used a nutrient rich co-compost through the composting of sludge, a nitrogen-rich organic material with carbon rich municipal solid wastes (MSW) to evaluate the agronomic efficacy of the MSW derived co-compost and their ability to ameliorate drought stress. Application of co-compost significantly enhanced growth and yield of lettuce and maize, by a magnitude comparable to chemical fertilizers. Furthermore, under drought stress, lettuce plants grown under co-compost soil amendment grew much better with less wilting, more biomass and yield, and improved root growth. Also, co-compost application enhanced relative root mass ratio (RRMR) under drought stress, indicative that co-compost amendment increased the allocation of biomass to the roots, which is an important morphological attribute for drought adaptability. K content in both leaves and roots of plants amended with co-compost was also higher under drought stress, which may have played a role in osmotic adjustment, consequently, the plants exhibited higher leaf relative water content (RWC). Other nutrient elements that were significantly enhanced by co-compost application included Mg, Ca, Fe and Cu. These results provide evidence that MSW co-composting could optimize organic resource recycling for climate change mitigation and agricultural productivity while minimizing nutrient losses from agroecosystems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"10ad86d11ab5282089b7525340cee571718018b71a653365f5a1f2903ac0185f","category":"Interdisciplinary"}