{"title":"Grand Prix la Marseillaise: 2021 Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/grand-prix-la-marseillaise-2021-preview","date":1611940023000,"content":"\n      <p>Well, it’s been a while hasn’t it. But following the Australian races succumbing to the pandemic, cycling is finally back.</p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><span style=\"font-weight: 400;\">We kick off in southern France for the Grand Prix la Marseillaise this Sunday (31st January). It's a UCI 1.1 event and will see a strong field of WorldTour teams. Since the first edition in 1980, winners have ranged from Bernard Hinault to </span><span style=\"font-weight: 400;\">Benoît Cosnefroy</span><span style=\"font-weight: 400;\"> – the winner of the 2020 race.</span></p>\n<div style=\"text-align: left;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/grand-prix-cycliste-la-marseillaise-2021_1024x1024.png?v=1611923609\" alt=\"Grand Prix la Marseillaise Profile\" style=\"float: none;\"></div>\n<p><i><span style=\"font-weight: 400;\">(Credit: La Flamme Rouge)</span></i></p>\n<p><span style=\"font-weight: 400;\">The course starts and ends in Marseille, albeit in different locations with the finish beside the Stade </span><span style=\"font-weight: 400;\">Vélodrome</span><span style=\"font-weight: 400;\">, which regularly hosts Ligue 1 football matches. After leaving Marseille to the north, the peloton will meander up numerous climbs to the east of the city. </span></p>\n<p><span style=\"font-weight: 400;\">The road is scarcely flat along the 171km route, which is highlighted by four major climbs: the Pas de la Couelle (4.3km, 4.2%), Col de l’Espigoulier (3.4km, 3.2%), </span><span style=\"font-weight: 400;\">Route des Crêtes</span><span style=\"font-weight: 400;\"> (3.8km, 7.9%) and the Col de la Gineste (7.2km, 3.1%). </span></p>\n<p><span style=\"font-weight: 400;\">Overall, the stage features 2,800 meters of climbing, but the final 10km is characterised by a quick downhill run back into Marseille. The combination of a large amount of climbing and a downhill finish opens up a wide variety of possible scenarios. </span></p>\n<p><span style=\"font-weight: 400;\">The stronger climbers will attack aggressively on the climbs, looking to put the heavier sprinters into the red, whereas the fast men will try to hold on for dear life so they are able to compete for victory. A solo victor or a reduced bunch sprint could cross the line in Marseille, perhaps somewhere between the two is the most likely outcome.</span></p>\n<h4><b>The Contenders</b></h4>\n<p><span style=\"font-weight: 400;\">There are seven WorldTour teams in attendance (there were just four last season), including Lotto Soudal. The Belgians bring a strong team featuring the likes of </span><b>Tim Wellens</b><span style=\"font-weight: 400;\"> and </span><b>Philippe Gilbert.</b><span style=\"font-weight: 400;\"> The latter will be chasing Milan-San Remo in March as he aims to become only the fourth man to win all five monuments. </span></p>\n<p><span style=\"font-weight: 400;\">However, he is still working his way back from a fractured patella, so we shouldn’t have lofty expectations for Gilbert on Sunday. Alternatively, Tim Wellens has developed a knack of winning races often and early in the season - he’s won at least one race by the end of February in three of the last four years. It wouldn’t be a surprise to see him on the offensive in an effort to go solo or with a small group to the line. </span><b>John Degenkolb </b><span style=\"font-weight: 400;\">and </span><b>Gerben Thijssen</b><span style=\"font-weight: 400;\"> also race for Lotto Soudal – the two sprinters offer the team a variety of strategic options.</span></p>\n<p><a href=\"https://www.rouleur.cc/it/blogs/the-rouleur-journal/philippe-gilbert-the-road-to-recovery-dreaming-of-san-remo\" target=\"_blank\" title=\"PHILIPPE GILBERT: THE ROAD TO RECOVERY, DREAMING OF SAN REMO\" rel=\"noopener noreferrer\"><em><strong>Related – Philippe Gilbert: The Road to Recovery, Dreaming of San Remo</strong></em></a></p>\n<p><b>Matteo Trentin</b><span> was perhaps one of the more underrated signings of the season. He will make his debut for UAE-Team Emirates this weekend. Trentin should fair well on the climbs and will surely be one of the quickest if it comes to a sprint.</span></p>\n<p><span> </span><b>Ryan Gibbons </b><span>is another sprinter who possesses his fair share of punch for UAE, but </span><b>Alessandro Covi</b><span> could be a dark horse. The 22-year-old Italian shone towards the end of his neo-pro season, it will be interesting to see whether he is deployed as a pure domestique or given the opportunity to attack.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/0W5A7049_1024x1024.jpg?v=1611923689\" alt=\"Matteo Trentin\"><i><span style=\"font-weight: 400;\">Matteo Trentin debuts for UAE-Team Emirates in France. (Image credit:<span> </span></span></i><i><span style=\"font-weight: 400;\">Zac Williams/SWpix.com</span></i><i><span style=\"font-weight: 400;\">)</span></i></p>\n<p><span style=\"font-weight: 400;\">AG2R Citroën, Cofidis and Groupama-FDJ are the three WorldTour teams riding on home soil, with AG2R bringing a particularly capable squad – at least on paper.</span><b> Lilian Calmejane</b><span style=\"font-weight: 400;\"> will make his debut for the team. He’s struggled to recapture his Tour de France stage-winning form as of late and will look to be rejuvenated in new colours.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-cycling-team-jerseys-2021\" target=\"_blank\" title=\"WorldTour Cycling Team Kits 2021: The best, the worst and the bravest\" rel=\"noopener noreferrer\"><em><strong>Related – World Tour Cycling Team Kits 2021</strong></em></a></p>\n<p>However, the team’s best option could well be <b>Andrea Vendrame</b>. The terrain suits the Italian almost perfectly. We doubt he could design a better-suited course himself. He finished fourth on stage four of the 2020 Giro in a bunch sprint, and also claimed a top-five on stage 20 to Sestriere in the final week, a day which featured over 5,000 metres of climbing. Vendrame is quick and can clearly climb well. He should be feared by his opposition.</p>\n<p><span style=\"font-weight: 400;\">Cofidis will aim to be aggressive when the road goes uphill as they are without a pure sprinter in their ranks. The likes of </span><b>Jesús Herrada</b> <span style=\"font-weight: 400;\">who finished 4th here last season, or </span><b>Anthony Perez</b><span style=\"font-weight: 400;\"> who demonstrated his punch at last season's Tour before fracturing a collarbone, could be their best bets. For FDJ, they may look to </span><b>Jake Stewart</b><span style=\"font-weight: 400;\">. The Brit displayed his sprinting prowess when he was twice second at the Tour du Limousin last year. Just 21-years-old, his talent is undeniable. Whether he can survive the climbs is another question.</span></p>\n<p><span style=\"font-weight: 400;\">The final two WorldTour teams are perhaps not quite as potent. The day’s climbing could be within the capability of Intermarche-Wanty’s </span><b>Andrea Pasqualon</b><span style=\"font-weight: 400;\">, though, who is also a quick finisher. EF Education-Nippo’s </span><b>Simon Carr</b><span style=\"font-weight: 400;\"> has made the step-up to WorldTour for 2021, he could attempt to replicate his solo victory at the </span><span style=\"font-weight: 400;\">Prueba Villafranca de Ordizia this Sunday. Born in Hereford, Carr was raised in the Pyrenees and has recently changed his nationality from Great Britain to France.</span></p>\n<p><span style=\"font-weight: 400;\">Naturally, you’d expect the WorldTour teams to feature the stronger riders, but there are an array of strong riders and squads elsewhere.</span></p>\n<p><span style=\"font-weight: 400;\">Total Direct Énergie look like the pick of the ProTeams. Now 33-years-old, </span><b>Edvald Boassen Hagen</b><span style=\"font-weight: 400;\"> is another to make his debut in new colours. The team has a range of options though, with accomplished climbers and sprinters in their ranks. </span><b>Pierre Latour, Alexis Vuillermoz </b><span style=\"font-weight: 400;\">and </span><b>Alexandre Geniez </b>(2018 GP Marseillaise winner), <span style=\"font-weight: 400;\">who also make their team debuts, should be considered among the strongest climbers on the startline. </span><b>Chris Lawless</b><span style=\"font-weight: 400;\"> and </span><b>Anthony Turgis</b><span style=\"font-weight: 400;\"> are two punchy sprinters who will be confident the day’s climbing is tolerable, particularly Turgis – he won this race in 2019 by beating Romain Combaud to the line in a two-up sprint.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_5014_1024x1024.jpg?v=1611923738\" alt=\"Pierre Latour\"><i><span style=\"font-weight: 400;\">Pierre Latour is one of a number of riders to debut for Total Direct Énergie. (Image credit:<span> </span></span></i><i><span style=\"font-weight: 400;\">Alex Broadway/SWpix.com)</span></i></p>\n<p><b>Orluis Aular</b><span style=\"font-weight: 400;\">, riding for Caja Rural, will be far from the most talked about rider entering Sunday’s race. The Venezuelan is a punchy sprinter though, and the terrain this weekend will be appetising for him. The 24-year-old has previously been dominant when racing in the Southern Hemisphere, but the same form didn’t translate to the European Tour in 2020. Caja’s other strategy could be to follow attacks when the road goes uphill, where </span><b>Julen Amezqueta</b><span style=\"font-weight: 400;\"> could be the man for the task.</span></p>\n<p><b>Bryan Coquard</b><span style=\"font-weight: 400;\"> lines up for B&amp;B Hotels, he just might be the fastest sprinter in the entire bunch. </span><span style=\"font-weight: 400;\">Elsewhere, Delko bring </span><b>Alessandro Fedeli,</b><span style=\"font-weight: 400;\"> who looked strong when he claimed a brilliant top-5 at the Bretagne Classic last year.</span></p>\n<h4><b>Our Prediction</b></h4>\n<p><span style=\"font-weight: 400;\">Andrea Vendrame’s two professional victories have come in France,</span><span style=\"font-weight: 400;\"> he’ll make it a French-flavoured hat-trick this Sunday. He has the ability to withstand the inevitable attacks which will be pivotal if he is to make it two-years in a row for AG2R.</span></p>\n<p><span style=\"font-weight: 400;\"> With an average gradient just under 8%, the </span><span style=\"font-weight: 400;\">Route des Crêtes</span><span style=\"font-weight: 400;\"> is perhaps the most suitable spot for the climbers to make their move, where Tim Wellens, Jesus Herrada or even Alessandro Covi could be active. But with over 25km still to go it could be difficult for them to hold on should they create any separation from the likes of Vendrame.</span></p>\n<p><span style=\"font-weight: 400;\">⭐⭐⭐ Andrea Vendrame</span></p>\n<p><span style=\"font-weight: 400;\">⭐⭐ Tim Wellens, Matteo Trentin, Jesús Herrada</span></p>\n<p><span style=\"font-weight: 400;\">⭐ Anthony Turgis, John Degenkolb, Alessandro Covi, Orluis Aular, Bryan Coquard, Jake Stewart, Lilian Calmejane</span></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"10ae4c0ac1583e2779eea4ffa251c4f16c159e9b3fe910efd42411c50564be36","category":"Cycling"}