{"title":"ยอดขายรวมของ Nintendo Switch ในอเมริกาแซง Wii ที่ขายดีที่สุดไปเรียบร้อยแล้ว","link":"https://www.blognone.com/node/135489","date":1693285879000,"content":"<div><div><div><p><strong>Nintendo Switch</strong> ได้บรรลุยอดขายไปอีกขั้น เนื่องจากยอดขายเครื่องรวมในสหรัฐอเมริกานั้นแซงหน้า <strong>Wii</strong> ซึ่งเป็นเคยเครื่องเกมคอนโซลที่ขายดีที่สุดของ Nintendo เป็นที่เรียบร้อย <a href=\"https://www.blognone.com/node/133749\">หลังจากยอดขายรวมทั่วโลกของ Switch แซงหน้า Wii ไปก่อนในช่วงเดือนมิถุนายนที่ผ่านมา</a></p>\n<p>ข้อมูลจาก Circana (ชื่อเดิมคือ NPD) ระบุว่ายอดขายรวมของเครื่องเกมพกพา Nintendo Switch แซงหน้า Wii เป็นทีเรียบร้อยแล้ว หลังจากวางจำหน่ายมาเป็นเวลา 6 ปี โดยยอดขายรวมแซง Wii ไปในเดือนกรกฎาคมที่ผ่านมา แต่ทาง Circana ไม่ได้ระบุจำนวนเครื่องที่ขายได้ทั้งหมดอย่างชัดเจน ส่วนทาง IGN ระบุว่า Switch ขายได้ราว 49 ล้านเครื่องในอเมริกา</p>\n<p>GamesIndustry.biz กล่าวเพิ่มเติมว่า ยอดขายของ Switch ตอนนี้ตามหลัง Xbox 360 ไม่ถึงหนึ่งล้านเครื่อง ในสหรัฐอเมริกา และห่างจาก PlayStation 2 ไม่ถึง 5 ล้านเครื่อง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f3a80baec9fd3e26949897b8bb309dce.jpg\" alt /></p>\n<p>ความสำเร็จอย่างต่อเนื่องของ Switch นั้นมาจากคลังเกม 1st Party ที่แข็งแกร่ง ในปี 2023 ซึ่งนำทัพโดย The Legend of Zelda: Tears of the Kingdom ตามด้วย Metroid Prime Remastered และ Pikmin 4 ล่าสุด และยังมีเกมอย่าง Super Mario Bros. Wonder ที่มีกำหนดออกในปลายปีนี้</p>\n<p>เว็บไซต์อย่างเป็นทางการของ Nintendo ระบุว่าขณะนี้ Switch มียอดขายมากกว่า 129 ล้านเครื่อง ณ วันที่ 30 มิถุนายน 2023 โดยยอดขาย Wii ตลอดอายุการใช้งานต่อยอดอยู่ที่ 101 ล้านเครื่อง</p>\n<p>เกมที่ขายดีที่สุดบน Switch คือ Mario Kart 8 Deluxe ซึ่งขายได้ 55.46 ล้านชุด ในขณะที่ The Legend of Zelda: Breath of the Wild เป็นเกมที่ขายดีที่สุดเป็นอันดับ 4 ด้วยยอดขาย 30 ล้านชุด และ Tears of the Kingdom ก็เป็นเกมที่ขายดีที่สุดอันดับที่ 9 โดยขายไปแล้ว 18 ล้านชุด</p>\n<p>ที่มา - <a href=\"https://www.ign.com/articles/nintendo-switch-just-passed-the-wiis-total-sales-in-the-us\">IGN</a>, <a href=\"https://www.gamesindustry.biz/the-us-video-game-industry-gets-back-to-growth\">Games Industry.biz</a> via <a href=\"https://www.nintendolife.com/news/2023/08/nintendo-switch-has-surpassed-the-wiis-lifetime-sales-in-the-us\">Nintendo Life</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/nintendo-switch\">Nintendo Switch</a></div><div><a href=\"/topics/wii\">Wii</a></div><div><a href=\"/topics/nintendo\">Nintendo</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"10b2bc42b2e3cb897b864e9582a0a7067537ec2c997807a6a2a58e716ab0df7c","category":"Thai"}