{"title":"Mark Zuckerberg พูดถึง Vision Pro: นี่อาจเป็นคอมพิวเตอร์ในอนาคต แต่ไม่ใช่แนวทางที่เราต้องการทำ","link":"https://www.blognone.com/node/134247","date":1686271320000,"content":"<div><div><div><p>หลังการเปิดตัว <a href=\"https://www.blognone.com/node/134171\">Vision Pro</a> เฮดเซต Mixed Reality ของแอปเปิล ซึ่งอาจเป็นคำตอบของผลิตภัณฑ์โลกเสมือน ล่าสุด Mark Zuckerberg ผู้จุดกระแสคำว่า Metaverse ก็ออกมาให้ความเห็นต่อ Vision Pro แล้ว</p>\n<p>โดยมีรายงานจากการประชุมพนักงาน Meta ล่าสุด ซึ่ง Zuckerberg ให้ความเห็นต่อ Vision Pro ว่า เทคโนโลยีที่นำเสนอไม่มีเรื่องใหม่ที่เกินคาดคิด Meta เคยศึกษาแนวทางเหล่านี้มาทั้งหมดแล้ว นอกจากนี้เขายังให้ความเห็นกับราคาเฮดเซต 3,499 ดอลลาร์ ว่าสิ่งนี้สะท้อนแนวทางแอปเปิลที่แตกต่างจาก Meta มาก เพราะบริษัทต้องการทำสินค้าที่ทุกคนเข้าถึงได้ โดย <a href=\"https://www.blognone.com/node/134123\">Quest 3 มีราคา 499 ดอลลาร์</a> ส่วน <a href=\"https://www.blognone.com/node/132885\">Quest Pro</a> ราคา 999 ดอลลาร์</p>\n<p>สุดท้าย Zuckerberg ว่าเป้าหมายของ Meta คือการสร้าง Metaverse ซึ่งเป็นเรื่องของโซเชียล ขณะที่ Vision Pro ดูทำให้คนแยกตัวขณะใช้งานมากกว่า เขาบอกว่าแอปเปิลอาจต้องการสร้างรูปแบบใหม่ของคอมพิวเตอร์ในอนาคต แต่นั่นไม่ใช่ที่เขาต้องการทำ</p>\n<p>เนื้อหาเต็มอยู่ท้ายข่าว</p>\n<p>ที่มา: <a href=\"https://www.theverge.com/2023/6/8/23754239/mark-zuckerberg-meta-apple-vision-pro-headset\">The Verge</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fd472000dc2807e88b3e63af06f83797.jpg\" alt /></p>\n<p>เนื้อหาเต็มที่ The Verge ได้ข้อมูลมา</p>\n<blockquote><p>แอปเปิลเปิดตัวเฮดเซตเรียบร้อยแล้ว ผมจึงอยากพูดถึงเรื่องนี้สักหน่อย ผมสงสัยจริง ๆ ว่าสินค้าจะเป็นยังไงกันแน่ ซึ่งก็คงต้องได้ลองเล่นก่อน จึงจะเข้าใจว่าคนใช้งานกันอย่างไร<br />\n  ดูจากสิ่งที่ผมเห็นตอนนี้ เป็นข่าวดีว่าไม่มีโซลูชันล้ำ ๆ ที่ทีมเราไม่เคยศึกษาวิธีการหรือคิดถึงมันมาก่อน สิ่งที่แอปเปิลใส่คือหน้าจอความละเอียดสูง ตลอดจนเทคโนโลยีต่าง ๆ ที่ใส่เข้าไป ทำให้ราคาแพงกว่าเรา 7 เท่า และต้องใช้พลังงานมากกว่า จึงเห็นการใช้แบตเตอรีมีสายต่อเข้าตลอดเวลาใช้งาน ในแง่ดีไซน์เป็นสิ่งที่ต้องแลกกัน และแอปเปิลก็น่าจะเลือกแล้ว<br />\n  สิ่งที่แอปเปิลนำเสนอเป็นภาพที่ต่างจากแนวทางที่ Meta ต้องการเดินไป และผมคิดว่าสิ่งนี้สำคัญมาก เราสร้างนวัตกรรมเพื่อให้สินค้าเราเข้าถึงได้ ราคาดีที่สุดสำหรับทุกคนเท่าที่ทำได้ ซึ่งพิสูจน์จากแว่นตา Quest ที่ขายได้มากกว่า 10 ล้านอันแล้ว<br />\n  ที่สำคัญกว่านั้น วิสัยทัศน์ของ Meta คือ Metaverse ซึ่งมีโซเชียลเป็นพื้นฐาน เป็นการปฏิสัมพัทธ์ของผู้คนในแนวทางใหม่ ทำให้พวกเขารู้สึกใกล้ชิดกันในรูปแบบใหม่ สินค้าของเราเป็นแบบนั้น กรณีของแอปเปิล เราเห็นภาพคนหนึ่งคนนั่งโซฟา นั่นอาจเป็นวิสัยทัศน์ของการสร้างคอมพิวเตอร์สำหรับอนาคต แต่ไม่ใช่สิ่งที่เราต้องการ เมื่อเห็นชัดว่าแนวทางเราแตกต่างกัน การเดินทางและการแข่งขันจากนี้ก็น่าสนใจและน่าตื่นเต้นมาก</p>\n</blockquote>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/mark-zuckerberg\">Mark Zuckerberg</a></div><div><a href=\"/topics/apple-vision-pro\">Apple Vision Pro</a></div><div><a href=\"/topics/metaverse\">Metaverse</a></div><div><a href=\"/topics/mixed-reality\">Mixed Reality</a></div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/virtual-reality\">Virtual Reality</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"10bcb150f6db6ebbcf0de47dc097d5f745e6dc7108e341936e4c6b647ddbc712","category":"Thai"}