{"title":"Integrative metabolome and transcriptome profiling provide insights into elucidation of the synthetic mechanisms of phenolic compounds in Yunnan hulled wheat (Triticum aestivum ssp. yunnanense King)","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13293?af=R","date":1712768606000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Yunnan hulled wheat grains (YHWs) have abundant phenolic compounds (PCs). However, a systematic elucidation of the phenolic characteristics and molecular basis in YHWs is currently lacking. The aim of the study, for the first time, was to conduct metabolomic and transcriptomic analyses of YHWs at different developmental stages.</p>\n<h2>RESULTS</h2>\n<p>A total of five phenolic metabolite classes (phenolic acids, flavonoids, quinones, lignans and coumarins, and tannins) and 361 PCs were identified, with flavonoids and phenolic acids being the most abundant components. The relative abundance of the identified PCs showed a dynamic decreasing pattern with grain development, and the most significant differences in accumulation were between the enlargement and mature stage, which is consistent with the gene regulation patterns of the corresponding phenolic biosynthesis pathway. Through co-expression and co-network analysis, PAL, HCT, CCR, F3H, CHS, CHI and bZIP were identified and predicted as candidate key enzymes and transcription factors.</p>\n<h2>CONCLUSION</h2>\n<p>The results broaden our understanding of PC accumulation in wheat whole grains, especially the differential transfer between immature and mature grains. The identified PCs and potential regulatory factors provide important information for future in-depth research on the biosynthesis of PCs and the improvement of wheat nutritional quality. © 2024 Society of Chemical Industry.</p>","author":"Chuanli Zhang, \nYun Sha, \nQianchao Wang, \nJunna Liu, \nPing Zhang, \nShunhe Cheng, \nPeng Qin","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"10c3ebf3fc5ec2f7beb9c9d5a7bdc0181b90ade23ca3c4e0471b082e5a06157f","category":"Environment"}