{"title":"COVID-19 Vaccines: A Risk Factor for Cerebral Thrombotic Syndromes","link":"https://www.preprints.org/manuscript/202406.1236/v2","date":1718788671000,"content":"Introduction: This population-based retrospective cohort study assesses rates of adverse events (AEs) involving cerebral thromboembolism (CTE) after COVID-19 vaccines. Methods: Data were collected from the U.S. Centers for Disease Control and Prevention (CDC) and Food and Drug Administration (FDA) Vaccine Adverse Event Reporting System (VAERS) database from January 1, 1990 to December 31, 2023. CTE AEs after COVID-19 vaccines were compared to those after influenza vaccines and after all other vaccines using proportional reporting ratio (PRR) analysis by time. Results: There are 5137 cerebral thromboembolism AEs reported in the 3 years (36 months) after COVID-19 vaccines compared to 52 AEs for the influenza vaccines over the past 34 years (408 months) and 282 AEs for all other vaccines (excluding COVID-19) over the past 34 years (408 months). The PRR’s are significant when comparing AEs by time from COVID-19 vaccines to that of the influenza vaccines (p &lt; 0.0001) or to that of all other vaccines (p &lt; 0.0001). The CTE AEs PRR by time (95% confidence intervals) for the COVID-19 vaccine AEs vs influenza AEs is 1120 (95% confidence interval (723-1730), p &lt; 0.0001) and for COVID-19 vaccines vs all others is 207 (95% confidence interval (144-296), p &lt; 0.0001). Cerebral venous thromboembolism AEs are female predominant with a female/male odds ratio of 1.63 (95% confidence interval (1.52-1.74), p &lt; 0.0001). Conversely, cerebral arterial thromboembolism has a nonsignificant male preponderance. Cerebral venous thromboembolism is far more common than cerebral arterial thromboembolism over 36 months with an odds ratio (OR) of 14.8 (95% confidence interval 14.0-15.5, p &lt; 0.0001). Atrial fibrillation, the most common identifiable cause of cerebral arterial thromboembolism, occurs far more commonly after the COVID-19 as compared to all other vaccines with a PRR of 123 (95% CI 88.3-172, p &lt; 0.0001) Conclusions: There is an alarming breach in the safety signal threshold concerning cerebral thrombosis AEs after COVID-19 vaccines compared to that of the influenza vaccines and even when compared to that of all other vaccines. An immediate global moratorium on the use of COVID-19 vaccines is necessary with an absolute contraindication in women of reproductive age.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"10caef784bf4e73bb413416536bf7835de1f1adc87ccf4e8329b5183d2e81f63","category":"Interdisciplinary"}