{"title":"Prediction of daily new COVID-19 cases ‐ Difficulties and possible solutions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307092","date":1724421600000,"content":"<p>by Xiaoping Liu, A. Courtney DeVries</p>\r\n\r\nEpidemiological compartmental models, such as <i>SEIR</i> (Susceptible, Exposed, Infectious, and Recovered) models, have been generally used in analyzing epidemiological data and forecasting the trajectory of transmission of infectious diseases such as COVID-19. Experience shows that accurately forecasting the trajectory of COVID-19 transmission curve is a big challenge for researchers in the field of epidemiological modeling because multiple unquantified factors can affect the trajectory of COVID-19 transmission. In the past years, we used a new compartmental model, <i>l-i SEIR</i> model, to analyze the COVID-19 transmission trend in the United States. Unlike the conventional <i>SEIR</i> model and the delayed <i>SEIR</i> model that use or partially use the approximation of temporal homogeneity, the <i>l-i SEIR</i> model takes into account chronological order of infected individuals in both latent (<i>l</i>) period and infectious (<i>i</i>) period, and thus improves the accuracy in forecasting the trajectory of transmission of infectious diseases, especially during periods of rapid rise or fall in the number of infections. This paper describes (1) how to use the new <i>SEIR</i> model (a mechanistic model) combined with fitting methods to simulate or predict trajectory of COVID-19 transmission, (2) how social interventions and new variants of COVID-19 significantly change COVID-19 transmission trends by changing transmission rate coefficient <i>β</i><sub>n</sub>, the fraction of susceptible people (<i>S</i><sub>n</sub>/<i>N</i>), and the reinfection rate, (3) why accurately forecasting COVID-19 transmission trends is difficult, (4) what are the strategies that we have used to improve the forecast outcome and (5) what are some successful examples that we have obtained.","author":"Xiaoping Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"10cc8f5d4c35049b46a83d70ee653b39bc91ef6c8d12cbe7ecfbffd4b3521930","category":"Interdisciplinary"}