{"title":"Effect of green tea or black tea extract on lipid and protein oxidation in Cantonese sausage","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13946?af=R","date":1728622476000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Natural polyphenols offer a safer alternative to synthetic antioxidants in meat products. This study investigated the efficacy of green tea and black tea extracts as natural antioxidants in Cantonese sausages to inhibit lipid and protein oxidation.</p>\n<h2>RESULTS</h2>\n<p>Sausages were prepared with the addition of different concentrations – 100, 300, and 600 mg kg<sup>−1</sup> total polyphenols (TP) – of green tea or black tea extract. Oxidation of the sausages was assessed through thiobarbituric acid reactants, carbonyl content, and thiol content, whereas consumer acceptability was evaluated based on texture, color, and sensory analysis. The tea extracts inhibited malondialdehyde production and reduced the thiobarbituric acid reactive substance value from 23.72 mmol MDA g<sup>−1</sup> to less than 1.94 mmol MDA g<sup>−1</sup>. However, the addition of tea extracts decreased the thiol content and caused the loss of myosin heavy chain and actin bonds in sodium dodecyl sulfate polyacrylamide gel electrophoresis. Although the addition of tea extracts increased the redness and hardness of the sausage, no significant difference in consumer acceptance between the control and treatment groups was observed in the sensory analysis.</p>\n<h2>CONCLUSION</h2>\n<p>The tea extract inhibited the oxidation of lipids in Cantonese sausage. There was no negative effect on the sensory characteristics of sausages. The use of tea extracts as natural antioxidants in Cantonese sausage is therefore feasible. © 2024 Society of Chemical Industry.</p>","author":"Weibing Xu, \nChunlin Nie, \nZhicheng Li, \nShuxian Qiu, \nJunyi Xiang, \nYongqiang Zhou, \nIgor Tomasevic, \nWeizheng Sun","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"10d5bf90a3ebd56fb7fd7db46cd4cc50f5e962ea2579c261d6764f5f905bc09a","category":"Environment"}