{"title":"อินเทลยืนยันแล้ว จีพียู Intel Arc จ้างโรงงาน TSMC ผลิตที่ 5 และ 6 นาโนเมตร","link":"https://www.blognone.com/node/124324","date":1629426375000,"content":"<div><div><div><p>อินเทลยืนยันข่าวจีพียูตัวใหม่ Intel Arc จะจ้าง TSMC ผลิต ซึ่งเป็นไปตาม<a href=\"https://www.blognone.com/node/121850\">ยุทธศาสตร์ IDM 2.0</a> ที่มีทั้งการจ้างคนอื่นผลิต และเปิดโรงงานของตัวเองรับจ้างผลิตให้คนอื่น</p>\n<p>ข่าวนี้ไม่ใช่เรื่องน่าแปลกใจนัก เพราะ<a href=\"https://www.blognone.com/node/120922\">จีพียูเซิร์ฟเวอร์รหัส Ponte Vecchio (Xe-HPC)</a> ก็มีบางส่วนที่จ้าง TSMC ผลิตอยู่ก่อนแล้ว การที่ Intel Arc (Xe-HPG) จะจ้าง TSMC ผลิต \"ชิ้นส่วนจำนวนหนึ่ง\" (significant elements) ก็ไปในทิศทางเดียวกัน กระบวนการผลิตมีทั้งแบบ 5 และ 6 นาโนเมตร (N6/N5)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c35b2d2862a6c3ada9b962fda57f690c.jpg\" /></p>\n<p>อินเทลระบุว่าจริงๆ จ้างโรงงานภายนอกผลิตชิปมาให้หลายสิบปีแล้ว เช่น ชิปเซ็ต, ชิป Wi-Fi หรือ Ethernet ปัจจุบันอินเทลมีสินค้าประมาณ 20% จากจำนวนชิปทั้งหมดที่จ้างโรงงานภายนอกผลิต โดยเน้นไปที่กระบวนการผลิตไม่ต้องทันสมัยที่สุด (mainstream process nodes) เพื่อมาเสริมการผลิตของอินเทลเอง</p>\n<p>แต่ภายใต้ยุทธศาสตร์ IDM 2.0 ที่ประกาศเมื่อต้นปี สิ่งที่อินเทลทำคือใช้บริการพาร์ทเนอร์ช่วยผลิตชิปขนาดเล็กๆ ด้วย ซึ่งจีพียูตระกูล Xe ถือเป็นสินค้ากลุ่มแรกที่เดินตามยุทธศาสตร์นี้</p>\n<p>แนวทางการพัฒนาชิปของอินเทลยังย้ายมาสู่ชิปแบบ modular ที่แยกส่วนกัน (จาก System-on-a-Chip มาสู่ System-on-a-Package) สามารถจ้างโรงงานผลิตจากหลายแหล่ง หลายขนาด มาประกอบกันได้ ซึ่งจีพียู Ponte Vecchio เป็นตัวอย่างแรก และซีพียู Meteor Lake จะตามมาเป็นลำดับถัดไป (ใช้ทั้งโรงงานอินเทลและ TSMC ประกอบกัน)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/10f4d821ffe567159acb8095f06fca18.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.intel.com/content/www/us/en/newsroom/opinion/expanding-foundry-partnerships-critical-piece.html\">Intel</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/intel-arc\">Intel Arc</a></div><div><a href=\"/topics/tsmc\">TSMC</a></div><div><a href=\"/topics/intel\">Intel</a></div><div><a href=\"/topics/semiconductor\">Semiconductor</a></div><div><a href=\"/topics/gpu\">GPU</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"10e8404aec9a5c3e0df339c95fe8b377f707bb922672a2b3a8dea9e2235250ef","category":"Thai"}