{"title":"Higher Temperatures Provide Insights Into the Aerobic Mineralization of Aquatic Macrophyte Leachates","link":"https://onlinelibrary.wiley.com/doi/10.1002/iroh.202402175?af=R","date":1728018799000,"content":"<h2>ABSTRACT</h2>\n<p>Aquatic macrophyte leachate is one of the autochthonous sources of carbon and nitrogen in aquatic systems, and microbial communities easily mineralize these elements. Understanding the effects of climate change on the consumption of dissolved oxygen (DO) due to the mineralization of leachate from aquatic macrophytes is fundamental for accurately establishing the oxygen balance in aquatic systems and forecasting element cycling rates. Bioassays were developed to determine the consumption of DO owing to the mineralization of carbon and nitrogen of the aquatic macrophytes leachates (<i>Myriophyllum aquaticum</i>, <i>Hedychium coronarium</i>, <i>Salvinia auriculata</i>, and <i>Chara</i> sp.) when exposed to a temperature increase of 4°C (from 21°C to 25°C). The results concerning accumulated DO were fitted to a first-order kinetic model. At 25°C, oxygen consumption due to mineralization increased by 9.6%, whereas the chemical composition of the leachate changed oxygen consumption between 7.2 (21°C) and 9.2% (25°C). The O/C stoichiometry (oxygen consumed by oxidized carbon) indicated the compositions of the leachate, and temperatures determined the pattern of oxygen consumption. Due to the chemical composition of the leachate, the values varied by approximately 17% and were higher at 25°C (about 30%). Regardless, the increase in temperature improved the oxygen consumption of leachate mineralization. After 90 days at 25°C, the highest concentrations of remaining dissolved organic carbon occurred, suggesting the selection of microorganisms and the catabolic routes that favored the production of refractory organic compounds to the detriment of mineralization. The results indicate that knowledge of the effects of climate variations on aquatic systems is crucial for an accurate understanding of the biogeochemical cycles in these environments.</p>","author":"Roberta Freitas, \nMarcela Bianchessi da Cunha‐Santino, \nIrineu Bianchini Jr.","siteTitle":"Wiley: International Review of Hydrobiology: Table of Contents","siteHash":"c09ce30dd438b9d413c661995ac13a60a951328672586b3a80c41cbb2203224a","entryHash":"10ec7f88cf5a36beae962d3ea5b5a638617dafdaecf3fea7e7ff1f57a6cc3f49","category":"Environment"}