{"title":"The new electric eSprinter out-performs, undercuts Rivian’s cargo van","link":"https://arstechnica.com/?p=2000965","date":1707141605000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/2024-Mercedes-Benz-eSprinter-First-Drive-001-800x533.jpg\" alt=\"A maroon Mercedes-Benz eSprinter with a cargo port in the background.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/2024-Mercedes-Benz-eSprinter-First-Drive-001-scaled.jpg\">Enlarge</a> <span>/</span> Mercedes-Benz has electrified its Sprinter van and given it more range than Ford's E-Transit or the Rivian Delivery Van. (credit: Tim Stevens)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Mercedes-Benz provided flights from Albany to Los Angeles and accommodation so we could drive the new eSprinter. Ars does not accept paid editorial content.</aside>\n<p>There are plenty of ways for small businesses to celebrate their success. It might be a flashy new sign outside, a high-end furniture set inside, or an advertising campaign that they might never have imagined when they started up. But, for businesses literally on the move, the purchase of a first new van is definitely a major milestone. In 2024, the Mercedes-Benz eSprinter may become the new aspirational acquisition for many small businesses.</p>\n<h2>Lots of range and lots of space</h2>\n<p>The Sprinter has been on the US market for over 20 years since it began production at the Mercedes-Benz factory in Charleston, South Carolina. The new eSprinter marks the first time it has gone fully electric, and yes, that version will be assembled in America, too, augmented with a 113 kWh lithium ferro phosphate (LFP) battery pack powering a 134 hp (100 kW) or 201 hp (150 kW) motor driving only the rear wheels. Mercedes estimates a range of 273 miles (440 km) on the European WLTP cycle, which will probably mean somewhere around 250 miles (402 km) when tested with the <a href=\"https://arstechnica.com/cars/2024/01/heres-how-the-epa-calculates-how-far-an-ev-can-go-on-a-full-charge/\">US EPA cycle</a>.</p>\n<p>That battery pack is situated in the floor, between the frame rails, still making room for a cavernous, 488 cubic-foot (13,819 L) cargo compartment. At nearly 24 feet long (280 inches/7,112 mm), it's enough space to carry about a dozen pinball machines or an entire Jabba the Hutt, complete with all his cackling cronies.</p></div><p><a href=\"https://arstechnica.com/?p=2000965#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2000965&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"10f65bc9dfaff81531a006a2116a5a492e9e031a894c29e8f559b7a559916a06","category":"Tech"}