{"title":"Not enough backup power: AT&T and T-Mobile suffer big outages in Louisiana","link":"https://arstechnica.com/?p=1790650","date":1630358672000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-hurricane-ida-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-hurricane-ida.jpg\">Enlarge</a> <span>/</span> LaPlace, Louisiana: Jacqueline Smith waits with her mother Lucille Matthew for transportation after they were rescued from their flooded neighborhood in the aftermath of Hurricane Ida on August 30, 2021. (credit: Getty Images | Scott Olson)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>AT&amp;T today said that only 60 percent of its network in Louisiana is working as Hurricane Ida pummels the state. T-Mobile is reporting similarly extensive outages, while Verizon says it has minimized outages with backup generators. AT&amp;T and T-Mobile both said they have deployed additional generators but the carriers apparently didn't deploy enough to handle the widespread power outages.</p>\n<p>\"Our Louisiana wireless network is operating at 60 percent of normal and we have significant outages in New Orleans and Baton Rouge due to power outages, flooding and storm damage,\" AT&amp;T said in a <a href=\"https://about.att.com/pages/disaster_relief/storm_ida.html\">network-status update</a>. \"We had key network facilities go offline overnight, and while some have already been restored, some facilities remain down and are inaccessible due to flooding and storm damage.\"</p>\n<p>AT&amp;T said it has \"mobilized additional disaster recovery equipment in the region to assist in the recovery and will work around the clock until service is restored.\" AT&amp;T said its wireless network in Alabama is operating normally and that it's \"seen only a very small wireless impact in Mississippi.\"</p></div><p><a href=\"https://arstechnica.com/?p=1790650#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1790650&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"10f925651253a7a7152bc4f78d75f2fb95f5106dedaeb8e2d55e4be55712c1ed","category":"Tech"}