{"title":"Effects of garlic‐derived fructan and oligofructose mixtures on intestinal health and constipation relief in mice","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13567?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Garlic polysaccharides (GPs) constitute over 75% of the dry weight of garlic. They are characterized by fructan with a 2,1-<i>β</i>-<span>d</span>-Fruf backbone and 2,6-<i>β</i>-<span>d</span>-Fruf branches. Studies have suggested a role for GPs in regulating gut microbiota but whether they possess a comprehensive function in maintaining intestinal well-being and can serve as effective prebiotics remains unknown. To explore this, varied doses of GPs (1.25–5.0 g kg<sup>−1</sup> body weight) and inulin (as a positive control) were administered to Kunming mice via gavage, and their effects on the intestinal epithelial, chemical, and biological barriers were assessed. A constipation model was also established using loperamide to investigate the potential effects of GPs on the relief of constipation.</p>\n<h2>RESULTS</h2>\n<p>Administration of GPs significantly upregulated expression of tight-junction proteins and mucins in Kunming mouse small-intestine tissue. Garlic polysaccharides elevated cecal butyric acid content, reduced the abundance of Desulfobacterota, and decreased the ratio of Firmicutes to Bacteroidetes (the F/B ratio). Garlic polysaccharides also promoted the growth of <i>Bacteroides acidifaciens</i> and <i>Clostridium saccharogumia</i>. Tax4Fun functional predictions suggested the potential of GPs to prevent human diseases, reducing the risk of insulin resistance, infectious diseases, and drug resistance. Garlic polysaccharides also exhibited a beneficial effect in alleviating loperamide-induced constipation symptoms by enhancing small intestinal transit, softening stool consistency, accelerating bowel movements, and promoting the release of excitatory neurotransmitters.</p>\n<h2>CONCLUSIONS</h2>\n<p>These findings highlight the important role of GPs in maintaining gut fitness by enhancing intestinal barrier function and peristalsis. Garlic polysaccharides are promising prebiotics, potentially contributing to overall intestinal well-being and health. © 2024 Society of Chemical Industry.</p>","author":"Chanyuan Xie, \nWei Gao, \nXingdi Liang, \nFook Yee Chye","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"10ffc9c70b7cd3aa7e3cb258e9f5f03dc2974b5e78ad588010a1c6d43e856e0a","category":"Environment"}