{"title":"M3 MacBook Pro: Everything you need to know","link":"https://www.macworld.com/article/2111544/m3-macbook-pro-everything-you-need-to-know.html","date":1698319279000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple makes three different sizes of MacBook Pro: a 13-inch, a 14-inch, and a 16-inch model. The 13-inch and 14-inch models may only be an inch apart, but they’re quite different: The 13-inch model is closer to a MacBook Air than a Pro, but it does have some unique features and benefits. While the 14-inch and the 16-inch MacBook Pro currently support either an M2 Pro or M2 Max processor, with the 16-inch model being the ultimate pro with a massive Retina XDR display.</p>\n\n\n\n<p>That’s what we have right now, the question if you are thinking of buying one is what is coming next? In this article, we’ve gathered all the rumors about the next generation MacBook Pro, from what the M3, M3 Pro and M3 Max could offer and other benefits the new chips could bring, to the predicted pricing and speculation about the screen and even the future of the notch.</p>\n\n\n\n<p>Update October 26: Apple will be holding an event on October 30 at which it’s expected to unveil a new M3 13-inch MacBook Pro, but will there be more than one new MacBook Pro? </p>\n\n\n\n<h2>M3 MacBook Pro: Release date</h2>\n\n\n\n<h3>13-inch MacBook Pro</h3>\n\n\n\n<ul>\n<li>13-inch: October 30 2023</li>\n\n\n\n<li>14- and 16-inch: Early 2024 (although there is a slim chance they could also arrive on October 3o). </li>\n</ul>\n\n\n\n<p>Apple is holding an <a href=\"https://www.macworld.com/article/1064916/apple-october-event-date-time-mac-ipad.html\">event on October 30</a> (on October 31 if you are outside the U.S.) The company is expected to unveil the M3 chip at this event, and the 13-inch MacBook Pro is expected to be one of the first Macs to feature the new chip. </p>\n\n\n\n<p>The 13-inch MacBook Pro is expected to get an update to M3. Back in July 2023, Bloomberg’s Mark Gurman predicted that alongside an M3 MacBook Air and iMac <a href=\"https://www.macworld.com/article/1996129/m3-imac-macbook-air-pro-launch-2023-fall-event.html\">the 13-inch MacBook Pro would be updated with an M3 chip in the fall of 2023</a>. At the time he wrote: “The October launch could feature the first Macs with M3 chips. October is too early for new high-end MacBook Pros or desktops, so the first beneficiaries of the new chip should be the next iMac, 13-inch MacBook Air, and 13-inch MacBook Pro.” </p>\n\n\n\n<p>Gurman reiterated this in August when he stated that Apple’s <a href=\"https://www.macworld.com/article/2044423/m3-processor-macbook-mac-mini-fall-event.html\">M3’s release cycle would likely start in October</a> with the M3 chip in the 13-inch MacBook Pro, 13- and 15-inch MacBook Air, Mac mini, and iMac. We now know that there will be an <a href=\"https://www.macworld.com/article/672537/when-is-apples-next-event.html\">Apple event</a> so it looks like Apple’s is ready to launch. </p>\n\n\n\n<p>However, the wait could stretch to the spring. There have been reports that the M3 production was delayed because all efforts went to manufacturing the chips for the new iPhones, which used the same 3nm process that the M3 is expected to. According to analyst Ming-Chi Kuo on X (formerly Twitter) in September, the <a href=\"https://twitter.com/mingchikuo/status/1700193866178343036%20https://www.macworld.com/article/1807369/m3-processor-mac-ipad-pro-2024-release.html\">M3 won’t make its debut in a MacBook until 2024</a>. </p>\n\n\n\n<figure><div>\n<blockquote><p>çœ‹èµ·ä¾†åˆ°ä»Šå¹´å¹´åº•å‰ï¼ŒAppleæ‡‰è©²éƒ½ä¸æœƒç™¼å”®æ–°æ¬¾çš„MacBook (é…å‚™M3ç³»åˆ—è™•ç†å™¨) æ©Ÿåž‹äº†<br />==<br />It seems that Apple will not launch new MacBook models (equipped with M3 series processors) before the end of this year.</p>— éƒ­æ˜ŽéŒ¤ (Ming-Chi Kuo) (@mingchikuo) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1700193866178343036?ref_src=twsrc%5Etfw&amp;xcust=1-1-2111544-1-0-0&amp;sref=https://www.macworld.com/feed\">September 8, 2023</a></blockquote>\n</div></figure>\n\n\n\n<h3>14-inch and 16-inch MacBook Pro</h3>\n\n\n\n<ul>\n<li>Spring 2024</li>\n</ul>\n\n\n\n<p>We expect that the wait for the 14- and 16-inch updates will take a little longer. The M3 Pro and Max, and eventually Ultra chips will most likely roll out in the spring or summer of 2024.</p>\n\n\n\n<p>However, the phrasing in this Ming-Chi Kuo tweet could indicate that all the new M3 chips will launch together: </p>\n\n\n\n<figure><div>\n<blockquote><p>As far as I know, Apple attributes the significant decline in MacBook shipments in 2023 mainly to the limited M2 computing power upgrade. I believe this is why Apple may prefer to launch the M3 series MacBook Pro even when its production volume is still low rather than continue…</p>— éƒ­æ˜ŽéŒ¤ (Ming-Chi Kuo) (@mingchikuo) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1716885306933411885?ref_src=twsrc%5Etfw&amp;xcust=1-1-2111544-1-0-0&amp;sref=https://www.macworld.com/feed\">October 24, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Referring to the M3 series, rather than the M3, suggests more than one M3 chip, as we discuss here: <a href=\"https://www.macworld.com/article/2115095/apple-scary-fast-event-m3-pro-max-macbook-pro.html\">Apple’s ‘Scary Fast’ event will live up to its name</a>. </p>\n\n\n\n<p>Gurman did indicate in an October newsletter that the M3 Pro and M3 Max-powered 14-inch and 16-inch MacBook Pro models have <a href=\"https://www.macworld.com/article/2107225/m3-pro-max-macbook-shipping-early-2024.html\">already reached design validation testing</a> or DVT (he said the same about the 13- and 15-inch MacBook Air). Gurman still thinks that the new M3 Pro and Max machines could arrive “between early and spring 2024,” though.</p>\n\n\n\n<h2>M3 MacBook Pro: Price</h2>\n\n\n\n<ul>\n<li>Similar pricing in the U.S.</li>\n\n\n\n<li>M2 model for under $1,000?</li>\n</ul>\n\n\n\n<p>There have been rumors that Apple will introduce a low-cost MacBook, designed primarily for the education market. We think that this would be an unlikely move, as we explain here: <a href=\"https://www.macworld.com/article/2055457/apple-chromebook-cheap-macbook-education-rumor.html\">Apple might (but probably won’t) make a cheap MacBook to take on Chromebooks</a>.</p>\n\n\n\n<p>A more likely scenario is that Apple keeps the M2 version of the MacBook Pro as a low-priced entry-level model. This could allow for a MacBook Pro under $1,000. It is also possible that we could see a lower price for all new MacBook Pro models, at least in some locations.</p>\n\n\n\n<p>Current pricing is as follows:</p>\n\n\n\n<ul>\n<li>MacBook Pro 13-inch M2, 8-core CPU/10-core GPU, 8GB RAM, 256GB SSD: $1,299/£1,349</li>\n\n\n\n<li>MacBook Pro 13-inch M2, 8-core CPU/10-core GPU, 8GB RAM, 512GB SSD: $1,499/£1,549</li>\n\n\n\n<li>MacBook Pro 14-inch M2 Pro, 10-core CPU/16-core GPU, 16GB RAM, 512GB SSD: $1,999/£2,149</li>\n\n\n\n<li>MacBook Pro 14-inch M2 Pro, 12-core CPU/19-core GPU, 16GB RAM, 1TB SSD: $2,499/£2,699</li>\n\n\n\n<li>MacBook Pro 14-inch M2 Max, 12-core CPU/30-core GPU, 32GB RAM, 512GB SSD: $3,099/£3,349</li>\n\n\n\n<li>MacBook Pro 16-inch M2 Pro, 12-core CPU/19-core GPU, 16GB RAM, 512GB SSD: $2,499/£2,699</li>\n\n\n\n<li>MacBook Pro 16-inch M2 Pro, 12-core CPU/19-core GPU, 16GB RAM, 1TB SSD: $2,699/£2,899</li>\n\n\n\n<li>MacBook Pro 16-inch M2 Max, 12-core CPU/38-core GPU, 32GB RAM, 1TB SSD: $3,499/£3,749</li>\n</ul>\n\n\n\n<p>Prior to the introduction of the M2 Pro and Max models, the pricing was a lot more favorable to the U.K. We hope that, with Apple already having adjusted iPhone pricing, the company will reduce overseas prices back to their pre-2022 levels. In this case, we hope to see something like the following:</p>\n\n\n\n<ul>\n<li>13-inch MacBook Pro M3 (256GB) $1,299/£1,299</li>\n\n\n\n<li>13-inch MacBook Pro M3 (512GB) $1,499/£1,499</li>\n\n\n\n<li>14-inch MacBook Pro M3 Pro (512GB) $1,999/£1,899</li>\n\n\n\n<li>14-inch MacBook Pro M3 Pro (1TB) $2,499/£2,399</li>\n\n\n\n<li>16-inch MacBook Pro M3 Pro (512GB) $2,499/£2,399</li>\n\n\n\n<li>16-inch MacBook Pro M3 Pro (1TB) $2,699/£2,599</li>\n\n\n\n<li>16-inch MacBook Pro M3 Max (1TB) $3,499/£3,299</li>\n</ul>\n\n\n\n<p>According to analyst Ming-Chi Kuo, Apple hoping to boost sales after a “significant decline in MacBook shipments in 2023 mainly to the limited M2 computing power upgrade.” Kuo wrote that Apple is hoping the M3’s “significant boost in computing power” will boost MacBook sales.</p>\n\n\n\n<h2>M3 MacBook Pro: Design </h2>\n\n\n\n<p>According to a Weibo post (shared by ShrimpApplePro on X/Twitter), the <a href=\"https://www.macworld.com/article/2115851/m3-macbook-pro-box-leak-scary-fast-event.html\">new MacBook Pro will look</a> similar to the current model, with skinny bezels, rounded corners, and circular feet. It’s not clear if there is a notch in the image below, which is one thing we could see change in the design of the 13-inch MacBook Pro. </p>\n\n\n\n<figure><div>\n<blockquote><p>I guess this is the new MacBook Pro <br />Source: Weibo <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/tdppFixOgJ&amp;xcust=1-1-2111544-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/tdppFixOgJ</a></p>— ShrimpApplePro ðŸ¤ (@VNchocoTaco) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/VNchocoTaco/status/1717105054287826967?ref_src=twsrc%5Etfw&amp;xcust=1-1-2111544-1-0-0&amp;sref=https://www.macworld.com/feed\">October 25, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>If the launch of the M3 MacBook Pro doesn’t improve sales, Kuo thinks Apple could redesign the MacBook Pro in 2025. </p>\n\n\n\n<p>Kuo also suggests that if Apple doesn’t see the sales it hopes for, it may introduce “a <a href=\"https://www.macworld.com/article/2116251/macbook-pro-redesign-lower-cost-model-2024-2025.html\">more affordable MacBook model</a>.” This echos DigiTimes claim that Apple is working on a Chromebook-like laptop for the education market.</p>\n\n\n\n<h2>M3 MacBook Pro: Display</h2>\n\n\n\n<ul>\n<li>Higher peak brightness</li>\n\n\n\n<li>Greater power efficiency</li>\n</ul>\n\n\n\n<p>There have been rumors for years that Apple would move the MacBook displays to OLED, as seen on the iPhone. This would allow for better power efficiency and increased battery life, and offer better color and brightness. However, it doesn’t look like Apple will be making this change for this generation.</p>\n\n\n\n<p>But that doesn’t mean we won’t be seeing display improvements. According to DigiTimes, the next generation 14- and 16-inch MacBook Pro displays will use <a href=\"https://www.macworld.com/article/2095067/m3-macbook-pro-mini-led-display-upgrade-battery-life.html\">new mini-LEDs that are 10 percent brighter</a> than the ones Apple currently uses (which have a maximum XDR brightness of 1,000 nits sustained and 1,600 nits peak.)</p>\n\n\n\n<p>Not only can they be brighter, when set to the same brightness as the current mini-LEDs, but apparently they will use less power, so we could see improved battery life.</p>\n\n\n\n<h2>M3 MacBook Pro: Notch &amp; FaceTime camera</h2>\n\n\n\n<p>That’s not the only change that could be coming to the display. An icon representing a MacBook in the iPadOS 17.1 beta includes what appears to be a <a href=\"https://www.macworld.com/article/2090570/dynamic-island-macbook-leak-ipados-17-beta.html\">Dynamic Island at the top of the screen</a>, rather than a notch. </p>\n\n\n\n<figure><div>\n<blockquote><p>MacBook Pro with Dynamic Island LEAKED by Apple??? <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/85QUvzVsSI&amp;xcust=1-1-2111544-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/85QUvzVsSI</a></p>— Carter (@IceCoolTech) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/IceCoolTech/status/1708843877338071314?ref_src=twsrc%5Etfw&amp;xcust=1-1-2111544-1-0-0&amp;sref=https://www.macworld.com/feed\">October 2, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Whether this means that the notch will also come to the 13-inch MacBook Pro, remains to be seen, but since the 13-inch MacBook Pro currently is limited to a 720p FaceTime HD camera we do hope that it will get upgraded to the 1080p FaceTime HD camera see elsewhere in the range.</p>\n\n\n\n<p>The inclusion of the notch on the MacBook Pro doesn’t currently support Face ID, but there are suggestions that it could in the future. A patent discovered by Patently Apple in June 2023 indicated that this is <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.patentlyapple.com/2023/06/apple-was-granted-another-patent-relating-to-face-id-authentication-for-macs-and-a-users-email.html&amp;xcust=1-1-2111544-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">something Apple is looking to incorporate</a>. </p>\n\n\n\n<h2>New MacBook Pro: Specs</h2>\n\n\n\n<p>Now onto the processors and what we can expect from the next generation. </p>\n\n\n\n<h3>M3</h3>\n\n\n\n<p>The M3 is expected to take advantage of the same 3nm fabrication process as was used for the A17 in the iPhone 15 Pro and Pro Max. If this is the case it could be the first desktop computer to use a 3nm chip. The M2-series uses the 5nm process.</p>\n\n\n\n<p>The benefits of the 3nm process are that it allows more transistors on a chip, which could provide a performance boost beyond what we have seen for the past couple of generations. The M3 could also offer better power efficiency for improved battery life.</p>\n\n\n\n<p>It’s this new 3nm process that could lead to delays for the launch of the M3 though. Apple is using TSMC to manufacture these chips and they have been stretched to fulfill Apple’s orders for the A17. Back in May Revegnus on Twitter indicated that the M3 chip destined for the iPad Pro and next-generation Macs, won’t arrive until 2024 due to <a href=\"https://www.macworld.com/article/1807369/m3-processor-mac-ipad-pro-2024-release.html\">TSMC’s yield issues</a>. </p>\n\n\n\n<figure><div>\n<blockquote><p>Update: No M3 Mac or iPad for this year<br />Due to yield issues with TSMC not being able to supply enough of the M3 to Apple, Apple has delayed the release of the M3 until next year.<br />So there will be no M3 Macs and no M3 iPads this year. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/faL9l7n53s&amp;xcust=1-1-2111544-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/faL9l7n53s</a></p>— Revegnus (@Tech_Reve) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/Tech_Reve/status/1653641879249092609?ref_src=twsrc%5Etfw&amp;xcust=1-1-2111544-1-0-0&amp;sref=https://www.macworld.com/feed\">May 3, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Despite this, Gurman still expects the M3 to arrive soon and he has some idea of what to expect based on <a href=\"https://www.macworld.com/article/2030760/m3-lineup-cpu-cpu-memory-macbook-imac-mac-mini.html\">developer logs for the M3 Pro and Max</a> that were spotted in August. </p>\n\n\n\n<p>Based on those logs the standard M3 is likely to offer 8 CPU cores (4 performance, 4 efficiency) and 10 or 12 GPU cores. This is the same as currently, but the 3nm process should lead to speed boosts.</p>\n\n\n\n<p>As well as support for less RAM another thing that holds up the M2 Macs right now is the smaller SSD on offer for the entry-level model. In tests this 256GB SSD is seen to be slower than the 512GB option. It’s suspected this is because the 256GB storage option is a single NAND chip instead of two 128GB chips. We hope that Apple will address this.</p>\n\n\n\n<h3>M3 Pro</h3>\n\n\n\n<p>The M3 Pro is said to be getting 12 or 14 CPU cores (6 or 8 performance, 6 efficiency), and 18 or 20 GPU cores. This represents a similar boost in core counts to that seen in the move from M1 to M2. Currently the M2 Pro offers a 10- or 12-core CPU and a 16-core or 19-core GPU.</p>\n\n\n\n<p>Gurman also notes that Apple could be changing the unified memory configurations because the MacBook Pros seen in testing have 36GB and 48GB unified memory options. Currently, Apple offers 8GB, 16GB, 24GB, 32GB, 64GB, and 96GB, 128GB or 192GB memory configurations, depending on the processor.</p>\n\n\n\n<p>On that basis, we could see this new 36GB unified memory option for the M3 Pro.</p>\n\n\n\n<h3>M3 Max</h3>\n\n\n\n<p>For the M3 Max we could see 16 CPU cores (12 performance, 4 efficiency) and 32 or 40 GPU cores. Currently, the M2 Max offers a 12-core CPU and a 30-core or 38-core GPU).</p>\n\n\n\n<p>Beyond that, we could see an M3 Ultra with 32 CPU cores (24 performance, 8 efficiency), and 64 or 80 GPU cores up from 24-core CPU and 60-core or 67-core GPU.</p>\n\n\n\n<p>The M3 Max may get new 32GB and 48GB Unified Memory options.</p>\n\n\n\n<h2>New MacBook Pro: Ports and connectivity</h2>\n\n\n\n<p>One other change coming to the 14- and 16-inch MacBook Pro could be support for Thunderbolt 5. We are unlikely to see this standard until 2024 or 2025, but when it arrives it should double the bi-directional bandwidth to 80 Gbps from 40 Gbps in Thunderbolt 4. A feature called “Bandwidth Boost” will also provide up to 120 Gbps for video content. The new standard will be backwards compatible.</p>\n\n\n\n<p>Here’s the low down on the ports and wireless capabilities currently offered by the MacBook Pro:</p>\n\n\n\n<ul>\n<li>13-inch MacBook Pro: Two Thunderbolt / USB 4 ports, WiFi 6 (802.11ax), Bluetooth 5.0</li>\n\n\n\n<li>14-inch &amp; 16-inch MacBook Pro: Three Thunderbolt 4 / USB C ports, HDMI, SDXC, WiFi 6E (802.11ax), Bluetooth 5.3.</li>\n</ul>\n\n\n\n<p>Hopefully the 13-inch MacBook Pro will get a Bluetooth and Wi-Fi upgrade to match the truly Pro models.</p>\n\nMacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"110056fdcfc11edb1414187c74a2cd5836abb1a4be7a8192bd8b82bc2be3096c","category":"Apple"}