{"title":"Faces of the Angliru – 20 years of pain","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/faces-of-the-angliru-20-years-of-pain","date":1629718273000,"content":"\n      <p><span>\"It’s Marco Pantani’s fault. I fell in love with him watching the Tour de France and when I found out he was going to ride the Vuelta a España in 2001, I went to the Lagos de Covadonga stage to photograph him. I drove to the foot of the mountain the day before and slept there. The next morning, I had my backpack ready with all my photographic equipment and my bicycle to pedal uphill. Then 9/11 happened and I just didn't go up. I couldn't see Pantani, my tragic hero, who died two years later.</span></p>\n<div></div>\n<p><span>Inside me, the passion for cycling was still burning. So the following year, I returned to the Vuelta, which went up the Angliru. Without realising it, I was continuing a photographic project: I was first there in 2000 when Gilberto Simoni took victory. I had no accreditation that day, I simply took in the stage from the side of the road with my camera as part of the crowd.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ANGLIRU-20-years-_-Francis-Tsang-2021-005-_1_1024x1024.jpg?v=1629465999\" /><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ANGLIRU-20-years-_-Francis-Tsang-2021-008-_1_1024x1024.jpg?v=1629466535\" />I stationed myself on the hardest section, at 23.5 per cent, about two kilometres before the summit. When the riders reach that point, they are completely spread out and that's when all the drama and beauty happens. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-most-difficult-climbs\">Related: La Vuelta 2021 Hardest Climbs</a></em></strong></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ANGLIRU-20-years-_-Francis-Tsang-2021-002_1024x1024.jpg?v=1629466449\" /><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ANGLIRU-20-years-_-Francis-Tsang-2021-008b_1024x1024.jpg?v=1629466560\" />But the cyclists only ignite half my interest, because the public is as important, maybe even more important. They have been waiting for hours, even days, and when the race arrives, everything explodes. Madness is born. It's a wonderful thing. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ANGLIRU-20-years-_-Francis-Tsang-2021-006-_1_1024x1024.jpg?v=1629466042\" /><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ANGLIRU-20-years-_-Francis-Tsang-2021-003-_1_1024x1024.jpg?v=1629466587\" />And it is never seen on television. I wanted to capture this whole other world that the cameras no longer show once the favourites for the GC have passed.</span></p>\n\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-preview\"><b><i>Related – La Vuelta a España 2021 Preview</i></b></a></p>\n<p>Because I ride a bike, I can't carry a lot of equipment up the Angliru, so the first time, in 2000, I used a 28 millimetre lens, a wide-angle, which allowed me to cover a lot of the ambience. In 2002 and later, so as not to repeat myself, I went up with a 50mm. I focused on portraits, on faces and gestures of suffering. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ANGLIRU-20-years-_-Francis-Tsang-2021-004-_1_1024x1024.jpg?v=1629466125\" /></p>\n<p><span>Then, in 2020, the year in which the race was without its usual audience because of the pandemic, I tried a new approach: I positioned myself a little higher, on a 21 per cent segment, and placed a studio flash on both sides of the road. They created a window of light through which the racers, coming from the darkness, passed. That's why the photos have that studio treatment. I wanted to use a different technique to the one normally employed in sports photography. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ANGLIRU-20-years-_-Francis-Tsang-2021-001_1024x1024.jpg?v=1629466269\" /></span></p>\n<p><span>I think this is the only reportage in my life which will take me 20 years.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ANGLIRU-20-years-_-Francis-Tsang-2021-007_1024x1024.jpg?v=1629466377\" />You can also see how cycling has evolved: in the older shots, the riders did not wear helmets or glasses and their emotions are less hidden, more human and transparent. In the more recent ones, the riders are more robotic, more android, and it is much more difficult to convey what they are feeling. Before, the gesticulations were wilder; now, everything is much more reserved, although the agony and the effort is still there.\"</span></p>\n<p><em><span>Faces of the Angliru first appeared in Issue 105 of Rouleur, on sale <a href=\"https://www.rouleur.cc/products/issue-105-mountains\">here</a></span></em></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"110705907f3e73fff843f982056619616698f8b045001db07fe82c2f8869c00d","category":"Cycling"}