{"title":"Dual Antibiotic Approach: Synthesis and Antibacterial Activity of Antibiotic‐Antimicrobial Peptide Conjugates","link":"https://www.preprints.org/manuscript/202407.1988/v1","date":1721887290000,"content":"In recent years, bacterial resistance to conventional antibiotics has become a major concern in the medical field. The global misuse of antibiotics in clinics, personal use, and agriculture has accelerated this resistance, making infections increasingly difficult to treat and rendering new antibiotics ineffective more quickly. Finding new antibiotics is challenging due to the complexity of bacterial mechanisms, high costs and low financial incentives for the development of new molecular scaffolds, and stringent regulatory requirements. Additionally, innovation has slowed, with many new antibiotics being modifications of existing drugs rather than entirely new classes. Antimicrobial peptides (AMPs) are a valid alternative to small molecule antibiotics offering several advantages, including broad-spectrum activity and a lower likelihood of inducing resistance due to their multifaceted mechanisms of action. However, AMPs face challenges such as stability issues in physiological conditions, potential toxicity to human cells, high production costs, and difficulties in large-scale manufacturing. A reliable strategy to overcome the drawbacks associate with the use of small molecule antibiotics and AMPs is the combination therapy, namely the simultaneous co-administration of two or more antibiotics or the synthesis of covalently linked conjugates. This review is intended to cover and critically analyze the design, synthetic strategies, antibacterial activity and, when possible, the cytotoxicity of antibiotic-AMPs conjugates.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"111668f704a01dc63d2776f9af18ffb74cdcd5a2dfd65616565da2d4890ed8e8","category":"Interdisciplinary"}