{"title":"Evaluation of a microencapsulated form of zinc oxide on weanling pig growth performance, fecal zinc excretion, and small intestinal morphology","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txad146/7492840?rss=1","date":1703289600000,"content":"<span><div>Abstract</div>A total of 300 pigs (DNA 200 × 400; initially 6.0 ± 0.08 kg body weight [<strong>BW</strong>]) were used in a 42-d study to evaluate a microencapsulated form of zinc oxide. At weaning, pigs were randomly allocated to pens, and pens were randomly assigned to dietary treatments with 5 pigs per pen and 12 pens per treatment. Dietary treatments were 1) negative control (CON; standard nursery diet containing 110 ppm Zn in the form of zinc sulfate from trace mineral premix); 2) control diet with 400 ppm added Zn from ZnO included in phases 1 and 2 (Low-ZnO); 3) control diet with 3,000 ppm added Zn from ZnO included in phase 1 and 2,000 ppm added Zn from ZnO included in phase 2 (High-ZnO); 4) control diet with 400 ppm added Zn from microencapsulated ZnO included in phases 1 and 2 (Low-MZnO; Vetagro S.p.A., Reggio Emilia, Italy); 5) control diet with 3,000 ppm added Zn from microencapsulated ZnO in phase 1 and 2,000 ppm added Zn from microencapsulated ZnO in phase 2 (high-MZnO; Vetagro S.p.A., Reggio Emilia, Italy). On days 10 and 28, fecal samples from 2 pigs per pen were collected for fecal Zn concentrations, and on day 28, 30 pigs (<span>n</span> = 6) were euthanized, and small intestinal tissues were collected to evaluate morphology. For the entire treatment period (days 0 to 28) there was no evidence of differences in average daily gain (<strong>ADG</strong>), average daily feed intake (<strong>ADFI</strong>), or G:F (<span>P </span>&gt; 0.05). During the common phase 3 (days 28 to 42) pigs fed the negative control, High-MZnO, or Low-MZnO had improved (<span>P </span>&lt; 0.0001) ADG and ADFI compared to pigs fed High- or Low-ZnO. For the entire experiment (days 0 to 42), pigs fed Low-ZnO or High-ZnO had reduced (<span>P </span>&lt; 0.0001) ADG compared to those fed the negative control. A significant treatment × day interaction (<span>P </span>= 0.04) was observed for fecal Zn concentrations, where the level of Zn excreted in the feces was dependent on the sampling day in pigs fed a low level of ZnO or low level of microencapsulated ZnO. There was no evidence (<span>P </span>&gt; 0.05) that small intestinal morphology differed significantly between treatments. In summary, feeding a microencapsulated form of ZnO did not alter piglet growth performance during the treatment period. Pigs fed a low level of ZnO or microencapsulated ZnO had reduced fecal Zn excretion by the end of the feeding period, but no significant impacts were observed on piglet small intestinal morphology.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"111779a8adec2da7b63d7202eed02136e70f78853f8348c2c0b9bf8125346417","category":"Environment"}