{"title":"Hybrid Tabu-Grey wolf optimizer algorithm for enhancing fresh cold-chain logistics distribution","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306166","date":1724940000000,"content":"<p>by Hao Zhang, Jianing Yan, Liling Wang</p>\r\n\r\nThe increasing public demand for fresh products has catalyzed the requirement for cold chain logistics distribution systems. However, challenges such as temperature control and delivery delays have led a significant product loss and increased costs. To improve the current situation, a novel approach to optimize cold chain logistics distribution for fresh products will be presented in the paper, utilizing a hybrid Tabu-Grey wolf optimizer (TGWO) algorithm. The proposed hybrid approach combines Tabu search (TS) and Grey wolf optimizer (GWO), employing TS for exploration and GWO for exploitation, aiming to minimize distribution costs in total and establish efficient vehicle scheduling schemes considering various constraints. The effectiveness of the TGWO algorithm is demonstrated through experiments and case studies compared to other heuristic algorithms. Comparative analysis against traditional optimization methods, including Particle swarm optimization (PSO), Whale optimization algorithm (WOA), and original GWO, highlights its superior efficiency and solution quality. This study contributes theories by demonstrating the efficacy of hybrid optimization techniques in complex supply chain networks and dynamic market environments. The practical implication lies in the implementation of TGWO to bolster distribution efficiency, cost reduction, and product quality maintenance throughout the logistics process, offering valuable insights for operational and strategic improvements by decision-makers. However, the study has limitations in generalizability and assumptions, suggesting future research areas including exploring new search operators, applying additional parameters, and using the algorithm in diverse real-life scenarios to improve its effectiveness and applicability.","author":"Hao Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"11191d788cfcbd7ca376d3af4cea4c33a57fa1f467c6d942cddfe71ef1474988","category":"Interdisciplinary"}