{"title":"Antimicrobial Stewardship: When Less Is More","link":"https://www.preprints.org/manuscript/202407.1386/v1","date":1721217016000,"content":"Antimicrobial resistance (AMR) is a growing concern in healthcare, and the misuse of antibiotics is contributing to the problem. Antimicrobial Stewardship Programs (ASPs) have been proven to help reduce antibiotic consumption, promote appropriate use, and decrease the incidence of AMR and related side effects. In this study, we aimed to evaluate the impact of ASPs on antibiotics consumption and AMR spread in a Southern Italy. Most of the APSs consisted of applying infection control guidelines and WHO recommendations on antibiotic consumption. The results of the study showed that during the study period, the number of hospitalizations increased by 24%, while the total amount of antibiotics administered decreased from 52.1 to 38.6 defined daily doses (DDD) per 100 bed-days. There was also a significant increase in the number of rectal swabs taken to detect carbapenem-resistant Enterobacteriaceae (CRE) and methicillin-resistant Staphylococcus aureus (MRSA), while the positivity rate of these infections decreased significantly. Moreover, the hospital recorded a decrease in the incidence of several infections, including CRPsA, MRSA, PDR, and VanA infections. This study provides further evidence that ASPs can be effective in reducing antibiotic consumption and preventing the spread of AMR. By promoting the appropriate use of antibiotics and implementing infection control measures, we can help preserve the effectiveness of these life-saving drugs and promote better patient outcomes. However, more efforts are needed to improve healthcare practices and reduce related costs. In conclusion, we urge healthcare providers to implement ASPs in their institutions and help combat the growing threat of AMR. By doing so, we can ensure that antibiotics remain effective for future generations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"111a54a33862c4c0566052e75ab6b9f777ba233159e982c8fcabff1db5ab725d","category":"Interdisciplinary"}