{"title":"Dynamic analysis of groundwater chemistry from 1997 to 2018 in the eastern part of Yongning County, Ningxia Hui Autonomous Region of northwestern China: Integration of Bayesian water quality assessment and health risk assessment","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11134?af=R","date":1726809633000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/413b0809-2418-471a-a5bb-9ac4232459cc/wer11134-toc-0001-m.png\" alt=\"Dynamic analysis of groundwater chemistry from 1997 to 2018 in the eastern part of Yongning County, Ningxia Hui Autonomous Region of northwestern China: Integration of Bayesian water quality assessment and health risk assessment\" />\n<p>Industrial pollution and domestic wastewater enter the groundwater through infiltration and other ways to pollute the groundwater, so it is very important to evaluate the water quality of groundwater. In this study, the health risk assessment of water quality with higher grade is carried out, and the exposure routes of children and adults through oral ingestion and skin contact are considered.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Groundwater is an important part of water resources, with many characteristics: widespreading, steady changing, good water quality, and usable. Therefore, it is an ideal drinking water source. However, with the rapidly economic development and the accelerated urbanization process, the problem of groundwater pollution has become increasingly serious. In this study, the eastern part of Yongning County was taken as the study area, 30 groundwater samples from 1997 to 1998, 2007 to 2008, and 2017 to 2018 were selected for water quality assessment and health risk assessment. The results showed that the groundwater chemical type had a tendency to change from HCO<sub>3</sub>-Ca·Mg type to SO<sub>4</sub>·Cl-Ca·Mg type, and the rock weathering was the important factor controlling the groundwater hydrochemistry in the eastern part of Yongning County. The water quality evaluation of Mn and As was grade II, and the water quality evaluation of Cu, Zn, Cr<sup>6+</sup>, Cd, and Mo was grade I. Both carcinogenic and non-carcinogenic risks were higher in children than in adults, the acceptable frequency of adults was higher than that of children, and the area with higher risks was distributed in the central and easternmost regions of Yongning County. As was a more sensitive factor to carcinogenic risk than Cr<sup>6+</sup>. Therefore, we should pay more attention to the governance of As and the health of children's drinking water. Special attention also should be paid to the water environment protection in the eastern parts of Yongning County. Water quality assessment and health risk assessment in the study area lay a foundation for water pollution control and water environmental protection in the future.</p>\n<h2>Practitioner Points</h2>\n<p>\nThe hydrochemical type changes from HCO<sub>3</sub>-Ca·Mg type to SO<sub>4</sub>·Cl-Ca·Mg type, which is mainly affected by rock weathering.\nAccording to the Bayesian water quality assessment: Mn and As was II, and Cr belongs to I is small.\nAs was the main carcinogenic factor, Mn was the main non-carcinogenic factor, and the risk was higher in children than adults.\n</p>","author":"Yahong Zhou, \nYingqiu Xia, \nJingkai Zhou, \nYuhan Dai, \nYuetao Ma, \nTiebing Xu, \nZhuo Liu","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"112003239824957e937718f4851e04e9bea9897e30813467e67601003ab08fb8","category":"Environment"}