{"title":"Ascender หุ่นยนต์ดูดฝุ่นปีนบันไดตัวแรกของโลก","link":"https://www.blognone.com/node/134237","date":1686209269000,"content":"<div><div><div><p>หมดเรื่องยุ่งยากในการทำความสะอาด เมื่อสตาร์ทอัพ Migo Robotics ได้สร้าง “Ascender” หุ่นยนต์ดูดฝุ่นตัวแรกที่สามารถปีนขึ้น/ลงบันไดได้ หลังจากก่อนหน้านี้หุ่นยนต์ดูดฝุ่นแทบทุกตัวต้องการพื้นเรียบ หรืออาจจะข้ามสิ่งกีดขวางเตี้ยๆ ได้ไม่กี่เซนติเมตรเท่านั้น<br />\nAscender จะมีส่วนที่คล้ายกับขา 2 ข้างเพื่อยกตัวเครื่องให้ปีนบันไดได้ และเมื่อขึ้น/ลงในแต่ละขั้นบันไดแล้วขาทั้งคู่จะกลับมาประจำข้างตัวในลักษณะที่เหมือนกับหุ่นยนต์ดูดฝุ่นทั่วไป และจะมีล้อหมุนรอบทิศทางที่ช่วยให้ทำความสะอาดได้ในแนวข้างจากฝั่งซ้าย-ขวาโดยไม่ต้องเลี้ยวตัวเครื่อง จึงไม่ต้องกลัวว่าเครื่องจะตกจากขั้นบันได</p>\n<p>Ascender ใช้เทคโนโลยี LiDAR (light detection and ranging) เพื่อสร้างแผนที่ห้องต่างๆ ในบ้านที่ต้องการทำความสะอาด วางแผนเส้นทางสำหรับการทำความสะอาด รวมถึงผู้ใช้สามารถตั้งค่าพื้นที่ที่ไม่ต้องการให้หุ่นยนต์เข้าไปทำความสะอาดได้ผ่านแอปบนโทรศัพท์ ทั้งนี้ทางบริษัทยังไม่ได้ระบุเกี่ยวกับอายุการใช้งานแบตเตอรี่  เพียงแต่ระบุว่า Ascender นั้นสามารถทำความสะอาดพื้นได้มากถึง 5,167 ตารางฟุต</p>\n<p>Migo Robotics คาดว่าจะจัดส่ง Ascender ในเดือนสิงหาคมนี้ ในราคาเหลือ 999 ดอลลาร์หากจองล่วงหน้า ราคาปลีกปกติจะอยู่ที่ 1399 ดอลลาร์</p>\n<p>ที่มา : <a href=\"https://www.migorobotics.com/pages/ascender\">Migo Robotics</a>, <a href=\"https://gizmodo.com/migo-ascender-first-robot-vacuum-can-climb-stairs-1850515467\">Gizmodo</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f7d3e28633d6eceb93353a8b5793cb61.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/robot\">Robot</a></div><div><a href=\"/topics/vacuum-cleaner\">Vacuum Cleaner</a></div><div><a href=\"/topics/lidar\">LIDAR</a></div></div></div>","author":"ydk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"112101307fc18d29cc85a7770a376bc621a7da4eb7266a901302994e2158f612","category":"Thai"}