{"title":"Prevalence and dynamics of contraceptive use by type during the COVID-19 pandemic: Evidence from Western Iran","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300613","date":1710856800000,"content":"<p>by Serajeddin Mahmoudiani</p>\r\n\r\nContraception represents a deliberate choice made by individuals, both men and women, to regulate their desired number of children. The primary objective of this study was to examine the prevalence and predictors of contraceptive use, while also exploring the shifts in contraception methods following the COVID-19 pandemic. This study employed a quantitative approach with a survey technique. The survey was conducted in Kermanshah, one of Iran’s metropolises located in the western part of the country. The sampling methodology employed in this study involved a combination of multi-stage classification and systematic random methods. The survey took place between July and August 2022. The target population for the survey included women between the ages of 15 and 49. A total of 600 women from this population were selected and included in the survey sample. The sample was described using frequency tables, as well as central and dispersion indices (mean and standard deviation). Additionally, multivariate analysis was conducted through the application of logistic regression. Findings pointed out that approximately 65% of the women in the sample utilized contraception methods. Among these methods, the condom and oral pill were found to be the most prevalent choices. Moreover, the findings indicated that an increase in the number of both living and ideal children was associated with a decreased likelihood of contraceptive use. Following the occurrence of the COVID-19 pandemic, there was an observed increase in the utilization of traditional and natural methods of contraception. This shift highlights the importance of considering a broader range of contraceptive options and not solely focusing on restricting contraception services. In the midst of the coronavirus outbreak, women turned to traditional contraceptives, which may increase the risk of unintended pregnancies and subsequent miscarriages. Therefore, providing in-person services to women at their place of residence is necessary during epidemics.","author":"Serajeddin Mahmoudiani","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"112a96a87d19880d4fd3ade16aa61b9b4d333405e605e2e9ff61a2467cb7f781","category":"Interdisciplinary"}