{"title":"Assessing performance of an external compound parabolic concentrator solar collector with cascaded latent heat thermal storage","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14392?af=R","date":1722427964000,"content":"<h2>Abstract</h2>\n<p>This study presents quantitative results of charging experiments conducted on cascaded thermal energy storage system (CTESS) integrated with external compound parabolic concentrator solar collector (XCPCSC). Increasing mass flow rate in 2-stage CTESS integrated with XCPCSC resulted in a 30% reduction in initiation time of phase change materials (PCMs) during charging, with a higher mass flow rate of 0.025 kg/s. However, due to disparate melting point temperatures of PCMs, phase transition in the two-stage CTESS did not occur simultaneously, leading to poor heat transfer rates within the CTESS. To address this, study extended number of phases from two to three, resulting in a 1.5-fold increase in rate of heat transfer compared to 2-stage PCM system. The simultaneous melting processes at various stages in the CTESS maximized energy absorption, leading to a 25% increase in system efficiency. Notably, the values of energy stored efficiency and over-all efficiency reached their peak values of 95% and 60%, respectively, between <i>t</i> = 12.00 h and <i>t</i> = 13.00 h. This time period also saw a significant increase in collector efficiency to 72%. These quantitative findings highlight importance of mass flow rate and PCM arrangement in achieving efficient heat transfer and system performance in a CTESS integrated with XCPCSC.</p>","author":"Christopher Sathiya Satchi, \nPonrajan Vikram Muthuraman, \nAmrit Kumar Thakur, \nPinar Mert Cuce, \nErdem Cuce, \nRajaBharathi Balavadivel","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"113029fafa98aef38696dfc26495733c7e3b479bee3021bf6d813d5818e0ffb3","category":"Environment"}