{"title":"An Improved Migratory Birds Optimization Algorithm for Closed- Loop Supply Chain Network Planning in a Fuzzy Environment","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306294","date":1719496800000,"content":"<p>by Yangjun Ren, Qiong Chen, Yui-yip Lau, Maxim A. Dulebenets, Mengchi Li, Botang Li, Mark Ching-Pong Poo, Pengfei Zhang</p>\r\n\r\nRecycling of used products can provide substantial economic and environmental benefits for supply chain players. However, many factors associated with the design of closed-loop supply chain networks are uncertain in their nature, including demand, opening cost of facilities, capacity of opened facilities, transportation cost, and procurement cost. Therefore, this study proposes a novel fuzzy programming model for closed-loop supply chain network design, which directly relies on the fuzzy ranking method based on a credibility measure. The objective of the presented optimization model aims at minimizing the total cost of the network when selecting the facility locations and transportation routes between the nodes of the network. Based on the problem characteristics, a Migratory Birds Optimization Algorithm with a new product source encoding scheme is developed as a solution approach. The inspiration for the product source coding method originates from the label information of raw material supplier and manufacturing factories on product packaging, as well as the information of each logistics node on the delivery order. This novel encoding method aims to address the limitations of four traditional encoding methods: Prüfer number based encoding, spanning tree based encoding, forest data structure based encoding, and priority based encoding, thereby increasing the likelihood of heuristic algorithms finding the optimal solution. Thirty-five illustrative examples are developed to evaluate the proposed algorithm against the exact optimization method (LINGO) and a Genetic Algorithm, Ant Colony Optimization, Simulated Annealing, which are recognized as well-known metaheuristic algorithms. The results from extensive experiments show that the proposed algorithm is able to provide optimal and good-quality solutions within acceptable computational time even for large-scale numerical examples. The suitability of the model is confirmed through a meticulous sensitivity analysis. This analysis involves adjusting the confidence level incrementally from 50% to 100%, in 5% intervals, with respect to the model’s uncertain parameters. Consequently, it yields valuable managerial insights. The outcomes of this research are expected to provide scientific support for related supply chain enterprises and stakeholders.","author":"Yangjun Ren","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1143b91446cefb212ca9959a9cfb84efdebcd23baf87cc54a944730b1afb4907","category":"Interdisciplinary"}