{"title":"How to true a bicycle wheel | 4 essential principles to get your wheels straight","link":"https://www.bikeradar.com/advice/workshop/how-to-true-a-wheel/","date":1697900445000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/BikeRadar160823kg0321-db3af49.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/10/BikeRadar160823kg0321-db3af49.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/BikeRadar160823kg0321-db3af49.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/BikeRadar160823kg0321-db3af49.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/BikeRadar160823kg0321-db3af49.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/BikeRadar160823kg0321-db3af49.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/BikeRadar160823kg0321-db3af49.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/BikeRadar160823kg0321-db3af49.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/BikeRadar160823kg0321-db3af49.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/10/BikeRadar160823kg0321-db3af49.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Mechanic truing wheel on wheel truing stand\" title=\"Mechanic truing wheel on wheel truing stand\" />                                            <p>Truing is the act of adjusting the tension of a wheel’s spokes to make it perfectly straight and round.</p>\n<p>Truing is a normal part of any wheel’s life. Wheels are subject to extreme forces, from withstanding a clattering from an unexpected pothole or rough riding off-road. Over time, or in the case of a heavy hit, this may cause the wheel to go ‘out of true’.</p>\n<p>This presents itself as a wobble in the side-to-side (lateral) trueness of the wheel, or its roundness (radial).</p>\n<p>A wheel that is out of true won’t handle well when riding and will potentially shorten the lifespan of the components. If your bike has <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-brakes/\">rim brakes</a>, the rim may contact the pads as it spins. In extreme cases, it could even cause the rear tyre to abrade on the inside of the seatstays or chainstays.</p>\n<p>In this guide, we’ll run through the four main principles you need to know when truing a wheel.</p>\n<p>Because there is so much nuance to wheel building, this guide is by no means exhaustive and is intended as a reference point to get your wheel back into working order.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Hunt 4 Season Aero road wheelset\" title=\"Hunt 4 Season Aero road wheelset\" />\n\n</div><div><figcaption><span><i></i> We recommend practising on an old wheel to build up your skills.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Wheel truing requires a basic understanding of the principles of wheel building, patience and practice – you are very unlikely to get it right on your first go.</p>\n<p>If you are new to wheel truing, we would strongly recommend you practise on an old wheel first. Exotic carbon wheels are best left for when you have lots of experience.</p>\n<p>Before truing a wheel, it’s worth checking if the hub is properly adjusted. Any play in the hub will be amplified on the truing stand. We have a full guide on <a href=\"https://www.bikeradar.com/advice/workshop/how-to-service-the-hubs-on-your-bike/\">how to service a hub</a>.</p>\n<h2>Tools required</h2>\n<ul>\n<li>Wheel truing stand</li>\n<li>Relevant spoke keys</li>\n<li>Bladed spoke holder (if your wheel has bladed spokes)</li>\n<li>Wheel alignment (dishing) gauge</li>\n<li>Spoke tensiometer (recommended but not essential)</li>\n</ul>\n<h3>Wheel truing stand</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"DT Swiss Wheel Truing Stand on a desk\" title=\"DT Swiss Wheel Truing Stand on a desk\" />\n\n</div><div><figcaption><span><i></i> A truing stand magnifies any problems at the rim.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>A dedicated wheel truing stand is a significant investment, with the majority of options ranging from £80 to £500.</p>\n<p>As such, it’s only worth investing in one if you know you are going to make good use of it – or perhaps chip in and buy one as a group of friends and share it around.</p>\n<p>More expensive truing stands will be built to tighter tolerances and may include additional features, such as having two caliper jaws, dial indicators or built-in dishing.</p>\n<p>Many stands require calibrating, where the uprights are perfectly centered to give an accurate reading of wheel dishing (we’ll come onto this in more detail later, but it means how central the rim is over the hub). If your stand uses this design, make sure you keep it in a safe place to avoid it getting knocked.</p>\n<p>If you don’t want to invest in a truing stand, you could turn the bike upside down and use cable ties around the frame to act as your reference points and you could judge the tension of the spokes by feel.</p>\n<h3>Spoke keys</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"DT Swiss and Park Tool spoke key selection\" title=\"DT Swiss and Park Tool spoke key selection\" />\n\n</div><div><figcaption><span><i></i> Spoke keys come in all shapes and sizes.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>You must make sure you have the correct spoke key for your nipples.</p>\n<p>Although there are many variations, most conventional spoke nipples (the nut that threads onto the end of the spoke) have four wrench flats. You can use a vernier caliper to determine the width of the flat.</p>\n<p>A spoke key that is too large may round the corners of the nipple, whereas one that is undersized simply won’t fit. If you’re unsure, buy a spoke key with multiple nipple sizes (we like the <a href=\"https://www.amazon.co.uk/CYCLO-Outdoor-Sports-Triple-3-45-3-3-3-23mm/dp/B004NT78FY?tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">Cyclo triple spoke key</a>).</p>\n<p>Some spoke nipples don’t use wrench flats and require a specialist tool instead, such as the nipples used on Mavic’s Zicral spokes.</p>\n<p>Some spokes require adjusting at the hub, whereas others are internally accessed and require the rim tape to be removed.</p>\n<p>If the spokes are bladed, you’ll also need to buy a bladed spoke holder so that the blade doesn’t twist around when you adjust the spoke.</p>\n<h2>How to true a wheel</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Mechanic truing wheel in truing stand\" title=\"Mechanic truing wheel in truing stand\" />\n\n</div><div><figcaption><span><i></i> Make sure the wheel is installed properly in the stand.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Wheel truing is essentially the act of balancing four variables – how true the wheel is laterally, radially, if it’s dished correctly and if the tensions are correct.</p>\n<p>It’s first wise to check for any obviously loose spokes, either by hand or with a tensiometer</p>\n<p>It’s best to remove the tyre when truing a wheel because it’s much harder to accurately gauge how radially true the rim is with the tyre installed.</p>\n<p>We’d also recommend checking the upper and lower limit spoke tensions so you know they’re in the correct range and to avoid overtightening them. You should check with the rim manufacturer because this will almost always be lower than the upper limit of the spoke itself.</p>\n<p>If you overtighten a spoke, it’s likely to break or damage the rim. On custom wheel builds, the spoke tensions are often calculated for the rider’s weight.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Mechanic truing wheel on wheel truing stand\" title=\"BikeRadar_160823_kg0323\" />\n\n</div><div><figcaption><span><i></i> We recommend making small adjustments at a time – wheel truing can very quickly go wrong if you take a gung-ho approach.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>We like to check the tensions of the spokes before truing so we have a starting reference point. To check the recommended tension, you need to know the diameter and the material of the spoke. You can then look these up on a table – Park Tool supplies its truing stand with a tension meter chart.</p>\n<p>If your truing stand has two caliper jaws, the wheel should be placed in the stand so the <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-rotors/\">disc brake rotor</a> is on the left-hand side when looking at the stand from in front.</p>\n<p>If your stand only has one, you’ll need to rotate the wheel periodically to check both sides.</p>\n<section>\n    <div>\n        \n<h3>Wheel truing in a nutshell</h3>\n<ol>\n<li>Work on the wheel’s lateral true</li>\n<li>Then move on to radial true</li>\n<li>De-stress the spokes and repeat steps 1 and 2 until you are happy with the result</li>\n<li>Check the wheel is dished correctly</li>\n<li>De-stress again if you need to make any adjustments</li>\n<li>Check the tensions are all in range</li>\n</ol>\n<p>\n\n    </p></div>\n    </section>\n\n<h2>Lateral truing (side-to-side)</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Lateral truing on a wheel\" title=\"Lateral truing on a wheel\" />\n\n</div><div><figcaption><span><i></i> Keep drawing the jaws in until the rim makes contact.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Lateral truing is the correcting of any side-to-side wobbles.</p>\n<p>Spin the wheel slowly in the truing stand and wind the caliper jaws in until you see and hear one part of the rim make contact with either jaw.</p>\n<p>If the rim hits the left jaw, we either need to tighten a spoke on the right to pull the rim over to that side or loosen a spoke on the left to relieve tension on that side. If the rim hits the right jaw, the opposite would be true.</p>\n<p>Identify the spoke that needs adjusting. Buckles aren’t necessarily isolated at one spoke, and you may need to adjust several spokes on one side.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"v\" title=\"BikeRadar_160823_kg0319\" />\n\n</div><div><figcaption><span><i></i> Try to push the spoke key fully down to avoid stripping the nipple.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Looking at the spoke in front of the truing stand, turning the spoke nipple clockwise adds tension and anti-clockwise loosens the spoke.</p>\n<p>We recommend adjusting the spoke in quarter (or even eighth) turns so you can monitor any changes carefully.</p>\n<p>If you want to get an idea of what tightening a spoke will do, squeeze it with your finger and you’ll be able to see the result.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Mechanic squeezing two spokes\" title=\"Mechanic squeezing two spokes\" />\n\n</div><div><figcaption><span><i></i> Squeezing the spokes prior to adjustment gives you an indication of what will happen.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Once you’ve sorted the first area out, identify the next problem area by winding in the caliper jaws until another area of the rim makes contact.</p>\n<p>Keep working on the lateral true until you are happy with the result.</p>\n<p>If the spoke is hard to turn (and isn’t towards the top of its recommended tension) or creaks, it’s worth adding a drop of lubricant to the spoke nipple, provided that’s within the purview of the rim manufacturer.</p>\n<h2>Radial truing (the roundness or up-and-down)</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Checking the radial true of a wheel.\" title=\"Checking the radial true of a wheel.\" />\n\n</div><div><figcaption><span><i></i> The tyre must be removed for radial truing.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Although a rim might be laterally true, that doesn’t mean it is radially.</p>\n<p>Align the calipers under the rim to check where the rim is out of true, moving them up until they make light contact.</p>\n<p>A section of the rim may move inward towards the rim or outward away from the rim.</p>\n<p>With radial truing, we work on pairs of spokes to pull the rim in or push it away.</p>\n<p>Identify the two spokes nearest the problem and tighten each by a quarter turn to move the section towards the rim or loosen to move away from the rim.</p>\n<p>As with lateral truing, if you want to look at the result before you make an adjustment, squeeze the two affected spokes and see what the result is. Radial truing may also extend across more than two spokes.</p>\n<p>We’d recommend first focusing on spokes that have a ‘high spot’ (where the rim of the wheel moves further out). By sorting these spokes first, you’ll minimise the ‘low spots’ when you come to adjust these afterwards.</p>\n<p>When you make radial corrections, the lateral truing will likely be affected. We’d recommend re-checking the lateral true every three or four radial adjustments.</p>\n<h2>Wheel dishing</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Park Wheel Alignment Gauge WAG\" title=\"Park Wheel Alignment Gauge WAG\" />\n\n</div><div><figcaption><span><i></i> This tool tells you how central the rim is over the hub.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>The dish of the wheel refers to how central the rim is over the hub.</p>\n<p>Some wheel truing stands have a dishing feature built in, whether that’s a mark on the stand to signify its central point or the caliper jaws are calibrated to be in a certain position.</p>\n<p>Although we wouldn’t recommend this method because it’s inaccurate, you can use the bike’s frame as a way of testing the dish, which will suffice in a pinch.</p>\n<p>However, even if you have a stand with a built-in dishing feature, it’s always best to use a dedicated tool to check in case the stand isn’t calibrated correctly.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Park WAG wheel alignment gauge being placed on wheel\" title=\"Park WAG wheel alignment gauge being placed on wheel\" />\n\n</div><div><figcaption><span><i></i> The sliding blocks rest on the rim.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Employing a specific wheel alignment gauge, use the two sliding blocks of the tool to rest them on either side of the rim.</p>\n<p>Lower the gauge of the tool so it touches the outermost axle locknut or end cap (depending on your wheel).</p>\n<p>Then, flip the wheel around and inspect if the gauge of the tool contacts the axle locknut on the opposite side.</p>\n<p>Because the dishing tool magnifies any problems, a 1mm gap will equate to about 0.5mm when the wheel is installed on the bike.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"This wheel looks good to go.\" title=\"Park WAG wheel alignment gauge being placed on wheel\" />\n\n</div><div><figcaption><span><i></i> This wheel looks good to go.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>There are three possible scenarios – if there’s no significant gap, you’re good to go because the wheel is properly dished.</p>\n<p>The second scenario is there will be a gap between the gauge and the axle locknut. As a general guide, if it’s less than 1mm, you’re okay, but if the gap is larger, the dishing will need to be adjusted.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Park WAG wheel alignment gauge being placed on wheel\" title=\"Park WAG wheel alignment gauge being placed on wheel\" />\n\n</div><div><figcaption><span><i></i> The gap is well over 1mm here, therefore requires adjustment.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>The third scenario is the gauge will sit below the locknut face. In this scenario, we’d recommend resetting the tool using this side as the initial reference and then flipping it around – this will then result in a gap between the axle and foot of the tool as in the second scenario.</p>\n<p>If you need to bring the rim further to the driveside, starting at the valve hole so you have a point of reference, equally tighten all the non-driveside spokes half a turn.</p>\n<p>If the rim needs to be pulled further towards the non-driveside, tighten all the driveside spokes half a turn.</p>\n<p>Before you adjust all of the spokes, it’s worth checking the tensions. When you tighten all of them, both sides will tighten and you want to make sure you’re not going to go over the maximum recommended spoke tension.</p>\n<p>Like lateral or radial truing, tightening isn’t necessarily always the best option. You could loosen one side by half a turn to achieve the same result if the tensions are already towards the upper limit.</p>\n<p>Once the rim’s dish is within tolerance, you should check the lateral and radial true again.</p>\n<h2>Spoke tension</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Park TM-1 Spoke Tension Meter\" title=\"BikeRadar_160823_kg0300\" />\n\n</div><div><figcaption><span><i></i> A spoke tensiometer is an invaluable tool.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>The correct spoke tension is crucial to the performance of your wheel, ensuring its structural integrity.</p>\n<p>If it’s too low, the wheel will flex when you’re riding and wobble. You risk cracking the rim and hub, or damaging spokes if the tension is too high.</p>\n<p>If you’re unsure what spoke tensions your wheel uses, consult with your wheel or rim manufacturer.</p>\n<p>Spoke tensions are measured in kgf (kilograms-force). Recommended spoke tensions are given when the tyre is removed because the tensions will change once a tyre is installed.</p>\n<div></div>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Mechanic checking tension of spokes with Park TM-1\" title=\"Mechanic checking tension of spokes with Park TM-1\" />\n\n</div><div><figcaption><span><i></i> You can see the spoke flexing here.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>The best way to measure spoke tension is to use a specific tensiometer. This tool flexes the spokes between two posts via a calibrated spring and the amount of deflection is shown on the scale.</p>\n<p>If you don’t have a tensiometer, you could pluck the spokes and listen to their tone, but this isn’t the most accurate method.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Park TM-1 Spoke Tension Meter\" title=\"Park TM-1 Spoke Tension Meter\" />\n\n</div><div><figcaption><span><i></i> The reading will need converting to kgf on this Park TM-1 tension meter.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>If you are using a Park Tool TM-1 tension meter, it’s important to note the tool doesn’t measure in kgf. You need to refer to a table, which then converts the figure portrayed on the TM1 to kgf.</p>\n<h2>De-stress the wheel</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Oscar Huckle de-stressing wheel\" title=\"Oscar Huckle de-stressing wheel\" />\n\n</div><div><figcaption><span><i></i> The job is all for nothing if you don’t de-stress the wheel.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Once you are happy with your work, remove the wheel from the stand and grip the wheel horizontally with your hands on the top rim in the 10 and 2 o’clock positions.</p>\n<p>Press the wheel down on your thighs, applying pressure through your forearms. Make sure you’re wearing an apron or something protective because rims are often dirty. Don’t worry if you hear the spokes pinging – that’s the sound of the heads settling into place.</p>\n<p>Work your way around the wheel to evenly de-stress it.</p>\n<p>Another way we like to de-stress the wheel is to press against it while it’s lying on the floor.</p>\n<p>You may see examples of mechanics standing on a rim. While this also de-stresses it (and the rim should be able to withstand the force), our method is less destructive.</p>\n<p>Once de-stressed, check your work on the truing stand and repeat the above four steps as necessary.</p>\n<h2>When should I stop?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Mechanic truing wheel\" title=\"Mechanic truing wheel\" />\n\n</div><div><figcaption><span><i></i> This wheel is well within tolerance.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>For reference, the tolerance according to British Standard BS 6102 for a rim brake wheel is 2mm, whereas there’s more leeway with disc brake wheels at 4mm. However, that’s quite generous.</p>\n<p>We would generally suggest stopping when the rim is within 0.5mm laterally and radially, after the wheel has been sufficiently de-stressed and at the correct tension.</p>\n<p>Of course, many pride themselves (especially master wheel builders) on being able to get a wheel as true as possible in the pursuit of perfection.</p>","author":"Oscar Huckle","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"11459b4290ee8f2a5a83b5983842a3e7bf54b996638fdc637ef90cbbcbccd2d5","category":"Cycling"}