{"title":"Tour de France 2023 Predictions - Yellow jersey winner, stage victors, the best team and more","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2023-predictions-yellow-jersey-winner-stage-victors-the-best-team-and-more","date":1687357536000,"content":"\n      <p><span>The biggest race in the cycling calendar is fast approaching in the form of the 2023 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>. Steep roads and wild fans await the peloton in the Basque Country for the race’s Grand Départ and the stakes are as high as ever for this year’s edition of the race. </span></p>\n<div></div>\n<p><span>2023 winner Jonas Vingegaard returns to defend his yellow jersey, but two-time winner Tadej Pogačar is hungry to reaffirm his dominance. Mark Cavendish is looking to get his 35th stage win, but there’s a stacked list of fast sprinters who are going to make his life difficult. There’s breakaway specialists who are ready to pounce when the chances arise, and Tour de France debutants who could really make their mark on this race.</span></p>\n<p><span>So who will come away from the Tour satisfied and who will be left wanting more? These are our predictions of the winners and losers.</span></p>\n<h3>Yellow jersey winner</h3>\n<p><span>There is no denying that the yellow jersey is the most coveted prize in cycling. Winning the Tour de France is the dream of many professional riders and, for the few who succeed, it changes their lives forever. That very thing happened for Jumbo-Visma’s Jonas Vingegaard last year when he surprised many by beating two-time Tour de France winner Tadej Pogačar, dropping him on the brutal Col du Granon in a stage that will go down for the ages. Both riders return to the Tour in 2023 with Vingegaard hoping to defend his title and Pogačar with dreams of getting back to the top step of the podium, but who will get the outcome they are hoping for?</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-06379_1024x1024.jpg?v=1687278686\" alt />We’re betting on Jonas Vingegaard to win a second consecutive yellow jersey at the 2023 Tour de France. The Danish rider has been in imperious form so far this season, winning the recent Critérium du Dauphiné with apparent ease. Pogačar, on the other hand, has been unable to race since he crashed out of Liège-Bastogne-Liège in April – he suffered a broken wrist in the accident and, although he is back in training, will not race before he stands on the start line of the Tour de France in July outside of his National Championships. Pogačar isn’t a rider who should be underestimated and there’s every chance that he will still be dominant despite his lack of racing in the lead up to the Tour, but Vingegaard’s supremacy at the Dauphiné is telling us that the Danish rider will get the top spot. Jumbo-Visma also come to the race with an incredibly strong line-up including the likes of Wout van Aert, Sepp Kuss, Christophe Laporte, Tiesj Benoot and more – Vingegaard will have a solid team around him who can protect him both on the flat and in the mountains.</span></p>\n<h3>Best sprinter</h3>\n<p><span>The beauty and complexity of the Tour de France is that it is about far more than just the battle for the overall general classification victory. Stage wins for sprinters on the flatter days of the Tour are extremely coveted – Mark Cavendish currently shares the record for the most Tour de France stage wins with Eddy Merckx, both riders have won 34 stages in their respective careers. In 2023, Cavendish will ride his final Tour de France with Astana-Qazaqstan with the aim of getting one final stage win so he can hold the record of the winningest rider in Tour history. However, for the British sprinter who is in the twilight of his career, a stage win in the 2023 edition of Le Tour is  a tall order, he has some tough competition to contend with.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-04623_1024x1024.jpg?v=1687278076\" alt /></span><em><span>Fabio Jakobsen wins stage two of the 2023 Tour de France (Image: Zac Williams/SWpix)</span></em></p>\n<p><span>The likes of Caleb Ewan (Lotto-Dstny), Dylan Groenewegen (Jayco-Alula), Sam Welsford (Team dsm-fermenich), Biniam Girmay (Intermarché - Circus - Wanty), Fabio Jakobsen (Soudal–Quick-Step), Wout van Aert (Jumbo-Visma) and Jasper Philipsen (Alpecin-Deceuninck) are just a few of the main sprinters who will want to challenge Cavendish for stage wins. Record or no record, victories will not be gifted to the Manxman in this Tour de France. Of the stacked list of sprinters taking part in the race, we expect Jakobsen to be the best of the bunch. Quick Step have a team almost solely dedicated to leading out the Belgian, with Danish rider Michael Mørkøv (widely regarded as the best lead out man in the world), serving as Jakobsen’s last man. Mørkøv’s wheel can give sprinters a red carpet ride to the finish line and it led Jakobsen to two stage victories at the Baloise Belgium Tour recently, the penultimate race that Jakobsen will do before the Tour de France. It should be on stages three and four that the sprinters get their first chances to shine after a hilly opening two days in the Basque Country and Jakobsen will be leading the charge in the colours of </span><span>Soudal–Quick-Step</span>.</p>\n<h3>Best debutant</h3>\n<p><span>This year’s Tour de France sees a number of riders taking on the three week race for the first time in their careers. The youngest rider on the current startlist is Carlos Rodríguez of the Ineos Grenadiers and it will also be the Spanish rider’s first ever attempt at La Grande Boucle. Rodríguez recently won the white jersey at the Critérium du Dauphiné and finished ninth overall. His role for Ineos at the Tour de France is currently unclear, but he will either be one to watch in the white jersey competition if he is riding for GC, or fight for stage wins if he is given the freedom to get in the breakaways when the opportunity arises. </span></p>\n<p><span>Another rider competing in the Tour de France for the first time is Mattias Skjelmose of Lidl-Trek. Skjelmose surprised many by taking victory at the recent <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-suisse-all-the-essential-info\">Tour de Suisse</a>, riding with impressive strength and maturity. Skjelmose’s performances so far this season have been beyond expectations, he was second in La Flèche Wallonne – the parcours of which are similar to the opening stages in the Basque Country in this year’s Tour de France. From Bora-Hansgrohe, this is also the first time that last year’s <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> winner Jai Hindley will race in the Tour de France – he is one to watch for the general classification. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-08274_1024x1024.jpg?v=1687278140\" alt /><em>Mattias Skjelmose at the Tour de Suisse (Image: Zac Williams/SWpix)</em></span></p>\n<p><span>On the side of the sprinters, Biniam Girmay starts in the Tour de France for the first time in his career this year – the Eritrean rider proved he was back to winning form at the Tour de Suisse when he outsprinted Arnaud Démare and Wout van Aert on stage two. We can expect more of this from Girmay in the Tour. Sam Welsford of Team DSM has proven to be another promising fast man so far in his career so could be one to keep an eye on during the flatter stages. It will certainly be a test to see if Welsford, who originally comes from track cycling, can get himself over the arduous mountain tests of the Tour de France.</span></p>\n<p><span>Of all the debutants in this year’s race, we expect Skjelmose and Girmay to be the two key riders to watch.</span></p>\n<h3>Breakaway specialists</h3>\n<p><span>And for the days in between, that aren’t for the sprinters and aren’t for the general classification riders, there are chances for the breakaway. The Tour de France provides unusual opportunities for riders with varied skill sets to take stage wins – there is often little incentive for the strong GC teams to chase down the breakaway if it contains riders who aren’t of any danger for challenging for yellow. This means that riders who are brave, courageous and believe in their chance to win can often leave the Tour de France with stage wins to their name – something that has the potential to change a rider’s career path forever. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography--Giro-d_Italia-2023---Stage-15-01961_1024x1024.jpg?v=1687278285\" alt /></span><em><span>Magnus Cort at the 2023 Giro d'Italia (Image: Zac Williams/SWpix)</span></em></p>\n<p><span>Every year as the Tour rolls round, there are the usual candidates that we can expect to make themselves known in the breakaways when the chances arise. EF Education-EasyPost are a team with a number of riders who can perform well from a small group and play the breakaway game well. Magnus Cort, Alberto Bettiol and Nielson Powless are all riders from the team in pink who we can expect to see fighting to make the move when the time comes. Fred Wright of Bahrain-Victorious was a common face seen in the breakaway in last year’s Tour de France, coming close to stage wins on multiple occasions – he’ll be hoping to finally secure his first professional victory this season. His teammate, Matej Mohorič, is one to watch for the breakaway and intermediate days too. Julian Alaphilippe of </span><span>Soudal–Quick-Step</span> will dream of a stage win on those opening punchy stages in the Basque Country.</p>\n<p><span>Valentin Madouas and Thibaut Pinot (Groupama-FDJ) are a duo who could fight for stage wins on the hillier days, but this will depend on if Pinot goes for the general classification or not. In fact, there are quite a few riders who fall in the category of those who could target the overall GC, but will move to hunting stage wins if they end up losing time due to a mishap in the earlier stages. These include the likes of Michael Woods and Nick Schultz (Isreal-Premier Tech) and Tom Pidcock (Ineos-Grenadiers). Wildcard team UNO-X Pro Cycling will also want to prove worthy of their spot in the race this year and will certainly be active in breakaways, Tobias Halland Johannessen and Anthon Charmig are two of their riders who could be up there on the hillier stages.</span></p>\n<h3>Most successful team</h3>\n<p><span>The official team classification at the Tour de France is decided by taking the time of each squad’s top three finishers on every stage (apart from in a team time trial, when the time of the fifth rider to cross the finish is counted, or the last if there are fewer than five riders remaining.) The team with the lowest cumulative time across the race so far leads the classification. It isn’t a classification that team’s normally target and doesn’t usually represent the overall success of a team – it doesn’t take into account stage wins or the work of domestiques.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-05556_1024x1024.jpg?v=1687278403\" alt /></span><em><span>Jumbo-Visma after the 2022 Tour de France (Image: Zac Williams/SWpix)</span></em></p>\n<p><span>We think that a team’s success at the Tour de France should be judged with a wider view than the current team classification shows – stage wins, team unity and tactics also should play a part in deciding which team has given the best performance. In 2023, we’re finding it hard to look past Jumbo-Visma as the strongest team in the race. Wout van Aert can perform well in the sprint stages and intermediate stages, but has also proven his ability to be a impressive mountain domestique; Sepp Kuss is consistently reliable in the high mountains too, able to ride with the strongest climbers; Christophe Laporte, Nathan Van Hooydonck and Tiesj Benoot are all-rounders who can protect Vingegaard when necessary and also go for stage wins themselves if given the chance; while Wilco Kelderman is another rider to rely on in the mountains – proving that with his recent fourth place finish at the Tour de Suisse. Jumbo-Visma will come to the Tour as defending champions and know how to win a three-week race.</span></p>\n<h3>Dutiful domestique</h3>\n<p><span>The role of a domestique is one of the most important in cycling – a good domestique can make the difference between their leader winning and losing a Grand Tour. Wout van Aert proved himself to be one of the best in the race in last year’s Tour de France, sacrificing his own chances of stage wins when required to help Vingegaard and Jumbo-Visma, notably on the cobbles in stage five. Similarly Brandon McNulty and Mikkel Bjerg were extremely valuable to Pogačar in the latter stages of last year’s race when he was trying to hold on to the yellow jersey – the Tour de France is not a race that can be won alone.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-04546_1024x1024.jpg?v=1687278509\" alt /><em>Sepp Kuss during stage 18 of the 2022 Tour de France (Image: Zac Williams/SWpix)</em></span></p>\n<p><span>In 2023, we expect Sepp Kuss to be an extremely valuable domestique to Vingegaard in the high mountains. The American rider likely has the class and talent to go for a Tour de France victory himself, but has spoken publicly about enjoying the role of a domestique and being at peace with sacrificing his own chances. Last year, Kuss was absolutely crucial to Jumbo-Visma’s victory, able to stay with Vingegaard and Pogačar on the hardest sections of the most difficult mountain stages. Similarly, Rafał Majka is going to be crucial to Pogačar in the mountains – the Polish rider was forced to abandon last year’s Tour on stage 17 but has proven this season that he is in good form ahead of the Tour. Whichever domestique can do the best work for their leader as late into the race as possible will be seen as the most valuable – it’s important that a team has as many riders as they can as the stages get difficult.</span></p>\n<p><em><span>Cover image: Zac Williams/SWpix</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"114acbb5e829ed48b446cdb5808c762b5cffa40c9cb62a375b0bfa9e1cd9478b","category":"Cycling"}