{"title":"Fighting VPN criminalization should be Big Tech’s top priority, activists say","link":"https://arstechnica.com/?p=1923060","date":1679310057000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/criminalizing-vpn-800x450.jpg\" alt=\"Fighting VPN criminalization should be Big Tech’s top priority, activists say\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/criminalizing-vpn.jpg\">Enlarge</a> (credit: Aurich Lawson | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>“Women, life, freedom” became the protest chant of a revolution still raging in Iran months after a 22-year-old Kurdish woman, Mahsa Amini, died while in custody of morality police. Amini was arrested last September for “improperly” wearing a hijab and violating the Islamic Republic's mandatory dress code laws. Since then, her name has become a viral hashtag invoked by millions of online activists protesting authoritarian regimes around the globe.</p>\n<p>In response to Iran's ongoing protests—mostly led by women and young people—Iranian authorities have increasingly restricted Internet access. First, they temporarily blocked popular app stores and indefinitely blocked social media apps like WhatsApp and Instagram. They then implemented sporadic mobile shutdowns wherever protests flared up. Perhaps most extreme, authorities responded to protests in southeast Iran in February by blocking the Internet outright, <a href=\"https://english.alarabiya.net/News/middle-east/2023/02/24/New-protests-in-Iran-s-southeast-as-internet-blocked-Activists\">Al Arabiya reported</a>. Digital and human rights experts say motivations include controlling information, keeping protestors offline, and forcing protestors to use state services where their online activities can be more easily tracked—and sometimes trigger arrests.</p>\n<p>As getting online has become increasingly challenging for everyone in Iran—not just protestors—millions have learned to rely on virtual private networks (VPNs) to hide Internet activity, circumvent blocks, and access accurate information beyond state propaganda. Simply put, VPNs work by masking a user's IP address so that governments have a much more difficult time monitoring activity or detecting a user's location. They do this by routing the user's data to the VPN provider's remote servers, making it much harder for an ISP (or a government) to correlate the Internet activity of the VPN provider's servers with the individual users actually engaging in that activity.</p></div><p><a href=\"https://arstechnica.com/?p=1923060#p3\">Read 47 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1923060&amp;comments=1\">Comments</a></p>","author":"Ashley Belanger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"114d073ed75712f0fce43aef700007c0d278cacf80ec07acea61babf54464744","category":"Tech"}