{"title":"360 Turbine Technology: Leatt’s take on anti-rotational technology","link":"https://www.bikeradar.com/advertising-feature/leatt-360-turbine/","date":1690970400000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Leatt-Turbine-360-explainer-advertorial-6-7701d4b.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Leatt-Turbine-360-explainer-advertorial-6-7701d4b.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Leatt-Turbine-360-explainer-advertorial-6-7701d4b.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Leatt-Turbine-360-explainer-advertorial-6-7701d4b.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Leatt-Turbine-360-explainer-advertorial-6-7701d4b.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Leatt-Turbine-360-explainer-advertorial-6-7701d4b.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Leatt-Turbine-360-explainer-advertorial-6-7701d4b.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Leatt-Turbine-360-explainer-advertorial-6-7701d4b.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Leatt-Turbine-360-explainer-advertorial-6-7701d4b.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/Leatt-Turbine-360-explainer-advertorial-6-7701d4b.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Leatt Turbine 360 explainer advertorial 6\" title=\"Leatt Turbine 360 explainer advertorial 6\" />                                            <p>Fun, fitness, excitement – the reasons for riding bikes are numerous and personal. As committed cycling addicts, we are forever celebrating the positives, but our favourite activity also comes with an element of risk.</p>\n<p>It was a reality that Leatt founder, Dr Chris Leatt, faced in 2001 when a fellow motocross rider died on the tracks, and he set his sights on designing a neck brace to help prevent future tragedies.</p>\n<p>The South African company has since devised safety solutions for cyclists and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-body-armour/\">full-body protection</a> for mountain bikers. In 2017, Leatt introduced new helmet protection called 360 Turbine Technology. This is claimed to protect riders from both low-speed linear impacts and rotational acceleration. It features across the full range of Leatt helmets, including the MTB 3.0 Enduro.</p>\n<p>We caught up with Dr Leatt to discuss some of the finer details of 360 Turbine Technology and the MTB 3.0 <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-enduro-helmets/\">Enduro helmet</a>.</p>\n<h2>Ultimate protection</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Leatt Lab - Lab 032\" title=\"Leatt Lab - Lab 032\" /></div><div><figcaption><span><i></i> Leatt’s Turbine 360 technology uses small gel-like tabs designed to help protect the brain from rotational impacts.</span></figcaption><span> <i>Leatt</i></span></div>\n<p>Anti-impact technology in cycling helmets is not new. <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-mips/\">MIPS</a> (Multi-directional Impact Protection System) is a familiar safety feature across <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-helmets/\">road helmets</a> and MTB lids. Designed to protect the brain from rotational impact, MIPS is a thin layer that sits between the EPS foam and helmet liner.</p>\n<p>Leatt’s 360 Turbine Technology looks altogether very different. Small, round ‘turbines’ made from a soft gel-like substance are positioned strategically around the helmet, hardening on impact to help protect the brain.</p>\n<p>“Instead of one large slip-plane, Leatt chose to develop multiple smaller ones, that when displaced act as a slip-plane, but have the added advantage of also being able to offer low-speed linear dampening, not included in larger slip-plane technologies,” explains Dr Leatt.</p>\n<p>The company developed the technology to meet the HIC (Head Injury Criteria) as assessed by helmet standards organisations, such as SNELL, ECE and DOT.</p>\n<p>“In the past,” explains Dr Leatt, “it was thought that linear deceleration was the only important consideration for the risk of brain injury. We now know that brain rotational accelerations and velocities are of great importance when assessing the risk of brain injury and new computations for the risk of brain injury have been added to standard helmet testing, including these parameters.”</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Leatt Turbine 360 explainer advertorial 11\" title=\"Leatt Turbine 360 explainer advertorial 11\" /></div><div><figcaption><span><i></i> Leatt’s technology is claimed to reduce the chances of concussion.</span></figcaption><span> <i>Leatt</i></span></div>\n<p>While we are all aware that high-velocity impact can be catastrophic, those small falls and incidental bumps can also have a negative impact.</p>\n<p>“The 360 Turbine Technology not only mitigates against rotational acceleration, but also low-speed linear impacts, that if repeated, can have a cumulative effect on the frequency and severity of <a href=\"https://www.bikeradar.com/advice/health/concussion-and-cycling/\">concussion</a>, which may lead to the development of chronic degenerative brain conditions like CTE (Chronic Traumatic Encephalopathy),” says Dr Leatt.</p>\n<h2>Science behind the thrill</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"The Turbine 360 tabs harden on impact.\" title=\"Leatt Lab - Lab 007\" /></div><div><figcaption><span><i></i> The Turbine 360 tabs harden on impact.</span></figcaption><span> <i>Leatt</i></span></div>\n<p>Based in Dr Leatt’s state-of-the-art lab facilities in Cape Town, the team set to work developing 360 Turbine Technology by designing disc-shaped turbines constructed from an energy-absorbing material. This non-Newtonian polymer is said to absorb energy and the turbines are placed on the inside of the helmet’s EPS liner.</p>\n<p>“When you put the helmet on, they are positioned directly against the skull and are ready to protect you,” explains Dr Leatt. “In a crash, these turbines deform, reducing rotational impact forces and absorbing energy from the impact. This technology can thereby absorb both rotational impact forces, as well as low-speed linear impact forces in a crash.”</p>\n<h2>Safety for all</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Leatt Turbine 360 explainer advertorial 11\" title=\"Leatt Turbine 360 explainer advertorial 11\" /></div><div><figcaption><span><i></i> Turbine 360 is available on all of Leatt’s helmets.</span></figcaption><span> <i>Leatt</i></span></div>\n<p>Leatt has applied the 360 Turbine Technology to its full range of helmets, including the MTB 3.0 convertible enduro helmet. Despite weighing in at just 760g, it still meets the AS/NZS 2063:2008, EN1078, CPSC 1203 and ASTM F1952–10 safety standards, proving you don’t have to trade in safety for weight.</p>\n<p>Dr Leatt says the technology is designed to suit all styles of riding. “Rotational and linear forces act on the brains of all riders,” he says, “whether suffering low- or high-speed impacts from all applications; be it bicycle, motorcycle or other.”</p>\n<h2>Watch this space</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Leatt Lab - Lab 016\" title=\"Leatt Lab - Lab 016\" /></div><div><figcaption><span><i></i> Leatt is always in the process of developing new products.</span></figcaption><span> <i>Leatt</i></span></div>\n<p>As a company that prides itself on being at the cutting edge of technology, Dr Leatt says it will never stop learning and developing in the pursuit of safety. “As new research articles are published and more is known about brain injuries and our sport,” he says, “we aim to constantly update our research and development efforts.”</p>","author":"Katie Nicholls","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"1152860bf43e1781b86fc4b9be36e56e74ee1722837530f988fd8810d0e3bd41","category":"Cycling"}