{"title":"Determinants of low birth weight among newborns delivered in public hospitals of North Shewa Zone, Amhara region, Ethiopia: A case-control study (2023)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303364","date":1715608800000,"content":"<p>by Beniyas Minda, Girma Bekele, Solomon Hailemeskel, Abera Lambebo</p>\r\nBackground <p>Low birth weight (LBW), defined as a birth weight less than 2500 g, irrespective of gestational age, poses a significant health concern for newborns. Despite efforts, the incidence of LBW in sub-Saharan Africa has remained stagnant over the past decade, warranting attention from healthcare providers, policymakers, and researchers.</p> Objective <p>This study aimed to identify factors associated with LBW among newborns delivered in public hospitals of North Shewa Zone, Amhara Region, Ethiopia, from May 2 to June 10, 2023.</p> Methods and materials <p>An unmatched case-control study was conducted from May 2 to June 10, 2023, involving 318 participants (106 cases and 212 controls). Data were collected using pretested interviewer-administered structured questionnaires, medical record reviews, and direct anthropometric measurements. Bivariate analyses were conducted, and variables with a p-value ≤ 0.25 were included in a multivariable logistic regression model to determine significant determinants of LBW. A significance level of p &lt; 0.05 was used.</p> Results <p>A total of 309 newborns (103 cases and 206 controls) were included, yielding a response rate of 97.2%. Among the findings, females exhibited a higher risk of LBW (adjusted odds ratio [AOR]: 3.13, 95% CI: 1.34, 7.32, p = 0.008), as did mothers aged 20 or younger (AOR: 3.42, 95% CI: 1.35, 8.66, p = 0.009). Lack of formal education was associated with increased risk (AOR: 6.82, 95% CI: 2.94, 15.3, p &lt; 0.001), as were unplanned pregnancies (AOR: 3.08, 95% CI: 1.38, 6.84, p = 0.006) and missed antenatal care visits (AOR: 2.74, 95% CI: 1.16, 6.49, p = 0.021). No significant associations were found with residency type or maternal age above 35.</p> Conclusion <p>Mothers aged ≤ 20 years, with inadequate minimum dietary diversity, lack of antenatal care attendance, and unplanned pregnancies, faced heightened risks of LBW. Addressing these factors is vital for reducing LBW occurrences and improving newborn health outcomes in Ethiopia.</p>","author":"Beniyas Minda","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1153573ff79b654241355d8933a0f723a38976a5151779dfdcfaaddaa20807dc","category":"Interdisciplinary"}