{"title":"Prediction of Heat Wave Risk Based on Thermal Stress Indicators of Lactating Cows in the Amazon Savanna","link":"https://www.preprints.org/manuscript/202409.0339/v1","date":1725505332000,"content":"Thermal comfort indices are risk indicators for environmental conditions in livestock production. Predictive models based on these indices of heat stress, respiratory frequency, and presence of heat waves for lactating cows, comparing the prediction and correlation between these factors, generate responses that can improve animal management regarding physiological responses to heat stress during the incidence of heat waves. Therefore, the objective was to develop predictive models for heat wave risk alerts based on thermal stress indices, physiological responses, and surface temperature of lactating cows. The region's climatic conditions were evaluated based on data on temperature, air humidity, wind speed, black globe temperature, solar radiation, dew point temperature, and precipitation compiled from a meteorological station. In the processing phase, a data set was discretized into classes to apply machine learning techniques to generate a classification model with cross-validation of the data. The performance of the classifiers was evaluated based on the metrics: accuracy, precision, sensitivity (recall), and Kappa statistics. Predicting the risk of heat waves for lactating cows can meet the need to predict the frequency of heat waves for decision-making in environmental, nutritional, and health management to minimize adverse impacts on production. The accuracy of Decision Tree models (J48), Naive Bayes, and Logistic Regression was equal to 96.72%, 96.72%, and 98.36%, respectively. The performance in the evaluation metrics of the Logistic Regression prediction model was better than that of the decision tree and Naive Bayes models.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"116462b1e4453e0985bc43eafb81f91a0e84bba4cecbb90c199fb12eaaad1fb8","category":"Interdisciplinary"}