{"title":"Functional diversity in human song","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307032","date":1720792800000,"content":"<p>by Lucas Colares, Ray Balieiro Lopes-Neto, Alexandre Sampaio de Siqueira, Camila Ferreira Leão, Arianne Flexa de Castro, Bárbara Dunck</p>\r\n\r\nFunctional diversity–i.e., the diversity of morphophysiological characteristics of species in a biological community–revolutionized ecology in recent decades, shifting the focus of the field from species to ecosystems. While its ecological applications are known, its adaptability to other disciplines, specifically music, is explored here. We retrieved fourteen characteristics of 12,944 songs by the top 100 artists of the 2010s decade on four streaming platforms. Then, we calculated the three main components of functional diversity–richness, evenness, and divergence–to each artist using probabilistic hypervolumes. Furthermore, we investigated to what extent functional diversity and the traits of an artist, its albums and songs has an effect on their popularity across streaming platforms such as Spotify. High functional richness, where an artist’s songs differ greatly sonically, correlated with increased listens of up to 244,300,000. This would lead to estimated profit earnings exceeding $1,000,000 per richness gain. Danceable, highly-energetic, melodic, pop, and, notably, melancholic songs, albums, and artists are more listened to than their counterparts in streaming services. We captured how patterns in human song might reflects the social state of human societies in recent years and demonstrate the potential of applying functional diversity concepts and tools across scientific and economic domains, extending its relevance beyond ecology. By demonstrating applications of state-of-the-art functional diversity metrics using music as a case study, we intent to communicate the often-complex concepts of functional diversity using the familiar realm of music, which is an intrinsic trait of human cultures across the globe.","author":"Lucas Colares","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1168057f2ff18782f66ea9b744a53f445392c3614b4743ff9312d3b1c67e1271","category":"Interdisciplinary"}