{"title":"Report: Non-Pro iPhones won’t get 120Hz ProMotion displays until 2025","link":"https://www.macworld.com/article/1681116/iphone-promotion-high-refresh-rate-2025-under-display-face-id-camera.html","date":1680545514000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Ross Young, CEO of Display Supply Chain Consultants and frequent Apple display predictor, has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.displaysupplychain.com/blog/apple-dominates-best-selling-smartphones-in-q422-ltpo-share-surges-on-pro-models-with-full-adoption-expected-by-apple-in-2025&amp;xcust=1-1-1681116-1-0-0&amp;sref=https://www.macworld.com/feed\">issued a new report</a> claiming that Apple will finally add 120Hz ProMotion to the regular iPhone models—but not until 2025, more than two years from now.</p>\n\n\n\n<p>In a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/DSCCRoss/status/1642915504858992641&amp;xcust=1-1-1681116-1-0-0&amp;sref=https://www.macworld.com/feed\">tweet</a> showing his projected roadmap, he claims Apple will bring the “pill” and Dynamic Island in the current Pro models to the standard iPhone 15 models later this year, as has been rumored for some time. But the standard iPhones will still use an LTPS display technology rather than the LTPO found in the Pro models (and Apple Watch). LPTO allows for changes in refresh rate in a more power-efficient fashion and is seen as necessary for both ProMotion and always-on display in iPhones. (Both features can exist with LTPS displays and other display technologies, but the resulting battery drain is generally seen as too much for iPhone or Apple Watch.)</p>\n\n\n\n<figure><div>\n<blockquote><p>Apple to go all LTPO in 2025, even base models to get 120Hz refresh, finally. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/n0ivg08pde&amp;xcust=1-1-1681116-1-0-0&amp;sref=https://www.macworld.com/feed\">https://t.co/n0ivg08pde</a> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/dwjGiHwn8u&amp;xcust=1-1-1681116-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/dwjGiHwn8u</a></p>— Ross Young (@DSCCRoss) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/DSCCRoss/status/1642915504858992641?ref_src=twsrc%5Etfw&amp;xcust=1-1-1681116-1-0-0&amp;sref=https://www.macworld.com/feed\">April 3, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>According to Young’s roadmap, next year’s iPhones will have the same display features as this year’s. In 2025, however, the regular iPhones start to match today’s Pro models–with an LTPO display that enables 120Hz ProMotion and presumably an always-on display as well. That same year, the Pro models are said to get Face ID sensors that are under the display accompanied by a small hole cutout for the front camera. Then in 2027, Young predicts the standard models will get that arrangement while the Pro models remove the front camera under the display as well for a completely unobstructed front panel.</p>\n\n\n\n<p>That all sounds very exciting, but a word of caution with these predictions: While they use the best available information from a respected supply chain analyst, it’s very difficult to predict what Apple will do even next year, let alone two or more years in the future. The available technologies and their costs can change quite a bit between now and then, and even Apple hasn’t set the features of the 2025 iPhone in stone yet. </p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"116b56c136d11cb1445a0d20a71eb7940978d9b5b7cf01737595de73c3379aef","category":"Apple"}