{"title":"Tracking Progress Toward Urban Nature Targets Using Landcover and Vegetation Indices: A Global Study for the 96 C40 Cities","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023GH000996?af=R","date":1709013933000,"content":"<h2>Abstract</h2>\n<p>Access to urban natural space, including blue and greenspace, is associated with improved health. In 2021, the C40 Cities Climate Leadership Group set 2030 Urban Nature Declaration (UND) targets: “Quality Total Cover” (30% green area within each city) and “Equitable Spatial Distribution” (70% of the population living close to natural space). We evaluate progress toward these targets in the 96 C40 cities using globally available, high-resolution data sets for landcover and normalized difference vegetation index (NDVI). We use the European Space Agency (ESA)'s WorldCover data set to define greenspace with discrete landcover categories and ESA's Sentinel-2A to calculate NDVI, adding the “open water” landcover category to characterize total natural space. We compare 2020 levels of urban green and natural space to the two UND targets and predict the city-specific NDVI level consistent with the UND targets using linear regressions. The 96-city mean NDVI was 0.538 (range: 0.148, 0.739). Most (80%) cities meet the Quality Total Cover target, and nearly half (47%) meet the Equitable Spatial Distribution target. Landcover-measured greenspace and total natural space were strong (mean <i>R</i>\n<sup>2</sup> = 0.826) and moderate (mean <i>R</i>\n<sup>2</sup> = 0.597) predictors of NDVI and our NDVI-based natural space proximity measure, respectively. The 96-city mean predicted NDVI value of meeting the UND targets was 0.478 (range: 0.352–0.565) for Quality Total Cover and 0.660 (range: 0.498–0.767) for Equitable Spatial Distribution. Our translation of the area- and access-based metrics common in urban natural space targets into the NDVI metric used in epidemiology allows for quantifying the health benefits of achieving such targets.</p>","author":"Greta K. Martin, \nKatelyn O’Dell, \nPatrick L. Kinney, \nMarcia Pescador‐Jimenez, \nDavid Rojas‐Rueda, \nRobert Canales, \nSusan C. Anenberg","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"116f6dbaad2ced5e9f865c6ee2743c457ab085f0deab9c3abc40ed7de6c9d962","category":"Environment"}