{"title":"A big weekend in Italy: Daily News Digest","link":"https://cyclingtips.com/2021/03/a-big-weekend-in-italy-daily-news-digest/","date":1616364339000,"content":"<p>Hello CyclingTips readers,&nbsp;</p>\n\n\n\n<p>After much anticipation, the first monument of the season took place on Saturday, building steadily over 299 km to an absolutely nailbiting finish. Jasper Stuyven took the win for Trek-Segafredo at Milano-San Remo, and a day later, his teammate from the Trek-Segafredo women’s team, Elisa Longo Borghini, soloed to a stunning win at Trofeo Alfredo Binda. </p>\n\n\n\n<p>Big Italian races aside, there are sponsorship grumblings afoot at Deceuninck-Quick Step, and the big names are lining up in Spain for the Volta a Catalunya. </p>\n\n\n\n<p>Let&#8217;s roll into it. </p>\n\n\n\n<p><em>Iain Treloar<br>Senior Editor</em></p>\n\n\n\n<h3>Jasper Stuyven wins Milano-San Remo</h3>\n\n\n\n<p>Jasper Stuyven (Trek-Segafredo) took the biggest win of his career at Milano-San Remo on Saturday, timing an attack to perfection at 2.5 km to go and narrowly holding off a group of pre-race favourites. The Belgian rider was joined by Søren Kragh Andersen and although the two looked like they would not make it all the way, Stuyven just held off a pack of strong sprinters to take the victory.</p>\n\n\n\n<p>As is traditional for the longest race on the calendar, a breakaway group snuck away early, building up a sizeable advantage and scoring a bunch of TV time for their sponsors. Over the hours, their lead slowly got chipped away, and the final breakaway rider was caught with 24 km to go. Riding for Wout van Aert, Jumbo-Visma hit the front on the Cipressa, before a Filippo Ganna-powered Ineos Grenadiers came to the fore, driving the pace on the Poggio. The decisive split was led by a Julian Alaphilippe attack with 6.4km remaining, drawing out a small but select group over the top of the climb – including pre race favourites Wout van Aert and Mathieu van der Poel, along with Michael Matthews, Peter Sagan, Caleb Ewan, Tom Pidcock, Jasper Stuyven and Søren Kragh Andersen. </p>\n\n\n\n<p>At 2.5 km to go, Stuyven slipped away, joined by Andersen, and in the finishing straight it was Stuyven narrowly holding on to win. Caleb Ewan (Lotto Soudal) was the best of the rest with Wout van Aert (Team Jumbo-Visma) taking third on the day, while in fourth place, Peter Sagan showed signs of a renaissance after a COVID-19-impacted start to the year.</p>\n\n\n\n<p>For the full race report, <a href=\"https://cyclingtips.com/2021/03/jasper-stuyven-wins-milano-san-remo/\">see here</a>. </p>\n\n\n\n<h3>Elisa Longo Borghini wins Trofeo Alfredo Binda</h3>\n\n\n\n<p>Elisa Longo Borghini continued Trek-Segafredo’s excellent weekend, winning Trofeo Alfredo Binda – the second WorldTour race of the women’s season, and one of its most prestigious – on Sunday. </p>\n\n\n\n<p>The race was aggressive from the outset, with Alé BTC Ljubljana particularly keen to get away. A group of four riders finally formed off the front, but was brought back with 35 km to go. At 28.2 km, Tiff Cromwell (Canyon-SRAM) attacked but was brought back by Ruth Winder (Trek-Segafredo), quickly followed by an attack from her teammate Tayler Wiles. </p>\n\n\n\n<p>That drew out Kasia Niewiadoma (Canyon-SRAM), along with Elisa Longo Borghini. The Italian champion applied pressure on the climb to Orino, opening up a small gap and steadily building upon it. She crossed the finish line solo with a gap of 1:42, with four-time Trofeo Alfredo Binda winner Marianne Vos winning the sprint for second ahead of Cecilie Uttrup Ludwig. </p>\n\n\n\n<p>For the full race report, <a href=\"https://cyclingtips.com/2021/03/elisa-longo-borghini-wins-trofeo-alfredo-binda/\">see here</a>.</p>\n\n\n\n<h3>Sponsor turbulence at Deceuninck-Quick Step</h3>\n\n\n\n<p>Deceuninck-Quick Step may be one of the most successful teams on the circuit, but according to team manager Patrick Lefevere, they’re not immune to the pressures of finding new sponsorship. In his weekly Het Nieuwsblad column, Lefevere alleged that Bora-Hansgrohe’s team manager Ralph Denk was chasing Remco Evenepoel – with the audacious gamble of buying the entire Deceuninck-Quick Step team to secure the <a href=\"https://cyclingtips.com/2021/03/remco-evenepoel-is-the-face-of-pizza-hut/\">young pizza ambassador’s</a> signature. </p>\n\n\n\n<p>Lefevere has set a deadline of March 31 for his sponsor search, and appears to have taken Denk’s approach as a personal affront. “Be warned: &#8216;in my world, I never forget things like this.&#8217; I will get my revenge on Denk,” the notoriously cantankerous Lefevere wrote. </p>\n\n\n\n<p>For what it’s worth, Denk disputes Lefevere’s version of events, telling <a href=\"https://www.cyclingnews.com/news/lefevere-reveals-bora-offered-to-buy-out-deceuninck-quickstep-to-sign-evenepoel/\">Cyclingnews</a> that “it’s true that we talked. I wanted to know how the future of [Lefevere’s] team looks like and where he is at for 2022 and onwards, and he said not good. Then I asked him what Remco would do if Deceuninck-Quickstep would have to close and he told me about his option on him. He then actually did put that in prospect together with two other riders. To buy the team was never a topic.” </p>\n\n\n\n<h3>Volta a Catalunya start list takes shape</h3>\n\n\n\n<p>With that big weekend of Italian racing out of the way, the eyes of the cycling world turn to the Volta a Catalunya, a challenging week-long tour in Spain. An impressive line-up of riders is taking on the race’s centenary edition, with many GC riders using it as a crucial tune-up for the grand tours ahead. </p>\n\n\n\n<p>Multiple winner Alejandro Valverde will be leading Movistar, along with Enric Mas and Marc Soler. Their former teammate, Richard Carapaz, will be heading the charge for Ineos Grenadiers, while Chris Froome will be seeking to reclaim the magic for Israel Start-Up Nation. </p>\n\n\n\n<p>Outside of the GC contenders, Peter Sagan (Bora-Hansgrohe) is a late addition to the start list, and Marc Hirschi will make his long-awaited debut for UAE-Team Emirates after a sudden change of teams early this year. The race begins with a hilly opening stage that’s likely to come down to a bunch sprint.    </p>\n\n\n\n<h2>In case you missed it&#8230;</h2>\n\n\n\n<p><strong>Trek-Segafredo&#8217;s 1-2-3 punch won Trofeo Alfredo Binda</strong></p>\n\n\n\n<p>Abby Mickey has the <a href=\"https://cyclingtips.com/2021/03/trek-segafredos-1-2-3-punch-won-trofeo-alfredo-binda/\">tactical breakdown</a> of Trek-Segafredo&#8217;s win at Trofeo Alfredo Binda. </p>\n\n\n\n<p><strong>How the race was won: Milano-San Remo</strong></p>\n\n\n\n<p><a href=\"https://cyclingtips.com/2021/03/how-the-race-was-won-milano-sanremo/\">Cosmo Catalano is back</a> with his beloved How the Race Was Won videos.</p>\n\n\n\n<p><strong>Caleb Ewan knows he can win San Remo</strong></p>\n\n\n\n<p>After finishing agonisingly close on the weekend, <a href=\"https://cyclingtips.com/2021/03/ewan-after-san-remo-that-confirmed-that-i-could-potentially-win-the-race-one-day/\">Caleb Ewan knows that he can go one better</a>. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/a-big-weekend-in-italy-daily-news-digest/\">A big weekend in Italy: Daily News Digest</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"117cc7ff5616fedbcc8e27f3537b63c5fb0154973bfc8c8785c870ed2e9ebce3","category":"Cycling"}