{"title":"HCP Adds OpenID Connect (OIDC) Single Sign-On Functionality","link":"https://www.hashicorp.com/blog/hcp-adds-openid-connect-oidc-single-sign-on-functionality","date":1675443600000,"content":"<p>We are excited to announce that HashiCorp Cloud Platform (HCP) now allows organizations to configure their single sign-on (SSO) with the OpenID Connect (OIDC) authentication method. This popular SSO solution gives organizations leveraging HCP more options to integrate identity providers (IDPs) into their cloud platform.</p>\n<h2><a href=\"#what-is-oidc-sso\">»</a><a></a>What is OIDC SSO</h2>\n<p>OpenID Connect 1.0 is a simple identity layer on top of the OAuth 2.0 protocol that enables clients to verify end-users’ identities based on the authentication performed by an authorization server or identity provider, as well as obtain basic profile information about the end user in an interoperable and REST-like manner. You can <a href=\"https://openid.net/specs/openid-connect-core-1_0.html\">learn more about OIDC here</a>.</p>\n<h2><a href=\"#the-benefits-of-oidc-sso-on-hcp\">»</a><a></a>The Benefits of OIDC SSO on HCP</h2>\n<p>Previously, HCP supported three specific types of authentication methods: email and password combination, GitHub, and SAML SSO. Many HCP users and customers, however, leverage OIDC external identity providers (IDPs) across their networks and want to integrate them to log in to HCP.</p>\n<p>Due to these requests and the overall popularity of this authentication method, the latest release of HCP offers full support for OIDC authentication methods, allowing users to delegate authentication to their preferred OIDC provider.</p>\n<p>Many organizations find OIDC SSO much simpler to implement than SAML and more accessible through APIs because it works with RESTful API endpoints. In addition, by enabling OIDC SSO, HCP adds another way to easily integrate with popular identity providers like Microsoft Azure Active Directory and Okta. Lastly, this is the first step in allowing all HCP products to integrate with each other through a single seamless authentication workflow. Look for more HCP integration updates in the future.</p>\n<h2><a href=\"#how-to-implement-oidc-sso-on-hcp\">»</a><a></a>How to Implement OIDC SSO on HCP</h2>\n<p>HCP supports all OIDC external identity providers. Two popular identity providers, <a href=\"https://azure.microsoft.com/en-us/products/active-directory\">Azure Active Directory</a> and <a href=\"https://www.okta.com/\">Okta</a>, have unique implementation procedures. You can see an overview below, or click through for more detailed instructions. Refer to <a href=\"https://developer.hashicorp.com/hcp/docs/hcp/security/sso\">SSO Overview</a> for details about managing organizations with SSO enabled.</p>\n<h3><a href=\"#azure-active-directory-setup\">»</a><a></a>Azure Active Directory Setup</h3>\n<p>Setting up OIDC SSO on HCP utilizing Azure Active Directory requires three main actions:</p>\n<ol>\n<li>Your HCP organization's owner and/or admin must <a href=\"https://portal.cloud.hashicorp.com/\">log in to HCP</a> to set up and configure their selected SSO method.</li>\n<li><strong>Verify your domain:</strong> You need a DNS record (a secret value set as TXT) to prove ownership of a domain. HCP uses the domain to match the email addresses for SSO. You must use different SSO domains for each HCP organization. If you try to reuse a domain name, the DNS connection request will fail.</li>\n<li><strong>Enable OIDC integration:</strong> You must add information from the Initiate OIDC Integration section in HCP to the OIDC configuration for an Enterprise application in Azure Active Directory.</li>\n</ol>\n<p>For detailed step-by-step instructions visit the <a href=\"https://developer.hashicorp.com/hcp/docs/hcp/security/sso/sso-aad-oidc\">Azure Active Directory OIDC SSO Configuration page</a>.</p>\n<h3><a href=\"#okta-identity-provider-setup\">»</a><a></a>Okta Identity Provider Setup</h3>\n<p>Setting up OIDC SSO on HCP utilizing the Okta identity provider is also straightforward:</p>\n<ol>\n<li>Your HCP organization's owner and/or admin must <a href=\"https://portal.cloud.hashicorp.com/\">log in to HCP</a> to set up and configure their selected SSO method.</li>\n<li><strong>Verify your domain:</strong> You need a DNS record (a secret value set as TXT) to prove ownership of a domain. HCP uses the domain to match the email addresses for SSO. You must use different SSO domains for each HCP organization. If you try to reuse a domain name, the DNS connection request will fail.</li>\n<li><strong>Create an OIDC app integration:</strong> Log into Okta, click on Applications, and follow the Create App Integration process.</li>\n</ol>\n<p>For detailed step-by-step instructions visit the <a href=\"https://developer.hashicorp.com/hcp/docs/hcp/security/sso/sso-okta-oidc\">Okta OIDC SSO Configuration page</a>.</p>\n<h2><a href=\"#more-to-come\">»</a><a></a>More to Come</h2>\n<p>OIDC SSO expands user management options for organizations leveraging the HashiCorp Cloud Platform.  It can help mitigate account take over (ATO) attacks, provide a universal source of truth to federate identities from your identity provider (IDP), and help you better manage user access to your organization. Keep an eye out for further integrations to increase user security and flexibility as HCP develops.</p>","author":"Tom O’Connell","siteTitle":"HashiCorp Blog","siteHash":"3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"117c47c6e06e663d2570e195cbc8129be964450165f1be0d5e8aff","category":"Tech"}