{"title":"This bioelectronic device lets scientists map electrical signals of the Venus flytrap","link":"https://arstechnica.com/?p=1958110","date":1691070981000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/flytrap1CROP-800x533.jpg\" alt=\"Potted venus flytrap with a film of electrodes attached\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/flytrap1CROP.jpg\">Enlarge</a> <span>/</span> A newly developed measuring device allows researchers to measure the electrical signal in the lobe of the Venus flytrap. (credit: Thor Balkhed/Linköping University)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Human beings and other animals send electrical signals via the central nervous system. The Venus flytrap, which lacks such a nervous system, also sends rapid electrical impulses, which are generated in response to touch or stress. It's how the plant traps its prey to feed. Now scientists have developed a bioelectronic device to better understand the Venus flytrap's complex signaling mechanism by mapping how those signals propagate, according to a <a href=\"https://www.science.org/doi/10.1126/sciadv.adh4443\">recent paper</a> published in the journal Science Advances.</p>\n<p>“We can now say with certainty that the electrical signal originates in the sensory hairs of the Venus flytrap,\" <a href=\"https://www.eurekalert.org/news-releases/996064?\">said co-author Eleni Stavrinidou</a> of Linköping University in Sweden. \"With our technology, we can also see that the signal mainly spreads radially from the hair, without any clear direction.\" </p>\n<p>As <a href=\"https://arstechnica.com/science/2020/10/the-secret-of-how-the-venus-flytrap-remembers-when-it-captures-prey/\">we've reported</a> previously, the Venus flytrap attracts its prey with a pleasing fruity scent. When an insect lands on a leaf, it stimulates the highly sensitive trigger hairs that line the leaf. When the pressure becomes strong enough to bend those hairs, the plant will snap its leaves shut and trap the insect inside. Long cilia grab and hold the insect in place, much like fingers, as the plant begins to secrete digestive juices. The insect is digested slowly over five to 12 days, after which the trap reopens, releasing the dried-out husk of the insect into the wind.</p></div><p><a href=\"https://arstechnica.com/?p=1958110#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1958110&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1185f34c15bafab063b2e1268494d050958ada8ae4c733808c4deed0ffb33918","category":"Tech"}