{"title":"Evaluation of Medium-Deep Geothermal Resources Based on Seismic Imaging Technology: A Case Study of the Midu Basin in Yunnan Province","link":"https://www.preprints.org/manuscript/202407.1654/v1","date":1721632279000,"content":"The effective utilization of medium-high temperature geothermal energy is pivotal in reducing carbon emissions and plays a crucial role in developing clean energy technologies. The MiDu ge-othermal field, situated in the southeastern region of Dali Prefecture, Yunnan Province, lies within the Mediterranean-Himalayan high-temperature geothermal belt and is characterized by abundant geothermal resources. However, due to its considerable depth, exploration poses significant risks, resulting in a total utilization rate of less than 0.5% of the total reserves. This study employs natural seismic data to perform a tomographic analysis of the geothermal system in the Midu basin. By examining the P-wave velocity (Vp) and velocity ratio of P-wave and S-wave (Vp/Vs) at various depths, the findings reveal that the basin comprises two distinct structural layers: the thrust basement of the Mesozoic and Paleozoic eras and the strike-slip extensional sedimentary layer of the Cenozoic era. A low-velocity anomaly in the central basin corresponds to the loose Cenozoic sedimentary layer. In contrast, high-velocity anomalies at the basin edges correlate with boundary faults and the Mesozoic-Paleozoic strata. Below a depth of 4 km, the Red River Fault and MiDu Fault continue to dominate the basin's structure, whereas the influence of the Malipo Fault dimin-ishes. The MiDu Fault exhibits higher thermal conductivity than the Yinjie Fault. It interfaces with multiple carbonate and basalt formations characterized by well-developed pores and fractures, making it a crucial conduit for water and a control point for geothermal storage. Consequently, the existence of high temperature geothermal resources for power generation should be concentrated around the Midu fault on the western side of the basin, while the Yinjie fault area is more favorable for advancements in heating and wellness.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"119e192e4655fea38cccee648b52f2efd89f8313d94640df4ad4d1ed00aef16a","category":"Interdisciplinary"}