{"title":"Apple Deal Responsible for Google's Dominance in Search, Says Microsoft CEO","link":"https://www.macrumors.com/2023/10/02/microsoft-ceo-on-apple-goole-search-deal/","date":1696271359000,"content":"Microsoft CEO Satya Nadella today said that he believes the search engine deal between Apple and Google has made it impossible for other search engines like Bing to compete (via <em><a href=\"https://www.wsj.com/tech/ai/microsoft-ceo-testifies-about-limits-of-ai-at-google-antitrust-trial-32d032a9\">The Wall Street Journal</a></em>). With Google as the default search engine on Safari on all Apple devices, people become accustomed to using it, Nadella explained in testimony he gave during the ongoing Google vs. U.S. Department of Justice antitrust trial.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/microsoft-bing-chatgpt.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\n\"You get up in the morning, you brush your teeth, and you search on Google,\" said Nadella. \"With that level of habit forming, the only way to change is by changing defaults.\" Nadella went on to say that Google is able to use its ~90 percent market share to improve search results, further reinforcing its monopoly. He said that it's \"bogus\" that there is choice in the search engine market.\r<br />\n\r<br />\nMicrosoft has been attempting to chip market share away from Google by adding OpenAI's chatbot technology to Bing, but Nadella says it is unclear how much AI can reshape the existing market because Google's distribution advantage doesn't go away. \"I worry a lot about that,\" he said. \"Even in spite of my enthusiasm that there is a new angle with AI, this vicious cycle that I'm trapped in could become even more vicious because the defaults get reinforced.\"\r<br />\n\r<br />\nLast week, iTunes chief <a href=\"https://www.macrumors.com/guide/eddy-cue/\">Eddy Cue</a> <a href=\"https://www.macrumors.com/2023/09/26/apple-on-why-google-is-default-on-iphone/\">testified in the trial</a> and explained that Apple opts for Google as the default search engine on its devices because the company has \"always thought it was the best.\" Google does pay Apple billions of dollars per year to remain the default search engine, though Cue claimed there is no valid alternative.\r<br />\n\r<br />\nBack in 2020, <a href=\"https://www.macrumors.com/2023/09/28/microsoft-bing-acquisition-talks/\">Microsoft approached Apple</a> and offered up Bing as a potential acquisition target, but talks between Microsoft execs and ‌Eddy Cue‌ did not progress, both because of the money Apple gets from Google and concerns that Bing would not be able to compete with Google Search.\r<br />\n\r<br />\nNadella is likely correct that it would be difficult at this point for any search engine to truly compete with Google, especially as long as Google remains the default search engine on Apple devices. The exception might be if Apple decides to develop its own search engine at some point.\r<br />\n\r<br />\nIn <a href=\"https://www.bloomberg.com/news/newsletters/2023-10-01/could-apple-replace-google-with-own-search-engine-it-s-possible-but-unlikely-ln7gywed\">Sunday's edition of the Power On newsletter</a>, <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> <a href=\"https://www.macrumors.com/2022/12/19/apple-to-launch-search-engine-to-rival-google/\">reiterated rumors</a> that Apple has considered creating its own search engine. Such a solution would be able to provide better privacy and deeper integration with <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> and Spotlight, and Apple has already developed search tools that are used in apps like the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> and <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a>.\r<br />\n\r<br />\nApple's AI chief John Giannandrea heads up a search team within Apple, and according to Gurman, that team has created a next-generation search engine for Apple apps. Codenamed \"Pegasus,\" the search technology is able to provide more accurate results. While it is already used in some Apple apps, Apple will be expanding it to additional apps, such as the ‌App Store‌.\r<br />\n\r<br />\nWhat Apple has now does not match the Google search engine, but Gurman argues that Apple could use it as the backbone for a full search engine in the future.\r<br />\n\r<br />\nThere are still a few more weeks to go in the antitrust trial, and it is not yet clear what the outcome will be. If lawmakers target the lucrative deal between Apple and Google, the billions of dollars that Apple will lose could serve as a catalyst for Apple to further pursue its own search engine option.<div>Tags: <a href=\"https://www.macrumors.com/guide/google/\">Google</a>, <a href=\"https://www.macrumors.com/guide/microsoft/\">Microsoft</a>, <a href=\"https://www.macrumors.com/guide/bing/\">Bing</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/02/microsoft-ceo-on-apple-goole-search-deal/\">Apple Deal Responsible for Google's Dominance in Search, Says Microsoft CEO</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-deal-responsible-for-googles-dominance-in-search-says-microsoft-ceo.2405987/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"11a0ea22ce1af50173aadd244ff5cda6d7acc6adfb3ea3fe8e75dfeceae24e78","category":"Apple"}