{"title":"Retirements of professional tennis players in second- and third-tier tournaments on the ATP and WTA tours","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304638","date":1717423200000,"content":"<p>by Maria Palau, Ernest Baiget, Jordi Cortés, Joan Martínez, Miguel Crespo, Martí Casals</p>\r\n\r\nThe demands of professional tennis, including physical and psychological aspects, contribute to the frequency of retirements at elite levels of the sport. The aim of this study was to analyze epidemiological patterns and risk factors associated with retirements in previous ATP and WTA Tour tournaments. A retrospective cohort study was conducted. This study focused on previous ATP and WTA Tour tournaments. The ATP database encompassed 584,806 matches, while the WTA database included 267,380 matches. To assess retirements, potential risk factors such as playing surface, tournament category, match round, and player age were analyzed. Incidence rates were calculated for the period between 1978–2019 for men and 1994–2018 for women. The overall incidence rate was 1.56 (95%CI: 1.54, 1.59) and 1.36 (95%CI: 1.33, 1.39) retirements per 1000 games played in male and female competitions, respectively. Retirements increased over the years. Higher incidence rates were observed on hard (1.59 [95%CI: 1.56, 1.63] and 1.39 [95%CI: 1.34, 1.44]) and clay (1.60 [95%CI: 1.57, 1.63] and 1.36 [95%CI: 1.32, 1.41]) compared to grass courts (0.79 [95%CI: 0.65, 0.94] and 1.06 [95%CI: 0.88, 1.27]). Risk factors differed by gender, with tournament category significant in males (IRR: 1.23 [95%CI: 1.19, 1.28] in ITF vs ATP) and match round in females (IRR: 0.92 [95%CI: 0.88, 0.98] in preliminary vs final). This study provides valuable insights for coaches, players, support teams, and epidemiologists regarding retirements and associated risk factors in previous ATP and WTA Tour tournaments, contributing to injury prevention strategies.","author":"Maria Palau","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"11a737c7305cf2cec9ca6b22bebf0241889a5969eb640ed3bbecc98c3bca26d6","category":"Interdisciplinary"}