{"title":"“Function explains itself”—Bugatti’s designer talks EVs with us","link":"https://arstechnica.com/?p=1933547","date":1682091360000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/08-BUGATTI-W16-Mistral_MCW-800x533.jpg\" alt=\"A closeup of the Bugatti Mistral headlight cluster\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/08-BUGATTI-W16-Mistral_MCW-scaled.jpg\">Enlarge</a> <span>/</span> The Bugatti Mistral is the brand's final W16-powered road car. (credit: Bugatti)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>BMW provided flights from DC to San Francisco and back, plus five nights in a hotel, so we could attend Monterey Car Week. While I was there, I spoke to Bugatti's deputy design director. Ars does not accept paid editorial content.</aside>\n<p>PEBBLE BEACH, Calif.—We're big fans of electric propulsion here at Ars. Electric motors are smooth, quiet, and efficient, but they can also generate enormous amounts of torque almost immediately, which means they have something to appeal to all tastes. Electrification has already made its mark on the high-end hypercar; EVs like the <a href=\"https://www.autoblog.com/2022/08/16/pininfarina-battista-first-drive/\">Pininfarina Battista</a> and <a href=\"https://arstechnica.com/cars/2022/08/rimac-nevera-first-drive-an-entirely-new-level-of-hypercar-performance/\">Rimac Nevera</a> offer truly high-end specs, whether in power output or price tag. Electrification is even coming for Bugatti, which is on something of a farewell tour for its W16 engine.</p>\n<p>We caught up with Bugatti's deputy design director Frank Heyl at Monterey Car Week last summer to get his take on how going electric will (or won't) change Bugattis.</p>\n<p>Throughout its long history (and at the risk of sounding like Bart Simpson delivering a bad book report), Bugatti has often had a thing for contrasts. In its early days, its cars were engineering marvels, but they were designed so they could be built by the relatively unskilled laborers working for Ettore Bugatti. In its first incarnation, the company turned high-tech with an all-carbon construction, yet contemporary tests often complained about it being too heavy. And then came <a href=\"https://arstechnica.com/cars/2019/08/ferdinand-piech-dies-father-of-the-porsche-917-and-bugatti-veyron/\">Ferdinand Piech</a>, who wanted a road car with a thousand horsepower and a top speed of 260 mph but one tame enough that his grandmother could drive it to the shops.</p></div><p><a href=\"https://arstechnica.com/?p=1933547#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1933547&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"11ab448984e14125272ec32e93b6788dda5fea46af2bb784c8629a32f9c762dc","category":"Tech"}