{"title":"How to Disable an Unknown AirTag Found Moving With You to Prevent Being Tracked","link":"https://www.macrumors.com/how-to/disable-an-airtag-found-moving-with-you/","date":1618960959000,"content":"Apple's new <a href=\"https://www.macrumors.com/2021/04/20/apple-unveils-airtags-tracking-devices/\">AirTag item tracker</a> lets you easily track things like your keys, wallet, purse, backpack, luggage, and more. AirTags have a small, circular design with a white side and a polished stainless steel side with an Apple logo.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/Apple_airtag-front-and-back-emoji-2up_042021_big.jpg.large_.jpg\" />\r\n<br />\r\nAirTag has been designed to discourage unwanted tracking. If you are an iPhone or iPad user, the built-in Find My app will notify you if an unknown AirTag is seen moving with you over time by displaying an \"AirTag Found Moving With You\" message on the screen. Even if you don't use an iOS device, an AirTag that isn't with the person who registered it for an extended period of time will play a sound when moved.\r\n<br />\r\n\r\n<br />\r\nIf an unknown AirTag is found to be moving with you, follow the steps below to disable the AirTag and stop sharing your location:<ol><li>Tap the \"AirTag Found Moving With You\" message.</li>\r\n<br />\r\n<li>Tap on Continue.</li>\r\n<br />\r\n<li>Tap on Instructions to Disable AirTag and follow the on-screen steps.</li></ol>In a <a href=\"https://support.apple.com/en-us/HT212227\">new support document</a>, Apple says users who feel their safety is at risk should contact their local law enforcement, who can work with Apple. You might need to provide the AirTag or its serial number, according to Apple. If you need help finding the AirTag, tap Play Sound after tapping on the \"AirTag Found Moving With You\" message.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/airtag-privacy.jpeg\" />\r\n<br />\r\nIf you find an AirTag or a lost item with an AirTag attached that has not been moving with you, follow the steps below to learn about the AirTag and how to discover information about its original owner.\r\n<br />\r\n\r\n<br />\r\n<ol><li>Tap and hold the top of your iPhone or other NFC-capable smartphone to the white side of the AirTag.</li>\r\n<br />\r\n<li>Tap the notification that appears on your phone's screen. This will open a website that provides information about the AirTag, including its serial number.</li>\r\n<br />\r\n<li>If the AirTag's owner marked it as lost, you might see a message with information about how to contact the owner. You can contact the owner to let them know that you found their AirTag if you feel comfortable doing so.</li></ol>AirTags have unique Bluetooth identifiers that change frequently, which helps prevent you from being tracked from place to place, according to Apple. Apple says that no one, including Apple, knows the location or identity of any of the participating users or devices who help locate a missing AirTag.\r\n<br />\r\n\r\n<br />\r\nFor more information, read <a href=\"https://support.apple.com/en-us/HT212227\">Apple's support document</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a></div><br />This article, \"<a href=\"https://www.macrumors.com/how-to/disable-an-airtag-found-moving-with-you/\">How to Disable an Unknown AirTag Found Moving With You to Prevent Being Tracked</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/how-to-disable-an-unknown-airtag-found-moving-with-you-to-prevent-being-tracked.2292482/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ml05ogKn_KY:syhCvXB3UEQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ml05ogKn_KY:syhCvXB3UEQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ml05ogKn_KY\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"11b3fc15ff3955a29ef2f4370a878d77a0c1d0ea02117d58e837e69ec5d70cc1","category":"Apple"}