{"title":"Effects of pH and salt concentration on freeze–thaw fractionation of soymilk protein","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13322?af=R","date":1712732400000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The two major storage proteins of soymilk are the globulins 7S and 11S. Freeze–thaw fractionation is a simple method for separating these proteins in raw soymilk. In this study, we assessed the freeze–thaw fractionation ability of raw soymilk under various pH (4.3–11.6) conditions and added salt (sodium chloride) concentrations (0.00–0.67 mol L<sup>−1</sup>).</p>\n<h2>RESULTS</h2>\n<p>We successfully achieved fractionation within a pH range of 5.8–6.7 and when the salt concentration was 0.22 mol L<sup>−1</sup> or lower. Analysis of particle size distribution and microscopic examination of soymilk revealed no direct correlation between particle size and freeze–thaw fractionation ability. Interestingly, it was confirmed that the ranges of zeta potential values associated with successful freeze–thaw fractionation in raw soymilk remained consistent across different pH and salt concentration conditions. These ranges were between −23 and −28 mV at pH levels ranging from 5.8 to 6.7 and between −18 and −29 mV at added salt concentrations ranging from 0 to 0.22 mol L<sup>−1</sup>.</p>\n<h2>CONCLUSION</h2>\n<p>The pH and salt concentration in raw soymilk markedly influence the freeze–thaw fractionation process. We confirmed that the range of zeta potential values where fractionation was possible remained consistent under various pH and salt concentration conditions. These findings suggest that the zeta potential value might serve as an indicator for evaluating the freeze–thaw fractionation ability of raw soymilk. © 2024 Society of Chemical Industry.</p>","author":"Masayuki Matsuno, \nKazuya Murakami, \nKazuhiro Morita, \nMakoto Shimoyamada","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"11bc80d4cb1761e2988a21e28f7f6a6c644bb9026cac945f429f9d09a8f98d06","category":"Environment"}