{"title":"The Application of Convolutional Neural Networks in Organ-on-a-Chip Technology: A Review","link":"https://www.preprints.org/manuscript/202406.1747/v1","date":1719297890000,"content":"Recent developments in microfluidics and biomaterials have enabled the creation of organs-on-chips (OoCs), which provide a controlled and lifelike in vitro microenvironment resembling an actual organ. Organ-on-a-chip technology offers a tremendous opportunity for efficient, cost-effective, and ethical drug testing and research. However, the high throughput and large quantities of data these complex microenvironments produce make it difficult for researchers to effectively analyze the data and draw valuable conclusions. Convolutional Neural Networks (CNNs) are most aptly positioned to address many of OoC’s challenges because of their ability to interpret microscopic images and facilitate the analytical process. Despite the growing field of AI, there have been a limited number of studies summarizing the various applications of CNNs in OoCs. This review aims to provide 1) an overview of the technology involved with CNNs and OoCs 2) an insight into the state-of-the-art applications of CNNs in OoCs including device parameters, predicting and tracking cell trajectories, super-resolution image segmentation, and image classification, and 3) an overview of existing challenges and opportunities ahead for clinical translation of this technology. Various applications of CNNs have been classified by the type of task. Different CNN models such as Faster R-CNNs, fully convolutional networks (FCNs), and Mask R-CNNs are explained and highlighted. This review article can be used as a resource for a better understanding of the potential of CNNs in biomedical research and clinical applications, particularly OoCs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"11bec5b53fa13d0397b27d9443899637f546bafe752e250698fa3a7ff5d83d65","category":"Interdisciplinary"}