{"title":"[Tech Event] AI จะเปลี่ยนอนาคตโลกเทคโนโลยีทางการเงินอย่างไร หาคำตอบได้ในงาน The Rise of AI: Transforming the Future of Fintech โดย LSEG","link":"https://www.blognone.com/node/133024","date":1679060711000,"content":"<div><div><div><p>กลายเป็นคำถามที่หลายคนสงสัย หลายคนกังวลใจว่า AI จะเข้ามาเปลี่ยนแปลงโลกเทคโนโลยีทางการเงินและชีวิตของเราไปจากเดิมอย่างไร บางคนอาจมองเป็นโอกาส แต่บางคนยังไม่แน่ใจกับสิ่งที่จะเกิดขึ้นในอนาคต ดังนั้น London Stock Exchange Group หรือ LSEG ผู้ให้บริการโครงสร้างพื้นฐานและข้อมูลตลาดการเงินชั้นนำระดับโลก ใช้โอกาสนี้ในการสร้างความเข้าใจ และสร้างการเตรียมพร้อมรับมือกับเทคโนโลยีใหม่ ด้วยการจัดงาน The Rise of AI: Transforming the Future of Fintech เพื่อมาหาคำตอบพร้อมแลกเปลี่ยนความคิดเห็นร่วมกัน</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/jFTULtp.jpg\" /></p>\n<p>LSEG มีเป้าหมายต้องการขับเคลื่อนความมั่นคงทางการเงินของโลก  เพื่อให้ลูกค้าสร้างการเติบโตที่ยั่งยืน รวมถึงการเจริญเติบโตของ LSEG ไปพร้อมกัน ดังนั้นการแบ่งปันและแลกเปลี่ยนองค์ความรู้และเทคโนโลยีใหม่ๆ  ให้กับคนในสายงานเทคโนโนยี  และผู้ที่สนใจ  จึงเป็นหนึ่งในภารกิจสำคัญ เป็นที่มาของการจัดงานครั้งนี้</p>\n<p>LSEG เชื่อว่า นี่คือโอกาสในการสร้างเครือข่าย และสร้างแรงบันดาลใจให้กับผู้ที่สนใจทุกคน  โดยส่งผ่านมุมมองความคิดจากผู้นำเทคโนโลยีระดับแนวหน้าของโลก เพื่อรับรู้และเข้าใจถึงการเพิ่มขึ้นของ AI รวมถึงบทบาทหน้าที่ของ คนในสายงานเทคโนโลยีที่มีมากขึ้นเรื่อยๆ และทั้งหมดส่งผลต่อเราอย่างไร ท่ามกลางการก้าวเข้าสู่ยุคของเทคโนโลยีสมัยใหม่</p>\n<p>สามารถกดลงทะเบียนร่วมงานได้ที่นี่ <a href=\"https://pages.beamery.eu/lseg-careers/page/tech-connect-by-lseg-bangkok?utm_source=blognone&amp;utm_medium=advertorial&amp;utm_campaign=2224A+Bangkok+Tech+Event\">http://lseg.com/bangkok-tech-connect</a></p>\n<p>งานนี้จัดวันที่ 30 มีนาคม 2566 ระหว่างเวลา 18.00-20.55 น. ที่ LSEG Bangkok Offices เลขที่ 968 อาคารอื้อจื่อเหลียง ชั้น 31 แขวงสีลม เขตบางรัก</p>\n<p>กิจกรรมไฮไลทํในงาน<br />\n• Keynote from LSEG’s, CIO, Triona O’Keefe<br />\n• Knowledge sharing session – “Empowering Developers with the DX!”<br />\n• Panel Discussion – “AI: A World of Possibilities, A World of Risks”<br />\n• Opportunities for networking and career discussions</p>\n<p>ที่นั่งมีจำนวนจำกัด อย่าพลาดโอกาสสำคัญครั้งนี้</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/lseg\">LSEG</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"11cc4a8b3e1e5a23eb7e4f597ba8e46820a09e8a8cae37042d005290426e8d35","category":"Thai"}