{"title":"What's next for Dave Brailsford?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/whats-next-for-dave-brailsford","date":1701792689000,"content":"\n      \n<p><span>In many ways, Dave Brailsford, once architect of Olympic gold rush and <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> domination and soon likely to be leader of Manchester United's rebirth under Sir Jim Ratcliffe, is a great survivor.</span></p>\n<div></div>\n<div></div>\n<p><span>Brailsford's chameleon-like qualities and undoubted resilience have served him well over more than two decades, through national federation turmoil, bullying and doping investigations, the Tour de France hothouse, parliamentary inquiries, media scrutiny, ill health and even superstar feuds.</span><span> </span></p>\n<p><span>While a long list of collaborators, cohorts and critics, have been left battered and bruised, it's all appeared to be water off a duck's back for 'Teflon Dave,' as some of the press call him — or at least that's how it has seemed.</span></p>\n<p><span>Brailsford's numerous successes go before him and still, it seems, leave many in awe. His next trick however could be the daddy of them all: masterminding the regeneration of one of world sport's most famous brands — Manchester United.</span></p>\n<p><span>Brailsford has, for now, exited cycling. The football world now awaits mister Marginal Gains: the British sports media is hanging on, with baited breath, for the announcement confirming Ratcliffe's acquisition of 25% of the legendary British football club.</span><span> </span></p>\n<p><span>It's also expected to be confirmed that Brailsford, who knows Manchester well already, through his years based at the city's velodrome, will oversee the sporting performance of arguably the world's best-known sports brand.</span><span> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Roubaix-1568_1024x1024.jpg?v=1701782519\" /><em>Dylan van Baarle with Dave Brailsford after winning the 2022 edition of Paris-Roubaix (Image: Zac Williams/SWpix)</em></span></p>\n<p>Brailsford is now edging towards his sixties. The challenge at Old Trafford, of reviving a sleeping sporting juggernaut, feels like it could be his last big job. But why should he succeed, where so many others have tried and failed?</p>\n<p>I've known him since his late thirties and there is no doubt that his has been a remarkable journey, one that surprises some of those who knew him in the early days. But then whatever role he takes on, he is also always keeping an eye out for his next move. He was born in Derbyshire in 1964, but his family soon moved to North Wales. His father John Brailsford – blacksmith, Alpine guide, ice-climber, canoeist and long-distance cyclist – was a pioneering spirit and a clear role model to his young son.</p>\n<p>\"My dad had all these climbing and cycling mates, but I used to get caught in the middle,\" he remembered. \"They used to ride from Bangor all the way to the Alps and then have four or five weeks of ice climbing. My dad was a pretty driven bloke.\"</p>\n<p>He was also something of an absent father.  By 2012, that also worried Brailsford, who was by then, spending most weeks away from home, on the road with Team Sky.</p>\n<p>\"I feel very sad, very guilty for being an absent father,\" he told me back then, \"but on the other hand, I don’t know anything else.\"</p>\n<p>It's a little over twenty years since Brailsford took over as British Cycling's Performance Director. His impact, on a national federation run on goodwill, volunteers and a shoestring, was almost immediate.</p>\n<p>He had inherited a structure of what he called 'plucky losers,' and he took a wrecking ball to it. He was ruthless, hard and driven and he put noses out of joint. But at the same time he was laying the foundations for success and most of his athletes recognised that.</p>\n<p>Before that, Brailsford, who graduated in Sport and Exercise Sciences and Psychology from the University of Chester, had worked as export manager for Dave Loughran at Planet X.</p>\n<p>\"Dave was always passionate about cycling,\" Loughran told me when Team Sky first moved onto the road scene. \"We’d sit down at night and watch old Tour de France videos of Delgado, LeMond, Roche – and then try and batter each other on the bike the next day.\"<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/A9R08658_1024x1024.jpg?v=1701782807\" /><em>Geraint Thomas with Dave Brailsford at the end of the 2018 Tour de France (Image: Russell Ellis/SWpix</em></p>\n<p>The first tangible signs of the Brailsford-effect within British Cycling came at the 2004 Athens Olympics track programme in Santiago Calatrava's skeletal velodrome. Bradley Wiggins took gold, silver and bronze medals, and Steve Cummings, Paul Manning, Chris Hoy and Rob Hayles also reached the podium. Meanwhile, Victoria Pendleton hinted at what was soon to come.</p>\n<p>By 2008, in Beijing, British cyclists, dominant on the track and on the road, finished top of the Olympic medal table. Brailsford's riders took eight gold medals and Nicole Cooke won the women's road race in the shadow of the Great Wall. The years of failure and hardship were forgotten as Team GB basked in its success.</p>\n<p>Almost seamlessly, that domination transferred to road racing. Four years later, Wiggins won almost every major stage race in the spring and summer of 2012, culminating in Olympic Gold just days after winning the Tour in Paris, a run of success that is unlikely to ever be matched.</p>\n<p>Brailsford may have recently been off the media radar for a couple of years, but he has already walked back into the world of tabloid sports coverage. If he thought the questioning media were a major distraction and pain during Team Sky's glory years, worse is likely to come once he is installed at Old Trafford. Some wounds still run deep. And then there are the fans: bitter, angry and frustrated after years of watching their beloved team play under the reign of the Glazers, they will want results, fast. Is it really so mad to believe that Brailsford would succeed in Premier League football?</p>\n<p>After all, before the Beijing Olympics, nobody really bought into his theories of marginal gains. Back then, Brailsford was not yet being flown around Europe to give keynote speeches to starstruck CEOs and conference-goers. There's no suggestion that he will be taking training sessions, working on dead ball situations, or picking the team. He might, however, pick the team that picks the team. But then he also likes to prove a point.</p>\n<p>He needs constant challenges and doing the same thing over and over again bores him. \"Dave is the executor of the plan,\" Loughran said in 2012. \"He’s great at putting a team together, very good at hiring the right people.\"</p>\n<p>Back then, sitting on a hotel terrace in the Swiss Alps, Brailsford had told me that working in an office would kill him. Few ever doubted, that for all the stress, he loved being on the road at bike races and exerting an influence.</p>\n<p>It's perhaps no coincidence that when Brailsford showed up on the 2023 Tour for 48 hours, Ineos Grenadiers promptly won back-to-back stages, first through Michal Kwiatkowski on the Grand Colombier and 24 hours later, in Morzine, with Rodriguez. When he climbed out of an Ineos Grenadiers team car in Morzine on the afternoon of Rodriguez's stage win, he said it was \"good to be back.\"</p>\n<p>\"I realise how much I love the sport,\" he said last July, \"the mountains, the scenery, the chaos. The brutality of it...living right on the edge of danger all the time. I can't help but miss it.\"</p>\n<p>But now he has turned away from the sport he once revolutionised. The big question now is, where, in Ineos' sports portfolio, does that leave a cycling team brimming with young talent, but lacking old hands, especially following the recent departure of Brailsford's long-time collaborator, Rod Ellingworth. From the outside at least, as Brailsford heads back to Manchester, it looks as if Ratcliffe's cycling team is in limbo.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Brailsford-SW2_2948_1024x1024.jpg?v=1701782906\" /><em>Image: Simon Wilkinson/SWpix</em></p>\n<p>The questioning of the team's strategies started at last July's Tour de France and gathered pace during the 2023 Vuelta, in which they failed to place a rider in the top 30. Thwarted on the transfer market, Ellingworth's exit was not a surprise, particularly following the departure of star riders such as Tao Geoghegan Hart, and the failure to sign superstar targets such as Remco Evenepoel and Primož Roglič.</p>\n<p>But then, with Brailsford moving into football, Ellingworth under increasing pressure, the best-laid plans misfiring, an uncharacteristic lack of clarity on leadership and Grand Tour podiums now that much harder to achieve, is the team as attractive to the best riders as it once seemed?</p>\n<p>Not any more, according to former Team Sky rider Ian Boswell. \"They're the last person in the room when the music stops and they don't have a chair to sit on,\" he recently told The Cycling Podcast. \"Do they really have anyone who can theoretically win the Tour in 2024?\" Boswell asked, before adding that he knew of other riders who'd declined offers from the Grenadiers and gone to other teams, for smaller pay packets.</p>\n<p>At one point, it was believed that Brailsford would move back to a more hands-on role, something that, privately, some riders on the team would have welcomed. But his immediate future lies in Manchester, not Monaco. Brailsford knows, that if he stumbles, he could be savaged by the media, scrutinised by the sceptics, and derided by the doubters.</p>\n<p>Despite all that, Teflon Dave will probably just keep on going. His track record, both of success and of scepticism, speaks for itself. Meanwhile, the future of the Ineos Grenadiers seems shrouded in secrecy and uncertainty. What exactly are the team's plans for 2024? Who will be leading their campaign? Does any of that bother Jim Ratcliffe? Not really, would seem to be the answer.</p>\n<p><em>Cover image: Russell Ellis/SWpix</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"11d19012a0efc6a64e1911df1fec76779cc410b2b86ef85eeb134e58511c149e","category":"Cycling"}