{"title":"Event-based rainfall-induced landslide inventories and rainfall thresholds for Malawi","link":"http://link.springer.com/10.1007/s10346-023-02203-7","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Landslide event inventories are one of the most critical datasets to increase knowledge on landslide occurrences. However, they are rarely available in various regions, especially in countries of the Global South. This study aims to generate rainfall-induced landslide event inventories and define the rainfall thresholds responsible for landslide occurrence at the national scale of Malawi, Africa. We mainly followed a three-step methodology to generate landslide inventories. First, we went through media reports to identify documented landslide events. Second, we used Sentinel-2 images to identify possible areas affected by landslides using automated change detection algorithms based on vegetation indices. Third, we manually went through optical images provided by Planet Lab and Google Earth and mapped landslides via visual image interpretation. Overall, we mapped 27 rainfall-induced landslide inventories between 2003 and 2022, with a total of 4709 individual landslides. We then analysed the Malawian terrain and identified two different landscape clusters (i.e. Cluster 1 and Cluster 2) showing similar morphometric and climatic conditions. Ultimately, we calculated the rainfall threshold for each landscape cluster. The minimum rainfall amounts responsible for landsliding correspond to 66 mm/two-day and 51 mm/day in Clusters 1 and 2, respectively. In this context, our paper not only presents and shares the first national-scale, digital rainfall-induced landslide event inventory database of Malawi but also suitable rainfall thresholds to be potentially exploited for a national scale landslide early warning system. A similar framework could be applied to generate landslide inventories for other data scarce regions.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"11d2cc2d9dd236585d19c02e9f1a66569d13f11ef2f387e1f98427fd1a04f5fb","category":"Environment"}