{"title":"Screening and diagnosis of COPD and asthma based on government guidelines empowering peripheral health workers in Pune district Maharashtra, India: A study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308210","date":1725544800000,"content":"<p>by Jayashree Sachin Gothankar, Medha Deepak Bargaje, Sanjivani Vishwanath Patil, Prakash Prabhakarrao Doke</p>\r\n\r\nCOPD is the second leading cause of death in India. The guidelines for early detection of COPD were released by the Government of India in 2019. However, due to the COVID-19 pandemic, its implementation could not be optimal. Diagnosis of COPD is based on the presence of respiratory symptoms, the presence of exposure to risk factors, and the presence of poorly reversible airflow obstruction as assessed using a spirometer. Spirometers are currently available only at a few district hospitals. The existing guidelines expect the patient to visit the Rural hospital/ Community Health Centre, which does not have a spirometer or a pulmonary medicine specialist. Also, it is not feasible or accessible for patients to visit the district hospital to get diagnosed. The current study will be implemented to determine the prevalence, annual incidence of COPD and asthma, quality of life, and nutritional status of COPD and asthma patients. The novelty of this implementation research, which will be conducted in collaboration <i>with Zilla Parishad</i> (i.e., Government), Pune district, is the empowerment of an Accredited Social Health Activist (ASHA), a peripheral health worker to screen all individuals using a peak flow meter and confirmation of the diagnosis at health and wellness center (HWC). An accredited Social Health Activist (ASHA) will take relevant history to suspect COPD and asthma in 30+-year-old adults, and she will refer the suspected cases to the Community Health Officer (CHO) at the Health and Wellness Center. The CHO/ Medical officer of PHC will initiate the appropriate treatment after confirming the diagnosis using a portable spirometer. The difficult-to-diagnose patients with comorbidity and acute exacerbations will be referred to the nearest higher center, i.e., Primary Health Centre (PHC) or Community Health Centre (CHC), where a primary care physician is available. The ASHA workers will provide two follow-ups to these patients in a year, depending on the severity, to ensure compliance with the treatment. Thus, early diagnosis and appropriate treatment of COPD and asthma at the community level may help to reduce the episodes of acute exacerbations.","author":"Jayashree Sachin Gothankar","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"11e6af848989a8a10a961167093b12a265c21dcbf81f238560ede31272ae1071","category":"Interdisciplinary"}