{"title":"Paragon is working to get its ntfs3 filesystem into the Linux kernel","link":"https://arstechnica.com/?p=1785374","date":1628244923000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-183241353-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-183241353.jpg\">Enlarge</a> <span>/</span> Your hard drives and SSDs aren't any better than the filesystem you format them with. Paragon's ntfs3 driver combines decent performance with a fully featured implementation—a combination that neither Linux in-kernel ntfs nor FUSE-mounted ntfs-3g can claim both halves of. (credit: <a href=\"https://www.gettyimages.com/detail/photo/harddisk-zoomed-in-royalty-free-image/183241353\">dublinmark / Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>In March of last year, proprietary filesystem vendor Paragon Software <a href=\"https://arstechnica.com/information-technology/2020/03/the-exfat-filesystem-is-coming-to-linux-paragon-softwares-not-happy-about-it/\">unleashed</a> a stream of anti-open source FUD about a Samsung-derived exFAT implementation headed into the Linux kernel. Several months later, Paragon seemed to have seen the error of its ways and <a href=\"https://www.phoronix.com/scan.php?page=news_item&amp;px=Paragon-Read-Write-NTFS-Linux\">began</a> the arduous process of getting its own implementation of Microsoft's NTFS (the default filesystem for all Windows machines) into the kernel as well.</p>\n<p>Although Paragon is still clearly struggling to get its processes and practices aligned to open source-friendly ones, Linux kernel <a href=\"https://en.wikipedia.org/wiki/Benevolent_dictator_for_life\">BDFL</a> Linus Torvalds seems to have taken a personal interest in the process. After nearly a year of effort by Paragon, Torvalds continues to gently <a href=\"https://lore.kernel.org/lkml/CAHk-=whfeq9gyPWK3yao6cCj7LKeU3vQEDGJ3rKDdcaPNVMQzQ@mail.gmail.com/\">nudge</a> both it and skeptical Linux devs in order to keep the project moving forward.</p>\n<h2>Why Paragon?</h2>\n<p>To those familiar with daily Linux use, the utility of Paragon's version of NTFS might not be immediately obvious. The Linux kernel already has one implementation of NTFS, and most distributions make it incredibly easy to install and use another FUSE-based implementation (ntfs-3g) beyond that.</p></div><p><a href=\"https://arstechnica.com/?p=1785374#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1785374&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"11e6b67533d4159c53c231b04311d23f28e54f3e0e2e28b61880c0976f133761","category":"Tech"}