{"title":"Grafana เปลี่ยนไลเซนส์เป็น AGPL ป้องกันคนนำไปให้บริการคลาวด์","link":"https://www.blognone.com/node/122303","date":1619068802000,"content":"<div><div><div><p>Grafana Labs เดินตามรอย Elastic Inc ด้วยการเปลี่ยนสัญญาอนุญาต 3 โครงการหลัก ได้แก่ Grafana, Loki, และ Tempo จาก Apache License เป็น AGPL เพื่อป้องกันการนำซอฟต์แวร์ไปให้บริการคลาวด์</p>\n<p>ช่วงสองปีที่ผ่านมา บริษัทที่พัฒนาโครงการโอเพนซอร์สเปลี่ยนไลเซนส์เพื่อป้องกันการให้บริการคลาวด์หลายครั้ง โครงการสำคัญๆ คือ <a href=\"https://www.blognone.com/node/107584\">MongoDB</a> และ <a href=\"https://www.blognone.com/node/120632\">Elasticsearch </a> ที่เปลี่ยนไปใช้ SSPL แทน</p>\n<p>สัญญาอนุญาตแบบ AGPL นั้นยังถือว่าเป็นโอเพนซอร์สอยู่ (อยู่ในรายการ <a href=\"https://opensource.org/licenses/AGPL-3.0\">OSI-approved license</a>) โดยมีเงื่อนไขคือผู้ที่ดัดแปลงซอฟต์แวร์และให้บริการผ่านเน็ตเวิร์ค ต้องปล่อยโค้ดที่ดัดแปลงนั้นให้กับผู้ใช้งานด้วย ทาง Grafana Labs ยอมรับว่า AGPL นั้นป้องกันคนนำซอฟต์แวร์ไปให้บริการคลาวด์ไม่ดีเท่า SSPL ที่บังคับให้เปิดเผยซอร์สโค้ดอื่นๆ นอกโครงการ เช่น ซอฟต์แวร์จัดการระบบ, ซอฟต์แวร์ทดสอบ ดังนั้นหากผู้ใช้ใช้งาน Grafana โดยไม่ได้ดัดแปลงอะไรก็จะไม่ได้รับผลกระทบ</p>\n<p>ซีอีโอของ Grafana Labs กล่าวถึงความเสี่ยงที่อาจจะมีคน fork โครงการแบบเดียวกับ Elasticsearch ว่าตอนนี้ก็มีโครงการ fork ของ Grafana อยู่บ้างแล้ว และจริงๆ Grafana เองก็เป็นโครงการ fork ออกมาจาก Kibana แต่เขาก็ระบุว่าโครงการโอเพนซอร์สจะสำเร็จได้ต้องมีการดูแลโครงการอย่างต่อเนื่องด้วย</p>\n<p>ที่มา - <a href=\"https://grafana.com/blog/2021/04/20/grafana-loki-tempo-relicensing-to-agplv3/\">Grafana Blog</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/449ea2561786b68210d3f7e14e8c08c6.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/grafana\">Grafana</a></div><div><a href=\"/topics/open-source\">Open Source</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"11eacdb89a3f7bb0bbc940af18a997fd950f3b44fbfdfe5f78c3794490f88d21","category":"Thai"}