{"title":"Folic acid in carboxymethylcellulose/polyethylene oxide electrospun nanofibers: preparation, release and stability","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13728?af=R","date":1720527386000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Folic acid (FA), a synthetically produced compound analogous to vitamin B9, also referred to as vitamin folate, is an essential compound in human health and faces challenges in stability during food processing. This study explores the incorporation of FA into carboxymethylcellulose (CMC) nanofibers using electrospinning to enhance its stability.</p>\n<h2>RESULTS</h2>\n<p>In this study, optimization of both electrospinning and solution parameters facilitated the fabrication of nanofibers. Furthermore, incorporating FA into CMC/polyethylene oxide (PEO) nanofibers resulted in thinner fibers, with an average diameter of 88 nm, characterized by a flat shape and smooth surface. Fourier transform infrared spectroscopic analysis demonstrated substantial hydrogen bonding interactions between FA and the polar groups present in CMC. This interaction contributed to an encapsulation efficiency of 94.5%, with a yield exceeding 87%. Thermal analysis highlighted mutual interference between CMC and PEO, with FA enhancing the thermal stability and reducing the melting temperatures and enthalpies of PEO, while also increasing the reaction heats of CMC. The encapsulated FA remained stable in acidic conditions, with only 6% degradation over 30 days, demonstrating the efficacy of CMC/PEO nanofibers in safeguarding FA against acidic environments. Moreover, the nanofibers provided a protective barrier against UV radiation, thereby preserving the stability of FA.</p>\n<h2>CONCLUSION</h2>\n<p>This study emphasizes the efficacy of CMC/PEO nanofibers as a protective matrix against FA degradation. The findings indicate that this innovative approach could significantly diversify the applications of FA in food fortification, addressing concerns regarding its vulnerability to temperature and hydrolysis reactions during food processing. © 2024 Society of Chemical Industry.</p>","author":"Karen A Zavala‐Castillo, \nNelly Flores‐Ramírez, \nSalomón R Vásquez‐García, \nHéctor E Martínez‐Flores, \nDaniel Fernández‐Quiroz","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"11ece56b9196d38a7b03096435deabe42086875a967f130b7fd76bd72ab1f697","category":"Environment"}