{"title":"The iPhone 15 Pro’s non-click buttons will reportedly work just fine with a case","link":"https://www.macworld.com/article/1679403/iphone-15-pros-capacitive-buttons-sensitivity-toggle.html","date":1680281135000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When we read about the rumors of Apple changing the buttons on the iPhone 15 Pro from standard clickable buttons to solid-state capacitive ones, we had one question: <a href=\"https://www.macworld.com/article/1665435/iphone-15-pro-solid-state-volume-mute-buttons-why.html\">How will they work with a case?</a> According to a new report, Apple has heard our concerns.</p>\n\n\n\n<p>Anonymous A.S. on MacRumors, who previously reported on how the capacitive button will work and leaked the possibility of an Action button in place of the mute switch, has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://forums.macrumors.com/threads/capacitive-buttons-on-iphone-15-pro-models-use-a-new-micro-processor-to-manage-button-presses-and-enhanced-find-my-support-while-the-phone-is-off.2385131/?post=32067217#post-32067217&amp;xcust=1-1-1679403-1-0-0&amp;sref=https://www.macworld.com/feed\">followed up on his original report</a> with some new details about how the buttons will work when placed in a case: “Forgot to mention he does know those capacitive buttons will work very well with gloves and cases if designed correctly, as there’s a sensitivity toggle.”</p>\n\n\n\n<p>If true, that means Apple will let users adjust how hard or soft they need to press the buttons in order to be recognized, so the buttons shouldn’t be impacted by stiffer cases. If anything, the buttons might work better than they do now with some cheaper cases.</p>\n\n\n\n<p>The power and volume buttons as well as the mute switch on the iPhone 15 Pro will all reportedly switch to solid-state buttons like the iPhone 7’s Home button. Dedicated haptic sensors will simulate the sensation of an actual press while <a href=\"https://www.macworld.com/article/1675641/iphone-15-pro-co-processor-capacitive-buttons-volume-power.html\">a new co-processor</a> will handle the power requirements after the battery has been depleted. They will reportedly have a variety of new features, including swipe controls and customization like the Apple Watch’s <a href=\"https://www.macworld.com/article/1674628/iphone-apple-watch-ultra-action-button.html\">Action button</a>.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"11edcb15493ee5fc95c1847f69da09a258dcfa41d5f2468dfcd31c9ce16ab6cf","category":"Apple"}