{"title":"Free-ranging dogs match a human’s preference in a foraging task","link":"https://academic.oup.com/cz/article/70/3/343/7317596?rss=1","date":1697241600000,"content":"<span><div>Abstract</div>Social learning is a mechanism used by many species to efficiently gain information about their environment. Although many animals live in an environment where members of other species are present, little is known about interspecific social learning. Domesticated and urbanized species provide the opportunity to investigate whether nonhuman animals can learn from heterospecifics such as humans, who are integral parts of their social landscape. Although domestic dogs <span>Canis familiaris</span> have been intensively researched for their ability to learn from humans, most studies have focused on dogs living as pets. However, free-ranging dogs represent the majority of the world’s dog population, they live alongside humans, scavenge on human refuse, and are subject to natural and sexual selection. Thus, free-ranging dogs with extensive exposure to humans and their artifacts provide the opportunity to investigate interspecific social learning in a naturalistic setting, where learning from humans might be a benefit for them. Here we tested individual free-ranging dogs in a between-subject design: Dogs in the control group could spontaneously choose between two novel and differently patterned food-delivering boxes. In the experimental group, instead, dogs could first observe an unfamiliar human approaching and eating from 1 of the 2 boxes. We provide the first evidence that free-ranging dogs match the choice of an unfamiliar human. These results show that at least simple forms of interspecific social learning might be involved in dogs’ success in living alongside humans in a complex urbanized environment.</span>","author":"","siteTitle":"Current Zoology Current Issue","siteHash":"e7197aa0e79464a44186f16a81d9758c42b85acdd06820e73429ff264fcd9f66","entryHash":"11fa5e31ea99005a9e126c567934ba4e71e4d1b65f6ffe8ad250515a2f263e46","category":"Environment"}