{"title":"PSXIII-29 How does the combination of 3-nitrooxypropanol with feed additives affect the performance, carcass characteristics, and meat quality of feedlot young Nellore bulls?","link":"https://academic.oup.com/jas/article/102/Supplement_3/788/7757766?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objective was to assess the impact of combining 3-nitrooxypropanol (3-NOP; Bovaer) with different feed additives on performance, carcass characteristics and meat quality. Young Nellore bulls (n = 164), aged 16 ± 1 mo with body weight (BW) = 410 ± 3 kg, were randomly allocated to 24 pens. There were three treatments, each with 8 replications (pens) per treatment and 7 animals per pen. The animals were fed a high-concentrate feedlot diet (R:C, 10:90) for 102 d, according with the following three treatments: 1) Control: Sodium Monensin [26 mg/kg dry matter (DM)]; 2) BOV: Control + 3-NOP (Bovaer; 100 mg/kg DM); 3) BOVPERF (Bovaer Performance pack): Control + 3-NOP (100 mg/kg DM) + Essential oils (Crina Ruminants, 100 mg/kg DM) + 25-OH-Vitamin D3 (Hy-D, 0.10 mg/kg DM) + carbo-amino-phospho-chelate of chromium and zinc (0.40 and 60 mg/kg of DM, respectively). The BW of yearling bulls were recorded at the beginning, the end of the adaptation period (28 d), and the conclusion of the experiment after a 16-h feed withholding period to facilitate the recording of shrunk BW. Based on these BW, it was possible to conduct analyses of the performance during the periods of 28 and 102 d of the experiment. Additionally, carcass characteristics were evaluated, along with assessments of the meat quality of these animals subjected to different treatments. Data were analyzed by ANOVA using the PROC MIXED of SAS 9.4 and means and contrast comparison evaluated by Tukey test at <span>P</span> &lt; 0.05. Feeding BOVPERF increased DM intake during the adaptation period (<span>P</span> &lt; 0.01) compared with control and BOV. However, the control group showed a greater conversion ratio (<span>P</span> &lt; 0.01) and feed efficiency (<span>P</span> &lt; 0.01) compared with BOV and BOVPERF at 102 d of the feedlot. There was a greater increase in hot carcass weight (HCW) with a difference of (+12 kg, <span>P</span> &gt; 0.01), greater carcass ADG (+113 g/d, <span>P</span> &lt; 0.01), followed by a greater dressing percentage (<span>P</span> &lt; 0.01), greater carcass gain yield (<span>P</span> &lt; 0.01), and better biological efficiency (- 9 kg diet in DM kg/15 kg of HCW, <span>P</span> = 0.02) for BOVPERF compared with control and BOV. Additionally, when analyzing meat quality characteristics, a significant difference (<span>P</span> &lt; 0.01) in pH values was observed for BOVPERF compared with control and BOV. In conclusion, the combination of 3-NOP with essential oils, 25-hydroxy-vitamin D3, and minerals such as chromium and zinc demonstrated positive effects on various aspects, including increased performance, carcass characteristics and meat quality</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1200b12c7f2a1dad6008a666c45304c20299a93c1a0fa63abdd489505421b6b8","category":"Environment"}