{"title":"307 Awardee Talk: Effects of dietary valerate glycerides on weanling piglet diarrhea and immunity","link":"https://academic.oup.com/jas/article/102/Supplement_2/132/7665014?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The use of various feed additives for their non-nutrient, immunomodulatory qualities is under investigation for application in swine production, especially during the post-weaning period. Butyrate (C4) is a known modulator of intestinal physiology, produced endogenously by commensal microbes and found in other organic sources. However, the understanding of the role of valerate (C5) as a feed additive for pigs has not been well-evaluated. Two experiments were conducted utilizing glycerides of butyrate or valerate as feed additives for weanling piglets under enterotoxigenic <span>Escherichia coli</span> (ETEC) infection conditions. In both experiments, daily diarrhea scores were recorded to monitor the frequency of diarrhea. The first pilot experiment utilized 20 weanling piglets (21 to 24 d of age) housed individually and assigned to either control diet, or control diet supplemented with 0.10% butyrate glycerides or 0.10% valerate glycerides. This experiment also aimed to establish a coinfection disease model, administering two strains of ETEC at a dose of 0.5 × 109 CFU/1.5 mL for each strain after a 7-d adaptation period (F4 and F18; two highly prevalent strains in swine production). Overall, piglets had significantly (<span>P</span> &lt; 0.05) decreased frequency of diarrhea in either treatment group compared with control, suggesting similar modulatory effects by dietary valerate glycerides and butyrate glycerides. In addition, pigs fed valerate glycerides tended (<span>P</span> = 0.061) to have less neutrophils and had significantly (<span>P</span> &lt; 0.05) less serum TNF-α on d 4 post-inoculation (PI). Moving forward, a full-scale experiment was performed using 60 weanling piglets (21 to 24 d of age) to further investigate the effect of dietary valerate glycerides on piglet health under ETEC F18 infection conditions. Treatments included nursery basal diet (control), 0.075% or 0.10% monovalerin, or 0.1% trivalerin added to control. Pigs fed 0.1% trivalerin exhibited significantly (<span>P</span> &lt; 0.05) reduced frequency of diarrhea and fecal shedding of ETEC F18. Serum samples were collected throughout the experimental period and six replicate pigs per treatment group were sacrificed on d 7 PI to collect intestinal samples for morphological analysis and intestinal mucosa RT-qPCR analysis. Pigs fed trivalerin had reduced (<span>P</span> &lt; 0.05) serum TNF-α on d 0 before inoculation and d 6 PI compared with pigs in control. The mRNA expression of TNFA in ileal mucosa from pigs fed 0.1% monovalerin tended (<span>P</span> &lt; 0.10) to be lower compared with control. In addition, ZO1 mRNA expression tended (<span>P</span> &lt; 0.10) to be increased in jejunal mucosa from pigs fed 0.1% trivalerin. Overall, the second experiment indicated that dietary supplementation of valerate glycerides reduced diarrhea and fecal shedding of ETEC F18 in piglets infected with ETEC. In conclusion, both experiments provide evidence in support of supplementing 0.075 or 0.10% valerate glycerides could enhance disease resistance of weanling piglets experiencing ETEC-associated diarrhea.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1201b029464d3e4004cc5ce52a3fc651bde2bfbd791e8ea85f7dcfbf85189d9e","category":"Environment"}