{"title":"Showdown in Lombardy: how Pogačar, Roglič, and Evenepoel compare head-to-head","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/showdown-in-lombardy-how-pogacar-roglic-and-evenepoel-compare-head-to-head","date":1695987491000,"content":"\n      <p>The story of the 2023 men’s cycling season has to a large extent been that of the dominance of an elite sextet of riders. Tadej Pogačar, Jonas Vingegaard, Remco Evenepoel, Primož Roglič, Mathieu van der Poel and Wout van Aert have each reached a level of astonishing ability that could easily be regarded as the very best in the world, were it not for the similarly high levels of the other five. They monopolise our attention in every race they compete in, and for good reason — between them, they’ve won all four of the Monuments raced so far this year, two of the three Grand Tours, swept up all the medals at the World Championships road race as well as the individual time trial title, in addition to a host of other races that make up nearly 70 victories in total.</p>\n<div></div>\n<div></div>\n<p>Their duels have supplied us with many of the most dramatic racing this season, from Pogačar and Vingegaard at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, Roglič and Evenepoel at the other Grand Tours, and Van der Poel and Van Aert’s ongoing rivalry in the Classics. Yet, due to conflicting schedules and specialities, it’s rare to see as many as three of them competing against each other in the same race.</p>\n<p>That’s why this year’s Il Lombardia is set to be a treat. Roglič announced last week that he would be joining Pogačar and Evenepoel at the Race of the Falling Leaves, setting up a meet between these three riders for the first time in two years. On that occasion, Pogačar overturned his fortunes to win at Il Lombardia having been defeated by Roglič at the Milano-Torino and Giro dell’Emilia in the days preceding it, while Evenepoel floundered further adrift. But much has changed since then, and the more evenly matched dynamic between them makes choosing a favourite among them difficult.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tadej-pogacar-s-2023-race-bike-the-details-behind-the-paris-nice-winning-weapon\"><strong><em>Read more: Tadej Pogačar’s 2023 Colnago V4Rs - the details behind the Slovenian's winning weapon</em></strong></a></p>\n<p>We’ve had a look at their past head-to-heads to see how they’ve stacked up historically.</p>\n<h3>Pogačar v Evenepoel</h3>\n<p>In April, cycling fans were robbed of the opportunity to watch Pogačar and Evenepoel take each other on at Liège–Bastogne–Liège when the former crashed out in the early stages of the race. Evenepoel went on to win at a canter, which left us even more wistful at what might have been, given the seemingly unstoppable run of form Pogačar was on leading up to the race (he won the Tour of Flanders, Amstel Gold and Flèche Wallonne back-to-back).</p>\n<p>This particular head-to-head attracted interest precisely because it has been so rare. They’ve never met at a Grand Tour, only ridden the same stage race once (the 2022 Tirreno-Adriatico, when Pogačar was overall victor), and only met at one-day Classics a handful of times. Curiously, Evenepoel has tended to come out on top in these races. In fact, most of the landmark major triumphs of the Belgian’s career have come while Pogačar was among the opposition: the 2022 Worlds road race, his enormous solo San Sebastián victory earlier that year, and his maiden WorldTour win at that same race in 2019.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Tirreno_897.jpg?v=1695984024\" alt=\"Evenepoel, Pogacar\" /></p>\n<p><em>Evenepoel and Pogačar have rarely faced off at the top of their game (Zac Williams/SWPix)</em></p>\n<p>But look closer and it becomes apparent that these races were less a matter of Evenepoel getting the better of Pogačar than the Slovenian having problems. As at Liège–Bastogne–Liège this year, he was also a DNF at both San Sebastián editions (in 2022 when clearly exhausted from having only just finished a gruelling Tour de France). If Evenepoel isn’t too fatigued from his efforts at the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>, and Pogačar in his usual autumnal form, this Lombardia would, arguably, be the first time we see both of them face-off at the top of their game.</p>\n<h3>Pogačar v Roglič</h3>\n<p>Unlike with Evenepoel, Pogačar has a firmly established rivalry with fellow Slovenian Primož Roglič. As compatriots, the two go back a long way, and have known each other and been friends for many years, the latter playing a mentoring role for the young rider during the early years of his career. They’ve also raced against each other many times, most famously at the 2020 Tour de France when Pogačar so dramatically took the yellow jersey from a stunned and dishevelled Roglič during the penultimate stage time trial on the Planche des Belles Filles.</p>\n<p>Roglič has since enacted a revenge of sorts, when he worked to help Jumbo-Visma teammate Jonas Vingegaard take Pogačar’s Tour de France crown the following edition in 2021, in a race that remains the last time they met. That’s a very long time for what was arguably the world’s hottest rivalry not long ago, but they’ve been on different programmes since then, Pogačar focussing on the Tour while Roglič has targeted the Giro and Vuelta instead. And you have to go back even further to Milan-Sanremo in 2022 (when they both lost out to Matej Mohorič) for the last time they competed in a one-day race against each other, mostly as Roglič doesn’t tend to prioritise the Classics.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20200917TDF0010-A.S.O._Alex_Broadway_cadedd2c-30ee-4134-842a-f0084952f924.jpg?v=1695984316\" alt=\"Pogacar, Roglic Tour de France\" /></p>\n<p><em>Tadej Pogačar and Primož Roglič went head to head at the 2020 Tour de France (Alex Broadway/ASO)</em></p>\n<p>On the occasions that Roglič does ride the Classics, he can be very competitive, even when up against Pogačar. Although Pogačar defeated him to win Il Lombardia in 2021, prior to that Roglič had been the star of the autumn, overcoming him to win both Milano-Torino and Giro dell’Emilia. And when both riders got themselves in the decisive five-man break at Liège–Bastogne–Liège in 2020 (just weeks after their Planche des Belles Filles showdown at the Tour de France), it was Roglič who had the quickest sprint to take victory.</p>\n<p>You sensed Roglič ended the Vuelta a España earlier this month with more left to give, having been obliged to sacrifice his own chances to help Jumbo-Visma Sepp Kuss to win the red jersey. If he’s carried over his form from that race, expect Roglič to be fired up and eager to race for the win.</p>\n<h3>Evenepoel v Roglič</h3>\n<p>Over the last 13 months, Evenepoel and Roglič have become very familiar foes. They encountered each other at a Grand Tour for the first time at last year’s Vuelta a España, where they became the top GC contenders for overall victory before a crash for Roglič ensured Evenepoel took the overall victory. Since then their rivalry has been renewed twice more at Grand Tours: first at the Giro earlier this year, when they seemed poised to once again be the top GC candidates before Covid forced Evenepoel out after the first week, leaving Roglič to take overall victory; then most recently at the Vuelta, when Roglič once again came out on top albeit as a teammate for <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/ive-discovered-things-i-didnt-know-about-myself-sepp-kuss-victorious-journey-of-discovery-at-the-vuelta-a-espana\">overall victory Sepp Kuss</a>, while one bad day scuppered Evenepoel’s hopes.</p>\n<p>In terms of one-day races though, meetings between the two have been much rarer. The last time was at the 2021 Il Lombardia won by Pogačar, and, aside from that, the only other occasions have been the Giro dell’Emilia the week before, and while representing their nations in Worlds and Olympics road races.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230902VUE02020-UNIPUBLIC___SPRINT_CYCLING_AGENCY.jpg?v=1693681123\" /></p>\n<p><em>Roglič and Evenepoel met recently at the Vuelta a España (Sprint Cycling Agency/Unipublic)</em></p>\n<p>For an idea of how they might compare, we can instead look at their head-to-head record in individual stages of the stage races they’ve competed in, particularly those in which they’ve gone <em>mano-y-mano</em> on punchy or mountain top finishes. At the recent Vuelta, Evenepoel won the sprint atop Arinsal in a small group featuring Roglič, only for Roglič to edge him into second for a stage win at Xorret de Catí later that week. Even at the Volta a Catalunya stage race this year they shared the spoils, each taking two stages each (albeit with Roglič winning the GC by six seconds). From what we can tell, there doesn’t seem to be much in it between the two.</p>\n<h3>Conclusion</h3>\n<p>Although the parcours for this year’s Il Lombardia reverts back to that of the 2021 edition, when a rampaging Pogačar won ahead of both Roglič (in fourth) and Evenepoel (in 19th) the last time all three riders met, this year’s reunion looks set to be much more evenly-matched, and will require tactical smarts as well as brute force. Each rider likes to compete in a fairly straightforward, unsubtle manner, indulging their preferred way of racing without having to worry too much about the opposition. Pogačar loves to attack and attack early; Evenepoel even more so, to the extent that he doesn’t even seem to like sharing the workload with breakaway companions; and Roglič enjoys riding passively, knowing he can rely on his quick sprint to take victory. Against each other, however, they won’t have the luxury of riding so resolutely on their own terms, raising some potentially fascinating tactical conundrums. If each brings their A-game, and manages to avoid crashing or getting ill, this could be one of the showdowns of the season.</p>\n<p><em>Cover image by Pauline Ballet/ASO</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"12083a589a434347be9ce0b5fabed5d796ed43e31cc6a2f24c456e49425eea56","category":"Cycling"}