{"title":"Report: Paris-Roubaix postponed due to new COVID-19 restrictions","link":"https://cyclingtips.com/2021/03/paris-roubaix-postponed-due-to-new-covid-19-restrictions/","date":1616591686000,"content":"<p>Paris-Roubaix, set to take place April 11th, has been postponed due to rising COVID-19 cases in France, according to <a href=\"https://www.leparisien.fr/sports/cyclisme/paris-roubaix-reporte-lepreuve-ne-se-disputera-pas-le-11-avril-24-03-2021-VHL7XS5TONCU7FKA53PASARYIE.php\">a report in Le Parisien</a>. The men&#8217;s and women&#8217;s races, which were both cancelled in 2020, are hoping to snag a new date in mid-October. Although the ASO, organizers of Paris-Roubaix, have yet to make an official announcement.</p>\n\n\n\n<p><a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Aso-travaille-toujours-sur-la-date-du-11-avril-pour-paris-roubaix/1235625\">L’Equipe reports</a> that the decision to not hold Paris-Roubaix on the date of 11 April will not be taken before next week. ASO, the organizers of the race, will recon the course to see how they can drastically reduce the number of spectators. A final decision follows next week, the sports paper reports. ASO has not officially responded to the rumours. </p>\n\n\n\n<p>France has recently announced new lockdown restrictions that will begin over the weekend. The new restrictions spurred rumblings of Paris-Roubaix&#8217;s cancellation late last week. Hauts-de-France&#8217;s prefect Michel Lalande said <a href=\"https://cyclingtips.com/2021/03/volta-a-catalunya-underway-paris-roubaix-uncertainty-daily-news/\" target=\"_blank\" rel=\"noreferrer noopener\">in an interview</a> mere days ago that he felt uncertain about the race going ahead as planned. </p>\n\n\n\n<p>This is now the third time Paris-Roubaix has hit a wall. The race was already postponed in April of 2020 and outright cancelled in October later last year. Due to continued coronavirus pandemic uncertainty, the UCI has already extended the October calendar from the 19th to the 31st, so there is still a chance we will see a fall edition of Paris-Roubaix.</p>\n\n\n\n<p>For the women&#8217;s peloton, this news is particularly disappointing. The 2020 edition was set to be the first-ever women&#8217;s Paris-Roubaix, an event the peloton has been asking for for years. Thankfully it&#8217;s not over yet – stay tuned for more news as it develops. </p>\n\n\n\n<p><em>This story is ongoing. </em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/paris-roubaix-postponed-due-to-new-covid-19-restrictions/\">Report: Paris-Roubaix postponed due to new COVID-19 restrictions</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"12168157edc90f95542ab10ed0e6e4b9284d070a3f5598d2e98483b6bbede90c","category":"Cycling"}