{"title":"Antiparasitic approaches and strategies in European aquaculture, with emphasis on Mediterranean marine finfish farming: Present scenarios and future visions","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12857?af=R","date":1710918000000,"content":"<h2>Abstract</h2>\n<p>Parasitic infections can be occasionally severe in the European marine aquaculture industry, including the Mediterranean region, as they can incur considerable financial losses. Due to the lack of commercial vaccines, therapeutic approaches seem the only measure to battle parasitic outbreaks. Integrated strategies and increased resilience of the hosts, may limit to some degree the level of infestation. Ectoparasitic therapy is traditionally based on baths, with few exceptions. Several antiparasitic compounds have been registered in European aquatic medicine to combat mainly salmon sea lice; however, few of them are readily used against Mediterranean fish parasites. Formalin and less commonly hydrogen peroxide baths are applied against ectoparasites in the Mediterranean region. Most of the registered anti-lice antiparasitics have limited potential perhaps due to their adverse environmental impact. Future therapies against fish parasites will rely mainly on effective substances ensuring consumer, animal, and environmental welfare. Ideally, dietary antiparasitics such as praziquantel exhibiting mild environmental impact and high efficacy against a wide range of pathogens should be adopted. Moreover, combined strategies such as integrated pest management, involving various management practices with limited use of chemicals, should be a priority for specific parasitic outbreaks. The information presented in this review can guide future research and promote effective and prudent parasite control practices for Mediterranean-farmed fish.</p>","author":"George Rigos, \nFrancesc Padrós, \nEleni Golomazou, \nCarlos Zarza","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"1217022bf69ffeea059d8334cfce243959803c09eaf9e34ba4c4c257378d9de9","category":"Environment"}