{"title":"Introducing HashiTalks: Build, a Developer-Focused Edition of Our Community Event","link":"https://www.hashicorp.com/blog/introducing-hashitalks-build-a-developer-focused-edition-of-our-community-event","date":1625846400000,"content":"<p>When we hosted our <a href=\"https://www.hashicorp.com/blog/hashitalks-2019\">first HashiTalks community event in 2019</a>, our goal was simple: find new ways to showcase the work of HashiCorp users, no matter their technical level, timezone, or location. What started out as an annual event quickly grew into a series of events, covering different regions and languages, all the while making HashiCorp community knowledge even more accessible.</p>\n<p>Today, we’re introducing a new type of HashiTalks. On July 21-22, we are organizing <a href=\"https://events.hashicorp.com/hashitalksbuild\">HashiTalks: Build</a>, the first developer-focused edition of this virtual community event series. Instead of explaining how to provision and secure infrastructure with HashiCorp products, the sessions at this event will take a look at how the products work under the hood and how you can build new features and integrations for them.</p>\n<h2><a href=\"#what-you-can-expect-at-hashitalks-build\">»</a><a></a>What You Can Expect at HashiTalks: Build</h2>\n<p>Ever wondered how the Terraform protocol gets developed and what the new SDK will bring? Are you curious about Vagrant's transition from Ruby to Go or interested in what the Waypoint Runner architecture looks like? Wondering how to build a device driver for Nomad and how to write better tutorials? Or are you looking for plugin examples from experienced Vault secrets engine developers?</p>\n<p>These are the kinds of topics that HashiTalks: Build will focus on. With more than 40 live-streamed sessions covering the full suite of HashiCorp products, as well as community building, ethics in engineering, and dependency management, we are confident that attendees will enjoy leveling up their engineering skills and getting a deeper look at the open integration architecture of these tools.</p>\n<p>We’ll also hold live Q&amp;As following many sessions and moderated panels on July 22. You ask the questions, we'll provide the answers.</p>\n<h2><a href=\"#hands-on-workshops\">»</a><a></a>Hands-On Workshops</h2>\n<p>Want to learn hands-on? Join us on July 21, the first day of HashiTalks: Build, for <a href=\"https://events.hashicorp.com/hashitalksbuild-workshops\">two workshop sessions</a>.</p>\n<p>The first workshop is led by Kaitlin Carter, Education Architect at HashiCorp. In that session, you’ll learn how to write and organize excellent technical content, with best practices from the creators of <a href=\"https://learn.hashicorp.com/\">HashiCorp Learn</a>. The second workshop will help you pick up new debugging skills for Nomad as Roblox Principal Engineer Shishir Mahajan teaches you how to detect problems in Nomad client nodes.</p>\n<h2><a href=\"#sign-up-and-see-the-schedule\">»</a><a></a>Sign Up and See the Schedule</h2>\n<p>Head over to the <a href=\"http://events.hashicorp.com/hashitalksbuild\">HashiTalks: Build event site</a> to check out the full schedule, register for the livestream (free) and <a href=\"https://events.hashicorp.com/hashitalksbuild-workshops\">workshops</a>. Workshops can fill up quickly, so register soon. You can share your thoughts and follow the events live on Twitter with the hashtag <a href=\"https://twitter.com/search?q=%23HashiTalks&amp;f=live\">#HashiTalks</a>.</p>\n<p>We’re looking forward to seeing you on July 21 and 22 at <a href=\"https://events.hashicorp.com/hashitalksbuild\">HashiTalks: Build</a>!</p>","author":"Kerim Satirli","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"121af2d45ce31520198f7874626c4db8d46c2b719c24b2672e5c8e1470cf2500","category":"Tech"}