{"title":"Aquaponics as a climate‐smart technology for sustainable food production: A comparison with conventional production system in United Arab Emirates","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13049?af=R","date":1712550638000,"content":"<h2>Abstract</h2>\n<p>This research aimed to standardize the growth of two commonly cultivated herbs in the United Arab Emirates, basil (<i>Ocimum basilicum</i> L.) and coriander (<i>Coriandrum sativum</i> L.), within an aquaponic system. The study compared a recirculatory aquaponic system (RAS) with static aquaculture systems (for fish performance) and irrigated greenhouse cultivation systems (for herb performance). The project assessed growth, element composition, and aquaponic efficacy to determine the viability of aquaponics for these herbs. In the soilless (aquaponic) system, both herbs exhibited significantly enhanced growth parameters, including plant height, root length, leaf count, and fresh and dry weights, compared to conventional soil-based cultivation. This growth enhancement was attributed to the additional nutrients derived from fish waste in the aquaponic system. Furthermore, plants displayed significantly higher element levels, highlighting the effectiveness of aquaponics in nutrient delivery. Notably, the aquaponic system demonstrated superior antioxidant activity in both herbs. The study also revealed remarkable water use efficiency in the aquaponic system, with water savings exceeding 90% compared to conventional methods. These findings establish the efficiency and sustainability of aquaponic systems over traditional food production approaches, particularly in arid regions such as the United Arab Emirates. Utilizing an aquaponic system for these commonly cultivated herbs resulted in improved growth and resource efficiency, affirming its viability as an environmentally sustainable and efficient method of food production in desert climates.</p>","author":"Drishya Nishanth, \nMariam H. S. Alshamsi, \nAlreem M. K. A. Alkaabi, \nAysha H. A. AlKaabi, \nShamma H. K. Alnuaimi, \nChythra Somanathan Nair, \nAbdul Jaleel","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"121e3703ed360dd2d5e074b0889a9278467139dfb8fba516ae6059f45ca5e889","category":"Environment"}