{"title":"Instagram to Require Users to Provide Their Date of Birth","link":"https://www.macrumors.com/2021/08/30/instagram-date-of-birth-requirement/","date":1630345980000,"content":"Instagram <a href=\"https://about.instagram.com/blog/announcements/asking-people-for-their-birthdays\">today said</a> that it is now requiring all Instagram users to share their date of birth to \"create safer, more private experiences for young people.\"\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/instagram-add-date-of-birth.jpg\" />\r\n<br />\r\nInstagram users who have not already provided their birthday to Instagram will be prompted to share it. Instagram plans to ask for date of birth when the app is opened up, and will provide notifications asking for the information a handful of times.\r\n<br />\r\n\r\n<br />\r\nUsers will be required to share their birthdays to continue using the Instagram app. Instagram also plans to place warning screens on certain posts and will ask for a birthday before allowing the content to be viewed. This is the same interface that's already in place for sensitive or graphic posts, but it will also now require a date of birth confirmation.\r\n<br />\r\n\r\n<br />\r\nThe age information will be used to create new safety features, and it will help ensure that the \"right experiences\" are provided to the \"right age group.\" Back in March, Instagram introduced changes to prevent adults from sending messages to users who are under 18, and last month, began defaulting new accounts for users 16 and under to private.\r\n<br />\r\n\r\n<br />\r\nInstagram is developing \"new systems\" to address people inputting the incorrect date of birth, using AI to estimate how old people are. Going forward, if someone selects an age and Instagram's technology disagrees, the app will offer a menu of options for age verification.<div>Tag: <a href=\"https://www.macrumors.com/guide/instagram/\">Instagram</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/30/instagram-date-of-birth-requirement/\">Instagram to Require Users to Provide Their Date of Birth</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/instagram-to-require-users-to-provide-their-date-of-birth.2309213/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=kjs_apuXGpk:hfumhD6_f1A:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=kjs_apuXGpk:hfumhD6_f1A:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/kjs_apuXGpk\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"122138605f398bb865f09c23954a45623d3df5bab915fb1a6dab285ccf66500d","category":"Apple"}