{"title":"Anatomy of a sprint: The Space Between","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/anatomy-of-a-sprint-the-space-between","date":1688756928000,"content":"\n      <p><span>‘Ma’ is a Japanese word that doesn’t translate easily into English, but roughly means ‘space’ or ‘interval’. It is nothing, but you have to think of it as a tangible, physical thing – it is everything that isn’t something.</span></p>\n<p><span>The Japanese director Hayao Miyazaki once spoke to Roger Ebert about his concept of space after the film critic had praised the pacing of his movies. Miyazaki didn’t need non-stop action – he gave his characters room to breathe, and to do nothing, because that’s the most accurate reflection of how life works. </span></p>\n<div></div>\n<p><span>“We have a word for that in Japanese,” he said. “It’s called ‘ma’. Emptiness. It’s there intentionally.” Miyazaki illustrated ma by clapping his hands four times and telling Ebert, “The time in between my clapping is ma.”</span></p>\n<p><span>Photographers call this negative space: photographs are composed of the outlines of things, but the space that surrounds them also has its own physical shape, even if it is composed of nothing. Musicians and composers don’t think of the spaces between notes as nothing – the space is an equal part of the music as the notes.</span></p>\n<p><span>This is something that <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> followers might appreciate, after a quiet day between Mont-de-Marsan and Bordeaux for the seventh stage of the 2023 race ended in a sprint victory for Jasper Philipsen. We can only ever appreciate the full narrative of a Grand Tour once it is finished, but this lull in the action came after two frenetic days in the Pyrenees, and gave the race a chance to draw breath. As Miyazaki went on to tell Ebert: “If you just have non-stop action with no breathing space at all, it’s just busyness. But if you take a moment, then the tension building in the film can grow.” Stage seven was a story of growing tension towards the finish, but also a pause in the GC action which will give greater meaning to what has gone before and what is to come.</span></p>\n<p><span>The Tour is all about space. We need space between the action, as Hayao Miyazaki and Tour <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/creating-the-tour-how-thierry-gouvenou-designs-every-kilometre\">course designer Thierry Gouvenou</a> well know. The Tour links urban populations and settlements, but it largely takes place in the wide open spaces between them, and Tadej Pogačar will tell you that the 25-second space that separates him and Jonas Vingegaard in the GC is anything but empty.</span></p>\n<p><span>Also: sprinting is about space.</span></p>\n<p><span>Bunch sprinting is a potent, intoxicating cocktail of overlapping elements. Speed, strength, timing, confidence, teamwork, focus, momentum, luck, agility, skill, judgement, flexibility, aerodynamics, instinct, experience, an understanding of limits and a hard-headed intransigence – the ability to not do the sensible thing and sit up, ease the pressure off the pedals and acknowledge that this is stupid – catalyse into a starburst of intense effort, blurred motion and high velocity, and the person who has not necessarily the most of all of the above, but the right proportions at the right times, wins.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/cy23-tdf-js-07-0037_1024x1024.jpg?v=1688756738\" /></div>\n<p><span>But it is also a little about space, which is a less obvious thing than speed and strength and all those other things. Jasper Philipsen and Mark Cavendish had lots of it in the bunch sprint at the end of stage seven of the 2023 Tour de France, and that is why they came first and second. Mads Pedersen had none of it, which is why he came 10th.</span></p>\n<p><span>In fact, sprinting is a lot about space. I think Mark Cavendish thinks about that a lot, because he said after he won the 2011 World Road Race Championships, where he’d looked boxed in on the right with a perilously short distance to go, that he </span><i><span>knew </span></i><span>it would open up on the right, because that’s what happens in sprints where there is a right hand bend before the straight. (I also remember speaking with him a month or two after he didn’t win the 2016 World Road Race Championships after having assumed that with the sprint coming off a right hand bend before the straight, that it would open up on the right, and he was a) mystified and b) pissed off.)</span></p>\n<p><span>And you could see him, all the way up the gently curving right hand bend of the Quai Richelieu and the Quai Louis XVIII alongside the meander of the Garonne river in central Bordeaux, hanging around on the right-hand side of the road, boxed in, and a little far back, maybe 25th wheel with a kilometre to go, but knowing that the space would open up on the right, as it almost always does.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/time-is-running-out-for-mark-cavendishs-history-making-victory-but-hope-remains\"><strong><em>Read more: Time is running out for Mark Cavendish's history-making victory, but hope remains</em></strong></a></p>\n<p><span>Sporting immortality dangled tantalisingly in front of Mark Cavendish in Bordeaux, and between 350m to go and 100m to go, it looked like a historic 35th Tour stage win was within his grasp. The gap had opened at 350m, with clear road in front of him. He started really accelerating with 300m to go. He hit the front with 200m to go. At 150m, he was still first. All those things that combine to make a perfect sprint had aligned perfectly, except one: luck. A small speed bump at the start of his sprint had knocked him off his line enough that his rear wheel momentarily went into the air and when it hit the ground again, slightly diagonal to his direction of travel, the combined force of that not-quite-straight impact and the torque he was putting through his cranks shifted his chain one gear. He slowed as his gears ground, just as Philipsen really went for it, and in those final 100m – six pedal revs, five seconds – the Belgian claimed his third stage win of this Tour and the fifth of his career, while Cavendish picked up only his fourth second place.</span></p>\n<p><span>The space that opened up in front of Mark Cavendish on the finishing straight in Bordeaux as he furiously fought his way to the line wasn’t empty. It was full of meaning, possibility, ambition and hope. And ultimately, disappointment.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1223a95b903bd834be570b000ca433d94660198f0b84fa396fe341d502d9e60f","category":"Cycling"}