{"title":"Electrical stimulation of Schwann cells on electrospun hyaluronic acid carbon nanotube fibers","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308207","date":1723039200000,"content":"<p>by Judy Senanayake, Raymond R. Mattingly, Harini G. Sundararaghavan</p>\r\n\r\nNeurofibromatosis Type 1 (NF1) is a complex genetic disorder characterized by the development of benign neurofibromas, which can cause significant morbidity in affected individuals. While the molecular mechanisms underlying NF1 pathogenesis have been extensively studied, the development of effective therapeutic strategies remains a challenge. This paper presents the development and validation of a novel biomaterial testing model to enhance our understanding of NF1 pathophysiology, disease mechanisms and evaluate potential therapeutic interventions. Our long-term goal is to develop an invitro model of NF1 to evaluate drug targets. We have developed an <i>in vitro</i> system to test the cellular behavior of NF1 patient derived cells on electroconductive aligned nanofibrous biomaterials with electrical stimulatory cues. We hypothesized that cells cultured on electroconductive biomaterial will undergo morphological changes and variations in cell proliferation that could be further enhanced with the combination of exogenous electrical stimulation (ES). In this study, we developed electrospun Hyaluronic Acid–Carbon Nanotube (HA-CNT) nanofiber scaffolds to mimic the axon’s topographical and bioelectrical cues that influence neurofibroma growth and development. The cellular behavior was qualitatively and quantitively analyzed through immunofluorescent stains, Alamar blue assays and ELISA assays. Schwann cells from NF1 patients appear to have lost their ability to respond to electrical stimulation in the development and regeneration range, which was seen through changes in morphology, proliferation and NGF release. Without stimulation, the conductive material enhances NF1 SC behavior. Wild-type SC respond to electrical stimulation with increased cell proliferation and NGF release. Using this system, we can better understand the interaction between axons and SC that lead to tumor formation, homeostasis and regeneration.","author":"Judy Senanayake","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"122880f5ececf24ca9cc08ab228ad6b9823a8ce75b03911aef60400d39604ba3","category":"Interdisciplinary"}