{"title":"Analysis of the Liquefaction Potential at the Base of the San Marcos Dam (Cayambe, Ecuador). A Validation in the Use of the HVSR","link":"https://www.preprints.org/manuscript/202410.0219/v1","date":1727945667000,"content":"The analysis of the liquefaction potential of the ground is a fundamental characterization in areas with continuous seismic activity, such as Ecuador. Geotechnical liquefaction studies are usually approached from the application of dynamic penetration tests, which pose problems both in their execution and in their evaluation. The proposed research involves analyzing dynamic penetration tests and microtremor geophysical surveys (Horizontal to Vertical Spectral Ratio, HVSR technique) at the base of the San Marcos dam, a reservoir destined for the irrigation water located in Cayambe (Ecuador). Based on the investigations performed at the time of construction of the dam (drilling and geophysical refraction profiles) and the application of 20 microtremor observation stations performed by the HVSR technique, an analysis of the Safety Factor of liquefaction (SFliq) has been conducted, proposed by Youd and Idriss in 2001, and based on the values of the Standard Penetration Test (SPT) applied in granular materials (sands). In addition, the vulnerability index (Kg) proposed by Nakamura in 1989 was analyzed through the HVSR passive seismic records related to the Ground Shear Strain (GSS). The results obtained in the HVSR surveys indicate the presence of a zone of about 100 m length in the central part of the foot of the dam, whose GSS values are identified with a condition of susceptibility to liquefaction. In the same area, the analysis applied from SPT essays in the P-8A drill hole executed in said area also shows a potential susceptibility to liquefaction in earthquake conditions greater than a moment magnitude (Mw) of 4.5, which could occur in the environment, for example, with a new activity condition of the nearby Cayambe volcano or even from an earthquake from the vicinity fractured zone.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"12317e9486b01fd1c6a154e8f76e7c4725024cd442989f4c0fba40cd6460f955","category":"Interdisciplinary"}