{"title":"Uncovering the wider impact of COVID-19 measures on the lives of children with complex care needs and their families: A mixed-methods study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305543","date":1720447200000,"content":"<p>by Janet A. Curran, Jennifer Lane, Holly McCulloch, Lisa Keeping-Burke, Catie Johnson, Helen Wong, Christine Cassidy, Jessie-Lee McIsaac, De-Lawrence Lamptey, Julie Clegg, Neil Forbes, Sydney Breneol, Jordan Sheriko, Shauna Best, Stacy Burgess, Doug Sinclair, Annette Elliot Rose, Mary-Ann Standing, Mari Somerville, Sarah King, Shelley Doucet, Heather Flieger, Margie Lamb, Jeanna Parsons Leigh, Dana Stewart</p>\r\n\r\nExisting barriers to care were exacerbated by the development and implementation of necessary public health restrictions during the COVID-19 pandemic. Children with complex care needs and their families represent a small portion of the paediatric population, and yet they require disproportionately high access to services. Little is known about the impact of COVID-19 public health measures on this population. This study will generate evidence to uncover the wider impact of COVID-19 measures on the lives of children with complex care needs and their families in relation to policy and service changes. This multi-site sequential mixed methods study will take place across the Canadian Maritime provinces and use an integrated knowledge translation approach. There are two phases to this study: 1) map COVID-19 public health restrictions and service changes impacting children with complex care needs by conducting an environmental scan of public health restrictions and service changes between March 2020 and March 2022 and interviewing key informants involved in the development or implementation of restrictions and service changes, and 2) explore how children with complex care needs and their families experienced public health restrictions and service changes to understand how their health and well-being were impacted.","author":"Janet A. Curran","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1239a01c0fd59d1ea142ddf6cc44806aebbdb72e4836c8d1172fd6b03026fe2e","category":"Interdisciplinary"}