{"title":"Information Theory of Gravity","link":"https://www.preprints.org/manuscript/202110.0082/v7","date":1729695430000,"content":"A new model of gravity is presented here that is similar to MOND and Chameleon theory but uses an Entropic Gravity approach that is not based fundamentally on the First Law of Thermodynamics. Instead, the Second Law of Thermodynamics will be mainly used here as it was applied in Black Hole Physics via the Area Theorem and the Holographic Principle. The Area Theorem was considered here to imply, not only that the total area of the event horizon will never shrink when entropy increases, but also that the mass or energy content within the black hole will always be greater than the original mass-energy input, though not necessarily violating the energy conservation law. This black hole property will be extended to include even a non-black hole setting. Moreover, the approach does not use the Equipartition Theorem to relate energy to temperature ($E=Nk_{b}T$) instead we used Vopson's Energy-Mass-Information Equivalence Principle ($E=k_{b}T\\ln(\\Omega)$). The theory uses $E=NE_{p}$, for the total energy of a massive object where $E_{p}$ is the Planck Energy and $N$ is the number of Planck Energy to represent the amount of information within the limit set at the Planck scale. It is shown here that gravity emerges whenever information is updated within a given volume of space with a magnitude that is defined not only by the gravitating matter but also by the energy generated in space within the vicinity of the gravitating matter. The model is the first to consider the role of both spacetime and matter as a medium to store information and apply it to describe gravity in a fundamental way.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"123b60fe0a32a4a6d66ba7827f1c2351ebcf0208f79a7e3f92d5a56fa82c3405","category":"Interdisciplinary"}