{"title":"Drying behavior and nutritional quality of bitter‐gourd slices dried in a solar dryer with tray and skewer arrangement","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14445?af=R","date":1721196049000,"content":"<h2>Abstract</h2>\n<p>In this investigation, we assessed the efficacy of an indirect-type solar drying system that utilized skewers and rack arrangements, comparing it to a conventional drying cabinet equipped with trays for dehydrating bitter gourd slices. We examined the influence of pretreatment methods and loading quantities on the solar drying process for bitter gourd slices in both configurations. The drying behavior of various combinations was scrutinized, and the physicochemical attributes of the dried bitter gourd samples, including total phenolic content, total flavonoid content, total chlorophyll content, antioxidant capacity, ascorbic acid content, and color, were analyzed. Rehydration characteristics, such as rehydration ratio, coefficient of rehydration, percent water in the rehydrated sample, and hardness of the rehydrated sample, were also determined. The bitter gourd slices achieved a final moisture content of 6.84%–8.27% wb after drying from an initial range of 88%–90% wb, within a total elapsed time of 28–55 h. The solar drying cabinet utilizing skewers exhibited enhanced efficiency, featuring reduced drying time and superior product quality compared to the tray-equipped drying cabinet. This improved performance is ascribed to enhanced hot air circulation over the produce surface, facilitated by the uniform spacing between skewers on racks within the drying chamber.</p>","author":"Sudarshan M. Borse, \nManpreet Singh, \nPreetinder Kaur, \nSukhmeet Singh, \nRuchika Zalpouri","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"12547af0e61ce7594a7c78491780fc8f9184e9838e8f8fbab25e85bb541ce7ba","category":"Environment"}