{"title":"Infective Endocarditis &ndash; Characteristics and Prognosis according to the Affected Valves.","link":"https://www.preprints.org/manuscript/202404.0246/v1","date":1712135931000,"content":"Background: Infective endocarditis (IE) continues to be a disease with high mortality despite medical advances. \nObjective: To investigate the characteristics and prognosis of IE according to the affected valves.\nMaterial and methods: The study is retrospective, single-center, cross-sectional and includes 270 patients with diagnosis IE, for the period 2005 – 2021, who received treatment at the University Hospital \"St. Georgi\" in Plovdiv, Bulgaria.\nResults: Single-valve IE (SIE) was found in 82.6% (n-222), multivalvular IE (MIE) in 16.66% (n=45) and device IE (CDRIE) in 0.74% (n=2) patients. The most commonly affected valve was the aortic 44.8% (n=121). The predominant multivalvular involvement was aortic-mitral valves (AV-MV) – 13.7% (n=37). The patients with tricuspid valve (TV) IE were significantly younger – 39 (30) years and were more frequently male (80.8%). Mortality was higher in MIE than SIE (31.1% vs 23.8%) and highest in multivalve aortic-tricuspid (AV-TV) IE (75%). Early surgery was done most in AV-MV IE 29.7% (n=11). Charlson comorbidity index was significantly higher in MV  4 (4) and AV 3 (3) than TV IE 1 (5) (p=0.048 and p=0.011, respectively). Septic shock occurred most frequently in AV-TV involvement (75%; p=0.0001). The most common causative agent was Staphylococcus group. Staphylococcus aureus affected more often TV alone 46.2% (n=124) vs. AV 9.9% (n=14); p=0.0001 and vs. MV 22.6% (n=17), p=0.022; Staphylococcus coagulase-negative (CNG) was the prevalent cause of MV IE 22.7% (n=17) vs AV-MV 2.7% (n=1); p=0.007. Streptococci were represented in a low percentage and only in left-sided IE, and  more frequently in AV-MV 18.9% (n=7); vs. AV 6.6% (n=8); (p=0.025).\nConclusion: Aortic valve is the most frequently affected valve, as single valve IE or multivalve AV-MV, with the predominant causative  agents  Staphylococcus group. The AV-TV IE has the worst prognosis, with the most common complication of septic shock and the highest in-hospital mortality.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"125d10dc380a8d515e326035c8968d11bbc7caea5bc2885f87f13c1d41e6025a","category":"Interdisciplinary"}