{"title":"Multiple stressors alter greenhouse gas concentrations in streams through local and distal processes","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17301?af=R","date":1714460400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/323bbdfb-e55a-41e7-be50-eec8e4017ad4/gcb17301-toc-0001-m.png\" alt=\"Multiple stressors alter greenhouse gas concentrations in streams through local and distal processes\" />\n<p>We found that the simultaneous occurrence of several human-induced stressors in streams increases the concentrations of greenhouse gases in their waters, potentially exacerbating climate crisis. Our results also indicate that the scale at which human impacts occur has different effects on carbon dioxide and methane concentrations. Collectively, our findings suggest that reducing nitrogen inputs and addressing hypoxia in streams could provide additional co-benefits, aiding in the fight against climate change.</p>\n<br />\n<h2>Abstract</h2>\n<p>Streams are significant contributors of greenhouse gases (GHG) to the atmosphere, and the increasing number of stressors degrading freshwaters may exacerbate this process, posing a threat to climatic stability. However, it is unclear whether the influence of multiple stressors on GHG concentrations in streams results from increases of in-situ metabolism (i.e., local processes) or from changes in upstream and terrestrial GHG production (i.e., distal processes). Here, we hypothesize that the mechanisms controlling multiple stressor effects vary between carbon dioxide (CO<sub>2</sub>) and methane (CH<sub>4</sub>), with the latter being more influenced by changes in local stream metabolism, and the former mainly responding to distal processes. To test this hypothesis, we measured stream metabolism and the concentrations of CO<sub>2</sub> (<i>p</i>CO<sub>2</sub>) and CH<sub>4</sub> (<i>p</i>CH<sub>4</sub>) in 50 stream sites that encompass gradients of nutrient enrichment, oxygen depletion, thermal stress, riparian degradation and discharge. Our results indicate that these stressors had additive effects on stream metabolism and GHG concentrations, with stressor interactions explaining limited variance. Nutrient enrichment was associated with higher stream heterotrophy and <i>p</i>CO<sub>2</sub>, whereas <i>p</i>CH<sub>4</sub> increased with oxygen depletion and water temperature. Discharge was positively linked to primary production, respiration and heterotrophy but correlated negatively with <i>p</i>CO<sub>2</sub>. Our models indicate that CO<sub>2</sub>-equivalent concentrations can more than double in streams that experience high nutrient enrichment and oxygen depletion, compared to those with oligotrophic and oxic conditions. Structural equation models revealed that the effects of nutrient enrichment and discharge on <i>p</i>CO<sub>2</sub> were related to distal processes rather than local metabolism. In contrast, <i>p</i>CH<sub>4</sub> responses to nutrient enrichment, discharge and temperature were related to both local metabolism and distal processes. Collectively, our study illustrates potential climatic feedbacks resulting from freshwater degradation and provides insight into the processes mediating stressor impacts on the production of GHG in streams.</p>\n<h2>Resumo</h2>\n<p>Os rios são grandes emissores de gases com efeito de estufa (GEE) para a atmosfera, e o crescente número de agentes de stress que degradam os rios pode exacerbar este processo, e constituir uma ameaça à estabilidade climática. No entanto, não é claro se o efeito dos impactos humanos nas concentrações de GEE na água está associado ao aumento do metabolismo local do rio (processos locais) ou ao aumento da produção de GEE nas zonas a montante dos rios ou nas zonas terrestres adjacentes (processos distais). A nossa hipótese é que os mecanismos que controlam os efeitos dos impactos humanos na emissão de GEE variam entre o dióxido de carbono (CO<sub>2</sub>) e o metano (CH<sub>4</sub>). A nossa previsão é que o CO<sub>2</sub> responde principalmente a processos distais, enquanto o CH<sub>4</sub> é mais influenciado por alterações no metabolismo local dos cursos de água. Para avaliar esta hipótese, medimos o metabolismo aquático e as concentrações de CO<sub>2</sub> (<i>p</i>CO<sub>2</sub>) e CH4 (<i>p</i>CH<sub>4</sub>) em 50 rios que abrangem gradientes de enriquecimento em nutrientes, depleção de oxigénio, stress térmico, degradação da zona ribeirinha e caudal. Os nossos resultados indicam que estes agentes de stress tiveram efeitos aditivos no metabolismo e nas concentrações de GEE nos rios, e que as interações entre os agentes de stress tiveram pouca capacidade preditiva. O enriquecimento em nutrientes foi associado a um aumento da heterotrofia e <i>p</i>CO<sub>2</sub>, enquanto o <i>p</i>CH<sub>4</sub> aumentou com a depleção de oxigénio e com a temperatura da água. O caudal estava positivamente correlacionado com a produção primária, a respiração e a heterotrofia, mas negativamente correlacionado com o <i>p</i>CO<sub>2</sub>. Os nossos modelos indicam que as concentrações equivalentes de CO<sub>2</sub> podem duplicar em rios eutrofizados e com baixa concentração de oxigénio, em comparação com os rios oligotróficos e com águas bem oxigenadas. A aplicação de modelos de equações estruturais mostrou que os efeitos do enriquecimento em nutrientes e do caudal no <i>p</i>CO<sub>2</sub> estavam relacionados com processos distais e não com o metabolismo local. Em contrapartida, as respostas do <i>p</i>CH<sub>4</sub> ao enriquecimento de nutrientes, ao caudal e à temperatura estavam relacionadas tanto com o metabolismo local como com processos distais. O nosso estudo demonstra que a degradação dos rios e dos ecossistemas ribeirinhos pode ter efeitos negativos na estabilidade climática e fornece informação relevante sobre os processos biogeoquímicos que medeiam os impactos humanos na produção de GEE nos rios.</p>","author":"Cayetano Gutiérrez‐Cánovas, \nDaniel von Schiller, \nGiorgio Pace, \nLluís Gómez‐Gener, \nCláudia Pascoal","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"126262a010b01c24ad7b0f4456e6632f7099dc11b59599663573ac66cb5070c3","category":"Environment"}