{"title":"Cyclist’s 31 Inspirational Women No5: Iris Slappendel","link":"https://www.cyclist.co.uk/sponsored/9295/cyclist-s-31-inspirational-women-no5-iris-slappendel","date":1614709508000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/maria-david\">Maria David</a></span>\n      <span class=\"field-item odd\"><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-03-05T13:20:00+00:00\">5 Mar 2021</span></div>    </div></div><p class=\"short-teaser\">\nFormer pro, clothing designer, director of The Cyclists’ Alliance… Iris is a woman of many talents</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/03/iris_slappendel-velofocus.jpg?itok=7ZuWo_mz\" />  </div>\n<div class=\"field field-name-body\">\n      <p> <a href=\"https://www.cyclist.co.uk/tags/zwift-womens-history-month\"><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/02/31_inspirational_women_clickable_logo_new.jpg\" alt=\"Cyclist's 31 Inspirational Women\" border=\"0\" /></a></p>\n<p><strong>To celebrate International Women's Month, we have partnered with Zwift to tell the stories of 31 inspirational women across 31 days</strong></p>\n<p><strong>Words</strong>: Maria David</p>\n<p>As a professional racer, Iris Slappendel enjoyed her fair share of success, including a win at the Open de Suède Vårgårda Women’s World Cup race in 2012 and a Dutch national road race title in 2014. </p>\n<p>Since her retirement in 2016, however, Iris has only risen in prominence on the women’s cycling scene. Most notably, she is a co-founder and executive director of The Cyclists’ Alliance (TCA), an organisation that supports women pro cyclists and campaigns to improve their working conditions.</p>\n<p>Iris speaks about some of the work the organisation does and why it is important:</p>\n<p>‘Carmen [Small], Gracie [Elvin] and I started The Cyclists’ Alliance in 2017. We all had the common feeling of wanting to help and support women riders. This was particularly needed as some riders were encountering problems such as bullying or were signed to unfavourable contracts.</p>\n<p>‘We reached out to the riders about the issues they were facing and wanted to give them confidence and advice. When riders have confidence, and when they know there is someone who has their back, that’s when we can then start changing the position of women in the sport.</p>\n<blockquote><p>We have to develop women’s cycling as a sport on its own, and not just keep copying men’s cycling</p></blockquote>\n<p>‘I’m really proud that in just a few years we have been recognised for the work we’ve done, and we’re seen by the riders as a union that helps them. I’m super-happy with all the support we’ve received, and the people who have joined the TCA.</p>\n<p>‘One of our biggest concerns and one of the things we focus on the most is the disparity of conditions between riders at different teams.</p>\n<p>‘It’s great that there is a minimum salary and maternity leave, and that there is a Women’s WorldTour. A few teams are able to provide good salaries, and if you set a bar that is then made higher by those teams, that’s definitely a good thing.</p>\n<p>‘However, the surveys we have carried out within the women’s peloton showed that 57% of riders earn less than €15,000 a year, and half of them don’t earn anything.</p>\n<p>‘Sadly, the disparity is only becoming bigger. It’s all very well to say that if the men have this salary, the women should have the same salary too. But in fact it may be better to first look to the sport itself, and aim to create a peloton of real professional women who <i>all </i>earn a living wage.</p>\n<p>‘Maybe we could have just 20 or 30 UCI teams rather than the 49 teams that we have now. At the moment there are nine top-tier Womens WorldTeams, with wages and conditions for riders on those teams continuing to improve significantly.</p>\n<p>‘However, many of the remaining 40+ UCI-registered professional teams have conditions going in the opposite direction.</p>\n<p>‘It’s great that we will have a women’s Paris-Roubaix in 2021, but at the same time, we have to develop women’s cycling as a sport on its own, and not just keep copying men’s cycling.</p>\n<p>‘Women’s sport has its own opportunities, its own unique selling points and its own stories.’</p>\n<div class=\"field field-name-field-see-related field-type-node-reference field-label-above\">      <div class=\"field-label\">See related&nbsp;</div>\n  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/news/2252/all-you-need-to-know-about-the-classics-monuments-cobbles\">Cycling Spring Classics 2021: Race dates, Monuments, cobbles and live TV guide</a></div>      <div class=\"field-item odd\"><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 111: on sale now!</a></div>    </div></div><p>\nAs well as her work with The Cyclists’ Alliance, Iris has also spent time as a sports director for an Under-23 team in The Netherlands, an experience she says she enjoyed.</p>\n<p>‘I thought it would be a good challenge to do something in men’s cycling rather than be a DS of women I was racing with the previous year.</p>\n<p>‘Also the U23 category is interesting as the riders are at an important time in their career, so I wanted to help with that.</p>\n<p>‘The riders were nice, and the team managers were fine. It also felt good that they took me on because of the person I was, not because I am a woman. I loved the coaching part of it, and driving the car in the caravan.</p>\n<p>‘But I was kind of overwhelmed a little bit because of the media attention it got at that time. It was a little awkward at times when people from other teams or race organisers always thought that I was a soigneur, and not a DS. I definitely got some surprised looks. Reactions were one extreme or another.</p>\n<p>‘Some managers definitely tested me – for example they wouldn’t give me space in the caravan. And then others were super-nice to me.</p>\n<p>‘Cycling is an old boys club with some guys who have been there for hundreds of years. They would be like that with any newcomer, whatever their gender. But I think they tested me a little more because I am a woman.</p>\n<p>‘I would definitely recommend this to a woman who would like to be a sports director having been a pro cyclist. The racing style is sometimes a little bit different, which I found quite refreshing. And I actually think that it’s good as a woman to gain experience in men’s cycling.</p>\n<p>‘DS’ing a team, you have to do it full time and you have to put all your focus into it. I did it for a couple of years but stopped because it became difficult to juggle it with my other activities.’</p>\n<p>The other main strand of Iris’s life these days is her clothing range IRIS, a range of quality cycle wear designed to make you look good both on and off the bike.</p>\n<p>‘I am really happy that I can make a small impact in women’s sport,’ she says. ‘Whatever I get involved in, it comes back to empowering women and making them feel more confident.’</p>\n<p>For more from Zwift this International Women's Month, <a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5632488664&amp;iu=/359/impcount.co.uk\" target=\"_blank\">visit here</a>. </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/cyclists\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Cyclists</a></div>    </div></div>","author":"mjames","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"1264de1ef6bc9208faf4d8b4dff25a37caddbd9a2b9093520c58d5621aff37fb","category":"Cycling"}