{"title":"Efficacy and Mechanisms of Antioxidant Compounds and Combinations Thereof Against Cisplatin Induced Hearing Loss in a Rat Model","link":"https://www.preprints.org/manuscript/202405.0970/v1","date":1715683660000,"content":"Cisplatin is an election chemotherapeutic agent for many cancer treatments. Its cytotoxicity against neoplastic cells is mirrored by that taking place in healthy cells and tissues, resulting in serious adverse events. A very frequent one is ototoxicity, causing hearing loss which may permanently affect quality of life after successful oncologic treatments. Exacerbated oxidative stress is a main cytotoxic mechanism of cisplatin, including ototoxicity. Previous reports have shown antioxidant protection against cisplatin ototoxicity, but there is a lack of comparative studies on the otoprotectant activity and mechanism of antioxidant formulations. In this paper we report that a combination of vitamins A, C, E and Mg++ (ACEMg), previously shown to protect against noise-induced hearing loss, reverses auditory threshold shifts, promotes outer hair cell survival, and attenuates oxidative stress in the cochlea after cisplatin treatment, thus protecting against extreme cisplatin ototoxicity in the rat. The addition of 500 mg N-acetylcysteine (NAC), which administered individually also shows significant attenuation of cisplatin ototoxicity, to the ACEMg formulation, results in degradation of ACEMg otoprotection. Mg++ administered alone, as MgSO4, also prevents cisplatin ototoxicity, but in combination with 500 mg NAC, otoprotection also is greatly degraded. Increasing the dose of NAC to 1000 mg, also results in dramatic loss of otoprotection activity compared with 500 mg NAC. These findings support that single antioxidants or antioxidant combinations, particularly ACEMg in this experimental series, have significant otoprotection efficacy against cisplatin ototoxicity. However, an excess of combined antioxidants and/or elevated doses, above a yet to be defined “antioxidation threshold”, results in unrecoverable redox imbalance with loss of otoprotectant activity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"12707cdee3a1b1ae4efd97952b067c3971d2a176d8ecc15a7c27cd487d29c10d","category":"Interdisciplinary"}