{"title":"High protein requirements of juvenile Atlantic wolffish, Anarhichas lupus: Effects of dietary protein levels on growth, health, and welfare","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15789?af=R","date":1717037324000,"content":"<h2>Abstract</h2>\n<p>The objective of the present study was to investigate the optimal dietary protein requirement and the effect of varying protein levels on the growth and health of juvenile, wild-caught Atlantic wolffish, <i>Anarhichas lupus</i>, a promising candidate for cold-water aquaculture diversification. Six iso-energetic (ca. 18.3 MJ kg<sup>−1</sup>), fish meal-based experimental diets were formulated with crude protein levels ranging from 35% to 60%, with graded increments of 5% in a 12-week feeding trial in a recirculating aquaculture system (RAS). Weight gain, specific growth rate (SGR), and condition factor (K) were evaluated in response to dietary protein levels. Liver, muscle, and blood parameters were assessed for possible changes in protein and lipid metabolism and welfare. Overall growth was highly variable throughout the experiment on all diets, as expected for a wild population. The feed with highest in protein (60%) inclusion resulted in the highest growth rates, with an average weight gain of 37.4% ± 33.8% and an SGR of 0.31% ± 0.2% day<sup>−1</sup>. This was closely followed by feeds with 55% and 50% protein inclusion with an average weight gain of 22.9% ± 34.8% and 28.5% ± 38.3%, respectively, and an SGR of 0.18% ± 0.3% day<sup>−1</sup> and 0.22% ± 0.3% day<sup>−1</sup>, respectively. Fish fed the high protein diets generally had increased hepatic lipid deposition (17%–18%) and reduced free fatty acid levels (3.1–6.8 μmol L<sup>−1</sup>) in the plasma relative to fish that were fed the lower protein diets (35%–45%). No effects of diet were found on plasma protein levels or muscle protein content. Furthermore, stress parameters such as plasma cortisol and glucose levels were unaffected by diet, as were plasma ghrelin levels. Overall, these results suggest that a high protein inclusion in the diet for Atlantic wolffish is required to sustain growth with a minimum protein level of 50%.</p>","author":"James Hinchcliffe, \nJonathan A. C. Roques, \nJosefin Roos, \nMarkus Langeland, \nIda Hedén, \nHenrik Sundh, \nKristina Sundell, \nBjörn Thrandur Björnsson, \nElisabeth Jönsson","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"1277fd75150bc5fc4f1c0472d39dea74ee7aa6a1562f9ebf0c9439e125534d5b","category":"Environment"}