{"title":"The social science side of marine biodiversity monitoring","link":"https://academic.oup.com/icesjms/article/81/5/864/7640278?rss=1","date":1712188800000,"content":"<span><div>Abstract</div>Marine biodiversity monitoring is a complex task given the vast ocean areas to be covered, the types of data to be integrated, and the large number of possible parameters to consider when measuring biodiversity change. International agreements, such as the Convention on Biological Diversity (CBD) or the recently adopted ‘BBNJ treaty’protecting biodiversity beyond national jurisdiction (BBNJ), encourage states to monitor marine life both within and beyond their national waters to foster marine biodiversity conservation and sustainable use. While oceanographers in general, and marine biologists in particular, are aware of the challenges and complexities of measuring biodiversity in the ocean, the politics of marine biodiversity monitoring and the added value of social science perspectives tend to be neglected. This story from the frontline describes our experiences with turning marine biodiversity monitoring into an object of social science inquiry. The MARIPOLDATA project developed an innovative multi-sited approach to capture both the politics and practices of monitoring marine life. During our research, we were confronted with a diversity of perspectives and expectations of what monitoring is, how it works, why it should be done, and whom it should serve. By adopting a mixed-method approach and collecting data at different epistemic sites (negotiation rooms, scientific fields, laboratories, and conferences), we tried to cut through some of the observed ambiguities and trends. We conclude that studying monitoring necessitates a multidisciplinary approach and a sensitivity for the regional, institutional, and cultural specificities and inequalities that shape how we know and govern the ocean.</span>","author":"","siteTitle":"ICES Journal of Marine Science Current Issue","siteHash":"54f8cca1acc450a23f886e7003c55f387c2b0793320a665b1e27fbbf191461e5","entryHash":"12898ec78e1af5c8a7753b9a1b1521892026707ac8673af17bb33ba9b0bacc61","category":"Environment"}