{"title":"SpamSieve 2.9 review: Snag and tag spam before it hits your Mac’s inbox","link":"https://www.macworld.com/article/546660/mac-gems-spamsieve-review.html","date":1635505200000,"content":"<div>\n<section><div></div></section><div><img src=\"https://www.macworld.com/wp-content/uploads/2021/02/MW-Ed-Choice-90x90-1.png\" /><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div></div><h3>Price When Reviewed</h3><p>$30 single user; $48 family or 2 users; site licenses available</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>C-Cpmmnd Software</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$30</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://c-command.com/store/&amp;xcust=1-1-546660-2-241527-12851&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p>It may seem like spam has always been with us, and unsolicited commercial email (UCE) did arise in the early days of the public internet—followed not far behind by outright criminal messages that tried to steal credentials (phishing) or install or pass along malware.</p>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/spam-sieve-statistics-bordered.png\" /><figcaption>I last reset the statistics in 2007, and SpamSieve has helped with nearly 600,000 messages since then.</figcaption></figure></div></div>\n\n\n\n<p>SpamSieve is nearly two decades old, arriving on the Mac not too far after spam first became insufferable. Its advent was near the beginning of the Mac OS X transition. It arrived after a certain kind of frequency analysis became a popular way for server software to distinguish spam (unwanted email) and ham (the good stuff) with some reliability.</p>\n\n\n\n<p>The app uses Bayesian inference, which is the mathematical equivalent of an educated guess based on which words or phrases appear more frequently in mail you want and mail you don’t. (It’s used broadly across many disciplines—not just email quality detection.)</p>\n\n\n\n<p>SpamSieve scores every word and some aspects of embedded images by how frequently they appear in messages marked as spam or ham. As you train SpamSieve’s filter, it increasingly identifies messages as good or bad more accurately. After training my filters for years, SpamSieve is often 100 percent certain a message is desirable or that it’s unwanted, and it’s correct nearly all of the time.</p>\n\n\n\n<p>Spammers years ago developed techniques to partially defeat Bayesian analysis—in case you wondered why some spam has extracts of random passages of text at the bottom—but there’s only so far a message can go in defeating probability before it’s unreadable by a recipient. And SpamSieve includes other filtering options, like an option to block all HTML encoded to be unreadable to the human eye until viewed in a browser.</p>\n\n\n\n<p>SpamSieve is a largely set-it-up-and-forget-it utility after some initial training, about which C-Command Software offers detailed guidance. A tip: save spam you’ve manually identified for a bit so that you can <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://c-command.com/spamsieve/manual#do-an-initial-training&amp;xcust=1-1-546660-1-0-0&amp;sref=https://www.macworld.com/feed\">prime the SpamSieve pump</a> with about 350 bad messages alongside 650 good ones you’ve filed. It’s like training a drug-sniffing dog, only much more rapidly and with no treats required. You barely need to touch the app after setup.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/spam-sieve-corpus-bordered.png?w=1200\" /><figcaption>The corpus shows all the words, email addresses, and other elements SpamSieve has extracted and scored, including how many messages feature the listed terms.</figcaption></figure></div>\n\n\n\n<p>In the beginning, I relied on SpamSieve almost exclusively. With the evolving nature of spam, I now have one layer at my mail host, one layer in my email program, and SpamSieve to catch the remainder. That’s not a commentary on SpamSieve as much as it is on the infinite adaptability of the unspeakable villains who try to stuff our mailboxes.</p>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/spam-sieve-prefs-bordered.png\" /><figcaption>A few preferences let you control aspects of tagging behavior.</figcaption></figure></div><p>IDG</p></div>\n\n\n\n<p>You can integrate SpamSieve with nearly all major mail apps, including Apple’s Mail, Outlook, AirMail, Gyazmail, MailMate, and others. This lets it performs its analysis, scoring, and tagging in such a way that the mail app can filter messages or run rules against them—and even have the app color code them by likelihood of spamminess.</p>\n\n\n\n<p>Integrated mail apps lets you manually change the analysis of a message. If UCE shows up in your inbox or ham gets filtered to Junk, you can use a keyboard shortcut or other trigger to inform SpamSieve that it guessed wrong. This updates its database, improving performance in the future, as well as adding whitelist and blacklist rules that match against addresses in the message’s headers.</p>\n\n\n\n<p>For mail apps that SpamSieve doesn’t offer an add-on for—including Postbox 6 and 7, which the developer says lacks the extensibility required—C-Command provides instructions on running Apple Mail in the background solely for the purpose of filtering spam. It’s worth it.</p>\n\n\n\n<p>SpamSieve is a one-trick pony and it performs its Bayesian trick exceptionally well. We will never be free of spam, and this decades-old method built out with simplicity in the app remains an important line of defense.</p>\n\n\n\n<p>SpamSieve is up to date for macOS 12 Monterey and works with releases as far back as Mac OS X 10.9. C-Command also makes previous versions available for even older Mac OS X flavors. The price is $30 for a single-user license or $48 for a family.</p>\n\n\n\n<p><em>Macworld last reviewed SpamSieve in 2015, <a href=\"https://www.macworld.com/article/226976/spamsieve-2-9-review-a-must-have-spam-filter-for-your-mac-email-client.html\">when Kirk McElhearn wrote</a>, “This app works so well that, over time, you almost forget about it.”</em></p>\n\n\n\n<p><em>Mac Gems highlights great nuggets of Mac software—apps that have a high utility, have a sharp focus on a limited set of problems to solve, and are generally developed by an individual or small company. With the strong resurgence of the Mac in recent years, we want to celebrate tools we use and that readers recommend to make the most of your macOS experience. Stay tuned for weekly updates, and send your suggestions to the Mac Gems Twitter feed (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/macgems&amp;xcust=1-1-546660-1-0-0&amp;sref=https://www.macworld.com/feed\">@macgems</a>).</em></p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"128f0b47599ee711cd0f8a93d58050a1e6ce922f9e6f19bf1dccb8c829213b96","category":"Apple"}