{"title":"WhatsApp Gains Chat Lock Feature for More Private Conversations","link":"https://www.macrumors.com/2023/05/16/whatsapp-locked-chats/","date":1684229880000,"content":"WhatsApp is rolling out a new Chat Lock feature that allows users to secure select conversations in their inbox behind a passcode, fingerprint, or <a href=\"https://www.macrumors.com/guide/mask-face-id/\">Face ID</a> authentication, parent company Meta has announced.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/whatsapp-locked-chats.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nIn a <a href=\"https://about.fb.com/news/2023/05/whatsapp-chat-lock/\">post</a> on its news page, Meta explained that locked conversations are removed from the regular chat list and hidden in a password-protected folder. Notification previews for any locked chats don't show sender or message content, while any media shared in locked chats won't be auto-saved to the phone's photo library, altogether keeping the conversations more private.\r<br />\n<blockquote>\"We believe this feature will be great for people who share their phones from time to time with a family member, or in moments where someone else is holding your phone at the exact moment an extra-special chat arrives,\" said Meta.</blockquote>To lock a one-to-one or group chat, tap the name at the top of the conversation to reveal the thread's settings menu, where there is a new Lock option. To later reveal locked chats, slowly pull down on WhatsApp's main conversations list, and you'll be prompted for authentication before the locked chats folder can be opened. \r<br />\n\r<br />\nThe feature is coming to the latest version of WhatsApp for iOS on the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, and is rolling out to all users on both <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and Android in the coming days.<div>Tag: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/16/whatsapp-locked-chats/\">WhatsApp Gains Chat Lock Feature for More Private Conversations</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whatsapp-gains-chat-lock-feature-for-more-private-conversations.2389654/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"129132436008ca5ad7d71fa2526e5573fb654a309cdfa84a40b55e7269a4fecb","category":"Apple"}