{"title":"A process‐based water stable isotope mixing model for plant water sourcing","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2611?af=R","date":1705476137000,"content":"<h2>Abstract</h2>\n<p>Stable isotopes of hydrogen and oxygen in water are common tools for investigating water uptake apportionment, but many of the existing methods rely on simple linear mixing approaches that do not mechanistically incorporate additional information about site physical properties and conditions. Here, we develop a ‘physically based root water uptake isotope mixing estimation’ model (PRIME) that combines a continuous and parametric probability density function for root water uptake with site physical data in a process-based linear mixing framework. To demonstrate the application of PRIME, water uptake patterns of boreal forest <i>Pinus banksiana</i> trees were estimated on four dates in 2019. To aid in validation, estimates were compared with that of the Bayesian linear mixing model framework, MixSIAR. The two approaches provided similar results, but due to its continuous and parametric nature, PRIME provided estimates of superior resolution, certainty, and model parsimony. Although both models incorporate additional physical information into their mixing frameworks, PRIME does so in a mechanistic manner, thereby reflecting the relevant hydrological processes more effectively than the purely empirical approach taken by MixSIAR. Furthermore, because PRIME uses a continuous function to describe the predicted uptake pattern, it allows users to quantify water uptake with essentially infinite resolution, through integration over the desired depth ranges. These findings demonstrate the advantages of utilizing a continuous, parametric, and process-based mixing model to estimate root water uptake apportionment, thus providing a relatively simple yet powerful tool with which to approach plant water sourcing.</p>","author":"Eric J. Neil, \nHan Fu, \nBingcheng Si","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"129874cb26d96deca2026e8ada85e239bef9a4e137c2e3423d84b8eb740207f3","category":"Environment"}