{"title":"Survivors try to stay positive after deadly pandemic in Station Eleven trailer","link":"https://arstechnica.com/?p=1817786","date":1638507640000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p> A limited series based on Emily St. John Mandel’s international bestseller, <em>Station Eleven</em> is a post-apocalyptic saga that follows survivors of a devastating flu as they attempt to rebuild and reimagine the world anew while holding on to the best of what's been lost. </p></div>\n<p>A deadly flu wipes out most of humanity and the survives try to cling to hope in the official trailer for <a href=\"https://en.wikipedia.org/wiki/Station_Eleven_(miniseries)\"><em>Station Eleven</em></a>, the forthcoming new series from HBO Max about the onset and aftermath of a global flu pandemic that wipes out most of humanity. The ten-episode series is based on the international bestselling novel of the same name by Emily St. John Mandel.</p>\n<p>I won't re-hash the novel's entire complicated plot; you can get those details <a href=\"https://arstechnica.com/gaming/2021/11/station-eleven-teaser-is-intriguing-but-will-show-run-afoul-of-pandemic-fatigue/\">here.</a> It concerns an outbreak of the \"Georgia Flu\"—a virus that is both highly contagious and deadly—that is sweeping over the world, leaving millions of corpses in its wake. Within a few weeks, the majority of humanity succumbs to the disease. The novel then jumps some 20 years after Year Zero, focusing in part on a group of actors and musicians who travel from  from town to town, staging concerts and Shakespeare's plays. But not everyone has responded to this new reality with that kind of positive idealism. The troupe soon runs into trouble in a town controlled by a mysterious cult figure known only as The Prophet.</p>\n<p>Himesh Patel plays Jeevan a paramedic traineee who befriends a young child actress named Kristen after most of her fellow <em>King Lear</em> cast members die in Year Zero. Mackenzie Davis portrays the adult Kirsten. Gael Garcia Bernal plays doomed actor Arthur Leander (star of the aforementioned production); Danielle Deadwyler plays Arthur's first wife Miranda; Caitlin FitzGerald plays Arthur's second wife Elizabeth; and Julian Obradors plays Tyler, Arthur's son by Elizabeth. Daniel Zovatto is listed as playing The Prophet, which is either sleight of hand on the production's part or a genuine departure from the novel. (The true identity of The Prophet is one of the novel's big reveals.)</p></div><p><a href=\"https://arstechnica.com/?p=1817786#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1817786&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1299aaa0fc6bb00d436be31a8053acd7e3d306f051d1f7ca631e12b993fd2322","category":"Tech"}