{"title":"Levant is Now a HashiCorp-Supported Project","link":"https://www.hashicorp.com/blog/levant-is-now-a-hashicorp-supported-project","date":1610125200000,"content":"<p>I joined HashiCorp back in April to work on the Nomad Ecosystem team having worked on designing and building solutions using HashiCorp Nomad as an orchestrator for a number of years. During that time I wrote Levant to enhance the user experience by providing a unified and consistent deployment workflow across all paths to production environments with improved feedback in CI systems.</p>\n<p>Joining HashiCorp raised a broad question about the future of Levant, which I authored to use alongside Nomad and maintained as an independent open source project.</p>\n<h2><a class=\"__permalink-h\" href=\"#about-levant\" aria-label=\"about levant permalink\">»</a><a class=\"__target-h\" id=\"about-levant\" aria-hidden></a>About Levant</h2>\n<p>Levant is a tool aimed at enhancing and simplifying the process of submitting jobs to Nomad. It utilizes templating to allow operators to share job files across environments, while altering key parameters via variables stored in a number of supported formats.</p>\n<p>Via a single <code>deploy</code> command Levant will render the job template and provide real-time feedback on the status of the job and the subsequent deployment. In the event of a deployment failure, Levant will inspect each failed allocation and log debug information so the operator can quickly identify the issue.</p>\n<h2><a class=\"__permalink-h\" href=\"#levant-hashicorp\" aria-label=\"levant hashicorp permalink\">»</a><a class=\"__target-h\" id=\"levant-hashicorp\" aria-hidden></a>Levant &#x26; HashiCorp</h2>\n<p>We've discussed a number of options and I'm happy to announce that we've migrated Levant to the <a href=\"https://github.com/hashicorp/levant\">HashiCorp GitHub organization</a>. The Nomad Ecosystem team will be taking up ongoing maintenance and enhancements. We're committed to keeping Levant supported and up-to-date with the latest Nomad features and contributions.</p>\n<p>As an early example of how we hope this extra support will benefit the community, we worked with the HashiCorp education team to develop two guides on using Levant:</p>\n<ul>\n<li><a href=\"https://learn.hashicorp.com/tutorials/nomad/dry-jobs-levant?in=nomad/templates\">DRY Nomad Job Specs with Levant</a></li>\n<li><a href=\"https://learn.hashicorp.com/tutorials/nomad/levant-abstract-jobs?in=nomad/templates\">Make Abstract Job Specs with Levant</a></li>\n</ul>\n<p>Thank you all for your support and belief in Levant. I'm looking forward to the next chapter for this and all our Ecosystem team projects.</p>\n<p>If you have any questions or feedback, please feel free to reach out via <a href=\"https://twitter.com/jrasell\">Twitter</a>, using the <a href=\"https://discuss.hashicorp.com/c/nomad/28\">HashiCorp Nomad discuss forum</a>, or by posting an issue on the<a href=\"https://github.com/hashicorp/levant\"> Levant GitHub repository</a>. Thanks from the entire Nomad Ecosystem team.</p>","author":"James Rasell","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"12a0052ad8cd0835fd9d72239605a81fe82c194aed3abbd84cef33650939fafb","category":"Tech"}