{"title":"Anatomy of a pest control failure: introgression of cytochrome P450 337B3 alleles from invasive old-world bollworm into native corn earworm (Lepidoptera: Noctuidae)","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae094/7796688?rss=1","date":1727654400000,"content":"<span><div>Abstract</div>The establishment of invasive species populations can threaten the ecological balance in naïve habitats and impact agricultural production practices. <span>Helicoverpa armigera</span> (Hübner) (Lepidoptera: Noctuidae) (old-world bollworm, OWBW) and <span>Helicoverpa zea</span> (corn earworm, CEW) were geographically separated prior to the 2013 report of OWBW invasion into South America. Introgression of OWBW-specific cytochrome P450 337B3 (CYP337B3) gene into CEW was repeatedly detected across South America and the Caribbean. Two hybrids were documented from Texas in 2019. In this study, screening insects collected in Olathe, CO, USA, where a failure of pyrethroids to control CEW damage to conventional sweetcorn in 2023 detected 28.6% of insects with the OWBW-specific CYP337B3 marker. Nucleotide sequencing of the CYP337B3 gene identified 73.1% and 26.9% of insects carried CYP337B3v2 and CYP337B3v6 alleles, respectively, and 0.15 overall frequency of CYP337B3 alleles. Based on prior data for distinct phylogeographic origins of CYP337B3v2 and v6 alleles, our results indicate Olathe samples were derived from 2 different introductions: An uncertain source of the v6 allele that was initially reported in West Africa and possibly South American or Caribbean origin of the globally distributed v2 allele. One of the 1618 individuals screened also carried a ribosomal RNA internal transcribed spacer 1 derived from OWBW. Local selection pressures at the Olathe location imposed by repeated pyrethroid exposures are likely attributed to the prevalence of CYP337B3, where control practices hasten the accumulation of phenotypic resistance by adaptive introgression. Pyrethroid and other resistance factors carried by invasive OWBW may continue to impact CEW management tactics across the Americas.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"12b4fa951a2d112403412ca9e51a883de5bb529d8c2d0d082c795a0f7c294263","category":"Environment"}