{"title":"Apple's New Feature That Scans Messages for Nude Photos is Only for Children, Parental Notifications Limited to Kids Under 13","link":"https://www.macrumors.com/2021/08/05/apple-communication-safety-children-only/","date":1628200250000,"content":"Apple today announced a series of <a href=\"https://www.macrumors.com/2021/08/05/apple-new-child-safety-features/\">new child safety initiatives</a> that are coming alongside the latest <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a>, and <a href=\"https://www.macrumors.com/roundup/macos-12/\">macOS Monterey</a> updates and that are aimed at keeping children safer online.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/iphone-communication-safety-feature-arned.jpg\" />\r\n<br />\r\nOne of the new features, Communication Safety, has raised privacy concerns because it allows Apple to scan images sent and received by the Messages app for sexually explicit content, but Apple has confirmed that this is an opt-in feature limited to the accounts of children and that it must be enabled by parents through the Family Sharing feature.\r\n<br />\r\n\r\n<br />\r\nIf a parent turns on Communication Safety for the <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a> account of a child, Apple will scan images that are sent and received in the Messages app for nudity. If nudity is detected, the photo will be automatically blurred and the child will be warned that the photo might contain private body parts.\r\n<br />\r\n\r\n<br />\r\n\"Sensitive photos and videos show the private body parts that you cover with bathing suits,\" reads Apple's warning. \"It's not your fault, but sensitive photos and videos can be used to hurt you.\"\r\n<br />\r\n\r\n<br />\r\nThe child can choose to view the photo anyway, and for children that are under the age of 13, parents can opt to get a notification if their child clicks through to view a blurred photo. \"If you decide to view this, your parents will get a notification to make sure you're OK,\" reads the warning screen.\r\n<br />\r\n\r\n<br />\r\nThese parental notifications are optional and are only available when the child viewing the photo is under the age of 13. Parents cannot be notified when a child between the ages of 13 and 17 views a blurred photo, though children that are between those ages will still see the warning about sensitive content if Communication Safety is turned on.\r\n<br />\r\n\r\n<br />\r\nCommunication Safety cannot be enabled on adult accounts and is only available for users that are under the age of 18, so adults do not need to worry about their content being scanned for nudity.\r\n<br />\r\n\r\n<br />\r\nParents need to expressly opt in to Communication Safety when setting up a child's device with Family Sharing, and it can be disabled if a family chooses not to use it. The feature uses on-device machine learning to analyze image attachments and because it's on-device, the content of an iMessage is not readable by Apple and remains protected with end-to-end encryption.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-privacy/\">Apple privacy</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/05/apple-communication-safety-children-only/\">Apple's New Feature That Scans Messages for Nude Photos is Only for Children, Parental Notifications Limited to Kids Under 13</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-new-feature-that-scans-messages-for-nude-photos-is-only-for-children-parental-notifications-limited-to-kids-under-13.2306668/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Bg8NXsMYRZU:bSCqRe_NOG8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Bg8NXsMYRZU:bSCqRe_NOG8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/Bg8NXsMYRZU\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"12c1037b511f5d187aa03311d9cd26e574e6c246dc6b8b19446ce7937be7af2b","category":"Apple"}