{"title":"An Ensemble of Machine Learning Models for the Classification and Selection of Categorical Variables in Traffic Inspection Work of Importance for the Execution of Events","link":"https://www.preprints.org/manuscript/202409.0547/v1","date":1725619059000,"content":"Traffic Inspection (TI) work in this article is positioned as a specific module of road traffic with its primary function oriented towards monitoring and controlling safe traffic and the execution of significant events within a particular geographic area. Exploratory research on the significance of event execution in simple, complicated and complex traffic flow and process situations is related to the activities of monitoring and controlling functional states and performance of categorical variables, which include objects and locations of road infrastructure, communication infrastructure and networks of traffic inspection resources. It is emphasized that the words “work” and “traffic” have the semantic status as synonyms (in one world language), which is explained in the design of the Agent-based model of the complexity of content and contextual structure of TI work at the singular and plural level with 12 points of interest (POI) in the thematic research. An Event Execution Log (EEL) was created for on-site data collection with eight variables, seven of which are independent (event type, activities, objects, locations, host, duration-period and periodicity of the event) and one dependent (significance of the event) variable. The structured data set includes 10,994 input-output vectors in 970 categories collected in the EEL created by 32 human agents (traffic inspectors) over a 30-day period. An algorithmic presentation of the methodological research procedure for preprocessing and final data processing in the ensemble of machine learning models for classification and selection of TI tasks is given. Data cleaning was performed on the available dataset to increase data consistency for further processing. Vector elimination was carried out based on the Location variable, such that the total number of vectors equals the number of unique categories of this variable, which is 636. The main result of this research is the Classification modeling of the significance of events in TI work based on machine learning techniques and the Stacking ensemble. The created machine learning models for event significance classification modeling have high accuracy values. To evaluate the performance metrics of the Stacking ensemble of models, the confusion matrix, Precision, Recall, ND F1-score are used.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"12c4c5f3ae23f47b0f18458c659c92070c82e1074e3115f18b35cd58c6389096","category":"Interdisciplinary"}