{"title":"Bitwarden รองรับการล็อกอินด้วย Passkey แล้ว","link":"https://www.blognone.com/node/137645","date":1705071704000,"content":"<div><div><div><p>Bitwarden บริการจัดการรหัสผ่านโอเพนซอร์สชื่อดังเริ่มรองรับการล็อกอินเข้าใช้งานด้วย Passkey แล้ว ทดแทนการใช้ชื่อบัญชีและรหัสผ่านตามปกติ</p>\n<p>Bitwarden เลือกรองรับ Passkey ผ่านส่วนเสริม PRF ของมาตรฐาน WebAuthn โดยหลักการของ PRF คือให้กุญแจยืนยันตัวตนสร้างกุญแจเข้ารหัสขึ้นมาชุดหนึ่งสำหรับ Bitwarden (หรือเว็บไซต์อื่นๆ) โดยเฉพาะ จากนั้น Bitwarden ก็จะนำกุญแจนี้ไปใช้กับการเข้ารหัสและปลดล็อคข้อมูลของผู้ใช้ใน vault อีกทอดหนึ่งด้วย หรือพูดง่ายๆ คือ PRF ทำให้ Passkey สามารถใช้ได้กับทั้งการล็อกอินผู้ใช้เข้าระบบและการเข้ารหัส/ถอดรหัส vault ในคราวเดียว รวมถึงผู้ใช้ไม่ต้องพิมพ์ทั้งอีเมลและรหัสผ่านและผ่านขั้นตอน 2FA เลย จากเดิมที่ Bitwarden อาศัย master password ในการเข้ารหัสและถอดรหัสข้อมูลของผู้ใช้ (ในที่นี้คือรหัสผ่านต่างๆ ที่เก็บอยู่ใน vault)</p>\n<p>ทั้งนี้ ผู้ใช้ต้องใช้ทั้งกุญแจยืนยันตัวตนและเบราว์เซอร์ที่รองรับ PRF ด้วย โดยขณะนี้คือเบราว์เซอร์ตระกูล Chromium เช่น Chrome และ Edge</p>\n<p>หากกุญแจยืนยันตัวตนหรือเบราว์เซอร์ที่ใช้ไม่รองรับ PRF ก็ยังสามารถล็อกอินเข้า Bitwarden ด้วย Passkey ได้แบบไม่ต้องพิมพ์อีเมลและผ่านขั้นตอน 2FA แต่ยังต้องพิมพ์ master password อยู่เพื่ออ่านข้อมูลใน vault</p>\n<p>สำหรับขั้นตอนการเปิดใช้งาน สามารถกดดูวิดีโอได้ในที่มา</p>\n<p>ที่มา - <a href=\"https://bitwarden.com/blog/log-into-bitwarden-with-a-passkey/\">Bitwarden</a></p>\n<p><img alt=\"alt=&quot;image808056b598639b99.png&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/7b758e62ad3ec31b3ffd66d2a16831ff.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/bitwarden\">Bitwarden</a></div><div><a href=\"/topics/password-manager\">Password Manager</a></div><div><a href=\"/topics/passkey\">Passkey</a></div><div><a href=\"/topics/security\">Security</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"12c862e816e14164eabeb907c201bfd647487837b345bf73cc75c90b550ca60a","category":"Thai"}