{"title":"Tephra identification without pre‐separation in ashed peat","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3619?af=R","date":1712298582000,"content":"<h2>ABSTRACT</h2>\n<p>Cryptotephras in peat and sediment samples are traditionally separated for geochemical characterization using chemical or density floatation techniques following initial tephra identification and shard counting through analysis of ashed residue via light microscopy. However, these practices can be time consuming, subject to practitioner experience and material type, with a potential for sample loss. We present an alternative approach to identify cryptotephra in peat and sedimentary samples, where ashed material is mounted directly in epoxy resin and analysed through back-scattered electron (BSE) imaging via scanning electron microscopy–energy dispersive X-ray spectroscopy (SEM-EDX). Semi-quantitative, unsupervised chemical maps of epoxy mounts are created within 120 min using ‘Feature Analysis’ on AZtec software by Oxford Instruments. These maps locate grains of higher atomic mass and categorize phases based on geochemistry. We create a tephra identification method using an ombrotrophic peat sample doped with bimodal Vedde Ash, where recovery of the known tephra proportion in wet peat is 96%. We also propose an automated alternative to optical shard counting, whereby tephra counts identified via Feature Analysis can be ratioed to total grain counts acquired through ImageJ software and extrapolated to the inorganic fraction in wet peat. We apply the method to a minerotrophic peat from Brackloon Wood, Mayo, Ireland, where the Laki <span>ad</span> 1783–84 cryptotephra is successfully identified.</p>","author":"LUCY C. Blennerhassett, \nPAUL C. Guyett, \nEMMA L. Tomlinson","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"12c9e8670d6c172b51ff4f04c8177a9a990accbfbd1422aeaea16d5d4832affb","category":"Environment"}