{"title":"Vitamin B12 deficiency in diabetic patients treated with metformin: A cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302500","date":1714053600000,"content":"<p>by Dat Tan Huynh, Ngoc Thi Nguyen, Minh Duc Do</p>\r\n\r\nMetformin is a cornerstone medication in the management of type 2 diabetes. Metformin is safe, effective, and inexpensive; however, it is associated with vitamin B12 deficiency. This study set out to evaluate the rate of vitamin B12 deficiency in Vietnamese patients with type 2 diabetes who were treated with metformin and to investigate factors associated with vitamin B12 deficiency. This is a cross-sectional study that was conducted in Vinmec Central Park Hospital from February to June 2023. The clinical and paraclinical characteristics of the participants were recorded, and the levels of vitamin B12 and folate were measured. The rate of vitamin B12 deficiency in patients treated with metformin was found to be 18.6%. Further, the duration of diabetes, duration of metformin use, metformin dose, and hemoglobin levels were statistically associated with vitamin B12 deficiency with OR (95% CI) = 1.12 (1.03–1.19), 1.01 (1.00–1.02), 1.002 (1.001–1.002), 0.74 (0.55–0.99), respectively. After adjusting for covariates, a metformin dose greater than the median dose remained the only parameter associated with vitamin B12 deficiency, with OR (95% CI) = 4.10 (1.62–10.36). Moreover, when combining both long-term use of metformin and a metformin dose greater than the median dose, the OR increased to 5.25 (95% CI: 2.11–13.15). These results demonstrate that vitamin B12 deficiency in patients treated with metformin is quite prevalent in Vietnam and that those with long-term use of metformin (48 months or more) and high metformin dose (1000 mg/day or more) are at high risk of experiencing this adverse effect and so require screening.","author":"Dat Tan Huynh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"12d4ff10f7af71a7df24a49b2a9ca8823f09db3430827c4ab0fc73edeceeba45","category":"Interdisciplinary"}