{"title":"Do Macs come with built-in antivirus software?","link":"https://www.macworld.com/article/2237624/does-a-mac-come-with-antivirus.html","date":1708087184000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Windows PCs come with antivirus software built-in to protect them from the myriad of attacks that they have to fight off, but what about your Mac? For years the thinking was that Macs didn’t get viruses and therefore didn’t need antivirus software. But that’s not necessarily the case. As the Mac has grown in popularity, this has drawn the attention of hackers hoping to take advantage of the more laissez-faire attitude to security that has often been the marker of Mac users. </p>\n\n\n\n<p>With this rise in malware threats, it leads us to ask <a href=\"https://www.macworld.com/article/668710/how-secure-mac.html\">if Macs really are more secure than Windows PCs?</a> For the time being this still remains the case, as the threats identified are far more numerous to Microsoft’s operating system, but that doesn’t mean Macs are impervious to attack. </p>\n\n\n\n<p>Apple has been monitoring this trend though, and provides its own antivirus and malware protections in macOS which automatically go about fending off any aggressive or malicious programs. Here’s a quick guide on how macOS protects you, as well as some additional ways to make your Mac more secure. </p>\n\n\n\n<h2>Does Mac have antivirus built-in?</h2>\n\n\n\n<p>While it might not be obvious, Macs all come with a couple of main protections against malware and viruses: XProtect and Gatekeeper.</p>\n\n\n\n<h3>XProtect </h3>\n\n\n\n<p>XProtect scans all applications on your machine against an up-to-date list of malware that Apple keeps to identify any potentially malicious programs. It all happens seamlessly in the background and doesn’t require you to set it up as it’s on by default. One of the main advantages of this, apart from the fact it’s free, is that due to being a part of the operating system its impact on performance is negligible. </p>\n\n\n\n<p>Your only real interaction with XProtect would be when you try to open a file that appears on its warning list, as this will usually trigger a warning message telling you that it could be malware. Should you see this message, immediately delete the file as there’s a very good chance it’s dangerous. </p>\n\n\n\n<p>XProtect is updated regularly by Apple (all in the background) and is a solid protection against malware threats. That being said, some third-party antivirus software offer a wider scope of malware protection and are updated more frequently than XProtect. So if you’re someone who regularly downloads software from outside the App Store, you may want to take a look at our roundup of the <a href=\"https://www.macworld.com/article/668850/best-mac-antivirus-software.html\">Best Mac antivirus apps</a>.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/02/App-will-damage-your-computer.-You-should-more-it-to-trash.jpg?quality=50&amp;strip=all\" alt=\"will damage your computer. You should more it to trash. Xprotect\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/02/App-will-damage-your-computer.-You-should-more-it-to-trash.jpg?quality=50&amp;strip=all 655w, https://b2c-contenthub.com/wp-content/uploads/2023/02/App-will-damage-your-computer.-You-should-more-it-to-trash.jpg?resize=300%2C266&amp;quality=50&amp;strip=all 300w\" width=\"655\" height=\"581\" /></figure><p> </p></div>\n\n\n\n<h3>Gatekeeper</h3>\n\n\n\n<p>The second tier of protection is one you may well have encountered while using your Mac. Gatekeeper, as the name suggests, stops any unauthorized software from being installed on your computer. This is achieved by Apple digitally signing approved software, so that any trying to be installed that doesn’t have the signature will be turned away. It’s like your Mac has a nightclub bouncer for software. ‘You’re not on the list, you’re not coming in’. </p>\n\n\n\n<p>Gatekeeper does have some granular settings though, meaning you can lock up your Mac tight by only allowing software from the Mac App Store to be installed, or include third-party programs that have the appropriate digital signature. You may want the latter at times as some software developers offer more features in their software when it’s downloaded directly from their sites. </p>\n\n\n\n<p>These settings can be adjusted in macOS, using the following steps:</p>\n\n\n\n<ol>\n<li>Open System Settings.</li>\n\n\n\n<li>Go to Privacy &amp; Security.</li>\n\n\n\n<li>Scroll down to the Security section.</li>\n\n\n\n<li>Choose either App Store or App Store and Identified Developers.</li>\n</ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/Does-Mac-need-antivirus-SETTINGS.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Security settings on macOS\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/Does-Mac-need-antivirus-SETTINGS.jpg?quality=50&amp;strip=all 1489w, https://b2c-contenthub.com/wp-content/uploads/2024/02/Does-Mac-need-antivirus-SETTINGS.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/02/Does-Mac-need-antivirus-SETTINGS.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/02/Does-Mac-need-antivirus-SETTINGS.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/02/Does-Mac-need-antivirus-SETTINGS.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2024/02/Does-Mac-need-antivirus-SETTINGS.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Martyn Casserly</p></div>\n\n\n\n<p>You can read a more detailed explanation of these and some additional security features in our <a href=\"https://www.macworld.com/article/670537/do-macs-need-antivirus.html\">do Macs need antivirus software?</a> feature. </p>\n\n\n\n<h2>Does Apple have a virus scan? </h2>\n\n\n\n<p>Essentially, yes, Apple does have a virus scan, but it runs in the background, you can’t manually set it to scan your Mac for viruses. </p>\n\n\n\n<p>XProtect will catch any Mac viruses that are included in the database Apple uses, but it could miss the newest malware, and it may not prohibit you from passing on Window viruses to PC users. </p>\n\n\n\n<h2>Should I use third-party antivirus software on Mac?</h2>\n\n\n\n<p>While XProtect and Gatekeeper are a solid way to prevent malware and viruses from getting onto your Mac, there are more features available in some third-party solutions that could prove invaluable if you’re someone that likes to download and install lots of software from a variety of developers. These include a more extensive list of potential threats, real-time monitoring, firewalls, more frequent updates, anti-ransomware protection and other benefits. Another reason to install antivirus software on your Mac is to catch PC viruses that you could unwittingly pass on to friends and colleges. </p>\n\n\n\n<p>For most people, this will probably be overkill, but security is never something to be taken lightly. One of the best all-round solutions we’ve seen on macOS is <a href=\"https://offer.intego.com/en/mac-av?aff_sub=1-1-2237624-1-0-0\" target=\"_blank\"> Intego’s Mac Internet Security X9</a>. For more solutions check out our roundup of the <a href=\"https://www.macworld.com/article/673359/antivirus-deals.html\">best Mac antivirus deals</a>. We also recommend taking a look at the <a href=\"https://www.macworld.com/article/231047/best-vpn-for-mac.html\">best VPN for Mac</a> to make sure that your data is protected when using public Wi-Fi. </p>\n\n\n\n<p>There are also some steps you can take to mitigate the risks of infection, such as those outlined in <a href=\"https://www.macworld.com/article/1432223/mac-security-tips-password-find-my-users-lockdown-mode.html\">10 ways to protect your Mac from malware and theft</a> and <a href=\"https://www.macworld.com/article/225517/checking-your-mac-for-viruses-wait-what.html\">how to scan your Mac for malware</a>. If you’re concerned that you may already be a victim of an attack, then you can either use the <a href=\"https://www.macworld.com/article/1072483/how-to-lockdown-mode-activate-iphone-mac.html\">Lockdown feature in macOS</a> or explore our guide on <a href=\"https://www.macworld.com/article/676307/how-to-know-if-your-mac-has-been-hacked.html\">how to know if your Mac has been hacked</a> to find out what you can do. </p>\n\n\n\n<p>As always, we recommend <a href=\"https://www.macworld.com/article/671336/how-to-back-up-a-mac-or-macbook.html\">backing up your Mac</a> to prevent data loss in a worst-case scenario, using either Time Machine or one of the offerings featured in our <a href=\"https://www.macworld.com/article/668696/protect-your-mac-with-these-mac-backup-software-options.html\">best Mac backup software</a> chart. </p>\n\nMac, MacOS, Personal Software, Professional Software, Security Software and Services</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"12d54118b51b79d00f5aba499574f160de788c9d1e5c61e4cc1b89c813cb26b2","category":"Apple"}