{"title":"Tracking Scientific Gaps in the Conservation of Endangered Sturgeon: A Bibliometric Approach and Content Analyses","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/4496931?af=R","date":1718953449000,"content":"<p>The declining sturgeon population has prompted increased efforts for protection and recovery, resulting in its listing on the <i>IUCN Red List of Endangered Species</i>. Conservation and restoration efforts for sturgeon populations are vital within the context of aquaculture. The substantial growth of knowledge in this field between 1970 and 2022 underscores the need for a comprehensive bibliographic review. This review aims to categorize and optimize existing research to advance the sustainable development of sturgeon populations. Using bibliometric indicators and tools such as <i>VOSviewer</i>, <i>R</i>, <i>Maxqda</i>, and Publish or Perish, this study examined 1,118 peer-reviewed articles collected from the Scopus database. The review provides an overview of studies on sturgeon conservation and sustainable development. Our analysis suggests that future research should focus on six key factors: environmental impacts, management practices, genetic data, nutritional status, sturgeon characteristics, and the capabilities of sturgeon sperm. The results emphasize that the conservation of sturgeon is a multifaceted concept associated with changes in environmental conditions and human activities as well as sturgeon morphology, physiology, and genetics. This review aims to guide future research toward enhanced sturgeon protection by presenting the results of various analyses, identifying scientific and research gaps, and specifying research priorities.</p>","author":"Sara Pourhosein-Sarameh, \nBahram Falahatkar, \nZhitao Qi","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"12d5bb7baeca7b57b3d3a0135102d0b0b62ee1374fbf46a0565895217b141632","category":"Environment"}