{"title":"The WRKY Family Transcription Factor GmWRKY72 Represses Glyceollin Phytoalexin Biosynthesis in Soybean","link":"https://www.preprints.org/manuscript/202408.2093/v1","date":1724916877000,"content":"Phytoalexins are plant defense metabolites that are biosynthesized transiently in response to pathogens. Despite that their biosynthesis is highly restricted in plant tissues, the transcription factors that negatively regulate phytoalexin biosynthesis remain largely unknown. Glyceollins are isoflavonoid-derived phytoalexins that have critical roles in protecting soybean crops from the oomycete pathogen Phytophthora sojae. To identify regulators of glyceollin biosynthesis, we used a transcriptomics approach to search for transcription factors that are co-expressed with glyceollin biosynthesis in soybean and stilbene synthase phytoalexin genes in grapevine. We identified and functionally characterized the WRKY family protein GmWRKY72, which is one of four soybean WRKY72-type transcription factors of soybean. Overexpressing and RNA interference silencing of GmWRKY72 in the soybean hairy root system decreased and increased expression of glyceollin biosynthetic genes and metabolites, respectively, in response to wall glucan elicitor from P. sojae. A translational fusion with green fluorescent protein demonstrated that GFP-GmWRKY72 localizes mainly to the nucleus of soybean cells. The GmWRKY72 protein directly interacts with several glyceollin biosynthetic gene promoters and the glyceollin transcription factor proteins GmNAC42-1 and GmMYB29A1 in yeast hybrid systems. The results show that GmWRKY72 is a negative regulator of glyceollin biosynthesis that may repress biosynthetic gene expression by interacting with transcription factor proteins and the DNA of glyceollin biosynthetic genes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"12e3b10f798ea239c61de7b9648476dbb32120f07bc9bf230fe14e9665eebed4","category":"Interdisciplinary"}