{"title":"The Influence of Lifestyle on Male Fertility in the Context of Insulin Resistance &ndash; Identification of Factors That Influence Semen Quality with the Construction of a Multivariate Model for the Prediction of Correct or Incorrect Sperm Motility Test Results","link":"https://www.preprints.org/manuscript/202404.0554/v1","date":1712583717000,"content":"This aim of this study was to investigate the relationships between lifestyle factors, insulin resistance, and male fertility in 73 men with and without insulin resistance. The participants were divided based on insulin resistance status. Their physical activity, diet, perceived stress, sleep quality, libido level, and the duration of sexual abstinence were assessed on the basis of a number of parameters, including indices proposed by the authors. The results highlighted associations between a number of parameters, i.e., micronutrient and vitamin intake, diet quality, body composition, insulin resistance, and the duration of sexual abstinence, and semen quality, as measured by sperm motility. Significantly, the presence or absence of insulin resistance was linked to male fertility. A multivariate model was developed, incorporating parameters such as the Matsuda index, vitamin intake, and sexual abstinence duration, to predict motility scores. The study underscores the negative impact of modern civilization’s lifestyle choices on male fertility. Notably, vitamin and mineral consumption, especially from antioxidant-rich diets like the Mediterranean diet, emerged as key modifiable factors affecting fertility. Routine diagnostics for insulin resistance in fertility-related interventions is recommended. The study also highlights the importance of considering sexual abstinence duration during semen collection for accurate diagnostic results. Future research should focus on validating the proposed multivariate model and exploring the effects of lifestyle modifications, particularly vitamin supplementation, on fertility outcomes in men, especially in the context of insulin resistance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"12f2ec58ea2abb25dcb8bc17a12815b480b3fae8332e0b808717ff4cd0a5c730","category":"Interdisciplinary"}