{"title":"Ineos Grenadiers respond to Freeman verdict, British MP says Brailsford should be suspended","link":"https://cyclingtips.com/2021/03/ineos-grenadiers-respond-to-freeman-verdict-british-mp-says-brailsford-should-be-suspended/","date":1615582028000,"content":"<p>After the Medical Practitioners Tribunal Service (MPTS) deemed former Sky and British Cycling doctor Richard Freeman <a href=\"https://cyclingtips.com/2021/03/richard-freeman-guilty-of-ordering-testosterone-for-an-unknown-rider/\" target=\"_blank\" rel=\"noreferrer noopener\">guilty</a> of having ordered testosterone &#8220;knowing or believing&#8221; it was for a rider, the Ineos Grenadiers responded to the verdict with a statement on Friday, while a member of British Parliament has called for team principal Dave Brailsford to be suspended while an investigation is carried out.</p>\n\n\n\n<p>&#8220;The Team fully supports the work of the GMC [the General Medical Council] and it is very clear from their report that Richard Freeman fell short of the ethical standards required of him as a doctor and acted dishonestly,&#8221; the team said in a statement.</p>\n\n\n\n<p>&#8220;However the Team does not believe that any athlete ever used or sought to use Testogel or any other performance enhancing substance. No evidence has been provided that this ever happened or that there has been any wrongdoing by any athlete at any point. We will continue to give our full support and co-operation to UKAD, as we have done throughout this process, as they continue to investigate his conduct. We will not be making any further comment.&#8221;</p>\n\n\n\n<p>The GMC reached its verdict after tribunal proceedings that lasted for over two years, with several lengthy adjournments and reschedulings. Accused of ordering testosterone to British Cycling headquarters in 2010, Freeman said that he had indeed made the order and admitted to 18 of 22 charges related to the incident, but claimed he was &#8220;bullied&#8221; into doing so by former British Cycling and Sky coach Shane Sutton to treat erectile dysfunction. Sutton denied that claim. The hearing ultimately found Freeman&#8217;s conduct &#8220;incapable of innocent explanation.&#8221;</p>\n\n\n\n<p>The tribunal will meet again to determine whether Freeman should lose his license to practice medicine or face other repercussions following the verdict.</p>\n\n\n\n<p>UK Anti-Doping has already charged Freeman with &#8220;possession of a prohibited substance&#8221; and &#8220;tampering or attempted tampering with any part of doping control.&#8221; In a statement, UKAD chief executive Nicole Sapstead said that Freeman &#8220;is subject to a provisional suspension from all sport.&#8221;</p>\n\n\n\n<p>According to <a href=\"https://www.telegraph.co.uk/cycling/2021/03/12/dave-brailsford-should-suspended-ineos-says-mp-member-dcms/\" target=\"_blank\" rel=\"noreferrer noopener\">The Telegraph</a>, Clive Efford, a member of the British Parliament&#8217;s Digital, Culture, Media &amp; Sport committee, has called on Ineos to suspend team principal Dave Brailsford and called for an investigation into the incident.</p>\n\n\n\n<p>&#8220;Until this is cleared up, all those involved shouldn’t be anywhere near the sport,&#8221; Efford said.</p>\n\n\n\n<p>&#8220;Clearly, there are questions to be answered and people should be suspended while this is properly investigated.”</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/ineos-grenadiers-respond-to-freeman-verdict-british-mp-says-brailsford-should-be-suspended/\">Ineos Grenadiers respond to Freeman verdict, British MP says Brailsford should be suspended</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"12f6a5cf0b3ac9548db00ef27f659261dec4b9cb0658ca7bb5e64d4bdfe20762","category":"Cycling"}