{"title":"PSXIII-20 Impact of Aspergillus oryzae fermentation-derived prebiotic-like additive combined with monensin on feedlot performance in finishing steers","link":"https://academic.oup.com/jas/article/102/Supplement_3/790/7757764?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The aim of this study was to investigate the effects of supplementing a prebiotic-like action additive product derived from the fermentation of <span>Aspergillus oryzae</span> (AM; 2 g Amaferm/d) in combination with monensin throughout the entire feedlot period. The primary objective was to evaluate the impact of this dietary intervention on feedlot performance, focusing on parameters such as feed intake, feed-to-gain ratio, body weight (BW), average daily gain (ADG), and carcass quality. Steers (n = 1,200), aged approximately 18 mo with an initial BW of 307.8 ± 17 kg, were randomly assigned to 8 pens (150 steers per pen) and each pen was randomly assigned to two treatments: a control diet with monensin (M; monensin supplemented at 33 mg/kg DM) and a treatment diet with the addition of AM (M+AM; monensin supplemented at 33 mg/kg DM and 2 g Amaferm/d). The feedlot period comprised three steps, with daily feed delivery adjustments using a feed bunk management system. A multilevel model using the PROC MIXED procedure of SAS with pen as experimental unit, was employed to evaluate feed intake, feed to gain ratio, BW and ADG for each period, also including effects on carcass quality and growth measured by ultrasound (random sample of 45 animals per pen; 30% of each pen). No significant differences were observed in feed intake across the three diet steps (<span>P</span> &gt; 0.10). During the adaptation period, steers fed AM had greater ADG (+0.168 kg/d; <span>P</span> = 0.003) and increased BW at d 20 (+5.5 kg; <span>P</span> &lt; 0.001). Although ADG during the finishing phase was similar for both treatments, a trend was observed for greater BW at d 108 (+4.6 kg; <span>P</span> = 0.095) when supplemented with AM. The inclusion of AM showed no impact on feed-to-gain ratio for the entire period (<span>P</span> = 0.589). In the finishing period, a positive effect on ribeye area (REA) growth rate (+0.54 cm<sup>2</sup>/mo; <span>P</span> = 0.016) and a trend towards greater back fat deposition rate (+0.11 mm/mo; <span>P</span> = 0.069) were observed with AM supplementation. At the end of the finishing period, a trend towards greater REA (+1.39 cm2; <span>P</span> = 0.101) was noted with no differences in back fat. Overall, this study demonstrates that the addition of AM throughout the feedlot period positively influenced the productive response during the adaptation period, leading to improvements in carcass growth during the finishing period.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1311f3e0d7c1bc0c1bc2e8fe22783f106d1dc709f5cefa5e0064b16b0383cf72","category":"Environment"}