{"title":"Bennett sprints to another UAE Tour stage win: Daily News","link":"https://cyclingtips.com/2021/02/bennett-sprints-to-another-uae-tour-stage-win-daily-news/","date":1614382888000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>We close out the week with news of Sam Bennett nabbing his second win of the week. The 30-year-old Irishman sprinted to victory on stage 6 of the UAE Tour, where Tadej Pogacar continues to lead the race despite being penalized for getting a push from a teammate in the finale.</p>\n\n\n\n<p>Also in the news, Quinn Simmons has said he does not think he deserved to be suspended last year.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Bennett wins stage 6 of the UAE Tour, Pogacar penalized for getting a push</h3>\n\n\n\n<p><strong>Sam Bennett</strong> nabbed his second win of the season on Friday&#8217;s sixth stage of the <strong>UAE Tour</strong>.</p>\n\n\n\n<p>The penultimate stage of the UAE Tour took the peloton 165 km from Deira Island to the Palm Jumeirah in Dubai. Crosswinds in the desert led to a brief split in the pack with around 70 km to go, but things came back together in the peloton before long. The main break of the day was caught with some 25 km to go, and a solo move by <strong>Dmitriy Gruzdev</strong> was reeled in with 10 km to go.</p>\n\n\n\n<p>The sprinters&#8217; teams jockeyed for position in the closing kilometers, with BikeExchange and then Bora-Hansgrohe pushing the pace in the final kilometer. Bennett&#8217;s Deceuninck-Quick-Step teammate <strong>Michael Morkov</strong> hit the front in the last 200 meters, however, and then Bennett launched a sprint that no one could match. He took a convincing win, his second of this year&#8217;s UAE Tour, ahead of <strong>Elia Viviani</strong> and <strong>Pascal Ackermann</strong>.</p>\n\n\n\n<p>Race leader <strong>Tadej Pogacar</strong> finished safely in the peloton, but he and fellow UAE-Team Emirates rider <strong>Jan Polanc</strong> were both penalized 10 seconds after Polanc gave Pogacar a push in the finale. With one stage to go, Pogacar has a 35-second GC advantage over second-placed <strong>Adam Yates</strong>.</p>\n\n\n\n<h3>Florian Stork fractures knee cap and ribs in UAE Tour crash</h3>\n\n\n\n<p>In other news from the UAE Tour, <strong>Florian Stork</strong> crashed as he approached the finish line on stage 6, and he ultimately abandoned the race.</p>\n\n\n\n<p>DSM said after the stage that the 23-year-old German had suffered a fractured knee cap and fractured ribs in the crash.</p>\n\n\n\n<h3>Quinn Simmons: &#8216;I don&#8217;t feel like I deserved the suspension&#8217;</h3>\n\n\n\n<p><strong>Quinn Simmons</strong>, who was suspended by <strong>Trek-Segafredo</strong> last year after what the team referred to as &#8220;engaging in conversation on Twitter in a way that we felt was conduct unbefitting a Trek athlete,&#8221; said on Friday that he did not feel that he deserved to be suspended, <a href=\"https://www.cyclingnews.com/news/quinn-simmons-i-did-not-deserve-to-be-suspended/\" target=\"_blank\" rel=\"noreferrer noopener\">Cyclingnews</a> reports.</p>\n\n\n\n<p>The 19-year-old American was suspended after he posted a tweet with the word &#8220;Bye&#8221; and an emoji of a Black hand waving in response to a tweet from a cycling journalist saying that supporters of Donald Trump could unfollow her.</p>\n\n\n\n<p>He addressed the topic in a media appearance Friday.</p>\n\n\n\n<p>&#8220;For me, I don&#8217;t feel like I deserved the suspension,&#8221; Simmons said, according to Cyclingnews. &#8220;I realize that I didn&#8217;t represent the brand in the way that I was supposed to, but to have missed the Classics and, straight up, I&#8217;m able to play a big role for the team, and I think to sacrifice that was probably, definitely, not worth it, for myself and the team.&#8221;</p>\n\n\n\n<h3>Ayesha McGowan launches Thee Abundance Summit, &#8216;a virtual celebration of Black and Brown joy in cycling and the outdoors&#8217;</h3>\n\n\n\n<p><strong>Ayesha McGowan</strong> continues to work to bolster inclusivity in cycling. She has announced the launch of <strong>Thee Abundance Summit</strong>, which her announcement described as &#8220;a virtual celebration of Black and Brown joy in cycling and the outdoors.&#8221;</p>\n\n\n\n<p>The summit, open to anyone who wishes to attend, will take place from March 26 to 27 and will feature workshops, panels, a group Zwift ride, among other events.</p>\n\n\n\n<p>“I think it’s absolutely necessary that I host a celebration of joy,&#8221; McGowan said. &#8220;All too often we are only invited to share our pain, our struggles, and our sorrows. This is a space where we, as Black and Brown people in the cycling and outdoor communities, can bring our full selves with the sole purpose of having a good time.”</p>\n\n\n\n<p>You can find out more <a href=\"https://www.aquickbrownfox.com/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</p>\n\n\n\n<h3>UCI publishes update to COVID-19 protocols</h3>\n\n\n\n<p>The <strong>UCI</strong> has published an <strong>update</strong> to its COVID-19 protocols for the 2021 season that feature a handful of changes from last year&#8217;s protocols but also confirm that COVID-19 testing will continue to be required for anyone entering a race &#8220;bubble&#8221; in 2021. As was the case in 2020, riders and team staff will need two negative PCR tests before joining a &#8220;bubble,&#8221; and that includes those who have been vaccinated.</p>\n\n\n\n<p>&#8220;Progress has been made in the fight against coronavirus, especially with the arrival of vaccines, which have given us hope that we can soon make a gradual return to a more ‘normal’ life,&#8221; UCI President David Lappartient said. &#8220;However, given that athletes and young adults are not among governments’ priorities for vaccination, we have decided, in conjunction with the steering group – which includes representatives of the riders, teams, team doctors and organizers – to maintain similarly high standards as last year, in the best interests of all parties and in expectation of better days ahead.&#8221;</p>\n\n\n\n<h3>Itzulia Basque Country unveils 2021 route</h3>\n\n\n\n<p>Organizers of the <strong>Itzulia Basque Country</strong> have unveiled the route of this year&#8217;s race, which is set to start with a 13.9 km time trial in Bilbao on April 5.</p>\n\n\n\n<p>Following the opening TT, the race will take on plenty of climbing challenges, among them the Ermualde climb that closes out stage 3, the Jaizkibel and Erlaitz climbs that feature towards the end of stage 4, and the seven categorized climbs on tap for the sixth and final stage to Arrate.</p>\n\n\n\n<h2>Coming up &#8230;</h2>\n\n\n\n<p>Saturday will be a busy day for bike racing. The UAE Tour will conclude with a sprinter-friendly seventh and final stage that will start at Yas Mall and finish at the Abu Dhabi Breakwater, while the Omloop Het Nieuwsblad will kick off cobbled racing in Belgium for both the men&#8217;s and women&#8217;s pelotons.</p>\n\n\n\n<h2>In case you missed it&#8230;</h2>\n\n\n\n<ul><li>It took years for our social media editor <strong>Mike Better</strong> to come to terms with his eating disorder. <a href=\"https://cyclingtips.com/2021/02/i-flicked-the-light-switch-on-an-eating-disorder/\">This</a> is his story.</li><li><strong>Hunt</strong> has <a href=\"https://cyclingtips.com/2021/02/hunt-expands-limitless-aero-disc-range-with-60-version/\">added</a> to its <strong>Limitless Aero Disc</strong> range.</li><li>Here&#8217;s <a href=\"https://cyclingtips.com/2021/02/what-you-need-to-know-about-the-mens-omloop-het-nieuwsblad/\" target=\"_blank\" rel=\"noreferrer noopener\">what you need to know</a> ahead of the men&#8217;s <strong>Omloop Het Nieuwsblad</strong>.</li><li>Amy Jones has your <a href=\"https://cyclingtips.com/2021/02/womens-cycling-weekly-issue-14/\" target=\"_blank\" rel=\"noreferrer noopener\">weekly roundup</a> of <strong>women&#8217;s cycling news and insight</strong>.</li></ul>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/bennett-sprints-to-another-uae-tour-stage-win-daily-news/\">Bennett sprints to another UAE Tour stage win: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1317a6a547a47a84e37246fe1ad08313833c74c183d4c1cacbe5e089c44f4c42","category":"Cycling"}