{"title":"Urolithin a Protects Hepatocytes from Palmitic Acid-Induced ER Stress by Regulating Calcium Homeostasis in the MAM","link":"https://www.preprints.org/manuscript/202410.0399/v1","date":1728293821000,"content":"An ellagitannin-derived metabolite Urolithin A (UA) has emerged as a potential therapeutic agent for metabolic disorders due to its antioxidant, anti-inflammatory, and mitochondrial function-improving properties, but its efficacy in protecting against ER stress remains underexplored. The endoplasmic reticulum (ER) is a cellular organelle involved in protein folding, lipid synthesis, and calcium regulation. Perturbations in these functions can lead to ER stress, which contributes to the development and progression of metabolic disorders such as metabolic-associated fatty liver disease (MAFLD). In this study, we identified a novel target protein of UA and elucidated its mechanism for alleviating palmitic acid (PA)-induced ER stress. CETSA-LC-MS/MS analysis revealed that UA binds directly to the sarcoplasmic/endoplasmic reticulum Ca2+-ATPase (SERCA), an important regulator of calcium homeostasis in mitochondria-associated ER membranes (MAMs). As an agonist of SERCA, UA attenuates abnormal calcium fluctuations and ER stress in PA-treated liver cells, thereby contributing to cell survival. In addition, UA inhibits PA-induced mitochondrial ROS and lipid accumulation, further supporting its protective role. The lack of UA activity in SERCA knockdown cells suggests that UA regulates cellular homeostasis through its interaction with SERCA. Collectively, our results demonstrate that UA protects against PA-induced ER stress and enhances cell survival by regulating calcium homeostasis in MAM through SERCA. This study highlights the potential of UA as a therapeutic agent for metabolic disorders associated with ER stress.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"132f3794927f00f8a20d4092607cdaaa4498808c432bf35f7297557492b87585","category":"Interdisciplinary"}