{"title":"Assessment of DNA/RNA Defend Pro: An Inactivating Sample Collection Buffer for Enhanced Stability, Extraction-Free PCR, and Rapid Antigen Testing of Nasopharyngeal Swab Samples","link":"https://www.preprints.org/manuscript/202403.1361/v1","date":1711359848000,"content":"This study comprehensively evaluates the DNA/RNA Defend Pro (DRDP) sample collection buffer designed to inactivate and stabilize patient samples. The primary objectives encompassed assessing DRDP's efficacy in ensuring sample stability, facilitating extraction-free polymerase chain reaction (PCR), and ensuring compatibility with rapid antigen testing.Ninety-five diagnostic nasopharyngeal swab samples tested for influenza A/B, RSV A/B, and/or SARS-CoV-2 were diluted 1/10 with DRDP and anonymized. Stability testing involved incubating 31 positive samples at 4 째C, 20 째C, and 37 째C for 7 days, with regular extraction-free nucleic acid amplification testing (NAAT).Results demonstrated that DRDP guaranteed viral RNA stability at all temperatures for influenza, SARS-CoV-2 and RSV showing stability up to 7 days at 4 째C. DRDP-diluted samples exhibited robust compatibility with direct PCR, as 72 out of 88 samples positive for cobas Liat also tested positive for direct PCR. Non-concordant results could be explained by the 200-fold lower input in the extraction-free NAAT.Compared to NAAT, rapid antigen testing demonstrated lower sensitivity, as expected, while maintaining perfect specificity. Clear cutoffs between positive and negative rapid antigen testing results were observed in both cobas Liat and direct PCR analyses, validating DRDP's compatibility with these techniques. In conclusion, DRDP is an effective stabilizing medium compatible with direct PCR and rapid antigen testing and shows great potential for optimizing diagnostic processes, particularly in resource-limited or time-sensitive scenarios.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"13348793257b21e79a79a3002a2f3d37860943167d2069d5e710989ca5de4138","category":"Interdisciplinary"}