{"title":"Identifying Climate Impacts From Different Stratospheric Aerosol Injection Strategies in UKESM1","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004358?af=R","date":1711353887000,"content":"<h2>Abstract</h2>\n<p>Stratospheric Aerosol Injection (SAI) is a proposed method of climate intervention aiming to reduce the impacts of human-induced global warming by reflecting a portion of incoming solar radiation. Many studies have demonstrated that SAI would successfully reduce global-mean surface air temperatures; however the vast array of model scenarios and strategies result in a diverse range of climate impacts. Here we compare two SAI strategies—a quasi- equatorial injection and a multi-latitude off-equatorial injection—simulated with the UK Earth System Model (UKESM1), both aiming to reduce the global-mean surface temperature from that of a high-end emissions scenario to that of a moderate emissions scenario. We compare changes in the surface and stratospheric climate under each strategy to determine how the climate response depends on the injection location. In agreement with previous studies, an equatorial injection results in a tropospheric overcooling in the tropics and a residual warming in the polar regions, with substantial changes to stratospheric temperatures, water vapor and circulation. Previous comparisons of equatorial versus off-equatorial injection strategies are limited to two studies using different versions of the Community Earth System Model. Our study evaluates how the climate responds in UKESM1 under these injection strategies. Our results are broadly consistent with previous findings, concluding that an off-equatorial injection strategy can minimize regional surface temperature and precipitation changes relative to the target. We also present more in-depth analysis of the associated changes in Hadley Circulation and regional temperature changes, and call for a new series of inter-model SAI comparisons using an off-equatorial strategy.</p>","author":"Alice F. Wells, \nMatthew Henry, \nEwa M. Bednarz, \nDouglas G. MacMartin, \nAndy Jones, \nMohit Dalvi, \nJames M. Haywood","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"1338d1419a22188466255c3d7bd50305176cc99b7651b8e17a5801ec4831146e","category":"Environment"}