{"title":"Blue Eye Samurai","link":"https://markpeak.net/blue-eye-samurai/","date":1700973174000,"content":"<p><em>[มีสปอยล์เนื้อเรื่อง]</em></p>\n<p>Blue Eye Samurai ผลงานแอนิเมชันเรื่องใหม่บน Netflix ในเดือนพฤศจิกายน 2023 เป็นซีรีส์ความยาว 8 ตอน ดูจบแล้วต้องบอกว่าทำได้ดีมากจนต้องเขียนถึง (แม้เป็นซีรีส์สำหรับผู้ใหญ่ที่เต็มไปด้วยเลือด เซ็กซ์ และความรุนแรง)</p>\n<p>เนื้อเรื่องของ Blue Eye Samurai เป็นเรื่องของซามูไรพเนจร (โรนิน) ชื่อ “มิซึ” (Mizu ที่แปลว่าน้ำ) ที่ตาสีฟ้าเพราะเป็นลูกครึ่งต่างชาติ ในยุคสมัยเอโดะที่ญี่ปุ่นปิดกั้นตัวเองจากโลกภายนอก การมีตาสีฟ้าจึงเปรียบได้ดั่ง “ปีศาจ” ที่คนในสังคมรังเกียจ</p>\n<p>มิซึไม่รู้ว่าใครเป็นพ่อ และเมื่อเติบโตมาได้ไม่นาน บ้านก็ถูกวางเพลิงซ้ำอีก แม่ตาย มิซึกลายเป็นเด็กกำพร้าที่ถูกเด็กๆ ในหมู่บ้านกลั่นแกล้งอย่างน่าคับแค้นใจ จนโชคชะตาทำให้มาเจอกับ Master Eiji ปรมาจารย์นักตีดาบตาบอดที่เก็บมาเลี้ยง ทำให้มิซึได้ฝึกวิชาตีดาบไปในตัว พร้อมฝึกวิชาดาบโดยเลียนแบบท่าของนักดาบต่างๆ ที่แวะเวียนมาขอให้อาจารย์ตีดาบให้</p>\n<p>แต่เท่านั้นยังไม่พอ ตอนจบของ Episode 1 ก็เปิดเผยให้คนดูรู้ว่า มิซึแท้จริงแล้วเป็นผู้หญิง (เท่ากับมีปมทั้ง race และ gender) ที่ต้องปลอมตัวเป็นผู้ชาย เพื่อเดินทางในยุคที่ผู้หญิงเดินทางเองลำพังไม่ได้ ทำให้เรื่องยิ่งดราม่าเข้าไปอีก</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-3.jpg\" width=\"800\" height=\"450\" srcset=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-3.jpg 800w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-3-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-3-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-3-700x394.jpg 700w\" /></p>\n<h2>ตัวละคร</h2>\n<p>การผจญภัยของมิซึ มีเป้าหมายเพื่อสังหารชาวต่างชาติ 4 คนที่ทางการญี่ปุ่น “ยอม” ให้เข้ามาอยู่ในประเทศยุคนั้น ซึ่ง 1 ใน 4 คนนั้นคือพ่อของเธอ คนที่ทำให้เธอเกิดมาในโลกที่เต็มไปด้วยความเกลียดชังแห่งนี้</p>\n<p>ระหว่างทาง มิซึได้พบกับตัวละครหลักอีก 3 คน ได้แก่ Ringo ลูกชายร้านโซบะที่มือพิการมาตั้งแต่กำเนิด (บางคนบอกว่า woke สามชั้นคือมีตัวละครพิการมาด้วย), Taigen นักดาบมือหนึ่งของเกียวโต และ Akemi เจ้าหญิงลูกสาวของไดเมียวแห่งเกียวโต คนรักของ Taigen ที่จะต้องไปแต่งงานกับลูกชายโชกุนแห่งเอโดะ</p>\n<p>บทในเรื่อง Blue Eye Samurai ทำออกมาได้ดี ตัวละครมีไม่เยอะ แต่สำคัญ มีบทบาททุกตัว แต่ละตัวมีพัฒนาการ มีปมในใจ มีไคลแมกซ์ของตัวเอง แม้มีจุดที่ดูแล้วเอ๊ะบ้าง เช่น ตัวละครแม่ของมิซึที่จู่ๆ ใส่กลับเข้ามาใหม่อีกครั้ง หรือตัวร้าย Fowler ที่ยังไม่ค่อยเข้าใจปมหรือความต้องการของเขามากนัก ดูเป็นตัวร้ายทั่วๆ ไปที่ไม่น่าจดจำสักเท่าไร</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-ringo-1024x576.jpg\" width=\"700\" height=\"394\" srcset=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-ringo-1024x576.jpg 1024w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-ringo-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-ringo-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-ringo-700x394.jpg 700w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-ringo.jpg 1200w\" /></p>\n<h2>เนื้อเรื่อง</h2>\n<p>เนื้อเรื่องทั้ง 8 ตอน แบ่งออกเป็นช่วง 3 ตอนแรกใช้เวลาเซ็ตแบ็คกราวน์ของตัวละครให้ผู้ชม ตอนที่ 4-5 เป็นช่วงที่มิซึและอาเคมิ ไปอยู่ในซ่องเพื่อสืบข่าว ก่อนปิดองค์กลางในตอนที่ 6 ที่มิซึบุกเข้าไปยังปราสาทบนเกาะของ Abijah Fowler ฝรั่งที่เป็นบอสใหญ่ของเรื่อง แล้วตอนที่ 7-8 ค่อยเป็นองค์สุดท้ายที่เป็นสงครามในเมืองหลวง</p>\n<ul>\n<li>ตอนที่เด่นในเรื่องคือตอนที่ 5 ที่เล่าประวัติชีวิตของมิซึอย่างละเอียด ว่าทำไมจึงเคียดแค้นจนกลายเป็น onryo โดยใช้วิธีเล่าสลับกับหุ่นกระบอกญี่ปุ่น Bunraku ที่เปรียบเทียบกับชีวิตของมิซึ ทำออกมาได้น่าจดจำมาก</li>\n<li>ส่วนตอนที่ 6 ก็ทำออกมาดีไม่แพ้กัน เป็นการบุกเดี่ยวเข้าปราสาทของมิซึ ที่ทำออกมาได้เหมือนกับเกมแอคชั่นเลย เรียกว่าดูรวดเดียวจบถึงได้รู้ว่า อ้าว จบแล้ว</li>\n<li>ตอนที่ 8 เหตุการณ์สงครามกลางเมือง ที่ลุกลามจนกลายเป็นไฟไหม้ใหญ่ เผาไหม้ทุกอย่าง อ้างอิงเหตุการณ์จริงในประวัติศาสตร์ Great Fire of 1657 ที่เผาผลาญเอโดะไปเกือบหมด แต่เหตุการณ์ในเรื่องไม่ได้อิงตามประวัติศาสตร์ แค่ยืมฉากมาใช้เฉยๆ ซึ่งเป็นตอนจบที่อลังการดีมาก</li>\n<li>ตอนจบของ Blue Eye Samurai ยังเป็นแค่ตอนจบเฉพาะบทแรกของเรื่องเท่านั้น <a href=\"https://www.netflix.com/tudum/articles/blue-eye-samurai-season-1-ending-explained\">เนื้อเรื่องยังเตรียมขยายต่อไปยังซีซั่น 2 ซึ่งทีมงานอยากทำ</a> แต่ตอนนี้ยังไม่ได้รับอนุมัติจาก Netflix ให้สร้างต่อ (ถ้าเรตติ้งดีพอ)</li>\n</ul>\n<p>ในภาพรวมแล้ว Blue Eye Samurai เป็นการต่อสู้ของผู้หญิง 2 คน ทั้ง <strong>มิซึ</strong> ผู้หญิงตาสีฟ้าที่ต้องปลอมตัวเป็นผู้ชาย ต่อสู้เพื่อล้างแค้นจนตัวเองกลายเป็นปีศาจร้ายที่แค้นจนตาย “<a href=\"https://en.wikipedia.org/wiki/Onry%C5%8D\">onryo</a>”  และ <strong>อาเคมิ</strong> องค์หญิงสูงศักดิ์ที่เติบโตขึ้นมาในวัง ใช้ชีวิตหรูหราที่คนอื่นต้องอิจฉา แต่ด้วยฐานันดรกลับทำให้เธอไม่เป็นตัวของตัวเอง จึงต้องต่อสู้เพื่อลิขิตชีวิตเอง และโชคชะตาทำให้เส้นทางชีวิตของทั้ง 2 คนได้ผ่านมาพบกันในเรื่อง ให้ภาพที่คอนทราสต์กัน ซึ่งตรงนี้ทำออกมาได้ดีมากๆ</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-akemi-1024x576.jpg\" width=\"700\" height=\"394\" srcset=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-akemi-1024x576.jpg 1024w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-akemi-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-akemi-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-akemi-700x394.jpg 700w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-akemi.jpg 1200w\" /></p>\n<h2>เบื้องหลังการสร้าง</h2>\n<p>ผู้สร้างซีรีส์ Blue Eye Samurai คือคู่สามีภรรยา Michael Green และ Amber Noizumi โดย Green เป็นนักเขียนบทภาพยนตร์ที่มีผลงานหนังดังๆ มาแล้วหลายเรื่อง เช่น Blade Runner 2049 และไตรภาคนักสืบ Poirot ของ Kenneth Branagh (Murder on the Orient Express, Death on the Nile, A Haunting in Venice)</p>\n<p>ส่วนภรรยา Amber Noizumi น่าจะเป็นต้นแบบของมิซึเลยก็ว่าได้ เพราะเธอให้สัมภาษณ์ชัดเจนว่าในฐานะลูกครึ่งญี่ปุ่น เธอต้องพบกับความผิดแผกในสังคมแบบที่ลูกครึ่งต้องเจอ และความรู้สึกนี้มันกลายเป็นปมหลักของ Blue Eye Samurai นั่นเอง</p>\n<p><span>﻿</span><span>﻿</span><span>﻿</span></p>\n<p>บุคคลสำคัญอีกคนของซีรีส์คือ ผู้กำกับหญิงหัวสีชมพู Jane Wu ซึ่งเป็นคนไต้หวันที่เติบโตในแคลิฟอร์เนีย และน่าจะสะท้อนความรู้สึกของความผิดแผกในแง่เชื้อชาติได้ดีเช่นกัน ตัวเธอเองยังเป็นนักสู้ martial art ด้วย และกลายเป็นคนคุมทีมงานมาฝึกวิชาต่อสู้ ฟันดาบ เพื่อให้เข้าใจความรู้สึกของตัวละครจริงๆ (คลิปข้างบนมีฉากที่ Jane Wu ซ้อมต่อสู้ด้วย)</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.vanityfair.com/hollywood/2023/09/blue-eye-samurai-jane-wu\">\n\t\t\t\t\t<img src=\"https://media.vanityfair.com/photos/65123369e535c0bd3bf516f5/16:9/w_1280,c_limit/Director-Blue-Eye-Samurai.jpg\" alt=\"The Pink-Haired Secret Weapon Behind 'Blue Eye Samurai'\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.vanityfair.com/hollywood/2023/09/blue-eye-samurai-jane-wu\">\n\t\t\tThe Pink-Haired Secret Weapon Behind 'Blue Eye Samurai'\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.vanityfair.com/hollywood/2023/09/blue-eye-samurai-jane-wu\">\n\t\t\t<p>Jane Wu once hated who she was. The animation director's new Netflix series explores a warrior who also hides to fit in. An exclusive first look...</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://www.vanityfair.com/verso/static/vanity-fair/assets/favicon.ico\" alt=\"Vanity Fair\" />\t\tVanity Fair\t</div>\n</div>\n<h2>งานภาพและโปรดักชัน</h2>\n<p>งานภาพของ Blue Eye Samurai ใช้เทคนิค 3D แปลงภาพเป็น 2D หรือที่เราเคยเรียกมันว่า cell-shaded ช่วยให้การขยับมุมกล้องดูเป็น cinematic มากๆ (เพราะหมุนกล้องในโลก 3D ได้ตามความพอใจของผู้กำกับ) แต่ยังคงอารมณ์ความรู้สึกใกล้เคียงกับงานภาพแอนิเมชันแบบ 2D ดั้งเดิมเอาไว้ได้เยอะพอสมควร แม้มีหลุดๆ บ้างในบางฉากที่ดูไม่ค่อยเนียนตานัก แต่ก็ให้อภัยได้เพราะไม่เยอะ</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-1.jpg\" width=\"900\" height=\"506\" srcset=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-1.jpg 900w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-1-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-1-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-1-700x394.jpg 700w\" /></p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-2.jpg\" width=\"900\" height=\"506\" srcset=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-2.jpg 900w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-2-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-2-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-scene-2-700x394.jpg 700w\" /></p>\n<p>Netflix ยังออกคลิปอธิบายเบื้องหลังงานภาพมาให้ดูกัน เราจะเห็นว่างานละเอียดมาก คือ มีตั้งแต่การสเกตซ์ภาพซีนต่างๆ ตามปกติ จากนั้นไปทำ motion capture จากนักแสดงคนจริงๆ เพื่อให้ได้การเคลื่อนไหวที่สมจริง ไม่ว่าจะเป็นฉากแอคชั่นฟันดาบ หรือการเดินของตัวละครหญิงที่สวมชุดกิโมโนในเรื่อง แล้วค่อยมาดัดแปลงเป็นโมเดล 3D อีกทีหนึ่ง (งาน 3D ทำโดย<a href=\"https://www.spirit-prod.com/en/\">สตูดิโอ Blue Spirit จากฝรั่งเศส</a>)</p>\n<p></p>\n<p>จุดสังเกตสำคัญของงานภาพคือ แม้ชื่อเรื่องดูเป็นซีรีส์ญี่ปุ่น แต่คนสร้างเป็นฝรั่งเกือบทั้งหมด สไตล์ภาพจึงเป็นแนวๆ แอนิเมชั่นฝรั่งที่ดูสมจริง (เหมือนพวกงาน DreamWorks ยุคแรกๆ) ตัวละครหน้าตาแข็งๆ เห็นกรามหน้าชัดเจน ตาตี่ๆ หน่อย ต่างจากงานภาพฝั่งอนิเมะญี่ปุ่น ตาโตหน้ากลม แบบที่เราคุ้นเคยกัน</p>\n<p>และเนื่องจากทีมผู้สร้างเป็นฝรั่งเกือบหมด เสียงพากย์หลักจึงเป็นภาษาอังกฤษ โดย<a href=\"https://www.netflix.com/tudum/articles/blue-eye-samurai-cast-and-characters\">นักพากย์อเมริกันเกือบหมด</a> (แม้มีคนญี่ปุ่นบ้าง เช่น George Takei แต่ก็เป็นคนที่แสดงในหนังฝรั่ง พูดภาษาอังกฤษอยู่แล้ว) ดังนั้นทั้งงานภาพและเสียงจึงให้ความรู้สึกเป็นฝรั่งมากกว่างานฝั่งญี่ปุ่นแน่นอน</p>\n<p>งานโปรดักชันในเรื่องก็ทำออกมาได้ดีและละเอียดมาก เราเห็นการเก็บรายละเอียดต่างๆ ในเรื่องมากมาย เช่น สีสันและลวดลายของกิโมโนในเรื่อง ชีวิตของคนในเมืองญี่ปุ่นยุคนั้นว่าทำมาหากินอะไรกัน วัฒนธรรมญี่ปุ่นอย่างการใช้พู่กันเขียนตัวอักษร การชงชา การจัดดอกไม้ โดย <a href=\"https://www.netflix.com/tudum/features/edo-period-japan-guide-blue-eye-samurai\">Netflix มีบทความอธิบายรายละเอียดเรื่องนี้ด้วย</a></p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-behind-scene.webp\" width=\"800\" height=\"728\" srcset=\"https://markpeak.net/wp-content/uploads/2023/11/blue-eye-behind-scene.webp 800w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-behind-scene-300x273.webp 300w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-behind-scene-768x699.webp 768w, https://markpeak.net/wp-content/uploads/2023/11/blue-eye-behind-scene-700x637.webp 700w\" /></p>\n<p>ภาพรวมของ Blue Eye Samurai คือทำออกมาได้ดีกว่าที่คิดไว้มาก (จากตอนแรก ลองดูแบบไม่คิดอะไรมาก) ถ้าให้คะแนนคือ 9/10 ให้เป็นรอง <a href=\"https://markpeak.net/arcane-season-1/\">Arcane</a> นิดนึง โดยหักคะแนนเรื่องพล็อตงงๆ ตอนที่ 5 ย้อนอดีตที่ดูเหมือนจับยัดไปหน่อย และสไตล์งานภาพที่ดูแข็งๆ ไปนิดนึง</p>\n<p>เกร็ดสนุกๆ ระหว่างการดูเรื่องนี้คือ พบว่า Hideo Kojima ก็ดูเรื่องเดียวกัน แล้วแกดูนำหน้าไปนิดหน่อย ทยอยโพสต์ทีละนิด เราก็ต้องรีบไล่ตามดูให้ทันเพื่อให้ได้รู้ว่า Kojima ดูแล้วคิดยังไงบ้าง</p>\n<blockquote>\n<p>Just finished watching all 8 episodes of BLUE EYE SAMURAI! Well, everything is wonderful! Everything is all beautiful! Without a doubt, the best anime of the year! It is a visual work that transcends the common sense of animation!</p>\n<p>The new generation of CG-based animation reached… <a href=\"https://t.co/pQT9eEIkdh\">pic.twitter.com/pQT9eEIkdh</a></p>\n<p>— HIDEO_KOJIMA (@HIDEO_KOJIMA_EN) <a href=\"https://twitter.com/HIDEO_KOJIMA_EN/status/1727666450767462487?ref_src=twsrc%5Etfw\">November 23, 2023</a></p></blockquote>\n<p></p>\n<p>สำหรับคนที่อยากลองดูบ้าง ดูจบแล้วเพิ่งเห็นว่า Netflix นำตอนแรกไปลง YouTube ให้ดูกันฟรีๆ ด้วย</p>\n<p></p>The post <a href=\"https://markpeak.net/blue-eye-samurai/\">Blue Eye Samurai</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"133da07dae8dbd46b28b3e989d6cfdcffabd6bd2114268c59c9315307a06c192","category":"Thai"}