{"title":"My Best of E3 2021","link":"https://markpeak.net/my-best-of-e3-2021/","date":1624700238000,"content":"<p>E3 2021 จบไปหลายสัปดาห์แล้ว ยังย่อยไม่ค่อยหมด มาจดเกมอินดี้ เกมเล็กๆที่คิดว่าน่าสนใจเอาไว้ เผื่อใช้ติดตามผลในอนาคตเมื่อเกมเสร็จแล้ว</p>\n<h2>Replaced</h2>\n<p>มันคือ <a href=\"https://www.blognone.com/node/123242\">Cyberpunk แบบ 2D กราฟิกพิกเซล</a> ที่ทำสวยน่าเล่นมาก อันนี้ให้เป็นท็อปของปีนี้</p>\n<p></p>\n<h2>Sable</h2>\n<p>เกมกราฟิก 3D cellshade ที่เน้นการ “ร่อน” บนเนินทราย คล้ายกับเกม <a href=\"https://markpeak.net/journey/\">Journey</a> แต่มีส่วนของเนื้อเรื่อง การพูดคุยมากกว่า กราฟิกแนวการ์ตูน ชวนให้นึกถึง Nausica and Valley of the Wind</p>\n<p></p>\n<h2>Harold Halibut</h2>\n<p>เกมผจญภัยกราฟิกแนว stop-motion ที่คนสร้างต้องมานั่งขยับทีละเฟรม สุดมาก</p>\n<p></p>\n<h2>Vokabulantis</h2>\n<p>เกมที่อ่านชื่อยากมาก เป็น stop-motion อีกเกม ในคลิปมีเบื้องหลังการสร้างให้ดูด้วย</p>\n<p></p>\n<h2>Behind The Frame</h2>\n<p>เกม เอ่อ เกมวาดรูป ที่ดูกราฟิกแล้วไปหลอกว่าเป็นเกมของ Studio Ghibli ทุกคนก็คงเชื่อ พัฒนาโดยสตูดิโอได้หวัน</p>\n<p></p>\n<h2>Soup Pot</h2>\n<p>ถัดจากเกมวาดรูป มาสู่เกมทำอาหารที่ดูจริงจังมากๆ ควรใช้ชื่อว่า Kitchen Simulator 2021 มากกว่านะ</p>\n<p></p>\n<h2>Death’s Door</h2>\n<p>เกมแอคชั่น isometric คล้ายๆ Bastion แต่เป็นอีกาแทน กราฟิกสวยดี</p>\n<p></p>\n<h2>Atomic Heart</h2>\n<p>เกมนี้หลุดจากความเป็นสตูดิโออินดี้มาพอสมควร เกมเปิดตัวมาสักพักแล้วแต่เพิ่งรู้จัก เป็นเกมสายลับรัสเซียยุค 1955 ในจักรวาลคู่ขนาน (พัฒนาโดยสตูดิโอรัสเซียด้วย) คล้ายๆ กับ No One Lives Forever ผสมกับ BioShock และ Control แต่เป็นเวอร์ชันกาวมากๆ ศัตรูเป็นหุ่นผีที่ดูหลอนๆ เพี้ยนๆ ก็น่าสนใจว่าเกมออกมาแล้วจะ “ไปสุด” แค่ไหน</p>\n<p></p>\n<p></p>\n<h2>Trek to Yomi</h2>\n<p>มันคือ Ghost of Tsushima เวอร์ชัน 2D side-scrolling แต่ใช้กราฟิกขาวดำ สไตล์หนังซามูไรของ Akira Kurosawa ช่างคิดได้</p>\n<p></p>\n<h2>SacriFire</h2>\n<p>เกมอีกแนวที่เห็นเยอะใน E3 รอบนี้คือ เกม JRPG ย้อนยุคเหมือนสมัย Super Famicom ซึ่ง SacriFire เป็นหนึ่งในนั้น กราฟิกแนวๆ Octopath Traveler</p>\n<p></p>\n<h2>Wartales</h2>\n<p>มันคือเกม RPG open world แนวสร้างเมือง มุมมองและกราฟิกคล้ายๆ Age of Empires ส่วนการต่อสู้เป็น turn based ในโลกแฟนตาซีนิดๆ แบบ The Witcher</p>\n<p></p>\n<h2>Lake</h2>\n<p>กลุ่มเกมเน้นเนื้อเรื่องที่มาแรงในช่วงหลัง เหตุการณ์เกิดในปี 1986 เรื่องคือสาวออฟฟิศในเมืองใหญ่ กลับบ้านเกิดบ้านนอก ไปขับรถส่งของอยู่ 2 สัปดาห์ และพบเจอกับเพื่อนเก่า สังคมเก่าๆ เน้นเรื่องความสัมพันธ์</p>\n<p>น่าเล่นในแง่พัฒนาการของเกมสายเนื้อเรื่อง ว่าจะมาเป็นสื่อแขนงใหม่ที่อยู่ตรงกลางระหว่างเกมกับหนังได้แค่ไหนกัน</p>\n<p></p>\n<h2>Somerville</h2>\n<p>เกมเอาตัวรอดในโลกยุคหายนะ โดยหนึ่งในผู้สร้าง Limbo/Inside กราฟิกเป็นแนว isometric 2.5D</p>\n<p></p>\n<h2>The Wandering Village</h2>\n<p>เกมสร้างเมืองอีกเกม แต่เป็นเมืองบนหลังเต่าที่เดินไปเดินมาได้ ช่างคิดได้เนอะ แต่ดูเทรลเลอร์แล้วยังไม่ค่อยเข้าใจว่า การอยู่บนหลังเต่ามันมีผลต่อเกมเพลย์อย่างไร</p>\n<p></p>\n<h2>Loot River</h2>\n<p>เกมแอคชั่นมุมมองด้านบนเหมือน Zelda ภาคแรกๆ แต่เอาแนวคิดของพัซเซิลแบบขยับบล็อคมาใช้ด้วย มันเลยเหมือน Zelda ผสม Tetris ถือว่าไอเดียแปลกใหม่ดี</p>\n<p></p>\n<h2>12 Minutes</h2>\n<p>เกมผจญภัยในห้องเล็กๆ ที่ interact ได้กับทุกสิ่ง และเป็น time loop 12 นาที ต้องใช้ความรู้จาก loop ก่อนหน้าเพื่อเอาตัวรอดใน loop ถัดไปเรื่อยๆ (เหมือนกับเกม Outer Wilds)</p>\n<p></p>\n<p>เกมบางส่วนรู้จักจาก <a href=\"https://www.windowscentral.com/best-games-shown-e3-2021\">Windows Central</a> และ <a href=\"https://www.gamespot.com/videos/23-hidden-gems-you-should-know-about/2300-6455716/\">Gamespot</a></p>The post <a href=\"https://markpeak.net/my-best-of-e3-2021/\">My Best of E3 2021</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"133e325629950c2c01ebf82ee630c9c76592732eb3e4552e16b1bb4a866eee01","category":"Thai"}