{"title":"Topeak JoeBlow Tubi 2Stage floor pump review","link":"https://cyclingtips.com/2021/10/topeak-joeblow-tubi-2stage-floor-pump-review/","date":1633489657000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-13-650x366.jpg\" /></div><h2>Topeak JoeBlow Tubi 2Stage floor pump review</h2><p>\n</p><p>Topeak is no stranger to producing good value and long-lasting bicycle pumps, and its JoeBlow series of floor pumps are found in the sheds, garages, cupboards and cars of many thousands of cyclists around the world. </p>\n\n\n\n<p>Topeak currently sells 26 floor pump models, with the variance between some of them being a bit of a ‘spot the difference’ challenge. One that stands apart is the JoeBlow Tubi 2Stage, a new addition that aims to be a tubeless-friendly pump without obvious compromise and not requiring an air chamber to be pressurised. </p>\n\n\n\n<p>The new Tubi 2Stage pump sets itself apart with two specific features. Firstly, there’s the 2Stage chamber that toggles the pump between being high volume (0-30 psi) and high pressure (30-160 psi) purposes. Secondly, the TubiHead pump head hides a truly ingenious feature for easy tubeless inflation. </p>\n\n\n\n<h2>2Stage inflation</h2>\n\n\n    <div>\n        <div>\n\t\t\t                <h2>Story Highlights</h2>\n\t\t\t\n\t\t\t                <ul>\n\t\t\t\t\t                        <li><strong>What:</strong> A dual chamber floor pump capable of seating a tubeless tyre.</li>\n\t\t\t\t\t                        <li><strong>Price:</strong> US$120 / €120 </li>\n\t\t\t\t\t                        <li><strong>Highs:</strong> Clever Tubi head, quickly seats tubeless tyres, comfortable to use, stable, good build quality.</li>\n\t\t\t\t\t                        <li><strong>Lows:</strong> Valve core removal feature needs long valves to work, gauge is tricky to read at certain pressures, hose could be longer, more moving parts means more parts to wear. </li>\n\t\t\t\t\t                </ul>\n\t\t\t        </div>\n    </div>\n\n\n\n\n<p>The concept of a floor pump that can be switched between high volume and high pressure settings isn’t new, and Topeak themselves have long offered such things. The Taiwanese company’s 2Stage is the latest iteration of this and offers a well-placed switch at the top of the steel pump barrel that changes the pump from using the full barrel for high volume (0-30 psi) purposes, to using a smaller internal tube for high pressure (30-160 psi) needs. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-6-1340x754.jpg\" /><figcaption>Setting ‘1’ for high volume, flip it in either direction to hit ‘2’ for high pressure. </figcaption></figure>\n\n\n\n<p>Topeak quotes a 715 cc volume per stroke in the high volume setting, and a 258 cc volume in the high-pressure setting. Put another way, that high volume setting inflated a 27.5 in (650B) x 47 mm tyre to 30 psi in just 11 strokes. Or it’ll inflate a 29 x 2.2in tyre to 30 psi in 13 strokes. By comparison, high-pressure pumps such as the Birzman Snap-It Apogee and Lezyne CNC Floor drive inflated the same 27.5 tyre in 25 strokes. </p>\n\n\n\n<p>When used in conjunction with removing the valve core (more on this in the next section), this high volume setting has proven to be sufficient to easily seat every tubeless tyre I’ve thrown at it to date, and this includes a couple of worn and loose-fitting mountain bike combinations that I was sure it would fail at. It truly is the first floor pump I’ve used that doesn’t feel like a workout for setting up tubeless. </p>\n\n\n\n<p>One reason why I’m such a fan of an <a href=\"https://cyclingtips.com/2021/07/a-guide-to-air-compressors-for-bicycles/\" target=\"_blank\">air compressor</a> and <a href=\"https://cyclingtips.com/2021/07/review-the-best-bicycle-tyre-inflators-to-use-with-an-air-compressor/\" target=\"_blank\">dedicated bicycle inflators</a> is that it’s a zero sweat experience for setting up tubeless. Tubeless inflator canisters and chamber-equipped floor pumps can do the job impressively well, but they can be quite the effort to fill and almost heartbreaking when they fail to seat a tyre – and I’ve been here far too often. </p>\n\n\n\n<p>On the Tubi 2Stage, just switch to the pump’s second stage (high pressure) and it becomes a wholly different inflation device. In this setting, I pumped a 700 x 25 mm tyre to 80 psi in 24 strokes, whereas those previously mentioned Birzman and Lezyne pumps each did it in a more efficient 19 strokes. That said, the Topeak pump can match this 19 stroke figure by starting in the high volume setting and then switching over to the high-pressure setting once you hit approximately 30 psi. </p>\n\n\n\n<p>The pump features a large dual-compound plastic handle that’s comfortable to hold and at 2.35 kg it’s sturdy enough to load your weight onto. Shorter folk may find the pump’s 74cm length and 126cm fully extended height to be quite tall, but I’m not exactly a giant at 170 cm and found it comfortable. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-5-1-1340x754.jpg\" /><figcaption>The handle offers a large surface area and subtly padded material. It’s supremely comfortable to use. </figcaption></figure>\n\n\n\n<p>Switching between the settings offers a positive click and feel, and while this feature adds complexity to an otherwise simple device, I’m quite confident that it’ll last well. And it’s only a positive that Topeak has a solid reputation for offering low-cost service parts for its pumps.  </p>\n\n\n\n<h2>The new Tubi pump head</h2>\n\n\n\n<p>Obviously, this pump can move a large volume of air in its first stage but the true limitation of that is the small opening of a Presta valve. Removing the valve core is a faithful old trick for seating stubborn tubeless tyres and that’s exactly what the new TubiHead pump head aims to ease. </p>\n\n\n\n<p>Featuring a mix of quality anodised and knurled aluminium and translucent plastic construction, the TubiHead immediately looks different. Designed to simply press onto a Presta valve and stay there with a friction fit and pneumatic pressure, the TubiHead is fast, simple to use and easy to replace the rubber gasket in. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-9-1340x754.jpg\" /><figcaption>The TubiHead. It simply presses onto the valve, while the use of the knurled screw (left of picture) is an optional feature. </figcaption></figure>\n\n\n\n<p>Where the TubiHead separates itself from the flock is that it can remove and re-install a Presta valve core all with the pump head attached and holding air. This is quite a contrast to the usual effort of removing a valve core to seat the tubeless tyre, to then lose the air when re-installing the valve core and then have pump up the tyre again. The TubiHead is the first Presta pump head I know of with this integrated valve core removal feature, but the idea is well proven and utilised in the 4WD world for fast deflating of tyres through Schrader valves. </p>\n\n\n\n<p>To use this feature, simply press the pump head onto the valve, and then slide the valve core remover onto the valve, unwind, and then slide the remover back out with the core in place. The core is retained in the remover with an o-ring. Simply reverse the steps to re-install it. </p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CUWRYI2ByI-/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CUWRYI2ByI-/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Dave Rome (@romeandstuff)</a></p></div></blockquote> \n\n\n\n<p><em>The TubiHead in action. This particular tubeless set-up was slightly fussy, others popped on with a single stroke of the pump. </em></p>\n\n\n\n<p>This valve remover works exactly as intended but only if there’s more than the required minimum exposed valve stem length of 16 mm. If the valve is shorter than this, the valve core remover will bottom out on the pump head before it can unscrew the core. This may sound like it’s only an issue on valves that are already too short, but the 16 mm figure is without the valve nut or valve core, and I have a few wheels set up that fall short. Thankfully the pump head will still inflate these shorter valve lengths without much worry, but you won’t be able to use the TubiHead’s clever valve core removal function.</p>\n\n\n\n<p>Want to just add air to your tyres? Simply open the Presta valve, push the pump head on, and pump. To release, give the pressure release button a quick press and then pull it off. </p>\n\n\n\n<p>Want to inflate a tyre with a Schrader valve? Topeak provides a threaded adapter for just that which then allows the Presta-only head to push on. The adapter works exactly as expected and stores securely in a dedicated holder when not in use. It’s not the very simplest or fastest way to inflate a Schrader valve, but it does work. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-7-1340x754.jpg\" /><figcaption>The Schrader valve adapter is stored within a holder on the hose. </figcaption></figure>\n\n\n\n<p>Attached to the pump via a neat 360-degree swivel, the hose is said to offer an extra-long length for easy reach but at 82 cm in length, I actually think it’s almost too short. It’s not long enough to reach a bike clamped up in a work stand or to let you stand a good distance away from a tubeless tyre that’s about to loudly snap into place. </p>\n\n\n\n<p>It’s worth noting that Topeak also offer the new TubiHead as an upgrade kit for existing pumps. Priced at US$30 / €30<strong>,</strong> the <a href=\"https://www.topeak.com/global/en/products/227-Upgrade-Kits/1394-TUBIHEAD\" target=\"_blank\">TubiHead kit</a> is intended to be a direct fit for Topeak pumps, but it shouldn’t be too difficult to rig it up to others, too. The upgrade kit includes the TubiHead and a generous 117 cm length of attached hose with Topeak’s fittings in place. Topeak provided me a sample of this upgrade kit with the sample pump and the extra length of hose was well welcomed. I do urge Topeak to consider updating the pump with a longer hose length – there’s little downside to it. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-24-1340x754.jpg\" /><figcaption>The TubiHead is also available as an upgrade option for other pumps. </figcaption></figure>\n\n\n\n<h2>A dual scale gauge and other elements</h2>\n\n\n\n<p>Sitting above the well-weighted steel base is a 3 inch large analogue gauge with a somewhat odd dual scale. The gauge offers fine single psi gradients from 0-30 psi, and then splits to a less precise scale after that. I found there was a learning curve to reading the figures, especially in the 30-40 psi range. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-8-1340x754.jpg\" /><figcaption>Yes, reading this gauge takes some getting used to. The adjustable indicator on the bezel (the little gold diamond-shaped object aligned with 30 psi in this photo) will surely come in handy. </figcaption></figure>\n\n\n\n<p>The gauge on my sample proved rather accurate across common pressures – for example, it read 23 psi at an actual 22.5 psi, it read 60 psi at an actual 58 psi and was right on the money for 80 psi. The legibility and graduations on the gauge are really the limitations to achieving specific pressures, not the actual accuracy of the measurement.</p>\n\n\n\n<p>In this sense, this pump is great for achieving fairly precise pressures between 0-30 psi. But above that, you’ll likely only be able to get within a few psi of the exact desired number. Those ultra fussy about their gravel and road pressures will likely want to use a secondary gauge after inflation. </p>\n\n\n\n<p>Personally, I’d welcome a digital gauge version of this pump, but that will inevitably mean a higher price and something that requires batteries. </p>\n\n\n\n<h2>Conclusion </h2>\n\n\n\n<p>I understand this is a lot of words for a floor pump, and it’s because this pump truly impressed me. </p>\n\n\n\n<p>It absolutely isn’t perfect, and I most notably wish the TubiHead would remove the valve cores of shorter valves and that the gauge were easier to decipher. However, beyond that the <a href=\"https://www.topeak.com/global/en/products/41-Floor-Pumps/1368-JOEBLOW-TUBI-2STAGE\" target=\"_blank\">JoeBlow Tubi 2Stage</a> is easy to use, manages to inflate tubeless tyres without a sweat, and does so while still being great as a general floor pump.</p>\n\n\n\n<p>Yes, a separate valve core remover and high volume pump will likely achieve much of what this pump does, and it’s perhaps not a smart purchase if you already have all that. But that doesn’t change the fact that this pump eases and speeds up the process, all while being a joy to use. And while it’s not cheap, the pricing is more than competitive with what the likes of Lezyne and Bontrager sell its tubeless pumps for.  </p>\n\n\n\n<p><em>Not tired of reading about pumps? Be sure to check out my feature on the <a href=\"https://cyclingtips.com/2019/08/the-best-mini-pumps-for-road-gravel-and-mountain-bike-45-tested/\" target=\"_blank\">best mini pumps for road, gravel and mountain bikes</a> – a test I still have nightmares about. And for the old school, there’s my shootout of the <a href=\"https://cyclingtips.com/2019/11/the-best-bicycle-frame-pumps-reviewed/\" target=\"_blank\">best frame pumps</a>. </em></p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-15-1340x754.jpg\" /><figcaption>This new Topeak pump is likely bulkier than your existing floor pump. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-10-1340x754.jpg\" /><figcaption>The base looks small, but its steel construction means the pump isn’t prone to topple. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-1-1340x754.jpg\" /><figcaption>Locked and loaded. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-17-1340x754.jpg\" /><figcaption>The translucent head is designed to let you see when the valve core is removed. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-2-1340x754.jpg\" /><figcaption>Tough to see, but here the valve is removed. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-21-1340x754.jpg\" /><figcaption>The pump head makes use of a commonly available Topeak gasket. These last reasonably well and are cheap to replace. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-22-1340x754.jpg\" /><figcaption>A look inside at the valve core remover feature. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-23-1340x754.jpg\" /><figcaption>This is the threaded end up of the hose where it attaches to the pump. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-20-1340x754.jpg\" /><figcaption>The head attaches to the hose with a somewhat unique fitting. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-14-1340x754.jpg\" /><figcaption>The gauge works well but certainly takes some getting used to. I’d much rather it offered clearer pressure gradients for modern gravel and road tyres. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-11-1340x754.jpg\" /><figcaption>Fancy gold paint covers the pump. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-4-1340x754.jpg\" /><figcaption>Just some instructions. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Topeak-Joeblow-Tubi-2Stage-tubeless-floor-pump-review-cyclingtips-18-1340x754.jpg\" /><figcaption>The TubiHead can be bought separately. </figcaption></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/10/topeak-joeblow-tubi-2stage-floor-pump-review/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"134299d8f291c6dd2c49bc1b8f1a440ee738fa4382ded24fdb4277c0b174aed4","category":"Cycling"}