{"title":"‘The smartest rider in the bunch’ - From Silicon Valley to a Strade-Bianche podium, Kristen Faulkner’s rise to the top","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-smartest-rider-in-the-bunch-from-silicon-valley-to-a-strade-bianche-podium-kristen-faulkner-s-rise-to-the-top","date":1678198827000,"content":"\n      <p><span>Kristen Faulkner has been doing amazing things on a bicycle for a little while now. It all started with her stage win at the Tour of Ardèche in 2020 and the momentum built when she finished in the top-10 at the Tour of Flanders a year later. Two stage wins and the QOM classification at the Giro d’Italia Donne last season was confirmation, if anyone really needed it, that Faulkner is one of the most exciting talents in the women’s peloton at the moment.</span></p>\n<div></div>\n<p><span>But unlike many of her competitors who were born and raised on the cobbles of Belgium, or grew up flying down Alpine descents, or learnt how to ride in a peloton in their teenage years, Faulkner’s rise to the top of the sport has been unique, and this makes her performances in races even more impressive.</span></p>\n<p><span>When she got that first professional victory in the Tour of Ardèche, Faulkner was still working as a venture capitalist, waking up early before stages to get her work done and then spending the afternoon racing her bike. It was the first time she had ever competed in a professional peloton, having only started cycling a few years prior. The Harvard graduate, who secured a BA in Computer Science in 2015, won stage four in the Ardèche by riding away from the peloton on the difficult climb to Mont-Lozère. After the race, she said she didn’t know how long the mountain was, or how the race really worked, but she just did her best effort and was able to take the win.</span></p>\n<p><span>Fast forward two seasons, and last weekend Faulkner was putting pressure on women’s cycling’s de facto super team, SD Worx, at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a> after she made a convincing solo move for victory. The American woman attacked with just under 40 kilometres of the race remaining on the white roads of Tuscany and built up a gap of nearly two minutes. Behind her, the pre-race favourites began to panic as the race reached its later stages, it became clear they had underestimated the gutsy Jayco-Alula rider. Faulkner was riding with war wounds too from an earlier crash in the race, her blood mixing with dust and running down her left thigh. As she powered over the gravel, she’s was vision of strength, bravery and tenacity.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1471164446_1024x1024.jpg?v=1678197319\" alt /><em>Image: Luc Claessen/Getty</em></span></p>\n<p><span>Behind her, Lotte Kopecky and Demi Vollering of SD Worx were chasing hard, but still Faulkner was holding the gap. The duo only caught her in the final 700 metres of the race and Faulkner held on for third place on the podium, her best ever result in a one-day race.</span></p>\n<p><span>Afterwards, headlines around the race focused on the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-shocking-sprint-one-wild-horse-and-trouble-at-team-sd-worx-what-was-going-on-at-strade-bianche-donne\" target=\"_blank\">shocking sprint between Vollering and Kopecky</a>, whereby the two teammates went head-to-head rather than sharing the victory like many expected them to do. Although it might have been overshadowed by her competitor’s inter-team drama, perhaps the most impressive story of the day was Faulkner’s courageous, fearless attack that almost got her the race win herself.</span></p>\n<p><span>“It's pretty dangerous letting a rider like her get away. I think we've seen what she can do. I think everyone underestimated her, because she nearly got the win,” Faulkner’s teammate, Ruby Roseman-Gannon said after the race.</span></p>\n<p><span>Even Anna van der Breggen, the sports director for Team SD Worx, admitted that she and her colleagues were fearful in the team car behind about whether their riders would be able to reel in the Alaskan rider in the final throes of the race. “If just one of our riders was chasing her alone, we wouldn’t have been able to bring her back,” Van der Breggen said. “Kristen was so strong.”</span></p>\n<p><span>Perhaps helped by her history in numbers and her ability to think rationally and calculate risk, Faulkner said after the race that she believes she measured her solo effort well. “I thought it was possible [to stay away] and I just gave it everything I could, the whole time trying to stay calm,” she explained. “I was pushing because it was possible, but also not getting ahead of myself. When they came past me, I was like shit, but at that point, I was completely cramping and I knew that I had given everything I could and they were just stronger in the end.”</span></p>\n<p><span>Faulkner’s attack is even more impressive considering her preparation for Strade Bianche had been last minute, too. “I was actually a reserve for Strade and I begged to do it and I was told no, but then I was put in because someone got sick,” she said. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_0682_1024x1024.jpg?v=1678197344\" alt /></span><em><span>Image: Alex Whitehead/SWpix</span></em></p>\n<p><span>Still, the American utilised the meticulous attention to detail that she has learnt in her previous career to prepare for the race as soon as she was aware she’d be standing on the start line in Siena. “Preparations for this race was a lot of looking at the conditions of the gravel, looking at the climbs, where we would want me to attack and use me for that,” she said. “I knew section five was going to be long but after coming out of section five, I saw that the peloton was actually quite large and there were a lot of support riders still there. I didn't feel like it was the right moment to attack right away. I actually waited until some groups were going between sections five and six. I thought I'll get a head start going into six and see what happens there.”</span></p>\n<p><span>“I knew when I had about 40 seconds, 50 seconds and then about one minute and 40. I could feel my pace starting to decline and I knew that after section six, that was when some of the big riders would start speeding up. I could tell the gravel sector on section seven that my pace was starting to slow, so I knew that the gap was going to go down. Then I heard in the end, they had about 30 seconds and I was like, oh, man, it's going to be a rough final 10k.”</span></p>\n<p><span>Despite eventually being caught by Team SD Worx and not holding on for the victory, Faulkner’s performance was one of the best in her career so far and is a perfect example of how she is a rider who has the mindset to produce these long solo attacks which can be dangerous for her rivals.</span></p>\n<p><span>“Kristen is one of the smartest riders in the bunch, she's a Harvard graduate. I love the intellectual conversations I have with her and I think she has a really analytical approach,” Roseman-Gannon continued after the race. “It's great to learn and work with her.”</span></p>\n<p><span>With Faulkner’s physical ability and the method in which she can dissect and compartmentalise races to make her efforts as efficient as possible, the American woman is certainly one to watch for the remainder of the Classics. She may not have grown up watching bike racing on TV and she may still be a rookie compared to some of her more experienced colleagues, but Faulkner’s career so far and her valiant attack at Strade Bianche is proof that there’s more than one road to the top, and sometimes the path less trodden might take you even higher.</span></p>\n<p><em><span>Cover image: Luc Claessen/Getty</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"6dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"13444f75abfbd63698a6138e50ceadd624fd08b3b7148db5344a63","category":"Cycling"}