{"title":"How to make sure your iPhone favorites can call you (if that’s what you want)","link":"https://www.macworld.com/article/2192667/ios-focus-settings.html","date":1705568400000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s Focus feature is designed to let you shape your interruptions. Do you want to get no calls, FaceTimes, or messages? No alerts from apps? Or would you like to let certain important or particular people and things through to make sure something that should break your concentration appears?</p>\n\n\n\n<p>In particular, you might want to always let a set of people reach you by a voice call on your iPhone. Depending on your age, it may be rare or unheard of to get a phone call—or you may place and receive them all the time. But for most people, a phone call from a select group of people can be something they always want, no matter whether Do Not Disturb, Sleep, or another Focus mode is set.</p>\n\n\n\n<p>Check your Focus settings in iOS or iPadOS to see whether you’ve enabled exceptions or allow them more broadly:</p>\n\n\n\n<ol>\n<li>Go to <em>Settings</em> &gt; <em>Focus</em>.</li>\n\n\n\n<li>Choose a Focus mode; in this example, <em>Do Not Disturb</em>.</li>\n\n\n\n<li>Examine who appears under People. Anyone who is in this list can send you notifications as well as call you.</li>\n\n\n\n<li>Tap the <em>People</em> area. With <em>Allow Notifications From</em>, you can add or remove people from your list.</li>\n\n\n\n<li>Under Phone Calls on an iPhone, the <em>Allow Calls From</em> option lets you choose broadly or narrowly; see below for more on these choices. <em>Favorites</em> is a common choice, as it sweeps in emergency callers as well.</li>\n\n\n\n<li>Tap <em>Back</em> &gt; <em>Focus</em> when done and configure other Focus modes the same way.</li>\n</ol>\n\n\n\n<p>Focus settings in macOS are broadly similar in Sonoma, found in <em> &gt; System Settings &gt; Focus</em>. Choose a Focus mode and then click<em> Allowed People</em> to have the same choices as above.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-focus-modes.png?w=1200\" alt=\"iOS Focus modes\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-focus-modes.png?quality=50&amp;strip=all 2459w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-focus-modes.png?resize=300%2C196&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-focus-modes.png?resize=768%2C502&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-focus-modes.png?resize=1200%2C784&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-focus-modes.png?resize=1536%2C1004&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-focus-modes.png?resize=2048%2C1338&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"784\" /><figcaption><p>Focus modes let you choose people and other settings to override your general sense of quiet.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>The Allow Calls From menu has some very fine distinctions (if you select one, the text below changes to explain who is included):</p>\n\n\n\n<ul>\n<li><strong>Allowed People Only:</strong> This limits incoming phone calls to your Emergency Bypass contacts set in the Contacts and people in the list above.</li>\n\n\n\n<li><strong>Favorites:</strong> This adds anyone marked as a favorite in the Contacts or Phone app.</li>\n\n\n\n<li><strong>Contacts Only:</strong> Only people with a contact card can call you.</li>\n\n\n\n<li><strong>Everybody:</strong> If you truly need to receive all incoming calls while in a Focus mode, choose this option.</li>\n</ul>\n\n\n\n<p>To set an Emergency Bypass or Favorite, you must use iOS or iPadOS: In the Contacts app or in the Phone app’s Contacts view, choose a contact and then tap <em>Add to Emergency Contacts</em> or <em>Add to Favorites</em>.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Laura.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nApple Watch, iOS, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"13491c37c3da5f18bb7f89f46989d2d8b805850d7fa8a033b2989c0143cf4f38","category":"Apple"}