{"title":"Theory-based and evidence-based nursing interventions for the prevention of ICU-acquired weakness in the intensive care unit: A systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308291","date":1726236000000,"content":"<p>by Qin Xu, Jie Tan, Yixuan Wang, Manli Tang</p>\r\nObjectives <p>To synthesise and map the evidence of a theory- and evidence-based nursing intervention for the prevention of ICU-acquired weakness and evaluate its effectiveness in terms of the incidence of ICU-acquired weakness, incidence of delirium, and length of hospital stay.</p> Methods <p>We searched PubMed, CINAHL, MEDLINE, Academic Search Complete, Embase, Scopus, Web of Science and the Cochrane Library from database inception to November 2023. The eligible studies focused on critically ill patients in the intensive care unit, used a theory- and evidence-based nursing intervention, and reported the incidence of ICU-acquired weakness and/or used the Medical Research Council Scale. The methodological quality of the included studies was critically appraised by two authors using the appropriate Joanna Briggs Institute appraisal tool for randomised controlled trials, quasi-experimental studies, and cohort studies. Additionally, the weighted kappa coefficient was used to assess inter-rater agreement of the quality assessment. Data were reported using a narrative synthesis. This systematic review was registered by the International Prospective Register of Systematic Review (PROSPERO; CRD42023477011).</p> Results <p>A total of 5162 studies were initially retrieved, and 9 studies were eventually included after screening. This systematic review revealed that preventive nursing interventions for ICU-acquired weakness mainly include (a) physiotherapy, including neuromuscular electrical stimulation and early rehabilitation, and (b) nutritional support. In addition, (c) airway management, (d) sedation and analgesia management, (e) complication prevention (delirium, stress injury and deep vein thrombosis prevention), and (f) psychological care were also provided. The theories are dominated by goal-oriented theories, and the evidence is mainly the ABCDE bundle in the included studies. The results show that theory- or evidence-based nursing interventions are effective in reducing the incidence of ICU-acquired weakness (or improving the Medical Research Council Scale scores), decreasing the incidence of delirium, shortening the length of hospital stay, and improving patients’ self-care and quality of life.</p> Conclusion <p>Theory- and evidence-based nursing interventions have good results in preventing ICU-acquired weakness in critically ill patients. Current nursing interventions favour a combination of multiple interventions rather than just a single intervention. Therefore, preventive measures for ICU-acquired weakness should be viewed as complex interventions and should be based on theory or evidence. This systematic review is based on a small number of trials. Thus, more high-quality randomised controlled trials are needed to draw definitive conclusions about the impact of theory- and evidence-based nursing interventions on the prevention of ICU-acquired weakness.</p>","author":"Qin Xu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"136ceb189570adbacab2133325bdde14992e9efb1b44c376c8c17e2c1160df46","category":"Interdisciplinary"}