{"title":"Updating forest road networks using single photon LiDAR in northern Forest environments","link":"https://academic.oup.com/forestry/article/97/1/38/7146573?rss=1","date":1682640000000,"content":"<span><div>Abstract</div>Knowledge about the condition and location of forest roads is important for forest management. Coupling accurate forest road information with planning and conservation strategies supports forest resource management. In Canada, spatial data of forestry road networks are available provincially; however, they lack spatial accuracy, and up-to-date information on key attributes such as road width is missing. In this study, we apply a novel approach to update forest road networks and characterize road conditions in Ontario’s Boreal and Great Lakes—St. Lawrence (GLSL) Forest regions. We use airborne laser scanning (ALS), to facilitate the identification of forest roads across densely forested landscapes. We categorized roads into four classes based on driveable width, edge vegetation, as well as surface and edge degradation as derived from high-density Single Photon LiDAR (SPL) data. Using a novel road extraction method, we produced a road probability raster and map road centerlines. We validated road location and attribute information using Global Navigation Satellite System (GNSS) ground truth data in two Ontario forest management units, in the boreal forest and the GLSL. Road segments in some regions have been altered to account for land cover changes, such as flooding or fallen trees. In other situations, the road path may deviate from the planned layout of the road, which is not always followed in the field. Our results highlight inaccuracies in the existing road networks, with 30 per cent of ‘Full access’ roads and 29 per cent of ‘Partial access’ roads being undriveable by standard vehicles and 45 per cent of ‘Status unknown’ roads, which make up 48 per cent of the pre-existing network, being driveable by standard vehicles. Results show that the average positional accuracy of updated road centerlines is 0.4 m, and the average road width error is 2 m. The production of spatially accurate forest road networks and road attribute information is important for characterizing large road networks for which often minimal information is available.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"136f46bfb434be65e6ebeef2a7c4b50c98d4f845ad0da3e226cd1173feacd1c9","category":"Environment"}