{"title":"Factors associated with the ability of adolescent girls and young women (AGYW) in sexual unions to negotiate for safer sex. An analysis of data from the 2018 Zambia Demographic and Health Survey (ZDHS)","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003614","date":1725458400000,"content":"<p>by Teebeny Zulu, Mwiche Musukuma, Choolwe Jacobs, Patrick Musonda</p>\r\n\r\nThe ability of AGYW to negotiate for safer sex is key in the fight against the Human Immunodeficiency Virus (HIV). We determined the prevalence of safer sex negotiation among AGYW in sexual unions aged 15–24 and its associated factors in Zambia. Of 1879 respondents, 78.0% (1466) had the ability to negotiate for safer sex (ANSS). While adjusting for other variables in the model, condom use at last sex with the most recent partner (AOR 4.08, 95% CI 1.74–9.60, p = 0.001), experiencing any sexual violence by husband or partner (AOR 1.74, 95% CI 1.17–2.59, p = 0.006), listening to the radio at least once a week (AOR 2.03, 95% CI 1.32–3.13, p = 0.001), secondary or higher education (AOR1.77, 95% CI 1.04–2.99, p = 0.034), being in the richest wealth quintile (AOR 2.70, 95% CI 1.30–5.60, p = 0.008), and living in Eastern Province (AOR 2.75, 95% CI 1.53–4.93 p = 0.001), Northwestern (AOR 2.31, 95% CI 1.15–4.65, p = 0.019) and Southern (AOR 3.11, 95% CI 1.58–6.09, p = 0.001) was associated with a significant increase in the odds of ANSS among AGYW aged 15–24 years in sexual unions. On the other hand, being in Muchinga province (AOR 0.48, 95% CI 0.28–0.81, p = 0.006) decreased the odds of ANSS. In conclusion, safer sex negotiation is crucial in combating HIV; hence, tailor-made interventions that promote condom use, frequency of listening to health programmes on the radio, education, and wealth acquisition should be implemented to build and sustain safer sex negotiation, particularly among AGYW in sexual unions.","author":"Teebeny Zulu","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"13707cfc469cffe8b034ceaae5fa13b972204ef4cbe2671aba4dc73613b3745e","category":"Environment"}