{"title":"Ecology and conservation under ageing and declining human populations","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14758?af=R","date":1723537742000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/ab849d77-af7a-4e3d-a42b-3c3ba4280ed6/jpe14758-toc-0001-m.png\" alt=\"Ecology and conservation under ageing and declining human populations\" />\n<p>This brief overview demonstrates that population decline, ageing and rural-to-urban migration can have extensive implications for biodiversity and the socio-cultural relationships between people and nature. However, the significance, dynamics and consequences of these processes are still largely overlooked. We believe that these changes warrant specific attention from the research, policy and practice communities, as understanding the outcomes and feedbacks associated with depopulation, ageing populations, loss of culture and tradition and ecological change could aid in designing landscapes and informing management that enhances both human well-being and biodiversity conservation.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nMuch research and media attention has revolved around the environmental impacts of growing global human populations. While the conclusions remain contested, these assessments have largely neglected the ecological and conservation impacts of other key regional processes such as declining populations, ageing demographics and rural-to-urban migration.\n\nThese demographic shifts are increasingly prevalent across many regions of the world, and will have significant direct effects on natural resource management and biodiversity conservation by altering individual consumption patterns, land use, land stewardship and natural disturbances. Given that the scientific foundation around this topic is still developing, we first present an initial examination of some of the key environmental impacts, aiming to elevate awareness and encourage further research in these areas.\n\nBeyond the ecological implications, declining populations, ageing demographics and rural-to-urban migration carry intricate social and cultural consequences that can affect people and nature interactions. Ecological studies that focus on single dimensions of biodiversity or ecosystem responses often overlook these complexities. Demographic changes are likely to be accompanied by shifts in environmental attitudes and connections with nature, all of which will influence our capacity to adapt to or mitigate environmental changes. Finally, environmental policy and practice frameworks are potentially unprepared and their success could be sensitive to these socio-cultural and demographic shifts.\n\n<i>Synthesis and applications</i>: This brief overview demonstrates that population decline, ageing and rural-to-urban migration can have extensive implications for biodiversity and the socio-cultural relationships between people and nature. However, the significance, dynamics and consequences of these processes are still largely overlooked. We believe that these changes warrant specific attention from the research, policy and practice communities, as understanding the outcomes and feedbacks associated with depopulation, ageing populations, loss of culture and tradition and ecological change could aid in designing landscapes and informing management that enhances both human well-being and biodiversity conservation.\n</p>","author":"Lorenzo Marini, \nPéter Batáry, \nRachel Carmenta, \nKevin J. Gaston, \nRowena Gordon, \nCate Macinnis‐Ng, \nAkira S. Mori, \nMartin Nuñez, \nJos Barlow","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"1373ce67d614f222df392afc0ba03c5a4da42efb5c34d7f8db5741fa3f8403d9","category":"Environment"}