{"title":"How to unlock your iPhone with your Apple Watch while wearing a mask","link":"https://www.macworld.com/article/331851/how-to-unlock-apple-watch-wearing-mask-ios-14-5.html","date":1619459529000,"content":"\n<div>\n<section><div></div></section><p>With the release of <a href=\"https://www.macworld.com/article/3605528/ios-14-5-features-release-date-beta-how-to-install.html\">iOS 14.5</a> and watchOS 7.4, Apple has solved one of the most vexing iPhone problems of the past year: the fact that Face ID doesn’t work when wearing a mask. Here’s how to set it up on your phone and watch.</p>\n\n\n\n<h2>Requirements</h2>\n\n\n\n<p>First, you’ll need an iPhone that has Face ID and an Apple Watch. The iPhone must be updated to iOS 14.5 and the Apple Watch must be updated to watchOS 7.4. Furthermore, your Apple Watch must be secured with a passcode, worn on your wrist, and unlocked. It must also be nearby to your iPhone.</p>\n\n\n\n<p>In other words, the requirements for unlocking your iPhone with your Apple Watch are basically the same as unlocking your Mac with it. </p>\n\n\n\n<h2>Enabling Apple Watch unlock</h2>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2021/02/unlock-watch-screen-100875703-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2021/02/unlock-watch-screen-100875703-medium.jpg\" /></a><figcaption><p>Rather than a passcode screen, you may see a very brief notice that your iPhone is unlocking with your Apple Watch.</p>\n</figcaption></figure></div>\n\n\n\n<p>To enable the feature, open the Settings app on your iPhone and tap on <em>Face ID &amp; Passcode</em>. You’ll be asked to enter your iPhone’s passcode. Then scroll down to the <em>Unlock with Apple Watch</em> section and flip the toggle to enable the feature. That’s all there is to it. Now you won’t need to type in a passcode when Face ID recognizes that you’re wearing your a mask.</p>\n\n\n\n<p>Once enabled, it works incredibly well. Your Apple Watch is likely unlocked most of the time it’s on your wrist (by default it will require you to unlock it once when you first put it on, but stay unlocked as long as you don’t remove it). If you try to use Face ID, either at the lock screen or to access a password or something in an app, your iPhone will operate as usual.</p>\n\n\n\n<p>But if Face ID recognizes that you’re wearing a mask, it will immediately unlock with your Apple Watch rather than showing you a screen full of numbers and waiting for your passcode. The screen may briefly notify you that it’s unlocking with your Apple Watch, and you’ll feel a quick double-tap on your wrist from the Apple Watch’s taptic engine. It’s a lot like unlocking your Mac with your Apple Watch.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1380245be299121f006da16bad8b9848fb151c3949b0c9c12c16ce63c0a4d862","category":"Apple"}