{"title":"Eugenol-Rich Essential Oils from Flower Buds and Leaves of Syzygium aromaticum Unveils Antifungal Activity against Candida and Cryptococcus Species","link":"https://www.preprints.org/manuscript/202406.1650/v1","date":1719211479000,"content":"Plants from the Myrtaceae family are well known to contain considerable amounts of volatile compounds, ranging from oxygenated monoterpenes to hydrogenated sesquiterpenes, and others, which exhibit antimicrobial activity. One such plant includes Syzygium aromaticum that has been extensively used to treat a number of disorders, including bacterial and fungal infections. Thus, the scientific validation of the essential oil (EO) of Syzygium aromaticum vis-à-vis Candida and Cryptococcus species is valuable. To this end, the present study sought to investigate the antifungal activity of EO from S. aromaticum (clove) leaves and flower buds against Candida and Cryptococcus species. The antioxidant activity of S. aromaticum’s essential oils is also elucidated. The EO was extracted from fresh leaves and floral buds of S. aromaticum using a Clevenger-type apparatus. The as-prepared essential oils were further evaluated for antifungal activity against Candida and Cryptococcus species using a microdilution method. The phytochemical analysis of the EOs was assessed by gas chromatography/mass spectrometry (GC-MS). Antioxidant activities of the EOs were evaluated using standard methods. As a result, the GC-MS analysis revealed the presence of volatile compounds, such as eugenol (87.08%), β-caryophyllene (6.40%) and acetyleugenol (4.45%) as the major constituents of EO from the flower buds ; and eugenol (90.54%) and β-caryophyllene (24.65%) as the major components of the leaf’s EO. The eugenol-rich essential oils exhibited significant antifungal effects against Candida species (common MIC value: 200 ppm) and Cryptococcus neoformans (MIC value: 50 ppm), as well as antioxidant activity. Overall, essential oils of S. aromaticum demonstrated an-tioxidant and antifungal effects, thus validating the ethnopharmacological use of this plant in the treatment of fungal infections. However, antifungal mechanisms of action, in-depth toxicity and in vivo experiments, and pharmacokinetics are warranted to support the use of this plant in ethnomedicine.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1388f5ed33eb23dcc606b0c6400a7150e3ceefe4a097c7cb41655efdcdc9432f","category":"Interdisciplinary"}