{"title":"Metformin lotion promotes scarless skin tissue formation through AMPK activation, TGF-β1 inhibition, and reduced myofibroblast numbers","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311147","date":1727445600000,"content":"<p>by Jianying Zhang, Kengo Shimozaki, Soichi Hattori, Vasyl Pastukh, Derek Maloney, MaCalus V. Hogan, James H-C. Wang</p>\r\n\r\nScar tissue formation following skin wound healing is a challenging public health problem. Skin regeneration and preventing the formation of scar tissue by currently available commercial products are largely ineffective. This study aimed to test the efficacy of a novel topical metformin lotion (ML) in inhibiting scar tissue formation during skin wound healing in rats and to determine the mechanisms of action involved. A 6% ML was prepared in our laboratory. A skin wound healing model in rats was used. The wounded rats were divided into two groups and treated daily for 10 days as follows: Group 1 received a daily application of 50 mg of control lotion, or 0% ML (totaling 100 mg of lotion per rat), and Group 2 received a daily application of 50 mg of 6% ML (totaling 100 mg of 6% ML per rat). Blood samples from the heart of each rat were analyzed for inflammatory markers, HMGB1 and IL-1β, using ELISA, and immunological and histological analyses were performed on skin tissue sections. ML decreased levels of inflammatory markers HMGB1 and IL-1β in the serum of rats and inhibited the release of HMGB1 from cell nuclei into the skin tissue matrix. Additionally, ML demonstrated anti-fibrotic properties by enhancing AMPK activity, decreasing the expression of TGF-β1, reducing the number of myofibroblasts, decreasing the production of collagen III, and increasing the expression of collagen I. ML promotes the regeneration of high-quality skin during wound healing by reducing scar tissue formation. This effect is mediated through the activation of AMPK, inhibition of TGF-β1, and a decrease in the number of myofibroblasts.","author":"Jianying Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1389b94a1df618c9c67f840ae087235bf25ed0577c80c2b2ffa77892f484b200","category":"Interdisciplinary"}