{"title":"Ubiquitin-driven protein condensation stabilizes clathrin-mediated endocytosis","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae342/7738212?rss=1","date":1724198400000,"content":"<span><div>Abstract</div>Clathrin-mediated endocytosis is an essential cellular pathway that enables signaling and recycling of transmembrane proteins and lipids. During endocytosis, dozens of cytosolic proteins come together at the plasma membrane, assembling into a highly interconnected network that drives endocytic vesicle biogenesis. Recently, multiple groups have reported that early endocytic proteins form flexible condensates, which provide a platform for efficient assembly of endocytic vesicles. Given the importance of this network in the dynamics of endocytosis, how might cells regulate its stability? Many receptors and endocytic proteins are ubiquitylated, while early endocytic proteins such as Eps15 contain ubiquitin-interacting motifs. Therefore, we examined the influence of ubiquitin on the stability of the early endocytic protein network. In vitro, we found that recruitment of small amounts of polyubiquitin dramatically increased the stability of Eps15 condensates, suggesting that ubiquitylation could nucleate endocytic assemblies. In live-cell imaging experiments, a version of Eps15 that lacked the ubiquitin-interacting motif failed to rescue defects in endocytic initiation created by Eps15 knockout. Furthermore, fusion of Eps15 to a deubiquitylase enzyme destabilized nascent endocytic sites within minutes. In both in vitro and live-cell settings, dynamic exchange of Eps15 proteins, a measure of protein network stability, was decreased by Eps15–ubiquitin interactions and increased by loss of ubiquitin. These results collectively suggest that ubiquitylation drives assembly of the flexible protein network responsible for catalyzing endocytic events. More broadly, this work illustrates a biophysical mechanism by which ubiquitylated transmembrane proteins at the plasma membrane could regulate the efficiency of endocytic internalization.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"1399b6524557ff5c0a317ffdb0da633003ca1d6550d54ef1a5d1ced81a66a7fa","category":"Interdisciplinary"}