{"title":"Toward more accurate estimates of carbon emissions from small reservoirs","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12577?af=R","date":1714094618000,"content":"<h2>Abstract</h2>\n<p>Because of their abundance and high emissions rates, small reservoirs (&lt; 0.01 km<sup>2</sup>) can be important emitters of the greenhouse gases carbon dioxide and methane. However, emissions estimates from small reservoirs have lagged those of larger ones, and efforts to characterize small reservoir emissions have largely overlooked variations in emissions pathways, times, and locations. We intensively sampled four small reservoirs in Georgia, USA, during the summer to quantify the contribution and spatiotemporal variability of different emissions pathways (CO<sub>2</sub> and CH<sub>4</sub> diffusion, CH<sub>4</sub> ebullition). We used these data to evaluate the efficiency and accuracy of different sampling schemes. Every emissions pathway was dominant in one reservoir on one sampling day, and excluding ebullition caused misestimation between −89% and −15% of the total flux. Sampling only once daily caused misestimation between −78% and 45%, but sampling twice or just after dawn (07:00 h) reduced error. Sampling four or fewer locations caused misestimation between −85% and 366%, and our results indicated that 6–20 sampling locations may be needed for reasonable accuracy. The floating aquatic macrophyte <i>Wolffia</i> sp. (duckweed) appeared to exert control over emissions variability, and the consequences of not accounting for variability were greater in a duckweed-covered reservoir. Our results indicate that sampling only at 10:00 h (modal sampling time of prior efforts) may lead to the erroneous conclusion that reservoirs with high photosynthetic biomass are CO<sub>2</sub> sinks rather than sources. Improving estimation accuracy by accounting for within-reservoir variation in emissions will facilitate more strategic management of these abundant, anthropogenic ecosystems.</p>","author":"Laura C. Naslund, \nAndrew S. Mehring, \nAmy D. Rosemond, \nSeth J. Wenger","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"139db1afb2fce5866189a4c44ac2f8552cce339e6e3ccb154d2004601b5af635","category":"Environment"}