{"title":"This EV restomod highlights the joys and flaws of the classic MGB","link":"https://arstechnica.com/?p=1973008","date":1696406446000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/OL9_4868-Edit-800x533.jpg\" alt=\"A metallic green MGB drives down an English road\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/OL9_4868-Edit-scaled.jpg\">Enlarge</a> <span>/</span> Mass-produced in the 1960s with a not-very special engine, the MGB is a rather good candidate for an electric conversion. (credit: Frontline Developments)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Electrifying classic sports cars is swiftly becoming big business. Battery-powered 911s, <a href=\"https://arstechnica.com/cars/2023/07/a-great-idea-or-sacrilege-we-test-a-jaguar-e-type-converted-to-ev/\">E-Types</a>, Triumphs, and more have been around for a while, but the humble MGB has thus far been overlooked… until now. UK-based MG specialists Frontline Developments has a rich history of restoring, modifying, and generally sprucing up MGBs, and has decided that now is the time to inject a cleaner, greener heart into what was once a British sportscar staple.</p>\n<p>The MG BEE EV is a neat little thing. Currently in prototype form, it's packing a 40 kWh battery attached to a 114 hp (85 kW) 162 lb ft (220 Nm) Hyper9 motor that sends power to the rear wheels via a five-speed Mazda Miata gearbox. Range is about 140 miles (225 km) if you drive sensibly, and charging takes about five hours. Frontline will build you one as a BEE GT (coupe), or Roadster should you wish to feel the wind in your beard as you roll along.</p>\n<p>Frontline Developments is well known in the MG world. Founded in 1991 by Tim Fenna, it started with gearbox swaps, then widened its business with suspension, brake, and even engine upgrades for customers wanting a little more go. The company offers full restorations, as well as its own special editions from time to time. Its LE50 and Abingdon editions came with beautiful aesthetics, twinned with more modern (and powerful) internal combustion engines. It's launching a V8-powered LE60 alongside the BEE for those who fancy old-school thrills.</p></div><p><a href=\"https://arstechnica.com/?p=1973008#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1973008&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"139e47445df404239202ecd06056cc1d2966486cbd29d46bcb960da10e20d404","category":"Tech"}