{"title":"Apple-Sponsored Study Highlights Success of Small Developers","link":"https://www.macrumors.com/2023/05/11/apple-small-developer-study/","date":1683810000000,"content":"Small developers have seen growing success over the course of the last two years, according to an Apple-commissioned study conducted by economists at Analysis Group. Data shared today highlights the ways the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> has benefited independent ‌App Store‌ developers.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/iOS-App-Store-General-Feature-Clorange.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nBetween 2020 and 2022, the revenue earned by small ‌App Store‌ developers increased 71 percent, and in the U.S. specifically, earnings growth was at 83 percent. Analysis Group defines small developers as those who have fewer than a million annual downloads and who earn up to $1 million per year, and this group accounts for more than 90 percent of developers on the ‌App Store‌.\r<br />\n\r<br />\nAccording to the study, revenue growth for small developers outpaced revenue growth for large developers, with earnings improving across all app categories. The study points out the opportunities provided by the ‌App Store‌, such as tools that help developers reach a worldwide audience. Close to 80 percent of small developers are active on multiple storefronts and earn 40 percent of total app downloads from outside of their home country.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/developer-growth-chart-app-store.jpg\" alt width=\"2142\" height=\"1175\" />\r<br />\nDevelopers have seen success over time, with the study suggesting that many apps earning over $1 million in 2022 started out as apps from small developers. 40 percent of these developers were not on the ‌App Store‌ or had less than $10,000 in earnings five years ago.\r<br />\n\r<br />\nApple has commissioned several ‌App Store‌ studies from Analysis Group as it faces growing pressure to open up iOS to sideloading and alternate app store options. The European Union, for example, is requiring Apple to allow apps to be installed outside of the ‌App Store‌, functionality that Apple is rumored to be <a href=\"https://www.macrumors.com/2023/04/17/app-sideloading-support-coming-ios-17/\">implementing in Europe in iOS 17</a>.\r<br />\n\r<br />\nIn the United States, government officials are <a href=\"https://www.macrumors.com/2022/01/20/senate-panel-sideloading-bill-advances/\">considering legislation</a> that would let developers use non-Apple app stores and alternative in-app payment systems on iOS devices. Apple has been fighting these changes and studies like these from Analysis Group can be used to convince regulators and the public of the benefits of the ‌App Store‌.\r<br />\n\r<br />\nMore information and the full study can be accessed <a href=\"https://www.apple.com/newsroom/\">through the Apple Newsroom</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2023/05/11/apple-small-developer-study/\">Apple-Sponsored Study Highlights Success of Small Developers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-sponsored-study-highlights-success-of-small-developers.2389261/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"13a7dcfe185b3b051e8929e4d201edc16eb607b1aa118ea333e522d108af00b7","category":"Apple"}