{"title":"The Matrix Awakens is 2021’s must-play flex of current-gen console power","link":"https://arstechnica.com/?p=1818922","date":1639108826000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul>\n          <li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/matrix-10-980x551.jpg\" /></div>\n        <p>\n          Virtual Keanu Reeves, rendered in real time on a consumer-grade Xbox Series X in the latest Unreal Engine 5 demo.                      [credit:\n                        <a href=\"https://www.epicgames.com/store/en-US/\">Epic Games</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul>\n  \n<p>2021 is the 25th anniversary of a gaming-related milestone: the <em>Super Mario 64</em> face. This fascinating tech demo (whose creator <a href=\"https://youtu.be/zK66pX5Jw9o?t=1415\">opines about it in a May 2021 interview</a>) is the first thing you see upon booting the N64's signature game, and it was a declaration of the N64's potential 3D prowess, well ahead of the likes of Sony's first PlayStation.</p>\n<p>Modern games rarely come with this sort of useless, whimsical tech demo, and similar tech muscle-flexes on consoles have been rare in the years since the N64's '90s heyday. Tonight, another unbelievable demo joins its ranks: <em>The Matrix Awakens</em>.</p>\n<p>This brand-new Unreal Engine 5 showcase, <a href=\"https://www.unrealengine.com/en-US/wakeup\">now downloadable on Xbox Series X/S and PlayStation 5</a>, is rendered almost entirely in real time on current-gen consoles. What's more, every image in this article was not only captured on my own home Series X but is also, according to Epic Games, rendered in real time. Only a few choice snippets of the demo, now downloadable via Xbox Live and PlayStation Network, consist of premade video footage, which I skipped in favor of the impressive faces, action sequences, and cityscapes that UE5 is apparently equipped to render on the latest home consoles.</p></div><p><a href=\"https://arstechnica.com/?p=1818922#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1818922&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"13b7eb3eed7eaf8ec4742e2299813a97f5402e91680590e33084832003db0fa7","category":"Tech"}