{"title":"Apple’s new iMac sports an M3 chip but no other upgrades","link":"https://www.macworld.com/article/2120769/apples-new-imac-sports-an-m3-chip-but-no-other-upgrades.html","date":1698714650000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple revealed an update to the <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2120769-1-0-0&amp;u=https://www.apple.com/imac\">iMac</a> at its <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2120769-1-0-0&amp;u=https://www.apple.com/apple-events/\">“Scary Fast” event</a> on Monday. The new iMac now features an M3 processor while maintaining the same all-in-one design, accessories, and colors.</p>\n\n\n\n<p>The M3 processor is an upgrade to the M1 that was used in the iMac when it was <a href=\"https://www.macworld.com/article/347534/24-inch-imac-review-apple-design-display-colors-storage-upgradability-price.html\">released in May of 2021</a>. The M3 features 8 CPU cores (4 performance, 4 efficiency), which is the same as with the M1 and M2. The M3 also has a 10-core GPU, which is more than the M1’s 7- and 8-core GPU.</p>\n\n\n\n<p>While the specs for the M3 seem very similar to the M1, the M3 has architectural changes that help boost its performance. The M3 is Apple’s first Mac chip to be made with the 3nm process, which allows for greater transistor density, resulting in improved performance. As far as how M3 performance compares to the M1, Apple touts a 2x increase in overall performance, depending on task and application. Applications like Safari or Excel perform around 30% faster, games should run up to 50% faster, and video and photo editing should be up to twice as fast.</p>\n\n\n\n<p>As for the rest of the M3 iMac specifications, they are similar to its predecessor. The base configurations include 8GB of unified memory and a 256GB SSD, with upgrades to 24GB of memory and 512GB, 1TB, and 2TB SSDs available.</p>\n\n\n\n<p>Apple offers three standard configurations:</p>\n\n\n\n<ul>\n<li><strong>$1,299</strong>: M3 with 8 CPU cores and 8 GPU cores; 8GB unified memory, 256GB SSD; two Thunderbolt ports; Magic Keyboard without Touch ID.</li>\n\n\n\n<li><strong>$1,499</strong>: M3 with 8 CPU cores and 10 GPU cores; 8GB unified memory, 256GB SSD; two Thunderbolt ports and two USB-C ports; gigabit ethernet; Magic Keyboard with Touch ID.</li>\n\n\n\n<li><strong>$1,699</strong>: M3 with 8 CPU cores and 10 GPU cores; 8GB unified memory, 512GB SSD; two Thunderbolt ports and two USB-C ports; gigabit ethernet; Magic Keyboard with Touch ID.</li>\n</ul>\n\n\n\n<p>The M3 iMac is available to order now, with shipments starting on November 7.</p>\n\n\n\n<h2>iMac design and colors</h2>\n\n\n\n<p>The iMac was redesigned with the M1 introduction in 2021, and Apple did not make any changes with the M3 release. Apple offers the all iMacs in Blue, Green, Pink, and Silver; the $1,499 and $1,699 iMacs are also available in Yellow, Orange, and Purple.</p>\n\n\n\n<p>The iMac comes with a Magic Keyboard, Magic Mouse, and/or Magic Trackpad that still have Lightning connectors to charge their built-in batteries. There was speculation before the event that Apple could change these devices to USB-C, as it did with the iPhone 15.</p>\n\n\n\n<p>Apple did not reveal a larger iMac, rumors of which have been making the rounds in the media. The rumors stated that the machine could have a display as large as 32 inches. <a href=\"https://www.macworld.com/article/349270/imac-pro-release-date-display-price.html\">Read about the rumors large iMac</a>.</p>\n\niMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"13b84bca55d68a7c9e6d869310a6675e2d5afc032e00758cfe32348dcb73bf13","category":"Apple"}