{"title":"Clusters from chronic conditions in the Danish adult population","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302535","date":1714485600000,"content":"<p>by Anders Stockmarr, Anne Frølich</p>\r\n\r\nMultimorbidity, the presence of 2 or more chronic conditions in a person at the same time, is an increasing public health concern, which affects individuals through reduced health related quality of life, and society through increased need for healthcare services. Yet the structure of chronic conditions in individuals with multimorbidity, viewed as a population, is largely unmapped. We use algorithmic diagnoses and the K-means algorithm to cluster the entire 2015 Danish multimorbidity population into 5 clusters. The study introduces the concept of rim data as an additional tool for determining the number of clusters. We label the 5 clusters the Allergies, Chronic Heart Conditions, Diabetes, Hypercholesterolemia, and Musculoskeletal and Psychiatric Conditions clusters, and demonstrate that for 99.32% of the population, the cluster allocation can be determined from the diagnoses of 4–5 conditions. Clusters are characterized through most prevalent conditions, absent conditions, over- or under-represented conditions, and co-occurrence of conditions. Clusters are further characterized through socioeconomic variables and healthcare service utilizations. Additionally, geographical variations throughout Denmark are studied at the regional and municipality level. We find that subdivision into municipality levels suggests that the Allergies cluster frequency is positively associated with socioeconomic status, while the subdivision suggests that frequencies for clusters Diabetes and Hypercholesterolemia are negatively correlated with socioeconomic status. We detect no indication of association to socioeconomic status for the Chronic Heart Conditions cluster and the Musculoskeletal and Psychiatric Conditions cluster. Additional spatial variation is revealed, some of which may be related to urban/rural populations. Our work constitutes a step in the process of characterizing multimorbidity populations, leading to increased comprehension of the nature of multimorbidity, and towards potential applications to individual-based care, prevention, the development of clinical guidelines, and population management.","author":"Anders Stockmarr","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"13ca80291e6d91eaeb9e43cc09e80255321f60a4726cce92fbcb39d85fa4d711","category":"Interdisciplinary"}