{"title":"Effects of foliar spraying different sizes of zinc fertilizer on the growth and cadmium accumulation in rice","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13675?af=R","date":1718959827000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Nanotechnology has been widely applied in agricultural science. During the process of reducing metal toxicity and accumulation in rice, nanomaterials exhibit size effects. However, there is limited knowledge regarding these size effects. We aim to explore the impact of fertilizer with various sizes of ZnO nanoparticles (ZnO-NPs) on rice growth and cadmium (Cd) accumulation and to elucidate the potential mechanism of Cd reduction in rice. Foliar applications of different concentrations (0.5 and 2 mmol L<sup>−1</sup>) and different sizes (30 and 300 nm ZnO-NPs) of zinc (Zn) fertilizer (Zn(NO<sub>3</sub>)<sub>2</sub>) were performed to investigate the effects on rice growth, Cd accumulation and subcellular distribution, and the expression of Zn–Cd transport genes.</p>\n<h2>RESULTS</h2>\n<p>The results suggested that all the foliar sprayings can significantly reduce the Cd concentrations in rice grains by 41–61% with the highest reduction in the application of ZnO-NPs with large size and low concentration. This is related to the enhancement of Cd fixation in leaf cell walls and downregulation of Cd transport genes (<i>OsZIP7</i>, <i>OsHMA2</i>, <i>OsHMA3</i>) in stem nodes. Foliar ZnO-NPs applications can increase the Zn concentration in grains by 9–21%. Foliar applications of Zn(NO<sub>3</sub>)<sub>2</sub> and small-sized ZnO-NPs promoted plant growth and rice yield, while the application of large-sized ZnO-NPs significantly reduced rice growth and yield.</p>\n<h2>CONCLUSION</h2>\n<p>The study suggests that the rice yield and Cd reduction are dependent on the size and concentration of foliar spraying and the use of large-sized ZnO-NPs is the most effective strategy when considering both yield and Cd reduction comprehensively. © 2024 Society of Chemical Industry.</p>","author":"Haorui Ma, \nLaiyong You, \nXiu Yi, \nChengcheng Ding, \nJing Zhou, \nJun Zhou","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"13cb0db1acb31312804b52918953c4e8ba80655dc2ffc2868b3281a9a173372c","category":"Environment"}