{"title":"Hydrodynamic Similarity of Different Power Levels and Dynamic Analysis of Ocean Current Converter-Platform Systems with a Novel Pulley-Traction Rope Design under  Typhoon Irregular Wave and Current","link":"https://www.preprints.org/manuscript/202407.1940/v1","date":1721814292000,"content":"In the future, the power of commercial ocean current generators can reach MW level, and the corresponding mooring rope tension is very great. But the power of the ocean current generator in research stage is KW level and it can bear less rope tension. Its main mooring rope adopts a single cable and a single foundation. This paper studies the dynamic response and rope tension of the MW-level ocean current generator mooring system. It is assumed that the commercial MW-level ocean current generator is similar to the research-type KW level, and the similarity law and several dimensionless similar parameters are proposed, including for the turbine and platform the power number, tip speed ratio, hydrodynamic damping and stiffness coefficient and others. Based on these dimensionless similar formula and the known parameters of the researched KW-level convertor, all parameters of the MW-level ocean current generator are derived. In order to overcome the extreme tension of a MW-level mooring system and provide good stability, this paper proposes the pulley-traction rope design to replace the traditional single traction rope design.\nThe static and dynamic mathematical models of this mooring system subjected to typhoon wave impact and current are proposed and analytical solutions are obtained. The study found that the dynamic rope tension of the MW-level system with the traditional single rope system is significantly greater than its fracture strength and the dynamic tension of the pulley- traction rope system. It means that this design can effectively reduce the dynamic rope tensions of the mooring system. Moreover, if the length ratio of rope A to the seabed depth is within a safe range, the maximum rope dynamic tension will be less than the fracture strength.\nIn addition to the MW level, the dynamic response of the 700kW level power generation system under the action of typhoon waves is also studied. It is discovered that the dynamic tension of rope D is the largest. In addition, the dynamic tension of rope D for 700kW system will exceed the original strength of design. However, only the specification of rope D is increased, the new dynamic tension is still close to the original such that the dynamic tension of rope D is significantly less than the adjusted fracture strength and the mooring system becomes safety.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"13cdbb5247ea871ac4a08504bbc7817ac86a5c1928d88312442d2e4b822393f8","category":"Interdisciplinary"}