{"title":"The Variation in the Thermal Low-Pressure Location Index over the Qinghai&ndash;Tibet Plateau and Its Relationship with Summer","link":"https://www.preprints.org/manuscript/202404.0681/v1","date":1712665773000,"content":"Utilizing NCEP/NCAR monthly reanalysis data alongside precipitation observations from 1936 monitoring stations across China spanning from 1966 to 2022, this study establishes a location index for the thermal low-pressure center situated over the Qinghai–Tibet Plateau. Temporal variations in the location index and summer (July) precipitation patterns in China were studied. Over the past six decades, thermal low-pressure centers have been predominantly positioned near 90°E and 32.5°N on the plateau, with their distribution extending from east to west rather than from south to north. The longitudinal and latitudinal position indices exhibit contrasting linear trends, with a positive trend observed during the 1970s and early 21st century and a negative trend in subsequent decades. Mutation analysis highlights pronounced weakening mutations occurring in 1981 and 1973, with the longitudinal index transitioning from an inter-annual cycle of approximately 6-8 years, while the latitudinal index displays quasi-cyclic oscillations of 5 and 8 and 12-14 years. Strong negative correlations are evident between the location indices and precipitation along the southeastern edge of the Qinghai–Tibet Plateau and in Southern China, contrasting with the positive correlations observed in the central-eastern plateau, northwest China, North China, and the Huang-Huai region. The influence of southerly airflow predominates over much of China east of the plateau, while northwest China experiences convergence between northerly and southerly airflow. Higher location indices correspond to weaker surface cold air masses and strengthened Western Pacific Subtropical and South Asian Highs south of the Yangtze River Basin, resulting in significantly reduced rainfall in the southern Yangtze River region and increased rainfall in northwest China.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"13d0aa2f19651666600ad2642dce602ff197438286ddd78cce7d086e074f2657","category":"Interdisciplinary"}