{"title":"Comparison of Coronary Artery Disease Involvement in Patients With or Without Familial History","link":"https://www.preprints.org/manuscript/202405.0799/v1","date":1715579839000,"content":"Introduction: It is demonstrated that both a familial history and genetic risk score are associated with subclinical atherosclerosis and most recently have been shown to each provide independent information for future cardiovascular events that seems additive when both are present. The exact mechanism that is responsible for higher risk of patients with positive familial history is yet unknown. In order to find this relationship in Iranian population because of lack of data, we assessed pattern of CAD involvement in patients with positive familial history and without. \nMethods: This was a cross sectional study that was performed between April 2019 and April 2020 in Imam Rezan and Ghaem Hospitals, Mashhad, Iran. We enrolled all patients with typical chest pain and markedly CAD such as STEMI, non-STEMI, unstable angina, chronic stable angina or sudden cardiac death. Patients’ age were between 18 to 65 years of old. They were divided into 2 groups: patient with familial history of CAD and those without and evaluated for potential risk factors of CAD. \nResults: This study was performed on 300 patients with CAD who underwent coronary angiography. Of these patients, 180 of them had positive familial history and 120 of them were without familial history. One hundred seventy five of participants were male (58.3%) with mean age of 54.2 years old. Multivariate regression analysis of risk factors showed that age (OR: 1.04, P=0.014), gender (OR: 0.564, P=0.035) and hypertension (OR: 1.99, P= 0.008) are significantly different in two groups. Vessel involvement in both groups showed that multi-vessel involvement in patients with positive familial history (49.2%) was higher than in patients without (36.1%). Three vessel disease (OR: 2.55, P=0.013) was significantly higher in patients with previous familial history rather than patients without after adjusting for other risk factors. \nConclusion: In conclusion, we found that a positive familial history of CAD is associated with the severity, morphology (non-calcified and mixed) and extent of coronary atherosclerosis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"13d37a08d2b61f158b6f3da1c668ba06b50dc989eb59422ee57e64e106a5459f","category":"Interdisciplinary"}