{"title":"VMware ยกเลิกการขายไลเซนส์แบบขายขาด มีเฉพาะ Subscription เท่านั้น มีผลทันที","link":"https://www.blognone.com/node/137197","date":1702425707000,"content":"<div><div><div><p>VMware ซึ่ง<a href=\"https://www.blognone.com/node/136904\">ปัจจุบันมี Broadcom เป็นเจ้าของ</a> ประกาศเปลี่ยนรูปแบบการขายไลเซนส์มาเป็นแบบ Subscription ทั้งหมด โดยมีผลตั้งแต่ 11 ธันวาคมเป็นต้นไป จะไม่มีการขายไลเซนส์ของผลิตภัณฑ์ VMware แบบขายขาด (perpetual license) รวมทั้งไม่มีการขายแผนสนับสนุน (support and subscription - SnS) ให้ผลิตภัณฑ์ VMware แบบไลเซนส์ขายขาดอีกต่อไปเช่นกัน ทั้งหมดจะมีเฉพาะแบบ Subscription เท่านั้น</p>\n<p>ส่วนไลเซนส์ขายขาดที่ลูกค้าซื้อไปแล้ว รวมทั้งสัญญา SnS ที่มีอยู่เดิม จะยังสามารถใช้ได้ต่อไปตามข้อตกลงในสัญญา แต่เมื่อระยะเวลาสัญญาหมดลง จะไม่ได้รับการซัพพอร์ตหรือต่ออายุได้อีก นอกจากนี้ VMware จะเริ่มติดต่อลูกค้าเพื่อเสนอทางเลือกเทรดอินไลเซนส์ขายขาดเดิมกับส่วนลดในการเปลี่ยนมาเป็น Subscription ด้วย</p>\n<p>Broadcom อธิบายว่าแนวทางนี้เพื่อทำให้รายละเอียดผลิตภัณฑ์ของ VMware มีความซับซ้อนน้อยลง และเป็นการผลักดันให้ลูกค้ามาใช้ Subscription ทั้งหมด ซึ่งเป็นแนวทางที่ในอุตสาหกรรมนิยมใช้กันมากขึ้น</p>\n<p>VMware ยังประกาศเปลี่ยนแปลงรายละเอียดของ VMware Cloud Foundation โดยโซลูชัน VMware Cloud Foundation ที่เป็นไฮบริดคลาวด์สำหรับลูกค้าองค์กรขนาดใหญ่ ปรับลงราคาลง เพิ่มรายละเอียดการสนับสนุนที่มากขึ้น และเพิ่มโซลูชันใหม่ VMware vSphere Foundation ซึ่งปรับลดรายละเอียดการใช้งานสำหรับองค์กรขนาดกลาง จนถึงลูกค้ารายย่อย</p>\n<p>ที่มา: <a href=\"https://news.vmware.com/company/vmware-by-broadcom-business-transformation\">VMware</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/4ba1ce9e72dc80276b052034c0eb365b.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/vmware\">VMware</a></div><div><a href=\"/topics/broadcom\">Broadcom</a></div><div><a href=\"/topics/enterprise\">Enterprise</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"13df0d22d24b216700c9681143c51629a6bb1b01e4f7e083754ae205cf8a6396","category":"Thai"}