{"title":"Assessment of dietary yeast‐based additives for cultured catfish and tilapia health","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.14008?af=R","date":1724128406000,"content":"<h2>Abstract</h2>\n<p>Channel catfish (<i>Ictalurus punctatus</i>) and Nile tilapia (<i>Oreochromis niloticus</i>) are two aquaculture species of great importance. Intensive production is often hindered by poor growth performance and disease mortality. The aim of this study was to evaluate the potential of a commercial fermented yeast product, DVAQUA, on channel catfish and Nile tilapia growth performance metrics and disease resistance. Channel catfish and Nile tilapia were fed practical diets supplemented with 0%, 0.1% or 0.4% of DVAQUA over approximately 2-month feeding periods in recirculation aquaculture systems. To assess the potential of the postbiotic against common aquaculture pathogens, juvenile catfish were subsequently challenged by immersion with <i>Edwardsiella ictaluri</i> S97-773 or virulent <i>Aeromonas hydrophila</i> ML09-119. Nile tilapia juveniles were challenged by injection with <i>Streptococcus iniae</i> ARS-98-60. Serum lysozyme activity, blood chemistry and growth metrics were measured at the end of the feeding period, but no differences were observed across the different metrics, except for survival. For the pathogen challenges, there were no differences in endpoint mortality for channel catfish with either pathogen (<i>p</i> &gt; .05). In contrast, Nile tilapia survivability to <i>S. iniae</i> infection increased proportionally to the inclusion of DVAQUA (<i>p</i> = .005). Changes to sera lysozyme activity were also noted in the tilapia trial, with a reduction of activity in the fish fed the 0.4% DVAQUA diet compared to the control diet (<i>p</i> = .031). Expression profiles of proinflammatory genes and antibodies were also found to be modulated in channel catfish fed the postbiotic, indicating some degree of protective response. These results suggest that this postbiotic may be beneficial in protecting Nile tilapia against <i>S. iniae</i> infection by influencing immune parameters and additional research is needed to evaluate the potential of this DVAQUA for improving catfish health and disease control.</p>","author":"Guillaume Cacot, \nD. Allen Davis, \nBenjamin R. LaFrentz, \nMark R. Liles, \nIan A. E. Butts, \nCraig A. Shoemaker, \nBenjamin H. Beck, \nMark Farmer, \nTimothy J. Bruce","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"13dfc6fb018ef992eb0fd18ee6ec68cfb178e9a46ebd5eee707b7a4851b7240f","category":"Environment"}