{"title":"PSII-5 Effect of short-term feeding of hemp (Cannabis sativa) on stress biomarkers in weaned beef calves","link":"https://academic.oup.com/jas/article/102/Supplement_3/438/7757406?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Hemp research is growing rapidly due to its health benefits for animals; however, there is little information on its effects on stress. The objective of this study was to determine the effects of hemp supplementation on stress biomarkers in beef calves during weaning. Calves (n = 12) were completely randomized into Control (CC: received commercial concentrates before and after weaning), Treatment 1 (CH: received commercial concentrates before weaning and 25 g of hemp diet after weaning), Treatment 2 (HC: received 25 g hemp diet before weaning and commercial concentrates after weaning) and Treatment 3 (HH: received 25 g hemp diet before and after weaning). The study lasted for 28 d; blood samples were collected at 7-d intervals for enzyme-linked immunosorbent assay. Plasma was analyzed for heat shock protein 90, cortisol, haptoglobin, total antioxidant capacity, and glutathione peroxidase. There was treatment x time interaction in cortisol concentrations, with the (CH) group showing the greatest concentration of cortisol (124.23 ng/mL) in wk 3. There was no significant (<span>P</span> = 0.0675) difference in total antioxidant capacity. There was a treatment x time interaction (<span>P</span> = 0.0009) in glutathione peroxidase concentrations, with the (HH) group showing the greatest concentration of glutathione peroxidase of 46.83 ng/mL in wk 2 and 47.57ng/mL in wk 3. There was no significant (<span>P</span> &lt; 0.05) difference in heat shock protein and haptoglobin. We concluded that hemp supplementation could reduce weaning stress in beef cattle, thereby improving the productivity and performance of beef calves</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"13e1d3d6408b1accb863694b5692a296963bc0f6b417294f5681d41567e0fd10","category":"Environment"}