{"title":"Alteration and Non-formula Elements Uptake of Zircon From Um Ara Granite, South Eastern Desert, Egypt","link":"https://www.preprints.org/manuscript/202407.1284/v1","date":1721117090000,"content":"The Um Ara granites are a suite of granitoid rocks located in the south Eastern Desert of Egypt. The combination of Back Scattered Electron imaging (BSE), X-ray compositional mapping, and the data of the Electron Probe Micro Analyzer (EPMA) has provided valuable insights into the alteration process of zircon in the Um Ara granite. The investigated zircon grains have measurable amount of non-formula elements such as U, Th, Hf, REEs, P, Al, Ca, Fe, and Ti, along with extensive structural features indicative of radiation damage. These characteristics point to significant hydrothermal alteration of the zircon following its initial crystallization. The textural and geochemical evidence suggests the alteration of the Um Ara zircons was driven by coupled dissolution-reprecipitation processes influenced by aqueous fluids. The breakdown of accessory minerals like xenotime, thorite, monazite, and apatite during a major hydrothermal event around 1.8 Ga released the non-formula elements (U, Th, P, Ca, Al, Fe, REEs) that were then incorporated into the zircon structures. Subsequent pluvial periods around 50,000-159,000 years ago may have allowed further uptake of these elements during low-temperature alteration. The shear zones within the Um Ara granites facilitated the mobilization and transport of the non-formula element-bearing fluids, likely as carbonate and fluoride complexes. The temperature regime, with fluids remaining below 300°C, was crucial in preserving the radiation damage features in the zircons despite the extensive chemical changes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"13f2782919ffca705fb5796cd9901ee16ece462de738534ebea0375d88267f94","category":"Interdisciplinary"}