{"title":"Online Determination of State of Charge in Lithium-Ion Batteries: Influence of the State of Health","link":"https://www.preprints.org/manuscript/202406.1131/v1","date":1718615780000,"content":"This paper focuses on determining the State of Charge (SOC) of lithium-ion batteries when operating and the influence the State of Health (SOH) has on SOC determination. The paper studies the effects of the discharge rate on the battery performance and how it modifies the evaluation of the SOC. The article also analyzes the effects of battery aging on the determination of SOC. The online determination of SOC in lithium-ion batteries uses the linear behavior of battery discharge and how the discharge rate modifies the battery voltage slope. The paper develops a simple algorithm that relates the SOC of the battery with the online battery voltage. The proposed measurement method uses a very short controlled discharge at a specific rate that avoids unexpected interferences with the current operation of the battery during charge or discharge. We conducted a simulation process to evaluate the evolution of the SOC in Li-ion batteries for different operating stages. Experimental tests validate the proposed methodology, showing a close agreement between theoretical values and experimental results with 98% accuracy. The paper also deals with the determination of the aging factor in lithium batteries as a critical parameter to calculate the SOC. The method determines the aging factor using specific simulation for this goal. The results are compared to values obtained in an experimental test within high agreement (&gt;93%). The proposed model applies to almost any lithium battery and is validated for a wide range of Battery State of Health, up to 50%, within accurate prediction, higher than 90%.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"13f8063e7178b8d63178ab303088cd8cd9970baaac4aec55b0519d83d6b26606","category":"Interdisciplinary"}