{"title":"Transitioning to a Hydrogen Economy: Exploring the Viability of Adapting Natural Gas Pipelines for Hydrogen Transport Through a Case Study on Compression vs. Looping","link":"https://www.preprints.org/manuscript/202403.1303/v1","date":1711021930000,"content":"The growing importance of hydrogen as an energy carrier in a future decarbonized energy system has led to a surge in its production plans. However, the development of infrastructure for hydrogen delivery, particularly in the hard-to-abate sectors, remains a significant challenge. While the construction of new pipelines entails substantial investment, repurposing existing pipelines offers a cost-effective approach to jump-starting hydrogen networks. Many European countries are exploring the possibility of utilizing their current pipeline infrastructure for hydrogen transport. Yet, a critical aspect requiring extensive research is the expansion planning of these networks to accommodate increased capacity in the future. This study investigates the utilization of existing natural gas pipeline infrastructure for hydrogen transportation as a cost-saving measure. It explores two expansion strategies, namely pipeline looping and compression, for repurposing a segment of a 342 km x 36inch existing pipeline, from the Escravos – Lagos gas pipeline system (ELPS) in Nigeria, for hydrogen transport. Employing the Promax® process simulator tool, the study assesses compliance with the API RP 14E and ASME B31.12 standards for hydrogen and hydrogen-methane blends. Both expansion strategies demonstrate acceptable velocity and pressure drop characteristics for hydrogen blends of up to 40%. Additionally, the increase in hydrogen content leads to heightened compression power requirements until approximately 80% hydrogen in the blends for compression, and a corresponding extension in looping length until around 80% hydrogen in the blend for looping. Moreover, the compression option proves to be more economically viable for all investigated proportions of hydrogen blends for the PS1-PS5 segment of the Escravos – Lagos gas pipeline case study. The percentage price differentials between the two expansion strategies reach as high as 495% for a 20% hydrogen proportion in the blend. This study offers valuable insights into the technical and economic implications of repurposing existing natural gas infrastructure for hydrogen transportation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"14032b3bc5767a6e01465b6e074313c21c032192b7fe72fa6331f3030e5a7b87","category":"Interdisciplinary"}