{"title":"472 Evaluating the effects of acidosis and bacterial concentrations on the development of liver abscesses in beef steers","link":"https://academic.oup.com/jas/article/102/Supplement_3/384/7757418?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>We evaluated the association of diet type, ruminal acidosis bout frequency, and intraruminal bacterial inoculum concentration on liver abscess (LA) development in steers. Beef × dairy steers [n = 40, initial body weight (BW) = 107 ± 11 kg] were assigned randomly to 1 of 5 treatments that included either a high-dose (HD; 1 × 10<sup>9</sup> and 1 × 10<sup>9</sup> CFU/mL) or a low-dose (LD; 1 × 10<sup>6</sup> and 1 × 10<sup>6</sup> CFU/mL) of <span>Fusobacterium necrophorum subsp. necrophorum and Salmonella enterica serovar Lubbock</span>, respectively. Treatments included: NCON = high-forage diet with no intraruminal inoculation; CON+HD = high-forage diet with a single, HD inoculation; 2AD+HD = 2 acidotic diet cycles with a single, HD inoculation; 4AD+3LD = 4 acidotic diet cycles with a series of 3 LD inoculations; and 4AD+HD = 4 acidotic diet cycles with a single, HD inoculation. Individual animal was the experimental unit. Continuous data were analyzed using mixed models, and categorical data were analyzed as binomial proportions with treatment, time, and their interactions as the fixed effects. Hematology was evaluated before harvest on d 21 to evaluate indications of systemic disease. Although no difference was observed in rumenitis among treatments (<span>P</span> = 0.79), steers with LA presented with 8 percentage points greater rumenitis than steers without LA. Steers consuming the high-forage diet also presented with rumenitis. Prevalence of LA was 0, 37.5, 37.5, 50, and 12.5% for NCON, CON+HD, 2AD+HD, 4AD+3LD, and 4AD+HD, respectively (<span>P</span> = 0.68). A key observation of this study was that steers fed a high-forage diet presented with LA when dosed with of <span>F. necrophorum</span> and <span>S. enterica</span>, even in the absence of the acidotic diet.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1405263c8946bc6d885097afa4ce0d2fdf9002617d1172c608981f5b467af059","category":"Environment"}