{"title":"ทีม FF XIV ทำตัวละครเผ่า Viera เพศชายนอกเวลางาน ตามเสียงเรียกร้องของแฟนเกม","link":"https://www.blognone.com/node/123074","date":1623142601000,"content":"<div><div><div><p>Final Fantasy XIV ออกภาคเสริม Shadowbringers เมื่อปี 2019 ให้ผู้เล่นสามารถสร้างตัวละครเผ่าหูกระต่าย Viera และเผ่าสิงโต Hrothgar ได้ แต่เผ่า Viera สร้างได้แค่ตัวละครหญิง ส่วนเผ่า Hrothgar สร้างได้แค่ตัวละครชายเท่านั้น</p>\n<p>เหตุผลในตอนนั้นคืออิงจากตัวละครหญิง Fran ที่เป็นเผ่า Viera ในภาค FFXII (ไม่มีตัวละครเผ่า Viera เพศชายในเกม) ส่วนตัวละคร Kimahri มาจากภาค FFX ที่เป็นเผ่า Hrothgar ก็เป็นเพศชาย และไม่มีตัวละครหญิง การตัดสินใจนี้ทำให้แฟนๆ FFXIV ไม่ค่อยพอใจที่ตัวละครถูกล็อกให้เล่นได้เพศเดียว</p>\n<p>ในตอนนั้น Naoki Yoshida โปรดิวเซอร์เกม FFXIV ระบุว่าไม่น่าจะสร้างอีกเพศให้แล้ว เพราะการสร้างตัวละครเล่นได้ตัวใหม่ในเกมออนไลน์ ต้องมีการทดสอบและปรับปรุงมากมาย ทั้งตรวจเช็คว่าตัวละครอยู่ในเฟรมของคัทซีนหรือไม่ ตรวจสอบเครื่องแต่งกาย อาวุธ ทรงผมต่างๆ การขยับท่าทาง แอนิเมชั่นอีโมต และอื่นๆ ว่าเข้ากันได้หรือไม่ ซึ่งเป็นงานหนักพอสมควร</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/16c9dfdc9227cb7ec76ab86d463141ca.jpg\" /></p>\n<p>แต่ล่าสุด Yoshida เพิ่งให้สัมภาษณ์กับใน <a href=\"https://blog.playstation.com/2021/06/07/final-fantasy-xiv-endwalker-producer-and-director-naoki-yoshida-qa/\">PS Blog</a> ว่าไม่ใช่แค่แฟนๆ ที่ไม่พอใจ เพราะทีมกราฟฟิกของ FFXIV ก็อยากเพิ่มตัวละครอีกเพศเข้ามาให้เช่นกัน โดยเลือกใช้เวลาว่างนอกเวลางานในช่วงกว่าครึ่งปีที่ผ่านมา เพื่อหาวิธีทำให้สำเร็จ</p>\n<p>ทีมงานพบว่ามีเวลาและทรัพยากรพอที่จะเพิ่มตัวละครได้อีกแค่ 1 เพศ สำหรับ 1 เผ่าในภาคเสริม Endwalker ที่กำลังจะออกวันที่ 21 พฤศจิกายนนี้ และถ้าจะรอให้เสร็จทั้งสองเผ่าซึ่งอาจต้องรอถึงเวอร์ชั่น 7.0 เลยทีเดียว คุณ Yoshida เลยตัดสินใจให้ทีมงานปล่อยตัวละคร Viera เพศชายมาก่อน ค่อยสร้าง Hrothgar เพศหญิงตามมาในอนาคต</p>\n<p>Yoshida ไม่ได้ระบุว่าตัวละคร Hrothgar เพศหญิงจะมาเมื่อไร แต่น่าจะเป็นในภาคเสริมถัดไปหลังจาก Endwalker</p>\n<p>ที่มา - <a href=\"https://blog.playstation.com/2021/06/07/final-fantasy-xiv-endwalker-producer-and-director-naoki-yoshida-qa/\">PlayStation Blog</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2e9a8c06877f2aa244b00285ba547a63.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/final-fantasy\">Final Fantasy</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/square-enix\">Square Enix</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1405b39ca747931db90ae0d728f08c2884033dbb9154d0cd9a88b57874d0d72b","category":"Thai"}