{"title":"Assessment of Rural Flood Risk and Factors Influencing Household Flood Risk Perception in the Haut-Bassins Region of Burkina Faso, West Africa","link":"https://www.preprints.org/manuscript/202405.0032/v1","date":1714541487000,"content":"In the past two decades, several floods have affected people and their properties in Burkina Faso, with the unprecedented flooding occurring in Ouagadougou in September 2009. So far, most studies have focused on Ouagadougou and surrounding localities and have paid little attention to other flood-prone regions in Burkina Faso. Specifically, there is a data and knowledge gap about the flood risk in the Haut-Bassins region, which in turn hampers the development of mitigation strategies and risk reduction measures in communities. This study demonstrates how data collected at the household level can be used to understand flood risk and its components at the village level in this data-scarce region. Using an indicator-based method, we analyze both flood risk and flood risk perception at the village level. Moreover, we determine the factors influencing flood risk perception at the household level using an ordered logit model. We find that 12 out of the 14 villages considered, experience high levels of flood risk. The management of runoff from the nearest urban areas and poorly designed civil engineering infrastructures, such as roads, were highlighted by the households as significant factors that increase their vulnerability. Hence, dependencies in space and between urban and rural areas may play a substantial role in modifying risk. The perceived flood risk consistently exceeds the estimated flood risk, with an insignificant positive correlation between both risk indices. Regression results indicate that flood risk perception is mainly influenced by informational and behavioral factors of the households. The findings of this study can provide valuable information to municipal and regional authorities involved in disaster risk management in the study area. Moreover, the method is transferable to other data-scarce regions","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"14235b8c35e321f0e8fcc03ae747c3a43eee6ae1f2ef107dbf2c23194d3a0edc","category":"Interdisciplinary"}