{"title":"Evaluation of the Usability of UAV LiDAR for Analysis of Karst(Doline) Terrain Morphology","link":"https://www.preprints.org/manuscript/202408.1223/v1","date":1723795396000,"content":"Traditional terrain analysis has relied on Digital Topographic Maps produced by national agencies and Digital Elevation Model (DEM) created using Airborne LiDAR. However, these methods have significant drawbacks, including the difficulty in acquiring data at the desired time and precision, as well as high costs. Recently, advancements and miniaturization in LiDAR technology have enabled its integration with Unmanned Aerial Vehicle (UAV), allowing for the collection of highly precise terrain data. This approach combines the advantages of conventional UAV photogrammetry with the flexibility of obtaining data at specific times and locations, facilitating a wider range of studies. Despite these advancements, the application of UAV LiDAR in terrain analysis remains underexplored. This study aims to assess the utility of UAV LiDAR for terrain analysis by focusing on the doline features within karst landscapes. In this study, we analyzed doline terrain using three types of data: 1:5000 scale digital topographic maps provided by the National Geographic Information Institute (NGII) of Korea, Digital Surface Models (DSM) obtained through UAV photogrammetry, and DEM) acquired via UAV LiDAR surveys. The analysis results indicated that UAV LiDAR provided the most precise three-dimensional spatial information for the entire study site, yielding the most detailed analysis outcomes. These findings suggest that UAV LiDAR can be utilized to represent terrain features with greater precision in the future which is expected to be highly useful not only for generating contours but also for conducting more detailed topographic analyses, such as calculating area and slope of the study sites.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"14344a41b3b73dc6f540c7dadc1ae102e7525bf850bbc897fb45c0d432e67a0b","category":"Interdisciplinary"}