{"title":"Strontium and Copper Doped Ceramic Granules in Bone Regeneration-Associated Cellular Processes","link":"https://www.preprints.org/manuscript/202410.1801/v1","date":1729749864000,"content":"Background: Pathological bone fracturing is an escalating problem driven by increasing aging and obesity. Bioceramics, particularly tricalcium-phosphate-based materials (TCP), are renowned for their exceptional biocompatibility, osteoconductivity, and ability to promote biomineralization. In the present study, we designed and characterized TCP porous granules doped with Strontium (Sr) and Copper (Cu). Sr2+ ions were selected as it plays a crucial role in early bone formation, osteogenesis and angiogenesis; Cu2+ ions possesses antibacterial properties. \nMaterials: The synthesized CuSr TCP granules were characterized by X-Ray Diffraction. Cytotoxicity and cell proliferation analyses assays were performed through the Lactate dehydrogenase (LDH) activity and CCK-8 viability tests in rat bone marrow-derived mesenchymal stem cells (BM-MSCs). Hemolytic activity was carried out with human red blood cells (RBCs). Early and late osteogenesis was assessed with alkaline phosphatase (ALP) and Alizarin Red S activity in human osteoblast progenitor cells and rat BM-MSCs. The influence of Sr and Cu-substituted TCP on angiogenesis was investigated in human umbilical vein endothelial cells (HUVECs).\nResults: We have demonstrated that a media enriched with CuSr TCP in concentrations ranging from 0.1 mg/ml to 1 mg/ml was not cytotoxic and did not significantly affect cell proliferation rate motility. Moreover, a concentration of 0.5 mg/ml has shown a 2.5-fold increase in the migration potential of BM-MSCs. We also found that CuSr TCP-enriched media slightly increased early osteogenesis. We also found that Sr and Cu substitutions in TCP particles significantly enhanced the measured angiogenic parameters compared to control and unsubstituted TCP granules.\nConclusion: Our results demonstrate that TCP porous granules doped with Sr and Cu are biocompatible, promote osteodifferentiation and angiogenesis, and could be recommended for further in vivo studies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"143c5df45d28863a4ad7e591d651f30d624bda4cfc2bed6dab574826e16441e5","category":"Interdisciplinary"}