{"title":"PSIII-23 Identifying genes associated with the retinol biosynthesis pathway in corpora lutea of cyclic and pregnant gilts","link":"https://academic.oup.com/jas/article/102/Supplement_3/498/7757777?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Improving reproductive performance (e.g., farrowing rate, litter size, pigs weaned) of commercial sows is crucial for sustainability of swine production. Good nutrition is essential to support high performing reproductive outputs. Vitamin A (retinol) is an essential fat-soluble vitamin with important roles in tissue development and reproduction. Previous studies in porcine luteal cells in vitro have shown that retinoids support corpus luteum (CL) function and stimulate progesterone (P4) secretion. The objective of this study is to identify the expression of genes associated with retinol biosynthesis pathway in CL of cyclic and pregnant gilts. Duroc x Landrace x Yorkshire gilts (n = 37) free of physical, heath, or reproductive-related issues were housed in groups on solid concrete floors with ad libitum water access and fed 2.0 kg/d of a standard gestation diet formulated to meet micronutrient requirements. After breeding, gilts were euthanized and ovariohysterectomized during the preimplantation (d 11; n = 10), implantation (d 15; n = 10), mid gestation (d 60; n = 6), and late gestation (d 00; n = 6) stages of pregnancy, as well as cyclic gilts (d 15 of luteal phase; Cyclic;n = 5). Both ovaries of each gilt were separated from the uteri and CL count was recorded before storing at -80°C. Blood was collected concurrently, centrifuged at 2,500 x g for 25 min at 4°C, and resulting plasma was stored at -20°C. Plasma P4 concentration was quantified using a double-antibody RIA kit per manufacturer instructions. Mean relative expression of CL aldehyde dehydrogenase 1 family member 1A (ALDH1A1) was quantified by RT-qPCR. Statistical analyses for CL number and P4 concentrations were determined by PROC GLM in SAS 9.4 and gene expression comparison by day was determined by one-way ANOVA and Student’s t-test for pairwise comparison in JMP 17.0. There were no differences in CL number (15.7 ± 1.5; <span>P</span> &gt; 0.05) or P4 concentrations (17.3 ± 5.3 ng/mL; <span>P</span> &gt; 0.05) by day of pregnancy or between cyclic and pregnant gilts. The mean relative expression of ALDH1A1 was greater (<span>P</span> &lt; 0.001) between d 11 and Cyclic gilts and between d 11 and all other dys of pregnancy (<span>P</span> &lt; 0.01). However, there were no other statistical significances for ALDH1A1 between day of pregnancy or by pregnancy status (<span>P</span> &gt; 0.05). The greater mean relative expression of ALDH1A1 at D 11 of pregnancy could be evidence that retinoic acid has an important role in the porcine anti-luteolytic mechanism, which occurs around d 11 of pregnancy in pigs, and is crucial for the maintenance of pregnancy. Other genes associated with the retinol pathway like retinol binding protein 2 (RBP2), retinol binding protein 4 (RBP4), lecithin retinol acyltransferase (LRAT), and alcohol dehydrogenase 1C (ADH1C) will be quantified by RT-qPCR to better understand the role of retinol biosynthesis in porcine CL function.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"14401f19f6f986e8a879852654a0e9ada982a640569d70a859281dfdec346399","category":"Environment"}