{"title":"Is the iPhone 15 Pro already dead on arrival?","link":"https://www.macworld.com/article/2019260/iphone-15-16-pro-dead-on-arrival-display-camera-buttons-ultra.html","date":1691145000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>In his regular Medium update this week ahead of <a href=\"https://www.macworld.com/article/2019166/apple-third-quarter-2023-results-iphone-mac-ipad-services-revenue.html\">Apple’s Q3 earnings</a>—which saw a year-over-year decline in iPhone sales—analyst Ming-Chi Kuo casually <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://medium.com/@mingchikuo/apple-8%E6%9C%883%E6%97%A5%E6%B3%95%E8%AA%AA%E5%B0%8Dapple%E8%88%87%E4%BE%9B%E6%87%89%E9%8F%88%E7%9A%84%E8%82%A1%E5%83%B9%E5%BD%B1%E9%9F%BF%E9%A0%90%E8%A6%BD-the-preview-of-how-apples-earnings-report-on-august-3-will-affect-b4620d4f57d1&amp;xcust=1-1-2019260-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">reported</a> that “demand for iPhone 15 is lower than that of iPhone 14.” He doesn’t give a specific reason, but it’s likely that there are several contributing factors, including waning smartphone demand and <a href=\"https://www.macworld.com/article/2010727/you-might-be-paying-a-lot-more-for-the-iphone-15-pro-max.html\">rumored higher prices</a>. Before it even arrives, the iPhone 15 is facing tough headwinds, and if customers on the fence start reading about the iPhone 16, they might climb off it entirely.</p>\n\n\n\n<p>That’s right, rumors for the iPhone 16 are already trickling in, and the first round suggests next year’s device will bring some upgrades that will make it one of the most desirable handsets in years and could spell big trouble for the iPhone 15. Here are five reasons why the iPhone 16 could be a death knell for the iPhone 15 before it even arrives:</p>\n\n\n\n<h2>A better telephoto camera</h2>\n\n\n\n<p>When the <a href=\"https://www.macworld.com/article/1487037/iphone-15-pro-max-ultra-design-display-camera-price-rumors.html\">iPhone 15 Pro Max</a> arrives in the fall, rumors say it will have a feature unlike any other iPhone: a periscope telephoto lens. Reports say it will double the optical zoom capabilities (from 3X to 6X) and likely bring a tremendous leap in digital zoom as well. We’ve seen this on other smartphones, such as Samsung’s <a href=\"https://www.techadvisor.com/article/721149/samsung-galaxy-s20-ultra-review-2.html\" target=\"_blank\">100X Space Zoom</a>, but the iPhone has never had anything close to a powerful telephoto camera.</p>\n\n\n\n<p>However, early reports say the iPhone 15’s telephoto camera is just the first phase of Apple’s zoom plans. Apple will reportedly <a href=\"https://www.macworld.com/article/1999006/iphone-16-pro-max-super-telephoto-periscope-lens-camera-optical-zoom.html\">expand the new telephoto camera</a> to the smaller iPhone 16 Pro next year and increase the focal length to about 300mm, compared to 150mm on the iPhone 15 Pro Max. That would enable far greater optical and digital zoom and put the iPhone 14 Pro Max’s zoom to shame.</p>\n\n\n\n<h2>Larger displays</h2>\n\n\n\n<p>Ever since the iPhone 12, Apple has offered the same two sizes of Pro phone screens: 6.1 inches and 6.7 inches. According to a report from Ross Young, CEO of Display Supply Chain Consultants, who is extremely accurate when it comes to rumors, the iPhone 16 Pro and Pro Max will <a href=\"https://www.macworld.com/article/1919496/iphone-16-pro-larger-display-periscope-camera-buttons.html\">have 6.3-inch and 6.9-inch displays</a>. That might not sound like much of an increase, but even a couple of extra millimeters can make a big difference in daily use—just look at the Apple Watch.</p>\n\n\n<div><figure><img src=\"https://www.idg.se/editorial/980/path/1.745350.1665491828!imageUploader/320216529.jpg?quality=50&amp;strip=all\" alt=\"Iphone 14 Pro och Iphone 14 Pro Max\" loading=\"lazy\" /><figcaption><p>The iPhone 16 Pro and Pro Max are rumored to have the largest screens ever.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Solid-state buttons</h2>\n\n\n\n<p>If you were following the iPhone 15 rumors closely, you’ll remember how it was <a href=\"https://www.macworld.com/article/1665435/iphone-15-pro-solid-state-volume-mute-buttons-why.html\">supposed to have solid-state buttons</a> that used haptic engines to mimic the feel of a press. It’s not just a neat trick; solid-state buttons also allow Apple to add functionality beyond a simple click. Think the MacBook trackpad’s Force Touch feature—but on your iPhone. We’re not sure what that means for the iPhone 16, but after years of development, it’s gotta be worth the wait.</p>\n\n\n\n<h2>An Ultra model</h2>\n\n\n\n<p>When the Apple Watch Ultra arrived last year, it was better than the Series 8 in every way: bigger screen, better features, and longer battery life. Rumor has it that Apple will give the iPhone 16 the same treatment with the launch of the <a href=\"https://www.macworld.com/article/1503167/iphone-15-ultra-pro-max-size-price.html\">iPhone 16 Ultra</a> in 2024. We’re not entirely sure what that will mean for the Pro Max or how Apple will differentiate the new model from the rest of the Pro models—Gurman only said: “Apple could add an even higher-end iPhone above both Pro models”—but it’s certain to be the model everyone wants.</p>\n\n\n\n<h2>Under-display Face ID</h2>\n\n\n\n<p>When Face ID debuted on the iPhone X, Apple also introduced the infamous notch, which transformed into the Dynamic Island on the iPhone 14. But it still takes up a large area of the top of the screen. Rumors say Apple has been working on under-display technology for the Face ID sensors so all that remains is a small circle for the camera. This could arrive with the iPhone 16, which would make it the first iPhone without a notch since the iPhone 8. Add that to the skinnier bezels being introduced this year and you’ve got a phone that’s pretty darn close to 100 percent screen.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"144af91ffdea689a9a8fcae89a077dfb7ba743320454140cc6138acb0f068f2f","category":"Apple"}