{"title":"Business Model and Strategy for Sustainable Lending of State-Owned Banks in Indonesia","link":"https://www.preprints.org/manuscript/202407.0852/v1","date":1720608922000,"content":"Currently, banks are facing challenges in fulfilling the interests of stakeholders, not only from the economic point of view but also from the environmental, social, and governance (ESG) aspects. This is due to the increasing concern for sustainability issues, including in lending activities. Lending activities constitute the largest portion of bank assets and are the largest contributor to bank revenues. Thus, banks need certain business models and strategies to encourage sustainable lending growth. This study aimed to build a sustainable business model and selection of sustainable lending strategies in state-owned banks in In-donesia using a value chain approach. The development of a sustainable business model utilized triple layer business model canvas (TLBMC) is based on the results of previous re-search and sustainability reports data of the three state-owned banks. Formulation of strat-egy selection as key drivers to drive sustainable lending utilized analytical hierarchy pro-cess (AHP) based on expert respondent data collected through questionnaires. This re-search showed that the lending distribution business model at state-owned banks in Indonesia, which was built using the TLBMC framework, can realize sustainability goals in the form of a sustainable lending business model. Furthermore, this sustainable business model can be used as a basis for selecting sustainable strategies. In addition, the AHP results obtained alternative strategies in the form of green loan and micro, small and medium enterprises (MSME) market development and penetration as the key drivers of sustainable lending growth.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"144c41723375397ddfc4b96c94757f95b5276c7f5e794e88861c250f74cc2c28","category":"Interdisciplinary"}