{"title":"Vaccine trial finds a glitch with children in one age range","link":"https://arstechnica.com/?p=1821566","date":1639768571000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1315919379-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1315919379.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/doctor-prepares-to-administer-the-pfizer-biontech-royalty-free-image/1315919379?adppopup=true\">Reshi Irshad / Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Friday, Pfizer and BioNTech announced that their latest vaccine trial was showing some odd results in children within a specific age range. Children in the 2- to 5-year age group didn't produce as strong of an antibody response to the vaccine as older and younger children did. As a result, the trial is being modified to include a third dose of vaccine for participants in this age group.</p>\n<p>The trial was designed to enroll as many as 4,500 children to test the safety and efficacy of the companies' messenger RNA vaccine. It included an early test of how well the vaccine was tolerated in different age groups. Based on these results, the companies went ahead with a two-tiered strategy: children from 5 to 11 years of age got two doses of 10 µg; younger children (down to six months in this trial) received two doses of 3 µg.</p>\n<p>The trial is ongoing, and both the participants and doctors involved remain blinded to the status of the participants. But blood samples were obtained from some participants one month after the second dose and analyzed by a separate group of researchers who were not blinded as to the vaccine/placebo status of the participants. The analysis they performed showed an unexpected pattern.</p></div><p><a href=\"https://arstechnica.com/?p=1821566#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1821566&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"14645762656a60987beb670fbc555aa3ee52ac54c33ae55109f7adf1e2c1ff65","category":"Tech"}