{"title":"Tropical forest succession increases trtaxonomic and functional tree richness but decreases evenness","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13856?af=R","date":1717854512000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Successional changes in functional diversity provide insights into community assembly by indicating how species are filtered into local communities based on their traits. Here, we assess successional changes in taxonomic and functional richness, evenness and redundancy along gradients of climate, soil pH and forest cover.</p>\n<h2>Location</h2>\n<p>Neotropics.</p>\n<h2>Time period</h2>\n<p>Last 0–100 years.</p>\n<h2>Major taxa studied</h2>\n<p>Trees.</p>\n<h2>Methods</h2>\n<p>We used 22 forest chronosequence studies and 676 plots across the Neotropics to analyse successional changes in Hill's taxonomic and functional diversity of trees, and how these successional changes vary with continental-scale gradients in precipitation, soil pH and surrounding forest cover.</p>\n<h2>Results</h2>\n<p>Taxonomic and functional richness and functional redundancy increased, while taxonomic and functional evenness decreased over time. Functional richness and evenness changed strongly when not accounting for taxonomic richness, but changed more weakly after statistically accounting for taxonomic richness, indicating that changes in functional diversity are largely driven by taxonomic richness. Nevertheless, the successional increases in functional richness when correcting for taxonomic richness may indicate that environmental heterogeneity and limiting similarity increase during succession. The taxonomically-independent successional decreases in functional evenness may indicate that stronger filtering and competition select for dominant species with similar trait values, while many rare species and traits are added to the community. Such filtering and competition may also lead to increased functional redundancy. The changes in taxonomically-independent functional diversity varied with resource availability and were stronger in harsh, resource-poor environments, but weak in benign, productive environments. Hence, in resource-poor environments, environmental filtering and facilitation are important, whereas in productive environments, weaker abiotic filtering allows for high initial functional diversity and weak successional changes.</p>\n<h2>Main conclusion</h2>\n<p>We found that taxonomic and functional richness and functional redundancy increased and taxonomic and functional evenness decreased during succession, mainly caused by the increasing number of rare species and traits due to the arrival of new species and due to changing (a)biotic filters.</p>","author":"Masha T. van der Sande, \nLourens Poorter, \nGéraldine Derroire, \nMario Marcos do Espirito Santo, \nMadelon Lohbeck, \nSandra C. Müller, \nRadika Bhaskar, \nMichiel van Breugel, \nJuan Manuel Dupuy‐Rada, \nSandra M. Durán, \nCatarina C. Jakovac, \nHoracio Paz, \nDanaë M. A. Rozendaal, \nPedro Brancalion, \nDylan Craven, \nFrancisco Mora Ardilla, \nJarcilene S. Almeida, \nPatricia Balvanera, \nJustin Becknell, \nBryan Finegan, \nRicardo Gomes César, \nJosé Luis Hernández‐Stefanoni, \nDeborah Kennard, \nSusan G. Letcher, \nErika Marín‐Spiotta, \nRodrigo Muñoz, \nCasandra Reyes‐García, \nLucía Sanaphre‐Villanueva, \nLuis P. Utrera, \nGeraldo Wilson Fernandes, \nFrancisco S. Álvarez, \nJose Luis Andrade, \nFelipe Arreola, \nVanessa Boukili, \nGeorge A. L. Cabral, \nJerome Chave, \nRobin Chazdon, \nGabriel Colletta, \nMaria das Dores Magalhães Veloso, \nBen de Jong, \nEdwin Lebrija‐Trejos, \nVanessa de Souza Moreno, \nDaisy H. Dent, \nSaara DeWalt, \nElisa Díaz García, \nYule Roberta Ferreira Nunes, \nVanessa Granda, \nJefferson Hall, \nRodney Lobo, \nOmar Lopez, \nMiguel Martínez Ramos, \nJorge A. Meave, \nSusana Ochoa‐Gaona, \nEverardo V. S. B. Sampaio, \nArturo Sanchez‐Azofeifa, \nHeitor Mancini Teixeira, \nMarisol Toledo, \nMaria Uriarte, \nS. Joseph Wright, \nKátia Zanini, \nFrans Bongers","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"1465f3a44f6d6c24f91d9e74da74718fb0cfa7872533fc08310968fb274e6215","category":"Environment"}