{"title":"MOOTS DEALER SPOTLIGHT– BICYCLE SPORT","link":"https://moots.com/moots-dealer-spotlight-bicycle-sport/","date":1616622118000,"content":"<p>Our featured dealer this month is Charlotte, North Carolina’s Bicycle Sport; one of the best-loved Moots dealers<span></span> in the Southeast. What kind of riding are you in to? In any direction from this iconic shop and you’ll find gravel, world-class trails, and ribbons of asphalt that’ll take you to the mountains or the sea. We know you’re jealous now!<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_2589.jpg\" /></p>\n<p>From their corner shop in Charlotte’s historic Myers Park neighborhood, Bicycle Sport has catered to passionate cyclists since 1983. The transition to current owner Ben Cooley was a smooth one, since he’d worked at the shop prior to purchasing it nearly a decade ago.<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_2597.jpg\" /></p>\n<p>The pandemic and ensuing shut-downs put new emphasis on the importance of bike shops as essential services, Bicycle Sport has always played a part in shaping the local cycling scene. Along with sponsoring events, teams, shop rides, and fundraisers, Cooley and partners also helped co-found Charlotte’s “Learn to Ride” program.<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_2592.jpg\" /></p>\n<p>While we all love new bike day, being able to put a customer on a “dream bike” like a Moots is a special experience for Ben and the team at Bicycle Sport.<span> </span></p>\n<p>“We know this isn’t an everyday thing for most cyclists,” adds Cooley. “Every little detail matters, and we want to make their Moots be everything they expect it should be.” <span> </span></p>\n<p>As the shop’s owner, Cooley has plenty of bikes to choose from. But it’s his own Moots Routt that sees the bulk of the mileage along his favorite rides in the western North Carolina high country.<span> </span></p>\n<p> </p>\n<p>The post <a href=\"https://moots.com/moots-dealer-spotlight-bicycle-sport/\">MOOTS DEALER SPOTLIGHT– BICYCLE SPORT</a> appeared first on <a href=\"https://moots.com\">Moots</a>.</p>","author":"Jon Cariveau","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"1473bf5c7daca28b41154084eb2614a158b38fadaaa5b9e6d39822eb6720326a","category":"Cycling"}