{"title":"Twitter to Stop Unverified Accounts From Appearing in Recommended Tweets [Updated]","link":"https://www.macrumors.com/2023/03/28/twitter-to-stop-recommending-unverified-accounts/","date":1680000218000,"content":"Twitter will prevent posts from unverified accounts from appearing in its \"For You\" algorithmic feed starting Saturday, April 15, CEO Elon Musk announced on Tuesday. The new policy means that only posts originating from paid-for Twitter Blue accounts will be included in the platform's stream of recommended tweets. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/03/Twitter-Feature.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nIn a <a href=\"https://twitter.com/elonmusk/status/1640502698549075972?s=20\">post</a> announcing the impending change, Musk said the decision to no longer recommend tweets from accounts that don't have a blue verified badge was \"the only realistic way to address advanced AI bot swarms taking over.\"\r<br />\n\r<br />\nIn the same tweet, Musk revealed that the ability to vote in polls on the social media platform would also require verification for the same reason. \"It is otherwise a hopeless losing battle,\" claimed the Twitter chief.\r<br />\n\r<br />\nIn an earlier post, Musk said that paid verification significantly increases the cost of using bots and makes it easier to identify them.\r<br />\n\r<br />\nTwitter relaunched its Twitter Blue subscription option in December after the initial launch saw accounts with blue checkmarks being used to impersonate businesses, celebrities, and other high-profile individuals. The only requirement to get a blue checkmark was to spend $8 (or $11 if subscribing from the iOS app).\r<br />\n\r<br />\nTo prevent impersonations, Twitter Blue subscribers now receive a blue checkmark next to their name only after they verify their phone number and their account has been reviewed. \r<br />\n\r<br />\n<div><blockquote><p>Starting April 15th, only verified accounts will be eligible to be in For You recommendations.<br /><br />The is the only realistic way to address advanced AI bot swarms taking over. It is otherwise a hopeless losing battle.<br /><br />Voting in polls will require verification for same reason.</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1640502698549075972?ref_src=twsrc%5Etfw\">March 27, 2023</a></blockquote> </div>\r<br />\nSubscribers who change their username, display name, or profile photo, temporarily lose the blue checkmark until their account is reviewed again. However, Twitter does not ask for any form of official identification to verify ownership at any point in the sign-up process, which some users argue calls into question Musk's logic for blocking unverified accounts from its \"For You\" tab.\r<br />\n\r<br />\nTwitter last week also said that it would begin to wind down its \"legacy\" verified program and remove \"legacy verified\" blue badges on April 1. \r<br />\n\r<br />\nTwitter Blue has become a tentpole policy of the platform as Musk seeks to find new ways to generate revenue. Since the Tesla CEO took over, the market price of the company is said to have tanked. According to a <a href=\"https://www.nytimes.com/2023/03/26/technology/elon-musk-twitter-value.html\"><em>New York Times</em></a> report, last week Musk told employees in an email memo that Twitter is now valued at $20 billion, which is less than half of the $44 billion that Musk paid for the company last year.\r<br />\n\r<br />\nUpdate: The Twitter chief appears to have backtracked on his new paid-for \"For You\" policy following a user backlash – Musk <a href=\"https://twitter.com/elonmusk/status/1640800519894736896\">tweeted</a> later in the day: \"Forgot to mention that accounts you follow directly will also be in For You, since you have explicitly asked for them.\"<div>Tag: <a href=\"https://www.macrumors.com/guide/twitter/\">Twitter</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/28/twitter-to-stop-recommending-unverified-accounts/\">Twitter to Stop Unverified Accounts From Appearing in Recommended Tweets [Updated]</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/twitter-to-stop-unverified-accounts-from-appearing-in-recommended-tweets-updated.2385056/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"147479e63c2fe3e291a7ce3f3a8a83dea4dcc375f7d4b71b6ad8c0d68829d0ac","category":"Apple"}