{"title":"Tracking worldwide interest in sustainable development goals using culturomics","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000070","date":1688133600000,"content":"<p>by Ricardo A. Correia, Enrico Di Minin</p>\r\n\r\nThe lack of robust and timely data continues to be a limiting factor in the capacity to monitor progress towards the United Nations Sustainable Development Goals (SDGs). Developing indicators based on big data has been proposed as a suitable approach to overcome this challenge but such developments have largely focused on earth observation data. Digital data representing aspects of human behaviour, such as information-seeking behaviour, hold great potential to monitor interest and engagement with sustainability topics. Using worldwide data from online searches carried out through Google’s search engine, we explore how interest in the seventeen SDGs has changed over time since the goals were first proposed and assess how the COVID-19 pandemic affected these dynamics. Our results suggest a growing trend for searches related to the SDGs since they came into place in 2016. Interest was mostly directed at social and economic-related goals in the first years, but increasing interest in environmental goals has greatly increased in the last years. The onset of the COVID-19 pandemic caused significant disruptions in internet searches for the SDGS, but interest has recovered since then and continues to grow. Searches for the different SDGs are also more frequently connected following the pandemic, possibly indicating a growing awareness of the inter-related nature of sustainability goals. While further progress is needed to captivate broader engagement with the SDGs, our analysis suggests some progress has been achieved and highlights the potential of digital data to improve our understanding of public interest and engagement with sustainability topics. To materialize this potential, we outline specific areas where digital data can enhance capacity to monitor and shape sustainability progress.","author":"Ricardo A. Correia","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"147be80d08e57b8dd62d081a10dccc3fa8dde38cdd663853b3b8e724100830a2","category":"Environment"}