{"title":"Olympic gold medalist Marty Nothstein arrested and charged with stalking","link":"https://cyclingtips.com/2021/12/olympic-gold-medalist-marty-nothstein-arrested-and-charged-with-stalking/","date":1639082726000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/nothstein1-650x472.jpg\" /></div><h2>Olympic gold medalist Marty Nothstein arrested and charged with stalking</h2><p>\n</p><p>Marty Nothstein, a three-time world champion on the track who won a gold medal in the sprint at the 2000 Olympics in Sydney, was arrested on Tuesday and charged with two counts of stalking, one count of criminal trespass, and one count of defiant trespass, according to <a href=\"https://wlvr.org/2021/12/olympic-gold-medalist-and-ex-lehigh-county-commissioner-marty-nothstein-charged-with-stalking/\" target=\"_blank\">WLVR</a>.</p>\n\n\n\n<p>As the <a href=\"https://www.mcall.com/news/breaking/mc-nws-pa-marty-nothstein-charged-stalking-20211208-j5zmnw5ovveupl2vfngo3i2dai-story.html\" target=\"_blank\">Allentown Morning Call</a> reports, the victims are a woman with whom Nothstein had previously been in a relationship and a man with whom she is currently in a relationship.</p>\n\n\n\n<p>The criminal complaint against Nothstein includes accusations that he sent threatening messages, that he entered the female victim’s home and tried to access her Apple account, that he smashed a window and scratched the doors of the male victim’s car, and that he sent letters claiming that the male victim, a teacher, was having inappropriate relationships with students, among other allegations.</p>\n\n\n\n<p>The female victim reportedly recorded a conversation in which a person identified as Nothstein admitted to his involvement in several of the alleged incidents.</p>\n\n\n\n<p>Nothstein was arraigned and then released on $25,000 bail.</p>\n\n\n\n<p>Nothstein took world championship wins in the keirin and the sprint in 1994 and in the keirin in 1996. He won a silver medal in the sprint that same year at the Atlanta Olympics, and then won a gold medal in the sprint four years later in Sydney.</p>\n\n\n\n<p>In 2017, Nothstein became the executive director of the Valley Preferred Cycling Center in Trexlertown, Pennsylvania. In 2018, he unsuccessfully ran for election in Pennsylvania’s 7th congressional district. He was terminated from his position at the Valley Preferred Cycling Center that same year following allegations of sexual misconduct.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/olympic-gold-medalist-marty-nothstein-arrested-and-charged-with-stalking/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1494ca9c23d336db63b257bbe1962e7031e4824483998e1b4b7b141188c8f8d6","category":"Cycling"}