{"title":"Duckling survival increased with availability of flooded wetland habitat and decreased with salinity concentrations in a brackish marsh","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duae017/7754281?rss=1","date":1715558400000,"content":"<span><div>Abstract</div>Waterfowl population recruitment is sensitive to duckling survival. We quantified predator types and survival rates for <span>Anas platyrhynchos</span> (Mallard) and <span>Mareca strepera</span> (Gadwall) ducklings in one of the largest brackish water marshes in western North America (Suisun Marsh, California) using 556 radio-tagged ducklings from 284 broods tracked during the 2016 to 2019 breeding seasons. Overall, 78% of ducklings died and 84% of mortalities occurred &lt; 7 days after hatch. After hatching in upland fields, survival was greater for broods that hatched closer to flooded wetlands; broods had a ≥ 75% chance of surviving the move from the nest to water when nests were located ≤ 140 m from the nearest wetland and ≤ 50% chance of surviving when nests were located ≥ 970 m from the nearest wetland. Predation accounted for 91% of mortalities and was attributed to mammals (27.6%), birds (22.0%), snakes (4.4%), and unknown predators (46.0%). <span>Anas platyrhynchos</span> survival to fledging (54 days) was only 3.2% and 0.9% during 2 drier years and 11.7% and 16.7% during 2 wetter years. <span>Mareca strepera</span> survival to fledging was 9.4% to 11.2% among years. Daily survival rates for ducklings generally increased with the amount of flooded wetlands within 0.5 km (<span>A. platyrhynchos</span>) and 1.0 km (<span>M. strepera</span>) of the nest at hatch. Additionally, survival rates increased with duckling age and body mass at hatch for both species and decreased with hatch date for <span>A. platyrhynchos</span> but not <span>M. strepera</span>, which may be partially due to the earlier onset of <span>A. platyrhynchos</span> nesting. For ducklings that survived the initial move to water, survival rates were negatively correlated with salinity and this effect was more pronounced for younger ducklings. <span>Anas platyrhynchos</span> survival to 7 days post hatch decreased by 9.1% (wetter year) to 31.4% (drier year) when ducklings were in 12 ppt water (99th quantile of cumulative salinity concentrations experienced by ducklings) versus 0.5 ppt water. <span>Mareca strepera</span> survival to 7 days decreased by 7.4% when ducklings were in 12 ppt vs. 0.5 ppt water. Our results suggest that maintaining a network of low salinity wetlands within 1 km of upland nesting sites would likely improve duckling survival rates, especially during the critical 7-day period after hatch.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"149503b65fbbfeb056b5b60c87b48c2b6ce26fb265467085428c662281fb92c4","category":"Environment"}