{"title":"How To Become A Better Speaker At Conferences","link":"https://smashingmagazine.com/2023/07/become-better-speaker-conferences/","date":1689058800000,"content":"<p>During my time curating the <a href=\"https://uxlondon.com/\"><em>UX London</em></a> and <a href=\"https://leadingdesign.com/conferences\"><em>Leading Design</em></a> events, I used to watch a few hundred presentations each year. I’d be looking at a range of things, including the speaker’s domain experience and credibility, their stage presence and ability to tell a good story, and whether their topic resonated with the current industry zeitgeist. </p>\n<p>When you watch that many presentations, you start to notice patterns that can either contribute to an absolutely amazing talk or leave an audience feeling restless and disengaged. But before you even start worrying about a delivery, you need to <strong>secure yourself a spot on the stage</strong>. How? Follow me along, and let’s find out!</p>\nChoosing What To Speak About\n<p>I think one of the biggest misunderstandings people have about public speaking is the belief that you need to come up with a <em>totally new</em> and <em>unique</em> concept — one that nobody has spoken about before. As such, potentially amazing speakers will self-limit because they don’t have “something new to share.” While discovering a brand new concept at a conference is always great, I can literally count the number of times this has happened to me on the one hand. This isn’t because people aren’t constantly exploring new approaches. </p>\n<p>However, in our heavily connected world, <strong>ideas tend to spread faster than a typical conference planning cycle</strong>, and the type of people who attend conferences are likely to be taped into the industry zeitgeist already. So even if the curator does find somebody with a groundbreaking new idea, by the time they finally get on stage, they’ve likely already tweeted about it, blogged about it, and potentially spoken about it at several other events. </p>\n<p><img src=\"https://files.smashing.media/articles/become-better-speaker-conferences/1-audience-dconstruct-conference.jpg\" /></p>\n<p>I think the need to create something unique comes from an understandable sense of insecurity.</p>\n<blockquote>“Why would anybody want to listen to me unless I have something groundbreaking to share?”</blockquote>\n\n<p>The answer is actually more mundane than you might think. It’s the <em>personal filter</em> you bring to the topic that counts. Let’s say you want to do a talk about <a href=\"https://www.whatmatters.com/faqs/okr-meaning-definition-example\"> OKR’s</a> (Objectives and Key Results) or <a href=\"https://www.usability.gov/how-to-and-tools/methods/usability-testing.html\">Usability Testing</a> — two topics which you might imagine have been “talked to death” over the years.</p>\n<p>However, <strong>people don’t know the specific way you tackled these subjects</strong>, the challenges you personally faced, and the roadblocks you overcame. There’s a good chance that people in your audience will already have some awareness of these techniques. Still, there’s also a good chance that they’ve been facing their <em>own challenges</em> and want nothing more than to hear how you navigate your way around them, hopefully in an interesting and engaging manner. </p>\n<p>Also, let’s not forget that there are <strong>new people entering our industry every day</strong>. There are so many techniques I’ve made the mistake of taking for granted, only to realize that the people I’m talking to have not only never practiced them before but might not have even come across them; or if they have, they might have only the scantest knowledge about them, gleaned from social media and a couple of poorly written opinion pieces. </p>\n<p>In fact, I think our industry is starting to atrophy as techniques we once thought were core ten years ago barely get a mention these days. So just because you think a subject is obvious doesn’t mean everybody feels the same, and there isn’t room for new voices or perspectives on the subject.</p>\n<p>Another easy way to break into public speaking is to do some kind of <strong>case study</strong>. So think about an interesting project you did recently. What techniques did you use, what approach did you take, what problems did you encounter, and how did you go about solving them? The main benefit of a case study type talk is that you’ll know the subject extremely well, which also helps with the nerves (more on this later).</p>\n<p>During the past few years, there were published <a href=\"https://www.smashingmagazine.com/category/case-studies/\">many excellent, very detailed case studies</a> on Smashing Magazine — take a look at this list for some inspiration.</p>\n\n\n\nInvest The Right Amount of Time Doing Prep\n<p>Another thing people get wrong about public speaking is feeling the need to write a new talk every time. This also comes from insecurity (and maybe a little bit of ego as well). We feel like once our talk is out in the world, everybody will have seen it. However, the sad reality is that the vast majority of people won’t be rushing to view your talk when the video comes online, and even if they do, there’s a good chance they’ll only have taken in a fraction of what you said if they remember any of it at all.</p>\n<p><img src=\"https://files.smashing.media/articles/become-better-speaker-conferences/2-margaret-lee-leading-design-talk.jpg\" /></p>\n<p>It’s also worth noting that <strong>talks are super context-sensitive</strong>. I remember watching a talk from former Adaptive Path founder Jeff Veen at least five times. I enjoyed every single outing because while the talk hadn’t changed, I had. I was in a different place in my career, having different conversations and struggling with different things. As such, the talk sparked whole new trains of thought, as well as reminded me of things I knew but had forgotten.</p>\n<p>It should be mentioned that, like music or stand-up comedy, <strong>talks get better with practice</strong>. I generally find that it takes me three or four outings before the talk I’m giving really hits its stride. Only then have I learnt which parts resonate with the audience and which parts need more work; how to improve the structure and cadence, moving sections around for a better flow, and I’ve learnt the bits which people find funny (some international and some not), and how to use pacing and space to make the key ideas land. If you only give a talk once, you’ll be missing out on all this useful feedback and delivering something that’s, at best, 60% of what it could potentially be.</p>\n<p>On a practical level, a 45-minute talk can take a <strong>surprisingly long time to put together</strong>. I reckon it takes me at least an hour of preparation for every minute of content. That’s at least a week’s worth of work, so throwing that away after a single outing is a huge waste. Of course, that’s not what people do. If the talk is largely disposable, they’ll put a lot less effort in, often writing their talk “the night before the event.”</p>\n<p>Unless you’re some sort of wunderkind, this will result in a mediocre talk, a mediocre performance, and a low chance of being asked to come back and speak again. Sadly this is one of the reasons we see a lot of the same faces on the speaker circuit. They’re the ones who put the effort in, deliver a good performance, and are rewarded with more invites. Fortunately, the quality bar at most conferences is so low that putting a little extra time into your prep can pay plenty of dividends.</p>\nNailing The Delivery\n<p>As well as 45 minutes being a lot of content to create, it’s also a lot of content to sit through. No matter how interesting the subject is, a monotone delivery will make it very hard for your audience to stay engaged. As such, <strong>nailing the delivery is key</strong>. One way to do this is to see public speaking for what it is — a performance — and as the performer, you have a number of tools at your disposal.</p>\n<p>First of all, you can <strong>use your voice as an instrument</strong> and try varying things like speed, pitch, and volume. Want to get people excited? Use a fast and excitable tone. Want people to lean in and pay attention? Slow down and speak quietly. Varying the way you speak gives your talks texture and can help you hold people’s attention for longer. </p>\n<p>Another thing you can use is the <strong>physical space</strong>. While most people (including myself) feel safe and comfortable behind the lectern, the best speakers use the entire stage to good effect, walking to the front of the stage to address the audience in a more human way or using different sides of the stage to indicate different timelines or parts of a conversation.</p>\n<p><img src=\"https://files.smashing.media/articles/become-better-speaker-conferences/3-scott-belsky-ux-london.jpg\" /></p>\n<p>Storytelling is an art, so consider starting your talk in a way that grabs your audience’s attention.</p>\n<p>This generally isn’t a 20-minute bio of who you are and why you deserve to be on the stage. One of the most interesting talks I ever saw started with one such lengthy bio causing a third of the audience to get up and walk out. I felt really bad for the speaker — who was visibly knocked — so I stuck with it, and I’m so glad I did! The talk turned out to be amazing once all the necessary cruft was removed.</p>\n<blockquote>“When presenting at work or [at a conference or] anywhere else, never assume the audience has pledged their undivided attention. They have pledged maybe 60 seconds and will divide their attention as they see fit after that. Open accordingly.”<br /><br />— <a href=\"https://mastodon.social/@mikeindustries@macaw.social/110180890095623158\">Mike Davidson</a></blockquote>\n\n<p>A little trick I like to use is to start my talk in the middle of the story: “So all of a sudden, my air cut out. I was in a cave, underwater, in the pitch black, and with less than 20 seconds of air in my lungs.” Suddenly the whole audience will stop looking at their phones. “Wait, what?” they’ll think. What’s happening? Who is this person? Where are they? How did he get there? And what the hell does this have to do with design? You’ve suddenly created a whole series of open questions which the audience desperately wants to be closed, and you’ve just bought yourself five minutes of their undivided attention where you can start delivery.</p>\n<p><img src=\"https://files.smashing.media/articles/become-better-speaker-conferences/4-captivated-audience-ux-london-conference.jpg\" /></p>\n<p><strong>Taking too long to get to the meat of the talk is a common problem</strong>. In fact, I regularly see speakers who have spent so long on the preamble that they end up rushing the truly helpful bits. One of the reasons folks get stuck like this is that they feel the need to bring everybody up to the same base level of knowledge before they jump into the good stuff. </p>\n<p>Instead, it’s much better to <strong>assume a base level of knowledge</strong>. If the talk stretches your audience’s knowledge, that’s fine. If it goes over some people’s heads, it might encourage them to look stuff up after the event. However, if you find yourself teaching people the absolute basics, there’s a good chance the more experienced members of the audience will zone out, and capturing their interest will become that much harder later on. </p>\n<p>When speakers don’t give themselves enough time to prepare a good narrative, it’s easy to fall back on tried and tested patterns. One of these is the “<a href=\"https://neilpatel.com/blog/listicle-content/\">listicle talk</a>” where the speaker explains, “Here are twelve things I think are important, and I’m going to go through them one by one.” It’s a handy formula, but it makes people super-conscious of the time. (“Crikey, they’re still only at number five! I‘m not sure I’m going to make it through another seven of these points.”) </p>\n<p>In a similar vein are the talks, which are little more than a series of bullet points that the speaker reads through. The problem is that the audience is likely to read through them much quicker than the speaker, so people basically know what you’re going to say in advance. As such, keep these sorts of lists in your speaker notes and pick some sort of title or image that illustrates the points you’re about to make instead.</p>\nTame The Nerves\n<p>Public speaking is unnatural for us, so everybody feels some level of stress. I have one friend who is an absolutely amazing speaker on stage — funny, charming, and confident — but an absolute wreck moments before. In fact, it’s fairly common before going on stage to think, “Why the hell am I doing this to myself?” only to come off the stage 45 or 60 minutes later thinking, “That was great. When can I do it again!”.</p>\n<p>One way to minimize these nerves is to <strong>memorize the first five minutes</strong> of your talk. If you can go on the stage with the first five minutes in the bag, the nerves will quickly subside, and you’ll be able to ease into your presentation some more. This is another reason why starting with a story can be helpful, as they’re easy to remember and will give you a reasonable amount of creative license.</p>\n<p>A sure way to tame the nerves is to feel <strong>super-prepared and practiced</strong>; as such, it’s worth reading your talk out loud a bunch of times before you deliver it to an audience. It’s amazing how often something sounds logical when you say it in your head, but it doesn’t quite flow properly when said out loud. Practicing in front of people is very helpful, so consider asking friends or colleagues if you could practice on them. Also, consider doing a few dry runs with a local group before getting on a bigger stage. The more you know your material, the less nervous you’ll feel. </p>\n<p><img src=\"https://files.smashing.media/articles/become-better-speaker-conferences/5-molly-nix-talk-ux-london.jpg\" /></p>\n<p>While some speakers like to brag about how little prep they’ve done or how little sleep they’ve got the night before, don’t get tricked into thinking that this is the standard approach. Often these folks are actually very nervous and are saying things like this in an attempt to preempt or excuse potential poor performance.</p>\n<p>It reminds me of the kids at school who used to claim they didn’t study and revise the material and ended up getting a B-. They almost certainly did some revision, albeit probably not enough. But this posturing was actually a way for them to manage their own shortcomings. “I bet I could have gotten an A if I’d put some extra work in.” Instead, make sure you’re <strong>well prepared, well rested</strong>, and set yourself up for success. </p>\n<p>It’s worth mentioning that <strong>most people get nervous during public speaking</strong>, even if they like to tell you otherwise. As such, nerves are something you just need to get better at managing. One way to do this is to re-frame “nerves” (which have negative connotations) to something more positive like “excitement.” That feeling of excitement you get before giving a talk can actually be a positive thing if you don’t let it get out of hand. It’s basically your body’s way of getting you ready to perform. </p>\n<p>However, this excess energy can bleed out in some less helpful ways, such as the “speaker square dance.” This is where speakers either shift their weight from one foot to the other or take a step forwards, a step to the side, and a step back, like some sort of a caged zoo animal. Unfortunately, this constant shifting can feel very unsettling and distracting for the audience, so if you can, try to plant your feet firmly and just move with deliberate intent when you want to make a point. </p>\n<p>It’s also great if you can try to minimize the <em>“ums”</em> and <em>“ahs.”</em> People generally do this to give themselves pause while they’re thinking about the next thing they want to say. However, it can come across as if you are a little unprepared. Instead, do take <em>actual breaks</em> between concepts and sentences. At first, it can feel a bit weird doing this on stage, but think of it as an aural whitespace, making it easier for your audience to take in one concept before transitioning on to the next.</p>\n<p><strong>Note</strong>: <em>I feel comfortable calling these behaviors out as they’re both things I personally do, and I’m working on fixing them — with mixed results so far.</em></p>\nAvoid The Clichés\n<p>At least once during every conference I attend, a speaker will say something jokingly along the lines of “I’m the only one standing between you and tea/lunch/beer.” It’s meant as a wry apology, and the first time I heard it, I gave a gentle chuckle.</p>\n<p>However, I’ve been at some conferences where <em>three speakers in a row</em> had made the same joke. Apart from a lack of originality, this also shows that the speakers haven’t actually been listening to the other talks, probably because they’ve been in their room or backstage, tweaking their slides. Sometimes this is necessary, but I always appreciate speakers who have been engaged with the content, <strong>make references to earlier talks</strong>, and don’t trot out the same old clichés as the previous speakers.</p>\n<p><strong>Note</strong>: <em>I should also add that personally, I find the joke (“the only thing between you and beer”) by the last speaker of the day somewhat problematic, as it implies that people are here for the drink rather than the conference content, and because it also somewhat normalizes overconsumption.</em></p>\n<p><img src=\"https://files.smashing.media/articles/become-better-speaker-conferences/6-andy-budd-speaking-leading-design-conference.jpg\" /></p>\n<p>One thing some speakers do in order to calm their nerves (and also to increase people’s engagement, as a side-effect) is through <strong>audience participation</strong>. If you get people from the audience interacting with each other for five minutes, it takes some of the pressure and focus off of you. It’s also five fewer minutes of content you need to prepare. </p>\n<p>However, I see audience participation go wrong far more often than it goes right. This happens especially in front of Brits and Northern Europeans who would rather curl up into a ball and die rather than risk the social awkwardness of talking to their neighbors.</p>\n<p>I remember seeing one American speaker walk up the aisle at a European conference encouraging the audience to whoop and cheer while they high-fived everybody or at least <em>attempted</em> to high-five everybody. Although this sort of hype-building might have worked well in Vegas, the assembled audience of Northern Europeans found the whole episode deeply embarrassing, and the speaker never truly recovered for the rest of the talk.</p>\n<p>And, on the opposite side of things, if you <em>do get</em> your audience interacting, it can be quite hard to get them <em>to stop</em> a few minutes later! I have seen far too many speakers asking people to introduce themselves to their neighbors, only to cut them off 30 or so seconds later. So if you have such an activity planned, make sure you leave enough time for it to become a meaningful connection, and have a strategy on how you’re going to bring people’s focus back to you.</p>\n<p>Another (negative) thing I see a lot of speakers do is make jokes about how they didn’t write their talk till last night or didn’t get to bed till late because they were out drinking. While it’s good to appear to be vulnerable and human, if played wrong, the message you might actually be sending is that you don’t really care about the audience, so be careful.</p>\nHow To Get Invited Back?\n<p>Organizing conferences can be stressful work. You’re trying to coordinate with a bunch of different people with widely <strong>different workloads, communication styles</strong>, and response times. People are super quick to say “Yes!” to a speaking gig, but then they might go dark for months on end. This is really difficult if you’re trying to get enough information to launch your event site and start selling tickets. It’s even harder if you’re trying to organize things like travel and accommodation and you are seeing the price of everything going up.</p>\n<p>As such, you can make conference organizers’ lives a lot easier by <strong>responding to their emails in a timely manner</strong>, sending them your talk descriptions, bio information, and headshots when asked, and confirming or booking your travel details enough time in advance so that the prices don’t double in size. </p>\n<p><strong>Speakers who are a pleasure to work with get recommended and invited back</strong>. Speakers who don’t respond to emails, send in overly-short descriptions or leave booking travel to the last minute often don’t. In fact, I’m a member of several conference organiser Slack groups where this sort of behaviour is regularly talked about, causing invites for certain speakers to dry up quickly.</p>\n<p>This is, sadly, another reason why you see the same speakers talking at events time and again. Not necessarily because they’re the best speakers, but because they’re reliable and don’t give the organizers a heart attack.</p>\nConclusion\n<p>I know this article has covered a lot of public speaking <strong>do</strong>’s and <strong>don’t</strong>’s. But before wrapping things up, it’s worth mentioning that speaking is also <em>a lot of fun</em>. It’s a great way to attend conferences you might not have otherwise been able to afford; you get to meet speakers whose work you might have been following for years and learn a ton of new things. It also provides a great sense of personal accomplishment, being able to share what you’ve learnt with others and “pay it forward.”</p>\n<p>While it’s easy to assume that all speakers are extroverts, (the art of) speaking is actually <strong>surprisingly good for introverts, too</strong>. A lot of people find it quite awkward to navigate conferences, go up to strangers, and make small talk. Speaking pretty much solves that problem as people immediately have something they can talk to you about, so it’s super fun walking around after your talk and chatting with people.</p>\n<p><img src=\"https://files.smashing.media/articles/become-better-speaker-conferences/7-andy-budd-chatting-attendees-coffee-break.jpg\" /></p>\n<p>All that being said, please <strong>don’t feel pressured into becoming a speaker</strong>. I think a lot of people think that they need to add a “conference speaker” to their LinkedIn bio in order to advance their careers. However, some of the best, most successful people I know in our industry don’t speak at public events at all, so it’s definitely not an impediment. </p>\n<p>But if you do want to start sharing your experience with others, now is a good time. Sure, the number of in-person conferences has dropped since the start of the pandemic, but the ones that are still around are desperate to find <strong>new, interesting voices from a diverse set of backgrounds</strong>. So if it’s something you’re keen to explore, why not put yourself out there? You’ll have nothing to lose but potentially a lot to gain as a result.</p>\n<h3>Further Reading</h3>\n<p>Here are a few additional resources on the topic of speaking at conferences. I hope you will find something useful there, too.</p>\n<ul>\n<li>“<a href=\"https://www.andybudd.com/archives/2018/08/breaking_into_the_speaker_circuit\">Breaking into the speaker circuit</a>,” by Andy Budd<br />Here are some more thoughts on breaking into public speaking by yours truly. As somebody who both organizes and often speaks at events, I’ve got a good insight into the workings of the conference circuit. This is probably why I regularly get emails from people looking for advice on breaking into the speaking circuit. So rather than repeating the same advice via email, I thought I’d write a quick article I could point people to.</li>\n<li>“<a href=\"https://amazon.co.uk/Confessions-Public-Speaker-Scott-Berkun/dp/1449301959/\">Confessions of a Public Speaker</a>,” by Scott Berkun<br />In this highly practical book, author and professional speaker Scott Berkun reveals the techniques behind what great communicators do and shows how anyone can learn to use them well. For managers and teachers — and anyone else who talks and expects someone to listen — the <em>Confessions of a Public Speaker</em> provides an insider’s perspective on how to effectively present ideas to anyone. It’s a unique and instructional romp through the embarrassments and triumphs Scott has experienced over fifteen years of speaking to audiences of all sizes.</li>\n<li>“<a href=\"https://abookapart.com/products/demystifying-public-speaking\">Demystifying Public Speaking</a>,” by Lara Hogan <em>(A Book Apart)</em>, with foreword by Eric Meyer<br />Whether you’re bracing for a conference talk or a team meeting, Lara Hogan helps you identify your fears and face them so that you can make your way to the stage, big or small.</li>\n<li>“<a href=\"https://www.amazon.co.uk/slide-Science-Creating-Presentations-Presentation/dp/0596522347/\">Slide:ology: The Art and Science of Presentation Design</a>,” by Nancy Duarte<br />No matter where you are on the organizational ladder, the odds are high that you’ve delivered a high-stakes presentation to your peers, your boss, your customers, or the general public. Presentation software is one of the few tools that requires professionals to think visually on an almost daily basis. But unlike verbal skills, effective visual expression is not easy, natural, or actively taught in schools or business training programs. This book fills that void.</li>\n<li>“<a href=\"https://www.amazon.co.uk/Presentation-Zen-Simple-Design-Delivery/dp/0321811984/\">Presentation Zen: Simple Ideas on Presentation Design and Delivery</a>,” by Garr Reynolds<br />A best-selling author and popular speaker, Garr Reynolds, is back in this newly revised edition of his classic, best-selling book in which he showed readers there is a better way to reach the audience through simplicity and storytelling and gave them the tools to confidently design and deliver successful presentations.</li>\n<li>“<a href=\"https://www.youtube.com/watch?v=pVumgiMJeag\">How To — Public Speaking</a>,” a video talk by <a href=\"https://www.youtube.com/@zefrank\">Ze Frank</a><br />You may benefit a lot from this video that Ze Frank made several years ago.</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2018/02/getting-started-public-speaking/\">Getting Started In Public Speaking: Global Diversity CFP Day</a>,” by Rachel Andrew <em>(Smashing Magazine)</em><br />The Global Diversity CFP Day (Call For Proposals, sometimes also known as a Call For Papers) is aimed to help more people submit their ideas to conferences and get into public speaking. In this article, Rachel Andrew rounds up some of the best takeaways along with other useful resources for new speakers.</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2014/01/getting-the-most-out-of-your-web-conference-experience/\">Getting The Most Out Of Your Web Conference Experience</a>,” by Jeremy Girard <em>(Smashing Magazine)</em><br />To be a web professional is to be a lifelong learner, and the ever-changing landscape of our industry requires us to continually update and expand our knowledge so that our skills do not become outdated. One of the ways we can continue learning is by attending professional web conferences. But with so many seemingly excellent events to choose from, how do you decide which is right for you?</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2018/12/state-of-commercial-web-conferences-events/\">Don’t Pay To Speak At Commercial Events</a>,” by Vitaly Friedman <em>(Smashing Magazine)</em><br />The state of commercial web conferences is utterly broken. What lurks behind the scenes of such events is a widely spread, toxic culture despite the hefty ticket price. And more often than not, speakers bear the burden of all of their conference-related expenses, flights, and accommodation from their own pockets. This isn’t right and shouldn’t be acceptable in our industry.</li>\n<li>“<a href=\"https://twitter.com/graceleaf_/status/1669500920277905408\">How to make meaningful connections at in-person conferences</a>,” by <a href=\"https://twitter.com/graceleaf_\">Grace Ling</a> <em>(Figma Config)</em><br />This is an excellent Twitter post about how to make meaningful connections at in-person conferences — a few concise, valuable, and practical tips.</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"149555bd1f74e7603324cefe5bf4e728684f7bec48903dd12f536c014fac3b29","category":"Tech"}