{"title":"Route planning lessons from ‘The Swimmer’ (1968)","link":"https://www.cyclist.co.uk/in-depth/the-swimmer-route-planning","date":1694703379000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/the-swimmer-route-planning\">Route planning lessons from ‘The Swimmer’ (1968)</a></p>\n\n<p>In the 1968 film <em><a href=\"https://amzn.to/45QTMZ8\" target=\"_blank\">The Swimmer</a></em>, Burt Lancaster plays Ned Merrill, who realises it is possible to ‘swim’ home from the suburban pool party he is attending using other friends’ back garden swimming pools as ‘a river’. After announcing his plan, he dives into the pool, gets out the other end, disappears over the fence and starts what becomes an increasingly eventful journey.</p>\n\n\n\n<p>The film made such an impression on my housemate and I when we watched it in the 1990s that he was inspired to write a play based on it, which he performed at the local swimming baths. Sadly, the run ended abruptly as he hadn’t taken into account just how bad the acoustics were at the Victorian-era Guinea Gap baths in Wallasey.</p>\n\n\n\n<p>I was fascinated by the idea of using an alternative infrastructure – which in Ned Merrill’s day would have been considered counter-cultural but for the number of middle-class swimming pools involved – to get from A to B.</p>\n\n\n<div>\n<figure><img width=\"705\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/10/05232522/jogle_day_one_2-705x970.jpg\" alt=\"jogle_day_one_2\" /><figcaption></figcaption></figure></div>\n\n\n<p>Already a commuting cyclist, I now pondered alternative routes that could get me from home to work avoiding the regular roads and their incessant traffic. While Ned achieves his objective in just a pair of swimming trunks, I had to factor in waterproofs and a rucksack as I followed my Ordnance Survey map’s dotted lines across golf courses, parks and wasteland under threatening Merseyside skies.</p>\n\n\n\n<p>It was an experiment with mixed results.</p>\n\n\n\n<p>I was never sure of the legality of riding across a golf course and so was continually bracing myself to be on the receiving end of either a mis-hit tee shot or a greenkeeper’s ire. The short stretches of vacant land were fraught with the risks of punctures or encounters with unsavoury characters, and I had my fair share of dead-ends and unrideable (on skinny road tyres, at least) surfaces.</p>\n\n\n\n<p>And whereas Ned Merrill had regular flirtatious encounters with attractive female neighbours, I had to dodge pompous golfers, angry dog walkers or dead-eyed ghouls seeking their next fix.</p>\n\n\n\n<p>Nearly 30 years later I no longer have a daily commute. I do, however, regularly have to make utilitarian journeys by bike – whether shopping, leading beginners’ group rides or visiting schools to teach Bikeability. This has prompted me to revisit my ambition to use routes and infrastructure away from the prescriptive network of roads and roundabouts. And it’s the gravel bike – a concept that wasn’t around in the 1990s – that has made this mission a much more enjoyable and achievable goal.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/vittoria-corsa-pro-tyres\">In The Drops: Vittoria Corsa Pro tyres, Fjällräven × Specialized backpack, Rudy Project sunglasses and The Swimmer (1968) film</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/best-cycling-french-pyrenees\">Best places to cycle in the French Pyrenees</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/king-alfreds-way-cycling-uk-route-bikepacking-touring\">King Alfred’s Way: Conquering Wessex during Britain’s wettest ever day</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>Fun on the farm</h2>\n\n\n\n<p>I also now live in Scotland, where cyclists are allowed on footpaths and the country’s ‘Right to Roam’ makes even the faintest indentation on the land a potential right of way. I have enjoyed plotting routes between key places and mixing up well-established footpaths and coastal trails with little-known, overgrown shortcuts and forgotten farm tracks.</p>\n\n\n\n<p>For someone who finds mountain-biking a tad too technical, these gravel routes, pioneered in the comforting cradle of my drop handlebars, have provided a taste of what <em>The Guardian</em> would probably term ‘wild cycling’ while also furnishing an escape from the tyranny of tarmac.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"970\" height=\"347\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-300x107.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-768x275.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1536x550.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-750x269.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1140x408.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4.jpg 1818w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p>I’ve successfully plotted a 20km off-road loop from my front door that provides access to the nearest town (although admittedly I often take the direct road route home depending how much precious cargo of wine I’ve bought from the local Co-op). A friend who lives in Lewisham, south London, has linked together a series of parks to safely deliver him to the North Downs, while another in Glasgow uses canal towpaths and a short-cut through a cemetery to get to work. And we’re not the only ones going off-grid to avoid the pollution and hazards of roads.</p>\n\n\n\n<p>Kieran Foster is the off-road advisor for <a href=\"https://www.cyclinguk.org/routes\" target=\"_blank\">Cycling UK</a>, and has plotted gravel routes including the Great North Trail from Yorkshire to Edinburgh, and <a href=\"https://www.cyclist.co.uk/in-depth/king-alfreds-way-cycling-uk-route-bikepacking-touring\" target=\"_blank\">King Alfred’s Way</a>, a 350km loop in southern England. Of new gravel converts, he says, ‘They reach a certain age and find they have families and mortgages and decide that roads are just too dangerous. I can’t offer these riders a new piece of segregated tarmac that will cost £1 million a mile. However, I can give them a route that may be occasionally muddy or rutted but will keep them safe.’</p>\n\n\n\n<p>Despite a dark existential cloud looming over it, Ned Merrill’s aquatic odyssey is a logistical triumph (and, incidentally, a great advert for 52-year-old Burt Lancaster’s personal trainer). All bike riders can take inspiration from such ambition and planning. Swimming trunks are optional.</p>\n\n\n\n<p><strong>• This article originally appeared in issue 143 of Cyclist magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/the-swimmer-route-planning\">Route planning lessons from ‘The Swimmer’ (1968)</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Martin James","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"149cf83627c320cc215e1db241b52bd5d40c26001f0f2a89746aec56e757deb9","category":"Cycling"}