{"title":"La Vuelta a España 2021 Stage 8 Preview - Sprint in La Manga","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-stage-8-preview-sprint-in-la-manga","date":1629385723000,"content":"\n      <p><span>The sprinters have already received three,</span><span> clear-cut chances to win at the <span>2021 Vuelta a España.</span></span><span> Their next major opportunity arrives on stage 8, and with opportunities slowly drying up as the mountains loom, the pressure is rising.</span></p>\n<p><b><span>The stage finishes in La Manga, which is one of La Vuelta's historic locations — it first hosted a stage finish in 1966, where Italian Enzo Pretolani won his only Grand Tour stage. The coastal spit, which i</span><span>s just 100 metres wide at its narrowest and 21km in length,</span><span> separates the Mediterranean Sea from coastal lagoon Mar Menor.</span></b></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-preview\"><b><i>Vuelta 2021 Guide</i></b></a></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VE21-Altimetriasv4-8_1024x1024.png?v=1629377889\" />Stage 8 profile</span></i></p>\n<p><span>After leaving Santa Pola, the riders travel south alongside the Spanish coastline. An intermediate sprint in Cartagena occurs at kilometre 104, where bonus seconds are awarded to the first three riders.</span></p>\n<p><span>Some sections of the stage are exposed and, should the wind comply, the formation of echelons is feasible. </span><span>Some weather forecasts indicate that winds could reach speeds of 20kph, which could be strong</span><span> enough to string things out.</span><span> However, this requires at least one team to press on aggressively, and with a mountain stage to come, who will be willing to invest so heavily?</span></p>\n<p><span>After passing through Cartagena, two minor, uncategorised climbs occur, but they are too far from the finish and not difficult enough to have a major impact on the stage.</span></p>\n<p><span>The stage finish in La Manga isn’t particularly technical <span>with only a few kinks and sweeping corners to navigate</span>. <span>Look out for the left-right chicane with just few hundred metres left— the sprinters will launch their assault on the finish line here.</span> </span></p>\n<p><span>Without any significant corners to look out for, lead out riders must be careful to time their effort accurately. The road is wide, so we could see a hotly contested finish with many riders in contention.</span></p>\n<h4><b>Contenders</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20211708VUE014-Photogomezsport-min_1024x1024.jpg?v=1629377916\" />Fabio Jakobsen celebrates winning stage 4 (Image credit: </span></i><i><span>Luis Angel Gomez / ASO)</span></i></p>\n<p><span>Three mass sprints have taken place at La Vuelta so far, and</span><b> Jasper Philipsen</b><span> has won two of them.</span><span> Philipsen is an intelligent rider who can react dynamically in a mass sprint.</span><span></span><span> His lead out train faltered early o<span>n stage 2 but</span> he made the clever, late decision to switch to the UAE Team Emirates lead out train. However, he followed his teammates Alexander Krieger and Sacha Modolo all the way to the line o<span>n stage 5</span>. Expect Phlipsen to be a key challenger again.</span></p>\n<p><span>Following his victory on stage 4, </span><b>Fabio Jakobsen</b><span> stated, “W</span><span>e can all say this is the end of my comeback</span><span>.” Keen to put an end to talk of his recovery after crashing at the Tour of Poland last year, Jakobsen is one of the peloton's leading sprinters once more</span><span>. Two second places on stages 2 and 5 will have boosted Jakobsen’s ever-growing confidence further. </span>Zdeněk Štybar and Bert Van Lerberghe led him to victory on stage 4 and they have a crucial role to play again.</p>\n<p><span>On the other hand, </span><b>Arnaud Démare</b><span> is struggling to swing the tide in his favour. The Frenchman was pipped to the line on stage 4 and was out of contention <span>entirely </span>in the other two sprints. Démare<span> will be desperate to find the form that helped him win four stages of the Giro d'Italia last season.</span></span></p>\n<p><b>Alberto Dainese</b><span> has sprinted well for Team DSM so far. The Italian, who is making his Grand Tour debut, finished fourth in Molina de Aragón and improved to third in Albacete. Can the 23-year-old continue his upward trajectory?</span></p>\n<p><span><span>UAE Team Emirates' </span></span><b>Juan Sebastián Molano </b>has been competitive in the sprint finishes so far.<span> Now participating at his sixth Grand Tour, Molano has finished fourth twice, matching his best Grand Tour result. With four-time Vuelta stage winner Matteo Trentin leading him out, </span>Molano<span> can be confident that he’ll be in a good position late on.</span></p>\n<p><span>Be sure to keep an eye on </span><b>Piet Allegaert, Jon Aberasturi </b><span>and </span><b>Jordi Meeus, </b>who have all recorded at least two top-10s.</p>\n<p><i><span>Cover image: Gonzalo Arroyo Moreno / Getty Images</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"14a1f7b8043edfc953f4fca2ef7eb347b5f0eba6911c1f945e895e06adf335ec","category":"Cycling"}