{"title":"AT&T Giving $5 Credit to Customers Following Major Network Outage","link":"https://www.macrumors.com/2024/02/25/att-crediting-customers-for-network-outage/","date":1708887741000,"content":"AT&amp;T has <a href=\"https://www.att.com/makeitright/\">announced</a> that it will be providing impacted customers with a $5 bill credit per account as compensation for the network's major outage across the U.S. on Thursday. The credits will automatically be applied within two bill cycles, it said.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/ATT-Banner.jpeg\" width=\"1200\" height=\"630\" />\r<br />\nThe carrier's full statement apologizing for the outage:<blockquote>We apologize for Thursday's network outage. We recognize the frustration this outage has caused and know we let many of our customers down. We understand this may have impacted their ability to connect with family, friends, and others. Small business owners may have been impacted, potentially disrupting an essential way they connect with customers.\r<br />\n\r<br />\nTo help make it right, we're reaching out to potentially impacted customers and we're automatically applying a credit to their accounts. We want to reassure our customers of our commitment to reliably connect them – anytime and anywhere. We're crediting them for the average cost of a full day of service.\r<br />\n\r<br />\nWe're also taking steps to prevent this from happening again in the future. Our priority is to continuously improve and be sure our customers stay connected.</blockquote>AT&amp;T also <a href=\"https://about.att.com/ecms/dam/snrdocs/network-employee-letter.pdf\">shared the letter</a> that its CEO John Stankey sent to the company's employees. In it, he said the company \"let down\" many of its customers and has \"already implemented changes to prevent what happened on Thursday.\"\r<br />\n\r<br />\nBased on its initial review, AT&amp;T <a href=\"https://about.att.com/pages/network-update\">said</a> it believed that the outage was caused by the \"application and execution of an incorrect process used as we were expanding our network,\" not a cyber attack. The U.S. government on Thursday said the FBI and the Department of Homeland Security were looking into the outage.\r<br />\n\r<br />\nThe outage began in the early hours of Thursday morning, with tens of thousands of customers complaining that they were unable to make cellular phone calls, send or receive text messages, or use cellular data. AT&amp;T said about three-quarters of its customers were able to access its network by around 6 a.m. Eastern Time on Thursday, and it said that it had fully restored its network by around 1 p.m. Eastern Time that day.\r<br />\n\r<br />\nAT&amp;T said the bill credit offer does not apply to AT&amp;T Business, prepaid, or Cricket customers. A spokesperson for the carrier <a href=\"https://www.cnet.com/tech/mobile/at-t-will-give-5-account-credits-after-thursdays-network-outage/\">told <em>CNET</em></a> that those customers will \"have options available to them if they were potentially impacted by the outage.\"<br />This article, \"<a href=\"https://www.macrumors.com/2024/02/25/att-crediting-customers-for-network-outage/\">AT&amp;T Giving $5 Credit to Customers Following Major Network Outage</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/at-t-giving-5-credit-to-customers-following-major-network-outage.2420387/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"14a4475a5b56f0059222caf555d516b422969e758aa7209acb426d679e3c3ede","category":"Apple"}