{"title":"ตลาดคริปโต Gemini จับมือ Mastercard เปิดตัวบัตรเครดิต รับเงินคริปโตคืนทันทีเมื่อใช้จ่าย","link":"https://www.blognone.com/node/122398","date":1619583059000,"content":"<div><div><div><p>Gemini แพลตฟอร์มซื้อขายเหรียญคริปโตของพี่น้องฝาแฝด Winklevoss จับมือกับ Mastercard ผู้ให้บริการบัตรเครดิตชั้นนำ เปิดตัวบัตรเครดิต Gemini ที่จะให้เงินคืนสูงสุด 3% ของยอดใช้จ่าย เป็นสกุลเงินคริปโตที่ผู้ใช้เลือกได้เองกว่า 30 ชนิดที่มีบน Gemini (เหมือน cash back แต่เป็น crypto back แทน)</p>\n<p>การคืนเงินจะได้เงินเข้าทันทีหลังใช้จ่าย ไม่ต้องรอสิ้นเดือน รวมถึงไม่มีค่าธรรมเนียมรายปี และยังได้สิทธิพิเศษต่างๆ เหมือนบัตร Mastercard ทั่วไป</p>\n<p>Noah Perlman ผู้อํานวยการฝ่ายปฏิบัติการ (COO) ของ Gemini <a href=\"https://www.youtube.com/watch?v=_0D374fIe_M\">ให้สัมภาษณ์กับ Bloomberg Technology</a> ตอบคำถามเรื่องความเสี่ยงที่ Gemini ไม่สามารถควบคุมได้ของสินทรัพย์ประเภทเหรียญคริปโต ว่าจริงๆ แล้วเรื่องแต้มสะสมปกติที่อาจเป็นไมล์บิน หรือแต้มโรงแรม บริษัทอื่นๆ ก็ควบคุมไม่ได้เหมือนกัน และแม้จะมีความเสี่ยง ตัวสินทรัพย์ดิจิทัลเช่น Bitcoin ก็เป็นสินทรัพย์ประเภทที่มีผลตอบแทนดีที่สุดใน 10 ปีที่ผ่านมา</p>\n<p>Noah ยังระบุอีกว่าปัจจุบันมีผู้ลงชื่อสนใจใน waitlist กว่า 150,000 คนแล้ว หลังบริษัทประกาศความร่วมมือกับ Mastercard ส่วนข้อมูลเพิ่มเติมบนหน้าเว็บไซต์ระบุว่าบัตรเตรียมเปิดให้ใช้งานใน 50 รัฐของสหรัฐอเมริกาภายในฤดูร้อนของปีนี้ (ช่วง 20 มิถุนายน ถึง 20 กันยายน) และสามารถใช้งานได้ทุกที่ที่รับบัตร Mastercard</p>\n<p>ที่มา - <a href=\"https://www.gemini.com/blog/gemini-credit-card-to-launch-with-mastercard-as-network-partner\">Gemini</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b6400be73ed910543d7e71278c7e963a.jpg\" /></p>\n<p><em>วิดีโอสัมภาษณ์ Noah Perlman จาก Bloomberg Technology</em></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/gemini\">Gemini</a></div><div><a href=\"/topics/mastercard\">Mastercard</a></div><div><a href=\"/topics/cryptocurrency\">Cryptocurrency</a></div><div><a href=\"/topics/credit-card\">Credit Card</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"14a5e82f304023bde1c99a9193c56fd300aa1ed38361dc6b451bf14836863ba8","category":"Thai"}