{"title":"Apple Watch Series 8 Suppliers Developing Blood Glucose Monitoring Components","link":"https://www.macrumors.com/2021/10/25/apple-watch-series-8-blood-glucose-sensors/","date":1635158051000,"content":"Apple's suppliers are currently developing components for next-generation sensors in the Apple Watch Series 8 that will allow users to measure their blood glucose level, according to a new report.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/09/applewatchs6bloodoxygen2.jpg\" />\r\n<br />\r\nAccording to a <a href=\"https://www.digitimes.com/news/a20211025PD202.html\">paywalled report</a> from <em>DigiTimes</em>, Apple and its suppliers have begun working on short-wavelength infrared sensors, a commonly used sensor type for health devices. The new sensors, likely to be fitted on the back of the Apple Watch, will enable the device to measure the amount of sugar in a wearer's blood. \r\n<br />\r\n\r\n<br />\r\nThe Apple Watch, over the years, has gained more comprehensive health features, most recently with the Apple Watch Series 6 that added a blood oxygen sensor. Compared to the first Apple Watch capable of measuring heart rate and primary daily activity, the Apple Watch is now capable of taking an ECG, detecting falls, high and low heart rates, blood oxygen levels, and more. \r\n<br />\r\n\r\n<br />\r\nContinuing to build the Apple Watch as an all-encompassing health tool, Apple has already been rumored to be eying blood glucose measuring functionality for the next-generation Apple Watch, the Apple Watch Series 8. According to <em>The Wall Street Journal</em>, blood glucose level is one of multiple health metrics <a href=\"https://www.macrumors.com/2021/09/01/multiple-new-apple-watch-health-features/\">Apple is looking to add to the Apple Watch</a>.\r\n<br />\r\n\r\n<br />\r\nAccording to <em>The Wall Street Journal</em>, however, Apple is facing challenges in incorporating blood glucose capabilities into the Apple Watch. Current methods of measuring blood glucose levels include taking a sample of blood and using a medical-grade device. With the Apple Watch, Apple would be looking to take a typically invasive medical practice and make it non-invasive. \r\n<br />\r\n\r\n<br />\r\nIn <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, the Health app <a href=\"https://www.macrumors.com/2021/06/23/ios-15-apple-watch-series-7-feature/\">added blood glucose highlights as a health metric</a>. ‌iOS 15‌‌ users have to use external hardware to provide the data, but that would change if Apple adds a glucose monitoring feature to a future Apple Watch model. \r\n<br />\r\n\r\n<br />\r\nWhat Apple has in store for the next Apple Watch remains unclear, but the radical redesign that was rumored for the Series 7 but never materialized could make an appearance. The <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 7</a>, announced last month, includes a larger display, faster charging, and a slightly larger battery. Apple is expected to announce the Apple Watch Series 8 in the 2022 fall season.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 7</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/digitimes-com/\">digitimes.com</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/25/apple-watch-series-8-blood-glucose-sensors/\">Apple Watch Series 8 Suppliers Developing Blood Glucose Monitoring Components</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-watch-series-8-suppliers-developing-blood-glucose-monitoring-components.2319143/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5qm-2AFaTC4:c9G0Yca7Aiw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5qm-2AFaTC4:c9G0Yca7Aiw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/5qm-2AFaTC4\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"14a765cbe6927c22a427998394a0b591236983929e857b8938eba49570efaad9","category":"Apple"}