{"title":"Evidence for a Pro-inflammatory State of Macrophages from Non-obese Type-2 Diabetic Goto-Kakizaki Rats","link":"https://www.preprints.org/manuscript/202407.1811/v1","date":1721808563000,"content":"Obesity causes insulin resistance (IR) through systemic low-grade inflammation and can lead to type 2 diabetes mellitus (T2DM). However, the mechanisms that cause IR and T2DM in non-obese individuals are unclear. The Goto-Kakizaki (GK) rat develops IR spontaneously and is a model of non-obese T2DM. These rats exhibit hyperglycemia beginning at weaning and exhibit lower body mass than control Wistar rats. Herein, we tested the hypothesis that macrophages of GK rats are permanently in a pro-inflammatory state, which may be associated with a systemic inflammation condition that mimics the pathogenesis of obesity-induced T2DM. Using eighteen-week-old GK and control Wistar rats, we investigated the proportions of M1 (pro-inflammatory) and M2 (anti-inflammatory) macrophages isolated from the peritoneal cavity. Additionally, the production of inflammatory cytokine and reactive oxygen species (ROS) in cultured macrophages under basal and stimulated conditions was assessed. It was found that phorbol myristate acetate (PMA) stimulation increased GK rat macrophage ROS production by 90-fold compared to basal levels. This response was also three times more pronounced than in control cells (36-fold). The production of pro-inflammatory cytokines, such as tumor necrosis factor-alpha (TNF-α), tended to be upregulated in cultured macrophages from GK rats under basal conditions. Macrophages from GK rats produced 1.6 times more granulocyte-macrophage colony-stimulating factor (GM-CSF), 1.5 times more monocyte chemoattractant protein-1 (MCP-1) and 3.3 times more TNF-α than control cells when stimulated with lipopolysaccharide (LPS) (p = 0.0033; p = 0.049; p = 0.002, respectively). Moreover, compared to control cells, GK rats had 60% more M1 (p = 0.0008) and 23% less M2 (p = 0.038) macrophages. This study is the first to report macrophage inflammatory reprogramming towards a pro-inflammatory state in GK rats.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"14adfc603627c4ffb37bad4ad8d8255b9d083479ec8cb49ff8ff0ae648b22f00","category":"Interdisciplinary"}