{"title":"Fiscal Policy and Economic Resilience: Impact of Government Consumption alongside Oil and Non-Oil Revenues on Saudi Arabia&rsquo;s GDP during Crises (1969-2022)&rdquo;","link":"https://www.preprints.org/manuscript/202405.1359/v3","date":1720607845000,"content":"This study investigates the impact of Government Consumption (GC) on Saudi Arabia’s GDP during major economic crises from 1969 to 2022, with a focus on periods marked by fluctuations in oil and non-oil revenues. By integrating these revenue streams, the research provides a more comprehensive analysis of fiscal policy effectiveness during economic downturns. Using an Autoregressive Distributed Lag (ARDL) model, the study reveals the complex role of Government Consumption (GC) in stabilizing and stimulating the Saudi economy amidst revenue volatility.Key findings indicate that while GC does not significantly influence GDP in the short term, its long-term effectiveness varies across different crises. Specifically, GC has acted as a buffer against immediate economic shocks during certain crises while providing a stimulus for economic recovery in others. For instance, during the 2020 COVID-19 pandemic, timely fiscal measures significantly boosted GDP, underscoring the importance of adaptive and proactive fiscal policies. Conversely, the 2014-2016 oil price collapse demonstrated that GC alone was insufficient to counteract economic downturns, emphasizing the need for diversified revenue strategies.These findings underscore the dual role of GC in economic stabilization and recovery. During the COVID-19 pandemic, GC played a crucial role in both mitigating negative economic impacts and supporting recovery efforts, showcasing its effectiveness in times of global disruptions. This demonstrates GC's capability as an immediate buffer against economic shocks and a stimulus for economic recovery. In contrast, during the 2014-2016 oil price collapse, GC was less effective, indicating the limitations of relying solely on government spending without broader economic diversification. This highlights the necessity of diversified revenue strategies to complement fiscal measures for long-term economic resilience.The robustness of the findings was ensured through various diagnostic tests, including checks for autocorrelation, heteroskedasticity, and stationarity of residuals. The absence of significant autocorrelation and heteroskedasticity, along with the stationarity of differenced variables, confirms the validity of the econometric models used.The study contributes to the discourse on fiscal policy in oil-dependent economies by illustrating the critical role of diversified revenue strategies and adaptive fiscal measures in enhancing economic resilience. Recommendations are offered for policymakers to optimize fiscal strategies, ensuring robust economic recovery and long-term stability in volatile markets. This research highlights the necessity for Saudi Arabia to refine its fiscal policies towards greater economic diversification and stability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"14b124f497d158f23e218f95ebad50bc0e068fdf9dc3bf4d9089dbb9e21e693c","category":"Interdisciplinary"}