{"title":"Advancements in edible films for aquatic product preservation and packaging","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12880?af=R","date":1700631422000,"content":"<h2>Abstract</h2>\n<p>This review focuses on the incorporation of various bioactive compounds into edible films/coatings, improving their properties using novel techniques, and discussing their applications in aquatic food products. Aquatic food products with a high nutritional value play an important role in the market. However, these products are susceptible to microbiological spoilage, chemical oxidation, and physical deterioration. Therefore, the use of functional edible films and coating layers for shelf life extension is a critical issue. In this review, marine-based biopolymers, peptides, biodegradable polymers, and their conjugates as edible film/coating materials are summarised, and commonly applied methods are explained. Polysaccharide and/or protein films enriched with plant extracts, phenolic compounds, and essential oils (EOs) have also been presented. Recent studies have indicated that nanostructures, such as nanofibers, nanoparticles, and nanoemulsions, have gained interest for the nanoencapsulation of bioactive ingredients or antimicrobial agents in edible films to preserve freshness. Therefore, nanocomposite packaging film materials with improved moisture barriers have a strong impact on oxidation and microbial delay. The combination of various compounds or synergistic treatment of edible films with other nonthermal methods such as ozonation, high hydrostatic pressure, and irradiation, are recommended as alternative edible film modification methods. Finally, the enrichment of edible films with microorganism-based additives, bacteriophages, and enzymes is discussed. This review reports that the integration of natural antioxidants, phenolic compounds, probiotics, and bacteriocins with antioxidant and antimicrobial activities in edible films and their packaging applications has the potential to prolong the shelf life of aquatic products.</p>","author":"Aydın Aytaç Gürdal, \nTurgay Çetinkaya","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"14b2cc97283b30f3d28499addad717430cbd1fc8802fa39f0632a86f534b1d00","category":"Environment"}