{"title":"Alexander Vinokourov is back at Astana for 2022","link":"https://www.cyclist.co.uk/news/9976/alexander-vinokourov-is-back-at-astana-for-2022","date":1629106999000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>16 Aug 2021</span></div>    </div></div><p>\nHaving left his role as team principal last month, Vino and Astana will be back in the WorldTour next season</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/08/vinokourov.jpg?itok=nYsrXSjD\" />  </div>\n<div>\n      <p> He's back. <a href=\"/tags/astana\" target=\"_self\">Astana</a> has confirmed that Alexander Vinokourov has been reappointed as team principal for 2022.</p>\n<p>Slipped into a statement confirming that the team's shareholders will continue as owner and sponsor for next season, Astana said Vino, who had been in the role since 2013 until reports of his sacking last month, will oversee rider and staff recruitment as well as sporting operations.</p>\n<p>There had been whispers of the 2012 Olympic road race champion's impending return given the departure of current co-title sponsors Premier Tech along with several riders either having confirmed or rumoured to be departing.</p>\n<p>It is believed that Canadian company Premier Tech will redirect their investment into another WorldTour team while key riders including Alexandr Vlasov, the Izagirre brothers, Luis León Sánchez and current Vuelta a España nearly man Alex Aranburu all eyeing, or completing, an exit.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/4019/flanders-makes-bid-for-2021-world-championships\">Flanders makes bid for 2021 World Championships</a></div>      <div><a href=\"/in-depth/7981/rainbow-stripes-the-history-of-the-world-championships-jersey\">Rainbow stripes: The history of the World Championships jersey</a></div>      <div><a href=\"/in-depth/7965/the-tour-of-flanders-a-nations-obsession\">The Tour of Flanders: a nation's obsession </a></div>      <div><a href=\"/in-depth/6904/around-the-worlds-exploring-the-routes-of-the-yorkshire-2019-world-championships\">Around the Worlds: Exploring the routes of the Yorkshire 2019 World Championships</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 117: on sale now!</a></div>    </div></div><p>\nVinokourov, Kazakhstan's golden child, helped set up the team – named after the Kazakh capital, which has since been renamed Nur-Sultan – in 2006 after winning the Vuelta, helping to develop a wealth of Kazakh cycling talent including Tour de France and Vuelta stage winner Alexey Lutsenko.</p>\n<p>Controversy has never been far away from Vinokourov though, having served a doping ban as a rider and faced accusations of race fixing – which he was cleared of – in 2019. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"14b58259fd97e973af3f6b5dfb9059652082edbe34d0958100c6d0e0a8ea9c4f","category":"Cycling"}