{"title":"The OnePlus 12 packs a 5400 mAh battery, up to 24GB of RAM","link":"https://arstechnica.com/?p=1988697","date":1701805280000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/8.jpg\" /></div>\n          <p>\n            The OnePlus 12.                          [credit:\n                              OnePlus                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>The OnePlus is doing its usual early flagship launch in China. The OnePlus 12 <a href=\"https://www.oneplus.com/cn/12-launch\">is official there</a> but won't be released in the US until 2024. We can still fire up Google Translate and go over it, though.</p>\n<p>This will be one of the first devices on the market with the <a href=\"https://arstechnica.com/gadgets/2023/10/qualcomms-snapdragon-8-gen-3-promises-30-percent-faster-cpu/\">Snapdragon 8 Gen 3</a>, Qualcomm's new SoC for 2024. This uses an Arm Cortex X4 CPU and a novel 1:5:2 core arrangement, all built on a 4 nm process. That's one big X4 core, five \"medium\" A720 cores, and two A530 cores for background processing. The base model has 12GB of RAM and 256GB of storage, while higher tiers will let you go up to 24GB of RAM and 1TB of storage. The phone is only IP65 rated for dust and water resistance; in other words, it can't be submerged in water like most other flagships.</p>\n<p>The battery is getting a big boost beyond the usual 5000 mAh capacity phones have been stuck at for years and is now up to 5400 mAh. The Chinese version has 100 W wired quick charging (this will probably be downgraded to 80 W in the US) and sees the return of 50 W wireless charging. Both will need proprietary OnePlus chargers. The display is a 6.82-inch, 3168×1440 120 Hz OLED that can hit 4,500 nit peak brightness. Unlike <a href=\"https://arstechnica.com/google/2023/10/pixel-8-pro-review-the-best-android-phone/\">some other flagships</a> that are dumping curved displays, this one is still curved.</p></div><p><a href=\"https://arstechnica.com/?p=1988697#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1988697&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"14b9afea72f10455ddc21141a5c1cd85583fddb549a7937b1bd6f73127b334c5","category":"Tech"}