{"title":"From a war-torn homeland to a WorldTour contract and Tour de France dreams: Meet Welay Hagos Berhe","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/chasing-dreams-welay-hagos-berhe","date":1709738294000,"content":"\n      <p><span>Few regions in the world have lived through a period as turbulent and uncertain as Tigray in Ethiopia has in the past few years. One of the hotbeds of African cycling, a bloody civil war between the Tigray People’s Liberation Front and the Ethiopian federal government killed an estimated 600,000 people between November 2020 and November 2022, and though a subsequent ceasefire is holding out, tensions remain high, and the mountainous territory has been devastated.</span></p>\n<div></div>\n<div></div>\n<p><span>Cyclists from the area all have their own stories: Mulu Hailemichael, a rider for Caja-Rural, escaped the war zone on foot with zero possessions; Eyeru Tesfoam Gebru of Komugi-Grand Est fled to Europe and then lived a “horrible” experience before finally being granted asylum;</span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-mothers-dream\"><span> Negasi Haylu Abreha of Q.365 wasn’t reunited with his family for three years.</span></a></p>\n<p><span>Welay Hagos Berhe, meanwhile, hasn’t seen his family since leaving home in July 2020. “It’s been nearly four years already,” the Jayco-Alula rider, 22, says. “I wish I had been home, but I haven’t yet. Hopefully I can soon.” Entire families have been killed, thousands of children have been orphaned. Fortunately, Berhe’s family are safe. “I’m really lucky to find everything is fine. I’m really grateful that they are safe.”</span></p>\n<p><span>Problems, however, remain. “The war has stopped but things are still broken, things don’t work,” he explains. “There’s no more fighting, and some villages are free, but most places are still under the control of the enemy. It’s really difficult. At the moment, it’s still really hard to call my family. For example, today they called me but after one minute the call was cut. The internet is really bad. It’s tough and they can’t change anything. It’s pretty hard when I can’t even speak or laugh together with my family and friends at big events like Christmas and birthdays.”</span></p>\n<p><span>Aged 18, Berhe first visited Europe in 2019 when he was invited to spend three months training at the UCI’s World Cycling Centre in the Swiss Alps, and he returned to the same place the following summer in July 2020; he’s been unable to fly home ever since. “I wish I will be back to see my family and friends. I really miss them, but at the moment it’s difficult. I still have to wait a bit.” </span></p>\n<p><span>Berhe didn’t race in 2020 due to Covid, and neither did he in 2021 due to visa issues. In the summer of 2021, a few months shy of his 20th birthday, he applied for refugee status in Switzerland, and was moved to a refugee centre where he was living in a shared room of four. He doesn’t want to divulge any more details.</span></p>\n<p><span>It wasn’t until 2022 that his residency issues were sorted and he could get back racing after a two year absence. EF Education-Nippo Development Team gave him the opportunities to impress and it worked: Jayco-Alula saw enough in just one season to offer him a three-year contract to compete in the WorldTour.</span></p>\n<p><span>“Going off the data we have on other guys, and the standard set in lactate tests, he looks to be a stage racer, and he’s certainly got what it takes to be a WorldTour racer,” his coach Josh Hunt says. “Compared to other guys who have gone on to become Grand Tour riders, his numbers match up as a neo-pro.”</span><span><br /></span><span></span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1654869918.jpg?v=1708532750\" /></span></p>\n<h3><strong>Chasing a dream</strong></h3>\n<p><span>Berhe was born at altitude in Dogu’a Tembien, and moved to Tigray’s capital, Mek’ele, aged 13. Alongside his secondary school education, he cleaned shoes and baked bread to earn money. He didn’t know much about cycling until one day he caught a glimpse of the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> on television. “Woah,” he exclaims. “Everything! I loved everything about it! The fans, the mountains, the sprints, the leadout, I couldn’t believe it. I fell in love with cycling.”</span></p>\n<p><span>He would watch the Tour in a local cafe, but only when the owner wasn’t under pressure to broadcast football. “There was only ever me watching the race. I was the only one!” he giggles. “People watch football, sometimes running, and when the cycling was on, only some were happy to see it, but most complained. But the man was really happy for me. I saw Chris Froome winning, and I wanted to be like him. And here I am, chasing my dream today.”</span></p>\n<p><span>Berhe received his first bike aged 17 and was a quick learner, immediately winning a multitude of local races, and then the Junior National Time Trial Championships. In 2019, he defended his title, and also became African time trial champion. Those were the results that prompted his move to Aigle, Switzerland. “It was a really big change,” he remembers. “The racing was so hard, and even the food was completely different. I also couldn’t speak English so it was really difficult to compete with the best.”</span><span><br /></span><span></span></p>\n<p><span>At the time, he spoke only Tigrinya, one of five official languages in Ethiopia. “But I knew language was more key than riding more hours so I learned English quickly and adapted. I was always translating messages in the groups and I was quite quick to understand. Within a few months I got to a good level.” Today, Berhe is fluent.</span></p>\n<p><span>On the bike, he was showing that his lightweight build lent him to powering up mountains. One day in particular stands out. “The World Cycling Centre does 20 minute tests on the Plan du Croix, a climb that the Tour de Romandie do every year,” he remembers. “In 2019 I really prepared for the climb, rode the test like a race and I got the fastest time on the Strava segment, beating times set in the Tour de Romandie. Everyone was saying, ‘wow, you go so fast on the climbs!’ That was the day when I thought I was good enough.”</span></p>\n<h3><strong>‘He’s such an open book’</strong></h3>\n<p><span>Before he joined Jayco, he had only ridden 42 UCI-sanctioned race days, and his coach Hunt points out that he’s probably not ridden many more non-UCI races. What’s more, he’s barely even ridden a time trial bike. “That’s why we can’t put a label on him yet,” Hunt says. “He goes fast up climbs, but whether that means he’s a Grand Tour or week-long stage racer, we can’t say. He’s in the development stage and it’s important to say he’s still just 22.</span></p>\n<p><span>“You take it for granted that people know how to race a bike, but he joined us and started asking questions about position and crosswinds. A big part of his development is turning those good numbers into being able to ride in the wind, to be strong enough to be at the front come the end, getting to climbs fresher, and being more efficient. Getting him into the race rhythm is his big challenge. He’s a really exciting rider to work with because he’s such an open book. It’s almost like he’s untouched.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1622777169.jpg?v=1708532834\" />In 2023, aged 21 for the entire season, Berhe twice finished second in stages of the Tour of Austria, and became only the second Ethiopian after his Jayco-Alula teammate Tsgabu Grmay to ride a Grand Tour when he started the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>; he went home after stage 15 due to a positive Covid infection. “It was an up and down year,” is his assessment, “and this season I want to be a better rider in the peloton and to go for the GC in some races. I also need to learn more about time trialling. In the high mountains I think there will be some chances for me. I was born at 2,500m, so it’s a little bit easier for me than others at that altitude!”</span></p>\n<p><span>His dream is clear. “To win the Tour de France,” he answers, and he thinks he could claim his first pro win in 2024. “I think it’s possible. It’s not easy, there are always big names at even the small races, but I will prepare and hopefully I win one. A 10km steep climb with a high finish would be a dream race for me.”</span></p>\n<p><span>Better than winning, though, would be flying back home to Tigray and seeing his family. “Woah,” he says, and pauses. “That’s a really crazy thought. It would be the happiest moment of my life. Really. My family would be… this would be really special. I hope it happens soon.”</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"14baa96e12b07f76a17ba70a4a6c161a751b14e5ec110d76d9d2397c4ff24f83","category":"Cycling"}