{"title":"Detection and modeling of Staphylococcus aureus and fecal bacteria in Hawaiian coastal waters and sands","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11037?af=R","date":1715335488000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/fae8d7fb-d80e-4b60-8d19-27fdb301e65a/wer11037-toc-0001-m.png\" alt=\"Detection and modeling of Staphylococcus aureus and fecal bacteria in Hawaiian coastal waters and sands\" />\n<p><i>Staphylococcus aureus</i>, methicillin-resistant <i>S. aureus</i> (MRSA), and fecal indicator bacteria (<i>Enterococcus</i> spp., and <i>Clostridium perfringens</i>) were frequently detected in seawater and sand across six beaches in Hilo, Hawai‘i. This study utilized robust modeling techniques, specifically negative binomial generalized linear models that can predict elevated concentrations of the measured bacteria.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Microbial pollution of recreational waters leads to millions of skin, respiratory, and gastrointestinal illnesses globally. Fecal indicator bacteria (FIB) are monitored to assess recreational waters but may not reflect the presence of <i>Staphylococcus aureus</i>, a global leader in bacterial fatalities. Since many community-acquired <i>S. aureus</i> skin infections are associated with high recreational water usage, this study measured and modeled <i>S. aureus</i>, methicillin-resistant <i>S. aureus</i> (MRSA), and FIB (<i>Enterococcus</i> spp., <i>Clostridium perfringens</i>) concentrations in seawater and sand at six beaches in Hilo, Hawai‘i, USA, over 37 sample dates from July 2016 to February 2019 using culturing techniques. Generalized linear models predicted bacterial concentrations with physicochemical and environmental data. Beach visitors were also surveyed on their preferred activities. <i>S. aureus</i> and FIB concentrations were roughly 6–78 times higher at beaches with freshwater discharge than at those without. Seawater concentrations of <i>Enterococcus</i> spp. were positively associated with MRSA but not <i>S. aureus</i>. Elevated <i>S. aureus</i> was associated with lower tidal heights, higher freshwater discharge, onsite sewage disposal system density, and turbidity. Regular monitoring of beaches with freshwater input, utilizing real-time water quality measurements with robust modeling techniques, and raising awareness among recreational water users may mitigate exposure to <i>S. aureus</i>, MRSA, and FIB.</p>\n<h2>Practitioner Points</h2>\n<p>\n<i>Staphylococcus aureus</i> and fecal bacteria concentrations were higher in seawater and sand at beaches with freshwater discharge.\nIn seawater, <i>Enterococcus</i> spp. positively correlated with MRSA, but not <i>S. aureus</i>.\nFreshwater discharge, OSDS density, water turbidity, and tides significantly predicted bacterial concentrations in seawater and sand.\nPredictive bacterial models based upon physicochemical and environmental data developed in this study are readily available for user-friendly application.\n</p>","author":"Maria Steadmon, \nMelia Takakusagi, \nTracy N. Wiegner, \nMikayla Jones, \nLouise M. Economy, \nJazmine Panelo, \nLynn A. Morrison, \nMatt C. I. Medeiros, \nKiana L. Frank","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"14c0e6fc48b6f8d963159596a3a00dc0f3dcac5f766511a6c32e08271caee235","category":"Environment"}