{"title":"Tour de France 2021 Stage 6 Preview - The Tour Returns to Châteauroux","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-stage-6-preview-the-tour-returns-to-chateauroux","date":1624982901000,"content":"\n      <p>Châteauroux hosted a sprint finish at the Tour de France in 2008, and most recently, in 2011. On both occasions, it was Mark Cavendish who celebrated across the line. The 2008 stage marked the Manx Missile’s first ever win at the Tour de France.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b><i>Tour de France 2021 Guide</i></b></a></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_PROFILS_ETAPES_SANS_RAVITO_ETP06_1024x1024.jpg?v=1624966639\" />Stage 6 profile</span></i></p>\n<p><span>The stage starts in Tours for a moderately short route at 160 kilometres and there are less than 1,000 climbing metres on the menu.</span></p>\n<p><span>The first and only King of the Mountains sprint takes place at kilometre 72 on the Côte de Saint-Aignan. The ascent is 2.1km at just 2.9%, meaning the climb is fourth category. Ide Schelling currently leads the polka-dot jersey classification and may decide to join the breakaway to bolster his lead at this section of the stage. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/polka-dot-duel-ide-schelling-s-impressive-start-to-le-tour\">Related: Polka Dot Duel: Ide Schelling's sublime Tour debut</a></strong></em></p>\n<p><span>The intermediate sprint occurs with 56.3km remaining in Luçay-le-Mâle. With such a distance left to the finish, we will witness all of those vying for the green jersey battling for points.</span></p>\n<p><span>With around 24km remaining, the riders will travel through Levroux. The road here is dead-straight all the way until </span><span>Châteauroux. The racers will enter from the north-west side of the city with. 5.5 kilometres to go. </span></p>\n<p><span>There are a few roundabouts that must be negotiated with caution, but the first key point comes at 2.3 kilometres to go with a 90-degree left turn. There will be a mega battle for position ahead of this corner, as the next important moment comes close after: a right-hand turn with 1,600 metres of the stage remaining. This is the final corner that the riders must negotiate, so positioning here will be vital. With a long, 1,600 metre drag to the line to follow, the contenders could recover from a poor position, but it would come at the cost of vital energy reserves. </span></p>\n<h4><b>Contenders</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210626TDF1036-A.S.O._Pauline_Ballet-min_1024x1024.jpg?v=1624966118\" /></b><em>Mark Cavendish won his first Tour de France stage in Châteauroux (</em><em><span>Image credit: A.S.O./Pauline Ballet)</span></em></p>\n<p><span>The first sprint finish of the 2021 Tour de France was marred by numerous crashes which prevented many of the favourites from contending. However, Alpecin-Fenix stayed out of trouble with their three main options in </span><b>Mathieu van der Poel, Jasper Philipsen </b><span>and </span><b>Tim Merlier</b><span>. As their main rivals on the stage — Peter Sagan and Caleb Ewan — crashed out, Merlier and Philipsen went on to claim a 1-2. They have a fantastic lead out and numerous options available to them in a sprint meaning they are among the main favourites here. But will Merlier or Philipsen lead the team?</span></p>\n<p><span><strong>Mark Cavendish</strong><span> is the main topic of discussion entering stage 6. Cavendish claimed his 31st Tour de France win a couple of stages ago and is now just three behind Eddy Merckx' all-time Tour de France stage record. The 'Manx Missile' won </span><span>on both occasions the Tour de France visited </span><span>Châteauroux recently, including his first Tour de France stage victory in 2008. </span></span><span><span>Erik Zabel was third that year, and now racing against a different generation, including Zabel’s son Rick, could Cavendish make it a hat-trick in Châteauroux?</span></span></p>\n<p><b>Arnaud Démare</b><span> was one of the winningest riders in 2020 with 14 wins to his name. The Groupama-FDJ leadout train were on fine form throughout that period, but the loss of Ignatas Konovalovas on stage one has reduced the potency of the Groupama-FDJ leadout. </span><b>Jacopo Guarnieri</b><span> is still available to drop </span>Démare <span>off in the final few hundred metres, though the Frenchman hasn't been at his best at the Tour de France so far after he crashed on stage three.</span></p>\n<p><b>Wout Van Aert</b><span> stated that he wouldn’t be sprinting on stages 3 and 4, instead choosing to save as much energy as possible for the stage 5 time-trial. We wait to see whether he will sprint for stage 6 in Châteauroux.</span></p>\n<p><strong>Peter Saga</strong><span><strong>n</strong> hit the deck after colliding with Caleb Ewan in the final few hundred metres on stage three. Although the Slovakian Champion came off much better than</span><b> Caleb Ewan</b><span> — who was forced to leave the Tour de France with a broken collarbone — he still suffered a hard fall. Nonetheless, the Bora man is the king of positioning, with or without a strong team around him. He will surely be placed well in the final few hundred metres which makes him a strong contender for the stage.</span></p>\n<p><span>Trek-Segafredo have multiple options available with </span><b>Mads Pedersen, Jasper Stuyven </b><span>and </span><b>Edward Theuns. </b><span>Pedersen looked to be their lead sprinter entering the race, particularly as he was second on two stages last season, but the former World Champion crashed heavily on stage one. Who will Trek ride for here?</span></p>\n<p><span>Other riders with a chance in a bunch finish include </span><b>Christophe Laporte, Nacer Bouhanni, Cees Bol </b><span>and </span><b>André Greipel.</b></p>\n<p><em>Cover image: A.S.O./Pauline Ballet</em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"14c2db010daf73f56b5ec252bdf467659014207bdb0018c072fa2ffc54c5de12","category":"Cycling"}