{"title":"Apple’s MagSafe wireless charger is on sale for a new low price today","link":"https://arstechnica.com/?p=1763926","date":1620756882000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/dealmaster051121-800x444.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/dealmaster051121.jpg\">Enlarge</a> (credit: Ars Technica)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Today's Dealmaster is headlined by a new low price on Apple's MagSafe Charger for the iPhone 12, with the wireless charging pad <a href=\"https://amzn.to/3rGXsIk\" target=\"_blank\">marked down to just under $30</a> at Amazon and Walmart. While that's still not cheap by wireless charger standards, it is $10 off Apple's MSRP and about $5 off the usual going rate we've tracked online over the past couple of months.</p>\n<p>We recommended this charger in our <a href=\"https://arstechnica.com/gadgets/2020/12/best-magsafe-accessories-for-iphone-12/\" target=\"_blank\">guide to the best iPhone 12 accessories</a> for supplying an advertised 15 W of power to Apple's latest smartphones, which makes it technically faster than most other wireless chargers on the market. It can get an iPhone 12 from 0 to 30 percent charge in about a half-hour and 0 to 60 percent in roughly one hour. Its magnetic design aligns easily and stays attached to those devices with little fuss, and it can work through certain MagSafe-compatible cases.</p>\n<p>The usual trade-offs with wireless chargers still apply here, namely that it's not <em>truly</em> wire-free and that using a traditional <a href=\"https://amzn.to/2SzEM0O\" target=\"_blank\">USB-C-to-Lightning cable</a> with the appropriate charger will still top your device up noticeably faster. You'll need a <a href=\"https://support.apple.com/en-us/HT211829\" target=\"_blank\">20 W or higher USB-C 3.0 PD</a> wall charger on hand to reach the MagSafe Charger's maximum charging rate, too. But if you like the convenience of simply plopping your new iPhone on a pad to charge and are willing to pay a premium for the fastest wireless speeds possible, this deal should make the cost more manageable.</p></div><p><a href=\"https://arstechnica.com/?p=1763926#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763926&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"14d0602d3f981491957077a5417bbf9bb8f3cac48c71f7c0b4b52b034b6b32d2","category":"Tech"}