{"title":"Apple's In-House 5G Modem Work Faces Further Delays","link":"https://www.macrumors.com/2023/11/16/apple-in-house-5g-modem-delays/","date":1700166247000,"content":"Apple is continuing to run into troubles in its attempt to develop a 5G modem to replace Qualcomm's 5G modems in the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and other products, <a href=\"https://www.bloomberg.com/news/articles/2023-11-16/apple-project-to-replace-modems-made-by-qualcomm-falls-further-behind-to-2026\">reports <em>Bloomberg</em>'s Mark Gurman</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/5G-Modem-Feature-Blue.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nApple in 2019 acquired the <a href=\"https://www.macrumors.com/2019/07/25/apple-intel-acquisition/\">majority of Intel's smartphone business</a> and started in on a serious effort to develop its own modem hardware, but the project has suffered multiple setbacks. Apple is still \"years away\" from creating a chip that is able to perform as well as or better than chips from rival Qualcomm.\r<br />\n\r<br />\nThe Cupertino company initially wanted to have an in-house modem chip ready to go by 2024, a goal that could not be met, and now Gurman says that Apple is also going to miss an extended spring 2025 launch timeline. As of now, the modem chip launch has been postponed until the end of 2025 or early 2026, and Apple is still planning to introduce the technology in a version of the low-cost <a href=\"https://www.macrumors.com/roundup/iphone-se/\">iPhone SE</a>.\r<br />\n\r<br />\nDevelopment on a modem chip is said to be in the early stages, and it \"may lag behind the competition by years.\" One version in development does not support faster mmWave technology, and Apple has also run into issues with the Intel code that it has been working with. Rewrites have been required, and adding new features has been causing existing features to break, plus Apple has to be careful not to infringe on Qualcomm patents while developing the chip.\r<br />\n\r<br />\n\"Why we thought we could take a failed project from Intel and somehow succeed is a mystery,\" an Apple employee allegedly told Gurman. Apple's hardware technologies group is also said to be \"stretched thin\" across numerous projects, leading to difficulty resolving bugs. \r<br />\n\r<br />\nApple's dissatisfaction with Qualcomm surfaced in 2017, which is when <a href=\"https://www.macrumors.com/2019/04/16/apple-qualcomm-settlement/\">Apple sued Qualcomm</a> for unfairly collecting royalties for technologies it had nothing to do with. Apple was of the opinion that Qualcomm was charging too much for its modem chip technology.\r<br />\n\r<br />\nWith the ‌iPhone‌ 11 lineup, Apple was able to opt out of using Qualcomm chips, instead equipping iPhones with chips from Intel, but the relationship between Intel and Apple was short lived. After the launch of the ‌iPhone‌ 11, Apple wanted to continue to use Intel chips for its first 5G iPhones, the ‌iPhone‌ 12 models, but Intel could not manufacture 5G chips that <a href=\"https://www.macrumors.com/2019/04/03/intel-delays-5g-iphone-2020/\">were up to Apple's standards</a>.\r<br />\n\r<br />\nApple was instead forced to <a href=\"https://www.macrumors.com/2019/04/16/apple-qualcomm-settlement/\">settle its legal dispute</a> with Qualcomm, and all litigation was dropped. The two companies signed a new contract, which was <a href=\"https://www.macrumors.com/2023/09/11/apple-extends-deal-with-qualcomm-as-modem-delayed/\">extended in September 2023</a>. The latest deal with Qualcomm covers smartphone launches in 2024, 2025, and 2026, and will last through Apple's delayed modem chip development.\r<br />\n\r<br />\nWhile Apple's in-house modem chip has been delayed, the company is continuing development because it is eager to end its expensive deal with Qualcomm. Apple's first modem chip will be a standalone chip, but the company hopes to eventually develop a system-on-a-chip that will also cut out suppliers like Broadcom and give it more control over component development.<div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a>, <a href=\"https://www.macrumors.com/guide/qualcomm/\">Qualcomm</a>, <a href=\"https://www.macrumors.com/guide/apple-5g-modem/\">Apple 5G Modem</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/16/apple-in-house-5g-modem-delays/\">Apple's In-House 5G Modem Work Faces Further Delays</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-in-house-5g-modem-work-faces-further-delays.2411187/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"14da2b85863936b7f0e67e217a21561069628179bb1ed9b700481271013a6a3c","category":"Apple"}