{"title":"Accessible Target Sizes Cheatsheet","link":"https://smashingmagazine.com/2023/04/accessible-tap-target-sizes-rage-taps-clicks/","date":1682596800000,"content":"<p>Rage taps are annoying and frustrating. These wonderful occurrences in our interface when we need to tap twice, or sometimes three times to continue our journeys. Of course sometimes they happen because the website is too slow, but sometimes it’s the target size of interactive elements that is the culprit.</p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/01-rage-taps-metric-for-user-frustration.jpg\" /></p>\n<p>So how big should our interactive elements be these days? <strong>What would be a reliable size for icons, links and buttons</strong> — in navigation and on mobile? How do we make it more difficult for our users to make mistakes? Let’s take a look.</p>\n<p>Mobile Touch Cheatsheet (8 mins)\nRage taps are annoying and frustrating. These wonderful occurrences in our interface when we need to tap twice, or sometimes three times to continue our journeys. Sometimes they happen because the website is too slow, but sometimes it’s the target size of interactive elements that is the culprit.</p>\n<p>Rage Taps, a Metric for User Frustration, by Colin Contreary\nRage taps are a good metric for user frustration. Image source.</p>\n<p>So how big should our interactive elements be these days? What would be a reliable size for icons, links and buttons — in navigation and on mobile? How do we make it more difficult for our users to make mistakes? Let’s take a look.</p>\n<p>You can find a whole video chapter on designing for touch in <a href=\"https://smart-interface-design-patterns.com/\">Smart Interface Design Patterns</a> as well — along with 30 other chapters all around UX and design patterns.</p>\nTarget Sizes Cheatsheet\n<p>One of the common recommendations for target sizes on mobile is <strong>44×44px</strong>. This is a little bit misleading because screen pixels, or at least <em>device-independent pixels (dips)</em> are scaled to a multiple of the display resolution. So pixels are different on different screens, and when we have a conversation about sizes, we probably should be speaking about <em>dips</em>, rather than <em>pixels</em>.</p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/02-target-sizes-cheatsheet.jpeg\" /></p>\n<p>Depending on where an element appears on the screen, it needs more or less padding. In general, we are very precise in our input in the center of the screen, but we are <strong>least precise on the edges of the screen</strong> (both on the top and at the bottom).</p>\n<p>Accordion to Steven Hoober’s research in his book on <a href=\"https://www.smashingmagazine.com/2022/02/fitts-law-touch-era/\">Touch Design For Mobile Interfaces</a>, to minimize rage taps we need to aim for 11mm (or 31pt / 42px) on the top of the screen, and 12mm (or 34pt / 46px) at the bottom of the screen. In the center though, we could potentially go as low as 7mm (or 20pt / 27px). This includes both the width and padding of an interactive element.</p>\n<p><strong>How do point units translate to CSS pixels or Android/iOS units</strong>? Fortunately, Steven Hoober provides a <a href=\"https://www.4ourthmobile.com/publications/type-sizes-for-every-device-and-user\">helpful conversion table</a> to help you translate from points to px and em units, Android SPs or DPs, iOS points and Windows DIP or px.</p>\nNot All Pixels Are The Same\n<p>As we’ve seen above, target sizes change depending on where components appear on the screen. It’s worth noting that according to the <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/target-size.html\">WCAG 2.1 AAA level requirements</a>, all targets should measure <strong>at least 44 by 44px</strong>, except if the target is in a sentence or block of text. For such exceptions, we could be using 27px as a goal, but in general, the larger, the better.</p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/03-bottom-sheet-bar.jpeg\" /></p>\n<p>For sticky menus at the top or bottom of the screen, we should probably aim for around 44–46px boxes, or preferably even more. However, for links that appear on the screen as user scroll down the page, we probably will be able to avoid most issues with smaller components.</p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/04-bottom-navigation-tabs.png\" /></p>\n<p>This is also why we probably will be able to <strong>place at most 5 items in the bottom tabs</strong> on a mobile phone. Instead, we might need to use a bottom sheet that would slide up from down as an overlay on top of the screen.</p>\nPrefer “Actions” Button To Single Icons For Data Tables\n<p>Complex tables typically have <strong>hover actions</strong> that appear once a user starts hovering over a particular row. They typically include everything from highlight and export to move and delete. </p>\n<p>In testing, showing icons on hover <strong>produces too many mistakes</strong>: not only do users often accidentally jump to a wrong row as they navigate horizontally towards the icons. They also make mistakes by accidentally clicking on the wrong spot and starting all over again.</p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/05-table-hover-actions.jpeg\" /></p>\n<p>To avoid rage clicks, it might be a good idea to test how well an <strong>“Actions” buttons or a “Split”-Button</strong> would perform instead. Indeed, that button could live on every row, would open on tap/click and wouldn’t close automatically. It might not be ideal for every use case, but it definitely gives users more sense of control as they need to take an action on a row.</p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/06-actions-button.png\" /></p>\nProvide An Assistant For Complex Manipulations\n<p>With a complex manipulation such as rotation of an image, or selection of a small part of a larger area, we often rely on pinch and zoom, or zoom in/out buttons. These options of course work, but they easily become a bit tedious to use for very precise manipulations — especially if used for a while.</p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/08-assistant-pattern.png\" /></p>\n<p>Instead, we can attach a little handle to allow users to move their selection within the object faster, and with more precision. This is how <a href=\"https://tylko.com/de/kategorie/type01plywood-sideboard\">Tylko</a> allows users to customize their shelves on mobile. Zooming is supported as well, but it’s not necessary to select one of the areas.</p>\nWhen Multiple Taps Are Better Than One\n<p>But what do we do if some tap areas have to be small? Perhaps we <strong>can’t reserve 27×27px for each icon</strong> — for example, when we suggest a color selection in an eCommerce site? Well, in that case one option to consider would be to prompt a “proper” selection of colors with one additional tap. This might be a bit slower in interaction, but way more accurate.</p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/gronland-mobile-examples.gif\" /></p>\nAlways Maximize Clickable Area\n<p>Whenever possible, <strong>encapsulate the entire element</strong>, along with enough padding to ensure that you hit the magical 42–46px size to prevent rage taps for good. This typically means <strong>adding enough padding</strong> for icons but also preferring full-width or full-height bars for accordions and navigation.</p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/09-increase-clickable-area.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/10-increase-clickable-area-icon.png\" /></p>\n<p>Ahmad Shadeed presents <a href=\"https://ishadeed.com/article/clickable-area/\">a few useful examples of using spacing</a> to increase clickable areas and prevent rage clicks. Any Lupe provides even more suggestions in her article on <a href=\"https://craftcms.com/blog/accessible-target-sizes\">accessible target sizes</a>.</p>\nWrapping Up\n<p>When designing for touch today, we need to use <strong>at least 27×27px for small links</strong> or icons in the content area, and at least 44×44px for icons at the top and at the bottom of the page.</p>\n<p><img src=\"https://files.smashing.media/articles/accessible-tap-target-sizes-rage-taps-clicks/11-click-areas.jpeg\" /></p>\n<p>Personally, I would always go up to <strong>30×30px</strong> and <strong>48×48px</strong> to make sure mistakes are really difficult to make. And of course, always use full width or full height for the clickable areas. Hopefully this will help us remove rage taps from our websites altogether — and many of your users would sincerely appreciate it.</p>\n<p>You can find more details on <strong>navigation UX</strong> in the <a href=\"https://smart-interface-design-patterns.com\">video library on Smart Interface Design Patterns</a> 🍣 — with a live UX training that’s coming up in September this year.</p><p></p>\nUseful Resources\n<p>There are a few wonderful resources on accessible target sizes that might be helpful if you’d like to dive deeper in the topic:</p>\n<ul>\n<li>“<a href=\"https://craftcms.com/blog/accessible-target-sizes\">Accessible Target Sizes</a>,” by Amy Lupe</li>\n<li>“<a href=\"https://www.nngroup.com/articles/touch-target-size/\">Touch Targets on Touchscreens</a>,” by Aurora Hailey</li>\n<li>“<a href=\"https://ishadeed.com/article/clickable-area/\">Enhancing the Clickable Area</a>,” by Ahmad Shadeed</li>\n<li>“<a href=\"https://css-tricks.com/looking-at-wcag-2-5-5-for-better-target-sizes/\">WCAG 2.55 for Better Target Sizes</a>,” by Todd Libby</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/02/fitts-law-touch-era/\">Fitt’s Law In The Touch Era</a>,” by Steven Hoober</li>\n<li>“<a href=\"https://www.smashingmagazine.com/printed-books/touch-design-for-mobile-interfaces/\">Touch Design For Mobile Interfaces</a>,” by Steven Hoober</li>\n<li>“<a href=\"https://www.4ourthmobile.com/publications/type-sizes-for-every-device-and-user\">Type Sizes for Every Device</a>,” by Steven Hoober</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"14df8d8fed7ec324f614f90299f8f36ebe066963d1febb3445101f93b3060863","category":"Tech"}