{"title":"342 Sow weight development: A pragmatic approach to crossbred and selection populations","link":"https://academic.oup.com/jas/article/102/Supplement_3/45/7757215?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Feed used for maintenance in sows is around 1% of their live weight, and a 10 kg greater sow body weight (BW) from first lifetime insemination onwards requires 36.5 kg extra feed for maintenance annually, which increases the feed cost for a 1,000-sow operation unit by approximately $15,000 CAD per year. Genetic selection, through emphasis on feed efficiency, changes body development year after year. Phenotypic sow development should allow for adequate litter weight, litter size and longevity for an optimum lifetime production. In this study we wanted to understand sow mature weight and its variation. Sow BW (n = 14,554 of 5,292 sows) around farrowing and litter weights were collected on two crossbred and one purebred farm with industry accepted feeding protocols; that is, limited feeding at the different stages of production. Sow BW were corrected for stage of gestation and realized litter weights to represent empty BW at the day of farrowing. Body weight at the age of first insemination was added. When estimating genetic parameters, the statistical model for sow BW included, in addition to Line and HerdYearSeason, a rate parameter as a covariate (b<sub>1</sub>*AGE <sup>-1</sup>) within Farm. A bivariate analysis applying a repeatability model for the BW of purebred and crossbred animals yielded similar heritabilities (h<sup>2</sup> = 0.58 ± 0.05 and h<sup>2</sup> = 0.55 ± 0.05, for purebred and crossbred, respectively), and greater relevant genetic variances (335 ± 40 and 166 ± 13 kg<sup>2</sup>) with a clearly positive, but not significant genetic correlation of 0.49 ± 0.46. The (random) effect of a permanent environment was not significant for either characteristic. A second analysis in which genetic parameters were estimated simultaneously for the plateau and the rate parameter showed that genetic selection based on the repeatability model for BW only, affected both the plateau and the rate parameter. Only crossbreds were included in this analysis because the minimum required BW observations per sow were not met for purebred animals. Selection for mature BW might affect other key traits. The phenotypic correlations between the EBVs for the BW of crossbred sows and litter weight, litter size and longevity were -0.15, -0.02 and +0.02, respectively. Genetically heavier or smaller animals do not have better production with heavier ones possibly having slightly decreased performance. However, if animals are treated as equally and uniformly as possible, it is reasonable to assume that genetically heavier animals use more feed for growth, instead of for reproduction, given equal feeding rations. Heritability estimates point to a clear genetic drive to BW development. This study shows the relevance of weight observations at nucleus level and the necessity to estimate genetic correlations with production traits.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"14f2b632285ea0d07d0a52ae7695f375bfef7d4d35f8155ba8a3f7da2cd593ac","category":"Environment"}