{"title":"Physicists discover new kind of tetraquark—the longest-lived yet found","link":"https://arstechnica.com/?p=1784919","date":1628529086000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/tetraquarkTOP-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/tetraquarkTOP.jpg\">Enlarge</a> <span>/</span> An artist’s impression of Tcc+, a tetraquark composed of two charm quarks and an up and a down antiquark. (credit: CERN)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The exotic family of particles known as <a href=\"https://en.wikipedia.org/wiki/Tetraquark\">tetraquarks</a> has a surprising new member. Dubbed T<sub>cc</sub><sup>+</sup>, it's the first tetraquark to contain two heavy quarks and two light antiquarks, and it's the longest-lived exotic matter particle yet discovered. Representatives for the <a href=\"https://home.cern/science/experiments/lhcb\">LHCb collaboration</a> at CERN's Large Hadron Collider <a href=\"https://phys.org/news/2021-07-exotic-particle-tetraquark.html\">made the announcement</a> last week at the European Physical Society Conference on High Energy Physics in Germany, hosted jointly by Universität Hamburg and DESY.</p>\n<p>Quarks are the most fundamental building blocks of matter, first proposed in 1964 by Murray Gell-Mann and George Zweig. Quarks come in six different flavors, all differing in mass and charge: up, down, strange, charm, bottom, and top (from lightest to the heaviest), along with their corresponding antiquarks. They typically clump together in groups of two or three to form hadrons, held together by force-carrying particles known as gluons. Ordinary baryons are hadrons that include the proton and neutron of an atom, each made up of three-quark combinations, while hadronic particles known as mesons are formed from quark-antiquark pairs. Think of quarks as the LEGO bricks of the subatomic world, mixing and matching in various combinations to form more complicated structures.</p>\n<p>Gell-Mann thought there might be more exotic hadrons formed from quark combinations of four or even five quarks, but these existed solely in the realm of theory until quite recently. That's because such exotic heavy particles decay very rapidly into more stable byproduct particles within fractions of a second. It's those byproducts that show up in particle accelerator detectors, amounting to distinctive signatures for their heavier precursor particles. But it's extremely difficult to tease out those signatures from all the noise in the vast amounts of data produced in particle collisions.</p></div><p><a href=\"https://arstechnica.com/?p=1784919#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1784919&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"14ff114cf3289d776a402115ee8b169f2ec49166a48275637027e6a4333e0f24","category":"Tech"}