{"title":"Revisiting post‐settlement dynamics and mechanisms for a depleted American lobster (Homarus americanus) stock","link":"https://onlinelibrary.wiley.com/doi/10.1111/fog.12689?af=R","date":1721984986000,"content":"<h2>Abstract</h2>\n<p>Environmentally explicit models can improve model performance and our understanding of biological processes. However, these models must be retested over time, as the mechanisms influencing biological processes can change. The relationship between recently settled young-of-year (i.e., settlers) and pre-recruit American lobsters was revisited to determine if our perception on post-settlement lobster processes has changed. Analyses were focused within the southern region of the species' latitudinal range (Rhode Island, United States), where several environmental factors have been theorized to contribute to the Southern New England stock decline and continued depleted state. The inclusion of additional, recent years' data provided insight on how the density-dependent nature of the settler–pre-recruit lobster relationship has varied over time. Including both new and retested environmental drivers reaffirmed the importance of incorporating environmental data when describing this process. Specifically, modeling revealed the importance of epizootic shell disease, finfish predators, and Asian shore crabs in the settler–pre-recruit relationship. Including disease, predation, and competition metrics in the lobster post-settlement relationship has allowed for improved modeling and insight into settlement dynamics. This renewed analysis supports reevaluating environmentally explicit models over time and calls for further directed research regarding the biological processes we seek to model with time series data.</p>","author":"M. Conor McManus","siteTitle":"Wiley: Fisheries Oceanography: Table of Contents","siteHash":"ddf10675d11d4e916ea2c59904318f6a27094a133dc6841be0937d77cc7558c9","entryHash":"150345cf82556de31601c4892d7e8b22449273ef264cebfc7cc29ab74e95f19f","category":"Environment"}