{"title":"Impacts of Fintech and natural resources on environmental quality: The role of renewable energy and carbon taxes: A panel QARDL approach","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12534?af=R","date":1722431308000,"content":"<h2>Abstract</h2>\n<p>The world is currently suffering from a significant environmental crisis characterized by global warming, rising sea levels, foods, and droughts. This has adversely affected the poorest nations, resulting in increased occurrences of both droughts and flooding that impact their means of livelihood. In order to address this issue, countries globally need to develop policies that efficiently reduce environmental destruction and achieve zero carbon emissions. A number of empirical estimates were used in this study. The Friedman, Frees, and Pesaran tests are used to evaluate cross-sectional dependence. Unit root tests, such as the augmented Dickey–Fuller test, are used to assess the stationarity of variables. The Pedroni test is used in co-integration analysis to find the long-term relationships between variables, and a novel Panel quantile auto-regression distributed lag methodology to investigate both long-term and short-run dynamics across G-17 countries spanning from 2000 to 2021. The results clarify the pivotal role of carbon taxes, technological innovation, and renewable energy consumption in reducing carbon dioxide (CO<sub>2</sub>) emissions, thereby enhancing environmental quality, while the sustained use of natural resources is harmful to environmental quality. Furthermore, the finding reveals that Fintech's association with CO<sub>2</sub> emissions negatively impacts environmental quality. The study also demonstrates the efficacy of environmental taxes in reducing CO<sub>2</sub> emissions across, supporting for higher carbon pricing as a viable policy tool for environmental protection.</p>","author":"Javid Ali, \nXihao Wu, \nMuhammad Akhtar Alam, \nManzar Rehman, \nAtif Jahanger, \nShayan Khan Kakar, \nSidra Khan","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"1503b05b32ee44194efe37d1c46f2f1bb53797c857baabefe23c20552e54794f","category":"Environment"}