{"title":"Rocket Report: SpaceX plans a Falcon 9 flurry, Bill Gates buys into rockets","link":"https://arstechnica.com/?p=1819851","date":1639742455000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/10/Blue-Origin-BE4-3-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/10/Blue-Origin-BE4-3.jpg\">Enlarge</a> <span>/</span> Blue Origin's BE-4 engine hot-fire tests take place at the company's facility in West Texas. (credit: <a href=\"https://www.blueorigin.com/\">Blue Origin</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 4.26 of the Rocket Report! This will be the final edition of 2021 due to a forthcoming (and much-needed) holiday break. As I write this, NASA and the European Space Agency are debating whether to press ahead with a launch attempt of the James Webb Space Telescope on December 24 or a few days later. Whenever the $10 billion telescope flies, my single Christmas wish is for a safe launch and deployment sequence. See you in 2022.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Blue Origin launches six people for the first time</strong>. On Saturday, the company's New Shepard capsule sent six people on a suborbital trip for the first time, increasing the number of passengers from four. Laura Shepard Churchley, daughter of Mercury astronaut Alan Shepard, and former NFL football player Michael Strahan were invited guests along with four paying customers.</p></div><p><a href=\"https://arstechnica.com/?p=1819851#p3\">Read 26 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1819851&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"150575f592140bc1fe763cb990c92c649fe2b55c1a2e42dbd9e0fcfa7ef55c3e","category":"Tech"}