{"title":"After slow start, NOAA predicts rest of hurricane season to be “above normal”","link":"https://arstechnica.com/?p=1960369","date":1691764600000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/sanibel-800x533.jpg\" alt=\"aerial view of hurricane damage\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/sanibel.jpg\">Enlarge</a> <span>/</span> In Florida, parts of the Sanibel Causeway to Sanibel Island are washed away, along with sections of the bridge to the island, after Hurricane Ian passed through the area in September 2022. The hurricane brought high winds, storm surge and rain to the area causing severe damage (credit: Joe Raedle/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>NOAA forecasters are upping their expectations for the 2023 hurricane season, based on record-warm Atlantic sea surface temperatures.</p>\n<p>The National Oceanic and Atmospheric Administration announced Thursday that <a href=\"https://www.noaa.gov/news-release/noaa-forecasters-increase-atlantic-hurricane-season-prediction-to-above-normal\">forecasters have increased</a> the likelihood of an above-normal season to 60 percent. The forecasters now expect 14 to 21 named storms, including six to 11 hurricanes and two to five major hurricanes of category 3, 4, or 5 strength, packing sustained winds of 111 miles an hour or more.</p>\n<p>In May, the forecasters at NOAA’s Climate Prediction Center had projected a 30 percent chance of an above-normal season and thought a near-normal season was more likely, with 12 to 17 named storms. They said Thursday the revised forecast, issued routinely in August near the heart of the season, was based on Atlantic sea surface temperatures that have not been seen since record-keeping began in 1950, said Matthew Rosencrans, lead hurricane season forecaster at the Climate Prediction Center, a division of the National Weather Service.</p></div><p><a href=\"https://arstechnica.com/?p=1960369#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1960369&amp;comments=1\">Comments</a></p>","author":"Inside Climate News","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"150a8caa5d319f4f5539a120316d900a84ce4733a6a5cdffb9cadfce36335769","category":"Tech"}