{"title":"Mass exploitation of critical MOVEit flaw is ransacking orgs big and small","link":"https://arstechnica.com/?p=1945579","date":1686020708000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/broken-glass-car-breakin-800x588.jpg\" alt=\"Mass exploitation of critical MOVEit flaw is ransacking orgs big and small\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/broken-glass-car-breakin.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Organizations big and small are falling prey to the mass exploitation of a critical vulnerability in a widely used file-transfer program. The exploitation started over the Memorial Day holiday—while the critical vulnerability was still a zeroday—and continues now, some nine days later.</p>\n<p>As of Monday evening, payroll service <a href=\"https://www.zellis.com/resources/press-and-media/press-statement-on-moveit-transfer-data-breach/\">Zellis</a>, the Canadian <a href=\"https://novascotia.ca/news/release/?id=20230604003\">province of Nova Scotia</a>, British Airways, the BBC, and UK retailer Boots were all known to have had data stolen through the attacks, which are fueled by a recently patched vulnerability in MOVEit, a file-transfer provider that offers both cloud and on-premises services. Both Nova Scotia and Zellis had their own instances or cloud services breached. British Airways, the BBC, and Boots were customers of Zellis. All of the hacking activity has been attributed to the Russian-speaking Clop crime syndicate.</p>\n<h2>Widespread and rather substantial</h2>\n<p>Despite the relatively small number of confirmed breaches, researchers monitoring the ongoing attacks are describing the exploitation as widespread. They liken the hacks to smash-and-grab robberies, in which a window is broken and thieves grab whatever they can, and warned that the quick-moving heists are hitting banks, government agencies, and other targets in alarmingly high numbers.</p></div><p><a href=\"https://arstechnica.com/?p=1945579#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1945579&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"150cabfa3260ee19798f65d53862a3dc9ca69ec0390bad503bec30e54bf2e6e5","category":"Tech"}