{"title":"Joanna Stern Interviews Craig Federighi Regarding Apple’s Controversial New Child Safety Features","link":"https://www.youtube.com/watch?v=OQUO1DSwYN0","date":1628876468000,"content":"\n<p>Clarifying interview, with at least one bit of news: Federighi says the heretofore unspecified “threshold” for CSAM fingerprint matches that must be reached before an iCloud account is flagged (or even <em>can</em> be flagged, thanks to how the shared-key cryptography is implemented) is “on the order of 30 known child pornographic images”. Right around the 3:00 mark:</p>\n\n<blockquote>\n  <p>“And if, and only if you meet a threshold of something on the order\nof 30 known child pornographic images matching, only then does\nApple know anything about your account and know anything about\nthose images.”</p>\n</blockquote>\n\n<p><a href=\"https://www.wsj.com/articles/apple-executive-defends-tools-to-fight-child-porn-acknowledges-privacy-backlash-11628859600\">There’s also a WSJ news story</a> (<a href=\"https://apple.news/AMZjSJNYnTHOW54WgegR5KA\">News+ link</a>), co-bylined by Stern and Tim Higgins, in which Federighi emphasizes that the database of CSAM fingerprints is auditable:</p>\n\n<blockquote>\n  <p>Beyond creating a system that isn’t scanning through all of a\nuser’s photos in the cloud, Mr. Federighi pointed to another\nbenefit of placing the matching process on the phone directly.\n“Because it’s on the [phone], security researchers are constantly\nable to introspect what’s happening in Apple’s [phone] software,”\nhe said. “So if any changes were made that were to expand the\nscope of this in some way — in a way that we had committed to not\ndoing — there’s verifiability, they can spot that that’s\nhappening.”</p>\n\n<p>Critics have said the database of images could be corrupted, such\nas political material being inserted. Apple has pushed back\nagainst that idea. During the interview, Mr. Federighi said the\ndatabase of images is constructed through the intersection of\nimages from multiple child-safety organizations — not just the\nNational Center for Missing and Exploited Children. He added that\nat least two “are in distinct jurisdictions.” Such groups and an\nindependent auditor will be able to verify that the database\nconsists only of images provided by those entities, he said.</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/08/13/stern-federighi-interview\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"150f63ed22eb3a7d8fa16a58e5e06a3f1617275f2732efd73855f413c5d44477","category":"Tech"}