{"title":"อินเทลดึงอดีตหัวหน้าทีมออกแบบ Skylake กลับมาคุมทีมซีพียูฝั่งไคลเอนต์","link":"https://www.blognone.com/node/123610","date":1625662212000,"content":"<div><div><div><p>อินเทลยุคใหม่ภายใต้การนำของ Pat Gelsinger กำลังไล่ดึงตัววิศวกรระดับหัวกะทิกลับมายังบริษัท ล่าสุดประกาศดึง Shlomit Weiss อดีตหัวหน้าทีมออกแบบ Sandy Bridge และ Skylake กลับมาดำรงตำแหน่งหัวหน้าทีมออกแบบชิปสายคอนซูเมอร์ทั้งหมด</p>\n<p>เส้นทางชีวิตของ Weiss น่าสนใจตรงที่เธอเป็นผู้หญิงแถวหน้าของวงการออกแบบซีพียู เธอเป็นวิศวกรชาวอิสราเอลที่ทำงานกับอินเทลมาตั้งแต่ปี 1989 โดยมีตำแหน่งสุดท้ายเป็นหัวหน้าศูนย์พัฒนาซีพียูฝั่งศูนย์ข้อมูล ในปี 2017 จึงย้ายงานไปพัฒนาหน่วยประมวลผลเครือข่ายให้ Mellanox ในอิสราเอล ก่อนที่ <a href=\"https://www.blognone.com/node/108577\">Mellanox ถูก NVIDIA ซื้อกิจการในปี 2019</a> ทำให้เธอย้ายมาเป็น Senior Vice President Silicon Engineering ให้ NVIDIA ด้วย</p>\n<p>การกลับมาที่อินเทลรอบนี้ เธอจะรับตำแหน่งผู้จัดการใหญ่ร่วมของ Design Engineering Group (DEG) ร่วมกับอดีตพนักงานของอินเทลอีกคน Sunil Shenoy ที่ถูกดึงกลับมาอีกครั้ง</p>\n<p>ผลงานของ Weiss ในช่วง Skylake ยิ่งถือว่าน่าประทับใจเมื่อเวลาผ่านไปจากนั้นอีกหลายปี เพราะอินเทลติดๆ ขัดๆ เรื่องการข้ามผ่าน 14 นาโนเมตร ทำให้สถาปัตยกรรม Skylake ที่ออกในปี 2015 (6th Gen) ถูกนำมาใช้เป็นอาวุธขัดตาทัพต่อมาอีกนาน (Comet Lake ที่ออกในปี 2019 นับเป็น 10th Gen ก็อิงอยู่บน Skylake) และยังสามารถใช้ทานกระแส Ryzen ได้นานกว่าที่หลายๆ คนคาดไว้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e76a2a2623b0dc1975aaed7ba767d006.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.tomshardware.com/news/intel-skylake-chip-architect-returns-shlomit-weiss-gelsinger\">Tom's Hardware</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/intel\">Intel</a></div><div><a href=\"/topics/cpu\">CPU</a></div><div><a href=\"/topics/skylake\">Skylake</a></div><div><a href=\"/topics/mellanox\">Mellanox</a></div><div><a href=\"/topics/nvidia\">NVIDIA</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"15145a211fda3319d9402f527537a769206b8e7a5ab520f989f1405a7650ff7d","category":"Thai"}