{"title":"Why the M2 Macs probably aren’t worth waiting for","link":"https://www.macworld.com/article/547795/apple-silicon-m1-pro-m2-specs-speed.html","date":1635954280000,"content":"<div>\n<section><div></div></section><p>Even before Apple’s M1 Pro and M1 Max MacBooks hit the market, rumblings of <a href=\"https://www.macworld.com/article/350372/apple-silicon-m1-m1x-m2-processor-cpu-gpu.html\">future Apple silicon</a> were already hitting the wire. Dubbed the M2, this chip is the likely successor to the M1 that powers the <a href=\"https://www.macworld.com/article/234819/macbook-air-m1-review-an-absolutely-stunning-debut-for-apple-silicon-in-a-mac.html\">MacBook Air</a>, <a href=\"https://www.macworld.com/article/234838/13-inch-macbook-pro-m1-review-amazing-breakthroughs-in-processing-and-battery-performance.html\">13-inch MacBook Pro</a>, <a href=\"https://www.macworld.com/article/234842/m1-mac-mini-review-the-mac-with-the-best-ever-bang-for-your-buck.html\">Mac mini</a>, and the <a href=\"https://www.macworld.com/article/347534/24-inch-imac-review-apple-design-display-colors-storage-upgradability-price.html\">24-inch iMac</a>. According to reports, it will arrive in the first half of 2022.</p>\n\n\n\n<p>And look at the calendar—2022 is just around the corner. So if you’re wondering whether you should wait for the M2 instead of investing in an M1 MacBook Air or M1 Pro MacBook Pro, we’re here to help.</p>\n\n\n\n<h2>M1, M1 Pro, and M1 Max</h2>\n\n\n\n<p>Apple’s first three Mac chips are all built on the same architecture but they’re quite different:</p>\n\n\n\n<div><div>\n<figure><table><thead><tr><th></th><th>M1</th><th>M1 Pro</th><th>M1 Max</th></tr></thead><tbody><tr><td>CPU Cores (Performance)</td><td>4</td><td>6/8</td><td>8</td></tr><tr><td>CPU Cores (Efficiency)</td><td>4</td><td>2</td><td>2</td></tr><tr><td>GPU Cores</td><td>7/8</td><td>16</td><td>24/32</td></tr><tr><td>NPU Cores</td><td>16</td><td>16</td><td>16</td></tr><tr><td>Memory</td><td>8GB/16GB</td><td>16GB/32GB</td><td>32GB/64GB</td></tr></tbody></table></figure></div></div>\n\n\n\n<p>As you can see the chips are quite different. While they’re all built on the same 5nm die process, the M1 Pro has much more power, especially when using apps that take advantage of more than one core. The M1 is a very good chip, but the M1 Pro is a great one with mind-blowing speeds and excellent upgrade options. As you can see in the CPU benchmarks below, the extra cores go a long way and that’s before you take graphics and RAM into account. Apple has delivered a chip that’s great for pros but might be <em><a href=\"https://www.macworld.com/article/547584/m1-pro-vs-m1-max-macbook-pro-cpu-gpu-memory.html\">too fast</a></em> for casual users.</p>\n\n\n\n\n\n\n\n\n<h2>M2: Specs and speed</h2>\n\n\n\n<p>According to several reports, the M2 will make its debut in the next MacBook Air. It will be faster than the M1, but Bloomberg <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-01-22/apple-aapl-plans-new-macbook-air-with-magsafe-macbook-pro-with-sd-card-slot&amp;xcust=1-1-547795-1-0-0&amp;sref=https://www.macworld.com/feed\">reports</a> that it will have the same number of CPU cores as the M1 and up to 10 graphics cores. That would put the M2 closer to the M1 than the M1 Pro.</p>\n\n\n\n<p>The M2’s debut in Apple’s thinnest and lightest laptop says a lot about the chip. Like the current MacBook AIr, <a href=\"https://www.macworld.com/article/546465/2022-macbook-air-m2-design-display-rumors.html\">reports</a> say the 2022 MacBook Air won’t have a fan for cooling, which could mean Apple will be limiting the M2’s performance in order to maintain a proper operating temperature. If <a href=\"https://www.macworld.com/article/450981/iphone-13-pro-review.html\">the A15</a> is any indication, the M2 chip could bring a single-core performance boost of roughly 10 percent over the M1 and 20 percent better multi-core CPU performance. On the GPU side, we saw speeds that were 40 to 50 percent faster than the iPhone 12’s A14 chip when compared with the higher-end iPhone 13 Pro and about 25 percent higher with the 4-core GPU in the iPhone 13.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macbook-air-m1.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The 2022 MacBook Air could look very different from the current Air (pictured), and it could have an M2 chip.</p></figcaption></figure><p>Jason Cross/IDG</p></div>\n\n\n\n<p>Compared to the M1, we’ll probably see the M2 increase in CPU performance to be about 15 percent with a bigger jump in GPU performance. The M1 Pro, with its eight or 10 CPU cores (two efficiency cores, the rest are performance cores), boasts multi-core CPU performance that’s about 70 percent better than the M1, so even with a nice increase, the M2 will still be significantly slower overall than the M1 Pro.</p>\n\n\n\n<h2>M2 vs M1 Pro: No comparison</h2>\n\n\n\n<p>The M1 Pro is built for software that can take advantage of multi-core processing and GPUs. If you’re a pro who uses CPU-intensive apps, don’t wait, invest in an M1 Pro MacBook Pro now. Based on what we know about the M2, it will offer a decent improvement over the M1 and creep a little closer to the M1 Pro, but not enough to anywhere near matching it.</p>\n\n\n\n<p>But for common tasks, the M2 could be still faster than Apple’s flagship processors. The M1 Pro’s single-core performance is essentially the same as the M1 (which is expected, since the M1 Pro is based on the M1), and if the M2 follows the path of the A15, single-core speed will be a bit faster than all of the M1 chips, including the Pro and the Max.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/14-inch-macbook-pro-3.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The 14-inch MacBook Pro has a great screen—but it wouldn’t be anything without the M1 chip.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>If the idea that the M2’s single-core performance could be better than the M1 Pro piqued your interest, an M1 Pro—and probably any subsequent Pro chip—is overkill for what you do in the first place. Single-core performance is important for common apps such as Mail and Photos, so the speed gains there could be more worthwhile than the multi-core performance of the M1 Pro. But the M1 is already great for that stuff, so we’d recommend one of those unless you’re interested in the MacBook Air’s rumored redesign—at which point the chip doesn’t really matter.</p>\n\n\n\n<p>There’s also the question of the 13-inch MacBook Pro: Will Apple decide to keep it, and if so, will it get an M2? The current model has the same chip as the MacBook AIr, but its fan keeps things a little cooler so it can run at higher speeds for longer. In our testing, the 13-inch M1 MacBook Pro was marginally faster than the M1 MacBook Air, though the MacBook Pro can sustain its speeds longer than the Air, and we expect similar results for the M2. That’s still not enough incentive to wait for an M2 instead of buying an M1 Pro.</p>\n\n\n\n<h2>M2 Pro: The future</h2>\n\n\n\n<p>According to rumors, Apple isn’t done with the M1 Pro and M1 Max. Far from it. The new chips will likely end up in at least two more Macs in 2022: the <a href=\"https://www.macworld.com/article/349270/2022-imac-pro-32-inch-design-processor-display-ports-price-release.html\">27-inch iMac</a> and the <a href=\"https://www.macworld.com/article/347466/2021-mac-mini-design-m1x-price-release.html\">high-end Mac mini</a>. </p>\n\n\n\n<p>So what about an M2 Pro? That’s surely coming after the M2, but it could be a while. The M1 Pro just made its debut, and the rumor is that the new M2 MacBook Air won’t be available until mid-2022, about 18 months after the M1 was released. If a Pro chip is on a similar 18-month cycle, the M2 Pro won’t be available until 2023. So if you’re happy with your M1 or Intel-based MacBook Pro that you bought in the past year, the M2 will be ready right around the time you’re looking to upgrade.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1514ff4f2f79772855d33cf0e5cfb4cc1c93ad90d024a28f952afede6dc6f14c","category":"Apple"}