{"title":"Strade Bianche: 2021 Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-2021-preview","date":1614112089000,"content":"\n      <p>Without question, Strade Bianche is one of, if not the most, beautiful races of the season.</p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>Strade Bianche on Saturday 6th March is the first WorldTour level classic that takes place on Italian soil. The race takes place in central Italy, just south of Firenze in Tuscan hills, making for a stunning setting.</p>\n<p class=\"p1\"><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related – The 2021 Men's Early Season: The Rouleur Racing Guide</a> <br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">Related – </a></strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\"><strong><span class=\"s1\">The Women's 2021 Early Season: The Rouleur Racing Guide</span></strong></a></em></p>\n<p>The riders will take on over 3000 metres of climbing throughout the day, which is incredible because there are few climbs longer than one kilometre in length. Constant short hills and descents await the competition, making this a race of attrition. Strade Bianche is unique in the sense that gravel roads are scattered throughout, a rare sight in a road race. The winner must be strong in many senses if they are to cross the line victorious in Siena.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Strade_1024x1024.png?v=1613667985\" alt=\"Strade Bianche\"></p>\n<p><em>Strade Bianche, 2021 profile (via La Flamme Rouge)</em></p>\n<p>Only 42 of the 166 starters finished the race in 2020, displaying Strade’s brutality perfectly. Wout Van Aert won solo in Siena that day after attacking with 12km to go, dropping Davide Formolo and Maxi Schachmann, who both finished on the podium.</p>\n<p>It was Van Aert’s first of six victories in 2020 on the road. He will kick-off his 2021 season in Italy as he looks to make it back-to-back victories on the famous white Italian roads. He perhaps starts as the out-and-out favourite. As ever, though, the competition is stellar.</p>\n<p>2019 winner Julian Alaphilippe is back after missing the race in 2020. Deceuninck have a strong line-up in Italy, where 2015 winner Zdeněk Štybar will join Alaphilippe. The Czech man has wracked up a series of impressive results here — since his win in 2015 he has finished in the top-10 every year.</p>\n<p>Jakob Fuglsang is a force to be reckoned with in the Classics. He was just beaten to the line by Alaphilippe in 2019 and finished in the top-five last year. Although he has never won the race, Fuglsang will start as a premier contender.</p>\n<p>UAE-Team Emirates finished second last year with Davide Formolo, and clearly have intentions of going one better this year, bringing Marc Hirschi and Tadej Pogačar to join up with Formolo in Italy. We know Formolo can go well here, and although Hirschi and Pogačar have never finished in the top-ten, the race should suit them.</p>\n<p>Tim Wellens is a rider who always starts the season well and proved that again this year by winning a stage and the overall classification at Étoile de Bessèges. He has only ridden Strade twice but finished in the top-ten on both occasions, including a podium finish in 2017.</p>\n<p>Strade Bianche is one race that Greg Van Avermaet is yet to conquer in his illustrious career. He finished second in 2015 and 2017, beaten by Štybar and Kwiatkwoski respectively. After finishing eighth in 2020, GvA will look to put that record straight with his new team AG2R Citroën.</p>\n<p>Trek-Segafredo look well equipped to contend on the white roads of Tuscany with numerous riders that have won already in 2021. Bauke Mollema is in good shape after winning at the Tour des Alpes, but Gianluca Brambilla also won there, taking the overall classification too. Brambilla has come close to winning this race before when he finished 3rd in 2016. Trek also have second-year pro Quinn Simmons who possesses bags of potential.</p>\n<p>Oh yeah, one more rider we should mention, Mathieu van der Poel – heard of him? He only managed 15th<span> </span>last year in his first appearance at the race, but the gravelled, hilly roads should suit his style. He will be disappointed not to improve on that result this year.</p>\n<p><strong>Favourites:</strong><span> </span>Jakob Fuglsang, Julian Alaphilippe, Wout Van Aert, Zdeněk Štybar, Tim Wellens</p>\n<p><strong>Outsiders:</strong><span> </span>Tom Pidcock, Matej Mohorič, Søren Kragh Andersen, Quinn Simmons</p>\n<p><em>Cover image: LB/RB/CorVos/SWpix</em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"15178d90eec261ca2cdd97133b34ea13d04b1b937dc796f1d50de27a89230ce6","category":"Cycling"}