{"title":"Public EV charging keeps getting worse, according to new study","link":"https://arstechnica.com/?p=1961182","date":1692200854000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1232464216-800x533.jpg\" alt=\"A dark Chevy Bolt charges at an EVgo charger at Union Station in Washington DC\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1232464216-scaled.jpg\">Enlarge</a> (credit: Drew Angerer/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Despite growing electric vehicle adoption in the US, satisfaction with the electric vehicle charging experience continues to suffer. That's according to a new study on the EV public charging experience conducted by JD Power, which together with PlugShare has been asking EV owners about their satisfaction levels since 2021. This year, the study found that people are unhappy with charge times, and one in five reported visiting a charger but being unable to charge.</p>\n<p>The not-great state of public EV charging is a topic of much conversation—<a href=\"https://arstechnica.com/cars/2022/07/electric-cars-are-doomed-if-fast-charger-reliability-doesnt-get-better/\">a story about fast charger reliability</a> garnered almost 1,200 comments last year. Just about everyone who has tried to fast-charge a non-Tesla EV will have a horror story or two, and it's a problem the automakers are well aware of.</p>\n<p>That's why the past few months have seen a flurry of announcements from car companies announcing a switch from the Combined Charging Standard 1 plug—until now, the de facto industry standard for non-Tesla EVs—to Tesla's North American Charging Standard (NACS) plug. In doing so, those OEMs gain access to the Tesla Supercharger network for their customers starting in 2024.</p></div><p><a href=\"https://arstechnica.com/?p=1961182#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1961182&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"151f1ad88e0070ee6ca255dd6f601ed1248b427641c204d87cf7a23ee9f37446","category":"Tech"}