{"title":"The Westfjords Way: Bicycle Touring One of Iceland’s Most Remote Areas – Part 03 – Rugile Kaladyte, Lael Wilcox, & Evan Ruderman","link":"https://theradavist.com/2021/09/the-westfjords-way-bicycle-touring-one-of-icelands-most-remote-areas-part-03/?utm_source=rss&utm_medium=rss&utm_campaign=the-westfjords-way-bicycle-touring-one-of-icelands-most-remote-areas-part-03","date":1631707217000,"content":"<p>There’s a place to get soup at the halfway point. We’ll stop there. They might have some dried fish and rugbraud to pack for dinner– traditional Icelandic bread; dark, dense, and sweet. In the past, the locals dug holes and used the heat from geothermal water to bake the bread. We pack a sandwich to go, throw a leg over the top tube and let the wind carry us down the way. When the wind is your friend, there’s no feeling like it.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/02-Westfjords-Way-%E2%80%94-Rugile-Kaladyte-%E2%80%94-Part-Three-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>With storms and high wind in the forecast, we plan on a short day, a 60km ride to a cabin to regroup, look at the map and make plans for the rest of the trip. It’s drizzling and gusty. We sail to the soup spot, a nice place to warm up. There are sheepskins and wool sweaters for sale and a woman playing piano in the corner. We serve ourselves bowls of creamy cauliflower soup and put slices of bread in the toaster. With only 30km to go and a tailwind to take us there, we don’t rush.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/36-Westfjords-Way-%E2%80%94-Evan-Ruderman-%E2%80%94-Part-Three.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/09/06-Westfjords-Way-%E2%80%94-Evan-Ruderman-%E2%80%94-Part-Three.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>There’s a minifridge with cartons of local eggs, handpicked wild blueberries, rugbraud, donuts, and dried fish. The proprietor boils our eggs, so they’re easier to pack on the bikes. We take one of everything, stuff it in the packs and get back on the road. The wind pushes us to the cabin on the coast. A couple of boys meet us on bikes at the entrance to the driveway and we all ride in together. The front door of the main house opens, a family of seven is framed in the doorway. They wave. The owner explains that all of her grandchildren are here for her 60th birthday.</p>\n<p>She shows us to our cabin. “Would you like milk?”</p>\n<p>She brings over a gallon glass jar and the fixings for mushroom soup– hand-picked chanterelles, butter, flour, cream, and salt.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/16-Westfjords-Way-%E2%80%94-Rugile-Kaladyte-%E2%80%94-Part-Three-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We’re in from the storm. Chris pulls out the map. We’re scheming a stage race on the Westfjords Way. Races and events breathe life into routes. The route is the treasure map of opportunity– free to the public and available at any time. By planning an event, you set a date and meeting point and get people to dream they could actually be there and then they make it happen. They pour over maps, they find resources, they think about gear choices and the weather and what it would be like.</p>\n<p>After riding half of the route, I’m starting to get a feeling for the place– it’s both stark and lush, remote and welcoming. The conditions are challenging– wind, rain, exposure.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/05-Westfjords-Way-%E2%80%94-Evan-Ruderman-%E2%80%94-Part-Three.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Our idea is to set up an ultra-endurance stage race with 100 riders. There will be four stages– each one 240km to 300km that ends with the possibility of accommodations, food, and a hot spring. Riders will be self-supported, carrying what they need along the way, taking care of their bikes and themselves. Unlike many self-supported races, due to the high winds, they’ll be allowed to draft and work together.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/28-Westfjords-Way-%E2%80%94-Evan-Ruderman-%E2%80%94-Part-Three.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>They will have 24 hours or so to complete the stage and get ready before the next one goes off. They’ll self-record their times with photos. There might be some incentives to get time reductions– soaking in hot springs, jumping in the sea, eating all the waffles, and meeting special people along the way. The race will be in late June, a week after the summer solstice, with nearly peak daylight. At least one stage will start at night. Your finishing time is when you jump into the harbor at the end in Ísafjörður.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/07-Westfjords-Way-%E2%80%94-Rugile-Kaladyte-%E2%80%94-Part-Three-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Let’s make it happen next June! Who wants to come?</p>\n<p>This idea started with Birna, our local guide from Visit Westfjords. She is not a cyclist, but participated in a Tuc-Tuc race across India and would love to bring an adventure race to Iceland. With the help of Iceland Tourism, we can put together a magical experience. It’s a fun way to launch the route, encourage others to come to ride their hearts out and share their stories. More information is coming soon!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/25-Westfjords-Way-%E2%80%94-Rugile-Kaladyte-%E2%80%94-Part-Three-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We fold up the map, brains buzzing with ideas. Birna cooks mushroom soup, we record the Adventure Stache podcast daily recap, eat dinner and go to bed.</p>\n<p>On day 5, we get hit in the face with wind and rain. There are three gorgeous climbs out of the gate and the rest is coastal. I get cold to the bone and am really grateful for the restaurant stop with hot lasagna and soup. Every day into September is a step closer to winter. The air is getting colder.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/38-Westfjords-Way-%E2%80%94-Evan-Ruderman-%E2%80%94-Part-Three.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/09/43-Westfjords-Way-%E2%80%94-Evan-Ruderman-%E2%80%94-Part-Three.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I ride most of the day with Rue– happy for the time on the bike with my wife. I get on Chris’s wheel for the final stretch to the hot spring. He’s strapped a full pizza to his rack and is absolutely hauling ass. Our videographer, Thrainn, makes a joke later that Chris looked like he was delivering pizza to save his life.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/48-Westfjords-Way-%E2%80%94-Rugile-Kaladyte-%E2%80%94-Part-Three-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The hot spring has a pool, a changing room, and a stone bath. Our host for the night tells us that the famous singer Bjork and her “Water Friends” helped set it up. Raindrops splash the surface. My cheeks are cold from the air, but it’s warm under water. It’s hard to get out, but eventually, we do. We change out of our wet clothes and ride across the street to the Mora guesthouse. I’m famished. We heat up leftover lasagna from lunch that Rue stowed in her hip pack. I’m ready for sleep.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/41-Westfjords-Way-%E2%80%94-Evan-Ruderman-%E2%80%94-Part-Three.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/09/49-Westfjords-Way-%E2%80%94-Evan-Ruderman-%E2%80%94-Part-Three.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I’ll set the alarm early and get up in the dark to write my story before another huge day on the bike. I have to get the words down before I forget them. Every day feels like a week. I’m glad people are taking pictures because I’d never remembered what we saw and you’d never believe it was true.</p>\n<p></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"152699b5b23a53f2667e639212a162f6c62349424e89f01025ca07a22cca8c58","category":"Cycling"}