{"title":"Top Stories: Apple Event Announced, M1X MacBook Pro Rumors, Apple Watch Series 7 Launch","link":"https://www.macrumors.com/2021/10/16/top-stories-october-mac-apple-event/","date":1634389200000,"content":"It feels like Apple's iPhone event just ended, but it's already time to do it all over again as Apple has announced a virtual media event for this Monday, October 18.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/Top-Stories-80-Thumbnail.jpg\" />\r\n<br />\r\nEven at this late date, rumors about the MacBook Pro are still coming in one after another, and we're also hearing from sources claiming the third-generation AirPods will be making an appearance at the event, so read on below for all of the latest details!\r\n<br />\r\n\r\n<br />\r\n<h2>What to Expect From October 18 'Unleashed' Apple Event: New MacBook Pros, AirPods 3 and More</h2>\r\n<br />\r\nAfter hosting its iPhone 13, Apple Watch Series 7, and iPad event in September, Apple has announced that it <a href=\"https://www.macrumors.com/2021/10/12/apple-event-unleashed-october-18/\">will be hosting a second fall event on Monday, October 18 at 10 a.m. Pacific Time</a>. The virtual event will be streamed on Apple's website and on YouTube, and we've got <a href=\"https://www.macrumors.com/how-to/watch-october-18-apple-event/\">full details on how and when to watch</a>, wherever you're located.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/10.18-event-what-to-expect-thumb-1.jpg\" />\r\n<br />\r\nRumors widely suggest the event will revolve around new Macs, including <a href=\"https://www.macrumors.com/guide/14-inch-macbook-pro/\">redesigned 14-inch and 16-inch MacBook Pro models</a> with a faster version of the M1 chip, mini-LED backlit displays, and more. It's possible that <a href=\"https://www.macrumors.com/2021/10/13/new-airpods-during-unleashed-apple-event/\">third-generation AirPods may also be unveiled</a>. For a full rundown on what we're expecting to see at Monday's event, <a href=\"https://www.macrumors.com/guide/october-18-apple-event-what-to-expect/\">check out our overview guide</a>.\r\n<br />\r\n\r\n<br />\r\n<h2>Upcoming MacBook Pro Models Could Feature 120Hz Mini-LED Displays</h2>\r\n<br />\r\nWhile it has been rumored for several months that the next MacBook Pro models will feature mini-LED backlit displays with higher brightness and improved contrast, just this week we learned from display industry consultant Ross Young that <a href=\"https://www.macrumors.com/2021/10/12/macbook-pro-120hz-mini-led-display/\">the next MacBook Pros will likely also support up to a 120Hz refresh rate</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/Mini-LED-MacBook-Pro-Feature.jpg\" />\r\n<br />\r\nYoung has a good track record, and if this rumor proves to be accurate, perhaps Apple will use ProMotion branding for the displays like it did for iPhone 13 Pro models, which also support up to a 120Hz refresh rate.\r\n<br />\r\n\r\n<br />\r\nAnother display-related rumor that seems incredibly sketchy at first glance claims that the MacBook Pro displays <a href=\"https://www.macrumors.com/2021/10/15/new-macbook-pro-could-have-a-notch/\">will have a notch similar to recent iPhones</a>. A closer look at previously leaked display resolutions for the upcoming MacBook Pro models suggests there may actually be something to this rumor.\r\n<br />\r\n\r\n<br />\r\n<h2>AirPods 3 Ready to Launch and Likely to Be Announced at Apple Event Next Week, Analyst Says</h2>\r\n<br />\r\nWe've been hearing about updated AirPods for quite some time now, with rumors originally stating they would debut earlier in 2021. Multiple sources are reporting that Apple is ready to launch them at any moment, and Monday's event is a prime opportunity.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/airpods-3-gizmochina@3x.jpg\" />\r\n<br />\r\nWedbush analyst Dan Ives says that according to his supply chain checks, <a href=\"https://www.macrumors.com/2021/10/15/airpods-3-likely-at-unleashed-apple-event/\">the new AirPods have already been manufactured</a> and so he expects them to be announced on Monday. Similarly, a leaker on Weibo who accurately predicted Apple would introduce the ninth-generation iPad at last month's event <a href=\"https://www.macrumors.com/2021/10/13/new-airpods-during-unleashed-apple-event/\">also says the new AirPods are coming on Monday</a>.\r\n<br />\r\n\r\n<br />\r\n<h2>MacBook Pro Models Said to Start at 16GB RAM and 512GB Storage, Feature Upgraded 1080p Webcams</h2>\r\n<br />\r\nJust ahead of Apple's event next Monday, a leaker known as \"dylandkt\" has shared some potential features and specs for the notebooks on Twitter.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/M1X-MBP-Feature.jpg\" />\r\n<br />\r\nAccording to his tweets, the new MacBook Pro models <a href=\"https://www.macrumors.com/2021/10/12/macbook-pro-upgraded-webcams-new-power-brick/\">will start with 16GB of RAM and 512GB of storage</a>, and he also reiterated his previous claim that the notebooks will sport <a href=\"https://www.macrumors.com/2021/10/12/macbook-pro-upgraded-webcams-new-power-brick/\">an upgraded 1080p webcam</a>, following in the footsteps of the 24-inch iMac earlier this year.\r\n<br />\r\n\r\n<br />\r\n<h2>New MacBook Pro Features Breakdown: Everything Rumors Say We Can Expect</h2>\r\n<br />\r\nIn addition to a faster version of the M1 chip and mini-LED backlit displays, there are several other new features and changes rumored for the next MacBook Pro models, so make sure to <a href=\"https://www.macrumors.com/2021/10/14/new-macbook-pro-features-breakdown/\">check out our breakdown of everything rumors say we can expect</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/2021-mbp-hdmi-slot-3d.jpg\" />\r\n<br />\r\nWe've also put together a guide with <a href=\"https://www.macrumors.com/guide/m1x/\">everything we know about Apple's so-called \"M1X\" chip</a> that is rumored to power the next MacBook Pro models.\r\n<br />\r\n\r\n<br />\r\n<h2>First Apple Watch Series 7 Orders Arriving to Customers</h2>\r\n<br />\r\nThe Apple Watch Series 7 has officially launched, with the <a href=\"https://www.macrumors.com/2021/10/14/apple-watch-series-7-australia-new-zealand/\">first orders making their way into customers' hands</a>. Supplies remain extremely tight as expected, thanks to early production difficulties, with most new orders not shipping until November or even December.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/apple-watch-series-7.jpg\" />\r\n<br />\r\nAhead of the launch, reviews were shared by media outlets and YouTube channels. In addition to <a href=\"https://www.macrumors.com/2021/10/13/apple-watch-series-7-unboxing-videos-and-reviews/\">rounding up Apple Watch Series 7 video reviews and unboxings</a>, we've highlighted some <a href=\"https://www.macrumors.com/review/apple-watch-series-7/\">written reviews</a> and <a href=\"https://www.macrumors.com/2021/10/15/apple-watch-series-7-hands-on/\">put together our own quick hands-on video</a> with the new watch.\r\n<br />\r\n\r\n<br />\r\nWe also shared an image that provides a <a href=\"https://www.macrumors.com/2021/10/14/apple-watch-series-7-screen-size-series-6/\">side-by-side look at the Apple Watch Series 7's larger display vs. the Series 6</a>.\r\n<br />\r\n\r\n<br />\r\n<h3>MacRumors Newsletter</h3>\r\n<br />\r\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r\n<br />\r\n\r\n<br />\r\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/oct-14-2021\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/16/top-stories-october-mac-apple-event/\">Top Stories: Apple Event Announced, M1X MacBook Pro Rumors, Apple Watch Series 7 Launch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-apple-event-announced-m1x-macbook-pro-rumors-apple-watch-series-7-launch.2317235/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=e3M0n-3Inmc:DIMmMhOJ1Ww:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=e3M0n-3Inmc:DIMmMhOJ1Ww:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/e3M0n-3Inmc\" />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"15282305256b1a2e2665030b3677cf83fa189afac4f2934aaa190b27c2410a20","category":"Apple"}