{"title":"Canyon launches new UCI-legal Speedmax CFR Disc TT time trial bike","link":"https://www.bikeradar.com/news/canyon-speedmax-cfr-disc-tt/","date":1620205249000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/speedmax-cfr-tt-disc_2776_bk-wh_P5-765b5d2.jpg?quality=45&amp;resize=620,413\" />                                            <p>Canyon has announced the Speedmax CFR Disc TT, a new UCI-rules compliant <a href=\"https://www.bikeradar.com/advice/buyers-guides/time-trial-bikes/\">time trial bike</a>.</p>\n<p>Following an <a href=\"https://www.bikeradar.com/features/pro-bike/canyon-speedmax-uci-legal/\">under-the-radar debut at the Tour de Romandie</a> last week, full details of the new bike are now available. Canyon has said its sponsored <a href=\"https://www.bikeradar.com/news/2020-worldtour-team-bikes/\">WorldTour</a> team, Movistar Team, will race it at the upcoming <a href=\"https://www.bikeradar.com/events/giro-ditalia/\">Giro d’Italia</a>.</p>\n<p>As things stand, there’s only one model available – a £10,799 / €9,999 build with <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-12-speed-red-etap-axs-hrd-review/\">SRAM Red eTap AXS</a> gearing, <a href=\"https://www.bikeradar.com/brand/zipp/\">Zipp</a> wheels, <a href=\"https://www.bikeradar.com/reviews/components/tyres/road-bike-tyres/continental-grand-prix-5000-clincher-tyre-review/\">Continental GP5000 clincher</a> tyres, a <a href=\"https://www.bikeradar.com/news/ceramicspeed-oversized-pulley-wheel-system-claimed-to-save-three-watts/\">CeramicSpeed OSPW system</a> and a SRAM Red AXS <a href=\"https://www.bikeradar.com/reviews/training/power-meters/\">power meter</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Annemiek van Vleuten of Movistar Team testing the new Canyon Speedmax CFR TT on the velodrome.</span></figcaption><span> <i>Canyon</i></span></div>\n<h2>Bye-bye rim brakes</h2>\n<p>Following the recently released <a href=\"https://www.bikeradar.com/news/2021-canyon-speedmax/\">triathlon-specific Speedmax Disc range</a>, the new Speedmax CFR Disc TT is also disc brake only.</p>\n<p>Canyon nevertheless says the new bike is 2.7 watts more aerodynamically efficient than the outgoing rim-brake <a href=\"https://www.bikeradar.com/features/pro-bike/tony-martins-canyon-speedmax-cf-slx-gallery/\">Speedmax CF SLX TT,</a> “in spite of the switch to disc brakes”. Canyon hasn’t said at what speed or yaw angles this is measured at, though.</p>\n<p>It’s fair to say that’s not a lot, but the outgoing time trial bike was already a highly aero-optimised machine.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Speedmax CFR Disc TT is disc-brake only, going forward. The fork has also been designed to shield the front brake caliper from the wind.</span></figcaption><span> <i>Canyon</i></span></div>\n<p>The constraints of the UCI rules begin to show their effects here, though, because Canyon claims the latest top-of-the-range Speedmax CFR Disc (the triathlon-specific version released in 2020) is 9 to 10 watts more aerodynamically efficient than the outgoing Speedmax CF SLX TT, at 45 kph and across a range of yaw angles from -20 to +20 degrees.</p>\n<p>If the new Speedmax CFR Disc TT was tested under the same conditions, then we could conclude it’s around 7 watts less aerodynamically efficient than the triathlon-specific version. This difference can likely be put down to the smaller tube shapes, particularly around the fork, head tube and down tube on the TT version, required to conform to the UCI’s strict regulations on tubing sizes.</p>\n<p>The slimming down of these tubes also means that all of the integrated storage options found on the triathlon-specific bikes have been removed.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> To make the bike comply with UCI rules, Canyon has slimmed down the tubes and removed the integrated storage from its Speedmax triathlon bike.</span></figcaption><span> <i>Canyon</i></span></div>\n<h2>Bye-bye front derailleur</h2>\n<p>In an interesting and progressive move, Canyon has specced the new Speedmax CFR Disc TT with a <a href=\"https://www.bikeradar.com/features/what-would-make-you-go-1x-on-the-road/\">1× drivetrain</a>. This means there’s no front derailleur and only one chainring.</p>\n<p>1× has become a bit of a <a href=\"https://www.bikeradar.com/features/road-bike-tech-that-failed/\">tech dead-end</a> for road bikes but it may have found a niche in the time trial world.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Speedmax CFR TT is only available with a 1× drivetrain.</span></figcaption><span> <i>Canyon</i></span></div>\n<p>Given time trial courses tend to be mostly flat or rolling, the inner ring and front derailleur can become redundant for many dedicated time trial racers. Removing the latter can therefore be an easy way to save a couple of watts worth of aerodynamic drag.</p>\n<p>The spy shots of Marc Soler’s bike at the Tour de Romandie last week appear to confirm a front derailleur hanger can still be fitted to the Speedmax CFR Disc TT, though, so you won’t be locked into a 1× drivetrain forever.</p>\n<h2>Fit and adjustability</h2>\n<p>The new Speedmax CFR Disc TT gets a 400mm base bar and narrower adjustable armrests, a refinement of the TT aero cockpit from the outgoing Speedmax CF SLX TT. Canyon says it will also offer a range of spacers for adjusting the armrest height and tilt.</p>\n<p>The bike is also specced with <a href=\"https://www.bikeradar.com/news/zipp-vukashift/\">Zipp’s VukaShift AXS 90 carbon extensions</a>, which contain the electronic brains for the wireless SRAM eTap drivetrain.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Canyon has specced Zipp’s VukaShift AXS 90 carbon extensions.</span></figcaption><span> <i>Canyon</i></span></div>\n<h2>Availability, weight and colours</h2>\n<p>Available in three sizes (small, medium and large), claimed frame and fork weights are light: 1,030g for a size M frame and 500g for the fork. Canyon says this makes for a complete bike weight of 8.4kg.</p>\n<p>You can have it in any colour you want so as long as it’s black.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Black is the only paint option at the moment, which is likely intended to save weight.</span></figcaption><span> <i>Canyon</i></span></div>","author":"Simon Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"152b76509ed76c2668446db77509b26d2bea14268f43da98965c892bb9132faf","category":"Cycling"}