{"title":"‘Technical issues’ might force Apple to ditch the iPhone 15 Pro’s solid-state buttons","link":"https://www.macworld.com/article/1783293/iphone-15-pro-physical-button-design.html","date":1681333958000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It looks like one of the most significant design changes in this year’s iPhone refresh has been called off. In a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://medium.com/@mingchikuo/two-iphone-15-pro-models-removal-of-solid-state-button-design-negatively-affects-cirrus-logic-and-a456d5e7386c&amp;xcust=1-1-1783293-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Medium post</a> today, the respected analyst Ming-Chi Kuo says Apple no longer plans to use a solid-state button design on the iPhone 15 Pro and 15 Pro Max.</p>\n\n\n\n<p>“My latest survey indicates that due to unresolved technical issues before mass production, both high-end iPhone 15 Pro models (Pro &amp; Pro Max) will abandon the closely-watched solid-state button design,” he writes, “and revert to the traditional physical button design.”</p>\n\n\n\n<p>As long ago as <a href=\"https://www.macworld.com/article/1365990/iphone-15-pro-solid-state-power-volume-buttons.html\">October 2022</a>, rumors pointed to the Pro versions of the late-2023 iPhones having solid-state power and volume buttons, and the theory was largely accepted as fact up to this spring. (We discussed their likely implications in a <a href=\"https://www.macworld.com/article/1665435/iphone-15-pro-solid-state-volume-mute-buttons-why.html\">cost-benefit analysis</a> last month, for example.) Indeed, it was Kuo himself who initially propagated the rumor, albeit with the inclusion of the classic caveat word “may.”</p>\n\n\n\n<figure><div>\n<blockquote><p>(1/6)<br />My latest survey indicates that the volume button and power button of two high-end iPhone 15/2H23 new iPhone models may adopt a solid-state button design (similar to the home button design of iPhone 7/8/SE2 &amp; 3) to replace the physical/mechanical button design.</p>— 郭明錤 (Ming-Chi Kuo) (@mingchikuo) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1585852274680950784?ref_src=twsrc%5Etfw&amp;xcust=1-1-1783293-1-0-0&amp;sref=https://www.macworld.com/feed\">October 28, 2022</a></blockquote>\n</div></figure>\n\n\n\n<p>In other words, the buttons wouldn’t physically press inwards, but instead, use a haptic mechanism to mimic the feel of a click in response to pressure and skin contact. It appears this approach is proving difficult to execute.</p>\n\n\n\n<p>Apple did something similar back in 2016 when the iPhone 7 was launched with a solid-state Home button. The idea was that ditching a moving part reduced the likelihood of mechanical problems: in previous iterations, the Home button had been one of the most <a href=\"https://www.macworld.com/article/670663/how-to-fix-broken-iphone-home-button.html\">fault-prone</a> parts of the iPhone. But the new design was not universally loved either; we called it “odd” and “weird” at the time, and its inability to work with non-capacitive gloves has been <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://discussions.apple.com/thread/251555160&amp;xcust=1-1-1783293-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">an issue</a> with the iPhone SE.</p>\n\n\n\n<p>Furthermore, using a static design on the power button, specifically, is more challenging than on the Home button. Such designs need power; if you’ve powered off one of Apple’s recent MacBooks, for example, trying to press the solid-state trackpad is like pressing a flat and unresponsive slab of aluminum. Yet the power button obviously needs to be able to do its job when the iPhone is off.</p>\n\n\n\n<p>It’s unclear if that is the “unresolved technical issue,” or if the rumor was off to start with; the cynic might observe that it is rather convenient for Kuo to be able to grab headlines twice, first by starting a rumor and then by killing it off. But Kuo is generally well informed, and as he notes in the Medium post, there is still time for Apple to change its mind.</p>\n\n\n\n<p>“The iPhone 15 Pro is currently in the EVT [Engineering Validation Test] development stage,” he writes, “so there is still time to modify the design.”</p>\n\n\n\n<p>For the latest news and rumors leading up to the launch this fall, check out our regularly updated <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15 superguide</a>, which includes comprehensive information about the Pro models, or you can check out our round-up of <a href=\"https://www.macworld.com/article/1487037/iphone-15-ultra-design-display-camera-specs-price.html\">iPhone 15 Ultra rumors</a>. If you don’t want to (or can’t) wait that long, find the best current model for your needs with our <a href=\"https://www.macworld.com/article/670458/iphone-buying-guide.html\">iPhone buying guide</a>.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"152f767fef9e4e89850bc7fd4f2c5fd3235b2dcacb187682677a1b3ef7c9f07c","category":"Apple"}