{"title":"25 New Things Your iPhone Can Do With Next Month's iOS 17.2 Update","link":"https://www.macrumors.com/2023/11/17/new-iphone-features-december-ios-update/","date":1700258687000,"content":"Apple made the first beta of iOS 17.2 available to developers in October. Since then we've seen two more betas, and with each iteration Apple continues to add more new features and changes, many of which users have been anticipating for quite a while. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/iOS-17.2-Everything-New-Your-iPhone-Can-Do-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nBelow, we've listed 25 new things that are coming to your iPhone when the finalized version is publicly released in December.\r<br />\n\r<br />\n<h2>1. Help You Keep a Daily Journal</h2> \r<br />\nYour iPhone will soon be able to act as your personal journaling companion, thanks to Apple's new Journal app. Apple originally announced it was releasing a Journal app as part of iOS 17, and it's finally coming in iOS 17.2.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/Journal-App-iOS-17-Feature-Green.jpg\" width=\"2612\" height=\"1469\" />\r<br />\nThe Journal app has a simple, straightforward interface. When you open it up, you're presented with a \"+\" button, and tapping on it lets you start a new entry. Journal entries are automatically dated, and you can bookmark your favorite ones. Entries can include images, voice recordings, and location tags, so not only will you have the ability to create and maintain a daily journal, you'll be able to easily record your thoughts, experiences, and memories with your iPhone.\r<br />\n\r<br />\n<h2>2. Set a Journaling Schedule</h2> \r<br />\nStaying consistent with journaling can be difficult, but your iPhone can make it a lot easier with the new Journal app's scheduling feature, which can be found in Settings ➝ Journal.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/journal-schedule.jpg\" alt=\"journal\" width=\"2738\" height=\"2716\" />\r<br />\nThe scheduling option isn't just a reminder – it's about building a habit. So whether it's a gentle reminder notification that you need in the morning or a prompt before bed, you can adapt the feature to your personal routine.\r<br />\n\r<br />\n<h2>3. Offer Journaling Suggestions</h2> \r<br />\nWhen you first open the Journal app, you can decide what information it can pull from your phone for writing suggestions. Options include workout activity, media like podcasts and music, photos, and significant locations. You can control which apps and services appear using the switches in the Settings app under Privacy &amp; Security ➝ Journaling Suggestions.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/journal-suggestions.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nHere, there are also settings to prefer suggestions with others when you're around your contacts or large groups, and to be discoverable by others to help prioritize the suggestions of other people. If you don't like suggestions in general, you can simply turn them off (Settings ➝ Journal ➝ Skip Journaling Suggestions).\r<br />\n\r<br />\n<h2>4. Give Journaling Prompts</h2> \r<br />\nIf you have a serious case of writer's block, iOS 17.2 can offer you entry prompts in the form of \"reflections.\" These reflections are designed to inspire and guide you, providing ideas and topics to explore in each entry.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/journal-prompts.jpg\" alt=\"journal\" width=\"1920\" height=\"1080\" />\r<br />\nThe reflections can vary from thought-provoking questions to creative writing cues, and if the one you're offered doesn't get your gears turning, you can tap a button to generate a new one.\r<br />\n\r<br />\n<h2>5. Secure Your Journal</h2> \r<br />\nPrivacy and security are paramount when it comes to personal journaling. That's why iOS 17.2 introduces enhanced security features, including encryption and password protection, to safeguard your journal from unauthorized access.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/journal-lock.jpg\" alt=\"settings\" width=\"1920\" height=\"1080\" />\r<br />\nThe option can be found in the Settings app under Journal ➝ Lock Journal, and it allows you to use your device passcode, Face ID or Touch ID, providing peace of mind every time you record sensitive or personal information.\r<br />\n\r<br />\n<h2>6. Translate with a Button Press</h2> \r<br />\nOvercome communication barriers with the new custom Translation option for the Action button in iOS 17.2. With just a button press, your iPhone 15 Pro or iPhone 15 Pro Max will be able to translate live conversations into multiple languages. The feature should be a boon for travelers, students, and anyone learning a language.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iPhone-15-Pro-Action-Button-Translate.jpg\" width=\"1600\" height=\"900\" />\r<br />\nYou can choose which language the speech should be translated into in the Translate app. According to Apple, the translation is not just accurate but also context-aware, ensuring that nuances and colloquialisms are captured effectively.\r<br />\n\r<br />\n<h2>7. Show Detailed Weather Forecasts on Home Screen</h2> \r<br />\nThe update includes new Details, Daily Forecast, and Sunrise/Sunset widgets for the Weather widget, providing more of the kind of information that you would normally only find by going into the Weather app.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/weather-app-widgets.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nDetails shows information like precipitation chance, UV index, wind speed, and air quality, while Daily Forecast offers the weather for the next few days in a small widget size. Sunrise/Sunset naturally shows the sunrise and sunset times for each day.\r<br />\n\r<br />\n<h2>8. Host Collaborative Music Playlists</h2> \r<br />\nCollaborative playlists in the Music app let you create and share playlists with friends, family, or colleagues, enabling everyone to contribute their favorite tracks. It adds another social dimension to the Music app, and provides a useful way to discover new music and share your musical tastes with others.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/apple-music-collaborative-playlists.jpg\" width=\"5484\" height=\"3085\" />\r<br />\nIn a playlist you have made, just tap on the three-dot icon in the top right of the app, select the Collaborate option and choose Start Collaboration. You'll then be able to create a link to the playlist, and anyone who has access to that link can add to it. You can also invite people to join via QR code, and opt to approve each person that asks to join.\r<br />\n\r<br />\n<h2>9. Use Stickers as Message Reactions</h2> \r<br />\nApple aims to make message reactions in the Messages app more fun and expressive by offering an easier way to use stickers as an alternative to tapback reactions.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/ios-17-2-tapback-reply-sticker.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nPreviously you had to drag a sticker or an emoji from the keyboard onto any message bubble. Now you can simply long press on any chat bubble and tap \"Add Sticker,\" which lets you choose either a sticker or an emoji to apply to the corner of an iMessage.\r<br />\n\r<br />\n<h2>10. Record Spatial Video</h2> \r<br />\nIf you have an iPhone 15 or iPhone 15 Pro Max, iOS 17.2 will allow you to record spatial video for viewing in the Photos app on Apple's forthcoming Vision Pro headset, set to be released in early 2024. (Note that when spatial videos captured with an ‌iPhone‌ are viewed on the ‌iPhone‌, they appear as normal videos.)\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/spatial-video-apple-visioin-pro.jpg\" width=\"1600\" height=\"898\" />\r<br />\nTo enable spatial video recording, go to Settings ➝ Camera ➝ Formats, then toggle on Spatial Video for Apple Vision Pro. Video is recorded at 30 frames per second at 1080p, and one minute of video takes up 130MB of storage space. Apple says that for best results when recording spatial video, the iPhone should be held stable in landscape orientation.\r<br />\n\r<br />\n<h2>11. Populate a Favorites Music Playlist</h2> \r<br />\nApple is introducing a Favorites Music Playlist in Apple Music that automatically aggregates any songs that you have favorited, ensuring that your most-liked tracks are always at your fingertips.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/apple-music-favorite-playlists.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nSince it populates dynamically, it should make it easier to enjoy the music you love while removing some of the hassle of manual curation.\r<br />\n\r<br />\n<h2>12. Selectively Turn Off Your Listening History</h2> \r<br />\nThere's a new privacy-centric feature that allows you to selectively turn off your listening history. This means that you can listen to music – or <a href=\"https://www.macrumors.com/how-to/apple-music-listening-history-focus-filter/\">allow your kids to listen to their stuff on your device</a> – without influencing your future recommendations or shared playlists.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/apple-music-listening-history-focus1.jpg\" alt=\"focus\" width=\"4137\" height=\"2716\" />\r<br />\nIt's a useful tool for times when you're exploring new genres or playing music for others, since it ensures that your personal recommendations remain untainted by atypical listening choices.\r<br />\n\r<br />\n<h2>13. Verify Your iMessage Contacts</h2> \r<br />\nThe security of iMessage has been enhanced with a new feature to verify your contacts. Contact Key Verification adds an extra layer of trust and authenticity to your conversations by displaying a code that verifies you are communicating with the intended person.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/12/Apple-advanced-security-iMessage-Contact-Key-Verification_screen-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nApple first previewed iMessage Contact Key Verification in December 2022, and said it is designed for those who face \"extraordinary digital threats,\" such as journalists, human rights activists, and government officials. It should help in safeguarding against impersonation and phishing attempts, making iMessage and FaceTime more secure platforms for personal and professional communication.\r<br />\n\r<br />\n<h2>14. Sync Additional Message Settings in iCloud</h2> \r<br />\niCloud's capabilities now include the synchronization of additional message settings across your Apple devices. A new \"Messages in ‌iCloud‌\" section in the Settings app shows the total amount of storage that messages are taking up, the number of messages synced to ‌iCloud‌, and the time of the last sync. There's also a \"Sync Now\" option to force an update.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/ios-17-2-messages-in-icloud.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nPreferences and customizations made in the Messages app on one device will automatically reflect on your other devices signed in to the same iCloud account. Apple previously said that additional settings would be synced through Messages in ‌iCloud‌ in ‌iOS 17‌, like Text Message Forwarding, Send &amp; Receive accounts, and SMS filters across devices, so those additional settings are likely to sync, too.\r<br />\n\r<br />\n<h2>15. A New TV App Experience</h2>\r<br />\nApple is revamping the TV app in iOS 17.2, offering a refreshed and more user-friendly experience. The update focuses on improving navigation and discoverability, making it easier to find your favorite shows and movies.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/ios-17-2-tv-app.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nApple has removed the separate tabs for Movies and TV shows in the Store section of the Apple TV app, with everything now integrated together. <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> has said that Apple also plans to remove the option to purchase TV shows and movies from the iTunes app as part of a TV app redesign.\r<br />\n\r<br />\n<h2>16. Improve Reliability of Emergency Alerts</h2>\r<br />\nApple has improved the reliability of emergency alerts on iPhone. In Settings -&gt; Notifications &amp; Emergency Alerts, there is a new \"Local Awareness\" option that can be turned on. Apple says that Local Awareness uses your approximate location to improve the timeliness, accuracy, and reliability of emergency alerts.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/ios-17-2-emergency-local-awareness.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nWhether it's severe weather warnings, Amber alerts, or other vital notifications, this setting should increase the probability that important alerts are not missed due to technical issues.\r<br />\n\r<br />\n<h2>17. Add More Color to Contact Posters</h2> \r<br />\nAdd a splash of color to your Contact Poster, with a new rainbow-colored text option for your name, allowing you to make it more vibrant and visually appealing.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/ios-17-2-contact-poster-rainbow.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nIf you want your Contact Poster to stand out from the contacts crowd, this provides another way to do it.\r<br />\n\r<br />\n<h2>18. Make Your iPhone an AirPlay Receiver</h2> \r<br />\nThe iOS 17.2 update will turn your iPhone into an AirPlay receiver ready for the spatial computing era. A new \"AirPlay Receiver\" setting allows the upcoming ‌Apple Vision Pro‌ headset to stream or share content to your ‌iPhone‌.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/ios-17-2-airplay-handoff.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nEarlier this year, Apple said AirPlay‌ would soon work with supported televisions in hotels, allowing users to easily enjoy their favorite content on the TV when traveling. Apple said the capability will be available before the end of the year in select hotels, and it looks as if iOS 17.2 could also be the update that makes it happen.\r<br />\n\r<br />\n<h2>19. Add More Memoji Customizations</h2> \r<br />\nThe update brings enhanced customization options for Memoji, allowing users to create avatars that are more representative of their personal style and identity.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/ios-17-2-memoji-body.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nTo that end, Apple has added a \"Body\" section for Memoji where users can customize waist, bust, shoulders, and arms.\r<br />\n\r<br />\n<h2>20. Rolling News Event Updates in Real Time</h2> \r<br />\nThe News app now delivers events in real-time with added support for Live Activities, keeping users informed with up-to-the-minute updates on news-related events such as elections.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/ios-17-2-apple-news-live-activities.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nLive Activities allow iPhone users to stay on top of real-time events right on the Lock Screen on any iPhone model compatible with iOS 17, and in the Dynamic Island on iPhone 14 Pro and iPhone 15 models.\r<br />\n\r<br />\n<h2>21. Stop Adding Favorited Songs to Your Library</h2> \r<br />\nA new option included in the update enables you to stop favorited songs (and in many cases whole albums) from being automatically added to your music library. It gives you more control over your music collection by ensuring that only the songs you choose to add are saved.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/ios-17-2-music-add-favorite-songs.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThe new toggle can be found in Settings ➝ Music ➝ Add Favorite Songs. If you turn the option off, don't worry – favorited songs will still populate the new Favorites playlist. The option to \"Favorite\" songs was added in iOS 17.1.\r<br />\n\r<br />\n<h2>22. Disable Inline Predictions</h2> \r<br />\nIt's now possible to disable inline predictions when you're entering text into your iPhone. The new \"Show Predictions Inline\" toggle, found in Settings ➝ General ➝ Keyboard, is likely to be welcomed by those who prefer a more manual typing experience or find inline autocomplete text suggestions distracting.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/keyboard-inline-predictions.jpg\" width=\"1808\" height=\"1017\" />\r<br />\nThe additional toggle also means that you can now turn off inline text predictions without disabling the predictive text that appears above the onscreen keyboard.\r<br />\n\r<br />\n<h2>23. FaceTime Blocked Contact Warnings</h2> \r<br />\niOS 17.2 enhances privacy in FaceTime by introducing warnings for blocked contacts. If a blocked contact tries to reach you via FaceTime, the app now provides a notification, giving you awareness and control over the communication before the call is initiated.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/General-Apps-FaceTime.jpg\" width=\"2500\" height=\"1407\" />\r<br />\nApple provides warnings when joining a call with a blocked contact, or when a blocked contact is joining a call you're already on.\r<br />\n\r<br />\n<h2>24. Share Your Contact Poster in FaceTime</h2> \r<br />\nThe update adds new options for sharing your Contact Poster through FaceTime and Phone. Previously, the setting was only available for the Messages app.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/phone-share-photo.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nIn the settings pages for both apps, \"Share Name and Photo\" can be toggled off, set to Contacts Only, or set to Always Ask, which prompts you before sharing that information with others.\r<br />\n\r<br />\n<h2>25. Expand Sensitive Content Warnings</h2> \r<br />\nLastly, Apple's opt-in Sensitive Content Warning feature will work with Contact Posters in both the Contacts and Phone apps, as well as stickers in the Messages app.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/Sensitive-Content-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nWhen turned on, the Sensitive Content Warning feature uses on-device machine learning to analyze photos and videos, and blurs photos or videos with any detected nudity before users view them. Apple says it does not receive any indication that nudity was detected, and does not gain access to the photos or videos as a result.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/17/new-iphone-features-december-ios-update/\">25 New Things Your iPhone Can Do With Next Month's iOS 17.2 Update</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/25-new-things-your-iphone-can-do-with-next-months-ios-17-2-update.2411302/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"155b5321bbfbce2f7e065d296fa3693149ad2fe2f2527ebafa258c9415b0b9a2","category":"Apple"}