{"title":"Inorganic Polyphosphate Promotes Colorectal Cancer Growth via TRPM8 Receptor Signaling Pathway","link":"https://www.preprints.org/manuscript/202409.0739/v1","date":1725951688000,"content":"Colorectal cancer (CRC) is characterized by a pro-inflammatory microenvironment and features high energy supply molecules that assure tumor growth. A still underestimated macromolecule is the Inorganic Polyphosphate (iPolyP), a high-energy linear polymer that is ubiquitous in all forms of life. Made up of hundreds of repeated orthophosphate units, iPolyP is essential for a wide variety of functions in mammalian cells, including the regulation of proliferative signaling pathways. Some evidence has suggested its involvement in carcinogenesis, although more studies need to be pursued. In this study, we tested the role of iPolyP on CRC proliferation, using in-vitro and ex-vivo approaches, in order to evaluate its effect on tumor growth. We found that iPolyP is significantly increased in tumor tissues compared to the corresponding peritumoral counterparts. In addition, iPolyP signaling occurs through the TRPM8 receptor, promoting CRC cell proliferation. Pharmacological inhibition of TRPM8 or RNA interference experiments showed that the involvement of TRPM8 is essential, greater than that of the other two known iPolyP receptors, P2Y1 and RAGE. The presence of iPolyP drives cancer cells towards the mitotic phase of the cell cycle by enhancing the expression of ccnb1, which encodes for the Cyclin B protein. In-vitro 2D and 3D data reflected the ex-vivo results, obtained by the generation of CRC-derived organoids, which increased in size. These results indicate that iPolyP may be considered a novel and unexpected early biomarker supporting colorectal cancer cell proliferation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"155c0e016e5ca2e892d98b238caec158fb17fe4b49da8592ac181a28c1bae6fd","category":"Interdisciplinary"}