{"title":"Can we please just go back to using smaller wheels and tires?","link":"https://arstechnica.com/?p=1960947","date":1692120528000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Ioniq-5-flat-tire-800x600.jpg\" alt=\"A flat tire on a Hyundai Ioniq 5\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Ioniq-5-flat-tire-scaled.jpg\">Enlarge</a> <span>/</span> <em>Sigh</em>. Not only are the 225/45/R20 tires easy to puncture, they're not cheap. Smaller wheels would ride better and provide better efficiency. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Friday afternoon, I popped out of the house to run a quick errand. This week's press fleet car is a <a href=\"https://arstechnica.com/cars/2021/12/the-hyundai-ioniq-5-is-the-best-ev-weve-driven-in-2021/\">Hyundai Ioniq 5</a>, a boxy, angular, and efficient electric vehicle. I never quite made it to my intended destination, though; a very slightly misjudged corner—at low speed—saw me clip the curb with the back right wheel, resulting in a dime-sized hole in the sidewall and a frustrating couple of hours. Needless to say, there is no spare tire in an Ioniq 5, nor a can of get-you-home foam, not that it would have helped in this instance. But I can't help thinking all that stress could have been avoided if the car used smaller wheels and higher profile tires.</p>\n<p>Of all the current automotive trends, the ever-increasing size of wheels and tires may be my least favorite. If you're middle-aged, you've probably been driving for a couple of decades now, during which time smaller wheel sizes have been disappearing <a href=\"https://arstechnica.com/science/2012/03/more-evidence-links-a-family-of-insecticides-to-bee-colony-collapse/\">even faster than the honey bees</a>. Just try finding good 14-inch tires for an older Miata, for example. Or even 15s.</p>\n<p>The increasing popularity of crossovers and SUVs is largely to blame, though not entirely. So, too, is the move to battery electric vehicles, which is ironic considering that increasing wheel size very clearly hurts efficiency and range, the two main considerations for many EV buyers.</p></div><p><a href=\"https://arstechnica.com/?p=1960947#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1960947&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"155fc61a2e04ba04e56bac7bcc69bf247103d8727e1694cbbbdac55656feef65","category":"Tech"}