{"title":"Advancing Understanding on Greenspace and Mental Health in Young People","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023GH000959?af=R","date":1709808428000,"content":"<h2>Abstract</h2>\n<p>Mental distress among young people has increased in recent years. Research suggests that greenspace may benefit mental health. The objective of this exploratory study is to further understanding of place-based differences (i.e., urbanity) in the greenspace-mental health association. We leverage publicly available greenspace data sets to operationalize greenspace quantity, quality, and accessibility metrics at the community-level. Emergency department visits for young people (ages 24 and under) were coded for: anxiety, depression, mood disorders, mental and behavioral disorders, and substance use disorders. Generalized linear models investigated the association between greenspace metrics and community-level mental health burden; results are reported as prevalence rate ratios (PRR). Urban and suburban communities with the lowest quantities of greenspace had the highest prevalence of poor mental health outcomes, particularly for mood disorders in urban areas (PRR: 1.19, 95% CI: 1.16–1.21), and substance use disorders in suburban areas (PRR: 1.35, 95% CI: 1.28–1.43). In urban, micropolitan, and rural/isolated areas further distance to greenspace was associated with a higher prevalence of poor mental health outcomes; this association was most pronounced for substance use disorders (PRRUrban: 1.31, 95% CI: 1.29–1.32; PRRMicropolitan: 1.47, 95% CI: 1.43–1.51; PRRRural 2.38: 95% CI: 2.19–2.58). In small towns and rural/isolated communities, poor mental health outcomes were more prevalent in communities with the worst greenspace quality; this association was most pronounced for mental and behavioral disorders in small towns (PRR: 1.29, 95% CI: 1.24–1.35), and for anxiety disorders in rural/isolated communities (PRR: 1.61, 95% CI: 1.43–1.82). The association between greenspace metrics and mental health outcomes among young people is place-based with variations across the rural-urban continuum.</p>","author":"Sophia C. Ryan, \nMargaret M. Sugg, \nJennifer D. Runkle, \nBhuwan Thapa","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"156fc241c971e76f3a40e595cf65ca45e41bf4106270599659823a891148bb9f","category":"Environment"}