{"title":"Chloroplast phosphate transporter CrPHT4-7 regulates phosphate homeostasis and photosynthesis in Chlamydomonas","link":"https://academic.oup.com/plphys/article/194/3/1646/7420154?rss=1","date":1699920000000,"content":"<span><div>Abstract</div>In eukaryotic cells, phosphorus is assimilated and utilized primarily as phosphate (Pi). Pi homeostasis is mediated by transporters that have not yet been adequately characterized in green algae. This study reports on PHOSPHATE TRANSPORTER 4-7 (CrPHT4-7) from <span>Chlamydomonas reinhardtii</span>, a member of the PHT4 transporter family, which exhibits remarkable similarity to AtPHT4;4 from Arabidopsis (<span>Arabidopsis thaliana</span>), a chloroplastic ascorbate transporter. Using fluorescent protein tagging, we show that CrPHT4-7 resides in the chloroplast envelope membrane. <span>Crpht4-7</span> mutants, generated by the CRISPR/Cas12a-mediated single-strand templated repair, show retarded growth, especially in high light, reduced ATP level, strong ascorbate accumulation, and diminished non-photochemical quenching in high light. On the other hand, total cellular phosphorous content was unaffected, and the phenotype of the <span>Crpht4-7</span> mutants could not be alleviated by ample Pi supply. <span>CrPHT4-7</span>-overexpressing lines exhibit enhanced biomass accumulation under high light conditions in comparison with the wild-type strain. Expressing CrPHT4-7 in a yeast (<span>Saccharomyces cerevisiae</span>) strain lacking Pi transporters substantially recovered its slow growth phenotype, demonstrating that CrPHT4-7 transports Pi. Even though CrPHT4-7 shows a high degree of similarity to AtPHT4;4, it does not display any substantial ascorbate transport activity in yeast or intact algal cells. Thus, the results demonstrate that CrPHT4-7 functions as a chloroplastic Pi transporter essential for maintaining Pi homeostasis and photosynthesis in <span>C. reinhardtii</span>.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"1578b22370136c5080e974ae15d9905ecc3521741aaeda88e8f84b2a566a2cc9","category":"Environment"}