{"title":"AlphaFold Structure Analysis of COQ2 as Key Component of the Coenzyme Q Synthesis Complex","link":"https://www.preprints.org/manuscript/202403.0818/v1","date":1710411184000,"content":"Coenzyme Q (CoQ) is a lipidic compound widely distributed in nature with crucial functions in metabolism, protection against oxidative damage and ferroptosis, and other processes. CoQ biosynthesis is a conserved and complex pathway involving several proteins. COQ2 is a member of the UbiA family of transmembrane prenyltransferases that catalyzes the condensation of the head and tail precursors of CoQ, a key step in the process because its product is the first intermediate that will be modified in the head by the next component of the synthesis process. Mutations in this protein have been linked to primary CoQ deficiency in humans, a rare disease predominantly affecting organs with a high energy demand. The reaction catalyzed by COQ2 and its mechanism are still unknown. Here we aimed at clarifying COQ2 reaction by exploring possible substrate binding sites using a strategy based on homology, comprising the identification of ligand-bound homologs with solved structures available in the Protein Data Bank (PDB) and their subsequent structural superposition to the AlphaFold predicted model for COQ2. The results highlight some residues located on the central cavity or the matrix loops that may be involved in substrate interaction, some of them mutated in primary CoQ deficiency patients. Furthermore, we analyze the structural modifications introduced by the pathogenic mutations found in humans. These findings shed new light on the understanding of COQ2 function and, thus, CoQ biosynthesis and pathogenicity of primary CoQ deficiency.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"157c2c60dd0d9236153502c4a3526f41eb556c3327dcfa1ea438dd3dcdfd4658","category":"Interdisciplinary"}