{"title":"Hyperspectral imaging reveals small-scale water gradients in apple leaves due to minimal cuticle perforation by Venturia inaequalis conidiophores","link":"https://academic.oup.com/jxb/article/75/10/3125/7612731?rss=1","date":1708560000000,"content":"<span><div>Abstract</div>Effects of <span>Venturia inaequalis</span> on water relations of apple leaves were studied under controlled conditions without limitation of water supply to elucidate their impact on the non-haustorial biotrophy of this pathogen. Leaf water relations, namely leaf water content and transpiration, were spatially resolved by hyperspectral imaging and thermography; non-imaging techniques—gravimetry, a pressure chamber, and porometry—were used for calibration and validation. Reduced stomatal transpiration 3–4 d after inoculation coincided with a transient increase of water potential. Perforation of the plant cuticle by protruding conidiophores subsequently increased cuticular transpiration even before visible symptoms occurred. With sufficient water supply, cuticular transpiration remained at elevated levels for several weeks. Infections did not affect the leaf water content before scab lesions became visible. Only hyperspectral imaging was suitable to demonstrate that a decreased leaf water content was strictly limited to sites of emerging conidiophores and that cuticle porosity increased with sporulation. Microscopy confirmed marginal cuticle injury; although perforated, it tightly surrounded the base of conidiophores throughout sporulation and restricted water loss. The role of sustained redirection of water flow to the pathogen’s hyphae in the subcuticular space above epidermal cells, to facilitate the acquisition and uptake of nutrients by <span>V. inaequalis</span>, is discussed</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"157c002170a1e9abbadb4823b4a086669306ddac9a10c53bdc425dcfc3bf5c12","category":"Environment"}