{"title":"Remarkable and Selective Cytotoxicity of Synthesized Bola-Amphiphilic Nano Vesicles on Etoposide-Sensitive and Resistant Neuroblastoma Cells","link":"https://www.preprints.org/manuscript/202408.0465/v1","date":1722954990000,"content":"Neuroblastoma (NB) is a solid tumor occurring in infancy and childhood, whose high-risk form has currently a survival rate &amp;lt; 50 %, despite aggressive treatments. Additionally, drugs-induced secondary tumorigenesis and the emergency of drug resistance worsen the already worrying scenario, calling for an urgent development of new extra-genomic treatments. Quaternary phosphonium salts (QPSs) possess both antimicrobial and anticancer effects. Triphenyl phosphonium salts (TPPs) are mitochondria-targeting compounds, exerting anticancer effects, impairing mitochondria functions and damaging DNA, at the same time. TPP-based bola-amphiphiles, previously proven to self-assemble nanoparticles (NPs) in water and successfully assayed as possible antibacterials, were never tested as suitable antitumor agents. Here, aiming at the development of new antitumor devices to counteract resistant forms of NB, the anticancer effects of a TPP-based amphiphile molecule have been investigated for the first time. To this end, we considered the water-soluble sterically hindered quaternary phosphonium salt (BPPB) encompassing two triphenyl phosphonium groups linked by a C12 alkyl chain, thus embodying both the characteristics of mitochondria-targeting compounds and those of bola-amphiphiles. The anticancer effects of BPPB were assessed against HTLA-230 human stage-IV NB cells and their counterpart resistant to etoposide (ETO), doxorubicin (DOX) and to many other therapeutics (HTLA-ER). Determined IC50 values were very low on both cell populations, already after 24 hours of treatment, when cells viability did not significantly differ from that observed for the longest exposure timing. Moreover, to investigate a putative future inclusion of BPPB in a chemotherapeutic cocktail for NB, its cytotoxic effects were assessed against mammalian cell lines. These included monkey kidney cells (Cos-7), human hepatic cells (HepG2), a lung-derived fibroblast cell line (MRC-5) and red blood cells. From appreciable to very high selectivity indices have been determined after 24 hours treatments, an exposure time after which both NB cell populations tested appeared already fully exterminated.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"157e65f3de3c8e9428a1b1d8379b37b33609e2699221dc4aeebd3e588cf909d6","category":"Interdisciplinary"}