{"title":"Comcast offers tantalizing hint of a future with upload speeds above 35Mbps","link":"https://arstechnica.com/?p=1759493","date":1619125887000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Comcast-Gigabit-Laptop-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Comcast-Gigabit-Laptop.jpg\">Enlarge</a> <span>/</span> Picture of a Comcast router/modem gateway from the company's website. (credit: <a href=\"https://www.xfinity.com/\">Comcast</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Comcast today offered the latest hint of a future in which its cable customers won't be limited to 35Mbps upload speeds. <a href=\"https://corporate.comcast.com/press/releases/comcast-conducts-ull-duplex-chip-multi-gigabit-symmetrical-speeds\">Announcing a recent lab test</a>, Comcast said its research team \"deliver[ed] upstream and downstream throughputs of greater than 4Gbps\" and that \"future optimization\" will allow \"even greater capacity.\"</p>\n<p>This was \"the first-ever live lab test\" of a Broadcom \"system-on-chip (SOC) device that will pave the way for Comcast to deliver multigigabit upload and download speeds over its hybrid-fiber coaxial (HFC) network,\" Comcast said. It won't require installation of more cables because the \"technology works using the same types of connections already installed in hundreds of millions of homes worldwide,\" Comcast said.</p>\n<p>Cable customers have been waiting a long time for upload speeds that aren't a tiny fraction of download speeds. Comcast's cable uploads, ranging from 3Mbps to 35Mbps, are so low that <a href=\"https://arstechnica.com/tech-policy/2021/03/comcast-hides-upload-speeds-deep-inside-its-infuriating-ordering-system/\">Comcast hides them deep within its online ordering system</a>. While cable download speeds of up to 1.2Gbps are prominently displayed, Comcast doesn't tell customers what upload speeds they'll get until they enter a valid credit card number.</p></div><p><a href=\"https://arstechnica.com/?p=1759493#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1759493&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"15819f9edea2535acee9a01f6e94b47993d5e949158c88b11df7557f01c51d39","category":"Tech"}