{"title":"Goethite (α‐FeOOH) photocatalytic activity at natural concentrations by the addition of H2O2 at neutral pH and the simultaneous presence of fluoride and bicarbonate","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300015?af=R","date":1685162300000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/8ecb515d-8e1d-4987-b95b-2ab30fca8f2b/appl202300015-gra-0001-m.png\" alt=\"Goethite (α-FeOOH) photocatalytic activity at natural concentrations by the addition of H2O2 at neutral pH and the simultaneous presence of fluoride and bicarbonate\" /><p>Goethite and fluoride at concentrations typically found in natural waters may produce goethite fluorination leading to an increase of its photocatalytic activity, while the reaction between photoinduced <sup>•</sup>OH and bicarbonate could lead to the formation of carbonate radicals that may exhibit an interesting oxidizing power to degrade 2,4-D as well.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The effect of the simultaneous presence of fluoride (0.15–1.2 mg L<sup>−1</sup>), bicarbonates (83.6–596 mg L<sup>−1</sup>), and synthesized goethite (0.3 mg L<sup>−1</sup>) at typical concentrations often found in groundwater samples was evaluated on the degradation of 2,4-dichlorophenoxyacetic acid (2,4-D) at pH 6.9 under simulated sunlight irradiation (300 W m<sup>−2</sup>) and H<sub>2</sub>O<sub>2</sub> concentrations of 10 mg L<sup>−1</sup>. The 2,4-D removal was strongly enhanced by the presence of fluoride. F<sup>−</sup> could modify the surface of iron (hydr)oxide, leading to the formation of surface Fe–F bonds benefiting the formation of free <sup>•</sup>OH, producing upward band bending, reducing the electron-hole recombination, and enhancing the electron transfer to H<sub>2</sub>O<sub>2</sub>. On the other hand, bicarbonate may react with <sup>•</sup>OH generating CO<sub>3</sub>\n<sup>−•</sup> species that could participate in pollutant oxidation, while solar light-induced H<sub>2</sub>O<sub>2</sub> photolysis also played an important role in removing 2,4-D. These findings suggest that tuning of iron (hydr)oxides by fluoride could take place in real groundwater, generating photocatalysts with a high activity that could participate, by adding H<sub>2</sub>O<sub>2</sub>, in the enhancement of sunlight photoinduced natural abiotic processes for pollutant abatement.</p>","author":"John J. Alvear‐Daza, \nJaneth Sanabria, \nVictor A. Castaño‐Rodriguez, \nAlejandra Correa‐Betancourt, \nSilvia Binet, \nFrancisco H. Sánchez, \nGuillermo A. Muñoz‐Medina, \nHéctor M. Gutiérrez‐Zapata, \nLuis R. Pizzio, \nJulián A. Rengifo‐Herrera","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"158613a7f00e54b5a1275bda9d0bac8709546535cb432e828cd2bbc6a93ecd1d","category":"Environment"}