{"title":"The Molecular Comorbidity Network of Periodontal Disease","link":"https://www.preprints.org/manuscript/202407.2028/v1","date":1721900835000,"content":"Periodontal disease, a multifactorial inflammatory condition affecting the supporting structures of the teeth, has been increasingly recognized for its association with various systemic diseases. Understanding the molecular comorbidities of periodontal disease is crucial for elucidating shared pathogenic mechanisms and potential therapeutic targets. In this study, we conducted comprehensive literature and biological database mining utilizing tools such as DisGeNET2R, Romin, and Rentrez R libraries to identify diseases sharing associated genes, proteins, or molecular pathways with periodontitis. Our analysis revealed significant molecular overlaps between periodontal disease and several systemic conditions, including cardiovascular diseases, diabetes mellitus, rheumatoid arthritis, and inflammatory bowel diseases. Shared molecular mechanisms implicated in the pathogenesis of these diseases and periodontitis encompassed dysregulation of inflammatory mediators, immune response pathways, oxidative stress pathways, and alterations in the extracellular matrix. Furthermore, network analysis unveiled key hub genes and proteins that play pivotal roles in the crosstalk between periodontal disease and its comorbidities, offering potential targets for therapeutic intervention. Insights gained from this integrative approach shed light on the intricate interplay between periodontal health and systemic well-being, emphasizing the importance of interdisciplinary collaboration in developing personalized treatment strategies for patients with periodontal disease and associated comorbidities.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"158928afc6b9029f3dd8a7fc33bfcdf41776a2d1e4f96b1096cf1445bcd025c9","category":"Interdisciplinary"}