{"title":"Here’s Why Peak Zwift Is Always a Tuesday","link":"https://www.dcrainmaker.com/2024/01/peak-zwift-always-tuesday.html","date":1705435588000,"content":"<p><img title=\"IMG_0138.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/01/IMG_0138.jpeg\" width=\"720\" height=\"480\" /></p>\n<p>It might seem ‘odd’ to declare a Peak Zwift concurrent user high watermark only two weeks into the year, but that’s actually the way it generally works. With the exception of COVID lockdown-induced Zwift moments, the company has virtually always hit peak concurrent users on the platform on either the 2nd or 3rd Tuesday in January. And always, in the evening European. So, did they pull that off today?</p>\n<p>And why a seemingly random Tuesday in January? Well, let’s dig into that.</p>\n<h3><strong>Factors At Play:</strong></h3>\n<p>The first thing to know is that while it’s surprisingly consistent in terms of timing, the exact variables will sway it to one week or the other. We’ll get into the Tuesday thing in a second, but it’s almost always either the 2nd or 3rd Tuesday in January. The thinking, by many, including myself, was that a dumping of snow across Europe this morning (3rd Tuesday in January) would be enough to push it over the edge, especially when combined with very cold temps across the US, even in normally temperate regions.</p>\n<p>Of course, it’s more than just being a Tuesday in January, There’s a few factors at play here, making for the perfect storm of scenarios this year for it to go big:</p>\n<blockquote><p><span><strong>A) The Tour de Zwift is on:</strong> </span>This <a href=\"https://www.zwift.com/eu/tour-de-zwift/ride\">annual event occurs across</a> January, and drives a bunch of people onto the platform at mostly preset times. It started back on Wednesday, January 3rd, and runs into February.</p>\n<p><span><strong>B) Snow across Europe:</strong></span> This morning saw snow blanket much of Europe in places that might only get snow once per year. It wasn’t a ton of snow, but it’s enough to keep road/race bikes off the road. But it wasn’t horrific enough to keep people entirely indoors – in fact, people like me may have done other workouts outdoors given it was sunny in many areas after the snow.</p>\n<p><span><strong>C) Effing cold in the US:</strong> </span>With temperatures across much of the US at or well below freezing, the thinking was that it’d drive people indoors, and certainly, it did. But when it comes to Peak Zwift, the US doesn’t actually carry enough weight to massively impact it. Instead, they merely tip the scale (purely due to timezone timing).</p>\n<p><span><strong>D) Tuesday is the most popular Zwift day of the week:</strong></span> Tuesday is consistently the day with the most users peaking out each week at a given time. Monday’s tend to be a common rest day after the weekend, leading to people jumping back into sport on Tuesday. More on that down below in detail.</p></blockquote>\n<p>Now, why roughly 7PM Central European time? It’s the biggest hit of concurrent users possible for the cycling-focused platform. It’s a blend of most of the European continent, plus the UK at 6PM getting home from work and jumping on bikes. But it’s also some US Eastern &amp; US Central timezone folks getting in a lunch workout (12-1PM), and then a trickle of US Pacific &amp; Mountain folks that…well…’have a very flexible job’. 🙂 It’s still too early for most of Asia &amp; Australia, so they aren’t helping here. And with warmer weather in South America this time of year (summer), they too aren’t pulling their weight either.</p>\n<h3><strong>Busiest Times on Zwift:</strong></h3>\n<p>Here’s a chart that Zwift put together a couple of years ago for a media presentation that showed the peak days for Zwift usage each week, as well as times. Starting with the day of week, Tuesday reigns supreme – with some 50% of active Zwifters showing up on Tuesday:</p>\n<p><img title=\"ZwiftPeakPresentation1.png\" src=\"https://media.dcrainmaker.com/images/2024/01/ZwiftPeakPresentation1.png\" width=\"719\" height=\"383\" /></p>\n<p>Next, looking at the times, you can see how the weekends differ from the weekdays, but that Tuesday is far beyond the rest, and peaks in that 6-9PM local time (which, with a heavy European base, drives the overall Peak Zwift time).</p>\n<p><img title=\"ZwiftPeakPresentation2.png\" src=\"https://media.dcrainmaker.com/images/2024/01/ZwiftPeakPresentation2.png\" width=\"719\" height=\"385\" /></p>\n<p>I confirmed with Zwift today, that the above charts are still pretty accurate in terms of how things look these days too. Also, since there were two more charts in that deck related to time, I’ve stuck them here for you’re poking:</p>\n<p><img title=\"ZwiftPeakPresentation3.png\" src=\"https://media.dcrainmaker.com/images/2024/01/ZwiftPeakPresentation3.png\" width=\"355\" height=\"189\" /> <img title=\"ZwiftPeakPresentation4.png\" src=\"https://media.dcrainmaker.com/images/2024/01/ZwiftPeakPresentation4.png\" width=\"355\" height=\"189\" /></p>\n<p>Look, I don’t think you’ll ever see me on Zwift at 5AM, I’m definiteley a lunch person or an evening person. But if you’re there that early – good on you!</p>\n<h3><strong>A History of Peak Zwift:</strong></h3>\n<p>So, historically, what has Peak Zwift been at numbers-wise? Ask and you shall receive. Some of these stats I’ve tracked, and then cross-confirmed with historical stats from <a href=\"http://www.ZwiftInsider.com\">ZwiftInsider</a> and <a href=\"https://www.youtube.com/channel/UCbcwZ8hm18GK6on_S_CgmFA?themeRefresh=1\">GPLAMA</a>:</p>\n<blockquote><p><strong>2018:</strong> <a href=\"https://www.youtube.com/watch?v=vzhaC5R_h2s\">~8,500</a></p>\n<p><strong>2019:</strong> <a href=\"https://zwiftinsider.com/peak-zwift-2020/\">13,064</a></p>\n<p><strong>2020:</strong> <a href=\"https://zwiftinsider.com/peak-zwift-34940/\">34,940</a> (rare April peak, due to COVID)</p>\n<p><strong>2021</strong>: <a href=\"https://zwiftinsider.com/peak-zwift-49114/\">49,114</a></p>\n<p><strong>2022:</strong> <a href=\"https://www.youtube.com/watch?v=vzhaC5R_h2s\">42,199</a></p>\n<p><strong>2023:</strong> <a href=\"https://www.youtube.com/watch?v=d8xw7My780Y\">40,039</a></p>\n<p><strong>2024:</strong> 42,452 – Jan 9th (Jan 16th was 41,861)</p></blockquote>\n<p>Last year, for 2023, the weather was pretty tame across much of Europe those weeks, which didn’t help give Zwift the push they needed. As easy as it is to focus on these numbers, keep in mind it’s incredibly heavily influenced by weather. Also note, that the exact number can be slightly different based on the refresh rate of the companion app, so it might be +/- a hundred or so people.</p>\n<p>If we look at tonight for example (Tuesday the 16th), the highest point of the tonight was at 7:01PM Central European Time (1:01PM US Eastern Time). As you might imagine, that’s exactly when people were joining the 7PM Tour de Zwift ride, while it’s also when some people were finishing up earlier group rides from the 6PM hour.</p>\n<p>Also, a quick graph, cause everyone likes graphs:</p>\n<p><img title=\"PeakZwift2024.png\" src=\"https://media.dcrainmaker.com/images/2024/01/PeakZwift2024.png\" width=\"718\" height=\"350\" /></p>\n<p>Again, as a reminder, this is for max concurrent users on Zwift at one time. This is not total paying accounts. Zwift doesn’t disclose that number publicly, but the general consensus is that the number is likely in the 750,000-900,000 range. Zwift has often touted “millions of accounts”, but that’s total accounts created, not actually active/paying. The last time <a href=\"https://www.dcrainmaker.com/2023/02/upcoming-increase-subscriber.html\">Zwift talked about this</a>, they said “roughly 1 million subscribers”, with the keyword there being roughly. My strong suspicion has been that if Zwift is actually over 1 million subscribers, they’d likely have announced that. But as a private entity, Zwift does not have to disclose these sorts of numbers publicly (whereas Peloton has been, and sits at approximately 6.4m members, of which ~3.8m of them are paying).</p>\n<p>In any event, it’s good to see a bit of recovery here in these numbers – even if Zwift is still falling short of 2021. At the same time, keep in mind that these don’t show what the exact subscribers are for Zwift. In 2021 when people were locked-in due to various restrictions, it was far more likely that someone would have joined a random challenge (the Tour de Zwift), than other years when there were other options. Yet those same people may still be paying members on Zwift, but just using it at other times of the day. For example, myself, I didn’t partake in Peak Zwift today, simply because <a href=\"https://www.strava.com/activities/10568922519\">I went out for a run in the snow with my wife instead</a>. To each their own.</p>\n<p>Still, in talking to various people around the industry, most platforms are finally starting to see some recovery in their numbers after the COVID-bubble popped (remember, for the indoor training industry, 2020-2021 were their biggest years ever). Really only Peloton managed to avoid losing subscribers, based on the data I’ve seen (since their data is public, it was really easy) – virtually all other platforms showed and/or reported massive drops in 2022 compared to 2021. But again, things appear to be on the up and up – not only in software, but also the number of new indoor training devices that have been released over the past few months.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"159c7632d7638b071b640ba5f8812c8538832323a21c7150a40556fb445eae95","category":"Cycling"}