{"title":"Seasonal variation of the sea surface salinity in the western tropical North Atlantic on two contrasting years of precipitation in the Amazon Basin","link":"http://link.springer.com/10.1007/s10236-024-01602-1","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Motivated by the extreme hydrological events that caused an abnormal reduction and increase in discharge from the Amazon River in 2010 and 2012, respectively, this work investigates the seasonal variability of the sea surface salinity (SSS) in the western tropical Atlantic Ocean over these years. SMOS satellite data and a 1/12<span>\n                      \n                      <span>\\(^{\\circ }\\)</span>\n                      \n                    </span> horizontal resolution of the coordinate ocean model (HYCOM) are used to investigate the SSS seasonal variation and assess the balance of mixed layer salinity (MLS) and the mechanisms that rule the SSS seasonal cycle. Two simulations with the same configuration, but with and without tides effects, are employed to investigate the impact of tides on the MLS balance in the region. The results show that the SSS of the Amazon River plume (ARP) was about 1.0 larger and covered a smaller area during the summer and early year boreal autumn of 2012 compared to 2010 in the area located to northwest of the North Brazil Current (NBC) retroflection region, even with the expressive increase in the supply of fresh water from the Amazon River in 2012 compared to 2010. This variability in SSS occurs shortly after the maximum discharge of the Amazon River and is associated with the highest input of freshwater precipitation from the Intertropical Convergence Zone (ITCZ) during the 2010 boreal spring and summer. The impact of tidal swings on the MLS balance in the western region of the tropical Atlantic Ocean occurs mainly in the area near the mouth of the Amazon and Pará Rivers, especially in the northwest portion of the mouth of the Amazon River until approximately Cabo Cassiporé. The forced tidal model shows an increase in MLS over the entire seasonal cycle of about 1.2, as well as a decrease in the contribution of zonal advection to the MLS balance, which reduces the zonal component from the west and increases the meridional component towards the north.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"159e9276485e131bfc350076a52fb6d7aa46b3bf2e2dbdb62764169cc4877622","category":"Environment"}