{"title":"Niantic and Nintendo Announce New 'Pikmin' Augmented Reality Game","link":"https://www.macrumors.com/2021/03/22/niantic-nintendo-pikmin-ar-game/","date":1616460357000,"content":"Niantic and Nintendo <a href=\"https://www.nintendo.co.jp/corporate/release/en/2021/210323.html\">today announced</a> the upcoming debut of a new augmented reality game based on Nintendo's \"Pikmin\" franchise, with the title set to launch later in 2021.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/pikmin.jpg\" alt=\"\" width=\"1024\" height=\"512\" class=\"aligncenter size-full wp-image-790264\" />\r\n<br/>\r\nNintendo's Pikmin franchise features a series of strategy and puzzle games where players direct a variety of plant-like creatures called Pikmin to destroy obstacles, fight enemies, and avoid hazards while exploring an Earth-style planet. \r\n<br/>\r\n\r\n<br/>\r\nThere are few details available about the Pikmin AR game at this time, but <a href=\"https://nianticlabs.com/blog/nintendo-apps-partnership/\">Niantic says</a> that it will allow you to \"explore the world\" alongside Pikmin friends, with a focus on gameplay activities that will \"make walking more delightful.\"<blockquote>Today, we are thrilled to announce a new partnership with Nintendo to jointly develop mobile titles built on Niantic's real-world AR technology, bringing Nintendo's beloved characters to life in new ways. We're honored that Nintendo has chosen Niantic to be its publisher of real-world AR applications.\r\n<br/>\r\n\r\n<br/>\r\nTo kick off the partnership, Niantic and Nintendo are developing an app based on the Pikmin franchise. The app will include gameplay activities to encourage walking and make walking more delightful. Slated to launch later this year, this will be the first title created by our Tokyo Studio since it was established in April 2018.</blockquote>Niantic is allowing people <a href=\"https://nianticlabs.com/newappsignup/\">to sign up</a> to get more information about the title, and says more details will be available in the coming months.\r\n<br/>\r\n\r\n<br/>\r\nIn a statement, Nintendo's Shigeru Miyamoto said that Niantic's AR tech will make it possible to experience the world as if we're living with Pikmin all around us.<blockquote>Niantic's AR technology has made it possible for us to experience the world as if Pikmin are secretly living all around us. Based on the theme of making walking fun, our mission is to provide people a new experience that's different from traditional games. We hope that the Pikmin and this app will become a partner in your life.</blockquote>Niantic developed hit game \"Pokémon Go,\" an augmented reality title where players are tasked with catching Pokémon while out and about. Pokémon Go has remained popular since <a href=\"https://www.macrumors.com/2016/07/05/pokemon-go-available-in-app-store/\">its 2016 launch</a>, and Niantic has also since come out with \"Harry Potter: Wizards Unite.\" Like Pokémon Go and other Niantic titles, the upcoming Pikmin game will be a mobile title that will presumably be available on iOS and Android devices.\r\n<br/>\r\n\r\n<br/>\r\nPikmin is a strategy and puzzle video game where players direct plant-like creatures called Pikmin to destroy obstacles, fight enemies, and avoid hazards while exploring an Earth-style planet. <div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/nintendo/\">Nintendo</a>, <a href=\"https://www.macrumors.com/guide/niantic/\">Niantic</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/22/niantic-nintendo-pikmin-ar-game/\">Niantic and Nintendo Announce New &#039;Pikmin&#039; Augmented Reality Game</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/niantic-and-nintendo-announce-new-pikmin-augmented-reality-game.2289259/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0uCQ89boAeM:MlvkjdfsMWU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0uCQ89boAeM:MlvkjdfsMWU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/0uCQ89boAeM\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"15b5d81681e12da1df681e0fa41de56847e007b4b8a5b38ab841b1b2d5b1a4a8","category":"Apple"}