{"title":"Revolutionizing TB Diagnosis: Intelligent Microscopy and Image Recognition for Enhanced Acid-Fast Bacilli Detection","link":"https://www.preprints.org/manuscript/202404.0483/v1","date":1712564766000,"content":"Background: Microscopic examination of acid-fast stained sputum smears for detecting mycobacterial acid-fast bacilli (AFB) remains the most economical and readily available method for laboratory diagnosis of tuberculosis (TB). However, this conventional approach has limitations, including low sensitivity and labor-intensive procedures. Methods: An automated microscopy system incorporating artificial intelligence (AI) and machine learning for AFB identification was evaluated. The study was conducted at an Infectious Disease Hospital in Jiangsu Province, China, utilizing an intelligent microscope system (TB-Scan, Wellgen Medical, Kaohsiung). A total of 1,000 sputum smears were included in the analysis, with the system capturing digital microscopic images and employing an image recognition model to automatically identify and classify AFB. Referee technicians provided the gold standard for discrepant results. Results: The automated system demonstrated an overall accuracy of 95.00% (950/1,000), sensitivity of 91.24% (177/194), and specificity of 95.91% (773/806). Notably, the system identified 21 smears as positive that were previously reported as negative, with referee technicians confirming 17 of these as true positive and retracting the test results accordingly. Recalculating the performance, the accuracy increased to 96.70% (967/1,000), sensitivity to 91.94% (194/211), and specificity to 97.97% (773/789), with a false negative rate of 8.06% (17/211) and a false positive rate of 2.03% (16/789). Conclusions: The incorporation of AI and machine learning into an automated microscopy system demonstrated the potential to enhance the sensitivity and efficiency of AFB detection in sputum smears compared to conventional manual microscopy. This approach holds promise for widespread application in TB diagnostics and potentially other fields requiring labor-intensive microscopic examination.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"15b65310a1038e6e41f9beb8c6ec24d3203275410780cd69da5ef37468048e22","category":"Interdisciplinary"}