{"title":"A Vicsek-type model of confined cancer cells with variable clustering affinities","link":"https://academic.oup.com/ib/article/doi/10.1093/intbio/zyae005/7613089?rss=1","date":1708646400000,"content":"<span><div>Abstract</div>Clustering of cells is an essential component of many biological processes from tissue formation to cancer metastasis. We develop a minimal, Vicsek-based model of cellular interactions that robustly and accurately captures the variable propensity of different cells to form groups when confined. We calibrate and validate the model with experimental data on clustering affinities of four lines of tumor cells. We then show that cell clustering or separation tendencies are retained in environments with higher cell number densities and in cell mixtures. Finally, we calibrate our model with experimental measurements on the separation of cells treated with anti-clustering agents and find that treated cells maintain their distances in denser suspensions. We show that the model reconstructs several cell interaction mechanisms, which makes it suitable for exploring the dynamics of cell cluster formation as well as cell separation.<div><strong>Insight:</strong> We developed a model of cellular interactions that captures the clustering and separation of cells in an enclosure. Our model is particularly relevant for microfluidic systems with confined cells and we centered our work around one such emerging assay for the detection and research on clustering breast cancer cells. We calibrated our model using the existing experimental data and used it to explore the functionality of the assay under a broader set of conditions than originally considered. Future usages of our model can include purely theoretical and computational considerations, exploring experimental devices, and supporting research on small to medium-sized cell clusters.</div></span>","author":"","siteTitle":"Integrative Biology Current Issue","siteHash":"08ec31a93e0a3f830088f3051f0870206dac7048d685312e4717ea0a4882ca75","entryHash":"15bbcd7c64972ff3ed0d95bdf94da87472d0107a9e7d4acc8c50d4265b8dc665","category":"Environment"}