{"title":"Protect your brain like a modern pro—Does your helmet offer rotational impact technology?","link":"https://www.cyclingtips.com/2023/05/protect-your-brain-like-a-modern-pro-does-your-helmet-offer-rotational-impact-technology/","date":1683266441000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1250888854-scaled.jpg?width=1200\" alt=\"Protect your brain like a modern pro—Does your helmet offer rotational impact technology?\" /></figure><p>Cycling is, without a doubt, fun and a great option to improve one’s physical health, but is it safe?</p>\n<p>Safety gear is nearly non-existent for road and gravel cycling. The helmet is all we have. I can still remember watching the grand tours as a kid, and most, if not all of the peloton was without a helmet. Now, if you see a cyclist without a helmet, it seems shocking. Wearing a helmet is such a simple thing, and while it can’t protect your body or flesh in the unfortunate chance you crash, it is a surprisingly effective way to protect your brain.</p>\n\n<a href=\"https://www.cyclingtips.com/2023/05/protect-your-brain-like-a-modern-pro-does-your-helmet-offer-rotational-impact-technology/tour-de-france-5/\"><img width=\"2560\" height=\"1727\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-3135946-scaled.jpg\" alt loading=\"lazy\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-3135946-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-3135946-scaled.jpg?width=190 190w\" /></a>\n<a href=\"https://www.cyclingtips.com/2023/05/protect-your-brain-like-a-modern-pro-does-your-helmet-offer-rotational-impact-technology/topshot-cycling-fra-tdf2022-stage15/\"><img width=\"2560\" height=\"1651\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1241955933-scaled.jpg\" alt loading=\"lazy\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1241955933-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1241955933-scaled.jpg?width=190 190w\" /></a>\n\n<p>While the human body is an amazing thing that can overcome incredible injury and stress, the brain is not so quick to heal. I’m not a doctor or brain specialist, but I figure anything I can do to reduce my chances of a head injury are worth doing, and buckling a helmet on is simple and easy. However, the science and technology that goes into modern helmets have come a long way in the short amount of time that cycling helmets have become standard equipment.</p>\n<p>Thirty years seems like a long time, but when you think of how long humans have been riding bikes, it’s not. The level of testing and simply the understanding of what happens when we hit our heads has increased so much, and the resources to combat it have evolved quicker than the bicycle itself. Helmets are more comfortable, lightweight, and, most importantly, effective. Oblique impacts, also known as rotational impacts, have become the focus topic for almost all helmet brands. This type of head trauma is not completely understood, but helmet companies understand that more safety and research are always the best way forward.</p>\n<p>Helmets across the globe have to pass many different safety standards. Each region has its own tests and certificates to ensure they are up to the minimum safety standard. While some models of helmets are designed just to pass, many brands have taken things upon themselves to go above and beyond. Currently, cycling helmets do not have to pass any tests or have certificates in regard to rotational impacts. These sorts of features and safety measures are completely voluntary.</p>\n<p>It should also be noted that no helmet or technology can guarantee to prevent injury even when certified, but the helmet is truly our only line of defense when things go wrong. The tough part is that every crash and impact is unique, but wearing a helmet is, without a doubt, always the best choice.</p>\n<p>Helmet construction varies from brand to brand, but most consist of a polycarbonate shell and expanded polystyrene (EPS) foam. This absorbs the energy of the force by redirection and/or compression to reduce force transfer to the head and brain. Historically this has always been a linear impact test or direct, but cycling and cycling crashes are rarely linear. However, this is the standard test to certify a helmet. Essentially a minimum standard for the amount of energy that can be transmitted to the helmet interior for baseline impact force is set by the CPSC for the Americas, CE for Europe and parts of Asia, and AUS for Australia and New Zealand.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1457831665-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1457831665-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1457831665-scaled.jpg?width=190 190w\" /><figcaption><span>Poc helmets of Team EF Education – Easypost prior to the 23rd Santos Tour Down Under 2023 – Stage 3. (Photo by Daniel Kalisz/Getty Images)</span></figcaption></figure>\n<p>As stated above, as of now, none of these agencies require an oblique (rotational) impact test. An oblique (rotational) impact is the force applied to the helmet in multiple directions. This occurs when the helmet and head may be moved rotationally due to the direction of the applied force. This could result in a rotational brain injury. A rotational brain injury, also known as a concussion, is bleeding between the brain and skull caused by rapid rotational movement of the head, and helmets have traditionally been poor in protecting cyclists from these types of forces.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/03/CannondaleDynamReview_mips3-1340x893.jpg?width=730\" alt=\"CannondaleDynamReview_mips3\" width=\"730\" height=\"486\" /><figcaption>The Cannondale Dynam helmet uses a version of MIPS called MIPS Air Node. It eschews the plastic slip plane of traditional MIPS liners for a single pad that releases easily under force, a serious boon to cyclists who often have their hair stuck in helmets. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<p>So the real question is, what can you do to protect yourself? Lucky for us, the cycling industry is full of passionate cyclists that want to not only sell you new stuff but protect themselves too. Sure, we all feel like there is some new widget or technology that X brand wants to sell us, but when it comes to helmets, it’s a selfish endeavor as they are always looking to protect themselves just as much as they are the consumer. In all honesty, I have met a lot of helmet teams, and the passion to improve, even if it seems small, is truly unmatched across the rest of the industry. They understand that the work they do could save a life, and any added protection is progress.</p>\n<p>What the helmet teams also know is that if it’s not just as sleek, easy, comfortable, and essentially effortless, then the majority of cyclists will not use it. When it comes to modern protection against rotational brain injury for cyclists, the name Mips leads the charge. This system is added or somehow integrated into the helmet, and in just a short time, we have seen some very impressive adaptations of the system. Mips is a plastic liner added to the helmet to create a slip plane. During a rotational impact, the liner isolates the head and allows the helmet shell to rotate and absorb the energy.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2021/01/Lazer-Sphere-MIPS-helmet-review-13-1340x1005.jpg?width=730\" alt width=\"1340\" height=\"1005\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2021/01/Lazer-Sphere-MIPS-helmet-review-13.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2021/01/Lazer-Sphere-MIPS-helmet-review-13.jpg?width=190 190w, https://cdn.cyclingtips.com/wp-content/uploads/2021/01/Lazer-Sphere-MIPS-helmet-review-13.jpg?width=16 16w, https://cdn.cyclingtips.com/wp-content/uploads/2021/01/Lazer-Sphere-MIPS-helmet-review-13.jpg?width=320 320w, https://cdn.cyclingtips.com/wp-content/uploads/2021/01/Lazer-Sphere-MIPS-helmet-review-13.jpg?width=640 640w, https://cdn.cyclingtips.com/wp-content/uploads/2021/01/Lazer-Sphere-MIPS-helmet-review-13.jpg?width=380 380w, https://cdn.cyclingtips.com/wp-content/uploads/2021/01/Lazer-Sphere-MIPS-helmet-review-13.jpg?width=510 510w\" /><figcaption></figcaption></figure>\n<p>Another technology is WaveCel or Koroyd. While they are slightly different, their construction is similar. Both WaveCel and Koroyd are plastic cellular structures that replace some of the EPS foam. During a Rotational Impact, the structure will flex or compress to absorb the energy of the impact.</p>\n<p>Taking a slightly different approach, Lazer has developed KinetiCore. Instead of an added structure or material, they have designed blocks and channels molded into the EPS foam of the helmet during manufacturing. These are engineered to absorb or redirect the force of either linear or rotational impacts to help protect the head, like a “crumple zone” built into modern cars. There are other brands using similar molded techniques, and while testing for all of these is not required, Virginia Tech has become the most noteworthy testing facility. VT measures the helmet’s ability to absorb linear and rotational force and ranks performance from 1 (worst) to 5 (best). Further setting them apart is that they test helmets from all different sports.</p>\n<p>What does all this mean to you? At the end of the day, there are a lot of people across multiple sports working on protecting the brain. When you are shopping for a new helmet, or maybe you have a helmet that needs replacing because it is over three years old, don’t overlook the new tech. EPS foam deteriorates over time, and while a helmet can last much longer than three years, make sure you are prioritizing your safety.</p>\n<p>Over just the last five years, all of these systems have reduced weight, increased ventilation, and overall brought the price and availability down to helmets of all levels. It’s a good time to shop for a new helmet.</p>\n<p>As cyclists always do, we also look to the pro peloton for inspiration, and this season, 71% of men’s teams are using helmets equipped with Mips technology. On the women’s tour, 87% of teams will use Mips-equipped helmets. When you calculate all the other brands and technologies, it is probably closer to 90-95% of both men’s and women’s teams riding a helmet with some level of oblique impact-specific adaptation. The real question is, are you?</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1246634690-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1246634690-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/GettyImages-1246634690-scaled.jpg?width=190 190w\" /><figcaption><span>Marius Mayrhofer from Germany of Team DSM crashes with Mattia Cattaneo from Italy of Soudal Quick-Step (SOQ) at the 2023 Cadel Evans Great Ocean Road Race in Geelong- (Photo by CHRIS PUTNAM / AFP via Getty Images)</span> (Photo: CHRIS PUTNAM/AFP via Getty Images)</figcaption></figure>","author":"Troy Templin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"15cbd180bafc65ff94d8e053c9640787abbd5bf9902c059e8863e98a758131ba","category":"Cycling"}