{"title":"Terraform Cloud adds streamlined run task reviews","link":"https://www.hashicorp.com/blog/terraform-cloud-adds-streamlined-run-task-reviews","date":1696003200000,"content":"<p><a href=\"https://registry.terraform.io/browse/run-tasks\">Run tasks</a> allow users to directly integrate third-party tools and services within their HashiCorp Terraform Cloud workspace. They are used to perform a wide range of operations, such as managing cost, security, compliance, or enhancing workflows with custom logic. Today, we are excited to build on this functionality with the general availability of <em>streamlined run task reviews</em>; a new feature that accelerates run task evaluation by providing critical information in <a href=\"https://www.hashicorp.com/products/terraform?ajs_aid=b819fe94-ab52-42b0-8dc3-183a8dacd6e9&amp;product_intent=terraform&amp;utm_medium=video&amp;utm_channel_bucket=paid&amp;utm_offer=terraform-product-page&amp;utm_content=animated&amp;utm_source=YouTube&amp;utm_campaign=FY24-optimize-cloud-spend\">Terraform Cloud</a>. Streamlined run task reviews are now available for use with the <a href=\"https://docs.paloaltonetworks.com/prisma/prisma-cloud/prisma-cloud-admin-code-security/get-started/connect-your-repositories/ci-cd-runs/add-terraform-run-tasks\">Palo Alto Prisma Cloud run task</a> for Terraform Cloud.</p>\n\n<h2>Challenges in run task evaluation</h2>\n\n<p>When Terraform Cloud reaches the appropriate <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/run/states\">stage</a> of a run, all associated run tasks are triggered and users receive run-related information via a <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/api-docs/run-tasks/run-tasks-integration#run-task-callback\">callback request</a>. This includes a brief message and an external URL where users can access more comprehensive details on the run task evaluation. A problem with this approach is that it assumes all Terraform practitioners can access the URL to view details on the run task evaluation. However, this is not always the case. In many large organizations, third-party tools and services for addressing governance, managing risk, and ensuring compliance are restricted to a specific group of individuals. </p>\n\n<p>This means that an application developer could encounter a failed run task evaluation and lack access to the external application that provided the necessary context to resolve the issue. This led the developer to seek help to access the details, creating more work for the compliance team, hindering their overall efficiency and potentially leading to delays. Even if developers do have access, this context switching adds time and effort to the review process.</p>\n\n<h2>Introducing streamlined run task reviews for Terraform Cloud</h2>\n\n<p>Streamlined run task reviews improve the way run task evaluations are shown in Terraform Cloud and increase the amount of information provided. They are presented in a structured format that enables run task integrations to return detailed information that helps Terraform users quickly identify resource violations, understand the severity of the failure, and remediate their Terraform configuration without having to leave the app.</p>\n\n<p>The detailed information now provided by run tasks includes:</p>\n\n<ul>\n<li><strong>ID:</strong> A unique identifier for the task result.</li>\n<li><strong>Name:</strong> The name or title of the task result that is being reported.</li>\n<li><strong>Description:</strong> A brief description of the task result and its purpose.</li>\n<li><strong>Classification:</strong> The type or category of the task result (e.g. critical, high, medium, low, informational, etc.).</li>\n<li><strong>Labels:</strong> Additional metadata or tags that can be assigned to the result.</li>\n<li><strong>Status:</strong> The status or result of the task (e.g. passed, failed, etc.).</li>\n<li><strong>Message:</strong> Additional information or notes about the task that may be relevant.</li>\n<li><strong>External URL:</strong> A link to any external resources or documentation related to the task.</li>\n</ul>\n<img src=\"https://www.datocms-assets.com/2885/1695939258-image-9.png\" alt=\"View\" /><img src=\"https://www.datocms-assets.com/2885/1695939277-image-8.png\" alt=\"View\" /><h2>Streamlined run task reviews benefits</h2>\n\n<p>Streamlined run task reviews for Terraform Cloud provide two key benefits:</p>\n\n<ul>\n<li><strong>Visibility:</strong> Making it easier for Terraform practitioners to identify resource violations and fully understand the context of the failure.</li>\n<li><strong>Efficiency:</strong> Eliminating the need to redirect Terraform practitioners to an external system to view detailed information regarding the run task evaluation.</li>\n</ul>\n\n<blockquote>\n<p>\"We're excited about the new streamlined run task reviews. This updated functionality allows our joint users to have more visibility and efficiency by providing detailed descriptions of violations and fixes from Prisma Cloud in the context of their Terraform deployment environment.\" - Taylor Smith, Prisma Cloud Senior Product Manager</p>\n</blockquote>\n\n<h2>Getting started with streamlined run task reviews</h2>\n\n<p>To get started with streamlined run task reviews for Terraform Cloud, check out the <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/settings/run-tasks\">Terraform run task documentation</a>. Then <a href=\"https://registry.terraform.io/browse/run-tasks\">browse run tasks in the Terraform registry</a> to integrate third-party tools for cost, security, and compliance management. </p>\n\n<p>You can <a href=\"https://cloud.hashicorp.com/products/terraform\">get started with Terraform Cloud for free</a> to begin provisioning and managing your infrastructure in any environment. And don’t forget to <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/users-teams-organizations/users#log-in-with-your-hashicorp-cloud-platform-account\">link your Terraform Cloud and HashiCorp Cloud Platform (HCP) accounts</a> together for a seamless sign-in experience.</p>\n","author":"Mitchell Ross","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"15cfb4a30322184708a9ca427be03e5c26678730a01fd087da093b8ac818f1d2","category":"Tech"}