{"title":"Reflections of Adult Learners on Binge-Watching and its Detrimental Impact on the Environment in West Bengal, India","link":"https://www.preprints.org/manuscript/202407.2168/v1","date":1721991522000,"content":"In contemporary society, digital technology permeates every aspect of our routines. This study assessed students' comprehension of the environmental impacts of prolonged screen time, specifically during binge-watching sessions. It investigated awareness of carbon emissions from electronic device usage, binge-watching habits, and influencing factors such as content preferences, duration, and frequency. The study also explored potential interventions to mitigate environmental impacts. Using a mixed-methods approach, data were collected from 525 higher education students (150 male, 375 female) through self-designed standardized questionnaires. The analysis involved Percentage, t-test, ANOVA, Multiple Correlation, and coding processes. Results indicated that 66.67% of students had a high level of understanding regarding the environmental impact of binge-watching, while only 4.76% were highly aware of the carbon emissions from extended screen time. Additionally, 23.81% exhibited high levels of binge-watching habits and behavior. Gender disparities were significant; females demonstrated a deeper understanding of the environmental impacts (t=4.08, p &lt; α) and showed different binge-watching habits compared to males (t=3.16, p &lt; α). However, no significant gender difference was found in awareness of carbon emissions (t=0.28, p &gt; α). A notable difference (t=12.98, p &lt; α) was observed between students' understanding of environmental impacts and their awareness of carbon emissions. The study also revealed a weak positive correlation (R=0.36) and significant differences [F(2, 1572) = 320.10, p &lt; 0.05, 0.01] in understanding the environmental impacts, awareness of carbon emissions, and binge-watching behaviors. Factors influencing binge-watching and potential regulatory measures were also identified.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"15ddbe4b5f8843305201c837a55bbea084b310e3ec75451f2969552384eb7c6c","category":"Interdisciplinary"}