{"title":"Partial trailside Japanese barberry (Ranunculales: Berberidaceae) removal did not reduce the abundance of questing blacklegged ticks (Acari: Ixodidae)","link":"https://academic.oup.com/ee/article/53/3/417/7630510?rss=1","date":1710547200000,"content":"<span><div>Abstract</div>In a nature reserve in southern Maine, we removed invasive Japanese barberry (<span>Berberis thunbergii</span> de Candolle) along sections of forested recreational trails that ran through dense barberry infestations. Barberry thickets provide questing substrate and a protective microclimate for blacklegged ticks (<span>Ixodes scapularis</span> Say), and trail users could brush up against encroaching barberry and acquire ticks. Trailside barberry removal will reduce or eliminate encroaching tick questing substrate and could reduce trailside questing tick abundance by creating a microclimate more hostile to ticks. The same-day cut-and-spray treatment comprised mechanical cutting of barberry clumps (individual plants with numerous ramets) followed immediately by targeted herbicide application to the resulting root crowns. The treatment created trail shoulders to a lateral width of 1–2 m on both sides of 100-m trail sections, with initial treatment in the fall of 2013 and one retreatment in the summer of 2014. Our aim was to remove 90% of barberry clumps to achieve a 50% or better reduction in questing tick abundance on trail shoulders. However, by the fall of 2015, there were only 41% fewer barberry clumps on treated vs. untreated trail sections and there was no reduction in either adults or nymphs. We concluded that our barberry treatment protocol was not sufficiently aggressive since the resulting ecotone habitat on trail shoulders proved suitable for questing <span>I. scapularis</span>. In principle, cutting back barberry along trails should reduce trail user contact with questing deer ticks, but we were unable to demonstrate a reduction in trailside tick abundance.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"15de5f317ce5b24e6021e84358e3a784179358df4ecbd8348f571f6d54c8f1bb","category":"Environment"}