{"title":"Challenges to integrating programs for the elimination of mother-to-child transmission of HIV, syphilis, and hepatitis B into antenatal care: Experiences from Indonesia","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002977","date":1709733600000,"content":"<p>by Luh Putu Lila Wulandari, Dinar Saurmauli Lubis, Desak Putu Yuli Kurniati, Karjono Sumintang, Dewa Ayu Mirah Ardrini, Putri Mariani, Pande Putu Januraga, Artha Camellia, Ni Made Diah Permata Laksmi, Laila Mahmudah, Jason J. Ong, Louise Causer, Marco Liverani, Rebecca Guy, Virginia Wiseman</p>\r\n\r\nThe WHO’s Asia-Pacific framework for triple elimination recommends that countries evaluate their programs for the elimination of mother-to-child transmission of HIV, syphilis, and hepatitis B (EMTCT), including identifying gaps to improve program planning and the implementation of elimination strategies in antenatal care (ANC) services. In 2022, the Indonesian Ministry of Health reported that only 39% of pregnant women were tested for HIV, 14% for syphilis, and 28% for hepatitis B, respectively. We conducted a qualitative study involving a focus group discussion (FGD) and in-depth interviews with 25 key stakeholders in Bali and West Nusa Tenggara Provinces to identify specific challenges to testing for HIV, syphilis, and hepatitis B in ANC settings. Thematic analysis was used to identify the themes generated from the data. Health system bottlenecks experienced by stakeholders included supply chain management issues involving stock forecasting and stock monitoring, stock-outs of rapid test reagents which were particularly most frequent and for longer durations for syphilis and hepatitis B, high staff turnover, lack of staff training on how to perform the test, the complexity and time needed to record the data on women’s characteristics, risk behaviours, and testing in both paper format and into the computer-based surveillance systems, discrepancies in program coverage data from different divisions of the district health office involved in the reporting system, high levels of stigma that prevented women from being followed up, challenges in notifying partners, and inadequate reporting and referral of women from private providers to public ones for testing. Interventions addressing the above challenges are worthy of consideration to improve the health system function and integrate EMTCT into the ANC settings.","author":"Luh Putu Lila Wulandari","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"15de37ec195f7ecb37f24cae9254777e7c8e16acbeb9cd5eb80f7c269778479b","category":"Environment"}