{"title":"Estimating multiple years, tributary‐specific, and overall Atlantic salmon smolt abundance in a large Canadian catchment using capture–mark–recapture experiments","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15586?af=R","date":1710504692000,"content":"<h2>Abstract</h2>\n<p>Population monitoring of Atlantic salmon (<i>Salmo salar</i> L.) abundance is an essential element to understand annual stock variability and inform fisheries management processes. Smolts are the life stage marking the transition from the freshwater to the marine phase of anadromous Atlantic salmon. Estimating smolt abundance allows for subsequent inferences on freshwater and marine survival rates. Annual abundances of out-migrating Atlantic salmon smolts were estimated using Bayesian models and an 18-year capture–mark–recapture time series from two to five trapping locations within the Restigouche River (Canada) catchment. Some of the trapping locations were at the outlet of large upstream tributaries, and these sampled a portion of the total out-migrating population of smolts for the watershed, whereas others were located just above the head of tide of the Restigouche River and sampled the entire run of salmon smolts. Due to logistic and environmental conditions, not all trapping locations were operational each year. Additionally, recapture rates were relatively low (&lt;5%), and the absolute number of recaptures was relatively few (most often a few dozen), leading to incoherent and highly uncertain estimates of tributary-specific and whole catchment abundance estimates when the data were modeled independently among trapping locations and years. Several models of increasing complexity were tested using simulated data, and the best-performing model in terms of bias and precision incorporated a hierarchical structure among years on the catchability parameters and included an explicit spatial structure to account for the annual variations in the number of sampled locations within the watershed. When the best model was applied to the Restigouche River catchment dataset, the annual smolt abundance estimates varied from 250,000 to 1 million smolts, and the subbasin estimates of abundance were consistent with the spatial structure of the monitoring programme. Ultimately, increasing the probabilities of capture and the absolute number of recaptures at the different traps will be required to improve the precision and reduce the bias of the estimates of smolt abundance for the entire basin and within subbasins of the watershed. The model and approach provide a significant improvement in the models used to date based on independent estimates of abundance by trapping location and year. Total abundance and relative production in discrete spawning, nesting, or rearing areas provide critical information to appropriately understand and manage the threats to species that can occur at subpopulation spatial scales.</p>","author":"Guillaume J. R. Dauphin, \nCarole‐Anne Gillis, \nGérald J. Chaput","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"15e4dc47eca506217c8f8ac69ce8a072a7495cf149e535adb4a82096ee542939","category":"Environment"}