{"title":"Structure of resilience: A Machiavellian contribution or ‘paddle your own canoe’","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302257","date":1714399200000,"content":"<p>by Aleksandra Zlatkovic, Vesna Gojkovic, Jelena Dostanic, Veljko Djuric</p>\r\n\r\nAccording to biobehavioral synchronicity model, empathy—a fundamental requirement for reciprocal and prosocial behavior—is at the core of rebound from stress, an essential feature of resilience. However, there are also reports on antagonistic traits—characterized by empathic deficit—bolstering immunity to stress. In the literature there is also inconclusive evidence regarding gender-related differences in resilience. In separate female and male subsamples we analyzed the network constellation entailing resilience (assessed as rebound from stress), empathic (cognitive empathy, affective resonance, and affective dissonance) and antagonistic personality traits (Machiavellianism, grandiose- and vulnerable narcissism). For both genders, Machiavellian agency instigated by narcissistic admiration occupied the central position in the network indicating that personality’s resources for proactivity and control are essential for successful rebound. Empathy, and in particular its affective component, occupied only a peripheral position in the network. Machiavellian antagonism in men and grandiose narcissism in females bridged prosocial mechanism of resilience with antagonistic nodes of the network. In the female subsample both types of malign narcissism (rivalry and vulnerable narcissism) directly thwarted rebound. This process was not detected in the male subsample network dominated by antagonism. That is, gender-related differences were associated with the avoidance strategies rather than with the proactive strategies. Thus, resilience assessed as rebounding from stress primarily involves personality resources which modulate proactive- and prosocial- but not necessarily reciprocal behavior.","author":"Aleksandra Zlatkovic","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"15e66ecb587777e0866922f0e6eb1571519f9445681ef7dbcf81f5db33c322a2","category":"Interdisciplinary"}