{"title":"★ Et tu, Procter & Gamble?","link":"https://daringfireball.net/2021/04/et_tu_procter_gamble","date":1617991908000,"content":"\n<p>Sharon Terlep, Tim Higgins, and Patience Haggin, reporting for The Wall Street Journal, <a href=\"https://www.wsj.com/articles/p-g-worked-with-china-trade-group-on-tech-to-sidestep-apple-privacy-rules-11617902840\">“P&amp;G Worked With China Trade Group on Tech to Sidestep Apple Privacy Rules”</a> (<a href=\"https://apple.news/ALxtnAojhRVyEKpyhNKX6Hw\">News+ link</a>):</p>\n\n<blockquote>\n  <p>Procter &amp; Gamble Co. helped develop a technique being tested in\nChina to gather iPhone data for targeted ads, a step intended to\ngive companies a way around Apple Inc.’s new privacy tools,\naccording to people familiar with the matter. […]</p>\n\n<p>The company has joined forces with dozens of Chinese trade groups\nand tech firms working with the state-backed China Advertising\nAssociation to develop the new technique, which would use\ntechnology called device fingerprinting, the people said. Dubbed\nCAID, the advertising method is being tested through apps and\ngathers iPhone user data. Through the use of an algorithm, it can\ntrack users for purposes of targeting ads in a way that Apple is\nseeking to prevent. […]</p>\n\n<p>Through apps, CAID collects user device data, such as the device\nstart-up time, model, time zone, country, language and IP address.\nBased on China’s personal information security standards, most of\nthose data aren’t counted as “personal information.” But a\nso-called device ID can be generated by algorithm based on these\ndata. That device ID can achieve a similar tracking effect as the\nidentifier that Apple is allowing users to block.</p>\n</blockquote>\n\n<p>Not a good look for a major American company like Procter &amp; Gamble to be in cahoots with a Chinese trade group to circumvent Apple’s new privacy rules.</p>\n\n<p>The whack-a-mole<sup id=\"fnr1-2021-04-09\"><a href=\"#fn1-2021-04-09\">1</a></sup> aspect of Apple’s new privacy rules is that while Apple can restrict access to the API that provides access to the <a href=\"https://en.wikipedia.org/wiki/Apple_ID_for_Advertisers\">IDFA</a> identifier, clever developers can find (perhaps infinite) other ways to combine things they <em>do</em> have access to into a unique, or even just “close enough to unique to be useful for tracking”, identifier. IP addresses, to name just one example, are a big factor that Apple can’t block would-be-trackers from using. That’s what CAID is, but CAID isn’t some rogue effort — it has the backing of the Chinese government.</p>\n\n<p>Doing this is clearly against Apple’s rules. The questions are: Can Apple detect these techniques? And what is Apple going to do if they do identify apps in China using CAID in flagrant violation of the App Store rules, if those apps have the backing (implicit or explicit) of the Chinese government?</p>\n\n<p>Consider just Tencent. What is Apple going to do if <a href=\"https://medium.com/@KaitlinZhang/who-uses-wechat-and-why-is-wechat-so-popular-in-china-c8df11577489\">WeChat</a> is flagged for circumventing the App Store privacy rules, and Tencent says “No thank you” to Apple’s rules, that they’re going to do it anyway because they have the backing of the PRC? Reading between the lines, I <em>think</em> Apple is diplomatically telling the companies involved with CAID that they will pull the apps from the App Store over this. Here’s Apple’s statement to The Journal:</p>\n\n<blockquote>\n  <p>Device fingerprinting runs afoul of Apple’s rules, and the tech\ncompany has said it would ban any app that violates its policies.</p>\n\n<p>“The App Store terms and guidelines apply equally to all\ndevelopers around the world, including Apple,” an Apple spokesman\nsaid. “We believe strongly that users should be asked for their\npermission before being tracked. Apps that are found to disregard\nthe user’s choice will be rejected.”</p>\n</blockquote>\n\n<p>I don’t read diplomat-ese fluently, but that statement seems adamant: “all developers around the world, even Apple”. I wonder, though, if Tencent believes they can track users with impunity because Apple wouldn’t dare pull WeChat (etc.) from the Chinese App Store.</p>\n\n<p>Basically, IDFA was Apple’s attempt to work with companies to provide a way to offer a sanctioned identifier for advertising tracking that respected user privacy and user control over tracking. It didn’t work — these companies have no respect for user privacy or user control, even <em>with</em> IDFA. So Apple is taking it to the next level. That’ll only work if Apple backs up its rules with enforcement — even in China.</p>\n\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn1-2021-04-09\">\n<p>Random spelling factoid I recently learned: the actual arcade game is spelled “<a href=\"https://en.wikipedia.org/wiki/Whac-A-Mole\">Whac-A-Mole</a>”, with no “k”. Which, to me, looks wac-y.&nbsp;<a href=\"#fnr1-2021-04-09\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 1 in the text.\">&#x21A9;&#xFE0E;</a></p>\n</li>\n</ol>\n</div>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"15ec8e5e32f02821388c6fd5e1d2d6fc64cda219b0ba3e029d464e91aac7a9a2","category":"Tech"}