{"title":"Immuno-Electron Microscopy in the Evaluation of Connective Tissue Disorders","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.403/7719861?rss=1","date":1721779200000,"content":"<span>Our Micro-Imaging facility focuses on connective tissues, with the majority of effort dedicated to ultrastructural analysis of bone, cartilage, eye, tendon and skin by transmission electron microscopy. Since the installation of our laboratory almost 40 years ago, many of our investigations have included immuno-gold localization of the various collagens and associated molecules present within normal matrix, often allowing us to assign function to these molecules. With these results in mind, we also evaluate disease states resulting from mutations in these molecules, sometimes with surprising results. Mutations in cartilage Oligomeric Matrix Protein (COMP) are responsible for the dwarfing condition Pseudoachondroplasia. The function of COMP in normal tissue is controversial; null mutations have no consequence, however COMP interacts with several structural collagens and likely stabilizes cartilage matrix. Some years ago, we were fortunate to obtain cartilage from an individual affected with the Pseudoachondroplasia. After lite fixation and PLT dehydration, we embedded the tissue in Lowicryl K4M for section-surface immunolabeling. Localized by indirect immuno-gold, TEM demonstrated the presence of COMP not only within the cartilage matrix, but also within lamellae of distended RER. Several other molecular species including collagen types II, IX, XI (Figure 1, left) and proteoglycan normally present in the cartilage matrix also accumulated in the distended RER (Figure 1, right). Growth of long bones depends on secretion of these molecules into the matrix, where they assemble into a cartilage model, which expands and calcifies at the growth plate where it transitions to bone. Expansion of the model halts when matrix components accumulate in the RER. Despite a lack of phenotype in COMP null animals, mutations in COMP result in dwarfism via an unanticipated mechanism.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"15fe5042697595b005bf6a0afcb1a39ae3a87e0714420d3b51c80953efd69842","category":"Environment"}