{"title":"A bootstrap-based approach to combine individual-based forest growth models and remotely sensed data","link":"https://academic.oup.com/forestry/article/97/4/649/7607001?rss=1","date":1707782400000,"content":"<span><div>Abstract</div>Combining forest growth models with remotely sensed data is possible under a generalized hierarchical model-based (GHMB) inferential framework. This implies the existence of two submodels: the growth model itself ($\\mathcal{M}_{1}$) and a second submodel that links the growth predictions to some remotely sensed variables ($\\mathcal{M}_{2}$). Analytical GHMB estimators are available to fit submodel $\\mathcal{M}_{2}$ and account for the uncertainty stemming from submodel $\\mathcal{M}_{1}$, i.e. the growth model. However, when the growth model is individual based, it is usually too complex to be differentiated with respect to its parameters. As a result, the analytical GHMB estimators cannot be used. In this study, we developed a bootstrap approach for the GHMB inferential framework in order to combine individual-based forest growth models with remotely sensed data. Through simulation studies, we showed that the bootstrap estimators were nearly unbiased when both submodels were linear. The estimator of the parameter estimates remained nearly unbiased when submodel $\\mathcal{M}_{1}$ became complex, i.e. non-differentiable, and submodel $\\mathcal{M}_{2}$ was nonlinear with heterogeneous variances and correlated error terms. The variance estimator showed some biases but these were relatively small. We further demonstrated through a real-world case study that the predictions of a complex individual-based model could be linked to a Landsat-8 near-infrared spectral band in the boreal forest zone of Quebec, Canada.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"1600fed17392e91e998b4eccd0b8645871a29391829848ef4588e361f4efe228","category":"Environment"}