{"title":"Differential regulation of physicochemical properties and myofibrillar protein degradation of yak meat by interactions between reactive oxygen species and reactive nitrogen species during postmortem aging","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13886?af=R","date":1726221910000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>This study aimed to explore how interactions between reactive oxygen species (ROS) and reactive nitrogen species (RNS) affect oxidative properties, nitrosative properties, and myofibrillar protein degradation during postmortem aging of yak meat.</p>\n<h2>RESULTS</h2>\n<p>Yak longissimus dorsi was incubated with saline, ROS activator (H<sub>2</sub>O<sub>2</sub>)/inhibitor N-Acetyl-L-cysteine (NAC) and RNS activator S-Nitrosoglutathione (GSNO)/inhibitor L-NAME hydrochloride (L-NAME) combined treatments at 4 °C for 12, 24, 72, 120, and 168 h. The results indicated that regardless of whether RNS was activated or inhibited, activated ROS played a dominant role in myofibrillar protein degradation by oxidative modification to increase carbonyl content, disulfide bonds, surface hydrophobicity, and dimerized tyrosine while decreasing sulfhydryl content, thereby degrading nebulin, titin, troponin-t and desmin. Notably, the Warner–Bratzler shear force (WBSF) of the H<sub>2</sub>O<sub>2</sub> + L-NAME group was the smallest, whereas that of the NAC + GSNO group was smaller than that of the NAC + L-NAME group.</p>\n<h2>CONCLUSION</h2>\n<p>These findings provide new insights into meat tenderization patterns through the interaction between ROS and RNS. © 2024 Society of Chemical Industry.</p>","author":"Xue Yang, \nXinrong Bu, \nYiheng Li, \nRuheng Shen, \nYufeng Duan, \nHongmei Shi, \nXiangying Kong, \nLi Zhang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"1602f59fd3832e2cc9d8bcd673c98dc1c650a1a06a5f4583baa87e996e8e167d","category":"Environment"}