{"title":"A Deep Learning Approach for Accurate Path Loss Prediction in LoRaWAN Livestock Monitoring","link":"https://www.preprints.org/manuscript/202403.0589/v1","date":1710391445000,"content":"The agricultural sector is amidst an industrial revolution driven by the integration of sensing, communication, and artificial intelligence (AI). Within this context, the internet of things (IoT) takes center stage, particularly in facilitating remote livestock monitoring. Challenges persist, particularly in effective field communication, adequate coverage, and long-range data transmission. This study focuses on employing LoRa communication for livestock monitoring in mountainous pastures in the north-western Alps in Italy. The empirical assessment tackles the complexity of predicting LoRa path loss attributed to diverse land-cover types, highlighting the subtle difficulty of gateway deployment to ensure reliable coverage in real-world scenarios. Moreover, the high expense of densely deploying end devices makes it difficult to fully analyze LoRa link behavior, hindering a complete understanding of networking coverage in mountainous environments. This study aims to elucidate the stability of Lora link performance in spatial dimensions and ascertain theextent of reliable communication coverage achievable by gateways in mountainous environments. Additionally an innovative deep learning approach was proposed to accurately estimate path loss across challenging terrains. Remote sensing contributes to land-cover recognition, while Bidirectional Long Short-Term Memory (Bi-LSTM) enhances the path loss model’s precision. Through rigorous implementation and comprehensive evaluation using collected experimental data, this deep learning approach significantly curtails estimation errors, outperforming established models. Our results demonstrate that our prediction model outperforms established models with a reduction in estimation error to less than 5dB, marking a 2X improvement over state-of-the-art models. Overall, this study signifies a substantial advancement in IoT-driven livestock monitoring, presenting robust communication and precise path loss prediction in rugged landscapes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"16083977ac02c63f9a2ca0a2e362d032a928c2dce45a5f95f48d5766c6a24f28","category":"Interdisciplinary"}