{"title":"iPhone 15 Pro Low-Energy Chip to Allow Solid-State Buttons to Work When Device is Off or Out of Battery","link":"https://www.macrumors.com/2023/03/29/iphone-15-pro-low-energy-microprocessor/","date":1680080082000,"content":"The iPhone 15 Pro and Pro Max will use a new ultra-low energy microprocessor allowing certain features like the new capacitive solid-state buttons to remain functional even when the handset is powered off or the battery has run out, according to a source that <a href=\"https://forums.macrumors.com/threads/capacitive-buttons-on-iphone-15-pro-models-use-a-new-micro-processor-to-manage-button-presses-and-enhanced-find-my-support-while-the-phone-is-off.2385131/\">shared details on the <em>MacRumors</em> forums</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/iPhone-15-Pro-Buttons-CAD-Leak.jpg\" alt width=\"1600\" height=\"895\" /><div><em>CAD-based render of new solid-state buttons on iPhone 15 Pro models</em></div>\r<br />\nThe source of this rumor is the same forum member that <a href=\"https://www.macrumors.com/2022/08/31/iphone-14-pro-camera-cutout-indicators/\">shared accurate details about the Dynamic Island</a> last year before the iPhone 14 Pro was officially launched, so there is good reason to believe that the following information is reliable.\r<br />\n\r<br />\nAccording to the anonymous source, the new microprocessor will replace Apple's current super-low energy mode that allows an iPhone to be located via Find My after it has been powered off or for up to 24 hours if its battery has been depleted, and enables Apple Pay Express Mode to be used for up to five hours after the battery has run out. \r<br />\n\r<br />\nThe new chip will allegedly take over these existing Bluetooth LE/Ultra Wideband functions in addition to powering the solid-state buttons – including an \"action\" button that replaces the mute switch – when the phone is on, off, or the battery is depleted. The microprocessor will \"immediately sense capacitive button presses, holds, and even detect their own version of 3D Touch with the new volume up/down button, action button, and power button, while the phone is dead or powered down,\" says the tipster. \r<br />\n\r<br />\nThe source also claims that the new low-energy capacitive features are currently being tested with and without Taptic Engine feedback while powered off, but not while the battery is dead, however \"whether this tidbit makes it to production or not is highly uncertain but IS being tested,\" they added.\r<br />\n\r<br />\nThe source claims that their \"man inside\" Apple has seen two functional versions of the rumored new <a href=\"https://www.macrumors.com/2023/03/20/iphone-15-volume-mute-buttons-cad/\">unified volume button</a> in testing, including one where the volume goes up/down faster depending on the amount of force used when pressed, and another where the volume can be adjusted by swiping up and down on the button with a finger. They do not know which method will be adopted for the final release, but these features are enabled by software, so this functionality may well be user-customizable.\r<br />\n\r<br />\nThe anonymous tipster claims that their inside source is on the Apple development team, so they do not have additional information about the design of the new models unless the physical features require software development to complement them.\r<br />\n\r<br />\nAs per previous rumors, solid-state capacitive buttons are expected to be exclusive to the iPhone 15 Pro models, with the standard iPhone 15 models retaining the same traditional button mechanism as on the iPhone 14 series. The iPhone 15 Pro is also rumored to be gaining a software-customizable button in lieu of the mute switch, with a unified volume button or \"rocker\" replacing the separate up/down volume buttons. For everything else we know about the new iPhone 15 series, check out our dedicated roundups using the links below.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a>, <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/29/iphone-15-pro-low-energy-microprocessor/\">iPhone 15 Pro Low-Energy Chip to Allow Solid-State Buttons to Work When Device is Off or Out of Battery</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-pro-low-energy-chip-to-allow-solid-state-buttons-to-work-when-device-is-off-or-out-of-battery.2385191/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1608f9cbb266a18ff7846c88a976eebf3e8d82f1115152d45ad77dd21e4a1dd0","category":"Apple"}