{"title":"A gain-of-function mutation in BnaIAA13 disrupts vascular tissue and lateral root development in Brassica napus","link":"https://academic.oup.com/jxb/article/75/18/5592/7686459?rss=1","date":1717286400000,"content":"<span><div>Abstract</div>Rapeseed (<span>Brassica napus</span>) is an important oilseed crop worldwide. Plant vascular tissues are responsible for long-distance transport of water and nutrients and for providing mechanical support. The lateral roots absorb water and nutrients. The genetic basis of vascular tissue and lateral root development in rapeseed remains unknown. This study characterized an ethyl methanesulfonate-mutagenized rapeseed mutant, <span>T16</span>, which showed dwarf stature, reduced lateral roots, and leaf wilting. SEM observations showed that the internode cells were shortened. Observations of tissue sections revealed defects in vascular bundle development in the stems and petioles. Genetic analysis revealed that the phenotypes of <span>T16</span> were controlled by a single semi-dominant nuclear gene. Map-based cloning and genetic complementarity identified <span>BnaA03.IAA13</span> as the functional gene; a G-to-A mutation in the second exon changed glycine at position 79 to glutamic acid, disrupting the conserved degron motif VGWPP. Transcriptome analysis in roots and stems showed that auxin and cytokinin signaling pathways were disordered in <span>T16</span>. Evolutionary analysis showed that AUXIN/INDOLE-3-ACETIC ACID is conserved during plant evolution. The heterozygote of <span>T16</span> showed significantly reduced plant height while maintaining other agronomic traits. Our findings provide novel insights into the regulatory mechanisms of vascular tissue and lateral root development, and offer a new germplasm resource for rapeseed breeding.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"160c9c1de2a7159c1bca84c590413d52e78d07b714a32d0ac6fc5df2bf2a50fc","category":"Environment"}