{"title":"Evaluation of Evidence-Based Practice Competency among Greek Undergraduate Nursing Students","link":"https://www.preprints.org/manuscript/202408.0156/v1","date":1722592352000,"content":"Several years now, the global scientific community has accepted and recognized the importance of Evidence-based practice (EBP) for Nursing science. The main factor for the implementation of EBP is the competence of undergraduate Nursing students towards EBP, so that they as active nurses be ready for its application in their clinical practice, in order to provide better care for their patients. The aim of the present study is to examine the level of evidence-based practice competency evaluated with the self-reported EBP-COQ questionnaire. A quantitative study based on cross-sectional design was conducted from February to June 2022 in a convenience sample of Greek undergraduate nursing students. The Evidence-Based Practice Competence Questionnaire (EBP-COQ) and a questionnaire on undergraduate students’ gender, age, academic year, and training in the field of research were used. The SPSS 26.0 program was used to perform descriptive, bivariate and multivariate analyses. A total of 175 undergraduate students participated at the Hellenic University Nursing (Greece), specifically from the 2nd and 3rd academic year. The mean score of EBP-COQ for nursing undergraduate students was 3.03 ± 0.26, indicating moderate EBP. Among the EBP-COQ dimensions, the mean scores were obtained 3.03 ± 0.32 for Attitude toward EBP, 3.01 ± 0.49 for Skills in EBP, and 3.03 ± 0.49 for Knowledge in EBP. They were not found significant differences among participants’ mean EBP-COQ scores regarding gender (p = 0.766), age (p = 0.400), academic year (p = 0.153), and training in the field of Research Methodology (p = 0.538). It appears that the level of readiness towards EBP is mediocre between undergraduate nursing students at a university in Greece. Therefore, it is necessary to carry out new studies in the future, so that there is a correct approach of all the elements that contribute to the readiness of Nursing undergraduate students regarding EBP.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"160ea02f0cc7c9dc50bfac38f1433b725e51aa1da9bd8792e88631caa515ebb6","category":"Interdisciplinary"}