{"title":"iMessage gets a major makeover that puts it on equal footing with Signal","link":"https://arstechnica.com/?p=2005125","date":1708562236000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/03/crypto-key-800x450.jpeg\" alt=\"Stylized illustration of key.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/03/crypto-key.jpeg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/\">Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>iMessage is getting a major makeover that makes it among the two messaging apps most prepared to withstand the coming advent of quantum computing, largely at parity with Signal or arguably incrementally more hardened.</p>\n<p>On Wednesday, Apple <a href=\"https://security.apple.com/blog/imessage-pq3/\">said</a> messages sent through iMessage will now be protected by two forms of end-to-end encryption (E2EE), whereas before, it had only one. The encryption being added, known as PQ3, is an implementation of a new algorithm called Kyber that, unlike the algorithms iMessage has used until now, can’t be broken with quantum computing. Apple isn’t replacing the older quantum-vulnerable algorithm with PQ3—it's augmenting it. That means, for the encryption to be broken, an attacker will have to crack both.</p>\n<h2>Making E2EE future safe</h2>\n<p>The iMessage changes come five months after the Signal Foundation, maker of the Signal Protocol that encrypts messages sent by more than a billion people, <a href=\"https://arstechnica.com/security/2023/09/signal-preps-its-encryption-engine-for-the-quantum-doomsday-inevitability/\">updated the open standard</a> so that it, too, is ready for post-quantum computing (PQC). Just like Apple, Signal added Kyber to X3DH, the algorithm it was using previously. Together, they’re known as PQXDH.</p></div><p><a href=\"https://arstechnica.com/?p=2005125#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2005125&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1611be8943b571afda532d1386cd273cb7ebbc6049d76d6e256307602c13c6e0","category":"Tech"}