{"title":"£40 off an annual Flaviar Exclusives membership","link":"https://www.bikeradar.com/bikeradar-daily-deals/40-off-an-annual-flaviar-exclusives-membership/","date":1619195765000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/All-article-header-image-flaviar-3b36c41.jpg?quality=90&amp;resize=620,413\" />                                            <p>Want to discover lots of exciting new spirits and increase your drinks knowledge? Then Flaviar is the spirits club for you. Founded in 2012, Flaviar Exclusives helps its members explore their flavour preferences by introducing them to a host of producers, with a special focus on craft players, boutique distillers, and hidden gems alongside classic drams. Members can choose both sample boxes and full-size bottles from a vast collection of rare and unusual spirits for the quarterly deliveries shipped direct to their door. They’ll also get to enjoy exclusive experiences and the red-carpet treatment at top distilleries (when they open again), plus receive personalised recommendations. Flaviar Exclusives usually costs £250 a year (or £75 a quarter), but with this exclusive <a href=\"https://flaviar.5d3x.net/yRqqav\" target=\"_blank\">deal</a>, you can enjoy £40 off an annual membership.</p>\n<p><a href=\"https://flaviar.5d3x.net/yRqqav\" target=\"_blank\">Get £40 off now</a></p>\n<section><div>\n        <p><em><strong>Note: </strong></em><i>We negotiate hard to bring you great offers and the best prices in our online deals. We receive a commission from the retailer for each completed purchase and this income helps us to continue to be able to offer you our high-quality content free of charge.</i></p>\n\n    </div>\n    </section><p>So, what’s included in a Flaviar membership?</p>\n<ul><li><strong>Quarterly spirits delivery: </strong>a quarterly spirits delivery including one tasting box with 3 x 1.5oz samples, as well as one full-size (750ml) premium bottle.</li>\n<li><strong>Access to rare and original spirits:</strong> Once a month, Flaviar opens up The Vault – its private collection of the most exclusive, hard to find spirits out there, which can include anything from sold out Yamazaki to the notorious Pappy.</li>\n<li><strong>Exclusive, private bottlings: </strong>Access to limited edition private bottlings from Flaviar, including the peated blockbuster Scotch Son of a Peat, the all-American bourbon Corn Trooper United Craft Bourbon, the crowd-tasting curated Cognac Frérot, and Deer, Bear &amp; Moose, which are extremely limited batches of wild whiskies.</li>\n<li><strong>Unlimited free shipping for orders over $: </strong>Quarterly tasting boxes and full-size bottles are shipped for free and members benefit from unlimited free shipping on orders over £45.</li>\n<li><strong>Great events:</strong> Flaviar puts on live flavour experiences (currently virtual), which has included a Live Blended at Home session with WhistlePig that allowed members to try their hand at blending whiskey and co-create WhistlePig Home Stock. There was also the Flaviar annual Craft Spirits Celebration, where members can receive tasting/blending kits at no additional cost to share the fun with a friend or two. This year will see sessions hosted by a veritable line up, including Macallan’s Master of Wood, Compass Box’s Whisky Maker, and rock royalty Metallica hosting a Blackened session.</li>\n<li><strong>VIP distillery access:</strong> Flaviar members can enjoy the red-carpet treatment at a number of craft distilleries around the world (when they reopen).</li>\n</ul><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/Box-Bottles-and-Vials_Lifestyle_Japanese-Box-img-1-7862670.jpg?quality=90&amp;resize=513%2C667\" /></div>    <figcaption></figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/Flaviar-viski-11-img-2-0d738d7.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption></figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/Flaviar-Gin-11-img-3-b373292.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption></figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/03_image_school2-img-4-e171cfc.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption></figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<p><strong>Who is Flaviar membership for?</strong></p>\n<p>Flaviar membership is for people looking for more joy from both their spirits and life. It’s for those just starting on their journey of spirits discovery, as well as for those who are more experienced and already know what they like. Flaviar is here to disrupt the same old, same old, and challenge its members to try new things and experiences more often. Flaviar members are explorers that crave knowledge and enjoy bonding over good drinks and the social currency that comes with exclusive access.</p>\n<p>Offer ends 29/07/21. Cannot be used in conjunction with any other discounts or offers.</p>\n<p><a href=\"https://flaviar.5d3x.net/yRqqav\" target=\"_blank\">Get £40 off now</a></p>\n<p><em>You can find all our current shopping deals<strong> <a href=\"https://www.bikeradar.com/bikeradar-daily-deals/\" target=\"_blank\">here</a></strong>. If you have any questions about the deal product or the related services, please contact the provider directly. If you have any questions about the online shopping deal itself, or if you would like to work with us as a partner, please email <a href=\"mailto:deals@bikeradar.com\" target=\"_blank\">deals@bikeradar.com</a></em></p>","author":"Steve Newell","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"162a2a696dda129dd957a967b4d55a90c0be4d81824e3cf069acc226dba4be35","category":"Cycling"}