{"title":"The ontogeny of social networks in wild great tits (Parus major)","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae011/7616293?rss=1","date":1709164800000,"content":"<span><div>Abstract</div>Sociality impacts many biological processes and can be tightly linked to an individual’s fitness. To maximize the advantages of group living, many social animals prefer to associate with individuals that provide the most benefits, such as kin, familiar individuals, or those of similar phenotypes. Such social strategies are not necessarily stable over time but can vary with changing selection pressures. In particular, young individuals transitioning to independence should continuously adjust their social behavior in light of developmental changes. However, social strategies exhibited during adolescence in animals are understudied, and the factors underlying social network formation during ontogeny remain elusive. Here, we tracked associations of wild great tits (<span>Parus major</span>) during the transition to independence and across their first year of life. Both spatial and social factors predicted dyadic associations. During the transition to independence in spring, fledglings initially preferred to associate with siblings and peers over non-parent adults. We found no evidence for preferred associations among juveniles of similar age or fledge weight during that time but weak evidence for some potential inheritance of the parental social network. By autumn, after juveniles had reached full independence, they exhibited social strategies similar to those of adults by establishing stable social ties based on familiarity that persisted through winter into the next spring. Overall, this research demonstrates dynamic changes in social networks during ontogeny in a species with a fast life history and limited parental care, which likely reflect changes in selective pressures. It further highlights the importance of long-term social bonds based on familiarity in this species.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"162ab8ee5ac73e487747b0ff88d23b67a3430cafc277db49a7ca9a2a79b57aea","category":"Environment"}