{"title":"Protocol for the Nutrition for Brain and Body Health Study: A Randomized Feasibility Trial","link":"https://www.preprints.org/manuscript/202403.1038/v1","date":1710760351000,"content":"Older adults with obesity have an increased risk for cognitive decline and subsequent Alzheimer’s disease. Previous research has focused on the impact of individual nutrients and overall dietary patterns to improve cognitive function. The Brain and Body Health (BB-Health) study aims to demonstrate the feasibility of a multicomponent nutritional supplement (MCNS) and weight loss (WL) intervention for individuals with overweight and obesity who are not consuming a healthy diet. BB-Health is a parallel-group randomized placebo-controlled 2x2 factorial pilot trial comparing the MCNS, WL, and MCNS+WL with a Control group. Eligible participants are 55 to 85 years of age with a body mass index 27.0 to 39.9 kg/m2. Major exclusion criteria include type 2 diabetes, moderate or severe cognitive impairment, and self-reported healthy dietary pattern. The BB-Health feasibility trial is registered as NCT05542199 at clinicaltrials.gov. The BB-Health objectives are to report: 1) recruitment and enrollment, including pace and descriptive statistics of the study sample; 2) adherence to the administered interventions; 3) successful data collection and performance of outcome assessments, including evaluation of change in key outcomes over time that are powered for this pilot study; and 4) summary statistics on outcomes for use in planning a subsequent, larger trial. The outcomes of interest are age-sensitive cognitive assessments, cerebral hemodynamics, and related health parameters. All measurements are collected at baseline, 3-, 6-, and 12-month visits. If the BB-Health protocol demonstrates feasibility, the novel MCNS with and without a parallel WL intervention has potential to be administered in a confirmatory randomized trial to evaluate ability to prevent age-related cognitive decline and improve brain health. The BB-Health Feasibility Study could significantly contribute to our understanding of the influence of diet and weight management on cognitive health","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"163253d42932113d68dbe08d1f5fa12555453a9f6617201320984048a1267a83","category":"Interdisciplinary"}