{"title":"Food Microbiology in the Post-COVID-19 Era: Insights from Bibliometric Analysis in Bioeconomics","link":"https://www.preprints.org/manuscript/202408.1192/v1","date":1724083941000,"content":"Background: Before the COVID-19 outbreak, food microbiology was crucial in identifying and preventing foodborne pathogens like Salmonella and E. coli. The pandemic underscored the importance of this discipline, highlighting the need for enhanced surveillance and microbiological control in the food chain to prevent future global public health threats. This research aimed to advance knowledge management in Bioeconomy, focusing on Eco-Intensification and biotechnology applications that directly affect food microbiology, especially in the context of the COVID-19 crisis. Methodology: The study involved a comprehensive literature review grounded in the epistemological principles of Bioeconomy, utilizing the Bibliometric Scopus database. This approach facilitated the exploration of the development of eco-intensification and biotechnology applications within food safety and nutrition microbiology. Results: The findings emphasize the importance of understanding the social and economic impacts of microbiological activities in food intake through a Bioeconomy lens. The research highlights the need for integrating microbiological insights into broader bioeconomic frameworks to address food safety and sustainability challenges effectively. Conclusion: Recommendations are provided for decision-makers to enhance public health agendas from a bioeconomic perspective. These recommendations aim to strengthen the focus on Bioeconomy and improve the management of interactions between food microbiology and the challenges exacerbated by the COVID-19 pandemic.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"163f6db27b49f073e0e35ea7833b20327a70b5b0ac4fa725b9524c87f46268db","category":"Interdisciplinary"}