{"title":"First public betas of Apple’s low-key next-gen operating systems launch today","link":"https://arstechnica.com/?p=1953167","date":1689182419000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/2023-apple-800x447.jpeg\" alt=\"First public betas of Apple’s low-key next-gen operating systems launch today\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/2023-apple-scaled.jpeg\">Enlarge</a> (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Apple is officially releasing the first public betas of iOS 17, iPadOS 17, watchOS 10, and macOS 14 Sonoma today, a little over a month after releasing the first developer betas at its Worldwide Developers Conference.</p>\n\n<p>Although it's not as big a milestone as it has been in past years—developer betas are now available to <a href=\"https://arstechnica.com/gadgets/2023/06/how-to-install-ios-17-and-macos-14-developer-betas-now-that-anyone-can-do-it/\">anyone who signs up for a free Apple developer account</a>, and the builds released today are essentially identical to the third developer betas Apple released last week—the public beta period typically signals that Apple's newest OSes are approaching the level of stability and polish needed for a public release.</p>\n<p>To get the new iOS or macOS betas, first sign up for <a href=\"https://beta.apple.com/sp/betaprogram\">Apple's public beta software program with your Apple ID</a>. Then, on a compatible device, navigate to the Software Update page in the settings and opt into the beta of your choosing (there's also a separate beta track available for those continuing to test iOS 16 and macOS 13 updates). Per usual, you should make sure you have current backups before you upgrade, and don't install beta software on any devices you rely on daily since the only way to go back to non-beta software is <a href=\"https://support.apple.com/en-us/HT203282\">a full reset in recovery mode</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1953167#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1953167&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"164a788b171d2aaedd41c7a62144ad77a8a3f5a7cb6956190c174c43b8a47650","category":"Tech"}