{"title":"Real-World Case Series of Efgartigimod for Generalized Myasthenia Gravis：Well-Tailored Treatment Cycle Intervals Contribute to Sustained Symptom Control","link":"https://www.preprints.org/manuscript/202404.1145/v1","date":1713353676000,"content":"Introduction: Myasthenia gravis (MG), an immune disorder affecting nerve-muscle transmission, often necessitates tailored therapies to alleviative longitudinal symptom fluctuations. Here, we aimed to examine and compare the treatment cycle intervals and efficacy of efgartigimod in four patients. This case series mainly offers insights into personalized treatment cycle intervals and efficacy of efgartigimod for patients with MG in our facility in Japan. Methods: We retrospectively analyzed four patients with MG (2 patients with early-onset, 1 with late-onset, and 1 with seronegative MG, mainly managed with oral immunosuppressants as prior treatments) who completed four or more cycles of efgartigimod treatment from January 2022 to September 2023. We focused on changes in serum immunoglobulin (IgG) level, acetylcholine receptor antibody (AChR-Ab) titer, and quantitative MG (QMG) score. Results: Efgartigimod, administered at a median of 5.0 [IQR 5.0, 7.5] weeks between cycles, led to decreased serum IgG level in all patients and reduced AChR-Ab titers in seropositive patients. All patients showed sustained MG symptom improvement, with considerably reduced QMG scores before efgartigimod treatment. None of the patients required rescue medications or developed treatment-related adverse events. Conclusion: Customized efgartigimod administration intervals effectively enhanced clinical outcomes in patients with MG without notable symptom fluctuations, demonstrating the benefits of individualized treatment approaches and validating the safety of efgartigimod during the study period.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"16533d83314a7c569c9ce57cd2a81ddda940e22f9e064597b6113d35bc28be06","category":"Interdisciplinary"}