{"title":"Apple’s new contingent pricing may save you money on App Store subscriptions","link":"https://www.macworld.com/article/2175090/app-store-contingent-pricing-save-money-subscriptions.html","date":1702926438000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Let’s say you subscribe to a weather app called “Bright Sky.” The maker of Bright Sky publishes a new travel app called “Luggage” and it wants to offer a deal. “All Bright Sky subscribers can subscribe to Luggage for the discounted rate of $4.99 (regularly $6.99)!”</p>\n\n\n\n<p>That sort of thing hasn’t been possible with subscriptions through the App Store, but it soon will be. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/news/?id=6e9odqgu&amp;xcust=1-1-2175090-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple just announced a new Contingent Pricing feature</a> for App Store developers that allows them to charge a discounted subscription rate as long as the user already has another specific subscription from the same developer or a different one. Here’s Apple’s explanation of how it works:</p>\n\n\n\n<blockquote>\n<p>Contingent pricing can be used for subscriptions from one developer or two different developers. For example, you might offer Ocean Journal premium subscribers the opportunity to subscribe to Mountain Climber for a discounted price of $4.99/month instead of the regular $5.99/month. Customers pay the discounted price as long as they remain Ocean Journal subscribers.</p>\n\n\n\n<p>Customers can discover these pricing discounts within your app, in off-platform marketing channels, and in planned placements on the App Store. Apple helps you manage implementation, providing customers with a seamless redemption and purchasing experience based on the contingent price proposition you provide.</p>\n</blockquote>\n\n\n\n<p>The feature is expected to be available to developers in January, so it’s probably going to be part of <a href=\"https://www.macworld.com/article/2169796/ios-17-3-beta-features-release-stolen-device-protection.html\">iOS 17.3</a> (and other related OS updates). <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.wsj.com/business/media/apple-and-paramount-discuss-bundling-their-streaming-services-226972d1&amp;xcust=1-1-2175090-1-0-0&amp;sref=https://www.macworld.com/feed\">A recent story in the Wall Street Journal</a> said that Apple is in discussions to offer a bundle of Apple TV+ with Paramount+, which could be the reason for te change. One could imagine that this feature would be used for such a thing—instead of offering a new subscription to access both, the companies could offer a discount on Paramount+ for Apple TV+ subscribers or vice-versa.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1675a24f2160a4ee1016f03681eb1ce9fdc78972515820913b78afd9d8ec060f","category":"Apple"}