{"title":"Deep dive into stupid: Meet the growing group that rejects germ theory","link":"https://arstechnica.com/?p=1785588","date":1628338556000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/192639542_3898513270255119_2241166392498730490_n-800x451.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/192639542_3898513270255119_2241166392498730490_n.jpeg\">Enlarge</a> <span>/</span> This thriving Facebook group says viruses don't cause disease and the pandemic isn't real.  (credit: <a href=\"https://www.facebook.com/groups/germtheory.vs.terraintheory/learning_content\">Facebook</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Listen up, sheeple: COVID-19 doesn't exist. Viruses don't cause disease, and they aren't contagious. Those doctors and health experts who say otherwise don't know what they're talking about; the real experts are on Facebook. And they're saying it loud and clear: the pandemic is caused by your own deplorable life choices, like eating meat or pasta. Any \"COVID\" symptoms you might experience are actually the result of toxic lifestyle exposures—and you have only yourself to blame.</p>\n<p>As idiotic and abhorrent as all of the above is, it's not an exaggeration of the messages being spread by a growing group of Darwin Award finalists on the Internet—that is, germ theory denialists. Yes, you read that correctly: germ theory denialists—also known as people who don't believe that pathogenic viruses and bacteria can cause disease.</p>\n<p>As an extension of their rejection of basic scientific and clinical data collected over centuries, they deny the existence of the devastating pandemic that has sickened upwards of 200 million people worldwide, killing more than 4 million.</p></div><p><a href=\"https://arstechnica.com/?p=1785588#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1785588&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1677d878d2b5dcb5904494a1b5ad8b0911f2daf4e03cfe76acf4f8f8ee250e5a","category":"Tech"}