{"title":"An Overview of the Immune Response to COVID-19 Vaccination and Strategies to Boost SARS-CoV-2 Immunity in People with Inborn Errors of Immunity","link":"https://www.preprints.org/manuscript/202405.0661/v1","date":1715334122000,"content":"The ongoing SARS-CoV-2 pandemic has raised concerns surrounding immunological protection against the virus, particularly for people with inborn errors of immunity (IEI). While COVID-19 vaccination induces robust antibody, memory B-cell, and T-cell responses in healthy individuals, how well vaccination protects people with IEI against infection and severe disease remains unclear – especially in the context of new viral variants and vaccine formulations – leading to anxiety, ongoing self-isolation, and repeated vaccination with limited evidence of increased efficacy. Whilst most people with IEI generate some level of cellular and/or humoral immunity to COVID-19 vaccination, the level of protection and durability of the response are unclear. Alongside vaccination, antibody-based therapeutics are aimed at limiting infection and severe disease in this cohort. Immunoglobulin replacement therapy (IgRT) provides passive immunity in antibody-deficient individuals. However, to successfully prevent SARS-CoV-2 infection, a sufficient number of neutralizing antibodies must be present in product. While antibodies against circulating variants are eventually present in IgRT products (both from natural infection and vaccination of the donors), evidence of their capacity to recognize new variants is limited. Furthermore, while antibody-based pre- and post-exposure prophylaxis can be effective, they are susceptible to decreased efficacy in the context of variant evolution. This review provides an in-depth overview of current knowledge about COVID-19 vaccine efficacy in IEIs, the efficacy of SARS-CoV-2-specific antibody products, and knowledge and technological advances required for continued protection of people with IEI.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"167b7e1535a5d712d4e8c12b9fccf02d0394ee21e65646d08073e612409edddc","category":"Interdisciplinary"}