{"title":"Adaptation through Climate-Smart Agriculture: Socio-Economic Factors Influencing the Willingness to Adopt Climate-Smart Agriculture by Smallholder Maize Farmers in Limpopo Province","link":"https://www.preprints.org/manuscript/202403.1019/v1","date":1710754619000,"content":"Agriculture contributes towards South African economy, but this sector is highly vulnerable to risks imposed by climate change. Smallholder maize farmers are specifically susceptible to climate change impacts. Maize crop plays a crucial role in the country's food security as it is considered a stable food for households and source of feed for livestock. The study aimed to analyze the socio-economic factors influencing smallholder maize farmers’ willingness to adopt climate-smart agriculture. It was conducted in three different areas due to their specific agro-ecological zones. Multipurpose research design was used to gather data, and multistage random sampling to choose the study areas. Subsequently, 209 purposively selected farmers were interviewed face-to-face using structured questionnaires and focus discussion groups. Descriptive statistics and Double-hurdle regression model were used to analyze the data. Descriptive results indicated that 81%, 67%, and 63% farmers were willing to adopt CSA in Ga-Makanye, Gabaza, and Giyani, respectively. Empirical results from the first and second hurdles of the regression analysis showed that farmers’ education, crop diversification, information about CSA positively influenced the decision to adopt CSA while household size and agricultural experience negatively influenced the decision to adopt CSA. It is recommended that the Department of Agriculture, Land Reform, and Rural Development should provide CSA workshops and educational programs to farmers to enhance their knowledge and decision-making processes regarding adaptation strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"16820afb9929db9017db080a6fde575ce13e2488cc1ff8083fa2a36f57e6f1e8","category":"Interdisciplinary"}