{"title":"Immunogenicity and Safety of the Recombinant Adjuvanted Herpes Zoster Vaccine in Patients with Chronic Lymphocytic Leukemia and Multiple Myeloma","link":"https://www.preprints.org/manuscript/202409.1274/v1","date":1726536898000,"content":"Introduction: Patients with chronic lymphocytic leukemia (CLL) and multiple myeloma (MM) are susceptible to viral infections, including varicella-zoster virus (VZV) reactivation due to both disease-related and treatment-induced immunosuppression. The recombinant adjuvanted herpes zoster vaccine (RZV) has shown high efficacy in immunocompetent adults, but immunogenicity data in CLL and MM patients is limited. This study evaluates the immunogenicity and safety of RZV in this population. Methods: Patients with CLL and MM vaccinated with RZV (administered in two doses at least one month apart) were included in the study. Pre- and post-vaccination anti-VZV IgM and IgG antibody levels were measured to assess immunogenicity, and adverse events (AEs) were captured for safety evaluation. Results: Seventy-eight patients received both vaccine doses, and 71 had post-vaccination samples. Most of the patients were IgM seronegative and IgG seropositive before vaccination. Pre-vaccination IgG levels were higher in CLL compared to MM patients (p=0.001), while post-vaccination IgG levels significantly increased in both CLL (p&lt;0.0001) and MM (p&lt;0.0001) patients. In actively treated CLL patients, the pre-vaccination IgG levels were significantly lower than in not actively treated patients (p=0.002). Post-vaccination IgG levels were lower in MM patients receiving antiviral prophylaxis concurrently with the vaccination (p=0.013). AEs were reported in 49.4% after the first dose and 48.7% after the second dose, mostly mild (local or low-grade systemic). One case of immune thrombocytopenia was noted. Conclusion: RZV demonstrated strong immunogenicity and acceptable safety in CLL and MM patients, significantly boosting IgG levels, even in actively treated or heavily pretreated patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1688f620689fd2a538243919572a624b5079fefa3b52a25d88b44aa5adb0cccf","category":"Interdisciplinary"}