{"title":"Food consumption score and predictors among pregnant women attending antenatal care services in health centers of Addis Ababa, Ethiopia: Using ordinal logistic regression model","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306169","date":1719410400000,"content":"<p>by Jerusalem Ketema Belay, Solomon Mekonnen Abebe, Lemlem Daniel Baffa, Berhanu Mengistu</p>\r\nBackground <p>Poor maternal nutrition during pregnancy creates a stressful environment that can lead to long-term effects on tissue development. Understanding the food consumption score can be used to prevent problems associated with poor dietary intake of pregnant mothers. In Ethiopia, the food consumption score ranges from 54% to 81.5%, which is far below the World Food Program (WFP) recommendation. Thus, this study aimed to assess food consumption score and associated factors among pregnant women attending antenatal care services in health centers of Addis Ababa, Ethiopia.</p> Methods <p>This study has used institution based cross sectional study. Overall, 999 pregnant women were selected for this study. A multistage sampling technique followed by systematic random sampling was used to include pregnant women coming for antenatal care services in the selected health centers of Addis Ababa from June 07 to July 08, 2022. We used interviewer administered questionnaire using the Kobo toolbox. Food consumption score (FCS) was assessed after collecting data on frequency of eight food groups consumed over the previous seven days, which were weighted according to their relative nutritional value. STATA 14 was used to analyse the data. Ordinal logistic regression was used to identify independent predictors of food consumption score. Those variables having p value &lt; 0.25 in the bivariable ordinal logistic regression were considered for the final model. Crude and Adjusted Odds Ratio were used to assess the strength of the association. In the final model, p value &lt; 0.05 at 95% confidence interval was used to declare statistical significance.</p> Result <p>From the total of 949 pregnant women a little over half (51.20% (95%CI: 48.00%-54.40%) had acceptable food consumption score, while just over two fifth (42.60% (95% CI: 39.40%-45.70%)) and a small proportion (6.2% (95%CI: 4.84%-7.94%)) of the study participants had borderline and poor food consumption score, respectively. No meal skip (AOR = 1.37, 95% CI:1.03–1.81), able to read and write (AOR = 3.99, 95% CI: 1.33–11.96), poorest wealth status (AOR = 0.52, 95% CI: 0.34–0.78), positive attitude towards consumption of a diversified diet (AOR = 1.52,95% CI: 1.17–1.98) were independent predictors of acceptable food consumption score.</p> Conclusion <p>In this study, considerably low level of acceptable food consumption score among the study participants was observed. Besides, not skipping meal, having better educational status, wealth status and attitude towards consumption of a diversified diet were associated with acceptable food consumption score. Therefore, nutritional education considering important dietary modifications should be intensified targeting vulnerable groups.</p>","author":"Jerusalem Ketema Belay","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"169186f80c07cc34729f4e4a9e0b40c63982e378ccce713d4b3edcf787677759","category":"Interdisciplinary"}