{"title":"‘How the iMac Saved Apple’","link":"https://www.theverge.com/23830432/imac-twenty-five-years-ago-saved-apple","date":1692914830000,"content":"\n<p>Jason Snell, writing at The Verge last week, marking the iMac’s 25th anniversary:</p>\n\n<blockquote>\n  <p>Upon its release, the iMac became so well known that it may have\neven eclipsed the Apple brand for a little while. It was at least\na strong enough signifier that Apple began using it on other\nproducts. The iBook laptop was an obvious choice, but in 2001,\nthe company chose to reuse the branding for its new music player,\nthe iPod.</p>\n\n<p>The iPod didn’t connect to the internet, but it didn’t matter.\nApple was declaring that the “i” stood for another cool Apple\nproduct you’d want to buy, and people bought an awful lot of\niPods. Apple began slapping the lowercase “i” in front of a lot of\nits hardware, software, and services, culminating in the release\nof the iPhone and iPad.</p>\n</blockquote>\n\n<p>A keen remembrance of a seminal product. Snell rightly emphasizes how controversial some of the iMac’s features were: the lack of a floppy disk drive and dropping all legacy I/O ports in favor of USB. The branding power of that “i” prefix remains so strong that I still hear people calling Apple Watches “iWatches”.</p>\n\n<p>It hindsight it seems obvious that Jobs and Ive would go on to create not just numerous great new products, but to do so in new (or at least new to Apple) product categories. But they had to start somewhere. The easiest way for Apple to have failed upon Jobs’s return would have been to shoot for the moon out of the gate. The next big things would come. First, they rightly decided to focus on righting the ship that was Apple’s <em>previous</em> big thing: a desktop personal computer. Everything the company has designed, built, and shipped since can be traced back to that Bondi Blue surprise.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/24/how-the-imac-saved-apple\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"16a660c5346ce3f5c12c5ffc0d651ebd6a3cc4b225a670a2981027514152e570","category":"Tech"}