{"title":"UK Probe Into Apple's Mobile Browser Restrictions Shut Down After Apple Argues Regulators Waited Too Long to Open Investigation","link":"https://www.macrumors.com/2023/03/31/uk-apple-browser-probe-shut-down/","date":1680293040000,"content":"The UK's Competition and Market Authority (CMA) will not be looking into Apple's policies on mobile browsers and cloud gaming services after Apple won an appeal that will force the UK regulators drop the investigation, reports <em><a href=\"https://www.reuters.com/technology/apple-wins-appeal-against-uks-decision-investigate-its-mobile-browser-2023-03-31/\">Reuters</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/06/app-store-blue-banner-uk-fixed.jpg\" alt width=\"1794\" height=\"1009\" />\r<br />\nThe CMA in November <a href=\"https://www.macrumors.com/2022/11/22/uk-cma-market-probe-apple-google/\">launched an investigation</a> into the cloud gaming and mobile browser restrictions put in place by both Apple and Google, suggesting that the two companies were holding back innovation and increasing costs for web developers, cloud gaming service providers, and browser vendors.\r<br />\n\r<br />\n\"Many UK businesses and web developers tell us they feel that they are being held back by restrictions set by Apple and Google,\" said Sarah Cardell, interim chief executive of the CMA, at the time. The investigation was part of a <a href=\"https://www.macrumors.com/2021/06/15/apple-and-google-duopoly-scrutiny-uk/\">larger examination</a> of the \"duopoly\" of Apple and Google on mobile ecosystems that launched in 2021.\r<br />\n\r<br />\nApple in January <a href=\"https://www.macrumors.com/2023/01/22/apple-appeals-uk-platform-investigation/\">filed an appeal</a> with the UK's Competition Appeal Tribunal (CAT) pointing out the CMA had missed key timing requirements, and thus should not be able to continue the investigation. The CMA was supposed to end its inquiry within 18 months, and there were deadlines that needed to be adhered to, but Apple said that the proper timeline wasn't followed.\r<br />\n\r<br />\nThe Appeal Tribunal agreed with Apple, and said that the CMA should have launched the market investigation at the same time that it published the duopoly report in June 2021. By not doing so, it \"erred in law.\"\r<br />\n\r<br />\nIf the CMA had continued with its investigation, it would have been be able to ask Apple for in-depth information on its browser and cloud gaming practices, and ultimately could have forced Apple to change the way that it operates.\r<br />\n\r<br />\nThe CMA says that it is disappointed in the ruling and is considering an appeal.<div>Tags: <a href=\"https://www.macrumors.com/guide/safari/\">Safari</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">Apple Antitrust</a>, <a href=\"https://www.macrumors.com/guide/united-kingdom/\">United Kingdom</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/31/uk-apple-browser-probe-shut-down/\">UK Probe Into Apple's Mobile Browser Restrictions Shut Down After Apple Argues Regulators Waited Too Long to Open Investigation</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/uk-probe-into-apples-mobile-browser-restrictions-shut-down-after-apple-argues-regulators-waited-too-long-to-open-investigation.2385508/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"16b7104129e238890804f1b66c461d599ddb34eb0fa57f7d70ee4bf16ccb752b","category":"Apple"}