{"title":"Developmental PFOS exposure alters lung inflammation and barrier integrity in juvenile mice","link":"https://academic.oup.com/toxsci/article/201/1/48/7687069?rss=1","date":1717372800000,"content":"<span><div>Abstract</div>Emerging epidemiological evidence indicates perfluorooctane sulfonic acid (PFOS) is increasingly associated with asthma and respiratory viral infections. Animal studies suggest PFOS disrupts lung development and immuno-inflammatory responses, but little is known about the potential consequences on respiratory health and disease risk. Importantly, PFOS exposure during the critical stages of lung development may increase disease risk later in life. Thus, we hypothesized that developmental PFOS exposure will affect lung inflammation and alveolar/airway development in a sex-dependent manner. To address this knowledge gap, timed pregnant Balb/cJ dams were orally dosed with a PFOS (1.0 or 2.0 mg/kg/d) injected mealworm or a vehicle control daily from gestational day (GD) 0.5 to postnatal day (PND) 21, and offspring were sacrificed at PND 22-23. PFOS-exposed male offspring displayed increased alveolar septa thickness. Occludin was also downregulated in the lungs after PFOS exposure in mice, indicative of barrier dysfunction. BALF macrophages were significantly elevated at 2.0 mg/kg/d PFOS in both sexes compared with vehicles, whereas BALF cytokines (TNF-α, IL-6, KC, MIP-1α, MIP-1β, and MCP-1) were suppressed in PFOS-exposed male offspring compared with vehicle controls. Multiplex nucleic acid hybridization assay showed male-specific downregulation of cytokine gene expression in PFOS-exposed mice compared with vehicle mice. Overall, these results demonstrate PFOS exposure exhibits male-specific adverse effects on lung development and inflammation in juvenile offspring, possibly predisposing them to later-in-life respiratory disease. Further research is required to elucidate the mechanisms underlying the sex-differentiated pulmonary toxicity of PFOS.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"16b97558d1fc354cbd7225b2d3be8ff43f36a02d01888c0ba7710e59bdbc86a3","category":"Environment"}