{"title":"How to share a Wi-Fi connection on one Mac over ethernet to another","link":"https://www.macworld.com/article/352173/how-to-share-a-wi-fi-connection-on-one-mac-over-ethernet-to-another.html","date":1627981200000,"content":"<div>\n<section><div></div></section><p>Apple added an Internet Sharing option in the Sharing system preference many years ago. This feature lets you share one Mac’s incoming internet connection via other network interfaces on that Mac. At one point, this was a popular way to create what was once called a “software base station” and now is more generally called a “personal hotspot.”</p>\n\n\n\n<p>But it’s also a great way to bridge your network if you have an older Mac with either broken, missing, failing, or weak Wi-Fi. As Apple has matured its line-up of computers, it has also upgraded the flavors of Wi-Fi supported. Macs older than five or so years include slower, older versions of Wi-Fi and network cards that have weaker signal transmission and reception as well as radios with less tolerance in sorting out overlapping signals.</p>\n\n\n\n<p>Ethernet and Internet Sharing offers one way to fix that if you have an easy enough way to connect two desktop Macs with ethernet ports. (You can connect laptops, too, but then this solution works only when the sharing Mac is present.) If either Mac lacks ethernet, you can add it through a USB-C or Thunderbolt 3 dock for newer Macs or a USB adapter or Thunderbolt 2 adapter or dock for older Macs.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/mac911-internet-sharing-setup.png?w=1200\" /><figcaption>Set up Internet Sharing so that one Mac relays Wi-Fi–based Internet access to another via Ethernet.</figcaption></figure></div>\n\n\n\n<div><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/mac911-internet-sharing-warning-1.png?w=522\" /><figcaption>The warning alerts you to the potential of disrupting your network.</figcaption></figure></div></div>\n\n\n\n<ol><li>Connect the two Macs via an ethernet cable. This can be a direct connection or through ethernet ports on powerline networking adapters, which use home electrical wiring for connectivity. (See “Add a wired base station” in “<a href=\"https://www.macworld.com/article/349645/how-to-use-your-macs-wi-fi-menu-to-sort-out-weak-areas-of-wi-fi-coverage.html\">How to use your Mac’s Wi-Fi menu to sort out weak areas of Wi-Fi coverage.</a>”)</li><li>Open the <em>Sharing</em> preference pane and select <em>Internet Sharing</em> in the left-hand <em>Service</em> list.</li><li>From the “Share your connection from” menu, select <em>Wi-Fi</em>.</li><li>From the “To computers using” list, check the box next to your ethernet adapter. (You may see more than one listed depending on the interfaces on your computer.)</li><li>Check the <em>Internet Sharing</em> box to start sharing.</li><li>Apple warns you about the potential of network nonsense. Click <em>Start</em>.</li></ol><p>This sharing system generates an IP address for the Mac with which its connection is shared, and manages relaying data to and from the internet for that other Mac. It also allows a direct full ethernet speed connection between the two Macs connected in this fashion.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Julian.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"16bdf10891ac0a724917a3bf20b2cc9a11dad0c7dbe521a22c9976ff257a36d3","category":"Apple"}