{"title":"Experimental and Numerical Analysis of the Impact of Corrosion on Pipeline Failure Pressure","link":"https://www.preprints.org/manuscript/202409.0837/v1","date":1726050964000,"content":"This paper employs the Finite Element Method (FEM) to simulate and analyze the effects of corrosion defect parameters on the stress and failure pressure of pipelines. It investigates how the boundary conditions of the pipeline model influence stress and examines the sensitivity of failure pressure to corrosion defect parameters. A nonlinear regression equation has been developed from a dataset obtained through simulation experiments to predict the failure pressure of corroded pipelines. To validate the effects of corrosion defect parameters on failure pressure, a hydrostatic test platform for an API 5L X65 pipeline with corrosion defects was established to measure stress levels and failure pressures across varying corrosion defects. The study reveals that failure pressure is negatively correlated with corrosion length and depth, while positively correlated with corrosion width. Among these parameters, corrosion depth exerts a more significant influence on the pipeline's failure pressure than corrosion length and width. Within the range of corrosion defect parameters examined, the maximum deviation of the prediction equation's results from the simulation results is 8.71%, with an average deviation of 5.81%. The standard deviation of the fitted residuals is 0.01837. Additionally, the maximum deviation between the predicted results and experimental measurements is 8.39%, with an average deviation of 7.77%. The strong agreement between the predicted results from the equation and the actual measured data underscores the effectiveness of the nonlinear regression equation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"16d34602fac10b677dd33cc4e89a5d49411885036709ef603be599cc9f917c06","category":"Interdisciplinary"}