{"title":"’Seeing is Believing’: How Neutron Crystallography Informs Enzyme Mechanism by Visualizing Unique Water Species","link":"https://www.preprints.org/manuscript/202409.1424/v1","date":1726666129000,"content":"Hydrogen is the lightest atom and composes roughly half of the atomic content in macromolecules, yet their location can only be inferred or predicted in most macromolecular structures. This is because hydrogen can rarely be directly observed by the most common structure determination techniques (such as X-ray crystallography and electron cryo-microscopy). However, knowledge of hydrogen atom positions, especially for enzymes, can reveal protonation states of titratable active site residues, hydrogen bonding patterns, and the orientation of water molecules. Though we know they are present, this vital layer of information, which can inform a myriad of biological processes, is frustratingly invisible to us. The good news is that, even at modest resolution, neutron crystallography (NC) can reveal this layer and has emerged this century as a powerful tool for elucidating enzyme catalytic mechanisms. Due to its strong and coherent scattering of neutrons, incorporation of deuterium into the protein crystal amplifies the power of NC. This is especially true when solvation and the specific participation of key water molecules are crucial for catalysis. Neutron data allow the modeling of all three atoms in water molecules and have even revealed previously unobserved and unique species such as hydronium (D3O+) and deuteroxide (OD-) ions as well as lone deuterons (D+). Herein, we briefly review why neutrons are ideal probes for identifying catalytically important water molecules and these unique water-like species, limitations in interpretation, and four vignettes of enzyme success stories from disparate research groups. One of these groups was that of Dr. Chris G. Dealwis, who died unexpectedly in 2022. As a memorial appreciation of his scientific career, we will also highlight his interest and contributions to the neutron crystallography field. As both the authors were mentored by Chris, we feel we have a unique perspective on his love of molecular structure and admiration for neutrons as a tool to query those structures.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"16d66618a4d1368fc8a2f4bf3f12dcb9136bd87abd8632667d3d4a7249776309","category":"Interdisciplinary"}