{"title":"Apps Continuing to Track Users Despite Apple's Privacy Prompt","link":"https://www.macrumors.com/2021/06/07/apps-continuing-to-track-users/","date":1623078245000,"content":"Apple is facing increasing pressure to tighten its <a href=\"https://www.macrumors.com/how-to/block-apps-from-tracking-idfa/\">App Tracking Transparency</a> rules after it was found that third parties are using workarounds to identify users who do not consent to be tracked, according to the <a href=\"https://www.ft.com/content/9cb52394-f95f-4b07-a624-89c47439aa16\"><em>Financial Times</em></a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/generic-tracking-prompt-blue.jpg\" />\r\n<br />\r\nApple rules around App Tracking Transparency, which <a href=\"https://www.macrumors.com/2021/04/01/apple-rejecting-app-updates-tracking-transparency/\">came into effect</a> as part of iOS 14.5 and iPadOS 14.5, require apps to ask for consent to track users across websites and apps so that they can be targeted with advertising.\r\n<br />\r\n\r\n<br />\r\nAccording to Eric Seufert, a marketing strategy consultant, many apps are using workaround methods to identify users who do not consent to being tracked, meaning that the amount of data being collected from many users is de facto unchanged.\r\n<br />\r\n\r\n<br />\r\n<blockquote>\"Anyone opting out of tracking right now is basically having the same level of data collected as they were before. Apple hasn't actually deterred the behavior that they have called out as being so reprehensible, so they are kind of complicit in it happening,\" Seufert explained. </blockquote>\r\n<br />\r\n\r\n<br />\r\nAccording to an email seen by the <em>Financial Times</em>, one app vendor told its clients that it had managed to continue collecting data on over 95 percent of its iOS users, using device and network information such as IP addresses to determine user identities. This secretive technique, known as \"fingerprinting,\" is banned by Apple, which insists that developers \"may not derive data from a device for the purpose of uniquely identifying it.\"\r\n<br />\r\n\r\n<br />\r\nSome adtech groups, used by thousands of developers, believe that looser \"probabilistic\" methods of user identification, which group users by behavior, are allowed under Apple's rules, since they rely on temporary, aggregated data rather than creating unique or permanent device IDs.\r\n<br />\r\n\r\n<br />\r\nThe situation regarding workarounds and Apple's lack of enforcement has created confusion around what Apple's rules actually allow. Apple told the <em>Financial Times</em>:\r\n<br />\r\n\r\n<br />\r\n<blockquote>We believe strongly that users should be asked for their permission before being tracked. Apps that are found to disregard the user's choice will be rejected.</blockquote>\r\n<br />\r\n\r\n<br />\r\nApple declined to comment about whether it makes a distinction between fingerprinting and \"probabilistic matching\" under its rules.\r\n<br />\r\n\r\n<br />\r\nSome industry observers think that the problem is severe enough that Apple is at risk of legal issues. Alex Austin, chief executive of Branch, a mobile marketing platform, said \"It's becoming clear that <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a> was much more a marketing promotion than an actual privacy initiative, sadly.\"\r\n<br />\r\n\r\n<br />\r\nApple has suggested that third parties' ability to track users is blocked when users ask them to stop, but if this is not the case, Apple may be subject to litigation over marketing rhetoric and reality. Founder of the Yale Privacy Lab, Sean O'Brien, accused Apple of being \"extremely disingenuous\" in lauding its privacy measures without adequately enforcing them.\r\n<br />\r\n\r\n<br />\r\n<blockquote>Apple may find this out the hard way, as Google has in the past, if the company is hit with lawsuits for misleading customers in regard to privacy. Just as it was discovered that Google's location history was never actually turned off in 2018, I think we will find that Apple still allows apps to peer into the windows of consumers' lives.</blockquote>\r\n<br />\r\n\r\n<br />\r\nO'Brien highlighted a comparison with Google, which faced a number of lawsuits after it was discovered that it had been tracking the locations of its users even after they expressly told it not to.\r\n<br />\r\n\r\n<br />\r\nSeufert believes that Apple is likely to provide clarity on the issue soon, which could coincide with its <a href=\"https://www.macrumors.com/roundup/wwdc/\">Worldwide Developers Conference</a>, leading to a potential wave of app rejections during the review process later this month for those developers that use surreptitiously tracking techniques.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/ft-com/\">ft.com</a>, <a href=\"https://www.macrumors.com/guide/app-tracking-transparency/\">App Tracking Transparency</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/07/apps-continuing-to-track-users/\">Apps Continuing to Track Users Despite Apple's Privacy Prompt</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apps-continuing-to-track-users-despite-apples-privacy-prompt.2299521/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=hbsbYLnYqeI:gKxA6j9auYE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=hbsbYLnYqeI:gKxA6j9auYE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/hbsbYLnYqeI\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"16e706589923dc7d54f1bcd991c4e46778a153673e6d35c8236f029fabb33c71","category":"Apple"}