{"title":"Localized Crop Classification by NDVI Time Series Analysis of Remote Sensing Satellite Data; Applications for Mechanization Strategy and Integrated Resources Management","link":"https://www.preprints.org/manuscript/202407.1467/v1","date":1721294904000,"content":"In data-scarce regions, prudent planning and precise decision-making for sustainable development especially in agriculture remains a challenging task due to the lack of correct information. Remotely sensed satellite images provide a powerful source for assessing land use land cover (LULC) classes and crop identification. Applying Remote Sensing (RS) in conjunction with the Geographical Information System (GIS) and modern tools/ algorithms of artificial intelligence (AI) and deep learning has been proven effective for strategic planning and integrated resources management. The (this)study was conducted in the canal command area of the Lower Chenab Canal system in Punjab, Pakistan. Crop features/ classes were assessed using the Normalized Difference Vegetation Index (NDVI) algorithm. The MODIS (Moderate Resolution Imaging Spectroradiometer) 250 m and Landsat 5 TM (thematic mapper) images were deployed for NDVI time-series analysis with unsupervised classification technique to get LULC classes that helped to discern cropping pattern, crop rotation, and the area of specific crops, which were then used as a key input for agricultural mechanization planning and resources management. The accuracy of the LULC map was 78%, assessed by the error matrix approach. Limitations of high-resolution RS data availability and the accuracy of the results are the concerns observed in this study that could be managed by the availability of good quality local sources and advanced techniques of processing, which will make it more useful and applicable for regional agriculture and environmental management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"16efa31bbb9501b247b36d5b1069f92d2add23b6e66788fa73ad16a52b6ee849","category":"Interdisciplinary"}