{"title":"Ascorbate peroxidase in fruits and modulation of its activity by reactive species","link":"https://academic.oup.com/jxb/article/75/9/2716/7619389?rss=1","date":1709596800000,"content":"<span><div>Abstract</div>Ascorbate peroxidase (APX) is one of the enzymes of the ascorbate–glutathione cycle and is the key enzyme that breaks down H<sub>2</sub>O<sub>2</sub> with the aid of ascorbate as an electron source. APX is present in all photosynthetic eukaryotes from algae to higher plants and, at the cellular level, it is localized in all subcellular compartments where H<sub>2</sub>O<sub>2</sub> is generated, including the apoplast, cytosol, plastids, mitochondria, and peroxisomes, either in soluble form or attached to the organelle membranes. APX activity can be modulated by various post-translational modifications including tyrosine nitration, <span>S</span>-nitrosation, persulfidation, and <span>S</span>-sulfenylation. This allows the connection of H<sub>2</sub>O<sub>2</sub> metabolism with other relevant signaling molecules such as NO and H<sub>2</sub>S, thus building a complex coordination system. In both climacteric and non-climacteric fruits, APX plays a key role during the ripening process and during post-harvest, since it participates in the regulation of both H<sub>2</sub>O<sub>2</sub> and ascorbate levels affecting fruit quality. Currently, the exogenous application of molecules such as NO, H<sub>2</sub>S, H<sub>2</sub>O<sub>2</sub>, and, more recently, melatonin is seen as a new alternative to maintain and extend the shelf life and quality of fruits because they can modulate APX activity as well as other antioxidant systems. Therefore, these molecules are being considered as new biotechnological tools to improve crop quality in the horticultural industry.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"16f4106fdbf8923c2961540d1948ada90c8bce99e6c633daa263c1406c449f6b","category":"Environment"}