{"title":"The effect of terroir on volatilome fingerprinting and qualitative attributes of non‐irrigated grapes reveals differences on glycosylated aroma compounds","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13849?af=R","date":1725606340000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>‘Xynisteri’ is considered as the reference white grape cultivar in Cyprus with remarkable adaptation to adverse edaphoclimatic conditions and appreciable oenological properties that renders it as an appropriate cultivar for studies within a global context due to climate change. To this aim, two distinct non-irrigated plots with different climatic conditions, soil properties and levels of rainfall were selected; Koilani [KO, altitude 800 m, 76% calcium carbonate (CaCO<sub>3</sub>) content, pH 7.97, average temperature: 16.5 °C, rainfall: 229 mm] and Kyperounda (KY, altitude 1200 m, CaCO<sub>3</sub>-free soil, pH 6.47, average temperature: 14.9 °C, rainfall: 658 mm). An array of physiological, biochemical and qualitative indices during successive developmental stages (BBCH 75–89) were determined. During the advanced on-vine developmental stages (BBCH 85–89), the aromatic profile of grapes was assessed with the employment of gas chromatography–mass spectrometry (GC–MS). Such analysis was complemented with non-destructive chemometric analyses.</p>\n<h2>RESULTS</h2>\n<p>Berry ripening process substantially differed on the examined plots; BBCH 89 stage reached at 267 and 303 Julian days for KO and KY, respectively. Results indicated that berry weight, soluble solids content (SSC) and α-amino nitrogen were higher in KO than in KY, with exception made for ammonium nitrogen content. A total of 75 compounds, including aliphatic alcohols, benzenic compounds, phenols, vanillins, monoterpenes and C13-norisoprenoids were identified and quantified. The variations of mesoclimatic conditions affected the volatile organic compound (VOC) profiles at the fully-ripe stage, showing a considerable rise in glycosylated aroma compounds, especially monoterpenes and benzenic compounds. In particular, the higher amount of glycosylated aroma compounds were obtained in KY berries up to mid-ripe, whereas KO showed higher glycosylated aroma compounds at fully-ripe stage. Results reported herein indicate that aroma profile of ‘Xynisteri’ grapes varied substantially in the examined terroirs. Interestingly, the limited rainfall in KΟ non-irrigated vine did not compromise qualitative and aromatic properties of berries.</p>\n<h2>CONCLUSIONS</h2>\n<p>The present study aimed at dissecting the impact of terroir on bush-trained, non-irrigated grapevines of a cultivar appropriate for extreme climate change scenarios. The volatilome fingerprint was highly variable among the examined plots; such results can be further exploited at vinification level towards production of single vineyard premium end products. © 2024 The Author(s). <i>Journal of the Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Egli C. Georgiadou, \nMinas Mina, \nNicolas Valanides, \nAnna‐Maria Taliadοrou, \nStefanos Koundouras, \nClaudio D'Onofrio, \nAndrea Bellincontro, \nFabio Mencarelli, \nNikolaos Barbayiannis, \nVasileios Fotopoulos, \nGeorge A. Manganaris","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"16f94fcc8afb741d6de5a442b897c57b0a7191f83db239a80aa13c6ea66ab188","category":"Environment"}