{"title":"From Europe to Caucasus: cryptic diversity and unexpected biogeographic history of a Western Palaearctic moss-inhabiting flea beetle (Chrysomelidae: Mniophila)","link":"https://academic.oup.com/zoolinnean/article/doi/10.1093/zoolinnean/zlae084/7736729?rss=1","date":1724112000000,"content":"<span><div>Abstract</div>The turbulent Tertiary and Quaternary history of Europe and the Ponto-Caucasus has had a strong impact on its biota, resulting in unusual patterns of speciation, diversification, and dispersal. Our study reveals the Late-Tertiary diversification and biogeographic history of <span>Mniophila</span>, a Western Palaearctic endemic moss-inhabiting flightless flea beetle distributed across Europe and the Ponto-Caucasus. We assembled samples across the whole range of the genus except Crimea. Based on a molecular phylogenetic analysis, we found that the diversification of <span>Mniophila</span> started in the Balkan Peninsula, and was followed by at least two independent colonizations of other parts of Europe. The Ponto-Caucasian species are all descendants of a single colonization from the Balkans, followed by species’ radiation. The <span>Mniophila</span> beetles are, therefore, one of the first-known cases of the colonization of the Caucasus from Europe. We integrated our DNA data with morphology, allowing us to uncover the cryptic diversity of <span>Mniophila</span> and to revise its European species. We describe <span>Mniophila haveli</span> sp. nov. from the Carpathians and Balkans, <span>M. wroblewskii</span><a href=\"#CIT0081\">Wańkowicz, 1880</a> from Central Europe and the Balkans is restored as a valid species, and <span>M. bosnica</span> Apfelbeck, 1914 is newly recognized as a Dinaric endemic. We reveal an exceedingly large distribution range for <span>M. muscorum</span> (Koch, 1803), which is unusual for a flightless beetle.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"16fb186fef7534233958645d5bcfb4d43ea31aad48a07abe1c60d40fb76942ca","category":"Environment"}