{"title":"Climate and ecosystem type affect the correlated evolution of body size and trophic position in fishes","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13891?af=R","date":1720417252000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>The relationship between body size and trophic position (BS–TP) typically exhibits a positive correlation in aquatic foodwebs, but the strength of this relationship is contingent on ecosystem type and climate. Different hypotheses have been proposed to elucidate climate and ecosystem type effects on the BS–TP relationship for ray-finned fish. However, our understanding of whether such a relationship evolved in a correlated fashion, spanning various climates and ecosystem types, remains limited.</p>\n<h2>Location</h2>\n<p>Temperate and tropical marine and freshwater ecosystems.</p>\n<h2>Time Period</h2>\n<p>Present to millions of years ago.</p>\n<h2>Major Taxa Studied</h2>\n<p>Ray-finned fish.</p>\n<h2>Methods</h2>\n<p>We used a phylogenetic tree and TP and BS data of more than a thousand freshwater and marine ray-finned fishes, from distinct climates and ecosystems, to investigate patterns on macroevolutionary time scales of the evolutionary correlation of BS and TP. As part of our investigation, we also ran analyses excluding herbivores and detritivores from the dataset, then further focusing solely on carnivores.</p>\n<h2>Results</h2>\n<p>We found distinct patterns of the BS–TP evolutionary correlation for different climates and ecosystems. The evolutionary correlation between BS and TP was significant for all ecosystem type–climate combinations, except for tropical freshwater ecosystems. The results remained consistent even after accounting for phylogenetic uncertainty and when excluding herbivores and detritivores from the analysis.</p>\n<h2>Main Conclusions</h2>\n<p>We found a weaker evolutionary correlation between BS and TP in tropical freshwater ecosystems. These findings are consistent with the stronger BS–TP relationship between extant taxa in temperate climates compared to the tropics, illustrating how evolutionary dynamics might have influenced the trophic structure of fish and contributed to shaping macroecological patterns of the BS–TP relationship. Our findings suggest that limitations that hinder evolutionary integration between BS and TP might be primarily attributed to energetic constraints imposed by temperature and the availability of C-rich food resources at the base of the foodweb.</p>","author":"Guilherme Dalponti, \nAdriano Caliman, \nJosef C. Uyeda, \nRafael D. Guariento","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"16fbc3c0f9c291b0fce84b6d80c651392561a7d5de4586cae7c63755f066baf4","category":"Environment"}