{"title":"Comparison of the Effectiveness of Body Surface Area Estimation Formulas in Predicting the Risk of Death in Patients with Heart Failure","link":"https://www.preprints.org/manuscript/202410.0678/v1","date":1728462921000,"content":"Background/Objectives: Body surface area is one of the most important anthropometric parameters in medicine. The study's primary objective is to compare the consistency of the BSA estimation results through applying available formulas. Other objectives include determining the ability of these formulas to discriminate between the deaths and living patients, comparing the formulas’ diagnostic features as well as investigating whether the risk associated with a low BSA is independent of BMI. Methods: The study included 1029 patients (median age: 54 years, female: 13.7%, NYHA I/II/III/IV:  6.3% / 36.5% / 47.7% / 9.5%) diagnosed with heart failure. For each patient, BSA was calculated using the 25 formulas. Over the 3-year observation period, 31.2% of the patients died. Results: The average BSA value of the optimal discrimination thresholds was 1.79 m2 ± 0.084 m2 and the BSA difference between the estimators with the lowest (BSAMeeh1879) and the highest (BSANwoye1989) optimal discrimination thresholds was 0.42 m2. The lowest mortality rate was 35.2% and occurred in the subgroup of individuals with BSA values below the optimal discrimination threshold using the BSASchlich2010 estimator. The highest mortality was observed when estimators BSAMeeh1879 or BSALivingston&amp;Lee2001 were used. Conclusions: Our study has shown a relatively good concordance of 25 BSA estimators in BSA assessment in patients, without extremes of weight or height known to disrupt it. All BSA estimators presented a significant, although weak, ability to discriminate death from alive in 3-year follow-up. The higher risk of death in smaller patients as shown by BSA was independent of BMI in all but 2 BSA estimators.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"16fe71025ee005ab44828d39b2ca2f4b5799b95dfe0ce033cde5d9518a6008bd","category":"Interdisciplinary"}