{"title":"Predator exclosures increase nest success but reduce adult survival and increase dispersal distance of Piping Plovers, indicating exclosures should be used with caution","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duad047/7267554?rss=1","date":1694390400000,"content":"<span><div>Abstract</div>Diagnosing unsuccessful population outcomes for endangered species requires understanding relationships among vital rates, ecological conditions, and management variables, including unintended consequences of management actions. The federally threatened Piping Plover (<span>Charadrius melodus</span>) has remained below recovery goals, despite intensive management, including the use of nest exclosures to protect eggs from predation. We studied ecological factors and management actions affecting nest success, survival, site fidelity, and dispersal of the New Jersey, USA population of Piping Plovers over a 7-yr period, focused on evaluating the impact of exclosures on demography. While exclosures increased nest success by 62% over a 34-day period, exclosed nests were 4.7 times more likely to be abandoned, which was likely a consequence of adult mortality. Abandoned nests were associated with lower adult survival, particularly for males, but there was evidence that site fidelity was greater for birds whose last nest was exclosed vs. unexclosed. Regardless of exclosure status, females who abandoned their first nesting attempt dispersed 10 times farther between attempts than those whose first nest attempts were lost to other causes. Moreover, females that abandoned their last nesting attempts dispersed farther than females that lost their last nest to predation or flooding. This difference was more substantial for males. Our results corroborate studies documenting adverse impacts of exclosures on survival, and, for the first time, demonstrate that surviving mates (particularly females) emigrate from the breeding site, resulting in a realized loss of a local breeding pair. Further, we used an online population project model (i.e., PiperEx) to demonstrate that exclosures are not expected to improve growth rates in New Jersey. We conclude that there is a trade-off among increased nest survival, reduced adult survival and increased emigration rates, and we encourage managers to consider whether exclosures are worth the protection of eggs from predators using online decision support tools.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"16fe875b9c9fc8235f29ac347b69cb991528c514f0bbe74565fe84fc79877ae8","category":"Environment"}