{"title":"You might have to pay extra to make the Vision Pro headset comfortable","link":"https://www.macworld.com/article/1969195/apple-vision-pro-headset-strap-accessory-extra-charge.html","date":1687869487000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s Vision Pro headset, unveiled at WWDC earlier this month, is only the first step on the company’s journey into the mixed-reality market, and it clearly isn’t perfect. It’s understood that Cupertino’s design team recommended that the project be pushed back until the available technology caught up with the sort of product they wanted to make, but CEO Tim Cook <a href=\"https://www.macworld.com/article/1655723/ar-vr-headset-2023-launch-design-team-tim-cook.html\">overruled them</a> and insisted on announcing something this year. Real artists ship, after all.</p>\n\n\n\n<p>One of Vision Pro’s obvious physical limitations at this stage of evolution is its relatively high weight, which some early testers have suggested is likely to make it uncomfortable when worn for long sessions. But Apple is aware of this issue, and working to solve it. Indeed, when my colleague Roman was able to spend an hour going <a href=\"https://www.macworld.com/article/1944516/apple-vision-pro-hands-on-feaures-design-fit.html\">hands-on with the device</a>, he was equipped with an additional strap over the top of the headset, which appears to have at least partially mitigated the weight problem over that admittedly quite short period.</p>\n\n\n\n<p>“In my demo,” he writes, “the headset had a Velcro strap that goes across the top of your head–this strap is not shown in Apple’s product photos or videos. I think that after the measurements were taken of my head, Apple determined that I would benefit from this top strap.</p>\n\n\n\n<p>“After about an hour, my demo was done and I took off the headset. I didn’t have any fatigue in my neck or feel any tenderness where the headset and straps hugged my head. I felt like I could’ve gone on longer with the session, and I would’ve if Apple let me.”</p>\n\n\n\n<p>One can readily imagine that Apple’s design team, already irritated at being pushed into announcing earlier than they wanted, would have been extremely keen to make sure the additional strap was kept out of publicity materials as much as possible; it doesn’t sound very minimalist. But for most customers, I suspect, comfort will be at least as important as aesthetics, and it makes sense for Apple to explore ways to address the headset’s weight issue.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Visual-Pro-1-1.jpg?quality=50&amp;strip=all\" alt=\"Vision Pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Visual-Pro-1-1.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Visual-Pro-1-1.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Visual-Pro-1-1.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Visual-Pro-1-1.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"683\" /><figcaption>No sign of the extra strap.</figcaption></figure><p>Petter Ahrnstedt / Foundry</p></div>\n\n\n\n<p>Less pleasingly, however, it’s emerged that the company currently plans to sell that top strap as an optional extra rather than bundling it in the box. That’s according to knowledgeable leaker-analyst Mark Gurman, writing in the latest instalment of his <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-06-25/apple-2023-and-2024-road-map-iphone-15-m3-macs-ipad-air-vision-pro-headset-ljbftjwx&amp;xcust=1-1-1969195-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On newsletter</a>.</p>\n\n\n\n<p>“With more people testing the headset, its shortcomings are coming under greater scrutiny,” Gurman writes. “Many users are finding that the metal-framed device feels too heavy after a couple hours of continuous use. To address the weight issue, Apple has developed a second strap that goes over a wearer’s head. But the company is considering selling that strap as an extra accessory rather than including it in the box.”</p>\n\n\n\n<p>Sounds like the strap that Roman used in his testing, doesn’t it? But it’s astonishing that the company would view this as an upsell add-on rather than something worth including in the box as standard.</p>\n\n\n\n<p>For one thing, Roman suspects that he was pushed into using the extra strap because of his less-than-petite head (he reports a hat size between 7 ½ and 7 ¾). If that’s correct, that would make the accessory analogous to the larger-size Apple Watch bands for those with chunkier wrists, for which Apple <em>does not</em> charge extra.</p>\n\n\n\n<p>For another, when a product costs $3,499, you need some serious brass neck to not include the accessory that stops it being uncomfortable. But then again, the $6,999 Mac Pro doesn’t include wheels, so perhaps we shouldn’t be surprised.</p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"17014615be94d45988277d93c6426e3973f61d26c29cbbe9d43169102712c424","category":"Apple"}