{"title":"Resolving the taxonomy of the Polysiphonia scopulorum complex and the Bryocladia lineage (Rhodomelaceae, Rhodophyta)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13402?af=R","date":1708105134000,"content":"<h2>Abstract</h2>\n<p>Cryptic diversity is common among marine macroalgae, with molecular tools leading to the discovery of many new species. To assign names to these morphologically similar species, the type and synonyms have to be examined, and if appropriate, new species must be described. The turf-forming red alga <i>Polysiphonia scopulorum</i> was originally described from Rottnest Island, Australia, and subsequently widely reported in tropical and temperate coasts based on morphological identifications. A recent study of molecular species delineation revealed a complex of 12 species in Australia, South Africa, and Europe. These species are placed in a taxonomically unresolved lineage of the tribe Polysiphonieae. The aim of this study was to resolve the genus- and species-level taxonomy of this complex and related species using molecular and morphological information. Three morphologically indistinguishable species of the complex were found at the type locality of <i>P. scopulorum</i>, preventing a straightforward assignment of the name to any of the molecular lineages. Therefore, we propose a molecularly characterized epitype. <i>Polysiphonia caespitosa</i> is reinstated for the only species found in its type locality in South Africa. We describe seven new species. Only one species of the complex can be morphologically recognized, with the other eight species indistinguishable based on morphometric analysis. The studied complex, together with another seven species currently placed in <i>Polysiphonia</i> and two <i>Bryocladia</i> species, formed a clade distinct from <i>Polysiphonia</i> sensu stricto. Based on observations of <i>Bryocladia cervicornis</i> (the generitype), we describe our seven new species in the genus <i>Bryocladia</i> and transfer another nine species from <i>Polysiphonia</i> to <i>Bryocladia</i>.</p>","author":"Pilar Díaz‐Tapia, \nHeroen Verbruggen","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"170d900257f11968d50ad8b1a4dca805d9ca2012581cdf2d0f7f36ed0fc27d5f","category":"Environment"}