{"title":"Tour de France tech: Unbranded and prototype wheels we’ve spotted","link":"https://cyclingtips.com/2021/06/tour-de-france-tech-unbranded-and-prototype-wheels-weve-spotted/","date":1624932361000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Ineos-Princeton-CarbonWorks-Wheels-7-650x366.jpg\" /></div><h2>Tour de France tech: Unbranded and prototype wheels we've spotted</h2><p>\n</p><p>The <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a> rolled out of Brest on Saturday morning only nine months after the finish of last year’s Grand Boucle. We’ve just spent most a week roaming the streets of Brest with long-lens cameras, large memory cards, and a notes app on overdrive, to bring you the latest tech trends from the Tour de France.</p>\n\n\n\n<p>Yesterday we released the first in our <a href=\"https://cyclingtips.com/2021/06/bikes-of-the-tour-de-france-pogacars-colnago-di2-paired-with-sram-and-more/\" target=\"_blank\">Bikes of the Tour de France video series</a> (more to follow) and today we bring you news of new and/or unbranded wheels from a host of teams.</p>\n\n\n\n<p>So grab a coffee, a <a href=\"https://fr.wikipedia.org/wiki/G%C3%A2teau_breton\" target=\"_blank\">Gâteau breton</a>, and enjoy this Tour de France wheels gallery. </p>\n\n\n\n<figure><ul><li><figure><img /><figcaption>We spotted some new wheels on Mathieu van der Poel’s Canyon. </figcaption></figure></li><li><figure><img /></figure></li><li><figure><img /><figcaption>It might not say “Shimano”, but nothing says Shimano like this font and colour. </figcaption></figure></li><li><figure><img /><figcaption>Looks like Shimano is sticking with cup and cone bearings. </figcaption></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>As you can see above, stage 2 winner Mathieu van der Poel’s Canyon Aeroad features some as-yet-unannounced new Shimano wheels. We first saw these wheels under George Bennett at the Giro in May, but we managed to grab some close-up shots of the wheels before the start of stage 1. </p>\n\n\n\n<figure><ul><li><figure><img /><figcaption>We also spotted Team DSM using the same new and unnamed wheels.</figcaption></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>The Bikes of the Tour video we mentioned above features Michael Matthews’s custom-painted Bianchi with Shimano Dura-Ace C60 wheels. We also spotted Matthews’s spare bike which sat on a pair of unbranded wheels which were hastily swooped away from our prying eyes. But we smelled something fishy. It might just have been the nearby docks, but we assumed it was a set of wheels we weren’t supposed to see.  </p>\n\n\n\n<p>Fast forward to the morning of stage 1, and although we didn’t manage to snap Matthews’s’ bike then, we did spot a number of other BikeExchange bikes running wheels sans decals. </p>\n\n\n\n<figure><ul><li><figure><img /><figcaption>BikeExchange Bianchis equipped with the new wheels.</figcaption></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /><figcaption>Looks like a Vision hub to us, and the QR code and numbers font are very similar to those used on Vision wheels we have seen in the past.</figcaption></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>Although taped over, the hub gives a good indication these wheels are in fact Vision Metrons. Plus, the rim bears a striking resemblance to those used by both Bahrain Victorious and EF Education-Nippo.</p>\n\n\n\n<figure><ul><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>Jumbo-Visma was another team running unbranded wheels before the start of stage 1, and again we are confident these are Vision Metron wheels. Although these feature a similar rim, the hub is entirely different but again offers us a clue as to the true identity of these wheels. Although the black-on-black design is difficult to make out, and I couldn’t get any closer, we can just about make out the “Vision” text wrapping around the hub shell. </p>\n\n\n\n<figure><ul><li><figure><img /><figcaption>Jumbo-Visma riders rolled out on Dura-Ace wheels for the ride to the team presentation.</figcaption></figure></li><li><figure><img /><figcaption>They then rolled out for stage 1 on unbranded wheels we think are also Visions.</figcaption></figure></li><li><figure><img /><figcaption>These wheels look like Visions but, at least in terms of the hub, they look different to the Visions we think BikeExchange are using. </figcaption></figure></li><li><figure><img /><figcaption>The rims look very similar to those used by BikeExchange.</figcaption></figure></li><li><figure><img /><figcaption>Almost the entire team rode the unbranded wheels with a blue tire for the pre-race ride on Friday.</figcaption></figure></li><li><figure><img /><figcaption>Only Tony Martin and Mike Teunissen started with the Dura-Ace wheels.</figcaption></figure></li></ul></figure>\n\n\n\n<figure><ul><li><figure><img /><figcaption>The entire Ineos Grenadiers squad started stage 1 on the new Princeton CarbonWorks wheels.</figcaption></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>The Ineos-Grenadiers rode Shimano wheels to the team presentation but made the switch to the new <a href=\"https://cyclingtips.com/2021/06/princeton-carbonworks-and-ineos-debut-new-peak-4550-ultralight-wheels/\" target=\"_blank\">Princeton CarbonWorks Peak 4550</a> wheels for stage one. As expected, the team opted for the tubular setup, running the highly sought-after Competition Pro Ltd tubular. </p>\n\n\n\n<figure><ul><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>Defending champ Tadej Pogačar ran Campagnolo’s new Bora Ultra WTO 45s with tubeless Vittoria Corsa Speed in the lead-up to stage 1, but like many of the team switched back to Campagnolo’s Bora One 50 tubular for stage 1. However, for stage 3 Pogačar was back on the WTO and tubeless setup.</p>\n\n\n\n<figure><ul><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>It seems UAE Team Emirates is happy to chop and change wheels for different stages. We’ll wait to see if the team changes back to rim brake Colnagos for the high mountains.  </p>\n\n\n\n<figure><ul><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>Lotto Soudal seemed much happier to stick with the newer Bora Ultra WTO, running a mixture of Vittoria tubeless and clincher-with-inner-tube setups. A small number of Lotto Soudal riders have opted for the Bora One tubular. </p>\n\n\n\n<figure><ul><li><figure><img /></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>Team Movistar ran a mixture of the 303 Firecrest and the <a href=\"https://cyclingtips.com/2021/06/zipp-launches-new-454-nsw-404-firecrest-and-858-nsw-go-fast-aero-wheels/\" target=\"_blank\">new 454 NSW tubular</a>.</p>\n\n\n\n<figure><ul><li><figure><img /></figure></li><li><figure><img /><figcaption>Froome’s Tour de France Race bike with a multitude of personal touches.</figcaption></figure></li><li><figure><img /></figure></li><li><figure><img /></figure></li></ul></figure>\n\n\n\n<p>During stage 1 we reported on <a href=\"https://cyclingtips.com/2021/06/spotted-chris-froomes-customised-factor-ostro-isnt-exactly-sponsor-correct/\" target=\"_blank\">Chris Froome’s race bike</a> and his decision to run Lightweight wheels. We also spotted Lightweight Meilenstein wheels on bikes belonging to Dan Martin and Mike Woods, plus unsurprisingly on a number of spares on the team car roof. </p>\n\n\n\n<p>Stay posted to CyclingTips for more tech news from the 2021 Tour de France.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/tour-de-france-tech-unbranded-and-prototype-wheels-weve-spotted/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"17116d93f07a5d660dc989e5b0a1bcc21055e9880b941ebd17dde205bc00c8df","category":"Cycling"}