{"title":"Perception of the Barriers to the Implementation of a Successful Climate Change Policy in Bulgaria","link":"https://www.preprints.org/manuscript/202409.1322/v1","date":1726622545000,"content":"Climate change is an undeniable global phenomenon with severe and long-lasting impacts on the environment, economy, and society [1]. Like countless other nations, Bulgaria is already feeling the effects of climate change, with rising temperatures and heat waves [2], erratic precipitation patterns, and frequent occurrences of extreme weather events. Bulgaria is under imminent threat from climate change. The country is projected to experience a temperature increase of up to 4°C by 2100. This will lead to changes in precipitation patterns, resulting in numerous consequences. These include reduced water storage, impacts on public health, disruptions in agricultural production, stress on the country's biodiversity and forests, damage to infrastructure and private property, changes in tourism patterns, and many other potential issues [3]. Climate change has recently become a significant concern in Bulgaria due to its impact on ecosystems, the economy, society, and infrastructure. This study aims to examine the varying perspectives of different stakeholders regarding the bar-riers that impede the effective implementation of climate policies in Bulgaria. Key representatives from public administration, NGOs, businesses, and academia were interviewed in-depth. Additionally, an online and face-to-face survey was conducted among a diverse sample of the Bulgarian population. Results show that the most cited barriers include political instability, long-term vision, inadequate financial resources, limited public awareness, conflicting interests across sectors, and slow administrative processes. Moreover, the survey highlights notable disparities in perceptions among different stakeholder groups.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"171c1497edf02d352b5b691d5fe659977f6d51944f3f531be78e1fbe2a44d510","category":"Interdisciplinary"}