{"title":"Changes in Race Performance during the Underwater Phases of a 200 m Bi-Fins Race Simulation after Application Respiratory Muscle Training &ndash; Case Study in the Current World Record Holder","link":"https://www.preprints.org/manuscript/202409.1169/v1","date":1726541814000,"content":"Maximal athletic performance can be limited by various factors, including restricted respiratory function. These limitations can be mitigated through targeted respiratory muscle training, as supported by numerous studies. However, the full potential of respiratory training in competitive finswimming has not been fully investigated. This case study aims to evaluate performance variability during underwater phases in an elite Bi-Fins swimmer (current world record holder and multiple world championship medallist) over a 200m race simulation after an eight-week respiratory training using Airofit PRO™. Performance variability was assessed based on pre-test, inter-test, and post-test data. Each measurement included pulmonary function, body composition, and swim performance evaluations. The swimmer followed a 28-day training program with the AiroFit PRO™ respiratory trainer between tests. Significant improvements were observed in Wilcoxon paired-sample test between the pre-test and post-test in underwater distance (p=0.012; d=1.26), underwater time (p=0.012; d=1.26), and number of underwater kicks (p=0.043; d=1.01), resulting in a 14.23% longer underwater distance, 14.08% longer underwater time, and 14.94% increase in underwater kicks. Despite increased distance and time, underwater velocity remained stable, indicating improved underwater performance efficiency. The results suggest that the AiroFit PRO™ respiratory trainer has practical applications in finswimming training programs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1737c62ef1f8abe12c9ca351f5ba6a924c87d1fa8b27729015d545f75ae27cf5","category":"Interdisciplinary"}