{"title":"Interventions to enhance mental health and wellbeing among international college students: A systematic review and meta-analysis protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310645","date":1726754400000,"content":"<p>by Cheng-Ching Liu, Qi Huang, Angela Chia-Chen Chen, Charles Liu, Yuqing Liu</p>\r\nBackground <p>International students contribute significantly to both the economy and the intellectual and cultural landscape of host countries. Their interactions with domestic students foster personal, socioeconomic, and political development, promopting a broader understanding of diverse cultures and values. This highlights how crucial international education is for staying competitive globally. However, international students often face challenges such as poor mental health, linguistic and cultural barriers, acculturative stress, and limited health literacy. Therefore, supporting their academic success and well-being on college campuses is essential. This protocol aims to describe strategies used to evaluate the effect of interventions on international students’ mental health and wellbeing and propose directions for future research based on the evidence.</p> Methods <p>We will conduct an extensive search in several databases including CINAHL, PubMed, Web of Science, PsyInFO, ERIC, and Google Scholar with no date limits. Two reviewers will independently screen the literature and extract data. We will then conduct meta-analyses of the extracted data.</p> Discussion <p>To the best of our knowledge, this study is the first systematic review with meta-analysis focusing on interventions to enhance mental health and wellbeing among international college students. This study will provide most updated empirical evidence on the effects of interventions aimed to improve international students’ mental health and wellbeing. The findings from this study will summarize the importance of a range of interventions being available to international students who experience psychological distress and the effectiveness of each intervention. This study will also highlight the gap for researchers to focus on for future studies.</p> Trial registration <p>PROSPERO registration number: CRD42024528767.</p>","author":"Cheng-Ching Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"17380bf980c845c22c3fe23d7a52590004e4c4d03f249996dffc25be76e47942","category":"Interdisciplinary"}