{"title":"A two-decade analysis of the spatial and temporal variations in burned areas across Zimbabwe","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000201","date":1705500000000,"content":"<p>by Munyaradzi Davis Shekede, Samuel Kusangaya, Courage B. Chavava, Isaiah Gwitira, Abel Chemura</p>\r\n\r\nUnderstanding wildfire dynamics in space and over time is critical for wildfire control and management. In this study, fire data from European Space Agency (ESA) MODIS fire product (ESA/CCI/FireCCI/5_1) with ≥ 70% confidence level was used to characterise spatial and temporal variation in fire frequency in Zimbabwe between 2001 and 2020. Results showed that burned area increased by 16% from 3,689 km<sup>2</sup> in 2001 to 6,130 km<sup>2 in</sup> 2011 and decreased in subsequent years reaching its lowest in 2020 (1,161km<sup>2</sup>). Over, the 20-year period, an average of 40,086.56 km<sup>2</sup> of land was burned annually across the country. In addition, results of the regression analysis based on Generalised Linear Model illustrated that soil moisture, wind speed and temperature significantly explained variation in burned area. Moreover, the four-year lagged annual rainfall was positively related with burned area suggesting that some parts in the country (southern and western) are characterised by limited herbaceous production thereby increasing the time required for the accumulation of sufficient fuel load. The study identified major fire hotspots in Zimbabwe through the integration of remotely sensed fire data within a spatially analytical framework. This can provide useful insights into fire evolution which can be used to guide wildfire control and management in fire prone ecosystems. Moreover, resource allocation for fire management and mitigation can be optimised through targeting areas most affected by wildfires especially during the dry season where wildfire activity is at its peak.","author":"Munyaradzi Davis Shekede","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"173a176328bceb8e49180686503fbd962191cce036d22ee49c640cbaac38df16","category":"Environment"}