{"title":"40 years of the Mac, 40 years of Macworld","link":"https://www.macworld.com/article/2222437/macworld-40th-anniversary.html","date":1706700600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>As you’re probably aware, there was a <a href=\"https://www.macworld.com/article/2216095/40-years-mac-immortal.html\">big anniversary last week</a>. But the Mac wasn’t the only venerable Apple-related institution to hit the big four-oh on January 24. Once <a href=\"https://www.macworld.com/article/2215934/watch-steve-jobs-reveal-first-mac.html\">Steve Jobs wowed the 1984 Apple Investor Meeting</a> at the Flint Center in Cupertino with his introduction of the original Macintosh, attendees emerged from the auditorium to be greeted by people handing out the first issue of the world’s newest computer magazine: Macworld.</p>\n\n\n\n<p>Yes, it’s Macworld’s 40th as well. As you might expect from the relative health of the technology and media industries, the story of Macworld does not quite follow the same trajectory as the story of the Mac. (In the earliest days, Macworld was more successful than the Mac!)</p>\n\n\n\n<p>As the person who has probably been associated with Macworld for two-thirds of its existence–I joined the staff in the fall of 1997, and I’m writing this in 2024–it’s only appropriate that I take you on a little trip down memory lane.</p>\n\n\n\n<h2>Making a deal with Steve</h2>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/David_Bunnell&amp;xcust=1-1-2222437-1-0-0&amp;sref=https://www.macworld.com/feed\">David Bunnell</a>, founding editor of IDG’s PCWorld, was also the founder of Macworld. (The two magazines were split into separate companies later in the 1980s, only to be merged back together into a single business in the 2000s.) Bunnell, who passed away in 2016, told the story of founding Macworld <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://technologizer.com/2024/01/20/the-inside-story-of-pc-magazine-pc-world-and-macworlds-origins-as-told-by-david-bunnell/&amp;xcust=1-1-2222437-1-0-0&amp;sref=https://www.macworld.com/feed\">a few times</a>. But here’s the short version.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"1984 Mac team\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=1200%2C801&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=1536%2C1025&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=2048%2C1366&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac-team.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"801\" /><figcaption><p>This photograph of the Mac development team (with Steve Jobs holding a Mac) appeared in the very first issue of Macworld.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Bunnell and PCWorld colleague <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://medium.com/@harrymccracken/the-1985-andrew-fluegelman-interview-5791470819db&amp;xcust=1-1-2222437-1-0-0&amp;sref=https://www.macworld.com/feed\">Andrew Fluegelman</a> were a bit bored by the once-exciting world of personal computing settling down into a bit of a rut, thanks to the growing dominance of the IBM PC. Bunnell approached Apple about publishing an Apple II magazine, only to be told that Apple had cut a deal with fierce rival Ziff-Davis that gave them exclusive access to new Apple II buyers.</p>\n\n\n\n<p>Turns out that a fortuitous conversation with Bill Gates is, in part, responsible for the founding of Macworld. Bunnell recalled that Gates had spilled the beans about Apple’s new Macintosh project a few months earlier, raving about how the Mac would change everything. So Bunnell proposed publishing Macworld, and Apple was receptive to the idea.</p>\n\n\n\n<p>That might be a little too simplistic a version of the story because <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cultofmac.com/295336/remembering-macworld-steve-jobs/&amp;xcust=1-1-2222437-1-0-0&amp;sref=https://www.macworld.com/feed\">as Bunnell wrote</a>, IDG founder Pat McGovern was down on Apple and wanted to launch a new magazine about IBM PC home spin-off the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/IBM_PCjr&amp;xcust=1-1-2222437-1-0-0&amp;sref=https://www.macworld.com/feed\">PCjr</a>. Steve Jobs, meanwhile, wanted IDG to pay for the privilege of covering the Mac–while McGovern wanted Jobs to pay IDG for the privilege of making a magazine about his computer!</p>\n\n\n\n<p>(Anyone who dealt with either Jobs or McGovern during their lives will recognize the attitude and sheer chutzpah on display. During a single day in 2004, I had one-on-one conversations with both of them. That was one heck of a day.)</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/steve-jobs-macworld-covers.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Macworld covers Steve Jobs\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/steve-jobs-macworld-covers.jpg?quality=50&amp;strip=all 3800w, https://b2c-contenthub.com/wp-content/uploads/2024/01/steve-jobs-macworld-covers.jpg?resize=300%2C185&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/steve-jobs-macworld-covers.jpg?resize=768%2C473&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/01/steve-jobs-macworld-covers.jpg?resize=1200%2C739&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/01/steve-jobs-macworld-covers.jpg?resize=1536%2C946&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2024/01/steve-jobs-macworld-covers.jpg?resize=2048%2C1261&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"739\" /><figcaption><p>The first cover of Macworld was created in a special edition for the Mac’s 25th anniversary in 2009.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>While the negotiation and bickering continued, Bunnell and Fluegelman assembled a staff to build the first issue of Macworld in secret. The magazine had unfettered access to the Mac team’s offices on Bandley Drive in Cupertino. Jobs <a href=\"https://www.macworld.com/article/222770/cover-story-steve-jobs-and-the-first-issue-of-macworld.html\">posed for the cover of the first issue</a>, an iconic shot by <a href=\"https://www.macworld.com/article/2203496/behind-scenes-steve-jobs-photoshoot-macworld.html\">photographer Will Mosgrove</a>. (When I was editor in chief, in late 2008 we worked with Mosgrove to clean up and reprint that image for the 25th anniversary cover of Macworld.)</p>\n\n\n\n<p>By this point, Macworld had so much momentum that nobody–not even Jobs and McGovern–could stop it. And so that first issue, packed with insider information about how the Mac was made, as well as reviews of the first Mac apps, was handed out on launch day. By the fourth issue, even McGovern couldn’t deny that Macworld was here to stay.</p>\n\n\n\n<h2>The middle years</h2>\n\n\n\n<p>If you read any of Bunnell’s remembrances of the founding of Macworld, you will discover two things: his immense respect for Fluegelman, who died tragically young, and that he actually wasn’t much of a fan of what the Mac became. (He was, I would argue, a PC guy through and through.)</p>\n\n\n\n<p>By the early 1990s, the Mac had grown and evolved without many of its key players. Jobs were gone from Apple, and Mac models proliferated as the company fought to keep a foothold of users during the rise of the Microsoft-Intel juggernaut. Mac magazines also proliferated: The U.K.’s MacUser magazine was licensed by Ziff-Davis, PCWorld’s rival in the U.S. and the competition was on.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/macuser-last-issue.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"October 1997 MacUser: Last issue\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/macuser-last-issue.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2024/01/macuser-last-issue.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/macuser-last-issue.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/01/macuser-last-issue.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/01/macuser-last-issue.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2024/01/macuser-last-issue.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2024/01/macuser-last-issue.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2024/01/macuser-last-issue.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>The last issue of MacUser, Macworld’s main competitor, was the October 1997 issue. IDG’s Macworld and Ziff-Davis’ MacUser merged that year.</p></figcaption></figure><p>Ziff-Davis</p></div>\n\n\n\n<p>This is where I come into the story. In the summer of 1993, I was an intern at MacUser, and shortly thereafter, I was hired by editor-in-chief Maggie Cannon (formerly the editor of that Apple II magazine that blew up David Bunnell’s plans!) to become a full-time editor. Unfortunately, Apple’s slide toward bankruptcy picked up speed with the release of Windows 95, which popularized a Mac-like interface–and made it awfully hard for the real Mac to compete.</p>\n\n\n\n<p>It got so bad that the two rivals, IDG and Ziff-Davis, decided that the Mac market wasn’t worth fighting over. They would regret this decision almost immediately, but not before large portions of the Macworld and MacUser staff were laid off, and the two magazines were merged into a single, larger version of Macworld.</p>\n\n\n\n<p>You’d think that two sets of San Francisco-based editors who spent their professional lives covering Apple computers would be more alike than not, but the culture of the two magazines couldn’t have been more different. It took a year and a huge amount of staff turnover for the magazine to stabilize.</p>\n\n\n\n<p>Funny thing about that year: It’s also the year Apple came roaring back, with Steve Jobs unveiling the iMac, a new Power Mac, and stylish new PowerBooks. All of a sudden, Apple was fun to write about again–and almost every month, there was a new product that let us produce big feature stories backed by photographic covers of great-looking Apple products.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/July-1998-Macworld.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"July 1998 Macworld\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/July-1998-Macworld.jpg?quality=50&amp;strip=all 1800w, https://b2c-contenthub.com/wp-content/uploads/2024/01/July-1998-Macworld.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/July-1998-Macworld.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/01/July-1998-Macworld.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/01/July-1998-Macworld.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2024/01/July-1998-Macworld.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2024/01/July-1998-Macworld.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>The July 1998 cover of Macworld featured the iMac that revitalized Apple.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>The digital era</h2>\n\n\n\n<p>Before I even left college, I published a magazine that was entirely distributed via the Internet. So when I got into traditional publishing–electronic publishing was not a viable career option in 1994–I began to try and drag the places I worked for into the modern era by suggesting we launch websites. (I was told by one person at Ziff-Davis Publishing that “the future is on CompuServe.” I’ll never forget it.)</p>\n\n\n\n<p>It’s not news to say that print magazines were slow to embrace the web. In the early days, it was hard to understand how a company would ever make money on it, and print advertising was incredibly profitable. But over time, we got better at publishing to the web, as well as putting the words of notable web writers such as John Siracusa and John Gruber in front of print readers for the first time.</p>\n\n\n\n<p>You know that famous line about going bankrupt slowly at first and then suddenly? For a surprising number of years, the print magazine business was still profitable–until it suddenly wasn’t. Despite good support from paying subscribers, the bottom dropped out of the print advertising market–in the case of PCWorld, it literally happened in a single month–and it overturned the economics of publishing.</p>\n\n\n\n<p>The truth is, the Macworld (and PCWorld) readership was always years ahead of the general media audience in their habits. We stopped putting ink on paper and turned entirely digital back in 2014, but our audience–on the web and in our digital edition–was way ahead of us.</p>\n\n\n\n<p>I left the Macworld staff in 2014, writing an editor’s column about saying goodbye to print that was also secretly my farewell to Macworld. But Macworld continued on, and so did I. By my count, I’ve written nearly 500 of these columns for Macworld in the nine years since I left!</p>\n\n\n\n<p>The story goes on–for me and for Macworld. The form has changed (a lot), but the thing that David Bunnell started more than 40 years ago is still making an impact.</p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"173aef5e546f632e1703eeda959d88b370d96200d1683797c30f9f09f5e79caa","category":"Apple"}