{"title":"miR-335-3p attenuates transforming growth factor beta 1-induced fibrosis by suppressing Thrombospondin 1","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311594","date":1728309600000,"content":"<p>by Dong-Hee Han, Min Kyoung Shin, Jung-Suk Sung, Min Kim</p>\r\n\r\nPulmonary fibrosis is characterized by excessive extracellular matrix (ECM) accumulation caused by detrimental stimuli. The progressive impairment in lung functions is chronic and highly fatal, presenting itself as a global health challenge. Because of the lack of efficacious treatments, the underlying mechanism should be investigated. The progression of fibrosis involves transforming growth factor-beta 1 (TGF-β1), which accelerates ECM production via epithelial–mesenchymal transition and cell invasion. As microRNAs (miRNAs) serve as regulators of disease development and progression, this study aimed to investigate the interaction of miRNAs and target genes that could contribute to pulmonary fibrosis when exposed to TGF-β1. Differentially expressed mRNA and miRNA were identified in respiratory epithelial cells via transcriptome analysis by using the constructed TGF-β1-induced fibrosis model. Our results revealed a significant increase in the expression of thrombospondin 1 (THBS1), which participates in TGF-β1 activation, where THBS1 was identified as a core gene in protein interactions analyzed through bioinformatics. The expression of miR-335-3p, which targets 3ʹ-UTR of THBS1, substantially decreased upon TGF-β1 treatment. The TGF-β1 downstream signal was suppressed by inhibiting the interaction between TGF-β1 and THBS1, consequently alleviating fibrosis. When the miR-335-3p mimic was transfected in TGF-β1-treated respiratory epithelial cells, THBS1 and fibrosis markers were downregulated, while the introduction of miR-335-3p inhibitor exhibited a reverse phenomenon. Our findings demonstrated that TGF-β1 exposure to respiratory epithelial cells led to a decrease in miR-335-3p expression, resulting in the upregulation of THBS1 and ultimately exacerbating fibrosis. This study provides insights into TGF-β1-induced pulmonary fibrosis, suggesting new therapeutic targets and mechanisms.","author":"Dong-Hee Han","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"173f9f8fd6449830ba5f607b52f6e74174fc89b61716d207818317635263c023","category":"Interdisciplinary"}