{"title":"Report: Apple’s next iPhone SE will be the one to retire the iPhone 6 design","link":"https://arstechnica.com/?p=1971791","date":1695926350000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/Apple-iPhone-14-iPhone-14-Plus-5up-hero-220907-800x450.jpg\" alt=\"A new report claims that last year's iPhone 14 could be the foundation of a new iPhone SE in 2025.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/Apple-iPhone-14-iPhone-14-Plus-5up-hero-220907-scaled.jpg\">Enlarge</a> <span>/</span> A new report claims that last year's iPhone 14 could be the foundation of a new iPhone SE in 2025. (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>I've got a soft spot for Apple's budget phone, <a href=\"https://arstechnica.com/gadgets/2022/03/2022-iphone-se-review-revving-up-a-classic-hot-rod/\">the iPhone SE</a>. It has never been technologically impressive, but it has always been a way to get most of what's good about the iPhone ecosystem—an active App Store, Apple services like iMessage, and prompt software updates delivered for a respectable number of years—for several hundred dollars less than whatever the current flagship is.</p>\n<p>The downside has been that you need to put up with an older design. In the case of the current iPhone SE and the one before that, that has meant a phone with the same 4.7-inch screen and basic dimensions as the iPhone 6, a design that will be a decade old next year. The SE has waterproofing, wireless charging, a better camera, a faster chip, and some other features that the iPhone 6 never had, but the body-to-screen ratio is much worse than pretty much any other modern smartphone.</p>\n<p>For the last year, people who are normally mostly right about Apple rumors have been saying that the next iPhone SE is the one that will graduate to an iPhone X-style design, with a much larger screen and a display notch for the FaceID sensor and webcam. MacRumors <a href=\"https://www.macrumors.com/2023/09/27/iphone-se-4-details/\">published a report yesterday</a> that purports to fill in a few more of the gaps.</p></div><p><a href=\"https://arstechnica.com/?p=1971791#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1971791&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"17498cf8f3ee3e2c3ff8b850924dd957f7baaf22a4ee4383e5aa1c0d6806e144","category":"Tech"}