{"title":"Application of Machine Learning to Forecast Drought Index for the Mekong Delta","link":"https://www.preprints.org/manuscript/202405.1693/v1","date":1716792257000,"content":"Droughts have a substantial effect on water resources, agriculture, and ecosystems on a worldwide scale. In the Mekong Delta of Vietnam, droughts exacerbated by climate change are significantly endangering the region's agricultural sustainability and output. Conventional forecasting techniques frequently do not capture the intricate dynamics of meteorological phenomena associated to drought effectively, prompting the exploration of more advanced methodologies. This work utilises artificial intelligence, par-ticularly machine learning methods like Gradient Boosting and Extreme Gradient Boosting (XGBoost), to enhance drought pre-diction in the Mekong Delta. The study utilises data from 11 meteorological stations spanning from 1990 to 2022 to create and evaluate Machine Learning models based on several climatic factors. We utilise Gradient Boosting and XGBoost algorithms to estimate the Standardised Precipitation-Evapotranspiration Index (SPEI) and evaluate their effectiveness in comparison to con-ventional forecasting techniques. The results show that Machine Learning, particularly XGBoost, surpasses traditional approaches in predicting SPEI accuracy at various time scales. XGBoost demonstrates skill in understanding the complex relationships between climatic factors, with R² values falling between 0.90 and 0.94 for 1-month forecasts. The progress highlights the potential of Machine Learning in improving drought management and adaptation tactics, proposing the incorporation of Machine Learning forecasting models into decision-making processes to enhance drought resistance in susceptible areas.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"174f4a4b55f3671c34d5c550d0e364f33c654130c8f48dccbe82240e1e5eb1a3","category":"Interdisciplinary"}