{"title":"Long-Term Organic Cultivation in Greenhouses Enhances Vegetable Yield and Soil Carbon Accumulation through the Promotion of Soil Aggregation","link":"https://www.preprints.org/manuscript/202403.1849/v1","date":1711714851000,"content":"The long-term use of fertilizers and pesticides in conventional cultivation has resulted in a decrease in soil productivity and vegetable yields in greenhouses. However, only a limited number of studies have explored the impacts of organic cultivation on greenhouse soil. Specifically, there is a scarcity of research examining the alterations in soil aggregate mediated organic carbon and microbial communities, which are known to enhance soil productivity. This study investigated the properties of soil aggregates, including the levels of organic carbon fractions, microbial community, and enzyme activity with the three aggregate classes microaggregates (&amp;lt;0.25 mm), small macroaggregates (2-0.25 mm) and large macroaggregates (&amp;gt;2 mm). These investigations were conducted under three different cultivation methods in a greenhouse: conventional cultivation (CC), integrated cultivation (IC), and organic cultivation (OC) in greenhouse. The results showed that (1) OC and IC promoted the formation of small macro-aggregates and enhanced aggregate stability compared to CC, (2) SOC in the three size fractions of OC increased by 98.99%-92.06% compared to CC; EOC increased by 98.47%-117.59%; POC increased by 138.59%-208.70%; MBC increased by 104.71%-230.61%; DOC increased by 21.93%-40.90%, respectively; (3) Organic cultivation significantly increased enzyme activity in all three particle size aggregates and increased the relative abundance of bacteria in micro-aggregates as well as the relative abundance of fungi in small macro-aggregates. Structural equation model (SEM) analysis revealed that organic farming practices fostered the development of smaller macro-aggregates, elevated microbial and enzyme activities within soil aggregates, and facilitated the conversion of soil nutrients and carbon sequestration. consequently, this led to an increase in soil organic carbon content and improved vegetable yield in greenhouse environments. In conclusion, the soil carbon content and vegetable yield are enhanced through long-term organic cultivation in greenhouses, primarily by increasing the proportion of small macro-aggregates.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"175426edf286fc4e2f491dd9bea727a92965ddca0f8aa2d17ef3bada7ccc9c90","category":"Interdisciplinary"}