{"title":"Development and application of an online tool to quantify nitrogen removal associated with harvest of cultivated eastern oysters","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310062","date":1725631200000,"content":"<p>by Julie M. Rose, Ryan Morse, Christopher Schillaci</p>\r\n\r\nShellfish aquaculture can provide important ecosystem services to coastal communities, yet these benefits are not typically considered within the aquaculture permit review process. Resource managers have expressed interest in easy-to-use tools, based on robust science, that produce location and operation-appropriate values for beneficial services. These values need to be produced in a format that aligns with existing regulatory processes to facilitate seamless integration with permit review. The removal of excess nitrogen from coastal waters by shellfish farms is well documented in the literature and has been incorporated into nutrient management in the USA. Shellfish assimilate nitrogen into their tissue and shell as they grow, and this nitrogen is removed from the environment upon harvest. We have assembled a dataset of nitrogen concentration and morphometric measurements from farmed eastern oysters across the US Northeast, and adapted methodology used by existing nutrient management programs to quantify harvest-associated removal of nitrogen. Variability in oyster tissue and shell nutrient concentration was low within the dataset, and an assessment of farm location, ploidy, and three common cultivation practices (floating gear, bottom gear, no gear) suggested that a simple regression-based calculation could be applied across all farms within the region. We designed the new, publicly available online Aquaculture Nutrient Removal Calculator tool https://connect.fisheries.noaa.gov/ANRC/ based on this analysis, which uses inputs related to oyster size and harvest number to predict harvest-based nitrogen removal from an eastern oyster farm located within the geographic range of North Carolina to Maine, USA. The tool also produces a report that has been designed to integrate with the US Army Corps of Engineers public interest review process, and similar state-level permitting processes, and provides a succinct summary of the ecological services associated with nutrient removal in eutrophic locations, project-specific values, and citations supporting the calculation of those values.","author":"Julie M. Rose","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1757421eee07954f8f5831159a062f1062d1f4923008f7556f96c9ca099e1bfb","category":"Interdisciplinary"}