{"title":"Seroepidemiology of pertussis in Huzhou: A population-based, cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303508","date":1716213600000,"content":"<p>by Yan Liu, Chao Zhang, Yuda Wang, Xiaofu Luo, Guangtao Liu, Zizhe Zhang, Jianyong Shen</p>\r\nPurpose <p>The resurgence of pertussis has occurred around the world. However, the epidemiological profiles of pertussis cannot be well understood by current diseases surveillance. This study was designed to understand the seroepidemiological characteristics of pertussis infection in the general population of Huzhou City, evaluate the prevalence infection of pertussis in the population, and offer insights to inform adjustments in pertussis prevention and control strategies.</p> Methods <p>From September to October 2023, a cross-sectional serosurvey was conducted in Huzhou City, involving 1015 permanent residents. Serum samples were collected from the study subjects, and pertussis toxin IgG antibodies (Anti-PT-IgG) were quantitatively measured using enzyme-linked immunosorbent assay (ELISA). The analysis included the geometric mean concentration (GMC) of Anti-PT-IgG, rates of GMC≥40IU/mL, ≥100IU/mL, and &lt;5IU/mL. Stratified comparisons were made based on age, vaccination history, and human categories.</p> Results <p>Among the 1015 surveyed individuals, the geometric mean concentration (GMC) of Anti-PT-IgG was 10.52 (95% CI: 9.96–11.11) IU/mL, with a recent infection rate of 1.58%, a serum positivity rate of 11.43%, and a proportion with &lt;5IU/mL of 40.49%. Among 357 children with clear vaccination history, susceptibility decreased with an increasing number of vaccine doses (Z = -6.793, <i>P</i> &lt; 0.001). The concentration of Anti-PT-IgG exhibited a significant post-vaccination decline over time (Z = -5.143, <i>P</i> &lt; 0.001). In women of childbearing age, the GMC of Anti-PT-IgG was 7.71 (95% CI: 6.90–8.62) IU/mL, with no significant difference in susceptibility among different age groups (χ<sup>2</sup> = 0.545, <i>P</i> = 0.909). The annual pertussis infection rate in individuals aged ≥3 years was 9321 (95%CI: 3336–16039) per 100,000, with peak infection rates in the 20–29, 40–49, and 5–9 age groups at 34363 (95%CI: 6327–66918) per 100,000, 22307.72 (95%CI: 1380–47442) per 100,000, and 18020(95%CI: 1093–37266) per 100,000, respectively.</p> Conclusions <p>In 2023, the actual pertussis infection rate in the population of Huzhou City was relatively high. Vaccine-induced antibodies exhibit a rapid decay, and the estimated serum infection rate increases rapidly from post-school age, peaking in the 20–29 age group. It is recommended to enhance pertussis monitoring in adolescents and adults and refine vaccine immunization strategies.</p>","author":"Yan Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"175d22fa01912e8d6fa40a315199c92b30186e8be5cbc2db2c94990e76f72035","category":"Interdisciplinary"}