{"title":"Homing behavior of a tree lizard: influences of mating resource and habitat structure","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae081/7809585?rss=1","date":1727913600000,"content":"<span><div>Abstract</div>Homing behavior, characterized by repeated navigation to specific spatial areas, is shaped by individual condition and numerous environmental factors varying at both individual and population levels. Homing behavior is often measured by quantifying site fidelity and homing success. Site fidelity reflects an individual’s inclination to stay or reuse its previously occupied location, while homing success assesses the likelihood of an individual returning to its original location after an involuntary translocation. Exploring the effects of ecological and environmental factors on homing behavior across populations offers valuable insights into its adaptability to diverse and changing environments. Here, we conducted a translocation experiment involving 8 populations of Swinhoe’s tree lizard (<span>Diploderma swinhonis</span>). We examined the effects of resource availability (mate and food), morphological traits, habitat structure, and population density on both site fidelity and homing success. Our results revealed significant variations in both site fidelity and homing success, both within and between populations. Males exhibited higher site fidelity when they had high numbers of female neighbors and low levels of heterogeneity of male neighbors. Regarding homing success, males returned to their territories more rapidly when their territories provided abundant mating opportunities and low levels of intrasexual competition. Additionally, habitat structure influenced homing success, with males showing higher success rates in populations characterized by smaller trees, or when they occupied smaller territory trees. Overall, our findings emphasize the necessity of making comparisons within and between populations to better understand the evolutionary and ecological forces shaping animal navigation.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"176466d501d1cf09bb4ec7453b1567ed320145ed49396a3b82a97a003f01fd07","category":"Environment"}