{"title":"Here come the Belgians!","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/here-come-the-belgians","date":1625505657000,"content":"\n      <p>Stage 5 of this year's Paris-Nice and it was bubbling along nicely, if unspectacularly. Then something quite dramatic, and unique, happened.</p>\n<p>Eleven Belgians – yes 11 – took it upon themselves to light up proceedings with an attack of stupendous audacity. And hilarity. The TV commentators were in fits of giggles, as were many of us.</p>\n<div></div>\n<p>Oliver Naesen was the man behind the slickly-managed operation, gathering up his countrymen from a variety of teams to dissuade any sprinters’ outfits from spoiling the party, then smashing away in the crosswinds for a brief interlude before being reeled back in.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Tour de France 2021 Guide</a></strong></em></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1325771264_1024x1024.jpg?v=1625143908\" /></p>\n<p><em>﻿Oliver Naesen: he's a very naughty boy...</em></p>\n<p>Accompanying the mischievious Naesen were the likes of Yves Lampaert, Tim Declercq, Jasper Stuyven and Victor Campenaerts, plus, naturally, Thomas de Gendt. Because, no Thomas de Gendt, no party.</p>\n<p>Another rider of note in this fabulous move was Philippe Gilbert. A recent conversation I had with TV commentator and Rouleur columnist Ned Boulting threw up an interesting theory from the former world champion.</p>\n<p>He had related to Ned how Remco Evenepoel was a unifying figure for the famously divided nation. The young superstar hails from Aalst, east Flanders, not so far from Wallonia, but is fluent in both languages. Eddy Merckx was a similarly loved figure by both Flandrians and Walloons – something of a rarity in the complex political cauldron of Belgium.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/mark-cavendishs-transcendent-win\"><em><strong>Related – Mark Cavendish's transcendent win</strong></em></a></p>\n<p>I was reminded of my first assignment as a cycling journalist, visiting a cyclo-cross team in Flanders. Around the lunch table, the riders referred to their Walloon team-mate as “the foreigner” – not their Czech rider Zdeněk Štybar, but their fellow countryman. Yes, it was done with a smile and a joke. But there was some underlying truth in their jesting.</p>\n<p>Gilbert, the 38-year-old from Verviers in Wallonia, has had his moments in the political headlines over his long and distinguished career, notably causing an unintentional furore back in 2013 when he stated in an interview that flying the Lion of Flanders flag at the World Championships was somehow anti-Belgian. As a symbol of the Flemish separatist movement, the flag has meaning beyond a simple visually-arresting roadside banner.</p>\n<p>The hornet's nest was stirred, Gilbert issued a clarification and promised to avoid making any potentially inflammatory comments of a political nature in future. This is one extremely complex country, seemingly split right down the middle – geographically and politically.</p>\n<p>Which brings us neatly back to unification. Gilbert assured Ned the big Belgian break was very much on the cards for this Tour de France – Flandrians and Walloons united in one glorious throw of the dice to boldly go where no nation has never gone before, leaving their wildcard French neighbours scratching their heads in puzzlement.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1326654937_1024x1024.jpg?v=1625486367\" /></p>\n<p><em>﻿Gilbert: \"Ask Naesen!\"</em></p>\n<p>I asked Gilbert last week which stage and at exactly which kilometre this audacious move might happen. He smiled wryly before answering: “Naesen is the organiser. You have his number, don’t you?”</p>\n<p>Naesen was messaged. No reply, unsurprisingly... So which stage is for you to conject upon, but what a delicious prospect.</p>\n<p>One nation under a groove, and on the attack. Here come the Belgians, again.</p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"176c3defd4a9644f52379c760903be9aa8bf3f30c39847a9ef15dda9d3be27ba","category":"Cycling"}