{"title":"Effect of lipid type on betulin‐stabilized water‐in‐oil Pickering emulsion: emulsion properties, in vitro digestion, and betulin bioaccessibility","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13867?af=R","date":1726060710000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>The Pickering emulsion delivery technique is widely acknowledged for its efficacy in serving as a carrier that can encapsulate functional components effectively. Previous studies have shown significant differences in the stability of Pickering emulsions composed of different oil phases and in the bioaccessibility of the encapsulated functional ingredients. This study therefore investigated the effects of different carrier oils in the betulin self-stabilized water-in-oil (W/O) Pickering emulsion on the stability of the emulsion and bioaccessibility of betulin.</p>\n<h2>Results</h2>\n<p>The results showed that the oil type was one of the main factors affecting the stability of the emulsion. Palm oil and coconut oil provided better storage stability and centrifugal stability due to the high saturated fatty acid content. The bioavailability of betulin correlated significantly with the composition and characteristics of fatty acids in carrier oils. Carrier oils rich in low-saturation long-chain fatty acids tended to release more free fatty acids (FFAs), thus forming larger and more mixed micelles with stronger swelling and dissolution ability, resulting in a relatively high bioaccessibility of betulin. In contrast, the bioaccessibility of betulin in the emulsion prepared by coconut oil (with high saturated fatty acid content) was relatively low (1.17%).</p>\n<h2>Conclusion</h2>\n<p>The results of this study indicate that selecting an appropriate carrier oil is important for the design of self-stabilized W/O Pickering emulsions to improve the bioaccessibility of betulin and other lipophilic bioactivities effectively. © 2024 Society of Chemical Industry.</p>","author":"Shuxian Su, \nYugang Liu, \nHaiyan Li, \nHuiping Xia, \nPeiwang Li, \nSi Qin, \nMeng Shi, \nShiyin Guo, \nChaoxi Zeng","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"1779dd0c5b161180dca551e06ad2406eca38f2d200eae3cb5fb7ee72b43aa8e2","category":"Environment"}