{"title":"Tour de France 2023 stage 12 preview - a day suited to the break","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2023-stage-12-preview","date":1689176877000,"content":"\n      <p><b>Distance: </b>168.8km<br /><b>Start location: </b>Roanne<br /><b>Finish location: </b>Belleville-en-Beaujolais<br /><b>Start time: </b>13:05 CEST<br /><b>Finish time (approx): </b>17:21 CEST</p>\n<p>At the 2019 Critérium du Dauphiné, Roanne was setting for a stage that was, in hindsight, one of the most pivotal moments of a generational changing of the guard in the peloton. It was while completing a recon of the time trial course in the morning that Chris Froome — who at the time was still probably the most feared rider in the peloton, having less than twelve months ago completed victories of all three Grand Tours back-to-back — had he freak crash that brought his time at the top to an abrupt halt; then in the stage itself, a 24-year-old Wout van Aert claimed his first ever WorldTour win. Van Aert has gone from strength to strength since, winning nine <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> stages and the green jersey as well as countless one-day classics, while Froome has never been the same. </p>\n<div></div>\n<p>While the personnel and main protagonists of the Tour change with each generation, some things are always a part of it: one of which is, of course, wine, which is celebrated today as riders travel through the Beaujolais wine-growing region. The peloton will pass through many of the picturesque vineyards where the Gamay grape is grown, which is known for the light-bodied, acidic red wines it creates. Although the many years and patience that’s usually required to wait for a wine to mature usually makes for an apt metaphor about how GC contenders should bide their time riding a Grand Tour, Beaujolais is more famous for its ‘Nouveau’ wine, which is best enjoyed soon after harvesting. The process of Carbonic maceration ferments the juices of the grapes before they have been crushed, meaning that, unlike most wines, it does not benefit from ageing. Every year on the third Thursday of November, ‘Beaujolais Day’ is celebrated to mark the arrival of a new annual batch.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Tappa12.jpg?v=1688382018\" alt /></p>\n<p><i>Stage 12 profile sourced via ASO</i></p>\n<p>Although nestled in between the Massif Central and the Alps, this region known as the ‘monts du beaujolais’ is still very hilly, and much too difficult for the sprinters to be within a shout. With a total of five climbs rated between category two and three, the parcours looks very similar to stage ten, so many of the same riders who featured that day may try and get into the breakaway again here, for what should be another chance to make it to the finish and contest for the stage win.</p>\n<p>Sylvain Chavanel was the victor the last time the Tour visited Roanne in 2008, and his profile as a strong all-rounder with aggressive instincts and tactical acumen is exactly what’ll be needed to win today’s stage. The last two climbs, the Col de la Croix Montmain and Col dele Croix Rosier, are the hardest, so it makes sense not to commit too deeply to an attack beforehand, though the 28km between the summit of the latter and the finish at Belleville-en-Beaujolais means the stronger climbers will still have to make their moves early. </p>\n<h3>Contenders</h3>\n<p><span>With three challenging mountain stages on the horizon, the GC contenders will be looking to give their legs some rest. And with stage 12 appearing to be quite hilly (3,000 metres of climbing), it looks too difficult for the sprinters. As a result, the breakaway riders have a chance to shine and most of them are still in pursuit of their elusive stage win in the Tour. </span></p>\n<p><span>One of the favourites is </span><b>Georg Zimmermann</b><span> (Intermarché-Circus-Wanty). He put </span><span>himself in the spotlight on stage 10 after he placed second behind Pello Bilbao. If he can get in the break once again, he’ll have added fuel to fire knowing he was so close to a stage win a few days ago.</span></p>\n<p><b>Krists Neilands</b><span> (Israel-Premier Tech) also displayed an impressive performance on stage 10, attempting a solo effort on the final climb and descent into Issoire. Unfortunately, he was caught in the last kilometre. After such a remarkable effort, it remains uncertain how well he has recovered for stage 12 and if he will be able to fight for another victory. </span></p>\n<p><b>Julian Alaphilippe </b><span>(Soudal-Quick-Step) has shown good form so far this race, participating in several breakaways during some challenging stages. Despite his relentless efforts, he has yet to achieve a victory. As a punchy rider, a stage like this suits him, but he will need to give his all if he hopes to make it onto the podium.</span></p>\n<p><span>EF Education-EasyPost are spoiled for choice as to who to send in the break. </span><b>Magnus Cort</b><span>, </span><b>Neilson Powless</b><span> (current polka dot jersey wearer) and </span><b>Esteban Chaves</b><span> are all viable choices for the American team. With no GC ambitions, their focus lies on stage wins and the polka dots. They have the spotty jersey at the moment, now can they achieve stage victories too?</span></p>\n<p><b>Wout van Aert</b><span> (Jumbo-Visma) has been diligently working for his team’s GC leader, Jonas Vingegaard. Although he has had opportunities to contend for stage victories, the Belgian has narrowly missed out, finishing second and third places on multiple occasions. Van Aert has triumphed in every Tour he has participated in, except for this one so far. However, with nine stages remaining and the mountains on the horizon, his chances for victory are diminishing. </span></p>\n<p><span>The same goes for</span><b> Mathieu van der Poel </b><span>(Alpecin-Deceuninck). However, he seems content on supporting Jasper Philipsen in his goal of winning as many sprint stages as he can. However, with a course that suits this Classics rider, will he finally take a shot at winning a stage? Van Aert and Van der Poel have a long-standing rivalry, and we have witnessed moments of their competitiveness towards each other so far (most notably Van Aert's questionable attack on stage 10). If both riders go all in, it promises to be an exciting watch. </span></p>\n<p><b>Mattias Skjelmose</b><span> (Lidl-Trek) has slipped quickly down the GC rankings over the past few stages. While he was once inside the top 10 earlier in the race, he has now slipped out of the top 20. However, he has gradually regained some time by working hard in the breakaways. This stage presents another opportunity for him to narrow the gap between himself and the other GC contenders or target a victory himself.</span></p>\n<p><b>Michal Kwiatkowski</b><span> (Ineos Grenadiers), </span><b>Warren Barguil</b><span> (Team Arkéa Samsic),</span><b> Stefan Küng</b><span> (Groupama-FDJ), </span><b>Fred Wright</b><span> (Bahrain-Victorious) and </span><b>Nils Politt </b><span>(Bora-Hansgrohe) will all be riders to watch on stage 12. </span></p>\n<h3>Prediction</h3>\n<p>We think <b>Georg Zimmermann </b>﻿will come out on top from the breakaway, securing the first Grand Tour win for his team this year. </p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"177b07345569c411aed8c81857ded3d251d24c3fd718b60f6a5c52229806b53f","category":"Cycling"}