{"title":"Large‐scale remote sensing analysis reveals an increasing coupling of grassland vitality to atmospheric water demand","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17315?af=R","date":1715238000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/96ad1374-662d-48f8-9678-353611682b51/gcb17315-toc-0001-m.png\" alt=\"Large-scale remote sensing analysis reveals an increasing coupling of grassland vitality to atmospheric water demand\" />\n<p>Grasslands are vulnerable to droughts, rendering their future vitality under climate change uncertain. We quantified the drought sensitivity of Central European grasslands pairing a fine-scale remote sensing dataset with climate re-analysis data. Grassland vitality was most sensitive to atmospheric water demand highlighting the importance of recent compounding drought and heatwaves. The spatial variability of drought sensitivity was linked to different grassland habitat types. Our study provides the first large-scale, long-term, and spatially explicit evidence of increasing drought sensitivities of Central European grasslands.</p>\n<br />\n<h2>Abstract</h2>\n<p>Grasslands provide important ecosystem services to society, including biodiversity, water security, erosion control, and forage production. Grasslands are also vulnerable to droughts, rendering their future vitality under climate change uncertain. Yet, the grassland response to drought is not well understood, especially for heterogeneous Central European grasslands. We here fill this gap by quantifying the spatiotemporal sensitivity of grasslands to drought using a novel remote sensing dataset from Landsat/Sentinel-2 paired with climate re-analysis data. Specifically, we quantified annual grassland vitality at fine spatial scale and national extent (Germany) from 1985 to 2021. We analyzed grassland sensitivity to drought by testing for statistically robust links between grassland vitality and common drought indices. We furthermore explored the spatiotemporal variability of drought sensitivity for 12 grassland habitat types given their different biotic and abiotic features. Grassland vitality maps revealed a large-scale reduction of grassland vitality during past droughts. The unprecedented drought of 2018–2019 stood out as the largest multi-year vitality decline since the mid-1980s. Grassland vitality was consistently coupled to drought (<i>R</i>\n<sup>2</sup> = .09–.22) with Vapor Pressure Deficit explaining vitality best. This suggests that high atmospheric water demand, as observed during recent compounding drought and heatwave events, has major impacts on grassland vitality in Central Europe. We found a significant increase in drought sensitivity over time with highest sensitivities detected in periods of extremely high atmospheric water demand, suggesting that drought impacts on grasslands are becoming more severe with ongoing climate change. The spatial variability of grassland drought sensitivity was linked to different habitat types, with declining sensitivity from dry and mesic to wet habitats. Our study provides the first large-scale, long-term, and spatially explicit evidence of increasing drought sensitivities of Central European grasslands. With rising compound droughts and heatwaves under climate change, large-scale grassland vitality loss, as in 2018–2019, will thus become more likely in the future.</p>","author":"Katja Kowalski, \nCornelius Senf, \nAkpona Okujeni, \nPatrick Hostert","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"178042d75d039268dc20ecfdb0e2d5fa2fa3ee57e69b7825e1de7280597c68e3","category":"Environment"}