{"title":"Visualisation of building life cycle assessment results using 3D business intelligence dashboards","link":"http://link.springer.com/10.1007/s11367-024-02309-7","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <span>\n                      <h3>Purpose</h3>\n                      <p>This study addresses the critical role of Life Cycle Assessment (LCA) visualisations in the building industry, focusing on the development and evaluation of an innovative 3D dashboard approach in Microsoft Power BI for enhanced LCA visualisations in building projects. It emphasises the need for effective communication of LCA results among stakeholders to support sustainable decision-making and reduce CO2 emissions in the construction sector.</p>\n                    </span>\n                    <span>\n                      <h3>Methods</h3>\n                      <p>The research involved defining key goals for LCA visualisation, developing a novel methodology to integrate LCA results with 3D models in an interactive Power BI dashboard and conducting a comparative analysis of traditional and 3D visualisation methods. Two real-world case studies were evaluated, and a survey was conducted among professionals in the architectural and structural engineering fields to assess the effectiveness of the proposed visualisation approach.</p>\n                    </span>\n                    <span>\n                      <h3>Results and discussions</h3>\n                      <p>The findings demonstrate that the 3D dashboard significantly enhances the ability to meet diverse LCA visualisation goals compared to traditional methods. The interactive nature of the dashboard allows for dynamic representation of LCA data, facilitating better understanding and decision-making. The study underscores the importance of tailoring LCA visualisations to the specific requirements of different building projects. User feedback confirmed the new approach’s advantages, particularly in its ability to facilitate informed sustainable decision-making.</p>\n                    </span>\n                    <span>\n                      <h3>Conclusions</h3>\n                      <p>The introduction of interactive 3D dashboards represents a significant advancement in the field of sustainable building design and analysis. This approach not only improves the clarity and comprehensibility of LCA data, but also fosters collective action and systemic change in the construction industry towards more sustainable practices. By setting a new standard in LCA methodologies, this study contributes to the broader goal of reducing CO2 emissions and addressing the climate crisis in the building sector.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"1780b4c04d5e27a8bef04e0bb91a40c3d5776f711445abd7e0c418434553f3ff","category":"Environment"}