{"title":"Range-wide genetic analysis of an endangered bumble bee (Bombus affinis, Hymenoptera: Apidae) reveals population structure, isolation by distance, and low colony abundance","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae041/7639784?rss=1","date":1712102400000,"content":"<span><div>Abstract</div>Declines in bumble bee species range and abundances are documented across multiple continents and have prompted the need for research to aid species recovery and conservation. The rusty patched bumble bee (<span>Bombus affinis</span>) is the first federally listed bumble bee species in North America. We conducted a range-wide population genetics study of <span>B. affinis</span> from across all extant conservation units to inform conservation efforts. To understand the species’ vulnerability and help establish recovery targets, we examined population structure, patterns of genetic diversity, and population differentiation. Additionally, we conducted a site-level analysis of colony abundance to inform prioritizing areas for conservation, translocation, and other recovery actions. We find substantial evidence of population structuring along an east-to-west gradient. Putative populations show evidence of isolation by distance, high inbreeding coefficients, and a range-wide male diploidy rate of ~15%. Our results suggest the Appalachians represent a genetically distinct cluster with high levels of private alleles and substantial differentiation from the rest of the extant range. Site-level analyses suggest low colony abundance estimates for <span>B. affinis</span> compared to similar datasets of stable, co-occurring species. These results lend genetic support to trends from observational studies, suggesting that <span>B. affinis</span> has undergone a recent decline and exhibit substantial spatial structure. The low colony abundances observed here suggest caution in overinterpreting the stability of populations even where <span>B. affinis</span> is reliably detected interannually. These results help delineate informed management units, provide context for the potential risks of translocation programs, and help set clear recovery targets for this and other threatened bumble bee species.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"1784b0895702aa47957685397668bfb6604e80f0f062eb0e84ac84dad8e14b38","category":"Environment"}