{"title":"Analysis of Inclusions and Impurities Present in Typical Hpdc, Stamping and Extrusion Alloys Produced with Different Scrap Levels","link":"https://www.preprints.org/manuscript/202404.0783/v1","date":1712820556000,"content":"The European Green Deal poses a two-pronged challenge for the automotive industry: migrating to solutions based in light structures, requiring light weight concepts and light materials, while at the same time avoiding dependence towards the importation of these advanced materials. \nAluminium alloys are lightweight and cost-effective materials that can successfully cover the requirements of many structural applications, however their production requires from bauxite and other Critical Raw Materials (CRM), such as Si and Mg. Aluminium alloys are fully recyclable, but scrap is usually contaminated and its use is related to an increment of impurities, tramp element and undesired inclusions. Traditionally, the use of secondary alloys has been restricted to low performance applications.  \nThe present work analyses the effect that the use of scrap has in the quantity of inclusions present in the alloy and in other properties relevant for the material processing.  \nThe study was carried out for common alloys belonging to 3 of the most common aluminium processes used in the car manufacturing industry: High Pressure Die Casting (HPDC) (EN AC-43500), extrusion (6063) and sheet metal forming (5754 and 6181). Reference alloy were mixed with different level of scrap (0, 20, 40, 60, 80 and 100%) trying to keep the chemical composition as unaffected as possible. The inclusions level of the alloy was characterized with the Prefil Foot-printer® test. In addition, the obtained materials, after being cast in an open mould, were subjected to metallographic characterization. Relevant properties to assess the formability quality of the alloys for the corresponding transforming process, were obtained: flowability test for HPDC alloy and high temperature compression for extrusion alloys. \nThe results obtained suggest that the number of inclusions present in the melt highly increase with the amount of scrap used to produce the alloy. These inclusions are also related with an important lost of flowability, but do not have a noticeable impact on microstructure.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"178ac51972b35250e257127eaf6e8f3c8ea0a043fa6d1cf745fe47e253579acb","category":"Interdisciplinary"}