{"title":"Neff critical of Ferrand-Prevot’s ‘stupid move’ in Olympic MTB race","link":"https://cyclingtips.com/2021/07/neff-critical-of-ferrand-prevots-stupid-move-in-olympic-mtb-race/","date":1627435325000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033346-043-650x433.jpeg\" /></div><h2>Neff critical of Ferrand-Prevot's 'stupid move' in Olympic MTB race</h2><p>\n</p><p>In Monday’s men’s MTB race at the <a href=\"https://cyclingtips.com/tag/2020-tokyo-olympics\" target=\"_blank\">Tokyo Olympics</a>, the ‘Sakura Drop’ <a href=\"https://cyclingtips.com/2021/07/mathieu-van-der-poel-crashes-out-of-contention-in-olympic-mtb-race/\" target=\"_blank\">ended the medal hopes of Mathieu van der Poel (Netherlands)</a>. A day later, the same course feature very nearly spelled disaster for <a href=\"https://cyclingtips.com/2021/07/jolanda-neff-wins-olympic-mtb-gold-in-all-swiss-podium/\" target=\"_blank\">eventual winner Jolanda Neff (Switzerland)</a>, even after a training ramp was re-installed due to bad weather.</p>\n\n\n\n<p>As Neff explained in her post-race press conference, it wasn’t the drop itself that was the problem, but rather some sudden braking from rival Pauline Ferrand-Prevot (France) on the first lap.</p>\n\n\n\n<p>“She was in front of me and we were going at a good decent speed and then she pulled her brakes super hard and I couldn’t do anything,” Neff said. “I couldn’t brake and I ended up jumping with no speed at all. I was super lucky that I didn’t crash. It was such a stupid move of hers because it’s really dangerous for the people behind.</p>\n\n\n\n<p>“I don’t know if she knew I was right there behind, but after that, I just thought, ‘I have to get away from her,'” Neff continued. “It’s scary because you never know what she’s going to do.</p>\n\n\n\n<p>“It’s not the first time she does something like that, I’m just glad I wasn’t near her anymore. I was glad I was riding on my own and safe.”</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CR1oNwugIGI/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CR1oNwugIGI/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Squadra Mondo (@squadramondo)</a></p></div></blockquote> \n\n\n\n<p>The pair almost tangled later in that opening lap as well, with Neff and Ferrand-Prevot taking different lines on approach to a slippery uphill rock garden. When the pair converged, Ferrand-Prevot was forced to brake, ultimately losing control of her bike which tumbled down the rocks.</p>\n\n\n\n<p>Until that moment the pair had been leading the race. As Ferrand-Prevot struggled to remount and work her way back through the field, Neff rode clear to lead the race on her own.</p>\n\n\n\n<p>“Jolanda Neff went left, I went right,” Ferrand-Prevot said of the incident on the rock garden. “We were going at the same speed and we arrived at the same time. I said to myself, ‘If she doesn’t brake or if I don’t brake, we’ll hit each other,’ so I braked.</p>\n\n\n\n<p>“There were rocks, it was slippery, and I slid off. The title was decided there. Afterwards, I don’t know if I would have beaten her, but in any case, the medal was decided there.”</p>\n\n\n\n<p>Neff went on to a commanding win in a Swiss 1-2-3 while Ferrand-Prevot dropped back to 10th place after reaching second at one point in her chase.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/neff-critical-of-ferrand-prevots-stupid-move-in-olympic-mtb-race/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"178f426cf6b8912d8774d478682c23ee6a5cfdd6e906aa50dd3c105560789f26","category":"Cycling"}