{"title":"Samsung’s iTest web app is like an April Fool’s Day joke that arrived a week late","link":"https://www.macworld.com/article/342929/samsungs-itest-web-app-is-like-an-april-fools-day-joke-that-arrived-a-week-late.html","date":1617990122000,"content":"\n<div>\n<section><div></div></section><p>You won’t find it in the App Store, but if you want to test out Samsung’s One UI 3 OS on your iPhone, there’s a handy way to do it. Why anyone would want to is another question.</p>\n\n\n\n<p>The web app, which was made by Samsung New Zealand, is actually pretty slick and does a good job of replicating a Galaxy phone experience, complete with notifications, themes, and incoming calls. The navigation uses the older bar rather than gestures, though Samsung does ship its phones with gestures turned off by default. </p>\n\n\n\n<p>Tapping on menus and settings tabs doesn’t actually do the thing they’re supposed to do. Rather, they bring up little pop-up cards that explain what they would do on a Samsung phone. There are also fun little Easter eggs, like the Google bar going directly to a Samsung Galaxy S21 search.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/samsung-itest-screens.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Samsung iTest web app shows you would it would be like to use a Galaxy S21 on your iPhone.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>I’m not exactly sure what this is trying to accomplish, however. Like the iPhone, <a href=\"https://www.pcworld.com/article/3608416/samsung-galaxy-s21-ultra-review-all-of-android-for-somewhat-less.html\">Samsung phones are as much about the hardware</a> as the software, with the design, display, and camera driving the experience, as well as the nuances of the respective interfaces. Otherwise, the foundation of Galaxy phones and iPhones are very similar, with apps, icons, and widgets peppering the home screen. I can’t imagine why anyone who uses this would come away with an informed opinion of Samsung’s OS or phones, let alone decide that they want to switch. It feels more like a slick gag app than anything, which is probably why it launched now and not on April 1.</p>\n\n\n\n<p>You can try out the app u<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.itest.nz&amp;xcust=1-1-342929-0-0-0&amp;sref=https://www.macworld.com/feed\">sing this link</a> and downloading the Safari bookmark to your home screen. </p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1794f2b5d0f0327082dabd06c900c5f1b59d60174f184ff55b30e1d9fdcdb60c","category":"Apple"}