{"title":"Ellagic Acid Mitigates Cadmium Exposure-Induced Apoptosis in HT22 Cells via Inhibiting Oxidative Stress, Mitochondrial Dysfunction, and Activating Nrf2/Ho-1 Pathway","link":"https://www.preprints.org/manuscript/202409.0912/v1","date":1726056724000,"content":"Exposure to cadmium sulfate (CdSO4) can lead to neurotoxicity. Nevertheless, the precise molec-ular mechanisms underlying this phenomenon remain unclear, and effective treatment strategies are scarce. This study explored the protective effects of ellagic acid (EA), a natural polyphenolic compound, against CdSO4 exposure-induced neurotoxicity in HT22 cells. Additionally, the inves-tigation sought to elucidate the molecular mechanisms underlying this phenomenon. Our findings demonstrated that exposure of HT22 cells to CdSO4 resulted in apoptosis, which was effectively reversed by EA supplementation. EA supplementation also decreased reactive oxygen species (ROS) and mitochondrial ROS productions, reduced malondialdehyde (MDA) levels, and restored the activities of superoxide dismutase (SOD) and catalase (CAT). Additionally, EA supplementation at 5–20 μM significantly counteracted Cd-induced mitochondrial membrane potential and ATP losses and reduced the ratio of Bax/Bcl-2 and cleaved-caspase-3 protein expression. Furthermore, EA supplementation upregulated Nrf2 and HO-1 protein expression while downregulating the phosphorylation of JNK and p38 proteins. Pharmacological inhibition of JNK partially inhibited CdSO4-induced Nrf2/HO-1 activation and exacerbated its cytotoxicity. In conclusion, our results indicate that EA supplementation provides protection against CdSO4-induced cell apoptosis in HT22 cells by inhibiting oxidative stress and activating the Nrf2 pathway. Activation of the JNK pathway plays a protective role in CdSO4-induced cell apoptosis in HT22 cells.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"179681674484db668eb57b9fdb1ca9abf00098fe202f9e7f582432135e5edef3","category":"Interdisciplinary"}