{"title":"PSIX-30 Interaction between rumen microbiome and host feed efficiency phenotype across contrasting breeds and dietary sources","link":"https://academic.oup.com/jas/article/102/Supplement_3/626/7757513?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Provision of feed accounts for a high proportion of the variable cost in beef production systems, and consequently is a major determinant of overall profitability. Thus, improving the conversion of feed to animal product by identifying and breeding cattle with improved feed efficiency potential provides a method through which feed input costs may be reduced, whilst also contributing to more environmentally sustainable beef production. The rumen microbiome dictates the feed degradation capacity and subsequent nutrient supply in ruminants and is thus potentially impacted by feed efficiency phenotype. However, the relationship between rumen microbiota and host feed efficiency phenotype is yet to be fully elucidated. This is further complicated when contrasting diets, cattle breeds as well as various stages of animal development are considered. The objective of this study was to undertake network analysis on rumen microbiome data generated from two contrasting steer breed types (Charolais and Holstein-Friesian), divergent within-breed for residual feed intake (RFI), and offered contrasting diets during different stages of development: i) high-concentrate during the growing phase; ii) grass silage during the growing phase; iii) zero-grazed grass during the growing phase, and iv) high-concentrate during the finishing phase. From approximately 10 mo of age, Charolais (n = 90) and Holstein-Friesian (n = 77) steers were individually fed each of the aforementioned diets for 70 d, following an adaptation period between each diet. At the end of each dietary phase, RFI was determined for every steer and rumen fluid was sampled using a transesophageal sampling device from the 10 most-efficient (Low-RFI) and the 10 least-efficient (High-RFI) steers within each breed. Rumen fluid samples were then subjected to 16S rRNA sequencing and a network-based systems biology analysis subsequently undertaken using PCIT incorporating the 16S sequencing data and individual RFI values across each breed and dietary phase. A total of 110 microbial taxa were connected (<span>P</span> &lt; 0.05; r &gt; 0.8) to the breed and diet contrasts examined; however, no single microbe was commonly connected to all contrasts. The <span>Pyramidobacter</span> genus was the most represented phylotype, displaying a positive connection with the Charolais steers during the grass silage diet, as well as a negative association with Charolais steers during the first high-concentrate diet and Holstein-Friesian steers during the zero-grazed grass diet. Similarly, of the 35 microbial taxa significantly connected to more than one breed/diet contrast, 12 displayed altered direction of association, indicating a differential relationship between the rumen microbiome and RFI phenotype depending on the prevailing dietary management. Acknowledgement: The animal model used in this study was funded by the Irish Department of Agriculture, Food and the Marine (RSF13/S/519). Kate Keogh received funding for this work from the Research Leaders 2025 program (co-funded by Teagasc and the European Union’s Horizon 2020, Marie Skłodowska-Curie grant agreement number 754380).</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"179f81a8cc3ff3ab499a3eac9c3471b124710bd898af6fb5da5dd472a55c81eb","category":"Environment"}