{"title":"Lipid metabolites index habitat quality for Canvasbacks on stopover areas during spring migration","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duad058/7343314?rss=1","date":1699056000000,"content":"<span><div>Abstract</div>Nutrients acquired by ducks on spring migratory stopover areas influence survival and subsequent reproduction. Accordingly, wetland loss and degradation on stopover areas can lead to reduced refueling efficiency and have demographic consequences. Lipid metabolite concentrations in blood provide a useful index of daily mass change in wild birds and can be used to make inferences about quality of stopover areas for refueling. We experimentally validated a model that uses lipid metabolites to predict daily mass change, and then we used those predictions to make inferences about foraging habitat quality for Canvasbacks (<span>Aythya valisineria</span>) at important stopover sites of the upper Mississippi and Illinois Rivers, USA. We measured plasma lipid metabolites and daily mass change of 60 wild Canvasbacks held in short-term captivity and subjected to feeding and fasting treatments. Respectively, triglyceride and β-hydroxybutyrate concentrations were positively and negatively related to mass change (<span>R</span><sup>2</sup> = 0.58). On average, Canvasbacks collected experimentally across our study area had positive index values indicating sufficient forage resources to allow energy acquisition. However, predicted daily mass increases were greater at more northerly pools of the Mississippi River (Pools 7–8 and 13) compared to more southerly locations (Pool 19 of the Mississippi River and the Illinois River Valley), which was likely due, in part, to more abundant submerged aquatic vegetation at more northerly pools. Our results affirm that lipid metabolites are useful predictors of daily mass change that in turn can provide inferences about habitat quality. Lower daily mass increases of Canvasbacks at Pool 19 are concerning because that area is considered a critically important spring stopover area for migratory diving ducks. Considering the challenges of managing large rivers for multiple uses, targeting restoration of wetlands isolated or isolatable from river systems could provide stopover areas with necessary forage for optimal mass gain.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"17b64b89a0131e3a154f970e01f75daa3bce346995ef6748575f6f7b0f28b98a","category":"Environment"}