{"title":"Infective Endocarditis &ndash; Predictors of In-Hospital Mortality, 17 Years, Single-Center Experience in Bulgaria","link":"https://www.preprints.org/manuscript/202408.2089/v1","date":1724869380000,"content":"Abstract\nBackground: Despite tremendous advances in medicine, infective endocarditis (IE) continues to be a challenge for physicians due to increasing morbidity and unchanged high mortality. Objectives: Our aim was to evaluate clinical outcomes in patients with IE and to identify predictors of in-hospital mortality.\nMaterial and methods: The study was retrospective, single-centered, and included 270 patients diagnosed with IE, for the period 2005-2021 (median age 65 (51–74),  man  177 (65.6%).\n Results: Native IE (NVIE) was found in 180 (66.7%), prosthetic IE (PVIE) in 88 (33.6%) and cardiac device-related IE (CDRIE) in 2 (0.7%), significantly more in the non-survivors group. Healthcare associated IE (HAIE) was 72 (26.7%), the most common pathogen were Staphylococci and the proportion of Gram-negative bacteria (GNB) non-HACEK were significantly higher in non-survivor’s vs survivors (11 (15%) vs 9 (4.5%), p=0.004). Overall, early surgery was performed in 54 (20%) patients, with a significant difference between deceased/alive (3 (4.5%) vs 51 (25.1%, p=0.000). The all-cause in-hospital mortality rate was 24.8% (67). The risk factors identified that increased the risk of death were septic shock (OR – 83 1; 95% CI (17.0-405.2), p=0.000) and acute heart failure (OR –24.6; 95% CI (9.2-65.0), p=0.000). Early surgery (OR – 0.03, 95% CI (0.01-0.16), p=0.000) and low Charlson comorbidity index (OR – 0.85, 95% CI (0.74-0.98, p=0.026) in turn reduce this risk.  Conclusion: We found that acute heart failure and septic shock are independent predictors of in-hospital mortality. Low Charlson comorbidity index and early surgery increased survival. Knowing the predictors of death would change the therapeutic approach to a more aggressive one and improve the near and long-term prognosis of patients with IE.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"17b9ab213310ec6f01d94a2667d8f4ece82a4d8bb4b6e236b65ea740260769f9","category":"Interdisciplinary"}