{"title":"Cloning grass carp (Ctenopharyngodon idella) ccdc3 and its expression affected by nutrition state, insulin, and glucagon","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15614?af=R","date":1710504692000,"content":"<h2>Abstract</h2>\n<p>As an adipokine, coiled-coil domain-containing 3 (CCDC3) plays multiple physiological roles in fatty liver, lipid metabolism, and abdominal obesity. Grass carp was selected as the experimental animal in this study to investigate the roles of Ccdc3 in teleosts. Results showed that the open reading frame (ORF) of cloned <i>ccdc3</i> was 831 bp and encoded 276 amino acids. Three N-glycosylation sites and a predicted coiled-coil domain motif were located in the identified Ccdc3. Moreover, a nuclear localization signal (NLS) was contained in the coiled-coil domain motif of the identified Ccdc3. The results on tissue distribution revealed that <i>ccdc3</i> was highly detected in grass carp fat and brain tissue. In the oral glucose tolerance test (OGTT), the expression of <i>ccdc3</i> increased remarkably in the brain, hypothalamus, and visceral fat in the glucose treatment group. In the fasting and refeeding experiment, the <i>ccdc3</i> expression levels were remarkably reduced in the brain, hypothalamus, and visceral fat after 14 days of fasting. In the refeeding group, the <i>ccdc3</i> expression levels were considerably elevated compared with those in the fasting group. In the induced overfeeding experiment, the <i>ccdc3</i> expression increased remarkably in the hepatopancreas, brain, and visceral fat tissues. The <i>ccdc3</i> expression in the primary hepatocytes was remarkably increased with glucose, oleic acid, and insulin treatment. However, <i>ccdc3</i> expression was markedly decreased with glucagon treatment. In conclusion, these results indicate that Ccdc3 is involved in regulating glucose and lipid metabolism of teleosts.</p>","author":"Guokun Yang, \nBoya Yang, \nSunan Wang, \nXiaomin Liang, \nChengquan Li, \nYanmin Zhang, \nXindang Zhang, \nXulu Chang, \nXiaolin Meng","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"17bb78a230a7b53eb2090543d93bd5101dde6740dababbfeae6e05a034020e76","category":"Environment"}