{"title":"These future Apple products may be hiding in plain sight","link":"https://www.macworld.com/article/344177/what-apples-spring-announcements-tell-us-about-future-products.html","date":1619432100000,"content":"\n<div>\n<section><div></div></section><p>Despite all the intriguing <a href=\"https://www.macworld.com/article/343881/everything-apple-announced-at-its-april-20-spring-loaded-event.html\">new devices</a> that Apple showed off this week, it’s never too early to start musing on what might be next up the company’s sleeves. As ever, you can glean a lot about the direction that Apple is heading in by seeing what kind of things the company focuses on, especially when it’s rolling out new products with new capabilities. Features and technologies that we haven’t seen before can often point at places in which the company has invested significant time and energy—and, in many of those cases, it’s with an eye to more than just a single device. One of Apple’s great strengths, after all, is a “build once, deploy anywhere” mentality that lets them bring the same feature to multiple products.</p>\n\n\n\n<p>With the first event of 2021 behind us, let’s take a look at what the company announced that may indicate what Apple may be working on for the rest of the year and beyond.</p>\n\n\n\n<h2>Big footprints to fill</h2>\n\n\n\n<p>Astronomers observe exoplanets—those outside of our solar system—not by perceiving them directly, but by measuring the effect those planets have on other elements of the universe. In the same way, you can observe the effect of Apple products on the overall ecosystem and make some educated guesses from the negative space—the things Apple <em>didn’t</em> talk about.</p>\n\n\n\n<p>Take the <a href=\"https://www.macworld.com/article/343752/apple-imac-m1-processor-colors-specs-design-display-keyboard-touch-id-camera-price.html\">new 24-inch iMac</a>, for example. Built on the same M1 processor that powers the Apple silicon-based Macs that rolled out last fall, the new iMac ably supplants the aging 21.5-inch iMac at the bottom end of Apple’s all-in-one desktop lineup. But just as with the M1 MacBook Pro models, this is only part of the story. There’s a higher-powered 27-inch Intel iMac that remains part of Apple’s lineup, just waiting for an Apple silicon refresh all its own.</p>\n\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/imac-27-2020.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>The 27-inch Intel-based iMac is still in Apple’s lineup, though probably not for long.</p></figcaption></figure></div><p>Apple</p></div>\n\n\n\n<p>Why not refresh both now? Simply put, because the current state of Apple silicon isn’t the right fit for this larger iMac. But we can not only now make a guess at the design of a larger iMac (here’s hoping it offers the same vibrant colors as the 24-inch, perhaps even with some additional options), but also the features it might offer.</p>\n\n\n\n<p>For example, since those looking for a larger, more powerful iMac will want more power, more memory, and better connectivity, it will require the next stage of Apple silicon evolution to enable those features—the M1 is not cutting it. And just as Apple bumped up the display size from 21.5 inches to 24, while keeping it within the same size footprint, it would hardly be shocking to see the 27-inch jump to a 30-inch display. Make no mistake: whatever replaces the 27-inch iMac is going to blow it out of the water in the same way the 24-inch iMac just did to its predecessor.</p>\n\n\n\n<p>Apple promised a two-year transition to Apple silicon, and we’re still less than a year into that, so hold on to your hats. There’s more to come.</p>\n\n\n\n<h2>Will the HomePod take Center Stage?</h2>\n\n\n\n<p>While the <a href=\"https://www.macworld.com/article/343706/ipad-pro-2021-faq-price-specs-features-release-date.html\">iPad Pro</a> got a solid update in this event, one of the truly new features Apple showed off on its latest tablet is Center Stage. Enabled by the new Ultra Wide front-facing camera, this seemingly pandemic-inspired capability can frame the image it captures so as to center the faces that it detects. To those of us who have chatted with a friend or relative perpetually positioned half off the camera, this will come as a great relief.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/echo-nest-homepod-mini.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>We could see Center Stage on a future HomePod that better competes with products from Amazon and Google.</p></figcaption></figure><p>Amazon/Google/Apple</p></div>\n\n\n\n<p>But it also seems like only the beginning for Center Stage. Recent rumors <a href=\"https://www.macworld.com/article/343053/a-radical-new-apple-tv-is-in-the-works-with-a-homepod-speaker-and-camera.html\">suggested</a> that Apple may be working on a new HomePod device that integrates a camera of its own, designed primarily for video chatting. While some reports suggested that it might contain a robotic arm that moves the camera to follow the subject, à la competing devices from Facebook and Amazon, it seems more likely (and, frankly, more Apple-like) that such a HomePod will use Center Stage instead.</p>\n\n\n\n<p>Likewise, it’s not hard to imagine Center Stage eventually making the jump to Macs as well, especially since it’s a feature available to third-party developers that will surely appeal to makers of other video conferencing apps, like Zoom and Skype.</p>\n\n\n\n<h2>Put it on display</h2>\n\n\n\n<p>As predicted, the new iPad Pro beefs up the existing USB-C port by adding USB4 and Thunderbolt to the mix. But…why? The latter enables connections to high-speed peripherals, which can let users add even faster external storage, but Apple also touted its ability to support external displays—including the company’s own Pro Display XDR.</p>\n\n\n\n<p>Which prompts the question: who exactly is buying a $6,000 monitor to connect to their iPad?</p>\n\n\n\n<p>The very expensive—and very impressive—ProDisplay XDR remains the only external display that Apple makes—otherwise, getting a third-party display for use with your Mac mini, MacBooks, and even as a secondary display for an iMac, remains a matter for third parties. Even though Apple itself creates great displays in many of its products.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macos-catalina-pro-display.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>An Apple display that’s more affordable than the Pro Display XDR could be a top seller.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>In the case of the iPad, the external display story still seems to be untold. How much does Apple consider external display support a core part of the iPad’s functionality? There are a few examples why users might want it, but the current capabilities—display mirroring or support for some video apps—is currently limited.</p>\n\n\n\n<p>No, this hardware feature is crying out for a good set of software features that can take advantage of it. <em>And</em> for a reasonably priced Retina display to go along with it. Who knows, perhaps those two will even arrive in close concert.</p>\n</div>","author":"Dan Moren","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"17c31caf1bd5f824a7ef05c37e7f7dc87afb582bdf477e862368ee2cd7a1d6ab","category":"Apple"}