{"title":"The iPhone 16’s A18 chip will change everything and nothing","link":"https://www.macworld.com/article/2111825/iphone-16-a18-processor-name-a17-pro.html","date":1697799600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>A recent report by supply chain analyst Jeff Pu claims that Apple is likely to use an A18 processor in all of next year’s iPhone 16 models, Pro <em>and</em> regular. At first glance, this would seem to fly in the face of recent trends that suggest the iPhone 16 Pro models will have an A18 Pro and the non-Pro models will get this year’s A17 Pro or a non-Pro version of it, just as they got an A16 this year.</p>\n\n\n\n<p>Don’t get your hopes up. Pu’s prediction is more nuanced than that, and Apple has already telegraphed a change to the way it names and possibly produces A-series processors.</p>\n\n\n\n<h2>An A18 by any other name</h2>\n\n\n\n<p>When Apple introduced the iPhone15 Pro, we took special note of the name change to the A17 processor. Instead of calling it the “A17 Bionic,” it is named “A17 Pro.”</p>\n\n\n\n<p>Naturally, this implies the existence of a <em>non-Pro</em> A17 processor. Perhaps we’ll see one in a future iPad or iPhone SE. Rather, I think Apple’s just setting us up for a future in which every A-series processor comes in two variants: standard and Pro. And Pu’s research seems to agree.</p>\n\n\n\n<p>He estimates that Apple will produce an A18 for the iPhone 16 and 16 Plus, and an A18 Pro for the iPhone 16 Pro and Pro Max. All of these chips are to be built on the second-generation “N3E” 3nm manufacturing process by TSMC. The current process, N3, is somewhat of a “beta” run of the 3nm process with high production costs, while N3E should improve yields and volume, making 3nm chips available to more than just Apple. </p>\n\n\n\n<p>The important thing to note is that, regardless of the exact manufacturing process used, the “A18” in the iPhone 16 and iPhone 16 Pro will not be the same. Just as the M2 and M2 Pro offer totally different performance, so too with the A18 and A18 Pro. </p>\n\n\n\n<p>The difference isn’t likely to be as pronounced. Apple’s not going to make a chip twice as big with twice as many high-performance CPU cores and nearly twice the GPU cores if it still has to fit inside an iPhone. However there <em>could</em> be significant technology differences, or it could be all the same features at different levels of performance.</p>\n\n\n\n<p>Apple could take two routes to make an A18:</p>\n\n\n\n<ol>\n<li>The A18 is essentially the A17 Pro, made on a more robust 3nm manufacturing process.</li>\n\n\n\n<li>The A18 is identical to the A18 Pro, with some CPU or GPU cores disabled and perhaps less RAM.</li>\n</ol>\n\n\n\n<p>Either one is a valid approach, and neither one is novel. The makers of PC graphics cards and CPUs have put a new-generation name on an old-generation product plenty of times over the years.</p>\n\n\n\n<h2>None of this is really important to sell iPhones, anyway</h2>\n\n\n\n<p>It felt a little bit insulting when Apple started splitting processors between new-model iPhones, with only the Pro models getting a new processor while the standard models get last year’s processor. Giving both models an “A18” name is a way for Apple to potentially sell us a last-year’s-tech iPhone with a this-year’s-tech name. </p>\n\n\n\n<p>But really, the world doesn’t care much about this. It’s been several years now of iPhone Pros sporting better performance than the standard models, and most people don’t even know about it. Us enthusiasts pay close attention to Geekbench scores and performance charts, but the overwhelming majority of people who buy a new iPhone just want…a new iPhone. They expect it to run all the apps they love, and take better pictures, and work with their AirPods and maybe MacBook…and if there’s a specification they really care about it’s battery life.</p>\n\n\n\n<p>At the end of the day, splitting the iPhone between standard models and Pro models with better features and performance isn’t new. And whether splits its lineup between processors named A17 Pro and A18 Pro, or an A18 and A18 Pro, is academic. </p>\n\n\n\n<p>This move, if it comes to pass, would be a curiosity but ultimately not a real change in how Apple makes and sells iPhones, and wouldn’t be responsible for the iPhone 16 being great or a disappointment.</p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"17c694c9997daf4fb763d4aa38daa33f7c5f39f51e1ca327c01e93d449f0b64e","category":"Apple"}