{"title":"Observations on Deraniyagala's beaked whale (Mesoplodon hotaula) in the South China Sea based on the first confirmed live sightings","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13178?af=R","date":1725535832000,"content":"<h2>Abstract</h2>\n<p>Deraniyagala's beaked whale, <i>Mesoplodon hotaula</i>, was previously known from eight published strandings and no confirmed live sightings, making it one of the least-known cetaceans. We conducted six cetacean survey cruises in the South China Sea between 2019 and 2023, and during 120 sea-days we recorded 12 sightings of unidentified <i>Mesoplodon</i>. From biopsy samples and acoustic recordings, five sightings were subsequently confirmed as <i>M. hotaula.</i> Using photographs, we provide the first field descriptions and observations of this species. The calf/juvenile has a distinctive facial coloration and dorsal striping pattern that appear to be diagnostic among Indo-Pacific <i>Mesoplodon</i>; among adult males, the dark rostrum of <i>M. hotaula</i> and the distinctively white-tipped beak of ginkgo-toothed beaked whale, <i>M. ginkgodens</i>, distinguish these similar-looking, partially sympatric species. Mean group size was small (3.0, <i>n</i> = 5), with a preference for deep (2,156 m, <i>n</i> = 5), warm (30.3°C, <i>n</i> = 3) water. We update the known distribution of this species, present evidence of fishery interactions, and document the first reported mixed-species <i>Mesoplodon</i> group: a juvenile Blainville's beaked whale <i>M. densirostris</i> associated with four <i>M. hotaula.</i> These sightings identify the South China Sea as a potentially important area for this almost completely unknown species.</p>","author":"Mingming Liu, \nWenzhi Lin, \nBinshuai Liu, \nShenglan Chen, \nMingli Lin, \nLijun Dong, \nHui Kang, \nMingyue Ouyang, \nZixin Yang, \nXiaoyu Huang, \nMassimiliano Rosso, \nL. Todd Pusser, \nJohn Y. Wang, \nRobert L. Pitman, \nSonghai Li","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"17d9d755a8e0b2cc320e57cdc12934b9da5325627ec0f12b585a7b660764b85d","category":"Environment"}