{"title":"Hate broccoli and cauliflower? Your microbiome might be partially to blame","link":"https://arstechnica.com/?p=1809324","date":1635892242000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/cauliflower-DNY59Getty-Images-800x532.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/cauliflower-DNY59Getty-Images.jpg\">Enlarge</a> <span>/</span> Many kids (and adults) don't much like broccoli, cauliflower, Brussels sprouts, and other types of cruciferous vegetables. Taste perception is complicated, but per a new study, our unique oral microbiomes might be one reason why. (credit: DNY59/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>For many people, nothing is less tantalizing than a big plate of steamed cruciferous vegetables at dinner. Yes, it's supposed to be good for us, but that bitter taste is just too overpowering and unpleasant. This is especially true for young children, as any frustrated parent can attest. But an aversion to broccoli, cauliflower, and similar foods is not just people being finicky; <a href=\"http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Search&amp;db=PubMed&amp;term=15723792\">some genetics are at play</a>. And according to <a href=\"http://pubs.acs.org/doi/abs/10.1021/acs.jafc.1c03889\">a recent paper</a> in the Journal of Agricultural and Food Chemistry, a person's <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6503789/\">oral microbiome</a> may also be an important factor.</p>\n<p>In 1931, a chemist named Arthur L. Fox accidentally released the powdered form of phenylthiocarbamide (PTC) in his lab. He didn't notice anything unusual, but his lab mate sensed a bitter taste. Subsequent experiments confirmed that this <a href=\"https://pubmed.ncbi.nlm.nih.gov/16124860/\">variation existed</a> in the broader population and that not being able to taste bitterness was a recessive genetic trait. For instance, about 25 percent of the population can't taste propylthiouracil (PROP), a chemical that is similar to the bitter compounds found in cabbage, raw broccoli, coffee, tonic water, and dark beers. That population is, like Fox, essentially \"taste blind.\"</p>\n<p>There are 25 \"bitterness\" genes known thus far; different bitter foods act through different receptors, and people can be high or low responders for one but not another. Many scientists think that those who can <a href=\"https://academic.oup.com/chemse/article/36/3/311/507040?login=true\">sense bitterness</a> are probably responding to compounds called glucosinolates, present in most cruciferous vegetables, like broccoli, Brussels sprouts, and cauliflower. Those glucosinolates are responsible for much of the nutritional benefits of those veggies, but they also break down into pungent compounds that can negatively trigger many people's bitter taste receptors. (I <a href=\"https://cocktailpartyphysics.com/tasters-choice-why-i-hate-raw-tomatoes-and-you-dont/\">happen to dislike all three</a>, as well as raw tomatoes, and I refuse to feel bad about that.)</p></div><p><a href=\"https://arstechnica.com/?p=1809324#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1809324&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"17dbd9827bd4e0ca87df937065e4cff85c0818899e0350903d567dba97a7d8bb","category":"Tech"}