{"title":"Revealing the dynamics of saffron growth: Optimizing corm size and planting depth for increased yield synergies","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303264","date":1715954400000,"content":"<p>by Ghulam Sarwar, Tauseef Anwar, Huma Qureshi, Muhammad Younus, Muhammad Waqar Hassan, Muhammad Sajid-ur-Rehman, Faizan Khalid, Muhammad Ishaq, Bushra Ahmed Alhammad, Mahmoud F. Seleiman</p>\r\n\r\nSaffron, the \"golden spice\" derived from <i>Crocus sativus</i> L., is renowned for its richness in secondary metabolites such as crocin and safranal, contributing to its unique properties. Facing challenges like decreasing global production, optimizing cultivation techniques becomes imperative for enhanced yields. Although the impact of factors like planting density, planting depth, spacing, and corm size on saffron growth has been studied, the interaction between corm size and planting depth remains underexplored. This study systematically investigates the interactive effects of corm size and planting depth on saffron growth and yield, providing evidence-based guidelines for optimizing cultivation. A factorial experiment, employing a completely randomized design, was conducted to assess the influence of corm size (05-10g, 10.1-15g, 15.1-20g) and planting depth (10cm, 15cm, 20cm) on saffron yield. Uniform-sized corms were obtained, and a suitable soil mixture was prepared for cultivation. Morphological and agronomic parameters were measured, and statistical analyses were performed using ANOVA and Tukey’s HSD test. The study revealed that planting depth significantly affected saffron emergence. The corms sown under 15cm depth showed 100% emergence regardless of corm size (either 05-10g, 10.1-15g, 15.1-20g) followed by 10cm depth corms. Corm dry weight exhibited a complex interaction, where larger corms benefited from deeper planting, while intermediate-sized corms thrived at shallower depths. Similar patterns were observed in shoot fresh weight and dry weight. Specifically, the largest corm size (t3, 15.1-20g) produced the greatest fresh-weight biomass at the deepest planting depth of 20cm (T3), while intermediate-sized corms (t2, 10.1-15g) were superior at the shallowest 10cm depth (T1). The total plant biomass demonstrated that larger corms excelled in deeper planting, while intermediate-sized corms were optimal at moderate depths. This research highlights the intricate interplay between corm size and planting depth in influencing saffron growth. Larger corms generally promote higher biomass, but the interaction with planting depth is crucial. Understanding these dynamics can aid farmers in tailoring cultivation practices for optimal saffron yields. The study emphasizes the need for a coordinated approach to corm selection and depth placement, providing valuable insights for sustainable saffron production and economic growth.","author":"Ghulam Sarwar","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"17dd49fd6cdc822e83e5fa4139f292ee1d3e4c52eded098c6a8a88bc22e5832f","category":"Interdisciplinary"}