{"title":"Stability of hydrous basaltic melts at low water fugacity: evidence for widespread melting at the lithosphere-asthenosphere boundary","link":"http://link.springer.com/10.1007/s00410-024-02177-2","date":1728259200000,"content":"<h3>Abstract</h3>\n                    <p>The upper mantle low velocity zone is often attributed to partial melting at the lithosphere-asthenosphere boundary. This implies that basaltic melts may be stable along plausible geotherms due to the freezing point depression in the presence of water and other incompatible impurities. However, the freezing point depression (<em>ΔT</em>) as a function of water content in the near-solidus basaltic melt (<em>c</em><sub><em>H2O</em></sub>) cannot be precisely determined from peridotite melting experiments because of difficulties in recovering homogeneous basaltic glasses at high pressures. We therefore used an alternative approach to reinvestigate and accurately constrain the <em>ΔT–c</em><sub><em>H2O</em></sub> relationship for basaltic melts at the low water fugacities that are expected in the upper mantle. Internally heated pressure vessel (IHPV) experiments were performed at water-saturated conditions in the anorthite-diopside-H<sub>2</sub>O system at confining pressures of 0.02 to 0.2 GPa and temperatures between 940 and 1450 ℃. We determined the water-saturated solidus, and obtained <em>ΔT</em> by combining our data with reports of dry melting temperatures in the anorthite-diopside system. In another series of experiments, we measured water solubility in haplobasaltic melts and extrapolated <em>c</em><sub><em>H2O</em></sub> to pressures and temperatures of the water-saturated solidus. By combining the results from these two series of experiments, we showed that the effect of water on <em>ΔT</em> was previously underestimated by at least 50 ℃. The new <em>ΔT–c</em><sub><em>H2O</em></sub> relationship was then used to revise predictions of melt distribution in the upper mantle. Hydrous melt is almost certainly stable beneath extensive regions of the oceanic lithosphere, and may be present in younger and water-enriched zones of the subcontinental mantle.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"17de53d6d5ce208a48c8f63960e57a84fdfd8f7f13c8e03a1c8cf7e29ecefc0b","category":"Environment"}