{"title":"Tadej Pogačar loses time – and hope?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/pogacar-loses-time-and-hope","date":1688632291000,"content":"\n      \n<p>UAE Team Emirates was presenting a united front. Tadej Pogačar, their talismanic leader and the two-time <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> winner, had just unexpectedly shipped 1-04 to his arch rival and defending champion Jonas Vingegaard on stage five, and yet despite the hammer blow and the real and significant concern that the Slovenian will not be in contention for a third <em><span>maillot jaune, </span></em>UAE remained unmoved. Nothing to worry about over here was the message.</p>\n<div></div>\n<p>“The last 2km on the last climb for sure [he was on the limit],” Pogačar said, but added that “it’s going to be OK. There’s a long way to go. I feel OK, and that’s the important thing.” Back at his team bus, Adam Yates, who ceded the yellow jersey to the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/jai-hindley-wins-stage-five-and-takes-the-yellow-jersey\">valiant stage winner Jai Hindley</a>, was overheard telling his teammates, “Boys, it doesn’t f**king matter”. Outside the bus, the team’s sports director Andrej Hauptman tried to shrug off the time loss by declaring that “in the end, it’s not so bad, huh,” following that up with “until Paris, there’s still a long way. We need to keep fighting.”</p>\n<p><span>Of course. Absolutely. This was only stage five. There remain 16 stages, tens of thousands of climbing metres and plenty of road to claw back time. The Tour de France is an attritional sporting competition, and its history is littered with examples of riders overturning deficits – ones much bigger than Pogačar’s 1-40 to Hindley and 53 seconds to Vingegaard.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_5325.jpg?v=1688586490\" alt />And yet it’s really hard to shake the feeling that this was not just a bad day in the office, one mountain climb that did not agree with Pogačar, but that in fact, it was an indicator of what is to come and an honest reflection of his condition. Before the race’s start in Bilbao, he continued his talk of downplaying his chances and bigging up Vingegaard’s, saying that while his wrist injury sustained at Liège-Bastogne-Liège was almost fully healed, he still had one broken bone and that he wasn’t 100%. Even after his little digs in the Basque Country that earned him 11 seconds over the Dane, Pogačar was still keen to draw attention to the fact that his wrist was “a bit painful” and it was causing him discomfort.</span></p>\n\n<p><span>It’s not ideal for him and his team, then, that stage six, the second of a Pyrenean doubleheader, is an even tougher affair, with three major climbs, including the Tourmalet, on the menu. The fear among his team, who are understandably trying to sugarcoat a troubling position, must be that Vingegaard and Jumbo-Visma sense blood and will go for the kill. </span></p>\n<p><span>In the days leading up to the Pyrenees, Jumbo were briefing journalists that they weren’t going to attack and that they were going to be conservative. They may have been bluffing, although the probable answer is that was the plan but Vingegaard, like the predator he is, pounced when he sighted his main adversary in trouble. Why wait to attack when your rival is already wounded? </span></p>\n<p><span>The positive for the Slovenian is that if he can make it through stage six relatively unscathed, he has two days to recover before the Puy de Dôme, the next major challenge of the race. </span>But despite his and his team’s reassurances and positive messaging, and even with a reality check that the race is only a quarter of the way through, Pogačar hasn’t looked as vulnerable as this since that fateful day on the Col du Granon last July.</p>\n<p><span>There is, as he says, a long way to go until Paris, but will he even make it there?</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"17df9d7be0d1c38c390e3386219e5c26138606c463a9d1249511fcb3831d14ae","category":"Cycling"}