{"title":"Effects of monensin and cashew nut-shell extract on bacterial community composition in a dual-flow continuous culture system","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txad148/7492778?rss=1","date":1703289600000,"content":"<span><div>Abstract</div>The objective of this study was to evaluate the effects of including monensin and two doses of CNSE in a high producing dairy cow diet on ruminal bacterial communities. A dual-flow continuous culture system was used in a replicated 4 × 4 Latin Square design. A basal diet was formulated to meet the requirements of a cow producing 45 kg of milk per d (17% crude protein and 27% starch). There were four experimental treatments: the basal diet without any feed additive (CON), 2.5 μM monensin (MON), 100 ppm CNSE granule (CNSE100), and 200 ppm CNSE granule (CNSE200). Samples were collected from the fluid and solid effluents at 3, 6, and 9 h after feeding; a composite of all time points was made for each fermenter within their respective fractions. Bacterial community composition was analyzed by sequencing the V4 region of the 16S rRNA gene using the Illumina MiSeq platform. Treatment responses for bacterial community structure were analyzed with the PERMANOVA test run with the R <span>Vegan</span> package. Treatment responses for correlations were analyzed with the CORR procedure of SAS. Orthogonal contrasts were used to test the effects of (1) ADD (CON vs. MON, CNSE100, and CNSE200); (2) MCN (MON vs. CNSE100 and CNSE200); and (3) DOSE (CNSE100 vs. CNSE200). Significance was declared at <span>P </span>≤ 0.05. We observed that the relative abundance of <span>Sharpea</span> (<span>P</span> &lt; 0.01)<span>, Mailhella</span> (<span>P</span> = 0.05)<span>, Ruminococcus</span> (<span>P</span> = 0.03)<span>, Eubacterium</span> (<span>P</span> = 0.01), and <span>Coprococcus</span> (<span>P</span> &lt; 0.01) from the liquid fraction and the relative abundance of <span>Ruminococcus</span> (<span>P</span> = 0.03) and <span>Catonella</span> (<span>P</span> = 0.02) from the solid fraction decreased, while the relative abundance of <span>Syntrophococcus</span> (<span>P</span> = 0.02) increased in response to MON when compared to CNSE treatments. Our results demonstrate that CNSE and monensin have similar effects on the major ruminal bacterial genera, while some differences were observed in some minor genera. Overall, the tested additives would affect the ruminal fermentation in a similar pattern.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"17e6a932b9701380069497a613926209ed67e4d21f20ea5cb587fd39ceee9955","category":"Environment"}