{"title":"Affinity Creative Apps 1.10.3 Update Brings macOS Monterey Support and 'Stunning' Performance Optimizations on New MacBook Pros","link":"https://www.macrumors.com/2021/10/26/serif-affinity-update-monterey-m1-pro-m1-max/","date":1635236881000,"content":"Serif today <a href=\"https://affinity.serif.com/en-us/press/newsroom/affinity-apps-are-ready-to-go-on-apples-new-macos-and-macbook-pro/\">announced</a> updates for its popular suite of <a href=\"https://affinity.serif.com/\">Affinity</a> creative apps that bring official support for macOS Monterey and optimizations for the new M1 Pro and M1 Max chips powering Apple's latest 14-inch and 16-inch MacBook Pros. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/Affinity-apps-on-M1-Max-and-M1-Pro-devices.jpg\" />\r\n<br />\r\nAccording to Ashley Hewson, managing director of Affinity developer Serif, buyers of the latest MacBook Pro with M1 Pro and M1 Max chips will enjoy \"stunning speed improvements\" when using all three apps:\r\n<br />\r\n<blockquote>\"The new GPU represents an industry reflection point—we now have compute performance surpassing nearly all discrete GPU hardware, but retain the key benefits of unified memory. This required us to step back and think again about where performance bottlenecks might be, as it's clear the 'old rules' no longer apply.\r\n<br />\r\n\r\n<br />\r\n\"The results of this work yield a benchmark score of around 30,000 for the M1 Max 32core GPU, absolutely obliterating any other single GPU score we have ever measured. Our changes have also improved performance on the previous M1 chip, which is now roughly 10% faster in our benchmark in version 1.10.3.\"</blockquote><div> <blockquote><p>Especially as the GPU isn’t the only big win here - the “Vector (Multi CPU)” score in the <a href=\"https://twitter.com/hashtag/M1Max?src=hash&amp;ref_src=twsrc%5Etfw\">#M1Max</a> is the highest we have ever measured (for Affinity Designer users), as is the “Combined (Single GPU)” score (for Affinity Publisher, by some margin).</p>— Andy Somerfield (@andysomerfield) <a href=\"https://twitter.com/andysomerfield/status/1452623925368741895?ref_src=twsrc%5Etfw\">October 25, 2021</a></blockquote> </div>\r\n<br />\r\n\r\n<br />\r\nThe new MacBook Pro also features a Liquid Retina XDR display, which completely changes the way photographers can edit images in Affinity Photo, according to Hewson.\r\n<br />\r\n<blockquote>\"The new XDR display is also a game-changer for photographers. We spent most of our time trying to work around the fact that our cameras shoot a few stops more light than can be displayed properly on a standard screen. Displays like the new Liquid Retina XDR can easily display the entire dynamic range captured by dSLRs, so the way you develop RAW changes completely, not just for bracketed merge shots, but for single images. Gone are the days of compressing highlights to recover detail—fundamentally changing the way we use computers to process photographs.\"</blockquote>Lastly, the Affinity apps have also been optimized to deliver smooth rendering at 120fps on the new MacBook Pros, similar to the equivalent Affinity apps on iPad.\r\n<br />\r\n\r\n<br />\r\nThe 1.10.3 update is available across all Affinity apps on macOS today and is free to existing users. All Affinity apps are currently available to purchase individually for $60 each on the <a href=\"https://affinity.serif.com/\">Affinity website</a>, no subscriptions required.<div>Tags: <a href=\"https://www.macrumors.com/guide/affinity-photo/\">Affinity Photo</a>, <a href=\"https://www.macrumors.com/guide/affinity-designer/\">Affinity Designer</a>, <a href=\"https://www.macrumors.com/guide/affinity-publisher/\">Affinity Publisher</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/26/serif-affinity-update-monterey-m1-pro-m1-max/\">Affinity Creative Apps 1.10.3 Update Brings macOS Monterey Support and 'Stunning' Performance Optimizations on New MacBook Pros</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/affinity-creative-apps-1-10-3-update-brings-macos-monterey-support-and-stunning-performance-optimizations-on-new-macbook-pros.2319422/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=eeCSGzWsqK8:WhdBBMdiKbU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=eeCSGzWsqK8:WhdBBMdiKbU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/eeCSGzWsqK8\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"180d9d895a32b1bf9bb5e24484e50c4ed5b586dc3d7242f221221065e23cc436","category":"Apple"}