{"title":"★ Volkswagen CEO Herbert Diess on Apple’s Purported Interest in Making Cars","link":"https://daringfireball.net/2021/02/volkswagen_ceo_apple_car","date":1613526834000,"content":"\n<p>Reuters: “<a href=\"https://finance.yahoo.com/news/volkswagen-ceo-diess-not-afraid-150200219.html\">Volkswagen CEO Diess ‘Not Afraid’ of an Apple Electric Car</a>”:</p>\n\n<blockquote>\n  <p>Germany’s Volkswagen is not concerned by any Apple plans for a\npassenger vehicle that could include the iPhone maker’s battery\ntechnology, its chief executive Herbert Diess said. […]</p>\n\n<p>“The car industry is not a typical tech-sector that you could take\nover at a single stroke,” Diess was quoted as saying an interview\nwith Frankfurter Allgemeine Sonntagszeitung. “Apple will not\nmanage that overnight,” he added.</p>\n\n<p>While Apple’s plans are not public, Diess said its intentions as\nsuch were “logical” because the company had expertise in\nbatteries, software and design, and that it had deep pockets to\nbuild on these competencies.</p>\n\n<p>“Still, we are not afraid,” he said.</p>\n</blockquote>\n\n<p>I’d like to think that no one has made more hay over Ed Colligan’s infamous <a href=\"https://daringfireball.net/2006/11/colligan_head_stuck\" title=\"Daring Fireball: Palm CEO Ed Colligan’s Head Seems to be Stuck Somewhere\">“PC guys are not going to just figure this out. They’re not going to just walk in” quote</a> — just a few weeks before the unveiling of the iPhone — than yours truly. So I feel like I’m in a position to declare that these remarks by Herbert Diessan are not an Ed Colligan moment. Ed Colligan, as the CEO of Palm, should have known that in 2006, the future of phones was <a href=\"https://daringfireball.net/2008/05/blackberry_vs_iphone\" title=\"Daring Fireball: BlackBerry vs. iPhone\">gadget-like computers, not the computer-like gadgets</a> the industry (including Palm) had been making until then. The iPod proved that Apple was the best designer and maker of gadget-like computers in the world. (They’ve only increased their lead in the intervening years.) Colligan should have been fearful of an Apple phone — <em>any</em> Apple phone, even an iPod phone, let alone the pocket-sized Unix computer with a gorgeous touchscreen interface they actually managed to make.</p>\n\n<p>Apple hasn’t shown anything that suggests they’ll be good at designing and producing cars. The dashboard interface? Sure. But the <em>car</em> part of the car? Nothing Apple has ever done is like that. I’m not betting against them, but I don’t think Diess’s remarks are the least bit clueless. </p>\n\n<p>I mean, what do you want him to say? That Volkswagen executives are soiling their lederhosen at the thought that Apple might enter the car market? That they’ll just pack up their bags and call it quits if Apple does?</p>\n\n<p>I would have suggested adding something along the lines of “I welcome Apple as a competitor, and I’m sure they’ll bring some interesting new ideas to the market.” Like coaches of sports teams, who inevitably talk their next opponent <em>up</em>, not down. “<em>They’re a tough team with some really talented players</em>”, says every coach playing the hapless New York Jets the next week.</p>\n\n<p>The part of Diess’s remarks that jumps out at me isn’t the “We are not afraid” bit, but the “take over at a single stroke” bit. No market gets taken over overnight. The iPod spent its first two years as a Mac-only peripheral with a FireWire port. The iPhone <a href=\"http://www.asymco.com/2010/10/21/turning-up-the-volume-iphone-overtakes-ipod/\">took three years</a> just to overtake the iPod in sales. In 2011, four years after launching, Business Insider’s Henry Blodget declared the iPhone “<a href=\"https://daringfireball.net/linked/2011/04/26/blodget\">dead in the water</a>”. <a href=\"https://daringfireball.net/linked/2015/01/27/iphone-claim-chowder\">Even as late as 2013</a>, the consensus on Wall Street was that Samsung was going to eat Apple’s lunch in the phone market. (That was the year of Phil Schiller’s “Can’t innovate any more, my ass” remark at WWDC.)</p>\n\n<p>Then there’s Apple Watch. Circa 2017, there were plenty of articles like this one by Mike Murphy at Quartz: “<a href=\"https://daringfireball.net/2017/04/apple_watch_success\">Two Years After Its Launch, the Apple Watch Hasn’t Made a Difference at Apple</a>”.</p>\n\n<p>Even if Apple indeed enters the car market, <em>and</em> its cars prove to be so stunningly innovative and popular as to do to the car market what they did to the phone market — a hypothetical best-case scenario — it will take many years. Probably more years than the phone, because people hold onto their cars longer than they do their cell phones. That’s the best case scenario. There are a lot of less-than-best-but-still-good scenarios for a hypothetical Apple car where it takes even longer to declare it a success. Or where Apple winds up with a hugely successful business, but never redefines the industry.</p>\n\n<p>There is no such thing as a “typical tech-sector that you could take over at a single stroke”. That Diess seems to think that’s how <em>any</em> of the markets where Apple currently competes work — that’s the thing that would worry me if I were at Volkswagen.</p>\n\n<p><strong>Postscript:</strong> <a href=\"https://twitter.com/robert_cassidy/status/1361057209568817152\">This tweet from Robert Cassidy</a> sums it up perfectly:</p>\n\n<blockquote>\n  <p>Apple doesn’t do overnight. They walk into your market, and a few\nyears in you realize they’ve quietly redefined your market and now\nyou’re years behind.</p>\n</blockquote>\n\n<p>Apple enters the market and <a href=\"https://www.youtube.com/watch?v=qycUOENFIBs\">all the established entrants see</a> is how Apple’s new product doesn’t measure up to the market’s current definition. </p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"181f97374609e33325532e473ee8f6c42049296cc32db98db4ff4437c1e76e95","category":"Tech"}