{"title":"43 Evaluating the effects of HiPhorius phytase added in diets at or below the P requirement on nursery pig growth performance and bone mineralization","link":"https://academic.oup.com/jas/article/102/Supplement_2/83/7664898?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>A total of 297 pigs (DNA 241 × 600; initial body weight = 8.64 ± 0.181 kg) were used in a 21-d trial to evaluate the effects of HiPhorius phytase (dm-firmenich, Parsippany, NJ) on pig growth performance and bone mineralization. All pigs were fed P depletion diets (0.09% aP) for a 3-d period before the start of the study (d 14 after weaning). Pens of pigs were then assigned to 1 of 5 treatments in a randomized complete block design with 5 pigs per pen and 12 replications per treatment. The first three diets were formulated to contain 0.09% aP; without added phytase (control), or control with 600 or 1,000 FYT/kg of added phytase (considering a release of 0.15 or 0.18% aP, respectively). The remaining two diets were formulated to contain 0.27% aP, one without added phytase and the other with 1,000 FYT/kg. One pig per pen was euthanized on d 21 and the right fibula, 10th rib, and metacarpal were collected to determine bone density, bone ash, and bone Ca and P. From d 0 to 21, increasing phytase in diets containing 0.09% aP increased (linear, <span>P</span> ≤ 0.002) average daily gain (ADG), average daily feed intake (ADFI), and gain to feed ratio (G:F) and increased percentage bone ash in metacarpals and 10<sup>th</sup> ribs (linear, <span>P</span> &lt; 0.001; quadratic, <span>P</span> = 0.004, respectively), and increased grams of Ca and P in all three bones (linear, <span>P</span> ≤ 0.027; Table). Adding 1,000 FYT/kg in diets with 0.27% aP did not impact growth performance, but increased percentage bone ash (<span>P</span> ≤ 0.038) in all bones and grams of Ca and P in fibulas and 10<sup>th</sup> ribs (<span>P</span> ≤ 0.023) compared with pigs fed 0.27% aP without added phytase. Increasing aP from 0.09% to 0.27% in diets without added phytase increased (<span>P</span> &lt; 0.001) ADG, ADFI, and G:F and increased bone density (<span>P</span> ≤ 0.002) in fibulas and metacarpals, percentage bone ash in all bones (<span>P</span> ≤ 0.074), and increased (<span>P</span> &lt; 0.05) grams of Ca and P in fibulas and 10<sup>th</sup> ribs. Increasing aP from 0.09 to 0.27% aP in diets with 1,000 FYT added phytase increased bone density (<span>P</span> ≤ 0.008) in fibulas and metacarpals, percentage bone ash in all bones (<span>P</span> ≤ 0.002), and grams of Ca and P in fibulas and 10<sup>th</sup> ribs (<span>P</span> &lt; 0.05). For growth performance (average of ADG and G:F), aP release was calculated to be 0.170% for 600 FYT/kg and 0.206% for 1,000 FYT/kg. For the average of all 3 bone measurements (average of 3 bones for bone density and percentage bone ash), aP release was calculated to be 0.120% and 0.125% for 600 and 1,000 FYT/kg, respectively.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"18240ebf788186c950be223dbc4acb3ca80146172f612345a92cbd1239de2269","category":"Environment"}