{"title":"Prior Appendicectomy and Gut Microbiota Reestablishment in Adults After Bowel Preparation and Colonoscopy","link":"https://www.preprints.org/manuscript/202404.0776/v1","date":1712823020000,"content":"Emerging evidence suggests that the human vermiform appendix is not a vestigial organ, but rather an immunological organ of biological relevance. It is hypothesised that the appendix acts as a bacterial ‘safe house’ for commensal gut bacteria and facilitates re-inoculation of the colon after disruption through the release of biofilms. To date, no studies have attempted to explore this potential mechanistic function of the appendix. We conducted a pre-post intervention study in adults (n=59) exploring reestablishment of the gut microbiota in those with and without an appendix after colonic disruption via bowel preparation and colonoscopy. Gut microbiota composition was measured one week before and one month after bowel preparation and colonoscopy using 16S rRNA sequencing. We observed between group differences in gut microbiota composition between those with (n=45) and without (n=13) an appendix at baseline. These differences were no longer evident one-month post-procedure, suggesting that this procedure may have ‘reset’ any potential appendix-related differences between groups. Both groups experienced reductions in gut microbiota richness and shifts in beta diversity post-procedure, with greater changes in those without an appendix, and there were five bacterial genera whose re-establishment post-procedure appeared to be moderated by appendicectomy status. This small experimental study provides preliminary evidence of a potential differential reestablishment of the gut microbiota after disruption in those with and without an appendix, warranting further investigation into the potential role of the appendix as a microbial safe house.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"182dd3cc94246c38922aa2f9683bc8443a0b19a584808deb3f3baf39bec2727c","category":"Interdisciplinary"}