{"title":"Influenza virus shedding and symptoms: Dynamics and implications from a multiseason household transmission study","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae338/7738343?rss=1","date":1724198400000,"content":"<span><div>Abstract</div>Isolation of symptomatic infectious persons can reduce influenza transmission. However, virus shedding that occurs without symptoms will be unaffected by such measures. Identifying effective isolation strategies for influenza requires understanding the interplay between individual virus shedding and symptom presentation. From 2017 to 2020, we conducted a case-ascertained household transmission study using influenza real-time RT-qPCR testing of nasal swabs and daily symptom diary reporting for up to 7 days after enrolment (≤14 days after index onset). We assumed real-time RT-qPCR cycle threshold (Ct) values were indicators of quantitative virus shedding and used symptom diaries to create a score that tracked influenza-like illness (ILI) symptoms (fever, cough, or sore throat). We fit phenomenological nonlinear mixed-effects models stratified by age and vaccination status and estimated two quantities influencing isolation effectiveness: shedding before symptom onset and shedding that might occur once isolation ends. We considered different isolation end points (including 24 h after fever resolution or 5 days after symptom onset) and assumptions about the infectiousness of Ct shedding trajectories. Of the 116 household contacts with ≥2 positive tests for longitudinal analyses, 105 (91%) experienced ≥1 ILI symptom. On average, children &lt;5 years experienced greater peak shedding, longer durations of shedding, and elevated ILI symptom scores compared with other age groups. Most individuals (63/105) shed &lt;10% of their total shed virus before symptom onset, and shedding after isolation varied substantially across individuals, isolation end points, and infectiousness assumptions. Our results can inform strategies to reduce transmission from symptomatic individuals infected with influenza.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"182d21b061e0251dde7b36d5d927b489af5e3a3a7d9628cc1731c59b5e8908a2","category":"Interdisciplinary"}