{"title":"236 Increased dietary protein supports key metabolic and intestinal tissue functions in weaned pigs, without increasing gastrointestinal pathogen abundance","link":"https://academic.oup.com/jas/article/102/Supplement_3/239/7757471?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>A common dietary strategy to prevent diarrhea in weaned pigs is feeding low protein diets in the period immediately following weaning. The goal of this intervention is to decrease dietary protein sufficiently to reduce pathogen proliferation and protein fermentation without negatively impacting growth performance. One potential alternative to low protein diets is provision of dietary fiber. However, many studies examining the role of protein and fiber on gastrointestinal microbiota and post-weaning diarrhea are complicated by the presence of other substrates, including polyphenols and antinutritional factors in complex ingredients. To assess the role of increased protein and fiber on gut microbiota and host metabolism, semi-purified diets differing in crude protein (CP) and crude fiber (CF) were fed to weaned pigs (n = 40; 28 d of age). Diets with high protein (HP; CP 24.3%, CF 6.4%), high fiber (HF; CP 18.9%, CF 9.4%), or both (HFHP; CP 24.9%, CF 9.5%) were compared with a control (CON; CP 18.1%, CF 6.3%) diet with industry standard crude protein and fiber levels (n = 10/group). Growth performance and diarrhea prevalence were measured alongside gut microbiota composition and metabolites. Pigs fed the HP and HFHP diets had significantly improved feed efficiency compared with both CON and HF diets. Increased protein fermentation, measured through production of biogenic amines, was observed in HP fed animals (<span>P</span> &lt; 0.001). These effects were mitigated by addition of fiber in the HFHP fed pigs. Despite increased markers of protein fermentation, post-weaning diarrhea incidence was not greater in HP fed animals and no increases in gastrointestinal pathogen abundance were detected. Metabolomic and transcriptomic analyses identified critical alterations in host metabolism and cecal transcriptome in the CON compared with the HP fed animals. While all diets were formulated to meet the dietary requirements of weaned pigs, diets with lower protein levels (CON and HF) induced alteration in transcripts from the serine synthesis pathways (<span>P</span> &lt; 0.001) and integrated stress response (<span>P</span> &lt; 0.001) in cecal tissue alongside increases in metabolic pathways related to lysine degradation (<span>P</span> = 0.005). These results challenge the current practice of low protein feeding following weaning by demonstrating a detrimental effect of low protein diets on intestinal cell function and muscle accretion. This suggests that with careful ingredient selection, increased dietary protein post-weaning could better support pig health and performance compared with current industry standard diets.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1830c7402c1c76685a5fe01bec4527295b7277f1868285c096f7d42100ef02ed","category":"Environment"}