{"title":"Serial Mediation Models of Future Anxiety and Italian Young Adults Psychological Distress: The Role of Intolerance of Uncertainty and Non-Pathological Worry","link":"https://www.preprints.org/manuscript/202405.0950/v1","date":1715684966000,"content":"Previous research has already examined the relationship between Future Anxiety, a construct recently introduced in Italy, and mental health in young adults, although possible mediating variables in this relationship have so far never been investigated. The present study attempts to fill this gap by exploring the incidence of Future Anxiety on psychological distress in a group of 302 young Italian adults (18 - 30 years; M = 21.9; SD = 2.6), presenting and evaluating the simultaneous mediating effect of Intolerance of Uncertainty and Non-Pathological Worry.Findings highlighted how Future Anxiety had a positive and significant direct effect on Stress and Depression, but not on Anxiety. In the three serial mediation models proposed, Intolerance of Uncertainty and Non-Pathological Worry mediated the relationship between Future Anxiety and mental health outcomes. The results also confirmed the hypothesized serial mediation effect by highlighting how young adults with greater Future Anxiety experienced more Intolerance of Uncertainty, which positively affected Non-Pathological Worry levels and, in turn, exacerbated psychological distress. Finally, results indicated that female participants experienced more Stress, Anxiety, and Depression in relation to Future Anxiety compared to males. Starting from the review of main references on this subject, the results discussed provide new insights for understanding youth psychological distress. Finally, practical implications for the design of supportive interventions for this study’s target group are proposed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"183372a38063be953c4b0e878a0ecd996c372e25047bfe7d168817885d6a1503","category":"Interdisciplinary"}