{"title":"Ecology of the Tibetan Antelope (Panthalops Hodgsonii) and Sympatric Ungulate Populations in a Cold Himalayan Desert","link":"https://www.preprints.org/manuscript/202408.0241/v1","date":1722838925000,"content":"Sympatric mountain ungulates experience population fluctuations due to intra and inter-specific competition and climate variations. In this comprehensive three-year study (2012-2015), we investigated the population dynamics, spatial distribution, and habitat use of Tibetan Antelope (Chiru) (Panthalops hodgsonii) in relation to four other sympatric ungulates (Argali Ovis ammon, Wild Yak Bos mutus, Tibetan Wild Ass Equus kiang, and Greater Bharal Pseudois nayaur) in the cold arid Changchenmo Valley of Ladakh, India. We conducted 162 intensive surveys covering 918.60 km, we recorded 215 animal sightings, encompassing 1670 Chiru individuals, exclusively males. Chiru exhibited encounter rate of 1.19±1.17 S.D individuals/km walked and 1.53±1.37 S.D. individuals/hr and a typical group sizes of 13.69. Our findings suggest spatio-temporal resource partitioning through habitat selection which favour species coexistence under harsh climatic conditions. While resource sharing occurred during summer, competition was observed during peak winters and springs. Noteworthy in our study was the coexistence of Chiru and Tibetan Wild Ass in shared habitats, indicating facilitation rather than interspecific competition. However, significant habitat segregation was observed between Chiru and other ungulates, highlighting distinct ecological preferences. The study reports a stable Chiru population and reveals a novel phenomenon of some individuals remaining in the area during winters, a behavior not previously documented. The overlap of all species in limited winter habitats poses a potential threat to Chiru survival. Additional threats include climate change, infrastructure development, armed conflict, and livestock competition. Special management efforts, including awareness programs for armed forces and stringent development regulations, are crucial. Our findings provide critical insights into complex species interactions and habitat preferences, forming an essential foundation for the conservation and management of Chiru and other Tibetan ungulates in the Trans-Himalayan landscapes affected by climate change.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1847464429c18432a70644e72d3633de146c0ff3768f5431be1d232c76ad95c8","category":"Interdisciplinary"}