{"title":"If this is the electric Volvo of 2026, the future might not be all bad","link":"https://arstechnica.com/?p=1777482","date":1625140237000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/283690_Volvo_Concept_Recharge-980x550.jpg\" /></div>\n        <p>\n          This is the Volvo Concept Recharge, and it should give you a pretty good impression of the big electric SUV that will replace the XC90 in about four or five years.                  </p>\n        </div>\n      </li>\n      </ul><p>When Volvo replaces its XC90 SUV next year, it will do so using a new platform, called SPA2, that includes the option of a battery-electric version. As a smaller automaker, Volvo has to use its resources wisely, which has meant designing vehicles with that kind of flexibility in mind. But not for much longer. Just as SPA2 ushers in a new range of larger battery EVs for the Swedish company, <a href=\"https://arstechnica.com/cars/2017/07/volvo-says-from-2019-all-new-models-it-introduces-will-be-electric-or-hybrid/\">Volvo will move on from the internal combustion engine</a> around the middle of the decade.</p>\n<p>Volvo is already at work on what comes next, and on Wednesday it gave us a glimpse into that future with the Concept Recharge. Think of it as the next-but-one XC90, Volvo's idea for what a large, luxurious EV should be in 2025 or 2026.</p>\n<p>The bulky part of an electric powertrain is the battery pack, so there's a long wheelbase with short front and rear overhangs. The pack is entirely structural, with cells sandwiched between two sheets of metal. The battery pack, then, is the floor of the monocoque chassis, reducing the EV's overall weight and therefore improving range efficiency. By 2030, Volvo and its partner Northvolt plan to produce 70 GWh of batteries annually, and Volvo says that by then, it hopes to have increased energy density past 1 kWh/L.</p></div><p><a href=\"https://arstechnica.com/?p=1777482#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1777482&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"184ca69ee32f6ea283908e70e7d45bd97b13ce09630faaa6f4e2681e806fb6ee","category":"Tech"}