{"title":"Gill disorders in fish: Lessons from poxvirus infections","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12835?af=R","date":1702540257000,"content":"<h2>Abstract</h2>\n<p>Gill disorders are responsible for substantial losses in the aquaculture industry. This is because gills are delicate and anatomically complex tissues, responsible for maintaining homeostasis in fish by being involved in many important physiological processes. Pathogens that infect gills, together with chemical irritants can modify the function of this organ and seriously affect fish health often leading to mass mortality. Since many fish pathogens affect not only gills, but also other organs, the impact of gill disorders alone on disruption of fish homeostasis is difficult to determine. There are, however, fish poxviruses that have a high affinity for the gills: carp edema virus (CEV), salmon gill poxvirus (SGPV) and <i>Plecoglossus altivelis</i> poxvirus (PaPV). These poxviruses could therefore help in defining the principal characteristics of gill disorders. Thus, the present study reviews the effects of gill disorders caused by CEV, SGPV and PaPV on fish health. CEV and SGPV infect fish species that are very important for global aquaculture: common carp (<i>Cyprinus carpio</i>) and Atlantic salmon (<i>Salmo salar</i>), and induce gill pathology that has a very negative impact on respiratory and osmoregulatory functions, nitrogenous waste excretion and energy metabolism. Furthermore, we highlight that a disruption of these metabolic processes increases stress response and results in immunosuppression, exposing fish to secondary infections. Finally, this review emphasises the importance of maintaining gill health for fish in order to perform well in aquaculture settings as well as underlining that gill health should be focused on in fish farming.</p>","author":"Maria Zawisza, \nMagdalena Chadzinska, \nDieter Steinhagen, \nKrzysztof Rakus, \nMikołaj Adamek","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"1852c9a18992d89c66e2e9b06e600906e59975a729aea2c25e0c836349ec2b96","category":"Environment"}