{"title":"Wild lions in small, fenced reserves in South Africa conform to a meta‐population","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12341?af=R","date":1720751413000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/087cfd91-ee41-40f0-9700-6b37d407ce7a/eso312341-toc-0001-m.png\" alt=\"Wild lions in small, fenced reserves in South Africa conform to a meta-population\" />\n<p>Wild lions in small reserves in South Africa function as a managed meta-population and is effective. Currently this is through ad hoc movements facilitated by the Lion Management Forum of South Africa. Incentives and coordination should be explored to ensure the continued success of this meta-population.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLions (<i>Panthera leo</i>) are declining across their range, mainly due to human-induced habitat fragmentation and prey depletion. However, the South African lion population continues to grow. Unlike other range states, South Africa actively manages wild lions across a continuum of landscapes and ecological constraints. Many of these lions are in small, fenced reserves where managers seek to mimic ecological processes in small landscapes. However, the effectiveness of this management approach has not been evaluated against meta-population criteria.\n\nGiven that meta-population dynamics allows species living in fragmented habitats to persist, we evaluated how South Africa's lion population complies with meta-population criteria using national audit data between 2010 and 2019 from 49 fenced, wild lion reserves.\n\nThe small, fenced reserves holding wild lions fulfil the criteria for meta-population functionality. However, this functionality was achieved through haphazard and uncoordinated management actions and not through a coordinated approach.\n\nOur main recommendation is to consider implementing a more coordinated meta-population management approach. At the very least, meta-population management guidelines should be reviewed and updated on a regular basis, regular audits should be conducted and periodic genetic evaluation of the meta-population (every 10 years) should be instituted. We recommend incentivising lion managers to enhance the conservation of lions in South Africa within a meta-population framework. We also recommend a focus on improving decision making and policy procedures that facilitates compliance with relevant legislation aimed at achieving high levels of lion conservation-governance efficiency.\n\nSouth Africa's meta-population approach to wild lion management in small, fenced reserves is effective at conserving lions and contributing to lion conservation more broadly. In an increasingly fragmented landscape, the need for human management actions to ensure persistence of large carnivores is likely to increase. A managed meta-population approach of fenced (or unfenced, but geographically isolated) populations is a useful tool for conservationists to consider worldwide.\n</p>","author":"Jeanetta Selier, \nSusan M. Miller, \nBrent Coverdale, \nSam Ferreira, \nJohan Kruger, \nDan M. Parker","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"186b8175227e3e272eb7d8dc1f3b5b8318732ced4bfeef36522971e639fb1394","category":"Environment"}