{"title":"Management of chronic non-cancer pain by primary care physicians: A qualitative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307701","date":1722002400000,"content":"<p>by Léa Rufener, Christina Akre, Pierre-Yves Rodondi, Julie Dubois</p>\r\n\r\nChronic non-cancer pain is a highly prevalent health issue with personal and societal consequences. Patients suffering from chronic non-cancer pain are mainly cared for by primary care physicians, but research shows that the latter perceive treating chronic pain as difficult. This qualitative descriptive study aimed to explore how primary care physicians in Switzerland manage patients with chronic non-cancer pain and what factors influence patient management. Data were collected through semi-structured interviews amongst primary care physicians in the German speaking part of Switzerland. A thematic analysis of the interviews allowed to identify four main themes: Investigation of chronic pain; patient-provider relationship; patient characteristics, and medical recommendations. These themes were closely interconnected and influenced each other. Physicians not only enquired about the origin of pain but also about the patients’ beliefs and expectations towards it. They stressed the role of communication in fostering a good patient-physician relationship and to help patients cope with their pain. In addition to purely medical considerations, the psychological, social and economic situation of their patients and their possible impacts on the management of chronic non-cancer pain played a crucial role when recommending a treatment. This study highlighted the complexity of chronic pain management, which entails that primary care physicians need to figure out a unique strategy for each patient. By integrating patients’ values and beliefs, as well as socioeconomic aspects, primary care physicians are in a position to take the lead in chronic non-cancer pain management. However, considering the burden of this disease, more continuous medical education on chronic pain is needed for primary care physicians, especially to better take into account the social determinants of pain.","author":"Léa Rufener","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"186ffc8b99bc2d7444e057a0bcf42d7ad2d8d90437f3b08b3e903869b8eacae6","category":"Interdisciplinary"}