{"title":"Distribution of pathogens and risk factors for post-replantation wound infection in patients with traumatic major limb mutilation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301353","date":1711980000000,"content":"<p>by Chang Gao, Haiyan Wang, Jihui Ju, Keran Zhang, Ye Gao, Shiqi Guo, Di Yin, Ruixing Hou, Qiang Guo</p>\r\nPurpose <p>Even though replantation of limb mutilation is increasing, postoperative wound infection can result in increasing the financial and psychological burden of patients. Here, we sought to explore the distribution of pathogens and identify risk factors for postoperative wound infection to help early identification and managements of high-risk patients.</p> Methods <p>Adult inpatients with severed traumatic major limb mutilation who underwent replantation from Suzhou Ruixing Medical Group between November 09, 2014, and September 6, 2022 were included in this retrospective study. Demographic, and clinical characteristics, treatments, and outcomes were collected. Data were used to analyze risk factors for postoperative wound infection.</p> Results <p>Among the 249 patients, 185 (74.3%) were males, the median age was 47.0 years old. Postoperative wound infection in 74 (29.7%) patients, of whom 51 (20.5%) had infection with multi-drug resistant bacteria. Ischemia time (OR 1.31, 95% CI 1.13–1.53, P = 0.001), wound contamination (OR 6.01, 95% CI 2.38–15.19, P &lt;0.001), and stress hyperglycemia (OR 23.37, 95% CI 2.30–236.93, P = 0.008) were independent risk factors, while the albumin level after surgery (OR 0.94, 95% CI 0.89–0.99, P = 0.031) was significant associated with the decrease of postoperative wound infection. Ischemia time (OR 1.21, 95% CI 1.05–1.40, P = 0.010), wound contamination (OR 8.63, 95% CI 2.91–25.57, P &lt;0.001), and MESS (OR 1.32, 95% CI 1.02–1.71, P = 0.037 were independent risk factors for multi-drug resistant bacteria infection.</p> Conclusions <p>Post-replantation wound infection was common in patients with severe traumatic major limb mutilation, and most were multi-drug resistant bacteria. Ischemia time and wound contamination were associated with the increase of postoperative wound infection, including caused by multi-drug resistant. Positive correction of hypoproteinemia and control of stress hyperglycemia may be beneficial.</p>","author":"Chang Gao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"187869b021f4f40e12306277076f090f72112b1124bae2b59cc8357bfb3802ef","category":"Interdisciplinary"}