{"title":"Unsung Heroes: Loes Adegeest the accidental cyclist who took an unconventional path to the WorldTour","link":"https://www.cyclingtips.com/2023/03/unsung-heroes-loes-adegeest-the-accidental-cyclist-who-took-an-unconventional-path-to-the-worldtour/","date":1678364562000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1460156196.jpeg?width=1200\" alt=\"Unsung Heroes: Loes Adegeest the accidental cyclist who took an unconventional path to the WorldTour\" /></figure><p><a href=\"https://www.cyclingtips.com/tag/loes-adegeest/\">Loes Adegeest</a>’s path to the WorldTour has not been straightforward.</p>\n<p>Adegeest — who won the Cadel Evans Great Ocean Road Race in January — was snapped up by FDJ-Suez after putting herself firmly on the map with victory over Ashleigh Moolman-Pasio at the 2022 Esports world championships, a title she would defend earlier this year.</p>\n<p>However, there’s more to the Dutchwoman’s story than that.</p>\n<p>The 26-year-old, who had never harbored ambitions of becoming a cyclist until later in life, has had to clear several major hurdles to making it into one of cycling’s top teams. Despite the struggles and the contemplations of retirement, she never gave up.</p>\n<p>“I know what I can do but it was hard to show what I could do because two years ago, I had barely any races. So that’s when I started doing Zwift racing to have some kind of opportunity to show what I was able to do,” Adegeest told <em>CyclingTips</em>. “I just like racing and I did races it on the club level, but I won them quite easily and thought I can do more and it’s not very challenging anymore, so that’s what was motivating to me to want to take the next step, but it was not easy to get into a team because UCI teams didn’t see those rides I could do and I couldn’t start a UCI race.”</p>\n<p><strong>Also read:</strong></p>\n<ul>\n<li><a href=\"https://www.cyclingtips.com/2022/02/loes-adegeest-wins-the-second-uci-cycling-esports-world-championships/\">Loes Adegeest wins the second UCI Cycling esports World Championships</a></li>\n<li><a href=\"https://www.cyclingtips.com/2023/02/unsung-heroes-cory-greenberg-on-racing-with-ulcerative-colitis/\">Unsung heroes: Cory Greenberg on racing with ulcerative colitis</a></li>\n<li><a href=\"https://www.cyclingtips.com/2021/11/unsung-heroes-tiffany-cromwell/\">Unsung Heroes: Tiffany Cromwell</a></li>\n</ul>\n<p>Adegeest didn’t set out to be a professional cyclist and, like many Dutch riders, began her career as a speed skater at age six. In fact, she was a national teammate with new SD Worx signing Femke Markus at the junior world championships.</p>\n<p>Cycling was initially just a way to get some fitness for her skating events and she joined a local club to go out on training rides, but it wasn’t long before she got into competition and was hooked to life on two wheels.</p>\n<p>“When I had my first or second training session they said: ‘next week, we have a race here. Do you want to join? Why not? And I ended on the podium, and I just loved racing,” she said. “It was never the plan to start racing, it was just for training. There was a school to do this in the summer and I only did the sprint races sometimes, because that’s just easier to combine with speed skating, and at the time speed skating was more important for me. When it was around 19, I switched to focus more on cycling and doing the classics and longer races.”</p>\n<p>Adegeest continued to mix cycling and speed skating until last season, but the bike became an increasingly important part of her life. She quickly showed a talent for the sport and finished fourth in the junior national time trial in 2014.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-514798944.jpeg?width=730\" alt=\"Loes Adegeest competed for Netherlands in speed skating\" width=\"1024\" height=\"683\" /><figcaption><span>Loes Adegeest competed for Netherlands in speed skating</span> (Photo: International Skating Union via Getty Images)</figcaption></figure>\n<p>The 2018 season would see her get an opportunity to race with Dutch club side NWVG and compete at WorldTour level for the first time. However, her year would be heavily impacted by a crash in January of that year, which left her with a concussion.</p>\n<p>Despite the challenges, she earned a spot on Parkhotel Valkenburg alongside future stars Demi Vollering and Lorena Wiebes. It was a big opportunity for Adegeest that came to an abrupt halt halfway through the year because of another big crash, this time at the BeNe Ladies Tour.</p>\n<p>“I didn’t really realize back then that the symptoms were from that old concussion, but that got in the way of a good winter and a good preparation for the season,” Adegeest said. “I never really got race fit during the year and then in the summer, when I started to feel a bit more like myself again, I crashed again, and then my season was over.</p>\n<p>“I just never really got a chance to ride like I was capable. I could see it in the power files that was just not at the level I could have been. It was a bit frustrating, but in the end, it was actually good that I crashed again, because then I went to a specialist and got to know that I actually didn’t recover from a concussion before and that helped my full recovery.”</p>\n<p>Few riders welcome a crash, but her fall at the BeNe Ladies Tour gave Adegeest an opportunity to take a step back from top-level racing and look after her health. She hadn’t recognized the concussion symptoms that she was suffering from, but they were beginning to take over her life and made it difficult to exist outside of her training and racing, which were also becoming harder.</p>\n<p>“Before that, I was combining my study and sports and it was all fine, but I struggled to make the combination and started to only focus on the sport because I didn’t have the energy or mental capacity to do more than just one training,” she said. “I just did my study, my training, and all the normal things you do, like grocery, doing laundry, and even combining that with training was becoming too much. But I think I ignored it because I just wanted to improve in cycling and just focusing on training.”</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1138850661.jpeg?width=730\" alt=\"Loes Adegeest raced with ParkHotel Valkenburg in 2019\" width=\"1024\" height=\"682\" /><figcaption><span>Loes Adegeest raced with Parkhotel Valkenburg in 2019</span> (Photo: Luc Claessen/Getty Images)</figcaption></figure>\n<p>The experience left Adegeest considering retirement before her career had even really had a chance to take off. She was no longer enjoying cycling, even just going out on a regular ride wasn’t particularly appealing.</p>\n<p>She ultimately made the tough decision to drop back down to club level and find the fun in her racing again. It worked, and the hunger for more was back.</p>\n<p>“I started to enjoy the coffee rides and then I actually started to miss racing. I thought maybe just start again, with a club where just where it’s just fun. But then when I started to win every race almost, and I thought, okay, maybe I’m not done with this. I want to try it again,” Adegeest said.</p>\n<p>The rest, as they say, is history.</p>\n<p>Struggling to show herself off to top teams, Adegeest took up Zwift racing and beat Moolman-Pasio to take the rainbow jersey. Surprisingly, she was not snapped up by a big squad after that performance, but she got a ride with the Irish-registered IBCT team and enjoyed a standout season that saw her take a stage win at the Tour de l’Ardèche.</p>\n<p>FDJ-Suez was suitably impressed and signed her on a two-year deal, which she almost immediately repaid with the win in Australia. She made a tentative European debut at Omloop Het Nieuwsblad last month and is set to ride Ronde van Drenthe this weekend, but she’s looking forward to the hillier races later in the spring.</p>\n<p>As a WorldTour rookie, she’s keeping her ambitions in check — despite the early win — and she’s hoping to grow as a rider as a whole.</p>\n<p>“I’m not a pure climber, I’m more the punchy climber type, but I also want to improve in the time trial,” she said. “Stage races are something that appeals to me, maybe not this year but in the longer term I want to try for a good, GC.</p>\n<p>“My dream race would be Strade Bianche with atmosphere and the white roads, it just looks special. I think that’s my dream race, and of course, the Tour de France to ride GC there once. It’s the biggest stage race right now. I saw the movie they made about FDJ at to Tour last year and it was so special to watch. It’s such a big event, which I think you can only experience really when you’re riding it yourself.”</p>","author":"Sadhbh O'Shea","siteTitle":"CyclingTips","siteHash":"3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1883e5543ebd0617d188c3706097baf8203ce7c042e511ab895304","category":"Cycling"}