{"title":"The Hong Kong version of Montreal Cognitive Assessment for the Visually Impaired (HKMoCA-VI): Proposed cut-off and cognitive functioning survey of visually impaired elderly in residential homes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305426","date":1719410400000,"content":"<p>by Calvin Chi Kong Yip, Winsy Wing Sze Wong, Calvin Pak Wing Cheng, Armstrong Tat San Chiu</p>\r\nBackground <p>Visual impairment has been strongly associated with the incidence of dementia. Appropriate cognitive screening for the elderly with visual impairment is crucial for early identification of dementia and its management. Due to challenges in processing visually presented stimuli among participants, the cut-off score of the Hong Kong version of the Montreal Cognitive Assessment for the Visually Impaired (HKMoCA-VI), also known as MoCA-BLIND or MoCA-22, was unknown. Besides, the cognitive status of elderly with visual impairment residing in care homes is rarely investigated. The current study aimed to 1) establish the cut-off score for HKMoCA-VI and 2) examine the general cognitive functioning of elderly with visual impairment living in residential homes in Hong Kong in terms of MoCA-VI percentile scores.</p> Method <p>HKMoCA-VI and the Cantonese version of the Mini-Mental State Examination (CMMSE) were administered to 123 visually impaired elderly residents in care homes in Hong Kong. Percentile scores of HKMoCA-VI by age and education level were determined, and the concurrent validity, sensitivity, and specificity of HKMoCA-VI were assessed.</p> Results <p>A cut-off score 12 was suggested for HKMoCA-VI, which yielded a sensitivity and specificity of 89.29% and 83.58%, respectively. Moreover, it strongly correlated with CMMSE, indicating satisfactory concurrent validity.</p> Conclusions <p>HKMoCA-VI is suggested to be a viable cognitive screening tool for elderly individuals with visual impairment in residential homes. Further modifications to enhance the sensitivity and specificity of the measure are proposed.</p>","author":"Calvin Chi Kong Yip","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"18832d1518bf294d59633b2d6209778210a25ab8126fa259a7c3efcabe6a2fb2","category":"Interdisciplinary"}