{"title":"Impaired motor-to-sensory transformation mediates auditory hallucinations","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002836","date":1727964000000,"content":"<p>by Fuyin Yang, Hao Zhu, Xinyi Cao, Hui Li, Xinyu Fang, Lingfang Yu, Siqi Li, Zenan Wu, Chunbo Li, Chen Zhang, Xing Tian</p>\r\n\r\nDistinguishing reality from hallucinations requires efficient monitoring of agency. It has been hypothesized that a copy of motor signals, termed <i>efference copy (EC)</i> or <i>corollary discharge (CD)</i>, suppresses sensory responses to yield a sense of agency; impairment of the inhibitory function leads to hallucinations. However, how can the sole absence of inhibition yield positive symptoms of hallucinations? We hypothesize that selective impairments in functionally distinct signals of <i>CD</i> and <i>EC</i> during motor-to-sensory transformation cause the positive symptoms of hallucinations. In an electroencephalography (EEG) experiment with a delayed articulation paradigm in schizophrenic patients with (AVHs) and without auditory verbal hallucinations (non-AVHs), we found that preparing to speak without knowing the contents (general preparation) did not suppress auditory responses in both patient groups, suggesting the absent of inhibitory function of <i>CD</i>. Whereas, preparing to speak a syllable (specific preparation) enhanced the auditory responses to the prepared syllable in non-AVHs, whereas AVHs showed enhancement in responses to unprepared syllables, opposite to the observations in the normal population, suggesting that the enhancement function of <i>EC</i> is not precise in AVHs. A computational model with a virtual lesion of an inhibitory inter-neuron and disproportional sensitization of auditory cortices fitted the empirical data and further quantified the distinct impairments in motor-to-sensory transformation in AVHs. These results suggest that “broken” <i>CD</i> plus “noisy” <i>EC</i> causes erroneous monitoring of the imprecise generation of internal auditory representation and yields auditory hallucinations. Specific impairments in functional granularity of motor-to-sensory transformation mediate positivity symptoms of agency abnormality in mental disorders.","author":"Fuyin Yang","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"18859887f5ad95e890cf3686aa1d328bd05ad60d79dcfd257de9fe6cf505e032","category":"Environment"}