{"title":"Berberine potentiates liver inflammation and fibrosis in the PI*Z hAAT transgenic murine model","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310524","date":1726754400000,"content":"<p>by Yuanqing Lu, Naweed S. Mohammad, Jungnam Lee, Alek M. Aranyos, Karina A. Serban, Mark L. Brantly</p>\r\nBackground <p>Alpha-1 antitrypsin deficiency (AATD) is an inherited disease, the common variant caused by a Pi*Z mutation in the SERPINA1 gene. Pi*Z AAT increases the risk of pulmonary emphysema and liver disease. Berberine (BBR) is a nature dietary supplement and herbal remedy. Emerging evidence revealed that BBR has remarkable liver-protective properties against various liver diseases. In the present study, we investigated the therapeutic effects and toxicities of BBR in Pi*Z hepatocytes and Pi*Z transgenic mice.</p> Methods <p>Huh7.5 and Huh7.5Z (which carries the Pi*Z mutation) cells were treated with different concentrations of BBR for 48 hours. MTT was performed for cell viability assay. Intracellular AAT levels were evaluated by western blot. In vivo studies were carried out in wild type, native phenotype AAT (Pi*M), and Pi*Z AAT transgenic mice. Mice were treated with 50 mg/kg/day of BBR or solvent only by oral administration for 30 days. Western blot and liver histopathological examinations were performed to evaluate therapeutic benefits and liver toxicity of BBR.</p> Results <p>BBR reduced intracellular AAT levels in Huh7.5Z cells, meanwhile, no Pi*Z-specific toxicity was observed. However, BBR did not reduce liver AAT load but significantly potentiated liver inflammation and fibrosis accompanying the activation of unfolded protein response and mTOR in Pi*Z mice, but not in wild type and Pi*M mice.</p> Conclusions <p>BBR exacerbated liver inflammation and fibrosis specifically in Pi*Z mice. This adverse effect may be associated with the activation of unfolded protein response and mTOR. This study implicates that BBR should be avoided by AATD patients.</p>","author":"Yuanqing Lu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"188864f0e37fa54a71645cf2b232f4abc699503e1c7b6d2b306d3483c89d941a","category":"Interdisciplinary"}