{"title":"264 Effects of increasing available phosphorus for 6 to 16 kg pigs fed diets containing phytase","link":"https://academic.oup.com/jas/article/102/Supplement_2/157/7664992?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>An experiment was conducted to determine the effects of increasing available phosphorus (aP) levels on growth performance of nursery pigs under commercial conditions. A total of 2,340 pigs [PIC 337 × 1050, initial body weight (BW) = 6.0 kg], placed in pens with 35 or 36 pigs, were used in a 39-d trial. Treatments were arranged in a dose titration with six levels of aP and 11 replicates per treatment. The aP levels were 0.33, 0.39, 0.46, 0.52, 0.59, and 0.65%. Two basal diets with the least and greatest aP levels were manufactured in meal form and blended at the farm to create the intermediate levels. Phytase [Allzyme Spectrum Swine (Alltech, Nicholasville, KY)] was included in the experimental diets at superdose levels with an estimated 0.15% aP release. Calcium levels were adjusted in each diet to maintain a constant 1.20 Ca:P. The experimental diets were fed from d 0 to 21 and a common corn-soybean meal-based diet with adequate aP level was fed from d 21 to 39. Data were analyzed with the MIXED procedure in SAS in a randomized complete block design with pen serving as the experimental unit and initial BW as the blocking factor. From d 0 to 21, pigs fed increasing levels of aP had improved (quadratic, <span>P</span> ≤ 0.024) average daily gain (ADG), average daily feed intake (ADFI), and feed efficiency [gain to feed ratio (G:F); Table 1]. For ADG and G:F, the quadratic polynomial resulted in the best fit predicting 100% of maximum response at 0.50 and 0.52% aP for ADG and G:F, respectively. Similar improvements (quadratic, <span>P</span> ≤ 0.049) were also observed in the overall period (d 0 to 39). From d 21 to 39, while pigs were fed a common diet, there was no evidence (<span>P</span> &gt; 0.05) for differences in growth performance. There was no evidence (<span>P</span> &gt; 0.05) for differences in mortality rate. However, there was a quadratic response (<span>P</span> = 0.008) in removal rate, with declining rates up to 0.59% aP. In summary, growth performance of 6 to 16 kg pigs was maximized with 0.50 to 0.52% aP with further improvements in removal rate observed with greater aP levels.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"188ead36b5e64750d3a60d6aeb72f0bcdac2c36128a6aafab2e5e87e8809e210","category":"Environment"}