{"title":"A Russian ISP confirms Roskomnadzor’s Twitter-blocking blooper","link":"https://arstechnica.com/?p=1748765","date":1615479753000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/roskomnadzor-speed-test-to-gulag-dot-link-980x417.png\" alt=\"\"></div>\n        <p>\n          This is https://speed.gulag.link/, a speedtest application that demonstrates Roskomnadzor throttling to Russian users it impacts.                      [credit:\n                        Jim Salter                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Last night, a confidential source at a Russian ISP contacted Ars with confirmation of the titanic mistake Roskomnadzor—Russia's Federal Service for Supervision of Communications, Information Technology, and Mass Media—made when attempting to punitively throttle Twitter's link-shortening service <code>t.co</code>.</p>\n<p>Our source tells us that Roskomnadzor distributes to all Russian ISPs a hardware package that must be connected just behind that ISP's BGP core router. At their small ISP, Roskomnadzor's package includes an <a href=\"https://teleser.ru/products/ecofilter4080\">EcoFilter 4080</a> deep package inspection system, a pair of Russian-made 10Gbps aggregation switches, and two Huawei servers. According to our source, this hardware is \"massive overkill\" for its necessary function and their experienced traffic level—possibly because \"at some point in time, government planned to capture all the traffic there is.\"</p>\n<p>Currently, the Roskomnadzor package does basic filtration for the list of banned resources—and, as of this week, has begun on-the-fly modifications of DNS requests as well. The DNS mangling also caused problems when first enabled—according to our source, YouTube DNS requests were broken for most of a day. Roskomnadzor eventually plans to require all Russian ISPs to replace the real root DNS servers with <a href=\"https://en.wikipedia.org/wiki/Alternative_DNS_root#Russian_National_Domain_Name_System\">its own</a>, but that project has met with resistance and difficulties.</p></div><p><a href=\"https://arstechnica.com/?p=1748765#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1748765&comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"18906401ccfa13c8f4f3f3e9608dd29084fecdc2089035bb05e21c6a70665b48","category":"Tech"}