{"title":"Release of ballast material during sea-ice melt enhances carbon export in the Arctic Ocean","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae081/7609917?rss=1","date":1708128000000,"content":"<span><div>Abstract</div>Globally, the most intense uptake of anthropogenic carbon dioxide (CO<sub>2</sub>) occurs in the Atlantic north of 50°N, and it has been predicted that atmospheric CO<sub>2</sub> sequestration in the Arctic Ocean will increase as a result of ice-melt and increased primary production. However, little is known about the impact of pan-Arctic sea-ice decline on carbon export processes. We investigated the potential ballasting effect of sea-ice derived material on settling aggregates and carbon export in the Fram Strait by combining 13 years of vertical flux measurements with benthic eDNA analysis, laboratory experiments, and tracked sea-ice distributions. We show that melting sea-ice in the Fram Strait releases cryogenic gypsum and terrigenous material, which ballasts sinking organic aggregates. As a result, settling velocities of aggregates increased ≤10-fold, resulting in ≤30% higher carbon export in the vicinity of the melting ice-edge. Cryogenic gypsum is formed in first-year sea-ice, which is predicted to increase as the Arctic is warming. Simultaneously, less sea-ice forms over the Arctic shelves, which is where terrigenous material is incorporated into sea-ice. Supporting this, we found that terrigenous fluxes from melting sea-ice in the Fram Strait decreased by &gt;80% during our time-series. Our study suggests that terrigenous flux will eventually cease when enhanced sea-ice melt disrupts trans-Arctic sea-ice transport and thus, limit terrigenous-ballasted carbon flux. However, the predicted increase in Arctic primary production and gypsum formation may enhance gypsum-ballasted carbon flux and compensate for lowered terrigenous fluxes. It is thus unclear if sea-ice loss will reduce carbon export in the Arctic Ocean.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"18919fcfcec82d3bbba31d4d0850069663ccf32f8572bf4b077c170b4df67c15","category":"Interdisciplinary"}