{"title":"A decade of curtailment studies demonstrates a consistent and effective strategy to reduce bat fatalities at wind turbines in North America","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12371?af=R","date":1724467229000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d8d77d67-53c8-4f99-8e30-e3dbbab1ee5a/eso312371-toc-0001-m.png\" alt=\"A decade of curtailment studies demonstrates a consistent and effective strategy to reduce bat fatalities at wind turbines in North America\" />\n<p>Wind turbine curtailment is an effective way to reduce bat fatalities. Our meta-analysis shows relatively consistent reduction in bat fatalities across included sites and bat species, with some site and species-specific variation present. Overall, curtailment reduced bat fatalities by 33% for each 1 m/s increment of curtailment.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThere is a rapid, global push for wind energy installation. However, large numbers of bats are killed by turbines each year, raising concerns about the impacts of wind energy expansion on bat populations. Preventing turbine blades from spinning at low wind speeds, referred to as curtailment, is a method to reduce bat fatalities, but drawing consistent inference across studies has been challenging.\n\nWe compiled publicly available studies that evaluated curtailment at six wind energy facilities in North America across 10 years. We used meta-regression of 29 implemented treatments to determine fatality reduction efficacy as well as sources of variation influencing efficacy. We also estimated species-specific fatality reduction for three species that comprise most fatalities in North America: hoary bat (<i>Lasiurus cinereus</i>), eastern red bat (<i>Lasiurus borealis</i>) and silver-haired bat (<i>Lasionycteris noctivagans</i>).\n\nWe found that curtailment reduced total bat fatalities by 33% with every 1.0 ms<sup>−1</sup> increase in curtailment wind speed. Estimates of the efficacy for the three target species were similar (hoary bats: 28% per ms<sup>−1</sup>, 95% CI: 0.4%–48%, eastern red bats: 32% per ms<sup>−1</sup>, 95% CI: 13%–47% and silver-haired bats: 32% per ms<sup>−1</sup>, 95% CI: 3%–53%).\n\nAcross multiple facilities and years, a 5.0 ms<sup>−1</sup> cut-in speed was estimated to reduce total bat fatalities by an average of 62% (95% CI: 54%–69%). Mortality reductions at individual facilities in any given year were estimated to fall between 33%–79% (95% prediction interval). Inter-annual differences rather than inter-site or turbine characteristics accounted for most of the variation in efficacy rates. Species-specific average mortality reduction at 5.0 ms<sup>−1</sup> curtailment wind speed was 48% (95% CI: 24%–64%) for hoary bats, 61% (95% CI: 42%–74%) for eastern red bats and 52% (95% CI: 30%–66%) for silver-haired bats.\n\n<i>Practical implication</i>. curtailment reduced bat mortality at wind turbines in this North American study. Efficacy increased proportionally as curtailment speed is raised, and patterns and rates of efficacy were similar across species. This indicates that curtailment is an effective strategy to reduce bat fatalities at wind energy facilities, but exploration of further refinements could both minimize bat mortality and maximize energy production.\n</p>","author":"Michael D. Whitby, \nM. Teague O'Mara, \nCris D. Hein, \nManuela Huso, \nWinifred F. Frick","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"189a11342fec35a007fccdfaec2945fd25cd38a42977528f26384db8ff1eb579","category":"Environment"}