{"title":"Giro d'Italia stage 19 preview - a brutal day in the Dolomites","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-stage-19-preview-the-toughest-day","date":1685031716000,"content":"\n      <p><b>Distance: </b><span>183km<br /></span><b>Start location: </b><span>Longarone<br /></span><b>Finish location: </b><span>Tre Cime di Lavaredo <br /></span><b>Start time: </b><span>11:35 CEST<br /></span><b>Finish time (approx): </b><span>17:13 CEST</span></p>\n<p>In 1869, Austrian mountaineer Paul Grohmann became the first man to reach the top of the Cima Grande peak in the Dolomites. One of the Tre Cime di Lavaredo, or ‘Three Peaks of Lavaredo’ that used to form part of the border between Italy and the Grohmann’s native Austria-Hungary before World War One, and provides the Dolomites with its archetypical picture postcard image, it was one of many peaks that Grohmann had the claim of being the first to conquer in the Dolomites. </p>\n<div></div>\n<p>This was an age of exploration in extreme parts of the world where intrepid, heroic figures would make dangerous expeditions to the untapped, extreme parts of the world, from Alpine summits to the depths of Antarctica. Nowadays, now so much of the world has been mapped out, sports competitors like those taking part in the Giro d’Italia fulfil a similar role in the collective imagination, as athletic heroes who continue to push the limits of human endeavour by cycling up summits like Tre Cime di Lavaredo at ever increasing speeds.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_19_e384efc5-2062-4d8d-9a0b-e4f74a69cb53.jpg?v=1684320076\" alt /><em>Stage 19 profile sourced on the Giro d'Italia website </em></p>\n<p>With five climbs in total, and five of them ranked category one, this is the second of the double header of stages in the Dolomites and might just be the hardest of the whole Giro. It’s certainly the one with the most high-altitude climbing, with the three biggest climbs all standing over 2,000m above sea level, confronting the riders’ lungs with the problem of thin, difficult to breathe air, as if their legs didn’t alone have enough to worry about.</p>\n<p>The first of those category one climbs, Passo Valparola, comes immediately after the category two Passo Campolongo, and its lengthy, 14km test that will serve to sap at the riders' energy and thin the peloton. The real racing is likely to begin on the next climb though, the horrendously steep Passo Giau. Whereas mountain passes are generally characterised by their length rather than their gradients, this one rises at 9.3% for 10km, making it one of the hardest sustained efforts of the race. Although initially only used sparingly after its introduction in 1973, the Giau has become a common feature of the Giro in the last 15 years, and most recently a pink jersey-clad Egan Bernal used it as a springboard for a long-range attack to win a weather-affected stage of the 2021 edition while in the pink jersey, that was mostly missed by television transmitters due to the terrible conditions.</p>\n<p>Although a similar move is not impossible this time, the severity of the final 22km after they’re done descending Passo Giau might persuade them to hold fire. First comes Passo Tre Croci (7.9km at 7.2%), then, after a 7km plateau, the final ascent to Tre Cime di Lavardeo, which averages a devastating 11.7% for the final 4km. It’s the same finale (minus Passo Giau, which was cancelled due to the weather) that saw Vincenzo Nibali emerge from the freezing mist to triumph in the pink jersey in what was a memorably snowy penultimate stage of his victorious 2013 Giro, one of the greatest days of his brilliant career. </p>\n<h3>Contenders</h3>\n<p><span>Mountain after mountain, Friday's stage will provide fireworks for those watching at home as it is set to be one of the final fights between the GC riders, and it's likely they'll fight it out for the stage win instead of a breakaway. After stage 18, the battle for the </span><i><span>maglia rosa</span></i><span> is still wide open as the riders take on the last mountain road stage, with time gaps still relatively small. However, the brutal climbs could be the final deciding factor. </span></p>\n<p><span>Current race leader</span> <b>Geraint Thomas </b><span>(Ineos Grenadiers) defended the jersey excellently on stage 18 and looked consistent from start to finish. Nothing seems to have fazed the Welsh rider, even when attacks were made by his rivals, he stuck to their wheels to ensure he stayed in pink. However, it is far from over for Thomas, and he’ll have to make sure he’s on top form here to keep his rivals from gaining any time. He might be an outside shot for victory here considering his tendency to ride fairly defensively, and maintaining his overall lead will be his top priority.</span></p>\n<p><span>Moving up to second place, </span><b>Primož Roglič</b><span> (Jumbo Visma) now sits 29 seconds behind Thomas and still has the </span><i><span>maglia rosa</span></i><span> within reach if a chance presents itself. We haven’t seen Roglič in his best form yet, with no successful stinging attacks that we’ve become accustomed to. On stage 17, he couldn’t hold the wheel of Thomas and </span><b>João Almeida</b><span> (UAE Team Emirates) as they battled for the stage, but on stage 18, he looked more himself, attacking on the final climb in an attempt to shake Thomas. The steep finish here may suit him over the others, and offer him a chance to grab a stage win as well as some time.</span></p>\n<p><span>Almeida may have won a stage at this Giro d’Italia, but on stage 18 he didn’t have his best day, losing the wheel of his two rivals on the final climb. The Portuguese rider is 10 seconds behind Roglič, but the finish to stage 19 is less than ideal for his metronomic style of climbing. He has a fast finish though, so could stand a chance at victory if he holds on with Thomas and Roglič to the final hundred metres.</span></p>\n<p><b>Eddie Dunbar</b><span> (Jayco Alula) is having the ride of his life so far at the Giro, taking over Bahrain-Victorious rider </span><b>Damiano Caruso</b><span> for fourth place in the GC. Both riders will be wanting to stick with the three favourites</span><span> to ensure their high rankings stay put, but a stage win here looks beyond both of them. </span></p>\n<p><b>Thibaut Pinot </b><span>(Groupama-FDJ) has had two heartbreaking second places now at this Giro and will still be searching for the stage win he desperately wants. A breakaway would be his best bet again, but it looks like a tall order given the terrain.</span></p>\n<p><b>Hugh Carthy</b><span> (EF Education-EasyPost) slipped down the GC on Thursday after being dropped on the steep slopes of the penultimate climb. As a pure climber he should be comfortable with a stage like this, and his time gap of over nine minutes on GC may allow him some leeway to grab the stage should he have the energy to attack. </span></p>\n<h3>Prediction</h3>\n<p><span>After looking more himself on stage 18, we think Primož Roglič will triumph on Tre Cime di Lavaredo.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"189be6562e84b21f7d68c1de15b7cc5bb3328bd7fc8e65bc3d8cd81cbab07459","category":"Cycling"}