{"title":"Aerosol loading in the guinea coast climate region of Nigeria: comparison of MODIS and AERONET data sources","link":"http://link.springer.com/10.1007/s44292-024-00018-2","date":1728345600000,"content":"<h3>Abstract</h3>\n                    <p>This study compares aerosol optical depth (AOD) measurements from satellite data with that from a ground-based station. It aims at validating monthly AOD data from the Moderate Resolution Imaging Spectroradiometer (MODIS) Deep Blue (DB) collection 6.1 (Aqua and Terra) at 550 nm against AOD data from the Aerosol Robotic Network (AERONET) station at 500 nm in Ilorin over the period 2003–2022. The analysis focuses on eight selected cities/locations within the Guinea Coast region of Nigeria. Descriptive and inferential statistical methods, including correlation, regression, standard deviation, coefficient of variation, the Mann–Kendall trend test, root mean square error (RMSE), mean absolute error (MAE), and relative mean bias (RMB), were employed. The results indicate a positive correlation in most locations, with correlation values ranging from 0.3 to 0.7. The correlation between the datasets in Ilorin showed a positive and significant relationship while the other seven locations presented a weak and insignificant relationship. Additionally, the period from 2013–2022 showed better correlation compared to 2003–2012. AOD levels were highest during the harmattan season (DJF), exceeding 0.8, and lowest during the monsoon (JJA) and post-monsoon (SON) seasons, with values below 0.5, reflecting the effects of wet scavenging. The highest agreement between MODIS Aqua and AERONET data was observed during the harmattan season. The study also found that MODIS tends to overestimate AOD compared to AERONET and that MODIS-AOD exhibits greater spread and variability than AERONET-AOD.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"189e4c477bb6d4bff13aa55bedf3792536a2533fabb012bc647c7a7ebd496a01","category":"Environment"}