{"title":"Portable monitors could make foldable-screen gadgets finally make sense","link":"https://arstechnica.com/?p=1994880","date":1704914598000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/list-maybe-YT-980x653.jpg\" /></div>\n          <p>\n            Asus plans to release this foldable OLED monitor in 2024. Electronics retailer Abt Electronics captured footage of it on display at CES.                           [credit:\n                              <a href=\"https://www.youtube.com/watch?v=JwHnSIh-NoQ\">Abt Electronics/YouTube</a>\n                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p><a href=\"https://arstechnica.com/gadgets/2023/09/the-first-foldable-pc-era-is-unfolding/\">Foldable screens</a> have been bending their way into consumer gadgets over the last few years. But with skepticism about durability, pricing, image quality, and the necessity of such devices, foldable screens aren't mainstream. With those concerns in mind, I haven't had much interest in owning a foldable-screen gadget, even after <a href=\"https://arstechnica.com/gadgets/2023/12/hp-shows-what-a-foldable-screen-laptop-should-and-shouldnt-be/\">using a foldable laptop for a month</a>. However, the foldable portable monitor that Asus is showing at CES in Las Vegas this week is an application of foldable OLED that makes more sense to me <a href=\"https://arstechnica.com/gadgets/2023/10/motorola-demos-smartphone-that-can-wrap-around-your-wrist-again/\">than others</a>.</p>\n<p>Asus' ZenScreen Fold OLED MQ17QH announced on Tuesday is a 17.3-inch portable monitor that can fold to a 12.5-inch size. The monitor has 2560×1920 pixels for a pixel density of 184.97 pixels per inch. Other specs include a 100 percent DCI-P3 coverage claim and VESA DisplayHDR True Black 500 certification.</p>\n<p>When I think of the ways I use portable monitors, foldability makes more sense than it does with other device types. For example, I love working outside when possible, and an extra 17.3-inch screen that's easy to carry would make long work sessions with an ultraportable laptop more feasible. The Fold OLED's 17.3 inches is near the larger size for a portable monitor, but the fold and comparatively light weight should make it feel more transportable than similarly sized monitors that don't fold in half.</p></div><p><a href=\"https://arstechnica.com/?p=1994880#p3\">Read 25 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1994880&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"18acc1a6605d140e795b4f8b7b2c2ff3ca7520775c1b2df64603a7577630e52c","category":"Tech"}