{"title":"TetraDENSITY 2.0—A Database of Population Density Estimates in Tetrapods","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13929?af=R","date":1729658089000,"content":"<h2>ABSTRACT</h2>\n<h2>Motivation</h2>\n<p>Population density is a fundamental parameter in ecology and conservation, and taxonomic and geographic patterns of population density have been an important focus of macroecological research. However, population density data are time-consuming and costly to collect, so their availability is limited. Leveraging decades of research, TetraDENSITY 1.0 was developed as a global repository containing over 18,000 population density estimates for &gt; 2100 terrestrial vertebrate species, aiding researchers in investigating patterns of population density, its intrinsic and extrinsic drivers, and for developing predictive models. Here we present a substantially expanded version of the database, which now includes marine tetrapods and encompasses over 54,300 estimates for 3717 species associated with error estimates and geographical coordinates when available, hence enabling meta-analytical approaches and better spatial matching of estimates with environmental conditions.</p>\n<h2>Main Types of Variables Contained</h2>\n<p>Population density estimates and associated errors, time and location of data collection, taxonomic information, estimation method.</p>\n<h2>Spatial Location</h2>\n<p>Global.</p>\n<h2>Time Period and Grain</h2>\n<p>1925–2024.</p>\n<h2>Major Taxa and Level of Measurement</h2>\n<p>Amphibia, Reptilia, Aves and Mammalia. Estimates reported at the population level.</p>\n<h2>Software Format</h2>\n<p>.csv.</p>","author":"L. Santini, \nV. Y. Mendez Angarita, \nC. Karoulis, \nD. Fundarò, \nN. Pranzini, \nC. Vivaldi, \nT. Zhang, \nA. Zampetti, \nS. J. Gargano, \nD. Mirante, \nL. Paltrinieri","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"18ae54d6322a66497205da3f14d9a55a4f282cb182fb2415e57bf192e38147f3","category":"Environment"}