{"title":"Long term co‐application of biochar and fertilizer could increase soybean yield under continuous cropping: insights from photosynthetic physiology","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13202?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Photosynthesis is the key to crop yield. The effect of biochar on photosynthetic physiology and soybean yield under continuous cropping is unclear. We conducted a long-term field experiment to investigate the effects of co-application of biochar and fertilizer (BCAF) on these parameters. Five treatments were established: F2 (fertilizer), B1F1 (3 t hm<sup>−2</sup> biochar plus fertilizer), B1F2 (3 t hm<sup>−2</sup> biochar plus reduced fertilizer), B2F1 (6 t hm<sup>−2</sup> biochar plus fertilizer), and B2F2 (6 t hm<sup>−2</sup> biochar plus reduced fertilizer).</p>\n<h2>RESULTS</h2>\n<p>BCAF increased chlorophyll and leaf area, enhancing soybean photosynthesis. The net photosynthetic rate (<i>P</i>\n<sub>n</sub>), transpiration rate (<i>T</i>\n<sub>r</sub>), stomatal conductance (<i>G</i>\n<sub>\n   <i>s</i>\n</sub>), water use efficiency (WUE) and intercellular carbon dioxide (CO<sub>2</sub>) concentration (<i>C</i>\n<sub>i</sub>) were enhanced by BCAF. In addition, BCAF improved soybean photosystem II (PSII) photosynthetic performance, driving force, potential photochemical efficiency (<i>F</i>\n<sub>v</sub>/<i>F</i>\n<sub>0</sub>), and quantum yield of electron transfer (<i>φ</i>\n<sub>E0</sub>). Furthermore, BCAF enhanced the accumulation of photosynthetic products, such as soluble proteins, soluble sugars and sucrose content, resulting in higher leaf dry weight. Consequently, BCAF increased the soybean yield, with the highest increase of 41.54% in B2F1. The correlation analysis revealed positive relationships between soybean yield and chlorophyll, leaf area, maximal quantum yield of PSII (<i>F</i>\n<sub>v</sub>/<i>F</i>\n<sub>m</sub>), electron transport flux per cross-section at <i>t</i> = 0 (ET<sub>0</sub>/CS<sub>0</sub>), trapped energy flux per cross-section at <i>t</i> = 0 (TR<sub>0</sub>/CS<sub>0</sub>), composite blade driving force (DF<sub>Total</sub>), and leaf dry weight.</p>\n<h2>CONCLUSIONS</h2>\n<p>We demonstrated that long-term BCAF enhances soybean photosynthesis under continuous planting, reduces fertilizer use and increases yield. This study reveals a novel way and theory to sustainably increase soybean productivity. © 2023 Society of Chemical Industry.</p>","author":"Di Wu, \nYuxue Zhang, \nWenqi Gu, \nZhibo Feng, \nLiqun Xiu, \nWeiming Zhang, \nWenfu Chen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"18b8e27cb9204ee4f697360c6b14031c9d92f67f8f0fd2009c98285e52a312f0","category":"Environment"}