{"title":"MicroLED Apple Watch Ultra: All the Rumors So Far","link":"https://www.macrumors.com/guide/microled-apple-watch/","date":1682716895000,"content":"Apple is working on next-generation display technology called microLED, which will be coming to the <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra</a> first. We're not expecting the ‌Apple Watch Ultra‌ with microLED until 2025, but rumors about the device have been ramping up already.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/apple-watch-ultra-purple.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThis guide highlights everything we know about Apple's work on a microLED watch and what Apple has in store for microLED in the future.\r<br />\n\r<br />\n<h2>MicroLED Apple Watch Ultra</h2>\r<br />\nIntroduced in 2022, the current ‌Apple Watch Ultra‌ uses standard OLED technology. MicroLED is, as the name suggests, LED display technology rather than OLED display technology, but it offers many of the benefits of OLED along with some improvements.\r<br />\n\r<br />\nThe microLED Apple Watch is expected to include a 2.1-inch diagonal display, but we aren't aware of any other features that the device might get as of yet.\r<br />\n\r<br />\nApple is already testing microLED displays for the Apple Watch, and the displays are said to feature brighter, more vibrant colors and <a href=\"https://www.macrumors.com/2023/01/10/apple-custom-displays-microled-apple-watch/\">a look like</a> content is \"painted on top of the glass.\"\r<br />\n\r<br />\nIt is unclear if Apple will update the ‌Apple Watch Ultra‌ prior to when it implements microLED, but given that we're at least two years away from the new model, we could get an in-between update. That said, it isn't yet known if Apple will update annually or if the ‌Apple Watch Ultra‌ will be more like the <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a> with occasional updates.\r<br />\n\r<br />\n<h2>MicroLED Overview</h2>\r<br />\nMicroLED is a fairly new technology that's been around for about two decades, but it has not yet been mass produced, because of the costs associated with it and the difficulty of making the displays. Samsung, for example, has made a microLED TV, but it <a href=\"https://www.samsung.com/us/televisions-home-theater/tvs/micro-led/110-class-micro-led-samsung-4k-with-smart-hub-mna110ms1acxza/\">sells for $150,000</a>.\r<br />\n\r<br />\nAs the name suggests, microLED uses microscopic LEDs for individual pixels. The production process involves creating little tiny LEDs on a wafer and transferring them to a backplane, a process that hasn't been perfected yet because of the time that it takes to test all of those LEDs. Since this is nascent technology, there are new cutting-edge production techniques in the works, and multiple companies are focused on figuring out microLED.\r<br />\n\r<br />\nCompared to LED displays, microLED is much more energy efficient and it would likely notably increase battery life on the ‌Apple Watch Ultra‌ and other devices that adopt the technology in the future. Unlike OLED, there's much less risk of screen burn-in, and microLEDs have a longer potential lifetime.\r<br />\n\r<br />\nMicroLED displays also provide contrast improvements and faster response times because of the pixel-level individual lights, plus the color is better and brighter. In a nutshell, it's a next-generation technology superior to OLED and miniLED.\r<br />\n\r<br />\nLike OLED displays, microLED displays can be flexible, so if Apple eventually transitions to foldable devices, those products could use microLED. The technology would also work for curved displays.\r<br />\n\r<br />\n<h2>Apple's In-House Display Development</h2>\r<br />\nMicroLED is not like Apple's other display technologies because it is the first display type that Apple is planning to design in-house. Rather than using a third-party display supplier like Samsung or LG Display, Apple is designing the displays itself and having them manufactured by partners like TSMC.\r<br />\n\r<br />\nApple has spent over six years working on microLED technology, and it has invested billions into developing new displays. Way back in 2015, Apple <a href=\"https://www.macrumors.com/2015/12/14/apple-thinner-display-taiwan/\">opened a secret laboratory</a> in northern Taiwan to work on thinner, brighter, and more energy-efficient displays for future iOS devices, and rumors suggest that factory was <a href=\"https://www.macrumors.com/2015/12/16/apple-taiwan-factory-oled-micro-led-tech/\">dedicated to microLED</a>. <a href=\"https://www.macrumors.com/2023/01/10/apple-custom-displays-microled-apple-watch/\">According to <em>Bloomberg</em></a>, it is one of the company's most \"critical projects.\"\r<br />\n\r<br />\nApple reportedly has more than 300 employees working on microLED display development, but little is known about it outside of the company as of now. When Apple is able to transition to its own in-house displays, it will no longer need to rely on display partners.\r<br />\n\r<br />\n<h2>MicroLED for Other Apple Devices</h2>\r<br />\nWith OLED displays, Apple started with the Apple Watch before rolling out the technology to other devices, and the same thing is expected for microLED. The ‌Apple Watch Ultra‌ will be the first device with microLED, but Apple is planning to expand it to the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, and it could also be introduced for the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> and the Mac in the future.\r<br />\n\r<br />\nIt may take Apple some time to scale the technology to introduce larger microLED displays, but <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> says there are <a href=\"https://www.macrumors.com/2023/01/15/apple-custom-displays-heading-to-iphone-ipad-and-mac-after-apple-watch/\">definite plans to use microLED</a> for the ‌iPhone‌, ‌iPad‌, and Mac.\r<br />\n\r<br />\nWith OLED, the original Apple Watch introduced in 2015 had an OLED display, and it was the first Apple device to use the technology. Two years later, Apple brought OLED displays to the ‌iPhone‌ with the ‌iPhone‌ X, and now there are rumors of <a href=\"https://www.macrumors.com/guide/oled-ipad-pro/\">OLED iPads</a> and MacBooks.\r<br />\n\r<br />\n<h2>MicroLED Launch Date</h2>\r<br />\nThe ‌Apple Watch Ultra‌ with microLED display is coming in the second half of 2025 at the earliest, according to <a href=\"https://www.macrumors.com/2023/04/27/apple-watch-ultra-second-half-2025/\">display analyst Ross Young</a>.\r<br />\n\r<br />\nThat's still far off, so it is possible that Apple's plans could be delayed and it could be pushed until 2026. Right now, Apple appears to be targeting 2025, so if that timeline sticks, we could see the ‌Apple Watch Ultra‌ with the new display technology launched in September 2025, which is typically when Apple introduces new Apple Watch models.<br />This article, \"<a href=\"https://www.macrumors.com/guide/microled-apple-watch/\">MicroLED Apple Watch Ultra: All the Rumors So Far</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/microled-apple-watch-ultra-all-the-rumors-so-far.2388106/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"18c640bd7b3638d3947aead6c51c87d142b67a4c19780a9d40ff4e16ca831c31","category":"Apple"}