{"title":"Assessing Surface Saturation and Transpiration Potential by Hypsometric Curves and the HAND Model","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037082?af=R","date":1722490846000,"content":"<h2>Abstract</h2>\n<p>Methods for soil water conditions assessment are often highly localized or data demanding. In this study we propose a new scalable approach to assess soil water conditions. The main goal is to test whether the approach can be used to provide information about local conditions, without the need of extensive data sets. The approach utilizes a combination of normalized topography derived from the HAND terrain model (Height Above the Nearest Drainage) and hypsometric curves to identify wet and saturated areas for any given geographical extent. The study was conducted through a case study in the Lagan River catchment in the southwest of Sweden. To analyze the performance of the approach, a non-linear regression analysis was performed to assess the relationship between the fraction of wet area and the normalized terrain. This was followed by a correlation analysis, in which the correspondence of the derived output was validated against the national Soil Moisture Map provided by the Swedish University of Agricultural Sciences. The results show a strong, and statistically significant, negative exponential relationship between the fraction of wet area, and the maximum heights within the studied area. The approach also corresponds well with the spatial variations highlighted in the Soil Moisture Map, although better in predicted wetter areas than under dry conditions. Going forward, we believe the integration of hypsometric curves and the HAND model could not only improve water balance calculations but assist in the assessments of flood and drought-prone areas.</p>","author":"August Bjerkén, \nLuz A. Cuartas, \nLuk Peeters, \nKenneth M. Persson","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"18d4207d40897a260c7251a301b1a0e2c587d3cd1f7c0497de04d3df0b2f9c2d","category":"Environment"}