{"title":"10 products I loved in 2021: James Huang","link":"https://cyclingtips.com/2021/12/10-products-i-loved-in-2021-james-huang/","date":1638920291000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Ten-products-I-loved-in-2021-James-Huang-1-650x366.jpg\" /></div><h2>10 products I loved in 2021: James Huang</h2><p>\n</p><p>As I was looking over my list for 2021, I couldn’t help but notice how it’s dominated by things from smaller brands — ones without huge marketing or engineering budgets, with less-than-ubiquitous name recognition, and without the benefit of flashy pro teams to help hawk their wares. Nevertheless, each of these lesser-known items left an impression on me by tangibly making my rides better.</p>\n\n\n\n<p>I wonder if part of this is because many of the major technological performance gains — at least for the drop-bar world — that require big-time investment and resources have already been done. Bikes are still getting lighter, but not across the board and certainly not at the pace of yesteryear. They’re getting more aerodynamic, but that’s not of major importance to me personally. And while they’re getting more capable in many cases, I’m generally not one to push the boundaries too much; I’m pretty mediocre in both my personal capabilities as well as my aspirations.</p>\n\n\n\n<p>What’s left, then, are smaller gains that might not seem worthwhile to a big company with a big budget, but still mean something to little ol’ me. Things that remove stress. Things that make life a little easier. Things that save me money. Things that make me smile more. Things that let me have more fun. </p>\n\n\n\n<p>I dare say things have been challenging for most of us in one way or another over the past couple of years, and we should all be thankful we can still turn to bikes as an escape from reality. If I’ve learned anything, it’s that life is short. I don’t know about you, but I’d like to pack as many smiles into my brief period on this planet as I possibly can, and anything that can help reliably bring that smile to my face is as good as gold.</p>\n\n\n\n<hr />\n\n\n\n<h2>Bivo stainless steel water bottles</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Bivo-Duo-water-bottle-1-1340x754.jpg\" /></figure>\n\n\n\n<p><a href=\"https://cyclingtips.com/2021/01/bivo-one-water-bottle-review-better-flow-by-focusing-on-air/\" target=\"_blank\">Bivo water bottles</a> don’t make a ton of sense on paper. They’re 3-4 times as expensive as good plastic bottles, almost twice as heavy, and the thin-walled stainless steel bodies are prone to denting if you drop them. And having seen more than few other metal bottle designs come and go over the years — none of which did the actual job of providing fluid to drink better than what I was already using — I was more than a little skeptical when I first saw these.</p>\n\n\n\n<p>However, Bivo’s ace-in-the-hole is its slick nozzle design, which mimics a toddler’s sippy cup in that there’s a path for fluid to pour out as well as a way for air to get in. Both are engineered such that water flows out faster than any conventional plastic bottle I’ve used, all without having to squeeze the body. You just tilt it and drink, and the water comes out as fast as you can suck it down.</p>\n\n\n\n<p>The end result is that I consistently drink more during a ride when using these bottles than I used to, to the point where I typically bring two bottles instead of one, or at least a larger bottle (Bivo recently added a 750 mL model) instead of a smaller one.</p>\n\n\n\n<p>The stainless material also doesn’t make my water taste funny, the top completely disassembles in seconds for easy and thorough cleaning, and as a nice bonus, the whole lot comes out of my dishwasher bone-dry and ready to store, as compared to plastic bottles that I always have to set out for further air-drying. </p>\n\n\n\n<p>To be clear, I don’t use Bivo bottles for every kind of ride, particularly not for trail rides when I prefer not to have a big metal thing right in my lower back. Even on road and gravel rides, the denting thing is also still an issue, and the body’s silicone rubber coating isn’t as durable as I’d like, but I’ve accepted both as a sort of patina that tells a story over time. And given that I expect these to last for years and years instead of having to be retired relatively quickly like plastic bottles, I expect there to be quite the story someday.</p>\n\n\n\n<p><strong>Price: </strong>US$29-44 / AU$41-62 / £22-33 / €29-44 <br /><strong>More information: </strong><a href=\"http://www.drinkbivo.com\" target=\"_blank\">www.drinkbivo.com</a></p>\n\n\n\n<hr />\n\n\n\n<h2>Santini Grido wool base layer</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Santini-Grido-base-layer-1-1340x754.jpg\" /></figure>\n\n\n\n<p>I really don’t like being cold. I’m not sure if I can chalk it up to getting older, or that I’ve gotten spoiled by Colorado’s pleasantly sunny and (mostly) dry winters as compared to the chill-you-to-the-bone humidity I suffered through in the US midwest for so long. Either way, I don’t deal with it nearly as well as I used to, which explains why I quickly fell in love with Santini’s Grido long-sleeve base layer.</p>\n\n\n\n<p>The Grido is made of Polartec’s new Power Wool bi-layer wool and synthetic material. Soft and fuzzy Merino wool sits on the inside, in a striped and lofted pattern that maximizes warmth and reminds me of that classic Patagonia fleece material in the way it seems to create a little barrier of air right next to your body. On the outside, however, is a stretch polyamide material that not only offers a more compressive fit, but also helps to transfer sweat away from your skin. It seems to be more durable to repeated machine washings than 100% Merino wool base layers, too.</p>\n\n\n\n<p>Put it all together, and it’s the warmest and coziest winter base layer I’ve ever used.</p>\n\n\n\n<p>Truth be told, the magic of this base layer probably lies more in the work Polartec has put into the Powerwool fabric than whatever Santini has done, and given the Grido’s considerable cost, maybe there are more economical options out. But this is what I’ve got, and now that winter has finally arrived here again, I’ll basically be living in this thing until spring.</p>\n\n\n\n<p><strong>Price: </strong>US$150 / £120 / €129 / AU$NS<br /><strong>More information:</strong> <a href=\"https://www.santinicycling.com/us/clothing-cycling-man-baselayer-technical/grido-baselayer-2821.html\" target=\"_blank\">www.santinicycling.com</a></p>\n\n\n\n<hr />\n\n\n\n<h2>Bontrager Rapid Pack Hydro</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Bontrager-Rapid-Pack-Hydro-1-1340x754.jpg\" /></figure>\n\n\n\n<p>OK, so maybe not <em>every </em>product on my list is from a smaller company. </p>\n\n\n\n<p>I’ve only worn a conventional hydration pack a couple of times in the last several years. Part of that boils down to my mountain bike rides rarely spanning more than a few hours these days, but it’s also because hip packs have gotten so good. Why deal with a sweaty back and tired shoulders if I don’t have to?</p>\n\n\n\n<p>My previous go-to was Bontrager’s original Rapid Pack. The bottle is positioned dead-center in the pack so the weight is nicely balanced, the side pockets have plenty of room for food and some lightweight emergency layers, and the whole thing is so comfortable that I genuinely forget I’m wearing it. Subdividers in the side pockets (and a key clip) keep smaller items organized, too. However, that single-bottle capacity (combined with the other bottle on my bike) was limiting on longer summertime rides, and since I still stubbornly resist traditional packs, I occasionally went a little thirsty.</p>\n\n\n\n<p>That’s no longer an issue with the newer Rapid Pack Hydro, which doubles my fluid capacity with a 1.5 L Hydrapak bladder that lives in its own separate compartment. That weight is held nice and low, and all of that mass is still centered on my lower back to keep the pack from rotating over time. When I don’t need the bladder, that full-width compartment has proven handy for thicker layers, and there’s still lots of space for snacks.</p>\n\n\n\n<p>As icing on the cake, it’s also pretty reasonably priced. </p>\n\n\n\n<p>I’ve got several options for hip packs, and the Rapid Pack Hydro isn’t the flashiest, lightest, or most expensive of the lot. But with little exception, this is the one I put on before I roll out the door.</p>\n\n\n\n<p><strong>Price: </strong>US$90 / AU$170 / £95 / €105<br /><strong>More information:</strong> <a href=\"https://www.trekbikes.com/us/en_US/us/en_US/equipment/bike-accessories/bike-bags-baskets-panniers/bike-bags-panniers/bontrager-rapid-pack-hydro/p/34744/\">www.</a><a href=\"https://www.trekbikes.com/us/en_US/us/en_US/equipment/bike-accessories/bike-bags-baskets-panniers/bike-bags-panniers/bontrager-rapid-pack-hydro/p/34744/\" target=\"_blank\">trekbikes</a><a href=\"https://www.trekbikes.com/us/en_US/us/en_US/equipment/bike-accessories/bike-bags-baskets-panniers/bike-bags-panniers/bontrager-rapid-pack-hydro/p/34744/\">.com</a></p>\n\n\n\n<hr />\n\n\n\n<h2>Route Werks handlebar bag</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Route-Werks-handlebar-bag-1-1340x754.jpg\" /></figure>\n\n\n\n<p>I poo-pooed the handlebar bag craze for a pretty long time. Despite their growing popularity, most of the ones I tried didn’t fit well, or they cramped my hand positions, or they were hard to access while riding. But then Route Werks came along.</p>\n\n\n\n<p>The <a href=\"https://cyclingtips.com/2021/03/route-werks-handlebar-bag-review-brilliant-design-brilliant-execution/\" target=\"_blank\">Route Werks bag</a> is more expensive than most other bar bags out there, and certainly heavier. But its semi-rigid construction and neat aluminum quick-release bracket mounting also suspends the bag off the front of the bar to make room for my hands, the squared-off shape makes the most of the 3.2-liter official capacity, and that flip-top hinged lid makes it super easy to grab a snack on the go. </p>\n\n\n\n<p>I love how Route Werks has spent a lot of time on the details here. The computer mount built into the plastic lid is a nice bit of integration, and optional bolt-on stubs on the sides provide a place for lights and cameras. If you don’t need the bag, but still want to have your computer, there’s now a separate mount that attaches the Route Werks’ dedicated quick-release handlebar bracket, too. The interior lining is also lightly colored so your stuff doesn’t get lost in a black hole of nylon, the body is DWR-coated to help keep your stuff dry, and the modular design makes for easier repairs should something go wrong (and yes, the company has spare parts available). </p>\n\n\n\n<p>Aesthetically, the Route Werks bag may be a little too function-over-form for some people’s liking, and it’s not exactly svelte. But then again, both of those descriptors apply to me, too, which might help explain why I like it so much.</p>\n\n\n\n<p><strong>Price: </strong>US$179 (pricing for other regions varies with exchange rate)<br /><strong>More information: </strong><a href=\"https://routewerks.us/products/the-handlebar-bag\" target=\"_blank\">www.routewerks.us</a></p>\n\n\n\n<hr />\n\n\n\n<h2>American Classic tires</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/American-Classic-tires-1-1340x754.jpg\" /></figure>\n\n\n\n<p>Barely a minute goes by without us all (justifiably) screaming about why everything bike-related is so expensive these days. Which is why American Classic’s new range of tires is so refreshing. </p>\n\n\n\n<p>The brand shut down <a href=\"https://www.bicycleretailer.com/industry-news/2018/01/05/american-classic-closes-factory-puts-ip-assets-sale\" target=\"_blank\">at the end of 2017</a>, but it <a href=\"https://cyclingtips.com/2021/09/american-classic-is-reborn-as-a-road-and-gravel-tire-brand-focused-on-value/\" target=\"_blank\">recently re-emerged from the ashes</a> with eight new tires for road, urban, and gravel applications, all exclusively sold consumer-direct (at least for now). The tread designs are pretty derivative, but my last few months of testing has shown that the tires themselves are actually very good in all the categories that matter: grip, rolling resistance, durability, puncture resistance, and so on. </p>\n\n\n\n<p>Are they <em>the </em>lightest in their respective categories? Or the fastest-rolling?? The grippiest??? No, no, and no. But they’re darn close, and they’re literally half the cost of comparable tires from other brands. Together with American Classic’s surprisingly generous replacement policy, this makes them an easy sell. After all, who wouldn’t want a quality tire for thirty bucks?</p>\n\n\n\n<p>“Disruptive” is a word that gets tossed around far too often, but these feel like the real deal. Now, if American Classic can follow up on this opening act with good mountain bike tires, and then pull off its plan to re-enter the wheel market, I dare say we might be in for some genuine disruption indeed.</p>\n\n\n\n<p><strong>Price: </strong>US$30-35 (sorry, US buyers only for now)<br /><strong>More information:</strong> <a href=\"http://www.amclassic.com\" target=\"_blank\">www.amclassic.com</a></p>\n\n\n\n<hr />\n\n\n\n<h2>Ornot Micro Climate jacket</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Ornot-Micro-Climate-jacket-1-1340x754.jpg\" /></figure>\n\n\n\n<p>I’ve written at length about <a href=\"https://cyclingtips.com/2017/10/gore-tex-shakedry-shootout-who-makes-the-best-waterproof-cycling-jacket/\" target=\"_blank\">how incredible Gore’s ShakeDry jackets are</a>, and I still stand by everything I’ve said over the years. ShakeDry is super waterproof, it’s incredibly thin and light, and it’s totally windproof. If there’s even a chance of weather, this is what goes into my jersey pocket.</p>\n\n\n\n<p>It’s pretty dry where I live overall, though, and even summertime rides often come with huge temperature swings, so protection from water isn’t always as important to me as warmth, breathability, and packability. I still always go ShakeDry if there’s the slimmest possibility of rain, but for every other situation, lately it’s been Ornot’s Micro Climate jacket all the way.</p>\n\n\n\n<p>The Micro Climate is very nicely tailored (and stretchy!), but on paper, it isn’t anything super special otherwise. However, Ornot graces strategic areas of the inside of the jacket with an array of tiny raised fuzzy triangles that keep the shell from sitting directly on your skin. As a result, you end up with this thin layer of air — hence the “Micro Climate” name — that keeps you far warmer than you might expect from something so thin.</p>\n\n\n\n<p>Combined with the exceptional breathability and wind resistance, it’s one of those jackets that somehow manages to be warm almost down to freezing at one end, but still comfy almost in summertime temps at the other, all while still being easy to stuff into a jersey pocket if you want to, and easy to just keep on if you don’t.</p>\n\n\n\n<p>I heard people rave about this jacket for years before I got to try one for myself, and now I understand what all the hype was about. Good luck getting your hands on one, though, because they seem to be perpetually sold out.</p>\n\n\n\n<p><strong>Price: </strong>US$212 / AU$302 / £160 / €188<br /><strong>More information:</strong> <a href=\"https://www.ornotbike.com/collections/jacket-and-vests/products/micro-climate-jacket-stone-blue\" target=\"_blank\">www.ornotbike.com</a></p>\n\n\n\n<hr />\n\n\n\n<h2>CushCore Gravel.CX foam tire inserts</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/CushCore-Gravel.CX-foam-insert-1-1340x754.jpg\" /></figure>\n\n\n\n<p>Perhaps more than any other discipline (save for cyclocross), gravel bike performance is extremely dependent on tires — and more specifically, tire pressure. On the road, the surfaces are smoother and the pressures are much higher so pinch flats aren’t usually a big issue, and on mountain bikes, you’ve got the wiggle room of comparatively massive air volume. For gravel, however, you have ground conditions that are nearly as challenging as when you’re on a trail bike, yet far less casing width to play with to balance things like traction, ride comfort, and flat prevention. More often than not, you have to compromise somewhere.</p>\n\n\n\n<p>That hasn’t been the case since I started running CushCore’s Gravel.CX foam tire inserts.</p>\n\n\n\n<p>The relatively high-density, triangular-profile inserts provide excellent protection against pinch flats, along with lots of extra support to keep the base of the casing from folding over in hard cornering. In the event you spring a leak that you can’t plug, you can even ride them flat if you’re not too far away from home. But best of all, I’ve been able to drop my tire pressures several psi as compared to what I normally run without inserts, all with no noticeable hit to rolling resistance. </p>\n\n\n\n<p>They’re not without downsides, of course. They weigh a little over 100 g per wheel, they’re expensive, they’re a little tricky to install (especially if your rims are at the narrower end of the recommended width scale), and if you need to install a tube, you’re guaranteed to ruin your jersey by wearing a messy foam insert bandolier-style. Unless you’re regularly riding in rocky conditions where pinch flats are common, I’d probably say they’re overkill.</p>\n\n\n\n<p>But at least for where I’m riding, they’ve allowed me to ride my gravel bike like a complete idiot.</p>\n\n\n\n<p><strong>Price: </strong>US$149 / AU$286 / £160 / €175-200<br /><strong>More information: </strong><a href=\"https://www.cushcore.com/gravel-cx-products/\" target=\"_blank\">www.cushcore.com</a></p>\n\n\n\n<hr />\n\n\n\n<h2>Velocolour Rocket Pocket saddle bag</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/VeloColour-Rocket-Pocket-1-1340x754.jpg\" /></figure>\n\n\n\n<p>I feel like I’ve been on the hunt for the “perfect” saddle bag for my entire cycling life. Some are too big, some too small, some just the wrong shape, some with too-flimsy an attachment, and the vast majority of them are far too cheaply made.</p>\n\n\n\n<p>But then I tried the Velocolour Rocket Pocket. </p>\n\n\n\n<p>Based in Toronto, Canada, Velocolour is a tiny outfit that’s perhaps better known for its <a href=\"https://www.instagram.com/velocolour/\" target=\"_blank\">exceptional custom paint work</a>, but the brand also offers a wide range of soft goods. None of it is cheap in terms of cost, but it’s anything but cheap in the other sense of the word, too. Velocolour makes everything in-house in Toronto, the construction quality is exceptional, and the designs are clearly conceived with longevity in mind. </p>\n\n\n\n<p>Velocolour has several saddle bag options, but what I love about the Rocket Pocket is the way its practical rectangular shape is so smartly organized. A spare tube, a CO2 cartridge, and tire levers sit in one area, a multi-tool in another, and they’re separated by a swinging flap with a sleeve for smaller things like glueless patches, money, and medication. The pack is also designed with a hinged cover so you can easily access the multi-tool without worrying about anything else falling out, and the whole thing is held with a simple polyurethane strap that’s super secure, easy to use, and easy to replace. </p>\n\n\n\n<p>Velocolour offers the Rocket Pocket in multiple sizes depending on your needs. I use the smallest one for road bikes, and the medium size for gravel — and if you’re starting from scratch and feeling flush, Velocolour will even sell bags preloaded with fancy Silca tire levers and a multi-tool and tubeless plug kit from Lezyne.</p>\n\n\n\n<p>It’s certainly possible that something else might come along to knock the Rocket Pocket off the top podium spot, but at this point, I think I’m done looking.</p>\n\n\n\n<p><strong>Price: </strong>C$78-82 (pricing for other regions varies with exchange rate)<br /><strong>More information: </strong><a href=\"https://www.velocolour.com/shop/rocket-pocket\" target=\"_blank\">www.velocolour.com</a>   </p>\n\n\n\n<hr />\n\n\n\n<h2>Ratio Technology 12-speed conversion kit</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/Ratio-Technology-1x12-SRAM-conversion-kit-review-9-1340x754.jpg\" /></figure>\n\n\n\n<p>We’ve spoken at length here at CyclingTips (particularly on <a href=\"https://cyclingtips.com/2020/10/nerd-alert-podcast-12-speed-for-everyone-and-in-house-brands/\" target=\"_blank\">the Nerd Alert podcast</a>) about how much we like SRAM’s aging 11-speed mechanical road drivetrains, and how much we wish SRAM (and Shimano) would devote some resources to further advancing the genre instead of only offering electronic systems at the high end. That’s not likely to happen, of course, but when UK company Ratio Technology came out with <a href=\"https://cyclingtips.com/2020/10/ratio-technology-sram-1x12-speed-upgrade-kit/\" target=\"_blank\">its 12-speed conversion kit</a> for older 11-speed SRAM DoubleTap mechanical road levers, I was pretty excited.</p>\n\n\n\n<p>Thankfully, that initial excitement didn’t fade once I had <a href=\"https://cyclingtips.com/2021/10/ratio-technology-1x12-upgrade-kit-review-lightweight-12-speed-on-a-budget/\" target=\"_blank\">the chance to review it myself</a>.</p>\n\n\n\n<p>The kit is very simple, consisting of a replacement ratchet for the lever and a modified cable fin for a 12-speed SRAM Eagle mountain bike rear derailleur, and it’s all impressively easy to install. More importantly, it works as advertised, offering that ultra-tactile shift action so many of us like, but now with the option of true wide-range 1×12 gearing.</p>\n\n\n\n<p>The system is pretty sensitive to adjustment and cable friction, but there are otherwise no real downsides that I’ve encountered. It never runs out of batteries, it’s easy to fix and service — particularly in the field — and it breathes new life into older components that many performance-minded riders may have already put out to pasture. </p>\n\n\n\n<p>Ratio has plans for a 2×12 conversion kit, too, so I like where this is going. Don’t get rid of those 11-speed SRAM mechanical road shifters just yet, folks.</p>\n\n\n\n<p><strong>Price: </strong>£75-95 (complete kit; pricing for other regions varies with exchange rate)<br /><strong>More information: </strong><a href=\"https://ratiotechnology.com/\" target=\"_blank\">www.ratiotechnology.com</a></p>\n\n\n\n<hr />\n\n\n\n<h2>Gummy bears</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/gummy-bears-1-1340x754.jpg\" /></figure>\n\n\n\n<p>At this point in my life, I think I’ve tried every energy bar, gel, drink, and concoction under the sun. I settled on <a href=\"https://cyclingtips.com/2016/12/ten-products-i-loved-in-2016-james-huang/\" target=\"_blank\">Skratch hydration mix</a> in my bottles several years ago as it seems to work best for my stomach, so that takes care of my fluids and salts. When it comes to replacing calories spent during a ride, there are obviously countless fancy ways to do so, but what I’ve discovered is that I run great on a steady stream of straight-up sugar — and my delivery vehicle of choice is gummy bears.</p>\n\n\n\n<p>Just nine of these little guys pack about 100 calories, the soft texture is easy to chew while in the saddle, there are a ton of different flavors and shapes available, they’ve available almost anywhere, and they’re dirt cheap, especially if you buy them in bulk at the grocery store like I do. </p>\n\n\n\n<p>Do they offer any sort of supplemental minerals or amino acids? Were they developed using some cutting-edge sport science? Are they endorsed by some big-name pro? No, no, and no. But I love them so, and I dare you to try to get me on something else.</p>\n\n\n\n<p><strong>Price: </strong>Not much.<br /><strong>More information:</strong> Seriously? Just go to the store already.</p>\n\n\n    <div>\n    <div>\n\t\n\n\n\n<p><em>Stay tuned for more <a href=\"https://cyclingtips.com/tag/most-loved-2021/\" target=\"_blank\">’10 products I loved in 2021′</a> articles from other members of the CyclingTips team. In the meantime, you can catch up on all of <a href=\"https://cyclingtips.com/tag/most-loved-2020/\" target=\"_blank\">last year’s picks</a>. Or go back further into the archives for our round-ups from <a href=\"https://cyclingtips.com/tag/most-loved-2019/\" target=\"_blank\">2019</a>, <a href=\"https://cyclingtips.com/tag/most-loved-2018/\" target=\"_blank\">2018</a>, and <a href=\"https://cyclingtips.com/tag/most-loved-2017/\" target=\"_blank\">2017</a>.</em></p>\n\n\n    </div>\n    </div>\n\t\n<p></p><a href=\"https://cyclingtips.com/2021/12/10-products-i-loved-in-2021-james-huang/\">Read More</a>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"18d508956be130a2f873c2c9fa98ce380beb49d68a99dbb624fb4631f60ffc55","category":"Cycling"}