{"title":"C-reactive Protein Pretreatment-Level Evaluation with Histopathological Correlation for Chondrosarcoma Prognosis Assessment&mdash;a 15-Year Retrospective Single-Centre Study","link":"https://www.preprints.org/manuscript/202405.1840/v1","date":1716899546000,"content":"Background: An aberrant cellular microenvironment characterized by pathological cells or inflammation represents an added risk factor across various cancer types. While the significance of chronic inflammation in the development of most diffuse tumors has been extensively studied, an exception to this analysis exists in the context of Chondrosarcomas. Chondrosarcomas represent 20–30% of all skeletal sarcomas and have an estimated incidence of 1 in 100,000 worldwide. The mean age of presentation is 50, with over 70% of patients over the age of 40 at the time of diagnosis. The aim of this retrospective study was to analyze the role of C-reactive protein (CRP) as a prognostic factor in relation to the histopathological findings for Chondrosarcoma. Methods: This retrospective study included 73 patients with confirmed Chondrosarcoma diagnosis treated between 2004 and 2019. Preoperative CRP determination was assessed in mg/dL with a non-pathological value below 0.5 mg/dL. Disease-free survival time was calculated as the time between the initial diagnosis and an event like local recurrence or metastasis. Follow-up status was described in death of disease, no evidence of disease and alive with disease. The exclusion criteria of this study included insufficient laboratory values, lack of information regarding the follow-up status and incomplete histopathological report. Results: The calculate risk estimation of a reduced follow-up time was 2,25 time higher in the patients with an CRP level &amp;gt;0.5 mg/dL (HR 2,25 and 95% CI 1,13-4,45) and 3 times higher in patients with a tumour size &amp;gt;pT2 (HR 3 and 95% CI 1,59-5,92). We can easily confirm that the most elevated risk for a reduce follow-up time relies in chondrosarcomas high grading, preoperative pathological CRP- level and a size &amp;gt;8 cm. Conclusions: In Chondrosarcoma cases, we can consider CRP pretreatment value &amp;gt;0.5 mg/dL a sensitive prognostic and sensitive risk factor for distant metastasis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"18d6bc049454c4f1191635332e5011f75cb8a7e3d2669c23a5f9bf73727bf018","category":"Interdisciplinary"}