{"title":"Upstart Italian shoe brand UDOG goes gravel with the Distanza","link":"https://www.cyclingtips.com/2023/03/upstart-italian-shoe-brand-udog-goes-gravel-with-the-distanza/","date":1678953613000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/ANDY1036.jpg?width=1200\" alt=\"Upstart Italian shoe brand UDOG goes gravel with the Distanza\" /></figure><p>A year on from introducing itself to the world with a pair of road shoes, Italian direct to consumer brand <a href=\"http://cyclingtips.com/tag/udog\" target=\"_blank\">UDOG</a>, short for underdog, is expanding into gravel with the Distanza, a bold shoe design sure to turn some heads.<span> </span></p>\n<p>The word “unique” gets thrown around liberally these days, but with its rubberized toe cap, the Distanza truly is different from other cycling shoes on the market. And that’s no accident. “I wanted to make it as unique as possible,” UDOG founder Alberto Fonte told <i>CyclingTips. </i>“Maybe it’s not everyone’s cup of tea, but I wanted something different in design.”</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/DISTANZA-Cinder-Black_01.jpg?width=730\" alt width=\"1090\" height=\"871\" /><figcaption><span>The rubber outsole extends to the toes for extra durability.</span></figcaption></figure>\n<p>For fans of sneakers, the look is somewhat similar to the Nike Waffle Racer, a vintage running shoe with rubber tread extending up the sides of the toe box.</p>\n<p><strong>Also read:</strong> <a href=\"https://www.cyclingtips.com/2023/03/specialized-s-works-recon-review/\" target=\"_blank\">Specialized S-Works Recon shoe review: hidden features included</a></p>\n<p>However, the Distanza isn’t different just to be different; there is good reason behind the design. The front and sides of the shoe is most likely to encounter extra abuse, whether from rogue rocks kicked up by a rider up the trail, or from scraping a shoe against trailside boulders, or snags with thorns or other vegetation. This cap should keep the Distanza on the trail for extra miles.</p>\n<p>The rubber toe cap is an extension of the rubber outsole, which runs all the way back to the heel, protecting the bottom of the shoe from scrapes and providing more traction. Beneath that, UDOG offers the shoe in two different outsole versions: carbon or nylon.<span> </span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/DISTANZA-Cinder-Black_03-1340x1072.jpg?width=730\" alt width=\"1340\" height=\"1072\" /><figcaption><span>The Distanza keeps it old school with laces.</span></figcaption></figure>\n<p>The carbon version is being advertised as focused on racing and performance, and gets a weight cut compared to the nylon version, which UDOG bills as an adventure model. The carbon upgrade will be a $75 USD premium over the nylon version. More on pricing later.</p>\n<p>Otherwise, the shoe relies on a laced design, just like UDOG’s Cima and Tensione road models, and makes use of the same patented Tension Wrap System, TPU laminated straps that wrap the insole from one side of the shoe to the other. UDOG says this feature hugs the foot, supporting it throughout the pedal stroke. A deep heel cup and spacious toe box define the rest of the shoe’s fit.<span> </span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/DISTANZA-Ash-Grey_04-1340x1675.jpg?width=730\" alt width=\"1340\" height=\"1675\" /><figcaption><span>The Distanza has the same patented Tension Wrap System as UDOG’s road models.<br />\n</span></figcaption></figure>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/DISTANZA-Ash-Grey_05-1340x1675.jpg?width=730\" alt width=\"1340\" height=\"1675\" /><figcaption><span>A heel tab makes putting on the shoes easier. </span></figcaption></figure>\n<h2>Pricing</h2>\n<p>As a direct to consumer brand, UDOG sells its shoes at relatively attractive prices.</p>\n<p>The carbon version costs $275 USD / €250 / £220. The nylon version costs $2 USD / €180 / £160.<span> </span></p>\n<h2>Weight</h2>\n<p>The carbon version weighs 315 grams per shoe in a size 42, while the same size shoe in nylon adds 15 grams per shoe, bringing the total to 330 grams each.<span> </span></p>\n<h2>Colors</h2>\n<p>As for colors, there are two available: black and gray, both of which should be easy to pair with your entire wardrobe of kits. The caveat here is that each color is tied to the type of outsole, black for carbon and gray for nylon.</p>\n<h2>Sizing</h2>\n<p>There are 11 sizes from 38 to 48, but no half sizes.</p>\n<h2>Availability</h2>\n<p>The shoes are available now from <a href=\"http://udog.cc\" target=\"_blank\"><span>udog.cc</span></a></p>\n<p><i>CyclingTips</i> is getting a pair in to test. Look for a review soon.</p>","author":"Will Tracy","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"18d975e543909fc5b3a942b70d0834d8860f0a5ee273acbc65c4fee4e7b2e08c","category":"Cycling"}