{"title":"Integrative taxonomy using historical specimens provides evidence for a single species of bushbuck, Tragelaphus scriptus (Mammalia: Bovidae)","link":"https://academic.oup.com/zoolinnean/article/200/2/532/7281963?rss=1","date":1695600000000,"content":"<span><div>Abstract</div>The bushbuck (<span>Tragelaphus scriptus</span>) is an antelope widely distributed throughout sub-Saharan Africa that varies greatly in body size, horn length and coat patterning. Recent taxonomic work has suggested reclassification as two or more species. Molecular studies have shown a deep mitochondrial divergence between north-western (scriptus) and south-eastern (sylvaticus) bushbuck populations, and morphological assessments, based largely on coat patterning, have divided the bushbuck into as many as eight species and 32 subspecies. Molecular and morphological approaches have, to date, not been brought together in a single integrative study. Using 43 museum cranial specimens, we sequenced complete mitochondrial genomes and used three-dimensional geometric morphometrics to compare genetic and phenotypic divergence between the two main subclades of the <span>T. scriptus</span> species complex. We found a significant but weak relationship between phenotypic and genetic distances. Mean body size differed between males of each subclade, but morphological differences attributable to sexual dimorphism within subclades were greater than differences between subclades. Despite a mitochondrial divergence of nearly 3 Myr, cranial morphological differences between subclades were minor and could be accounted for largely by minor size differences between males (size–shape allometry). These results support the recognition of a single bushbuck species, as indicated by nuclear genetic data.</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"18ded1ca6a64132c910ed75044ce5069cd68134c0137a3245b7807993b830147","category":"Environment"}