{"title":"Extracellular Enzymes of Soils under Different Tillage: Predicted Functional Potential and Actual Activity","link":"https://www.preprints.org/manuscript/202408.0781/v1","date":1723450122000,"content":"Conventional farming relies on large-scale, intensive crop production using mechanical tillage and synthetic inputs like chemical fertilizers and pesticides, which, despite being economically beneficial, can be environmentally destructive, whereas organic cropping system offers a more sustainable alternative with less harmful environmental impact. But is organic system more beneficial for soil health than conventional? In this study, we focused on evaluating the functional potential of soil for the conversion of carbon, nitrogen, phosphorus, and sulfur, as well as measuring the actual activity of enzymes involved in these cycles. We used Chernozem soil samples from fields that were managed using organic (OCS) and conventional (CCS) methods as the objects of our study. Another objective of the study was to compare two methods: profiling of functional genes of the microbial community and measurement of actual enzyme activity. The comparison of OCS versus CCS indicates that functional gene profiling and enzymatic activity measurements similarly capture qualitative differences between these systems, but diverge in how they assess quantitative differences. A combination of these two methods for assessing soil conditions appears to be promising. Overall, the study demonstrated that the agronomic practices used in the conventional cropping system not only preserved the functional properties of the soil microbiome but also significantly enhanced its microbiological activity for nutrient bioconversion compared to the organic cropping system. However, the question remains as to how long the conventional system can sustain its high potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"18e56eb22855c0c218fb46f0b635d835079d61d093e5ef949311c629967fb586","category":"Interdisciplinary"}