{"title":"Preparation of quick-dissolving nanofibre face masks based on Needleless Electrostatic spinning","link":"https://www.preprints.org/manuscript/202405.0694/v1","date":1715336544000,"content":"With the rapid growth of the global mask market, consumers have put forward higher requirements for the functionality and ingredients of mask products. Conventional facial masks generally use ordinary non-woven fabrics as the mask base fabric, are frequently used with essence and contain preservatives. At the same time, they are susceptible to the influence of the external environment and are easily oxidized, which will cause the mask to deteriorate and skin allergic reactions. In addition, conventional facial masks exhibit poor skin fit, limited breathability, inadequate absorption of nutrient solutions, and easy to drip. The nanofiber mask prepared by electrospinning technology has a high specific surface area and high porosity, which enabling improved nutrient absorption by the skin, superior skin fit, and exceptional breathability. Nanofiber facial mask products can effectively solve consumer pain points and promote the high-end development of facial mask products. Therefore, this research combines needleless electrospinning technology to develop a novel solid-state, preservative-free, and quick-dissolving nanofiber facial mask that can be prepared on a large scale. Based on needleless electrospinning technology, this research deeply explores the process parameters and influencing mechanisms of quick-dissolving nanofiber facial masks, ultimately achieving the consistent production of nanofiber facial masks with optimal morphology. Comprehensive and evaluation of the structure and performance of nanofiber facial masks from micro and macro perspectives. The experimental results show that the mask morphology is optimal under the process conditions of using a spinning liquid of 20% collagen peptide solution, a spinning voltage of 30kV, a collection distance of 19cm, and a liquid supply speed of 130ml/h.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"18e71ab389d3e1387ed68f4d5a70cf8b241d931456d06e19c8d1a3440775a441","category":"Interdisciplinary"}