{"title":"Emergent Properties and Robustness of Species–Habitat Networks for Global Terrestrial Vertebrates","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13912?af=R","date":1726056669000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>Habitat loss is the dominant cause of biodiversity decline around the world, yet the complexity and stability of terrestrial assemblages related to suitable habitats have been almost unknown on a global scale.</p>\n<h2>Location</h2>\n<p>Global.</p>\n<h2>Time Period</h2>\n<p>Contemporary.</p>\n<h2>Major Taxa Studied</h2>\n<p>Mammalia, Aves, Reptilia, Amphibia.</p>\n<h2>Methods</h2>\n<p>We constructed gridded maps of species–habitat networks of terrestrial vertebrates based on global species distributions and a recently developed habitat type dataset. Then, we investigated the biogeographic patterns of emergent network structures and analysed network robustness to habitat loss by simulating habitat removals on a global scale.</p>\n<h2>Results</h2>\n<p>We found that, compared with reptiles and amphibians, the species–habitat networks of mammals and birds were characterised by higher habitat diversity, connectance and modularity. All four taxonomical groups have high robustness globally, but after adjusting for species and habitat diversity, we found a variation of surplus and deficiency of network structures and robustness. Temperature and precipitation contributed most to relative network robustness globally, whereas geographical and human population factors played important roles in scattered regions on all continents.</p>\n<h2>Main Conclusions</h2>\n<p>Overall, we provide novel insights into the biogeographic patterns of species–habitat connections through a network approach, which can help to identify gaps for reestablishing species–habitat links to improve conservation outcomes.</p>","author":"Xiyang Hao, \nMartin Jung, \nYiwen Zhang, \nChuan Yan","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"18e99b571eb234280950747e6277d78efd632db588f3c4ca17e2d7aabdc352f5","category":"Environment"}