{"title":"Anna van der Breggen: Vuelta Femenina 'not Van Vleuten's best victory' after controversial tactics","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/anna-van-der-breggen-annemiek-won-the-vuelta-femenina-because-of-a-pee-stop-it-s-not-her-best-victory","date":1683891244000,"content":"\n      <p><span>When Anna van der Breggen retired after the 2021 season, her compatriot Annemiek van Vleuten may have expected that to be the end of the long-time rivalry between the two riders which has formed a key part of the narrative in the women’s peloton over the last decade. However, with Van der Breggen quickly settling into a sports director role with SD Worx after retirement, she still remains a key part of the set-up in the world number one Dutch team, meaning competition with Van Vleuten has continued, albeit in a different way.</span></p>\n<div></div>\n<p>Van der Breggen’s influence on SD Worx can be seen clearly in the performances of the rider who many would call her successor, Demi Vollering. When Vollering took <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/years-in-the-making-demi-vollering-reigns-as-queen-of-the-huy-at-fleche-wallonne\">victory in La Flèche Wallonne</a> earlier this season, for example, she did so with exactly the same style and class that Van der Breggen exhibited when she won the race seven times during her career. From the point she began her effort on the Mur de Huy with metronomic pedalling style and perfected timing, it was clear that she had taken instruction and inspiration from the performances of her sports director. Van der Breggen is now also Vollering’s coach, meaning that the two Dutch women know each other extremely well.</p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230505LVF03007-UNIPUBLIC___CXCLING_1024x1024.jpg?v=1683883845\" alt />And just like Van der Breggen was in her career, Vollering has now become a key obstacle between Movistar's Van Vleuten and race victories. The world champion was unable to respond to the dominance of Vollering and SD Worx during the cobbled and Ardennes Classics, and at the first major stage race of the season, this trend looked to be continuing. On the first key mountain stage of the race which saw the riders climb up to the Mirador de Peñas Llanas, Vollering confidently outsprinted Van Vleuten and won the stage, looking quite clearly like the stronger of the two riders.</span></p>\n<p><span>However, things turned upside down for Vollering the following day, when what should have been a simple stage for the SD Worx rider saw the red leader’s jersey change hands after she was distanced in a crosswind section. Afterwards, it transpired that Vollering had stopped for a nature break and she argued that the likes of Movistar decided to ride hard on the front of the bunch while knowing she was stopping by the side of the road. Vollering wrote the word “deception” on Instagram afterwards to describe how her day had gone, and many raised questions over the sportsmanship of Movistar’s actions.</span></p>\n<p><span>Van Vleuten argued that Movistar had always planned to try to split the bunch at that point of the race and suggested that SD Worx stopping for a toilet break just before the crosswinds was their own mistake. </span></p>\n<p><span>After Vollering won the final stage of the race but still narrowly missed out on the overall victory by just nine seconds – time she had lost the day before due to the ill-timed pee stop, Van der Breggen, who was in the SD Worx team car as sports director, argued that the reason Vollering didn’t take the overall victory was “a pity”.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230507LVF03004-UNIPUBLIC___SPRINT_CYCLING_AGENCY_1024x1024.jpg?v=1683883916\" alt />“When you pee and they start the echelon, it's not the most sporting thing to do,” she said after the race. “I think if you look now at the win of Annemiek, you know, actually it's because of that. I think it's not her best victory, but anyway, we tried what we did today to still beat the girls and have the general and Demi came really close.”</span></p>\n<p><span>She added that pee stops are an inevitable part of the sport and riders should not be made to feel afraid if they need to stop for this reason. “In the end, if nothing had happened yesterday then Demi would have won the general classification. It's a bit of a pity the reason why she is losing it. If riders cannot do a pee stop anymore, then cycling is going to be difficult. But after the spring we had, it's normal that they are really trying to beat us in every way, and that’s what they did,” Van der Breggen said.</span></p>\n<p><span>While the Dutch team exhibited clear frustration after the Vuelta Femenina, Van der Breggen remained pragmatic looking ahead to the rest of the season. “A lot of races are coming up and we still had two stage wins here and a really good feeling of course, because if you beat the girls on climbs in this way it’s a really good sign.”</span></p>\n<p><span>The drama of the Vuelta Femenina certainly sets the stage for Van Vleuten and Vollering’s rivalry to continue as stage races come thick and fast at this point in the season. Movistar and SD Worx are two very different teams who are both hungry for success and this is making racing this season explosive and dramatic. Whether it can be blamed on pee stops or not, the Vuelta Femenina was one of the most exciting stage races from the women’s peloton in recent memory, and cycling fans can get the popcorn out for the rest of the season.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"18ec8ea33978721ebb7a0711ff1c0904a8248eaf73abb0c3d041edc3bc32e13b","category":"Cycling"}