{"title":"398 Effects of timing of fat supplementation on intake, growth performance, carcass characteristics, and methane emissions of finishing beef cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/377/7757159?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Feeding supplemental fat is a common strategy to increase energy density of finishing diets and mitigate enteric methane (CH<sub>4</sub>) emissions. Recent increases in cost of supplemental fat sources may warrant reduced inclusion and modified feeding strategies. The objective of this experiment was to evaluate the effects of different fat supplementation strategies on growth performance and CH<sub>4</sub> emissions of finishing beef cattle. Crossbred steers (n = 54; initial body weight [BW] = 451 ± 3.86 kg) were housed in 6 pens equipped with electronic gates (American Calan Inc., Northwood, NH) allowing individual measurement of feed intake. The basal diet consisted of (DM basis): 62% steam-flaked corn, 20% Cargill Sweet Bran, 3.4% dried distillers grains, 9% corn stalks, 0.6% urea, and 5% vitamin and mineral supplement. Steers were ranked by paired-day unshrunk BW (d -1 and 1), blocked as light or heavy, and randomly assigned to 1 of 4 dietary treatments: 1) no supplemental fat throughout the finishing phase (d 1 to 119; NoFat); 2) 1.5% supplemental fat throughout the finishing phase (d 1 to 119; TotalFat); 3) 1.5% supplemental fat from d 1 to 58 followed by no supplemental fat from d 59 to 119 (EarlyFat); or 4) no supplemental fat from d 1 to 58 followed by 1.5% supplemental fat from d 59 to 119 (LateFat). For treatment diets containing added fat, 1.5% of steam-flaked corn was replaced with 1.5% of corn oil on a DM basis. Paired-day unshrunk BW was recorded on d -1, 1, 58, 59, 118, and 119 to determine average daily gain (ADG) and feed efficiency (gain to feed; G:F). GreenFeed systems (C-Lock Inc.; Rapid City, SD) measured daily CH<sub>4</sub> production (DMP; g CH<sub>4</sub>∙d<sup>-1</sup>) which was used to determine CH<sub>4</sub> yield (MY; g CH<sub>4</sub>∙kg DMI<sup>-1</sup>) and CH<sub>4</sub> emission intensity (MI; g CH<sub>4</sub>∙kg ADG<sup>-1</sup>). Animals were harvested on d 119 to determine hot carcass weight (HCW), dressing percentage (DP), 12<sup>th</sup> rib fat thickness (FT), ribeye area (REA), kidney pelvic and heart fat (KPH), and USDA yield grade (YG). Data were analyzed using SAS with steer as the experimental unit, a fixed effect of treatment, and random effects of block and steer(treatment). There was no treatment effect on BW, DMI, ADG, or G:F (<span>P</span> ≥ 0.85). There was no treatment effect on DMP, MY, or MI (<span>P</span> ≥ 0.49). There was no treatment effect on HCW, DP, FT, REA, and KPH (<span>P</span> ≥ 0.19). TotalFat had greater (<span>P</span> &lt; 0.05) YG than EarlyFat, but no other differences in YG were observed (<span>P</span> ≥ 0.05). Supplementing crude corn oil at 1.5% of diet DM does not affect growth performance or reduce CH<sub>4</sub> emissions of finishing beef cattle; indicating there may be a minimum threshold of fat inclusion to elicit significant changes.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"18f3e6de5e0b3aad70ae00546db70cbaf8c9c355e7d3d42427694b3a9a276808","category":"Environment"}