{"title":"Use of mushrooms as antioxidants in lipid oxidation model under indirect and direct oxidation test: Ethanolic extracts of Ganoderma resinaceum and Phlebopus bruchii","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13497?af=R","date":1711718339000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Foods contain lipids that are easily susceptible to oxidation, which can modify their sensory properties. While these compounds provide characteristic flavours and odours, but unwanted compounds, such as volatile secondary oxidation products, can also be found, representing a recurring problem for both the industry and consumers. Synthetic antioxidants are often employed to prevent this, but their chronic consumption can be detrimental to human health. This work evaluates the antioxidant potential of ethanolic extracts from <i>Ganoderma resinaceum</i> and <i>Phlebopus bruchii</i> using an accelerated oxidation test.</p>\n<h2>Results</h2>\n<p>The composition profile of the extracts was investigated, identifying the presence of tryptophan, quinic acid, caffeic acid, and 3,4-DHPG. The antioxidant capacity of the extracts was compared to that of BHT in sunflower oil that was oven-heated at 60°C. Chemical (peroxide value, p-anisidine value, and conjugated dienes) and volatile (2-octenal, 2-heptenal, and 2,4-decadienal) indicators were measured over 28 days. The peroxide value decreased for both extracts at a similar level to that of BHT 0.02% w/w, and conjugate dienes decreased in the presence of GR 0.1% w/w. Meanwhile, p-anisidine exhibited a slightly greater decrease for PB 0.1% w/w than for BHT. The sample with 0.1% w/w of extracts showed a reduction in volatile secondary oxidation compounds, indicating significant antioxidant activity.</p>\n<h2>Conclusion</h2>\n<p>Based on these results, both extracts could be proposed as potential antioxidants in foods with high lipid content.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"M.E Mariani, \nN.S Juncos, \nN.R. Grosso, \nR.H Olmedo","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"190b1119f5f5bd62a45ab03afab970554b5b72910c95e2809f7f7d40ab43fa8f","category":"Environment"}