{"title":"Difficulties and challenges experienced by nurses in eldercare institutions in Albania: A qualitative content analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300774","date":1711548000000,"content":"<p>by Nertila Podgorica, Emiljano Pjetri, Andreas W. Müller (M. A.), Susanne Perkhofer</p>\r\nIntroduction <p>The global and Albanian populations of elderly people are steadily increasing. It is estimated that the number of elderly adults requiring care in Albania will rise from 90.9 thousand to 130.4 thousand by 2030. Despite the envisaged increase in the number and life expectancy of the elderly population in Albania, which will result in an increased demand for nursing care, little is known about the difficulties and challenges that nurses face while providing care for elderly Albanian individuals.</p> Aim <p>To explore the difficulties and challenges nurses experience while caring for elderly people in Albanian eldercare institutions.</p> Methods <p>The study employed a qualitative design using purposive sampling of 20 nurses in 8 eldercare institutions who participated in face-to-face semi-structured interviews. The audio-recorded interviews were transcribed and subsequently subjected to analysis using Graneheim and Lundman’s qualitative conventional content analysis. Data analysis was supported by the qualitative data analysis software MAXQDA 2020. The reporting of this study followed the consolidated criteria for reporting qualitative research (COREQ) checklist.</p> Results <p>Five key categories emerged from data analysis: (1) professional difficulties, (2) educational difficulties, (3) relationship challenges, (4) increased mental stress, and (5) participation in advocacy. This study showed that nursing staff experienced many barriers, challenges, and unmet needs when implementing care for elderly people in long-term care facilities.</p> Conclusion <p>The findings indicate that nurses working in eldercare institutions faced significant challenges in caring for elderly people. Nurses need more legal, financial, educational, and emotional support. The study indicates that more organizational and national support is necessary for nursing staff to care for elderly people in eldercare Albanian institutions properly. Eldercare institution leaders need to recognize the importance of their role in overcoming the barriers and providing adequate support for their staff in caring for elderly people.</p>","author":"Nertila Podgorica","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"190ef81074f3e1b5c07d014a8fec4da4f478769ae79d443f6cdc62f8822db3e6","category":"Interdisciplinary"}