{"title":"Teams will represent cities at the inaugural Into the Lion’s Den race","link":"https://cyclingtips.com/2021/10/teams-will-represent-cities-at-the-inaugural-into-the-lions-den-race/","date":1634252581000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/lionsdenjersey-650x387.jpg\" /></div><h2>Teams will represent cities at the inaugural Into the Lion's Den race</h2><p>\n</p><p>The first edition of Into the Lion’s Den powered by SRAM, a <a href=\"https://cyclingtips.com/2021/09/the-richest-crit-in-us-history-is-coming-to-sacramento-this-october/\" target=\"_blank\">new event founded by Justin Williams</a>, will see the men’s race contested by teams representing cities in a format intended to mirror other major team sports.</p>\n\n\n\n<p>The event announced on Thursday that “each rider will wear a unique jersey showcasing their City Team, last name, and an oversized individual number for fans to easily identify and cheer on their favorite riders” at the race.</p>\n\n\n\n<p>“Fans will witness a new format of racing in the men’s race,” said Justin Williams, the L39ION of Los Angeles founder who is also behind the Into the Lion’s Den race. “We’re testing out City Teams to create allegiances between fans and their communities. Fans will be able to cheer on teams from their cities or hometowns, just like they do with football and baseball. Plus, they will be able to identify their favorite riders by seeing their last names and team number across their entire backs, just like basketball.”</p>\n\n\n\n<p>In short, a number of US domestic trade teams will race with updated jerseys to represent places where they have ties. The Sacramento-based Voler Factor Cycling Team, for instance, will race as the SAC team, the Aminorip Factory Racing Team will represent South Florida, and Bahati Foundation riders will race as the Compton team. In total, 14 City Teams have been announced, with L39ion fielding two squads for the race.</p>\n\n\n\n<p>“The City Team format will create a unique bond between fans, teams and riders,” said Bahati Foundation founder and Compton team director Rahsaan Bahati. “I think Into the Lion’s Den is going to develop fans through community pride and inspire the next generation by showcasing their local heroes.”</p>\n\n\n\n<p>The event, which will also feature a women’s race and will offer the largest equal prize money amounting to the largest purse in American crit racing history, is set to take place in Sacramento on October 30.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/teams-will-represent-cities-at-the-inaugural-into-the-lions-den-race/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"19220a951864df271c8a6e0ddc1be7cee245f476cf5e0fe50be3c1744be0b85c","category":"Cycling"}