{"title":"Seasonal tissue-specific gene expression in wild crown-of-thorns starfish reveals reproductive and stress-related transcriptional systems","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002620","date":1715695200000,"content":"<p>by Marie Morin, Mathias Jönsson, Conan K. Wang, David J. Craik, Sandie M. Degnan, Bernard M. Degnan</p>\r\n\r\nAnimals are influenced by the season, yet we know little about the changes that occur in most species throughout the year. This is particularly true in tropical marine animals that experience relatively small annual temperature and daylight changes. Like many coral reef inhabitants, the crown-of-thorns starfish (COTS), well known as a notorious consumer of corals and destroyer of coral reefs, reproduces exclusively in the summer. By comparing gene expression in 7 somatic tissues procured from wild COTS sampled on the Great Barrier Reef, we identified more than 2,000 protein-coding genes that change significantly between summer and winter. COTS genes that appear to mediate conspecific communication, including both signalling factors released into the surrounding sea water and cell surface receptors, are up-regulated in external secretory and sensory tissues in the summer, often in a sex-specific manner. Sexually dimorphic gene expression appears to be underpinned by sex- and season-specific transcription factors (TFs) and gene regulatory programs. There are over 100 TFs that are seasonally expressed, 87% of which are significantly up-regulated in the summer. Six nuclear receptors are up-regulated in all tissues in the summer, suggesting that systemic seasonal changes are hormonally controlled, as in vertebrates. Unexpectedly, there is a suite of stress-related chaperone proteins and TFs, including HIFa, ATF3, C/EBP, CREB, and NF-κB, that are uniquely and widely co-expressed in gravid females. The up-regulation of these stress proteins in the summer suggests the demands of oogenesis in this highly fecund starfish affects protein stability and turnover in somatic cells. Together, these circannual changes in gene expression provide novel insights into seasonal changes in this coral reef pest and have the potential to identify vulnerabilities for targeted biocontrol.","author":"Marie Morin","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"19283a40cb19976afbad5ca9286c96daf8301bfa8092159b5dd3e193a28ddf84","category":"Environment"}