{"title":"An aquaculture risk model to understand the causes and consequences of Atlantic Salmon mass mortality events: A review","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12917?af=R","date":1714806000000,"content":"<h2>Abstract</h2>\n<p>Mass mortality events (MMEs) are defined as the death of large numbers of fish over a short period of time. These events can result in catastrophic losses to the Atlantic salmon aquaculture industry and the local economy. However, they are challenging to understand because of their relative infrequency and the high number of potential factors involved. As a result, the causes and consequences of MMEs in Atlantic salmon aquaculture are not well understood. In this study, we developed a structural network of causal risk factors for MMEs for aquaculture and the communities that depend on Atlantic salmon aquaculture. Using the Interpretive Structural Modeling (ISM) technique, we analysed the causes of Atlantic salmon mass mortalities due to environmental (abiotic), biological (biotic) and nutritional risk factors. The consequences of MMEs were also assessed for the occupational health and safety of aquaculture workers and their implications for the livelihoods of local communities. This structural network deepens our understanding of MMEs and points to management actions and interventions that can help mitigate mass mortalities. MMEs are typically not the result of a single risk factor but are caused by the systematic interaction of risk factors related to the environment, fish diseases, feeding/nutrition and cage-site management. Results also indicate that considerations of health and safety risk, through pre- and post-event risk assessments, may help to minimize workplace injuries and eliminate potential risks of human fatalities. Company and government-assisted socio-economic measures could help mitigate post-mass mortality impacts. Appropriate and timely management actions may help reduce MMEs at Atlantic salmon cage sites and minimize the physical and social vulnerabilities of workers and local communities.</p>","author":"Zaman Sajid, \nA. Kurt Gamperl, \nChristopher C. Parrish, \nStefanie M. Colombo, \nJavier Santander, \nCharles Mather, \nBarbara Neis, \nIngunn Marie Holmen, \nRamón Filgueira, \nCynthia H. McKenzie, \nLissandra Souto Cavalli, \nMohamed Jeebhay, \nWenzhao Gao, \nMaría Andrée López Gómez, \nCory Ochs, \nSarah Lehnert, \nCyr Couturier, \nChristine Knott, \nJoão F. Romero, \nAlbert Caballero‐Solares, \nAllan Cembella, \nHarry M. Murray, \nIan A. Fleming, \nJoel Finnis, \nMark D. Fast, \nMark Wells, \nGerald G. Singh","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"19311d97687a3c88133ac27805214d4ed36f007d43a0a92fb90968026246dd6a","category":"Environment"}