{"title":"This autonomous cargo train wants to fix the problem of underused rails","link":"https://arstechnica.com/?p=1967349","date":1694533937000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/23_Parallel_MK2_High-speed-1-800x533.jpg\" alt=\"A yellow cargo container rides on an autonomous rail car\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/23_Parallel_MK2_High-speed-1-scaled.jpg\">Enlarge</a> <span>/</span> No, this is not a screen grab from the movie <em>Logan</em>. It's Parallel Systems' second-generation autonomous electric rail vehicle. (credit: Parallel Systems)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p><a href=\"https://arstechnica.com/cars/2016/04/europe-completes-a-demonstration-of-semi-autonomous-truck-platooning/\">Platoons of driverless cargo trucks</a> cruising across highways is one of those tempting technocrat ideas that doesn't look like it will pan out. As autonomous driving technology matured in the middle of the last decade, we saw trials of the concept, but human truck drivers do more than just throttle, steer, and brake, and they aren't likely to be replaced soon.</p>\n<p>A better idea would be to shift some of that cargo to our underutilized railways—here, the idea of platooning is an old one, better known as a \"train.\" Parallel Systems hopes to do just that with its second-generation autonomous battery-electric freight railcar.</p>\n<p>\"Our goal is to transfer more of the trucking traffic onto the railroad. In order to do that, the railroad needs to be far more flexible,\" explained John Howard, co-founder and vice president of operations at Parallel Systems.</p></div><p><a href=\"https://arstechnica.com/?p=1967349#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1967349&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1938fc906f3307cb889b55a836743e0ba725a0207dd98691a4179f132b50ae29","category":"Tech"}