{"title":"Effect of carnosine on nitrosamine formation in gastric‐simulated aqueous and lipid environments","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13757?af=R","date":1721979278000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Nitrite salts are frequently utilized as meat additives to improve the quality and safety of processed meat products. However, these salts are associated with the formation of carcinogenic nitrosamines. Given its potential regulating effect on the formation of intermediate molecules, such as nitric oxide, it is hypothesized that carnosine, a meat constituent possessing antioxidant activity and other multiple health benefits, could dampen the formation of nitrosamines. The current study therefore assessed the effect of carnosine on nitrosamine formation in both a monophasic aqueous system and a biphasic water–lipid system simulating a gastric environment.</p>\n<h2>Results</h2>\n<p>In the monophasic system, relatively high levels of carnosine were required to significantly reduce the formation of different species of nitrosamine compared with the control (no carnosine). While higher levels of some nitrosamines were generated in both phases of the biphasic system, low carnosine concentrations significantly suppressed nitrosamine formation in the aqueous phase, while in the lipid phase, intermediate levels of carnosine were required. At higher carnosine levels, further reduction in nitrosamines was observed in the lipid phase.</p>\n<h2>Conclusions</h2>\n<p>This study demonstrates the capacity of carnosine to reduce nitrosamine formation in aqueous and lipid environments and suggests the potential of dietary carnosine to lower the risks associated with the consumption of processed meat products. © 2024 His Majesty the King in Right of Canada and The Author(s). <i>Journal of the Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry. Reproduced with the permission of the Minister of Agriculture and Agri-Food Canada.</p>","author":"Yi Yao Li, \nVaroujan Yaylayan, \nMarie‐France Palin, \nTania M Ngapo, \nSimon Cliche, \nFleur Gagnon, \nClaude Gariépy","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"193e6283e958b4ceb62c5cb5ce5d1917ee8cf104348c581d7f83ccce564ef27c","category":"Environment"}