{"title":"Surgical appropriateness nudges: Developing behavioral science nudges to integrate appropriateness criteria into the decision making of spine surgeons","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300475","date":1713535200000,"content":"<p>by Teryl K. Nuckols, Peggy G. Chen, Kanaka D. Shetty, Harsimran S. Brara, Neel Anand, Nabeel Qureshi, David L. Skaggs, Jason N. Doctor, Joshua M. Pevnick, Anne F. Mannion, Surgical Appropriateness Nudge Authorship Group </p>\r\nBackground <p>Substantial variation exists in surgeon decision making. In response, multiple specialty societies have established criteria for the appropriate use of spine surgery. Yet few strategies exist to facilitate routine use of appropriateness criteria by surgeons. Behavioral science nudges are increasingly used to enhance decision making by clinicians. We sought to design “surgical appropriateness nudges” to support routine use of appropriateness criteria for degenerative lumbar scoliosis and spondylolisthesis.</p> Methods <p>The work reflected Stage I of the NIH Stage Model for Behavioral Intervention Development and involved an iterative, multi-method approach, emphasizing qualitative methods. Study sites included two large referral centers for spine surgery. We recruited spine surgeons from both sites for two rounds of focus groups. To produce preliminary nudge prototypes, we examined sources of variation in surgeon decision making (Focus Group 1) and synthesized existing knowledge of appropriateness criteria, behavioral science nudge frameworks, electronic tools, and the surgical workflow. We refined nudge prototypes via feedback from content experts, site leaders, and spine surgeons (Focus Group 2). Concurrently, we collected data on surgical practices and outcomes at study sites. We pilot tested the refined nudge prototypes among spine surgeons, and surveyed them about nudge applicability, acceptability, and feasibility (scale 1–5, 5 = strongly agree).</p> Results <p>Fifteen surgeons participated in focus groups, giving substantive input and feedback on nudge design. Refined nudge prototypes included: individualized surgeon score cards (frameworks: descriptive social norms/peer comparison/feedback), online calculators embedded in the EHR (decision aid/mapping), a multispecialty case conference (injunctive norms/social influence), and a preoperative check (reminders/ salience of information/ accountable justification). Two nudges (score cards, preop checks) incorporated data on surgeon practices and outcomes. Six surgeons pilot tested the refined nudges, and five completed the survey (83%). The overall mean score was 4.0 (standard deviation [SD] 0.5), with scores of 3.9 (SD 0.5) for applicability, 4.1 (SD 0.5) for acceptability, and 4.0 (SD 0.5), for feasibility. Conferences had the highest scores 4.3 (SD 0.6) and calculators the lowest 3.9 (SD 0.4).</p> Conclusions <p>Behavioral science nudges might be a promising strategy for facilitating incorporation of appropriateness criteria into the surgical workflow of spine surgeons. Future stages in intervention development will test whether these surgical appropriateness nudges can be implemented in practice and influence surgical decision making.</p>","author":"Teryl K. Nuckols","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1942851f4255a3c8c1b0f72f3c5ab87b896f5d16ba7d2c4181d4d5cd01a69abc","category":"Interdisciplinary"}