{"title":"Psycho-social problems among older people residing in community of Chitwan, Nepal—A cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310849","date":1726754400000,"content":"<p>by Sunita Poudyal, Kalpana Sharma, Hem Kumari Subba, Ramesh Subba</p>\r\nBackground <p>Older people are vulnerable to various psycho-social problems such as depression, anxiety, insomnia, dementia, and loneliness that have profound impact on overall health and their quality of life and higher use of health services. Prevention and treatment of psychological problems in this risk group is critical for improving their quality of life.</p> Objective <p>This study aimed to find out the psycho-social problems among older people residing in community.</p> Methods <p>The study was a cross-sectional study design and 388 older people aged 65 years and above residing in different wards of Bharatpur Metropolitan city were selected using probability simple random sampling technique. Data were collected using interview schedule containing geriatric depression scale-15; Geriatric anxiety scale-10, University of California Loss Angels Loneliness Scale (UCLA-20), Anthens Insomnia Scale and Mini-Cog Test. Obtained data were analyzed in SPSS version 20 for windows. Chi-square test was applied to measure the association between psychosocial problems and selected variables.</p> Result <p>Findings of the study revealed that the mean age (± SD) of respondents was 72.92 (±7.12) years. Almost all (93.6%) older people had full functioning of activity of daily living and two third (66.5%) had other co-morbid conditions. More than two third (67.0%) of older adults had depression, 60.3% had anxiety, 53.6% had moderate to high level loneliness, 47.2% had insomnia, and 33.3% had dementia. Age, functional dependency, sex, co-morbidity, financial dependence, education and occupation were significantly associated with the psychosocial problems among older people.</p> Conclusion and recommendation <p>Psychosocial problems are common among older people residing in community of Chitwan. Hence, there is need to develop and implement health care strategy by local health care planner to prevent, treat and manage the psychosocial problems among this risk groups. Further, health care providers working in geriatric problems or psychosocial health need to conduct regular screening programs for the early diagnosis and treatment of these problems.</p>","author":"Sunita Poudyal","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1947a3079e37f7b5639af6b43f6c41baa0046ee7b07ac9b9491b3fe132629472","category":"Interdisciplinary"}