{"title":"Navigating uncertainty: Managing herbivore communities enhances Savanna ecosystem resilience under climate change","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14573?af=R","date":1709702618000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/28e92d81-2db6-436c-925e-e54356b54fcb/jpe14573-toc-0001-m.png\" alt=\"Navigating uncertainty: Managing herbivore communities enhances Savanna ecosystem resilience under climate change\" />\n<p>Our findings underscore that, in the face of climate uncertainty, farmers' most effective strategy for securing their livelihoods and ecosystem stability is to integrate browsers and apply management of mixed herbivore communities. This management approach not only significantly delays or averts tipping points but also maintained greater plant functional diversity, fostering a more robust and resilient ecosystem that acts as a vital buffer against adverse climatic conditions.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSavannas are characterized by water scarcity and degradation, making them highly vulnerable to increased uncertainties in water availability resulting from climate change. This poses a significant threat to ecosystem services and rural livelihoods that depend on them. In addition, the lack of consensus among climate models on precipitation change makes it difficult for land managers to plan for the future. Therefore, Savanna rangeland management needs to develop strategies that can sustain Savanna resilience and avoid tipping points under an uncertain future climate.\n\nOur study aims to analyse the impacts of climate change and rangeland management on degradation in Savanna ecosystems of southern Africa, providing insights for the management of semi-arid Savannas under uncertain conditions worldwide. To achieve this, we simulated the effects of projected changes in temperature and precipitation, as predicted by 10 global climate models, on water resources and vegetation (cover, functional diversity, tipping points (transition from grass-dominated to shrub-dominated vegetation)). We simulated three different rangeland management options (herbivore communities dominated by grazers, by browser and by mixed feeders), each with low and high animal densities, using the ecohydrological model EcoHyD.\n\nOur results identified intensive grazing as the primary contributor to the increased risk of degradation in response to changing climatic conditions across all climate change scenarios. This degradation encompassed a reduction in available water for plant growth within the context of predicted climate change. It also entails a decline in the overall vegetation cover, the loss of functionally important plant species and the inefficient utilization of available water resources, leading to earlier tipping points.\n\n<i>Synthesis and applications</i>. Our findings underscore that, in the face of climate uncertainty, farmers' most effective strategy for securing their livelihoods and ecosystem stability is to integrate browsers and apply management of mixed herbivore communities. This management approach not only significantly delays or averts tipping points but also maintained greater plant functional diversity, fostering a more robust and resilient ecosystem that acts as a vital buffer against adverse climatic conditions.\n</p>","author":"Katja Irob, \nNiels Blaum, \nBritta Tietjen","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"1949f11177260373ddc7236c92b061ce2ed5b7398c1f9e3c8c0dc3b0e8de86a3","category":"Environment"}