{"title":"Assessing ventilation through ambient carbon dioxide concentrations across multiple healthcare levels in Ghana","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003287","date":1723644000000,"content":"<p>by Cecilia Crews, Paul Angwaawie, Alhassan Abdul-Mumin, Iddrisu Baba Yabasin, Evans Attivor, John Dibato, Megan P. Coffee</p>\r\n\r\nInfection prevention and control (IPC) measures safeguard primary healthcare systems, especially as the infectious disease landscape evolves due to climate and environmental change, increased global mobility, and vaccine hesitancy and inequity, which can introduce unexpected pathogens. This study explores the importance of an \"always-on,\" low-cost IPC approach, focusing on the role of natural ventilation in health facilities, particularly in low-resource settings. Ambient carbon dioxide (CO<sub>2</sub>) levels are increasingly used as a measure of ventilation effectiveness allowing for spot checks and targeted ventilation improvements. Data were collected through purposive sampling in Northern Ghana over a three-month period. Levels of CO<sub>2</sub> ppm (parts per million) were measured by a handheld device in various healthcare settings, including Community-Based Health Planning and Services (CHPS) facilities, municipal and teaching hospitals, and community settings to assess ventilation effectiveness. Analyses compared CO<sub>2</sub> readings in community and hospital settings as well as in those settings with and without natural ventilation. A total of 40 facilities were evaluated in this study; 90% were healthcare facilities and 75% had natural ventilation (with an open window, door or wall). Facilities that relied on natural ventilation were mostly community health centers (60% vs 0%) and more commonly had patients present (83% vs 40%) compared with facilities without natural ventilation. Facilities with natural ventilation had significantly lower CO<sub>2</sub> concentrations (CO<sub>2</sub> ppm: 663 vs 1378, p = 0.0043) and were more likely to meet international thresholds of CO<sub>2</sub> &lt; 800 ppm (87% vs 10%, p = &lt;0.0001) and CO<sub>2</sub> &lt; 1000 ppm (97% vs 20%, p = &lt;0.0001). The adjusted odds ratio of low CO<sub>2</sub> in the natural facilities compared with non-natural were: odds ratios, OR (95% CI): 21.7 (1.89, 247) for CO<sub>2</sub> &lt; 800 ppm, and 16.8 (1.55, 183) for CO<sub>2</sub> &lt; 1000 ppm. Natural ventilation in these facilities was consistently significantly associated with higher likelihood of low CO<sub>2</sub> concentrations. Improved ventilation represents one cost-effective layer of IPC. This study highlights the continuing role natural ventilation can play in health facility design in community health care clinics. Most health facilities met standard CO<sub>2</sub> thresholds, particularly in community health facilities. Further research is needed to optimize the use of natural ventilation. The use of a handheld devices to track a simple metric, CO<sub>2</sub> levels, could improve appreciation of ventilation among healthcare workers and public health professionals and allow for them to target improvements. This study highlights potential lessons in the built environment of community primary health facilities as a blueprint for low-cost, integrated multi-layer IPC measures to mitigate respiratory illness and anticipate future outbreaks.","author":"Cecilia Crews","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"194a6a94ce9653b9f8c3f5d393b93fd46c93d39dae6e1fc2dd07c37fcb0e7a5a","category":"Environment"}