{"title":"Effects of Bacillus cereus YB1 on growth, intestinal digestive enzyme activity, liver antioxidant enzyme activity, and intestinal structure of black rockfish, Sebastes schlegelii","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13078?af=R","date":1715313188000,"content":"<h2>Abstract</h2>\n<p>We aimed to investigate the effects of <i>Bacillus cereus</i> YB1 on the growth, intestinal digestive enzyme activity, liver antioxidant enzyme activity, and intestinal tissue structure of juvenile black rockfish (<i>Sebastes schlegelii</i>). A 50-day feeding experiment was conducted. Feeding was conducted in four diet groups: control group with no YB1 supplement in diet and three treatment groups E-L, E-M, and E-H containing 10<sup>5</sup>, 10<sup>6</sup>, and 10<sup>7</sup> CFU/g YB1, respectively. The results revealed that the weight gain and specific growth rate of juvenile fish significantly increased, while the feed coefficient was reduced in all three diet treatment groups. This indicated that the growth of black rockfish was significantly and positively affected by YB1 feeding. Enzyme activity in the intestinal tract was not significantly affected by YB1. However, the activity of protease, amylase, and lipase increased because of YB1 treatment, except for the proteases in the E-M diet group. Meanwhile, no significant differences were recorded in the activities of the antioxidant enzymes in liver, but the level of catalase, superoxide dismutase, and malondialdehyde activities in treatments shows a better performance compared with the control in overall perspective. Furthermore, the structural features of the intestine (i.e., number of intestinal villi, length of gut villi, and thickness of muscularis) was significantly elevated with the inclusion of <i>B. cereus</i> YB1 in the diet. These results reveal that dietary supplementation of <i>B. cereus</i> YB1 is beneficial to the boosting of enzymatic activities and structure of intestinal tissue as well as the antioxidative ability of liver tissue. Such findings suggest that fish growth would be improved under YB1 feeding conditions.</p>","author":"Tengteng Wang, \nFei Wang, \nNa Sun, \nGuangxin Cui, \nYuzhen Chen, \nMingliang Zhang, \nShuo Sun, \nRuichao Ma, \nChunxiao Sun, \nHuizong Han","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"194af111ab163e14442e8aa98a1e5d2f505ad7cd54dd5f42935f8d9ad46fe723","category":"Environment"}