{"title":"How Safari’s new macOS tabs will transform your workflow","link":"https://www.macworld.com/article/349519/safari-15-macos-12-monterey-big-sur-tab-bar-groups-design-sidebar-how-to.html","date":1624880700000,"content":"\n<div>\n<section><div></div></section><p>Tabs are a major user interface element in Safari—we use them all the time, but they become unwieldly and hard to manage. Apple hopes to address those problems in Safari 15 with a new tab implementation and features.</p>\n\n\n\n<p>Here’s how tabs work in Safari 15 and how to make tab groups. If you want to try it out for yourself, you don’t have to wait for macOS Monterey—the Safari Technology Preview includes the new tabs, and <a href=\"https://www.macworld.com/article/349408/macos-monterey-safari-big-bur-tab-bar-groups-live-text-quick-notes-extensions.html\">it’s available for macOS Big Sur right now</a>. (Note: the Preview has a version number of 14.2. Safari in macOS Monterey is version 15.)</p>\n\n\n\n<h2>New tab UI</h2>\n\n\n\n<p>Apple changed the way tabs are displayed in Safari 15. Previously, the new tab you created appeared below the Address/Search box and the Favorites Bar. Now tabs occupy the space of the Address/Search box, which allows a bit more of a webpage to show on the screen. A nice design touch in Safari 15 is that the toolbar can take on the color of a website. It’s a subtle way to let you know what site you are on, which can be helpful if you have several tabs open.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/safari-15-toolbar-united-website.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Safari’s toolbar can take on the color used by a website.</p></figcaption></figure><p>United</p></div>\n\n\n\n<h2>Tab groups: The basics</h2>\n\n\n\n<p>Web research can involve visiting several websites, and sometimes you have a bunch of websites open in tabs, each one relevant to what you’re doing. In Safari 15, you can now save groups of those tabs together as a “tab group” and open that set of tabs whenever you want. For example, if you have a set of websites you like to visit for planning a vacation, you can save that set of sites as a tab group, and open that set when it’s time to plan your next trip.  </p>\n\n\n\n<p>To <strong>create a tab group</strong>, set up Safari so the sites you want in the group are open in a tab. Click on the <em>File</em> menu, and then select <em>New Tab Group with x Tabs</em> (the “x” will be the number of tabs currently open). </p>\n\n\n\n<p>Another way to create a tab group is to find the Show Sidebar icon on the upper right and click on the down arrow to the right. A pop-up menu will appear and you can select <em>New Tab Group with x Tabs.</em></p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/Safari-14.2-preview-make-tab-group.jpg?quality=50&amp;strip=all\" /></figure><p>Apple</p></div>\n\n\n\n<p>To <strong>add a tab</strong> to a tab group, just open a new tab and go to the site you want. To <strong>delete a tab</strong> from a tab group, open the tab group, and then close the tab. All the changes are automatically saved to the group.</p>\n\n\n\n<p>You can also <strong>create an empty tab group</strong>, which will have no tabs at the start. Then, any tabs you create are automatically saved in the group. You can create an empty tab group through <em>File &gt; New Empty Tab Group</em>, or by pressing Control+Command+N, or by clicking the down arrow icon to the right of the Show Sidebar icon and selecting <em>New Empty Tab Group.</em></p>\n\n\n\n<h2>Tab groups: Organizing and syncing</h2>\n\n\n\n<p>To <strong>open a tab group</strong>, click on the down arrow icon to the right of the Show Sidebar icon. In the menu that appears, your tab groups are listed in the middle section. Click on the group that you want to open it.</p>\n\n\n\n<p>You can also open a tab group through the Sidebar. Open the Sidebar by clicking the Show Sidebar in the upper left, or through <em>File &gt; Show Sidebar</em>, or by pressing Shift+Command+L. In the Sidebar you’ll find a section called Tab Groups. To <strong>open</strong> <strong>a tab group</strong>, click on one and the tabs will open in the main window.</p>\n\n\n\n<p>To see <strong>thumbnails of the tabs</strong>, click on the icon of four squares to the right of the tab group’s name. Or right-click the tab group and select <em>Show Tab Overview</em>.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/safari-tab-group-thumbnails.jpg?quality=50&amp;strip=all\" /><figcaption><p>You can view thumbnails of the tabs in a tab group.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>To <strong>rename</strong> <strong>a tab group</strong>, click on tab group to select it, then click on the name to trigger the ability to rename it. Or right-click the tab group and select <em>Rename</em>.</p>\n\n\n\n<p>To <strong>delete</strong> <strong>a tab group</strong>, right-click it and select <em>Delete</em>. Or click on it to select it, and then click on the <em>File</em> menu and select <em>Delete Tab Group</em>.</p>\n\n\n\n<p>If you <strong>right-click</strong> on a tab group, you have a couple more useful functions other than the ones previously mentioned.</p>\n\n\n\n<ul><li><strong>Copy Links:</strong> When you select this, A bulleted, hyperlinked list is created on your clipboard. When you paste it, the tab group name appears at the list’s title, and then each bulleted item is the hyperlinked title of each tab.</li><li>At the bottom of right-click menu is a <strong>list of the sites</strong> in each tab. You can select one and it will load in the main window.</li></ul><p>Tab groups <strong>sync across devices</strong>, so you can use them on your iPhone, iPad, or other Macs.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/Safari-Copy-Links-tabs.jpg?quality=50&amp;strip=all\" /><figcaption><p>The Copy Links function creates a hyperlinked bulleted list of your tab group. Here is what the list looks like when pasted into Pages. Clicking on each listing opens that webpage in a browser.</p></figcaption></figure><p>IDG</p></div>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"195eaa0f39f9e15784cfb2ee5139fd5c9e0d8695d4b25e5d4e99541f6ae7ccc5","category":"Apple"}