{"title":"Spectator involved in Tour de France Stage 1 crash arrested","link":"https://www.cyclist.co.uk/news/9819/spectator-involved-in-tour-de-france-stage-1-crash-arrested","date":1625129610000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>1 Jul 2021</span></div>    </div></div><p>\nFrench police have tracked down the spectator whose sign appeared to be the cause the huge crash on Stage 1. Image: Gendarmerie du Finistere</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/07/tour_de_france_sign_gendarmerie_du_finistere_crop.jpg?itok=K7uPmM9Y\" />  </div>\n<div>\n      <p> French police have arrested the spectator who appeared to cause a massive crash on Stage 1 of the <a href=\"/tags/tour-de-france\">Tour de France</a>.</p>\n<p>The woman, who authorities have confirmed is French, brought down Tony Martin and subsequently most of the peloton when she stepped into the road to show to the cameras a cardboard sign saying hello to her grandparents.</p>\n<p>Footage shows the grin still plastered to her face as she spins round following the impact of Martin colliding with her ridiculous cardboard sign, before she realises what's happened.</p>\n<p>While she fled the scene, the pile-up of riders was massive with extensive injuries to several, and <a href=\"/tags/team-dsm\">Team DSM</a>'s Jasha Sütterlin was forced to abandon as the race was held up 45km from the finish.</p>\n<p>A witch hunt ensued, with Tour de France deputy director Pierre-Yves Thouault saying, 'We are suing this woman who behaved so badly. We are doing this so that the tiny minority of people who do this do not spoil the show for everyone.'</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2021: Everything you need to know</a></div>      <div><a href=\"/news/8632/how-to-watch-and-live-stream-the-tour-de-france-2021\">How to watch and live stream the Tour de France 2021</a></div>      <div><a href=\"/in-depth/1448/mont-ventoux-the-giant-of-provence\">Mont Ventoux: Tour de France Classic Climb</a></div>    </div></div><p>\nHe added, 'This is unacceptable behaviour. There are safety rules to follow. Spectators don't cross the road, they don't take selfies. Frankly, her attitude was insane. The show is the riders, not spectators who want to be on TV.'</p>\n<p>It is not yet confirmed what charges the woman, who is in custody in Landerneau where the stage finished, will face, though <em>France24</em> reported that they would include 'unintentional short-term injury through a manifestly deliberate breach of a duty of safety or care'. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"195fd6a17a3a506f954699f8f3cbac738aef4e283b4af501c5dff01da6281810","category":"Cycling"}