{"title":"156 Growth performance, energy, and nutrient digestibility of nursery pigs fed high-shear dry extruded corn and soymeal","link":"https://academic.oup.com/jas/article/102/Supplement_2/91/7664700?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Altering the processing method via high-shear dry extrusion of both soybean meal and corn has been shown to improve diet energy and digestibility. The objective was to evaluate the effect using high-shear dry extruded corn and mechanically processed soymeal on growth performance, energy, and nutrient digestibility of nursery pigs. A total of 240 newly weaned pigs [initial body weight (BW) = 5.7 ± 1.3 kg] were assigned to 1 of 5 dietary treatments (n = 16 pens per treatment with 3 pigs per pen) in a complete randomized design for three dietary phases over a 6 wk study duration. Pigs were allowed a 7-d acclimation period where they were fed a common commercial medicated starter pellet diet (d 0-7, Phase 1). In phase 2 and 3, experimental diets included: 1) solvent-extracted soybean meal and conventional ground corn (Con), 2) solvent-extracted soybean meal and high-shear dry extruded corn (ECorn), 3) mechanically processed soymeal and conventional corn (ExSoy), 4) mechanically processed soymeal and high-shear dry extruded corn (same ME and Lysine as treatment 1 to 3; Comb), and 5) mechanically processed soymeal and conventional corn (energy floated with same Lys:ME; Comb+). The phase 2 mash test diets contained 0.40% titanium dioxide as a digestibility marker (d 8-21) and phase 3 test diets were fed from d 22-42. Pigs were individually weighed on d 0, 7, 21 and 42 and feed disappearance was recorded to calculate average daily feed intake (ADFI) and Gain:Feed within phase 1, 2 and 3, and overall (phase 2 and 3 combined). Data were analyzed using pen as the experimental unit. Compared with Cont, end BW did not differ in the ECorn and ExSoy treatment, while Comb and Comb+ pigs were 13 to 17% lighter (26.1, 24.2, 24.0, 22.6 and 21.5 kg, respectively, <span>P</span> = 0.004). Overall, the Con fed pigs had 30% greater average daily gain (ADG) and 12 to 21% increase in feed efficiency compared with either Comb or Comb+ treatments (<span>P</span> &lt; 0.001). Overall ADFI did not differ. During phase 3, Con and ECorn fed pigs observed increased ADG and feed efficiency compared with pigs fed either Comb treatment (Both <span>P</span> = 0.002, respectively). Compared with Cont, ECorn and Comb+ had greater GE ATTD coefficients, while ExSoy and Comb were less (82.1, 84.6, 86.9, 78.7 and 79.1%, respectively, <span>P</span> &lt; 0.001). Nitrogen ATTD coefficients were greatest in Comb+, followed by ECorn, Cont, ExSoy and Comb (84.4, 78.8, 77.9, 73.0 and 72.3%, respectively, <span>P</span> &lt; 0.001). In conclusion, substituting conventional corn or solvent-extracted soybean meal with extruded corn or mechanically processed soymeal resulted in equal pig growth performance. Further research is needed to determine the effects on the performance of nursery pigs fed diets including more than one high-shear dry extruded ingredients.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1960b54019a513ff5b33a6019524fe6f43fdd2095f4c07b9d9d9211f81eb59e9","category":"Environment"}