{"title":"Auxin receptor OsTIR1 mediates auxin signaling during seed filling in rice","link":"https://academic.oup.com/plphys/article/194/4/2434/7517471?rss=1","date":1705017600000,"content":"<span><div>Abstract</div>Cereal endosperm represents the most important source of the world’s food. Nevertheless, the molecular mechanisms behind sugar import into rice (<span>Oryza sativa</span>) endosperm and their relationship with auxin signaling are poorly understood. Here, we report that auxin transport inhibitor response 1 (TIR1) plays an essential role in rice grain yield and quality via modulating sugar transport into endosperm. The fluctuations of <span>OsTIR1</span> transcripts parallel to the early stage of grain expansion among those of the 5 <span>TIR1</span>/<span>AFB</span> (auxin-signaling F-box) auxin co-receptor proteins. <span>OsTIR1</span> is abundantly expressed in ovular vascular trace, nucellar projection, nucellar epidermis, aleurone layer cells, and endosperm, providing a potential path for sugar into the endosperm. Compared to wild-type (WT) plants, starch accumulation is repressed by mutation of <span>OsTIR1</span> and improved by overexpression of the gene, ultimately leading to reduced grain yield and quality in <span>tir1</span> mutants but improvement in overexpression lines. Of the rice <span>AUXIN RESPONSE FACTOR</span> (<span>ARF</span>) genes, only the <span>OsARF25</span> transcript is repressed in <span>tir1</span> mutants and enhanced by overexpression of <span>OsTIR1</span>; its highest transcript is recorded at 10 d after fertilization, consistent with <span>OsTIR1</span> expression. Also, OsARF25 can bind the promoter of the sugar transporter <span>OsSWEET11</span> (SWEET, sugars will eventually be exported transporter) in vivo and in vitro. <span>arf25</span> and <span>arf25/sweet11</span> mutants exhibit reduced starch content and seed size (relative to the WTs), similar to <span>tir1</span> mutants. Our data reveal that OsTIR1 mediates sugar import into endosperm via the auxin signaling component OsARF25 interacting with sugar transporter <span>OsSWEET11</span>. The results of this study are of great significance to further clarify the regulatory mechanism of auxin signaling on grain development in rice.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"19688b17ee333ec59535610875f26173967ecbf299ca401cdce6934bc1204dfa","category":"Environment"}