{"title":"Epic Games ถูกแบนบัญชีนักพัฒนาเพื่อสร้างสโตร์บน iOS ในประเทศ EU - Apple บอกเพราะพฤติกรรมอดีต \"ไว้ใจไม่ได้\"","link":"https://www.blognone.com/node/138575","date":1709770578000,"content":"<div><div><div><p>ประเด็นระหว่างแอปเปิลและ Epic Games ดูจะยาวนานยิ่งขึ้น เมื่อล่าสุด Tim Sweeney ซีอีโอและผู้ก่อตั้ง Epic Games เปิดเผยว่าแอปเปิลได้แบนบัญชีนักพัฒนาของ Epic Games ในประเทศสวีเดน ซึ่งบริษัทเตรียมนำมาใช้<a href=\"https://www.blognone.com/node/137883\">สำหรับการทำสโตร์ดาวน์โหลดเกมบน iOS</a> ในกลุ่มประเทศ EU โดยบัญชีนี้เพิ่งได้รับอนุมัติจากแอปเปิลไม่นาน</p>\n<p>Epic Games ยังแสดงอีเมลระหว่างผู้บริหารของบริษัทกับผู้บริหารแอปเปิล ที่นำมาสู่สาเหตุของการแบนบัญชี โดย Phil Schiller ผู้บริหารแอปเปิลบอกว่าเพราะพฤติกรรมที่ผ่านมาของ Epic Games ไม่น่าเชื่อถือ ในอดีต Epic Games ยอมรับเงื่อนของ App Store แต่ก็<a href=\"https://www.blognone.com/node/117949\">ทำระบบจ่ายเงิน</a>ขึ้นมาเอง<a href=\"https://www.blognone.com/node/117953\">จนถูกแบน</a> แล้ว Epic Games ก็ฟ้องร้องแอปเปิลทันที เมื่อแอปเปิลประกาศการเปลี่ยนแปลงใน iOS ของกลุ่มประเทศ EU ที่สร้างสโตร์ขึ้นมาได้ Sweeney ก็ออกมาวิจารณ์ว่าแนวทางนี้อาจผิดกฎหมาย DMA ทั้งยัง<a href=\"https://twitter.com/TimSweeneyEpic/status/1762243725533532587?s=20\">โพสต์ข้อความใน X</a> วิจารณ์บริษัทต่อเนื่อง ทั้งหมดที่เกิดขึ้นทำให้แอปเปิลยากที่จะไว้ใจ Epic ได้อีก</p>\n<p>อีเมลแจ้งระงับบัญชีมาจากทนายที่เป็นตัวแทนแอปเปิล โดยระบุว่า Epic Games แสดงให้เห็นชัดว่าไม่สามารถไว้ใจได้แบบมีหลักฐาน แอปเปิลไม่สามารถไว้ใจได้เลยว่า Epic จะปฏิบัติตามข้อกำหนดของ App Store และนักพัฒนาอันใหม่นี้ได้</p>\n<p>Epic Games แถลงประเด็นนี้ว่า แอปเปิลกำลังแสดงให้เห็นว่าจะเป็นอย่างไร ถ้าคุณเป็นนักพัฒนารายใหญ่ที่พยายามมาแข่งขันกับแอปเปิล และนี่เป็นการแบนสโตร์ 3rd Party ที่ขัดกับกฎหมาย DMA อย่างชัดเจน</p>\n<p>ด้านแอปเปิลก็แถลงว่า ที่ผ่านมา Epic ละเมิดข้อตกลงบ่อยครั้ง ยังมีคดีความฟ้องร้องในศาล แอปเปิลจึงมีสิทธิที่จะระงับบัญชีทุกประเภทของ Epic Games เมื่อรวมกับพฤติกรรมในอดีตด้วย แอปเปิลก็เลือกใช้สิทธินี้</p>\n<p>ที่มา: <a href=\"https://www.epicgames.com/site/en-US/news/apple-terminated-epic-s-developer-account\">Epic Games</a> และ <a href=\"https://www.macrumors.com/2024/03/06/apple-explains-terminating-epic-games-account/\">MacRumors</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c21d8eea0698ddd5542d48508cb49ac9.jpg\" /></p>\n<blockquote><p>Apple just terminated Epic's developer account, and they admitted that this tweet was one of the reasons.We don't want to think about Apple being evil. It would be so inconvenient. We don't want to switch to Android. But I see ever more signs that power has corrupted them. <a href=\"https://t.co/KExDKWptlc\">https://t.co/KExDKWptlc</a></p>\n<p>— Paul Graham (@paulg) <a href=\"https://twitter.com/paulg/status/1765431238985187525?ref_src=twsrc%5Etfw\">March 6, 2024</a></p></blockquote>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/epic-games\">Epic Games</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/fortnite\">Fortnite</a></div><div><a href=\"/topics/ios\">iOS</a></div><div><a href=\"/topics/antitrust\">Antitrust</a></div><div><a href=\"/topics/europe\">Europe</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1975d4bdaf949dda1578f85c24f521dda97da0af6642c34ba8bba8bf4421e096","category":"Thai"}