{"title":"Fulcrum goes tubeless with updated Racing DB range","link":"https://www.bikeradar.com/news/fulcrum-racing-db/","date":1622638854000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Racing-5-9b20686.jpg?quality=90&amp;resize=620,413\" />                                            <p>Fulcrum has announced an updated Racing DB range that now has wider, tubeless-ready rims and faster freehub engagement.</p>\n<p>The range of entry-level aluminium wheels consists of three models named the Racing 4 DB, Racing 5 DB, and the Racing 6 DB. Fulcrum says the wheel range covers everything from road training to use on a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bike</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Fulcrum Racing DB range has been overhauled to support tubeless setups.</span></figcaption><span> <i>Fulcrum</i></span></div>\n<p>All the wheels are <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-pads/\">disc-brake</a> specific – the “DB” in the name stands for disc brake – and the updated rim design brings the range in line with what many riders expect from a set of disc brake wheels.</p>\n<p>The tubeless-ready rim design on the wheels features Fulcrum’s “2-Way Fit Ready technology”. This rim design means the wheels can be used with compatible <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless tyres</a> but they can also be used with normal clincher tyres and tubes.</p>\n<p>The Racing DB wheels all come with tubeless tape installed and valves included.</p>\n<p>The wider rim widths also make the Racing DB wheels similar to other modern <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">road bike wheels</a>. Compared to the 2018 Racing DB range, Fulcrum says the new wheels will “better support modern tyre preferences.”</p>\n<p>Fulcrum hasn’t gone into any further details on this, but it is taken to refer to the fact that the wheels can fit wider tyres.</p>\n<p>The hub in the new Racing DB has an aluminium body and sealed cartridge bearings. When compared to the 2018 DB range, the freehub engagement system has moved up from 30 teeth to 36 teeth, which Fulcrum says gives the wheels “more direct power transfer and better ride dynamics.”</p>\n<p>When it comes to aesthetics, the wheels feature stickers and laser etching to achieve “a clean and minimalist racing look”.</p>\n<p>The wheels are available with either Shimano Hyperglide 11-speed, XDR, or Campagnolo’s N3W freehub bodies.</p>\n<p>The retail price with a Shimano freehub body is £449.99 / $596 for the Racing 4, £399.99 / $522 for the Racing 5 and £339.99 / $422 for the Racing 6.</p>\n<h2>Racing 4 DB</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Fulcrum Racing 4 DB is the lightest wheelset in the updated range.</span></figcaption><span> <i>Fulcrum</i></span></div>\n<p>The Racing 4 DB wheelset is the most expensive in the new Racing range and is oriented towards training on the road and according to Fulcrum they have been “chosen by the Cofidis team for their training setup.”</p>\n<p>The wheels have a rim depth of 34mm, which according to Fulcrum “balances aerodynamics, riding precision and versatility” making the Racing 4 DB wheels “ideal for climbing without sacrificing stability once the speed increases on the descents.”</p>\n<p>Compared to the previous Racing 4 DB, the aluminium rim profile on the new version is 2mm wider at 19mm, so it can easily fit a 25mm tyre.</p>\n<p>The wheels come already taped ready for a tubeless setup and they have a claimed weight of 1,710g.</p>\n<h2>Racing 5 DB</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Fulcrum Racing 5 DB wheels are aimed at endurance riding.</span></figcaption><span> <i>Fulcrum </i></span></div>\n<p>In comparison to the Racing 4 wheels, the Racing 5 wheels are tailored more towards endurance riding and comfort.</p>\n<p>The rim has a shallower 24mm rim depth that is less aerodynamically efficient but is more stable in bad weather conditions. The shallower depth also makes the wheels less stiff and consequently more forgiving and comfortable.</p>\n<p>The internal rim width on the Racing 5 DB wheels has jumped up from an internal width of 17mm to 20mm, and Fulcrum says the wheels can comfortably fit 25mm – 28mm tyres as a result.</p>\n<p>The wheels come with the 2-Way Fit tubeless technology and have a claimed weight of 1,660g, making them the lightest in the updated range.</p>\n<h2>Racing 6 DB</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A more road-specific set of wheels for your gravel bike?</span></figcaption><span> <i>Fulcrum </i></span></div>\n<p>The Racing DB 6 wheelset is the cheapest in the new range and Fulcrum describes the wheels as suitable for training or for “road rides with a gravel bike.”</p>\n<p>Like the Racing 5 wheels, the Racing 6 wheels have an updated rim depth of 24mm and an increased inner rim width of 20mm, making them more suitable for wider tyres.</p>\n<p>The wheels share the same tubeless technology as the other wheelsets in the range but, as can be expected for their price point, are slightly heavier at 1,780g.</p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"19816da58353005a376e9de1f4fc01b4be1c54369062e252261692632bbc77ac","category":"Cycling"}