{"title":"Influence of an indigenous yeast, CECA, from the Ningxia wine region of China, on the fungal and bacterial dynamics and function during Cabernet Sauvignon wine fermentation","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13696?af=R","date":1719398120000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p><i>Saccharomyces cerevisiae</i> CECA was a potential indigenous Chinese wine yeast that can produce aroma and flavor in Cabernet Sauvignon wines. High-throughput sequencing combined with metabolite analysis was applied to analyze the effects of CECA inoculation on the native microbial community interaction and metabolism during Cabernet Sauvignon wine fermentation.</p>\n<h2>RESULTS</h2>\n<p>Fermentations were performed with three different inoculant strategies: spontaneous fermentation without inoculation, inoculation with CECA after grape must sterilization, and direct inoculation of CECA. Results showed that the diversity of bacteria (<i>P</i> = 0.033) is more sensitive to CECA inoculation than fungi (<i>P</i> = 0.563). In addition, CECA inoculation altered the species composition of core microorganisms (relative abundance &gt;1%) and the keystone species (accounting for the top 1% of the most important interactions), as well as of the biomarkers (linear discriminant analysis &gt; 3.0, <i>P</i> &lt; 0.05). Furthermore, the inoculation could change the cluster of metabolites, and these differential metabolite sets were correlated with four fungal taxa of <i>Issatchenkia</i>, <i>Issatchenkia orientalis</i>, <i>Saccharomycetales</i>, <i>Saccharomycetes</i> and two bacterial taxa of <i>Pantoea</i>, <i>Tatumella ptyseos</i>, were significantly correlated. Inoculated fermentation also altered the correlation between dominant microorganisms and aroma compounds, giving Cabernet Sauvignon wines more herbal, floral, fruity, and cheesy aromas.</p>\n<h2>CONCLUSION</h2>\n<p><i>Saccharomyces cerevisiae</i> CECA and dimethyl dicarbonate (DMDC) inhibition treatments significantly altered the microbial community structure of Cabernet Sauvignon wines, which in turn affected the microbial-metabolite correlation. These findings will help winemakers to control the microbial dynamics and functions during wine fermentation, and be more widely used in regional typical wine fermentations. © 2024 Society of Chemical Industry.</p>","author":"Fang Zhang, \nJing Zhang, \nYue Sun","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"1985b857d7403f4a2e42e17f78a40a6023593e4896cae423bba8ecbd987926cc","category":"Environment"}