{"title":"Comprehensive Analysis of Leucine-rich Repeat Receptor-like Pro-teins Provides Insights into Their Roles in Biotic and Abiotic Stress Responses in Kiwifruit","link":"https://www.preprints.org/manuscript/202403.0897/v1","date":1710484235000,"content":"Abstract: Kiwifruit, a perennial horticultural crop known for its nutritional value, faces significant challenges due to biotic and abiotic stresses, affecting its yield and quality. Leucine-rich repeat receptor-like proteins (LRR-RLPs), a major group of receptor-like proteins in plants, have diverse functions in plant physiology, including growth, development, signal transduction, and stress responses. Despite their importance, the specific roles of kiwifruit LRR-RLPs in response to biotic and abiotic stresses remain poorly understood. In this study, we investigated the expression patterns of kiwifruit LRR-RLPs under various stress conditions, including pathogen stress, heat stress, waterlogging stress, and copper stress. Through genome and transcriptome analyses, we identified a total of 101, 164, and 105 LRR-RLPs in Actinidia Chinensis 'Hongyang', Actinidia eriantha 'Huate', and Actinidia chinensis 'Red5' kiwifruit, respectively, classified into 9 subgroups based on phylogenetic relationships. Synteny analysis revealed that the expansion of kiwifruit LRR-RLPs was primarily attributed to segmental duplication events. Using RNA-seq data from pathogen-infected kiwifruits, we identified specific LRR-RLP genes potentially involved in different stages of pathogen infection. Additionally, we observed the potential involvement of kiwifruit LRR-RLPs in abiotic stress responses, with upstream transcription factors possibly regulating their expression. Furthermore, protein interaction network analysis unveiled the participation of kiwifruit LRR-RLP genes in the regulatory network of abiotic stress responses. These findings highlight the crucial roles of LRR-RLPs in mediating both biotic and abiotic stress responses in kiwifruit, offering valuable insights for the breeding of stress-resistant kiwifruit varieties.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"198b142fe5ee6cbcecf5e80b5a390bc6bfc52c595e31faa302576ae16b623105","category":"Interdisciplinary"}