{"title":"Review: The Chipolo ONE Spot is a Solid AirTag Alternative With Built-In Hole and Louder Sound","link":"https://www.macrumors.com/review/chipolo-one-spot/","date":1622222967000,"content":"The <a href=\"https://chipolo.net/en-us/pages/chipolo-collection\">Chipolo ONE Spot</a> is the first Find My-compatible accessory that's a direct AirTag competitor, offering AirTag-like tracking capabilities for your valuable items. The ONE Spot is slightly more affordable than the AirTag at $28 for one and $90 for four (vs $29 for one AirTag and $99 for four) and it has a couple benefits that make it a worthy AirTag alternative.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/chipolo-1.jpg\" />\r\n<br />\r\nLike the AirTag, the ONE Spot is a small, circular tag that's about 1.5 inches in diameter, so similar in size to a silver dollar. It's bigger than an AirTag, and about as thick, but it's a uniform thickness, whereas the AirTag has a protruding bottom where the battery is housed.\r\n<br />\r\n\r\n<br />\r\nSince it's the same thickness, you can't put the ONE Spot in places an AirTag can't go, such as a wallet, so there's no real difference in design functionality.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/chipolo.jpg\" />\r\n<br />\r\nThe Chipolo ONE Spot is made from a lightweight plastic, and it is not as well made as the AirTag. The AirTag has a premium design with a shiny plastic cap and a silver bottom complete with Apple logo, while the ONE Spot is made from a simple black plastic material.\r\n<br />\r\n\r\n<br />\r\nApple's AirTag is heavier than the ONE Spot and holding both, there's no comparison - the AirTag is much nicer. Those concerned with aesthetics will want to opt for the AirTag, but I'm not of the opinion that an item tracking tag needs to stand out.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/airtag-chipolo-1.jpg\" />\r\n<br />\r\nGiven their popularity, <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a> are going to be immediately noticeable when attached to an item, and for some people, that's a plus. ‌AirTags‌ can be engraved and are designed to be seen. Those who want something more unassuming will prefer the Chipolo ONE Spot, which blends in better and is less well known.\r\n<br />\r\n\r\n<br />\r\nBoth the ONE Spot and the ‌AirTags‌ share similar base designs, but the ONE Spot boasts a built-in hole that can be attached to a keyring, strap, or another accessory. The AirTag does not have any native way to attach to items and needs a holder of some kind if you want to put it on keys, a pet, the outside of a bag, or similar places.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/airtag-chipolo-2.jpg\" />\r\n<br />\r\nChipolo has used the ONE Spot's built-in hole as a feature that sets it apart from the AirTag because there are no additional accessories needed to use it, which is a plus. When you buy an AirTag, if you want to attach it to something, you need to spend at least $5 to find a case, and oftentimes more. Apple's own AirTag cases are priced starting at $29, which is the same price as an AirTag.\r\n<br />\r\n\r\n<br />\r\nTo test the AirTag and Chipolo ONE Spot tracking abilities, I tucked both into a suitcase and then checked that suitcase on a recent flight, watching the journey from departure airport to plane to destination airport, and then tracking them at a hotel while I was away.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/chipolo-find-my-interface.jpg\" />\r\n<br />\r\nDuring this test, I noticed no discernible difference between the two item trackers. Each time I checked, both showed up right in the Items tab in the <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> app at the same time, and locations were updated at about the same intervals based on the iOS devices that were nearby. I did notice that the AirTag seemed to update a bit more frequently, but it was a difference of just a couple of minutes every time that I checked. \r\n<br />\r\n\r\n<br />\r\nThere was no difference in the distance that they seemed to be trackable at and there was no clear difference in the intervals in which their location was updated when away from me. Functionality was identical, and if I had done a blind test where I hadn't known which was the AirTag and which was the ONE Spot in the ‌Find My‌ app, I would not have been able to tell which was which.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/chipolo-airtag-time-tracking.jpg\" />\r\n<br />\r\nThe AirTag and the ONE Spot seem to offer the same basic functionality, and can be tracked in the ‌Find My‌ app alongside Apple devices. Both of these use Apple's ‌Find My‌ network, so if either the AirTag or the ONE Spot become lost and are out of your range, they will ping other nearby Apple devices to provide an updated location. There are <a href=\"https://www.macrumors.com/2021/01/27/apple-active-devices-worldwide-january-2021/\">more than 1.65 billion active Apple devices</a> around the world, which makes Apple's ‌Find My‌ network a valuable feature.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/chipolo-tracking-distance.jpg\" />\r\n<br />\r\nThe core feature set between the ONE Spot and AirTag is largely the same, but there are a few things worth highlighting that are standout options on each accessory. The AirTag is easier to set up, because you just hold it near an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and it connects right away. With the Chipolo, I held it near my ‌iPhone‌ and was then instructed to press on it (there's a built-in button function). It wasn't difficult, but it was an extra bit of friction.\r\n<br />\r\n\r\n<br />\r\nChipolo's ONE Spot and ‌AirTags‌ both have an identical Lost Mode that lets you leave a phone number or email address for contact purposes and get a notification if a lost item is found. This feature also lets you play a sound, and it's worth noting that the ONE Spot is easier to hear. I don't think that one is louder than the other in a direct sound comparison, but when tucked away in a bag or couch cushion, the ONE Spot is not as muffled.\r\n<br />\r\n\r\n<br />\r\nI used an ‌iPhone‌ app to test decibel level, and while I'm not sure how accurate an ‌iPhone‌ app is, the AirTag came in at 86 decibels max and the ONE Spot was 83 decibels max, but again, the ONE Spot was easier to hear when covered up. The AirTag's sound also stops after a few seconds, while the ONE Spot's sound lasts longer, so it easily wins in a direct sound comparison.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/airtag-chipolo-3.jpg\" />\r\n<br />\r\nBoth the AirTag and the ONE Spot use CR2032 batteries that are designed to last for about a year and that are replaceable, so there's little difference there. The AirTag is, however, more water resistant, which makes it better in situations where it might be exposed to liquids or to the elements.\r\n<br />\r\n\r\n<br />\r\nThere's one other main difference between the two item trackers, and that's Precision Finding. Apple added a Precision Finding feature that uses the U1 chip in the AirTag when paired with an <a href=\"https://www.macrumors.com/roundup/iphone-11/\">iPhone 11</a> or <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> model, with the option designed to make it easier to track down an item that's lost nearby by pointing you in the right direction.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/airtag-precision-finding-2.jpg\" />\r\n<br />\r\nThis is kind of a hit or miss feature that doesn't always work as you might expect it to work, but it's definitely nice to have, especially when an item like a set of keys is lost indoors. There is no equivalent feature on the ONE Spot because it doesn't have an Ultra Wideband chip, but even if it did, Apple doesn't let yet third-party companies access the U1 chip in the ‌iPhone‌ (though this is coming).\r\n<br />\r\n\r\n<br />\r\n<h2>Bottom Line</h2>\r\n<br />\r\nWhen it comes to key functionality, the AirTag and the ONE Spot are basically identical. Both integrate into the ‌Find My‌ app and take advantage of the ‌Find My‌ Accessory Network to make lost items easier to locate.\r\n<br />\r\n\r\n<br />\r\nThe ONE Spot wins out when it comes to attachment points and sound thanks to its built-in hole for a keyring or strap and its speaker that isn't as easily muffled.\r\n<br />\r\n\r\n<br />\r\nThe AirTag wins out when it comes to aesthetic design, setup, indoor item location, and water resistance, so both have their pros and their cons. You're going to get the same general performance with either of these item tracking tags, and it just comes down to the add-on features that are most important to you.\r\n<br />\r\n\r\n<br />\r\nBoth the AirTag and the ONE Spot are recommendable and perform well, and the ONE Spot is definitely a solid alternative to the AirTag if you're looking for a simpler design that's more utilitarian. It's also worth noting that if you're buying in bulk, you can save about $10 going with the ONE Spot over Apple's ‌AirTags‌. \r\n<br />\r\n\r\n<br />\r\n<h2>How to Buy</h2>\r\n<br />\r\nThe Chipolo ONE Spot can be <a href=\"https://chipolo.net/en-us/pages/chipolo-collection\">purchased from the Chipolo website</a>. A single Chipolo ONE Spot costs $28, while a pack of four is available for $90. Preorders placed now will ship out in August.\r\n<br />\r\n\r\n<br />\r\n<em><small>Note: Chipolo provided MacRumors with a ONE Spot for the purpose of this review. No other compensation was received.</small></em><div>Tags: <a href=\"https://www.macrumors.com/guide/find-my/\">Find My</a>, <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a>, <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My Network Accessory Program</a>, <a href=\"https://www.macrumors.com/guide/chipolo/\">Chipolo</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/airtags.232\">AirTags</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/chipolo-one-spot/\">Review: The Chipolo ONE Spot is a Solid AirTag Alternative With Built-In Hole and Louder Sound</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-the-chipolo-one-spot-is-a-solid-airtag-alternative-with-built-in-hole-and-louder-sound.2298282/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=GxuSWQ0am3s:OM2EONvpYDw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=GxuSWQ0am3s:OM2EONvpYDw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/GxuSWQ0am3s\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"198f426e800ce3428376ce4f0ea1e556b40c761538f1466e35cd635cc216a0bf","category":"Apple"}