{"title":"เผยฟุตเทจของ Luigi ครั้งแรกในรอบ 26 ปีของเกม Super Mario 64 ที่ถูกตัดออกตอนวางขายจริง","link":"https://www.blognone.com/node/137291","date":1702897800000,"content":"<div><div><div><p>มีคนพบฟุตเทจของ Luigi ในเกม Super Mario 64 ที่วางจำหน่ายเมื่อปี 1996 ที่ตัวเกมจริงไม่มี Luigi ให้เล่น โดยฟุตเทจดังกล่าวมาจากงาน Nintendo Space World เมื่อปี 1995 ที่เครื่องเกมคอนโซล Nintendo 64 ปรากฎตัวเป็นครั้งแรก</p>\n<p>ในคลิปวิดีโอมี 1 วินาที (จากความยาว 21 นาที) ของยูทูบเบอร์ชื่อ Now in Game Channel แสดงภาพของ Mario และ Luigi ในเกม Super Mario 64 ซึ่งถือเป็นครั้งแรกที่เราได้เห็น Luigi ในเกมเวอร์ชันดั้งเดิมนอกเหนือจาก<a href=\"https://www.blognone.com/node/116165\">ข้อมูลไฟล์เกมต้นแบบของ Nintendo ที่หลุดเมื่อปี 2020</a> ที่มีโมเดลต้นแบบของตัวละครหลุดมาด้วย</p>\n<p>Shigeru Miyamoto ผู้กำกับของเกมให้สัมภาษณ์เมื่อปี 1996 ว่าเคยตั้งใจให้ Luigi เป็นตัวละครที่ 2 ที่สามารถเล่นได้ในมินิเกมต่าง ๆ แต่ถูกถอดออกเนื่องจากปัญหาของหน่วยความจำ และพิจารณาจากผู้คนที่ซื้อเครื่อง Nintendo 64 ครั้งแรกมีคอนโทรลเลอร์แค่ตัวเดียว การใส่โหมด Multiplayer ลงไปดูไม่เหมาะเท่าไหร่</p>\n<p>อย่างไรก็ตามเกม Super Mario 64 DS ที่ลงให้กับเครื่อง Nintendo DS มีโหมด Multiplayer ที่เล่นได้สูงสุด 4 คน เล่นเป็น Yoshi, Mario, Luigi และ Wario ได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1b435bb500fb718736f655bca01f4049.jpg\" /><em>ภาพจาก X ของ Yakumono ที่บันทึกรูปมาจากคลิปของ Now in Game Channel</em></p>\n<p>ที่มา - <a href=\"https://www.youtube.com/watch?v=3cHzwNRLddI&amp;t=801s\">Now in Game Channel</a> via <a href=\"https://www.videogameschronicle.com/news/first-ever-mario-64-luigi-footage-discovered-via-old-vhs-tape/\">Video Games Chronicle</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/mario\">Mario</a></div><div><a href=\"/topics/nintendo-64\">Nintendo 64</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/nintendo\">Nintendo</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"199ed112963abf4c786e7b8a0d14470318ebee1b8b056032fe8570f609ba852d","category":"Thai"}