{"title":"Gene editing makes bacteria-killing viruses even more deadly","link":"https://arstechnica.com/?p=1937458","date":1683562636000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-1124672154-800x450.jpg\" alt=\"Cartoon of a phage, showing a complex geometrical head connected to legs by a long stalk.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-1124672154.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/illustration/illustration-of-bacteriophage-royalty-free-illustration/1124672154?phrase=phage&amp;adppopup=true\">Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Broad-spectrum antibiotics are akin to nuclear bombs, obliterating every prokaryote they meet. They're effective at eliminating pathogens, sure, but they're not so great for maintaining a healthy microbiome. Ideally, we need precision antimicrobials that can target only the harmful bacteria while ignoring the other species we need in our bodies, leaving them to thrive. Enter <a href=\"https://www.sniprbiome.com/\">SNIPR BIOME</a>, a Danish company founded to do just that. Its first drug—SNIPR001—is currently <a href=\"https://clinicaltrials.gov/ct2/show/NCT05277350\">in clinical trials</a>.</p>\n<p>The drug is designed for people with cancers involving blood cells. The chemotherapy these patients need can cause immunosuppression along with increased intestinal permeability, so they can't fight off any infections they may get from bacteria that escape from their guts into their bloodstream. The mortality rate from such infections in these patients is around 15–20 percent. Many of the infections are caused by <i>E. coli</i>, and much of this <i>E. coli</i> is already resistant to fluoroquinolones, the antibiotics commonly used to treat these types of infections.</p>\n<p>The team at SNIPR BIOME engineers bacteriophages, viruses that target bacteria, to make them hyper-selective. They started by screening 162 phages to find those that would infect a broad range of <i>E. coli </i>strains taken from people with bloodstream or urinary tract infections, as well as from the guts of healthy people. They settled on a set of eight different phages. They then engineered these phages to carry the genes that encode the CRISPR DNA-editing system, along with the RNAs needed to target editing to a number of essential genes in the <i>E. coli</i> genome. This approach has been shown to prevent the evolution of resistance.</p></div><p><a href=\"https://arstechnica.com/?p=1937458#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1937458&amp;comments=1\">Comments</a></p>","author":"Diana Gitig","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"19a77d7ade61608eb68aa8b91f6df05ec3931c133056bd1c62b10d263dc103c7","category":"Tech"}