{"title":"Five key stages that will define the 2021 Tour de France","link":"https://www.bikeradar.com/features/tour-de-france-stages/","date":1624359659000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/08/GettyImages-1273716451-4d5ccfd.jpg?quality=45&amp;resize=620,413\" />                                            <p>Back in its summer slot, albeit starting a little earlier to accommodate the Tokyo Olympic Games, the 108th edition of the <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> rolls out in Brittany on Saturday (June 26).</p>\n<p><a href=\"https://www.bikeradar.com/features/pro-bike/pogacar-bennett-bikes-paris/\" target=\"_blank\">Tadej Pogacar</a> triumphed on a climb-laden route in 2020, and he and fellow Slovenian Primoz Roglic are among the favourites in 2021 with a more balanced <a href=\"https://www.bikeradar.com/news/2021-tour-de-france-route/\" target=\"_blank\">Tour de France route</a> served up by race organisers ASO.</p>\n<p>Featuring two <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-your-best-ever-time-trial/\" target=\"_blank\">time trials</a>, and 58km of time trialling in total, as well as <a href=\"https://www.bikeradar.com/features/routes-and-rides/2021-tour-de-france-climbs/\" target=\"_blank\">notable climbs</a> such as the Col du Portet and a double ascent of Mont Ventoux, there will be little let-up for the GC contenders.</p>\n<section><div>\n        <h4>The 2021 Tour de France route in numbers</h4>\n<p>The 2021 Tour starts in Brittany on June 26. The route includes:</p>\n<ul><li>Eight flat stages</li>\n<li>Five hilly stages</li>\n<li>Six mountain stages</li>\n<li>Double ascent of Mont Ventoux</li>\n<li>Three summit finishes (Tignes, Saint-Lary-Soulan Col du Portet, Luz Ardiden)</li>\n<li>Two individual time-trials (58km of time trialling in total)</li>\n<li>Two rest days</li>\n<li>Stage eight, at 248km (Vierzon to Le Creusot), is the longest Tour stage since 2000.</li>\n</ul><p>\n\n    </p></div>\n    </section><p>The old adage states the Tour de France will not be won until the riders roll onto the Champs-Elysees on July 18, but there will be numerous chances for riders to stake their claims for the yellow jersey.</p>\n<p>Here are five stages that could define the 2021 race.</p>\n<h2>Stage five – Change to Laval Espace Mayenne</h2>\n<h3>Wednesday June 30 – 27.2km, individual time trial</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Stage five is the longest time trial stage in the first week of the Tour de France since 2008</span></figcaption><span></span></div>\n<p>An early start to this year’s Tour means some riders’ GC hopes could be over before we even get into July.</p>\n<p>Stage one’s uphill finish and the risk of coastal crosswinds, plus a double climb of the Mur-de-Bretagne on stage two, could mean gaps already open up on the first weekend.</p>\n<p>And by the last day of the month, there will be some GC contenders already re-assessing their targets for the season after the stage five time trial.</p>\n<p>The route features two time trials in total, and 58km of time trialling, with the first 27.2km packed into the largely flat circular route from Change to Laval Espace Mayenne.</p>\n<p>It is the longest time trial in the Tour de France’s first week since 2008, and will determine tactics for the mountains stages to come.</p>\n<p>Any riders lacking form will be found wanting, and the likes of Primoz Roglic could open up a sizable advantage over their less-rounded GC rivals.</p>\n<section><div>\n        <p><strong>Did you know?</strong><br />\nAt 27.2km, this is the longest time trial in the Tour’s first week since 2008</p>\n<p><strong>Who does the stage suit?</strong><br />\nClimbers ◉◎◎◎◎<br />\nPuncheurs ◉◎◎◎◎<br />\nRouleurs ◉◉◉◉◉<br />\nSprinters ◉◎◎◎◎</p>\n<p>\n\n    </p></div>\n    </section><h2>Stage 11 – Sorgues to Malaucene</h2>\n<h3>Wednesday July 7 – 198.9km</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Mont Ventoux features twice on a mouth-watering stage 11</span></figcaption><span></span></div>\n<p>Stage 11 is arguably the 2021 Tour de France’s showpiece stage, and certainly the one that whet the appetite most when the full route was announced.</p>\n<p>The eagerly-awaited return of Mont Ventoux, for the first time since 2016, sees the <em>Giant of Provence</em> tackled not once, but twice from two different sides.</p>\n<p>Steeped in Tour de France history, the climb has not featured in the race since Chris Froome – in the <a href=\"https://www.bikeradar.com/features/tour-de-france-jersey-colours/\" target=\"_blank\">yellow jersey</a> – was forced to run part of the way up after a crash in 2016.</p>\n<p>The traditional ascent from Bedoin is a 15.7km with an average gradient of 8.8 per cent which, at this year’s race, will be this year’s second climb.</p>\n<p>The peloton will already have tackled the tamer, but longer Sault route (24km at five per cent), before the second and most likely explosive ascent.</p>\n<p>After cresting Ventoux for the second time, the riders then still have the descent to Malaucene to contend with – this is a stage that will twist and turn, quite literally, all the way to the finish line.</p>\n<section><div>\n        <p><strong>Did you know?</strong><br />\nDespite its fame, this will be just the 17th time the <em>Giant of Provence</em> has featured at the Tour de France</p>\n<p><strong>Who does the stage suit?</strong><br />\nClimbers ◉◉◉◉◉<br />\nPuncheurs ◉◉◎◎◎<br />\nRouleurs ◉◎◎◎◎<br />\nSprinters ◉◎◎◎◎</p>\n<p>\n\n    </p></div>\n    </section><h2>Stage 15 – Ceret to Andorra la Vella</h2>\n<h3>Sunday July 11 – 191.3km</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Port d’Envalira is the highest point of the 2021 Tour de France</span></figcaption><span></span></div>\n<p>The second week of racing ends in the Pyrenees, as the peloton makes a brief but painful sojourn out of France and into neighbouring Andorra.</p>\n<p>At 2,406m up, stage 15 features the highest summit of the 2021 Tour de France atop the Port d’Envalira, where the first rider across the top will earn the Souvenir Henri Desgrange.</p>\n<p>For the GC contenders, however, it is also notable for being the second of three first-category climbs on the 191.3km stage.</p>\n<p>After crossing the Franco-Andorran border, the first major test of the stage is the Montee de Mont-Louis (8.4km at 5.7 per cent).</p>\n<p>The Col de Puymorens (5.8km at 4.7 per cent) then acts as the <em>appertif</em> for Port d’Envalira as the roads point skywards and the mountain goats take their opportunity to shine.</p>\n<p>There is still just shy of 45km to race after the climb is summitted too, with a rapid descent to Encamp before the third category-one ascent of the day, the Col de Beixalis (6.4km at 8.5 per cent).</p>\n<p>A punishing, but fairly consistent gradient will sap the last sinews of energy from the yellow jersey contenders before a descent to the finish line in Andorra la Vella.</p>\n<section><div>\n        <p><strong>Did you know?</strong><br />\nThe 2020 Tour de France took place exclusively in France – this will be the first time the race has left the country since 2019.</p>\n<p><strong>Who does the stage suit?</strong><br />\nClimbers ◉◉◉◉◉<br />\nPuncheurs ◉◉◎◎◎<br />\nRouleurs ◉◎◎◎◎<br />\nSprinters ◉◎◎◎◎</p>\n<p>\n\n    </p></div>\n    </section><h2>Stage 17 – Muret to Saint-Lary-Soulan (Col du Portet)</h2>\n<h3>Wednesday July 14 – 178.4km</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Col du Portet features for just the second time</span></figcaption><span></span></div>\n<p>While it is not steeped in Tour history like some of the other ascents in this year’s race, the Col du Portet will not be underestimated.</p>\n<p>On its 2018 debut, the 16km climb, with an average gradient of 8.7 per cent, proved it has all the hallmarks of becoming a Tour classic.</p>\n<p>Twisting, snake-like slopes, thigh-numbing hairpins and long, punishing slopes in between will make for spectacular viewing.</p>\n<p>Nairo Quintana rode to stage up the steep slopes in 2018, on a climb that starts and ends with steep pitches for maximum, explosive effect.</p>\n<p>The race is likely to have already blown apart by the time the first double-digit slopes of the Portet kick in too – the summit finish is the third major climb of stage 17.</p>\n<p>The back-loaded stage also sees riders tackle the Col de Peyresourde (13.3km at 6.9 per cent) and Col de Val Louron-Azet (6.8 per cent at 7.9 per cent) before the main event.</p>\n<section><div>\n        <p><strong>Did you know?</strong><br />\nThe Col du Portet was supposed to debut at the Tour de France in 1982, but it finally featured for the first time in 2018 – 36 years later.</p>\n<p><strong>Who does the stage suit?</strong><br />\nClimbers ◉◉◉◉◉<br />\nPuncheurs ◉◉◎◎◎<br />\nRouleurs ◉◎◎◎◎<br />\nSprinters ◉◎◎◎◎</p>\n<p>\n\n    </p></div>\n    </section><h2>Stage 18 – Pau to Luz Ardiden</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Stage 18 is the last chance for the out-and-out climbers to make their mark</span></figcaption><span></span></div>\n<h3>Thursday July 15 – 129.7km</h3>\n<p>Straight off the back of the Col du Portet, the climbing continues the following day with the final mountain stage of this year’s race.</p>\n<p>The third of just three summit finishes, stage 18 finishes at Luz Ardiden on what is likely to be a comparatively short but very explosive day.</p>\n<p>At 129.7km, it is the second-shortest road stage of this year’s race, with only the final stage in Paris coming in shorter.</p>\n<p>For the first half of the route, there are only two category-four climbs to break up what should otherwise be a fast-paced opening as teams jostle for position.</p>\n<p>And position will be key, because the second half of the race then packs in the Col du Tourmalet and Luz Ardiden – the last two major climbs of this year’s race.</p>\n<p>With a 30.8km time trial between Libourne and Saint-Emilion awaiting on stage 20, this stage is the last chance for the true climbers to strike home an advantage.</p>\n<p>The Tourmalet is a Tour icon – a 17km climb with an average gradient of 7.4 per cent, and after the long descent to Luz Saint-Saveur, the road then heads straight back up to Luz Ardiden.</p>\n<p>A final, 13.4km climb with an average gradient of 7.5 per cent – an average lowered slightly by the more moderate first two kilometres – is last chance saloon for the mountain goats.</p>\n<p>Stage 20 could still see the yellow jersey change hands, after the final time trial, but the out-and-out climbers know their only hope of claiming the <em>maillot jaune</em> is to be in front after Luz Ardiden.</p>\n<section><div>\n        <p><strong>Did you know?</strong><br />\nThe Col du Tourmalet has featured more times at the Tour de France than any other pass – first appearing in 1910.</p>\n<p><strong>Who does the stage suit?</strong><br />\nClimbers ◉◉◉◉◉<br />\nPuncheurs ◉◉◎◎◎<br />\nRouleurs ◉◎◎◎◎<br />\nSprinters ◉◎◎◎◎</p>\n<p>\n\n    </p></div>\n    </section>","author":"Colin Henrys","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"19acd6acb33761d057a1d2b1c74d246971f0638f34809bc5b1ef8bc367e4b5ad","category":"Cycling"}