{"title":"Dietary Patterns Correlate with Transition Readiness of Adolescents with Autism: A Pilot Study","link":"https://www.preprints.org/manuscript/202409.0212/v1","date":1725417289000,"content":"Despite extensive research on autism in children, much less attention has been given to the transition into adulthood. This study aims to address this gap by examining the dietary behaviors of young adults with autism during this critical transition period, highlighting the role of diet in enhancing their readiness for adulthood. Forty-seven participants (mean age 21.0 ± 1.1 years), both male and female, were involved in this study. Participants had various comorbidities, such as mood disorders, attention-deficit/hyperactivity disorder, depression, and anxiety disorders, for which they required medication. Dietary behavior was assessed using the Starting the Conversation: Diet survey, while transition readiness was measured with the Transition Readiness Sur-vey. T-test and regression analysis were utilized to evaluate the data.  The results indicated that participants did not follow healthy eating habits, as reflected by the dietary scores (1.08 ± 0.07), and were not adequately prepared for adulthood, as shown by the transition readiness scores (3.19 ± 1.10). A statistically significant and negative correlation was found between dietary pat-terns and transition readiness (r = -0.51, p &lt; 0.001), indicating an adverse relationship: transition readiness ratings decline as diet scores rise. Linear regression analysis revealed that dietary habits accounted for 26.20% of the variation in transition readiness, with the confidence interval for the coefficient of dietary habits being -2.89 to -0.95 (p = 0.002). The negative significant correlation between dietary scores and transition readiness scores shows that diet behavior significantly influences participants’ assessed readiness for transition.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"19acab65753c08a70c4b522b0301c41965bf52bc3069c3e61b0a8308703a9c14","category":"Interdisciplinary"}