{"title":"Apple’s new AR headset will lean on a lot of old technology","link":"https://www.macworld.com/article/1790302/ar-headset-platform-iphone-ios.html","date":1681900200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>As I read the latest report from Bloomberg’s Mark Gurman about the <a href=\"https://www.macworld.com/article/1790170/reality-pro-headset-apps-games-fitness-books-facetime.html\">apps Apple is building for Apple’s forthcoming AR/VR headset</a>, I was again reminded about how unique Apple’s place in the tech ecosystem is.</p>\n\n\n\n<p>We talk a lot about Apple’s competitors, and to be sure, it has them in every single market in which it competes. But while Apple has competitors, none of them are playing the same game Apple is. For decades I’ve observed that many of the people who dislike Apple as a business do so because they don’t understand it–they try to fruitlessly compare it to other companies in the tech sector.</p>\n\n\n\n<p>The fact that we’re even able to discuss Apple’s forthcoming headset, headset operating system, headset app platform, and headset apps says everything about how Apple has a strategy that lets it execute in ways no other company can.</p>\n\n\n\n<h2>Incomplete comparisons</h2>\n\n\n\n<p>To truly see Apple’s uniqueness, consider its closest analogs in the tech industry. The companies that are building their own OS and app platforms are largely doing it once: Microsoft for PCs, and Google for phones. They dabble in hardware, too, but other hardware partners do the heavy lifting. Apple has hardware competitors everywhere, but they’re largely using someone else’s software.</p>\n\n\n\n<p>That’s because even building and maintaining a single consumer-device operating system and app platform is <em>incredibly</em> hard. How many of those have ever been successful in the history of the computer industry? A handful or two over four or five decades. It is a monumental task to be a platform owner: software, hardware, and developer relations. Apple probably owns more viable consumer operating systems than the rest of the world put together. (And if not, it’s a surprisingly close thing.)</p>\n\n\n\n<p>This is not to say Microsoft and Google are weaklings. In fact, Apple kind of stepped in it (metaphorically speaking) when it forked Mac OS X and turns it into iOS beginning in 2007. Yes, the iPhone was a huge hit that changed the world, of course, we know all that. But consider what Apple was left with: a rapidly-evolving iPhone OS that needed to cater to the needs of mobile devices, and the existing base of OS X. Two increasingly disparate operating systems with completely different and incompatible app-development platforms. If running one computing platform is hard, running two at the same time seems nearly impossible.</p>\n\n\n\n<p>This was the conundrum of Apple in the 2010s. A victim of its own success, Apple needed to find a way to keep a lot of plates spinning (iPhone! iPad! Mac! Apple TV! The new Apple Watch!) while trying to find a way to make it all sustainable. Slowly, a strategy came into focus: take the most important and successful platform (iOS) and make it the center of the company’s strategy.</p>\n\n\n\n<p>The first Apple TV originally ran Mac OS X, but it switched over to iOS pretty rapidly. watchOS was based on iOS and, in fact, couldn’t run without an iPhone nearby. There was even a moment during the middle of the decade when it looked like Apple would put the Mac out to pasture.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3817236/iphone_home_screen_ios_16.jpg?quality=50&amp;strip=all\" alt=\"iphone_home_screen_ios_16.jpg\" loading=\"lazy\" /><figcaption><p>The iPhone and iOS are what Apple’s platforms all revolve around.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Out of many platforms, one</h2>\n\n\n\n<p>What happened after that was a masterstroke. Apple started planning to move the Mac to Apple’s own processors, the same ones in the iPhone. It spent a few years bringing the underpinnings of macOS and iOS back together after years of them drifting apart. And it made it possible for Macs to take advantage of the iOS software platform, either via Mac Catalyst or even running iPad apps directly on Apple silicon Macs.</p>\n\n\n\n<p>This is how Apple can manage to be the platform owner of all these different devices. While they look different, and behave differently to a certain degree, beneath the surface they’re all variations of the same platform. Yes, macOS is an outlier–though far less than it once was–but every other product is firmly a derivative of iOS, from the Studio Display to the HomePod… to the forthcoming Apple headset.</p>\n\n\n\n<p>This is what struck me when reading Tuesday’s report from Bloomberg: Not even Apple has the resources to build an entirely new operating system, system apps, and a development platform from scratch for a new AR/VR headset. But what Apple <em>can</em> do, and in fact has gotten very, very good at, is taking iOS and then making a variant that fits the product in question.</p>\n\n\n\n<p>So while Apple is building apps for the VR headset, is there any doubt that they’re based on the knowledge, and probably the code base, of analogous apps on iOS and iPadOS? Of course, any new features of the headset will have to be added, but Apple has an enormous library of code for screen sharing, messaging, gaming, media playback… you name it.</p>\n\n\n\n<p>When Apple unveils this device to developers, it won’t ask them to start from scratch, either. Instead, it will be speaking to seasoned iOS developers, many of whom have been exposed to VR/AR-adjacent Apple software tools for the last few years. There will be plenty of learning to do, but they will be starting from a position of familiarity.</p>\n\n\n\n<p>It will be a lot easier for Apple to convince developers to develop apps for a new headset that’s running a familiar operating system with a few new wrinkles. It’ll be easier for users putting on the headset for the first time to see new versions of Apple’s own apps.</p>\n\n\n\n<p>None of this is easy. Being a platform owner isn’t easy. That’s one reason there aren’t very many of them. But the strategies Apple has employed in order to ship so many different kinds of devices are exactly the strategies they’ll be able to use to ship one more. It’s an advantage that only Apple has, and you bet they’re going to use it.</p>\n\nApple, iOS, MacOS, Virtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"19ad643c4fdc9322b8f8068a6528b822b4d2c326a8291d02a6148457195cb29d","category":"Apple"}