{"title":"2017","link":"https://www.llun.me/posts/2017-12-31-2017/","date":1514678400000,"content":"\n      \n        <p>Not too sure how to describe this year. It is not too bad but also not so great. Kind of a year of fighting which is increasing in the same rate as age. Start playing with many things in the work, in free time but no traveling abroad at all (I guess this will be a thing that is happen like year and skip a year now.)</p>\n<h2 id=\"aws-lambda%2C-first-toy-from-end-of-2016\">AWS Lambda, first toy from end of 2016 <a class=\"direct-link\" href=\"https://www.llun.me/posts/2017-12-31-2017/#aws-lambda%2C-first-toy-from-end-of-2016\">#</a></h2>\n<p>This is like a research for whole year, building a lot of tools around it also contribute some back to the upstream. I am very impress with the cost and usefulness. Using as a background processing job and the cost for unused VM time is almost free or a fraction of it used to be.</p>\n<p>Cold start is kind of problem when using it for API and serving frontend job but I guess this will improve. Tools around it is still an issue but end of year it is not so much anymore. Next year I guess this will be a lot more mature than this year and more fun.</p>\n<h2 id=\"home-automation-and-my-homemade-router\">Home automation and my homemade router <a class=\"direct-link\" href=\"https://www.llun.me/posts/2017-12-31-2017/#home-automation-and-my-homemade-router\">#</a></h2>\n<p>I did not see how useful is this in the beginning. I start with only SoundTouch speaker which has wifi and http server api and just a question “Hey what I can do with this speaker” and now, in the end of year, I can control most of devices in my room with voice (which I also against it in the beginning of the year)!</p>\n<figure><img src=\"https://www.llun.me/posts/2017-12-31-2017/homekit-control.jpg\" alt=\"\" /><figcaption>All devices in the room with some wifi presence sensor from my homemade router!</figcaption></figure>\n<p>With duplicate two posts, <a href=\"https://medium.com/llun/home-automation-492b3c2ec43d\" target=\"_blank\" rel=\"noopener\">Home Automation (with homebridge)</a> and <a href=\"https://www.llun.me/posts/dev/2017-06-04-building-my-own-router-and-homekit-hub/\">building a router</a> for presence detection. It makes me learn a lot from how to compile kernel to the netlink which is a bus that can tap in for many activities in kernel. Another few things that learn from this also, how is HomeKit is far better handle offline task and rules than Google Home and also How far voice command in Google Assistant is better than Siri. I’m not play with Alexa yet because the api itself is not really easy compare to HomeKit and not very useful if it <a href=\"http://www.business-standard.com/article/technology/google-vs-amazon-youtube-services-no-longer-available-on-fire-tv-117123000555_1.html\">cannot control YouTube.</a></p>\n<h2 id=\"cycling\">Cycling <a class=\"direct-link\" href=\"https://www.llun.me/posts/2017-12-31-2017/#cycling\">#</a></h2>\n<p>New bike! New Jersey! New Short! I didn’t expect to cycle much this year because of office is further away from previous one but in the end I complete this year goal with one real medal from cycling event!</p>\n<figure><img src=\"https://www.llun.me/posts/2017-12-31-2017/ocbc1.jpg\" alt=\"\" /><figcaption>First cycling event!</figcaption></figure>\n<figure><img src=\"https://www.llun.me/posts/2017-12-31-2017/bike-rack.jpg\" alt=\"\" /><figcaption>New bike! The top one</figcaption></figure>\n<p>Not everything is perfect, almost end of the year got one fall which take me to afraid of cycling on road for sometime but now I’m back!</p>\n<h2 id=\"nintendo-switch\">Nintendo Switch <a class=\"direct-link\" href=\"https://www.llun.me/posts/2017-12-31-2017/#nintendo-switch\">#</a></h2>\n<p>Wasting time machine of the year! For few months to complete Zelda and another few months for other games but I really love this machine. It very good toy for a party.</p>\n<figure><img src=\"https://www.llun.me/posts/2017-12-31-2017/mario-kart.jpg\" alt=\"\" /><figcaption>MarioKart time</figcaption></figure>\n<p>I carry this machine to almost every party this year. Although I have to carry charger with me too because Nintendo lock device to allow only it own charger for making it work with external display but it still worth for carry it out. So instead of I carry Macbook Pro charger I just need to carry this one (it is not enough to power my MacBook when use it as full power but enough if I just browsing the web or watching non 4k video.)</p>\n<p>Worthy game for me would be</p>\n<ul>\n<li>Zelda breath of the wild. I think this is a game of this year too!</li>\n<li>MarioKart8. Good for party that don’t like fighting</li>\n<li>Arms. Good for party that like fighting</li>\n<li>Super Mario Odyssey. Good for playing after finish Zelda</li>\n<li>1–2 Switch. Another good party game</li>\n<li>Overcooked. Party game that need really good coordinator</li>\n<li>Ace of the Luftwaffe. Space shooter party game that can play up to 4 players!</li>\n</ul>\n<h2 id=\"end-of-2017\">End of 2017 <a class=\"direct-link\" href=\"https://www.llun.me/posts/2017-12-31-2017/#end-of-2017\">#</a></h2>\n<p>December is kind of good and bad month for me, getting old, cake, and somehow this year, December is super busy month with a bad experience. This break in new year is hopefully make me recovery a bit and as least can fight for next year. It’s not so great year but I guess not so bad too.</p>\n\n        <p>\n          <a href=\"mailto:comment@llun.me?subject=Common on post https://www.llun.me/posts/2017-12-31-2017/\">Send a comment</a>\n        </p>\n      \n    ","author":"","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"19b38c91b4e172f194cf4f6be374059f3c3242446f928d616ef116eac7754bd2","category":"Me"}