{"title":"Shaping sustainable futures: The role of micro-entrepreneurs’ personality traits in social innovations","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306800","date":1723644000000,"content":"<p>by Maciej Zastempowski</p>\r\n\r\nIn the rapidly evolving business landscape, micro-entrepreneurs stand out as significant contributors to social innovation. However, the link between their personality traits and the social innovations they introduce needs to be studied more. This research, guided by the Big Five model and the Oslo Manual’s innovation framework, aims to address this gap. The central question driving this study is whether the personality traits of micro-entrepreneurs, precisely openness to experience, conscientiousness, extraversion, agreeableness, and neuroticism, influence the social innovations they bring forth. Through a comprehensive exploration of literature and empirical analysis—quantitative research on a representative sample of 1848 Polish micro-entrepreneurs—this research examines the interconnectedness between personality characteristics and social innovation outcomes. The key findings suggest that three personality variables characterising micro-entrepreneurs–openness for experience, conscientiousness, and extroversion–emerge as shared, statistically significant factors. These variables positively impact all types of social innovations implemented by micro-entrepreneurs (product and process). In none of the analysed cases, agreeableness and neuroticism were statistically significant. Finally, it’s worth emphasising that the chances of micro-entrepreneurs introducing social innovations increase more strongly with an increase in their openness to experience than in the case of extroversion and conscientiousness.","author":"Maciej Zastempowski","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"19bdbc2a5319836fe94ed1dee2412c8faf5886a0d1e846c65f1c748ef3d2a369","category":"Interdisciplinary"}