{"title":"Quantitative measures of discrimination with application to appointment processes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299870","date":1710338400000,"content":"<p>by P. A. Robinson, C. C. Kerr</p>\r\n\r\nBias and discrimination in appointment processes such as hiring decisions (and analogous selection procedures for performance evaluations, promotions, scholarships, and awards), are quantified statistically via the binomial distribution. These statistical measures are described and an easily used webapp for calculating them is provided. The measures considered include the likelihood that a given number of appointments arose from a fair process and the likelihood that an existing process would give rise to a fair outcome if it were repeated. These methods are illustrated by applying them to sex (including gender) discrimination and racial discrimination in senior appointments in the Australian university sector; both conscious and unconscious biases are included. Significant sex discrimination is found to have existed in the appointments of university chief executives (Vice Chancellors) who were in office in 2018, but with a moderate chance that current processes will yield fair outcomes in the future. However, there is no evidence of strong sex discrimination in the country’s eight main research universities for senior appointments (i.e., Faculty Deans and members of their governing Boards or Senates) for those in office as of 2021. However, at the same dates, extreme racial discrimination was implicit in the selection procedures for both Vice Chancellors and senior appointments in all these universities. The University of Sydney’s senior appointments were found to have had the most racially biased outcomes among the country’s eight main research universities. Significantly, there is negligible statistical likelihood of achieving racially unbiased outcomes in the future in any of the contexts considered, unless the selection procedures are significantly modified.","author":"P. A. Robinson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"19d0c08ec33ae61eeb05fdfca31882a3d00c703cb12291a1bb4f645d4f07443a","category":"Interdisciplinary"}