{"title":"This 900-person delta cluster in Mass. has CDC freaked out—74% are vaccinated [Updated]","link":"https://arstechnica.com/?p=1784187","date":1627659882000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1234110645-800x533.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1234110645.jpeg\">Enlarge</a> <span>/</span> Foot traffic along Commercial Street in Provincetown, Mass., on July 20, 2021.  Provincetown officials have issued a new mask-wearing advisory for indoors, regardless of vaccination status, on the latest data showing that Provincetown COVID cases are increasing.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/foot-traffic-along-commercial-street-in-provincetown-ma-on-news-photo/1234110645?adppopup=true\">Getty | Boston Globe</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>An analysis of a COVID-19 cluster of around 900 people in Massachusetts—<a href=\"https://www.facebook.com/ProvincetownManager/posts/157253496504824\">74 percent of whom are vaccinated</a>—is among the alarming data that spurred the Centers for Disease Control and Prevention to <a href=\"https://arstechnica.com/science/2021/07/cdc-mask-reversal-vaccinated-should-wear-masks-in-many-settings-amid-surge/\">reverse course on masks this week</a>.</p>\n<p>According to an internal CDC document <a href=\"https://www.washingtonpost.com/health/2021/07/29/cdc-mask-guidance/\">first obtained by The Washington Post</a> Thursday evening, data on the Provincetown, Massachusetts, cluster showed that vaccinated people carried surprisingly high levels of the delta coronavirus in their noses and throats. In <a href=\"https://www.cdc.gov/mmwr/volumes/70/wr/mm7031e2.htm?s_cid=mm7031e2_w\">a study of a subset of people in the cluster</a>, published at 1pm ET Friday by the CDC, Massachusetts health officials reported that fully vaccinated infected people appeared to have similar viral loads as unvaccinated infected people. More importantly, vaccinated people were found to be spreading the dangerous virus variant to other vaccinated people.</p>\n<p>The CDC-published study included 469 cases from the cluster, 346 of which were in fully vaccinated people. Of those breakthrough infections, 79 percent had symptoms, with cough, headache, sore throat, myalgia, and fever being the most common symptoms. There were five hospitalizations in the subset: one in an unvaccinated person with underlying medical conditions and four in fully vaccinated people, two of whom had underlying medical conditions. No deaths from cases linked to the cluster have been reported to date.</p></div><p><a href=\"https://arstechnica.com/?p=1784187#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1784187&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"19d4fc0fdfb74b7bdafe5d945baa56f080399d9522bbadc2dd4b114711b329ec","category":"Tech"}