{"title":"Hacking group says it has found encryption keys needed to unlock the PS5","link":"https://arstechnica.com/?p=1811284","date":1636409673000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/ps5hack-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/ps5hack.jpg\">Enlarge</a> <span>/</span> Decrypting the PS5 kernel doesn't involve opening the hardware like this, but it still serves as a good visual metaphor for how the system is now being \"exposed.\" (credit: <a href=\"https://www.youtube.com/watch?v=CaAY-jAjm0w\">Sony / YouTube</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Hacking group Fail0verflow <a href=\"https://twitter.com/fail0verflow/status/1457526453105569793\">announced Sunday evening</a> that it had obtained the encryption \"root keys\" for the PlayStation 5, an important first step in any effort to unlock the system and allow users to run homebrew software.</p>\n<p>The tweeted announcement includes <a href=\"https://twitter.com/fail0verflow/status/1457499576676634625/photo/1\">an image</a> of what appears to be the PS5's decrypted firmware files, highlighting code that references the system's \"secure loader.\" Analyzing that decrypted firmware could let Fail0verflow (or other hackers) reverse engineer the code and create custom firmware with the ability to load homebrew PS5 software (signed by those same symmetric keys to get the PS5 to recognize them as authentic).</p>\n<p>Extracting the PS5's system software and installing a replacement both require some sort of exploit that provides read and/or write access to the PS5's usually secure kernel. Fail0verflow's post does not detail the exploit the group used, but the tweet says the keys were \"obtained from software,\" suggesting the keys didn't need to make any modifications to the hardware itself.</p></div><p><a href=\"https://arstechnica.com/?p=1811284#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1811284&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"19d86972449533188d19ffc6852844eae798ec6a5fffa9ffca08368df0c0dc8f","category":"Tech"}