{"title":"Alkyl Pyridinol Compounds Exhibit Antimicrobial Effects against Gram-Positive Bacteria","link":"https://www.preprints.org/manuscript/202409.0064/v1","date":1725267191000,"content":"The rise of antibiotic-resistant pathogens represents a significant global challenge in infectious disease control, which is amplified by the decline in the discovery of novel antibiotics. Staphylococcus aureus continues to be a highly significant pathogen causing infections in multiple organs and tissues in both healthcare institutions and community settings. The bacterium has become increasingly resistant to all available antibiotics. Consequently, there is an urgent need for novel small molecules that inhibit growth or impair survival of bacterial pathogens. Given their large structural and chemical diversity as well as often unique mechanisms of action, natural products represent an excellent avenue for the discovery and development of novel antimicrobial treatments. Anaephene A and B are two such naturally occurring compounds with significant antimicrobial activity against gram-positive bacteria. Here, we report the rapid syntheses and biological characterization of five novel anaephene derivatives, which display low cytotoxicity against mammalian cells but potent antibacterial activity against various S. aureus strains, including methicillin resistant S. aureus (MRSA) and the multi drug-resistant community acquired strain USA300LAC. A Sonogashira cross-coupling reaction served as the key step for the synthesis of the alkyl pyridinol products. Using the compound JC-01-074, which displays bactericidal activity already at low concentrations (MIC: 16 mg/ml), we provide evidence that alkyl pyridinols target actively growing and biofilm-forming cells and show that these compounds cause disruption and deformation of the staphylococcal membrane, indicating a membrane associated mechanism of action.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"19dafe27980f5ea2dd1748e4e5176acf2fa44a742aad509ae419eb14fda49bd5","category":"Interdisciplinary"}