{"title":"How iOS 15 transforms the way we think of iPhone updates","link":"https://www.macworld.com/article/348888/ios-15-older-iphones-software-security-updates.html","date":1623837600000,"content":"\n<div>\n<section><div></div></section><p>Apple’s been crowing about the pace at which its users install software updates for ages. Rapid uptake of updates is a sign of a healthy ecosystem—and yet, as announced last week, Apple has made a change that threatens to derail the iOS update train. Just as it unveiled all the features that threaten to make iOS 15 a must-have update this fall, Apple also announced that iOS 14 users who aren’t ready to board will have the opportunity to step off and wait it out.</p>\n\n\n\n<p>“iOS now offers a choice between two software update versions in the Settings app,” reads <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/ios/ios-15-preview/features/&amp;subid1=1-1-348888-0-0-0\">a page on the iOS 15 website</a>. “You can update to the latest version of iOS 15 as soon as it’s released for the latest features and most complete set of security updates. Or continue on iOS 14 and still get important security updates until you’re ready to upgrade to the next major version.”</p>\n\n\n\n<p>It’s not quite the end of iOS updates as we know them, but it’s a fascinating change that has a lot of ramifications for the future of iOS.</p>\n\n\n\n<h2>Fear of updates</h2>\n\n\n\n<p>It’s in Apple’s best interest for users to update to the latest version of its operating systems, for many reasons. The faster the users move, the more comfortable app developers will be in implementing all the nice new features that Apple has added to the latest OS releases. It’s a virtuous cycle.</p>\n\n\n\n<p>It’s also a huge security issue. While Apple does patch old operating-system versions when necessary, the best way to stay secure is generally to be on the latest OS version and stay updated. The more current iOS users are, the safer they are.</p>\n\n\n\n<p>Unfortunately, iOS 7 got in the way.</p>\n\n\n\n<p>Eight years ago, iPhone users updated their devices without any concern. But then something catastrophic happened: iOS 7, which completely redesigned the entire iPhone interface, arrived on millions of iPhones. The shock of those changes was enough to make an entire generation of users distrust automatic software updates.</p>\n\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ios-7.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>iOS 7 was a major shift in the iOS UI, and many users were resistant to the changes.</p></figcaption></figure></div><p>Apple</p></div>\n\n\n\n<p>I’m not exaggerating. The shock of iOS 7 transformed most of the non-tech-oriented iPhone users I know into paranoid software updaters. I visit relatives and they note that they have been putting off software updates for weeks or months. My mother refuses to update her phone unless I’m there to supervise things—her concern about software updates never existed before that iOS 7 update.</p>\n\n\n\n<p>In the intervening years, Apple has tried a few strategies to provide an inducement for users to update. When a new OS feature becomes a breakout hit—like using widgets to customize your iPhone’s interface in iOS 14—it drives updates.</p>\n\n\n\n<p>And then there’s emoji. Yes, emoji. Apple generally doesn’t release a new year’s emoji set with the first version of a new operating system. But just as the initial wave of updates begins to flag, Apple steps in with an update that uses the power of FOMO (the fear of missing out) to drive software updates. For a lot of people, nothing quite motivates updating like the opportunity to use a new emoji, or even more likely, the lack of ability to see the new emoji that a friend is sending your way.</p>\n\n\n\n<h2>So why undercut the updates?</h2>\n\n\n\n<p>If updates are so important to Apple, then why is going to offer users the ability to stay behind on iOS 14 for a while?</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/apple-new-emoji-2020.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The main reason (and the only reason, for a lot of people) to update iOS is for the new emoji.</p></figcaption></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blog.emojipedia.org/first-look-new-emojis-coming-to-ios-in-2020/&amp;xcust=1-1-348888-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Emojipedia</a></div>\n\n\n\n<p>It’s a little bit of a trick question because Apple’s not turning off software updates, it’s just offering two separate tracks for software updates. Users who opt to stay behind will still receive important security updates, making them safer than they might have been if that had avoided all updates. In essence, Apple’s telling users that they don’t have to compromise their safety just to avoid getting a software update that messes up their phone.</p>\n\n\n\n<p>Of course, Apple will continue to extoll the virtues of its software updates. New emoji designs will continue to draw people to the update panel in order to interpret the messages their friends are sending their way. But users will be able to make that move when they want, while still feeling confident that they’ll be able to get the updates they need to stay safe.</p>\n\n\n\n<h2>Freedom for old devices</h2>\n\n\n\n<p>I also have to wonder if perhaps this move is a precursor to a forthcoming iOS update, perhaps iOS 16, breaking compatibility with a bunch of older devices. Right now Apple’s track record of supporting older iPhone models with iOS is remarkable. The iPhone 6S, released in 2015, will run iOS 15. Android phones are lucky to get a couple of years on the current OS version before they’re forced off the update cycle forever.</p>\n\n\n\n<p>But by building a second update path into iOS, Apple is visibly committing to a separate update track for iOS. The next time Apple marks a bunch of devices as incompatible with a future update—and surely the time for pre-iPhone X models is coming soon—it will be able to park those devices in an update track that will still get major security updates for some time to come.</p>\n\n\n\n<p>It’s not that Apple hasn’t been updating older devices when necessary—it has. It’s more that, by making this feature so much more prominent (it’s in the iOS 15 marketing page!), it’s both committing to the practice and highlighting that even devices that aren’t on the latest OS version are still usable. That’s a good flag to plant in the ground, especially if a new round of incompatibility might be in the offing next year.</p>\n</div>","author":"Jason Snell","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"19e5441aee741171c708c7feb9b4de23cf1e8f6c29d2a170fcaa4a5cc941d24d","category":"Apple"}