{"title":"Mosquito‐Borne Disease among Individuals Experiencing Homelessness in the United States: A Literature Review","link":"https://www.preprints.org/manuscript/202410.1054/v1","date":1728900543000,"content":"Mosquito-borne diseases are a major public health issue. The United States has experienced mosquito-borne disease outbreaks, including West Nile virus, Zika, dengue, and malaria, highlighting widespread risk across the country. In the United States, exposure to mosquito vectors primarily occurs outdoors. Individuals experiencing unsheltered homelessness are particularly vulnerable to mosquito-borne diseases due to their increased exposure to mosquito vectors, limited access to healthcare, and high prevalence of underlying conditions. This review aims to examine the literature on mosquito-borne disease infections among individuals experiencing homelessness in the United States between 1999 and 2024. Our search strategy used Boolean methods on PubMed, Scopus, and Web of Science to select relevant publications. Two queries were used: the first query focuses on individuals experiencing homelessness and mosquito-borne diseases, and the second one focuses on epidemiological analyses of mosquito-borne disease outbreaks in the US. Only studies reporting at least 1 infection among individuals experiencing homelessness were included. Our search resulted in the identification of 347 studies. After screening them, 8 were ultimately included in this review. Half of the studies identified West Nile virus among individuals experiencing homelessness and the other half reported cases of malaria. These studies show that individuals experiencing homelessness are more exposed to mosquitoes, face a higher risk of infection, and have an increased likelihood of hospitalization due to mosquito-borne diseases compared to the general population. The full extent of mosquito-borne disease exposure among individuals experiencing homelessness remains unclear. With climate change and globalization, there is a consensus in the literature showing an increasing risk of mosquito-borne disease transmission in the next decades, and we have already started to witness this increasing trend. Therefore, we argue that developing policies aimed at providing homeless populations with housing during mosquito-borne disease outbreaks could be instrumental in protecting this segment of the population and promoting health equity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"19f34055658195b10460e0688a87ccefffceda223bbbd97cffd3e7ab8d6607f3","category":"Interdisciplinary"}