{"title":"Poverty and neighborhood opportunity effects on neonate DNAm developmental age","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306452","date":1720792800000,"content":"<p>by Stefanie R. Pilkay, Anna K. Knight, Nicole R. Bush, Kaja LeWinn, Robert L. Davis, Frances Tylavsky, Alicia K. Smith</p>\r\nBackground <p>Children from families with low socioeconomic status (SES), as determined by income, experience several negative outcomes, such as higher rates of newborn mortality and behavioral issues. Moreover, associations between DNA methylation and low income or poverty status are evident beginning at birth, suggesting prenatal influences on offspring development. Recent evidence suggests neighborhood opportunities may protect against some of the health consequences of living in low income households. The goal of this study was to assess whether neighborhood opportunities moderate associations between household income (HI) and neonate developmental maturity as measured with DNA methylation.</p> Methods <p>Umbilical cord blood DNA methylation data was available in 198 mother-neonate pairs from the larger CANDLE cohort. Gestational age acceleration was calculated using an epigenetic clock designed for neonates. Prenatal HI and neighborhood opportunities measured with the Childhood Opportunity Index (COI) were regressed on gestational age acceleration controlling for sex, race, and cellular composition.</p> Results <p>Higher HI was associated with higher gestational age acceleration (<i>B</i> = .145, <i>t</i> = 4.969, <i>p</i> = 1.56x10<sup>-6</sup>, 95% CI [.087, .202]). Contrary to expectation, an interaction emerged showing higher neighborhood educational opportunity was associated with lower gestational age acceleration at birth for neonates with mothers living in moderate to high HI (<i>B</i> = -.048, <i>t</i> = -2.08, <i>p</i> = .03, 95% CI [-.092, -.002]). Female neonates showed higher gestational age acceleration at birth compared to males. However, within males, being born into neighborhoods with higher social and economic opportunity was associated with higher gestational age acceleration.</p> Conclusion <p>Prenatal HI and neighborhood qualities may affect gestational age acceleration at birth. Therefore, policy makers should consider neighborhood qualities as one opportunity to mitigate prenatal developmental effects of HI.</p>","author":"Stefanie R. Pilkay","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"19f7f7dadfc622b4abf60b1ea9bc8d77c4aad155002028b9e76013bdc8d30bae","category":"Interdisciplinary"}