{"title":"Production, Characterization, Purification and Antitumor Activity of L-asparaginase from Aspergillus niger","link":"https://www.preprints.org/manuscript/202403.1222/v1","date":1710983434000,"content":"Cervical cancer is caused by a persistent and high-grade infection, caused by the Human Papilloma Virus (HPV), which, when entering cervical cells, alters their physiology and generates serious lesions. HPV 18 - is among those most involved in carcinogenesis in this region, but there are still no drug treatments that cause cure or total remission of lesions caused by HPV. Knowing that L-Asparaginase is an amidohydrolase, which plays a significant role in the pharmaceutical industry, particularly in the treatment of specific cancers, due to its antitumor properties, some studies have demonstrated its cytotoxic effect against cervical cancer cells. However, the commercial version of this enzyme has side effects, such as hypersensitivity, allergic reactions and silent inactivation due to the formation of antibodies. To mitigate these adverse effects, several alternatives have been explored, including the use of L-asparaginase from other microbiological sources, which is the case with the use of the fungus Aspergillus niger, a high producer of L-asparaginase. The study investigated the influence of the type of fermentation, precipitant, purification, characterization and in vitro cytotoxicity of L-asparaginase. The results revealed that semisolid fermentation produced higher enzymatic activity and protein concentration of A. niger. The characterized enzyme showed excellent stability at pH 9.0, temperature of 50ºC, resistance to surfactants and metallic ions, and an increase in enzymatic activity was also noted with the organic solvent ethanol. Furthermore, it exhibited low cytotoxicity in GM and RAW cells, and significant cytotoxicity in HeLa cells. These findings indicate that L-asparaginase derived from Aspergillus niger may be a promising alternative for pharmaceutical production. Its attributes, including stability, activity and low toxicity in healthy cells, suggest that this modified enzyme could overcome challenges associated with antitumor therapy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"19f92e04bd9fe420adc0a827b29f436ced552339a270351a8f839843ce939a24","category":"Interdisciplinary"}