{"title":"88 Ruminal degradation profiles of dry matter, organic matter, and crude protein of finishing diets with different levels of inclusion of dried distiller’s grains plus solubles and soybean meal","link":"https://academic.oup.com/jas/article/102/Supplement_2/252/7664980?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to estimate the ruminal degradation profile of dry matter (DM), organic matter (OM), and crude protein (CP) in concentrate-based diets with different levels of inclusion of dried distiller’s grains plus solubles (DDGS) and soybean meal (SBM). Red Angus steers [n = 4; body weight (BW) = 360 ± 9 kg] with ruminal, duodenal, and ileal cannulas, were used in a 4 × 4 latin square. Diets (TMR) consisted of dry-rolled corn (70%), hay (10%), liquid supplement (5%), and test ingredients (15%). Treatments were (DM basis): 1) 15.0% DDGS (CON); SBM in replacement of 50% of DDGS (SBM50); SBM in replacement of 75% of DDGS (SBM75), and SBM in replacement of 100% of DDGS (SBM100). Each period lasted 18-d, consisting of a 7-d diet adaptation followed by an 11-d collection period. An in situ ruminal incubation of each TMR was performed from d 8 to 11 of each period. Ingredients were weighed separately, maintaining their proportion in the TMR. Air-dried TMR sample (6 g, 2 mm grind) was ruminally incubated in a nylon bag (Ankom, 10 × 20 cm) using the same steer from the in vivo study. Samples were incubated for 0, 2, 4, 8, 16, 24, 48, and 72 h. The number of bags varied as a function of the incubation time to guarantee enough residual samples after incubation, where more bags per sample were incubated for the longer incubation times relative to the shorter incubation times (72 and 48 h, n = 5; 24 h, n = 4; 16 h, n = 3; 8 h and 4 h, n = 2; 2 h and 0 h, n = 1). DM, OM, and CP degradation were estimated by using the following model: Yt = a + b × (1 − e<sup>(−kd × t)</sup>), The NLIN procedure of SAS 9.4 was used and restricted and full models were compared by a likelihood ratio test. Rumen degradable protein (RDP) of each TMR was calculated as follows: RDP = a + b + [kd/(kd + kp)], where kp was 0.05 h<sup>−1</sup>). There were no differences (<span>P</span> ≥ 0.47) on the fractions a, b, and kd, or RDP (55%) between treatments for DM, OM, and CP. According to our analysis, approximately 13 h of incubation is necessary to accurately estimate the RDP content of the TMR. The NASEM (2016) adopts 35 and 75% of RDP for DDGS and SBM, respectively, based on fixed incubation time of 16 h. Most studies have evaluated degradation profiles of individual feed and not TMR; however, animals are fed complete diets, made up by feedstuff that vary in physical characteristics, nutrient composition, and consequently RDP. In this study, the similar degradation profiles between diets suggest that RDP of complete diets differs from that of individually assayed ingredients.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"19f9fa4dafab5033374c67d31e53b88615d7c11f0280e1647537bfea48e798b7","category":"Environment"}