{"title":"Assessment of Seasonal Rainfall Prediction in Ethiopia: Evaluating a Dynamic Recurrent Neural Network to Downscale ECMWF-SEAS5 Rainfall","link":"http://link.springer.com/10.1007/s00376-024-3345-1","date":1730419200000,"content":"<h3>Abstract</h3>\n                    <p>Seasonal rainfall plays a vital role in both environmental dynamics and decision-making for rainfed agriculture in Ethiopia, a country often impacted by extreme climate events such as drought and flooding. Predicting the onset of the rainy season and providing localized rainfall forecasts for Ethiopia is challenging due to the changing spatiotemporal patterns and the country’s rugged topography. The Climate Hazards Group InfraRed Precipitation with Station Data (CHIRPS), ERA5-Land total precipitation and temperature data are used from 1981–2022 to predict spatial rainfall by applying an artificial neural network (ANN). The recurrent neural network (RNN) is a nonlinear autoregressive network with exogenous input (NARX), which includes feed-forward connections and multiple network layers, employing the Levenberg Marquait algorithm. This method is applied to downscale data from the European Centre for Medium-range Weather Forecasts fifth-generation seasonal forecast system (ECMWF-SEAS5) and the Euro-Mediterranean Centre for Climate Change (CMCC) to the specific locations of rainfall stations in Ethiopia for the period 1980–2020. Across the stations, the results of NARX exhibit strong associations and reduced errors. The statistical results indicate that, except for the southwestern Ethiopian highlands, the downscaled monthly precipitation data exhibits high skill scores compared to the station records, demonstrating the effectiveness of the NARX approach for predicting local seasonal rainfall in Ethiopia’s complex terrain. In addition to this spatial ANN of the summer season precipitation, temperature, as well as the combination of these two variables, show promising results.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"19fc2dbfd435046244716c94646522bad894d33e79d8f798b3f6f192997f6feb","category":"Environment"}