{"title":"Multilevel analysis of dropout from maternal continuum of care and its associated factors: Evidence from 2022 Tanzania Demographic and Health Survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302966","date":1715090400000,"content":"<p>by Angwach Abrham Asnake, Amanuel Alemu Abajobir, Beminat Lemma Seifu, Yordanos Sisay Asgedom, Molalgn Melese, Meklit Melaku Bezie, Yohannes Mekuria Negussie</p>\r\nBackground <p>The maternal continuum of care (CoC) is a cost-effective approach to mitigate preventable maternal and neonatal deaths. Women in developing countries, including Tanzania, face an increased vulnerability to significant dropout rates from maternal CoC, and addressing dropout from the continuum remains a persistent public health challenge.</p> Method <p>This study used the 2022 Tanzania Demographic and Health Survey (TDHS). A total weighted sample of 5,172 women who gave birth in the past 5 years and had first antenatal care (ANC) were included in this study. Multilevel binary logistic regression analyses were used to examine factors associated with dropout from the 3 components of maternal CoC (i.e., ANC, institutional delivery, and postnatal care (PNC)).</p> Results <p>The vast majority, 83.86% (95% confidence interval (CI): 82.83%, 84.83%), of women reported dropout from the maternal CoC. The odds of dropout from the CoC was 36% (AOR = 0.64, (95% CI: 0.41, 0.98)) lower among married women compared to their divorced counterparts. Women who belonged to the richer wealth index reported a 39% (AOR = 0.61, (95% CI: 0.39, 0.95)) reduction in the odds of dropout, while those belonged to the richest wealth index demonstrated a 49% (AOR = 0.51, (95% CI: 0.31, 0.82)) reduction. The odds of dropout from CoC was 37% (AOR = 0.63, (95% CI: 0.45,0.87)) lower among women who reported the use of internet in the past 12 months compared to those who had no prior exposure to the internet. Geographical location emerged as a significant factor, with women residing in the Northern region and Southern Highland Zone, respectively, experiencing a 44% (AOR = 0.56, 95% CI: 0.35–0.89) and 58% (AOR = 0.42, 95% CI: 0.26–0.68) lower odds of dropout compared to their counterparts in the central zone.</p> Conclusion <p>The dropout rate from the maternity CoC in Tanzania was high. The findings contribute to our understanding of the complex dynamics surrounding maternity care continuity and underscore the need for targeted interventions, considering factors such as marital status, socioeconomic status, internet usage, and geographical location.</p>","author":"Angwach Abrham Asnake","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1a0260d5db9206f619cfc469b23ff9fc6d41107610a4d5ac116d03c90b8624a0","category":"Interdisciplinary"}