{"title":"PSVI-11 Effects of S-Abscisic Acid administration on the antioxidative status and glucose absorption in the gut of rats","link":"https://academic.oup.com/jas/article/102/Supplement_2/319/7664976?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>S-Abscisic Acid (S-ABA) is known to show various physiological functions in plants, but little information is available regarding the role of S-ABA in animals. Two experiments were conducted to investigate the effects of S-ABA administration on the antioxidative status and the function of the gut in rats. In the Experiment 1, male 5-wk-old Sprague-Dawley (SD) rats (n = 40) were randomly divided into the four groups. All groups were fed a common basal diet (MF, Oriental Yeast Co., Ltd., Tokyo, Japan). After a week of acclimation, either saline (CON) or S-ABA at 0.002 (LOW), 0.02 (MID), or 0.2 (HIGH) mg/kg body weight (BW) was administered intragastrically for 14 d. On d 14, all rats were weighed and euthanized for collection of plasma and gut mucosal tissues. The plasma concentration of superoxide dismutase (SOD) and the content of glutathione in a reduced (GSH) and an oxidized (GSSG) form in the gut mucosa was determined. The BW gain during the experimental period was significantly greater for LOW, MID and HIGH than for CON (<span>P</span> &lt; 0.01). The plasma SOD concentration did not differ among the treatments. The mucosal GSH was greater for LOW, MID and HIGH than for CON (<span>P</span> &lt; 0.01). In the Experiment 2, male 4-week-old SD rats (n = 36) were randomly allotted into three groups. The control (CON) was fed the AIN-93G diet while the other two groups received the diet supplemented with either 1 ppm (LOW) or 5 ppm (HIGH) S-ABA. The experimental diets were fed for 56 d. On d 21, 4 rats per treatment were employed for the intraperitoneal glucose tolerant test (IPGTT). The remainder of the animals were euthanized on d 56 for determination of the content of GSH and GSSG in the gut mucosa, the glycogen content in the liver, and the serum insulin concentration. There was no significant difference in the BW gain during the experimental period. In the IPGTT, HIGH showed greater blood glucose concentrations than CON (<span>P</span> &lt; 0.05) at 30 and 60 min after administration. Although there was no statistical significance, the mucosal GSH was numerically greater (<span>P</span> = 0.11) for HIGH than for CON or LOW. The liver glycogen or serum insulin did not differ among the treatments. Those results suggest that dietary S-ABA supplementation could improve the antioxidative status through stimulating the GSH production in the gut and consequently increase the absorption of glucose in animals. Although S-ABA was indicated to be beneficial in animals, further investigations are required to verify the practical benefits of feeding S-ABA to production animals.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1a033bb62dbdce24a781e7bde37fcd42cd9dc40941539cbd021863b4aa6df990","category":"Environment"}