{"title":"Shell Reworking Impacts on Climate Variability Reconstructions Using Individual Foraminiferal Analyses","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004663?af=R","date":1715961852000,"content":"<h2>Abstract</h2>\n<p>Particle mixing by benthic fauna beneath the sediment-water interface (or bioturbation) fundamentally challenges the proxy based retrieval of past climatic conditions from deep-sea sediment cores. Previous efforts targeted the impacts of bioturbation on the nature of paleoceanographic changes gleaned from the proxy record, whereas impacts on seasonal and/or interannual variability reconstructions have received less attention. We present TurbIFA (Tracking uncertainty of reworking &amp; bioturbation on IFA), a software that adapts and combines existing algorithms to quantitatively estimate the impact of sediment reworking and other uncertainties and assess significance of ocean and climate variability reconstructions based on individual foraminiferal analyses (IFA). Building upon previous idealized investigations of bioturbation using hydroclimate-sediment simulations, TurbIFA advances the IFA proxy system modeling such that users may directly assess the sensitivity of their data to various local parameters related to shell reworking across the global ocean. Using the output of state-of-the-art coupled atmosphere-ocean general circulation models, TurbIFA simulates planktic foraminiferal δ<sup>18</sup>O or Mg/Ca-temperature signal carriers and evaluates uncertainties in the sample size, analytical protocols along with as those arising from bioturbation. Application of TurbIFA to synthetic and existing data sets indicates that the significance of IFA-based reconstructions can be assessed once the impacts of sediment accumulation rates, sediment mixed layer depths, length of time integrated by the chosen IFA sampling interval, and changes in the amplitude of climate variability (i.e., the targeted environmental signal) are comprehensively evaluated. We contend that TurbIFA can aid quantitative assessments of past seasonal and interannual variability gleaned from the paleoceanographic record.</p>","author":"Natalia Bienzobas Montávez, \nKaustubh Thirumalai, \nGianluca Marino","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"1a0bd18a8eac30b3894287d18df2e6d22e3b6130ef930f8bc623843bc50f5d8f","category":"Environment"}