{"title":"The incorporation of strontium and barium into the otoliths of the flounder Paralichthys olivaceus at early life stages demonstrates resilience to ocean acidification","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15766?af=R","date":1721274433000,"content":"<h2>Abstract</h2>\n<p>Ocean acidification could modify the bioavailability and chemical properties of trace elements in seawater, which could affect their incorporation into the calcareous structures of marine organisms. Fish otoliths, biomineralized ear stones made by aragonite, are suspended within the endolymph fluid of teleosts, indicating that the elemental incorporation of otoliths might also be susceptible to ocean acidification. In this study, we evaluated the combined effects of CO<sub>2</sub>-induced ocean acidification (pH 8.10, 7.70, and 7.30, corresponding to ocean acidification scenarios under the representative concentration pathway 8.5 model as projected by the Intergovernmental Panel on Climate Change) and water elemental concentrations of strontium (Sr) and barium (Ba; low, medium, and high) on elemental incorporation into otoliths of the flounder <i>Paralichthys olivaceus</i> at early life stages. Our results revealed that the elemental incorporation of Sr and Ba into otoliths was principally dependent on the corresponding water elemental concentrations rather than on ocean acidification. Moreover, the partition coefficients (<i>D</i>\n<sub>Me</sub>) of Sr and Ba may stabilize after dynamic equilibrium is reached as the water elemental concentration increases, but are not affected by ocean acidification. Therefore, the incorporation of Sr and Ba into otoliths of the flounder at early life stages may not serve as an effective indicator of ocean acidification. In other words, the findings suggest that ocean acidification does not impact the incorporation of Sr and Ba incorporation into otoliths when tracing the temperature or salinity experiences of the flounder. Our findings will provide new knowledge for understanding the potential ecological effects of ocean acidification on the recruitment dynamics of fish species.</p>","author":"Honglin Tian, \nJinhu Liu, \nXiujuan Shan, \nLiang Cao, \nXianshi Jin, \nShuozeng Dou","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"1a0ff81850cb41afbfa70e6f445aeac798f11ff48bc64a8ccdcf804bbb980a55","category":"Environment"}