{"title":"Towards A Distributed Digital Twin Framework for Predictive Maintenance in Manufacturing Systems","link":"https://www.preprints.org/manuscript/202403.1357/v1","date":1711095670000,"content":"This study uses a wind turbine case study to showcase an architecture for implementing a distributed digital twin in which all important aspects of a predictive maintenance solution in a DT use a fog computing paradigm, and the typical predictive maintenance DT is improved to offer better asset utilization and management through real time condition monitoring, predictive analytics, and health management of selected components of Wind turbines in a wind farm.. Digital twin (DT) is a technology that sits at the intersection of Internet of Things, Cloud Computing and Software Engineering to provide a suitable tool for replicating physical objects in the digital space. This can facilitate the implementation of asset management in manufacturing systems through predictive maintenance solutions leveraged by Machine Learning (ML). With DTs, a solution architecture can easily use data and software to implement asset management solutions such as Condition Monitoring and Predictive Maintenance using acquired sensor data from physical objects and computing capabilities in the digital space. While DT offers a good solution, it is an emerging technology that could be improved with better standards, architectural framework, and implementation methodologies. Researchers in both academia and industry have showcased DT implementations with different levels of success. However, DTs remain limited in standards and architectures that offer efficient predictive maintenance solutions with real time sensor data, and intelligent DT capabilities. An appropriate feedback mechanism is also needed to improve asset management operations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1a163b1705bee65804bc529d0b10d681cfdc470d8d88c174aa01580aa94f0c17","category":"Interdisciplinary"}