{"title":"Analyzing the dynamics influencing artisanal and small‐scale mining in the Upper Denkyira East Municipality, Ghana","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12432?af=R","date":1709803149000,"content":"<h2>Abstract</h2>\n<p>The gold mining sector in Ghana has significantly contributed to the nation's economic expansion by creating various employment prospects, both directly and indirectly, within mining communities. However, it is important to acknowledge that this industry has also had adverse environmental consequences. A sample size of 330 individuals, comprising small-scale miners and farmers, was randomly selected from 10 mining communities within the Upper Denkyira Municipality to examine factors influencing artisanal and small-scale mining (ASM) operations. Furthermore, 150 key informants, comprising representatives from the Environmental Protection Agency, the Forestry Commission, the Mineral Commission, and other stakeholders, were also interviewed to ascertain the impact of mining on the environment. The research employed a logic regression model, the weighted average index (WAI), and X-ray fluorescence as a method for the study data analysis. The study determined that low income, the impact of climate change on agriculture, and the high demand for gold exhibit a significant chance of influencing ASM. Furthermore, the study demonstrated that ASM have immeasurably contributed to water pollution, food security, and the loss of biodiversity in the municipality. Additionally, water resources, which serve as sources of potable water for drinking and irrigation, are heavily contaminated with arsenic, mercury, lead, copper, and nickel. The study concluded that implementing stricter regulations on mining practices, promoting sustainable mining methodologies, and providing comprehensive training to miners on environmental protection and land rehabilitation can help mitigate the negative impacts of ASM. Additionally, supporting alternative means of livelihood for mining communities, such as agriculture or ecotourism, can reduce the reliance on mining and promote sustainable development.</p>","author":"Clifford James Fagariba, \nEnoch Akwasi Kosoe, \nRobert Yakubu Adjuik","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"1a1b6de703ad6cd23cfe0f6535e149afd3fde899fb1d92bf08b1782f5dc082cf","category":"Environment"}