{"title":"Combining sentiment analysis and text mining with content analysis of farm vet interviews on mental wellbeing in livestock practice","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304090","date":1716386400000,"content":"<p>by Andrew J. Duncan, Madeleine K. Henry, Kate Lamont</p>\r\nBackground <p>The aim of the How Farm Vets Cope project was to co-design, with farm veterinary surgeons, a set of web-based resources to help them and others deal with the different situations that they can face. As part of the wider project, participants were recruited for one-to-one semi-structured phone interviews. These interviews focused on elements of job satisfaction and how the participants coped during periods of poor mental wellbeing or with setbacks and failure.</p> Methods <p>Transcripts of these interviews were analysed using both quantitative methods of sentiment analysis and text mining, including term frequency/inverse document frequency and rapid automated keyword extraction, and qualitative content analysis. The twin aims of the analysis were identifying the important themes discussed by the participants and comparing the results of the two methods to see what differences, if any, arose.</p> Results <p>Analysis using the afinn and nrc sentiment lexicons identified emotional themes of anticipation and trust. Rapid automated keyword extraction highlighted issues around age of vets and support, whilst using term frequency/inverse document frequency allowed for individual themes, such as religion, not present across all responses, to be identified. Content analysis supported these findings, pinpointing examples of trust around relationships with farmers and more experienced vets, along with some examples of the difference good support networks can make, particularly to younger vets.</p> Findings <p>This work has confirmed previous results in identifying the themes of trust, communication and support to be integral to the experience of practicing farm veterinary surgeons. Younger or less experienced vets recognised themselves as benefiting from further support and signposting, leading to a discussion around the preparation of veterinary students for entry into a farm animal vet practice. The two different approaches taken showed very good agreement in their results. The quantitative approaches can be scaled to allow a larger number of interviews to be utilised in studies whilst still allowing the important qualitative results to be identified</p>","author":"Andrew J. Duncan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1a1e81ed39072c33c08595dffeb2ed51a566f388e26eb1a8308b53f7cf1ecd3b","category":"Interdisciplinary"}