{"title":"ผลทดสอบ Windows 11 ประสิทธิภาพเล่นเกมตกลง 25% เพราะฟีเจอร์ความปลอดภัย VBS","link":"https://www.blognone.com/node/125076","date":1633317431000,"content":"<div><div><div><p>เว็บไซต์ PCGamer ลองทดสอบการเล่นเกมบน Windows 11 แล้วพบว่าฟีเจอร์ความปลอดภัย Virtualization-Based Security (VBS) ส่งผลต่อประสิทธิภาพของเกม ทำเฟรมเรตลดลงเฉลี่ยประมาณ 25%</p>\n<p><a href=\"https://docs.microsoft.com/en-us/windows-hardware/design/device-experiences/oem-vbs\">Virtualization-Based Security (VBS)</a> เป็นชุดฟีเจอร์ความปลอดภัยที่อิงกับ hypervisor มีมาตั้งแต่ Windows 10 แต่ไม่ถูกเปิดใช้เป็นดีฟอลต์ (อยู่ในหมวด Device Security) หากอัพเกรดเครื่องจาก Windows 10 เป็น Windows 11 ก็จะยังไม่เปิดใช้งาน แต่ถ้าเป็น Windows 11 ที่มาพร้อมเครื่อง OEM จะถูกเปิดเป็นดีฟอลต์</p>\n<p><a href=\"https://www.blognone.com/node/124559\">VBS เป็นประเด็นหนึ่งที่ทำให้ Windows 11 ซัพพอร์ตฮาร์ดแวร์เก่าๆ ไม่ได้ เพราะต้องใช้ซีพียูรุ่นที่รองรับด้วย</a> (นอกเหนือจากเรื่อง TPM 2.0 ที่เป็นอีกกรณีแยกกัน เพราะ VBS สามารถใช้งานได้โดยไม่ต้องมี TPM)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2c71aa0eae11fa732e5acc9e7c96a3f1.png\" /></p>\n<p>จากการทดสอบของ PCGamer พบว่าเกมดังๆ หลายเกมได้รับผลกระทบจาก VBS เช่น Shadow of the Tomb Raider เฟรมเรตลด 28%, Horizon Zero Dawn ลด 25%, Metro Exodus ลด 24% ในขณะที่บางเกมอย่าง Far Cry New Dawn ลดเพียง 5%</p>\n<p>PCGamer ค้นหาสาเหตุของปัญหาประสิทธิภาพ พบว่าซีพียูและจีพียูยังทำงานได้ปกติ วิ่งที่สัญญาณนาฬิกาเท่าเดิม แต่กำลังไฟที่จ่ายให้ซีพียูและจีพียูลดลงแทน ซึ่งยังไม่ทราบชัดว่าเกิดจากอะไร</p>\n<p>PCGamer แนะนำว่าเกมเมอร์ควรปิดการใช้งาน VBS ซึ่งเกมเมอร์ส่วนใหญ่ไม่น่าจะได้รับผลกระทบอยู่แล้ว แต่กรณีว่าซื้อเครื่องใหม่ที่ออกในช่วงนี้อาจต้องหาวิธีปิด VBS กันเอง ตอนนี้ยังไม่มีข้อมูลว่าพีซีหรือโน้ตบุ๊กเกมมิ่งที่จะออกในช่วงนี้จะเปิด VBS มาให้ด้วยหรือไม่</p>\n<p>ที่มา - <a href=\"https://www.pcgamer.com/windows-11-pcs-can-hobble-gaming-performance/\">PCGamer</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/windows-11\">Windows 11</a></div><div><a href=\"/topics/security\">Security</a></div><div><a href=\"/topics/operating-system\">Operating System</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/benchmark\">Benchmark</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1a20f1a2d063e7677fa6098fbe808a76319b1fa7a29dc340662be321d61ff4b0","category":"Thai"}