{"title":"Integrating mid‐infrared spectroscopy, machine learning, and graphical bias correction for fatty acid prediction in water buffalo milk","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13471?af=R","date":1720851246000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Buffalo milk, constituting 15% of global production, has higher fatty acids content than Holstein milk. Fourier-transform mid-infrared (FT-MIR) spectroscopy is widely used for dairy analysis, but its application to buffalo milk, with larger fat globules, remains understudied. The ultimate goal of this study is to develop machine learning models based on FT-MIR spectroscopy for predicting fatty acids in buffalo milk and to assess the accuracy of commercial milk analyzers. This research provides a convenient, fast, and environmentally friendly method for detecting the fatty acid composition in buffalo milk.</p>\n<h2>RESULTS</h2>\n<p>We employed six machine learning algorithms to establish a detection model for 34 fatty acids in buffalo milk. The predictive models demonstrated robust capabilities for high-content fatty acids [C14:0, C15:0, C16:0, C17:0, C18:0, C18:1, saturated fatty acid (SFA), monounsaturated fatty acid (MUFA)], with errors within a 15% range. Traditional FT6000 detection methods exhibited limitations in measuring SFAs and polyunsaturated fatty acids (PUFA). Implementing a mean difference correction of 0.21 for MUFAs and applying regression equations (SFA × 1.0639 + 0.0705; PUFA × 0.5472 + 0.0047) significantly improved measurement accuracy.</p>\n<h2>CONCLUSION</h2>\n<p>This study successfully developed a predictive model for fatty acids in Mediterranean buffalo milk based on FT-MIR spectroscopy. Additionally, a correction was applied to the existing measurement device, FT6000, enabling more accurate measurements of fatty acids in buffalo milk. The findings have practical implications for the food industry, offering a faster and more reliable approach to assess and monitor fatty acid composition in buffalo milk, potentially influencing product development and quality control processes. © 2024 Society of Chemical Industry.</p>","author":"Zhiqiu Yao, \nWenna Zou, \nXinxin Zhang, \nPei Nie, \nHaimiao Lv, \nWei Wang, \nXuhong Zhao, \nYing Yang, \nLiguo Yang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"1a2e69d5d0d8a191d27784749d6c4b3416230b86acce4541127e87ba514a6d80","category":"Environment"}