{"title":"Apple ID Security Keys Feature Now Supports iCloud for Windows","link":"https://www.macrumors.com/2024/02/06/apple-id-security-keys-now-supports-windows/","date":1707247672000,"content":"If you have physical security keys set up for your Apple ID account, you can now sign in to iCloud on Windows, after updating the app to version 15 or later. Apple confirmed this change in a <a href=\"https://support.apple.com/en-us/HT213154\">support document</a> updated today.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/12/Apple-advanced-security-Security-Keys_screen-Feature-crop.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nPreviously, signing in to iCloud for Windows was not an option whatsoever after turning on the Apple ID security keys feature.\r<br />\n\r<br />\nApple ID security keys support was <a href=\"https://www.macrumors.com/2023/01/24/apple-explains-security-keys-feature/\">introduced early last year</a> with iOS 16.3, iPadOS 16.3, and macOS 13.2. When the optional setting is turned on, signing in to an Apple ID requires entering the account's password and then using a FIDO-certified security key to complete two-factor authentication, instead of a traditional six-digit verification code from another Apple device. These security keys typically look similar to a USB thumb drive.\r<br />\n\r<br />\nApple says the feature is \"designed for people who want extra protection from targeted attacks, such as phishing or social engineering scams.\" You should be extra careful if you turn on the feature, as you could be locked out of your Apple ID account permanently if you lose all of your trusted Apple devices and security keys.<div>Tags: <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a>, <a href=\"https://www.macrumors.com/guide/icloud-for-windows/\">iCloud for Windows</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/06/apple-id-security-keys-now-supports-windows/\">Apple ID Security Keys Feature Now Supports iCloud for Windows</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-id-security-keys-feature-now-supports-icloud-for-windows.2418681/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1a36f21d173ac39c0bf2b613c53a9102fa0afd58bb934834bb2e701a8e87ba39","category":"Apple"}