{"title":"Insights into the diet and feeding behavior of immature polar cod (Boreogadus saida) from the under‐ice habitat of the central Arctic Ocean","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15836?af=R","date":1719220463000,"content":"<h2>Abstract</h2>\n<p>Polar cod (<i>Boreogadus saida</i>) is an endemic key species of the Arctic Ocean ecosystem. The ecology of this forage fish is well studied in Arctic shelf habitats where a large part of its population lives. However, knowledge about its ecology in the central Arctic Ocean (CAO), including its use of the sea-ice habitat, is hitherto very limited. To increase this knowledge, samples were collected at the under-ice surface during several expeditions to the CAO between 2012 and 2020, including the Multidisciplinary drifting Observatory for the Study of Arctic Climate (MOSAiC) expedition. The diet of immature <i>B. saida</i> and the taxonomic composition of their potential prey were analysed, showing that both sympagic and pelagic species were important prey items. Stomach contents included expected prey such as copepods and amphipods. Surprisingly, more rarely observed prey such as appendicularians, chaetognaths, and euphausiids were also found to be important. Comparisons of the fish stomach contents with prey distribution data suggests opportunistic feeding. However, relative prey density and catchability are important factors that determine which type of prey is ingested. Prey that ensures limited energy expenditure on hunting and feeding is often found in the stomach contents even though it is not the dominant species present in the environment. To investigate the importance of prey quality and quantity for the growth of <i>B. saida</i> in this area, we measured energy content of dominant prey species and used a bioenergetic model to quantify the effect of variations in diet on growth rate potential. The modeling results suggest that diet variability was largely explained by stomach fullness and, to a lesser degree, the energetic content of the prey. Our results suggest that under climate change, immature <i>B. saida</i> may be at least equally sensitive to a loss in the number of efficiently hunted prey than to a reduction in the prey's energy content. Consequences for the growth and survival of <i>B. saida</i> will not depend on prey presence alone, but also on prey catchability, digestibility, and energy content.</p>","author":"Fokje L. Schaafsma, \nHauke Flores, \nCarmen L. David, \nGiulia Castellani, \nSerdar Sakinan, \nAndré Meijboom, \nBarbara Niehoff, \nAstrid Cornils, \nNicole Hildebrandt, \nKatrin Schmidt, \nPauline Snoeijs‐Leijonmalm, \nJulia Ehrlich, \nCarin J. Ashjian, \nthe MOSAiC team ECO","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"1a3a082b567e406a283caced999e82da311b14cba99a1729a33477993eaf5908","category":"Environment"}