{"title":"Changes to the Autophagy-Related Muscle Proteome Following Short-Term Treatment with Ectoine in the Duchenne Muscular Dystrophy Mouse Model MDX","link":"https://www.preprints.org/manuscript/202406.1470/v1","date":1718930876000,"content":"The severest form of muscular dystrophy (MD) termed Duchenne MD (DMD) remains to this day an incurable disease, hence the continued effort to further develop supportive therapies. Perturbation of autophagy, a degradative yet protective mechanism activated when tissues face severe and persistent stress, is critically involved in DMD, consequently, treatments harnessing autophagic capacities represent an amenable therapeutic strategy. We studied the effects of the protective osmolyte ectoine in the standard mouse model of DMD, the MDX, zooming in on the autophagy-related proteome. From birth, mice were treated with ectoine in the drinking water (150mg/kg) or through daily intraperitoneal injection (177mg/kg) until 5 weeks old. Hind limb muscles were dissected, performing western blotting for protein quantification and immunofluorescence to investigate tissue distribution. We report significant alterations of total levels of autophagy related 5 (ATG5), Ser366 phosphorylated sequestosome 1 (SQSTM1) and heat shock protein 70 (HSP70), and of activated microtubule-associated protein 1A/1B-light chain 3 (LC3 II) in mitochondrial fractions. Ectoine tends to restore the shifted balance between LC3 II and SQSTM1 levels observed in MDX muscle, and LC3 II upregulation was most pronounced on muscle fibers of MDX treated with ectoine in the drinking water. Findings from this explorative study support a possible beneficial effect of ectoine on the autophagic deficit in the MDX, which warrants its further exploration as a therapeutic supplement for DMD.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1a3fdbc11a8e4b5b19f5d4163b2fdb3df756a381361b31c32f9c8d5cc7a59c06","category":"Interdisciplinary"}