{"title":"[Sponsor] The Dirty Secret of OS Updates","link":"https://www.kolide.com/daringfireball","date":1690253671000,"content":"\n<p>Getting OS updates installed on end user devices should be easy. After all, it’s one of the simplest yet most impactful ways that every employee can practice good security. </p>\n\n<p>On top of that, every MDM solution promises that it will automate the process and install updates with no user interaction needed.</p>\n\n<p>Yet in the real world, <a href=\"https://l.kolide.co/43fMiNd\">it doesn’t play out like that</a>. Users <em>don’t</em> install updates and IT admins <em>won’t</em> force installs via forced restart.</p>\n\n<p>Let’s talk about the second problem first. Sure, you could simply schedule updates for all your users, and have them restart during non-work hours. But this inevitably leads to disruptions and lost work. This, in turn, leads to users (especially executives) who simply demand to be left out of your update policy. <em>The bottom line is: any forced restarts without user approval will lead to data loss events, and that makes them so unpopular that they are functionally unusable.</em></p>\n\n<p>There is another class of tools that claim to get users to install updates themselves, through “nudges.” These reminders pop up with increasing frequency until users relent or the timer runs out. This is an improvement, since it involves users in the process, but users still tend to delay updating as long as possible (which for some tools can be indefinitely).</p>\n\n<p>At Kolide, OS updates are the single most common issue customers want us to solve. They come to us because we have a unique (and uniquely effective) approach to device compliance.</p>\n\n<p>With Kolide, when a user’s device–be it Mac, Windows, Linux, or mobile–is out of compliance, <a href=\"https://daringfireball.net/martini/images/kolide-device-blocked.png\">we reach out to them with instructions on how to fix it</a>. </p>\n\n<p>The user chooses when to restart, but if they don’t fix the problem by a predetermined deadline, they’re unable to authenticate with Okta. (At present, Kolide is exclusive to Okta customers, but we plan to integrate with more SSO providers soon.)</p>\n\n<p>If your fleet is littered with devices that stubbornly refuse to update, then consider these two principles:</p>\n\n<ol>\n<li>You can’t have a successful patch management policy without involving users.</li>\n<li>You can’t get users to install patches unless you give them both clear instructions and real consequences.</li>\n</ol>\n\n<p>Installing OS updates is a top priority for both security and IT, and when you make it part of conditional access, you can finally get it done without massive lists of exemptions or massive piles of support tickets.</p>\n\n<p>To learn more about how Kolide enforces device compliance for companies with Okta, <a href=\"https://www.kolide.com/daringfireball\">click here to watch an on-demand demo</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/feeds/sponsors/2023/07/the_dirty_secret_of_os_updates\"> ★ </a>\n</div>\n\n\t","author":"Daring Fireball Department of Commerce","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"1a45c7cff27b9a0b73c4c82a57bd5ee96f31fcad53d42107b7efa4bfd4a6eba4","category":"Tech"}