{"title":"Gansulinema gen. nov. and Komarkovaeasiopsis gen. nov.: Novel Oculatellacean genera (Cyanobacteria) isolated from desert soils and hot spring","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13426?af=R","date":1704900664000,"content":"<h2>Abstract</h2>\n<p>To increase the understanding of simple thin filamentous cyanobacteria in harsh environmental areas, we previously isolated and identified four strains (XN101, XN102, GS121, NX122) from desert soils and hot spring in China. As a result, two new Oculatellacean genera of these four strains, <i>Gansulinema</i> gen. nov. and <i>Komarkovaeasiopsis</i> gen. nov., are described based on a polyphasic approach. The ultrastructure of these strains showed a similar arrangement of peripheral thylakoids with three to four parallel layers, indicating that they belonged to the orders Nodosilineales, Oculatellales, or Leptolyngbyales. In the 16S rRNA gene phylogeny, two sequences of the <i>Gansulinema</i> strains and the two sequences of the <i>Komarkovaeasiopsis</i> strains formed two independent and robust clusters, within the order Oculatellales. The 16S rRNA gene sequences of strains of <i>Komarkovaeasiopsis</i> and <i>Gansulinema</i> showed low identity to each other (≤93.2%) and to other sequences of the Oculatellacean genera (≤94.5% and ≤93.3%, respectively). Furthermore, the 16S–23S internal transcribed spacer rRNA region secondary structures of strains of <i>Komarkovaeasiopsis</i> and <i>Gansulinema</i> were not consistent with all existing descriptions of Oculatellacean taxa. These data suggest that cyanobacterial communities are rich sources of new taxa in under-exploited areas, such as desert soils and hot spring in China.</p>","author":"Fangfang Cai, \nShuheng Li, \nJiaxin Chen, \nRenhui Li","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"1a4e542414f25175fe7c75158b7e2fc3f82c19de1da90818c21e606e4c31bdf7","category":"Environment"}