{"title":"Efficacy of performance and mitigate pollution of CI engine: Delonix regia biodiesel with n‐butanol and exhaust gas recirculation","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14315?af=R","date":1715141849000,"content":"<h2>Abstract</h2>\n<p>The primary aim of this research study was to examine the effectiveness and environmental consequences of using Delonix regia biodiesel (DRB) in combination with butanol (BUT), exhaust gas recirculation (EGR), and diesel fuel (D) on a direct injection compression ignition engine operating at a constant speed. This study involved the formulation of five distinct biodiesel blends, namely DRB10% + D90%, DRB20% + D80%, DRB10% + BUT10% + D80%, DRB10% + BUT20% + D70%, and DRB20% + D80% + EGR10%. The inclusion of n-butanol in a biodiesel blend serves to tackle the problem of inadequate combustion in fuel blends by alleviating the oxygen deficiency that occurs during the combustion process. The findings of the study revealed that the combination of DRB at 10%, BUT at 20%, and D at 70% produced in a significant reduction in specific fuel consumption (SFC) by 11.19% and brake thermal efficiency by 2.62%. Additionally, this combination led to a decrease in exhaust emissions of CO and Smoke, with the exception of HC and NOx, when compared to the use of diesel fuel. The control of HC and NOx emissions can be achieved through the implementation of an exhaust gas recirculation system. The results of this investigation suggest that Delonix regia biodiesel, in combination with a 20% concentration of n-butanol, has potential as a viable alternative fuel choice that may be utilized without necessitating any engine modifications.</p>","author":"K. Thiruselvam, \nS. Ganesan, \nS. Senthil","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"1a50fca0f6433a167f2085524acd49af33889cee8943bccf56103fa16be235f9","category":"Environment"}