{"title":"Egan Bernal: the Vuelta's antagonist","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/egan-bernal-the-highlight-of-this-year-s-vuelta-a-espana","date":1630682634000,"content":"\n      <p><b></b><span>Egan Bernal trails race leader Primož Roglič by nearly five minutes in the General Classification of this year’s Vuelta España. He sits fourth overall, and he’s yet to finish on the podium in any stages so far. For a rider who has won the Tour de France, the Giro d’Italia and Paris–Nice, these results are sub-par, and below the expectations of Ineos Grenadiers, the richest team in the cycling world. At a quick glance through ProCyclingStats, Bernal’s Vuelta looks pretty disappointing. </span></p>\n<div></div>\n<p><span>Watching each stage live told a very different story, though. The TV pictures show how the Colombian has animated the race, igniting drama and putting himself in the thick of it. The way he’s ridden has been aggressive and passionate. He’s been the entertainer, keeping those of us watching at home glued to our TV screens. The GC fight was timid until Bernal lit things up with his all or nothing attack with 60km to go on Wednesday. It was an example of pure, raw racing. No marginal gains or calculations, just instinct and fighting spirit.</span></p>\n\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-preview\"><b><i>Vuelta 2021 Guide</i></b></a></p>\n<p><span>It would have been easy for Bernal to resign himself to losing the Vuelta this year. Earlier in the race, he was unable to cope with the pace set on the Alto de Velefique on stage 9 and he lost more time to Roglič on the Rincón de la Victoria and Valdepeñas de Jaén in week two. It was clear that the once-in-a-generation climber wasn’t on his usual form, he didn’t look like the same athlete who stormed to pink in the Giro at the start of the season. It’s worth mentioning he has suffered from Covid-19 since finishing the race in Italy, undoubtedly a factor in his lesser results since then. Coming into the two tough Asturian stages this week, Bernal was nearly 3 minutes behind the pre-race Slovenian favourite. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1337651633_1024x1024.jpg?v=1630678113\" /></span></p>\n<p><span>Aware he wasn’t at his best and with the palmares he already has to his name, it wouldn’t have surprised me to see Bernal take on a domestique role or even abandon the race and refocus on future goals. But, unlike me, Bernal is a Tour de France champion. And you don’t become that with a defeatist attitude. Instead, you pick yourself up and go again. You rewrite the plan and do your very best to execute it. The Columbian did just that when he launched his electrifying attack on the stage to Lagos de Covadonga.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/roglic-a-half-made-cyclist\">Related: Roglič, a champion who is always learning</a></em></strong></p>\n<p><span>Ultimately, his brave move was fruitless. After riding on the front relentlessly and dragging Primož Roglič up and down the wet Asturian roads, Bernal blew up at the final hurdle. Hours of work came to nothing as he watched the back wheel of Roglič disappear up the last climb, not to be seen again. The group of chasers behind swamped Bernal’s slight frame, his white jersey lost in a flurry of other GC contenders. He finished the stage in 7th place. It was hard to not feel pangs of sympathy watching from home. He’d provided arguably one of the most exciting GC battles of the race so far, but for what reward?</span></p>\n<p><span>We might have expected him to cross the line morosely, sullen and disappointed. But Bernal reached his soigneur with a smile on his face, because the result didn’t really matter. He didn’t finish second or third, but he’d raced for first place and he’d done all he could. He’d shown the strength that has won him two Grand Tours in his career so far.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1337883112_1024x1024.jpg?v=1630677919\" /></span></p>\n<p><span>In the next stage, he continued to attack, attempting to distance his rivals on the brutal Alto del Gamoniteiru. Bernal was not content with just waiting and racing for the podium, despite the disappointment of the day before. “I didn't want to go home with that doubt in my mind about what could have happened if I didn't try. Now I can go home happy knowing I gave it everything,” he said afterwards. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/alto-del-gamoniteiro-the-angliru-s-evil-sister\">Related: Alto del Gamoniteiru – The Angliru's Evil Sister</a></em></strong></p>\n<p><span>So Bernal isn’t going to win the Vuelta. He’s not going to get the result he or his team might have expected or hoped for. But cycling isn’t just about winning. The sport is a spectacle, it’s entertainment, and without fans, there would be little left of it. And Bernal has won the hearts of the fans this week. He’s affirmed that he is one of the most exciting riders in the peloton, showing tenacity and spirit. </span></p>\n<p><span>Above all, he hasn’t given up, and like the true racer he is, he’ll fight for every single kilometre on the road to the final ITT in Santiago de Compostela.</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1a5767db81f6d237691bb42a0344d703a82be0d1c07d20d9618fde0d5d1304de","category":"Cycling"}