{"title":"PSVI-6 Metabolic potential of three novel rumen bacterial species from sheep characterized by utilizing a metagenomic-based approach","link":"https://academic.oup.com/jas/article/102/Supplement_2/343/7664777?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The sheep rumen microbiome contains a vast wealth of known and unknown members, whose metabolic processes impact nutrient acquisition as well as gut and overall health of the animal. Based on previous research from our group on investigating the impact of a change in diet on the composition of the rumen microbiome in lambs, further insights into the metabolic functions of novel bacterial species represented by three Operational Taxonomic Units (OTUs) were pursued. The rumen fluid samples with the greatest abundance of OTUs RA1-01223, RA1-00032, and RA1-04216 were, respectively, used as representatives for metagenomic investigations to assemble the genomes of their corresponding bacterial species. Purified microbial genomic DNA was used as a template for ‘shotgun’ sequencing with an Illumina Miseq (2 x 250) platform. Raw datasets were filtered for quality then used for contig assembly with an in-house developed set of Perl scripts, generating 64 contigs for RA1-01223 [combined total length: 2,046,349 base pairs (bp)], 118 contigs for RA1-00032 (combined total length: 3,704,255 bp), and 119 contigs for RA1-04216 (combined total length: 8,884,743 bp). After building, coding sequences were identified and annotated using RAST, with metabolic pathways of predicted enzymes constructed for each OTU of interest using KEGG pathways as a model reference. Annotated coding sequences were also screened by blastp to assign contig sets to each OTU based on their respective taxonomic affiliation; both OTU RA1-01223 and OTU RA1-00032 were found to be most closely related to <span>Ruminococcus bili</span> (94.8% and 86.8%, respectively), while RA1-04216 was affiliated to <span>Succinivibrio dextrinsolvens</span> (96.9%). As RA1-01223 and RA1-00032 were found to possess enzymes responsible for lactate metabolism, they could potentially affect susceptibility to acidosis by acting as modulators of ruminal pH or by producing lactate from starch degradation. Distinguishing features between these two OTUS included the pathway for vitamin B5 synthesis, using uracil or L-aspartate as precursors (RA1-01223), and the ability to produce ethanol as an end product of ruminal fermentation (RA1-00032). Distinguishing metabolic activities of interest for RA1-04216 included synthesis of chorismate and prephenate, which are precursors for tryptophan and phenylalanine, respectively. Together, these results contribute to a better understanding of the metabolic roles of individual microorganisms in the rumen, providing information that is crucial for creating a healthy and proactive environment that benefits the host.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1a5e835f02b43617b180def23e39deea0d59c22fcf809ba7f8828ca79e88de72","category":"Environment"}