{"title":"Psychophysiological responses to a multimodal physiotherapy program in fighter pilots with flight-related neck pain: A pilot trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306708","date":1720188000000,"content":"<p>by Carlos Fernández-Morales, Luis Espejo-Antúnez, María de los Ángeles Cardero-Durán, Deborah Falla, Juan Manuel Moreno-Vázquez, Manuel Albornoz-Cabello</p>\r\nBackground <p>The physical and cognitive demands of combat flying may influence the development and persistence of flight-related neck pain (FRNP). The aim of this pilot study was to analyse the effect of a multimodal physiotherapy program which combined supervised exercise with laser-guided feedback and interferential current therapy on psychophysiological variables in fighter pilots with FRNP.</p> Methods <p>Thirty-one fighter pilots were randomly assigned to two groups (Intervention Group: n = 14; Control Group: n = 17). The intervention consisted of 8 treatment sessions (twice per week) delivered over 4 weeks. The following primary outcomes were assessed: perceived pain intensity (Numeric Pain Rating Scale–NPRS) and Heart Rate Variability (HRV; time-domain, frequency-domain and non-linear variables). A number of secondary outcomes were also assessed: myoelectric activity of the upper trapezius and sternocleidomastoid, pain catastrophizing (Pain Catastrophizing Scale–PCS) and kinesiophobia (TSK-11).</p> Results <p>Statistically significant differences (p≤0.05) within and between groups were observed for all outcomes except for frequency domain and non-linear HRV variables. A significant time*group effect (one-way ANOVA) in favour of the intervention group was found for all variables (p&lt;0.001). Effect sizes were large (d≥0.6).</p> Conclusions <p>The use of a multimodal physiotherapy program consisting of supervised exercise with laser-guided feedback and interferential current appears to show clinical benefit in fighter pilots with FRNP.</p> Trial registration <p>ClinicalTrials.gov: NCT05541848.</p>","author":"Carlos Fernández-Morales","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1a631e874dfa9dc8a7b400b43884130b51df0daab809f716f771d10d250c2922","category":"Interdisciplinary"}