{"title":"Looking at the bid picture: A framework for identifying reverse auctions in ecological systems","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14085?af=R","date":1719984809000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b260abd1-3145-40e4-ac74-1625da62c638/jane14085-toc-0001-m.png\" alt=\"Looking at the bid picture: A framework for identifying reverse auctions in ecological systems\" />\n<p>This manuscript will be the first to propose including auction systems into biological market theory. By submitted as a Concepts paper, our goal is to general conversation about this topic and encourage future work.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nBiological market theory can be used to explain intraspecific cooperation, interspecific mutualism, and sexual selection through models of game theory. These models describe the interactions between organisms as two classes of traders (buyers/sellers) exchanging commodities in the form of goods (e.g. food, shelter, matings) and services (e.g. warning calls, protection). Here, we expand biological market theory to include auction theory where bidding serves to match buyers and sellers.\n\nIn a reverse auction, the seller increases the value of the item or decreases the cost until a buyer steps forward. We provide several examples of ecological systems that may have reverse auctions as underlying mechanisms to form mutualistic relationships.\n\nWe focus on the yellow baboon (<i>Papio cynocephalus</i>) mating system as a case study to propose how the mechanisms of a reverse auction, which have the unintended but emergent consequence of producing a mutually beneficial outcome that improves collective reproductive benefits of the troop in this multi-female multi-male polygynandrous social system. For the yellow baboon, we posit that the “seller” is the reproductively cycling female, and the “buyer” is a male looking to mate with a cycling female. To the male, the “item for the sale” is the opportunity to sire an offspring, the price is providing safety and foraging time (via consortship) to the female. The “increasing value of the item for sale” is the chance of conception, which increases with each cycle since a female has resumed cycling post-partum. The female's sexual swelling is an honest indicator of that cycle's probability of conception, and since resident males can track a female's cycle since resumption, there is transparency. The males presumably know the chance of conception when choosing to bid by offering consortship.\n\nAcross nature, this reverse auction game likely exists in other inter- and intraspecific social relationships. Considering an ecological system as a reverse auction broadens our view of social evolution and adaptations through the lens of human economic structures.\n</p>","author":"Katherine J. Fowler, \nEmily J. Potratz, \nMargaret Malone, \nAbdel Halloway, \nJoy Peplinski, \nJoel S. Brown","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"1a663e9f6db2da8edcdf9b77fa9dbc167bb1cb0dff642dd918732238e8e0a403","category":"Environment"}