{"title":"Apple to Ban Apps That Reward Users For Enabling ATT Tracking","link":"https://www.macrumors.com/2021/04/27/apple-ban-apps-offer-rewards-for-att/","date":1619521499000,"content":"Apple says that it will ban and reject apps on the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> that attempt to offer users monetary incentives to enable tracking with ATT, one of many measures the company is taking to ensure developers follow through with the new framework.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/generic-tracking-prompt-green.jpg\" />\r\n<br />\r\nYesterday the Cupertino tech giant <a href=\"https://www.macrumors.com/2021/04/26/apple-releases-ios-14-5/\">released iOS and iPadOS 14.5</a> with several headlining features, including ATT or App Tracking Transparency. ATT is a new framework on iOS and iPadOS devices that requires apps to ask for users' permission before tracking them across others apps and websites. \r\n<br />\r\n\r\n<br />\r\nIt's received <a href=\"https://www.macrumors.com/2020/12/16/facebook-takes-out-full-page-ads-to-attack-apple/\">significant criticism</a> from companies such as Facebook, which deems it a threat to its business. With the new framework, all apps on the ‌App Store‌ must present users with a pop-up that asks whether they wish to be tracked or not. Users are shown \"Ask App Not to Track\" and \"Allow\" in the pop-up.\r\n<br />\r\n\r\n<br />\r\nFollowing ATT's release, the company also majorly updated its <a href=\"https://developer.apple.com/design/human-interface-guidelines/\">Human Interface Guidelines</a> with a new section titled \"<a href=\"https://developer.apple.com/design/human-interface-guidelines/ios/app-architecture/accessing-user-data/\">Accessing User Data</a>.\" In this section, offering a mix of new and previously known information, Apple outlines the design policies that all apps must follow when they attempt to ask a user for their permission to access personal data, device capabilities such as microphone and camera, and consent to track them across apps and websites.\r\n<br />\r\n\r\n<br />\r\nApple's senior vice president of software engineering, Craig Federighi, <a href=\"https://www.macrumors.com/2021/04/26/craig-federighi-talks-app-tracking-transparency/\">recently said</a> that Apple can only enforce its privacy values through the policies to which apps on the ‌App Store‌ are subject to and that it entirely can't be done at a system level. The executive, sitting below CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a>, referred to ATT, echoing that Apple will enforce the new change as vigorously as it can through the ‌App Store‌'s rules.\r\n<br />\r\n\r\n<br />\r\nThe new additions to the Human Interface Guidelines are reflective of Federighi's comments. Apple can expect to see some apps try and circumvent ATT with gimmicks such as imitation or limiting an app's functionality unless permission to track is given. To counter this, Apple's new guidelines bar apps from attempting to mislead users to enable \"Allow\" for ad-tracking by imitation or using a graphic that mimics the system pop-up.\r\n<br />\r\n\r\n<br />\r\nMost notably, however, Apple says that any app that attempts to offer monetary incentives to users to convince them to enable tracking will be banned from the ‌App Store‌. \r\n<br />\r\n<blockquote> Don't offer incentives for granting the request. You can't offer people compensation for granting their permission, and you can't withhold functionality or content or make your app unusable until people allow you to track them.\r\n<br />\r\n\r\n<br />\r\nDon't display a custom message that mirrors the functionality of the system alert. In particular, don't create a button title that uses \"Allow\" or similar terms, because people don't allow anything in a pre-alert screen.\r\n<br />\r\n\r\n<br />\r\nDon't show an image of the standard alert and modify it in any way.\r\n<br />\r\n\r\n<br />\r\nDon't draw a visual cue that draws people's attention to the system alert's Allow button.</blockquote>Apple also outlines the do's and don'ts on how apps can provide additional information for why users should enable ad-tracking. The native ATT pop-up offers developers the choice to customize the text to explain why tracking is needed.\r\n<br />\r\n\r\n<br />\r\nApps can also employ a splash screen before the pop-up appears that provides information about what the tracking is used for. These splash screens, however, most use wording like \"Continue,\" \"Next,\" and not \"Allow,\" which may mislead and confuse users, according to Apple.\r\n<br />\r\n<blockquote>If you display a custom screen that precedes a privacy-related permission request, it must offer only one action, which must display the system alert. Use a word like \"Continue\" to title the action; don't use \"Allow\" or other terms that might make people think they're granting their permission or performing other actions within your custom screen.</blockquote>The <a href=\"https://developer.apple.com/design/human-interface-guidelines/ios/app-architecture/accessing-user-data/\">new section </a>will be helpful for developers looking to make sure they're up to date with Apple's latest guidelines and can be an exciting read for users looking to learn more about ATT, and the privacy aspects of ‌App Store‌ apps. <div>Tags: <a href=\"https://www.macrumors.com/guide/app-tracking-transparency/\">App Tracking Transparency</a>, <a href=\"https://www.macrumors.com/guide/ios-14-5-features/\">iOS 14.5 Features</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/27/apple-ban-apps-offer-rewards-for-att/\">Apple to Ban Apps That Reward Users For Enabling ATT Tracking</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-to-ban-apps-that-reward-users-for-enabling-att-tracking.2293477/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=hJ6LoAWq4rc:2Y6GZShNmos:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=hJ6LoAWq4rc:2Y6GZShNmos:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/hJ6LoAWq4rc\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1a6cc810d7811c54f9f38c0012d13eaf1a1c3c74ff4059dd396194f2f3bfcffd","category":"Apple"}