{"title":"Apple AR/VR headset: Dual 8K displays, VR FaceTime, and an eye-watering price","link":"https://www.macworld.com/article/557878/apple-headset-ar-vr-design-features-specs-price.html","date":null,"content":"<div>\n<section><div></div></section><p>It’s looking more and more like Apple’s next big thing won’t be something that fits in your pocket or a bag. Rather it could be another wearable device. Analysts Ming Chi-Kuo said in November that Apple’s “goal is to replace the ‌iPhone‌ with AR in 10 years.” Here’s everything we know so far about Apple’s rumored mixed-reality headset.</p>\n\n\n\n<h2>2022 Apple headset: Latest rumors</h2>\n\n\n\n<p><strong>December 15:</strong> <a href=\"https://www.macworld.com/article/559525/display-rumors-imac-ar-headset-folding-iphone.html\">Ross Young of Display Supply Chain Consultants</a> says <strong>volume estimates for the headset’s displays “look low”</strong> which could indicate a high price tag.</p>\n\n\n\n<p><strong>December 9:</strong> Another Ming-Chi Kuo report (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/12/08/kuo-apples-mixed-reality-headset-to-have-advanced-hand-gesture-detection/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">via 9to5Mac</a>) describes <strong>gesture-based navigation</strong>.</p>\n\n\n\n<p><strong>December 8:</strong> Ming-Chi Kuo reports (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/12/08/kuo-apple-ar-vr-headset/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">via 9to5Mac</a>) that <strong>a second-generation headset</strong> is already in the works.</p>\n\n\n\n<h2>2022 Apple headset: Design</h2>\n\n\n\n<p>While the ultimate goal of Apple’s AR project is to produce <a href=\"https://www.macworld.com/article/234203/apples-ar-glasses-come-into-focus-with-rumored-specs-price-and-launch-date.html\">a pair of fashionable smart glasses</a>, the first version will reportedly be much bigger than that, weighing between 300-400 grams, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/12/08/kuo-apple-ar-vr-headset/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">according to Ming-</a><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/12/08/kuo-apple-ar-vr-headset/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">Chi</a><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/12/08/kuo-apple-ar-vr-headset/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\"> Kuo</a>. According to reports, the first-generation Apple headset will be an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theinformation.com/articles/new-apple-mixed-reality-headset-details-swappable-headbands-eye-tracking&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">Oculus-style headset</a> with a knit mesh-wrapped body similar to the AirPods Max. It could look something like a sleeker version of Google’s Daydream headset, which also had a soft fabric body. A <a href=\"https://www.macworld.com/article/334281/what-apple-patents-say-about-the-companys-vr-and-ar-ambitions.html\">patent application</a> for a “head-mounted display unit” also detailed several areas of adjustment, meaning comfort will be an area of focus.</p>\n\n\n\n<p>However, we don’t know much else about the design of Apple’s AR device. While Jon Prosser reported that Apple is working on a prototype pair of AR glasses, more recent rumors suggest that a bona fide pair of glasses is likely still years away from production.</p>\n\n\n\n<p>Curiously, Ming-Chi Kuo says Apple is already <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/12/08/kuo-apple-ar-vr-headset/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">working on a second-generation model</a> (via 9to5Mac) expected to launch in 2024 with a “significantly lighter” and “updated industrial” design.</p>\n\n\n\n<h2>2022 Apple headset: Display</h2>\n\n\n\n<p>As a mixed-reality device, Apple’s glasses are rumored to handle both virtual and augmented reality via a pair of high-resolution 8K screens using eye-tracking technology. The headset will reportedly feature more than a dozen cameras, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theinformation.com/articles/new-apple-mixed-reality-headset-details-swappable-headbands-eye-tracking&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">according to The Information</a>, which will project a real-world view onto the screens as if you were looking through clear glass. It will presumably use either OLED or mini LED and incorporate Apple’s Ceramic Shield coating as well.</p>\n\n\n\n<h2>2022 Apple headset: Processor and specs</h2>\n\n\n\n<p>According to Kuo (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/11/25/kuo-apple-ar-headset-mac-level-computing/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">via Macrumors</a>), Apple’s AR headset will have two processors, with the higher-end processor having “similar computing power as the M1 for Mac” and the secondary chip responsible for “sensor-related computing.” The sounds like a lot of processing power for a headset, but if the headset needs to power a pair of 8K displays, it will need a hefty chip. Reports also say that it will need to be tethered to an iPhone, much like the original Apple Watch.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/11/25/kuo-apple-ar-headset-mac-level-computing/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">Kuo also reported</a> that the headset will support Wi-Fi 6E, which is also rumored to come to the iPhone 14. It will also presumably have at least 8GB of RAM and a 256GB hard drive. We don’t know anything yet about the battery life, but Kuo says improving battery life will be a focus of the s<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/12/08/kuo-apple-ar-vr-headset/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">econd-generation model</a>.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/apple-ar-glasses-patent-illo.jpg?quality=50&amp;strip=all\" /></figure><p>Apple</p></div>\n\n\n\n<h2>2022 Apple headset: Apps and functionality</h2>\n\n\n\n<p>We don’t know yet what the user interface for Apple’s headset will look like, but it appears to be akin to a heads-up AR display that recognizes people and objects while also handling VR applications. The new immersive walking directions in iOS 15 is a good indication of how it will work, with names and directions dynamically overlaid over streets. In addition to maps, we expect apps for fitness, music, messages, and calls to be central to the experience.</p>\n\n\n\n<p>As a mixed-reality device, it will also be able to handle VR applications, which opens the headset up to a variety of apps. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2021-12-05/apple-verizon-t-mobile-at-t-iphone-13-apple-watch-ipad-rebates-not-working-kwtm0hum&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">Bloomberg’s Mark Gurman</a> also said that gaming could have “a strong focus” on the platform as well as “media consumption.” He expects Apple will work closely with developers and media partners to create content that can be watched in VR on the device. Apple will likely lean into VR content with its own TV+ service as well.</p>\n\n\n\n<p>Apple will also surely have apps dedicated to AR-type things, such as the Measure app and things like the tool that lets you see a 3D render of Apple products before you buy it. In a December report, Gurman additionally said the iPhone’s Animojis and VR FaceTime could be positioned as “the new-age Zoom.”</p>\n\n\n\n<p>A report by Ming-Chi Kuo in December outlined navigation for the device using hand gestures. In a technical note obtained by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/12/08/kuo-apples-mixed-reality-headset-to-have-advanced-hand-gesture-detection/&amp;xcust=1-1-557878-1-0-0&amp;sref=https://www.macworld.com/feed\">9to5Mac</a>, he predicts that “the structured light of the AR/MR headset can detect not only the position change of the user or other people’s hand and object in front of the user’s eyes but also the dynamic detail change of the hand (just like the iPhone’s Face ID/structured light/Animoji can detect user’s dynamic expression change).” It’s likely that Siri will also play a prominent role in how users communicate with the headset.</p>\n\n\n\n<h2>2022 Apple headset: Price and release</h2>\n\n\n\n<p>Apple has reportedly been working on its VR headset for several years, but both Gurman and Kuo agree that Apple is targeting late 2022 as a release date. As a mobile accessory, it’s likely that it makes an appearance at the September iPhone event.</p>\n\n\n\n<p>As far as pricing, rumors suggest that the first iteration could be an extremely expensive device, possibly costing several thousand dollars. In December, a Display Supply Chain Consultants report noted that volume estimates for the AR headset’s displays “look low for next year,” which likely indicates a high price tag (and low sales). With a price tag that’s out of reach for most people, the AR headset would mainly be a proof of concept device for diehards and developers, but no less exciting to the future of Apple wearables.</p>\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1a70527002e256239e2105fc254562d93290a4632c0c9d52311841542c3a2b22","category":"Apple"}