{"title":"Apple's Upcoming AR/VR Headset to Require Connection to iPhone","link":"https://www.macrumors.com/2021/09/02/ar-vr-headset-iphone-connection-required/","date":1630602497000,"content":"The first AR/VR headset that Apple has in development will need to be wirelessly tethered to an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or another Apple device to unlock full functionality, reports <em><a href=\"https://www.theinformation.com/articles/apples-ar-vr-headset-will-need-connection-to-other-device-such-as-iphone\">The Information</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-mixed-reality-headset-mockup-feature-orange.jpg\" />\r\n<br />\r\nIt will be similar to the WiFi-only version of the Apple Watch, which requires an ‌iPhone‌ connection to work. The headset is meant to wirelessly communicate with another Apple device, which will handle most of the powerful computing.\r\n<br />\r\n\r\n<br />\r\nAccording to <em>The Information</em>, Apple recently completed work on the 5-nanometer custom chips that are set to be used in the headset, and that's where the connectivity detail comes from.\r\n<br />\r\n\r\n<br />\r\nApple has completed the key system on a chip (SoC) that will power the headset, along with two additional chips. All three chips have hit the tape-out stage, so work on the physical design has wrapped up and it's now time for trial production.\r\n<br />\r\n\r\n<br />\r\nThe chips are not as powerful as the chips used in Apple's Macs and iOS devices, without a neural engine for AI and machine learning capabilities. The chip is designed to optimize for wireless data transmission, compressing and decompressing video, and power efficiency for maximum battery life.\r\n<br />\r\n\r\n<br />\r\nThough designed to work with an iOS device, the headset has a CPU and GPU, so there's a chance that it could have a standalone mode with limited functionality.\r\n<br />\r\n\r\n<br />\r\nTSMC is manufacturing the chips that will be used in the headset, and mass production is said to be at least a year away. The first AR/VR headset could be released as soon as 2022, but the launch could also be pushed back if work on the device is not completed in time.\r\n<br />\r\n\r\n<br />\r\n<em>The Information</em> has also heard that work has been completed on the image sensor and display driver for the headset, and TSMC is still working out issues with the image sensor given its large size. TSMC is working to increase the yield that it is getting during trial production.\r\n<br />\r\n\r\n<br />\r\nThis AR/VR headset that's in development is separate from a set of augmented reality smart glasses that are in the works. The sleeker, smaller smart glasses will follow the headset and are expected to launch in 2023.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-glasses/\">Apple Glasses</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/02/ar-vr-headset-iphone-connection-required/\">Apple's Upcoming AR/VR Headset to Require Connection to iPhone</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-upcoming-ar-vr-headset-to-require-connection-to-iphone.2309540/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=iGi_SMgFnWs:vMp6SJJDfsY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=iGi_SMgFnWs:vMp6SJJDfsY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/iGi_SMgFnWs\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1a7112d75dbd1c4c41929151811d7624c23bd3fbb019b59f168ee1a4ee3c6556","category":"Apple"}