{"title":"Deconvolution-Based System Identification and Finite Element Model Calibration of the UCLA Factor Building","link":"https://www.preprints.org/manuscript/202407.0968/v1","date":1720693657000,"content":"Wave propagation in buildings analyzed from its response to earthquakes can be applied for tracking the dynamic characteristics changes based on impulse response functions. The velocity of traveling shear-waves and intrinsic attenuation in buildings can be retrieved for buildings. It is an approach of importance for system identification. The Factor Building at the University of California, Los Angeles campus (henceforth referred as the UCLA Factor Building), an instrumented 15-story steel-moment frame structure, are selected for dynamic response characteristics identification. They are inferred from wave propagation using seismic interferometry for recorded motions. The deconvolved waves are used to compute shear wave travel time and wave attenuation. The natural logarithm for the envelopes of the waveforms deconvolved with the signal at the basement constrains the attenuation. The waveforms from deconvolution with the motion at the basement suggest the fundamental mode of the building. The frequency and decay with time constrain the shear velocity and attenuation as well.  The velocity are measured using arrival times picked from these deconvolved waves and the average velocity is 147.1 m/s. The quality factor is equal to 10.8 with the damping ratio at 5%. The shear wave velocity and damping ratio estimated from the deconvolved waves have a good match with these inferred from the waveforms deconvolved with the basement recording. This consistency suggests that wave deconvolution can be applied to extract the building response from the excitation and ground coupling. Based on the resonant frequencies and damping ratio, the finite element model of the building is updated. This study implies that wave deconvolution is powerful to extract the building dynamic characteristics. It helps to better the understanding of the dynamic response of buildings to earthquakes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1a78e9df66dd2165ea1f15a663da4f7e42c1b97c5064b521f9fce55907121755","category":"Interdisciplinary"}