{"title":"Apple’s News Partner Program offers reduced commission rate for publishers","link":"https://www.macworld.com/article/354159/apples-news-partner-program-offers-reduced-commission-rate-for-publishers.html","date":1629996836000,"content":"<div>\n<section><div></div></section><p>Apple on Thursday announced the News Partner Program, an initiative for subscription news services that post to Apple News. Participants “may qualify” for a 15 percent commission rate on in-app subscriptions from day one. That’s a change from the usual rate of 30 percent for the first year and then 15 percent thereafter. In the Program, publishers who post content with advertising get to keep 100 percent of any ad revenue.</p>\n\n\n\n<p>To sign up for the News Partner Program, a publisher must have a “robust” Apple News channel with “original, professionally authored” news content in Australia, Canada, the United States, and the United Kingdom. Apps by the publishers must let users buy auto-renewable subscriptions through Apple’s in-app purchase system.</p>\n\n\n\n<p>“Providing Apple News customers with access to trusted information from our publishing partners has been our priority from day one,” said Apple SVP Eddy Cue in a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/08/apple-introduces-the-news-partner-program/&amp;xcust=1-1-354159-1-0-0&amp;sref=https://www.macworld.com/feed\">press release</a>. “For more than a decade, Apple has offered our customers many ways to access and enjoy news content across our products and services. We have hundreds of news apps from dozens of countries around the world available in the App Store, and created Apple News Format to offer publishers a tool to showcase their content and provide a great experience for millions of Apple News users.”</p>\n\n\n\n<p>Apple said that the News Partner Program will work with global organizations to promote media literacy. The company also announced its continued support for Common Sense Media, the News Literacy Project, and Osservatorio Permanente Giovani-Editori. </p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1a7bd16bb28b0fd29280e62a645e891b28ef9e2c33a9df349e1420cb35af79b7","category":"Apple"}