{"title":"Contiguous United States hydrologic modeling using the Hillslope Link Model TETIS","link":"https://onlinelibrary.wiley.com/doi/10.1111/1752-1688.13227?af=R","date":1723436986000,"content":"<h2>Abstract</h2>\n<p>Large-scale hydrologic modeling is important for understanding changes in water resources and flood hazard across a broad range of climatic and hydrologic conditions. Parsimonious models, although simple, allow for an efficient way to model river systems across multiple decades to even centuries. Therefore, this study aims to assess the ability of the distributed Hillslope Link Model (HLM) TETIS to simulate streamflow observations across the contiguous United States (CONUS) from 1981 to 2020. To obtain model parameters across this domain, we partition the study area into 234 HydroSHEDS level 5 basins and calibrate the model to a single representative location near the outlet of each basin using dynamical dimension search for 100 realizations. Performance is then assessed at 5046 US Geological Survey streamgages with respect to the Kling Gupta Efficiency (KGE) and bias. Our simulations result in a median KGE of 0.43, with 89% of the sites having a value above the reference of 1 − √2 (~ -0.41). Furthermore, there is a dependence of the model performance on climate regions, with the model performing better in basins in cold and temperate regions than in arid ones. While the parameters are estimated based on daily precipitation inputs, it is shown that the model performs well even when forced with hourly precipitation, highlighting the robustness of the selected parameters to different inputs. Finally, the soil related parameters show dependence on soil properties, providing a basis for future model improvement. Overall, this study highlights the model's flexibility in performing across a vast domain with different runoff generation mechanisms.</p>","author":"Alexander T. Michalek, \nFelipe Quintero, \nGabriele Villarini","siteTitle":"Wiley: JAWRA Journal of the American Water Resources Association: Table of Contents","siteHash":"b7070794a350c180e68e2251d6fc4f4ad5be669c5d24d82d3d55b25b0dce7a23","entryHash":"1a83272dfb8600bb71092e1e6ee79bb6c81366807c79e07f645af29628e6def0","category":"Environment"}