{"title":"An iPhone 12 software update is coming to address radiation concerns","link":"https://www.macworld.com/article/2071081/iphone-12-software-update-radiation-concerns.html","date":1694790965000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>For a three-year-old phone that Apple stopped selling this week, the iPhone 12 sure is making a lot of headlines. On Tuesday, French regulators ordered Apple to <a href=\"https://www.macworld.com/article/2067698/france-stop-selling-iphone-12-radio-frequency-radiation.html\">stop selling the iPhone 12</a> citing concerns over high levels of radio frequency radiation. Now Apple says it will issue a software update to resolve the issue.</p>\n\n\n\n<p>Earlier this week, Agence Nationale des Fréquences (ANFR) told Apple to stop selling the iPhone 12 after it found that the phone’s Specific Absorption Rate (SAR) was higher than the allowable limit. It threatened to order a full recall of the phone if Apple failed to comply with the order.</p>\n\n\n\n<p>Coincidentally, Apple stopped selling the iPhone 12 on Tuesday following the launch of the iPhone 15. However, there are still iPhone 12 models for sale throughout the country and online, including refurbished models.</p>\n\n\n\n<p>In a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reuters.com/technology/apple-implement-iphone-12-update-next-few-days-france-minister-2023-09-15/&amp;xcust=1-1-2071081-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">statement to Reuters</a>, Apple said, “We will issue a software update for users in France to accommodate the protocol used by French regulators. We look forward to iPhone 12 continuing to be available in France.” Apple has stated that the iPhone 12 SAR levels aren’t a safety issue and is related to the “specific testing protocol.”</p>\n\n\n\n<p>It’s not clear whether the update will arrive for iOS 16 or iOS 17, which is arriving on phones Monday. France has already banned more than 40 phones due to SAR levels but this is the first time an Apple device has been flagged.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1a8492823eb9ff6f5953503ad09318285dc34d699dbff17de52d0de6617a3223","category":"Apple"}