{"title":"Evaluation of the HEAL<sup>™</sup>ing Mental Health program: A prospective cohort study of short-term changes from a physical activity and lifestyle education program for people with mental health disorders living in rural Australia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299859","date":1710338400000,"content":"<p>by Annette J. Raynor, Sophia Nimphius, Daniel Kadlec, Sally Casson, Caitlin Fox-Harding, Lauren V. Fortington</p>\r\n\r\nThis study aimed to evaluate short-term outcomes of the HEAL<sup>™</sup>ing Mental Health program, an 8-week intervention for change in functional, behavioural and physiological health and wellbeing designed for people living with mental health conditions in rural or regional areas of Australia. A prospective cohort study was completed, reporting on 19 items (pre-program) and 15 (post-participation change), organised across seven domains. Participants took part in an Accredited Exercise Physiologist/Nurse led supervised group exercise (60 minutes) and healthy lifestyle education program (60 minutes). Separate linear mixed models with restricted maximum likelihood were used to examine the primary research question considering the effect of the program on: walking (min/week); planned, incidental and total physical activity (min/week); sitting time; active days; fruit and vegetable intake; body mass index; waist circumference; blood pressure; 6 minute walk distance; 30 second sit-to-stand; psychological distress symptoms; and stage of behaviour change. There were 99 participants (31 males, 68 females) out of 117 participants completed more than 50% of program sessions. Twelve of 15 measures achieved their desired target change and a statistically significant change toward the desired outcome was reported for 14 of 15 measures. Positive results were obtained for participants completing more than 50% of sessions, suggesting that HEAL<sup>™</sup> ing Mental Health program is effective to increase physical activity and healthy lifestyle choices in individuals who self-report a mental health disorder.","author":"Annette J. Raynor","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1a9ac2a130d17c2f7ac1ac9deecd4ed5984f4cd313fa987aa47477ecf026c33b","category":"Interdisciplinary"}