{"title":"Prevalence of pulmonary tuberculosis among key and vulnerable populations in hotspot settings of Ethiopia. A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309445","date":1724940000000,"content":"<p>by Melese Abate Reta, Zelalem Asmare, Assefa Sisay, Yalewayker Gashaw, Ermias Getachew, Muluken Gashaw, Zelalem Dejazmach, Abdu Jemal, Solomon Gedfie, Getinet Kumie, Marye Nigatie, Wagaw Abebe, Agenagnew Ashagre, Tadesse Misganaw, Woldeteklehaymanot Kassahun, Selamyhun Tadesse, Alene Geteneh, Atitegeb Abera Kidie, Biruk Beletew Abate, Nontuthuko Excellent Maningi, P. Bernard Fourie</p>\r\nBackground <p>Despite the decline in tuberculosis (TB) incidence across many regions worldwide, including Ethiopia, the disease remains highly concentrated among vulnerable or socially marginalized populations and in high-risk settings. This systematic review and meta-analysis aims to estimate the pooled prevalence of pulmonary tuberculosis (PTB) among key and vulnerable populations (KVPs) residing in hotspot settings in Ethiopia.</p> Methods <p>Potential papers were searched systematically in PubMed, Scopus, ScienceDirect databases, Google Scholar search engine, and institutional electronic repositories/registrars. A total of 34 potential articles that provide necessary information on the prevalence of PTB were reviewed and data were analyzed to determine the pooled prevalence of PTB among KVPs. The relevant data were recorded and analyzed using STATA 17.0. Cohen’s kappa was computed to determine the agreement between reviewers, the Inverse of variance (I<sup>2</sup>) to evaluate heterogeneity across studies, and Egger’s test to identify publication bias. A random effect model was used to determine the pooled prevalence of PTB, subgroup analysis was computed by types of hotspot settings and year of publication.</p> Results <p>This meta-analysis demonstrates that the pooled prevalence of PTB among populations residing in hotspot settings in Ethiopia was 11.7% (95% confidence interval (95CI): 7.97–15.43) with an I<sup>2</sup> of 99.91% and a <i>p</i>&lt; 0.001. Furthermore, the subgroup analysis unveiled the pooled prevalence of PTB among KVPs residing in different hotspot settings as follows: Prison inmates 8.8% (95CI: 5.00–12.55%), University students 23.1% (95CI: 15.81–30.37%), Refugees 28.4% (95CI: -1.27–58.15%), Homeless peoples 5.8% (95CI: -0.67–12.35%), Healthcare settings 11.1% (95CI: 0.58–21.63%), Spiritual holy water sites attendees 12.3% (95CI: -6.26–30.80%), and other high-risk settings 4.3% (95CI: 0.47–8.09%). Besides, the subgroup analysis revealed that the pooled prevalence of PTB post-2015 was 10.79% (95CI: 5.94–15.64%), whereas it stood at 14.04% (95CI: 10.27–17.82%) before 2015.</p> Conclusion <p>The prevalence of PTB among KVPs residing in the hotspot settings in Ethiopia remains significant, with a weighted pooled prevalence of 11.7%. Thus, the national TB control programs should give due attention and appropriate control measures should be instituted that include regular systematic TB screening, compulsory TB testing for presumptive TB cases among KVPs, and tightened infection control at hotspot settings.</p>","author":"Melese Abate Reta","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1a9c88ac42ec03fe4b60b29ac0f9a0cffe31967a351b96c9a2c470e9bbbc8f72","category":"Interdisciplinary"}