{"title":"Social robots in research on social and cognitive development in infants and toddlers: A scoping review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303704","date":1715781600000,"content":"<p>by Solveig Flatebø, Vi Ngoc-Nha Tran, Catharina Elisabeth Arfwedson Wang, Lars Ailo Bongo</p>\r\n\r\nThere is currently no systematic review of the growing body of literature on using social robots in early developmental research. Designing appropriate methods for early childhood research is crucial for broadening our understanding of young children’s social and cognitive development. This scoping review systematically examines the existing literature on using social robots to study social and cognitive development in infants and toddlers aged between 2 and 35 months. Moreover, it aims to identify the research focus, findings, and reported gaps and challenges when using robots in research. We included empirical studies published between 1990 and May 29, 2023. We searched for literature in PsychINFO, ERIC, Web of Science, and PsyArXiv. Twenty-nine studies met the inclusion criteria and were mapped using the scoping review method. Our findings reveal that most studies were quantitative, with experimental designs conducted in a laboratory setting where children were exposed to physically present or virtual robots in a one-to-one situation. We found that robots were used to investigate four main concepts: animacy concept, action understanding, imitation, and early conversational skills. Many studies focused on whether young children regard robots as agents or social partners. The studies demonstrated that young children could learn from and understand social robots in some situations but not always. For instance, children’s understanding of social robots was often facilitated by robots that behaved interactively and contingently. This scoping review highlights the need to design social robots that can engage in interactive and contingent social behaviors for early developmental research.","author":"Solveig Flatebø","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1aa0ff2f4db1fa4a5e1d50c424b1ce5a528f4a09c9a9540ee331485bba63380a","category":"Interdisciplinary"}