{"title":"The Evolution of Multiple Color Mechanisms Is Correlated with Diversification in Sunbirds (Nectariniidae)","link":"https://academic.oup.com/sysbio/article/73/2/343/7593426?rss=1","date":1706572800000,"content":"<span><div>Abstract</div>How and why certain groups become speciose is a key question in evolutionary biology. Novel traits that enable diversification by opening new ecological niches are likely important mechanisms. However, ornamental traits can also promote diversification by opening up novel sensory niches and thereby creating novel inter-specific interactions. More specifically, ornamental colors may enable more precise and/or easier species recognition and may act as key innovations by increasing the number of species-specific patterns and promoting diversification. While the influence of coloration on diversification is well-studied, the influence of the mechanisms that produce those colors (e.g., pigmentary, nanostructural) is less so, even though the ontogeny and evolution of these mechanisms differ. We estimated a new phylogenetic tree for 121 sunbird species and combined color data of 106 species with a range of phylogenetic tools to test the hypothesis that the evolution of novel color mechanisms increases diversification in sunbirds, one of the most colorful bird clades. Results suggest that: (1) the evolution of novel color mechanisms expands the visual sensory niche, increasing the number of achievable colors, (2) structural coloration diverges more readily across the body than pigment-based coloration, enabling an increase in color complexity, (3) novel color mechanisms might minimize trade-offs between natural and sexual selection such that color can function both as camouflage and conspicuous signal, and (4) despite structural colors being more colorful and mobile, only melanin-based coloration is positively correlated with net diversification. Together, these findings explain why color distances increase with an increasing number of sympatric species, even though packing of color space predicts otherwise.</span>","author":"","siteTitle":"Systematic Biology Current Issue","siteHash":"ff28aeeb9b03783edee2039c6a58e13e932a0eb216cc2d8b21d5a99c6800e59a","entryHash":"1aa2ae4da303b0d2006d054d83c3eeb28d6190739266755adc744ac3503f6e9f","category":"Environment"}