{"title":"PSVII-11 Genetic parameter estimates for lamb survival in prolific and nonprolific ewes","link":"https://academic.oup.com/jas/article/102/Supplement_3/444/7757566?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Given the increasing global demand for animal products, increasing lamb survival is a key breeding objective for sheep. However, high prolificacy can be associated with increases in fetal and lamb mortality. Therefore, the goal of this study was to estimate the variance components and genetic parameters for lamb survival (LS), using a: 1) single-trait model, where all ewes are analyzed together; and 2) two-trait model, where ewes are grouped in two groups based on birth type [i.e., Group 1 (G1) = single lamb/ewe, and Group 2 (G2) = multiple lambs/ewe]. In both models, LS was defined as the survival of lamb from birth to weaning and analyzed as a threshold trait. A total of 1,040,629 records (215,075 from single and 825,554 from multiple birth) from 319,467 ewes from several breeds/breed groups were available for the study. There were no females with two different types of births. Variance components were estimated through Bayesian inference via Gibbs sampling implemented in the GIBBSF90+ program, fitting a two-trait animal model with maternal effects, in which breed/breed groups were included as fixed effects. Average number of lambs/ewe in G2 was 2.57 (SD = 0.72). Heritability estimated (± SE) for LS on the underlying scale using the single-trait (0.04 ± 0.10) and two-trait model (0.010 ± 0.001 for LS<sub>G1</sub> and 0.031 ± 0.004 for LS<sub>G2</sub>) were low. Maternal heritability estimated by the single-trait model was 0.007 ± 0.043, while by the two-trait model the estimates were 0.010 ± 0.006 and 0.040 ± 0.005 for LS<sub>G1</sub> and LS<sub>G2</sub>, respectively. The genetic correlation estimated between LS<sub>G1</sub> and LS<sub>G2</sub> was weak and positive (0.25 ± 0.21). The low non-significant genetic correlation between single and multiple birth groups suggests that lamb survival is a different genetic trait in different birth types. Therefore, selecting for improving LS in nonprolific ewes may not necessarily translate to improving LS in prolific ewes. This underscores the need for careful consideration and targeted breeding strategies to achieve desired outcomes in nonprolific and prolific sheep simultaneously. Further studies to define the optimal statistical approach to genetically evaluate LS in prolific and nonprolific ewes are warranted.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1aab91c9587fd2b59fb2b524ebfac0c25c104ec076287d597aa1bcf9fbe606e2","category":"Environment"}