{"title":"Polar Vantage V3 In-Depth Review: The Comeback Kid?","link":"https://www.dcrainmaker.com/2023/11/polar-vantage-v3-in-depth-review-test.html","date":1699352421000,"content":"<p><span>﻿</span></p>\n<p>The Polar Vantage V3 is arguably the most important product for the company in at least a decade, if not ever. It’s no secret that Polar has had a rough last few years, as it struggles to find its footing in a world of big-tech companies releasing ever more powerful smartwatches, while their endurance sports competitors do the same with a different take. But the Vantage V3 seems positioned to finally turn that tide.</p>\n<p>It’s the first time we’ve seen Polar implement on-wrist mapping into a watch, the first time they’ve put a brilliant AMOLED display into an endurance-focused watch, and the first time they’ve put dual-frequency/multiband GPS into watches focused on the hardcore audience.</p>\n<p>Finally, note that Polar provided a media loaner Vantage V3 to test, which I’ve been using for the past month. As usual, I’ll get that back to them here shortly. I’ll go out and pick up my own to continue testing the new features once they arrive. If you found this review useful, you can use the links at the bottom, or consider <a href=\"https://www.dcrainmaker.com/support\">becoming a DCR Supporter,</a> which makes the site ad-free, while also getting access to a mostly weekly video series behind the scenes of the DCR Cave. And of course, it makes you awesome.</p>\n<p>With that, let’s talk newness.</p>\n<h3><span><strong>What’s New:</strong></span></h3>\n<p><img title=\"DSC_9143.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9143.jpg\" alt=\"DSC 9143\" width=\"720\" height=\"480\" /></p>\n<p>The Polar Vantage V3’s new features can roughly be grouped into two core chunks: Hardware changes like the display/GPS/sensors, and then the handful of software features required to light-up those new hardware capabilities (like the ECG app for the new heart rate sensor). While this may sound like an obvious statement, what’s notably different here is that the Vantage V3 doesn’t actually have any new sports features, or other new fitness-related features. Meaning, we don’t see new training load/recovery metrics, new running or cycling features, or anything of that sort.</p>\n<p>That’s not a bad thing per se, it just means Polar was hyper-focused on adding specific features that support the new hardware capabilities. My guess is, like most companies, they’ll then change their focus going forward on software feature updates that take advantage of that hardware. In effect, they have a powerful platform now, that they can use to add new features – a playbook that Apple, COROS, Garmin, Suunto, and just about every other company out there is using lately.</p>\n<p>In any case, here’s what’s new compared to the previous Vantage V2 series (or alternatively, even the Polar Grit X Pro):</p>\n<p>– Added offline mapping, with free global maps at high detail levels<br />\n– Added/switched to 1.39” AMOLED display<br />\n– Added/have new ‘always’ bright mode for always-on, even when wrist is down<br />\n– Added dual-frequency/multiband GNSS (GPS) chipset<br />\n– New optical heart rate sensor version (Gen4)<br />\n– Added new ‘Elixir biosensing’ technology, which is their new algorithm fusion thingy<br />\n– Added SpO2 sensor (blood oxygen levels)<br />\n– Added ECG capabilities (note: not certified as a medical device, however)<br />\n– Added skin temperature sensor<br />\n– Added skin temperature tracking feature and baselining/guidance<br />\n– Added virtual flashlight (display-based)<br />\n– Added ability to do Orthostatic test using new ECG hardware (no heart rate strap required)<br />\n– Added ability to utilize Recovery Pro without chest strap (via the Orthostatic test with ECG hardware)<br />\n– Increased GPS battery time to 43 hours (full fidelity GPS tracking), and 140 hours (reduced tracking rates)<br />\n– Increased CPU speed by 129% for faster user interface usage<br />\n– Increased internal storage to 32GB for saving multiple map regions/continents<br />\n– Smartwatch regular usage battery life is 8 days, or ~5 days with always-on display enabled<br />\n– Switched to standard 22mm straps (without adapter required)<br />\n– Switched charging cable to USB-C (watch-side connector is still propriety)<br />\n– Watch is water-resistant to 50m, and has Gorilla Glass 3 (curved)<br />\n– Pricing is $599USD</p>\n<p>Got all that? Good, let’s get it unboxed.</p>\n<h3><span><strong>In The Box:</strong></span></h3>\n<p><img title=\"PolarVantageV3Box.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/PolarVantageV3Box.jpg\" alt=\"PolarVantageV3Box\" width=\"720\" height=\"480\" /></p>\n<p>If you’re familiar with Polar boxes, this one will seem right in line with past experiences. Crack it open, and you’ve got the watch with a nifty sticker atop it:</p>\n<p><img title=\"PolarVantageV3-BoxOpened.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/PolarVantageV3-BoxOpened.jpg\" alt=\"PolarVantageV3 BoxOpened\" width=\"720\" height=\"480\" /></p>\n<p>Taking out all the parts, you’ll find the watch, the USB-C charging cable (if you’ve got a previous Ignite 3 cable with USB-A, the side that connects to the Polar watch is the same and can be used as well), as well as some paper stuff, and a secondary smaller sized strap band:</p>\n<p><img title=\"PolarVantageV3-BoxContents.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/PolarVantageV3-BoxContents.jpg\" alt=\"PolarVantageV3 BoxContents\" width=\"720\" height=\"480\" /></p>\n<p>Here’s a close look at that USB cable and watch back, before I used it for a month. Just to see what it looked like when it was all nice and pretty.</p>\n<p><img title=\"PolarVantageV3-BoxPartsCloseup.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/PolarVantageV3-BoxPartsCloseup.jpg\" alt=\"PolarVantageV3 BoxPartsCloseup\" width=\"720\" height=\"480\" /></p>\n<p><img title=\"PolarVantageV3BackSEnsor.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/PolarVantageV3BackSEnsor.jpg\" alt=\"PolarVantageV3BackSEnsor\" width=\"720\" height=\"480\" /></p>\n<p>And then finally, here’s a quick look at the size and how it compares to the Suunto Race and Garmin Forerunner 965, the two most likely comparison points here for AMOLED-based display watches focused on endurance athletes.</p>\n<p><img title=\"DSC_9145.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9145.jpg\" alt=\"DSC 9145\" width=\"720\" height=\"480\" /></p>\n<p>And, the thickness:</p>\n<p><img title=\"DSC_9146.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9146.jpg\" alt=\"DSC 9146\" width=\"720\" height=\"480\" /></p>\n<p>With that, let’s start using it.</p>\n<h3><span><strong>Daily Watch Basics:</strong></span></h3>\n<p><img title=\"DSC_9072.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9072.jpg\" alt=\"DSC 9072\" width=\"720\" height=\"480\" /></p>\n<p>Starting off with the basics, this section is focused on day-to-day usage for things like the hardware, activity/step tracking, sleep tracking, and general tidbits like widgets and such.</p>\n<p>To begin, the Polar Vantage V3 has five physical textured buttons and a touch screen. The touchscreen can be used both in sport modes and elsewhere. There’s two buttons on the left, and three buttons on the right.</p>\n<p><img title=\"DSC_9079.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9079.jpg\" alt=\"DSC 9079\" width=\"350\" height=\"233\" /> <img title=\"DSC_9080.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9080.jpg\" alt=\"DSC 9080\" width=\"350\" height=\"233\" /></p>\n<p>The touch screen works fairly well in dry conditions, but can struggle a bit in rainy conditions when working out. It didn’t meaningfully impact things for me though, since I could just use the buttons instead. I appreciate that Polar has a bunch of buttons, given it’s a sports watch, but they just work so much better than touchscreens when sweaty/wet and working out hard.</p>\n<p>With that sorted, the main watch face is shown below, which is lightly customizable. You can tweak the data fields (aka complications) shown on it, and change up the colors assigned, as well as choose from a few different styles. There isn’t some sort of custom watch face app store of sorts, so you don’t have quite as much flexibility here.</p>\n<p><img title=\"DSC_9081.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9081.jpg\" alt=\"DSC 9081\" width=\"720\" height=\"480\" /></p>\n<p>Next, if you swipe down, you’ll get the settings control panel, for quick access to do-not-disturb mode or the flashlight. The flashlight is great and super bright, but actually…kinda too bright for most middle-of-the-night usage. I’d love to see Polar add some brightness controls like most other watch flashlights, but I also understand it’s a good starting point.</p>\n<p><img title=\"DSC_9082.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9082.jpg\" alt=\"DSC 9082\" width=\"350\" height=\"233\" /> <img title=\"DSC_9148.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9148-1.jpg\" alt=\"DSC 9148\" width=\"350\" height=\"233\" /></p>\n<p>And if you swipe up, you’ll get access to smartphone notifications (e.g. texts).</p>\n<p>Meanwhile, swiping to the right (or left, I suppose) is where you’ll see all the good stuff. These are all your dashboard pages for various stats, and are customizable in terms of which ones to show or not show. For example, here’s the activity (steps) one, showing first a high-level view, and then if you tap on it, more details:</p>\n<p><img title=\"DSC_9084.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9084.jpg\" alt=\"DSC 9084\" width=\"355\" height=\"237\" /> <img title=\"DSC_9087.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9087.jpg\" alt=\"DSC 9087\" width=\"355\" height=\"237\" /></p>\n<p>The same is true for sleep data, which is shown in a few different ways. You can see it in the Nightly Recharge page, which shows whether or not the watch thought you got good sleep last night, before tapping to see more details:</p>\n<p><img title=\"DSC_9092.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9092.jpg\" alt=\"DSC 9092\" width=\"350\" height=\"233\" /> <img title=\"DSC_9094.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9094.jpg\" alt=\"DSC 9094\" width=\"350\" height=\"233\" /></p>\n<p>The secondary page related to sleep is the ‘Boost from Sleep’ page, which looks at your sleep patterns/trends, and tries to figure out when you’ll have the most energy that day, at specific times. I like it, and it seems to roughly match what I see each day, though practically speaking, most people will fall into a lull in that mid-afternoon timeframe anyway, so that’s not exactly rocket science.</p>\n<p><img title=\"DSC_9123.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9123.jpg\" alt=\"DSC 9123\" width=\"350\" height=\"233\" /> <img title=\"DSC_9124.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9124.jpg\" alt=\"DSC 9124\" width=\"350\" height=\"233\" /></p>\n<p>When it comes to the per-sleep night stats, you can also see this on the Polar Flow mobile app as well, which also includes all the sleep phases/stages (as it does on the watch):</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8755.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8755-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8755-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8755-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8755-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8755-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8755-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8756.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8756-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8756-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8756-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8756-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8756-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8756-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8757.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8757-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8757-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8757-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8757-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8757-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8757-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8758.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8758-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8758-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8758-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8758-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8758-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8758-278x185.png 278w\" /></a>\n\n<p>If I look at the accuracy of the data, I’ve had pretty good luck with Polar properly detecting all of my fell-asleep/wake-up times within a couple of minutes, even if I woke up briefly earlier in the morning, it doesn’t end sleep or such. So that’s solid. As far as sleep stages/phases, it’s not something I grade for accuracy, because the comparative technology to do so simply isn’t that accurate, roughly only in the mid-80% range (in a best-case scenario). Instead, I just assume (usually correctly), that most of the sleep phase/stage data is at best iffy, from all companies. For the heart rate variability data (HRV), which is displayed nightly deep in the sleep stats, the numbers Polar is producing with the Vantage V3 have near-identically matched those that Garmin, Suunto, and Whoop have produced (depending on which devices I wear each night to compare to).</p>\n<p>For example, last night the Polar showed my HRV status at 36ms, Suunto at 37ms, and Whoop at 34ms. And yes, those are absurdly low for me for a nightly value/average, but also show the impact of having a bunch of friends over at the DCR Cave drinking wine all afternoon, followed by an indoor trainer Zwift workout.</p>\n<p>In any event, looking at other widgets, there’s the new skin temperature one. This will show the difference to your baseline, after at least 3 nights of skin temperature data. The main portion of the widget shows the difference, while lower portions show historical data:</p>\n<p><img title=\"DSC_9128.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9128.jpg\" alt=\"DSC 9128\" width=\"350\" height=\"233\" /> <img title=\"DSC_9127.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9127.jpg\" alt=\"DSC 9127\" width=\"350\" height=\"233\" /></p>\n<p>You can also see all of this data within the Polar Flow smartphone app. In terms of practicality of this data, Polar isn’t really doing anything with it yet. Thus, the data will be dependent mostly on your environmental conditions (the room temp). So if you are going from home to hotel, expect differences. Where we see this type of data being useful, is in women’s ovulation cycle predictions, like what Whoop and Oura are doing (and to a lesser extent Apple, with retrospective estimates after the fact). It sounds like Polar is looking at all their options here, but today it’s just general skin temp tracking.</p>\n<p>The next two widgets you’d see are Cardio Load Status &amp; Polar’s FitSpark daily suggested workouts feature, but I’ll save those for the sports section. Instead, you’ll see a widget for the sunrise/sunset times, as well as the weather. Here’s the sunrise/sunset one:</p>\n<p><img title=\"DSC_9112.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9112.jpg\" alt=\"DSC 9112\" width=\"350\" height=\"233\" /> <img title=\"DSC_9113.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9113.jpg\" alt=\"DSC 9113\" width=\"350\" height=\"233\" /></p>\n<p>And here’s the weather one. I suppose some people in some locations might find the weather one useful, but here in the Netherlands, it’s just gonna tell me it’s going to be rainy and windy every day.</p>\n<p><img title=\"DSC_9115.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9115.jpg\" alt=\"DSC 9115\" width=\"350\" height=\"233\" /> <img title=\"DSC_9116.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9116.jpg\" alt=\"DSC 9116\" width=\"350\" height=\"233\" /></p>\n<p>Last on dashboard pages/widgets, there’s music control. This will control whichever music is playing on your phone. Note that there’s no music storage on the Polar Vantage V3 itself.</p>\n<p><img title=\"DSC_9154.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9154.jpg\" alt=\"DSC 9154\" width=\"720\" height=\"480\" /></p>\n<p>Given the unit lacks WiFi hardware, it’s unlikely to ever get any streaming services with downloadable music, and practically speaking from a business standpoint, all those doors/gates have closed to providers like Spotify and others years ago. Polar is simply far too small to unlock that these days. While Polar could probably implement MP3-based playback using the storage on the watch, consumer demand simply doesn’t exist in big enough quantities to transfer MP3 files via USB to your watch and listen to them. I think most consumers of this watch would much rather Polar spend those development hours on sports features.</p>\n<p>Finally, the last item to cover is the new ECG (electrocardiogram) feature. This is the first time such has been included in a Polar wearable product. Starting with that, to take an ECG, you’ll tap down to the ‘Tests’ section, and then ECG’. It’s here you’ll see the new ECG screen, which requires you to place your other hand on the upper left button. That completes the ‘circuit’, allowing proper measurement. Once you’ve done that, you’ll start to see the ECG trace:</p>\n<p><img title=\"polar-vantagev3-ecg-trace.png\" src=\"https://media.dcrainmaker.com/images/2023/11/polar-vantagev3-ecg-trace.png\" alt=\"Polar vantagev3 ecg trace\" width=\"720\" height=\"405\" /></p>\n<p>After 30 seconds of showing you the trace/signal, the ECG will be complete. On the watch you’ll see average HR, HRV, and beat-to-beat interval.</p>\n<p><img title=\"DSC_9156.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9156.jpg\" alt=\"DSC 9156\" width=\"720\" height=\"480\" /></p>\n<p>At that point it’ll save the results to Polar Flow, where you can view the results and export out a PDF to take to your doctor.</p>\n<p><img title=\"IMG_8759.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8759-1.png\" alt=\"IMG 8759\" width=\"300\" height=\"649\" /> <img title=\"IMG_8760.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8760-1.png\" alt=\"IMG 8760\" width=\"300\" height=\"649\" /></p>\n<p>Now, it’s really important to note this is substantially different than what Apple, Garmin, Google/Fitbit, Samsung, and others are providing. Very very different. To begin, Polar is not claiming to be a medical device (certified or otherwise). Instead, they are saying they are merely providing a trace that you can talk with your doctor about. While the company says they are interested in the medical realm, and have history there, at present, the Polar Vantage V3 is not a medical device from an ECG standpoint.</p>\n<p>Feature-wise, the differences are arguably even more important in this context. All the others (Apple/Garmin/Fitbit/etc) are doing what’s called ‘Afib detection’, meaning, they’re looking for signs of an abnormal rhythm – either manually (when doing an ECG), or as a background process 24×7. Polar is doing neither. Thus, while you can take and record an ECG anytime you’d like on the Vantage V3, Polar is not going to tell you if it found an abnormal result (whereas the others are).</p>\n<p>Now, while I appreciate what Polar is doing here – I think in this context, given the existing landscape of the wearables world and certified ECG devices, that Polar’s marketing/implementation is probably a bit misleading. While I agree it’s technically correct, the average consumer will see what they are doing, and assume the ECG will provide feedback as seen in countless “this saved my life” news stories over the past few years. The Vantage V3 won’t do that. It’s merely going to take a trace that you can send to your doctor. That trace could indeed show signs of something concerning, but it’s not going to give you instant feedback.</p>\n<p>Hopefully though, as Polar says, with their interest in the medical realm, we’ll see them make that leap towards a proper FDA or EU/CE certified medical device. But that process is typically at least a year, if not often much longer.</p>\n<h3><span><strong>Sports Tracking:</strong></span></h3>\n<p><img title=\"DSC_9157.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9157.jpg\" alt=\"DSC 9157\" width=\"720\" height=\"480\" /></p>\n<p>Undoubtedly, if you’re buying a Polar watch, it’s likely to be used for sports purposes. Polar’s platform includes numerous sports, covering just about any sport you’d need. In the case of most of Polar’s sport profiles/modes, they’re primarily focused on correct calorie burn and general categorization for that particular sport (versus capturing the unique movements/data metrics of Stand-up Paddleboarding, for example).</p>\n<p>To start a workout, you’ll either tap the lower-left button and select training, or long-hold the red button. Both get you to this menu where you can select your particular sport of choice:</p>\n<p><img title=\"DSC_9159.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9159.jpg\" alt=\"DSC 9159\" width=\"720\" height=\"480\" /></p>\n<p>You can then scroll up/down this list till you find the sport you’re looking for. This list is sortable using the Polar Flow app, so you can arrange the sports modes in the order you’re most likely to use them. That said, I feel like this screen is ripe for an update. It hasn’t changed in a decade, and these days, it seems a pretty big waste of space. It’s also relatively slow to iterate through the list to find the sport you’re looking for. Instead, Polar could look at every other watch out there, which condenses this down into 3-5 sports on the page at once, which would hide any UI slowness, while also just making it faster to find the sport you want.</p>\n<p>In any event, at the top of that page you’ll see your GPS status, heart rate status (lock), and any sensors you’ve got locked (e.g. a cycling power meter). Likewise, you’ll also see if your phone is in-range and connected. However, in the upper left corner you’ve got the settings option. This lets you configure settings for that sport, such as always-on display (which is configured on a per-sport profile basis), as well as selecting routes, structured workouts, timers, and more.</p>\n<p><img title=\"DSC_9160.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9160.jpg\" alt=\"DSC 9160\" width=\"350\" height=\"233\" /> <img title=\"DSC_9161.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9161.jpg\" alt=\"DSC 9161\" width=\"350\" height=\"233\" /></p>\n<p>This is where you’d apply a route to follow, or if you had a specific planned structured workout, it’d all show up here. I’m going to cover the route/course piece in the next section, so for now, let’s double back and look at sensors.</p>\n<p>Sensors are added in the sensors menu, which is under settings. Here you can pair Bluetooth sensors such as heart rate sensors/straps, cycling power meters/cadence/speed sensors, and running footpads. Polar does not support ANT+ sensors here, though in 2023, I don’t think that’s a major issue – virtually all sensors made in the last decade support dual ANT+/Bluetooth Smart. The singular exception is smart trainers, which while they do all support dual ANT+/BLE, they don’t all support multi-channel Bluetooth. That’s more of a challenge in a trainer where you probably have Zwift/TrainerRoad controlling it via Bluetooth, taking up that single channel. Thus, you couldn’t also connect your Polar watch to it (or Suunto/COROS/Apple). Again, not an issue for everyone, but something of note.</p>\n<p><img title=\"DSC_9162.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9162-1.jpg\" alt=\"DSC 9162\" width=\"720\" height=\"480\" /></p>\n<p>When it comes to sensor pairing, Polar will automatically pull in saved Polar sensors from Polar Flow (e.g. a Polar H10 chest strap), and in fact, do it every single time you sync. You can add numerous other sensors though via the pairing menu, each listing the name of the sensor (e.g. Wahoo KICKR). If there’s a specific limit on the number of sensors, I haven’t run into it yet.</p>\n<p>However, one minor annoyance is that when you’re pairing sensors, it will only show the first sensor it finds. Choosing ‘No’, just resets the cycle. This can be tricky if you’re in a place with multiple sensors around, as you really have to keep pressing re-do hoping it finally finds the right thing first. On the bright side, this is certainly far better than Suunto, which doesn’t support saving multiple sensors of the same type (which Polar does). So, win some…lose some.</p>\n<p>In terms of pairing sensors, everything pairs fine. However, when paired to the Stages LR (dual-sided), it doesn’t correctly handle the Bluetooth power meter stream, and halves the power value, which is a bummer.</p>\n<p><img title=\"DSC_9163.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9163-1.jpg\" alt=\"DSC 9163\" width=\"720\" height=\"480\" /></p>\n<p>Further, if you have a chest strap that transmits running footpod data (e.g., Garmin HRM-PRO series or Wahoo TICKR X series), then Polar will incorrectly zero-out your entire run distance. It’ll still show the correct pace, the GPS track after, and even nearby Strava Segments. But during the run, distance will always be zero.</p>\n<p>Next, setting aside sensors, we’ve got the data pages you can configure. This can be done via the Polar Flow app on your phone, or Polar Flow on the website. You can configure up to 8 data pages per sport profile, and up to four fields per data page. You’ll find pretty much any data field you need here:</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8761.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8761-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8761-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8761-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8761-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8761-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8761-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8762.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8762-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8762-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8762-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8762-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8762-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8762-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8765.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8765-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8765-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8765-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8765-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8765-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8765-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8766.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8766-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8766-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8766-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8766-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8766-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8766-278x185.png 278w\" /></a>\n\n<p>I’d like to see Polar offer up to at least 6 data fields per page here. I know it may sound like I’m nitpicking on things, but when you charge $599, you’re competing against other watches in that price ballpark. And all those other watches (COROS, Suunto, Garmin, Apple) – all offer more than 4 data fields per page (sometimes far more). I’ve long believed that products can’t be evaluated in a price vacuum, and little things matter.</p>\n<p>Additionally, Polar also has some specialty fields, like the Hill Climb metric, which automatically detects climbs/hills and tracks them. I’ve <a href=\"https://www.dcrainmaker.com/2020/04/polar-grit-x-gps-watch-review.html#understanding-hill-splitter\">written about this previously</a>, this is really designed mostly for hill repeat scenarios, rather than big climbs up a mountain (as it doesn’t tell you how much is remaining). So it’s different than something like Garmin’s ClimbPro. Not in a bad way, they just do different things. Garmin’s ClimbPro is all about telling you where you are in a pre-planned climb/mountain (which Polar can’t do). Whereas Polar’s is really targeted for doing hill repeats ad-hoc, where you want to track how many repeats and the distance/elevation for each one (which Garmin’s can’t do).</p>\n<p><img title=\"IMG_7656.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_7656.png\" alt=\"IMG 7656\" width=\"720\" height=\"540\" /></p>\n<p>Ok, all these configuration distractions behind us, let’s start our run. I’m using run because it’s the easiest to show – but practically speaking there’s very little difference between how any of these sports work. In this case, because it’s an outdoor run, it finds GPS and locks that (which wouldn’t happen indoors such as on a swim, where it asks you your pool size instead):</p>\n<p><img title=\"DSC_9164.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9164.jpg\" alt=\"DSC 9164\" width=\"720\" height=\"480\" /></p>\n<p>So, starting the run, you’ll see the data you’ve configured on the various data pages. Here’s a gallery of that from one of my runs this weekend. Sorry for the rain, such is life.</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8608-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8608-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8608-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8608-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8608-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8608-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8608-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8613-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8613-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8613-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8613-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8613-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8613-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8613-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8615-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8615-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8615-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8615-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8615-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8615-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8615-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8617-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8617-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8617-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8617-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8617-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8617-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8617-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8620-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8620-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8620-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8620-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8620-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8620-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8620-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8621-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8621-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8621-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8621-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8621-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8621-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8621-278x185.jpeg 278w\" /></a>\n\n<p>In terms of things like pace stability, I had no problems there. It was both reactive to shifts in pace, as well as being stable while running stable.</p>\n<p>Post-workout you’ll get a summary screen of all your stats. This hasn’t changed from before, however, with the AMOLED display it looks a heck of a lot prettier/vibrant!</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8669-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8669-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8669-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8669-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8669-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8669-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8669-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8670-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8670-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8670-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8670-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8670-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8670-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8670-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8671-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8671-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8671-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8671-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8671-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8671-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8671-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8672-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8672-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8672-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8672-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8672-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8672-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8672-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8673-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8673-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8673-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8673-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8673-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8673-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8673-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8674-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8674-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8674-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8674-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8674-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8674-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8674-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8675-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8675-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8675-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8675-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8675-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8675-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8675-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8676-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8676-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8676-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8676-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8676-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8676-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8676-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8677-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8677-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8677-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8677-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8677-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8677-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8677-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8678-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8678-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8678-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8678-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8678-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8678-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8678-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8679-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8679-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8679-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8679-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8679-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8679-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8679-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8681-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8681-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8681-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8681-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8681-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8681-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8681-278x185.jpeg 278w\" /></a>\n\n<p>Then from there the data is available up on Polar’s Flow website, or their smartphone app. Again, here’s a gallery of some screenshots from this same run:</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8779.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8779-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8779-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8779-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8779-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8779-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8779-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8780.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8780-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8780-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8780-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8780-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8780-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8780-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8781.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8781-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8781-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8781-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8781-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8781-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8781-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_8782.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8782-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_8782-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/IMG_8782-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/IMG_8782-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/IMG_8782-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/IMG_8782-278x185.png 278w\" /></a>\n\n<p>From a battery standpoint, things are burning a bit higher than I expected. Polar claims up to 28 hours of battery life in workout mode, albeit doesn’t differentiate between always-on display enabled or not. In my case, like all watches I test, I use the always-on display. During the 12hr/60km hike I did, I burned through the entire battery, with it finishing at 5% (and actually it force-ended the activity the exact same second I was about to end the activity myself):</p>\n<p><img title=\"IMG_7797.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_7797.png\" alt=\"IMG 7797\" width=\"720\" height=\"554\" /></p>\n<p>In that case, I was using always-on display, optical HR, and navigation for the first few hours of the day, but since it kept crashing with navigation enabled, the bulk of the day was without navigation enabled (or maps showing). Just normal data fields.</p>\n<p>In talking to Polar about this, they noted that:</p>\n<blockquote><p>“When under strong direct sunlight, the watch goes into the special mode where the brightness is switching between ‘extra high’ and ‘normal high’ every 15 seconds. According to the display manufacturer, such a mode is the maximum brightness level that can be offered to ensure that the display doesn’t get burn-in. When you’re under strong direct sunlight, the battery life is around 12 hours with always-on and all other possible high accuracy and navigation settings turned on. When not under strong direct sunlight, the battery life estimate is up to 28 hours with always-on in dual-frequency and with enabled OHR.”</p></blockquote>\n<p>Now, what’s interesting here is what Polar is doing is trying to make it easier to see the display without gestures or tapping the screen, saying:</p>\n<blockquote><p>“We intentionally set the brightness level to ‘high’ so that one can use Vantage V3 on a bike handlebar or a bike mount without compromising the ability to read the display.”</p></blockquote>\n<p>They went on to note that with competitor watches:</p>\n<blockquote><p>“…their always-on during training under direct sunlight is hardly readable without doing the ‘wake-up’ gesture with the wrist, tapping the touchscreen, or pressing one of the buttons.”</p></blockquote>\n<p>Now, if you’re not familiar with AMOLED displays, this may all be a bit perplexing to you. But in short, all AMOLED displays (even in always-on mode) will dim the display when your wrist is down (not looking at it), to both save battery but prevent burn-in. Indoors and such, this isn’t a problem. But if in bright sunny conditions, it can be hard to see the watch if off-angle and still in a dim state. Once you’ve worn an AMOLED watch for a short period (maybe a few weeks), it becomes a very natural motion to know how to flick your wrist just barely (talking a few millimeters) to go to normal brightness. People have been doing this for years on Apple Watch and other watches without any issue (the most popular watch by sales volume on the planet).</p>\n<p>However, some people still don’t like it (fair enough), and in particular, if on a bike for example, it’ll generally go into the dimmed state at some point (unless the road is bumpy enough to keep it awake.</p>\n<p>Thus, what Polar has actually done here is ‘fix’ that problem, albeit at the cost of (substantial) battery life. But for someone not doing a 12-hour activity, it doesn’t likely matter – it fixes it and makes them happy. And as I told them privately, this is a super cool feature that none of their competitors have. Except, they aren’t correctly calling it a feature, nor is there any way to turn it off (without turning off AOD altogether). Again – to be clear, what I think Polar has done is brilliant (no pun intended), but…they just need to both document it somewhere, and also let people turn it off.</p>\n<p><img title=\"IMG_1077.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1077.png\" alt=\"IMG 1077\" width=\"720\" height=\"540\" /></p>\n<p>As another point of reference, on an hour-long run this weekend, I was at about 9-10% battery drain (no structured workout, no route loaded, and in fact *NO* always-on display was enabled this time). This was more battery than I expected to burn. Obviously, I could keep trying to tweak different backlight settings here, but it’s a bit fuzzy as to exactly how much battery (hours) you’d have, which is one thing I appreciate with Suunto’s battery burn calculator shown on the watch as you change settings.</p>\n<p>Now, like most other endurance sports companies, Polar has various training load metrics. The most prominent one you’ll see on the watch is Cardio Load Status, which tracks your training load. It does this by building up a profile of your workout usage over time, and then looking at how much load you’ve got right now (e.g., today/this week), versus that historical past load. You can see an example of this here by going to the Cardio Load dashboard page:</p>\n<p><img title=\"DSC_9107.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9107.jpg\" alt=\"DSC 9107\" width=\"720\" height=\"480\" /></p>\n<p>If you scroll down, you’ll see a short message about whether this load is appropriate based on your historical load.</p>\n<p><img title=\"DSC_9108.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9108.jpg\" alt=\"DSC 9108\" width=\"720\" height=\"480\" /></p>\n<p>You can also then get similar information in the app as well:</p>\n<p><img title=\"IMG_8768.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8768.png\" alt=\"IMG 8768\" width=\"300\" height=\"649\" /> <img title=\"IMG_8769.PNG\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8769.png\" alt=\"IMG 8769\" width=\"300\" height=\"649\" /></p>\n<p>In addition, Polar also has their FitSpark workout suggestions. This works by giving you specific daily workout suggestions in three categories: Strength, Cardio, and Supportive. In the case of Strength and Supportive workouts, it’ll suggest actual workout routines, such as these ‘Core’ workouts falling under the supportive suggestion:</p>\n<p><img title=\"DSC_9133.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9133.jpg\" alt=\"DSC 9133\" width=\"720\" height=\"480\" /></p>\n<p>However, for Cardio, it won’t specify an exact sport (e.g. running or cycling), but rather gives you zones to work from. That has pros and cons. On the positive side, it makes the watch more agnostic (versus Garmin which will prescribe exact Running or Cycling workouts, but only those two types). Inversely though, the downside is that if you’re just a runner, you might assume the appropriate ‘easy day’ is a 71-minute easy run it’s suggesting (which, in reality, probably should be some other sport). Still – their core/strength workouts are beyond what Garmin and most others do in this realm, in terms of automated workout suggestions.</p>\n<p><img title=\"DSC_9134.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9134.jpg\" alt=\"DSC 9134\" width=\"230\" height=\"153\" /> <img title=\"DSC_9135.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9135.jpg\" alt=\"DSC 9135\" width=\"230\" height=\"153\" /> <img title=\"DSC_9137.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9137.jpg\" alt=\"DSC 9137\" width=\"230\" height=\"153\" /></p>\n<p>Now, as I mentioned earlier on in the ‘Basics’ section, don’t forget that you’ll also get some recovery suggestions via the ‘Boost’ feature, which will show you whether or not you should train as normal.</p>\n<p>In addition, Polar can also do what’s called ‘Recovery Pro’, whereby it’ll take your training load information and then combine that with an orthostatic test. In the case of the Polar Vantage V3, this test no longer requires a Polar chest strap, instead, you place your finger on the upper left button (same as for ECG), for a period of four minutes, including starting off sitting for the first few minutes, then standing (all while still holding the button). At the end, you’ll receive a result:</p>\n<p><img title=\"IMG_8752.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_8752.png\" alt=\"IMG 8752\" width=\"720\" height=\"540\" /></p>\n<p>But, this isn’t your Recovery Pro result. Instead, you’ll need to do that for 3 of the last 7 nights (ideally each morning), and it replaces the Nightly Recharge feature. So it’s an either/or situation, and in my case, I prefer the automated nightly recharge function. Albeit, as I’ve said in the past, I wish Polar provided the option to do both.</p>\n<p>I think if we look at sports metrics, this is an area that Polar largely once led, in terms of monitoring training load/recovery. Whereas today, Polar has largely fallen behind on these metrics – which haven’t changed in years. Mind you, this isn’t saying that Polar needs to invent piles of new metrics, but rather, just ways to more easily display the data they already capture. The most useful metrics I use on other watches are simply ways to see my training load in a small chart over the last 7/28 days quickly from the watch, or the types of load.</p>\n<p><img title=\"DSC_9166.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9166.jpg\" alt=\"DSC 9166\" width=\"720\" height=\"480\" /></p>\n<p><em>(Note: I can hear some people screaming already “But Polar has a 7-day chart!!!!”, and they do, but that’s purely time, not training load. Which, in the context of training load things, is a massive difference.)</em></p>\n<p>While there is value to many of the metrics offered by their competitors, Polar merely has a single page dedicated to training load, and now barely a single page for recovery (with arguably no recovery page at all unless you do the manual process of Recovery Pro). For a company with so much focus on research and validation of all the stats they do, it feels like sometimes they forget the purpose of validating the stats they provide is to actually make them visible to the end user.</p>\n<p>Take for example HRV. Polar does indeed track HRV, but hides it deep in the menu system, without any way to see trends or changes, or how it impacts things. Same goes for breathing rate. Comparing both to a 28-day average (as Polar does today) is largely useless if I can’t see how things shift more recently. The whole point of these two stats is to look at factors that might be indicating one is over-trained, sick, etc… And you simply can’t do that comparing to a static 28-day baseline. You need to know what it’s been doing the last 3-7 days. Is it going up? Going down? The same?</p>\n<p><img title=\"DSC_9167.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9167.jpg\" alt=\"DSC 9167\" width=\"350\" height=\"233\" /> <img title=\"DSC_9168.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9168.jpg\" alt=\"DSC 9168\" width=\"350\" height=\"233\" /></p>\n<p>So, my message to Polar is simple here: If you’ve got it, flaunt it. You’ve put the time and energy into tracking all these metrics (and validating them). If I dig deep enough I can see the data is being recorded somewhere, just not presented in a way that shows what you’re doing. For an apt comparison, you’ve done the hard work in the gym all year long, but when you went to the beach in summer, you decided to wear 12 layers of thermals including two oversized winter parkas.</p>\n<p>Instead, spend just as much time on showing to the world the data you’ve gathered, as you spend writing (great) white papers on how good the data you’ve captured is.</p>\n<h3><span><strong>Mapping &amp; Navigation:</strong></span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/P1099783_thumb.jpg\" /></p>\n<p>Arguably the biggest feature on the Polar Vantage V3 is the new mapping capabilities. This is the first time we’ve seen offline maps on a Polar watch, and follows just months after we saw Suunto add it in their new Suunto Vertical (and to a sorta-extent, Apple on the Apple Watch in WatchOS 10). This appears to be the year of the offline map, finally.</p>\n<p>In Polar’s case, they’ve added 32GB of storage inside the Vantage V3 – dedicated virtually exclusively to maps. I say exclusively, because there’s no onboard music capabilities – so about the only thing you’re gonna use that space for is maps (workout/activity files are trivially small, usually measured in the 30-100KB range per hour).</p>\n<p>The first step is getting the maps you want on the watch. By default the Vantage V3 will come with the European and North American maps pre-loaded in a ‘Basic’ configuration. However, you can easily download other regions, and the more detailed maps, for free, via Polar Flow. To do so, you’ll go to <a href=\"http://flow.polar.com/maps\">flow.polar.com/maps</a> to get started (that site only works if you have a Polar Vantage V3 registered on your account). Which brings you here:</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h03m33s112_thumb.png\" /></p>\n<p>You’ll see you’ve got two options to begin with: Basic or Detailed.</p>\n<p>Basic maps show the general gist of things, including main roads and town names. Whereas ‘Detailed’ maps show down to the names of rivers/streams, as well as small trails. Additionally, detailed maps include topographic contour lines.</p>\n<p>From a basemap standpoint, Polar loads both the North American and European ‘Basic’ maps by default, which in total take up about 15.3GB of storage (8.4GB for Europe, 6.8GB for North America). From there, you’d likely want to add detailed maps for the country or region that you want more detail on. You can see how this is divided up in various spots:</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h03m43s540_thumb.png\" /></p>\n<p>For context, here’s some random map sizes for the ‘Detailed’ maps:</p>\n<p>– USA West: 4.9GB<br />\n– USA Midwest: 2.3GB<br />\n– USA Northeast: 1.1GB<br />\n– USA South: 3.4GB<br />\n– Canada West: 4.1GB<br />\n– Canada East: 3.8GB<br />\n– Canada North: 6.1GB<br />\n– France 2.7GB<br />\n– Spain and Andorra: 1.3GB<br />\n– Germany: 2.4GB<br />\n– Australia and Oceania: 5.2GB<br />\n– Brazil: 6.0GB<br />\n– South-east Asia: 7.0GB</p>\n<p>Generally speaking, from the above quick-hit list, you can probably figure out a ballpark for your specific region. Interestingly, there’s only ‘Basic’ maps offered for North America &amp; Europe. You can’t get a ‘Basic’ map for anywhere else, only detailed.</p>\n<p>Now, once you select the region you want, you’ll choose to download the file, which is simply a single file.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h03m54s660_thumb.png\" /></p>\n<p>In case it isn’t clear at this point, downloading maps requires a computer of some sort. You’ll need your Polar Vantage V3 connected via the included USB-C cable, which then makes the watch appear as a standard USB mass storage device (like a thumb drive). You’ll take said map file, and simply drag it onto the watch. Done, it’s as simple as that.</p>\n<p>Now, over on the watch, you’ll see your maps as part of a map page. That page is shown in any GPS sports profiles that you enable it. There isn’t a dedicated ‘map’ app/activity right now, though I suspect in the future Polar might add one akin to the Compass page. In the sports modes though, you’ll see your current location displayed via the blue dot, and you can zoom in/out as well as pan around.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/P1099778_thumb.jpg\" /></p>\n<p>However, you’re going to want to use this with a route. That’s because as it stands today, Polar does NOT show any historical track data on said map (e.g. where you’ve been thus far on your hike/etc) unless you have a route loaded. Meaning, no track breadcrumb trail is shown, which is kinda weird.</p>\n<p>To see that track, you’ll need to load a route (and be on said route), like this one here for my planned 45km hike (that…became a 58KM hike.):</p>\n<p><img title=\"IMG_1064.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1064.png\" alt=\"IMG 1064\" width=\"720\" height=\"540\" /></p>\n<p>In my case, I created this route on Komoot. Well, technically I created it in Strava, then exported a GPX file, which I then exported to Komoot, and then created a duplicate route there. Polar doesn’t link up to Strava Routes, which is kinda a bummer. And their turn-by-turn routes are only when paired with Komoot routes. In any event, all that said and done, I’m here:</p>\n<p><img title=\"IMG_1065.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1065.png\" alt=\"IMG 1065\" width=\"720\" height=\"540\" /></p>\n<p>While I was hiking along, I’d could see my current location on the map, and the track ahead. Here’s an example of that:</p>\n<p><img title=\"IMG_1128.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1128-2.png\" alt=\"IMG 1128\" width=\"720\" height=\"540\" /></p>\n<p>If you zoom in, you can clearly see the topographic data downloaded into this map detail level:</p>\n<p><img title=\"IMG_1128Zoomed.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1128Zoomed-1.png\" alt=\"IMG 1128Zoomed\" width=\"720\" height=\"413\" /></p>\n<p>Additionally, if there were turns coming up, you’d see that information too – like here, showing the turn in the trail coming up in 20 meters. The red portion of the trail is the portion I’ve completed, whereas the blue portion is where I’m headed. This was a lollipop section:</p>\n<p><img title=\"IMG_7661.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_7661.png\" alt=\"IMG 7661\" width=\"720\" height=\"540\" /></p>\n<p>Note that the Polar Vantage V3 can’t do routing on-demand. Meaning, it needs to have the route pre-planned (via Komoot) in order to route on it. You can’t enter an address into the watch, nor can it give alternate trails/routes back home if you go off-course.</p>\n<p>In fact, when you go off-course is where I ran into one fairly substantial issue: Your historical breadcrumb trail/track will disappear. I was hiking in a pretty desolate area, where the trail has become heavily overgrown – to the point that finding the trail was at times near-impossible. And sometimes, when navigating around cliffs and such, you had to do some trial and error as to the exact way the GPS route wanted you to get around that cliff (for example, going under past it, versus going over past it).</p>\n<p><img title=\"IMG_1154.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1154-1.png\" alt=\"IMG 1154\" width=\"720\" height=\"540\" /></p>\n<p>In the case of the Polar Vantage V3, if I went off-course (about 50-meters), it’d then disappear all of my historical data, so I could no longer follow the exact route I came out on back to my diversion point. No other watch on the market does this, they always show where you’ve been (for the exact reason of backtracking):</p>\n<p><img title=\"IMG_1159 2.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1159-2-1.png\" alt=\"IMG 1159 2\" width=\"720\" height=\"540\" /></p>\n<p>Polar counters that I could have enabled ‘Back to Start’, and that’s true…if I wanted to go back to the start. But I didn’t. I wanted to go back to my diversion point on the route. Had I selected back to start, that’d never show me that diversion point, but instead just keep routing me all the way back to the start.</p>\n<p>In any event, in my discussions with Polar, they seem to grasp that this is an issue, and looks like they’re seeing when it can be added back in the future. Essentially, the reason your track disappears is because once you go off-course, Polar no longer sees you as on a route, and just like with it not showing your historical route when no route at all is loaded – the same situation applies here too.</p>\n<p>However, my biggest issue shortly after this was that the watch crashed mid-hike, losing all my data for the previous few hours. I started the hike again, and then within 60 seconds of loading the route, it crashed again. I repeated this a few times, until figuring out that for whatever reason, loading the route was causing the crashes. I left it alone for a few hours (no route loaded) and it was fine. Of course, I got brazen around the 4-hour marker and tried loading the route in again, and it crashed again. Data lost again. For the remaining 8-hours of the hike, I just left it route-less.</p>\n<p>Now, crashes aside, a few final things to note here is that Polar does give you options when you open a route up mid-activity, as to how it will load – notably from the start, from the mid-point, and reverse:</p>\n<p><img title=\"IMG_1069.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1069.png\" alt=\"IMG 1069\" width=\"720\" height=\"540\" /></p>\n<p>Additionally, you’ll also see the elevation profile of your route, and how much ascent/descent is completed and remaining. Here’s the route loaded fairly early on, before the crashes – albeit, I’m not entirely sure why there are two zeros for both ascent/descent, since I had already ascended at least 142m from the sea (as indicated by my current 142m elevation), including some descending as well. In fact, as I’m now dragging all these photos in here, I think in reality, it had already failed to keep ‘snapped’ to my route at this point (despite the above photos showing very clearly that I’m on-route).</p>\n<p><img title=\"IMG_1130.png\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_1130.png\" alt=\"IMG 1130\" width=\"720\" height=\"540\" /></p>\n<p>Note, there are no waypoints or POIs present at this point on the Vantage V3. With everything you need to know about mapping and navigation, let’s take a look first at GPS accuracy, and then at heart rate accuracy.</p>\n<h3><span><strong>GPS Accuracy:</strong></span></h3>\n<p><img title=\"DSC_9169.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9169-1.jpg\" alt=\"DSC 9169\" width=\"720\" height=\"480\" /></p>\n<p>First we’ll take a look at the GPS, or more specifically, the GNSS system. In this case, all of my testing is done in the ‘Most Accurate’ setting/mode, which is dual-frequency/multiband configuration. This means it burns more battery life, but in exchange, you get higher-quality GPS tracks. For all other watches listed in this section, I’m using the highest accuracy option of each one – which is almost always multi-band (the exception being the Google Pixel Watch 2, which lacks such hardware). In the case of Garmin watches, I leave the default ‘Auto-Select’ mode, which basically automatically engages multiband/dual-frequency when it senses the environment needs it (buildings/mountains), and then steps down to lesser GPS options in areas like open farmland.</p>\n<p>Note that for all of these tests, you can click on the link next to each one to see the full test, and zoom around inside the GPS map with all of the tracks to analyze as you see fit. I’m going to focus on the most interesting (good or bad) portions of each route.</p>\n<p>With that said, let’s look at this first test that heads into the forest for a loop. This is compared to the new Suunto Race, and Garmin Epix Pro. Here’s that data at a high level, which <a href=\"https://analyze.dcrainmaker.com/#/public/b491f1cd-b897-46b6-7760-3da4821f321c\">looks pretty similar at first</a>:</p>\n<p><img title=\"V3-AccuracyGPS-1.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-1-1.png\" alt=\"V3 AccuracyGPS 1\" width=\"719\" height=\"456\" /></p>\n<p>And indeed, as I meander around the forest, the three units are largely very very close, with the Suunto Race making a few minor quirky errors initially:</p>\n<p><img title=\"V3-AccuracyGPS-2.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-2-1.png\" alt=\"V3 AccuracyGPS 2\" width=\"719\" height=\"454\" /></p>\n<p>And then trading places with the Polar Vantage V3 making a few minor errors:</p>\n<p><img title=\"V3-AccuracyGPS-3.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-3-1.png\" alt=\"V3 AccuracyGPS 3\" width=\"719\" height=\"455\" /></p>\n<p>Again, these are pretty minor, so let’s move along to something more interesting.</p>\n<p>This next one I’ve got a couple hour hike/trail run in areas that are occasionally forested, and occasionally open, along with some occasional cliffs. As long as I don’t fall off said cliffs into said trees, it’s all good. Oh, and I started from town where there are some taller hotel buildings, but nothing of major consequence. <a href=\"https://analyze.dcrainmaker.com/#/public/8b9edcf5-5196-4fc8-4651-bbd1e0d8d75b\">Here’s the data and overview</a>:</p>\n<p><img title=\"V3-AccuracyGPS-4.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-4-1.png\" alt=\"V3 AccuracyGPS 4\" width=\"719\" height=\"455\" /></p>\n<p>If I scroll around a bunch, I don’t see any meaningful difference between the three units (Garmin Epix Pro, Suunto Race, and Polar Vantage V3) – they’re all basically the same:</p>\n<p><img title=\"V3-AccuracyGPS-5.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-5-1.png\" alt=\"V3 AccuracyGPS 5\" width=\"718\" height=\"451\" /></p>\n<p>Here as well:</p>\n<p><img title=\"V3-AccuracyGPS-6.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-6-1.png\" alt=\"V3 AccuracyGPS 6\" width=\"719\" height=\"453\" /></p>\n<p>So, let’s increase the difficulty a boatload, and do a <a href=\"https://analyze.dcrainmaker.com/#/public/82bd0399-ffb6-4f41-4c71-0c584a89d2eb\">bit of a city test</a>. This test is done in virtually every one of my GPS watch reviews in the last few years, and is incredibly difficult to do well. I go up and down the business district streets, with buildings that are 20-30 stories tall, on either side of small streets:</p>\n<p><img title=\"GPS-CityTesting.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/GPS-CityTesting.jpg\" alt=\"GPS CityTesting\" width=\"719\" height=\"443\" /></p>\n<p>For some streets I run directly down the middle of the street (when able), and for others, if I have to be on the sidewalk, I vary which side of the street I’m on halfway down the street, so that no one side is favored. In general, a ‘great’ watch on this test will still struggle a bit. Whereas a ‘bad’ watch will look like a toddler’s drawing.</p>\n<p>Starting at a high level, here’s how things looked for the entire (larger) route, which includes numerous underpasses/tunnels, and more.</p>\n<p><img title=\"V3-AccuracyGPS-7.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-7-2.png\" alt=\"V3 AccuracyGPS 7\" width=\"719\" height=\"476\" /></p>\n<p>Starting with the non-complicated parts of this course, along the river and such. Here it’s all good. No real issues from the Vantage V3 or Suunto Race.</p>\n<p><img title=\"V3-AccuracyGPS-8.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-8-1.png\" alt=\"V3 AccuracyGPS 8\" width=\"719\" height=\"476\" /></p>\n<p>We do see a few somewhat minor errors/offsets with the Vantage V3 as it rounds some of these corners and goes under the massive highway/train/etc overpasses. Along with this section a bit later under another tunnel and near some buildings:</p>\n<p><img title=\"V3-AccuracyGPS-9.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-9-1.png\" alt=\"V3 AccuracyGPS 9\" width=\"340\" height=\"225\" /> <img title=\"V3-AccuracyGPS-10.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-10-1.png\" alt=\"V3 AccuracyGPS 10\" width=\"340\" height=\"225\" /></p>\n<p>But, we’re here for big-ass buildings, not big-ass highways. And thus, we arrive at the section that GPS devices wince at:</p>\n<p><img title=\"V3-AccuracyGPS-11.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-11.png\" alt=\"V3 AccuracyGPS 11\" width=\"719\" height=\"476\" /></p>\n<p>Here you can see the Polar Vantage V3 struggles the most of the three, offset by the largest amount. The COROS Pace 3 and Suunto Race both actually did quite well here. The Garmin Forerunner 965 did ‘fine’ here, albeit it was in auto-select mode, so perhaps it didn’t scale up to multi-band fast enough. Maybe some day when I’m bored I’ll run this section a bunch repeatedly with two Forerunner 965s concurrently and see how they might differ precisely in the two modes. Overall, for this one section, I’d say the COROS Pace 3 actually stuck the landing the best (like the Forerunner 965, it’s actually done this test a few times over the last few months, and this is by far its best performance, it’s had some other so-so results as well…such is life).</p>\n<p>In any event the rest of that particular test was mostly uneventful. A few tunnels that it skipped a beat on, but nothing major.</p>\n<p>Next, let’s look at the 58KM hike that I did. Albeit, due to the crashes in the Polar Vantage V3 it only recorded the last 8hrs worth (as it lost data from the first 4hrs). Nonetheless, there’s plenty of spicy mountain terrain in that to look at. Here it’s compared against the Suunto Race, Garmin Forerunner 965, and COROS Pace 3. <a href=\"https://analyze.dcrainmaker.com/#/public/9bed4f85-0ffd-4d11-4b8a-a9f0449fec3d\">The quick overview here</a>:</p>\n<p><img title=\"V3-AccuracyGPS-12.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-12.png\" alt=\"V3 AccuracyGPS 12\" width=\"719\" height=\"471\" /></p>\n<p>Looking at the section after the last crash, it took a few minutes to stabilize, but then it seemed to more or less be the same as others here in the woods alongside the cliffs:</p>\n<p><img title=\"V3-AccuracyGPS-13.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-13.png\" alt=\"V3 AccuracyGPS 13\" width=\"719\" height=\"477\" /></p>\n<p>Due to the trail being overgrown beyond passibility, I had to divert for a bit onto the Sa Calobra road to get up over the mountain pass. During this section, all four watches seemed to handle just fine:</p>\n<p><img title=\"V3-AccuracyGPS-14.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-14.png\" alt=\"V3 AccuracyGPS 14\" width=\"719\" height=\"470\" /></p>\n<p>Once back on the mountain trail, I didn’t see any issues – it was solid throughout all of this long traverse into the stiff headwinds:</p>\n<p><img title=\"V3-AccuracyGPS-15.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-15.png\" alt=\"V3 AccuracyGPS 15\" width=\"719\" height=\"478\" /></p>\n<p>There were actually very few moments where the four disagreed, such as this steep descent in deep woods alongside cliffs, where the COROS Pace 3 seems a bit offset from the others, but not that meaningful in the context here.</p>\n<p><img title=\"V3-AccuracyGPS-16.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-16.png\" alt=\"V3 AccuracyGPS 16\" width=\"340\" height=\"224\" /> <img title=\"V3-AccuracyGPS-17.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-17.png\" alt=\"V3 AccuracyGPS 17\" width=\"340\" height=\"221\" /></p>\n<p>Oh, and if I look at elevation here, here’s that chart (again, remember the Polar data on this chart starts about 4hrs in). We can see it’s very very close, though, in the last hour it very slightly drifts apart (with the COROS Pace 3), to be incorrectly 20 meters high (I ended at the water’s edge). But up in the mountains despite the shifting temps and pressure from day to night, it handled well.</p>\n<p><img title=\"V3-AccuracyGPS-Elevation.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-Elevation.png\" alt=\"V3 AccuracyGPS Elevation\" width=\"719\" height=\"290\" /></p>\n<p>So, what about open-water swimming? No problem, ask and you shall receive. On the left wrist the Polar Vantage V3, and on the right wrist the Suunto Race. Then a swim buoy with me (dragging along) with another GPS for reference. Here’s that data:</p>\n<p><img title=\"V3-AccuracyGPS-18Swim.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyGPS-18Swim.png\" alt=\"V3 AccuracyGPS 18Swim\" width=\"720\" height=\"455\" /></p>\n<p>As you can pretty easily see, it was near-identical to the swim-buoy reference track, which is great to see. Not much more to say about that, when things work well!</p>\n<p>Overall, when it comes to GPS accuracy, the Polar’s multiband/dual-frequency implementation on the Vantage V3 is much better than their first go on the Polar Ignite 3 a year ago. This is almost certainly due to better antenna design, plus smaller lessons learned since then. On the whole, the accuracy ranged from perfectly fine, to very good. There were a few cases where it struggled, such as the city test (as most units do, to some degree). As well as a few other times where the accuracy was so-so.</p>\n<p>If I look at a scale/range of accuracy across various brands ‘best’ options (in a multiband config), I’d say Polar is mostly slotting in just barely/slightly above COROS, but not quite as good as Garmin/Apple/Suunto (for land-based activities). But for almost all use cases, it does more than well enough to know where you are, and where you went.</p>\n<p><em>(Note: All of the charts in these accuracy sections were created using the DCR Analyzer tool. It allows you to compare power meters/trainers, heart rate, cadence, speed/pace, GPS tracks, and plenty more. You can use it as well for your own gadget comparisons, <a href=\"http://www.dcrainmaker.com/analyzer\">more details here</a>.)</em></p>\n<h3><span><strong>Heart Rate Rate Accuracy:</strong></span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/P1099786_thumb.jpg\" /></p>\n<p>Next, we’ve got accuracy of the optical HR sensor during workouts. In this case, I’m going to look at a variety of workouts to see how it handles. In this case I’m comparing it to other optical heart rate sensors as well as a validated/trusted chest strap to determine accuracy.</p>\n<p>You can click on any of the links to see the full original data set files, zoom in, do your own analysis etc. I include these so you can see I’m not cherry-picking any data portions – the full workouts are there, from start to finish.</p>\n<p>First up, we’ve got an indoor trainer (cycling) workout that starts off with some short intense intervals, before going into some longer/harder intervals. Here it’s compared against a chest strap (Garmin HRM-PRO Plus), the Suunto Race (optical HR watch), and the Whoop 4.0 strap (bicep band). That <a href=\"https://analyze.dcrainmaker.com/#/public/f149c993-1716-4816-48c0-18541e931696\">data set is here</a>:</p>\n<p><img title=\"V3-AccuracyHR-1.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR-1.png\" alt=\"V3 AccuracyHR 1\" width=\"720\" height=\"372\" /></p>\n<p>You can see that on the whole it’s pretty good, though, does seem to stumble briefly on the first interval. Not in a huge way, but just slightly notable. After that, it seems fine.</p>\n<p>So, let’s look at another indoor trainer workout, from last night. This one was more steady-state than interval, and thus should have been easier for the sensor to follow. I only threw in a few half-hearted sprints for fun. Here’s <a href=\"https://analyze.dcrainmaker.com/#/public/3abe1afb-32cc-4fad-587a-322dc4ab669c\">that data set</a>:</p>\n<p><img title=\"V3-AccuracyHR-2.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR-2.png\" alt=\"V3 AccuracyHR 2\" width=\"719\" height=\"374\" /></p>\n<p>This one is weird. As I noted, this should have been a piece of cake, but both the Polar Vantage V3 and Suunto Race struggled here in the first 12 minutes or so with many little drops/inconsistencies. These were variations of about 10-12bpm, which is pretty high to be off. While being wrong is par for the course on the Suunto Race optical HR sensor, it’s also a pattern that’s more hit or miss on the Polar Vantage V3. You can see these errors here:</p>\n<p><img title=\"V3-AccuracyHR-3.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR-3.png\" alt=\"V3 AccuracyHR 3\" width=\"720\" height=\"379\" /></p>\n<p>Again, these aren’t horrific in the grand scheme of things, but it’s not industry-leading (or in that ballpark).</p>\n<p>It’s a pattern I’d see on other workouts over the last little while as well. Take for example this next trainer workout (don’t worry, we’ll get to other sports, but this is theoretically the easiest sport type, and it’s struggling here). Here you can see that for the main (painful) intervals, it’s spot-on. Very well done. But, for the initial warm-up, it struggles a bit, albeit in this case, only for about 6-8 minutes. Here’s that <a href=\"https://analyze.dcrainmaker.com/#/public/48e3e034-4e6e-43d5-4a97-6950beb3d0cc\">data set.</a></p>\n<p><img title=\"V3-AccuracyHR4.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR4.png\" alt=\"V3 AccuracyHR4\" width=\"718\" height=\"386\" /></p>\n<p>Ok, so let’s look at a run. Here’s one from this past Saturday, where I was relatively easy-pace as the base of the run, and then every 2KM I’d do a 2-minute long tempo section. Not a hard sprint/interval, just I’d increase the pace to about 10KM-race pace. Here’s <a href=\"https://analyze.dcrainmaker.com/#/public/82bd0399-ffb6-4f41-4c71-0c584a89d2eb\">that data set</a>:</p>\n<p><img title=\"V3-AccuracyHR5.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR5.png\" alt=\"V3 AccuracyHR5\" width=\"719\" height=\"372\" /></p>\n<p>As you can see, results from either the Vantage V3 or Suunto Race were not good. There’s no two ways about it, and frankly, this result puzzles me the most. Again, the Suunto Race is generally not good, so that doesn’t surprise me. But the Polar Vantage V3 shouldn’t have had this much trouble. This was a very straightforward stable run in the rain. The rough pattern here appears to be the start of each tempo section when it would lose the plot, which almost indicates cadence-lock issues (when an optical HR sensor locks to the pounding of your feet). But in this case, it doesn’t match cadence, but just loses it entirely (usually cadence-lock would go high, not low).</p>\n<p>For contrast, check out this hard interval workout I did on the treadmill. In this case, the Polar Vantage V3 easily nailed this. Zero problems. It’s beautiful…stunning – near perfect match to the chest strap, with only a few seconds delay that we often see with optical heart rate sensors. <a href=\"https://analyze.dcrainmaker.com/#/public/08a32392-d953-44f1-65b4-b55045253c4c\">No biggie here, all is good</a>.</p>\n<p><img title=\"V3-AccuracyHR-6.png\" src=\"https://media.dcrainmaker.com/images/2023/11/V3-AccuracyHR-6.png\" alt=\"V3 AccuracyHR 6\" width=\"718\" height=\"369\" /></p>\n<p>How can it be so good one moment, and so off the next?</p>\n<p>In fact, now that I look at the dates – the only pattern I can seem to find here is actually just that: The dates. Specifically, the difference between one firmware version and the next. Everything on the current firmware version (V1.19) is struggling. Whereas everything on the previous versions is largely pretty solid. The only exception to that observation is the ultra-long hike. For some portions of the hike the data is spot-on, yet for a handful of portions, it’s wobbly. The only problem is that on that specific hike, I wasn’t focused on heart rate accuracy, mainly because I was doing things like eating or drinking while hiking – which would impact optical HR accuracy if my wrist was held up for sustained periods. Hence why I won’t dig into those files here (they are linked in the GPS section, where it doesn’t impact that).</p>\n<p>In any event, overall, the optical HR sensor accuracy here is concerning. Mainly because it seems so hit or miss, both within a workout (even more recent workouts) as well as from workout to workout. I suspect something has changed in the current firmware version, perhaps to save battery (by reducing power to the optical HR sensor), or perhaps something entirely unrelated. Either way, the current state isn’t ideal.</p>\n<h3><span><strong>Going Forward:</strong></span></h3>\n<p><img title=\"DSC_9171.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9171.jpg\" alt=\"DSC 9171\" width=\"720\" height=\"480\" /></p>\n<p>As I started out this review, the Polar Vantage V3 is arguably the most important product for Polar and their success going forward. And on the surface, they’re off to a good start in terms of hardware that seems capable of delivering that success. The external hardware is sleek, and in my opinion, quite nice looking. The display is brilliantly bright and easy to read, and the buttons easy to use with an interface that doesn’t feel laggy. It’s easily Polar’s best hardware to date.</p>\n<p>The addition of maps is well done for a first go at things, better than some others have done on their first shot at it. Having two detail levels is actually kinda handy, and while they didn’t put WiFi in there for downloading maps without a computer, they made it so easy to download it’s not a huge deal at this point for most people. As noted above, there’s some substantial quirks around the display of routes and/or current track on maps (or lack thereof), but I see those as actually very easy to fix issues. I’m not that concerned about that long-term, I suspect those will be sorted in very short order.</p>\n<p>Further, while I outlined above the crashes and loss of data, I suspect Polar will sort those out too. Probably quickly – they have all my log/debug data to likely figure them out efficiently. Instead, what I’m actually concerned about is the mixed bag of accuracy on the optical heart rate sensor. The fact that one workout it’s spot-on, and the next way-off is most concerning. As is the fact that sometimes it’s just so-so accurate. Specifically, the part that worries me is I can’t figure out what the pattern is that causes it to be good or bad. Usually with optical HR sensors, I know what will cause optical heart rate failures (e.g., cadence lock while running downhill, or sprints, or outdoor road cycling on road with vibrations, or certain strength workouts). But in this case, it’ll nail a hard running interval workout, then fail on an easy run. Or, it’ll wobble on an indoor trainer workout (which should be easy to track). For the last few years, Polar has had issues with their optical HR sensors being less accurate than ones of prior. What I don’t know with this sensor is whether it’s an algorithm thing, or a hardware thing. What I do know is that when it comes to these errors, neither are ever quick fixes. They never are, by any company – even if software.</p>\n<p>All of which somewhat sets aside the price/features conversation. I know some people don’t like to talk about price/features, but anyone who ignores it is ignoring reality. When Suunto launched the also-AMOLED Suunto Race the same day as Polar, but at $150 cheaper, it substantially undercut Polar’s party. Sure, there are slight material differences, but not meaningfully so. Suunto’s optical heart rate is worse than Polar’s, but Suunto does seem to make up for it with better navigation/tracking features and better training load/recovery metrics (which can still leverage an external chest strap like Polar). And of course, Polar is also trying to go up against Garmin’s Forerunner 965 at the same price point. All of which puts the $599 Polar Vantage V3 in dangerous territory.</p>\n<p>So, ultimately, Polar needs to take a page from their own playbook: Clearly outlining the future of the Polar Vantage V3 in terms of upcoming features. They need to do as they’ve done in the past and outline the next 3-6 months’ worth of planned updates for the watch, to give prospective buyers reason to jump in now. And look, that’s not giving their competitors any advantage – they’ve already got that (and those features). Instead, it’s giving buyers a reason to invest in the Comeback Kid.</p>\n<p>With that, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"1aaf9d69a6686760ae099b4be0f73b032ef3ecd71f7ef2145687ce6720d0ad46","category":"Cycling"}