{"title":"Quercetin alleviates 6-OHDA-caused apoptosis in SH-SY5Y cells","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae117/7725700?rss=1","date":1722556800000,"content":"<span><div>Abstract</div><div>Aim</div>This study is primarily designed to investigate the potential neuroprotective effects of polyphenol against 6-OHDAcaused neurotoxicity on SH-SY5Y cells.<div>Materials and Methods</div>Cytotoxic effect of 6-OHDA and valuable role of quercetin, myricetin and kaempferol on SH-SY5Y cells were analyzed by MTT assay. Generation of 6-OHDA-stimulated reactive oxygen species (ROS) was measured using DCFDA fluorescence dye. Alteration of 6-OHDA-caused mitochondrial membrane potential and nuclear condensation was investigated with the help of rhodamine-123 and hoechest stain. Immunoblotting was performed to detect the expression level of 6-OHDA-caused alpha-synuclein (á-syn), Bcl-2 associated protein X (BAX), caspase 3, cleaved Poly ADP – ribose polymerase (PARP) and Bcell lymphoma 2 proteins (Bcl-2).<div>Result</div>Through MTT assay, quercetin was selected over myricetin and kaempferol to counter 6-OHDA-caused cell death. The research delves into unraveling the intricate mechanisms underlying 6-OHDA-induced neurotoxicity, encompassing alterations in cellular morphology, escalation of oxidative stress, perturbation in mitochondrial membrane potential, and nuclear condensation. Exposure to 6-OHDA is implicated in the upregulation of á-syn protein, contributing to the aggravation of neurotoxicity. Concurrently, 6-OHDA orchestrates the apoptotic pathway by upregulating the expression of proapoptotic proteins such as BAX, caspase 3, and PARP, while down regulating the expression of the Bcl-2, affirming its role in apoptosis induction. Quercetin demonstrated ability to attenuate the expression of á-syn in the presence of 6-OHDA-caused injury in SH-SY5Y cells.<div>Conclusion</div>Taken together, these findings collectively underscore the therapeutic potential of quercetin as a promising agent against neurotoxicity caused by 6-OHDA.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"1abbe33477f53906c7ddc3460d5477d9ec9e180922866d508a470b4ff3308505","category":"Environment"}