{"title":"Protective Effect of Hibifolin on Lipopolysaccharide‐Induced Acute Lung Injury Through Akt Phosphorylation and NFκB Pathway","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24383?af=R","date":1723197161000,"content":"<h2>ABSTRACT</h2>\n<p>Acute lung injury (ALI) is a difficult condition to manage, especially when it is complicated by bacterial sepsis. Hibifolin, a flavonoid glycoside, has anti-inflammatory properties that make it a potential treatment for ALI. However, more research is needed to determine its effectiveness in LPS-induced ALI. In this study, male ICR mice were treated with hibifolin before LPS-induced ALI. Protein content and neutrophil count in bronchoalveolar lavage (BAL) fluid were measured by BCA assay and Giemsa staining method, respectively. The levels of proinflammatory cytokines and adhesive molecules were detected by ELISA assay. The expression of NFκB p65 phosphorylation, IκB degradation, and Akt phosphorylation was assessed by western blot assay. Hibifolin pre-treatment significantly reduced pulmonary vascular barrier dysfunction and neutrophil infiltration into the BAL fluid in LPS-induced ALI mice. In addition, LPS-induced expression of proinflammatory cytokines (IL-1β, IL-6, TNF-α) and adhesive molecules (ICAM-1, VCAM-1) within the BAL fluid were markedly reduced by hibifolin in LPS-induced ALI mice. More, hibifolin inhibited LPS-induced phosphorylation of NFκB p65, degradation of IκB, and phosphorylation of Akt in lungs with ALI mice. In conclusion, hibifolin shows promise in improving the pathophysiological features and proinflammatory responses of LPS-induced ALI in mice through the NFκB pathway and its upstream factor, Akt phosphorylation.</p>","author":"Yan‐Yan Ng, \nYung‐Chuan Ho, \nChi‐Hua Yen, \nShiuan‐Shinn Lee, \nChing‐Chi Tseng, \nSheng‐Wen Wu, \nYu‐Hsiang Kuan","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"1ac4915f5d97d47572cfbea53e6c609552883735d19c4099d02db00f24f8d8eb","category":"Environment"}