{"title":"Barriers to care for dependent older adults: Brazilian Primary Health Care managers’ perspective","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309309","date":1728482400000,"content":"<p>by Jonas Loiola Gonçalves, Raimunda Magalhães da Silva, Girliani Silva de Sousa, Indara Cavalcante Bezerra, Christina César Praça Brasil, Luiza Jane Eyre de Souza Vieira, Fernanda Colares de Borba Netto, José Maria Ximenes Guimarães, Maria Cecilia de Souza Minayo</p>\r\n\r\nThis study analyzes the perspective of 16 managers from different Brazilian regions about the barriers to adequate care for dependent older adults in Brazilian PHC. This qualitative approach is anchored in the hermeneutic-dialectic theoretical framework. It builds on the principle that aging has different epidemiological rhythms and multiple specific demands from older adults’ biopsychosocial changes. We highlighted several challenges to health services, since family, educational, organizational, and social contexts are fragmented. The 16 managers were selected by convenience from June to September 2019. They interacted individually in a semi-structured interview lasting approximately 30 minutes. The interviews were transcribed in full, and data were organized into four empirically selected themes: barriers due to dependent older adults’ family care problems; lack of priority in PHC scheduling; failure in recruiting and training professionals; and lack of a specific public policy. The results indicated weakened families regarding lack of training and overload, especially female caregivers in care routine. Managers recognize the repeated comings and goings and searching for PHC access, highlighting insufficient primary services to organize care. Noteworthy is that high population demand exacerbates inadequate coverage, since lack of professionals with adequate training, priority on the agenda of services, and a public support policy to meet this population’s needs fragment healthcare. Thus, it is essential to remedy the barriers recognized by managers by training more experts and qualifying professionals in the service. Society must recognize the stages of aging and support families, especially those most socially needy. The health sector at the Primary Care level has much to contribute to ensuring social protection and healthy longevity for Brazilians.","author":"Jonas Loiola Gonçalves","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1ac6ee9f400f2e0b0061d88e09527f0eb3f172508964aff8ae597cb832228c06","category":"Interdisciplinary"}