{"title":"Correlations between Selected Blood Markers of Hematological Profile and Milk Components in Dairy Cows","link":"https://www.preprints.org/manuscript/202405.1813/v1","date":1716882438000,"content":"Clinical and laboratory diagnostics are particularly important in monitoring the internal homeostasis of the body in high-yielding animals, especially in dairy cows, whose metabolism is under constant pressure to obtain high parameters of milk production and reproduction. Knowledge of laboratory test results and relationships based on significant correlations between various milk and blood parameters may be very useful in veterinary diagnostics and helpful in cattle practice in order to protect animal health and the quality of milk production. The aim of the study was to analyze the correlation between selected hematological biomarkers such as white blood corpuscles (WBC), red blood corpuscles (RBC), hemoglobin concentration (HGB), hematocrit (HCT), platelets (PLT), erythrocyte mean corpuscular volume (MCV), mean corpuscular hemoglobin content (MHC), mean corpuscular hemoglobin concentration (MCHC) and selected quantitative-qualitative parameters of cow’s milk such as current milk production, somatic cells count (SCC), colony of bacteria forming units (CFU), milk fat (MF), milk protein (MP), milk lactose (ML), milk solids (S), solids non-fat in milk (SNF), daily milk production. Samples were collected three times at daily intervals from 11 clinically healthy late-lactation dairy cows obtaining 33 sets of test results. This repeated study of cows allowed for obtaining a homogeneous group in order to determine statistical correlations between selected blood and milk parameters. Many significant correlations were found between the examined parameters. In cows, significant positive correlations were recorded between milk production and HGB, HCT, MCV or MHC. Significant negative correlations were also found between SCC and HGB, SCC and HCT, SNF and MCV, SNF and MHC, and between MF and RBC.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1ac6a2049de8b6882a9fec0326d0086d8ca2ef55cdf5b1668ec03e3b2114a7b5","category":"Interdisciplinary"}