{"title":"Development and validation of near‐infrared spectroscopy procedures for prediction of cassava root dry matter and amylose contents in Ugandan cassava germplasm","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.12966?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Cassava utilization for food and/or industrial products depends on inherent properties of root dry matter content (DMC) and the starch fraction of amylose content (AC). Accordingly, in the present study, near-infrared reflectance spectroscopy (NIRS) models were developed to aid breeding and selection of DMC and AC as critical industrial traits taking care of root sample preparation and cassava germplasm diversity available in Uganda.</p>\n<h2>RESULTS</h2>\n<p>Upon undertaking calibrations and cross-validations, best models were adopted for validation. DMC in calibration samples ranged from 20 to 45 g 100g<sup>−1</sup>, whereas, for amylose content, it ranged from 14 to 33 g 100g<sup>−1</sup>. In the validation set, average DMC was 29.5 g 100g<sup>−1</sup>, whereas, for amylose content, it was 24.64 g 100g<sup>−1</sup>. For DMC, a modified partial least square regression model had regression coefficients (<i>R</i>\n<sup>2</sup>) of 0.98 and 0.96, respectively, in the calibration and validation set. These were also associated with low bias (−0.018) and ratio of performance deviation that ranged from 4.7 to 5.0. In addition, standard error of prediction values ranged from 0.9 g 100g<sup>−1</sup> to 1.06 g 100g<sup>−1</sup>. For AC, the regression coefficient was 0.91 for the calibration set and 0.94 for the validation set. A bias equivalent to −0.03 and a ratio of performance deviation of 4.23 were observed.</p>\n<h2>CONCLUSION</h2>\n<p>These findings confirm the robustness of NIRS in the estimation of dry matter content and amylose content in cassava roots and thus justify its use in routine cassava breeding operations. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Ephraim Nuwamanya, \nEnoch Wembabazi, \nMichael Kanaabi, \nFatumah Babirye Namakula, \nArnold Katungisa, \nIvan Lyatumi, \nWilliams Esuma, \nEmmanuel Oladeji Alamu, \nDominique Dufour, \nRobert Kawuki, \nFabrice Davrieux","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"1acc1a2f73585c004c2bb086a60894b2292da1114dfdaf112a6be6f752b60a59","category":"Environment"}