{"title":"German chemists identified over 7,700 different chemical formulas in beers","link":"https://arstechnica.com/?p=1787854","date":1629239448000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/beerTOP-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/beerTOP.jpg\">Enlarge</a> <span>/</span> German chemists combined two complementary mass spectrometry techniques to analyze 467 different commercial beers from around the world. (credit: <a href=\"https://www.gettyimages.com/search/photographer?family=creative&amp;photographer=Natasha+Breen\">Natasha Breen/Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>People have been brewing beer for millennia, and the basic chemistry of fermentation is well understood. But thanks to advanced analytical techniques, scientists continue to learn more about the many different chemical compounds that contribute to the flavor and aroma of different kinds of beer. The latest such analysis comes courtesy of a team of German scientists who analyzed over 400 commercial beers from 40 countries. The scientists identified at least 7,700 different chemical formulas and tens of thousands of unique molecules, according to <a href=\"https://www.frontiersin.org/articles/10.3389/fchem.2021.715372/full\">a recent paper</a> published in the journal Frontiers in Chemistry. And they did it with a new approach that can analyze a sample in just 10 minutes.</p>\n<p>\"Beer is an example of enormous chemical complexity,\" <a href=\"https://blog.frontiersin.org/2021/08/10/frontiers-chemistry-chemical-complexity-beer-metabolomics/\">said co-author Philippe Schmitt-Kopplin</a> of the Technical University of Munich and the Helmholtz Center in Munich. \"And thanks to recent improvements in analytical chemistry, comparable in power to the ongoing revolution in the technology of video displays with ever-increasing resolution, we can reveal this complexity in unprecedented detail. Today it's easy to trace tiny variations in chemistry throughout the food production process, to safeguard quality or to detect hidden adulterations.\"</p>\n<p>As <a href=\"https://arstechnica.com/science/2019/01/want-to-keep-that-strong-hoppy-flavor-store-craft-beer-in-cool-place/\">I've written previously</a>, all <a href=\"https://arstechnica.com/science/2018/10/how-to-get-that-great-hoppy-beer-taste-without-the-exploding-bottles/\">beer contains hops</a>, a key flavoring agent that also imparts useful antimicrobial properties. To make beer, brewers mash and steep grain in hot water, which converts all that starch into sugars. This is traditionally the stage when hops are added to the liquid extract (wort) and boiled. That turns some of the resins (alpha acids) in the hops into iso-alpha acids, producing beer's hint of bitterness. Yeast is then added to trigger fermentation, turning the sugars into alcohol. Some craft brewers prefer dry-hopping—hops are added during or after the fermentation stage, after the wort has cooled. They do this as a way to enhance the hoppy flavors without getting excessive bitterness, since there is no isomerization of the alpha acids.</p></div><p><a href=\"https://arstechnica.com/?p=1787854#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1787854&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1acf067779c37407c053573add2005adefeec987ff481b7b05581a6b9c30e7d7","category":"Tech"}