{"title":"Non-linear trends using the generalized additive models in physical and technical performances of the Chinese Super League players","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307843","date":1722002400000,"content":"<p>by Wei Zhang, Rancheng Tao, Fei Zhou, Changjing Zhou, Bo Gong</p>\r\n\r\nThis study aimed to investigate the non-linear evolution of position-specific physical and technical performance indicators across different tactical formations in the Chinese Super League (CSL) from the 2015 to the 2021 seasons. Match data were collected from 800 games played in six common formations (3-5-2, 4-3-3, 4-2-3-1, 4-4-2, 3-4-3, and 4-1-4-1). Players were classified into five positions: central defenders (CD; match observations = 2,219), fullbacks (FB; match observations = 2,060), central midfielders (CM; match observations = 2,786), wide midfielders (WM; match observations = 1,587), and forwards (FW; match observations = 1,680). Generalized additive models (GAMs) were constructed to analyze the nonlinear evolution trends in position-specific physical and technical performance across seasons and formations. The results showed that the total distance covered by CDs in the 3-5-2 formation showed a non-linear upward trend from the 2015 to 2021 seasons (R<sup>2</sup> = 0.3, <i>p</i> = 0.006); FBs in the 3-4-3, 4-1-4-1, and 3-5-2 formations exhibited non-linear upward trends in number of sprints and sprint distance from the 2015 to 2021 seasons (R<sup>2</sup> = 0.189–0.448; <i>P</i> &lt; 0.03, respectively); the high-speed running of FWs in the 4-2-3-1 formation displayed a non-linear decline trend from the 2015 to 2021 seasons (R<sup>2</sup> = 0.477; <i>P</i> &lt; 0.001); CMs in the 4-2-3-1 formation demonstrated a non-linear increasing trend in the ball retention percentage (R<sup>2</sup> = 0.369; <i>p</i> = 0.001); WMs in the 4-4-2 formation showed a non-linear decreasing trend in ball retention percentage and passes from the 2015 to 2021 seasons (R<sup>2</sup> = 0.259–0.29; <i>P</i> = 0.006, respectively). These findings revealed non-linear evolutionary trends in physical and technical performances across positions and formations, providing an in-depth understanding of the changing match demands placed on players during matches. This enables the optimization of training and tactics by developing targeted strategies tailored to meet the specific requirements of different formations and playing positions.","author":"Wei Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1ad13eb6ea8312b5a130d394dea679c0f7499430bf15b1b5e63e4f209c9fea5e","category":"Interdisciplinary"}