{"title":"Tom Dumoulin’s season is over after he was hit by a driver during a ride","link":"https://cyclingtips.com/2021/09/tom-dumoulins-season-is-over-after-he-was-hit-by-a-driver-during-a-ride/","date":1631227075000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/tdumoulin-650x426.jpg\" /></div><h2>Tom Dumoulin's season is over after he was hit by a driver during a ride</h2><p>\n</p><p>Tom Dumoulin was hit by a driver while out on a training ride on Thursday, suffering a broken wrist that will require surgery, Jumbo-Visma has announced.</p>\n\n\n\n<p>The incident has effectively ended a 2021 season that saw him <a href=\"https://cyclingtips.com/2021/01/tom-dumoulin-will-take-a-break-from-racing/\" target=\"_blank\">take a break</a> from racing early on in the year but return to ride to a Dutch national time trial title and a silver medal in the time trial event at the Tokyo Olympics. He will now miss what had been planned starts at the upcoming World Championships and Il Lombardia, among other events.</p>\n\n\n\n<p>“This is a big disappointment,” the 30-year-old Dutchman said via a team press release. “My season is finished. That’s a big deception, because I just got really good at it again. Also, during the training today I felt really strong. I had a lot of confidence that I could ride a very strong month.”</p>\n\n\n\n<p>According to Jumbo-Visma, Dumoulin had been reconning the course for his Tour de Dumoulin event when “he was hit by a turning car, after which he ended up on the road surface through the hood.”</p>\n\n\n\n<p>He will now undergo surgery on Friday.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/tom-dumoulins-season-is-over-after-he-was-hit-by-a-driver-during-a-ride/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1ad10c88a31ca45a94667c2c4ce1e90ce2af7858fbe695309f0803be66fb2262","category":"Cycling"}