{"title":"18 Effect of precision feeding standardized ileal digestible lysine to lactating sows compared with conventional feeding strategies in a commercial farm","link":"https://academic.oup.com/jas/article/102/Supplement_2/63/7664768?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>A total of 728 sows and litters were used in a 19-d lactation study to evaluate effects of precision feeding SID Lys and other amino acids on sow and litter performance and feed cost in a commercial farm. Sows were blocked by parity and allotted to 1 of 2 treatments at entry into farrowing. Treatments consisted of a control diet or a feed blending curve. Two diets were used to create treatment curves, a low Lys diet (0.60% SID Lys) or a high Lys diet (1.07% SID Lys). Sows on the control treatment were fed only the high Lys diet and sows on the blend curve were fed a blend of the low and high Lys diets using the Gestal Quattro Opti Feeder (Jyga Technologies, St-Lambert-de-Lauzon, Quebec, Canada) to target a specific Lys intake/d. Lysine intake targets were based on the NRC (2012) model requirements, except targets were increased by 20% to reach average Lys intake of approximately 63 g/d. The blend of the low and high Lys diet was adjusted on d 7 and 14 for sows fed the blend curve in an attempt to reach target Lys intake. Average Lys intake was 87% of target Lys intake because feed intake was lower than predicted. Sows fed the control diet had greater (<span>P</span> &lt; 0.001; 72.0 vs 54.8 g/d) Lys intake compared with sows on blend curves because they were fed only the high Lys diet (Table). No differences (<span>P</span> &gt; 0.05) in body weight (BW), backfat, loin depth, caliper score, or average daily feed intake (ADFI) were observed. There were no differences (<span>P</span> &gt; 0.05) in litter size at d 2 after equalization or weaning; however, piglets and litters from sows fed the control treatment tended to have greater weaning weights (<span>P</span> = 0.090) and average daily gain (ADG; <span>P</span> = 0.071) compared with piglets and litters from sows fed the blend curve, likely due to insufficient Lys intake for sows on the blend curve to maximize litter growth performance. Feed cost per sow was less (<span>P</span> &lt; 0.05) for sows fed the blend curve in both a low and high ingredient price scenario. No differences (<span>P</span> &gt; 0.05) in feed cost per kg of litter weight gain were observed; however, feed cost per weaned pig was less (<span>P</span> &lt; 0.05) for sows on the blend treatment. Serum urea nitrogen was greater (<span>P</span> &lt; 0.05) at weaning compared with d 10 for control fed sows and was greater (<span>P</span> &lt; 0.05) than blend-fed sows at both time points. Sows fed the control diet had greater milk crude protein (<span>P</span> = 0.05) compared with sows fed the blend curve. While precision feeding sows using diet blending during lactation can be used to reduce feed cost, future research should focus on using technology to automatically adjust diet blend for low or high-feed intake sows to avoid the over or under-feeding of nutrients.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1adebcf9329aacb2c16e2925ae7c70d0d7e7b56dc169c399701275a60ff8d12e","category":"Environment"}