{"title":"Tour de Suisse 2023: all the essential info","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-suisse-all-the-essential-info","date":1685978182000,"content":"\n      \n<p><span><strong>Date:</strong> </span><span>Sunday June 11, 2023 - Sunday June 18, 2023 <br /></span><strong>Start:</strong><span> Einsiedeln <br /></span><span><strong>Finish:</strong> </span><span>Abtwil  <br /></span><span><strong>Total distance:</strong> </span><span>1,097km<br /></span><strong>Stages:</strong><span> Eight<br /></span><strong>Teams:</strong><span> 22<br /></span><span><strong>Defending champion:</strong> </span><span>Geraint Thomas (Ineos Grenadiers) </span></p>\n<p><span>This year’s edition of the Tour de Suisse will be its 84th, having taken place for the first time in 1933. The Swiss Cycling and Motorcycling Federation created the now eight-stage race, but over time, it has evolved in timing, duration and sponsorship. One thing that has always remained the same throughout the race’s history is the iconic mountain passes in the Swiss Alps which the route boasts, attracting the sport’s best climbers to the race. </span></p>\n<div></div>\n<p><span>A spectacle for cycling fans on the roadside or watching on the TV, the landscape in Switzerland provides a picturesque background to the race. In the first edition, over half a million people took to the streets to watch the peloton battle for victory on the Swiss roads. That year, Austrian rider Max Bulla took the overall title. It wasn’t until 1937, four years after the first edition, that a Swiss rider claimed victory on home soil with Karl Litschi. </span></p>\n<p>Unsurprisingly, Swiss riders have had the most success at the Tour de Suisse, winning the stage race 17 times overall. Italy closely follows, having taken the title 16 times, followed by Belgium, who have won it eight times. But there is only one rider holds the title for having won the race four times, and that is Pasquale Fornara, who won the race in 1952, 1954, 1957, and 1958. </p>\n<p>A number of active riders have had great success at the Tour de Suisse, but none more than Peter Sagan. He has won the most stages in the race’s history with 17 stage wins since 2011. The 33-year-old rider has also won the points classification eight times, defending his title from 2011 until 2016 when he came second behind Maximiliano Richeze. The only other rider close to Sagan is the retired Fabian Cancellara, who has 11 stage wins to his name, as do Hugo Koblet and Ferdinand Kübler. Another active rider who has had success in Switzerland is Egan Bernal, who in 2019 became the third youngest rider to win the Tour de Suisse at the age of 22. He then went on to win the Tour de France the same year. </p>\n<p><span>Last year’s winner was Geraint Thomas, but it's unlikely he’ll be back to defend his title having just completed the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>. However, we may catch a glimpse of Tom Pidcock taking aim at a first GC title at the Tour de Suisse as he lines up for the Ineos Grenadiers ahead of the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1403663075.jpg?v=1685710661\" alt=\"Tour de Suisse\" /></span></p>\n<h3><b>Tour de Suisse 2023 teams list: </b></h3>\n<ul>\n<li><span>AG2R Citroën </span></li>\n<li><span>Alpecin-Deceuninck </span></li>\n<li><span>Astana Qazaqstan </span></li>\n<li><span>Bahrain-Victorious</span></li>\n<li><span>Bora-Hansgrohe</span></li>\n<li><span>Cofidis</span></li>\n<li><span>EF Education-EasyPost</span></li>\n<li><span>Groupama-FDJ</span></li>\n<li><span>Ineos Grenadiers</span></li>\n<li><span>Intermarché-Circus-Wanty</span></li>\n<li><span>Jumbo-Visma</span></li>\n<li><span>Movistar</span></li>\n<li><span>Soudal-Quick-Step</span></li>\n<li><span>Team Arkea Samsic</span></li>\n<li><span>Team DSM</span></li>\n<li><span>Jayco Alula</span></li>\n<li><span>Trek-Segafredo</span></li>\n<li><span>UAE Team Emirates</span></li>\n<li><span>Israel-Premier Tech</span></li>\n<li><span>Lotto Dtsny </span></li>\n<li><span>Q36.5 Pro Cycling Team</span></li>\n<li><span>TotalEnergies </span></li>\n<li><span>Tudor Pro Cycling Team </span></li>\n</ul>\n<h3><b>Tour de Suisse 2023 route: </b></h3>\n<p><span>Opening with an individual time trial, the Tour de Suisse begins in Einsiedeln. The 12.7km-long route crosses over and skirts the edges of Sihlsee, Switzerland’s largest reservoir. It’s also pan flat, so there will be nothing too challenging for the riders in the opening stage. However, it will be a key stage for the time trial specialists and GC contenders to pick up some decisive seconds. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/tour_de_suisse_2023_route.png?v=1685710083\" alt=\"Tour de Suisse route 2023\" /></span></p>\n<p><em>Map sourced from the official Tour de Suisse website </em></p>\n<p><span>Stage two is set to be a day for the sprinters with a flat finish in Nottwil. However, over the route there are three classified climbs accumulating to over 1,800 metres of elevation gain. The first challenge comes just under 20km into the race with the Chommle, a 2.9km-long climb at 5.1%. These three climbs will be potential launchpads for any breakaway artists, and the sprinters' teams will have to put in the work to ensure the race stays together. </span></p>\n<p><span>The true Swiss mountains arrive in stage three as the peloton races from Tafers to Villars-sur-Ollon, marking the first summit finish of the race. The first half of the stage is relatively easy going for the riders, but the first climb arrives after 110km, with the Col des Mosses, which is a 6.2km-long ascent at an average gradient of 4.9%. However, the climb is followed by a long, steep descent that takes them to the base of the final climb to Villars-sur-Ollon – a gruelling 9.6km-long climb at an eye-watering 8.1% average gradient. This will be crucial for those aiming for the GC, and they must show no signs of weakness on these challenging climbs. </span></p>\n<p><span>A day of two halves, stage four opens with a flat ride from Monthey to Sion, with the climbs packed into the second half of the race. Featured in this year’s Giro d’Italia, the Tour de Suisse route tackles the Crans Montana, a 13.7km-long climb at 7%. Following that the climbs come in quick succession with a punchy category three climb before another category one climb 20km from the finish. The Dorben is a demanding 19km climb with an average gradient of 4.6%. To reach the finish line, the riders will face a final climb to Leukerbad at high altitude. </span></p>\n<p><span>Stage five is the queen stage of this year’s Tour de Suisse, presenting a truly challenging day for the riders with numerous Alpine passes. Covering 211km, it is not only the longest day in the saddle but also features 4,700 metres of climbing. The peloton will begin by ascending to the highest point of the day with the Furkapass, a 17.2km climb at over 6% gradient, followed by the Oberalppass After a long descent and a few undulations, they will face the 18km-long Alulapass climb, considered to be one of the most beautiful passes in Switzerland. The stage concludes with a technical descent to the finish in La Punt, demanding expert skills from the riders. </span></p>\n<p><span>The longest and perhaps the most difficult start to a stage follows on the sixth day of racing. Straight from the start line, the riders will tackle the Albulapass once again, but this time in the opposite direction. Shortly after the riders will face the Lantsch/Lenz climb, which is shorter in length but has a stinging average gradient of 9.5%. The rest of the stage is defined by its flat sections with punchy climbs, especially in the last 50km, favouring the riders with more explosive power. </span></p>\n<p><span>After stages defined by long alpine passes, stage seven features slightly shorter climbs, but this is compensated with the amount. The stage includes four categorised climbs, and although the finish provides an opportunity for the sprinters to shine, there are plenty of climbs before it. If the sprinters can endure the challenging terrain, they will have a strong chance at victory. However, they'll have to keep an eye on the potential breakaway. </span></p>\n<p><span>The last stage of the Tour de Suisse is a 25.7km-long ITT. This stage serves as a final opportunity for the GC contenders to gain crucial seconds on their rivals, ultimately determining the race winner. With 400 metres of elevation to tackle, the stage promises an exciting and challenging finish to the eight-day race.</span></p>\n<p><b>Stage one: </b><span>12.7km / Einsiedeln - Einsiedeln</span></p>\n<p><b>Stage two: </b><span>173.3km / Beromünster - Nottwil </span></p>\n<p><b>Stage three: </b><span>143.8km / Tafers - Villars-sur-Ollon </span></p>\n<p><b>Stage four:</b><span> 152.5km / Monthey - Leukerbad</span></p>\n<p><b>Stage five:</b><span> 211km / Fiesch - La Punt </span></p>\n<p><b>Stage six:</b><span> 215.3km / La Punt - Oberwil-Lieli </span></p>\n<p><b>Stage seven:</b><span> 162.7km / Tübach - Weinfelden </span></p>\n<p><b>Stage eight: </b><span>25.7km / St.Gallen - Abtwil </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1ae85f6c557d4424f5ea03be6c9a667f02612b175a0b76287479b0d6c485bc01","category":"Cycling"}