{"title":"Got a new iPhone? You need to try out these 14 tips and tricks right now","link":"https://www.macworld.com/article/1435887/iphone-tips-tricks-settings-display-siri-focus-widgets-search.html","date":1703521800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>So you just unboxed your brand-new iPhone. Maybe it’s the first one you’ve ever had. Maybe you’re replacing an older iPhone that has seen better days. Maybe you get an iPhone every year.</p>\n\n\n\n<p>Whatever the reason, you will enjoy your time with your new phone so much more if you spend a  little time learning some tips and tricks. Some of these you may know, others you may have never heard of, but they all make life with an iPhone a little nicer.</p>\n\n\n\n<p>Want to transfer your data from your old iPhone? Read <a href=\"https://www.macworld.com/article/434754/iphone-setup-tips-transfer-data.html\">iPhone setup guide: How to transfer iPhone to iPhone.</a></p>\n\n\n\n<div>\n<div></div>\n\n\n\n<div>\n<div><span>1.</span>\n<h3>Choose a safe password </h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/Change-iPhone-Password.jpg?quality=50&amp;strip=all\" alt=\"Change iPhone Password\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>It’s boring but important: While you can unlock your iPhone with your face or finger, your iPhone is only secure if nobody can guess your passcode. If it’s 123456 you’re asking for trouble.</p>\n\n\n\n<p>iOS will prompt you to create a six-digit passcode, but there is a more sophisticated way to make your iOS device more secure: using an alphanumeric passcode. </p>\n\n\n\n<p>It’s fairly easy to change your passcode to an alphanumeric one:</p>\n\n\n\n<ol>\n<li>Open the Settings app.</li>\n\n\n\n<li>Tap <em>Face ID and Passcode</em> (or <em>Touch ID and Passcode</em> on the iPhone SE), then <em>Change Passcode</em>.</li>\n\n\n\n<li>Enter the passcode you created during setup. </li>\n\n\n\n<li>Tap on <em>Passcode Options</em>.</li>\n\n\n\n<li>Choose <em>Custom Alphanumeric Code</em>. </li>\n\n\n\n<li>Type your new password. Make sure it’s one you can remember.</li>\n</ol>\n\n\n\n<p>You have 72 hours when you can continue to use your old password, just in case you forget the new one! </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>2.</span>\n<h3>Adjust your display settings</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/Adjust-screen-iPhone.jpg?quality=50&amp;strip=all\" alt=\"Adjust screen iPhone\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>If you have an iPhone 14 Pro/Max or 15 Pro/Max you have an always-on display, so you will always be able to see the time and your widgets. To <a href=\"https://www.macworld.com/article/1421776/how-to-always-on-display-phone-14-pro.html\">customize the always-on display</a> go to Settings &gt; <em>Display &amp; Brightness</em> and tap <em>Always On Display</em>. </p>\n\n\n\n<p>But even if your new iPhone doesn’t have an always-on display, there are still lots of display options. The coolest is system-wide <a href=\"https://www.macworld.com/article/232949/how-to-enable-dark-mode-on-iphone-and-ipad.html\">Dark Mode</a>, which gives all the pre-installed apps–and any third-party apps that have built-in compatibility–a black or dark grey background that’s more relaxing to read in the evening.</p>\n\n\n\n<p>You can have Dark Mode on all the time, or you can choose for it to be on from “Light until Sunset” (which switches based on the time of day) or set your own custom schedule.</p>\n\n\n\n<p>To turn on Dark Mode follow these steps: </p>\n\n\n\n<ol>\n<li>Open Settings.</li>\n\n\n\n<li>Tap <em>Display &amp; Brightness</em>. </li>\n\n\n\n<li>At the top of the next screen, you’ll see <em>Light</em> and <em>Dark</em> options side by side. You can choose one, or you can switch on <em>Automatic</em> to set Dark Mode to come on automatically at certain times, such as from <em>Sunset to Sunrise</em>, or on a custom schedule.</li>\n</ol>\n\n\n\n<p>Another tweak to make here is <a href=\"https://www.macworld.com/article/672969/how-to-use-night-shift-on-iphone.html\">Night Shift</a>, that can take some of the blue hues out of your screen late at night. You can adjust the timing of this if you are finding it comes on a little early in the evening. Set it to a couple of hours before you go to bed and, hopefully, you will sleep better. </p>\n\n\n\n<p>You can adjust the timing and color settings for Night Shift in <em>Display &amp; Brightness</em> &gt; <em>Night Shift</em>. </p>\n\n\n\n<p>For example, if you are finding Night Shift is a bit too orange for your liking you can adjust the slider a little toward the <em>Less Warm</em> side if you don’t want to skew the display quite so much.</p>\n\n\n\n<p>If you are struggling to read the text on your screen you can also adjust text size system-wide. To <a href=\"https://www.macworld.com/article/673063/how-to-get-bigger-text-on-iphone.html\">make the text on your iPhone bigger</a> go to Settings &gt; Display &amp; Brightness &gt; Text Size. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>3.</span>\n<h3>Customize Focus modes</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/Do-Not-Disturb.jpg?quality=50&amp;strip=all\" alt=\"Do Not Disturb iPhone\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>The quickest way to activate <a href=\"https://www.macworld.com/article/227420/how-to-master-do-not-disturb-on-ios.html\">Do Not Disturb</a> is from the Control Center—swipe down from the top right corner of the screen and tap the crescent moon icon.</p>\n\n\n\n<p>A matching moon icon will then appear in the top bar of your iPhone screen. With Do Not Disturb activated, incoming calls and alerts will be silenced. For a more advanced range of options, go to Settings &gt; <em>Focus</em> &gt; <em>Do Not Disturb</em>, which includes the ability to set a schedule so that Do Not Disturb turns on at certain times or in certain places. </p>\n\n\n\n<p>You can also allow exceptions: people who will be allowed to contact you even with the Do Not Disturb mode activated. Go to Settings &gt; <em>Focus</em> &gt; <em>Do Not Disturb</em> and tap <em>People</em>. Here you can add anyone in your Contacts. You can also allow calls from certain people. There’s also a setting that means if someone calls a second time within three minutes it will get through, so you know that in an emergency people will get through. </p>\n\n\n\n<p>Another related feature is the Driving Focus (which used to be known as Do Not Disturb While Driving). This is designed to stop dangerous situations on the road by not displaying text messages and notifications when you are driving. </p>\n\n\n\n<p>To set up Driving Focus:</p>\n\n\n\n<ol>\n<li>Go to Settings &gt; <em>Focus</em>. </li>\n\n\n\n<li>Tap on the <em>+</em> in the top right corner. </li>\n\n\n\n<li>Choose <em>Driving</em>. </li>\n\n\n\n<li>Tap on <em>Customize Focus</em>. </li>\n</ol>\n\n\n\n<p>Here you can choose to Allow notifications from certain people, set an auto-reply customize your lock screen to reduce distractions, and more. </p>\n\n\n\n<p>You’ll see there are three settings: Automatically (which attempts to work out when you’re driving by your motion, and which we wouldn’t recommend, given how many times we’ve seen this activate on trains), When Connected to Car Bluetooth, and Manually. </p>\n\n\n\n<p>Go back to the Do Not Disturb page of Settings and you’ll see the automated replies at the bottom of the screen. Select who you want to get this reply, and edit the reply by tapping Auto-Reply and then tapping the message.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>4.</span>\n<h3>Customize the Control Center</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/Control-Centre-iPhone.jpg?quality=50&amp;strip=all\" alt=\"Control Centre iPhone\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Get access to the most useful features on your iPhone quickly by adding them to the Control Centre. </p>\n\n\n\n<p>You can add more than 20 different Control Center shortcuts to Apple apps and features including Shazam Music Recognition, a Screen Recording button, Quick Note, Magnifier, and all the usual shortcuts, like the Camera, TV Remote, Flashlight (Torch), Low Power Mode, and more. </p>\n\n\n\n<p>To personalize your Control Center open Settings &gt; <em>Control Center</em> and tap <em>+</em> on any controls you want to add or <em>–</em> on any you want. to remove. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>5.</span>\n<h3>Take a trip to the Dynamic Island</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/10/iPhone-15-dynamic-island-small.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPhone 15 Dynamic Island small\" loading=\"lazy\" /></figure><p>Chris Martin / Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>The Dynamic Island is the evolution of the Notch to an intelligent section at the top of your iPhone that can change and reshape to include useful information when you might want it. It is a feature of the iPhone 14 Pro and Pro Max and the entire iPhone 15 range. </p>\n\n\n\n<p>If your iPhone has the Dynamic Island you will see information appear around the notch at the top of the screen such as Apple Pay confirmations, battery status, Maps directions, phone call details, sports scores, timers, music, and more–including third-party apps. Tap on the Dynamic Island to bring up related controls. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>6.</span>\n<h3>Change Siri’s voice</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/Change-Siri-Voice.jpg?quality=50&amp;strip=all\" alt=\"Change Siri Voice\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Siri’s voice is quite iconic, but did you know you can change it? There are multiple varieties (American, Australian, British, etc.) to choose from, each with several voices, including different genders. </p>\n\n\n\n<p>To change Siri’s voice just open Settings &gt; <em>Siri &amp; Search</em> and tap <em>Siri Voice</em> to listen to the options. </p>\n\n\n\n<p>You may have to download new voices, so this is usually best done when connected to Wi-Fi.</p>\n\n\n\n<p>While you are messing around with Siri why not try out some of these <a href=\"https://www.macworld.com/article/672515/fun-and-funny-things-to-ask-siri.html\">funny things you can say to Siri. </a></p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>7.</span>\n<h3>Swipe to search <em>everything</em></h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/spotlight-hero.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Spotlight Search\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n<div>\n<div>\n<p>It’s always surprising to see how many people don’t seem to know about or use the iPhone’s powerful global search feature. Like Spotlight on the Mac, it can find apps, search the web, and search through all sorts of content on your device like photos, documents, emails, Messages, and more. </p>\n\n\n\n<p>Just swipe down on your Home screen to access it–not down from the top edge (that will open the Notification Center or Control Center), just give the home screen a downward swipe from anywhere in the middle of the screen.</p>\n\n\n\n<p>Spotlight Search on the iPhone is so overlooked that Apple actually added a little “Search” button to the bottom of the Home screen in iOS 16. Just search for anything and scroll down to find results in the App Store, on the web, and from within the various apps on your phone. You can type in simple math problems and stuff, too. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>8.</span>\n<h3>Pick your widgets</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/Widgets-iPhone.jpg?quality=50&amp;strip=all\" alt=\"iPhone Widgets\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Widgets are a great way to get at-a-glance info on your Home screen. To add Widgets to your iPhone screen follow these steps: </p>\n\n\n\n<ol>\n<li>Enter ‘jiggle mode’ by pressing and holding the screen until the apps start to wiggle.</li>\n\n\n\n<li>Tap on the <em>+</em> in the top left. </li>\n\n\n\n<li>Select any Widgets that appear, or search for specific Widgets. </li>\n</ol>\n\n\n\n<p>The Siri Suggestions widget is handy if you want the apps you are most likely to need at any given moment to appear on your Home screen. </p>\n\n\n\n<p>Read our guide to <a href=\"https://www.macworld.com/article/234393/how-to-add-remove-and-customize-widgets-in-ios-14.html\">How to add, remove, and customize widgets</a> for more. </p>\n\n\n\n<p>But don’t get carried away: too many widgets leave little room for apps. Fortunately, you can stack widgets of the same size! </p>\n\n\n\n<ol>\n<li>Scroll down through the Widget options until you find Smart Stack.</li>\n\n\n\n<li>Tap on Add Widget. </li>\n\n\n\n<li>Once you have a widget on your home screen, tap and hold on the widget until a menu pops up. </li>\n\n\n\n<li>You can select “Edit stack” to pick which other widgets you want on top of it. </li>\n\n\n\n<li>You can now swipe through a number of different widgets that appear in that space. </li>\n\n\n\n<li>Not happy with the Widgets in your Stack? Press and hold on the Smart Stack and choose Edit Stack. Now you can remove any you don’t want. </li>\n</ol>\n\n\n\n<p>Your iPhone will do its best to show you the widget you’re most likely to want to see from a Stack, using time of day and location along with your past behavior. If you aren’t seeing the one you want, just swipe up or down on the widgets to cycle through the stack.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>9.</span>\n<h3>Add a button to the back of your iPhone</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/04/iphone-tips-back-tap.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPhone Back Tap\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n<div>\n<div>\n<p>Your iPhone has an accessibility feature that’s really handy for just about everyone. It’s called “Back Tap” and it lets you double-tap or triple-tap the back of your iPhone to trigger an action. You can double-tap to launch the camera, for example, or triple-tap to toggle the flashlight, open the Notification Center, toggle mute, take a screenshot, or launch a custom Shortcut.</p>\n\n\n\n<p>Here’s how to set up Back Tap: </p>\n\n\n\n<ol>\n<li>Open Settings.</li>\n\n\n\n<li>Tap on <em>Accessibility</em>.</li>\n\n\n\n<li>Scroll down to find <em>Back Tap</em> (it’s near the bottom) and select it. </li>\n\n\n\n<li>You can set independent actions for a double-tap and a triple-tap.</li>\n\n\n\n<li>Choose what you want to happen if you double-tap the back of the phone from the list (Camera, Control Centre, Siri, Flashlight, etc.). You can even choose from your Shortcuts which could include calling a specific contact.  </li>\n</ol>\n\n\n\n<p>In our experience, it works through cases, but if you have a thick wallet-style case it might not. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>10.</span>\n<h3>Use these keyboard tricks</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/iphone-keyboard-tricks.jpg?quality=50&amp;strip=all\" alt=\"iPhone Keyboard Tricks\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p><strong>Use the keyboard like a trackpad</strong>: Anytime the keyboard is up, tap and hold on the spacebar. After a second you’ll see all the letters blank out and you can drag your finger around to move the cursor as if using a trackpad. Then you can move the cursor to the text you want, hold again and the text selector will pop up. It’s a really simple and handy way of moving back to just the right spot to make edits.</p>\n\n\n\n<p><strong>Turn on haptic feedback</strong>: Haptic feedback is available on the keyboard, but it’s not enabled by default. To turn it on (and turn the annoying clicks off), open <em>Settings</em>, select <em>Sound and Haptics</em>, then <em>Keyboard Feedback</em>. You can independently enable or disable sounds and haptics. It’s a fantastic feature that adds a small vibration under your fingers as you type. It just might help you make fewer mistakes!</p>\n\n\n\n<p><strong>One-handed typing</strong>: You can shift the keyboard over to one side to make typing with one hand easier. With the keyboard displayed, press and hold on the Emoji icon (or globe if you don’t see that). Tap on <em>Keyboard</em> settings. Now tap on <em>One-Handed Keyboard</em> to turn that feature on. </p>\n\n\n\n<p><strong>Slide to type</strong>: To type even faster (and generally more accurately) try swiping. Just drag your finger around the keyboard and as if by magic your iPhone will type out the words you want. To turn on Slide to Type go to Settings &gt; <em>General</em> &gt; <em>Keyboards</em> and toggle <em>Slide to Type</em>. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>11.</span>\n<h3>Play with the camera</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/04/Apple-Shot-on-iPhone-macro-Marco-Colletta.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Shot on iPhone Macro Challenge \" loading=\"lazy\" /><figcaption><p><strong>“The Cave” (hibiscus) by Marco Colletta (@marcolletta.1). Shot on iPhone 13 Pro.</strong></p>\n</figcaption></figure><p>Apple</p></div>\n\n\n\n<div>\n<div>\n<p>From Action mode in the iPhone 14 and later, which applies really heavy video stabilization to your hand-held shots, to the new portrait features in the iPhone 15 phones, there are lots of new photography features that your old phone probably didn’t offer. </p>\n\n\n\n<p>To use <strong>Action Mode</strong> open the camera app, switch to Video mode, and tap the little “action” button to enable it. Video should be stable even if you are running while recording with the phone. </p>\n\n\n\n<p><strong>Portrait Mode</strong> and <strong>Portrait Lighting</strong> make for really beautiful shots of people and, for, the iPhone 15-series, animals. You can adjust the depth of field for these portraits to create more or less background blur.</p>\n\n\n\n<p><strong>Cinematic Mode</strong> arrived with the iPhone 13 and lets you focus on the subject in a video in a similar way to how Portrait Mode works with photos. There’s even automatic focus tracking. </p>\n\n\n\n<p><strong>Macro Photography</strong> is only available for the Pro iPhones, but if you have a Pro or Pro Max iPhone you can take really detailed close-ups.   </p>\n\n\n\n<p><strong>Photographic Styles</strong> arrived with the iPhone 13 and lets you customize the image processing pipeline to give your photos a slightly different tone. Open the Camera app, switch to Photo mode, and swipe upward to show the little camera control buttons. You can also select your Photographic Style in Settings &gt; Camera &gt; Photographic Styles.</p>\n\n\n\n<p><strong>Super zoom: </strong>If you have an iPhone 15 Pro Max, you have the only iPhone with a 5X zoom lens, which lets you get closer than ever to far-away subjects. To test it out, tap one of the zoom buttons in the viewfinder or pinch the screen to zoom.</p>\n\n\n\n<p>For more read <a href=\"https://www.macworld.com/article/334289/the-best-iphone-for-photography.html\">Which iPhone has the best camera?</a></p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>12.</span>\n<h3>Pull the subject of a photo out of the background</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/Pull-out-subject-make-sticker.jpg?quality=50&amp;strip=all\" alt=\"Pull out subject from photo iPhone\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Normally, cutting out an image from a photo requires Photoshop and a bit of skill, but with your iPhone, you can quickly select just the <em>subject</em> of an image and not the background. </p>\n\n\n\n<p>Just tap and hold an image on any web page or in your Photos app. In Photos, the subject will be selected, while on a web image, you’ll get a context menu and have to tap on “Copy subject.”</p>\n\n\n\n<p>You can then paste it into all sorts of other apps–Messages, Mail, even save it in Files. If you’ve got dextrous fingers, you can tap and hold the subject to drag it around into other apps. You can find a more detailed step-by-step walkthrough of <a href=\"https://www.macworld.com/article/790950/ios16-how-to-copy-the-subject-from-an-image.html\">how to cut out the subject from an image here</a>.</p>\n\n\n\n<p>A new option in iOS 17 is to Add a Sticker, which lets you add the cutout image as a Sticker that you can use in Messages and other apps. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>13.</span>\n<h3>Easily scan documents</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/Scan-document-with-iPhone.jpg?quality=50&amp;strip=all\" alt=\"Scan document with iPhone\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Your iPhone can, quite easily, scan paper documents into PDFs and even mark them up. You can save them to the cloud or your Files app, send in Messages or an email, whatever you want. There are a few ways to accomplish this, so consult our <a href=\"https://www.macworld.com/article/672791/how-to-scan-documents-and-photos-using-your-iphone.html\">guide to scanning documents with an iPhone</a> for more detail.</p>\n\n\n\n<p>The easiest way is to use the Notes app. </p>\n\n\n\n<ol>\n<li>Open Notes.</li>\n\n\n\n<li>Tap the <em>Camera</em> button. </li>\n\n\n\n<li>Tap <em>Scan Documents</em>. </li>\n</ol>\n\n\n\n<p>This is a great way to take receipts, vaccination records, registrations, and other important paper documents and produce a digital copy you can save in the cloud for safekeeping.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>14.</span>\n<h3>Set up your Medical ID</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-medical-ID.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPhone Medical ID\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n<div>\n<div>\n<p>The tip that could save your life! Your iPhone can display emergency medical info to first responders. It’s called <a href=\"https://www.macworld.com/article/230708/how-to-set-up-medical-id-on-your-iphone.html\">Medical ID</a>, and it only takes a couple of minutes to set up. First, open the <em>Health</em> app. Then tap on your <em>profile picture</em> in the upper right. Tap <em>Medical ID</em>. Tap <em>Edit</em> in the upper right. You can fill in emergency contacts, medical allergies, important medical conditions, and other info.</p>\n\n\n\n<p>Then tap the <em>Show When Locked</em> toggle, which will allow people to see your medical information in an emergency. You can also turn on Share During Emergency Call so that when you contact emergency services on your iPhone, your Medical ID will automatically be shared with the person on the line.</p>\n\n\n\n<p>Just <a href=\"https://www.macworld.com/article/230708/how-to-set-up-medical-id-on-your-iphone.html\">open the Health app to enter important Medical ID info</a> and set up an emergency contact. </p>\n\n\n\n<p>Medical ID info can display critical medical info or allergies on your lock screen to a first responder, and an emergency contact is someone who can be called in an emergency by pressing and holding the side and volume buttons.</p>\n\n\n\n<ol>\n<li>First, open the Health app.</li>\n\n\n\n<li>Then tap on your profile picture in the upper right.</li>\n\n\n\n<li>Tap <em>Medical ID</em>.</li>\n\n\n\n<li>Tap <em>Edit</em> in the upper right.</li>\n\n\n\n<li>Enter any critical medical info a first responder would need to know if you’re in an accident and an emergency contact you would want to reach.</li>\n</ol>\n</div>\n</div>\n</div>\n</div>\n</div>\n\n\n\n<p>We have more iPhone tips here: </p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/561941/useful-iphone-tips-apple.html\">10 incredibly useful iPhone tips hand-picked by Apple</a></p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/668290/iphone-tips-tricks.html\">iPhone tips &amp; tricks</a></p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/2078885/new-iphone-15-do-these-things-first.html\">iPhone 15 tips &amp; trick</a></p>\n\niOS, iPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1aecfdeefbdd2c2beb91937efa8ad85ccd055cc3a9d6d2211c614be115bc3a65","category":"Apple"}