{"title":"Watching the Grand Ethiopian Renaissance Dam from a distance: Implications for sustainable water management of the Nile water","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae219/7689070?rss=1","date":1717632000000,"content":"<span><div>Abstract</div>Increased demands for sustainable water and energy resources in densely populated basins have led to the construction of dams, which impound waters in artificial reservoirs. In many cases, scarce field data led to the development of models that underestimated the seepage losses from reservoirs and ignored the role of extensive fault networks as preferred pathways for groundwater flow. We adopt an integrated approach (remote sensing, hydrologic modeling, and field observations) to assess the magnitude and nature of seepage from such systems using the Grand Ethiopian Renaissance Dam (GERD), Africa's largest hydropower project, as a test site. The dam was constructed on the Blue Nile within steep, highly fractured, and weathered terrain in the western Ethiopian Highlands. The GERD Gravity Recovery and Climate Experiment Terrestrial Water Storage (GRACE<sub>TWS</sub>), seasonal peak difference product, reveals significant mass accumulation (43 ± 5 BCM) in the reservoir and seepage in its surroundings with progressive south-southwest mass migration along mapped structures between 2019 and 2022. Seepage, but not a decrease in inflow or increase in outflow, could explain, at least in part, the observed drop in the reservoir's water level and volume following each of the three fillings. Using mass balance calculations and GRACE<sub>TWS</sub> observations, we estimate significant seepage (19.8 ± 6 BCM) comparable to the reservoir's impounded waters (19.9 ± 1.2 BCM). Investigating and addressing the seepage from the GERD will ensure sustainable development and promote regional cooperation; overlooking the seepage would compromise hydrological modeling efforts on the Nile Basin and misinform ongoing negotiations on the Nile water management.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"1af0742552b9fd2a330fb9e6f0f311378f4ac466465fb6893a023ada5297726f","category":"Interdisciplinary"}