{"title":"The Apple Watch Ultra’s Action button is a perfect fit for the iPhone 15 Pro","link":"https://www.macworld.com/article/1674628/iphone-apple-watch-ultra-action-button.html","date":1680101550000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When Apple announced the <a href=\"https://www.macworld.com/article/1364168/apple-watch-ultra-review.html\">Apple Watch Ultra</a>, I was especially interested in its introduction of an Action button, an additional bit of hardware that could be set to trigger just about anything on watchOS. I began to wonder if future regular Apple Watches might get their own Action buttons, too.</p>\n\n\n\n<p>Now I’m starting to wonder if the Action button might have been a sign of a major new Apple feature to come. What if the Action button came to… the iPhone? It sounds crazy—but it might happen <a href=\"https://www.macworld.com/article/1675641/iphone-15-pro-co-processor-capacitive-buttons-volume-power.html\">as soon as this fall</a>.</p>\n\n\n\n<h2>But first, the Apple Watch</h2>\n\n\n\n<p>Before I get you excited about the iPhone possibilities here, I need to break the uncomfortable news about the Action button on the Apple Watch Ultra: It’s not living up to its potential.</p>\n\n\n\n<p>This is because the Action button isn’t contextual. You can assign it to any number of different actions, but it behaves the same way in all contexts. No matter what app or watch face you’re using, the Action button just does one thing.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-ultra-action-button.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Watch Ultra action button\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-ultra-action-button.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-ultra-action-button.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-ultra-action-button.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-ultra-action-button.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-ultra-action-button.jpg?resize=1536%2C1023&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-ultra-action-button.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-ultra-action-button.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption>The Action button on the Apple Watch Ultra is a bit of a one-trick pony.</figcaption></figure><p>Apple</p></div>\n\n\n\n<p>One of my hopes for the next edition of watchOS is that Apple makes the Action button contextual. For example, you could program it to be a single function globally, or perhaps different apps could use it in different ways–let the user decide. Support for double-taps for different use cases would also help matters.</p>\n\n\n\n<p>Arbitrating between global and per-app commands is hard. Just consider the Mac, where assigning global hotkeys in the Settings app can stomp on the keyboard shortcuts in individual apps–and vice versa. But giving Apple Watch apps direct access to a hardware button (I’m looking at you, stopwatch) would be amazing.</p>\n\n\n\n<h2>About those iPhone buttons</h2>\n\n\n\n<p>Now let’s get to the iPhone. Rumor has it that Apple, in its continuing effort to remove moving parts from its products, is going to replace the volume buttons on the side of the iPhone with pressure-sensitive “buttons,” much as it did with the home button on the iPhone 7. You’d press down on the buttons, but they wouldn’t move–there would just be a Haptic Engine pulse to indicate that you’d pressed.</p>\n\n\n\n<p>The venerable ring/silent switch, which has been on every iPhone since the original model, would also be replaced–with a button. I assume it would work similarly to the current switch, where there’s a specific vibration when you put the phone into silent mode. Or perhaps there would be two different haptic vibrations, one for entering silent mode and one for exiting it.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/iphone-14-pro.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPhone 14 Pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/iphone-14-pro.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/03/iphone-14-pro.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/iphone-14-pro.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/iphone-14-pro.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/03/iphone-14-pro.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/03/iphone-14-pro.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/03/iphone-14-pro.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/03/iphone-14-pro.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption>What if that switch that’s been on every iPhone was replaced with an Action button?</figcaption></figure><p>Apple</p></div>\n\n\n\n<p>But how many people use that switch? I leave my phone muted most of the time. You can mute your phone from Control Center. What if I could… do something else with that button?</p>\n\n\n\n<p>You see where I’m going with this.</p>\n\n\n\n<h2>My button, my actions</h2>\n\n\n\n<p>I want to give full credit to Federico Viticci of MacStories for <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.relay.fm/connected/442&amp;xcust=1-1-1674628-1-0-0&amp;sref=https://www.macworld.com/feed\">walking through the new button configuration</a> on the Connected Podcast. Once you consider the idea that Apple’s adding a button on the side of the iPhone, it’s hard not to be tempted by the idea that it should be reprogrammable. And wouldn’t that button be the equivalent of the Apple Watch’s Action button?</p>\n\n\n\n<p>Consider the possibilities. At the very least, Apple could treat that button like the Apple Watch Ultra treats its button: as a trigger for a single, global shortcut that would be executed no matter where you were in the iPhone interface. Imagine mapping it to the Camera app or the flashlight feature, for instance.</p>\n\n\n\n<p>It might be fun if apps had access to the button or if users could control what it did contextually. (I immediately began to imagine having it trigger a Shortcut, which could then decide what to do based on my current Focus status, the time of day, or some other variable.) But my best guess is that Apple will be conservative, at least at first, and have the new button mimic the ring/silent toggle–by default.</p>\n\n\n\n<p>However, Apple has shown that it’s happy to let users experiment with different ways of interacting with Apple’s hardware and software via settings in the Accessibility section of the settings app. It wouldn’t surprise me if Apple would let users map that button to some other function via an Accessibility setting, with options like toggling the flashlight, entering a specific accessibility mode, launching an app, or running a shortcut. And if running a shortcut is an option, then the sky’s the limit.</p>\n\n\n\n<p>In any event, I won’t miss the ring/silent toggle switch. And I’m excited that it might be replaced with a button that can be actually programmed to do something I want rather than being dedicated to a function I never use.</p>\n\nApple Watch, iPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1af32e7bfc4dc1a06cb62b492cd994f1935f7d11c32cdf86b7419d18d16aced9","category":"Apple"}