{"title":"Acclimation to warmer temperatures can protect host populations from both further heat stress and the potential invasion of pathogens","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17341?af=R","date":1717570800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/0129c106-e312-420b-8c7d-fcd92b326bc2/gcb17341-toc-0001-m.png\" alt=\"Acclimation to warmer temperatures can protect host populations from both further heat stress and the potential invasion of pathogens\" />\n<p>How hosts and pathogens react to higher temperatures depends on both their heat tolerance and capacity for population growth. Our study found that hosts overall fare better in warmer conditions, with faster growth rates and a greater capacity to tolerate the heat. In contrast, pathogen performed consistently worse under warming, limiting the potential spread of disease. The results suggest that hosts could benefit more from warming than pathogens. However, understanding the full impact requires linking individual traits to population processes under scenarios of warming.</p>\n<br />\n<h2>Abstract</h2>\n<p>Thermal acclimation can provide an essential buffer against heat stress for host populations, while acting simultaneously on various life-history traits that determine population growth. In turn, the ability of a pathogen to invade a host population is intimately linked to these changes via the supply of new susceptible hosts, as well as the impact of warming on its immediate infection dynamics. Acclimation therefore has consequences for hosts and pathogens that extend beyond simply coping with heat stress—governing both population growth trajectories and, as a result, an inherent propensity for a disease outbreak to occur. The impact of thermal acclimation on heat tolerances, however, is rarely considered simultaneously with metrics of both host and pathogen population growth, and ultimately fitness. Using the host <i>Daphnia magna</i> and its bacterial pathogen, we investigated how thermal acclimation impacts host and pathogen performance at both the individual and population scales. We first tested the effect of maternal and direct thermal acclimation on the life-history traits of infected and uninfected individuals, such as heat tolerance, fecundity, and lifespan, as well as pathogen infection success and spore production. We then predicted the effects of each acclimation treatment on rates of host and pathogen population increase by deriving a host's intrinsic growth rate (<i>r</i>\n<sub>\n   <i>m</i>\n</sub>) and a pathogen's basic reproductive number (<i>R</i>\n<sub>0</sub>). We found that direct acclimation to warming enhanced a host's heat tolerance and rate of population growth, despite a decline in life-history traits such as lifetime fecundity and lifespan. In contrast, pathogen performance was consistently worse under warming, with within-host pathogen success, and ultimately the potential for disease spread, severely hampered at higher temperatures. Our results suggest that hosts could benefit more from warming than their pathogens, but only by linking multiple individual traits to population processes can the full impact of higher temperatures on host and pathogen population dynamics be realised.</p>","author":"Tobias E. Hector, \nMarta S. Shocket, \nCarla M. Sgrò, \nMatthew D. Hall","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"1afa4af570603b7c94efb53c6ffe68f19dcdda4145d4cc547e9ec788b929028a","category":"Environment"}