{"title":"Hookless rims explained | How new standards have finally improved compatibility","link":"https://www.bikeradar.com/features/hookless-rims-road-tubeless/","date":1697554800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/07/Mavic-hookless-rim-cd5cde7-scaled.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/07/Mavic-hookless-rim-cd5cde7-scaled.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/Mavic-hookless-rim-cd5cde7-scaled.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/Mavic-hookless-rim-cd5cde7-scaled.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/Mavic-hookless-rim-cd5cde7-scaled.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/Mavic-hookless-rim-cd5cde7-scaled.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/Mavic-hookless-rim-cd5cde7-scaled.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/Mavic-hookless-rim-cd5cde7-scaled.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/Mavic-hookless-rim-cd5cde7-scaled.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/Mavic-hookless-rim-cd5cde7-scaled.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Mavic hookless rim\" title=\"Mavic hookless rim\" />                                            <p>As late as 2020, it was safe to say standards and compatibility for hookless tubeless road bike rims and tyres were a mess.</p>\n<p>However, in recent years, there’s been a real effort to tighten up standards and compatibility issues.</p>\n<p>Hookless road bike rims and, crucially, the range of <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless tyres</a> that can be used with them have been largely standardised, to the point where there’s a much broader array of options.</p>\n<p>“The industry has made huge strides within the last several years to reduce tyre-rim compatibility issues,” says Ken Rodriguez-Clisham of Hunt Wheels.</p>\n<p>He puts this down to the work of the European Rim and Tyre Technical Organisation (ETRTO), and manufacturers aligning with its standards, creating more clarity and information for consumers to choose reliable wheel and tyre combinations.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Continental GP5000 TT TR on ENVE SES 4.5 wheel on Tadej Pogačar's Colnago V4Rs\" title=\"Tadej Pogačar's Colnago V4Rs\" />\n\n</div><div><figcaption><span><i></i> Even the pros are now comfortable with hookless tubeless, as shown by Tadej Pogačar’s Colnago V4Rs.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>Back in 2020, road tubeless was also only just going mainstream. Things have changed massively since then and most (but not all) new wheelsets now offer tubeless compatibility as standard.</p>\n<p>Tyre brands such as <a href=\"https://www.bikeradar.com/brand/continental/\">Continental</a> have significantly expanded their tubeless tyre ranges too – there’s a tubeless tyre for every use, from time trialling right through to all-road and <a href=\"https://www.bikeradar.com/features/routes-and-rides/what-is-gravel-riding/\">gravel riding</a>.</p>\n<p>But although compatibility issues between rims and tyres have largely been addressed, some brands still strike a note of caution about hookless.</p>\n<p>We’ve talked to many of the wheel and tyre makers who are involved with the development of hookless road products, as well as the bodies that oversee standards and compatibility, to gauge the state of hookless tech today.</p>\n<p>Here, we’ll look at what makes a rim hookless, why hookless rims present a new set of challenges and how wheel and tyre makers have come together to address these. But first, what makes a rim hookless?</p>\n<h2>What is a hookless rim?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Hooked and hookless rims\" title=\"Enve-rim-types\" />\n\n</div><div><figcaption><span><i></i> Hookless rims do away with the bead hook that helps retain conventional clincher tyres.</span></figcaption><span> <a href=\"https://www.enve.com/en/journal/behind-the-product-the-hookless-bead-how-it-works-and-who-theyre-for/\"><strong>Enve</strong></a></span></div>\n<p>A hookless rim is simply one with a profile that lacks bead hooks, which are protruding edges that help retain conventional clincher tyres under pressure.</p>\n<p>Instead, a hookless rim has straight, vertical sides. In wheel-maker circles, the technology is often referred to as ‘tubeless straight side’, or TSS.</p>\n<p>Hookless rims have been around for mountain bikes for years, but in the road world, where <a href=\"https://www.bikeradar.com/advice/workshop/road-bike-tyre-pressure/\">tyre pressures</a> are typically much higher, they’re relatively new.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Hookless rim\" title=\"Corima G30.5 wheels\" />\n\n</div><div><figcaption><span><i></i> Modern hookless rims are designed to work with tubeless tyres only.</span></figcaption><span> <i>Matthew Loveridge / Our Media</i></span></div>\n<p>Hookless rims are usually tubeless-only – you must run a tubeless-specific tyre, which will have a stiffer bead than a conventional tubed clincher.</p>\n<p>It is possible to run a tube (for example, in the event of a puncture that sealant won’t fix) but only in that same tyre – it’s not usually considered safe to swap to a standard clincher tyre.</p>\n<p>On the face of it, you might assume a hookless rim is less safe than a hooked one, but the reality is much more nuanced.</p>\n<p>The safety of a rim-tyre interface is heavily dependent on the tolerances of the two components. Proponents of hookless claim it’s perfectly safe (or indeed safer than hooked) and offers real performance benefits (we’ll get onto those later).</p>\n<p>Detractors suggest the move to hookless is driven primarily by manufacturing concerns and not for the benefit of riders. There’s also the argument, made by DT Swiss, that hooked rims will always be safer and less vulnerable to riders disregarding the significantly lower maximum tyre pressures that are specified for hookless rims.</p>\n<h2>The state of play in road tubeless: it’s all happening</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Zipp's new 404 Firecrest wheelset\" title=\"Zipp’s new 404 range 05\" />\n\n</div><div><figcaption><span><i></i> Zipp is a strong advocate of hookless rims for road wheels.</span></figcaption><span> <i>Warren Rossiter / Our Media</i></span></div>\n<p>For the longest time, <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">road bike wheels</a> had an internal <a href=\"https://www.bikeradar.com/advice/buyers-guides/rim-width-explained-for-road-bikes-mountain-bikes-and-gravel-bikes/\">rim width</a> of 13mm to 15mm, with 23mm the go-to tyre width. Tyres larger than 25mm were confined to <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-endurance-road-bikes/\">endurance bikes</a> and regarded with suspicion by those with even modest performance ambitions.</p>\n<p>But now, at the high end of the market, the likes of Zipp and ENVE are offering wheelsets with hookless carbon rims, with large internal rim widths that would have placed them squarely in mountain bike territory just a few years ago.</p>\n<p>These are wheels aimed at tyres wider than old-school road cycling norms would have demanded, usually starting at 28mm nominal width, although on the wider rims, a tyre of this width will typically come up closer to 30mm.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Vittoria Corsa Pro Launch\" title=\"Vittoria Corsa Pro Launch\" />\n\n</div><div><figcaption><span><i></i> Road bike tyres are wider than ever.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>On the tyre front, all the major players now have a flagship road tubeless offering. Notable examples include the <a href=\"https://www.bikeradar.com/reviews/components/tyres/road-bike-tyres/schwalbe-pro-one-tubeless-review/\">Schwalbe Pro One TLE</a>, <a href=\"https://www.bikeradar.com/reviews/components/tyres/road-bike-tyres/vittoria-corsa-pro-tlr-first-ride-review/\">Vittoria Corsa Pro TLR</a> and <a href=\"https://www.bikeradar.com/reviews/continental-grand-prix-5000-s-tr-review/\">Continental Grand Prix 5000 S TR</a>.</p>\n<p>28mm tyres are becoming the go-to for general road riding and many endurance bikes now accept 32s or larger. Even the definitely-not-endurance <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cervelo-s5-force-etap-axs-review/\">Cervélo S5</a> can accommodate 34mm tyres.</p>\n<p>This trend goes hand-in-hand with the rise of road bike <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">disc brakes</a>. Few rim brake road bikes accepted a tyre larger than 28mm, or maybe 30mm at a squeeze.</p>\n<p>Designing a road frame for larger rubber meant moving to non-standard long-drop calipers, cantilevers (as used on <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cyclocross-bikes/\">cyclocross bikes</a>) or mini <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-brakes/\">V-brakes</a>.</p>\n<p>Disc frames inherently have fewer restrictions on clearance, and bike designers have been capitalising on this to produce ever-more versatile road bikes, some of which even overlap with the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bike</a> category.</p>\n<h2>What are the road tubeless standards?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"The ETRTO tyre standards manual can be yours for just €175 – perfect bedtime reading for tyre nerds.\" title=\"ETRTO-cover-SM-2023_web\" />\n\n</div><div><figcaption><span><i></i> The ETRTO tyre standards manual can be yours for just €175 – perfect bedtime reading for tyre nerds.</span></figcaption><span> <i>ETRTO</i></span></div>\n<p>We’ve spoken to a wide range of wheel and tyre manufacturers and also received feedback on standards from Philipp Luedi, head of prototyping and testing at the ETRTO and ISO (International Organization for Standardization) – the two bodies that oversee wheel and tyre standards for bicycles and other vehicles.</p>\n<p>Although in principle, having two bodies setting standards could lead to incompatible standards, in practice the ETRTO takes the lead on standards for bicycle wheels and tyres and ISO follows, as explained by Hunt Wheels’ Rodriguez-Clisham.</p>\n<p>“The European Rim and Tyre Technical Organisation is the body that provides a unified voice by publishing in-depth standards for rim contours and rim-tyre compatibility, which has led to greater reliability and consistency across tubeless offerings,” he says.</p>\n<p>“At Hunt, we follow both guidelines regarding the testing and manufacturing of rims. While the ISO standards are not updated as frequently, they [do not contradict] the standards the ETRTO have outlined.</p>\n<p>“So while they may not be in sync in terms of the frequency of updates, following both is not impossible,” Rodriguez-Clisham continues.</p>\n<p>The standards themselves are now much more aligned, as explained by Philipp Luedi.</p>\n<p>“The situation in regard to standardization of the tire/rim interface significantly improved with the revisions of ISO 5775-2 ‘Rims’ published in March 2021 and ISO 5775-1 ‘Tire designations and dimensions’ published in July 2023.</p>\n<p>“With these revisions, the ISO 5775 is now mostly identical with the ETRTO 2023, which simplified the situation for manufacturers and thus improves product compatibilities. Since the ETRTO standard will still be revised on a yearly basis, while the ISO periodic review takes place every five years, future incongruities cannot be excluded.”</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"ENVE SES 3.4 wheels with Pirelli P-Zero Race TLR tyres\" title=\"ENVE SES 3.4 wheels with Pirelli P-Zero Race TLR tyres\" />\n\n</div><div><figcaption><span><i></i> ENVE says work still needs to be done on road tubeless standards.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>Nathan Schickel, road wheel product manager at Zipp, says that the brand builds its wheels to exceed the ETRTO standards. It tests to ensure they are safe at substantially higher pressures and 95 per cent of its wheels hit or exceed Zipp’s own internal standards.</p>\n<p>Jake Pantone, VP of product and brand at ENVE, tells us hookless compatibility is the favourite topic at ENVE, but that there is still work to be done. Although the ETRTO has defined a lot of the standards and tolerances for hookless compatibility, Pantone states, these are only recommendations.</p>\n<p>“The questions of bead material, bead stiffness and tire bead diameter are not currently defined or standardised. We believe standardising this would answer the question of rim and tire compatibility,” Pantone says.</p>\n<h2>Hookless compatibility is less of an issue than it was</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"ENVE Foundation Collection 45 wheelset\" title=\"ENVE Foundation Collection 45 wheelset\" />\n\n</div><div><figcaption><span><i></i> ENVE has published a list of recommended tyres to work with its hookless rim design.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>Three years ago, Continental’s tubeless tyres had a warning on their sidewalls that they were not compatible with hookless rims.</p>\n<p>It wasn’t until 2021 when Continental released the updated <a href=\"https://www.bikeradar.com/reviews/continental-grand-prix-5000-s-tr-review/\">GP 5000 S TR</a> that it had a hookless-compatible road tyre.</p>\n<p>This was a big issue for brands – Hunt Wheels brought out its first hookless wheelset in 2017, but reverted to hooked beads because there just weren’t enough compatible tyres back then. Now, it has several hookless options in its catalogue, as tyre choice has become far less of an issue.</p>\n<p>David Ward at Giant Bikes emphasises the importance of increased tyre choice for hookless: “Vittoria and Continental not being on board at the time was a major stumbling block for some consumers but now the list of compatible tyres looks very healthy covering lots of different brands.”</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Schwalbe Pro One Aero tyre on Syncros Capital SL wheels\" title=\"_BR_3053\" />\n\n</div><div><figcaption><span><i></i> The tubeless-ready Schwalbe Pro One Aero is suitable for hookless rims.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>Although the number of hookless-compatible tyres has increased, there are still limitations.</p>\n<p>Continental has specific limitations on the rim’s internal width and a maximum tyre pressure of 5 bar / 73psi that it <a href=\"https://conti-tyres.co.uk/road-and-track/clinchers/grand-prix-5000s-tr\" target=\"_blank\">details on its site</a>.</p>\n<p>Schwalbe, too, has <a href=\"https://www.schwalbe.com/en/tubeless-laufradanforderungen\" target=\"_blank\">specific recommendations</a> for the use of its tyres on hookless beads, including a maximum pressure dependent on the tyre width.</p>\n<p>Tim Ward, from Schwalbe, says: “There are no particular restrictions for using Schwalbe tubeless road and gravel tyres on a hookless rim as long as they are explicitly designated as tubeless-compatible.</p>\n<p>“However, it should be borne in mind that hookless rims tend to have a more restricted pressure range and, without the bead-lock lip of many tubeless clincher rims, the tyre can de-mount at very low pressures or when flat.”</p>\n<h2>Testing is fundamental to ensuring compatibility</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Giant hookless carbon rim on the Liv EnviLiv Advanced 1 women's aero road bike\" title=\"Giant hookless carbon rim on the Liv EnviLiv Advanced 1 women's aero road bike\" />\n\n</div><div><figcaption><span><i></i> All Giant’s carbon rims are now hookless.</span></figcaption><span> <i>Sam Voaden / Our Media</i></span></div>\n<p>Wheel brands take differing approaches to tyre compatibility, with some wheel makers publishing lists of tyres they’ve tested and deemed safe, and others making more general statements about compatibility that place the onus on tyre makers to guarantee safety.</p>\n<p>Fundamentally, it’s a question of liability. No wheel or tyre maker wants to be in the position of promising compatibility with another brand’s products only for a rider to suffer injury as a result of it all going wrong.</p>\n<p>Zipp, for example, has <a href=\"https://www.sram.com/en/zipp/campaigns/hookless-tire-compatibility\" target=\"_blank\">a very detailed section on its website</a> listing tyres that are known to be compatible with each of its hookless rims.</p>\n<p>Zipp’s Schickel says the usual testing procedure is for Zipp to supply its wheels to tyre makers, who then use them to test their tyres for compatibility. The tyre maker then reports back to Zipp the tyres and tyre widths that it deems compatible.</p>\n<p>In many cases, compatibility is determined by tyre width as well as tyre model. For example, narrower tyres of around 25mm are typically not stated to be compatible with Zipp’s wider rims, while the same tyres with 28mm width or more are.</p>\n<p>The ISO standard for a blow-off test specifies a protocol where the tyre is gradually inflated to 110 per cent of the specified maximum pressure. Zipp also does its own testing internally, inflating tyres to far more than the recommended tyre pressures over a longer period of time to confirm compatibility.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"ENVE Foundation 45 wheelset for road bikes\" title=\"ENVE Foundation 45 wheelset - 01\" />\n\n</div><div><figcaption><span><i></i> ENVE’s hookless wheels are compatible with a relatively wide range of 25mm tyres.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>As Ward of Giant points out: “We are still sticking to the same guidelines we did when we developed our first hookless road rims in 2019 and stick to the same tyre testing protocol, taking tyres up to 150 per cent of the maximum pressure stated on the sidewall of the tyre.</p>\n<p>“If there is a hookless-specific pressure stated on the tyre then we test to 150 per cent of that.</p>\n<p>“There are a lot of tyre brands out there that work with Giant to get their tyres through our testing protocol and onto our approved lists as they can see the growth of hookless rims,” he says.</p>\n<p>ENVE is another wheel brand that publishes a <a href=\"https://www.enve.com/learn/tire-compatibility/\" target=\"_blank\">list of tyres</a> compatible with its hookless rims. In its case, there are a good number of 25 or 26mm-width choices, including the popular Continental Grand Prix 5000 S TR.</p>\n<p>ENVE’s testing protocol, like Giant’s, demands a tyre must achieve 1.5 times the maximum pressure of either the rim or the tyre, whichever is the lower number, without blowing off.</p>\n<p>For <a href=\"https://www.bikeradar.com/reviews/components/wheels/wheel-sets/enve-ses-4-5-wheelset-review/\">ENVE’s SES 4.5 AR</a>, for example, which is rated for 80psi, that means a tyre must hold 120psi without coming off the rim.</p>\n<p>Testing is carried out using actual rims as well as a machined aluminium test rim that’s used to measure bead stiffness and diameter.</p>\n<p>Talking to the brands, there’s a consistent theme of cooperation and testing – ultimately, it’s in everyone’s interests if riders have confidence in their equipment, and there are no compatibility pitfalls.</p>\n<h2>Is the future hookless?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Giant rim pressure limits\" title=\"TCR rim sticker cropped\" />\n\n</div><div><figcaption><span><i></i> Giant’s hookless rims don’t carry the 5-bar warning and it tests to 150 per cent of recommended tyre pressures.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>If you’ve been following recent wheel launches, you might have noticed repeated mentions of that 5-bar pressure limit on hookless rims. This comes from the ETRTO handbook.</p>\n<p>Historically, 73psi would have been a very low limit for road riding, where pressures as high as 120psi were not unheard of.</p>\n<p>If you ask the likes of Zipp, the number doesn’t really matter anyway because its testing consistently points to wider tyres and lower pressures being both faster and more comfortable in the real world, with no need to exceed that number.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Vittoria Corsa Pro TLR tyre being tested at Silverstone Sports Engineering Hub\" title=\"Vittoria Corsa Pro TLR tyre being tested at Silverstone Sports Engineering Hub\" />\n\n</div><div><figcaption><span><i></i> Lab testing has consistently shown wider (to a point) tyres and lower pressures to be faster than the super narrow high-pressure tyres of old.</span></figcaption><span> <i>Gavin Roberts / Our Media</i></span></div>\n<p>With that in mind, Zipp is all-in on hookless, claiming numerous advantages for the technology compared to hooked bead tubeless. Key among them from a performance point of view is that no hooks means better <a href=\"https://www.bikeradar.com/advice/buyers-guides/are-wider-tyres-faster/\">aerodynamics</a>. But Schickel also cites the added comfort on offer from the wider tyre/lower pressure combination, as well as higher wheel quality, and less waste and scrap going to landfill.</p>\n<p>Schickel claims this is better for everyone, with the switch to hookless contributing to steady reductions in both weight and price for newer generations of Zipp’s wheels.</p>\n<p>Hunt Wheels also sees hookless as the way forward. Rodriguez-Clisham comments: “Based on what we’re seeing as market trends, hookless wheels will only continue to grow in popularity. As with all new technologies, upon the initial launch, they tend to be implemented in higher-end products first. Once the new processes are refined and costs of production are brought down, then that technology will start to be utilised in products across ranges.”</p>\n<p>It’s a view echoed by Giant’s Ward: “All of our high-end wheels in the current line-up for road, gravel and off-road are already hookless. There are definite advantages on wheel performance, strength and durability, as well as tyre performance, and the tyres are getting better and better, so it makes sense.”</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Close up of DT Swiss internal rim tape.\" title=\"_BR_3222\" />\n\n</div><div><figcaption><span><i></i> Although DT Swiss has hookless rims on wheels for wider tyres, its road wheel rims remain hooked.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>Meanwhile, DT Swiss sounds a note of caution.</p>\n<p>“We have decided to stick to hooked rims, to give the user the safest and widest choice of tyres,” says Ralf Eggert, DT’s road marketing manager.</p>\n<p>“This [5 bar] pressure limitation imposed by hookless rims can sometimes be easily exceeded due to habits from the past (given experience from times of 23 or 25mm tires), unintentional heating up (climate controlled apartment vs. riding outside) in heat conditions or because of higher system weights, that needs higher tyre pressures to stabilise the sidewall of the tyre to achieve appropriate riding characteristics,” he continues.</p>\n<p>“No matter the discussion about lower weight, a potential better tyre fit and form, or simply a reduction of costs for a broader access of carbon wheels to the public: Safety First is our credo,” Eggert states.</p>\n<p>DT does offer hookless rims on its wheels designed for tyres over 35 or 40mm, where pressures used are much lower.</p>\n<p>However, for road wheels, DT is committed to hooked rims. “For us, a more intensive manufacturing process is not an obstacle and within the R&amp;D of new high-end wheels we have proven in measurements that there are no performance disadvantages in aerodynamics and rolling resistance,” says Eggert.</p>\n<p>“We believe that a hooked rim is the only way to produce a high-performance tyre-rim joint in the high-pressure range defined for us by the tyre sizes of under 35mm.”</p>\n<h2>Will alloy road rims remain hooked?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Hunt tubeless tape on a Hunt Alloy SL wheel\" title=\"Hunt tubeless tape on a Hunt Alloy SL wheel\" />\n\n</div><div><figcaption><span><i></i> Extruding a bead hook doesn’t pose any difficulties for an alloy rim and it may increase its rigidity.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>From a manufacturer’s perspective, hookless is a lot less appealing for alloy rims for road use, although there are <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-wheels/\">mountain bike wheels</a> available with hookless alloy rims. While carbon rims are moulded as a single unit, alloy ones are extruded, and then the ends of the extrusion are joined.</p>\n<p>This means making a bead hook doesn’t add any particular complexity to the process, and that controlling tolerances for bead seat diameter (the critical dimension that determines how tightly a tyre fits) is inherently more difficult than it is with carbon rims.</p>\n<p>As Hunt’s Rodriguez-Clisham says: “The benefits of hookless are greater for carbon wheels more so than alloy, so hookless probably won’t move to alloy rims anytime soon.</p>\n<p>“The hook for alloy rims is so easy to extrude unlike carbon rims, which require you to mould it – which comes with its own issues. Plus alloy is less stiff than carbon, so the hooked sidewalls add a bit of extra security at no cost.”</p>\n<p>It’s likely we will see a divergence in tubeless technology between the high- and low-end as a result.</p>\n<section>\n    <div>\n        \n<h2>BikeRadar’s take | Hookless tech will dominate high-end carbon wheels, but lower-priced wheels will probably retain their hooks</h2>\n<p>Hookless technology has matured to the point where most wheel makers and tyre manufacturers are confident in their products’ inter-compatibility.</p>\n<p>That’s due to decreased manufacturing tolerances in both wheel rims and tyres. Increased collaboration and thorough testing by both wheel and tyre makers have allowed them to establish what works with what. </p>\n<p>Nevertheless, we’d recommend double-checking the compatibility of your planned wheel-tyre combination, including tyre width, before using a specific tyre on a specific rim. </p>\n<p>Don’t exceed recommended pressures and don’t mount non-hookless approved tyres on hookless rims. Consider very carefully whether you want to shoulder the risk of trying unproven wheel-tyre combinations, not least because the wheels available with hookless rims tend to be the most expensive.</p>\n<p>\n\n    </p></div>\n    </section>","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"1b090a2d5cbd15faf23e9f5c0a420ac6be5d61ca8287a20f5370257ed4f391b8","category":"Cycling"}