{"title":"Parallels 17.1 Update Improves Windows 11 Support on Intel and M1 Macs, Compatibility With macOS Monterey","link":"https://www.macrumors.com/2021/10/15/parallels-17-1-update-windows-11-vtpm-support/","date":1634292741000,"content":"Parallels Desktop 17.1 for Mac has <a href=\"https://www.parallels.com/blogs/parallels-desktop-17-update/?utm_campaign=coschedule&amp;utm_source=twitter&amp;utm_medium=ParallelsMac&amp;utm_content=Just%20Released%20–%20Parallels%20Desktop%2017.1%20Update%20Fully%20Supports%20macOS%20Monterey%20and%20Windows%2011\">just been released</a>, offering improved support for Windows 11 virtual machines and added stability via the default implementation of Virtual Trusted Platform Modules (vTPMs) for \"all future and past Windows 11 VMs.\" Parallels 17.1 also fully supports <a href=\"https://www.macrumors.com/roundup/macos-12/\">macOS Monterey</a> as a host OS and improves the user experience when running ‌macOS Monterey‌ in a VM on <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> Macs.  \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/Windows-11-Parallels-Feature.jpg\" />\r\n<br />\r\nWindows 11 requires a hardware-based TPM chip to run, which limits the software's compatibility with older PC computers and prevents it from running via Boot Camp on Intel Macs. Meanwhile there is no Boot Camp feature on Macs with Apple silicon, and the ARM-based version of Windows 11 is not natively supported. \r\n<br />\r\n\r\n<br />\r\nBy introducing default support for vTPMs, Parallels offers automatic Windows 11 compatibility with Intel Macs and <a href=\"https://www.macrumors.com/guide/apple-silicon/\">Apple Silicon</a> Macs, with the proviso that owners of the latter are using Insider Preview builds of Windows 11 for ARM machines.\r\n<br />\r\n<blockquote>\"Knowing that Parallels Desktop plays a critical role in enabling users to run the latest versions of Windows on their favorite Mac device today, we've developed a simple solution to help all users upgrade to Windows 11 with the enablement of vTPMs by default on all Mac devices,\" said Elena Koryakina, Vice President of Engineering at Parallels. </blockquote>There has been continuing <a href=\"https://www.macrumors.com/2021/10/05/microsoft-releases-windows-11/\">uncertainty</a> surrounding the feasibility of running Windows 11 on ‌Apple Silicon‌ Macs via virtualization software, particularly in light of <a href=\"https://www.macrumors.com/2021/09/14/arm-windows-m1-macs-not-supported/\">comments</a> from Microsoft suggesting that virtualization is not a supported scenario for its latest operating system, as well as the subsequent release of Insider Builds that break virtualization. There are still specific requirements to be aware of when running Windows 11 on both Apple ‌M1‌ and Intel-based Mac computers, which Parallels has <a href=\"https://www.parallels.com/blogs/Windows-11-TPM/\">detailed in a blog post</a>, but this latest update should assuage concerns of some Parallels users.\r\n<br />\r\n\r\n<br />\r\nIn addition to automatic vTPM support, version 17.1 allows users to install Parallels Tools in a ‌macOS Monterey‌ VM on Apple ‌M1‌ Mac and use the Copy and Paste integrated feature between the VM and the primary macOS. The default virtual machine disk size has also been increased from 32GB to 64GB.  \r\n<br />\r\n\r\n<br />\r\nThis version of Parallels also improves graphics for several Windows games including, but not limited to: <em>World of Warcraft</em>, <em>Age of Empires 2 Definitive Edition</em>, <em>Tomb Raider 3</em>,<em> Metal Gear Solid V: The Phantom Pain</em>, <em>Mount &amp; Blade II: Bannerlord</em>, <em>World of Tanks</em>, and <em>Raft</em>.   \r\n<br />\r\n\r\n<br />\r\nLastly, there is added support for VirGL in Virtio GPU, which enables Linux 3D acceleration out of the box on all supported Mac computers, brings visual performance improvements, as well as use of Wayland protocol in Linux VMs. VirGL 3D graphics can be used by modern Linux VMs even without Parallels Tools being installed, but Parallels recommends users install Parallels Tools anyway. \r\n<br />\r\n\r\n<br />\r\nParallels Desktop 17 has moved entirely to a subscription model, which means the standard edition costs $79.99 per year, while Pro and Business Editions are available for $99.99 per year. Users who purchased a perpetual license for an earlier version of Parallels Desktop can upgrade to Parallels Desktop 17 for $49.99. A free trial is available to download from the <a href=\"https://www.parallels.com/products/desktop/\">Parallels website</a>.<div>Tags: <a href=\"https://www.macrumors.com/guide/apple-silicon/\">Apple Silicon</a>, <a href=\"https://www.macrumors.com/guide/parallels-desktop/\">Parallels Desktop</a>, <a href=\"https://www.macrumors.com/guide/windows-11/\">Windows 11</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/15/parallels-17-1-update-windows-11-vtpm-support/\">Parallels 17.1 Update Improves Windows 11 Support on Intel and M1 Macs, Compatibility With macOS Monterey</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/parallels-17-1-update-improves-windows-11-support-on-intel-and-m1-macs-compatibility-with-macos-monterey.2317038/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0HBTrJSlcSw:g7I-PXRxHd0:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0HBTrJSlcSw:g7I-PXRxHd0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/0HBTrJSlcSw\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1b12068db235851b7b830ddb6a0e547e04aacb93d529186cd98ddf3f633b1dac","category":"Apple"}