{"title":"Robust genetic codes enhance protein evolvability","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002594","date":1715868000000,"content":"<p>by Hana Rozhoňová, Carlos Martí-Gómez, David M. McCandlish, Joshua L. Payne</p>\r\n\r\nThe standard genetic code defines the rules of translation for nearly every life form on Earth. It also determines the amino acid changes accessible via single-nucleotide mutations, thus influencing protein evolvability—the ability of mutation to bring forth adaptive variation in protein function. One of the most striking features of the standard genetic code is its robustness to mutation, yet it remains an open question whether such robustness facilitates or frustrates protein evolvability. To answer this question, we use data from massively parallel sequence-to-function assays to construct and analyze 6 empirical adaptive landscapes under hundreds of thousands of rewired genetic codes, including those of codon compression schemes relevant to protein engineering and synthetic biology. We find that robust genetic codes tend to enhance protein evolvability by rendering smooth adaptive landscapes with few peaks, which are readily accessible from throughout sequence space. However, the standard genetic code is rarely exceptional in this regard, because many alternative codes render smoother landscapes than the standard code. By constructing low-dimensional visualizations of these landscapes, which each comprise more than 16 million mRNA sequences, we show that such alternative codes radically alter the topological features of the network of high-fitness genotypes. Whereas the genetic codes that optimize evolvability depend to some extent on the detailed relationship between amino acid sequence and protein function, we also uncover general design principles for engineering nonstandard genetic codes for enhanced and diminished evolvability, which may facilitate directed protein evolution experiments and the bio-containment of synthetic organisms, respectively.","author":"Hana Rozhoňová","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"1b1582b8de00481c086cb293b1d71153dd38d012aa4c1699795861e43cc552cb","category":"Environment"}