{"title":"Ironman Acquires FulGaz Training App: Plans Ironman Training App","link":"https://www.dcrainmaker.com/2021/10/ironman-acquires-fulgaz-training-app-plans-ironman-training-app.html","date":1634847756000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/10/FulGazIM.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/10/FulGazIM_thumb.jpg\" /></a></p>\n<p>Ironman has just announced the acquisition of FulGaz, the indoor training app for cycling. As part of the acquisition, Ironman will create a secondary app that caters specifically to Ironman athletes. This new app will include full rideable courses and course guides for ultimately all Ironman races, as well as virtual races within the app. Ironman sees this new unnamed app as focused on providing a “one-stop destination where everything you need to be prepared” for an event is located, including suggestions on whether or run a disc wheel, or what typical wind conditions are.</p>\n<p>Meanwhile, for those existing FulGaz users, you won’t have to worry about your app going anywhere. Ironman says that the goal is to give FulGaz the technical resources behind the scenes to continue to grow the FulGaz app and user base – just at a faster trajectory than before. That has already started from a technical perspective, with FulGaz having just finished transitioning to a much broader server platform which they say provides “100x” more capacity than before, including being distributed across more regions via a new CDN (content distribution network) in front of it.</p>\n<p>With that quick overview, let’s dive a bit deeper into what’s planned.</p>\n<h3><span>The Ironman Training App:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/FulGazApp.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/FulGazApp_thumb.png\" /></a></p>\n<p>The company says the goal for the Ironman training app is 100% focused on the Ironman athlete. And by that, they don’t mean iron-distance athletes, but specifically – athletes racing Ironman races. They envision this app being the one-stop-shop for everything an athlete needs when preparing for an ultimately racing an Ironman event.</p>\n<p>In talking to CEO Andrew Messick about the acquisition, he said:</p>\n<blockquote><p>“We are in business of providing our athletes with great racing experiences, and that’s always been the true north for our company…and as our company has evolved and grown, and become on our good days a more thoughtful and sophisticated company. And we’re increasing realizing an important part of that is having them be prepared as can possibly be when they walk up to the start line.”</p></blockquote>\n<p>To that end, they see the app including not just the real-course filmed videos that FulGaz is known for (except going forward with the Ironman course library), but also detailed course guides built into the app. Everything from exactly where the aid stations are located on the course, to outlining typical race day wind conditions (and as the race nears, forecasts), to how to train and race on a particular course. Messick noted that today people get that information from numerous places, but that they (Ironman) needed to consolidate that with more clarity in one spot.</p>\n<p>In my discussion they continued to use the term (or variants of) “being as prepared as you can possibly be” for race day. I then asked whether or not that extended to creating a structured race training plan, such as having 18 or 20 week training plans leading up to an event. But that doesn’t sound like that’s the case. They were careful to not step on the toes of their Ironman University coaches and their coaching businesses, saying they’d prefer to direct people towards those resources.</p>\n<p>Mike Clucas, founder of FulGaz – and also a high-performance coach himself, noted that over the years at FulGaz he’s built a lot of “arguably esoteric coaching features into FulGaz” that were designed for coaching high-performance athletes rather than the masses that mostly used FulGaz. But he said now he envisions a scenario where those features can be scaled out in conjunction with the Ironman University coaches, and having an audience that’s receptive to it.</p>\n<p>While I agree there’s a market for that, I’m skeptical that’s what the broader consumer market actually wants. Certainly, as an athlete myself that’s been coached to multiple Ironman finishes, I fully support the coached method. But at the same time, that’s also ignoring the vast majority of the market that’s looking for triathlon and Ironman training plans to get them to the starting line, and at various skill levels. In looking at the sports tech market and companies within it, those that have tried to cater wholly (entirely) to coaches have largely been left behind over the past few years with the rise of more and more platforms that directly interact with the athlete.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/Fulgaz2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/Fulgaz2_thumb.png\" /></a></p>\n<p>Shifting topics, it’s notable that most of those won’t be happening for quite some time – nearly a year. Ironman hasn’t even named this new secondary app yet, though is using the working name of ‘Ironman Connected App’. Once they ditch that name for something less corporate sounding (hopefully), the company says the app will go live in the Summer of 2022. At which point, both it and FulGaz will run as separate apps.</p>\n<p>I asked whether or not that meant two subscriptions – one for FulGaz and one for the Ironman app, and Ironman says they don’t know yet – however, they’d likely have some sort of combo deal or single subscription. Similarly, they haven’t decided on pricing yet either, other than to note that they are “aware that it’s a price-sensitive market”. Which is a tricky thing. The average Ironman athlete is very much not price sensitive. The outlay required to compete in an Ironman easily demonstrates that. However, I suspect what that statement is really underlining is the acknowledgment that most Ironman athletes will likely also be subscribing to Zwift or another training platform. Thus they need to be pricing the FulGaz-driven component as more complimentary than the singular app an athlete uses.</p>\n<p>The nearest term changes we’ll see are starting in January 2022, after the existing Rouvy-Ironman content &amp; event/racing partnership expires. At that point, FulGaz will start to host the Ironman courses (and they’ll disappear off Rouvy). Meanwhile, behind the scenes, Ironman and FulGaz are working to start filming of courses for next year, with the goal that every Ironman athlete has filmed courses in their training app. That includes not just the bike, but also the run courses, for which the new Ironman app will also include support for (something that FulGaz doesn’t have today).</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-51.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-51.png\" /></a></p>\n<p>This is an interesting acquisition. Ironman doesn’t exactly have the most sparkling digital track record when it comes to indoor training initiatives. Certainly, the early VR races demonstrated that, though, that was likely more driven by a rush to get things done, and perhaps a bit of overconfidence.  Inversely, FulGaz, while smaller – tends to be on the leading edge of how indoor training works. There are few apps, if any, that coordinate closely with hardware manufacturers to ensure the latest hardware is implemented not just early, but properly. We can look at examples like the Wahoo KICKR CLIMB, where FulGaz has implemented CLIMB support in a manner more immersive than many of the big platforms because they’re willing to take the time to implement features properly rather than just take shortcuts. The same is true of <a href=\"https://www.dcrainmaker.com/2021/01/wahoo-starts-shipping-kickr-2020-direct-connect-cable-hands-on-details.html\">Wahoo’s Direct Connect technology</a>, already implemented in FulGaz on from announcement Day 1. Nearly a year later, Zwift has yet to implement it.</p>\n<p>Still, I’m optimistic that after discussions with FulGaz and Ironman (both together and separately), that they kinda seem to get it here. In some ways, both companies kinda need each other. Ironman needs a platform that it can run indoor races on and host Ironman content without the complexities of depending on 3rd party platforms for every whim. And inversely, FulGaz can benefit from the financial power and reach that Ironman has – even though FulGaz doesn’t have any plans at all to cater to triathletes in their core app (no running is planned there).</p>\n<p>If Ironman can build a good app that’s clean and intuitive, without becoming overturned by corporate stuff or belabored advertising – it could be really appealing to Ironman athletes at the right price. Having all the Ironman courses in one app at the right price for both run and ride, including the eventual inclusion of races is super appealing and largely a gap in the market. Whether or not the two companies can pull that off remains to be seen. I’m guessing by about a year from now we’ll know the answer.</p>\n<p>The good news if you’re an Ironman athlete is that this doesn’t sound like Ironman trying to get into the app game and getting distracted from triathlon. When asked whether or not they see this investment puling in non-Ironman athletes and trying to compete with the likes of Zwift or other platforms, CEO Andrew Messick said that they have “no desire to”, and that ultimately “our focus on the IM connected app is on Ironman athletes”.</p>\n<p>With that, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"1b2b4b0785cfb35271eec76b82271c23a6736f454807360edfe958d455a20495","category":"Cycling"}