{"title":"Determination of volatile organic solvents in photoinitiators using headspace gas chromatography","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400002?af=R","date":1707368346000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/9923098e-548e-4180-8cb8-879d20f3f5c9/appl202400002-gra-0001-m.png\" alt=\"Determination of volatile organic solvents in photoinitiators using headspace gas chromatography\" /><p>A headspace gas chromatography method has been developed for the determination of residual organic solvnts in photoinitiators. Using water-glyceryl triacetate as the solvent, the method was used to determine the residual levels of 11 volatile organic compounds.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>A rapid headspace gas chromatography method has been developed for the determination of residual organic solvents in photoinitiators. Using water-glyceryl triacetate as the solvent, the method was used to determine the residual levels of 11 volatile organic compounds (VOCs), namely, benzene, toluene, xylene, methanol, ethanol, acetonitrile, acetone, n-hexane, dichloromethane, tetrahydrofuran, and ethyl acetate, in photoinitiators. Under the selected instrument operating conditions, all the residual solvents were completely separated. A detailed analysis was conducted on these 11 organic solvents. The mass concentrations of these solvents were linearly correlated with the chromatographic peak area, with a linear <i>R</i>\n<sup>2</sup> is called determination coefficient <i>R</i>\n<sup>2</sup> ≥ 0.99, and the relative standard deviation (<i>n</i> = 5) was less than 5.8%. The recovery rates of n-hexane and toluene were 90.3% and 102.9%, respectively. The method exhibits good precision and accuracy, making it suitable for the rapid detection and inspection of 11 residual VOC components in photoinitiators. The practical applicability of the method was evaluated by blue applicability grade index and the score was 75.0 demonstrating its good practicality and applicability.</p>","author":"Yulian Pang, \nGuiqin Tian, \nXun Sun, \nHongmei Li, \nFan Liu, \nQian Wu, \nPengfei Lai, \nPeng Luo, \nYingquan Zou","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"1b2cba08409b4ad4b0400afc759e4de1976ec95b29c26acd759f7e2791418fbb","category":"Environment"}