{"title":"Overwinter and Spring Thaw Nitrous Oxide Fluxes in a Northern Prairie Cropland Are Limited but a Significant Proportion of Annual Emissions","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023GB008051?af=R","date":1711541717000,"content":"<h2>Abstract</h2>\n<p>Croplands that experience seasonal soil freezing and thawing have been shown to be significant sources of N<sub>2</sub>O emissions. Yet, there is a paucity of year-round N<sub>2</sub>O emission data for one of the most significant crop production regions that seasonally freeze, the Prairies. Here, we present micrometeorological N<sub>2</sub>O fluxes measured over 4 years in Saskatchewan, Canada, to evaluate the magnitude of freeze-thaw N<sub>2</sub>O emissions and investigate its driving factors. Significant thaw related emissions occurred in 2 of the 4 years and were associated with relatively higher fall nitrate levels and a more gradual soil thawing period. Overall, fall soil nitrate levels were a strong explanatory variable for the differences in non-growing season (NGS) N<sub>2</sub>O emission (<i>r</i>\n<sup>2</sup> = 0.485). Measured cumulative N<sub>2</sub>O emissions for the NGS were 123–938 g N ha<sup>−1</sup> and were much smaller than those obtained at other cold climate sites but amounted to 52% of annual totals on average. The November to April period contributed 30% of the annual total emissions in years without major thaw events, but 70% in years with significant thaws. NGS N<sub>2</sub>O emissions were not explained by cumulative freezing degree days unlike most other cold climate sites. We propose that NGS N<sub>2</sub>O emissions are more strongly influenced by thaw dynamics during freezing-thawing conditions in dry regions, whereas freezing intensity is the dominant factor for wetter regions. Our results indicate that even for a semi-arid region freeze-thaw is an important source of N<sub>2</sub>O emissions and must be considered for more accurate reporting and development of mitigation strategies.</p>","author":"Claudia Wagner‐Riddle, \nKate A. Congreves, \nShannon E. Brown, \nWarren D. Helgason, \nRichard E. Farrell","siteTitle":"Wiley: Global Biogeochemical Cycles: Table of Contents","siteHash":"a2d4e750daa5e386ca7dda0c54cc50454a723cbd123b964bfed1d56a4712b632","entryHash":"1b3e5fb8c866c061baa4449ae20b2173a882b82f8e4f255bac04218d52225013","category":"Environment"}