{"title":"Gold Deposits Related to the Island Arc Formations and Ophiolitic Complexes of Eastern Cuba: A Review","link":"https://www.preprints.org/manuscript/202403.1331/v1","date":1711080888000,"content":"The gold deposits of the eastern region of Cuba are genetically related to the lithological formations of the island arc and the ophiolitic complex, which have been studied and exploited since the time of the Spanish colonization in the mid-sixteenth century. These deposits are part of the so-called Aguas Claras-Guajabales mineral field, in the Holguín Province (Cuba) and lie in an extensive elongated strip of approximately 15 km in length. The object of this work is to make an orderly, detailed, and chronological review of the geological and mining work carried out in this region as well as to highlight the degree of study achieved in each of the stages of research. To facilitate this work, an extensive bibliographic review of all available materials was planned and carried out, such as reports, manuals, monographs, and articles. The results obtained from this study highlight that gold mineralization is closely linked to metasomatic processes produced by the circulation of hydrothermal fluids that affected different lithologies of both the volcanic island arc and the ophiolitic complex, it is noteworthy that the highest gold contents are mainly where the lithologies contact each other. This highlights the fact that the presence of alterations such as serpentinization, listvenitization, rodingitization and propylitization have played a primary role in the deposition of gold during mineralization processes. This work could be a very useful guide for future research in this region, as it is an orderly, concrete, and practical compilation of the characteristics of the mineralization and alterations, as well as a precise indication of the spatial position, thicknesses, and contents of the gold horizons.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1b451487d2b5993b0dc8d1b817e36f45fe583f56688c3ae06896f83133605fdf","category":"Interdisciplinary"}