{"title":"Young carers’ experiences of services and support: What is helpful and how can support be improved?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300551","date":1711720800000,"content":"<p>by Madeleine Stevens, Nicola Brimblecombe, Sara Gowen, Robin Skyer, Jo Moriarty</p>\r\n\r\nGlobally, many children and young people provide support to family members who have poor physical or mental health, are disabled, or misuse drugs and alcohol. These young carers are at higher risk of poorer education, employment, health, and social participation outcomes compared to their peers without caring responsibilities. In the UK, awareness of the challenges faced by young carers, and a framework of their legal rights, are relatively well-developed. However, it is unclear how support can most effectively be provided. Taking a qualitative approach we explored experiences and views of young carers (aged 9–25), conducting focus groups or interviews with 133 young carers and 17 parent care recipients. We explored what aspects of services and support are seen as helpful, valued, and acceptable to young people, and what could be improved. A reflexive, thematic analysis was conducted. Valued support came from: young carers groups (including peer support), school-based and mental health support, and support for the care recipient. Helpful aspects of support included someone who listens and understands, and can be trusted not to break confidentiality; involving the young person in information, decision-making and planning (sometimes including regarding the care recipient); and finding and linking to other services. There was a difficult balance for practitioners between being perceived as proactive, persistent or intrusive when offering support to a young carer, but it was important to allow opportunities for young carers, and those they care for, to change their minds about when and whether to access support. Many interactions were perceived as unhelpful or threatening to the family, and there was often not enough of the type of support that was valued. Sharing of positive experiences can be beneficial for both people seeking support and those delivering it; key messages on what is helpful from the perspective of young carers can help support and shape practice approaches.","author":"Madeleine Stevens","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1b491d1cb6b9cf16d21cabae08acadb3113a9fb72d271014dc5092245fec9a6f","category":"Interdisciplinary"}