{"title":"Meaning and prediction of ‘excess mortality’: a comparison of Covid-19 and pre-Covid-19 mortality data in 31 Eurostat countries from 1965 to 2021","link":"https://academic.oup.com/biomethods/article/doi/10.1093/biomethods/bpae031/7676124?rss=1","date":1715904000000,"content":"<span><div>Abstract</div>Determining ‘excess mortality’ makes it possible to compare the burden of disasters between countries and over time, and thus also to evaluate the success of mitigation measures. However, the debate on coronavirus disease 2019 (Covid-19) has exposed that calculations of excess mortalities vary considerably depending on the method and its specification. Moreover, it is often unclear what exactly is meant by ‘excess mortality’. We define excess mortality as the excess over the number of deaths that would have been expected counter-factually, that is without the catastrophic event in question. Based on this definition, we use a very parsimonious calculation method, namely the linear extrapolation of death figures from previous years to determine the excess mortality during the Covid-19 pandemic. But unlike most other literature on this topic, we first evaluated and optimized the specification of our method using a larger historical data set in order to identify and minimize estimation errors and biases. The result shows that excess mortality rates in the literature are often inflated. Moreover, they would have exhibited considerable excess mortalities in the period before Covid-19, if this value had already been of public interest at that time. Three conclusions can be drawn from this study and its findings: (i) All calculation methods for current figures should first be evaluated against past figures. (ii) To avoid alarm fatigue, thresholds should be introduced which would differentiate between ‘usual fluctuations’ and ‘remarkable excess’. (iii) Statistical offices could provide more realistic estimates.</span>","author":"","siteTitle":"Biology Methods and Protocols Current Issue","siteHash":"69c994dba77628d461517adf354c299799d03c68fbf0494d0a5619d40a95f351","entryHash":"1b51f929eb5be1ded770d5abe386402b523a79c7e818c44a41bc83f9aa5fc092","category":"Environment"}