{"title":"Discord เปิดตัว Premium Membership เปิดให้เซิร์ฟเวอร์เก็บค่าสมาชิกได้, หักส่วนแบ่ง 10%","link":"https://www.blognone.com/node/126206","date":1638928271000,"content":"<div><div><div><p>โครงสร้างการทำงานของ Discord นับตั้งแต่อดีตมาถึงปัจจุบันคือ ผู้ใช้ทุกคนสามารถสร้างเซิร์ฟเวอร์ (ชุมชนผู้สนใจเรื่องต่างๆ) ได้เอง สร้างได้ฟรี ชวนผู้ใช้คนอื่นๆ มาเข้าร่วมเซิร์ฟเวอร์ได้ฟรี โดย Discord หาเงินจาก 2 ทางคือ ค่าสมาชิกแบบพรีเมียม (<a href=\"https://discord.com/nitro\">Nitro</a>) ที่จ่ายรายเดือนแล้วได้ฟีเจอร์พิเศษเพิ่ม และการซื้อ <a href=\"https://support.discord.com/hc/en-us/articles/360028038352-Server-Boosting-FAQ-\">Boost</a> เพื่อสนับสนุนเซิร์ฟเวอร์ที่ชอบให้เลื่อนชั้น และมีฟีเจอร์พิเศษเพิ่ม</p>\n<p>ล่าสุด Discord เพิ่มช่องทางใหม่ในการหารายได้คือ Premium Membership เป็นการเปิดให้เซิร์ฟเวอร์ตั้งค่าได้ว่าจะเก็บค่าเข้าร่วมหรือไม่ เจ้าของเซิร์ฟเวอร์สามารถกำหนดระดับของสมาชิกพร้อมตั้งราคาได้เอง (แนวทางคล้ายสมาชิกช่อง YouTube) โดย Discord จะหักส่วนแบ่งรายได้ 10% ส่วนเจ้าของเซิร์ฟเวอร์ได้เงิน 90%</p>\n<p>Sumeet Vaidya ผู้อำนวยการฝ่ายวิศวกรรมของ Discord ให้สัมภาษณ์กับ The Verge ว่าการเพิ่มช่องทางหารายได้ให้ครีเอเตอร์เจ้าของเซิร์ฟเวอร์ จะช่วยให้ชุมชนรันได้อย่างยั่งยืนกว่าเดิม และการที่เป็นฟีเจอร์ของ Discord เอง ทำให้เจ้าของเซิร์ฟเวอร์ไม่จำเป็นต้องไปหาวิธีเก็บเงินทางอื่น (เช่น Twitch, YouTube, Patreon) ส่วนการหักส่วนแบ่งแค่ 10% ก็เพื่อให้ครีเอเตอร์มีรายได้เยอะที่สุดเท่าที่เป็นไปได้</p>\n<p>ตอนนี้ Discord ยังทดสอบ Premium Membership ในวงจำกัดเท่านั้น และยังไม่บอกว่าจะเปิดใช้งานทั่วไปเมื่อใด</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/be7393dc4cf0e710eca5f52e37ce65ff.png\" /></p>\n<p>ที่มา - <a href=\"https://discord.com/blog/building-sustainable-creator-communities-on-discord\">Discord</a>, <a href=\"https://www.theverge.com/2021/12/7/22822042/discord-premium-memberships-creators-monetize-servers-feature\">The Verge</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/discord\">Discord</a></div><div><a href=\"/topics/social-media\">Social Media</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1b5332b95fc9dca90da766c8a2abc72237b61dedbb9e252282a2595aa4e6de76","category":"Thai"}