{"title":"เปิดตัว Fitbit Charge 5 จอสีรุ่นแรกของ Charge มีเซ็นเซอร์ SpO2 ราคา 7,690 บาท","link":"https://www.blognone.com/node/124430","date":1629950059000,"content":"<div><div><div><p>Fitbit Charge 5 เปิดตัวแล้ว หน้าจอ AMOLED พร้อมฟีเจอร์ always on เป็นครั้งแรกที่สปอร์ตแบนด์ตระกูล Charge เป็นจอสี มาพร้อมมี GPS ในตัว แบตเตอรี่ใช้งานได้ยาวนาน 7 วัน และสมาชิก Fitbit Premium ฟรี 6 เดือน</p>\n<p>Fitbit Charge 5 จะวัดอัตราการเต้นของหัวใจตลอดเวลา หากใส่นอน ตัวเครื่องจะติดตามการนอนหลับ แสดง Sleep Score คุณภาพการนอน ระยะเวลาที่อยู่ในการนอนหลับระดับต่างๆ และมีฟีเจอร์ Smart Wake ช่วยปลุกผู้ใช้ในช่วงที่เหมาะกับการตื่น ทุกเช้าระบบจะประเมินคะแนน Daily Readiness คะแนนความอ่อนล้าของร่างกาย เพื่อนำไปแนะนำการออกกำลังกายประจำวันว่าควรอยู่ในโซนใดกี่นาที</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e35e5be65ab48c101f76ccbc96d353c4.jpg\" /></p>\n<p>Charge 5 ยังมีเซ็นเซอร์ EDA วัดการตอบสนองของร่างกายต่อความเครียด จากการเปลี่ยนแปลงของต่อมเหงื่อบริเวณนิ้วมือ มีเซ็นเซอร์ SpO2 และวัดการเปลี่ยนแปลงอุณหภูมิของร่างกาย เพื่อนำไปแสดงใน Health Metrics Dashboard ที่จะติดตามผลระยะยาวได้เมื่อมี Fitbit Premium</p>\n<p>นอกจากเปิดตัว Charge 5 แล้ว Ars Technica ระบุว่า Fitbit เปิดเผยข้อมูลเพิ่มเติมว่าในอนาคตอาจทำสมาร์ทวอทช์ที่ใช้ Wear OS ด้วย <a href=\"https://www.blognone.com/node/120606\">หลัง Google ซื้อบริษัทเสร็จสิ้นไปเมื่อช่วงต้นปี</a> ซึ่งอาจอยู่เฉพาะในรุ่น Versa หรือ Sense ที่เป็นไลน์สมาร์ทวอทช์ของ Fitbit ในขณะที่ Charge เป็นไลน์สปอร์ตแบนด์ที่แม้จะมีฟีเจอร์ด้านออกกำลังกายเยอะ แต่อาจไม่ได้ไปต่อกับ Wear OS</p>\n<p>Fitbit Charge 5 สั่งจองได้ทางเว็บไซต์ <a href=\"https://www.fitbit.com/global/th/products/trackers/charge5?sku=421BKBK\">Fitbit</a> วางจำหน่ายฤดูใบไม้ร่วง (กันยายน-พฤศจิกายน) นี้ ราคา 7,690 บาท</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7f36f8d57ff55f47774a48a8313821e5.jpg\" /></p>\n<p>ที่มา - <a href=\"https://arstechnica.com/gadgets/2021/08/fitbit-announces-charge-5-teases-future-google-collaboration/\">Ars Technica</a>, จดหมายประชาสัมพันธ์</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/fitbit\">Fitbit</a></div><div><a href=\"/topics/sport-tracker\">Sport Tracker</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1b600305d5232a557528526454c7c2fcbf0aa7490a7c2044aa8835bf2c8a718f","category":"Thai"}