{"title":"Google Domains Shutting Down, Assets Sold to Squarespace","link":"https://9to5google.com/2023/06/15/google-domains-squarespace/","date":1686965746000,"content":"\n<p>Abner Li, reporting for 9to5Google:</p>\n\n<blockquote>\n  <p>In an <a href=\"https://www.prnewswire.com/news-releases/squarespace-enters-definitive-agreement-to-acquire-google-domains-assets-301852507.html?tc=eml_cleartime\">unexpected announcement</a> today, <a href=\"https://domains.google/\">Google\nDomains</a> is “winding down following a transition period,”\nwith Squarespace taking over the business and assets.</p>\n\n<p>Squarespace announced today that it “entered into a definitive\nasset purchase agreement with Google, whereby Squarespace will\nacquire the assets associated with the Google Domains business.”\nThis includes “approximately 10 million domains hosted on Google\nDomains spread across millions of customers.”</p>\n\n<p>Google cited “efforts to sharpen our focus” in selling the Google\nDomains registrar business, which <a href=\"https://9to5google.com/2014/06/23/google-announces-new-domain-registration-service-currently-invite-only/\">launched in 2014</a> as a\nbig proponent of HTTPS and <a href=\"https://9to5google.com/2018/10/02/google-page-tld-registry/\">top-level domains (TLDs)</a> as of\nlate. The service <a href=\"https://9to5google.com/2022/03/15/google-domains-discount/\">exited beta in 2022</a>.</p>\n</blockquote>\n\n<p>Funny enough, I just used Google Domains for the first time two weeks ago to register a <a href=\"https://icannwiki.org/.foo\">.foo</a> domain name <a href=\"https://bsky.app/profile/gruber.foo\">to use with Bluesky</a>. (<a href=\"https://skeeet.xyz?url=https://staging.bsky.app/profile/gruber.foo/post/3jyd4zjd5ox2y\">Very easy to do</a>, and one of Bluesky’s best and most innovative features.) I went to check on it when I saw this news that Google Domains is shutting down, and I had an alert that the new domain name I registered would be put on “hold” <em>today</em> if I didn’t verify the email address I used to register it. I hadn’t seen any verification emails from Google about it. I told Google Domains to send another verification email. Still didn’t see it. Turns out that even though I used an @gmail.com address to register the domain, every single email from Google Domains was being flagged as spam. So Google’s own email service considers all emails from Google’s own domain name service to be spam.</p>\n\n<p>So, yeah, I’d say Google needs to focus.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/16/google-domains\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"1b61ff879d8d2a4ee316ff324292155650e64ee09123cce08ffa0aaf67ea6f30","category":"Tech"}