{"title":"River Hydrological Regime Changes and Their Attribution: A Case Study in the Upper Reaches of the Yangtze River Using a Multi‐Model Approach","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4377?af=R","date":1727852400000,"content":"<h2>ABSTRACT</h2>\n<p>A comprehensive quantitative evaluation framework was used to analyze the driving factors affecting the hydrological conditions and runoff changes in the upper Yangtze River basin across multiple time scales (annual, seasonal, and monthly). This study focuses on utilizing the LSTM model and the WEP-L model for the quantitative assessment of factors influencing runoff changes. Additionally, we calculated the IHA indicators for actual runoff and the LSTM model-simulated runoff and conducted a comparative analysis using the range of variability approach (RVA) to study changes in the overall hydrological regime of the river. Following an abrupt change, the runoff in the upper reaches of the Yangtze River decreased by 6.6%, and the ecological response of the basin showed a negative trend, as reflected in the changes of five sets of hydrological-ecological indicators. The contributions of various driving forces exhibited significant differences across different time scales. On an annual scale, the LSTM model indicated that runoff was predominantly influenced by human activities with a contribution rate of 55%, whereas the WEP-L model indicated that climate factors were the dominant influence, with a contribution rate of 75%. On a seasonal scale, the WEP-L model showed that runoff was more influenced by climate in summer and autumn, with relative contribution rates of 68% and 73%, respectively. Conversely, the LSTM model showed that runoff was more influenced by human activities in summer and winter, with relative contribution rates of 98% and 91%, respectively. On a monthly scale, the situation was more complex. The LSTM model results indicated significant contributions from human activities in May, July, October, and November (76%, 68%, 69%, and 87%, respectively) and slightly higher contributions than climate factors in February and September (51% and 57%, respectively). In the remaining months (13%–95%), climate factors were the primary driving force. The WEP-L model results indicated significant contributions from land-use changes in January, February, and May (79%, 74%, and 80%, respectively) and slightly higher contributions than climate factors in December (57%), with climate factors being the primary driving force in the remaining months (20%–92%). The findings of this study provide valuable insights for the ecological protection and restoration of the upper Yangtze River basin.</p>","author":"Hongxiang Wang, \nJiaqi Lan, \nNing He, \nXuyang Jiao, \nHandong Ye, \nChaohui Sun, \nGaozhen Wang, \nWenxian Guo","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"1b687dee397efb0f300efd84df5005ee8411364922fa7f3f2d29dd7ef5273e15","category":"Environment"}