{"title":"A new Hope | The inside story on Team GB’s radical Tokyo 2020 track bike","link":"https://www.bikeradar.com/features/pro-bike/hope-hb-t/","date":1627895726000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/A-new-hope-04-d01ab2b.jpg?quality=90&amp;resize=620,413\" />                                            <p><em>This feature was originally published in issue 362 of <a href=\"https://www.cyclingplus.com/\" target=\"_blank\">Cycling Plus magazine</a>.</em></p>\n<p>When Hope Technology <a href=\"https://www.bikeradar.com/news/hope-lotus-hb-t/\">announced the HB.T track bike in October 2019</a>, created in collaboration with British racing car and bicycle manufacturer Lotus, from a British Cycling design, it had everyone talking. Its radical front end and those seatstays. It seemed to come out of nowhere. We knew we had to see it for ourselves as soon as possible.</p>\n<p>But to understand how this small Lancashire firm rose to the top of the cycling world, with the bike being ridden by Team GB in the <a href=\"https://www.bikeradar.com/news/guide-to-olympic-cycling-how-to-watch/\">Tokyo 2020 track cycling events,</a> it helps to first look back at how Hope began, to find out how it got involved in such a radical bike.</p>\n<p>In 1989, two former Rolls Royce aerospace engineers had a problem: the cantilever brakes on their <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">mountain bikes</a> weren’t good enough, especially compared to the disc brakes on their trials motorbikes. It sounds counter-intuitive, but if you want to ride fast, you need to have good brakes. So they decided to make their own disc brakes and hubs for their mountain bikes, based on motorbike brakes.</p>\n<p>Initially, those engineers, Ian Weatherill and Simon Sharp, made these key parts for use solely by themselves and their friends, but due to their effectiveness and popularity, they ended up forming Hope Technology in 1991 to bring them to market. The company was named after the ‘Hope Shed’ factory space in Colne, Lancashire, to which the founders’ engineering company, IPCO, had recently moved.</p>\n<p>A year later, Hope’s brakes were exhibited on 14 bikes at the 1992 Interbike, in Anaheim, USA. At the time, this was the entire stock of brakes that Hope had.</p>\n<p>They made such a stir that Hope soon had to set up an office in California to deal with burgeoning US sales. Over the next few decades, Hope swiftly built a reputation for high-performing, anodised CNC components, and it kept expanding.</p>\n<p>Each new product in Hope’s catalogue came about in much the same manner as the very first: simply put, the engineers working at Hope finding something they think they can do better.</p>\n<h2>Carbon copies</h2>\n<p>Around 2012, once Hope had practically every bicycle component in its range apart from a frame, it decided to <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/hope-hb-160-mountain-bike-first-ride-review/\">develop a carbon mountain bike frame</a>. However, the HB.160, released in 2017, got a lukewarm reception. The quality of its construction was brilliant, but the geometry felt dated. Undeterred, Hope’s engineers took stock and went back to the drawing board.</p>\n<p>While the HB.160 was in development, Tony Purnell, head of technology at British Cycling, had come to Hope’s factory to see their carbon frame production in person.</p>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/A-new-hope-03-4dc046a.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Hope’s Lancashire factory is embedded in the local community.</span>\n    </figcaption><span>\n                    <i>Mick Kirkman / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/A-new-hope-01-e5f1ed2.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Keeping everything in house gives Hope design and engineering freedom.</span>\n    </figcaption><span>\n                    <i>Mick Kirkman / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/A-new-hope-02-5759d28.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>British Cycling approached Hope to build the HB.T.</span>\n    </figcaption><span>\n                    <i>Mick Kirkman / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/A-new-hope-11-74f55b1.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The HB.T takes over from the Cérvelo T5GB as Team GB’s track bike of choice.</span>\n    </figcaption><span>\n                    <i>Mick Kirkman / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<p>British Cycling’s partnership with Cérvelo, which made the <a href=\"https://www.bikeradar.com/news/meet-team-gbs-weapon-of-choice-for-the-rio-olympics/\">T5GB track bike used at the 2016 Rio Olympics</a>, was due to continue up to 2020 and the Tokyo Olympic Games, but the relationship had been rocky – even though Team GB’s cyclists had a successful Olympics, stories had appeared in the national press alleging that the bikes weren’t up to scratch in the run-up to the games. British Cycling needed a Plan B.</p>\n<p>A few months after that initial visit, Ian Weatherill met Purnell again. Purnell told Weatherill about a design his team at British Cycling had come up with for a revolutionary new track bike (British Cycling’s Plan B). Lotus – who famously engineered Chris Boardman’s Barcelona 1992 gold medal-winning bike, <a href=\"https://www.bikeradar.com/features/throwback-thursday-1996-lotus-sport-110/\">the Type 108</a>, based on Mike Burrows’ original design – was on board to make the forks, but Purnell asked if Hope could just make Team GB a single bike as a test.</p>\n<p>Moulds are a key part of the equation in carbon frame manufacturing and would ordinarily pose a problem in satisfying such a request. According to Weatherill, purchasing moulds to spec can potentially cost between £30,000 to £50,000 per mould, but Hope has the advantage of having huge experience in metal machining – something that most companies working with composites lack. Consequently, Hope can make its own moulds.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Hope’s frame moulds cost less because they can be made in house.</span></figcaption><span> <i>Mick Kirkman / Immediate Media</i></span></div>\n<p>As well as saving money, it also means that Hope’s engineers can make revisions to its moulds when necessary. Hope can try something, get it wrong, and try again, many more times than most other small bicycle companies.</p>\n<p>So Hope set about making Purnell that one bike, but eventually Plan B became Plan A. British Cycling asked if Hope could make the <a href=\"https://www.bikeradar.com/features/pro-bike/track-cycling-bikes-explained/\">track bikes for every rider on the team for the Tokyo Olympics</a>. The bikes would need to be ready before the last Track World Cup in 2019, in order to qualify for use in Tokyo, and, as per UCI rules, Hope would also have to make the bike commercially available.</p>\n<p>This might have been a moment for Hope to point out that making track bikes not just for every Olympian on the British team, but also potentially for every deep-pocketed amateur rider out there, was not quite what it had originally signed up for. But Weatherill realised this was too good an opportunity to pass up. “If we’d said, ‘No’ they wouldn’t have asked us again,” he says. “So we said, ‘Why not? Let’s have a go.’”</p>\n<h2>Plan A</h2>\n<p>Sam Pendred, a 23-year-old design engineer at Hope, explains the concept behind the unusual design. “There’s always a rider on the bike, and the rider is the problem,” he says. “Why design a really good bike if the rider is going to ruin it?”</p>\n<p>Pendred says moving the fork and seatstays away from the wheels has a beneficial aerodynamic effect. It reduces the forks’ interaction with the front wheel, making the bike faster with a broader range of wheels, but the main function of the forks is to direct the airflow around a rider’s legs.</p>\n<p>Despite being ubiquitously shaved and partially covered in slippery fabrics, legs are messy when it comes to aerodynamics. It makes sense, when you think about it – the narrow track bikes we’re so used to seeing look wonderfully sleek and aerodynamic on their own, but sit a rider on any of them and it suddenly twigs that Team GB, Hope and Lotus might be onto something here.</p>\n<p>The obvious question to ask, then, is just how good is it? Weatherill tells us that they think it’s “around three per cent better than anything else currently available”. If he’s right, that’s enormous.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Ian Weatherill (left) and design engineer Sam Pendred (right) stand over the HB.T.</span></figcaption><span> <i>Mick Kirkman / Immediate Media</i></span></div>\n<p>“In terms of how fast it is – we know it’s going to be quick,” says Ed Clancy, a member of Team GB’s team pursuit squad. “It’s hard to say just how fast it is, but I’ve got faith in the engineers and scientists.”</p>\n<p>The bike is only part of an overall package that includes a rider, the bike itself and, in some instances, team-mates, but the gold medal in the team pursuit at the previous Olympics was won (by Team GB) with a winning margin of less than half a per cent.</p>\n<p>So why hasn’t anyone else thought of this before? In all likelihood, someone probably has (Team GB had some wide forks in 2012 that were likely designed for a similar purpose), but perhaps it wasn’t previously possible to build a bike as radical as this and still hit the benchmarks for other qualities, such as stiffness and weight.</p>\n<p>That it’s now possible may partly be due to crucial changes in the UCI rules that govern tube shapes: the 3:1 ratio rule for tube shapes (the size of a tube between length and width, brought in to limit the size and shape of aerofoil tubing on bicycles) was amended in January 2017 (it still applies to components). It states that frame and fork tubes must fit within a series of 8cm boxes, and be at least 25mm wide, or (crucially for the HB.T) 10mm wide for the seatstays, chainstays and forks.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Hope x Lotus HB.T in all its glory.</span></figcaption><span> <i>Mick Kirkman / Immediate Media</i></span></div>\n<p>But it’s also very likely down to advances in materials and construction methods, as well as some key advantages that a company like Hope has, that makes it possible to create a bike with these tube shapes; a bike that can stand up to the monstrous power of its riders.</p>\n<p>“Not every company could do this,” Pendred says. “New moulds were required for every iteration of the seatstays, but because we make our own, that was a viable option.”</p>\n<p>Those narrow, bendy tube shapes don’t exactly appear to lend themselves to rigidity or robustness, after all. Nevertheless, Pendred assures us the HB.T is a bike for all types of track rider because it’s made primarily from high modulus carbon fibre (the lightest, stiffest and most expensive type of carbon fibre). Pendred also tells us that most bikes claiming to be made from it often only contain a few strips of the stuff in selected locations, and use cheaper, lower modulus fibres throughout the rest of the bike to save money.</p>\n<p>Other than being expensive (<a href=\"https://www.bikeradar.com/news/hope-track-bike-price/\">£15,500 + VAT for the frameset</a>, if you were wondering), Pendred explains that “the problem with high modulus carbon fibre is that it’s very brittle in its uncured form”.</p>\n<p>With that in mind, Hope hired Chris Clarke, a composites expert who Weatherill tells us did the laying up of “all of Team GB’s UKSI bikes” – <a href=\"https://www.bikeradar.com/news/time-trial-bike-setups-at-the-2012-olympics/\">used to winning effect at the London 2012 Olympics</a> – to lay up the HB.T frames. Clarke is, according to everyone at Hope, one of the best in the business, and the fact that many of the UKSI frames are still in use to this day speaks for itself.</p>\n<p>Then there are all the 3D-printed parts, most of which are titanium (though the fork yoke is 3D-printed aluminium) to save a little weight. Hope and Lotus have partnered with Renishaw, another British engineering company, to produce these.</p>\n<section><div>\n        <h4>Ahead of the game | Chris Boardman on the Hope HB.T</h4>\n<p>Chris Boardman, who rode the Lotus bike in Barcelona, and for years headed up British Cycling’s ‘secret squirrel club’ that equipped the team with the fastest bikes, gives his thoughts on the Hope HB.T.</p>\n<p>“For the last 30 years, bike designers have focused on making a bike that was as slippery as possible,” he says. “Meanwhile, in motor sport, due to the need to create downforce, they concentrated on managing and even utilising the drag created by the car to make the overall time faster. In a sense, they lost some battles by creating drag for downforce in order to win the war, leading to faster cornering and, ultimately, faster lap times.</p>\n<p>“This holistic philosophy was brought into the Team GB Research and Development team in 2008, when CFD [computational fluid dynamics] modelling showed how purposefully creating drag in order to create a ‘hole’ in the wind for a body part to pass through could give an overall speed gain. It led to the development of the wide, cambered forks used by Team GB at the 2012 Olympics in London. Looking at this design, they have taken this approach to the next level.</p>\n<p>“Clearly formed specifically to affect airflow over the rider, the Tokyo machine is arguably even more radical than the original Barcelona bike. It’s a culmination of 16 years of non-stop learning, a journey that has led to an unparalleled understanding of airflow.”</p>\n<p>\n\n    </p></div>\n    </section><div>\n    <img /></div><div><figcaption><span><i></i> The HB.T features more metal than most elite bikes.</span></figcaption><span> <i>Mick Kirkman / Immediate Media</i></span></div>\n<p>Parts such as stems and handlebars can be made lighter and stiffer than comparable composite units, thanks to the internal lattice structure. Arguably, though, the more exciting advantages are that parts with very complex shapes can be made quickly, easily and to a completely custom specification, such as the one that joins the seatstays to the seat tube.</p>\n<p>It’s been a long time since we’ve seen much metal at the upper echelons of the sport, but 3D printing might be about to genuinely shake things up when it comes to bicycle design.</p>\n<h2>It’s not about the bike</h2>\n<p>If 3D printing is the future of bicycle design, the future for Hope isn’t yet mapped out. “There’s no grand plan, no predetermined direction,” admits Weatherill. “We just want to take the opportunities as they come. That said, the logical next step for the HB.T bike is surely a time trial bike – with disc brakes, obviously.” It would also make sense that if Hope might be going to make time trial bikes, it will likely also look at making drop bar road bikes, for which the market is much bigger. <em>[Update: You can <a href=\"https://www.bikeradar.com/features/hope-hb-tt-time-trial-bike-prototype/\">read our story on Hope’s prototype time trial bike</a>]</em></p>\n<p>Hope has already invested in local trails, but there are also plans for a velodrome project that Weatherill is working on in the background. He has already purchased land in the local area to build it on, but wants to “save up” to pay for the velodrome himself so that he can do it his way – as with everything else, Weatherill thinks Hope can do it better.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> 3D printing of bike parts: the next big thing?</span></figcaption><span> <i>Mick Kirkman / Immediate Media</i></span></div>\n<p>Nestled among the houses of Barnoldswick, Lancashire, you can’t help but notice how embedded the company is in the local community. This isn’t by accident. It would have been easy to have moved manufacturing to the Far East in search of greater profit margins, but Weatherill says that he isn’t in this business simply to make as much money as possible. Hope, he says, is making the bicycle parts for bicycles he and his employees want to ride.</p>\n<p>Lancashire might be a beautiful place to live, but Lancashire County Council ranks the Pendle borough, within which Barnoldswick sits, as one of the most deprived areas of the county, and Hope provides a valuable source of good jobs for the area.</p>\n<p>This isn’t a disruptive business that aims to extract maximum profit from an industry, and grow rapidly on debt before eventually getting sold off to a multinational. Hope has been in the area for 30 years, and you get the distinct impression that it intends to stick around for a lot longer.</p>\n<p>“Sometimes,” says Weatherill, “it’s not all about the money.”</p>\n<p>It’s not very often that you hear people in business say things like that.</p>\n<h2>Hope HB.T specification</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Will Team GB dominate in the velodrome again?</span></figcaption><span> <i>Mick Kirkman / Immediate Media</i></span></div>\n<ul><li><strong>Sizes available:</strong> Eight</li>\n<li><strong>Weight:</strong> 7.5kg</li>\n<li><strong>Frame weight:</strong> 1,500g</li>\n<li><strong>Frame:</strong> Carbon fibre and 3D-printed titanium, made by Hope Technology with 3D-printed parts made by Renishaw</li>\n<li><strong>Fork:</strong> Carbon fibre and 3D-printed aluminium, made by Lotus with 3D-printed parts made by Renishaw</li>\n<li><strong>Handlebar:</strong> 3D-printed titanium, made by Renishaw</li>\n<li><strong>Stem:</strong> 3D-printed titanium, made by Renishaw</li>\n<li><strong>Wheels:</strong> One-piece disc wheels, manufactured using a revolutionary technique that means an entire wheel can be made in a single mould.</li>\n</ul>","author":"Simon Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"1b81573e36a20fe232851a3a1fbf6d64379c05f86c132f8304bdca82db04a345","category":"Cycling"}