{"title":"Geopolymer Cement in Pavement Applications: Bridging Sustainability and Performance, an In-Depth Review","link":"https://www.preprints.org/manuscript/202404.0619/v1","date":1712653207000,"content":"Growing concerns about the greenhouse effect, global warming, and adverse climate changes primarily stemming from carbon dioxide (CO2) emissions in traditional Portland cement (OPC) used in civil engineering construction, have prompted a shift toward eco-friendly alternatives like geopolymer cement (GPC). Over the last few decades, significant advancements have been made in developing environmentally sustainable pavement construction materials such as GPC to mitigate global CO2 emissions. The success of geopolymer cement (GPC) as an eco-friendly alternative to OPC has garnered attention for its potential to lower carbon emissions and enhance durability. This is attributed to the sustainable production method of GPC, where industrial cementitious waste materials (such as fly ash (FA), metakaolin (MK), mine tailings (MT), slag, etc.) are combined with an eco-friendly alkaline activator and water through the geopolymerization process. Numerous studies on geopolymer concrete indicate that, like OPC, GPC exhibits comparable mechanical properties, including strength, fire resistance, chemical resistance, and durability. This review explores the properties and applications of GPC as a sustainable material in pavement construction, exploring key studies and advancements in geopolymer technology, particularly its suitability for pavement applications. The assessment covers the mechanical properties, long-term performance, and environmental impact of geopolymer-based pavements, providing a comprehensive overview to inform policymakers, engineers, and researchers about the viability of geopolymer-based materials as a sustainable solution for modern pavement construction.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1b85f5dee323962e96807fa4095f98a573757fc7655fa5dd7e2bc0cdebfd1b41","category":"Interdisciplinary"}