{"title":"Trump Co-Defendant Kenneth Chesebro Strikes Plea Deal With Georgia Prosecutors","link":"https://www.nbcnews.com/politics/donald-trump/trump-chesebro-plea-deal-georgia-trial-rcna121387","date":1697824345000,"content":"\n<p>Charlie Gile and Katherine Doyle, reporting for NBC News from Atlanta:</p>\n\n<blockquote>\n  <p>Trump campaign legal adviser Kenneth Chesebro struck a deal with prosecutors from the Fulton County, Georgia, district attorney’s office in its 2020 election interference case on Friday.</p>\n\n<p>Chesebro, who was charged alongside Donald Trump and more than a dozen other codefendants with attempting to delay the transfer of power after the 2020 election, was scheduled to stand trial this week. He accepted the offer as jury selection was underway on Friday, after 450 potential jurors had completed a lengthy questionnaire on what would be asked. He had rejected an earlier deal late last month.</p>\n\n<p>Standing beside his attorney in court, Chesebro pleaded guilty to a felony count of conspiracy to commit filing false documents and agreed to testify in the case as part of the deal.</p>\n\n<p>The Trump attorney faces five years probation, a $5,000 fine, 100 hours of community service, and must continue to provide documents and evidence to the state, according to the terms of the deal.</p>\n</blockquote>\n\n<p>Yesterday crackpot Sidney “The Kraken” Powell <a href=\"https://www.cnn.com/2023/10/19/politics/sidney-powell-plea-takeaways/index.html\">flipped</a>. Today, with Chesebro, they flipped a cooperating witness who isn’t nuts. Prosecutors offer probation only when they’re building a stronger case to send those higher up in the conspiracy to prison. If Rudy Giuliani has any sense he’ll flip next. And old Trumpy is fucked. It’s only a question of which prison sentences he’s going to serve in which order.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/10/20/cheesebro-flips\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"1ba9e7b34709323a91c5250e2a55491d3d4a657b024377d9cc20aacb6e4b0eec","category":"Tech"}