{"title":"Identifying Habitat Productivity Thresholds to Assess the Effects of Drought on a Specialist Folivore","link":"https://www.preprints.org/manuscript/202406.1532/v1","date":1718981788000,"content":"Climate change has altered the frequency and severity of extreme weather, which can affect vegetation condition and habitat quality for wildlife. Declines in vegetation productivity during droughts and heatwaves can negatively impact animals that depend on vegetation for water and nutrition. The ability to detect such effects on habitat suitability can reveal refugia, which can be prioritised for protection to improve threatened species conservation. We used the normalised difference vegetation index (NDVI) to look at relationships between vegetation productivity and the presence of koalas (Phascolarctos cinereus) in potential habitat throughout much of their range. Using a large, long-term koala presence dataset, we tested the hypothesis that locations where koalas had been observed would exhibit higher NDVI values than a random, representative sample from the same vegetation group (i.e. woodlands, open forests or tall open forests). We also identified the minimum NDVI threshold at which koalas occurred across time for each vegetation group and compared these to the minimum NDVI values observed across potential koala habitat before and during the millennium drought; one of the worst recorded in Australia. Additionally, we investigated whether vegetation above the minimum NDVI thresholds was significantly closer to perennial water than unsuitable vegetation. We found that koalas tend to occur at locations exhibiting higher NDVI than average for all vegetation groups. We also found that 49% of all vegetation groups maintained a minimum NDVI above the koalas’ NDVI threshold before drought, equating to 190,227 km2, which declined to 166,746 km2 during drought (a 12% reduction). We also found that unsuitable vegetation tended to occur farther from perennial water than suitable vegetation for some vegetation groups. Areas that remained above the NDVI thresholds during the drought should be considered potential refugia for populations during an event of similar magnitude and could indicate future core habitat extent.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1baf5cd66e8ad48cb6a55ccd39ba86c2c6980f3146f4191133e5a28d3dbcb728","category":"Interdisciplinary"}