{"title":"Apple to Sell Apple Watch Ultra 2 & Series 9 Tomorrow without Blood Oxygen Feature","link":"https://www.dcrainmaker.com/2024/01/apple-to-sell-apple-watch-ultra-2-series-9-tomorrow-without-blood-oxygen-feature.html","date":1705544402000,"content":"<p><img title=\"Apple-Watch-Blood-OxygenApp.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Apple-Watch-Blood-OxygenApp-1.jpg\" width=\"720\" height=\"540\" /></p>\n<p>On Wednesday, Apple lost its most recent appeal, which had sought to delay the import and sales ban of the Apple Watch Series 9 &amp; Apple Watch Ultra 2 watches. Apple had won a different appeal back a few weeks ago to continue their sales for a short period, after being blocked by the ITC (International Trade Commission), due to a dispute with Masimo around the blood oxygen sensor (<a href=\"https://www.dcrainmaker.com/2023/12/apple-to-halt-sales-of-apple-watch-ultra-2-series-9.html\">more details on that here</a>). Here are the court documents indicating Apple was denied their appeal:</p>\n<p><img title=\"AppleStay.png\" src=\"https://media.dcrainmaker.com/images/2024/01/AppleStay.png\" width=\"719\" height=\"454\" /></p>\n<p>As a result of the ban, Apple had been quietly working behind the scenes on a solution for watches sold going forward. Previously sold Apple watches will not see the feature disabled, nor watches in other countries.</p>\n<p>Apple confirmed that these new units will be sold starting Thursday, January 18th:</p>\n<blockquote><p>“Apple’s appeal is ongoing, and we believe the US Court of Appeals for the Federal Circuit should reverse the USITC’s decision. We strongly disagree with the USITC decision and resulting orders.</p>\n<p>Pending the appeal, Apple is taking steps to comply with the ruling while ensuring customers have access to Apple Watch with limited disruption. These steps include introducing a version of Apple Watch Series 9 and Apple Watch Ultra 2 in the United States without the Blood Oxygen feature. There is no impact to Apple Watch units previously purchased that include the Blood Oxygen feature.</p>\n<p>Apple Watch Series 9 and Apple Watch Ultra 2 without the Blood Oxygen feature will become available from apple.com starting 6am PT on January 18, and from Apple Stores starting January 18.”</p></blockquote>\n<p>When users open up these new Apple Watches, they’ll still see the Blood Oxygen app (shown at the top of this post) there, however, when they tap on it, it’ll say:</p>\n<blockquote><p>“The Blood Oxygen app is no longer available. Learn more in the Health app on your iPhone.”</p></blockquote>\n<p>Additionally, in the Health app on their iPhone, if they open up ‘Blood Oxygen’, it’ll say the feature is unavailable, and will redirect them to an Apple.com support article. All of which sounds like this is being disabled via software, rather than any specific hardware change (I asked to confirm if it was software or hardware, but haven’t received confirmation either way).</p>\n<p>Again, only US watches sold from that date are impacted, not previously sold units. Now, being almost certainly a software change would mean that should Apple either prevail in the future, or, come to a licensing agreement with Masimo, the feature could be re-enabled via software as well.</p>\n<p><span><strong>A Bit of Background:</strong></span></p>\n<p>For those <a href=\"https://www.dcrainmaker.com/2023/12/apple-to-halt-sales-of-apple-watch-ultra-2-series-9.html\">unfamiliar with the case</a>, Masimo has sued Apple, alleging infringement of Masimo’s patents around the algorithm related to the blood oxygen level sensing technology (which is a portion of the heart rate sensing hardware and software). There’s about a decade’s worth of soap-opera level drama between the two companies, likely worth at least Netflix series or two. However, the long and short of it, is that this past September (2023), the ITC (International Trade Commission, which…is really only a US thing), confirmed Masimo’s infringement claims. Of the 103 claims made across 5 patents, the ITC rejected 98 of them leaving 5 on the table.</p>\n<p>As a result of that, on October 25th, the ITC issued an import ban, which would disallow Apple from importing into the US, selling, or otherwise marketing the impacted products. Which at this point are the Apple Watch Series 9 and Apple Watch Ultra 2, Apple doesn’t no longer sells older units directly. It does not impact the Apple Watch SE, which doesn’t contain such technology. That ban took effect December 25th, 2023, but was immediately halted while this latest appeal from Apple was sorted out.</p>\n<p><img title=\"Apple-Watch-Blood-OxygenAppTest.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Apple-Watch-Blood-OxygenAppTest-1.jpg\" width=\"720\" height=\"540\" /></p>\n<p>However, that sales halt did not and does not stop 3rd party companies (e.g. Best Buy, Walmart, Joe’s Crab Shack), from selling Apple Watches with the feature. Nor, does it stop you from owning one, nor you from using the feature. Additionally, there are specific carve-outs for warranty support of existing watches as well.</p>\n<p>In any event, Apple essentially had four options:</p>\n<blockquote><p>A) Continue fighting various court battles/appeals, without making any changes<br />\nB) Form a licensing agreement with Masimo, to allow sales to continue<br />\nC) Alter the algorithms to the satisfaction of the court, allowing sales to continue<br />\nD) Disable the blood oxygenation sensing feature altogether, thus sidestepping the issue</p></blockquote>\n<p>There’s also some other variants of these for future watches, like redesign of hardware/etc. But given Masimo had opened the door this past summer to a software solution being acceptable (in later statements, they tried to close that door), Apple took that route.</p>\n<p><em>(It should be pointed out that I haven’t dared try to form a specific opinion on who is right in this case. There’s literally a decade’s worth of testimony, much of it actually sealed by the court, and realistically it’s near impossible for an outsider to decide whether or not Apple infringed, without access to that. The details of patent law are incredibly nuanced. It should be pointed out that Apple has counter-sued Masimo for other heart rate sensor things, and additionally, Masimo themselves are also being sued by <a href=\"https://dockets.justia.com/docket/california/cacdce/8:2023cv02475/910162\">another company claiming that Masimo</a> infringed upon their wrist-based pulse oximeter patent. As I said folks, Netflix time.)</em></p>\n<p><span><strong>Going Forward:</strong></span></p>\n<p><img title=\"Apple-Watch-Ultra2-OpticalHR-Sensor.jpg\" src=\"https://media.dcrainmaker.com/images/2024/01/Apple-Watch-Ultra2-OpticalHR-Sensor-1.jpg\" width=\"720\" height=\"540\" /></p>\n<p>In any case, what does this mean going forward?</p>\n<p>Well, obviously, buyers of new Apple Watch Series 9/Ultra 2 units don’t have blood oximetry data – a feature virtually every other wearable company has – be it Fitbit, Samsung, Google, Polar, Garmin, COROS, Suunto, etc… Everyone. Now, whether or not those companies simply did a better job avoiding existing patent pitfalls, came to a licensing agreement with Masimo, or weren’t a big enough targets for Masimo to sue, etc… we don’t know, and is probably a blend of a number of those factors.</p>\n<p>What we do know is that there’s effectively a gap here for some amount of new Apple Watch units going forward. Will this be a forever gap? Of course not. There’s certainly other ways to fry the blood oxygen fish, as evidenced by other companies. Whether or not Apple does this for the Series 9/Ultra 2, given it’s already January, or, if they decide to implement a new hardware/software solution for the Series 10/Ultra 3 in what is likely September (usual annual release cycle). That’s the bigger question. Neither are great options.</p>\n<p>Of course, at the end of the day, the bulk of the population never or sparingly use this feature either. Hence why it’s more important for Apple to get the watches selling again, rather than held up for something few people ever look at.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"1bb121452c41120792f94ad4e27e8fd28d713902484c5f02293387eb36be852f","category":"Cycling"}