{"title":"10 products I loved in 2021: Ronan Mc Laughlin","link":"https://cyclingtips.com/2021/11/10-products-i-loved-in-2021-ronan-mc-laughlin/","date":1637721240000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/RML-most-loved-2021-2-650x366.jpg\" /></div><h2>10 products I loved in 2021: Ronan Mc Laughlin</h2><p>\n</p><p>It seems like only yesterday I was writing about hacksaws and skewers in my <a target=\"_blank\" href=\"https://cyclingtips.com/2020/12/ten-products-i-loved-in-2020-ronan-mc-laughlin/\">10 products I loved in 2020</a>. Yet, that was almost 365 yesterdays ago, and here we are again with the things I loved for another year.</p>\n\n\n\n<p>2021 started off very much like 2020 rounded out – i.e. learning to write good English, lockdowns, and Everesting. Having <a href=\"https://cyclingtips.com/2021/03/ronan-mc-laughlin-has-smashed-the-everesting-record-in-6-hours-40-minutes/\" target=\"_blank\">scratched that sub-seven-hour itch</a>, my WorldTour career finally took off. I found myself at the Tour de France, Worlds, and <a href=\"https://cyclingtips.com/2021/10/paris-roubaix-tech-gallery-part-one-bars-gears-and-notes/\" target=\"_blank\">Roubaix</a>. Best of all, I was there without any of the training or suffering I always assumed was required to get there. </p>\n\n\n\n<p>Along the way, I lost 30 watts off my FTP, the obligation to measure every watt, and the desire to hammer every bike ride. I’ve found a few spare kilograms, the escape of a “disconnected” ride, and the joy of slowing down a little. Here are some of the things that helped me get there. </p>\n\n\n\n<h2>Albion ABR1 Bibs</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Albion-ABR1-Bib-Shorts-10-1340x754.jpg\" /><figcaption>Albion’s ABR1s are among my go-to bibs now. </figcaption></figure>\n\n\n\n<p>These bibs exemplify everything Yorkshire-based Albion is all about: good kit kept simple with a focus on environmental responsibility. Albion only offers one pair of bibs – you get a choice of three colours (black, grey, or navy), but there’s no huge array of bibs to choose from. This is good! Take one thing and do it well.</p>\n\n\n\n<p>The ABR1s feel luxurious with a comforting stretch and the pad is excellent. Better yet, in a year where I tested bibs and tights in the £300-400 range, the ABRs are among my absolute favourites and are much more reasonably priced. </p>\n\n\n\n<p>I could also include the <a target=\"_blank\" href=\"https://cyclingtips.com/2021/08/spotlight-albions-tradition-killing-burner-packable-wind-blocker/\">Albion Burner</a> in this list, but we are strictly limited to 10 items. Did I just include it? Maybe …</p>\n\n\n\n<p><strong>Price:</strong> US$158 / £125 / AU$218 / €135</p>\n\n\n\n<p><strong>More information: </strong><a target=\"_blank\" href=\"https://www.albioncycling.com/men/\">AlbionCycling.com</a></p>\n\n\n\n<h2>Wahoo Elemnt Rival </h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/ETSC6443-1340x754.jpg\" /><figcaption>“It does all these things and you only ask me the time?” (Photo: Specialized)</figcaption></figure>\n\n\n\n<p>The <a target=\"_blank\" href=\"https://cyclingtips.com/2020/11/wahoo-goes-wearable-introducing-the-new-elemnt-rival-multi-sport-watch/\">Elemnt Rival is Wahoo’s multi-sport watch</a> offering. Yes, it is a triathlon watch, and I got it mainly for an ill-advised Olympics-inspired foray into triathlon racing, but it has become my go-to ride-tracking device. </p>\n\n\n\n<p>Since my riding has become less structured training and more random jaunts, I feel much less obligated to record every ride. But here’s the catch, I have 10 years of solid training data I like keeping up to date for no other reason than, once I stop, I can never get back that uninterrupted fitness log. I also know my competitive urge will only stay suppressed for so long. Like a bear in torpor, it will probably awaken randomly, roar a little, then go back to sleep. When it does awaken, I want to know where I am and what I’ve done to hit the ground running.  </p>\n\n\n\n<p>That’s where the Rival comes in. It gives me the best of both worlds. I can record my rides and track all the data on my wrist, free from the intrusive judgment of out-front head unit wattage, heart rate, and time displays. </p>\n\n\n\n<p>The Rival also tells the time, tracks steps which is kind of fun, and the world clock widget tells me, without any mental time zone arithmetic, whether Dave Rome in Sydney is likely to be working, relaxing, or sleeping. It doesn’t do maps or offer much iPhone interaction, which at times has been frustrating. If it did, it could spell the end for my Apple Watch.</p>\n\n\n\n<p><strong>Price:</strong> US$379.99 / £349.99 / AU$599.95 / €379.99</p>\n\n\n\n<p><strong>More information: </strong><a target=\"_blank\" href=\"https://www.wahoofitness.com/devices/sport-watches/elemnt-rival/\">Wahoofitness.com</a></p>\n\n\n\n<h2>2022 Specialized Crux</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/2022-Crux-Pro-2-1340x754.jpg\" /><figcaption>Make me look fast. (Photo: Specialized)</figcaption></figure>\n\n\n\n<p>I think I’m having a mid-fitness crisis. That competitive urge is still napping, and the idea of doing an interval seems very alien. Of course, actually attempting an interval and the resulting hard evidence of my decreased fitness might only serve to worsen the situation. Paradoxically, short cruisey road rides don’t do it for me either. While great for clearing the head and taking in the scenery, easy road spins lack any exhilarating shredding, and I miss that post-ride leg ache and feeling of accomplishment. I know what I need: a sporty convertible.</p>\n\n\n\n<p>Enter the Crux! Or the Wilier Rave SLR I currently have for review. Or any of the “new” all-road bikes, take your pick. A bike racey and lively on road or dirt, capable of cruising group rides and shredding the local CX course.</p>\n\n\n\n<p>I only had one brief encounter with the new Crux in Leuven at Road Worlds. In my current mid-fitness crisis, it is exactly the kind of bike I’d be in the market for. With round tubes, bigger tyres, and a traditional bar and stem it hits so many of the speed bumps on my list of the <a target=\"_blank\" href=\"https://cyclingtips.com/2021/08/7-10-watts-lost-the-best-gear-that-makes-you-slower/\">best gear that makes you slower</a>. Adding a bar bag and tracking the ride – because, uninterrupted data (see above) – with a watch, will hit two more.</p>\n\n\n\n<p>It’s not an aero bike all about speed, and hence will, of course, be slower on tar, but I’m OK with that given its low weight feels and epic paint job vibes. Better yet, it would let me dart off that tar through an exhilarating forest trail or traffic-free gravel path every now and then. Let’s just pretend for the sake of this article that I can actually afford to buy one. </p>\n\n\n\n<p><strong>Price:</strong>  Crux Pro US$8,000 / £7,000 / AU$12,000 / €8,000</p>\n\n\n\n<h2>Castelli Premio Bibs</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Castelli-Premio-black-bibs-review-100-1340x745.jpg\" /><figcaption>Note to self: make sure the new garage has better lighting than the kitchen.</figcaption></figure>\n\n\n\n<p>Another pair of bibs for the list. The old saying goes something like, “invest in good shoes and a good bed, because if you’re not in one, you’re in the other.” Obviously, whoever coined this phrase was not a cyclist because clearly, it should be good shoes, a good bed, <em>and</em> good bibs!</p>\n\n\n\n<p>I love the Castelli Premio Black bibs launched back in May. The Premio’s all-black classic bib styling, minimal branding, superb pad, and a fit I love bumped these right to the top of my favourite bibs list. The bib straps are still a little tight when walking about off the bike, but the straps are fine on the bike. The durability concerns I had seem unfounded, with no further issues to report.</p>\n\n\n\n<p>Those ABR1s I mentioned earlier have since joined the Castellis at the top of my bibs list. They are very different bibs and I’d struggle to choose a favourite, but could quite happily rely on these two bibs for years to come.</p>\n\n\n\n<p><strong>Price:</strong> US$259.99 / AU$369 / £220 / €229.95</p>\n\n\n\n<p><strong>More information: </strong><a target=\"_blank\" href=\"https://www.castelli-cycling.com/gb/men/bottoms/cycling-bib-shorts/p/452100221P-010\">Castelli-cycling.com</a></p>\n\n\n\n<h2>My old winter casquette </h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Winter-cycling-cap-1340x754.jpg\" /></figure>\n\n\n\n<p>I bought this cap second-hand 16 years ago. I reckon it was at least four years old then, possibly 10. This thing is old! Yet I have never found a better winter cycling cap; I don’t believe one exists. I have other hats from many different brands. All shapes and sizes, styles and prices. I probably have too many hats – I have only one head after all. Still, every spring I stow this cap away and every winter I dig it back out again. </p>\n\n\n\n<p>This year was no different. The old Festina hat got plenty of use last winter, hibernated all summer, now it’s out again. What’s so special about it? Nothing really, it’s just a good cap. It fits, even under a helmet, even though it was probably never designed with helmets in mind. It’s not too heavy or too light, it’s just right, almost always.</p>\n\n\n\n<p>The cap has a peak, but it’s not too long and the ear covers are just the right shape and size – two areas that often trip up modern imitators. It’s so old it almost looks cool, but crucially it looks terrible to the untrained eye. The tub glue residue on the side is almost a nod to years gone by and a badge of honour for a lifetime of service. </p>\n\n\n\n<p>This is my oldest cycling accessory I still regularly use. It’s a miracle I didn’t lose it years ago. I have tried modern takes on this style of cap, but they just don’t do it for me. Is this the last great cycling cap? Will great grand children generations from now look at this as some sort of heirloom piece or has nostalgia got the better of me? Probably the latter.</p>\n\n\n\n<p><strong>Price:</strong> “They don’t make ’em like this any more.”</p>\n\n\n\n<h2>S-Works Romin Evo Mirror</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/S-Works-Romin-Evo-Mirror-1340x893.jpg\" /><figcaption>One saddle, many bikes. </figcaption></figure>\n\n\n\n<p>OK, so if we need good shoes, a good bed, and good bibs, surely we need to make it a quartet and include an excellent saddle as well? Well, not quite. I’m going to contradict myself here and suggest you scrap the idea of good bibs and head straight for a good saddle. </p>\n\n\n\n<p>A lot has been made of the S-Works Mirror saddles. They are ridiculously expensive, that honeycomb structure certainly looks interesting, and everyone talks about how good they are. So good they had Caley and James taking twerking lessons. James said, “this thing is stupidly good” in his <a target=\"_blank\" href=\"https://cyclingtips.com/2021/09/specialized-s-works-romin-evo-mirror-saddle-review/\">review of the Romin Evo Mirror</a>, while Caley said the Power Mirror “makes my butt so happy” when he recapped his <a target=\"_blank\" href=\"https://cyclingtips.com/2020/12/ten-products-i-loved-in-2020-caley-fretz/\">10 favorite cycling products of 2020</a>. </p>\n\n\n\n<p>There’s not much left for me to say following James and Caley’s comments and Dave Everett’s <a href=\"https://cyclingtips.com/2021/03/specialized-power-mirror-saddle-long-term-review/\" target=\"_blank\">Power Mirror long-term review</a>, other than something very similar. The Romin Evo Mirror is the most comfortable saddle I have ever ridden, bar none. Personally, I can’t say I like the look of it all that much, but I’ll sacrifice my own subjective bike styling ideas for the added comfort it offers.</p>\n\n\n\n<p>I’ve noticed the Romin’s added comfort makes it much more accommodating and forgiving when chopping and changing saddles between bikes and not always getting the saddle position spot on, something that used to drive me mad but I barely notice with the Romin. Having tried the saddle on several bikes I’d even go as far as to say it can transform stiffer bikes with a harsher ride on rough surfaces, bringing a level of forgiveness to what was otherwise a rough ride.</p>\n\n\n\n<p>All that’s missing is a more budget-friendly version. Come on Specialized – when will we see a more affordable Comp level, Cr-Mo rail Mirror saddle?  </p>\n\n\n\n<p><strong>Price:</strong> US$450/ £390 / AU$690 / €449.99.</p>\n\n\n\n<p><strong>More information:</strong> <a target=\"_blank\" href=\"https://www.specialized.com/us/en/power-saddle-mirror?gclid=CjwKCAiAwrf-BRA9EiwAUWwKXkwqyXmm9tbTetaUxn7H4jc_qo30JWVbTj0tNoAZiD4NHBp6xeupxxoCYZkQAvD_BwE\">Specialized.com</a></p>\n\n\n\n<h2>Time trial bikes and track racing</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/CORVOS_00033367-013-1340x892.jpeg\" /><figcaption>Time trialling and pursuiting: not everyone’s cup of tea but this year had some crackers.</figcaption></figure>\n\n\n\n<p>OK, so not exactly a product but 2021 seemed like a vintage year for bikes with aero extensions, TT tech, and timed racing action. We had a string of new TT bike releases, which, in a year without a Tour team time trial, wasn’t entirely expected. We also had some enthralling action on and off the track.</p>\n\n\n\n<p>It didn’t all start off so great though. When <a target=\"_blank\" href=\"https://cyclingtips.com/2021/05/canyon-announce-new-speedmax-disc-uci-legal-tt-bike/\">Canyon announced its new Speedmax Disc UCI legal TT bike</a> – basically a watered-down version of its triathlon bike – I wrote about my fears that triathlon was now the cutting edge of time trialling tech and road cycling was getting left behind. The UCI did little to curb my fears when it felt it necessary to <a target=\"_blank\" href=\"https://cyclingtips.com/2021/05/uci-bans-aerocoach-front-hub-fairing-used-by-ganna-in-giro-tt/\">ban the Aerocoach front hub caps on Filippo Ganna’s TT bike</a>. </p>\n\n\n\n<p>Thankfully TT tech came out fighting and restored my love for the race of truth. New bikes from <a target=\"_blank\" href=\"https://cyclingtips.com/2021/04/spotted-a-new-cannondale-time-trial-bike/\">Cannondale</a>, <a target=\"_blank\" href=\"https://cyclingtips.com/2021/06/tick-tock-more-new-time-trial-bikes-are-on-the-way/\">Trek</a>, and Factor, bucket loads of <a target=\"_blank\" href=\"https://cyclingtips.com/2021/07/gallerytour-de-france-time-trial-tech-part-two/\">Tour TT tech</a>, and even some <a target=\"_blank\" href=\"https://cyclingtips.com/2021/05/how-to-win-a-grand-tour-time-trial-and-why-some-teams-are-so-dominant/\">teams’ dominance in time trials</a> helped make TTs interesting again. Sure there was no penultimate-stage La Planche des Belles Filles Tour-winning time trial this year, but tiny winning margins in time trials at <a target=\"_blank\" href=\"https://cyclingtips.com/2021/03/filippo-ganna-is-not-a-robot/\">Tirreno-Adriatico</a>, <a target=\"_blank\" href=\"https://cyclingtips.com/2021/03/bissegger-wins-stage-3-tt-at-paris-nice-daily-news/\">Paris-Nice</a>, and <a target=\"_blank\" href=\"https://cyclingtips.com/2021/04/primoz-roglic-wins-the-opening-tt-at-the-itzulia-basque-country-daily-news/\">Itzulia Basque Country</a>, not to mention Ganna appearing human in the Europeans before <a target=\"_blank\" href=\"https://cyclingtips.com/2021/09/ganna-came-from-behind-to-successfully-defend-his-world-tt-title/\">he came from behind to win Worlds</a>, all kept me on the edge of my seat.  </p>\n\n\n\n<p>On top of all that we had pursuiting, hour records, and the Olympics on the track. The year started with talk of Joss Lowden <a target=\"_blank\" href=\"https://cyclingtips.com/2021/02/joss-lowden-has-unofficially-broken-the-world-hour-record/\">unofficially breaking the hour record in training</a> before doing it for real in September with a <a target=\"_blank\" href=\"https://cyclingtips.com/2021/09/48-km-joss-lowden-has-broken-the-hour-record/\">48.405 km ride</a>. Ashton Lambie became the first person to <a target=\"_blank\" href=\"https://cyclingtips.com/2021/08/ashton-lambie-breaks-four-minute-pursuit-barrier/\">break the four-minute pursuit barrier</a> on <a target=\"_blank\" href=\"https://cyclingtips.com/2021/08/the-33000-bike-ashton-lambie-rode-to-the-worlds-first-sub-4-minute-pursuit/\">a $33,000 bike</a> and Alex Dowsett went for the Hour record on a <a target=\"_blank\" href=\"https://cyclingtips.com/2021/11/dowsetts-hour-record-bike-track-adapted-factor-hanzo/\">track-adapted Factor Hanzo</a>.</p>\n\n\n\n<p>Of course we also had the Olympics and damn did the track bring the excitement. The stand-out for me was the team pursuits, with <a target=\"_blank\" href=\"https://cyclingtips.com/2021/08/australians-handlebar-snaps-during-olympic-team-pursuit-qualifying/\">snapped handlebars</a>, <a target=\"_blank\" href=\"https://cyclingtips.com/2021/08/denmarks-pursuit-team-shin-tape-uci-rule-loophole-or-team-wide-shin-injury/\">Denmark’s shin tape gate</a>, <a target=\"_blank\" href=\"https://cyclingtips.com/2021/08/team-gb-has-set-a-new-womens-team-pursuit-world-record/\">four team pursuit world records in one day</a>, and the pièce de résistance: <a target=\"_blank\" href=\"https://cyclingtips.com/2021/08/italy-takes-team-pursuit-gold-with-another-world-record/\">Italy’s incredible gold medal-winning ride</a> so good it had me screaming and dancing in the kitchen on repeat. If all that wasn’t enough for me, <a href=\"https://cyclingtips.com/2021/03/ronan-mclaughlin-world-record-everesting-attempt/\" target=\"_blank\">breaking the Everesting record</a> was of course one very long time trial with a hefty lump of rear-wheel puncture drama. </p>\n\n\n\n<p><strong>Price:</strong> TT bikes and velodromes: costly. Against-the-clock action: priceless! </p>\n\n\n\n<h2>Books</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Most-loved-books-1340x754.jpg\" /><figcaption>I like the idea of reading books but usually don’t have time. This year was slightly different.</figcaption></figure>\n\n\n\n<p>Full disclosure here, I am terrible with books. I have all the best intentions and love buying books, but I rarely get to read a book cover to cover.</p>\n\n\n\n<p>This year was better, though. I invested time and money in even more books, fully expecting not to actually get through them. Much to my surprise then, and with the help of Audible, I ploughed through Jonathan Vaughters’s “One-Way Ticket” and Michael Hutchinson’s “Faster”.</p>\n\n\n\n<p>Inspired by all that track action, I delved into whatever Hour Record literature I could find. First up was Bradley Wiggins’s “My Hour” on Audible, then my new favourite book.</p>\n\n\n\n<p>Michael Hutchinson’s “The Hour: Sporting Immortality the Hard Way” had me absolutely hooked. The book is an educational look at the history of the record and an insight into the slippery slope that is attempting a record. Hutch had me laughing out loud and tearing my hair out in equal measure as he took me on his journey from highly intellectual professional to time trialling superstar in the UK to the verge of mental breakdown. The Hour had me enthralled from start to finish. I might even read it again.</p>\n\n\n\n<p>Dr Hutch interrupted my attempt at Dan Bigham’s “Start at the End: How Reverse-Engineering Can Lead to Success” which I need to go back and finish. First up, though, is <a href=\"https://smarturl.it/everesting\" target=\"_blank\">“Everesting” from CyclingTips’ own Matt de Neef</a>. This hardback book with so many incredible photos looks fabulous, and I got a mention, so this is, of course, the best book ever, bar none – better even than that really old famous one.</p>\n\n\n\n<p><strong>Price:</strong> Varies</p>\n\n\n\n<h2>Flanders</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Kramon_UCIWorlds2021_EliteMenRR_09716-1340x893.jpg\" /><figcaption>The elite men’s road race at Worlds featured intermittently alternating laps of a circuit around Leuven where crowds of some 300,000 spectators showed up. </figcaption></figure>\n\n\n\n<p>I lived in Flanders on and off for six seasons from 2008 to 2013. At the time, it was a love-hate relationship. I loved the country and people, but hated the training roads/paths. I’d only been back once since, for the 2017 Gent Six-Day. I always had an affection for Belgium and Flanders but not enough to draw me back anytime soon.</p>\n\n\n\n<p>Then Worlds happened. Belgium welcomed the cycling world and put on a show like no other. From the time trials based in historic Brugge, to the thousands of fans lining the streets for the road races, the Flanders Worlds was a cyclist’s nirvana for the week. The atmosphere, the Belgian fans, the cycling culture, bike infrastructure, bakeries and cakes, Belgian chocolate, Belgian beers: I think Flanders is my spiritual home.</p>\n\n\n\n<p>I guess Flanders Tourism is the product here. Flanders has gone from “somewhere we should visit a weekend sometime”, to a must-see destination.</p>\n\n\n\n<p><strong>Price:</strong> Weekend city-break.</p>\n\n\n\n<h2>Bricks and mortar</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/Shed-hands-1340x754.jpg\" /><figcaption>Unlike others, these hands in the fresh plaster were intentional.</figcaption></figure>\n\n\n\n<p>Anyone who follows my <a target=\"_blank\" href=\"https://www.instagram.com/ronan_mc_laughlin/?hl=en\">Instagram</a> might have noticed I’ve dabbled in some construction work this year. We moved home a few years back and I’ve been shedless ever since. That had to change – there are only so many walls and rooms my wife could surrender to bike stuff. I started this project without the slightest idea about construction. Seven months later, I now have a slight idea. Just. </p>\n\n\n\n<p>Although frustrating at times, the project has been a lot of fun, and I learned so many new skills I will hopefully never use again. Friends and family lent countless hands to the build, and although there are probably easier ways to get together, nothing gets you closer than trusting my scaffold building, slipping and sliding on a roof, or sticking your hand in someone’s freshly plastered wall.</p>\n\n\n\n<p>I wanted to do as much of this myself as possible, which turned out to be a double-edged sword. Although I can look out at the finished garage with a sense of achievement, I also can’t help but see the little mistakes I made along the way. I guess those minor imperfections make the building more personal and all the better for it. </p>\n\n\n\n<p>The build was a lot of fun, the new space is great, but never again. </p>\n\n\n\n<p><strong>Price:</strong> Less than two superbikes.</p>\n\n\n    <div>\n    <div>\n\t\n\n\n\n<p><em>Stay tuned for more <a href=\"https://cyclingtips.com/tag/most-loved-2021/\" target=\"_blank\">’10 products I loved in 2021′ articles</a> from other members of the CyclingTips team. In the meantime you can catch up on all of <a href=\"https://cyclingtips.com/tag/most-loved-2020/\" target=\"_blank\">last year’s picks</a>. Or go back further into the archives for our round-ups from <a href=\"https://cyclingtips.com/tag/most-loved-2019/\" target=\"_blank\">2019</a>, <a href=\"https://cyclingtips.com/tag/most-loved-2018/\" target=\"_blank\">2018</a>, and <a href=\"https://cyclingtips.com/tag/most-loved-2017/\" target=\"_blank\">2017</a>.</em></p>\n\n\n    </div>\n    </div>\n\t\n\n\n<p>    </p><div>\n    <div>\n\t<em> Disclosure: One of the investors in Outside Inc. — the parent company of CyclingTips — is <a href=\"https://zone5ventures.com/\" target=\"_blank\">Zone 5 Ventures</a>, which supposedly isn’t technically owned by Specialized, but Specialized is the “sole limited partner” and is at least partially run by current and/or former Specialized employees (it’s complicated, and we have no idea how any of this works). Zone 5 Ventures has no influence on our editorial coverage at CyclingTips, but the optics are ugly, so we thought you should know.</em>    </div>\n    </div>\n\t<p></p>\n<p></p><a href=\"https://cyclingtips.com/2021/11/10-products-i-loved-in-2021-ronan-mc-laughlin/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1bb26be48730d3710abb8d9d5087dcb0cef1f76584e207761a1f25228b603b0d","category":"Cycling"}