{"title":"How model guided photosynthetic bioengineering can help to feed the world","link":"https://academic.oup.com/plphys/article/194/3/1276/7335659?rss=1","date":1698796800000,"content":"<span>The Green Revolution has substantially increased crop yields. However, agricultural productivity is plateauing (<a href=\"#kiad563-B19\">Zhu et al. 2010</a>). Given the increasing demand from world population growth (<a href=\"#kiad563-B17\">van Dijk et al. 2021</a>) and the negative impact of climate change on agricultural productivity (<a href=\"#kiad563-B3\">Gornall et al. 2010</a>; <a href=\"#kiad563-B17\">van Dijk et al. 2021</a>), new technologies are needed to meet these challenges. A promising approach is to increase photosynthetic productivity that has not been targeted directly in the Green Revolution. Using bioengineered components of the photosynthetic machinery, significant yield increases can be achieved to further improve agricultural productivity (<a href=\"#kiad563-B13\">Ort et al. 2015</a>; <a href=\"#kiad563-B11\">Leister 2023</a>). For example, photosynthetic organisms use the energy of sunlight inefficiently at high light intensities. Only about 30% of bright sunlight is used for photosynthesis (<a href=\"#kiad563-B12\">Melis 2009</a>). This can be significantly improved by limiting the light absorption to only the amount that they can use for photosynthesis. The excess light is passing through, enabling more cells to photosynthesize. In fact, this counterintuitive approach has increased photosynthetic productivity in a wide variety of organisms (<a href=\"#kiad563-B7\">Kirst et al. 2014</a>, <a href=\"#kiad563-B8\">2017</a>; <a href=\"#kiad563-B1\">Friedland et al. 2019</a>; <a href=\"#kiad563-B15\">Slattery and Ort 2021</a>).</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"1bc1d4f2ee9aa76bb14333775ab7382dba9a98b0d5962cfd1bfdfceeaeeb3509","category":"Environment"}