{"title":"Netflix มีจำนวนสมาชิกทั่วโลกเพิ่มอีก 8.76 ล้านบัญชี สะท้อนการป้องกันหารบัญชีส่งผลบวก","link":"https://www.blognone.com/node/136296","date":1697669150000,"content":"<div><div><div><p>Netflix รายงานผลประกอบการของไตรมาสที่ 3 ปี 2023 รายได้รวมเพิ่มขึ้น 7.8% จากช่วงเดียวกันในปีก่อนเป็น 8,542 ล้านดอลลาร์ มีกำไรสุทธิ 1,677 ล้านดอลลาร์ กระแสเงินสดอิสระ 1,888 ล้านดอลลาร์</p>\n<p>แนวทาง<a href=\"https://www.blognone.com/node/133979\">ป้องกันการหารบัญชี</a>ใช้งานยังคงส่งผลดีต่อ Netflix จำนวนสมาชิกในไตรมาสเพิ่มขึ้นมาอีก 8.76 ล้านบัญชี จำนวนสมาชิกรวมเป็น 247.15 ล้านบัญชี ซึ่ง Netflix บอกว่าเฉพาะจำนวนสมาชิกแพ็คเกจราคาถูกที่มีโฆษณา เพิ่มขึ้นมาจาก<a href=\"https://www.blognone.com/node/134916\">ไตรมาสก่อนหน้า</a>นี้ 70% แต่ไม่ได้บอกจำนวน และจำนวนสมาชิกที่สมัครใหม่ในประเทศที่มีแพ็คเกจโฆษณา 30% เลือกแพ็คเกจนี้</p>\n<p>คอนเทนต์เด่นในไตรมาสที่ผ่านมาได้แก่ One Piece จำนวนการรับชมล่าสุด 62 ล้านครั้ง, Suits ซีรี่ส์แนวกฎหมายที่ Netflix ซื้อไลเซนส์มาเผยแพร่ ได้ผลตอบรับที่สูงมาก ซึ่ง Netflix จะยังเดินหน้าซื้อซีรี่ส์ในอดีตมาเผยแพร่ในแพลตฟอร์มแบบ Friends</p>\n<p>Netflix บอกว่าในช่วง 6 เดือนที่ผ่านมา ความท้าทายสำคัญของบริษัทคือการประท้วงหยุดงานของสมาคมผู้เขียนบท WGA และสมาคมนักแสดง SAG-AFTRA ในอเมริกา ซึ่งตอนนี้ WGA <a href=\"https://www.blognone.com/node/135956\">ได้ข้อสรุป</a>การเจรจาแล้ว แต่ <a href=\"https://www.blognone.com/node/134840\">SAG-AFTRA ยังดำเนินต่อไป</a> บริษัทหวังว่าจะยุติปัญหานี้ได้โดยเร็วที่สุด</p>\n<p>ที่มา: <a href=\"https://s22.q4cdn.com/959853165/files/doc_financials/2023/q3/FINAL-Q3-23-Shareholder-Letter.pdf\">Netflix</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/a44e6a49679b37581f04cf3b75ff4b0d.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1bc3dbb471b7964145088dae45d221e2e12c31f3bbf7b0cc9646ed8f6e5e10d1","category":"Thai"}