{"title":"Molecular Insight into Water/Methane Occurrence Characteristics within Nanoporous Composite Media in Deep Shale Formations","link":"https://www.preprints.org/manuscript/202408.1088/v1","date":1724118475000,"content":"Accurate assessment of shale gas reserves hinges on a detailed characterization of gas and water distribution within shale reservoirs. Despite its importance, the nanoscale behavior of water and methane in deep shale formations, especially under elevated temperatures and pressures, remains poorly understood. This study proposes a novel molecular modeling approach to represent the complex nanocomposite porous media found in deep shale matrices. Leveraging quantitative data from experimental analyses of shale pore composition, we developed a molecular model that accurately reflects the intricate pore-slit structure within a composite of kerogen and illite, common constituents of shale. Employing a hybrid grand canonical Monte Carlo and molecular dynamics simulation technique, we investigated the micro-scale distribution and preferential adsorption sites of water and methane within the shale matrix. Our research further elucidates the impact of water on the pore structure of shale and delineates the co-occurrence patterns of water and methane. The simulations reveal that water and methane share similar adsorption preferences on kerogen surfaces, while methane does not exhibit specific adsorption preferences on water-bearing illite. We also find that the presence of water significantly alters the illite pore space, leading to a reduction in larger pore volumes and a concomitant increase in smaller pores. The decrease in methane content with increasing water content is more pronounced in the shrinkage cracks compared to the kerogen matrix pores and is particularly notable in the macropores of illite. The findings underscore the differential sensitivity of methane content to water levels across various shale pore types. These insights contribute to a deeper theoretical understanding of gas and water distribution mechanisms in deep shale reservoirs, offering valuable support for the evaluation of deep shale gas resource potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1bd0f0fc5c9c769a3ca4ae1c4f56e0f4522f57511d57049633644cf180494e25","category":"Interdisciplinary"}