{"title":"Anchovy and sardine condition and energy content in the North Aegean Sea (eastern Mediterranean) in relation to their contrasting reproductive strategies","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15872?af=R","date":1721453731000,"content":"<h2>Abstract</h2>\n<p>Forage species with high biomass, such as anchovies and sardines, play a key role in pelagic ecosystems and make up a significant proportion of the world's capture fisheries production. In recent years, condition indices have gained interest as significant indicators for assessing the effects of environmental and human pressures on these species and the quality of their habitats. In the present study, we examined, for the first time in the North Aegean Sea (eastern Mediterranean), the year-round variation in somatic and gonadal condition, energy density, and percentage of lipid content of anchovy (<i>Engraulis encrasicolus</i>) and sardine (<i>Sardina pilchardus</i>). Energy density was measured with bomb calorimetry and percentage lipid content with the fatmeter, a portable electronic device. Finally, the monthly changes in gonadal and energetic condition were examined in relation to the annual cycle of temperature and mesozooplankton biomass, simulated by the implementation of a coupled hydrodynamic-biogeochemical model (POM-ERSEM). There was a strong relationship between fish energy density (kJ g<sup>−1</sup>) and percentage dry weight. Furthermore, the mean monthly energy density and fatmeter measurements were strongly correlated, especially in sardine. Overall, the monthly changes in energetic condition were indicative of the species’ different strategies for energy acquisition and allocation to reproduction (capital vs. income breeding): sardine exhibited low energy density and percentage lipid content during the winter spawning period (November–March) and markedly higher energetic condition from spring to autumn (April–October). Anchovy spawning period, as inferred from gonadal condition, lasted from April to September, i.e., during the warm period of the year but its energy density and percentage lipid content did not exhibit any seasonal changes and were markedly lower than in sardine from April to October. Finally, the simulated mesozooplankton biomass was higher from January to July, which corresponded to the second half of the spawning season for sardine, but first half of the spawning season for anchovy.</p>","author":"Eudoxia Schismenou, \nStavros Chatzifotis, \nKostas Tsiaras, \nStylianos Somarakis","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"1bdb3b5a6c771327073b295ef15d34a74e1d1352bbe5ac639590ed5a0f689183","category":"Environment"}