{"title":"Projecting Changes in the Frequency and Magnitude of Ozone Pollution Events Under Uncertain Climate Sensitivity","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003941?af=R","date":1717382102000,"content":"<h2>Abstract</h2>\n<p>Climate change is projected to worsen ozone pollution over many populated regions, with larger impacts at higher concentrations. More intense and frequent ozone episodes risk setbacks to human health and environmental policy achievements. However, assessing these changes is complicated by uncertain climate sensitivity, closely related to climate model response, and internal variability in simulations projecting climate's influence on air quality. Here, leveraging a global modeling framework that one-way couples a human activity model, an Earth system model of intermediate complexity, and an atmospheric chemistry model, we investigate the role of climate sensitivity in climate-induced changes to high ozone pollution episodes in the United States using multiple greenhouse gas emissions scenarios, representations of climate sensitivity, and initial condition members. We bias correct and evaluate historical model simulations, identifying modeled and observed O<sub>3</sub> episodes using extreme value theory, and extend the approach to projections of mid- and end-century climate impacts. Results show that the influence of climate sensitivity can be as significant as that of greenhouse gas emissions scenario absent precursor emissions changes. Climate change is projected to increase the magnitude of the highest annually occurring O<sub>3</sub> concentrations by over 2.3 ppb on average across the U.S. at mid-century under a high climate sensitivity and moderate emissions scenario, but the increase is limited to less than 0.3 ppb under lower climate sensitivity. Further, we show that areas in the U.S. currently meeting air quality standards risk being pushed into non-compliance due to a climate-induced increase in frequency of high ozone days.</p>","author":"James D. East, \nErwan Monier, \nRebecca K. Saari, \nFernando Garcia‐Menendez","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"1bdf88c100efa890aeff691a7775e498ac7836f5077ffbaffabbe1cf6cba4a19","category":"Environment"}