{"title":"Castelli designs its best-performing bibs ever","link":"https://www.bikeradar.com/news/castelli-premio-bib-shorts/","date":1621929617000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Castelli-Premio-short-10-6baebcd.jpg?quality=90&amp;resize=620,413\" />                                            <p>Italian clothing giant Castelli has a history steeped in designing technical cycling kit for some of the biggest teams in the peloton.</p>\n<p>Its new Premio bib shorts are claimed to mark its biggest advancement in shorts technology this last decade, though, and its best-performing bibs ever – but they won’t be available for pro-team riders.</p>\n<p>The reason the shorts are beyond ‘pro’ is down to the material used. The new high-tech fabric can’t be printed on, so sponsored teams are unable to print the logos and designs that typically cover that fabric real estate.</p>\n<section><div>\n        <h2>What makes the Castelli Premio premium?</h2>\n<ul><li>The new material has an engineered weave which means the shorts can be constructed from just three pieces of fabric rather than the usual 10</li>\n<li>The engineered fabric developed exclusively for Castelli costs five times that of traditional polyester/Lycra mix</li>\n<li>The new chamois pad is the result of more than a decade of development</li>\n<li>Men’s- and two women’s-specific versions are available</li>\n<li>There is no printing on the shorts, all of the logos are etched by laser</li>\n<li>The materials are claimed to be thinner and lighter than any cycling short before</li>\n</ul><p>\n\n    </p></div>\n    </section><div>\n    <img /></div><div><figcaption><span><i></i> The fabric was developed exclusively for Castelli.</span></figcaption><span> <i>Castelli</i></span></div>\n<h2>Castelli Premio construction</h2>\n<p>Instead of using a standard polyester/Lycra mix, this is a newly ‘engineered’ (Castelli’s words) fabric developed exclusively for the brand.</p>\n<p>The ‘engineered’ moniker comes from the way the fabric’s woven structure is engineered to create specific characteristics throughout the construction.</p>\n<p>For instance, the bottom 7cm of the leg on the men’s version and 6cm on the women’s-specific version is woven tightly and densely in a specific pattern that creates grip by pushing the Lycra fibres outwards on the inner surface.</p>\n<p>That means the Premio bibs don’t need a secondary leg gripper or bonded-on silicone to stop them from riding up.</p>\n<p>As the fabric transitions further up the leg, the weave opens up a little to make them much more breathable than traditional fibres.</p>\n<p>Then, around the hips and midriff, the fabric noticeably thickens to create a compressive fit and hold the chamois pad in place.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Premio fabric is engineered to create a grippy leg without the need for additional grippers or silicone bonded to the fabric.</span></figcaption><span> <i>Castelli</i></span></div>\n<p>To the touch, the Premios don’t feel like your average road shorts, with the fabric feeling crisp, almost papery. We’ve felt similar from Pearl Izumi and its <a href=\"https://www.bikeradar.com/reviews/clothing/road-cycling-shorts/jersey-and-bib-shorts/pearl-izumi-pro-air-review/\" target=\"_blank\">Pro Air bibs</a> and <a href=\"https://www.bikeradar.com/reviews/clothing/road-cycling-shorts/jersey-and-bib-shorts/q36-5-unique-bib-shorts-l1-pinstripe-x-jersey-review/\">Q36.5’s Unique shorts</a>, though both of those don’t have the same complexity in the weave as the Premios.</p>\n<p>While no one should really concern themselves with the weight of a pair of shorts, my XL test pair weigh in at flyweight 161.2g. For comparison, Castelli’s team issue <a href=\"https://www.bikeradar.com/news/castelli-launches-new-free-aero-race-4-bib-short/\" target=\"_blank\">Free Aero shorts</a> weigh 172g in a size L.</p>\n<h2>Big days out in all weathers</h2>\n<p>Castelli says that what makes these shorts its best-ever long-distance option is the fabric, which is significantly thinner and lighter than traditional bibs, so it stays drier, wicks faster and is better in the heat.</p>\n<p>They’re also claimed to be a great option for cooler days because the weave is tighter than other shorts, so there’s less wind penetration.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Castelli-Premio-short-08-5e065a4.jpg?quality=90&amp;resize=410%2C533\" /></div>    <figcaption><div>\n    <figcaption><span>The men’s Progetto X2 Air Seamless pad has seen over 40 revisions since it debuted back in 2009.</span>\n    </figcaption><span>\n                    <i>Castelli</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Castelli-Premio-short-09-49ca110.jpg?quality=90&amp;resize=410%2C533\" /></div>    <figcaption><div>\n    <figcaption><span>The women’s shorts get a female-specific version of the Progetto X2 pad.</span>\n    </figcaption><span>\n                    <i>Castelli</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nInside, Castelli uses its Progetto X2 Air Seamless pad, which it says is the best option for the Premio because the pad’s seamless construction, low weight and clever two-level design match the Premio fabric in terms of comfort and protection.\n<p>The outer layer of the pad, which Castelli refers to as the skincare layer, is said to be the softest and stretchiest it’s ever made and is designed to move with you like a second skin, eliminating skin irritation and abrasion from a shifting pad.</p>\n<p>Underneath that is a cushioning layer that uses two densities of foam and gel pads at the sit bone area and perineum. The pad is 3D formed as one, so there are no steps between the padding, and it’s pre-formed for a better fit.</p>\n<p>Castelli debuted the original Progetto pad back in 2009 with the Cervélo test team and since then it’s seen more than 40 revisions to get to the X2 design seen on the Premio.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Castelli-Premio-short-05-1eea3be.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The Premio is Castelli’s most advanced short ever but you won’t see it at the Tour.</span>\n    </figcaption><span>\n                    <i>Castelli</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Castelli-Premio-short-07-c96fad9.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The women’s bib short launches alongside the men’s.</span>\n    </figcaption><span>\n                    <i>Castelli</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Castelli-Premio-short-01-7de7496.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>As well as a women’s bib short, Castelli offers the Premio in a women’s short.</span>\n    </figcaption><span>\n                    <i>Castelli</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nThe way in which these elements are constructed is another first for Castelli. Compared to its standard bib short range that uses around 10 components for the Lycra element, the Premio shorts have just three.\n<p>It’s great to see a women’s-specific version released at the same time as the men’s, which isn’t always the case. It shares all of the same tech but uses a women’s-specific version of the Progetto X2 Air pad, comes with wider bib straps or a non-bib option, and has a shorter leg length.</p>\n<h2>Castelli Premio details</h2>\n<h3>Bib straps</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The lightweight single-layer braces have Castelli logos bonded and stitched onto them to help them lay flat.</span></figcaption><span> <i>Castelli</i></span></div>\n<p>The straps are wider than most but sit very flat. The material has a huge amount of stretch, is very soft to the touch and noticeably thinner than most due to the single-layer construction.</p>\n<p>Typically, an issue with lightweight straps is the tendency for them to roll up, but Castelli has strategically bonded and stitched logo/label panels onto the straps (on the upper part of the pectorals) in a bid to stop this.</p>\n<h3>Waistline</h3>\n<p>A potential irritation point on shorts is around the waistline where the bibs and shorts join. However, the Premio uses a more formed design so any joins between sections are flat-edge bonded, eliminating any such problems.</p>\n<h3>At the back</h3>\n<p>Lightweight bib shorts made from light, thin fabrics don’t always protect your modesty, especially if you aren’t a 55kg bantamweight roadie. So, to save you from transparency woes, Castelli has added an ultralight liner to the back of the shorts.</p>\n<h2>Castelli Premio pricing</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A premium pair of shorts need premium packaging.</span></figcaption><span> <i>Castelli</i></span></div>\n<p>The Premio bibs don’t come cheap and are the priciest shorts offered by Castelli – £220 for the men’s bibs and £200 for the women’s versions. International pricing is €229.95 / $259.99 / AU$369, but we’re yet to confirm for which version.</p>\n<p>They aren’t the most expensive bibs we’ve seen though, with Q36.5’s Unique bibs costing £295 at retail, Pearl Izumi’s Pro Airs £249.99 and <a href=\"https://www.bikeradar.com/news/rapha-pro-team-powerweave-bib-shorts/\">Rapha’s Powerweaves</a> £275.</p>\n<p>The Premios should stay looking good for longer than most though with the laser logos replacing printed logos, which have a tendency to crack, peel or fade.</p>","author":"Warren Rossiter","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"1bf28ef8ef8da13223be43338c499bb4d058b31d4322c6765b7c8d2b23ccd58d","category":"Cycling"}