{"title":"Apple Vision Pro Battery Isn't Hot-Swappable, Switching Requires Restart","link":"https://www.macrumors.com/2024/01/31/apple-vision-pro-battery-not-hot-swappable/","date":1706707835000,"content":"The Apple Vision Pro headset comes with an external battery pack with a capacity of 3,166 mAh, compared to the 3,274 mAh battery found in the iPhone 15 Pro, although the voltages are different so the measurement alone can't be considered equivalent. Reviewers have also reported that there are significant size and weight differences between the two.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/vision-pro-battery-pack.jpg\" width=\"1640\" height=\"1060\" />\r<br />\nAccording to <a href=\"https://daringfireball.net/2024/01/the_vision_pro\"><em>Daring Fireball</em>'s John Gruber</a>, the Vision Pro battery is about the width and height of an iPhone 15 Pro, but thicker. Weight-wise, it is also heavier: About 325g, compared to 187g for an iPhone 15 Pro. \"It's closer in thickness and weight to two iPhone 15's than it is to one,\" according to Gruber.\r<br />\n\r<br />\nMarques Brownlee in his <a href=\"https://youtu.be/SaneSRqePVY?feature=shared&amp;t=262\">unboxing video</a> also described the battery as \"pretty heavy,\" and compared it to phones with larger capacity 5,000+ mAh batteries that feel \"much lighter.\" We'll probably have to wait for a teardown to find out what the additional weight can be attributed to.\r<br />\n\r<br />\nThe external battery pack that comes with the Vision Pro is silver, has a proprietary connector for attaching to the headset, and a USB-C port for charging via the included 30W wall charger. The proprietary connector is connected to the Vision Pro by rotating it a quarter turn to lock it into place. \r<br />\n\r<br />\nFor those considering buying an additional $200 battery pack, one thing to bear in mind is that Vision Pro batteries are not hot-swappable: As Gruber notes, there is no built-in reserve battery in the headset, so when the power cable is disconnected, Vision Pro immediately powers off. A manual reboot is therefore required to switch batteries.\r<br />\n\r<br />\nApple says the Vision Pro provides up to two hours of battery life overall, and up to 2.5 hours for 2D video playback specifically. However, <a href=\"https://www.macrumors.com/review/apple-vision-pro/\">several reviewers</a> claim to have gotten up to three hours out of a single charge in general use, with one reviewer saying they were able to watch a three-hour movie on a single charge. \r<br />\n\r<br />\n<div><blockquote><p>Vision Pro Battery specs:<br /><br />3166 MAh<br />35.9 Wh<br />Output 13V 6A max <br />Model number: A2781 <a href=\"https://t.co/XoSbxhHEHA\">pic.twitter.com/XoSbxhHEHA</a></p>— Aaron (@aaronp613) <a href=\"https://twitter.com/aaronp613/status/1752464226092798125?ref_src=twsrc%5Etfw\">January 30, 2024</a></blockquote> </div>\r<br />\nIn terms of battery life, it doesn't make sense to compare the Vision Pro to the iPhone 15 Pro, given that the former undoubtedly draws a lot more juice to power an array of much more sophisticated cameras, sensors, displays, speakers, and microphones.\r<br />\n\r<br />\nApple Vision Pro launches in the U.S. on Friday, February 2. Apple has said the Vision Pro will launch in additional countries later this year.\r<br />\n\r<br />\n<em><small>Article updated to remove phrasing that implied mAh measurement alone is equivalent without an indication of voltage. Apologies for the error.</small> </em><div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AppleVisionPro\">Vision Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/31/apple-vision-pro-battery-not-hot-swappable/\">Apple Vision Pro Battery Isn't Hot-Swappable, Switching Requires Restart</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-battery-isnt-hot-swappable-switching-requires-restart.2417956/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1bfaf956ced729095328d1d07fb2abfb4b494197505701479fb702f72c0f506f","category":"Apple"}