{"title":"Humans have broken a fundamental law of the ocean","link":"https://arstechnica.com/?p=1815646","date":1637933617000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/phytoplankton-800x523.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/phytoplankton.jpg\">Enlarge</a> <span>/</span> Microphotograph of thalassiothrix frauenfeldii, Thalassionemataceae, phytoplankton. (credit: De Agostini Picture Library | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On November 19, 1969, the CCS <em>Hudson</em> slipped through the frigid waters of Halifax Harbour in Nova Scotia and out into the open ocean. The research vessel was embarking on what <a href=\"https://tos.org/oceanography/assets/docs/22-3_wadhams.pdf\" target=\"_blank\">many of the marine scientists on board</a> thought of as the last great, uncharted oceanic voyage: the first complete circumnavigation of the Americas. The ship was bound for Rio de Janeiro, where it would pick up more scientists before passing through Cape Horn—the southernmost point in the Americas—and then head north through the Pacific to traverse the ice-packed Northern Passage back to Halifax Harbour.</p>\n<p>Along the way, the <em>Hudson</em> would make frequent stops so its scientists could collect samples and take measurements. One of those scientists, Ray Sheldon, had boarded the <em>Hudson</em> in Valparaíso, Chile. A marine ecologist at Canada’s Bedford Institute of Oceanography, Sheldon was fascinated by the microscopic plankton that seemed to be everywhere in the ocean: how far and wide did these tiny organisms spread? To find out, Sheldon and his colleagues hauled buckets of seawater up to the <em>Hudson</em>’s laboratory and used a plankton-counting machine to total up the size and number of creatures they found.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/wired-logo.png\" /></div>\n<p>Life in the ocean, <a href=\"https://aslopubs.onlinelibrary.wiley.com/doi/pdfdirect/10.4319/lo.1972.17.3.0327\">they discovered</a>, followed a simple mathematical rule: the abundance of an organism is closely linked to its body size. To put it another way, the smaller the organism, the more of them you find in the ocean. Krill are a billion times smaller than tuna, for example, but they are also a billion times more abundant.</p></div><p><a href=\"https://arstechnica.com/?p=1815646#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1815646&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1bfba3cb8da252f2b8ad56977aca2d6c26991d6ee49da1b182279c6140cd6c3b","category":"Tech"}