{"title":"Humane Lays Off 4 Percent of Employees Before Releasing Its AI Pin","link":"https://www.theverge.com/2024/1/9/24032274/humane-layoffs-ai-pin","date":1704850870000,"content":"\n<p>Alex Heath, reporting for The Verge:</p>\n\n<blockquote>\n  <p>Humane laid off 4 percent of employees this week in a move that \nwas described as a cost cutting measure to those who were \nimpacted, according to sources familiar with the matter. Employees \nwere recently told by leadership that budgets would be lowered \nthis year, said one of the people, who requested anonymity to \nspeak without the company’s permission. </p>\n\n<p>The cuts, which numbered 10 people, come ahead of the \nfive-year-old startup shipping its first device: a $699, \nscreenless, AI-powered pin that is pitched as a smartphone \nreplacement. </p>\n\n<p>In a text message, Bongiorno told me that the cuts were “not \ncommunicated as a layoff” to those who were impacted, despite \nsources telling me that they were — both verbally and in writing. \n“It goes without saying that, like every company, we have a \nresponsibility to remain prudent and proactive, ensuring we have \nthe right roles, right people, and the right structure at every \njuncture,” she said. </p>\n</blockquote>\n\n<p>Layoffs are never good — and layoffs before shipping the company’s first product are a particularly bad look — but 10/250 employees really does sound more like belt-tightening. But I do not think their AI Pin preorder numbers have set the world afire, nor do I think the company’s investors are interested in funding them further. (Sam Altman, <a href=\"https://www.lowpass.cc/p/humane-ai-pin-cellular-mvno-sam-altman\">Humane’s largest shareholder</a>, is <a href=\"https://daringfireball.net/linked/2023/12/26/tang-tan-lovefrom\">reportedly working with Jony Ive and LoveFrom</a> on “AI hardware”. To me, that’s far more of a warning sign about Humane than their laying off 10 employees.)</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/09/humane-layoffs\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"1bfefa9b02ecac0d26fcd0ee71c272012096b1e63f0bcc359749092f961537e8","category":"Tech"}