{"title":"Enhancing prebiotic, antioxidant, and nutritional qualities of noodles: A collaborative strategy with foxtail millet and green banana flour","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307909","date":1724076000000,"content":"<p>by Tasnim Farzana, Md. Jaynal Abedin, Abu Tareq Mohammad Abdullah, Akter Hossain Reaz, Mohammad Nazrul Islam Bhuiyan, Sadia Afrin, Mohammed Abdus Satter</p>\r\n\r\nFoxtail millet (FM) and green banana (GB) are rich in health-promoting nutrients and bioactive substances, like antioxidants, dietary fibers, and various essential macro and micronutrients. Utilizing GB and FM flour as prebiotics is attributed to their ability to support gut health and offer multiple health benefits. The present study aimed to evaluate the impact of incorporating 10% GB flour (GBF) and different proportions (10–40%) of FM flour (FMF) on the prebiotic potential, antioxidant, nutrient, color, cooking quality, water activity and sensory attributes of noodles. The prebiotic potential, antioxidant, and nutrient of the produced noodles were significantly improved by increasing the levels of FMF. Sensorial evaluation revealed that noodles containing 30% FMF and 10% GBF attained comparable scores to the control sample. Furthermore, the formulated noodles exhibited significantly (<i>p</i> &lt; 0.05) higher levels of protein, essential minerals (such as iron, magnesium, and manganese), dietary fiber (9.37 to 12.71 g/100 g), total phenolic compounds (17.81 to 36.35 mg GA eq./100 g), and total antioxidants (172.57 to 274.94 mg AA eq./100 g) compared to the control. The enriched noodles also demonstrated substantially (<i>p</i> &lt; 0.05) increased antioxidant capacity, as evidenced by enhanced DPPH and FRAP activities, when compared to the control noodles. Overall, the incorporation of 30% FMF and 10% GBF led to a noteworthy improvement in the nutritional and antioxidant qualities of the noodles, as well as the prebiotic potential of the noodles with regard to <i>L</i>. <i>plantarum</i>, <i>L</i>. <i>rhamnosus</i>, and <i>L</i>. <i>acidophilus</i>. The implementation of this enrichment strategy has the potential to confer a multitude of health advantages.","author":"Tasnim Farzana","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1c057ee8ccba24e1b745da8f4470da613f716c1bc57af0a329b02deb20b8f5d8","category":"Interdisciplinary"}