{"title":"PSVI-8 Effect of botanical extracts and calcium gluconate fed during lactation on sow and litter performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/325/7664863?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to investigate the effect of two levels of botanical extracts and botanical extracts in combination with calcium gluconate on sow and pig performance. A total of 541 sows (average parity 2.6, range 0-8) were used in 9 weekly farrow groups. Sows were housed in individual farrow stalls 5 d before the expected farrow date where treatments diets were fed until weaning at 21 d post farrowing. Sows were fed a fortified corn, soybean meal, and corn DDGS diet meeting or exceeding NRC 2012 nutrient requirements for lactating sows. The two test ingredients were 1) botanical extracts contained a proprietary formulation of turmeric, capsicum, and black pepper oleoresins (Fytera Care, Selko USA, Indianapolis, IN), and 2) calcium gluconate replaced corn in the diet. A general gestation diet void of test ingredients was fed before housing and after weaning. Dietary treatments were: 1) basal lactation diet (CON), 2) 150 ppm botanical extracts (150TCB), 3) 200 ppm botanical extracts (200TCB), and 4) 150 botanical extracts and 1000 ppm calcium gluconate (150TCB+CaG). During lactation, sows were allowed ad libitum access to water and feed. Pigs had unlimited access to sow and water. Pigs were cross-fostered within dietary treatments within 24 h of birth to meet a minimum of 75% and maximum of 2 pigs in excess of functional teats of the sow. Excess pigs were fostered to non-treatment nurse sows. Pig mortalities were recorded daily. Weaned sows were observed for 14 d for estrus detection. Statistical analyses included a two-way ANOVA with fixed effect of dietary treatment, random effect of farrow room, and parity as a covariate. Treatment contrasts were analyzed by Student’s t-test. Sow performance measures did not significantly differ between treatments (Table). Pig mortality was significantly (<span>P</span> &lt; 0.001) reduced for both 150TCB and 200TCB compared with CON and 150TCB+CaG treatments. Other pig performance measures were not significantly affected. However, treatment contrasts showed a greater (<span>P</span> &lt; 0.05) pig weaning weight for 200TCB compared with the CON. Analyzing data by parity class of 0, 1-5, 6-8 showed that piglet mortality was affected significantly (<span>P</span> &lt; 0.02) in parities 1-5 and 6-8 but not in parity 0. Pig weaning weight tended (<span>P</span> &lt; 0.06) to be affected in parity 0, but not in higher parity sows. Treatment contrasts showed a greater weaning weight for pigs on the 150AFP and 150TCB+CaG treatments versus CON. In conclusion, feeding botanical extracts at 150 and 200 ppm decreased pig mortality and the addition of calcium gluconate negated the improvement in mortality.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1c0959461b809a13c1649911ec72b3d4ba3d58a9b7ec667fd2ff39e4ffc56ba3","category":"Environment"}