{"title":"Delineating the shape of COat Protein complex-II coated membrane bud","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae305/7721057?rss=1","date":1721952000000,"content":"<span><div>Abstract</div>Curvature-generating proteins that direct membrane trafficking assemble on the surface of lipid bilayers to bud transport intermediates, which move protein and lipid cargoes from one cellular compartment to another. However, it remains unclear what controls the overall shape of the membrane bud once curvature induction has begun. In vitro experiments showed that excessive concentrations of the COPII protein Sar1 promoted the formation of membrane tubules from synthetic vesicles, while COPII-coated transport intermediates in cells are generally more spherical or lobed in shape. To understand the origin of these morphological differences, we employ atomistic, coarse-grained (CG), and continuum mesoscopic simulations of membranes in the presence of multiple curvature-generating proteins. We first characterize the membrane-bending ability of amphipathic peptides derived from the amino terminus of Sar1, as a function of interpeptide angle and concentration using an atomistic bicelle simulation protocol. Then, we employ CG simulations to reveal that Sec23 and Sec24 control the relative spacing between Sar1 protomers and form the inner-coat unit through an attachment with Sar1. Finally, using dynamical triangulated surface simulations based on the Helfrich Hamiltonian, we demonstrate that the uniform distribution of spacer molecules among curvature-generating proteins is crucial to the spherical budding of the membrane. Overall, our analyses suggest a new role for Sec23, Sec24, and cargo proteins in COPII-mediated membrane budding process in which they act as spacers to preserve a dispersed arrangement of Sar1 protomers and help determine the overall shape of the membrane bud.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"1c0ed43d0a4be259296f251b67ebcdd84ea631fd00b0d0e337c0a547f4a8a8d7","category":"Interdisciplinary"}