{"title":"How to fit, remove and change bike pedals","link":"https://www.bikeradar.com/advice/workshop/how-to-change-bike-pedals/","date":1624536000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/03/How-to-fit-and-remove-pedals-from-a-bicycle-19-8e43cc1.jpg?quality=90&amp;resize=620,413\" />                                            <p>\n</p><p>Knowing how to remove and change bike pedals is a key skill for any cyclist, especially if you’re <a href=\"https://www.bikeradar.com/advice/workshop/how-to-assemble-a-bike/\" target=\"_blank\">assembling a new bike</a> or want to try out <a href=\"https://www.bikeradar.com/features/how-to-use-clipless-pedals/\" target=\"_blank\">riding with clipless pedals</a>.</p>\n<p>In this step-by-step guide, we talk you through the tools you need to change the pedals on your bike, including how to identify your left and right pedals, how to remove old pedals and, of course, how to fit new pedals.</p>\n<p>If you’re looking for something new, check out our comprehensive guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-pedals/\" target=\"_blank\">best road bike pedals</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-pedals-13-of-our-favourites/\" target=\"_blank\">best mountain bike pedals</a>, as reviewed by our expert in-house testers.</p>\n<p>If you are fitting your first set of clipless pedals, check out our guides on <a href=\"https://www.bikeradar.com/features/how-to-use-clipless-pedals/\" target=\"_blank\">how to use clip-in pedals</a> and <a href=\"https://www.bikeradar.com/features/how-to-install-and-adjust-cycling-cleats/\" target=\"_blank\">how to set up your cleats</a>.</p>\n<section><div>\n        <h4>Jump to…</h4>\n<ul><li><a href=\"#tools\">Tools required to fit and remove pedals</a></li>\n<li><a href=\"#left_vs_right\">How to tell left from right pedals</a></li>\n<li><a href=\"#remove_pedals\">How to remove pedals from a bike</a></li>\n<li><a href=\"#fit_pedals\">How to fit pedals to a bike</a></li>\n</ul><p>\n\n    </p></div>\n    </section><h2><a></a>Tools required to change bike pedals</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/03/How-to-fit-and-remove-pedals-from-a-bicycle-5-5a6a5bd-e1617784150159.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The majority of pedals require either a 15mm spanner of an 8mm Allen (hex) key.</span>\n    </figcaption><span>\n                    <i>Laura Dow / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/03/How-to-fit-and-remove-pedals-from-a-bicycle-4-a74fb60-e1617783931749.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Provided it’s not too fat, any open-ended 15mm spanner will do.</span>\n    </figcaption><span>\n                    <i>Laura Dow / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/03/How-to-fit-and-remove-pedals-from-a-bicycle-3-6f4079b-e1617784123155.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>8mm hex keys are more common, but 6mm hex keys are also used. </span>\n    </figcaption><span>\n                    <i>Laura Dow / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nMost pedals are fitted and removed using either a 15mm spanner or an 8mm Allen (hex) key.\n<div>\n    <img /></div><div><figcaption><span><i></i> If your pedals have parallel faces like this, you need a 15mm spanner.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>If your pedals have parallel faces on the spindle between the pedal body and the crank, you will need a 15mm spanner.</p>\n<p>Any 15mm spanner will work provided it’s not too fat to fit between the crank and pedal body. You may struggle to fit an adjustable spanner in there.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Don’t get confused by lockrings like these. These will almost always be larger than 15mm and are used to access the internals of the pedal.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>Some pedals, such as more expensive <a href=\"https://www.bikeradar.com/advice/buyers-guides/shimano-spd-vs-spd-sl/\" target=\"_blank\">Shimano pedals</a>, have a larger locking nut next to the wrench flats. These are used to access the internals of the pedal for servicing – don’t get confused by this.</p>\n<p>Some very old pedals may have 9/16in pedal flats. You are very unlikely to encounter this on anything but the oldest bikes and, given 9/16in equates to 14.28mm, you might not even notice if using a 15mm spanner.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/03/How-to-fit-and-remove-pedals-from-a-bicycle-7-925a9a3.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The difference between the two is subtle, but once you’ve swapped a few pedals, you’ll begin to recognise it quickly.</span>\n    </figcaption><span>\n                    <i>Laura Dow / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/03/How-to-fit-and-remove-pedals-from-a-bicycle-20-ff50c00.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The hex head on the end of the spindle is accessed from the back of the crank arm.</span>\n    </figcaption><span>\n                    <i>Laura Dow / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nIf your pedals have a hexagonal socket on the end of the spindle (when viewed from the inside of the crank), you will need an 8mm hex key. Some pedals use a 6mm hex key instead, but these are in a minority.\n<p>A hex key with a long handle is best for removing pedals, and a T-shaped hex key with a sliding end is ideal because it allows you to move the long part of the hex key to avoid the bike’s chainrings.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Don’t get confused by dust caps on the outside face of the pedal – these are used for servicing the pedals.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>Note you always fit or remove pedals from the crank end of the pedal spindle. If your pedals have a bolt, cap or screw on the outside end of the pedal spindle, this is only used to service the bearings.</p>\n<h2><a></a>Left vs right pedals explained – what are the differences?</h2>\n<p>Left and right pedals have different threads, and ensuring you are fitting the correct pedal to each side of your bike is key.</p>\n<p>Before we go on, for the avoidance of doubt:</p>\n<ul><li>The right-hand side or <strong>driveside</strong> of the bike is the side with the gears on it</li>\n<li>The left-hand side or <strong>non-driveside</strong> of the bike is the side without the gears</li>\n</ul><h3>Right pedal threading</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The right pedal always loosens anti-clockwise and tightens clockwise.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>Right (driveside) pedals are always standard-threaded.</p>\n<p>This means they tighten by turning the spindle <strong>clockwise</strong> and loosen by turning anti-clockwise. In other words, right to tighten, left to loosen.</p>\n<h3>Left pedal threading</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The left pedal always loosens clockwise and tightens anti-clockwise.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>Left (non-driveside) pedals are always reverse-threaded. This means they tighten by turning the spindle <strong>anti-clockwise</strong> and loosen by turning clockwise.</p>\n<p>To be totally clear, this is the opposite of the driveside pedal (and pretty much every other threaded part you are likely to encounter on a bike or in life).</p>\n<h3>How to tell apart left and right pedals</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Most pedals will have clear stampings to differentiate the left from the right.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>Luckily, every pedal will come marked in some way to indicate whether it is for the left or right side of your bike.</p>\n<p>At its most basic, an L or R will be stamped onto the end of the spindle. It is also sometimes stamped onto the wrench flats of a pedal, or printed onto the body of the pedal.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> It is also sometimes printed onto the body of the pedal.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>If your pedal doesn’t have this, it may instead have a textured area next to the wrench flats to indicate it is the left pedal.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Look closely at the threads to determine which is the left pedal – the threads will angle up towards the left.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>If your pedal doesn’t have this either, you can look closely at the threads of the pedal spindle.</p>\n<p>A right pedal is standard-threaded and, looking at the threads, they appear to angle upwards to the right.</p>\n<p>The left pedal is reverse-threaded and, looking at the threads, they appear to angle upwards to the left.</p>\n<h2><a></a>How to remove pedals from a bike</h2>\n<h3>Step 1: How to remove the right (driveside) pedal from your bike</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Rotate your cranks so they are roughly parallel with the ground.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>Rotate your cranks so, when viewed from the driveside of your bike, the right-hand crank is pointing roughly towards the front wheel (the three o’clock position).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Place your spanner onto the wrench flats and press down.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>If your pedals use wrench flats, place your spanner onto these so it is pointing towards the rear of the bike.</p>\n<p>If your pedals use a hex key, place the short end of the hex key into the back of the pedal so the long section is pointing towards the back of the bike.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Press down hard to loosen the pedal.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>With your tool fitted, push down hard onto the tool, while holding the opposite crank, to loosen the pedal. You can then continue to unscrew the pedal by hand.</p>\n<p>If your pedals weren’t greased when they were fitted, or if they just haven’t been removed for a long time, this may take a great deal of force.</p>\n<p>If you cannot loosen the thread by hand, increasing your leverage carefully with an old pipe or similar implement can help.</p>\n<p>If you do not have anything like this to hand, you can try placing the wheels of your bike on the floor and, with someone holding it steady, try using your foot instead to apply extra pressure.</p>\n<p>Ensure your tool is very securely fitted to the wrench flat or hex socket before doing this. We also suggest you put a folded towel or old book beneath the pedal to protect your floor.</p>\n<h3>Step 2: How to remove the left (non-driveside) pedal from your bike</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The process is exactly the same for the non-driveside pedal.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>Viewing your bike from the non-driveside, rotate your left-hand crank so it is pointing towards the front wheel (the nine o’clock position).</p>\n<p>Now, following the exact same steps as before, place your tool so that it is pointing towards the back of the bike.</p>\n<h2><a></a>How to change bike pedals</h2>\n<h3>Step 1: How to fit the right (driveside) pedal to your bike</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Thoroughly clean the threads before fitting.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>If you have either a used pair of pedals or a used bike, thoroughly clean the threads on both the crank and the pedals. Grit or dirt can damage and wear out threads over time.</p>\n<p>With the threads clean, apply a thin layer of grease or anti-seize to the threads on the pedal axle.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Do not skip greasing the threads. You will only live to regret it later.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>This step is <strong>absolutely vital</strong>. At best, fitting pedals with ‘dry’ threads can lead to your pedals becoming extremely difficult to remove. At worst, if left long enough, your pedals and cranks could fuse together permanently.</p>\n<p>Don’t be tempted to use anything other than grease or anti-seize here – <a href=\"https://www.bikeradar.com/advice/buyers-guides/chain-lubes/\" target=\"_blank\">chain lube</a> or other oils won’t cut it in the long run.</p>\n<p>Some cranks and pedals require you to fit a thin pedal washer onto the spindle before fitting. Check your bike or crankset owner’s manual if you are unsure.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Threading the pedal in by hand.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>With the pedal axle lightly greased, begin by threading the axle in by hand. The right-hand pedal tightens by turning the axle <strong>clockwise</strong>.</p>\n<p>Continue threading the pedal by hand until it bottoms out on the crank. Once bottoming out against the crank, tighten up the pedal lightly with either your hex key or spanner.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Tighten up the pedals so they are snug against the crank arm.</span></figcaption><span> <i>Laura Dow / Immediate Media</i></span></div>\n<p>The pedals do not have to be very tight – just firmly snug against the crank. ‘Wrist tight’ is the best way to describe this.</p>\n<h4>Are you sure you’re fitting the correct pedal?</h4>\n<p>You may not be able to thread old cranks or pedals with dull threads by hand.</p>\n<p>Before turning to your tools, first double-check you are definitely fitting the correct pedal – the left-hand pedal will not thread into the crank and forcing it will cross the threads and destroy the bike’s crank.</p>\n<p>Even experienced mechanics can be caught out here if they’re in a rush, so take the time to check you’re doing it right.</p>\n<p>Once you are 100 per cent certain you are fitting the correct pedal, you can try using your spanner or hex key to get things going.</p>\n<h3>Step 2: How to fit the left-hand (driveside) pedal to your bike</h3>\n<p>The process is exactly the same for the left-hand pedal but, as it is reverse-threaded, you tighten it by turning the spindle <strong>anti-clockwise</strong>.</p>\n<p>Once you’ve fitted the pedals, wipe off any excess grease from the crank and you’re ready to ride.</p>","author":"Jack Luke","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"1c18bcbdb459f808ef0bd0a8415f32049d833cd9826980622323dcde90f5ce60","category":"Cycling"}