{"title":"424 Examining the effect of genetics between Bos taurus and Bos Indicus influenced cattle on production performance, carcass characteristics, and feeding behavior","link":"https://academic.oup.com/jas/article/102/Supplement_3/13/7757094?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Cattle production within the US has and will continue to be negatively impacted by climate change. With the amount of natural resources and arable land decreasing every day, it is imperative to improve cattle production efficiency to meet the needs of the rapidly growing global population. Increasing the percentage of <span>Bos indicus</span> (BI) genetics within the US beef herd is one potential method of doing so, as BI cattle are better adapted to nutritional stress and increment weather when compared with <span>Bos taurus</span> (BT) cattle. Despite these positive attributes, BI cattle often have a more excitable temperament, exhibit decreased production performance, and have compromised carcass quality when compared with BT cattle. The objective of this study was to examine how breed type and genetic differences between BT and BT-BI crossbred cattle contribute to production performance, feeding behavior, and carcass quality in a temperate climate setting. This study utilized a total of 88 steers of two different breed types, Angus (AN; 100% BT) and Santa Gertrudis influenced (SG; 19% BI, 81% BT), and took place over 2 yr in 2020 (n = 23 AN and n = 9 SG) and 2021 (n = 35 AN and n = 21 SG). All steers were fed a typical feedlot ration, were housed in pens equipped with Vytelle units, and were harvested at a commercial facility once industry backfat standards were achieved. Statistical analysis was conducted using the Mixed Procedure of SAS with Tukey-Kramer adjustments. Production-related traits including dry matter intake (DMI), average daily gain (ADG), and feed efficiency (G:F) were not affected (<span>P</span> &gt; 0.10) by breed type. Intramuscular fat was increased (<span>P</span> = 0.0003) in AN steers; however, other carcass traits including ribeye fat thickness, hot carcass weight (HCW), cold camera ribeye size, and cold camera yield grade were unaffected (<span>P</span> &gt; 0.10) by breed type. Feeding behavior traits including the number and duration of bunk visits (BV) and feed bouts (FB) did not differ (<span>P</span> &gt; 0.10) between breeds, but SG steers did spend more time with their heads down during such BV (<span>P</span> = 0.0047) and FB (<span>P</span> = 0.0078), respectively. To better examine the genomic differences between the two beef breeds, a Bovine GGP 100k assay was completed commercially and data were analyzed using models in SNP and Variation Suite. Following FDR corrections, SNPs with differences in allelic combinations that contributed to statistical significance were observed in ADG, DMI, HCW, marbling scores, and duration of BV and FB where the steers had their heads down. Potential breed effects were observed in marbling scores, cold camera yield grade, and cold camera ribeye size, however, due to the limited number of steers, additional research utilizing a larger population is warranted to validate such findings.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1c199aadc8fd03b82079c17d94e1947d2375f02ce15347b9e5fe2536f48fc2db","category":"Environment"}