{"title":"Pharmacokinetics and pharmacodynamics of five distinct commercially available hemp-derived topical cannabidiol products","link":"https://academic.oup.com/jat/article/48/2/81/7523740?rss=1","date":1704931200000,"content":"<span><div>Abstract</div>Products containing cannabidiol (CBD) have proliferated after the 2018 Farm Bill legalized hemp (cannabis with ≤0.3% delta-9-tetrahydrocannabinol (Δ<sup>9</sup>-THC)). CBD-containing topical products have surged in popularity, but controlled clinical studies on them are limited. This study characterized the effects of five commercially available hemp-derived high CBD/low Δ<sup>9</sup>-THC topical products. Healthy adults (<span>N </span>= 46) received one of six study drugs: a CBD-containing cream (<span>N</span> = 8), lotion (<span>N</span> = 8), patch (<span>N</span> = 7), balm (<span>N </span>= 8), gel (<span>N</span> = 6) or placebo (<span>N </span>= 9; matched to an active formulation). The protocol included three phases conducted over 17 days: (i) an acute drug application laboratory session, (ii) a 9-day outpatient phase with twice daily product application (visits occurred on Days 2, 3, 7 and 10) (iii) a 1-week washout phase. In each phase, whole blood, oral fluid and urine specimens were collected and analyzed via liquid chromatography with tandem mass spectrometry (LC–MS-MS) for CBD, Δ<sup>9</sup>-THC and primary metabolites of each and pharmacodynamic outcomes (subjective, cognitive/psychomotor and physiological effects) were assessed. Transdermal absorption of CBD was observed for three active products. On average, CBD/metabolite concentrations peaked after 7–10 days of product use and were highest for the lotion, which contained the most CBD and a permeation enhancer (vitamin E). Δ<sup>9</sup>-THC/metabolites were below the limit of detection in blood for all products, and no urine samples tested “positive” for cannabis using current US federal workplace drug testing criteria (immunoassay cut-off of 50 ng/mL and confirmatory LC–MS-MS cut-off of 15 ng/mL). Unexpectedly, nine participants (seven lotions, one patch and one gel) exhibited Δ<sup>9</sup>-THC oral fluid concentrations ≥2 ng/mL (current US federal workplace threshold for a “positive” test). Products did not produce discernable pharmacodynamic effects and were well-tolerated. This study provides important initial data on the acute/chronic effects of hemp-derived topical CBD products, but more research is needed given the diversity of products in this market.</span>","author":"","siteTitle":"Journal of Analytical Toxicology Current Issue","siteHash":"684cff8c881f5537e121ec409f4017c5ba6630e2a004f9595c9e918ac4254c23","entryHash":"1c1a9e1d846e03b817eba8bb0718055d022ad7bf5db7ce90811cbe48eba3336e","category":"Environment"}