{"title":"Prevalence of metabolic dysfunction-associated fatty liver disease and its association with glycemic control in persons with type 2 diabetes in Africa: A systematic review and meta-analysis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002835","date":1715004000000,"content":"<p>by Emmanuel Ekpor, Samuel Akyirem, Precious Adade Duodu</p>\r\n\r\nMetabolic dysfunction-associated fatty liver disease (MAFLD) and type 2 diabetes (T2D) are interconnected metabolic disorders with significant health implications. However, a comprehensive understanding of the extent of their co-occurrence in Africa is lacking. The aim of this review was to determine the prevalence of MAFLD and its association with glycemic control (HbA1c) in persons with T2D in Africa. A systematic search was conducted on PubMed, Medline, Embase, Scopus, Global Health, and Web of Science from their inception to December 6, 2023. Data on MAFLD prevalence and correlation coefficients regarding its association with glycemic control were pooled through random effect meta-analyses. Potential sources of heterogeneity were investigated using subgroup analysis and meta-regression. A total of 10 studies were included in the meta-analysis of MAFLD prevalence, while 2 were incorporated in the analysis of the association between MAFLD and glycemic control. The pooled prevalence of MAFLD in persons with T2D was 48.1% (95% CI: 36.1–60.3). The subgroup analysis revealed regional variations in MAFLD prevalence, with rates of 44.7% (95% CI: 28.7–62.0) in sub-Saharan Africa and 55.3% (95% CI: 36.2–73.0) in Northern Africa. Additionally, we observed an increasing trend in MAFLD prevalence, recording 55.1% (95% CI: 43.6–66.1) in the recent five years. There was a weak positive correlation between MAFLD and HbA1c (r = 0.33, 95% CI: 0.18–0.47). The findings of this study highlight a high prevalence of MAFLD in persons with T2D in Africa, with a suggested link between MAFLD and suboptimal glycemic control. Therefore, healthcare providers should prioritize the screening and management of MAFLD in individuals with T2D to enhance their metabolic health.","author":"Emmanuel Ekpor","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"1c1ca6eaf018903924e1c948b32b8096324866056aa3df145fe5c3c837124767","category":"Environment"}