{"title":"Community Paramedicine Supporting Community Needs: A Scoping Review","link":"https://www.preprints.org/manuscript/202310.0999/v3","date":1726217209000,"content":"Health and social needs exist along a dynamic continuum. Recognizing that health status is inextricably impacted by social determinants of health, community paramedicine has opportunities and a responsibility to reduce inequities. The objective of this scoping review was to investigate peer-reviewed and grey literature to explore how community paramedicine supports community needs along a health and social continuum. We conducted a scoping review of English language literature using the JBI Scoping Review methodology. We searched CINAHL, EMBASE, MEDLINE, Google Scholar, and organisational websites. 30 peer-reviewed and 13 grey literature articles met inclusion criteria. The findings describe the ways community paramedicine models evolved from minimising system pressures on emergency health services to addressing health and social needs. A key recommendation across the literature was the need to meaningfully engage communities early in program development to understand how best to implement and co-design integrated service models addressing specific community needs, though there was a lack of evidence to guide this approach. There is a notable lack of evidence pertaining to optimising technologies in program design and implementation. Results highlight opportunities to determine best practices for conducting holistic community needs assessments that include equitable stakeholder engagement and enhancing education to prepare paramedics for expanded roles. Community paramedicine provides opportunities to better meet the needs of structurally marginalised communities. There is a social responsibility and opportunity to engage communities to co-design service delivery, advance paramedic education, and enhance interprofessional collaboration to better support community needs and generate upstream solutions for individuals and communities","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1c20e8b953fd55f82f7f128a11fe9181bc41c61b2be167491d6d814e9c9fba35","category":"Interdisciplinary"}