{"title":"10 Awardee Talk: Pregnancy losses in Bos indicus-influenced cowherds","link":"https://academic.oup.com/jas/article/102/Supplement_3/100/7757138?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Pregnancy loss is recognized as a major reproductive challenge in beef cattle operations. Most pregnancy losses are associated with early embryonic mortality, but limited research evaluated pregnancy losses throughout the gestation period. Research is warranted to address this gap in knowledge, particularly fetal losses in <span>Bos indicus</span>-influenced females. This subspecies predominates in tropical regions of the planet, which contain more than 80% of the world’s cattle population and supply a major portion of the global demand for beef products. Our group recently evaluated pregnancy losses from d 30 of gestation to calving in 4,926 Nelore females assigned to an ovulation synchronization + fixed-time artificial insemination (FTAI) protocol. Pregnancy loss was greater (<span>P</span> &lt; 0.01) from d 60 to 150 of gestation (10.2%) compared with d 30 to 60 of gestation (6.0%) and with d 150 of gestation to calving (7.4%) and differed (<span>P</span> = 0.04) between these latter two periods. Pregnancy loss from d 30 to 60 of gestation did not differ (<span>P</span> = 0.26) among cow parities (nulliparous, primiparous, and multiparous), whereas total pregnancy losses (d 30 to calving) were greater (<span>P</span> &lt; 0.01) in precocious (28.4%) and conventional (27.1%) heifers compared with primiparous (16.4%) and multiparous (13.0%) cows. In a second experiment, pregnancy losses from fixed-time embryo transfer (FTET) to calving were evaluated in 4,366 FTET events using Nelore × Angus recipient heifers. Pregnancy losses were greater (<span>P</span> &lt; 0.01) from FTET to d 32 of gestation compared with d 32 to 100 and with d 100 to calving (58.7, 39.5, and 36.7%, respectively), and did not differ (<span>P</span> = 0.56) between these latter periods. Recipients that lost the pregnancy from FTET to d 32 gained less (<span>P</span> &lt; 0.01) body condition score after FTET compared with recipients that maintained the pregnancy. Pregnancy losses from d 32 to calving were greater (<span>P</span> &lt; 0.01) in recipients reared in drylots and moved to pastures on d 32 compared with recipients reared on pasture. Collectively, these results provide novel information about pregnancy losses in <span>Bos indicus</span> females, with a substantial proportion of losses occurring as fetal mortality.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1c21db9e0765c8571eee669738a066ecdcd11c5973510ab17078b2499a8917ac","category":"Environment"}