{"title":"Effects of e-cigarette smoking on periodontal health: A scoping review","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002311","date":1710943200000,"content":"<p>by Priti Charde, Kamran Ali, Nader Hamdan</p>\r\nObjectives <p>Use of electronic cigarettes (ECs), also known as vaping, has gained remarkable popularity globally during the last decade especially among young people. Current evidence suggests that vaping may be associated with health risks. The aim of this study is to evaluate whether vaping increases the risk for initiation and progression of periodontal disease; and to appraise the clinical changes seen in patients using e-cigarettes, and how these changes impact the management of periodontal disease.</p> Study selection, data and sources <p>A comprehensive electronic search was conducted on the PubMed, Scopus and Embase databases using the following search terms: Electronic Cigarettes OR vaping OR electronic nicotine delivery systems OR e-cigarettes AND Periodontitis. The search was limited to studies published from 1<sup>st</sup> January 2012 to 31<sup>st</sup> December 2022.</p> Results <p>A total of 23 clinical studies focusing on the effect of e-cigarette smoking on the periodontal clinical parameters, levels of inflammatory mediators, alteration in periodontal microflora, and response to periodontal treatment were found to be eligible for inclusion in the review. Vaping may be associated with greater clinical attachment loss (CAL) compared to non-smokers. Moreover, ECs are also associated with unfavorable effects on periodontal microbial counts, biomarkers of inflammation and oxidative stress.</p> Conclusions <p>Vaping may play a role in the initiation and progression of periodontal disease by altering the host response resulting in the release of inflammatory cytokines and periodontal microflora. Clinical studies show deleterious effects of vaping on periodontal health as well as less favourable response to periodontal treatment is observed in e–cigarette users compared to non-smokers. However, compared to cigarette smoking, the effects of vaping are less remarkable.</p>","author":"Priti Charde","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"1c2ac8bc7eff47b290f856e7c7db55e1a98f465973e83a416cd2d6988f4d3d93","category":"Environment"}