{"title":"Microbial influence on the larval survival of Japanese eel <i>Anguilla japonica</i>: Antibiotic-mediated alterations and biomarker isolation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306634","date":1720447200000,"content":"<p>by Youhei Fukui, Yoji Nakamura, Hitoshi Imaizumi, Masaaki Kamoshida</p>\r\n\r\nIn rearing systems for the Japanese eel <i>Anguilla japonica</i>, although it is assumed that microorganisms influence larval survival and mortality, particularly during the early stages of growth, the effects of bacterial communities on larval survival have yet to be sufficiently determined. In this study, we compared the bacterial communities associated with larval survival at three stages of eel growth. To artificially alter bacterial communities and assess larval survival, eel larvae were treated with 11 types of antibiotic, and larval survival and bacterial characteristics were compared between the antibiotic-treated and antibiotic-free control groups. Throughout the three growth stages, eels treated with four antibiotics (polymyxin B, tetracycline, novobiocin, and erythromycin) had survival rates higher than those in the control groups. The bacterial communities of surviving larvae in the control and antibiotic groups and dead larvae in the control groups were subsequently analyzed using 16S rRNA gene amplicon sequencing. PERMANOVA analysis indicated that these three larval groups were characterized by significantly different bacterial communities. We identified 14 biomarker amplicon sequence variants (ASVs) of bacterial genera such as <i>Oceanobacter</i>, <i>Alcanivorax</i>, <i>Marinobacter</i>, <i>Roseibium</i>, and <i>Sneathiella</i> that were enriched in surviving larvae in the antibiotic treatment groups. In contrast, all four biomarker ASVs enriched in dead larvae of the control groups were from bacteria in the genus <i>Vibrio</i>. Moreover, 52 bacterial strains corresponding to nine biomarkers were isolated using a culture method. To the best of our knowledge, this is the first study to evaluate the bacterial communities associated with the survival and mortality of larvae in during the early stages of Japanese eel growth and to isolate biomarker bacterial strains. These findings will provide valuable insights for enhancing larval survival in the eel larval rearing systems from a microbiological perspective.","author":"Youhei Fukui","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1c2a73f12cda05ad67b2ed2847aba75e0f1da14b38da47cfc75c1d7f5db1a70d","category":"Interdisciplinary"}