{"title":"Evaluating climate change effects on hydrological functionality and water‐related ecosystem services","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2557?af=R","date":1721273930000,"content":"<h2>Abstract</h2>\n<p>The paper investigates the effects of climate change on riverine ecosystems in the Upper Arno River basin, adopting a hybrid methodology relating the changes in streamflow to its related water ecosystem services. Twenty hydrological models were run using the Soil and Water Assessment Tool (SWAT), under their respective climate model and emission scenario. The streamflow variable obtained was analysed according to the method of Indicators of Hydrologic Alteration (IHA). The development of spatial maps of IHA allowed us to represent the spatial of the results according to the three river subbasins studied, with a focus on the presence of hotspots. Using IHA allowed to capture of the streamflow quantity and dynamics, through groups of magnitude, timing and rates, where the potential effect could be then linked to the concept of water ecosystem services. Finally, the results obtained were presented as a proxy that can be integrated into the existing Driver, Pressure, State, Impact, Response (DPSIR) management framework to eventually move towards an ecosystem-based management methodology. The main results, induced from the Mann–Kendall trend analysis of the IHA, suggested that provisioning and regulating services are to be affected by climate change where the quantity of flows shows a decreasing trend under several emission scenarios, in addition to an intensification of the extreme events. This shift is accompanied by a change in the dynamics of flow, which holds the potential of affecting habitat suitability. With the emergence of studies directed towards ecosystem-based management, the study refers to well-established hydrological modelling to evaluate climate change as a driver and provide screening results to ensure a proactive response planning that converges with the idea of ecosystems.</p>","author":"Jerome El Jeitany, \nTommaso Pacetti, \nEnrica Caporali","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"1c2d9bebe19ec2b6e40d720e4e8f41715e0925941c00fc234ddd6d00b4ca5865","category":"Environment"}