{"title":"ปัญหาที่เกิดจากการนำแนวคิด Microservices มาใช้ในทางที่ผิด","link":"https://www.somkiat.cc/mistakes-from-microservices/","date":1623569810000,"content":"<p><img src=\"https://www.somkiat.cc/wp-content/uploads/2021/06/eery-1648250_960_720-150x150.jpeg\" /></p>\n<figure><img src=\"https://www.somkiat.cc/wp-content/uploads/2021/06/eery-1648250_960_720.jpeg\" /></figure>\n\n\n\n<p>จากการสอนและแบ่งปันเรื่องการออกแบบระบบ<br />ตามแนวคิด <strong>Microservices</strong> ที่ <strong>Skooldio</strong> มา<br />มีหนึ่งสิ่งที่อยากแนะนำคือ<br />เมื่อเราเข้าใจและปัญหาที่ Microservices เข้ามาช่วยแก้ไขปัญหา<br />แต่ถ้าเรานำมาใช้แล้วดันเกิดปัญหามากกว่าเดิม<br />มันบ่งบอกว่า คุณไม่เข้าใจ หรือ เข้าใจผิด หรือ แก้ปัญหาด้วยวิธีการที่ผิดหรือไม่ ?<br />มาดูกันว่ามีอะไรบ้าง</p>\n\n\n\n<span></span>\n\n\n\n<p><strong>ปัญหาใหญ่ แยกกันแล้วแต่ยังผูกมัดกันไปมา</strong></p>\n\n\n\n<p>เมื่อมีการแก้ไข ต้องแก้ไขหลาย service<br />เมื่อต้องการ deploy หรือ scale ก็กระทบไปกันหมด<br />ยังไม่พอ เมื่อเกิดปัญหา หาและแก้ไขยากกว่าเดิมอีก</p>\n\n\n\n<figure><img src=\"https://www.somkiat.cc/wp-content/uploads/2021/06/microservice01.png\" /></figure>\n\n\n\n<p><strong>หรืออาจจะมาในรูปแบบ layer หรือ service มาตรฐานของแต่ละงาน</strong></p>\n\n\n\n<p>จะมี service layer ที่เกี่ยวข้องกัน เช่น</p>\n\n\n\n<ul><li>Data service</li><li>Orchestration service</li><li>Backend-for-Frontend</li><li>Messaging</li></ul>\n\n\n\n<figure><img src=\"https://www.somkiat.cc/wp-content/uploads/2021/06/microservice02.png\" /></figure>\n\n\n\n<p><strong>แต่ข้อดีของวิธีการนี้คือ</strong></p>\n\n\n\n<ul><li>ทุกคนในทีมและบริษัทจะพูดในทางเดียวกัน</li><li>ทำให้ไม่ต้องสร้างขึ้นมาใหม่ทุกครั้ง</li><li>ง่ายต่อการจัดการ</li><li>ง่ายต่อการบอกว่า จะต้องสร้าง service อะไรบ้าง และแต่ละ service ทำอะไร</li></ul>\n\n\n\n<p>แน่นอนว่า มีทั้งข้อดีและข้อเสีย</p>\n\n\n\n<p><strong>ปัญหาต่อมาคือ มักจะแยก service level มากกว่า database layer</strong></p>\n\n\n\n<p>ซึ่งทำให้ระบบ scale ได้ยากมาก ๆ<br />เรามักจะทำอะไรที่มันง่ายกว่าเสมอหรือไม่ ?</p>\n\n\n\n<p><strong>เรานำแนวคิด Microservices มาใช้เพราะว่าอะไร</strong></p>\n\n\n\n<p>มีปัญหาหรือไม่<br />หรือต้องทำเพราะว่า โดนสั่ง<br />หรือต้องทำเพราะว่า มันคือ trend<br /><br />แนะนำคือ ต้องเริ่มที่ปัญหาและยอมรับปัญหาก่อน<br />จากนั้นจึงหาวิธีการแก้ไขปัญหานั้น ๆ<br />ซึ่งอาจจะแก้ไขได้หรือไม่ ด้วยแนวคิด Microservices ก็ได้</p>\n\n\n\n<p><strong>เราทำ Microservices แต่เรามีทีมดูแล Core service นะ</strong></p>\n\n\n\n<p>Core service คือ service หลักที่ service อื่น ๆ เรียกใช้งาน<br />เรามักจะบอกว่า มันคือ reuse service นั่นเอง<br />แน่นอนว่า จำเป็นต้องมีทีมดูแลมากเป็นพิเศษ<br />เพราะว่ามีคนใช้งานเยอะ<br /><br /><strong><em>ถ้าคนใช้งานหนึ่ง ขอเปลี่ยนแปลงบางอย่าง จะทำได้ไหมนะ ?<br />ถ้าทำได้หนึ่งคน แสดงว่าจะมี logic ของคนนั้นมาอยู่ใน core service<br />คำถามคือ core service มันคือ core service จริงไหม ?</em></strong><br /><br />ความรู้เกี่ยวกับ Core domain จะกระจุกอยู่กับ core team เท่านั้นใช่ไหม<br />ซึ่งมันขัดแย้งกับแนวคิดของ cross-functional team หรือไม่<br />เพราะว่าเป็นการทำงานแบบ component teamปัญหายังคงอยู่ไหมนะ ?</p>\n\n\n\n<p><strong>ยังไม่พอ ทีมสร้างพัฒนา กับทีมดูแล เป็นคนละทีมกัน ?</strong></p>\n\n\n\n<p>คาดว่ามีความสนุกแน่นอน<br /></p>\n\n\n\n<p><strong>การติดต่อสื่อสารระหว่าง service ก็ไม่ใช่เลือกตามอารมณ์​</strong></p>\n\n\n\n<p>ต้องรู้และเข้าใจก่อนว่าในแต่ละ use case การติดต่อสื่อสาร<br />ควรเป็นอะไรsync หรือ async หรือ event-based เป็นต้น<br /></p>\n\n\n\n<p><strong>แบ่งเป็น service เล็ก ๆ ให้ทำงานเป็นอิสระต่อกันแล้ว แต่เมื่อมีปัญหากลับรู้จากผู้ใช้งาน</strong></p>\n\n\n\n<p>แต่ทีมหรือบริษัทกลับไม่รู้ หรือ รู้ช้า<br />นั่นคือปัญหาเรื่องของ observability เช่น logging, tracing และ metric<br />ที่ยังไม่เพียงพอ หรือ พร้อม หรือไม่<br /></p>\n\n\n\n<p><strong><em>ง่าย ๆ คือ ถ้าทำลงไปแล้ว กลับแย่มากกว่าส่งผลดี<br />แสดงว่า เรากำลังเดินไปในเส้นทางที่ผิด<br />ให้ลองหยุดและกลับมามองว่า<br /> ข้อผิดพลาดคืออะไรกันแน่เพื่อปรับปรุง ปรับเปลี่ยนให้มันถูกต้อง</em></strong></p>\n","author":"somkiat","siteTitle":"cc :: somkiat","siteHash":"3a23a5a4389e1e40c6fbb16520a8cc20df5b3591c25145ce72aaa18b19e48201","entryHash":"1c325d7fe9aa9518f697a4532840ac740da38f77ee51630e3378732aecc73d99","category":"Thai"}