{"title":"A comprehensive numerical procedure for high-intensity focused ultrasound ablation of breast tumour on an anatomically realistic breast phantom","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310899","date":1727791200000,"content":"<p>by Reza Rahpeima, Chao-An Lin</p>\r\n\r\nHigh-Intensity Focused Ultrasound (HIFU) as a promising and impactful modality for breast tumor ablation, entails the precise focalization of high-intensity ultrasonic waves onto the tumor site, culminating in the generation of extreme heat, thus ablation of malignant tissues. In this paper, a comprehensive three-dimensional (3D) Finite Element Method (FEM)-based numerical procedure is introduced, which provides exceptional capacity for simulating the intricate multiphysics phenomena associated with HIFU. Furthermore, the application of numerical procedures to an anatomically realistic breast phantom (ARBP) has not been explored before. The integrity of the present numerical procedure has been established through rigorous validation, incorporating comparative assessments with previous two-dimensional (2D) simulations and empirical data. For ARBP ablation, the administration of a 0.1 MPa pressure input pulse at a frequency of 1.5 MHz, sustained at the focal point for 10 seconds, manifests an ensuing temperature elevation to 80°C. It is noteworthy that, in contrast, the prior 2D simulation using a 2D phantom geometry reached just 72°C temperature under the identical treatment regimen, underscoring the insufficiency of 2D models, ascribed to their inherent limitations in spatially representing acoustic energy, which compromises their overall effectiveness. To underscore the versatility of this numerical platform, a simulation of a more clinically relevant HIFU therapy procedure has been conducted. This scenario involves the repositioning of the ultrasound focal point to three separate lesions, each spaced at 3 mm intervals, with ultrasound exposure durations of 6 seconds each and a 5-second interval for movement between focal points. This approach resulted in a more uniform high-temperature distribution at different areas of the tumour, leading to the ablation of almost all parts of the tumour, including its verges. In the end, the effects of different abnormal tissue shapes are investigated briefly as well. For solid mass tumors, 67.67% was successfully ablated with one lesion, while rim-enhancing tumors showed only 34.48% ablation and non-mass enhancement tumors exhibited 20.32% ablation, underscoring the need for multiple lesions and tailored treatment plans for more complex cases.","author":"Reza Rahpeima","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1c341108a3730d5344a585b4398eaa3981935ac0bc20c528ebe5a253fb6b72da","category":"Interdisciplinary"}