{"title":"Determinants of intention to leave among nurses and physicians in a hospital setting during the COVID-19 pandemic: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300377","date":1710424800000,"content":"<p>by Neeltje de Vries, Laura Maniscalco, Domenica Matranga, José Bouman, J Peter de Winter</p>\r\nBackground <p>The global outbreak of COVID-19 has brought to light the profound impact that large-scale disease outbreaks can have on healthcare systems and the dedicated professionals who serve within them. It becomes increasingly important to explore strategies for retaining nurses and physicians within hospital settings during such challenging times. This paper aims to investigate the determinants of retention among nurses and physicians during the COVID-19 pandemic.</p> Method <p>A systematic review of other potential determinants impacting retention rates during the pandemic was carried out. Secondly, a meta-analysis on the prevalence of intention to leave for nurses and physicians during the COVID-19 pandemic.</p> Findings <p>A comprehensive search was performed within four electronic databases on March 17 2023. Fifty-five papers were included in the systematic review, whereas thirty-three papers fulfilled the eligibility criteria for the meta-analysis. The systematic review resulted in six themes of determinants impacting intention to leave: personal characteristics, job demands, employment services, working conditions, work relationships, and organisational culture. The main determinants impacting the intention to leave are the fear of COVID-19, age, experience, burnout symptoms and support. Meta-analysis showed a prevalence of intent to leave the current job of 38% for nurses (95% CI: 26%-51%) and 29% for physicians (95% CI: 21%-39%), whereas intention to leave the profession for nurses 28% (95% CI: 21%-34%) and 24% for physicians (95% CI: 23%-25%).</p> Conclusion <p>The findings of this paper showed the critical need for hospital managers to address the concerning increase in nurses’ and physicians’ intentions to leave during the COVID-19 pandemic. This intention to leave is affected by a complex conjunction of multiple determinants, including the fear of COVID-19 and the confidence in and availability of personal protective equipment. Moreover, individual factors like age, experience, burnout symptoms, and support are maintained in this review. Understanding the influence of determinants on retention during the COVID-19 pandemic offers an opportunity to formulate prospective strategies for retaining nurses and physicians within hospital settings.</p>","author":"Neeltje de Vries","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1c458110a92965e62d1d25a4b2e6673492938b6c639f27ae8e1d34eacb46ee81","category":"Interdisciplinary"}