{"title":"‘The best juniors are training like WorldTour professionals’ - AJ August on joining Ineos Grenadiers and becoming America’s next Grand Tour hopeful","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-best-juniors-are-training-like-worldtour-professionals-aj-august-on-joining-ineos-grenadiers-and-becoming-america-s-next-grand-tour-hopeful","date":1700812801000,"content":"\n      <p><span>“He is Remco, but probably with more power,” was the quote from AJ August’s team manager when he was asked about the junior rider’s potential during an interview with <a href=\"https://www.globalcyclingnetwork.com/racing/news/us-sensation-aj-august-linked-to-ineos-hes-remco-but-probably-with-more-power\" target=\"_blank\">GCN</a> earlier this year. When August strolls through the central London café we are meeting at, he looks so fresh faced and youthful that he could easily be mistaken for a student at the nearby secondary school. To be the next Remco Evenepoel seems like a lot of weight and expectation on this 18-year-old’s shoulders. As he leaves the junior ranks to join the Ineos Grenadiers next year, AJ August has a lot to live up to.</span></p>\n<div></div>\n<div></div>\n<p><span>It’s not just the hyperbolic comments from those around him that have set August up as the next super talent to shoot straight into the WorldTour as soon as he is of age. The American teenager’s results speak for themselves: August finished second in the prestigious junior stage race, Course de la Paix (The Peace Race) earlier this season, he’s the current US national junior time trial champion and he’s been schooling elite riders in some of the biggest domestic events on the USA Cycling calendar for fun. That’s just on the tarmac, too – August won the Koppenberg Cross in Belgium last year and is the current US  <span>National</span> Junior Cyclocross Champion to boot. Rumour has it that August’s power numbers are eye-wateringly impressive, so it’s unsurprising that Ineos Grenadiers (who are in dire need of recruiting the next <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> winner) were keen to win the fight for August’s signature.</span></p>\n<p><span>“I always dreamt of being part of that team,” August admits. “I think the initial contact with them started at the end of my second year junior and then I was able to go on a camp with them in January last year. I felt super at home in the team and then by the Fall, I was able to make it official.”</span></p>\n<p><span>As he speaks, it’s clear why Ineos felt like August was ready to make the big jump up from the junior ranks to the WorldTour, skipping the under-23 category entirely. His answers are mature and measured, far from the hot-headed, throwaway responses that can sometimes be expected of riders his age. It’s well known that teams like Ineos value a rider’s ability to fit in with the team off the bike as well as on it, something that August confirmed he could do when he guested on the team camp just under 12 months ago.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AJ-August---by-Alessandra-Bucci-7998_1024x1024.jpg?v=1700756083\" /></span></p>\n<p><span>“When you're there with riders like Tom Pidcock and others, it can be quite nerve-wracking but they made me feel right at home. You always learn a few things that these guys can teach you because there's so much experience,” August says. “It's quite strange, because I’m over 15 years younger than some of these riders so we're from two different generations, but we're all teammates and we fit in really well together.”</span></p>\n<p><span>August puts a lot of his maturity and ability to fit into a professional team so young down to the outfit he spent his junior years part of, the historic North American Hot Tubes Development Cycling Team. Alumni from Hot Tubes include the likes of Magnus Sheffield, Matteo Jorgenson and Lawson Craddock.</span></p>\n<p><span>“I think it's the man behind the scenes, our sports director Toby Stanton, that makes the team what it is. He really teaches you how to be a professional so that when you're ready to make the jump because you’re physically strong enough, you’re ready to go both on and off the bike.”</span></p>\n<p><span>Training to an extremely high level while still in the junior ranks is becoming more and more common as riders are winning races and signing contracts at a much younger age. This is a trend that has generated some criticism about young riders taking the sport so seriously that it could have negative consequences on the longevity of their careers.</span></p>\n<p><span>“For me, I was always just having fun as a junior. There was pressure, but coming from myself. I wanted to be the best I could,” August says. “It’s hard because people say, ‘just have fun’, but what if everybody else is training like a professional already? It's like, I have to. At the end of the day, you have to balance keeping a normal life but then also still be focused.”</span></p>\n<p><span>August points out that when teams are set-up as professionally as Hot Tubes, and considering the access junior riders have to knowledge today, the gap between the kind of training that junior riders do compared to elite riders has really lessened.</span></p>\n<p><span>“The best juniors are, pretty much, training like WorldTour professionals just with maybe less volume. You just have to balance it correctly because at the end of the day, if you take it a bit less seriously, you'll have more room to grow when you reach the professional ranks. But it's hard to say that because everybody knows they have to get there somehow.”</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AJ-August---by-Alessandra-Bucci-8038_1024x1024.jpg?v=1700761287\" /></p>\n<p><span>Being based in the US when the majority of premier junior races are in Europe is another challenge altogether for riders like August. He explains that he attended online school as a second year junior because he was spending so much time away from home racing that it became a more viable option. </span></p>\n<p><span>“My parents have always been super supportive. They love watching me do well and they always taught me to have fun doing it,” August explains. “I think that's like the best thing they could have done.”</span></p>\n<p><span>August speaks about growing up in a sporting family with his brothers and father all racing, leading to friendly competition in their household. He took part in his first mountain bike race when he was eight years old but didn’t begin on the road until he was in his early teens. During that time, he was cycling alongside racing alpine skiing, a popular sport where he lives in Rochester, New York. August reminisces about watching the Tour de France growing up when Team Sky were the dominant force, something that had always made him dream of being part of it himself one day. </span></p>\n<p><span>That was then, however, and I point out that times have changed since the days of the Sky train dominance. Ineos are currently going through a turbulent period of managerial changes after struggling to compete with the likes of Jumbo-Visma in the Grand Tours in the past few seasons. August says this doesn’t worry him, though.</span></p>\n<p><span>“My full focus is just settling into the team and just doing the best I can do. I don't have too many opinions on what's going on in the team, I think they’re in a very good place and they know what they are doing,” he asserts.</span></p>\n<p><span>It seems like settling in after a winter of change is going to be a theme for August in 2024. He plans on moving to Andorra to live full-time, leaving his friends and family to fully pursue his dreams. He’ll also need to be physically ready to compete in longer and more challenging races, meaning there’s a big couple of months of work ahead to build that endurance base.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AJ-August---by-Alessandra-Bucci_1024x1024.jpg?v=1700756124\" /></span></p>\n<p><span>“I wouldn't say I'm nervous about anything but there's a lot of big changes like the race duration and racing against other WorldTour pros where everybody is so close in percentage. That will be a change to the juniors where there’s only 20 guys who were pretty close, and then the rest of the field is weaker. I'll have to adapt and just see how it is,” August says.</span></p>\n<p><span>The American rider believes that the additional access he will get to resources at Ineos Grenadiers will help him make some big steps up ahead of next season. From nutrition, to knowledge about training, to aerodynamic testing, there’s a lot that Ineos can offer August. He remains characteristically sensible and level-headed about the whole thing, however.</span></p>\n<p><span>“I need to take it step by step and not do everything at once. I think in the next year or two all these things combined can help me to develop further,” he explains. “My goal, at the end of the day, is to turn into a rider that can contend for Grand Tours. I consider myself a good climber, but I need to develop and adapt to the different types of races. But I think in year one, I can try all types of races to see what I enjoy and what suits me the best.”</span></p>\n<p><span>With the likes of Remco Evenepoel and Tadej Pogačar changing everyone’s expectations about what is possible from young riders, there’s inevitably going to be plenty of eyes on August to see what he can do in 2024. If the Ineos Grenadiers offer you a three-year contract before you’ve even fully entered adulthood, it certainly garners plenty of attention, something that August will need to be able to deal with as his career progresses. The man himself, however, doesn't seem particularly concerned with this, coming across as grounded and realistic about what next season will look like. </span></p>\n<p><span>August is clearly a winner, though, and doesn’t fully rule out making a name for himself in the professional ranks even earlier than some might think.</span></p>\n<p><span>“The main objectives are just learning and getting used to everything in professional life. The team is putting no pressure on me,” he says. “But, of course, I want to do well in races. I think because the team is withholding that pressure, that makes it a very good environment for me to surprise them, too.”</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1c4baee7c6715e618058ec5d85b28eaeaa210e8d8b227d0a1cde64edb3894536","category":"Cycling"}