{"title":"3 missing Vision Pro features that will play a key role in the future","link":"https://www.macworld.com/article/1991763/apple-vision-pro-missing-features-maps-translation-lookup.html","date":1689244200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>I haven’t written much about Vision Pro in the month since Apple took the wraps off its headset–er, excuse me, <em>spatial computer</em>. That’s in part because I still haven’t tried it out for myself, but also because I’ve been slowly digesting the staggering amount of technology that the company showed off with its latest device.</p>\n\n\n\n<p>In the meantime, there’s been plenty of theorizing about Apple’s ultimate goals with this product category, and whether a truly lightweight augmented reality device is even achievable with our current technology.</p>\n\n\n\n<p>As I’ve spent time considering the Vision Pro, I realized that Apple’s story for the device is shaped as much by what it <em>didn’t</em> show us as by what it did. That goes for big categories like fitness or gaming, which didn’t get much time in the Vision Pro announcement, but also for smaller, individual features that already show up in other Apple products but are conspicuously absent from the Vision Pro, though they seem ideally suited to the future of this space.</p>\n\n\n\n<h2>Two hands and a map</h2>\n\n\n\n<p>Apple demoed a number of its existing applications that have been ported to the Vision Pro, but the ones it showed off were definitely of a specific bent. Productivity tools like Keynote or Freeform, entertainment apps including Music or TV, communication tools such as FaceTime and Messages, and experiential apps like Photos and Mindfulness.</p>\n\n\n\n<p>One tool not present (as far as we can tell) on the Vision Pro’s home screen? Maps.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-mapping-ar.png?w=554\" alt=\"AR walking directions in iOS\" width=\"277\" height=\"601\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-mapping-ar.png?quality=50&amp;strip=all 1179w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-mapping-ar.png?resize=138%2C300&amp;quality=50&amp;strip=all 138w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-mapping-ar.png?resize=768%2C1665&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-mapping-ar.png?resize=554%2C1200&amp;quality=50&amp;strip=all 554w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-mapping-ar.png?resize=709%2C1536&amp;quality=50&amp;strip=all 709w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-mapping-ar.png?resize=945%2C2048&amp;quality=50&amp;strip=all 945w\" /><figcaption><p>Maps on the iPhone has a very good AR walking experience.</p></figcaption></figure><p>Dan Moren</p></div>\n\n\n\n<p>This strikes me as…not <em>odd</em>, exactly, for reasons I’ll get into, but interesting. Because Maps is one place where Apple has already developed a really good augmented reality interface. Starting in iOS 15, the company rolled out AR-based walking directions, which let you hold up your iPhone and see giant labels overlaid on a camera view. If you’ve missed it, that’s no surprise: it was first available in only a few cities but has quietly expanded in the last couple of years to more than 80 regions worldwide.</p>\n\n\n\n<p>I only ended up trying it out recently, and I was impressed with its utility, but annoyed by having to walk around holding up my iPhone. That made me even more certain that this feature would seem perfectly at home on a pair of augmented reality glasses. But it appears to be nowhere to be found on the Vision Pro.</p>\n\n\n\n<h2>Lost in translation</h2>\n\n\n\n<p>Any science-fiction fan has at some point or another coveted Star Trek’s universal translator or <em>The Hitchhiker’s Guide to the Galaxy’s</em> babelfish: the invisible technology that lets you instantly understand and be understood by anybody else. (Not to mention ironing out a lot of pesky plot problems.)</p>\n\n\n\n<p>Apple’s been gradually beefing up its own translation technology over the past several years, with the addition of the Translate app and a systemwide translation service. While perhaps not as broad as Google’s own offering, Apple’s translation software has been slowly catching up, even adding a conversation mode that can automatically detect people speaking in multiple languages, translate their words, and play them back in audio.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-translate.png?w=554\" alt=\"iOS Translation Conversation Mode\" width=\"277\" height=\"601\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-translate.png?quality=50&amp;strip=all 1179w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-translate.png?resize=138%2C300&amp;quality=50&amp;strip=all 138w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-translate.png?resize=768%2C1665&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-translate.png?resize=554%2C1200&amp;quality=50&amp;strip=all 554w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-translate.png?resize=709%2C1536&amp;quality=50&amp;strip=all 709w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios-translate.png?resize=945%2C2048&amp;quality=50&amp;strip=all 945w\" /><figcaption><p>The iPhone’s Translate app would be an ideal feature for the Vision Pro.</p></figcaption></figure><p>Dan Moren</p></div>\n\n\n\n<p>This is a killer app for travel, and yet another feature that would seem right at home on an augmented reality device. Imagine being able to instantly have a translation spoken into your ear, or displayed on a screen in front of your eyes. Several years ago, I was on an extended stay in India and, when the air conditioner in my now-wife’s apartment broke, I had to call her and have one of her co-workers translate for the repair man, who spoke only Hindi. (To be fair, I did try to use Google’s similar conversation mode at the time, but it ended up being rather cumbersome.)</p>\n\n\n\n<p>And it’s not only for conversations either. Apple’s systemwide translation framework already offers the ability to translate text in a photograph and the Translate app itself has a live camera view, meaning that you could even browse through a store while abroad and have items you see around for you translated on the fly.</p>\n\n\n\n<h2>Don’t look up</h2>\n\n\n\n<p>One of the most mind-blowing features that Apple has developed in recent years is Visual Lookup. When first introduced, it leveraged machine learning to identify a few categories of items seen in photos–including flowers, dogs, landmarks–with somewhat mixed results. But in iOS 17, Apple has improved this feature immensely, both in terms of reliability and by adding other categories, such as looking up recipes from a picture of a meal or identifying and interpreting those mystifying laundry symbols.</p>\n\n\n\n<p>This, to me, is the real dream of augmented reality. To be able to look at something and instantly pull up information about it is a bit like having an annotated guide to the whole world. Moreover, it’s another feature that meshes perfectly with the idea of a lightweight AR wearable device: rather than looking at, say, a work of art, and then burying your nose in your phone to learn more, you can instead see the details right in front of you, or could even have interesting things overlaid or meshed with the actual artwork itself.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/ios17-visuallookup-laundry.png?w=554\" alt=\"Visual Lookup of Laundry Codes in iOS 17\" width=\"277\" height=\"601\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/ios17-visuallookup-laundry.png?quality=50&amp;strip=all 1179w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios17-visuallookup-laundry.png?resize=138%2C300&amp;quality=50&amp;strip=all 138w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios17-visuallookup-laundry.png?resize=768%2C1665&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios17-visuallookup-laundry.png?resize=554%2C1200&amp;quality=50&amp;strip=all 554w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios17-visuallookup-laundry.png?resize=709%2C1536&amp;quality=50&amp;strip=all 709w, https://b2c-contenthub.com/wp-content/uploads/2023/07/ios17-visuallookup-laundry.png?resize=945%2C2048&amp;quality=50&amp;strip=all 945w\" /><figcaption><p>Visual Lookup on a headset</p> seems like an ideal match.</figcaption></figure><p>Dan Moren</p></div>\n\n\n\n<p>Apple didn’t show off any Visual Lookup features in its introduction to Vision Pro, but this is one place where there may be another shoe to drop. MacRumors’s Steve Moser poked around in the Vision Pro software development kit and found notice of a feature called Visual Search, which sounds as though it would do a lot of the same things, getting information from the world around you and augmenting it with additional details.</p>\n\n\n\n<h2>Vision of the future</h2>\n\n\n\n<p>On the face of it, the omission of all of these features makes sense with the story Apple told about where and when you’re likely to use the Vision Pro. Mapping, translation, and visual lookup are the kind of features that are most useful when you’re out and about, but the Vision Pro is still fundamentally a device that you go <em>to</em>, not one that you take with you.</p>\n\n\n\n<p>Calling the Vision Pro a spatial computer might be a buzz-worthy way of avoiding terms like “headset” or “metaverse,” but it also conveys something intrinsic about the product: it really is the mixed reality analog of a <em>computer</em>—and, even there, almost more of a desktop than a laptop, given that it seems to be something that you mostly use in a fixed position.</p>\n\n\n\n<p>But just as laptops and tablets and smartphones evolved the concept of a computer from something you sit at a desk to use to something that you put in a bag or your pocket, it seems obvious that the puck that Apple is skating towards is the Vision Pro’s equivalent of a MacBook or iPhone. Hopefully, it won’t take as long for Apple to get there as it did for the smartphone to evolve from the desktop computer but don’t be surprised if what we ultimately get is just as different from the Vision Pro as the iPhone was from the original Mac.</p>\n\niOS, Virtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1c4d58652d68b8baa569f67de3143b5af9e0ec970d41f38ac942751acb8d7469","category":"Apple"}