{"title":"How to type formatted fractions on your iPhone and iPad","link":"https://www.macworld.com/article/2219820/how-to-type-formatted-fractions-on-your-iphone-and-ipad.html","date":1707469200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you’re typing on a Mac, you have a variety of options on how to enter drawn or “true” fractions, ones that are typographically rendered to look like they appear in a recipe or in a book. I’ve covered that previously in “<a href=\"https://www.macworld.com/article/607237/character-viewer-macos.html\">How to use macOS’s Character Viewer to type emoji and other symbols</a>” and “<a href=\"https://www.macworld.com/article/2012469/how-to-insert-fractions-in-word-and-pages.html\">How to insert fractions in Word and Pages</a>.”</p>\n\n\n\n<p>But what if you’re typing out an email or other text on your iPhone or iPad? Their operating systems lack something as simple as a Character palette. However, you can lean on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/pages/id361309726&amp;xcust=1-1-2219820-1-0-0&amp;sref=https://www.macworld.com/feed\">free Pages app that Apple offers to all iPhone and iPad owners</a>. After installing, if you don’t have it, and launching Pages, follow these steps:</p>\n\n\n\n<ol>\n<li>Create a new document by tapping the + (plus) icon in the upper-right corner of the Pages app.</li>\n\n\n\n<li>Tap <em>Start Writing</em>.</li>\n\n\n\n<li>Tap the … in a circle (More) button in the upper-right corner.</li>\n\n\n\n<li>Swipe down to find the Settings icon and tap it.</li>\n\n\n\n<li>Tap Auto-Correction and enable Auto-Format Fractions. (It may already be turned on.)</li>\n</ol>\n\n\n\n<p>Now, as you type most single-digit fractions, Pages automatically reformats them. You must type a space before and another character (like a space or dash) afterward for Pages to perform its transformation. For instance, type a space, numeral 1, a forward slash, numeral 2, and then a space, and Pages produces ½. (This also works in Numbers.)</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-type-fractions-in-ios-pages-bordered.png\" alt=\"iOS Pages fractions\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-type-fractions-in-ios-pages-bordered.png?quality=50&amp;strip=all 1183w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-type-fractions-in-ios-pages-bordered.png?resize=300%2C139&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/mac911-type-fractions-in-ios-pages-bordered.png?resize=768%2C356&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"475\" /><figcaption><p>You can type fractions as you go in Pages, and the app automatically reformats them into more compact versions drawn within the typeface.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Once you have your message or even just the fractions you need, copy and paste them into a Mail or other document.</p>\n\n\n\n<p>You can find fractions in the standard Unicode format by searching for them on the web, too, and then copy and paste them into an email message or document. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.compart.com/en/unicode/decomposition/%3Cfraction%3E&amp;xcust=1-1-2219820-1-0-0&amp;sref=https://www.macworld.com/feed\">This page at compart</a> displays all the common typographic or drawn fractions as links to individual character pages where, when you land there, you can copy the fraction as a single character.</p>\n\n\n\n<p>If you use fractions commonly, you could type out or paste the ones you rely on most into a Pages document and then copy them from there into other Pages files or other locations as you need them.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Bill.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\niOS, iPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1c5439cd88c105cc8b64ef027a8ba5a1e6f678a4ac926189fd3c97b02e62824a","category":"Apple"}