{"title":"The Effectiveness of Applying Artificial Intelligence in Pediatric Clinical Education","link":"https://www.preprints.org/manuscript/202408.1338/v2","date":1724807756000,"content":"AI-driven tools can identify nursing students' strengths and weaknesses, thus enabling the development of customized learning plans that target specific areas for improvement. This targeted approach can enhance knowledge retention and skill development, resulting in better prepared healthcare professionals. Nursing students are required to overcome their own psychological stress during their internship in order to understand sick children’s emotional reactions, as well as to be able to interact and communicate with such children. The application of AI picture-based teaching e-books helps nursing students to understand how to use therapeutic games to improve communication with sick children. A comparison of the differences between nursing teachers’ self-efficacy scores and nursing students’ application of AI picture-based teaching e-books (experimental group) and narrative handouts (control group) was achieved via therapeutic games to deal with sick children’s fear of medical examinations and treatments. In addition, a comparison was also conducted on the differences between the impact of the self-efficacy of the experimental group and that of the control group in dealing with sick children’s behavioral responses with respect to fears of medical examinations and treatments. This study is a quasi-experimental study, in which the self-efficacy scores of 30 nursing students were collected and analyzed in both the experimental group and the control group before and after intervention in dealing with sick children’s behavioral responses to fears of medical examinations and treatments. It was found that the self-efficacy score of the experimental group was higher than that of the control group (β coefficient is 0.356) when assessing the self-efficacy scores and behavior of the experimental and control groups in dealing with sick children’s fears of medical examinations and treatments through one-way analysis of covariance (one-way ANCOVA), moreover, a statistically significant difference (p &lt; 0.05) was observed. The experimental group’s score of behavioral responses to the fears of sick children to examinations and treatments was lower than that of the control group (β coefficient was -1.540), wherein a statistically significant difference (p &lt; 0.05) was shown. The self-efficacy of the experimental group in dealing with sick children’s fears of medical examinations and treatments had a statistically significant impact on the sick children’s behavioral responses to the fear of medical examinations and treatments (p &lt; 0.05). In addition, the higher the self-efficacy scores of the experimental group in dealing with sick children’s fear of medical examinations and treatments, the lower the sick children’s behavioral responses to fears of medical examinations and treatments (the β coefficient was -0.914), the control group’s self-efficacy scores in dealing with sick children’s fears of medical examinations and treatments did not have a statistically significant impact on the sick children’s behavioral responses to fears of medical examinations and treatments (p &gt; 0.05). This study proves that the application of AI picture-based teaching e-books by nursing teachers is more effective than narrative handouts in improving nursing students’ self-efficacy when using therapeutic games to deal with, as well as reduce, sick children’s fears of medical examinations and treatments.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1c6230a7a94428a1927edac5768d62e248b8754c08dacea3d6c1c0075b41da53","category":"Interdisciplinary"}