{"title":"The accuracy of point-of-care C-Reactive Protein as a screening test for tuberculosis in children","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003725","date":1729778400000,"content":"<p>by Mary Kagujje, Sarah Nyangu, Minyoi M. Maimbolwa, Brian Shuma, Nsala Sanjase, Chalilwe Chungu, Andrew D. Kerkhoff, Jacob Creswell, Monde Muyoyeta</p>\r\n\r\nSystematic screening for TB in children, especially among those at high risk of TB, can promote early diagnosis and treatment of TB. The World Health Organization (WHO) recently recommended C-Reactive Protein as a TB screening tool in adults and adolescents living with HIV (PLHIV). Thus, we aimed to assess the performance of point-of-care (POC) CRP as a screening tool for TB in children. A cross-sectional study was conducted at 2 primary health care facilities in Lusaka, Zambia between September 2020 –August 2021. Consecutive children (aged 5–14 years) presenting for TB services were enrolled irrespective of TB symptoms. All participants were screened for the presence of TB symptoms and signs, asked about TB contact history, and undertook a POC CRP test, chest X-ray, and sputum Xpert MTB/RIF Ultra test. The accuracy of CRP (≥10 mg/L cutoff) was determined using a microbiological reference standard (MRS) and a composite reference standard (CRS). Of 280 children enrolled and with complete results available, the median age was 10 years (IQR 7–12), 56 (20.0%) were HIV positive, 228 (81.4%) had a positive WHO symptom screen for TB, 62 (22.1%) had a close TB contact, and 79 (28.2%) had a positive CRP POC test. Five (1.8%) participants had confirmed TB, 71 (25.4%) had unconfirmed TB, and 204 (72.3%) had unlikely TB. When the MRS was used, the sensitivity of CRP was 80.0% (95%CI: 28.4–99.5%) and the specificity was 72.7% (95%CI: 67.1–77.9%). When the CRS was used, the sensitivity of CRP was 32.0% (95%CI: 23.3% - 42.5%), while the specificity was 74.0% (95%CI: 67.0% - 80.3%). Using the CRS, there were no statistically significant differences in sensitivity and specificity of CRP in the HIV positive and HIV negative individuals. Among children in Zambia, POC CRP had limited utility as a screening tool for TB. There remains a continued urgent need for better tools and strategies to improve TB detection in children.","author":"Mary Kagujje","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"1c63ad6ac9de5bc1833d7886f45d816d6150652ea51e68aba6e49662c1715ba9","category":"Environment"}