{"title":"A Streptomyces species from the ginseng rhizosphere exhibits biocontrol potential","link":"https://academic.oup.com/plphys/article/194/4/2709/7516263?rss=1","date":1704931200000,"content":"<span><div>Abstract</div>Plants and their associated microbes live in complicated, changeable, and unpredictable environments. They usually interact with each other in many ways through multidimensional, multiscale, and multilevel coupling manners, leading to challenges in the coexistence of randomness and determinism or continuity and discreteness. Gaining a deeper understanding of these diverse interaction mechanisms can facilitate the development of data-mining theories and methods for complex systems, coupled modeling for systems with different spatiotemporal scales and functional properties, or even a universal theory of information and information interactions. In this study, we use a “closed-loop” model to present a plant–microbe interaction system and describe the probable functions of microbial natural products. Specifically, we report a rhizosphere species, <span>Streptomyces ginsengnesis</span> G7, which produces polyketide lydicamycins and other active metabolites. Interestingly, these distinct molecules have the potential to function both as antibiotics and as herbicides for crop protection. Detailed laboratory experiments conducted in Arabidopsis (<span>Arabidopsis thaliana</span>), combined with a comprehensive bioinformatics analysis, allow us to rationalize a model for this specific plant–microbe interaction process. Our work reveals the benefits of exploring otherwise neglected resources for the identification of potential functional molecules and provides a reference to better understand the system biology of complex ecosystems.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"1c6e2dca02f217535e3b0d83ddf9e9875adc1f984ac9e89d33436e829d3d3c24","category":"Environment"}