{"title":"Google Maps Warns You About Crowded Areas With Updated 'Busyness' Feature","link":"https://www.macrumors.com/2021/11/16/google-maps-busyness-crowded-areas/","date":1637109613000,"content":"Google <a href=\"https://blog.google/products/maps/keep-it-chill-holiday-new-tools-google-maps/\">today announced</a> the launch of new iOS Google Maps features aimed at helping holiday shoppers, including Area Busyness and Directories.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/Google-maps-feaure-purple.jpg\" />\r\n<br />\r\nWith Area Busyness, Google combines the busyness trends of businesses and locations that are near each other to let you know when a neighborhood or a part of town is at its busiest. Google says that this feature can help you identify busy areas to avoid, or highlight the hot spots when you're new to an area. Google says Area Busyness will roll out \"in time for this holiday season.\"\r\n<br />\r\n\r\n<br />\r\nGoogle is adding Directories, a feature designed to make it easier for people to navigate malls, airports, and transit stations. The Directory tab will allow users to see what types of stores are in a building and find airport lounges, parking lots, and more, along with helpful information such as whether a location is open, it's rating, and what floor it's on. This kind of indoor mapping functionality is already available in many shopping malls and airports in the <a href=\"https://www.macrumors.com/guide/maps/\">Apple Maps</a> app.\r\n<br />\r\n\r\n<br />\r\nGoogle is also expanding its integrated grocery store pickup feature, which allows pickup orders from Kroger, Fred Meyer, Fry's, Ralphs, and Marianos to be added to Google Maps for tracking order status and allowing stores to know when you've arrived.\r\n<br />\r\n\r\n<br />\r\nFor restaurants, Google is adding price ranges supplied by other Google Maps users to give people a better idea of what a location charges for food, plus there's a simplified method for providing additional review details about a location you've visited.<div>Tag: <a href=\"https://www.macrumors.com/guide/google-maps/\">Google Maps</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/11/16/google-maps-busyness-crowded-areas/\">Google Maps Warns You About Crowded Areas With Updated 'Busyness' Feature</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/google-maps-warns-you-about-crowded-areas-with-updated-busyness-feature.2323689/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=QGVNJA0LvR0:nTQNI6FJp28:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=QGVNJA0LvR0:nTQNI6FJp28:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1c746e0c470e43f582bb40ecbdd5484a5b9d9d7540781be551bc90d44a86b740","category":"Apple"}