{"title":"New Roomba combo bots have swappable dust and water tanks","link":"https://arstechnica.com/?p=1963716","date":1693240112000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/i557020_5-980x980.webp\" alt /></div>\n          <p>\n            The new midrange Roomba has two bins, one wet and one dry.                           [credit:\n                              iRobot                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Roomba is bringing the combo mop and vacuum feature to its cheaper robot vacuums with the new <a href=\"https://fave.co/44rizS4\" target=\"_blank\">Roomba Combo j5+</a>  and <a href=\"https://fave.co/3qMHWzX\" target=\"_blank\">Combo i5+</a>. Roomba's last combo bot was the Roomba Combo j7+, which would automatically switch between mopping and vacuuming with a swing-arm setup. These cheaper bots can both mop and vacuum, but you'll need to manually configure them for either task.</p>\n<p>The idea here is kind of clever: the robot comes with <em>two</em> bins, one that sucks in dust and one that acts as a water tank with a mop pad on the bottom. You'll need to switch out the bin depending on which cleaning mode you want (the iRobot marketing team has come up with the phrase \"swap and mop\"). Other combo bots need to balance water tank size and dust bin size, but here, you get water and dust bins that are free to take up as much room as possible. Roombas have small bin areas to begin with, though, so that works out to a 210 mL water tank and 360 mL dust bin.</p>\n<p>The vacuum part seems to be a bog-standard Roomba, complete with a charging base that can empty the dust bin. The mop part doesn't have a water sprayer or seemingly any connection to the rest of the robot at all. There's also no fancy water change system or scrubbing feature. It's just a self-contained water tank that keeps a rag wet and drags it along the floor. It almost feels like you could retrofit the water tank onto a normal Roomba, but on this unit, of course, all the vacuum functions turn off when you're mopping.</p></div><p><a href=\"https://arstechnica.com/?p=1963716#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1963716&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1c7b0f1836ed78b0e0d8f2c2dc4f2384d562715f770c7a29de195c7b0808659b","category":"Tech"}