{"title":"Fairytale final chapter: why we're all rooting for Mark Cavendish at the Tour de France","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/fairytale-final-chapter-why-were-all-rooting-for-mark-cavendish-at-the-tour-de-france","date":1624971103000,"content":"\n      <p>Mark Cavendish is crying. On the podium, in the press conference, in television interviews. His stubbly face is red and puffy, he can’t hold back the hot tears of relief. Was he worried it was the end? Worried the negative critics, real or imagined, might be right?</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Tour de France 2021 Guide</a></strong></em></p>\n<p>It’s day five of the 2010 Tour de France in Montargis and the pressure has found its release. A few journalists were already penning his career obituary, all because he hadn’t won for several days. In reality, it was the tiniest hiccup – just the end of the beginning and the start of the glorious middle. We know how the rest of the Cavendish story goes: a world road title, a total of 30 Tour de France stages, 15 Giro ones, a green jersey, to go along with Milan-Sanremo and his prolific record. The greatest sprinter in modern cycling history, all told.</p>\n<div></div>\n<p>Mark Cavendish is box office, compelling whether he wins or loses. And especially back then, Cavendish was a bit of a pantomime villain: he had been fined for causing a Tour de Suisse crash weeks before his Tour tears, he shot his mouth off, he flicked the Vs when winning in retribution. He was the best and didn’t shy away from saying it. That doesn’t always go down well. And when you win prolifically for years, it gets boring for fans.</p>\n<p>Cavendish does not play to the galleries. He’s more the win-at-all-costs friend you ring up when you want pub quiz victory, not the boy-next-door you introduce to your mum. He’s always been here to win bike races, not popularity contests.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/polka-dot-duel-ide-schelling-s-impressive-start-to-le-tour\"><em><strong>Polka Dot Duel: Ide Schelling’s sublime Tour debut</strong></em></a></p>\n<p>Yet, he also has a permanent emotional honesty that is rare and special in sport. More often than not, he shows exactly what he feels. He will pause for seconds to genuinely consider journalists’ questions and give intelligent responses. He will occasionally cry when he wins. Or loses. Or might be dropping out of the sport.</p>\n<p>He might also give two barrels. (It’s practically a cycling journalist rite of passage to be told to “foxtrot oscar” by Cavendish). Ask a stupid question, his brow furrows and a testy response is forthcoming. He’s older and wiser, but he still cares, competes and obsesses just as much.</p>\n<p>Life and pro cycling comes at us fast. I never imagined we’d see such a transformation in his public image. My impression over the last week is that the thing that fans want to see at the 2021 Tour de France, more than anything else, is a Mark Cavendish stage victory.</p>\n<div></div>\n<p>There is the comeback angle which people love: he’s dealt with his fair share of adversity, such as Epstein-Barr syndrome, various other knocks, crashes and injuries. It seemed like he was on the brink of quitting the sport last winter. Whatever his results this summer, his unexpected appearance at the Tour de France is allowing a re-appreciation of his standing, a summer of love from supporters. You don’t know what till it’s gone, and all that.</p>\n<p>But Cavendish seems different too. The 36-year-old is experiencing this Tour differently too, anew, optimistic. Racing with the joy of a debutant and not taking anything for granted. And that’s the incorrigible cycling lover in him, something unchanged through his career. Dare I say it, we’re close to getting something I never thought we’d see: Mark the adored, cuddly Cavendish (well, until he gets asked a dumb question).</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-81903708_1024x1024.jpg?v=1624970432\" /></p>\n<p><em>Chateâuroux in 2008</em></p>\n<p>It bears stating too: Mark Cavendish has nothing left to prove. He doesn’t ever have to win another bike race again. He doesn’t have to go for the Merckx stage win record, which only statto journalists seem to care about anyway. He doesn’t have to go out with a bang because his best years, between 2007 and 2016, were one, decade-long big bang. His acceleration was breathtaking, lethal, unmatchable. He was a prolific winner on four teams (Columbia-HTC, Team Sky, Quick Step and Dimension Data), which takes some doing.</p>\n<p>But let’s entertain that ever-more distinct possibility: Cavendish the 2021 Tour stage winner? The factors are piling up in his favour. There’s confidence and momentum on his side from wins in Turkey and Belgium. In Deceuninck-Quick Step and lead-out man Michael Mørkøv, he has arguably the best drilled team.</p>\n<p>Luck has been on his side so far: firstly, through Sam Bennett’s knee injury that gained him a Tour berth, then with the withdrawal of his principal challenger, Caleb Ewan, on stage 3. Nobody would wish such events on either rider, but as they say — one man’s misfortune is another’s opportunity. In contrast to the Australian, Cavendish has emerged from the Tour’s early crashes unscathed. Do you believe in fate? If you want yet one more coincidental sign, the race is returning to several places where he’s won before.</p>\n<blockquote>\n<p>This year's Tour de France is already like a Mark Cavendish greatest hits edition - visits Fougères, Châteauroux, Nîmes and Paris, all places where he's won before. Time to see him rolling back the years this summer?</p>\n— Andy McGrath (@Andymcgra) <a href=\"https://twitter.com/Andymcgra/status/1406978207451131921?ref_src=twsrc%5Etfw\">June 21, 2021</a>\n</blockquote>\n\n<p>It would be a fairytale final chapter if the Manxman could take one more stage win. Heaven knows the Tour could do with some feelgood emotion to punctuate the dark mood.</p>\n<p>Were it to happen, I imagine there’d be the same shock and joy etched on his face as his maiden win into Chateâuroux in 2008, the victory that set the whole Cavendish era into motion. And then we’ll probably be crying along with him.</p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1c7ba73f2e74e7dc143a48a04cdbebb10cc05140c05bdbdfb83cdc973eb15439","category":"Cycling"}