{"title":"Study on Mechanical Properties and Durability of Tunnel Lining Concrete in Coastal Areas","link":"https://www.preprints.org/manuscript/202407.2095/v1","date":1722215078000,"content":"To address the problems of lining cracking and spalling of tunnel structures in coastal areas under the influence of special geologic conditions, environmental loading, and the coupling effect of chemical erosion effects, hybrid fibers were introduced to fly ash concrete in this study. The working performance, compressive strength, split tensile strength, and flexural strength of the hybrid fiber fly ash concrete were tested.The NEL chloride diffusion coefficient under steady-state conditions and the durability test for resistance to sulfate corrosion were carried out. Thus, in-depth analyses of the comprehensive performance of the hybrid fiber fly ash concrete used for tunnel lining were carried out and the damage mechanism were explored. The results showed that the hybrid fiber fly ash concrete exhibited higher strength compared to the control group concrete. However, when the fibers exceeded a certain dosage, the reduction in the working properties of the concrete structure led to the creation of larger pores in the matrix structure, which in turn affected the mechanical properties of the concrete. The most significant reduction in NEL chloride diffusion coefficient was observed when both steel fibers and coconut fibers were added at 1.0 % volumetric parameter, compared to the control group. The apparent state and compressive strength after sulfate corrosion were also minimally affected. This study ensured that the mechanical properties of the concrete were improved and also substantially improved the corrosion resistance of the matrix, providing a scientific basis for the performance improvement of tunnel lining concrete, confirming that steel-coconut fibers hybrid fiber fly ash concrete has a great potential to improve the structural load bearing capacity and durability, and may provide theoretical support for the continued use of tunneling projects and construction processes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1c7c41da4029fdce4e7d993767b9a550595282659b4befb3beba715c2c3dffff","category":"Interdisciplinary"}