{"title":"Best Zwift setup for every rider – from budget smart trainers to the ultimate indoor bikes","link":"https://www.bikeradar.com/advice/fitness-and-training/best-zwift-setups-for-every-rider/","date":1636650000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Best-Zwift-setup-on-TV-55aa0a2.jpg?quality=45&amp;resize=620,413\" />                                            <p>With Zwift taking the indoor cycling world by storm at the moment, giving riders the chance to immerse themselves in a virtual universe and train more efficiently than ever, are you thinking about taking the plunge and investing in a dedicated Zwift setup?</p>\n<p>It can be hard to know exactly what you need or how much money you should spend to get your ideal Zwift setup. So, with that in mind, we’ve examined all of the options and put together a guide to the best Zwift setups for every rider and every budget.</p>\n<p>We’ve covered it all; from the cheapest Zwift turbo trainer to the ultimate high-end indoor training <a href=\"https://www.bikeradar.com/advice/fitness-and-training/tips-for-building-the-ideal-indoor-training-space/\">pain cave</a>.</p>\n<p>Otherwise, check out our complete guide to <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a> for more on the virtual cycling platform, as well as our round-up of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">best smart trainers</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">best indoor cycling apps</a>.</p>\n<h2>Why should you use Zwift?</h2>\n<p> </p>\n<div>\n    <img /></div><div><figcaption><span><i></i> There’s a Zwift setup for practically every budget – painting your living room is optional, though.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>Zwift is a great way to race and train, enabling you to reap the <a href=\"https://www.bikeradar.com/advice/fitness-and-training/indoor-cycling-benefits/\">benefits of indoor training</a> while having fun – or stoking the competitive fire – along the way. It can be used throughout the year, at any time of the day or night.</p>\n<p>It’s an online cycling game with different worlds to ride around, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-group-rides/\">virtual group rides</a> to join, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-workouts-training-plans-zwift/\">Zwift workouts and training plans</a> to complete, and <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-take-ftp-test-zwift/\">FTP and ramp tests</a> to benchmark your fitness. There are even <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-racing/\">Zwift races</a> to be won and lost.</p>\n<p>Zwift is great not just because it takes the boredom out of <a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">indoor cycling</a>, but because it’s so feature-rich that it can be considered an ideal complement to riding outside, rather than an alternative.</p>\n<h2>How to sign up to Zwift</h2>\n<p>You can sign up to Zwift on a Mac or PC via <a href=\"https://zwift.com/create_account\" target=\"_blank\">zwift.com/create_account</a>, or on a compatible tablet or mobile device via the Zwift app, which is available through the Apple App Store or Google Play.</p>\n<p>You can also purchase a digital membership gift card on <a href=\"https://zwift.com/gift\" target=\"_blank\">Zwift.com</a>.</p>\n<p>Once you’ve created an account, you’ll get a seven-day free trial if you signed up online, or 25km of free riding if you joined via the Apple App Store.</p>\n<p>Once that’s finished, you’ll need to sign up for a subscription, which costs £12.99 / $14.99 per month.</p>\n<div>\n    <h5>Zwift subscription deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Cheap Zwift setup</h2>\n<section><div>\n        <p>If you’re on a tight Zwift budget, you’ll need the following equipment to put together the cheapest setup:</p>\n<ul><li>A bike</li>\n<li>A budget indoor trainer</li>\n<li>A compatible computer, smartphone or tablet with Bluetooth or ANT+ (or an ANT+ USB dongle)</li>\n</ul><p>\n\n    </p></div>\n    </section><h3><span>Budget smart trainer</span></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> If you’re on a budget, the Tacx Flow Smart is our pick of affordable wheel-on smart trainers.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p><span>A budget wheel-on smart trainer is the ideal introduction to the immersive experience Zwift offers.</span></p>\n<p><span>We’d recommend a cheap wheel-on smart trainer over a regular, dumb (i.e. non-smart) turbo trainer, as it allows you to reap the benefits of Zwift’s virtual worlds and workouts, thanks to the variable resistance and power measurement offered by a smart trainer. You needn’t break the bank to get started.</span></p>\n<p><span>Though budget options may not on paper appear to offer comparable performance to more expensive smart trainers, our testing has shown there are good options for less than £300 / $400.</span></p>\n<p><span>Our pick of the bunch would be the </span><a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/tacx-flow-smart-review/\"><span>Tacx Flow Smart</span></a><span>. At a penny under £270 / $349 at RRP, it offers a solid spec for beginners, is easy to set up and use, and delivers great performance at a very competitive price.</span></p>\n<div>\n    <h5>Latest deals on the Tacx Flow Smart</h5>\n    <div></div>\n    <div></div></div>\n\n<div>\n    <img /></div><div><figcaption><span><i></i> The Elite Novo Smart is another good budget-priced option.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p><span>Alternatively, an even cheaper option is the </span><a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/elite-novo-smart-review/\"><span>Elite Novo Smart</span></a><span> (RRP £259 / $350). </span></p>\n<p><span>While its construction quality doesn’t quite stand up to that of the Tacx Flow Smart and it has a lower maximum power output, it nevertheless takes full advantage of all of Zwift’s immersive features and offers impressive data accuracy.</span></p>\n<p><span>It’s worth noting while both of these trainers can technically only simulate gradients up to 6 per cent, Zwift’s default trainer difficulty is set at 50 per cent, meaning you won’t actually max out the trainer’s resistance until you hit a 12 per cent gradient in the game.</span></p>\n<div>\n    <h5>Latest deals on the Elite Novo Smart</h5>\n    <div></div>\n    <div></div></div>\n\n<h3><span>Cheapest Zwift trainer and speed/cadence sensor</span></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> A basic Zwift setup can be cobbled together from a few bits of kit that many cyclists will already own.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p><span>If you’re on a very tight budget, any standard, non-smart turbo trainer can be used with Zwift, as long as you have a few accessories. The cheapest Zwift trainer, therefore, might just be the one you already have.</span></p>\n<p><span>If you currently own an ANT+ or Bluetooth-compatible measurement tool, such as a modern </span><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\"><span>power meter</span></a><span>, Zwift can use the data from that device to power your on-screen avatar.</span></p>\n<p><span>Of course, this means missing out on things such as simulated gradient changes, drafting and </span><a href=\"https://www.bikeradar.com/advice/fitness-and-training/erg-mode/\"><span>ERG mode</span></a><span>, but it’s a workable option in a pinch.</span></p>\n<p><span>It is worth noting that if you’re using an iOS device, then connecting via Bluetooth is your only option at this point.</span></p>\n<p><span>Those without a power measurement tool will need a speed/cadence measurement device instead.</span></p>\n<p><span>Something like </span><a href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=489797&amp;clickref=bikeradar-0&amp;p=https%3A%2F%2Fwww.wiggle.co.uk%2Fwahoo-rpm-speed-and-cadence-cycle-sensors%2F%3Flang%3Den&amp;curr=GBP&amp;dest=1&amp;sku=5360756609&amp;kpid=5360756609&amp;utm_source=google&amp;utm_term=&amp;utm_campaign=Shopping+-+All+Products&amp;utm_medium=base&amp;utm_content=mckv%7Csm0uVu6Ek_dc%7Cmcrid%7C295293415336%7Cmkw%7C%7Cmmt%7C%7Cmrd%7C5360756609uk%7Cmslid%7C%7C&amp;mkwid=sm0uVu6Ek_dc&amp;pcrid=295293415336&amp;prd=5360756609uk&amp;pgrid=58853027266&amp;ptaid=pla-522564259111&amp;gclid=CjwKCAiAws7uBRAkEiwAMlbZjsDD9fU2AiRJHjiFd_tmIXBoRkwit1ro0jxhUsSUyGQ2YCfjiG_miRoC2GIQAvD_BwE&amp;id=489797\" target=\"_blank\"><span>Wahoo’s RPM Speed and Cadence Cycle Sensors</span></a><span> are what you’re looking for, but any Bluetooth or ANT+ speed sensor should work.</span></p>\n<p><span>If you are just using a speed/cadence sensor and a non-smart trainer or </span><a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-on-rollers/\"><span>rollers</span></a><span>, then Zwift has two methods of calculating virtual watts.</span></p>\n<p><span>The first way is for Zwift to use the known power curve of your turbo trainer. If you own a trainer that Zwift has tested (the full list of compatible trainers can be found on </span><a href=\"https://zwift.com/hardware\"><span>Zwift’s website</span></a><span>) this can be a fairly accurate way of measuring power, but your in-game wattage will be capped at 1,200.</span></p>\n<p><span>If you have an unsupported trainer, Zwift will try to make a rough calculation based on your wheel speed, but realistically this is a last-ditch option, so don’t expect the numbers to be particularly accurate. Your in-game wattage will also be capped at 400 watts, so this isn’t a long-term solution for many.</span></p>\n<div>\n    <h5>Latest deals on speed and cadence sensors</h5>\n    <div></div>\n    <div></div></div>\n\n<h3><span>Essential accessories</span></h3>\n<p><span>In terms of accessories, you’ll also need some kind of stand for your phone, tablet or computer – but you can just as easily make do with a few boxes stacked on top of a chair or stool, if that’s all you have available.</span></p>\n<p>Finally, you’re going to need some sort of fan. A cheap but powerful option such as the aptly-named <a href=\"https://www.amazon.co.uk/Honeywell-HT900E1-HT900E-Turbo-Fan/dp/B001VEJFT6/?tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">Honeywell Turbo Fan from Amazon</a> will work fine, if you can get it in the right position.</p>\n<div>\n    <h5>Latest deals on the Honeywell Turbo Fan</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Mid-range Zwift setup</h2>\n<section><div>\n        <p>The mid-range is dominated by more expensive wheel-on smart trainers, plus a few accessories that help improve the quality of the experience. You’ll also start to see budget direct-drive smart trainers.</p>\n<ul><li>Mid-range wheel-on or budget smart trainer</li>\n<li>Turbo trainer table or tablet/phone stand</li>\n<li>Trainer-specific tyre</li>\n<li>Front-wheel riser block</li>\n</ul><p>\n\n    </p></div>\n    </section><h3>Mid-range wheel-on smart trainer</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Saris M2 wheel-on smart trainer is a top performer at a good price, allowing a much more immersive experience without costing the earth.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>With a wheel-on smart trainer, you’ll be able to access all of the features Zwift has to offer, such as simulated courses and gradients, power-based workouts and training plans with variable resistance, group rides, races, etc. They’re a great way for riders on a budget to get into interactive training.</p>\n<p>Our current favourite mid-range wheel-on smart trainer is the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/saris-m2-review/\">Saris M2</a> (RRP £499 and $549.99). We were impressed not only with the price, but also with its performance compared to direct-drive trainers.</p>\n<p>It has a claimed power accuracy of +/- 5 per cent, but in practice our tester found it generally kept within 3 per cent of his <a href=\"https://www.bikeradar.com/reviews/training/power-meters/garmin-vector-3-power-meter-review/\">Garmin Vector 3</a> power meter pedals.</p>\n<div>\n    <h5>Latest deals on the Saris M2</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Budget direct-drive smart trainer</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Elite Zumo is our pick of entry-level direct-drive smart trainers.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>There’s also a growing number of competitive-priced, direct-drive trainers. With a direct-drive trainer, you remove the rear wheel and connect your bike to the trainer via a standard cassette.</p>\n<p>The advantage of this is that there’s no wear on your rear tyre, and the best ones are able to offer better power accuracy, as well as a quieter and more realistic ride feel than a wheel-on trainer – usually thanks to them having a larger flywheel.</p>\n<p>They’re also generally able to simulate steep gradients and offer better support for higher-wattage outputs because there’s no risk of the tyre slipping on the trainer during sprint efforts.</p>\n<p>For £449 / $699, the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/elite-zumo-review/\">Elite Zumo</a> offers a lot of bang for your buck. It’s one of the cheapest direct-drive smart trainers available, but offers good ride feel and is very quiet.</p>\n<p>However, its power values read a little on the low side compared to on-bike power meters, so it’s perhaps not the best option for aspiring esports world champions, but otherwise it’s an impressive unit.</p>\n<p>The <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/thinkrider-x5-neo-smart-review/\">ThinkRider X5 Neo Smart</a> is another direct-drive smart trainer in the same pricing ballpark. It has a couple of quirks, but otherwise offers good power accuracy and an impressive specification for the price.</p>\n<div>\n    <h5>Latest deals on the Elite Zumo</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Fine-tuning your setup</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> A few choice accessories will fine-tune your Zwift setup.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>A <a href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=489797&amp;clickref=bikeradar-0&amp;p=https%3A%2F%2Fwww.wiggle.co.uk%2Flifeline-trainer-table%2F%3Flang%3Den&amp;curr=GBP&amp;dest=1&amp;sku=100628970&amp;kpid=100628970&amp;utm_source=google&amp;utm_term=&amp;utm_campaign=Shopping+-+All+Products&amp;utm_medium=base&amp;utm_content=mckv%7CsRM5SQmPG_dc%7Cmcrid%7C295298416289%7Cmkw%7C%7Cmmt%7C%7Cmrd%7C100628970uk%7Cmslid%7C%7C&amp;mkwid=sRM5SQmPG_dc&amp;pcrid=295298416289&amp;prd=100628970uk&amp;pgrid=54774251010&amp;ptaid=pla-521123913340&amp;gclid=Cj0KCQiA5dPuBRCrARIsAJL7oejBgKAfY2eWrwOeLiJLT3EkgKOiv80v_lKGYtsCbhxS4DWz7Absm7caAhDLEALw_wcB&amp;id=489797\" target=\"_blank\">dedicated trainer table with extendable legs</a> will help you easily get your laptop or tablet at eye level, as well as provide a convenient place to put your phone and spare water bottle.</p>\n<p>You’ll want to get a riser block for your front wheel too, if the trainer you purchase doesn’t come with one. This levels out the bike and holds the front wheel in place for better stability.</p>\n<p>You might also consider a <a href=\"https://www.awin1.com/cread.php?awinmid=1857&amp;awinaffid=489797&amp;clickref=bikeradar-0&amp;p=https%3A%2F%2Fwww.wiggle.co.uk%2Ftacx-trainer-tyre-for-road-bikes%2F%3Flang%3Den%26curr%3DGBP%26dest%3D1%26sku%3D5360396975%26kpid%3D5360396975%26utm_source%3Dgoogle%26utm_term%3D%26utm_campaign%3DShopping%2B-%2BAll%2BProducts%26utm_medium%3Dbase%26utm_content%3Dmckv%7CspPzfYyXm_dc%7Cmcrid%7C295270531587%7Cmkw%7C%7Cmmt%7C%7Cmrd%7C5360396975uk%7Cmslid%7C%7C%26mkwid%3DspPzfYyXm_dc%26pcrid%3D295270531587%26prd%3D5360396975uk%26pgrid%3D60973737802%26ptaid%3Dpla-978614769112%26gclid%3DCj0KCQiA5dPuBRCrARIsAJL7oeiIFjMnIaei6rS7dqo4-VjZaJtEy2lZ7w11vJTiuvBqjmZVAxg6G1oaAofyEALw_wcB&amp;id=489797\" target=\"_blank\">trainer-specific tyre</a> for use with a wheel-on trainer, but you’ll ideally need a spare wheel to put this on because swapping tyres every time you want to use the trainer isn’t practical. If you’re buying a direct-drive trainer, you may also need to buy a cassette (some trainers include a cassette, but many don’t).</p>\n<p>Finally, if you’ve got a little bit more money to spend, it’s worth investing in a slightly more powerful fan than recommended in our budget setup, to help keep you cool and comfortable, such as this <a href=\"https://www.vornado.com/shop/circulators-fans/460-small-air-circulator\" target=\"_blank\">Vornado 460 Small Air Circulator</a> – but anything similar will do.</p>\n<div>\n    <h5>Latest deals on riser blocks</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Best high-end Zwift setup</h2>\n<section><div>\n        <p>Here, the market is dominated by high-spec direct-drive smart trainers:</p>\n<ul><li>Direct-drive smart trainer</li>\n<li>Apple TV or powerful tablet/laptop with HDMI connection</li>\n<li>Indoor training-specific fan</li>\n</ul><p>\n\n    </p></div>\n    </section><h3>High-end direct-drive smart trainer</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> If you’ve got a bit more to spend, the Tacx Flux S is an excellent high-end direct-drive smart trainer that won’t break the bank.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>There’s a range of price points to choose from, but the best ones generally cost over £500 / $700. As you spend more, the resistance ceiling, gradient simulation, power accuracy and ride feel of a direct-drive trainer will usually improve.</p>\n<p>At an RRP of £549 / $749.99 the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/tacx-flux-s-smart-trainer-review/\">Tacx Flux S</a> is an excellent-value route into high-end direct-drive trainers.</p>\n<p>Its specs might not match up to its more expensive competitors on paper, with power limited to 1,500 watts and gradient simulation to 10 per cent, but in reality it’s a great smart trainer that offers more than enough power and resistance for the vast majority of riders.</p>\n<div>\n    <h5>Latest deals on the Tacx Flux S</h5>\n    <div></div>\n    <div></div></div>\n\n<div>\n    <img /></div><div><figcaption><span><i></i> The Kickr Core is Wahoo’s most affordable direct-drive smart trainer.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>For only £100 more, the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/elite-suito-review/\">Elite Suito</a> (RRP £650 / $799) is another good option. It’s ever so slightly louder than some of the best direct-drive trainers we’ve tested, but its performance, ease of use and stability make it a great option.</p>\n<p>The <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/wahoo-kickr-core-review/\">Wahoo Kickr Core</a> (RRP £699.99 / $899.99) offers a spec with few compromises, excellent ride feel and is also very quiet. It’s another fantastic option.</p>\n<div>\n    <h5>Latest deals on the Wahoo Kickr Core</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Zwift in HD</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Go widescreen for the ultimate Zwift setup.</span></figcaption><span> <i>BikeRadar / Immediate Media</i></span></div>\n<p>At this level, you may even want to consider using Zwift on a TV, so you can really enjoy the virtual worlds in all their glory.</p>\n<p>You could connect a laptop or tablet to your TV via an HDMI cable, but the easiest and possibly most cost-efficient way (if you don’t already own a suitable laptop or tablet) is to use an <a href=\"https://www.bikeradar.com/news/now-you-can-zwift-in-4k-with-the-latest-apple-tv/\">Apple TV 4k</a> because there’s a dedicated app for that platform.</p>\n<p>In terms of top-end fans, the <a href=\"https://www.bikeradar.com/news/wahoo-launches-cheaper-kickr-plus-trainer-controlled-fan/\">Wahoo Kickr Headwind</a> can simulate a headwind of up to 38mph / 48kph, with the fan speed controlled by your effort level – which can be measured in speed, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/power-vs-heart-rate/\">power or heart rate</a>.</p>\n<div>\n    <h5>Latest deals on Apple TV</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Ultimate Zwift setup</h2>\n<section><div>\n        <p>If money is truly no object, then there’s still another tier of Zwift setup you can reach:</p>\n<ul><li>Top-end direct-drive smart trainer or <a href=\"https://www.bikeradar.com/advice/buyers-guides/indoor-bikes/\">smart indoor bike</a></li>\n<li>Accessories that create a more immersive experience</li>\n<li>Projector and cinema screen</li>\n</ul><p>At this level, you really will need to have deep pockets because costs can spiral out of control very quickly. But, if you take your Zwifting seriously and you’ve got the cash to spend, why not treat yourself to the ultimate Zwift setup?</p>\n<p>\n\n    </p></div>\n    </section><h3>Flagship smart trainer</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Elite Direto XR is one of our favourite top-end smart trainers.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>One of the most fully-featured direct-drive smart trainers is the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/tacx-neo-2t-smart-review/\">Tacx Neo 2T Smart</a>.</p>\n<p>At an RRP of £1,200 / $1,399.99, it’s certainly not cheap, but it has excellent ride feel thanks to its virtual flywheel and a claimed power accuracy of +/- 1 per cent. It can even simulate descents and different surfaces (such as cobbles and gravel).</p>\n<div>\n    <h5>Latest deals on the Tacx Neo 2T</h5>\n    <div></div>\n    <div></div></div>\n\n<p>The <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/elite-direto-xr-smart-trainer-review/\">Elite Direto XR</a> (£824.99 / $949.99) is another fully-featured, high-end smart trainer that works perfectly with accessories such as Elite’s <a href=\"https://www.bikeradar.com/news/elite-sterzo-smart/\">Sterzo Smart steering block</a>.</p>\n<div>\n    <h5>Latest deals on the Elite Direto XR</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Indoor bikes for Zwift</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Want the ultimate indoor training setup? A smart bike might be the answer.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>If you’re able (and willing) to spend even more, there’s a recent trend towards dedicated smart indoor bikes.</p>\n<p>Our pick of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/indoor-bikes/\">best smart bikes</a> is the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wattbike-atom-next-generation-review/\">Wattbike Atom</a>. There’s also the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wahoo-kickr-bike-review/\">Wahoo Kickr Bike</a>, <a href=\"https://www.bikeradar.com/news/stages-bike/\">StagesBike</a> and <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/tacx-neo-bike-smart-review/\">Tacx Neo Bike Smart</a>.</p>\n<p>These are definitely halo products and will likely be out of reach for most people, but they have some key specs that differentiate them from even the best smart trainers, if your budget stretches this far.</p>\n<p>Bike fit and <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/what-is-the-best-crank-length-for-cycling/\">crank length</a> are usually highly adjustable, for example, and many models allow you to customise shifting and even chainring or cassette profiles.</p>\n<p>They often claim better ride feel and power accuracy, have support for higher maximum power outputs, and can also offer even greater degrees of gradient and descent simulations.</p>\n<p>An obvious drawback to these indoor bikes is that they can’t be folded away for easy storage, so you really need a dedicated space to train.</p>\n<h3>Cinematic experience</h3>\n<p>In terms of other equipment, everything else from the top-end tier applies here, unless you find that a TV is just too small for your ultimate training space and want to consider a <a href=\"https://www.amazon.co.uk/Sony-VPL-HW65-High-Cinema-Projector/dp/B01587WZTS/ref=sr_1_1?qid=1574266927&amp;refinements=p_n_feature_keywords_browse-bin%3A3598109031%2Cp_72%3A419153031&amp;rnid=419152031&amp;s=home-theater&amp;sr=1-1&amp;tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">projector</a> and <a href=\"https://www.amazon.co.uk/Grandview-Cyber-120-Electric-Motorised/dp/B00BD1WKRQ/ref=sr_1_6?qid=1574266927&amp;refinements=p_n_feature_keywords_browse-bin%3A3598109031%2Cp_72%3A419153031&amp;rnid=419152031&amp;s=home-theater&amp;sr=1-6&amp;tag=bikrad-21&amp;ascsubtag=bikeradar-0\" target=\"_blank\">cinema screen</a> to create the truly ultimate experience.</p>\n<p>If you use the excellent <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wahoo-kickr-smart-trainer-2020-review/\">Wahoo Kickr</a> smart trainer (£999.99 / $1,199.99), you can also make use of the <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wahoo-kickr-climb-first-ride-review/\">Wahoo Kickr Climb</a>, which attaches to the bike’s front dropouts and simulates climbs of up to 20 per cent and descents of -10 per cent, for a more immersive experience.</p>\n<div>\n    <h5>Latest deals on the Wahoo Kickr</h5>\n    <div></div>\n    <div></div></div>\n\n<div>\n    <img /></div><div><figcaption><span><i></i> The Wahoo Kickr Climb is designed to replicate climbs of up to 20 per cent and descents of -10 per cent.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>You might even decide you want some indoor-specific cycling kit as well, from the likes of <a href=\"https://www.bikeradar.com/features/first-look-friday/nopinz-subzero-indoor-cycling-kit/\">NoPinz</a>, <a href=\"https://www.bikeradar.com/features/first-look-friday/five-ten-trail-cross-mid-pro/\">Le Col</a>, <a href=\"https://www.bikeradar.com/news/rapha-indoor-cycling-kit/\">Rapha</a> and <a href=\"https://www.bikeradar.com/features/08-11-19/\">Madison</a>. Sure, your normal cycling kit will do the job, but when we’re talking about the ultimate Zwift setup, no stone should be left unturned.</p>\n<p>The benefits over a top-end setup will probably only be marginal, but marginal gains are gains nevertheless. So, if you’re looking to squeeze out every last watt from your sessions, spending this kind of money could be worth it.</p>\n<div>\n    <h5>Latest deals on the Wahoo Kickr Climb</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Best MTB setup for Zwift</h2>\n<section><div>\n        <p>Zwift isn’t just for roadies, so if you’re a mountain biker there’s no reason you can’t join in the fun as well. You might call it <a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-mountain-biking/\">the mountain biker’s dirty secret</a>.</p>\n<p>This is the best mountain bike setup for Zwift:</p>\n<ul><li>Direct-drive smart trainer</li>\n<li>Compatible freehub or cassette</li>\n<li>Steering platform</li>\n</ul><p>\n\n    </p></div>\n    </section><div>\n    <img /></div><div><figcaption><span><i></i> Multi-discipline riders such as Mathieu van der Poel use Zwift on all kinds of bikes.</span></figcaption><span> <i>Zwift</i></span></div>\n<h3>Direct-drive smart trainer</h3>\n<p>The mechanics of using a mountain bike on Zwift are essentially the same as a road bike.</p>\n<p>If you have a wheel-on trainer, you’ll need to check the trainer is compatible with the size of tyre you’re using. There are also turbo trainer tyres available for <a href=\"https://www.bikeradar.com/features/best-mountain-bike-wheels/\">mountain bike wheels</a>, if you want the quietest, most stable ride possible with these types of trainers.</p>\n<p>As with road bikes, direct-drive smart trainers are generally better though, if your budget can stretch.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Zwift isn’t just for roadies, there’s plenty going on for mountain bikers too.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>If your bike has a 12-speed drivetrain, then you may need to swap the stock cassette or freehub on the trainer to make it compatible with your bike.</p>\n<p>Most direct-drive smart trainers, such as the Wahoo Kickr or Elite Direto XR, have compatible freehub bodies available to purchase separately, though.</p>\n<p>A cheaper and simpler alternative to a freehub swap is to use a <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-mountain/sram-nx-eagle-first-ride-review/\">SRAM PG-1230 NX Eagle</a> 12-speed cassette on the trainer. This will fit on Shimano/SRAM 11-speed freehubs that come fitted as stock on practically every direct-drive smart trainer.</p>\n<p>Elite’s Sterzo Smart steering platform is also perfect for getting the most out of the singletrack courses and other mountain bike events on Zwift.</p>\n<p>Beyond that, everything else that applies for road bikes also applies here; you’ll need a decent fan and a device to play Zwift on, and somewhere to put it, such as a turbo-trainer table.</p>\n<div>\n    <h5>Latest deals on SRAM NX Eagle cassettes</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Turbo trainer accessories for Zwift</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A water bottle is an essential turbo trainer accessory.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>No run-through of the best Zwift setups would be complete without briefly touching on <a href=\"https://www.bikeradar.com/advice/buyers-guides/turbo-trainer-accessories/\">turbo trainer accessories</a>.</p>\n<p>As with most things, there’s an endless array of bits and bobs you can throw money at, but there are a few things that genuinely make a difference when sweating it out on the trainer.</p>\n<p>We’ve already covered a fan as an essential, but these are our other top picks:</p>\n<ul><li>Sports towel</li>\n<li>Large water bottles</li>\n<li>Trainer mat or some form of floor protection</li>\n<li>Wireless headphones</li>\n<li>Cotton cap or sweatband</li>\n</ul><div>\n    <h5>Latest deals on water bottles</h5>\n    <div></div>\n    <div></div></div>","author":"Simon Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"1c7f230b703ac983b1e7220851ecc6cd2ed50f0c2dadb96488c85a3cf8fe61e7","category":"Cycling"}