{"title":"Rotate Your SSL/TLS Certificates Now – Amazon RDS and Amazon Aurora Expire in 2024","link":"https://aws.amazon.com/blogs/aws/rotate-your-ssl-tls-certificates-now-amazon-rds-and-amazon-aurora-expire-in-2024/","date":1697814922000,"content":"<p><img loading=\"lazy\" src=\"https://media.amazonwebservices.com/blog/2019/rds_con_notice_1.png\" width=\"324\" height=\"268\" />Don’t be surprised if you have seen the <strong>Certificate Update</strong> in the <a href=\"https://aws.amazon.com/rds\">Amazon Relational Database Service (Amazon RDS)</a> console.</p> \n<p>If you use or plan to use Secure Sockets Layer (SSL) or Transport Layer Security (TLS) with certificate verification to connect to your database instances of Amazon RDS for MySQL, MariaDB, SQL Server, Oracle, PostgreSQL, and Amazon Aurora, it means you should rotate new certificate authority (CA) certificates in both your DB instances and application before the root certificate expires.</p> \n<p>Most SSL/TLS certificates (<code>rds-ca-2019</code>) for your DB instances will expire in 2024 after the <a href=\"https://aws.amazon.com/blogs/aws/urgent-important-rotate-your-amazon-rds-aurora-and-documentdb-certificates/\">certificate update in 2020</a>. In December 2022, we released new CA certificates that are valid for 40 years (<code>rds-ca-rsa2048-g1</code>) and 100 years (<code>rds-ca-rsa4096-g1</code> and <code>rds-ca-ecc384-g1</code>). So, if you rotate your CA certificates, you don’t need to do It again for a long time.</p> \n<p>Here is a list of affected Regions and their expiration dates of <code>rds-ca-2019</code>:</p> \n<table> \n <tbody> \n  <tr> \n   <td><strong>Expiration Date</strong></td> \n   <td><strong>Regions</strong></td> \n  </tr> \n  <tr> \n   <td>May 8, 2024</td> \n   <td>Middle East (Bahrain)</td> \n  </tr> \n  <tr> \n   <td>August 22, 2024</td> \n   <td>US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Osaka), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Paris), Europe (Stockholm), and South America (São Paulo)</td> \n  </tr> \n  <tr> \n   <td>September 9, 2024</td> \n   <td>China (Beijing), China (Ningxia)</td> \n  </tr> \n  <tr> \n   <td>October 26, 2024</td> \n   <td>Africa (Cape Town)</td> \n  </tr> \n  <tr> \n   <td>October 28, 2024</td> \n   <td>Europe (Milan)</td> \n  </tr> \n  <tr> \n   <td>Not affected until 2061</td> \n   <td>Asia Pacific (Hong Kong), Asia Pacific (Hyderabad), Asia Pacific (Jakarta), Asia Pacific (Melbourne), Europe (Spain), Europe (Zurich), Israel (Tel Aviv), Middle East (UAE), AWS GovCloud (US-East), and AWS GovCloud (US-West)</td> \n  </tr> \n </tbody> \n</table> \n<p>The following steps demonstrate how to rotate your certificates to maintain connectivity from your application to your database instances.</p> \n<p><strong><u>Step 1 – Identify your impacted Amazon RDS resources</u></strong><br /> As I said, you can identify the total number of affected DB instances in the <strong>Certificate update</strong> page of the <a href=\"https://console.aws.amazon.com/rds/\">Amazon RDS console</a> and see all of your affected DB instances. Note: This page only shows the DB instances for the current Region. If you have DB instances in more than one Region, check the certificate update page in each Region to see all DB instances with old SSL/TLS certificates.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/16/2023-rotate-db-certificates.jpg\" width=\"2197\" height=\"835\" /></p> \n<p>You can also use <a href=\"https://aws.amazon.com/cli\">AWS Command Line Interface</a> (AWS CLI) to call <code>describe-db-instances</code> to find instances that use the expiring CA. The query will show a list of RDS instances in your account and <code>us-east-1</code> Region.</p> \n<pre><code>$ aws rds describe-db-instances --region us-east-1 | \n      jq -r '.DBInstances[] | \n      select ((.CACertificateIdentifier != \"rds-ca-rsa2048-g1\") and \n              (.CACertificateIdentifier != \"rds-ca-rsa4096-g1\") and \n              (.CACertificateIdentifier != \"rds-ca-ecc384-g1\")) | \n               \"DBInstanceIdentifier: \n              (.DBInstanceIdentifier), CACertificateIdentifier: \n              (.CACertificateIdentifier)\"'</code></pre> \n<p><strong><u>Step 2 – Updating your database clients and applications</u></strong><br /> Before applying the new certificate on your DB instances, you should update the trust store of any clients and applications that use SSL/TLS and the server certificate to connect.  There’s currently no easy method from your DB instances themselves to determine if your applications require certificate verification as a prerequisite to connect. The only option here is to inspect your applications’ source code or configuration files.</p> \n<p>Although the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/UsingWithRDS.SSL-certificate-rotation.html#UsingWithRDS.SSL-certificate-rotation-updating\">DB engine-specific documentation</a> outlines what to look for in most common database connectivity interfaces, we strongly recommend you work with your application developers to determine whether certificate verification is used and the correct way to update the client applications’ SSL/TLS certificates for your specific applications.</p> \n<p>To update certificates for your application, you can use the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/UsingWithRDS.SSL.html#UsingWithRDS.SSL.CertificatesAllRegions\">new certificate bundle</a> that contains certificates for both the old and new CA so you can upgrade your application safely and maintain connectivity during the transition period.</p> \n<p>For information about checking for SSL/TLS connections and updating applications for each DB engine, see the following topics:</p> \n<ul> \n <li><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/ssl-certificate-rotation-mariadb.html\">Updating applications to connect to MariaDB instances using new SSL/TLS certificates</a></li> \n <li><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/ssl-certificate-rotation-sqlserver.html\">Updating applications to connect to Microsoft SQL Server DB instances using new SSL/TLS certificates</a></li> \n <li><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/ssl-certificate-rotation-mysql.html\">Updating applications to connect to MySQL DB instances using new SSL/TLS certificates</a></li> \n <li><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/ssl-certificate-rotation-oracle.html\">Updating applications to connect to Oracle DB instances using new SSL/TLS certificates</a></li> \n <li><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/ssl-certificate-rotation-postgresql.html\">Updating applications to connect to PostgreSQL DB instances using new SSL/TLS certificates</a></li> \n <li><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/ssl-certificate-rotation-aurora-mysql.html\">Updating applications to connect to Aurora MySQL DB clusters using new SSL/TLS certificates</a>.</li> \n <li><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/ssl-certificate-rotation-aurora-postgresql.html\">Updating applications to connect to Aurora PostgreSQL DB clusters using new SSL/TLS certificates</a>.</li> \n</ul> \n<p><strong><u>Step 3 – Test CA rotation on a non-production RDS instance</u></strong><br /> If you have updated new certificates in all your trust stores, you should test with a RDS instance in non-production. Do this set up in a development environment with the same database engine and version as your production environment. This test environment should also be deployed with the same code and conﬁgurations as production.</p> \n<p>To rotate a new certificate in your test database instance, choose <strong>Modify</strong> for the DB instance that you want to modify in the <a href=\"https://console.aws.amazon.com/rds/\">Amazon RDS console</a>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/16/ssl-rotate-cert-modify.png\" width=\"918\" height=\"334\" /></p> \n<p>In the <strong>Connectivity</strong> section, choose <code>rds-ca-rsa2048-g1</code>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/16/ssl-rotate-cert-ca-rsa2048-g1.png\" width=\"752\" height=\"230\" /></p> \n<p>Choose <strong>Continue</strong> to check the summary of modifications. If you want to apply the changes immediately, choose <strong>Apply immediately</strong>.</p> \n<p>To use the AWS CLI to change the CA from <code>rds-ca-2019</code> to <code>rds-ca-rsa2048-g1</code> for a DB instance, call the <code>modify-db-instance</code> command and specify the DB instance identifier with the <code>--ca-certificate-identifier</code> option.</p> \n<pre><code>$ aws rds modify-db-instance \\\n          --db-instance-identifier &lt;mydbinstance&gt; \\\n          --ca-certificate-identifier rds-ca-rsa2048-g1 \\\n          --apply-immediately</code></pre> \n<p>This is the same way to rotate new certificates manually in the production database instances. Make sure your application reconnects without any issues using SSL/TLS after the rotation using the trust store or CA certificate bundle you referenced.</p> \n<p>When you create a new DB instance, the default CA is still <code>rds-ca-2019</code> until January 25, 2024, when it will be changed to <code>rds-ca-rsa2048-g1</code>. For setting the new CA to create a new DB instance, you can set up a CA override to ensure all new instance launches use the CA of your choice.</p> \n<pre><code>$ aws rds modify-certificates \\\n          --certificate-identifier rds-ca-rsa2048-g1 \\\n          --region &lt;region name&gt;</code></pre> \n<p>You should do this in all the Regions where you have RDS DB instances.</p> \n<p><strong><u>Step 4 – Safely update your production RDS instances</u></strong><br /> After you’ve completed testing in non production environment, you can start the rotation of your RDS databases CA certificates in your production environment. You can rotate your DB instance manually as shown in Step 3. It’s worth noting that many of the modern engines do not require a restart, but it’s still a good idea to schedule it in your maintenance window.</p> \n<p>In the Certificate update page of Step 1, choose the DB instance you want to rotate. By choosing <strong>Schedule</strong>, you can schedule the certificate rotation for your next maintenance window. By choosing <strong>Apply now</strong>, you can apply the rotation immediately.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/16/ssl-rotate-cert-update-multiple.png\" width=\"2710\" height=\"638\" /></p> \n<p>If you choose <strong>Schedule</strong>, you’re prompted to confirm the certificate rotation. This prompt also states the scheduled window for your update.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/10/16/ssl-rotate-cert-confirm-schedule.png\" width=\"605\" height=\"486\" /></p> \n<p>After your certificate is updated (either immediately or during the maintenance window), you should ensure that the database and the application continue to work as expected.</p> \n<p>Most of modern DB engines do not require restarting your database to update the certificate. If you don’t want to restart the database just for CA update, you can use the <code>--no-certificate-rotation-restart</code> flag in the <code>modify-db-instance</code> command.</p> \n<pre><code>$ aws rds modify-db-instance \\\n          --db-instance-identifier &lt;mydbinstance&gt; \\\n          --ca-certificate-identifier rds-ca-rsa2048-g1 \\\n          --no-certificate-rotation-restart</code></pre> \n<p>To check if your engine requires a restart you can check the <code>SupportsCertificateRotationWithoutRestart</code> field in the output of the <code>describe-db-engine-versions</code> command. You can use this command to see which engines support rotations without restart:</p> \n<pre><code>$ aws rds describe-db-engine-versions \\\n          --engine &lt;engine&gt; --include-all --region &lt;region&gt; | \n          jq -r '.DBEngineVersions[] | \n          \"EngineName: (.Engine), \n           EngineVersion: (.EngineVersion), \n           SupportsCertificateRotationWithoutRestart: (.SupportsCertificateRotationWithoutRestart), \n           SupportedCAs: ([.SupportedCACertificateIdentifiers | \n          join(\", \")])\"'</code></pre> \n<p>Even if you don’t use SSL/TLS for the database instances, I recommend to rotate your CA. You may need to use SSL/TLS in the future, and some database connectors like the JDBC and ODBC connectors check for a valid cert before connecting and using an expired CA can prevent you from doing that.</p> \n<p>To learn about updating your certificate by modifying your DB instance manually, automatic server certificate rotation, and finding a sample script for importing certificates into your trust store, see the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/UsingWithRDS.SSL-certificate-rotation.html\">Amazon RDS User Guide</a> or the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/UsingWithRDS.SSL-certificate-rotation.html\">Amazon Aurora User Guide</a>.</p> \n<p><strong><u>Things to Know</u></strong><br /> Here are a couple of important things to know:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/rds/proxy/\">Amazon RDS Proxy</a> and <a href=\"https://aws.amazon.com/rds/aurora/serverless/\">Amazon Aurora Serverless</a> use certificates from the <a href=\"https://aws.amazon.com/certificate-manager/\">AWS Certificate Manager (ACM)</a>. If you’re using Amazon RDS Proxy when you rotate your SSL/TLS certificate, you don’t need to update applications that use Amazon RDS Proxy connections. If you’re using Aurora Serverless, rotating your SSL/TLS certificate isn’t required.</li> \n <li>Now through <strong>January 25, 2024</strong> – new RDS DB instances will have the <code>rds-ca-2019</code> certificate by default, unless you specify a different CA via the <code>ca-certificate-identifier</code> option on the <code>create-db-instance</code> API; or you specify a default CA override for your account like mentioned in the above section. Starting <strong>January 26, 2024</strong> – any new database instances will default to using the <code>rds-ca-rsa2048-g1</code> certificate. If you wish for new instances to use a different certificate, you can specify which certificate to use with the AWS console or the AWS CLI. For more information, see the <code>create-db-instance</code> <a href=\"https://docs.aws.amazon.com/cli/latest/reference/rds/create-db-instance.html\">API documentation</a>.</li> \n <li>Except for Amazon RDS for SQL Server, most modern RDS and Aurora engines support certificate rotation without a database restart in the latest versions. Call <code>describe-db-engine-versions</code> and check for the response field <code>SupportsCertificateRotationWithoutRestart</code>. If this field is set to <code>true</code>, then your instance will not require a database restart for CA update. If set to <code>false</code>, a restart will be required. For more information, see <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/UsingWithRDS.SSL.html#UsingWithRDS.SSL.RegionCertificateAuthorities.Selection\">Setting the CA for your database</a> in the AWS documentation.</li> \n <li>Your rotated CA signs the DB server certificate, which is installed on each DB instance. The DB server certificate identifies the DB instance as a trusted server. The validity of DB server certificate depends on the DB engine and version either 1 year or 3 year. If your CA supports automatic server certificate rotation, RDS automatically handles the rotation of the DB server certificate too. For more information about DB server certificate rotation, see <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/UsingWithRDS.SSL-certificate-rotation.html#UsingWithRDS.SSL-certificate-rotation-server-cert-rotation\">Automatic server certificate rotation</a> in the AWS documentation.</li> \n <li>You can choose to use the 40-year validity certificate (<code>rds-ca-rsa2048-g1</code>) or the 100-year certificates. The expiring CA used by your RDS instance uses the RSA2048 key algorithm and SHA256 signing algorithm. The <code>rds-ca-rsa2048-g1</code> uses the exact same configuration and therefore is best suited for compatibility. The 100-year certificates (<code>rds-ca-rsa4096-g1</code> and<code>rds-ca-ecc384-g1</code>) use more secure encryption schemes than <code>rds-ca-rsa2048-g1</code>. If you want to use them, you should test well in pre-production environments to double-check that your database client and server support the necessary encryption schemes in your Region.</li> \n</ul> \n<p><strong><u>Just Do It Now!</u></strong><br /> Even if you have one year left until your certificate expires, you should start planning with your team. Updating SSL/TLS certificate may require restart your DB instance before the expiration date. We strongly recommend that you schedule your applications to be updated before the expiry date and run tests on a staging or pre-production database environment before completing these steps in a production environments. To learn more about updating SSL/TLS certificates, see <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/UsingWithRDS.SSL-certificate-rotation.html\">Amazon RDS User Guide</a> and <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/UsingWithRDS.SSL-certificate-rotation.html\">Amazon Aurora User Guide</a>.</p> \n<p>If you don’t use SSL/TLS connections, please note that database security best practices are to use SSL/TLS connectivity and to request certificate verification as part of the connection authentication process. To learn more about using SSL/TLS to encrypt a connection to your DB instance, see <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/UsingWithRDS.SSL.html\">Amazon RDS User Guide</a> and <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/UsingWithRDS.SSL.html\">Amazon Aurora User Guide</a>.</p> \n<p>If you have questions or issues, contact your usual <a href=\"https://aws.amazon.com/premiumsupport/\">AWS Support</a> by your Support plan.</p> \n<p>— <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"1c7f8626c61c58c287bc42435d58b38d15295489e3c0acd75843206ca67b18aa","category":"Tech"}