{"title":"Apple Says Spotify Wants 'Limitless Access' to App Store Tools Without Paying","link":"https://www.macrumors.com/2024/02/22/apple-spotify-limitless-access-no-fees/","date":1708641413000,"content":"Amid rumors that the European Commission <a href=\"https://www.macrumors.com/2024/02/19/apple-fined-500-million-eu-music-probe/\">will soon fine Apple</a> 500 million euros for breaking EU law over access to streaming music services, Apple today commented on its relationship with <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> competitor Spotify and the ongoing complaints that Spotify has made to the EC to attempt to get the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> rules changed.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/06/Apple-vs-Spotify-feature2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nIn a statement to <em>MacRumors</em>, Apple said that Spotify is aiming to get unlimited access to Apple's tools and services without paying anything for the value that Spotify receives from the ‌App Store‌.<blockquote>\"We're happy to support the success of all developers -- including Spotify, which is the largest music streaming app in the world. Spotify pays Apple nothing for the services that have helped them build, update, and share their app with Apple users in 160 countries spanning the globe. Fundamentally, their complaint is about trying to get limitless access to all of Apple's tools without paying anything for the value Apple provides.\"</blockquote>The European Union's investigation into the streaming music market and Apple's ‌App Store‌ policies was initially sparked by Spotify. Spotify has complained multiple times about the ‌App Store‌ rules that prevent it from allowing users to subscribe to Spotify without using in-app purchases and without paying a fee to Apple. \r<br />\n\r<br />\nSpotify began working with the European Commission in 2015, and the company filed a final complaint in Europe in 2019. That led to a Statement of Objections from the European Commission in 2021. After that, the European Commission filed a \"replacement\" Statement of Objections on two separate occasions as it narrowed the focus of its investigation, with the latest statement released in December 2023. Over the last 10 years, Spotify met with the European Commission 65 times in an attempt to convince the EU that Apple's rules negatively impact streaming music services. \r<br />\n\r<br />\nApple says that while Spotify has claimed that Apple policies were harming competition and stifling growth, the streaming music market was in reality growing, presenting a challenge to the European Commission and leading to the revisions in the Statement of Objections. The commission was not able to pursue Apple for requiring app developers to use in-app purchase nor did it find that Apple was harming consumers with anti-competitive practices, so the investigation shifted to the anti-circumvention rules that prevent apps from informing users about lower subscription prices available outside of the ‌App Store‌. \r<br />\n\r<br />\nAccording to Apple, Spotify wants to rewrite the rules for its own gain. Apple does not believe that Spotify's complaints are about competition or finding a better deal for consumers -- it says Spotify simply wants a better deal and is using the European Commission to try to get it. Spotify wants access to Apple's technology, ‌App Store‌ reach, and to monetize through the ‌App Store‌ without paying anything to Apple.\r<br />\n\r<br />\nThe European Commission has said that Apple's anti-circumvention rules are \"detrimental to users of music streaming services on Apple's mobile devices\" and could lead to confusion for consumers that results in higher prices, but it is Apple's opinion that the European Commission's view on this point is misguided and has been heavily influenced by Spotify's ongoing complaints. \r<br />\n\r<br />\nApple says that Spotify is the dominant streaming music provider in Europe and other countries, and that much of the company's success can be attributed to the ‌App Store‌. Spotify's apps are able to work seamlessly across Apple devices because of Apple's engineering efforts. Spotify has used TestFlight for almost 500 versions of its app, and it uses thousands of Apple's APIs across 60 frameworks.\r<br />\n\r<br />\nIf and when the EU fines Apple over this matter, the company will almost certainly appeal the decision, so the antitrust battle between Apple and Spotify is likely far from over. \r<br />\n\r<br />\n<b>Update:</b> In a statement, Spotify said it does not have a level playing field with Apple and trusts that the European Commission will take action to create a fair ecosystem.<blockquote>Spotify’s success has happened despite Apple's best efforts to gain an artificial advantage by favoring their own music service at every turn while placing roadblocks and imposing unfair restrictions on ours. Under their current rules Apple controls Spotify’s access to its own customers and gives Spotify one of two untenable options: We either have to deliver a poor user experience where we can’t directly communicate how to buy or subscribe to Spotify on iPhones or we have to accept a 30% cost disadvantage against our biggest competitor. This is not a level playing field. We support the European Commission and trust that they will take action soon to create a fair ecosystem for everyone involved.</blockquote>\r<br />\n<div>Tag: <a href=\"https://www.macrumors.com/guide/spotify/\">Spotify</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/22/apple-spotify-limitless-access-no-fees/\">Apple Says Spotify Wants 'Limitless Access' to App Store Tools Without Paying</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-says-spotify-wants-limitless-access-to-app-store-tools-without-paying.2420180/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1c8b2d847b7ab0641f69788976dfda7ef5353e231537daf7292c42d4c3426ac4","category":"Apple"}