{"title":"รวมโฆษณาบริษัท Tech จาก Super Bowl 58 ปี 2024 ปีนี้ธีม AI มาแรง","link":"https://www.blognone.com/node/138160","date":1707717922000,"content":"<div><div><div><p>การแข่งขัน Super Bowl ครั้งที่ 58 อเมริกันฟุตบอลของ NFL นัดชิงชนะเลิศ ได้แข่งขันจบลงแล้วโดยปีนี้ Kansas City Chiefs เป็นทีมที่คว้าชัยชนะไป</p>\n<p>การแสดงช่วงพักครึ่งเวลาหรือ Halftime Show ที่มี Apple Music เป็นผู้สนับสนุนหลักนั้น ศิลปินที่แสดงคือ Usher และมาพร้อมศิลปินรับเชิญอย่าง Alicia Keys, H.E.R., will.i.am, Lil Jon และ Ludacris</p>\n<p>อีกไฮไลท์ทุกปีของ Super Bowl คือหนังโฆษณาที่ฉายระหว่างการแข่งขัน ซึ่งปีนี้บริษัทเทคโนโลยีก็ต่างทุ่มงบซื้อโฆษณาโปรโมตสินค้าผลิตภัณฑ์กันมากมายเช่นเคย ซึ่ง AI ก็เป็นหัวข้อหลักที่หลายบริษัทนำมาเป็นจุดขาย รวบรวมมาไว้แล้ว</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1d20678ca7ba4a728f7f5d5913a30c35.jpg\" /></p>\n<h4>Booking.com</h4>\n<p>Booking.com ซื้อเวลาโฆษณาเป็นปีที่ 3 โดยได้ Tina Fey มาเล่าว่าเธอสามารถเป็นใครก็ได้ ตามสถานที่พักซึ่งเลือกจอง โดยมีเซอร์ไพรส์คือการปรากฎตัวของนักแสดงอย่าง Glenn Close, Jane Krakowski และ Jack McBrayer ที่มาร่วมแสดงในแต่ละฉากด้วย</p>\n<h4>Crowdstrike</h4>\n<p>Crowdstrike บริษัทด้านแพลตฟอร์มความปลอดภัยทางไซเบอร์ จำลองบรรยากาศคาวบอยยุคตะวันตก เทียบบทบาทของตัวละครว่าเป็นสิ่งที่ Crowdstrike ทำอยู่ในโลกปัจจุบัน</p>\n<h4>DoorDash</h4>\n<p>แพลตฟอร์มเดลิเวอรี DoorDash ประกาศแคมเปญเล่นใหญ่มาก โดยประกาศชิงรางวัลและผู้โชคดีหนึ่งเดียว จะได้สินค้าทุกอย่างที่ปรากฏในโฆษณาช่วงการแข่งขัน Super Bowl ปีนี้</p>\n<h4>Etsy</h4>\n<p>แพลตฟอร์มอีคอมเมิร์ซงานฝีมือ ซื้อเวลาฉายโฆษณาครั้งแรกใน Super Bowl เพื่อโปรโมต Gift Mode ฟีเจอร์ช่วยให้ค้นหาของขวัญได้ง่ายขึ้น</p>\n<h4>Google</h4>\n<p>กูเกิลยังคงโฆษณาสมาร์ทโฟน Pixel โดยปีนี้เป็นฟีเจอร์ที่ช่วยให้คนตาบอดสามารถ่ายภาพได้ (<a href=\"https://www.blognone.com/node/138022\">รายละเอียดเพิ่มเติมในข่าวก่อนหน้านี้</a>)</p>\n<h4>Microsoft</h4>\n<p>ไมโครซอฟท์โปรโมต Copilot ด้วยเรื่องราวว่า AI เข้ามาช่วยทำสิ่งต่าง ๆ ให้กับผู้คนได้อย่างไร (<a href=\"https://www.blognone.com/node/138099\">รายละเอียด</a>)</p>\n<h4>Snapchat</h4>\n<p>Snapchat กับโฆษณา Super Bowl ครั้งแรก เพื่อนำเสนอความแตกต่างจากแพลตฟอร์มโซเชียลอื่นที่เน้น Like แต่ที่นี่เราเน้น Love</p>\n<h4>Squarespace</h4>\n<p>แพลตฟอร์มสร้างเว็บไซต์ Squarespace มาพร้อมหนังโฆษณาที่กำกับโดย Martin Scorsese ว่าด้วยการมาเยือนของ UFO</p>\n<h4>Uber Eats</h4>\n<p>แพลตฟอร์มเดลิเวอรี Uber Eats มากับหนังโฆษณาว่าลืมอะไรก็ลืม แต่ไม่ลืมว่า Uber Eats มีทุกอย่าง ซึ่งรวมนักแสดงทั้ง Jennifer Aniston กับ David Schwimmer จากซีรีส์ Friends, USHER ที่ลืมว่าเขาต้องแสดง Halftime Show, David กับ Victoria Beckham ก็มาแจมในโฆษณานี้ด้วย</p>\n<h4>Temu</h4>\n<p>แพลตฟอร์มสินค้าแฟชั่น Temu ที่มี Pinduoduo เป็นเจ้าของ มากับหนังโฆษณา ที่ย้ำจุดขายเรื่องสินค้าราคาถูก ช้อปเพลินเหมือนเป็นเศรษฐี พร้อมเพลงย้ำชวนติดหู</p>\n<blockquote><p>Best <a href=\"https://twitter.com/hashtag/SuperBowl?src=hash&amp;ref_src=twsrc%5Etfw\">#SuperBowl</a> Ad was Temu by a mile. Same catchy song was played so many times it will get stuck in ppl’s heads (esp kids)200 IQ <a href=\"https://t.co/T3BeGUUlTS\">pic.twitter.com/T3BeGUUlTS</a></p>\n<p>— Thinnd (@Thinnd) <a href=\"https://twitter.com/Thinnd/status/1756907330313363539?ref_src=twsrc%5Etfw\">February 12, 2024</a></p></blockquote>\n<h4>Verizon</h4>\n<p>เครือข่ายโทรศัพท์มือถือ Verizon เล่นเองเจ็บเอง เล่าเรื่องว่าศิลปิน Beyoncé สามารถสร้างเหตุการณ์ จนทำให้เครือข่ายอินเทอร์เน็ตล่มได้ แต่กับ Verizon นั้นไม่ง่ายเลย</p>\n<h4>แถม</h4>\n<p>ภาพยนตร์ Despicable Me 4 ปล่อยทีเซอร์แรก ก็แวะมาประเด็น AI สร้างรูปภาพ ที่บอกว่าสร้างด้วย Minion Intelligence ซึ่งภาพมีความไม่สมบูรณ์บางอย่าง</p>\n<p>ที่มา: <a href=\"https://www.thedrum.com/news/2024/01/17/the-drum-s-super-bowl-lviii-ad-scoreboard-nerds-nyx-drumstick-tease-big-game-ad\">The Drum</a> และ <a href=\"https://www.theverge.com/24064740/super-bowl-2024-best-ads-trailers\">The Verge</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/nfl\">NFL</a></div><div><a href=\"/topics/advertising\">Advertising</a></div><div><a href=\"/topics/super-bowl\">Super Bowl</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1c8e17d447cf2bc11ceafc06c3e787eb19f9f1093ec3d6929fcb79127123c3ed","category":"Thai"}