{"title":"‘Super, super dangerous’ - Riders voice safety concerns after the finish of stage six of the Tour de France Femmes","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/super-super-dangerous-riders-voice-safety-concerns-after-the-finish-of-stage-six-of-the-tour-de-france-femmes","date":1690637499000,"content":"\n      <p><span>Every sprint finish in cycling is dangerous. The nature of the sport makes this unavoidable: there are close to one hundred riders fighting for space on the road at eye-wateringly high speeds and one mistake, one touch of wheels can cause a ripple effect in the peloton. Fast approaches to the line also mean that when crashes happen during this part of the race, the impacts are often huge. There’s no time to brake so if one rider comes down, the entire peloton can follow in a domino effect, leading mass pile-ups.</span></p>\n<p><span>This innate danger is something that is out of the control of race organisers and something that can’t be changed – these risks are part of the sport. However, there are certain considerations that can be made when it comes to course design to lower this risk as much as possible. These include barrier placements to help riders navigate through road furniture, for example, or routing the peloton through a wider section of road, rather than blocking things off to create a pinch point during the run up to the finish line. During stage six of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a>, some riders and staff argued that the race organisers had failed to create a safe finish, adding to the risks of a sprint rather than helping to mitigate them.</span></p>\n<p><span>The main issue was a tight chicane that the riders hit just after the </span><i><span>flamme rouge</span></i><span> signifying there was one kilometre to go. The peloton was forced to move left then right, all while approaching the turns at high speeds. To make matters worse, tram tracks were situated directly in the middle of the series of corners in the racing line, presenting a high risk of wheels getting caught in the gaps and riders losing control of their bikes. This also came after a series of big speed bumps and roundabouts that had come thick and fast on the approach to the finish in Blagnac.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230728TDFFAZ0045-A.S.O._Thomas_Maheux_0807f32e-7528-4a2b-a31c-1eef388dce6c_1024x1024.jpg?v=1690637252\" alt /><em><span>Image: ASO/Thomas Maheux</span></em></span></p>\n<p><span>Those who were watching on television saw it coming, and no doubt those who were in the peloton were bracing themselves for the inevitable disaster too. One rider hit the barrier on the right-hand side of the road, sprawling into the peloton and then it was the ripple effect: riders fell like dominoes and the rhythm of the sprint finish was broken, with only a few riders left at the front to contest for the win.</span></p>\n<p><span>“We saw on VeloViewer that it was pretty technical and we got the mechanics to drive the last 6km just to give us a bit more information because we knew with the tram rails it’s always a big fight in the sprint and it was unlucky there was a crash on that corner. We hoped that the tram rails would be covered over,” Pfeiffer Georgi, a key lead-out woman for Charlotte Kool on Team dsm-firmenich said after the stage.</span></p>\n<p><span>Magnus Backstedt, a sports director Canyon//SRAM agreed with the sentiment of the British rider, retrospectively wishing that his team had raised safety concerns about the finish with the UCI after they had done a recon of the course ahead of the race.</span></p>\n<p><span>“I didn’t particularly like that last chicane. Everything until then was acceptable but that one no, I didn’t like. The problem is that sometimes we get the GPX files and they are not exactly one hundred percent right so we can’t complain beforehand which leaves us in a funny position. It’s something that we have to work on together with the UCI and the organisers to ensure a safer sprint finish,” Backstedt said. He added that when they had seen the finish previously, he had assumed the riders would be sent on the left-hand side of the road instead to avoid the peloton being squeezed into a tight turn.</span></p>\n<p><span>“Maybe we should have looked at it a bit closer,” Backstedt admitted. “It is up to the UCI commissaires and organisers to look at that together and deem what is safe and what is not safe. I don’t think a chicane that tight, that close to the finish is a smart move.”</span></p>\n<p><span>Even the general classification riders with a main focus of not losing time, rather than going for the stage win themselves, spoke about the design of the last few corners being unnecessary. “The final became pretty dangerous, it was all fine until we had to cross those railway tracks with the chicane, that, to me, was a little bit unnecessary and super, super dangerous. It was never going to be possible for the peloton to get over that safely so of course there was a crash, I’m very grateful not to have come down but I was caught behind it. I do hear that some of the girls came down pretty hard so I hope that those who were affected are fine,” Ashleigh Moolman of AG Insurance-Soudal Quick Step, who currently sits second on the general classification, said to <em>Women’s Cycling Weekly</em> after the stage.</span></p>\n<p><span>With the Tour de France Femmes being the biggest in the peloton, and when considering it is organised by the experienced Amaury Sport Organisation (ASO), it is perhaps fair to expect a little better when it comes to rider safety considerations. As Backstedt mentions, however, this should be at the forefront of organisers' minds from amateur to professional level.</span></p>\n<p><span>“I don’t think it matters what level of bike racing it is, we need to look after the safety of the bike riders,” Backstedt said. “That’s on all of us, we’re all in this together, the riders, sports directors,  organisers and the UCI. We have to find a way of working together.”</span></p>\n<p><em><span>Cover i</span>mage: Getty</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1c9d01c673401d1d7fc778e2bc0a403a89a7062c5b58144b8158c72cb18bbbd3","category":"Cycling"}