{"title":"Liege-Bastogne-Liege Preview 2021","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/liege-bastogne-liege-preview-2021","date":1617905168000,"content":"\n      <p>Taking place on Sunday the 25th April, Liege-Bastogne-Liege is the race every puncher dreams of winning. The race is scattered with hilly terrain meaning the winner must be very capable when the road goes uphill.</p>\n<div></div>\n<p><span>The 2020 edition finished in controversial fashion. Julian Alaphilippe crossed the line first and celebrated, but had he won? The Frenchman had impeded Marc Hirschi and Tadej Pogacar who had launched their sprint to his left meaning he was demoted to the back of the group. It didn't matter, though, Alaphilippe had forgotten about Roglic, who sprinted through the line and just pipped Alaphilippe on the road. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\"><strong><em>Related – The 2021 Men's WorldTour Calendar</em></strong></a></p>\n<p><span>A day to forget for Alaphilppe, but Primoz Roglic had won the first monument of his career.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032574-160_1024x1024.jpg?v=1617287604\" /></span></p>\n<p><em>Alaphilippe celebrates at the 2020 edition of Liege-Bastogne-Liege as Roglic sprints past (Image credit: CorVos/SWpix)</em></p>\n<h4><b>Route</b></h4>\n<p><span></span><span>Over 260km in length, Liege-Bastogne-Liege is a brutally long day in the saddle with the winner often finishing in around 6 and a half hours.</span></p>\n<p><span>No single climb is longer than 5km, yet over 4200 vertical metres will have been climbed by the finish. The first 150km, although featuring hilly terrain throughout, will most likely be used to form the day’s breakaway as teams look to gain an early tactical advantage, or just some TV time.</span></p>\n<p><span>The Côte de la Mont-le-Soie appears with 100km still to go, but this will be one of the hardest 100km on the calendar. Favourites could use any of the following climbs to launch an attack or send a teammate up the road, though it is more likely the pace will remain high and the leading contenders will sit in with such a distance back to Liege.</span></p>\n<p><span></span><span>The <span>Côte</span> de Stockeu (1km @ 12.8%) is short but nasty. The Col du Rosier (4.5km @ 5.7%) is the longest single climb in the race. Crossed with 60km to go, we could well see a major selection made at this point. The <span>Côte</span><span> </span>de la Redoute (2.3km @ 7.5%) is synonymous with LBL, and with 35km remaining is a great opportunity for those feeling good to press on.</span></p>\n<p><span>If we don’t have a solo rider ahead by the time we reach the <span>Côte</span><span> </span>de la Roche-aux-Faucons, we will undoubtedly see last-ditch attacks. We then have a 9km descent into Liege, where it will either be a sprint or we’ll witness a solo rider celebrate across the line.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/profile_1024x1024.png?v=1617287841\" /><em><span>Liege-Bastogne-Liege 2021 profile (Image credit: La Flamme Rouge)</span></em></span></p>\n<p><span>The weather may also have an impact. If we see windy and wet conditions, it’s </span><span>more likely that we’ll see a solo winner as Jakob Fuglsang demonstrated in 2019.</span></p>\n<h4><b>Contenders</b></h4>\n<p><span>Primoz Roglic will be back to defend his crown. This time, he’ll be riding LBL before his bid for the yellow jersey. It was Roglic’s debut at La Doyenne last year so he enters this season with a 100% record at the race. He is one of the strongest punchers in the world and also has a good sprint finish. We can’t be certain whether he’d have beaten Hirschi and Pogacar last year had they not been impeded, but Roglic isn’t a man you’d want to challenge in a sprint, particularly at the end of a tough race.</span></p>\n<p><span>Roglic’s countryman Tadej Pogacar will be back this season. The Slovenian finished third last time out after Alaphilippe’s demotion. Somehow, Pog has done what seemed unthinkable and improved further. After winning the Tour de France last year, Pogacar has won the UAE Tour and Tirreno-Adriatico this season. He’ll go up against Roglic for the first time in 2021 at the Itzulia Basque Country Tour.</span></p>\n<p><span>Pogacar won’t be alone, though. Last year’s runner-up Marc Hirschi made the shock move to join UAE Team Emirates this season. Hirschi went from being relatively unknown to one of the stand-out riders across last season, a breakout performance. His 2021 campaign hasn’t been without issues thus far, though, as his season start was setback by injury. However, if he has gained form by the time The Old Lady comes around he’ll be one of the favourites. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032574-145_1024x1024.jpg?v=1617287914\" /><em>Liege-Bastogne-Liege 2020 podium (</em></span><em><span>Image credit: CorVos/SWpix)</span></em></p>\n<p><span>We have somehow made it this far into the contenders section without mentioning the best puncher in the world and current World Champion. Julian Alaphiliippe is one of the stars of the sport, but his showing at LBL last year tinged an otherwise great season for the Frenchman. On paper, the parcours at Liege-Bastogne-Liege suits Alaphilippe down to a tee. He broke out at the age of 23 when he finished 2nd in 2015 behind four-time winner Alejandro Valverde. Liege still eludes him, despite thinking he had won last year, even if only for a few seconds. Alaphilippe will win here sooner or later, but will 2021 be his year?</span></p>\n<p><span><span>Israel-Start Up invigorated their Ardennes team when they signed Mike Woods to partner Dan Martin. The Irishman is a former winner here winning in 2013, though he hasn't been in the top-10 in the previous three seasons. On the contrary, Woods has been in the top-10 every year since 2017, but is yet to win a monument. Both have the ability over the hills but will need a great day to beat any of the aformentioned contenders.</span></span></p>\n<p><span>Astana-Premier Tech enter with 2019 winner Jakob Fuglsang as their leader. Now 36 years of age, Fuglsang skipped the Tour of Flanders to focus on the Ardennes Classics so should be in great form.</span></p>\n<p><span>Alejandro Valverde's tally of four wins at LBL is only surpassed by Eddy Merckx. Valverde can tie the all-time record with one more victory. The Spaniard turns 41 on the day of Liege, maybe his birthday can inspire him to one more spectacular performance in the Ardennes?</span></p>\n<p><b>Favourites</b><span>: Julian Alaphilippe, Marc Hirschi, Primoz Roglic, Tadej Pogacar, Jakob Fuglsang</span></p>\n<p><b>Outsiders: </b>Bauke Mollema, Warren Barguil, Simon Carr, Romain Bardet, David Gaudu</p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1cab40e1f1dd5ca9290cbbe306c9812c8d526b4ee7ecd32428fc0b73172c7834","category":"Cycling"}