{"title":"Valve ระบุกำลังทำงานร่วมกับ AMD, เพื่อให้มั่นใจว่า Steam Deck จะพร้อมรัน Windows 11","link":"https://www.blognone.com/node/124374","date":1629734991000,"content":"<div><div><div><p>Steam Deck เครื่องเล่นเกมพกพาจาก Valve ที่กำลังเป็นกระแสจากความเป็นเกมมิ่งพีซีพกพาประสิทธิภาพดีในราคาที่เอื้อมถึง ซึ่งแม้ว่าตัว Steam Deck จะมาพร้อมกับ<a href=\"https://www.blognone.com/node/123755\">ระบบปฏิบัติการ SteamOS 3.0</a> ที่เบื้องหลังคือ Linux ที่สามารถเล่นเกมฝั่ง Windows ได้ผ่านเครื่องมือของ Valve ที่มีชื่อว่า Proton</p>\n<p>แต่สำหรับเกมเมอร์ที่สนใจใช้ Steam Deck เพื่อเล่นเกมจากสโตร์อื่นๆ นอกเหนือจากบน Steam แล้วการติดตั้ง Windows ก็ยังดูเป็นตัวเลือกที่ดีกว่า และสำหรับท่านที่รอฟังข่าวคราวเรื่องความเข้ากันได้กับ Windows ตอนนี้ทาง Valve ก็ได้ออกมาให้ข้อมูลเพิ่มเติมแล้ว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2f4b8f0b11fb5a8d7da46b48f6f75e39.png\" /></p>\n<p>จากการให้สัมภาษณ์กับเว็บไซต์ PC Gamer ทาง Valve ได้ระบุว่า Steam Deck ควรจะรัน Windows 11 ระบบปฏิบัติการรุ่นถัดไปของไมโครซอฟท์ได้อย่างไม่มีปัญหาใดๆ เมื่อเครื่องวางจำหน่าย แม้ว่าก่อนหน้านี้ Valve จะโฟกัสกับการทำให้เครื่องรัน Windows 10 ได้เท่านั้น</p>\n<p>แต่ในตอนนี้พวกเขาก็กำลังทำงานเพื่อทำให้ Steam Deck สามารถรัน Windows 11 ได้ ทั้งในส่วนของ<a href=\"https://www.blognone.com/node/123419\">ความต้องการชิป TPM</a> และตัวหน่วยประมวลผลเอพียู โดยอย่างหลังนั้น Valve ยังได้พูดคุยกับ AMD เพื่อให้มั่นใจว่าตัวเอพียูที่ผลิตโดย AMD นั้นจะเข้ากันได้กับ Windows 11 ในระดับ BIOS</p>\n<p>นับว่าน่าสนใจมากเลยทีเดียวสำหรับท่านที่เล็งซื้อ Steam Deck มาติดตั้ง Windows เมื่อดูจากท่าทีของ Valve ที่ไม่เพียงไม่ปิดกั้นแต่ยังสนับสนุนให้ใช้งานกับ Windows ได้ดีอีกด้วย</p>\n<p>ที่มา - <a href=\"https://www.pcgamer.com/uk/steam-deck-windows-11-tpm-compatibility/\">PC Gamer</a> via <a href=\"https://www.windowscentral.com/steam-deck-should-be-able-run-windows-11\">Windows Central</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/steam-deck\">Steam Deck</a></div><div><a href=\"/topics/windows-11\">Windows 11</a></div><div><a href=\"/topics/valve\">Valve</a></div><div><a href=\"/topics/amd\">AMD</a></div></div></div>","author":"Job_The_Gamer","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1cbada423b3563e97abc54939f04f64ff884bc4ff60cd14fb5041d5a23d1a913","category":"Thai"}