{"title":"Development observed in the field of the Antarctic bivalve mollusc Aequiyoldia eightsii at Signy Island, South Orkney Islands","link":"https://academic.oup.com/mollus/article/doi/10.1093/mollus/eyae036/7794754?rss=1","date":1727654400000,"content":"<span><div>ABSTRACT</div>The embryonic development of marine ectotherms has been shown to be strongly temperature dependent across the world's oceans. However, at the coldest sites, in the polar regions, development is even slower than would be predicted on the basis of the temperature dependence of development in warmer waters, and this is thought to be a consequence of changes in physical characteristics of cytoplasm near 0 °C—such as viscosity and osmolyte packing that slow protein folding and increase the likelihood of interference by charged particles, and their effect on protein synthesis. The overwhelming majority of studies of rates of embryonic development have been laboratory-based, with animals either collected directly from the sea and spawned in the laboratory or held first in the laboratory and preconditioned to set environments before spawning. Few studies have assessed development from regularly collected samples and assessed field development, especially from polar latitudes. Here we present data for the Antarctic bivalve mollusc <span>Aequiyoldia eightsii</span>, tracking its development from spawning on 25/26 May to hatching of pelagic veligers on 12 June and the disappearance of pediveliger larvae from the water column at the end of September or early October, 108–114 days later. Larval dry mass was constant at 16.7 µg (SE = 0.19) across the pelagic phase, except for the initial few days after hatching when it was 9.55 µg (SE = 0.60). The difference was likely the calcification of the larval shell. The development time to trochophore was 189 h, and this was in line with previous studies showing larval development at temperatures around 0 °C is around 4–22 times slower than would be predicted from the general effect of temperature on development rates.</span>","author":"","siteTitle":"Journal of Molluscan Studies Current Issue","siteHash":"50e5bd74f9c9bc6ffdefd16d0eef1528d858cc544080b551025ae62157896b1d","entryHash":"1cc3096aec5952995c91bc111b6115c05522060f4ed362e0524a47f4750d753a","category":"Environment"}