{"title":"Food and feeding strategies of the green tiger shrimp, Penaeus semisulcatusDe Haan, 1844, in southeastern India","link":"https://academic.oup.com/jcb/article/doi/10.1093/jcbiol/ruae017/7650823?rss=1","date":1713398400000,"content":"<span><div>Abstract</div>Observations and analysis of the food and feeding habits of penaeid shrimp are decisive for understanding food webs and ecological processes. Published information on the feeding habits of the green shrimp, <span>Penaeus semisulcatus</span><a href=\"#CIT0005\">De Haan, 1844</a>, from Indian waters, however, dates back four decades, despite the fact that green tiger shrimp is one of the important shrimp species that forms a unique fishery in Palk Bay, on the southeastern India. Hence, its dietary preferences were analysed concerning sex, season, gonad maturity, and size. The species preyed on were composed of diversified components, with mollusc remains being the most common food item in females, followed by crustacean remains, whereas in males, the crustacean remains were the most common food items followed by mollusc remains. There was no significant difference in the gastrosomatic index of females and gonadal maturity stages among seasons, but a significant difference among size groups. In males, there was no significant difference among seasons, gonadal maturity, and size groups. Females were more active feeders than males, and the difference could be seen in their size groups. Larger groups fed more actively than smaller groups. Feeding was more active in the post-monsoon and summer monsoon seasons. <span>Penaeus semisulcatus</span> dominates the ecosystem among the shrimp species due to its carnivorous behaviour. The observations made in this study form key inputs for trophic modelling and ecosystem-based studies, which could help develop suitable strategies for managing the shrimp resource in Palk Bay.</span>","author":"","siteTitle":"Journal of Crustacean Biology Current Issue","siteHash":"8ca07ea220dbc7082c62912ab6b47a7a5a309f6e19a7257844b27bf0267b5f04","entryHash":"1ccda483f1b2396a9756d1bbc75b51ac2c9fe3920ccff3ebb6ad1a7814e7e3e6","category":"Environment"}