{"title":"Functional network modules overlap and are linked to interindividual connectome differences during human brain development","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002653","date":1726668000000,"content":"<p>by Tianyuan Lei, Xuhong Liao, Xinyuan Liang, Lianglong Sun, Mingrui Xia, Yunman Xia, Tengda Zhao, Xiaodan Chen, Weiwei Men, Yanpei Wang, Leilei Ma, Ningyu Liu, Jing Lu, Gai Zhao, Yuyin Ding, Yao Deng, Jiali Wang, Rui Chen, Haibo Zhang, Shuping Tan, Jia-Hong Gao, Shaozheng Qin, Sha Tao, Qi Dong, Yong He</p>\r\n\r\nThe modular structure of functional connectomes in the human brain undergoes substantial reorganization during development. However, previous studies have implicitly assumed that each region participates in one single module, ignoring the potential spatial overlap between modules. How the overlapping functional modules develop and whether this development is related to gray and white matter features remain unknown. Using longitudinal multimodal structural, functional, and diffusion MRI data from 305 children (aged 6 to 14 years), we investigated the maturation of overlapping modules of functional networks and further revealed their structural associations. An edge-centric network model was used to identify the overlapping modules, and the nodal overlap in module affiliations was quantified using the entropy measure. We showed a regionally heterogeneous spatial topography of the overlapping extent of brain nodes in module affiliations in children, with higher entropy (i.e., more module involvement) in the ventral attention, somatomotor, and subcortical regions and lower entropy (i.e., less module involvement) in the visual and default-mode regions. The overlapping modules developed in a linear, spatially dissociable manner, with decreased entropy (i.e., decreased module involvement) in the dorsomedial prefrontal cortex, ventral prefrontal cortex, and putamen and increased entropy (i.e., increased module involvement) in the parietal lobules and lateral prefrontal cortex. The overlapping modular patterns captured individual brain maturity as characterized by chronological age and were predicted by integrating gray matter morphology and white matter microstructural properties. Our findings highlight the maturation of overlapping functional modules and their structural substrates, thereby advancing our understanding of the principles of connectome development.","author":"Tianyuan Lei","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"1cd07e64d78c3d60326dd323d04b99d0e215f792c801742ff8563a510f0e5004","category":"Environment"}