{"title":"Why the iPhone 13 mini will probably be discontinued this week","link":"https://www.macworld.com/article/2062373/iphone-13-mini-wonderlust-event-discontinued.html","date":1694445854000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you’re looking to buy a new iPhone, today’s officially the worst day to buy one. On Tuesday, Apple will <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">launch the iPhone 15</a> at its Wonderlust event and subsequently cut the price of the iPhone 14 and iPhone 13 to make room for the new phones.</p>\n\n\n\n<p>Apple traditionally offers two older generations of iPhone at discounted prices after unveiling a new model, so the iPhone 12 will likely be cut from the lineup. Here’s how Apple’s pricing breaks down ahead of the event: </p>\n\n\n\n<ul>\n<li><strong>iPhone 14 Pro Max:</strong> $1,099</li>\n\n\n\n<li><strong>iPhone 14 Pro:</strong> $999</li>\n\n\n\n<li><strong>iPhone 14 Plus:</strong> $899</li>\n\n\n\n<li><strong>iPhone 14:</strong> $799</li>\n\n\n\n<li><strong>iPhone 13:</strong> $699</li>\n\n\n\n<li><strong>iPhone 13 mini:</strong> $599</li>\n\n\n\n<li><strong>iPhone 12: </strong>$599</li>\n\n\n\n<li><strong>iPhone SE:</strong> $429</li>\n</ul>\n\n\n\n<p>Apple typically cuts $100 from the current price as it shifts the older iPhones lower down the line, removing the oldest model. So here’s how the pricing could look like tomorrow:</p>\n\n\n\n<ul>\n<li><strong>iPhone 14 Plus: </strong>$799</li>\n\n\n\n<li><strong>iPhone 14:</strong> $699</li>\n\n\n\n<li><strong>iPhone 13:</strong> $599</li>\n\n\n\n<li><strong>iPhone 13 mini:</strong> $499</li>\n\n\n\n<li><strong>iPhone SE:</strong> $429</li>\n</ul>\n\n\n\n<p>However, when Apple lowered the price of the iPhone 12 last year, it opted to remove the iPhone 12 mini instead of lowering the price to $499, which would make it just $70 more than the iPhone SE. It doesn’t make sense for Apple to have two phones so close in price, especially when the iPhone 13 mini is superior to the SE. The only possibility is if Apple only cuts the price of the mini by $50, making it $549, more than $100 more than the iPhone SE.</p>\n\n\n\n<p>This year, prices are expected to fluctuate for the new iPhone 15 series, so the new pricing will likely look a little different. However, we don’t expect that to change the pricing for the older phones unless Apple also decides to cut the pricing of the iPhone 15 and 15 Plus. There were rumors earlier this year that Apple wasn’t happy with sales of the iPhone 15 Plus and was considering a price cut. Still, it’s unlikely that a lower pricing structure would affect Apple’s plans for the iPhone 13 mini.</p>\n\n\n\n<p>Mark Gurman also <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/markgurman/status/1700953564577923085?s=61&amp;t=OXaJ9Ia15o19Nppf6zMxOQ&amp;xcust=1-1-2062373-1-0-0&amp;sref=https://www.macworld.com/feed\">reports</a> that there is “low/no stock” at Apple Stores for various products expected to be discontinued this week, including the iPhone 12 and iPhone 13 mini. That strongly suggests Apple is expected to phase out the 5.4-inch phone.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1cde75fdd91b3992610ba1d26683d14a2b21c9b9d994254fb0fd12a450a34287","category":"Apple"}