{"title":"Spatially Heterogeneous Responses of Planktonic Foraminiferal Assemblages Over 700,000 Years of Climate Change","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13905?af=R","date":1724126855000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>To determine the degree to which assemblages of planktonic foraminifera track thermal conditions.</p>\n<h2>Location</h2>\n<p>The world's oceans.</p>\n<h2>Time Period</h2>\n<p>The last 700,000 years of glacial–interglacial cycles.</p>\n<h2>Major Taxa Studied</h2>\n<p>Planktonic foraminifera.</p>\n<h2>Methods</h2>\n<p>We investigate assemblage dynamics in planktonic foraminifera in response to temperature changes using a global dataset of Quaternary planktonic foraminifera, together with a coupled Atmosphere–Ocean General Circulation Model (AOGCM) at 8000-year resolution. We use ‘thermal deviance’ to assess assemblage responses to climate change, defined as the difference between the temperature at a given location and the bio-indicated temperature (i.e., the abundance-weighted average of estimated temperature optima for the species present).</p>\n<h2>Results</h2>\n<p>Assemblages generally tracked annual mean temperature changes through compositional turnover, but thermal deviances are evident under certain conditions. The coldest-adapted species persisted in polar regions during warming but were not joined by additional immigrants, resulting in minimal assemblage turnover. The warmest-adapted species persisted in equatorial regions during cooling with similarly minimal assemblage change. Assemblages at mid-latitudes mostly tracked temperature cooling and warming.</p>\n<h2>Main Conclusions</h2>\n<p>Planktonic foraminiferal assemblages were generally able to track or endure temperature changes: as climate warmed or cooled, bio-indicated temperature also became warmer or cooler, although to a variable degree. At polar sites under warming and at equatorial sites under cooling, the change in bio-indicated temperature was less than, or even opposite to, what would be expected from estimated environmental change. Nevertheless, all studied species persisted across the study interval, regardless of thermal deviance—a result that highlights the resilience and inertia of planktonic foraminifera on an assemblage level to the last 700,000 years of climate change.</p>","author":"Gregor H. Mathes, \nCarl J. Reddin, \nWolfgang Kiessling, \nGawain S. Antell, \nErin E. Saupe, \nManuel J. Steinbauer","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"1ce358d4026f58075fb23c97fcc806c3a96a1ca79250f67b401473d032bbd221","category":"Environment"}