{"title":"Silicon Valley Bank Is Shut Down by Regulators in Biggest Bank Failure Since Global Financial Crisis","link":"https://www.cnbc.com/2023/03/10/silicon-valley-bank-is-shut-down-by-regulators-fdic-to-protect-insured-deposits.html","date":1678482966000,"content":"\n<p>CNBC:</p>\n\n<blockquote>\n  <p>Financial regulators have closed Silicon Valley Bank and taken\ncontrol of its deposits, the Federal Deposit Insurance Corp.\nannounced Friday, in what is the largest U.S. bank failure since\nthe global financial crisis more than a decade ago.</p>\n\n<p>The collapse of SVB, a key player in the tech and venture capital\ncommunity, leaves companies and wealthy individuals largely unsure\nof what will happen to their money. [...]</p>\n\n<p>The FDIC’s standard insurance covers up to $250,000 per depositor,\nper bank, for each account ownership category. The FDIC said\nuninsured depositors will get receivership certificates for their\nbalances. The regulator said it will pay uninsured depositors an\nadvanced dividend within the next week, with potential additional\ndividend payments as the regulator sells SVB’s assets.</p>\n\n<p>Whether depositors with more than $250,000 ultimately get all\ntheir money back will be determined by the amount of money the\nregulator gets as it sells Silicon Valley assets or if another\nbank takes ownership of the remaining assets. There were concerns\nin the tech community that until that process unfolds, some\ncompanies may have issues making payroll.</p>\n</blockquote>\n\n<p>To say this is shocking is an understatement. This just shouldn’t happen to a bank. To make a long story short (and to be honest I’m cribbing this from a summary my pal <a href=\"https://stratechery.com/\">Ben Thompson</a> wrote in a private group chat), SVB took in a ton of cash during the COVID bubble, and because they couldn’t make money loaning that money at the time, they bought a bunch of corporate bonds and mortgage-backed securities. The problem is they bought those securities when interest rates were still at historical lows. Today, with higher interest rates, those securities are underwater — they’d lose a fortune selling them now before maturity. SVB would’ve been fine if they’d been able to let those securities mature for their full 10 years (or whatever the terms were). But withdrawals are up because startups are having trouble raising money, so SVB did an equity raise to fill the gap, but screwed up — to say the least — by announcing the equity raise before it was officially completed. At this point their stock tanked, the equity partner pulled out, and their customers started a run on the bank — and a bank run was the one thing SVB couldn’t withstand. Within 24 hours they went from “having a bad quarter” to “failed bank”.</p>\n\n<p>Some of SVB’s customers might be in trouble, at least momentarily: even a 100-employee company needs millions in the bank to make payroll, pay rent and utilities, etc. Larger companies, much more. $250K in deposit insurance is a drop in the bucket for most of SVB’s business customers. Everyone is assuming that some big bank will buy SVB and make all depositors whole, but until that happens, it’s an open question. If there is no buyer and SVB is liquidated, there’s no way uninsured deposits will be made whole.</p>\n\n<p><strong>See Also:</strong> <a href=\"https://twitter.com/justinwolfers/status/1634258402598592512\">Good thread from economist Justin Wolfers</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/10/svb-goes-belly-up\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"1ce3d6fb4a7acc4a091e98298fea30122e191cd82944382e47611949d616b21a","category":"Tech"}