{"title":"Roglič crashes – and also loses red – but makes big gains on key Vuelta rivals","link":"https://cyclingtips.com/2021/08/roglic-crashes-and-also-loses-red-but-makes-big-gains-on-key-vuelta-rivals/","date":1629821475000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/primozroglic-1-650x418.jpg\" /></div><h2>Roglič crashes – and also loses red – but makes big gains on key Vuelta rivals</h2><p>\n</p><p>Primož Roglič (Jumbo-Visma) came away from <a href=\"https://cyclingtips.com/2021/08/storer-gets-another-win-on-an-action-packed-vuelta-stage-10/\" target=\"_blank\">stage 10</a> of the Vuelta a España with 37 more seconds over his Ineos Grenadiers rivals Egan Bernal and Adam Yates – but he <em>could</em> have had an even bigger day. Then again, things also could have gone much worse.</p>\n\n\n\n<p>After jumping out to a strong advantage with an impressive and somewhat surprising solo bid on a late climb, Roglič was extending his lead over his main GC rivals with an aggressive descent when he slid out on a curve. The fall ultimately cost him around 20 seconds, allowing some of those chasing him to catch back up and helping limit the damage to those further back that he had worked so hard to gain time on. Then again, Roglič did quickly remount and made it safely to the finish after crashing on a high-speed descent; all things considered, he seemed to have escaped potentially far more serious consequences.</p>\n\n\n\n<p>“Without the crash it would be even better, no? But it’s not too bad.” Roglič said afterward. “It was some action, huh?</p>\n\n\n\n<p>“No risk, no glory.”</p>\n\n\n\n<p>On a hectic day that saw Odd Christian Eiking (Intermarché-Wanty-Gobert Matériaux) take red from the break, Roglič was content to put the pressure on his main GC rivals on a climb that did not seem likely to have big GC implications. The two-time defending champion soared away from the rest of the red jersey hopefuls riders on the Cat 2 Puerto de Almáchar and quickly built up a hefty lead, with the other GC riders forming into chase groups behind. While Miguel Ángel López and Enric Mas of Movistar, Jack Haig of Bahrain Victorious, and Roglič’s Jumbo-Visma teammate Sepp Kuss linked up to form the next group on the road, Bernal, Yates, and others were significantly further back as Roglič worked his way solo up the ascent.</p>\n\n\n\n<p>Roglič took some 20 seconds’ advantage on López, Mas, and Haig over the top after that group dropped Kuss, and Bernal and Yates were faring much worse at nearly a minute back. Roglič did not let up after cresting the top of the climb and seemed to be putting even more time into those behind with a high-speed downhill push. After flying through one corner after another, however, Roglič cut it too close on a righthand bend and went down.</p>\n\n\n\n<p>Cornering tightly as he was, though, he didn’t have far to fall onto the asphalt, and a guardrail helped stop his slide. He was back up within seconds, took a moment to get his chain back on, and continued.</p>\n\n\n\n<p>The crash held him up enough, however, that López, Mas, and Haig caught back on, and the advantage to those further back also narrowed. Kuss and a few others joined back up with Roglič, López, Mas, and Haig and the larger group rode to the finish together with perhaps a little bit less impetus than before.</p>\n\n\n\n<p>When all was said and done, Roglič had not gained any time on his next closest main GC rivals, but he had at least put more than half a minute into Bernal, Yates, and others. What’s more, he appeared to have avoided serious injury despite crashing while descending at a high speed, a victory in and of itself.</p>\n\n\n\n<p>“It’s not too bad. I mostly slid,” he explained afterward.</p>\n\n\n\n<p>Eiking and Guillaume Martin (Cofidis) both surged up the leaderboard out of the break, with Eiking now 58 seconds ahead of Martin and 2:17 ahead of Roglič, but on the whole, it was a day that Jumbo-Visma will likely be very happy with, considering the damage the 31-year-old Slovenian was able to do to two riders who came into the race looking like major rivals.</p>\n\n\n\n<p>Sure, the day could have gone more smoothly, but in the end, it went pretty well too.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/roglic-crashes-and-also-loses-red-but-makes-big-gains-on-key-vuelta-rivals/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1cf5b2cc4a61bedadb682d32bfc35eb55ad01196e263fe83c04ada6ea0171907","category":"Cycling"}