{"title":"Exploring Altered Neural Connectivity in Autism Spectrum Disorder: A Simulation of Spatial and Topological Proximities","link":"https://www.preprints.org/manuscript/202405.0856/v1","date":1715595375000,"content":"This study presents a computational simulation to explore the distinctive patterns of neural connectivity in Autism Spectrum Disorder (ASD), focusing on the concepts of spatial and topological proximities. ASD is characterized by unique cognitive and behavioral profiles, often attributed to atypical neural development and connectivity. Our simulation employs a two-pronged approach: first, by modeling spatial proximity through the generation of clustered 3D node positions, we mimic the observed over-connectivity in localized brain regions in ASD. Second, we construct a topological network to represent the complex interplay of under-connectivity and over-connectivity in functional brain networks, a hallmark of ASD's neural landscape. The spatial model demonstrates pronounced clustering, reflecting the structural brain differences and atypical growth patterns reported in neuroimaging studies of individuals with ASD. In contrast, the topological model reveals a network with a mix of sparse and dense connections, simulating the diverse and often contradictory findings of functional connectivity in ASD, such as reduced long-range connections and increased local connections. Our simulation provides a visual and conceptual framework for understanding the altered neural connectivity in ASD. It underscores the importance of considering both physical (spatial) and functional (topological) aspects of brain connectivity to grasp the full extent of neurodevelopmental deviations in ASD. This approach not only aids in elucidating the neural underpinnings of ASD's core symptoms but also offers a foundation for developing targeted interventions. Future research, integrating more complex and individual-specific data, could further refine this model, enhancing our understanding of ASD's neural dynamics and contributing to personalized therapeutic strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1cf94548d32ea0c9845646985533f1a20955f4e2ffe466348276e28695dd5fc9","category":"Interdisciplinary"}