{"title":"Genetic consequences of improved river connectivity in brown trout (Salmo trutta L.)","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13660?af=R","date":1712818800000,"content":"<h2>Abstract</h2>\n<p>Fragmentation of watercourses poses a significant threat to biodiversity, particularly for migratory fish species. Mitigation measures such as fishways, have been increasingly implemented to restore river connectivity and support fish migration. The effects of such restoration efforts are typically tested using telemetry and fisheries methods, which do not fully capture the broader population movements that may have important consequences for population viability. We performed a before-and-after control-impact (BACI) study using genetic tools (SNPs) to investigate the effect of a newly implemented fishway, aiming to enhance upstream spawning migration of brown trout (<i>Salmo trutta</i> Linnaeus) in a reservoir with two headwater tributaries fragmented by man-made weirs. Another reservoir with two barrier-free tributaries was also analysed as a control. Our results showed that the isolated brown trout population was spawning in the reservoir before the installation of the fishway, and we found genetic structuring and differentiation between fragmented headwater tributaries before the fishway construction, but not in the control reservoir. Unexpectedly, after the fishway construction we observed signals consistent with increased genetic differentiation between populations of newly recruited juvenile fish in the reservoir tributary and fish in the reservoir. We propose this was caused by newly enabled philopatric behaviour of brown trout to their natal spawning tributary. In contrast, we did not find any genetic changes in the tributary without a fishway or in the barrier-free reservoir system. Given the scarcity of similar studies, we advocate for an increased use of genetic analyses in BACI studies to monitor and evaluate the effect of efforts to restore habitat connectivity and inform future management strategies.</p>","author":"Paolo Moccetti, \nJamie R. Dodd, \nDomino A. Joyce, \nAndy D. Nunn, \nBen Gillespie, \nJonathan D. Bolland","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"1d035483452bd4c9edd25e4a6b0fc90dfcdf22d5dbb9abd1d622125663bed931","category":"Environment"}