{"title":"Biodecolorization of Reactive Red 120 Azo Dye by Metal-Ion Tolerant Lysinibacilluscapsici PB300 (T) Bacteria Bacteria and its Application Potential in Textile Effluents Treatment","link":"https://www.preprints.org/manuscript/202404.1688/v1","date":1714043374000,"content":"Currently, the textile industry is among the most rapidly expanding areas of the economy and is an important source of water pollution. There are many efficient chemical and physical methods for treating textile effluent, but they produce secondary pollutants. Therefore, there is a need to manage the textile waste wastewater. The potential EPS-producing and plant growth-promoting rhizobacteria Lysinibacillus capsici PB300 (T) bacteria strain has been isolated from the bark borer-affected Peltophorum pterocarpum plant and has been determined to be effective in &gt; 95 decolorizing Reactive Red 120, and other azo dyes such as AB11385%, orange II 94.62%, Congo red 94.62%, phenol red 94.54%, and mixtures of azo dyes 81.66%. Physico-chemical factors were optimized manually, including Taguchi design. EPS production, PGPR strain, and fabric discoloration of L. capsici were qualitatively studied. The FTIR, GC-MS, and UV absorbance studies also confirmed that the dye had been broken into its amines. Research findings using enzyme assays have shown that the bacteria Lysinibacillus capsici PB300 (T) can utilize laccase and manganese peroxidase and are capable of degrading dyes significantly. According to this work, immobilised L. capsici cells and the studied four bacterial consortiums, Lysinibacillus capsici PB300 (T), Alcaligenes faecalis subsp. Phenolicus DSM 16503 (T), Acinetobacterbaumanni ATCC 19606 (T), and Pseudomonasaeruginosa JCM 5962  may be employed to degrade RR120 effectively, and it is concluded that L. capsici PB300 (T) bacteria is significantly efficient in textile effluent treatment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1d0fa197c0c15d55d757dc093dae5a71b1c66e3c5ba756fca51e91dac5da50c6","category":"Interdisciplinary"}