{"title":"165 Characterizing protein quality with in vitro methodologies","link":"https://academic.oup.com/jas/article/102/Supplement_3/129/7757310?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Nutritional assessment of the quality of a protein source is a complex process with different requirements depending on the jurisdiction being discussed. The Protein Efficiency Ratio (PER) is a growth measurement required in Canada, whereas the United States uses the Protein Digestibility Corrected Amino Acid Score (PDCAAS), which requires the determination of the amino acid profile and digestibility of the protein source. Notably both PER and PDCAAS are in vivo methods, necessitating the use of animals for measurement of growth and protein digestibility. Understandably there is significant interest from both industry and consumers to reduce reliance on animal experimentation for content claims. It is notable that outside of North America there are multiple examples of in vitro protein quality assessment. In Europe protein content claims are based on whether the protein content contributes &gt;12% of the total energy, and in Australia content claims begin at 5 g of protein per serving. As the use of in vitro techniques for protein quality assessment has not led to indices of protein malnutrition in Europe and Australia, should be possible to use in vitro techniques in methods such as PER and PDCAAS thereby removing the reliance on animal use for quality assessment in North America. This can be accomplished by using in vitro methods in the assessment of protein digestibility and relying on recent changes by Health Canada to allow for calculation of PER from PDCAAS values. This presentation will introduce how protein quality is calculated via PER/PDCAAS, and subsequently discuss modifications of these methods to incorporate in vitro techniques to generate values indicating their nutritional quality with positive correlations to in vivo data.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1d16267bfd7d23e511e6a14c837a472b571716aa6b8f59d6a07399e4644027ba","category":"Environment"}