{"title":"ข้อมูลเพิ่มเติม Apple Vision Pro - ทำหายใช้ Find My หาไม่ได้, ต่อเมาส์บลูทูธไม่ได้ ฯลฯ","link":"https://www.blognone.com/node/138028","date":1707013071000,"content":"<div><div><div><p>แอปเปิลเริ่มส่งมอบเฮดเซต Apple Vision Pro ให้กับลูกค้าในสหรัฐอเมริกาแล้ว ทำให้มีข้อมูลเอกสารซัพพอร์ตเผยแพร่ออกมาประกอบการใช้งาน ซึ่งมีหลายประเด็นที่น่าสนใจในรายละเอียด โดยมีคนรวบรวมไว้แล้วดังนี้</p>\n<h4>การเชื่อมต่อบลูทูธ</h4>\n<p>การใช้งาน Vision Pro สามารถเชื่อมต่อกับอุปกรณ์บลูทูธ<a href=\"https://support.apple.com/en-us/HT213998\">เพิ่มเติมได้</a> ดังนี้</p>\n<ul>\n<li>หูฟัง AirPods และ Beats โดยรุ่นที่แอปเปิลแนะนำคือ AirPods Pro 2nd Gen</li>\n<li>คีย์บอร์ดบลูทูธส่วนใหญ่สามารถเชื่อมต่อได้ รวมทั้ง Apple Magic Trackpad แต่แอปเปิลบอกว่าไม่รองรับคีย์บอร์ดแอปเปิลรุ่นเก่า ที่ถอดเปลี่ยนแบตเตอรี่ได้</li>\n<li><strong>ไม่รองรับ</strong>เมาส์บลูทูธ</li>\n<li>คอนโทรลเลอร์ที่ได้มาตรฐาน MFi (Made for iPhone) ใช้งานได้ รวมทั้งคอนโทรลเลอร์ Xbox และ PlayStation</li>\n<li>อุปกรณ์ช่วยการฟังที่ได้มาตรฐาน MFi</li>\n</ul>\n<p>อย่างไรก็ตาม แอปเปิลบอกว่าหากเป็นอุปกรณ์ 3rd Party แอปเปิลไม่รับประกันว่าจะสามารถใช้งานได้ทั้งหมด</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1eaba18d09d09d16e460f4917129202f.jpg\" /></p>\n<h4>Find My</h4>\n<p>อุปกรณ์แอปเปิลในยุคหลังได้ใส่ชิปเพื่อรองรับ Find My สำหรับค้นหาพิกัดตำแหน่งอุปกรณ์ กรณีทำหาย (แม้แต่ <a href=\"https://www.blognone.com/node/137879\">Apple Pencil ยังอาจมี</a>) แต่ไม่ใช่สำหรับ Vision Pro</p>\n<p>แอปเปิลระบุว่า Vision Pro รองรับเฉพาะฟังก์ชัน Activation Lock เท่านั้น ไม่รองรับฟังก์ชันการแสดงตำแหน่งปัจจุบันเพื่อค้นหา การป้องกันอุปกรณ์ที่ทำได้คือล็อกอุปกรณ์ ไม่ให้ปิด Find My หรือรีเซ็ตอุปกรณ์ได้เท่านั้น</p>\n<p>ทางเลือกหนึ่งที่อาจพอทำได้ในปัญหานี้ คือใส่ AirTag ไว้ในเคสที่เก็บ Vision Pro แล้วค้นหาพิกัดจากเคสแทน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/154ed937c10ae0d4a760f519caab8f3d.jpeg\" /></p>\n<h4>Travel Mode</h4>\n<p>ภาพที่นำเสนอของ Vision Pro นั้น มักเป็นการใช้งานภายในบ้าน เหตุผลหนึ่งอาจเพราะแบตเตอรี่อยู่ได้ประมาณ 2 ชั่วโมงเท่านั้น แต่เฮดเซตนี้ก็มีโหมดสำหรับการเดินทาง Travel Mode ด้วย ที่นำเสนอผ่านการเปิด immersive ระหว่างนั่งเครื่องบิน สร้างสภาพแวดล้อมรอบตัวขึ้นมาระหว่างดูภาพยนตร์</p>\n<p><a href=\"https://support.apple.com/en-us/HT214004\">คำแนะนำ</a>ในการใช้งานระหว่างเดินทางคือ จัดเก็บ Vision Pro ไว้อย่างเหมาะสม ถ้าไม่ได้ใช้งาน โดยแนะนำให้ใส่ในเคสป้องกันโดยเฉพาะ และถอดแบตเตอรี่ออก ไม่มีของที่อาจไปขูดขีดเฮดเซตอยู่ใกล้ ๆ</p>\n<p>ส่วนการใช้งานขณะเดินทางเครื่องบิน แอปเปิลแนะนำให้ผู้ใช้งานนั่งอยู่กับที่ตลอดเวลา และถอดเฮดเซตออกก่อนลุกขึ้นยืน หลีกเลี่ยงการมองหน้าต่างเครื่องบิน เพราะอาจกระทบการตรวจสอบสภาพแวดล้อม การปรับตำแหน่งจอภาพให้ใช้ Digital Crown หมุนปรับตำแหน่งที่ต้องการ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1fc7dabd1c05d93ddb65a7ea5b537e69.jpeg\" /></p>\n<h4>Persona</h4>\n<p>ฟีเจอร์ขายอันหนึ่งของ Vision Pro คือ Persona ที่สามารถสร้างใบหน้าผู้ใช้งาน ไว้แสดงเมื่อสนทนาวิดีโอคอล และสามารถเคลื่อนไหวตามได้เสมือนจริง อย่างไรก็ตามรีวิวในช่วงแรกจากสื่อยังมองว่า Persona แสดงผลออกมาดูแปลกตา ซึ่งแอปเปิลน่าจะต้องปรับปรุงเพิ่มเติม</p>\n<p>ทั้งนี้แอปเปิลก็<a href=\"https://support.apple.com/en-us/HT214002\">แนะนำ</a>การตั้งค่า Persona เพื่อให้ได้ผลลัพธ์สมจริงที่สุดหลายอย่าง เช่น อยู่ในสภาพแสงที่เหมาะสม ไม่มีเงาสะท้อน, ใช้ฉากหลังพื้นเรียบ ไม่มีของหรือคนอยู่ด้านหลัง, เมื่อสั่งให้ยิ้ม ให้ยิ้มกว้างหรือเป็นธรรมชาติที่สุด, หากใส่หมวก AirPods ต่างหู ภาพที่ออกมาอาจไม่สมบูรณ์ ให้แก้ไขโดยถอดสิ่งเหล่านี้ออกก่อน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/d9444192d128a77a9e99ebf7b864e4f7.jpeg\" /><em>ภาพ <a href=\"https://www.youtube.com/watch?v=GkPw6ScHyb4\">Brian Tong</a></em></p>\n<h4>ข้อมูลอื่น</h4>\n<ul>\n<li>การ<a href=\"https://support.apple.com/en-us/HT213964\">ทำความสะอาด</a>ส่วนเลนส์และหน้าจอ ใช้ผ้าแห้งไมโครไฟเบอร์ หรือผ้าทำความสะอาดที่ให้มาในกล่อง</li>\n<li>สายรัดและสายคาด สามารถล้างทำความสะอาดได้ด้วยน้ำยาล้างจานผสมน้ำ ก่อนใช้งานต่อทุกอย่างควรแห้งสนิทก่อน</li>\n<li>มี<a href=\"https://support.apple.com/en-us/117742\">โหมด Guest</a> สำหรับให้คนอื่นมาใช้งาน Vision ได้</li>\n<li>การต่อจอ Mac เสมือน ต้องอัพเดตเป็น Sonoma หรือใหม่, ใช้ Apple ID เดียวกัน และอยู่ใน Wi-Fi เดียวกัน</li>\n<li>Mac ซีพียู Apple silicon รองรับการแสดงความละเอียดสูงสุด 4K ส่วนซีพียูอินเทลสูงสุด 3K</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8b16383e4d5b427b43e0c70e0ddd61e7.png\" /></p>\n<p>ที่มา: <a href=\"https://9to5mac.com/2024/02/02/apple-vision-pro-bluetooth-support/\">9to5Mac</a>, MacRumors <a href=\"https://www.macrumors.com/2024/02/02/apple-vision-pro-lacks-find-my-tracking/\">[1]</a>, <a href=\"https://www.macrumors.com/guide/vision-pro-travel/\">[2]</a>, <a href=\"https://www.macrumors.com/guide/vision-pro-persona-tips/\">[3]</a>, <a href=\"https://www.macrumors.com/2024/02/02/apple-explains-how-to-clean-vision-pro-headset/\">[4]</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/020ba4706fc08f5182746141b5cde422.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple-vision-pro\">Apple Vision Pro</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/spatial-computing\">Spatial Computing</a></div><div><a href=\"/topics/find-my\">Find My</a></div><div><a href=\"/topics/accessories\">Accessories</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1d17bb6a137f968471e4e2afe25dd62ff73af50a4f53ac0804abbc256728b444","category":"Thai"}