{"title":"Validation of activity trackers to estimate energy expenditure in older adults with cardiovascular risk factors","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309481","date":1724767200000,"content":"<p>by Alina Rieckmann, Bas Jordan, Friederike Burczik, Jacqueline Meixner, Christian Thiel</p>\r\nObjectives <p>To compare different types of activity trackers recording physical activity energy expenditure (PAEE) and examine their criterion validity against indirect calorimetry (IC) as the gold standard in adults over 60 years of age with a special focus on women with cardiovascular risk.</p> Design <p>Synchronous registrations of PAEE were performed with up to four different devices to determine criterion validity against IC while participants performed a protocol of simulated activities in a laboratory setting.</p> Method <p>Thirty-four participants (25 women, 9 men) with at least a light cardiac risk performed a protocol of simulated activities in a laboratory setting (daily living activities, cycle ergometer test). PAEE was simultaneously assessed by IC, two research-grade activity trackers (ActiGraph-wGT3X-BT and Actiheart-4) and two consumer-level activity trackers (OMRON pedometer and Fitbit Charge-3). Tracker-derived PAEE was compared with PAEE calculated from IC descriptively and by Bland–Altman plots.</p> Results <p>The ActiGraph (0.7 ± 0.4 kcal/min), the Actiheart (1.1 ± 0.6 kcal/min) and the OMRON (0.8 ± 0.6 kcal/min) underestimated, while the Fitbit (3.4 ± 1.2 kcal/min) overestimated PAEE compared to IC-PAEE (2.0 ± 0.5 kcal/min). The Bland–Altman limits of agreement (LoA) against IC were +0.5/+2.2 kcal/min for the ActiGraph, -0.3/+2.1 kcal/min for the Actiheart, -3.7/+1.0 kcal/min for the Fitbit, and -0.5/+2.9 kcal/min for the OMRON. The magnitude of the deviation varied considerably depending on the activity (e.g. walking, cleaning, cycle ergometer test).</p> Conclusions <p>The research-grade activity trackers estimated PAEE with higher validity than the commercially available activity trackers. The partly very wide LoA have to be critically considered when assessing PAEE in the context of health service research, as individual Physical Activity behaviour may be under- or overestimated.</p>","author":"Alina Rieckmann","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1d1d90700ddbdb208243118df8c0b8df569247c21a0996efaeb13ff5792c7f0e","category":"Interdisciplinary"}