{"title":"Epic CEO Tim Sweeney Admits App Store's 30% Cut Is Similar to Consoles, Would Have Accepted Special Deal With Apple","link":"https://www.macrumors.com/2021/05/04/tim-sweeney-epic-apple-trial-day-2/","date":1620161694000,"content":"Apple's legal battle with <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> is continuing on, and during the second day of the trial, ‌Epic Games‌' CEO Tim Sweeney continued his testimony against Apple.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/fortnite-apple-logo-2.5.jpg\" />\r\n<br />\r\nSweeney was grilled by Apple's lawyers, and made several points seemingly favorable to Apple. In addition to mentioning how he prefers Apple's <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and values Apple's privacy policies that he's aiming to dismantle, Sweeney confirmed that Apple's 30 percent cut is also the \"most prevalent rate\" that other platforms charge.\r\n<br />\r\n\r\n<br />\r\nMicrosoft, Sony, and Nintendo all take a 30 percent cut from ‌Epic Games‌ on their platforms and require their in-app purchase systems to be used, but Sweeney said that Epic is not challenging them because he believes in the idea of \"subsidized hardware,\" though he also admitted that ‌iPhone‌ and iOS development is \"very similar.\" It's also worth noting that Fortnite makes more money on console platforms than it does from iOS.\r\n<br />\r\n\r\n<br />\r\nSweeney confirmed that ‌Epic Games‌ has a history of bullying platform makers. ‌Epic Games‌ <a href=\"https://www.theverge.com/2021/5/3/22417560/sony-ps4-cross-play-confidential-documents-epic-games-agreements\">pushed Sony</a> into allowing cross-platform play, but Sony ultimately got the upper hand and requires additional payment to enable cross-platform capabilities, unlike iOS, where cross-platform play is free and has been since Fortnite launched on the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>.\r\n<br />\r\n\r\n<br />\r\nApple pointed out ‌Epic Games‌' use of Apple's Metal API and shared correspondence where Sweeney and Epic had praised Metal in the past as evidence that Epic benefits from Apple's APIs and SDKs. From an Epic internal email discussing a quote to give to Apple:<blockquote>We've been making use of Metal on iOS to great effect since its release in 2014. A fast, agile, feature-rich API like Metal is exactly what we need to bring a game designed for modern consoles and desktops to the battery-powered ‌iPhone‌ and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>. As a developer, it blows away OpenGL in every way.</blockquote>Starting in 2015, Sweeney began trying to convince Apple to make the ‌App Store‌ an open platform.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/tim-sweeney-email-cook.jpg\" />\r\n<br />\r\nHumorously, when he got Sweeney's initial email, Cook didn't know who Sweeney was. \"Is this the guy that was at one of our rehearsals?\" he asked <a href=\"https://www.macrumors.com/guide/phil-schiller/\">Phil Schiller</a> in a forwarded email.\r\n<br />\r\n\r\n<br />\r\nWhen asked whether he would have accepted a special deal from Apple for a lower ‌App Store‌ commission, Sweeney said \"Yes, I would have,\" which seems to weaken Epic's argument that its decision to kick off a legal battle with Apple was done to benefit all developers.\r\n<br />\r\n\r\n<br />\r\nAt the conclusion of today's questioning, Sweeney was asked what he would do if ‌Epic Games‌ loses the case. In response, he said that Apple would be able to cut off Fortnite and remove ‌Epic Games‌ from the developer program for any reason. \"We would have to live with not supporting the iOS platform,\" he said.\r\n<br />\r\n\r\n<br />\r\nThe legal fight between Apple and Epic will continue for three weeks, with Apple executives like <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> set to testify during the third week. We'll have ongoing coverage of Apple v. Epic as the case continues on.<div>Tags: <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/04/tim-sweeney-epic-apple-trial-day-2/\">Epic CEO Tim Sweeney Admits App Store's 30% Cut Is Similar to Consoles, Would Have Accepted Special Deal With Apple</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/epic-ceo-tim-sweeney-admits-app-stores-30-cut-is-similar-to-consoles-would-have-accepted-special-deal-with-apple.2294830/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=QKDubpBZpDs:sWoHTBiI-C8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=QKDubpBZpDs:sWoHTBiI-C8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/QKDubpBZpDs\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1d1f04d22d3cfd6972383fceeb7a724b34bd5242945ee64f8b44e746513dd62f","category":"Apple"}