{"title":"Mediation effects of basic psychological needs and motivation among coach leadership style on the subjective well-being of adapted sports athletes’ members of the special olympics","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0298297","date":1713189600000,"content":"<p>by Ana Domingues, Jorge Santos, Marco Batista, João Serrano, Samuel Honório, João Petrica</p>\r\nIntroduction <p>Subjective well-being has numerous indicators of global well-being, however, the most important are life satisfaction and attachments, which can be both positive and negative. The leadership of the coach is an integral part of the process that cares for the relationship of the athlete and coach, where the coach has a fundamental role on the athlete, and consequently on his subjective well-being.</p> Objective <p>The study has the purpose to analyse if and in what way the Basic Psychological Needs—relationship, autonomy and social relationship (mediator 1, M1) and the autonomous motivation (mediator 2, M2) mediate the relationship of the variables of democratic style (independent variable, X) with subjective well-being–life satisfaction and positive attachment (dependent variable, Y).</p> Methods <p>In this cross-sectional study, participated 94 athletes with Intellectual and Developmental Difficulty (IDD), aged between 11 and 63 years (ẋ = 32.6 ± SD = 13.8 years) of both genders. Statistical analysis was performed using multiple serial mediation models, using the macro PROCESS <i>for</i> SPSS, version 3 (model 6), using the <i>bootstrap method</i> with 10000 samples.</p> Results and Conclusions <p>There is a mediation effect between those of basic psychological needs and autonomous motivation, exercised between the democratic leadership profile of the coach and the subjective welfare of the athlete. On the other hand, autocratic style has a significant direct effect on the increase in basic psychological needs and controlled motivation. However, the democratic style is more consistent in this type of analysis. Our results reinforce the importance of promoting a democratic leadership style on the part of the coach in their athletes, enhancing a direct effect on life satisfaction and positive attachment in athletes adapted with IDD members of the Special Olympics.</p>","author":"Ana Domingues","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1d208d9750931c5102b40ce3912c01680451957e433815f291f2c31e70f0e786","category":"Interdisciplinary"}