{"title":"The ultimate Mac repair guide: Get your Mac powered on and starting up","link":"https://www.macworld.com/article/342272/the-ultimate-mac-repair-guide-get-your-mac-powered-on-and-starting-up.html","date":1617789600000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>The Mac is one of the most reliable PCs you can buy, which is probably why there&rsquo;s a heightened sense of anxiety when you press the power button and nothing happens. But take a deep breath. When your Mac won&rsquo;t start, there are a number of reasons why, and most likely, it&rsquo;s an easy fix. Apple has a&nbsp;<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT204267&amp;xcust=1-1-342272-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">support document</a>&nbsp;with advice on what to do when your Mac won&rsquo;t turn on, but we&rsquo;re going to give you a little more detail and a few more things to check. So be sure to bookmark this page for when it inevitably happens again.</p>\n\n\n\n<p><em>Before we start, let this be a lesson to keep a backup. Whether you use a cloud service, store important files on iCloud Drive, or use Time Machine with an external drive, you&rsquo;ll want to make sure your most personal stuff that isn&rsquo;t already in a cloud&mdash;local documents, files, movies, music, etc.</em> That way even if you need to wipe your Mac and start over, </p>\n\n\n\n<h1 class=\"toc\" id=\"your-mac-wont-power-up\">Your Mac won&rsquo;t power up</h1>\n\n\n\n<h2 id=\"make-sure-its-not-actually-on\">Make sure it&rsquo;s not actually on</h2>\n\n\n\n<p>If you press the power button and nothing happens, it might actually already be on. It sounds silly, but when the battery lies the Mac goes into a hibernation mode and it can be tough to tell if it&rsquo;s actually on or not. Listen for fan noise (though even Macs with fans are pretty quiet when they aren&rsquo;t doing anything), and check for light indicators, such as the backlighting on a MacBook keyboard or the Touch Bar on a MacBook Pro.</p>\n\n\n\n<p>Also, look at the display. If it&rsquo;s a deep black, the screen is definitely off, but if the color is more like an extremely dark gray that&rsquo;s close to black but not quite, it&rsquo;s on. You can tell by checking the contrast between the black bezel and the display on a MacBook or iMac&mdash;it should blend seamlessly if it&rsquo;s powered down. If you&rsquo;re using an external display, look for a power indicator LED on the front, and check that the cable connection is secure.</p>\n\n\n\n<p>If you&rsquo;ve determined that your Mac is actually on and not responding, you can try the old panacea: a restart. If you don&rsquo;t know how to do that, see below.</p>\n\n\n\n<h2 id=\"check-your-connections\">Check your connections</h2>\n\n\n\n<p>Beyond asking, &ldquo;Is it plugged in?&rdquo; we have a few more obvious issues that can often fix startup problems.</p>\n\n\n\n<p><strong>The USB cable to the Mac.</strong>&nbsp;This can sometimes get knocked loose, especially if you have a MacBook that you move around a lot. When I use my MacBook Pro on my lap while it is charging, sometimes the Thunderbolt power adapter becomes slightly unplugged and I don&rsquo;t even realize it. If it&rsquo;s been unplugged and the battery is dead, see above.</p>\n\n\n\n<p><strong>The power adapter in the wall.</strong>&nbsp;If you&rsquo;re not using an extension cable, the weight of the MacBook power adapter could cause it to fall out of a power socket. Also, the power adapter brick can somehow get disconnected from the prong module&mdash;that happened to me recently while moving things around for the cable guy. If you have a desktop Mac, it may have become unplugged while moving your desk.</p>\n\n\n\n<p><strong>The power strip/UPS.</strong>&nbsp;If your Mac is plugged in to a power strip or UPS, check to see it hasn&rsquo;t been switched off or unplugged.</p>\n\n\n\n<p><strong>The outlet.</strong>&nbsp;Seems silly to mention this, but blackouts and blown fuses can happen, and during daylight hours you may not notice. As I write this on an unplugged MacBook Pro, the TV LED light is the only obvious and immediate indication I can find in the room that the power is on, so if the power went out, I won&rsquo;t know until I look at the TV. You could check your circuit breaker or fuse box. Also, check the power outlet itself by plugging in something else.</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/macbook-adapter.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"MacBook power adapter\" class=\"wp-image-100060908\"><figcaption><p>Modules do well to stay on the power adapter, but it is possible for it to slide out of place.</p></figcaption></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<h2 id=\"check-the-cables-and-peripherals\">Check the cables and peripherals</h2>\n\n\n\n<p>If you&rsquo;ve determined that power is available and everything is plugged in, let&rsquo;s see if we can isolate the problem. </p>\n\n\n\n<p><strong>Try a different power cable or adapter.</strong>&nbsp;Cables can get tweaked, and power adapters can be rendered useless if there was a power surge. If you don&rsquo;t have a spare, ask a friend.</p>\n\n\n\n<p><strong>Disconnect peripherals.</strong>&nbsp;It&rsquo;s possible that something attached to your Mac is disrupting the boot process. Disconnect anything that&rsquo;s not needed to run your Mac: printers, external non-boot storage, cameras, etc. (You can leave your mouse and keyboard connected, as well as the display on desktop Macs.) If you&rsquo;re using a Mac Pro, make sure the internal components are seated properly.</p>\n\n\n\n<p><strong>Plug in your MacBook and wait a few minutes.</strong>&nbsp;If you&rsquo;re trying to boot a MacBook using battery power, maybe the battery is drained. Let it charge for a few minutes, then try booting again.</p>\n\n\n\n<h2 id=\"cycle-the-power\">Cycle the power</h2>\n\n\n\n<p>You have power, and all the connections are good. You can try performing a power cycle, which essentially forces your Mac to restart the boot process. Here&rsquo;s how to do a power cycle.</p>\n\n\n\n<p><strong>MacBooks:</strong>&nbsp;Press and hold down the power button for 10 seconds. The MacBook could make a squeal, and then shut down if it&rsquo;s on. Press the power button again to turn it on.</p>\n\n\n\n<p><strong>Desktop Mac:</strong>&nbsp;Hold down the power button for 10 seconds. Then unplug the Mac for another 10 seconds before plugging it back in. Press the power button to turn it back on.</p>\n\n\n\n<h1 class=\"toc\" id=\"your-mac-turns-on-but-wont-boot\">Your Mac turns on, but won&rsquo;t boot</h1>\n\n\n\n<h2 id=\"intel-mac-only-fixes\">Intel Mac-only fixes</h2>\n\n\n\n<p>If a normal startup is unsuccessful, you need to restart in Safe Mode again and then see if you can check for any macOS and software updates, since there&rsquo;s likely an issue with the OS. If everything&rsquo;s up to date, there are a few more fixes you can try.</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/macos-startup-screen-icons.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"macOS startup screen icons\" class=\"wp-image-100060909\"><figcaption><p>If the icon on the left appears during Mac startup, it means the operating system on the startup device isn&rsquo;t compatible. The icon on the right means that the startup device has not been detected or the installed system software is no loner working.</p></figcaption></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<p><strong>Reset the NVRAM/PRAM.</strong>&nbsp;This is for Intel Macs only;&nbsp;<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://eclecticlight.co/2021/01/21/system-management-and-nvram-on-m1-macs/&amp;xcust=1-1-342272-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">NVRAM on M1 Macs</a>&nbsp;works differently and doesn&rsquo;t have an easy way for resetting. NVRAM and PRAM is used by the Mac for quick access to system settings. It&rsquo;s possible that a setting here got corrupted, so a reset may help fix things.</p>\n\n\n\n<p>To reset the NVRAM/PRAM, turn off your Mac. Then hold down Command+Option+P+R as you turn the Mac on. Keep holding down those keys until you notice that the Mac restarts and the Apple logo appears.&nbsp;</p>\n\n\n\n<p>After the Mac completes it startup, you&rsquo;ll need to go into System Preferences and make some adjustments to the sound volume, screen resolution, and other settings to your liking.</p>\n\n\n\n<p><strong>Reset the SMC.</strong>&nbsp;This is also for Intel Macs only; M1 Macs do not have system management controller (SMC). And the way to reset the SMC depends on the type of Intel Mac you have.</p>\n\n\n\n<ul><li><strong>Intel MacBooks with a T2:</strong>&nbsp;Turn off the laptop. Hold down for 7 seconds the Control and Option keys on the left side of the keyboard, and the Shift key on the right side. (The Mac may turn on.) After 7 seconds, keep those keys pressed and press and hold the power button for another 7 seconds. (The Mac may turn off.) Release the keys and then turn on the Mac is it&rsquo;s off.&nbsp;</li></ul><ul><li><strong>Intel MacBooks without a T2:&nbsp;</strong>Turn off the laptop. On the left side of the keyboard, hold down the Shift, Control, and Option keys, and then press and hold won the power button for 10 seconds. Turn on the laptop.</li></ul><ul><li><strong>Intel desktop Mac with or without a T2:</strong>&nbsp;Turn off the Mac and then unplug the power cable. After 15 seconds, plug the cable in, then wait 5 seconds. Power up the Mac.</li></ul><h2 id=\"fix-the-firmware\">Fix the firmware</h2>\n\n\n\n<p>If you&rsquo;ve followed all of the steps here and your Mac still won&rsquo;t start up, the problem could lie within the firmware. If you have another Mac, you can try connecting the two together and perform a revive or restore. We have&nbsp;<a href=\"https://www.macworld.com/article/334317/how-to-revive-or-restore-an-unresponsive-mac-from-another-mac.html\">complete instructions</a>&nbsp;for both Intel and M1 Macs in a separate article but all you&rsquo;ll need is a USB-C data cable.</p>\n\n\n\n<h2 class=\"toc\" id=\"boot-into-safe-mode\">Boot into Safe Mode</h2>\n\n\n\n<p>You&rsquo;re able to turn on your Mac. Progess! But if your Mac won&rsquo;t start up all the way, you&rsquo;ll still need to do some work to get it working.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT201262&amp;xcust=1-1-342272-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">Safe Mode</a>&nbsp;is a boot process where the Mac uses only what&rsquo;s necessary to start up&mdash;it doesn&rsquo;t load&nbsp;login items, optional system extensions, and non-macOS fonts. It also clears out system caches and checks your startup disk for problems. The method for activating Safe Mode depends on the Mac you are using:</p>\n\n\n\n<ul><li><strong>Intel-based Macs:</strong>&nbsp;Turn off the Mac. Then power it on while holding down the Shift key. You can release Shift when the login window appears (you may have to log in twice). At the login window, you should see &ldquo;Safe Boot&rdquo; in the upper right corner of the screen.</li></ul><ul><li><strong>M1-based Macs:</strong>&nbsp;Turn off the Mac. Hold down the power button for 10 seconds when you power it on, and the release the button when the startup options window appears. Select your startup disk (usually your storage device on the left), then hold down the Shift key while you click&nbsp;<em>Continue in Safe Mode</em>. You can release the Shift key when the login window appears. Log in to the Mac (you might have to do this twice).</li></ul><p>If the Mac successfully boots into Safe Mode, you can try immediately restarting the Mac again and see if it will startup normally. If it does, the problem might only be temporarily fixed. We recommend checking your login items&mdash;the apps and services that automatically launch at startup. To check your software login items, go to&nbsp;<em>System Preferences &gt; Users &amp; Groups &gt; Login Items</em>. You&rsquo;ll need to go through the process of isolating what software is problematic by unchecking items, restarting, checking an item, restarting, repeat.&nbsp;</p>\n\n\n\n<h2 class=\"toc\">Boot into <strong>macOS Recovery</strong></h2>\n\n\n\n<h3 id=\"disk-utility\">Disk Utility</h3>\n\n\n\n<p>If you&rsquo;ve reached this step, there&rsquo;s likely a fairly large problem with your Mac, but it&rsquo;s not hopeless yet. When you boot into Recovery mode you can access Disk Utility, among other things. In this situation, Disk Utility is used to repair any issues with your startup drive. Here are the instructions.</p>\n\n\n\n<ul><li><strong>Intel Macs:</strong>&nbsp;Turn off the Mac. Hold down Command+R and turn on the Mac, and keeping holding down those keys.&nbsp;</li></ul><ul><li><strong>M1 Macs:</strong>&nbsp;Turn off the Mac. Press and hold down the power button until you see your startup options, which will be your startup disk and a gear icon called Options. Click&nbsp;<em>Options</em>.</li></ul><div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/macos-big-sur-recovery-utilities.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"macOS Recovery utilities\" class=\"wp-image-100060910\"><figcaption><p>These are the main tools you can access when you boot into macOS Recovery.</p></figcaption></figure><p class=\"imageCredit\">Apple</p></div>\n\n\n\n<p>After performing the boot procedure above, the Mac will ask for a password, and after you enter it, you&rsquo;ll see a window with four options. Click&nbsp;<em>Disk Utility</em>, which will launch the Disk Utility app. Now follow these instructions to repair your startup disk.</p>\n\n\n\n<ol type=\"1\"><li>Press Command+2 to Show All Devices. The left column shows all the storage devices connected to your Mac, starting with the startup device. Underneath each device submenus for each volume the device has.</li><li>Select the last volume that appears for the startup device. Then click the First Aid button at the top. You&rsquo;ll need to confirm the task by clicking&nbsp;<em>Run</em>&nbsp;in the pop-up that appears. You&rsquo;ll also need to enter a password.</li><li>When the task is done, select the next volume above, and run First Aid again. Keep doing this up the chain until you&rsquo;ve done the whole device.</li><li>Restart your Mac.</li></ol><div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/macos-big-sur-disk-utility-first-aid.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"macOS Disk Utility\" class=\"wp-image-100060911\"></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<h3><strong>Reinstall macOS</strong></h3>\n\n\n\n<p>You&rsquo;ve reached the nuclear option, which is to reinstall macOS. Boot into macOS Recovery (as described above and select <em>Reinstall macOS</em>, which will launch the macOS installer, which will lead you through the process. It&rsquo;ll take about an hour or so, and you should be able to reinstall the Library and important bits without losing any of your data. However, if the system can&rsquo;t read your disk, you may need to erase your disk to install it.</p>\n\n\n\n<p>On M1 Macs you&rsquo;ll be using Big Sur, but Intel Macs might be a little trickier. Instead of the Command-R keystroke above, you can boot into macOS Recovery over the Internet using two methods. If you haven&rsquo;t updated the OS, use&nbsp;<strong>Shift-Option-Command-R</strong>&nbsp;during startup to use the version of macOS that came with your Mac, or the closest version still available. You can also press&nbsp;<strong>Option-Command-R</strong>&nbsp;during startup to get the latest macOS that is compatible with your Mac, assuming you&rsquo;ve been keeping up with updates.</p>\n\n\n\n<h1 class=\"toc\" id=\"call-apple-support\">Call Apple support</h1>\n\n\n\n<p>If, after all that, the Mac still won&rsquo;t complete its startup process, it&rsquo;s time to contact&nbsp;Apple support. Before you do so, note down key points of behavior the Mac exhibits while trying to startup, such as when pauses occur, when the startup stalls, any unusual things that show up on the screen, etc. This information can help Apple support diagnose your problem. You can either call, chat online, or make an appointment at an Apple retail store.</p>\n</div></body></html>","author":"Roman Loyola","siteTitle":"Apple just made its long-rumored AirTags trackers completely unnecessary","siteHash":"ff31764ad69f885eda67d1c9620083f9441c698a9d37b07ed379ca736b955089","entryHash":"1d205f26c860b7eebdd9ac92c4c9bd6e1b4de2921ad7e74b1d70f79abe66004a","category":"Apple"}