{"title":"Analyzing the Genetic Variation and Geographic Distribution Patterns of Xanthomonas citri pv. citri Strains: Significance for Developing Sustainable Control Methods in Citrus Production in Burkina Faso","link":"https://www.preprints.org/manuscript/202404.0465/v1","date":1712549865000,"content":"It is essential to have a thorough knowledge of the genetic variation among different strains of Xanthomonas citri pv. citri (Xcc), which is responsible for causing citrus bacterial canker. This understanding is important for studying the disease’s characteristics, population structure, and evolution, and ultimately for developing sustainable methods of control. A total of 48 strains, obtained from citrus production areas in Burkina Faso in 2012, 2020, and 2021, were subjected to polymerase chain reaction (PCR) tests using specific primers. The aim was to examine the distribution of type 3 effectors (T3E) and determine the geographical origins of the strains. The examination of the distribution of type 3 non-transcription activate like effectors (TALE) indicates a broader range in strains obtained in 2020 and 2021 compared to those obtained in 2012. However, all strains possess a shared set of three genes, specifically XopE2, XopN, and AvrBs2. Furthermore, all examined effectors were observed in the Bobo-Dioulasso region. Regarding the characterization of TALEs, two profiles containing two to three TALEs were discovered. Profile 1, consisting of two TALEs, was found in 37 Xcc strains, whereas Profile 2, comprising three TALEs, was detected in 11 strains. Out of the three TALEs (A, B, and C) that were identified, TALEs B and C were present in all strains. The correlation matrix indicated a positive association between the T3E content of strains and the duration of their isolation. Principal component analysis revealed a limited organization of the strains under investigation","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1d27575860cb9b904b141f0b8d2ae448ead797727b42d15e715d95d9da779193","category":"Interdisciplinary"}