{"title":"Apple Warns Amazon About Sexually Explicit Kindle Content Accessible to Children","link":"https://www.macrumors.com/2023/04/18/apple-warns-amazon-about-sexually-explicit-kindle-content-accessible-to-children/","date":1681857240000,"content":"Both Apple and Alphabet have asked Amazon to improve content moderation for its Kindle app after it was found that children could use the app to access sexually explicit images, reports <em><a href=\"https://www.reuters.com/technology/porn-amazons-kindle-app-prompts-warnings-apple-alphabet-2023-04-18/\">Reuters</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2018/03/kindle-unlimited.jpg\" alt width=\"700\" height=\"420\" />\r<br />\nAmazon's Kindle platform sells adult-oriented books that include photographs that are not suitable for children, with the content first discovered by parents who contacted <em>Reuters</em>. The parents had purchased Kindle Unlimited for their pre-teen children because it included age appropriate books that were not available on Amazon's separate Amazon Kids+ subscription service.\r<br />\n\r<br />\nKindle Unlimited also offers books with full color nude photographs, which the children were able to download for free and with no parental checks as Kindle Unlimited provides all content for one $10/month subscription price. The books are self-published through the direct publishing feature of the Kindle service, which allows authors to publish their books instantly and make them available through Kindle Unlimited.\r<br />\n\r<br />\nApple did not provide detail on its communications with Amazon, but the company told <em>Reuters</em> the following: \"We've shared these concerns with the developer and are working with them to ensure their app is compliant with our guidelines.\" Apple also changed the age rating of the Kindle app to 12 years or older from 4 years or older.\r<br />\n\r<br />\nApple's <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> guidelines do not allow apps that depict \"overtly sexual or pornographic material,\" and app developers are \"responsible for moderating the user-generated content on their platforms.\"\r<br />\n\r<br />\nGoogle too said that it had contacted Amazon and that Google Play does not allow apps that contain or promote sexual content, while Amazon said that it is \"reviewing all of the available information and taking action\" based on its findings. Amazon said it is \"committed to providing a safe shopping and reading experience\" for customers and their families.\r<br />\n\r<br />\nAt the current time, the Kindle Unlimited service does not offer parental controls, and Amazon has not yet made any changes to the Kindle app or Kindle Unlimited.<div>Tags: <a href=\"https://www.macrumors.com/guide/amazon/\">Amazon</a>, <a href=\"https://www.macrumors.com/guide/apple/\">Apple</a>, <a href=\"https://www.macrumors.com/guide/kindle/\">Kindle</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/18/apple-warns-amazon-about-sexually-explicit-kindle-content-accessible-to-children/\">Apple Warns Amazon About Sexually Explicit Kindle Content Accessible to Children</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-warns-amazon-about-sexually-explicit-kindle-content-accessible-to-children.2387167/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1d28b1746d1ca4ed5a7e2a239c1d21f5aae123b9552b2b1fe6c566cc027e4242","category":"Apple"}