{"title":"B-Cell Maturation Antigen (BCMA) as a Biomarker and Potential Treatment Target in Systemic Lupus Erythematosus","link":"https://www.preprints.org/manuscript/202409.0069/v1","date":1725267091000,"content":"The BAFF-APRIL system is crucial for the pathogenesis of systemic lupus erythematosus (SLE) by promoting B cell survival, differentiation and the maintenance of humoral autoimmunity. Here, we investigated the relationship of BCMA expression on B cell subsets with its ligands BAFF and APRIL, together with soluble BCMA, and with clinical and serologic variables in a cohort of 100 SLE patients (86 under conventional and 14 under belimumab therapy) and 30 healthy controls (HC) using multicolor flow cytometry and ELISA. We found that BCMA expression in SLE patients was significantly increased on all B cell subsets compared to HCs, with all examined components of the BAFF-APRIL system being upregulated. BCMA expression was significantly increased on switched and unswitched memory B cells compared to naïve B cells, both in HCs and SLE. BCMA expression on B cells correlated with plasmablast frequencies, serum anti-dsDNA antibodies and complement consumption, while soluble BCMA correlated with plasmablast frequency, highlighting its potential as clinical biomarker. Belimumab treatment significantly reduced BCMA expression on most B cell subsets and soluble TACI, and contributes to the inhibition of almost the entire BAFF-APRIL system and restoration of B cell homeostasis. These results provide insights into the complex dysregulation of the BAFF-APRIL system in SLE and highlight the therapeutic potential of targeting its components, particularly BCMA, in addition to its use as biomarker for disease activity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1d32fb103fa9b3275cf77d015bda8b2a09fe902778bdc265933027a7a918a8c9","category":"Interdisciplinary"}