{"title":"เว็บไซต์ Pantip เปิดการสร้างรายได้ผ่าน Google AdSense ให้กับเหล่าสมาชิก","link":"https://www.blognone.com/node/136303","date":1697703936000,"content":"<div><div><div><p>เว็บไซต์ Pantip.com ร่วมมือกับ Google นำระบบการสร้างรายได้จากโฆษณาผ่าน Google AdSense เข้ามาเชื่อมต่อกับเว็บไซต์ Pantip เพื่อให้เหล่าสมาชิกสามารถสร้างรายได้จากการตั้ง-ตอบกระทู้</p>\n<p>ผู้ใช้งาน Pantip ต้องผูกบัญชีกับ Google AdSense เข้ากับบัญชีของ Pantip หลังได้รับอนุมัติจาก Google ผู้ใช้งานสามารถเข้าไปที่หน้าตั้งค่าโปรไฟล์ กดที่เมนูใหม่ทางด้านซ้ายมือที่มีชื่อว่า ‘สร้างรายได้’ ก็จะเจอกับหน้าสร้างรายได้</p>\n<p>เมื่อผู้ใช้งานทำการตั้ง หรือ ตอบกระทู้ตามปกติ ระบบจะทำการดึงโฆษณาที่เกี่ยวข้องกับเนื้อหากระทู้นั้น ๆ ขึ้นมาแสดง แต่โฆษณาอาจจะไม่ได้ขึ้นแสดงในทุกครั้งที่ตั้ง หรือ ตอบกระทู้ แต่จะสุ่มขึ้นมาตามเงื่อนไข และความเหมาะสมของระบบ</p>\n<p>กระทู้ที่สามารถเข้าร่วมการสร้างรายได้จะเป็นกระทู้ที่ถูกตั้ง และตอบในเว็บไซต์ Pantip.com ตั้งแต่วันที่ 1 มกราคม 2556 จนถึงปัจจุบัน ดังนั้นไม่ว่าจะเป็นกระทู้ใหม่ หรือกระทู้เก่า หากเจ้าของกระทู้หรือผู้ตอบกระทู้เข้ามาเปิดใช้บริการ Google AdSense เอาไว้ และกระทู้นั้น ๆ มียอดเข้าชมหลังจากที่การสมัครรับรายได้สําเร็จ ผู้ใช้งาน Pantip ก็จะสามารถเริ่มรับส่วนแบ่งจากโฆษณาที่เกิดขึ้นได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/7c9552bd5b2fefbf24cb658335288d9e.png\" /></p>\n<p>การแบ่งรายได้จากโฆษณา จะเป็นการแบ่งกันระหว่าง Google และผู้ใช้งาน Pantip ซึ่งทาง Pantip จะไม่ได้รับส่วนแบ่งรายได้จากการโฆษณา โดยผู้ใช้งานจะมีส่วนแบ่งรายได้อยู่ที่ 68% และ Google จะได้ส่วนแบ่ง 32% ซึ่งสัดส่วนนี้อาจเปลี่ยนแปลงได้ในอนาคตตามที่ Google กำหนด</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/258167b0bd48dc43f0f0b817bd83f452.png\" /></p>\n<p>ในการแสดงโฆษณาในแต่ละครั้ง ระบบของ Google จะทำการนับยอดการแสดงผลสะสมเก็บไว้ และถูกคำนวนเป็นรายได้ เมื่อยอดสะสมครบ 100 ดอลลาร์ ผู้ใช้งาน Pantip จะสามารถเบิกถอนได้ โดยสามารถตรวจสอบยอดได้จากหน้า AdSense ของ Google</p>\n<p>ที่มา - <a href=\"https://pantip.com/topic/42281658?\">Pantip</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/pantip\">Pantip</a></div><div><a href=\"/topics/google\">Google</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1d33431ee0ec3e1d9c272bc709e64b317ab5a3cb7b1d04b03317634c14b6f86b","category":"Thai"}