{"title":"New York Times Obituary for Katie Cotton","link":"https://www.nytimes.com/2023/05/04/business/katie-cotton-dead.html?smid=nytcore-ios-share&referringSource=articleShare","date":1683334294000,"content":"\n<p>Richard Sandomir, writing for The New York Times:</p>\n\n<blockquote>\n  <p>Katie Cotton, who as Apple’s longtime communications chief guarded\nthe media’s access to Steve Jobs, the company’s visionary\nco-founder, and helped organize the introduction of many of his\nproducts, died on April 6 in Redwood City, Calif. She was 57.</p>\n\n<p>Her death, in a hospital, was confirmed by Michael Mimeles, her\nformer husband. He did not give a cause but said that she had\nexperienced complications from heart surgery she underwent a few\nyears ago.</p>\n</blockquote>\n\n<p>Not sure what took a month, but it’s a nice obituary, with quotes from Walt Mossberg, John Markoff, and other writers who covered Apple.</p>\n\n<blockquote>\n  <p>“She was formidable and tough and very protective of both Apple’s\nbrand and Steve, particularly when he got sick,” Walt Mossberg, a\nformer technology columnist for The Wall Street Journal, said in a\nphone interview, referring to Mr. Jobs’s diagnosis of pancreatic\ncancer in 2004. He added: “She was one of the few people he\ntrusted implicitly. He listened to her. She could pull him back\nfrom something he intended to do or say.” Mr. Jobs died in 2011 at\n56. [...]</p>\n\n<p>“When Steve came back, he didn’t just put key engineers in place,”\nGreg Joswiak, Apple’s senior vice president of marketing, said.\n“He put the right people in place to lead us around the company,\nand Katie was a big part of that.”</p>\n</blockquote>\n\n<p>Cotton retired from Apple almost a decade ago, but Apple’s comms still bear her mark. She built a team and a culture.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/05/nyt-obit-katie-cotton\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"1d351d41edb7eab04e929b020dc24f5ab43f2b791bfe688dd397b6e834b77743","category":"Tech"}