{"title":"Climate Effects on Ergot and Ergot Alkaloids Occurrence in Italian Wheat","link":"https://www.preprints.org/manuscript/202405.0431/v1","date":1715174672000,"content":"In recent years, there has been an intensification of weather variability worldwide as a result of climate change. Some regions have been affected by drought, while others have experienced more intense rainfall. The incidence and severity of mouldy grain and mycotoxin contamination during the growing and harvesting seasons have increased as a result of these weather conditions. Addi-tionally, torrential rains and wet conditions may cause delays in grain drying, leading to mold growth in the field. In July 2023, a wheat field in Lecco (Lombardy, Italy) was affected by torren-tial rains that led to the development of the Claviceps fungi. In the field, dark sclerotia were identi-fied on some ears. Wheat ears, kernels and sclerotia were collected and analyzed by LC-MS/MS at IZSLER, Food Chemical Department, in Bologna. The wheat ears, kernels and sclerotia were ana-lyzed for 12 ergot alkaloids (EAs) according to (EU) Regulation 2023/915 (er-gocornine/ergocorninine; ergocristine/ergocristinine; ergocryptine/ergocryptinine; ergome-trine/ergometrinine; ergosine/ergosinine; ergotamine/ergotaminine), after QuEChERS (Z-Sep/C18) purification. The analyzed sclerotia showed significant differences in total alkaloids content that varies between 0.01-0.5% (w/w), according to the results of 2017 EFSA scientific report. EAs de-tected in sclerotia were up to 4951 mg/kg, in wheat ears up to 33 mg/kg, and in kernels were 1 mg/kg. Additional mycotoxins including ochratoxin A, deoxynivalenol, zearalenone, fumonisins, T2-HT2 toxins, and aflatoxins were investigated in wheat kernels, after purification with immu-noaffinity columns (IAC). The analysis revealed the presence of deoxynivalenol in wheat kernels at a concentration of 2251 µg/kg. It is expected that climate change will increase the frequency of extreme weather events. In order to mitigate the potential risks associated with mycotox-in-producing fungi and to ensure the protection of human health, it is suggested to implement of-ficial controls in the field.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1d46a7b7c1a0a783ae3de7bc958f3862ca24d5c9e01ae73fc917c2c46682bb55","category":"Interdisciplinary"}