{"title":"Leak claims Apple’s next chip will be dedicated to the iPhone 15 Pro’s buttons","link":"https://www.macworld.com/article/1675641/iphone-15-pro-co-processor-capacitive-buttons-volume-power.html","date":1680098334000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When the iPhone 15 Pro arrives later this year, it’s expected to have buttons that aren’t actually buttons. According to numerous rumors, Apple is turning to capacitive buttons that don’t move when pressed for its next flagship phone–similar to the iPhone 7’s Home button and the trackpad on MacBooks.</p>\n\n\n\n<p>However, that presents a unique problem–what to do when the battery dies. Since the buttons need a Haptic Engine to operate, they also need power to function. A new report says Apple has developed a “new micro-processor” dedicated to the buttons.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://forums.macrumors.com/threads/capacitive-buttons-on-iphone-15-pro-models-use-a-new-micro-processor-to-manage-button-presses-and-enhanced-find-my-support-while-the-phone-is-off.2385131/&amp;xcust=1-1-1675641-1-0-0&amp;sref=https://www.macworld.com/feed\">anonymous-A.S on the MacRumors forums</a>, the new chip will handle Super Low Energy Mode tasks such as how a dead iPhone can still make Apple Pay transactions and communicate with the Find My app. Additionally, they report that the chip will also “immediately sense capacitive button presses, holds, and even detect their own version of 3D Touch with the new volume up/down button, action (currently ringer switch) button, and power button, while the phone is dead or powered down.”</p>\n\n\n\n<p>There are a few interesting rumors there. First, the mute switch is called an Action button, which implies it will have more functionality depending on the app being used, like with the <a href=\"https://www.macworld.com/article/1364168/apple-watch-ultra-review.html\">Apple Watch Ultra</a>. And they say the volume button will have 3D Touch, which they explain would work in a couple of ways: the volume will increase at a faster rate when the button is pressed harder and the volume can be controlled by swiping on the button similar to the AirPods Pro.</p>\n\n\n\n<p>Anonymous-A.S says the new chip is a “definite” for the iPhone 15 Pro but is not sure if the 3D Touch features will be available at launch. According to the latest rumors, the iPhone 15 Pro and iPhone 15 Pro Max/Ultra will use the new capacitive buttons while the iPhone 15 and iPhone 15 Plus stick with the same clickable buttons.</p>\n\n\n\n<p>Apple has created several smaller co-processors to accompany its main CPUs, including chips dedicated to motion (M), security (T), Bluetooth (H), wireless (W), and Ultra Wideband (U). The iPhone 15 Pro is also expected to introduce the <a href=\"https://www.macworld.com/article/1532925/a17-bionic-preview-benchmarks-cpu-gpu-ram.html\">A17 processor</a>,  Apple’s first 3nm chip.</p>\n\n\n\n<p>To stay up to date on the latest news ahead of the release this fall, follow our <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15</a> and <a href=\"https://www.macworld.com/article/1487037/iphone-15-ultra-design-display-camera-specs-price.html\">iPhone 15 Ultra</a> rumor guides.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1d561b0346103566d6a2c8268d08049010ecf15403616ee94795675a6bbd2322","category":"Apple"}