{"title":"Prevalence of depression and associated factors among obstetric care providers at public health facilities in the West Arsi Zone, Ethiopia: Cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304903","date":1718028000000,"content":"<p>by Solomon Seyife Alemu, Mohammedamin Hajure Jarso, Zakir Abdu Adem, Gebremeskel Mulatu Tesfaye, Yadeta Alemayehu Workneh, Wubishet Gezimu, Mustefa Adem Hussen, Aman Dule Gemeda, Sheleme Mengistu Teferi, Lema Fikadu Wedajo</p>\r\nBackground <p>Depression is a severe and treatable mental illness that significantly affects individuals’ daily activities. Obstetric care providers are the most vulnerable group for depression because they work in an emergency to save two lives at a time, share the stress of women during labor, and are at great risk for contamination.</p> Objectives <p>To assess depression and associated factors among obstetric care providers working in public health facilities.</p> Method and materials <p>A cross-sectional study was conducted among 423 obstetric care providers working in public health facilities found in the West Arsi Zone, Ethiopia, from June 1 to 30, 2023. Study participants were selected through a simple random sampling technique. A pretested, face-to-face interviewer-administered structured questionnaire was used to collect data. Bi-variable and multivariable logistic regression analyses were employed to identify factors associated with depression. The level of statistical significance was declared at P &lt; 0.05 with a 95% CI.</p> Conclusions and results <p>Overall, the prevalence of depression among obstetric care providers was 31.1% (95% CI: 26.6%, 35.5%). Marital status not in union (AOR = 2.86, 95%CI: 1.66, 4.94), working more than 40 hours per week (AOR = 2.21, 95%CI: 1.23, 3.75), current substance use (AOR = 2.73, 95%CI: 1.64, 4.56), not being satisfied with their job (AOR = 3.52, 95%CI: 2.05, 6.07) and having burnout symptoms (AOR = 5.11, 95%CI: 2.95, 8.83) were factors significantly associated with depression.</p> Recommendations <p>We recommend that health professionals take care of themselves and avoid substance use. We also recommended that stakeholders enhance job satisfaction and avoid burnout by implementing various programs, like raising wages for workers, increasing staff members, offering various benefits, and regularly monitoring issues that arise.</p>","author":"Solomon Seyife Alemu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1d66cceb28155d65d504444c23c95c8e9b34e9f1495195b1ae61a6a214dbf037","category":"Interdisciplinary"}