{"title":"207 Efficacy of sheep and goats during intensive grazing for the control of field bindweed (Convolvulus arvensis)","link":"https://academic.oup.com/jas/article/102/Supplement_3/400/7757376?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Sheep and goats prefer forbs and browse, respectively, which make them ideal for targeted grazing of weeds. However, this grazing may negatively affect sheep and goat performance. The objectives of the study were to monitor the effects of intensive grazing on sheep and goat performance and forage selection, as well as reduce <span>Convolvulus arvensis</span>. To do this, sheep [n = 40; average body weight (BW) 74 kg ± 1.45 kg] and goats (n = 40; average BW 45 kg ± 1.45 kg) grazed six paddocks, each an acre in size, on a wildlife refuge area managed by the Utah DNR near Richmond, Utah. The flock was in each paddock for 3.5 to 4 d. Paddock rotation corresponded with the amount of forage in each plot. Sixteen ground coverage measurements/day, split between morning and night, were taken. Measurements estimated percentages of ground cover, litter cover, and bare ground. Bite counts were taken at dusk and dawn to record the number of weedy forb, grass, native forb, and shrub bites. One ewe or doe was randomly observed for 5 min, then the observer would randomly select another ewe or doe until 4 does and 4 ewes were sampled. Body weights and body condition scores (BCS) of ewes and does were taken at d 0 and 22. The GLIMMIX procedure of SAS with main effects of species and days on pasture was used to analyze ground cover, bite counts, weight, and BCS with paddock as the random variable. Bare ground increased (<span>P</span> = 0.006) by day in each paddock. Both ground and litter cover decreased over time in each paddock (<span>P</span> &lt; 0.05). There was no difference (<span>P</span> &gt; 0.10) in number of bites of native forbs or grasses between sheep and goats. A species × day effect (<span>P</span> = 0.02) occurred where sheep consistently had 20 more bites of weedy forbs than goats, except for at d 12 where goats took 27 more bites of weedy forbs than sheep. Goats consumed an average of 10 bites more (<span>P</span> = 0.03) shrubs than sheep. Consumption of grasses increased (<span>P</span> = 0.006) in each pasture between d 0 and 22, but no species difference (<span>P</span> = 0.80) was observed. There was a day effect where both species lost 3.6 kg between d 0 and 22 (<span>P</span> = 0.22) which represented 5% of sheep and 8% of goat BW from the start of the trial; however, body condition score increased (<span>P</span> &lt; 0.05) by one-half a score on a 5-point scale between d 0 and 22 in both species. The results of this study indicate that sheep will graze more field bindweed than goats. Sheep and goats in this grazing system may see some losses in productivity, therefore stage of production and supplementation strategy should be considered to optimize rangeland health and minimize negative effects on animal performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1d6d5e93fe10eb712d7721e5360e2b0348a77cebcdcb0a032c49c78f161425d1","category":"Environment"}