{"title":"Arkansas House passes unconstitutional bill putting creationism in schools","link":"https://arstechnica.com/?p=1757514","date":1618602038000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/1280px-Arkansas_State_Capitol-800x321.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/1280px-Arkansas_State_Capitol.jpg\">Enlarge</a> <span>/</span> The Arkansas state capitol. (credit: <a href=\"https://en.wikipedia.org/wiki/Arkansas_State_Capitol#/media/File:Arkansas_State_Capitol.jpg\">Daniel Schwen</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Last week, the Arkansas state House of Representatives passed a bill that would amend state education law to allow teachers in public schools to teach creationism as \"a theory of how the earth came to exist.\" As it stands, the act promotes blatantly unconstitutional behavior as made clear by a precedent set in <a href=\"https://en.wikipedia.org/wiki/McLean_v._Arkansas\">a 1982 case involving the Arkansas Board of Education</a>. Despite that, the bill passed 72-21, and it already has a sponsor in the state Senate.</p>\n<p>The body of <a href=\"https://www.arkleg.state.ar.us/Bills/FTPDocument?path=%2FBills%2F2021R%2FPublic%2FHB1701.pdf\">the bill</a> is mercifully short, consisting of two sentence-long amendments to the existing Arkansas code:</p>\n<blockquote><p>A teacher of a kindergarten through grade twelve (K-12) science class at a public school or open-enrollment public charter school may teach creationism as a theory of how the earth came to exist.</p>\n<p>This section is permissive and does not require a teacher to teach creationism as a theory of the earth came to exist.</p></blockquote>\n<p>But those two sentences are enough to land teachers and their local school system in a world of trouble, in that the permission given runs afoul of a lot of legal precedent. In a key case that involved Arkansas itself,<em> <a href=\"https://en.wikipedia.org/wiki/McLean_v._Arkansas\">McLean V. Arkansas Board of Education</a></em>, a group of plaintiffs banded together to challenge a state law that mandated the teaching of \"creation science\" in public schools. The judge in that case correctly recognized that creation science was actually religious in nature, and it therefore violated the constitution's prohibition against the establishment of state religion.</p></div><p><a href=\"https://arstechnica.com/?p=1757514#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1757514&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1d6e9075b9509c8f59456635f8c42dea3c50b1dba4897ac31cbf07ed1e90ec33","category":"Tech"}