{"title":"The impact of the early COVID-19 pandemic on maternal mental health during pregnancy and postpartum","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310902","date":1726840800000,"content":"<p>by Catharina Bartmann, Theresa Kimmel, Petra Davidova, Miriam Kalok, Corina Essel, Fadia Ben Ahmed, Rhiannon V. McNeill, Tanja Wolfgang, Andreas Reif, Franz Bahlmann, Achim Wöckel, Patricia Trautmann-Villalba, Ulrike Kämmerer, Sarah Kittel-Schneider</p>\r\nPurpose <p>The aim of this study was to investigate the effects of the COVID-19 pandemic on maternal mental health during pregnancy and the postpartum period.</p> Methods <p>The impact of the COVID-19 pandemic situation during and post pregnancy was addressed on three main factors; maternal mental health, mother-child bonding, and maternal self-confidence. To do this, two different patient cohorts were compared; data from one cohort was collected pre-pandemic, and data was collected from the other cohort at the beginning of the pandemic. Questionnaires were used to collect data regarding depressive symptoms (Edinburgh Postnatal Depression Scale [EPDS]), anxiety (State Trait Anxiety Inventory [STAI]), maternal self-confidence (Lips Maternal Self-Confidence Scale [LMSCS]) and mother-child bonding (Postpartum Bonding Questionnaire [PBQ]).</p> Results <p>There were no significant differences in depressive symptoms (EPDS with an average median of 4.00–5.00) or anxiety (STAI with an average median of 29.00–33.00) between the cohorts. However, the quality of postpartum maternal bonding was higher at 3–6 months in the pandemic cohort, which was also influenced by education and the mode and number of births. The maternal self-confidence was lower in the pandemic sample, also depending on the mode of birth delivery.</p> Conclusions <p>In this study, a differential effect of the COVID-19 pandemic on mother-child bonding and maternal self-confidence was observed. The results thereby identified possible protective factors of the pandemic, which could potentially be implemented to improve maternal mental health and bonding to the child under normal circumstances.</p>","author":"Catharina Bartmann","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1d76ca89a6170e0f7c7974871d6513a410bb510a85603d6677d754d55b3bc9b8","category":"Interdisciplinary"}