{"title":"The watchOS 9.5 update might turn your Apple Watch screen green","link":"https://www.macworld.com/article/1925704/the-watchos-9-5-update-might-turn-your-apple-watch-screen-green.html","date":1684770365000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple last week released the <a href=\"https://www.macworld.com/article/1922377/webkit-security-update-ios-macos.html\">watchOS 9.5 update</a>, and while it has bug fixes and new features, it also seems to make the watch display turn green for some users. (That’s not supposed to happen, in case that’s not clear.)</p>\n\n\n\n<p>Users on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/AppleWatch/comments/13l8sux/just_upgraded_to_watchos_95_and_control_center/&amp;xcust=1-1-1925704-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Reddit</a> are complaining that after installing the update, the watch display shows a green tint instead of the usual black. There doesn’t seem to be any rhyme or reason as to what features or watches are affected; it seems to occur on older and current models, and often with Notifications and Control Center, but some users aren’t affected at all.</p>\n\n\n\n<p>Some users have been able to fix the problem by restarting the watch, but for others, a restart doesn’t change anything. Since the problem started with the watchOS 9.5 update, Apple needs to issue a true fix with another update. If you haven’t updated to watchOS 9.5, it’s probably a good idea to wait.</p>\n\n\n\n<p>The watchOS 9.5 update includes “new features, improvements, and bug fixes” according to the release notes. It also includes the new <a href=\"https://www.macworld.com/article/1814654/apple-watch-iphone-lgbtq-wallpaper-face-sport-band.html\">Pride Celebration</a> watch face that matches the new Pride Edition Sport Band, though the band it’s required to use the new watch face.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1d888bbb382b3337b09344343a9104c184e2a05617376834c65e6e94b3214585","category":"Apple"}