{"title":"Climate change reduces long‐term population benefits from no‐take marine protected areas through selective pressures on species movement","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17240?af=R","date":1711004400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d395c18d-3fe3-4022-8dbf-4c8fdc9206e9/gcb17240-toc-0001-m.png\" alt=\"Climate change reduces long-term population benefits from no-take marine protected areas through selective pressures on species movement\" />\n<p>Marine protected areas (MPAs) provide important benefits for heavily fished species but are fixed in place and threatened by climate change, leading to unexplored effects on the protected communities. We show how the evolution of species movement in protected populations leads to lower movement extents inside MPAs, which extends survival for species locally but may prevent species from moving when temperatures get too hot, thereby leaving protected populations worse off than unprotected ones.</p>\n<br />\n<h2>Abstract</h2>\n<p>Marine protected areas (MPAs) are important conservation tools that confer ecosystem benefits by removing fishing within their borders to allow stocks to rebuild. Fishing mortality outside a traditionally fixed MPA can exert selective pressure for low movement alleles, resulting in enhanced protection. While evolving to move less may be useful for conservation presently, it could be detrimental in the face of climate change for species that need to move to track their thermal optimum. Here, we build a spatially explicit simulation model to assess the impact of movement evolution in and around static MPAs resulting from both fishing mortality and temperature-dependent natural mortality on conservation benefits across five climate scenarios: (i) linear mean temperature shift, (ii) El Niño/La Niña conditions, (iii) heat waves, (iv) heatwaves with a mean temperature shift, and (v) no climate change. While movement evolution allows populations within MPAs to survive longer, we find that over time, climate change degrades the benefits by selecting for higher movement genotypes. Resulting population declines within MPAs are faster than expected based on climate mortality alone, even within the largest MPAs. Our findings suggest that while static MPAs may conserve species for a time, other strategies, such as dynamic MPA networks or assisted migration, may also be required to effectively incorporate climate change into conservation planning.</p>","author":"Alicia M. Caughman, \nSteven D. Gaines, \nDarcy Bradley","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"1d8be671b049dfc26e42e55f96b9582986dd5d25744490ced87985e2ae3836a9","category":"Environment"}