{"title":"Curcumin protects against cadmium-induced germ cell death in the testis of rats","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae082/7687418?rss=1","date":1717459200000,"content":"<span><div>Abstract</div><div>Introduction</div>Cadmium (Cd) has been shown to disrupt the reproductive system. In this study, we evaluated the protective effects of Curcumin (Cur) against Cd-induced reproductive toxicity.<div>Methods</div>Exploring the role of Cur in Cd-treated rat models.<div>Results</div>The study demonstrated that Cd treatment impaired the seminiferous epithelium, leading to increased apoptosis of germ cells. Interestingly, pretreatment with Cur ameliorated the histological damage and decreased the germ cell apoptosis induced by Cd. Furthermore, after Cd exposure, B-cell lymphoma-2 expression was significantly decreased while Bax expression was increased. Pretreatment of rats with Cur protected against germ cell apoptosis by improving the expression of B-cell lymphoma-2 and reducing Bax. Additionally, Cd treatment increased reactive oxygen species, resulting in a decrease in antioxidant enzymes. However, pretreatment of rats with Cur followed by Cd administration led to a substantial decrease in reactive oxygen species levels and increased activities of antioxidant enzymes. Ultrastructural investigations revealed that damage to the mitochondrial structure was significantly ameliorated by Cur pretreatment in Cd-treated rats. Notably, Cur significantly activated the peroxisome proliferator-activated receptor gamma coactivator 1a/Sirtuins-3 signaling pathway.<div>Conclusions</div>Overall, our data suggest that Cd induces germ cell apoptosis through mitochondrial-induced oxidative stress, but Cur pretreatment offers strong protection against Cd-induced reproductive toxicity.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"1d933d3bcf5871933782ccda26dbe57e9e865ba105d38ddd7d3d4459827fbdd6","category":"Environment"}