{"title":"La Vuelta a España 2021 Stage 1 Preview - The Battle for Red","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-stage-1-preview-the-battle-for-red","date":1628798019000,"content":"\n      <p><b></b><span>The final Grand Tour of the year has arrived. La Vuelta a España will be the final race of the season for many participants. Therefore, every team and rider lining up in Burgos will be desperate to make an impression.</span></p>\n<div></div>\n<p><span>In Tadej <span>Pogačar</span>’s absence, Olympic time trial champion </span><span>Primož Roglič </span><span>starts as the heavy pre-race favourite. However, the Ineos Grenadiers will have something to say about that with Egan Bernal, Richard Carapaz and Adam Yates present. Other GC contenders include Alex Vlasov, Hugh Carthy and Enric Mas.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-teams-2021\"><b><i>La Vuelta Teams</i></b></a></p>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VE21-Altimetriasv4-1_1024x1024.png?v=1628771661\" />Stage 1 profile</span></i></p>\n<p><span><span>The 2021 edition begins with a short time trial around Burgos, located in Northern Spain. The course is 7.1km in length, which means we’ll see early time gaps in the GC form. </span></span><span>The start and finish locations are only metres away, either side of the picturesque Burgos Cathedral.</span></p>\n<p><span>After departing, the riders head uphill immediately before embarking on the Alto del Castillo. The third category ascent is 1.2km in length and averages 7.1%. However, the stage features a couple of short, steep ramps before reaching the Alto del Castillo, making the climb doubly difficult.</span></p>\n<p><span>Next, the riders will enjoy around 1.5km of descending, where they must recuperate the energy required to go full gas in the following 3km.</span></p>\n<p><span>The final 3km are completely flat with no undulations in gradient. This section of the course isn’t particularly technical, but a roundabout with 1.5km remaining must be navigated carefully. A couple of right-hand turns follow, before the final left-hand corner occurs with around 600 metres remaining. This is almost acute enough to be termed a hairpin, so the riders must scrub off the speed carefully, before stamping on the pedals and emptying the tank before they reach the finish line.</span></p>\n<h4><b>Contenders</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1282159444-min_a81c921c-feb8-4691-a3d2-73c3021fd354_1024x1024.jpg?v=1628771168\" />Defending champion <span>Primož Roglič is the pre-stage favourite </span>(Image credit: Justin Setterfield/Getty Images)</span></i></p>\n<p><span><span>The red jersey is up for grabs for the quickest rider to reach the finish. Although the stage will produce minor time gaps in the battle for red, they are unlikely to be decisive in the final classification.</span></span></p>\n<p><span>After winning the Olympic time trial in sumptuous style, <strong>Primož Roglič</strong> enters the first stage as the major favourite. <span>Roglič</span><span> </span>has won La Vuelta a España two years in a row, which are the only occasions he has started the race. </span><span>He has participated in two individual time trials at La Vuelta over that period and won both of them. Those victories took place over much longer distances, but there is nothing to suggest that <span>Roglič</span><span> </span>will struggle on the shorter 7km test. It will take a special performance from another rider to deny <span>Roglič the inaugural red jersey.</span><span></span></span></p>\n<p><span><strong>Maxi Schachmann</strong> of Bora-Hansgrohe could lead the outsiders. The German has excelled in time-trials before — he was second in a 15km time trial at Paris-Nice last season. The hills in the first half of the course won’t deter Schachmann either. <strong>Felix </strong></span><span><strong>Großschartner</strong> is another Bora rider that could perform well. He finished <span>19th in the TT last season on his way to ninth</span></span><span> in the general classification.</span></p>\n<p><span>The Ineos Grenadiers will be keen to get their race off to a positive start. The British outfit entered the Tour de France with a variety of GC options, but after multiple crashes and incidents in the first week, they were solely reliant on <strong>Richard Carapaz</strong>. Keeping their GC options open beyond the first week can only be beneficial. </span>However, Giro champ <strong>Egan Bernal</strong> enters as their most likely leader, so minimising<span> his early time loss to </span><span>Roglič</span><span> </span>is crucial. <strong>Tom Pidcock </strong>embarks on his first Grand Tour. This will be his first time trial for the Grenadiers.</p>\n<p><span><strong>Alex Vlasov</strong> has decided to ditch Astana - Premier Tech for Bora-Hansgrohe next season, but not before he leads Astana in one final Grand Tour. At the Giro earlier this year, where Vlasov finished fourth, he demonstrated that he is very capable on the time trial bike. He finished 11th in the opening time trial which took place on a course similar in length</span><span> to the opener here. Astana also enter with <strong>Ion Izagirre</strong> and <strong>Luis León Sánchez</strong> who can time trial well.</span></p>\n<p><span>Deceuninck - Quick Step’s <strong>Josef Černý</strong> is a La Vuelta debutant. The Czech time trial champion won his national time trial for the third occasion in four years in June. He finished in the top six in all three time trials at the Giro d’Italia last season, too. If he’s in form, Černý could finish in the top five here. </span></p>\n<p><span><strong>Hugh Carthy</strong> will lead <span>EF Education - Nippo's</span> GC charge — the Brit finished on the podium last year, and EF will hope he can replicate that performance. However, their best shot at a positive time trial result is with <strong>Magnus Cort</strong>. The Dane won a reduced sprint at the Vuelta last year. However, he is an improved time trialist this season — he was 12th and 9th in the two time trials at the Tour de France.</span></p>\n<p><span>Other riders with a chance include <strong>Jan Tratnik, Michael Matthews </strong>and<strong> Nelson Oliveira.</strong></span></p>\n<h4><b>Prediction</b></h4>\n<p><span>It’s very difficult to look past <span>Primož Roglič</span>. The reigning Vuelta a España champion has won every Vuelta individual time trial he's entered. He arrives after a sublime performance at the Tokyo Olympics, where he defeated all of his rivals by at least one minute. His winning margin won’t be that large over 7.1km, but barring any incidents, <span>Primož Roglič</span> is our pick to win stage 1 of the 2021 Vuelta a España.</span></p>\n<p><em><span>Cover image: David Ramos/Getty Images</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1d97081432bfaa5aca6854b7b87cb8bb070c0fef257059e27a1b3b199eb41b48","category":"Cycling"}