{"title":"A Week with the LeMond Prolog e-Assist Bike – Two Bikes Knoxville","link":"https://theradavist.com/2021/10/a-week-with-the-lemond-prolog/?utm_source=rss&utm_medium=rss&utm_campaign=a-week-with-the-lemond-prolog","date":1635508834000,"content":"<p>How I ended up writing this review of the <a href=\"https://lemond.com/prolog\" target=\"_blank\">LeMond Prolog</a> is a bit surreal. </p>\n<p>I’ve lived in Knoxville, Tennessee for the past ten years, where I’ve managed to carve out a career in the nonprofit bike space at <a href=\"https://www.twobikes.org/\" target=\"_blank\">Two Bikes Knoxville</a>. About a year ago, my pal Matt Zingg and I started a nonprofit bike shop called Two Bikes, which has kept us pretty busy. I still get out on rides a few times a week, but my cycling is largely practical these days. I ride to work, to get groceries, to go to the community garden.</p>\n<p>I mention this because whenever I read a review I always want to understand the perspective of the author. I’m really passionate about bringing folks together to have fun outside and about resolving the inefficacy of America’s transportation system. Bikes tick both of those boxes for me, so I really like bikes.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/LeMond_Prolog-07.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Around 2016, there were rumors that Greg LeMond, the three-time Tour de France winner, was moving to Knoxville. Then, sometime in 2020, I saw some photos of an electric bike his company was developing. Greg LeMond was developing a carbon <a href=\"https://lemond.com/prolog\" target=\"_blank\">e-assist commuter bike</a>? I was interested.</p>\n<p><em>I tried to get a meeting. I did not get the meeting.</em></p>\n<p>But if you live in Knoxville long enough, you end up meeting someone who knows someone. In this instance, my friend Kate knew Kepler, who worked at LeMond. We chatted on the phone once, and a few months later Kepler texted me that LeMond was hosting some sort of ribbon cutting and Greg would be there.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/LeMond_Prolog-09.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/10/LeMond_Prolog-08.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We weren’t invited per se, but we also weren’t <em>not</em> invited. We put on our Two Bikes aprons, Matt got his Greg LeMond coffee table book, and we were on our way.</p>\n<p>When we arrived we were kind of awkward. We didn’t know many folks there and did our best to look relaxed. Perhaps noticing that we were, in fact, not that relaxed, a very kind woman approached us and asked about our shop aprons. Matt and I told her about Two Bikes, and she loved it. “You’ve got to tell Greg!” She was Kathy LeMond.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/LeMond_Prolog-14.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Matt and I spent the next two hours mesmerized by the kindness of Kathy and Greg LeMond. They introduced us to their Creative Director, Brandon, who had seen our video from Pickett Memorial State Park. He asked if we would be interested in producing something like that for their new electric bike, the Prolog.</p>\n<p>And that’s how we found ourselves in this position – with a <strong>26-pound</strong> Di2 electric bike that belongs to Greg LeMond’s cycling company.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/LeMond_Prolog-13.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The bike looks good. With matte-white paint, integrated lighting, and a carbon bar/stem combo, it would be an incredible-looking bike without an e-assist. The fact that it looks this good and has a battery and motor is kind of mind-blowing. The bike feels like it was designed by Steve Jobs if Steve Jobs had worked in the cycling industry.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/LeMond_Prolog-05.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I wanted the pink one. The Prolog is offered in three colors, white, black, and pink. The pink is based on the colors of the Giro d’Italia, which is a nice tip of the hat to cycling historians, but nothing on the bike feels historical. It’s the first electric bike I’ve ridden that feels natural. The bike kind of disappears beneath you as you commute to work or ride to the coffee shop.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/LeMond_Prolog-06.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The bike comes with a GRX groupset, which I think is a great choice. The 11-speed drivetrain had plenty of range for steep climbs and fast descents. The brakes also did the trick, stopping the bike with ease. I felt comfortable one-finger breaking even on the highest mode of pedal assist.</p>\n<div></div>\n<p> </p>\n<p>The bike relies on the <a href=\"https://www.mahle.com/en/products-and-services/emobility/e-bike/\" target=\"_blank\">Mahle X35+</a> for the e-assist. It hides within the rear hub and frame and is pretty stealthy. It maxes out at 20 miles an hour, has a range of 45 miles, and weighs just shy of 8 pounds. My only complaint with the Mahle system is the user interface. The whole system (e-assist and lights) relies on one button, and it took me a little while to figure out how to cycle through the e-assist levels and light settings. With that said, the minimal design makes it easy to forget you’re even riding an electric bike.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/LeMond_Prolog-04.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I enjoyed riding the bike for the past week, and I’ll be sad to give it back to the folks at LeMond. When I picked the bike up, I thought I knew what I would say: “A really cool electric bike, but it wouldn’t change my riding habits.” But that’s not totally true.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/LeMond_Prolog-02.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>When my friend Brad invited me over to his house after work, I didn’t think twice about commuting there on the Prolog (it’s about 20 miles round-trip), and I have to admit that I probably would have driven otherwise. I think bikes like the Prolog are a part of solving America’s car problem, and it certainly helps that the Prolog looks so good – and is so fun to ride – in the process.</p>\n<p>See more at <a href=\"https://lemond.com/prolog\" target=\"_blank\">LeMond</a>.</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"1d9f58da620366d8bc7f22698491573ce807116eededfe02f124c5216a40914e","category":"Cycling"}