{"title":"262 Why are some cows skinny? An evaluation of stress and immune factors","link":"https://academic.oup.com/jas/article/102/Supplement_3/88/7757126?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>For the mature cow with low body condition scores (BCS), being too thin can accompany health issues, reduced pregnancy rates, more days to rebreeding, and decreased milk production resulting in lighter calves at weaning. In addition, reduced fat insulation in low BCS cows during the winter equates to additional feed requirements for warmth. The hypothesis of this study was that stress and immune factors contribute to low BCS in mature cows. The objective of this study was to determine whether there were differences in hematology parameters, hair cortisol concentrations, and plasma cytokine concentrations among animals with low body condition (BCS ≤ 4). Over a 3 yr study, we collected 62 pairs of cows which included cows with a BCS ≤ 4, and a matched control animal born in the same year with the same or similar breed composition from the same population of animals with a BCS of 5 or higher. Hematology parameters, cytokine concentration, and cortisol concentrations were analyzed using a model with BCS classification and sample year as fixed effects and age in years as a covariate. Hemoglobin, hematocrit, red blood cell and mean platelet volume were all less among the low BCS cows, and neutrophil count was greater (<span>P</span> &lt; 0.05). Platelet, monocyte counts, mean corpuscular volume, and mean corpuscular hemoglobin tended to be greater in low BCS cows (0.05 &lt; <span>P</span> ≤ 0.1), and lymphocyte count tended to be less. Hair cortisol concentrations, a longer-term measure of cortisol, tended to be greater in low BCS cows (<span>P</span> = 0.09). None of the 15 cytokines tested differed with BCS. The combination of reduced RBC parameters with greater neutrophils suggests that low BCS cows were responding to or were the reflection of some type of chronic stressor, such as a subclinical disease state or a physiologic stressor. This was also supported by the tendency for greater cortisol concentrations in low BCS cows. USDA is an equal opportunity provider and employer.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1da22361adcf9fd9d54830cd2daec19d7fde946fdedfe995960d7b03e3027d71","category":"Environment"}