{"title":"Stare into the abyss of a swirling black hole with this LED monolith installation","link":"https://arstechnica.com/?p=1816801","date":1638317837000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/jesse1-CROP-800x532.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/jesse1-CROP.jpg\">Enlarge</a> <span>/</span> Screengrab of Jesse Woolston's latest piece, <em>The Dynamics of Flow</em>, debuting at Art Basel Miami Beach later this week. (credit: Jesse Woolston)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Multimedia artist, composer, and sound designer <a href=\"https://twitter.com/jessewoolston\">Jesse Woolston</a> has had a recurring dream for much of his life about encountering a black hole, \"falling inward, and waking up terrified.\" (Who wouldn't wake up terrified?) According to the artist, those dreams have always been a reminder to him of \"nature's terrifying awe.\" Now, Woolston has channeled that emotional experience into a new multimedia installation, <em>The Dynamics of Flow</em>—part of an LED monolith exhibit debuting later this week at Art Basel Miami Beach. Bonus: it's also <a href=\"https://arstechnica.com/gaming/2021/03/ars-technicas-non-fungible-guide-to-nfts/\">an NFT</a>.</p>\n<div><blockquote><p>My second <a href=\"https://twitter.com/hashtag/NFT?src=hash&amp;ref_src=twsrc%5Etfw\">#NFT</a>, released on the 28th, will be part of an LED monolith installation built for the week of Art Basel.<br /><br />Throughout my life, I've had the same dream, being confronted with a blackhole and falling inward. This installation and NFT communicates my experience. <img src=\"https://s.w.org/images/core/emoji/11/72x72/1f5a4.png\" /> <a href=\"https://t.co/Kw93btpXhq\">pic.twitter.com/Kw93btpXhq</a></p>— Jesse Woolston (@jessewoolston) <a href=\"https://twitter.com/jessewoolston/status/1464652962320445443?ref_src=twsrc%5Etfw\">November 27, 2021</a></blockquote></div>\n<p>Woolston has long merged his artistic work with his love of science, aiming to \"recontextualize\" physics and art both visually and with sound/music. \"I see scientists almost as magicians who are fantastic at understanding the world,\" he told Ars. \"I consider myself someone who loves to communicate the laws of the universe and what it means to be human.\" He's worked with astrophysicists at Cornell University who hunt for exoplanets, for instance, and wrote the music for a theatrical dance performance inspired by Washington State University research on glacier dynamics in Greenland. In recent years, his focus has been on building large installations that combine sound and visuals in interesting ways.</p>\n<p>A couple of years ago, Woolston created an art installation for the Museum of the Moving Image in New York City with Levi Patel that made use of haptics technology. The tech is called Music: Not Impossible (M:NI), and I <a href=\"https://arstechnica.com/gaming/2018/11/new-wearable-tech-lets-users-listen-to-live-music-through-their-skin/\">wrote about it</a> in 2018. M:NI is designed to provide deaf and hearing users alike with a \"vibrotactile\" concert experience.</p></div><p><a href=\"https://arstechnica.com/?p=1816801#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1816801&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1da38f3b99e2d507f6ab2cf76e3a45f8b09e81e63ce156f7bf46fb0790117965","category":"Tech"}