{"title":"Effects of Sophora flavescens dietary supplementation on the growth performance, haematological indices, and intestinal bacterial community of Oreochromis niloticus","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15919?af=R","date":1726100092000,"content":"<h2>Abstract</h2>\n<p><i>Sophora flavescens</i> is considered to be of various medicinal and economic importance. Previous studies have shown that it has antibacterial, antioxidant, and immune-enhancing functions. To explore the full potential of <i>S. flavescens</i> in fish feed development, we investigated the effects of different levels of <i>S. flavescens</i> added to the diet on the growth performance, haematological indices, and the intestinal bacterial community of Nile tilapia (<i>Oreochromis niloticus</i>). The feeding trial lasted for 56 days, and the initial weight of the fish was 40.00 ± 5.00 g. Nile tilapia were randomly divided into six groups: a control group (CN) and five <i>S. flavescens</i> supplementation groups (0.02%, 0.04%, 0.08%, 0.16%, and 0.3% [w/w] of <i>S. flavescens</i> in diet). The growth performance of fish increased first and then decreased with the increase of <i>S. flavescens</i> supplemental level. Compared with other experimental groups, the growth performance of fish supplemented with 0.08% <i>S. flavescens</i> was significantly improved (<i>p</i> &lt; 0.05). Haematological indices exhibited that erythrocyte (RBC), along with leucocyte (WBC) indices, exhibited a secondary trend of increasing and then decreasing with the increase of <i>S. flavescens</i>, reaching the highest level at 0.08% (<i>p</i> &lt; 0.05). However, mean corpuscular volume (MCV), mean corpuscular haemoglobin (MCH), and mean corpuscular haemoglobin concentration (MCHC) exhibited a secondary trend of first decreasing and then increasing with the increase of <i>S. flavescens</i> and reached the lowest value at 0.08% (<i>p</i> &lt; 0.05). Compared with the CN, alkaline phosphatase (AKP) significantly decreased and changed when the additional amount of <i>S. flavescens</i> was 0.04% in each treatment group (<i>p</i> &lt; 0.05). In another way, the gut microbial profiles revealed that <i>Bacteroides</i> dominated the gut communities, and compared with the control group, two uncultured bacteria were suppressed. In addition, when the supplemental level of <i>S. flavescens</i> was more significant than 0.04%, the proliferation of <i>Arcobacter cryaerophilus</i>, <i>Solibacillus silvestris</i>, and <i>Escherichia</i> sp. in the gut of Nile tilapia was promoted. The results revealed that <i>S. flavescens</i>, as an additive to the Nile tilapia diet with levels ranging from 0.04% to 0.08%, can enhance the growth performance and immunity and promote the proliferation of intestinal beneficial bacteria of Nile tilapia.</p>","author":"Xin Lu, \nYingrui Wu, \nYinhui Peng, \nWenjie Liu, \nMing Liu, \nPeng Xu, \nKianann Tan, \nXueying Liang, \nXiaohui Cai, \nQingfang Gong","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"1dbdf52ee8a42d204652370cfb02905a21abe991e4522c6debe073206b9ac94a","category":"Environment"}