{"title":"When Infection Lurks Behind Malignancy: A Unique Case of Primary Bone Lymphoma Mimicking Infectious Process in the Spine","link":"https://www.preprints.org/manuscript/202406.1574/v1","date":1719224161000,"content":"Primary bone lymphoma of the spine (PBL) is a rare entity and the most shared type of non-Hodgkin lymphoma (LNH) appearing in bone lesions deprived of nodal or extra-nodal in-volvement and accounting for approximately 2% of all lymphomas. Most PBL are diffuse large B-cell lymphomas (DLBCL) and commonly involve the appendicular skeleton. Due to its atypical location and non-specific clinical imaging features mimicking certain neoplastic or infectious processes, this pathology may be misdiagnosed, thus complicating and delaying diagnosis. Our case reports a patient in her sixties who had been suffering from chronic low back pain for a year, and had gradually started to develop cruralgia and fever. She underwent a blood sample, magnetic resonance imaging (MRI), and positron emission tomography (18F-FDG-PET/CT) which revealed significant inflammatory syndrome, a pattern of spondylodiscitis at the L3-L4 level associated with morphological and metabolic invasion extending posteriorly, raising suspicion of epiduritis. No other lesions were found on the rest of the body. Neurosurgical management was performed and a biopsy was made. Histological results showed aggressive and diffuse large B-cell lymphoma, suggesting a diagnosis of PBL. This case highlights the first case of spondylodiscitis mimicking PBL in the lumbar spine, the intricacies of the diagnostic work-up, and the complexity of discriminating with an infectious process in the spine, as both have a similar, non-specific clinical presentation with different prognosis and therapeutic management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1dc95b54899f058addbe525216c0a438744550887703b30e236e10c4fca844ce","category":"Interdisciplinary"}