{"title":"USA Cycling names road, mountain bike, and track Olympic teams for Tokyo","link":"https://cyclingtips.com/2021/06/usa-cycling-names-road-mountain-bike-and-track-olympic-teams-for-tokyo/","date":1623344556000,"content":"<h2>Men’s Road Team</h2>\n\n\n\n<p><strong>Lawson Craddock </strong>and <strong>Brandon McNulty </strong>have been named to the USA’s Olympic team. The two will compete in both the road race and the time trial in Tokyo. </p>\n\n\n\n<p>Craddock, who races for EF Education First-Nippo on the road, has been aggressively chasing a big victory for the last couple of years. Recently, he went for multiple long-range attacks at the Critérium du Dauphiné but was unable to pull off a stage win. Craddock’s active style will come in handy on the challenging road course where it will be every man for themselves. </p>\n\n\n\n<p>McNulty has been one of the USA’s most impressive young talents for a few years. He jumped from team Rally to the World Tour with UAE-Team Emirates for the 2020 season. In his first full year in Europe McNulty finished third in the ITT and second on stage 10 of the Giro d’Italia. So far this season he has finished second in the opening ITT and third on stage 4 of the Itzulia Basque Country, third in the youth competition at the Volta Ciclista a Catalunya, and fourth in the ITT at Paris-Nice. McNulty will race the Tour de France before setting off to Tokyo for the Olympic Games.</p>\n\n\n\n<p><a href=\"https://cyclingtips.com/2021/06/usa-cycling-announces-womens-road-tokyo-olympic-team/\" target=\"_blank\">Ruth Winder, Chloe Dygert, Coryn Rivera, Amber Neben, and Leah Thomas</a> will represent the women in Tokyo. </p>\n\n\n\n<h2>Track Team</h2>\n\n\n\n<p><strong>Adrian Hegyvary</strong> and <strong>Gavin Hoover</strong> will compete in the Madison event on the track, with Hoover also racing the Omnium. </p>\n\n\n\n<p>For the women, <strong>Chloe Dygert</strong>,<strong> Megan Jastrab</strong>,<strong> Jennifer Valente</strong>, <strong>Emma White </strong>and <strong>Lily Williams</strong> will race the Team Pursuit. The four will be hungry for gold after the USA Team Pursuit team took home silver medals in the last two Olympic Games. </p>\n\n\n\n<p>Valente will have a full schedule at the Games. Along with the Team Pursuit, she will race the Madison with Jastrab as well as the Omnium. </p>\n\n\n\n<p><strong>Maddie Godby</strong> is the final track cyclist named to the team and will compete in the Keirin and Sprint events. </p>\n\n\n\n<h2>Mountain Bike Team</h2>\n\n\n\n<p>On the dirt side of cycling, <strong>Christopher Blevins</strong> will race the men’s cross country event with <strong>Haley Batten</strong>, <strong>Kate Courtney</strong>, and <strong>Chloe Woodruff</strong> racing the women’s.</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/06/usa-cycling-names-road-mountain-bike-and-track-olympic-teams-for-tokyo/\">USA Cycling names road, mountain bike, and track Olympic teams for Tokyo</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1dd0bd68e711206f223c313fd1be7253905e6cee7ef4fac89ee2e6d23448c551","category":"Cycling"}