{"title":"Development of a rapid detection assay for acetolactate synthase inhibitors resistance in three Amaranthus weed species through loop‐mediated isothermal amplification","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13385?af=R","date":1708933449000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The early detection of herbicide resistance in weeds is a key factor to avoid herbicide waste and improve agriculture sustainability. The present study aimed to develop and validate an allele-specific loop-mediated isothermal amplification (AS-LAMP) assay for the quick on-site detection of the resistance-endowing point mutation Trp-574-Leu in the acetolactate synthase (<i>ALS</i>) gene in three widely diffused <i>Amaranthus</i> weed species: <i>Amaranthus retroflexus</i>, <i>Amaranthus hybridus</i> and <i>Amaranthus tuberculatus</i>.</p>\n<h2>RESULTS</h2>\n<p>The AS-LAMP protocol was developed on wild-type and <i>ALS</i>-mutant plants of the three species and revealed that the amplification approach with only the primer set specific for the mutant allele (574-Leu) was the most promising. The validation and estimation of the AS-LAMP performance evaluated by comparing the results with those of the molecular marker (cleaved amplified polymorphic sequences) indicated that, although the sensitivity and specificity were relatively high in all species (overall 100 and &gt; 65%, respectively), precision was high for <i>A. hybridus</i> L. and <i>A. retroflexus</i> L. (75 and 79%, respectively), but quite low for <i>A. tuberculatus</i> (Moq.) J. D. Sauer (59%). The LAMP assay was also effective on crude genomic DNA extraction, allowing the quick detection of mutant plants in field situation (on site resistance detection).</p>\n<h2>CONCLUSION</h2>\n<p>The proposed AS-LAMP method has proven to be a promising technique for rapid detection of resistance as a result of Trp-574-Leu on the two monoecious weedy <i>Amaranthus</i> species but resulted less effective in the genetically variable dioecious species <i>A</i>. <i>tuberculatus</i>. © 2024 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Andrea Milani, \nSilvia Panozzo, \nTommasini Maria Grazia, \nLaura Scarabel","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"1dd7fdea2626c556a9cb5a9084d66bfa9c29e73a604a55de5354c22db9a9ea26","category":"Environment"}