{"title":"Zika Virus in Extracellular Vesicles: Insights from Integrated Proteomic and Metabolomic Dependent Regulation of B Cell and PI3K/AKT/mTOR Signaling Pathway","link":"https://www.preprints.org/manuscript/202408.0754/v1","date":1723431170000,"content":"Background; Cell-released extracellular vesicles (EVs) acting as 'metabolically and proteolytically active machines,' show potential in metabolomic and proteomic analysis of serum EVs. Despite diverse challenges, post-isolation omics characterization EVs offers crucial insights for effective analysis; (2) Methods: The research, involved children with Congenital Zika Syndrome, utilizing mass spectrometry for proteomics and GC-MS for metabolite identification. Vesicles were isolated using Izon qEV columns, quantified, and characterized by NTA and TEM. Data analysis employed Cytoescape/String and MetaboAnalyst, revealing variations in metabolic and proteomic profiles among groups through PCA and volcano plots. Proteins and Metabolite set enrichment analysis provided biologically meaningful patterns to enriched metabolites; (3) Results: Using molecular exclusion chromatography, the EVs were characterized, revealing size variations. Protein analysis identified 13 significantly altered proteins, including upregulated (e.g., AOM8Q6 - IGLC7) and downregulated (e.g., Q8TD86 - CALML6) ones. Metabolite analysis indicated involvement in the PI3K-AKT-mTOR pathway and suggested a role in Angiotensin inhibition in CZS+. Upstream of mTOR, Akt is the central signaling molecule in the PI3K pathway and plays critical roles in brain development as well as synaptic plasticity important for Zika Virus. The study provides insights into molecular mechanisms associated with CZS; (4) Conclusions: The study pinpointed valuable possible biomarkers, specifically proteins and metabolites, in Zika virus (ZIKV) infection. It stresses the necessity for broader investigations with advanced techniques to uncover molecular targets, potentially advancing pharmacological strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1ddff8ccf707a658cc91f7eaff1e28e34165b992798e1f6be144d2022ffaa043","category":"Interdisciplinary"}