{"title":"Abiotic legacies mediate plant–soil feedback during early vegetation succession on rare earth element mine tailings","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14572?af=R","date":1709702618000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/30128667-e29e-42f1-8ca1-18961c890553/jpe14572-toc-0001-m.png\" alt=\"Abiotic legacies mediate plant–soil feedback during early vegetation succession on rare earth element mine tailings\" />\n<p>Our study shows that early succession on contaminated rare earth element mine tailings may lead to more positive plant–soil feedback than predicted based on results of non-contaminated soils, mainly due to the alleviation of abiotic stress in tailings. Therefore, the improvement of specific abiotic soil stress and the trait-based selection of acquisitive plants should be preferentially considered to promote the primary restoration of degraded land.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAn increasing number of studies have shown how feedback interactions between plants and soil can influence primary and secondary succession. However, very little is known about the patterns and mechanisms of such plant–soil feedbacks on stressed mine tailings ecosystem, which can be severely contaminated by a range of toxic elements.\n\nIn a two-phase plant–soil feedback experiment based on the rare earth element (REE) mine tailing soil, we investigated biotic (changes in bacterial and fungal communities) and abiotic (changes in chemical properties) legacies of three pioneer grass species, and examined feedback effects of three grasses, two legumes and two woody plants with different root traits.\n\nPositive plant–soil feedbacks were found in <i>Miscanthus sinensis</i>, <i>Paspalum thunbergii</i> and <i>Tephrosia candida</i>, and neutral feedbacks were observed in the other four plants. These effects corresponded with an increase in nutrients and total organic carbon, as well as a decrease in acidity and extractable aluminium and REEs. There were less signs of biotic changes in the conditioned tailings.\n\nThe correlation analysis suggested a relationship between plants' responses to soil legacies and root traits, as well as root economics spectrum. On the mine tailings, acquisitive species with higher specific root length appeared to have greater potential for positive feedback.\n\n<i>Synthesis and application.</i> Our study shows that early succession on contaminated rare earth element mine tailings may lead to more positive plant–soil feedback than predicted based on results of non-contaminated soils, mainly due to the alleviation of abiotic stress in tailings. Therefore, the improvement of specific abiotic soil stress and the trait-based selection of acquisitive plants should be preferentially considered to promote the primary restoration of degraded land.\n</p>\n<h2>摘要</h2>\n<p>\n\n越来越多的研究揭示了植物和土壤之间的反馈相互作用如何影响原生和次生演替。然而, 在受到一系列有毒元素严重污染的胁迫尾矿生态系统中, 人们对植物-土壤反馈的模式和机制还知之甚少。\n\n基于稀土(rare earth element, REE)尾矿土壤, 我们开展了双阶段植物-土壤反馈实验。我们研究了三种耐性先锋草本植物的土壤生物(细菌和真菌群落的变化)和非生物遗留产物(化学性质的变化), 并探究了后续具有不同根系性状的三种草本植物、两种豆科植物和两种木本植物的生长反馈效应。\n\n植物-土壤反馈效应结果表明, 芒草、雀稗和山毛豆为正反馈, 其他4种植物为中性反馈。这些效应与土壤营养元素和总有机碳的增加以及酸度、可提取态铝和稀土元素的减少相对应。但经过草本调节后的尾矿土壤中生物群落的变化较少。\n\n相关性分析表明, 植物对土壤遗产的生长响应与根系性状和经济策略之间存在相关关系。在尾矿中, 具有较高比根长的获取型植物似乎具有更大的正反馈潜力。\n\n综合与应用。我们的研究表明, 受污染的稀土矿尾矿的早期演替可能会呈现更正向的植物-土壤反馈(若根据以往未受污染土壤中的研究结果预测, 演替早期的植物往往是呈现负反馈), 而这主要是由于尾矿中非生物土壤胁迫得到耐性先锋植物的缓解。因此, 为了促进退化尾矿地的早期生态恢复, 应优先考虑改善特定的非生物土壤胁迫以及基于性状选择获取策略的植物。\n</p>","author":"Shi‐Chen Zhu, \nWen‐Shen Liu, \nZi‐Wu Chen, \nXiao‐Rui Liu, \nHong‐Xiang Zheng, \nBo‐Yu Chen, \nXin‐Yu Zhi, \nYuanqing Chao, \nRong‐Liang Qiu, \nChengjin Chu, \nChong Liu, \nJean Louis Morel, \nAntony van der Ent, \nYe‐Tao Tang","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"1ded5b0c6ea1bd707a59b31b0cc6aeaad618c193fa09336659de11d47349e072","category":"Environment"}