{"title":"Mycorrhizal associations of temperate forest seedlings mediate rhizodeposition, but not soil carbon storage, under elevated nitrogen availability","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17446?af=R","date":1723014000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/67d77cc1-4fa2-4009-97a9-c33a629caa03/gcb17446-toc-0001-m.png\" alt=\"Mycorrhizal associations of temperate forest seedlings mediate rhizodeposition, but not soil carbon storage, under elevated nitrogen availability\" />\n<p>Seedlings added carbon belowground in the form of sugars, and the seedling mycorrhizal association mediated how seedling inorganic nitrogen uptake affected this carbon allocation. However, the soil carbon from the start of the experiment was not affected by seedling mycorrhizal association, and instead experienced a loss when roots were present.</p>\n<br />\n<h2>Abstract</h2>\n<p>Tree-mycorrhizal associations are associated with patterns in nitrogen (N) availability and soil organic matter storage; however, we still lack a mechanistic understanding of what tree and fungal traits drive these patterns and how they will respond to global changes in soil N availability. To address this knowledge gap, we investigated how arbuscular mycorrhizal (AM)- and ectomycorrhizal (EcM)-associated seedlings alter rhizodeposition in response to increased seedling inorganic N acquisition. We grew four species each of EcM and AM seedlings from forests of the eastern United States in a continuously <sup>13</sup>C-labeled atmosphere within an environmentally controlled chamber and subjected to three levels of <sup>15</sup>N-labeled fertilizer. We traced seedling <sup>15</sup>N uptake from, and <sup>13</sup>C-labeled inputs (net rhizodeposition) into, root-excluded or -included soil over a 5-month growing season. N uptake by seedlings was positively related to rhizodeposition for EcM- but not AM-associated seedlings in root-included soils. Despite this contrast in rhizodeposition, there was no difference in soil C storage between mycorrhizal types over the course of the experiment. Instead root-inclusive soils lost C, while root-exclusive soils gained C. Our findings suggest that mycorrhizal associations mediate tree belowground C investment in response to inorganic N availability, but these differences do not affect C storage. Continued soil warming and N deposition under global change will increase soil inorganic N availability and our seedling results indicate this could lead to greater belowground C investment by EcM-associated trees. This potential for less efficient N uptake by EcM-trees could contribute to AM-tree success and a shift toward more AM-dominated temperate forests.</p>","author":"Amelia A. Fitch, \nSarah B. Goldsmith, \nRichard A. Lankau, \nNina Wurzburger, \nZachary D. Shortt, \nAugustos Vrattos, \nElla N. Laurent, \nCaitlin E. Hicks Pries","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"1def7c77c8a6eca2c2a8741e2ef7c93a0655e2dc89174ffcdfb4b86e165aea2c","category":"Environment"}