{"title":"Captive birds exhibit greater foraging efficiency and vigilance after anti-predator training","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae051/7696134?rss=1","date":1718755200000,"content":"<span><div>Abstract</div>Rearing animals in captivity for conservation translocation is a complex undertaking that demands interdisciplinary management tactics. The maladapted behaviors that captive animals can develop create unique problems for wildlife managers seeking to release these animals into the wild. Often, released captive animals show decreased survival due to predation and their inability to display appropriate anti-predator, vigilance, and risk-analysis behaviors. Additionally, released animals may have poor foraging skills, further increasing their vulnerability to predation. Often conservation translocation programs use anti-predator training to ameliorate these maladapted behaviors before release but find mixed results in behavioral responses. The behavioral scope of analyzing the effect of anti-predator trainings is frequently narrow; the effect of this training on an animal’s risk-analysis competency, or ability to assess the predation risk of a foraging patch and subsequently adjust its behavior, remains unstudied. Using a captive-reared passerine species, the American robin (<span>Turdus migratorius</span>) (46 individuals), we applied an experimental giving up density test (GUD) to analyze the effect of anti-predator training on the robins’ vigilance/risk-analysis behaviors, patch choice, and the GUD of food left behind after one foraging session. Robins moved and foraged freely between 3 foraging patches of differing predation risk before and after a hawk silhouette was presented for 1 min. Results indicate that after anti-predator training, robins displayed increased vigilance across most foraging patches and better foraging efficiency (higher vigilance and latency to forage with simultaneous lower GUD) in the safest patch. These results can have positive survival implications post-release, however, more research on this training is needed because anti-predator training has the potential to elicit indiscriminate increased vigilance to the detriment of foraging gains. Further research is required to standardize GUD’s application in translocation programs with multigenerational captive-bred animals to fully comprehend its effectiveness in identifying and correcting maladaptive behaviors. GUD tests combined with behavioral analysis should be used by conservation translocation managers to examine the need for anti-predator and foraging trainings, the effects of trainings, and a group’s suitability for release.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"1df6263010540ead77cda26a20f356e652a3fd94f7f7363d607c8579337c9688","category":"Environment"}