{"title":"Social network enhanced behavioral interventions for diabetes and obesity: A 3 arm randomized trial with 2 years follow-up in Jordan","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001514","date":1710943200000,"content":"<p>by Eric L. Ding, Andrea B. Feigl, Kathleen T. Watson, Tin Lok James Ng, Leila Makerechi, Nancy Bui, Amal Ireifij, Rami Farraj, Daniel E. Zoughbie</p>\r\n\r\nWhile obesity and diabetes are rising pandemics, few low-cost and effective prevention and management strategies exist, especially in the Middle East. Nearly 20% of adults in Jordan suffer from diabetes, and over 75% are overweight or obese. Social network-based programs have shown promise as a viable public health intervention strategy to address these growing crises. We evaluated the effectiveness of the Microclinic Program (MCP) via a 6-month multi-community randomized trial in Jordan, with follow-up at 2 years. The MCP leverages existing social relationships to propagate positive health behaviors and information. We recruited participants from 3 community health centers in Amman, Jordan. Participants were eligible for the study if they had diabetes, pre-diabetes, or possessed ≥1 metabolic risk factor along with a family history of diabetes. We randomized participants into three trial arms: (A Group) received the Full MCP with curriculum-activated social network interactions; (B Group) received Basic MCP educational sessions with organic social network interactions; or (C Group-Control) received standard care coupled with active monitoring and parallel screenings. Groups of individuals were randomized as units in a 3:1:1 ratio, with resulting group sizes of n = 540, 186, and 188 in arms A, B, and C, respectively. We assessed the overall changes in body weight, fasting glucose, hemoglobin A1c (HbA1c) and mean arterial blood pressure between study arms in multiple evaluations across 2 years (including at 6-months and 2-years follow-up). We investigated the effectiveness of Full and Basic MCP social network interventions using multilevel models for longitudinal data with hierarchical nesting of individuals within MCP classrooms, within community centers, and within temporal cohorts. We observed significant overall 2-year differences between all 3 groups for changes in body weight (P = 0.0003), fasting blood glucose (P = 0.0015), and HbA1c (P = 0.0004), but not in mean arterial blood pressure (P = 0.45). However, significant changes in mean arterial pressure were observed for Full MCP versus controls (P = 0.002). Weight loss in the Full MCP exceeded (-0.97 kg (P&lt;0.001)) the Basic MCP during the intervention. Furthermore, both Full and Basic MCP yielded greater weight loss compared to the control group at 2 years. The Full MCP also sustained a superior fasting glucose change over 2 years (overall P&lt;0.0001) versus the control group. For HbA1c, the Full MCP similarly led to greater 6-month reduction in HbA1c versus the control group (P&lt;0.001), with attenuation at 2 years. For mean arterial blood pressure, the Full MCP yielded a greater drop in blood pressure versus control at 6 months; with attenuation at 2 years. These results suggest that activated social networks of classroom interactions can be harnessed to improve health behaviors related to obesity and diabetes. Future studies should investigate how public health policies and initiatives can further leverage social network programs for greater community propagation.\r\nTrial registration. ClinicalTrials.gov Identifier: NCT01818674.","author":"Eric L. Ding","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"1dfe110a6ad3bed98c106093a3800c450cf71ae93073d2092e6c9977de5b03db","category":"Environment"}