{"title":"Enhancing Blood Glucose Control in Individuals with Prediabetes who Are Overweight/Obese: A Randomized Clinical Trial Utilizing Individualized Nutrition Therapy and Continuous Glucose Monitoring","link":"https://www.preprints.org/manuscript/202409.1556/v1","date":1726769678000,"content":"Prediabetes is a significant risk factor for the development of Type 2 diabetes, cardiovascular diseases, chronic kidney disease, and other complications. Early diagnosis of prediabetes, coupled with education on lifestyle changes that support blood glucose management, are crucial for the prevention or delay of type 2 diabetes and related complications. This study aimed to examine the effects of individualized nutrition therapy (INT) combined with continuous glucose monitoring (CGM) on blood glucose control in individuals with prediabetes who are overweight or obesese. Participants (mean age ± SD: 55 ± 6 years; BMI: 31.1 ± 4.1 kg/m²) were randomly assigned to either the treatment group (n = 15) or the control group (n = 15). Both groups received INT and CGM, but the control group was blinded to the CGM data until the end of the study. Participants were followed for 30 days and visited the lab every 10 days for CGM replacement, study measurements, and dietary consultations. The treatment group showed a significant increase in the percent of time in the target blood glucose range (p=0.02) and a significant decrease in mean blood glucose concentration (p&amp;lt;0.05), glucose management indicator (p=0.02), percent coefficient of variation for blood glucose (p=0.01), and the percent time spent in the high or very high blood glucose ranges (p= 0.04). These changes were not statistically significant for the control group. We conclude that adding CGM feedback to INT resulted in better management of blood glucose levels in overweight or obese individuals with prediabetes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1e0dd46a768d102fdd12f068b08f6d553c74c776156d73b7eb65dcb47f667e23","category":"Interdisciplinary"}