{"title":"Evaluation of Body Composition and Biochemical Parameters in Adult PKU","link":"https://www.preprints.org/manuscript/202409.1153/v1","date":1726542398000,"content":"Background/Objectives: Phenylketonuria is a hereditary metabolic disorder characterized by a deficiency of phenylalanine hydroxylase. Main treatment for PKU is a phenylalanine-restricted diet. Exclusion of protein rich natural foods and inclusion of low-Phe substitutes may give rise to an imbalanced diet increasing the risk of overweight and obesity in PKU is a cause of concern. We aimed to evaluate the body composition and nutritional biochemical biomarkers in adult PKU patients who are on Phe-restricted and essential amino acids supplemented nutrition therapy and to investigate the relationships, between these parameters and patient gender, adherence to dietary therapy and disease type defined as mild or classic PKU. Methods: The study group comprised 37 PKU patients and 26 healthy siblings as controls. The participants were assessed based on an analysis of anthropometric parameters, body composition and biochemical test results. Results: PKU patients do not have a higher incidence of overweight and obesity than healthy controls, and the proportion of energy derived from carbohydrates in their diets was below the recommended level, and the total energy intake was below the recommended daily allowance. It was remarkable that patients with a treatment adherence ratio of &amp;lt;50% displayed a higher prevalence of overweight and abdominal obesity in comparison to those with a more favorable treatment adherence ratio. Conclusions: In view of the growing prevalence of overweight in the general population, PKU patients should be kept under close long-term follow-up. Particularly in the group with low treatment compliance, more caution should be paid in terms of adverse outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1e0f3abdf8d568a38fde6bedf2e1e175e2a707c21628e6ef685f528eb57c0afd","category":"Interdisciplinary"}