{"title":"เปิดมุมมองซีอีโอรุ่นใหม่ กับแล็ปท็อปคู่ใจเบื้องหลังความสำเร็จ ตอบโจทย์ทุกสถานการณ์ในยุค New Normal","link":"https://www.blognone.com/node/122879","date":1622106000000,"content":"<div><div><div><p>ปัจจุบัน Work From Anywhere กลายเป็นเทรนด์ใหม่ของคนทำงานไปเสียแล้ว และไม่ใช่เรื่องง่ายที่จะหาแล็ปท็อปคู่ใจสักเครื่องที่ตอบโจทย์การใช้งานทุกสถานการณ์ นอกจากต้องประมวลผลฉับไวเพื่อการทำงานที่ราบรื่นและรวดเร็วแล้ว ยังต้องโดดเด่นในเรื่องนวัตกรรมและดีไซน์ โดยเฉพาะผู้บริหารระดับสูงที่ต้องการทั้งความคล่องตัว ภาพลักษณ์ และความพร้อมใช้งานอยู่เสมอทุกฟังก์ชันทุกสถานการณ์</p>\n<p>ในโอกาสเปิดตัว HUAWEI MateBook Family 2021 หัวเว่ยจึงร่วมกับ GQ Thailand จัดเวทีเสวนาสุดเอ็กซ์คลูซีฟในหัวข้อ “CEO’S TOP SECRET ปรับตัวอย่างไรให้รอดในยุค New Normal” เชิญผู้บริหารรุ่นใหม่ที่นับเป็นไอคอนแห่งความสำเร็จทางธุรกิจ ทั้ง “ปิ๊น-อนุพงศ์ คุตติกุล” ผู้บริหารและผู้ร่วมก่อตั้งบริษัทคาร์นิวาล ซัพพลาย จำกัด ร้านสตรีทแฟชั่นมัลติแบรนด์ชั้นแนวหน้าของประเทศไทย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c5f232efb2c8527da8d9db47cd61cff2.jpg\" /><em>(จากซ้ายไปขวา) อนุพงศ์ คุตติกุล ผู้บริหารและผู้ร่วมก่อตั้งบริษัทคาร์นิวาล ซัพพลาย จำกัด, เกรียงไกร กาญจนะโภคิน ผู้ก่อตั้งและประธานเจ้าหน้าที่บริหาร กลุ่มบริษัท อินเด็กซ์ ครีเอทีฟ วิลเลจ จำกัด (มหาชน), สหศักดิ์ เตชะธรรมจิต ผู้ช่วยผู้อำนวยการประจำประเทศไทย บริษัท หัวเว่ย คอนซูมเมอร์ บิสสิเนส กรุ๊ป (ประเทศไทย), พีรวิชช์ อนันตศิรรัตน์ รองบรรณาธิการ GQ Thailand และสามขวัญ ตันสมพงษ์ กรรมการผู้จัดการ บริษัท วอท เดอะ ดัก จำกัด ร่วมเสวนาในหัวข้อ “CEO’s TOP SECRET ปรับตัวอย่างไรให้รอดในยุค New Normal”</em></p>\n<p><strong>“มอย-สามขวัญ ตันสมพงษ์”</strong> กรรมการผู้จัดการ บริษัท วอท เดอะ ดัก จำกัด ค่ายเพลงคนรุ่นใหม่ ต้นสังกัดของศิลปินชื่อดังอย่าง The Toys, Bowkylion, Whal &amp; Dolph และอื่นๆ อีกมากมาย ที่สร้างรอยยิ้มให้กับคนรักเสียงดนตรีมานานกว่า 5 ปี</p>\n<p><strong>“เมฆ-เกรียงไกร กาญจนะโภคิน”</strong> ผู้ก่อตั้งและประธานเจ้าหน้าที่บริหาร กลุ่มบริษัท อินเด็กซ์ ครีเอทีฟ วิลเลจ จำกัด (มหาชน) บริษัทเจ้าของโปรเจ็กต์ Village of Illumination งานเทศกาลประดับไฟใหญ่ที่สุดในเอเชีย ที่ไร่สิงห์ปาร์ค เชียงราย และเมืองโบราณ สมุทรปราการ</p>\n<p>และ <strong>“แชมป์-สหศักดิ์ เตชะธรรมจิต”</strong> ผู้ช่วยผู้อำนวยการประจำประเทศไทย บริษัท หัวเว่ย คอนซูมเมอร์ บิสสิเนส กรุ๊ป (ประเทศไทย) มาร่วมพูดคุยถึงกลยุทธ์ทางธุรกิจ รวมถึงความสำคัญของเทคโนโลยีและสมาร์ทดีไวซ์ที่นับได้ว่าเป็น Game Changer ต่อการปรับตัวในยุค New Normal ทั้งในแง่มุมของการทำงานและการใช้ชีวิต</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f4c2d2e16e68c97aa78f40d10c256726.jpg\" /><em>ปิ๊น-อนุพงศ์ คุตติกุล ผู้บริหารและผู้ร่วมก่อตั้งบริษัทคาร์นิวาล ซัพพลาย จำกัด</em></p>\n<p><strong>CARNIVAL: ผู้บริหารหนุ่มสายสตรีท เลือกแล็ปท็อปทั้งทีต้องบ่งบอกตัวตนและใช้งานไม่สะดุดตลอดวัน</strong></p>\n<p>ปิ๊น-อนุพงศ์ คุตติกุล ผู้บริหารและผู้ร่วมก่อตั้งบริษัท คาร์นิวาล ซัพพลาย จำกัด ร้านสตรีท แฟชันมัลติแบรนด์ชั้นแนวหน้าของประเทศไทย กล่าวว่า “ธุรกิจของคาร์นิวาลขับเคลื่อนด้วย Passion ทุกคนทำงานด้วยเป้าหมายเดียวกัน ยิ่งในสถานการณ์ New Normal แบบนี้ เราต้องมีอุปกรณ์ที่พร้อมจะเสิร์ฟเราได้ทุกสถานการณ์ สินค้าของเราเป็นสตรีทแวร์ที่บ่งบอกความเป็นตัวตน ผมชอบอะไรที่ทั้งคล่องตัว ทั้งดูดี และมีเอกลักษณ์ในตัวเอง ครั้งแรกที่เห็น HUAWEI MateBook 14 ก็รู้สึกสะดุดตากับดีไซน์ด้วยตัวบอดี้บางเบาถึงแม้จะใช้วัสดุที่เป็นโลหะ เพราะหมายความว่ามันไม่ใช่แค่พกพาสะดวก แต่ถือแล้วมันเสริมลุคเราไปในตัว แถมพอเป็นจอทัชสกรีนแล้วมันง่ายกับการทำงานของเรามากขึ้น ดังนั้นสำหรับผม จะเลือกแล็ปท็อปสักเครื่อง นอกจากใช้งานลื่นไหลแล้ว น้ำหนักและความคล่องตัวก็มาเป็นปัจจัยต้นๆ ที่สำคัญดีไซน์ควรมีเอกลักษณ์ บ่งบอกคาแรกเตอร์ และเข้ากันได้กับสไตล์การแต่งตัวของเรา”</p>\n<p>นอกจากเรื่องการแต่งกายและความคล่องตัว ปิ๊น-อนุพงษ์ ก็ประทับใจที่ HUAWEI MateBook 14 ยกระดับสเปกให้ตอบโจทย์การใช้งานได้ครบไม่แพ้เรื่องดีไซน์ ไม่ว่าจะเป็นชิปเซ็ต 11th Generation Intel® Core™ i5-1135G7 ให้การประมวลผลที่มีประสิทธิภาพสูงสุด รวมถึงมีระบบระบายความร้อนที่ดี สามารถใช้งานต่อเนื่องแบบมาราธอนได้โดยที่เครื่องไม่ overheat เพราะมีพัดลมระบายความร้อนไร้เสียง HUAWEI Shark Fin 2.0 ขณะที่แบตเตอรี่ทนทานความจุ 56 Wh สามารถใช้งานได้ยาวนานถึง 11 ชั่วโมง พร้อมรองรับการชาร์จเร็วอีกด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a816a00ace9f3066c1797e76c1fefe65.jpg\" /><em>มอย-สามขวัญ ตันสมพงษ์ กรรมการผู้จัดการ บริษัท วอท เดอะ ดัก จำกัด</em></p>\n<p><strong>What The Duck: ผู้บริหารสายบันเทิง เลือกหน้าจอกว้างเต็มตา เล่นคอนเทนต์หนักๆ ก็ยังลื่นไหล</strong></p>\n<p>มอย-สามขวัญ ตันสมพงษ์ กรรมการผู้จัดการ บริษัท วอท เดอะ ดัก จำกัด ค่ายเพลงคนรุ่นใหม่ ต้นสังกัดของศิลปินชื่อดังอย่าง The Toys, Bowkylion, Whal &amp; Dolph และอื่นๆ อีกมากมาย ได้ร่วมพูดคุยและแชร์มุมมองของเขาว่า “เนื่องจากงานผมต้องลงโปรแกรมตัดต่อเพลง ตรวจงานวิดีโอ เปิดไฟล์หรือโปรแกรมหนักๆ จำนวนมากพร้อมกัน ผมเลยชอบใช้แล็ปท็อปที่ประมวลผลเร็ว หน่วยความจำต้องมากพอ เปิดโน่นนี่ไว้เยอะๆ แล้วเครื่องไม่ค้าง ที่สำคัญคือยิ่งจอคมชัด ความละเอียดจอสูง ยิ่งทำให้เรามองเห็นรายละเอียดงานได้ดีขึ้น เราเป็น Final Decision จำเป็นต้องดูทุกรายละเอียดให้มั่นใจก่อนที่ผลงานจะออกไปจากมือเรา ปกติเวลาไปที่ทำงานเราก็ดูจากคอมพิวเตอร์เครื่องใหญ่ที่เราใช้ปกติ แต่ในเวลาที่ต้องปรับตัวกับวิถีชีวิตใหม่แบบนี้ HUAWEI MateBook 14 ก็มีสิ่งที่ทำให้เราวางใจคือจอชัด RAM ดี ตอบโจทย์พอดีครับ”</p>\n<p>ฟีเจอร์ที่ มอย-สามขวัญ โปรดปรานเป็นพิเศษคือการที่ HUAWEI MateBook 14 เปิดหลากหลายโปรแกรมได้แบบไม่ค้าง สลับโปรแกรมไปมาแล้วไม่ติดขัด ไม่ว่าจะเป็นโปรแกรมตัดต่อวิดีโอ ตัดต่อเพลงที่หนักๆ ด้วยหน่วยความจำ 16 GB DDR4 ซึ่งช่วยเพิ่มความเร็วในการรับส่งข้อมูลระหว่างโปรแกรมคอมพิวเตอร์และหน่วยประมวลผลกลาง ทำให้งานราบรื่นไปด้วย</p>\n<p>อีกลูกเล่นสุดประทับใจคือ Fingerprint Power Button ที่ช่วยสแกนลายนิ้วมือเพื่อเปิด-ปิดเครื่องได้อย่างรวดเร็วโดยไม่ต้องพิมพ์รหัสผ่าน รักษาความปลอดภัยได้ดีเยี่ยม ส่วนจอ 2K FullView Display ซึ่งได้รับการรับรองโดยผู้ให้บริการตรวจสอบอิสระชั้นนำระดับโลกอย่าง TÜV Rheinland นอกจากจะช่วยให้ตรวจงานมิวสิกวิดีโอได้เต็มอิ่ม ทั้งตรวจการเกรดสีและการเก็บรายละเอียดเพื่อให้เพลงที่ทำสื่อความหมายได้อย่างสมบูรณ์แบบแล้ว ยังสามารถช่วยให้หาแรงบันดาลใจในการสร้างสรรค์ผลงานได้อย่างเต็มที่โดยที่ตาไม่เหนื่อยล้าอีกด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/21a46c1faa1c555468ddad9611d1ff84.jpg\" /><em>เมฆ-เกรียงไกร กาญจนะโภคิน ผู้ก่อตั้งและประธานเจ้าหน้าที่บริหาร<br />\nกลุ่มบริษัท อินเด็กซ์ ครีเอทีฟ วิลเลจ จำกัด (มหาชน)</em></p>\n<p><strong>Index Creative Village: ผู้บริหารสายครีเอทีฟ เลือกการเชื่อมต่อที่สะดวกรวดเร็ว เพราะนอกจากไอเดียต้องดี งานยังต้องเร็ว</strong></p>\n<p>เมฆ-เกรียงไกร กาญจนะโภคิน ผู้ก่อตั้งและประธานเจ้าหน้าที่บริหาร กลุ่มบริษัท อินเด็กซ์ ครีเอทีฟ วิลเลจ จำกัด (มหาชน) เปิดเผยถึงเคล็ดลับว่าเขาเลือกแล็ปท็อปที่ใช้แล้วรู้สึกว่าสะดวกสบาย รวดเร็ว ไร้รอยต่อ “งานครีเอทีฟขึ้นชื่อเรื่องการทำงานแข่งกับเวลา นอกจากไอเดียเราจะต้องดีแล้ว เวลายังสำคัญมาก ยิ่งเดี๋ยวนี้ถ้าช้าไปสักนิดคนอื่นก็แซงหน้าเราไปหมด สิ่งที่ขาดไม่ได้เลยสำหรับผมคือ การเชื่อมต่อที่ง่าย เป็นครั้งแรกที่ผมได้เห็นการเอาจอสมาร์ทโฟนขึ้นมาไว้บนจอแล็ปท็อป แล้วยังเปิดแอปฯ มือถือบนจอแล็ปท็อปได้ถึง 3 แอปฯ พร้อมกัน แถมใช้งานผ่านแล็ปท็อปได้แบบ interactive ลากรูป ส่งไฟล์ ส่งวิดีโอได้โดยใช้เวลาแค่หลักวินาทีเท่านั้น เป็นเทคโนโลยีที่น่าทึ่งมากจริงๆ เรามักจะคิดไปก่อนว่าการทำงานในยุค New Normal จะทำให้ลำบากเมื่อต้อง Multi-tasking แต่จริงๆ แล้วเรามีเทคโนโลยีมากมายที่พร้อมสนับสนุนให้เราประชุมไปด้วยและทำงานไปด้วยได้”</p>\n<p>เมฆ-เกรียงไกร เล่าถึงความประทับใจเมื่อเขาได้ลองใช้ฟีเจอร์ HUAWEI Share 3.0 ที่มากับแล็ปท็อป HUAWEI MateBook 14 ว่า HUAWEI Ecosystem ช่วยให้การทำงานสะดวกยิ่งขึ้นในทุกขณะ นอกจากนั้นการเชื่อมต่อที่รองรับ Wi-Fi 6 ซึ่งเป็นเทคโนโลยีใหม่ล่าสุด ก็ยิ่งทำให้การทำงานรวดเร็วและราบรื่นขึ้นไปอีก ไม่ว่าในแง่ของการเชื่อมต่ออินเทอร์เน็ต การดาวน์โหลดไฟล์ หรืออัปโหลดข้อมูลต่างๆ ขึ้นคลาวด์</p>\n<p>“อีกฟีเจอร์ที่ผมชอบสำหรับแล็ปท็อปตัวนี้คือโหมด Performance ที่เหมาะจะใช้เวลาเราเปิดโปรแกรมใหญ่ๆ หรือทำงานที่ต้องอาศัยข้อมูลจำนวนมาก แค่กด Fn+P แล็ปท็อปก็จะเข้าสู่โหมดประสิทธิภาพสูงสุด ให้เราใช้งานได้แบบเต็มประสิทธิภาพ เหมือนมันเพิ่มขีดความสามารถให้แล็ปท็อปได้อีกระดับ ซึ่งทำเอาผมทึ่งเลยทีเดียว” เมฆ-เกรียงไกร กล่าวเพิ่มเติม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f205bf5268ab00094df7d66b89f14785.jpg\" /><em>แชมป์-สหศักดิ์ เตชะธรรมจิต ผู้ช่วยผู้อำนวยการประจำประเทศไทย<br />\nบริษัท หัวเว่ย คอนซูมเมอร์ บิสสิเนส กรุ๊ป (ประเทศไทย)</em></p>\n<p>ด้าน แชมป์-สหศักดิ์ เตชะธรรมจิต ผู้ช่วยผู้อำนวยการประจำประเทศไทย บริษัท หัวเว่ย คอนซูมเมอร์ บิสสิเนส กรุ๊ป (ประเทศไทย) กล่าวเสริมจากประสบการณ์ของเขาว่า “ผมมองว่าความคล่องตัวในการใช้งานเป็นสิ่งสำคัญ และเป็นคุณสมบัติพื้นฐานเวลาที่เราจะมองหาแล็ปท็อปสักเครื่องมาใช้ทำงาน แล็ปท็อปควรบาง เบา พกพาสะดวก ตอบโจทย์การใช้งานทั้งในและนอกออฟฟิศ โดยเฉพาะกลุ่มคนเจนใหม่ที่มีไลฟ์สไตล์แบบ New Normal เขาต้องการความยืดหยุ่นที่จะทำงานได้จากทุกที่ หรือที่เราเรียกกันว่า Work From Anywhere รวมถึงผู้บริหารรุ่นใหม่ที่ต้องออกไปหาลูกค้าในหลายพื้นที่ เจ้าของธุรกิจที่ต้องดูแลหน้าร้านหลายสาขา หรือผมเองที่ต้องมีแล็ปท็อปในมือพร้อมประชุมอยู่เสมอ คนกลุ่มนี้จะมองหาแล็ปท็อปที่พกพาสะดวกมาเป็นอันดับแรก”</p>\n<p>อีกประเด็นที่ แชมป์-สหศักดิ์ มองว่าสำคัญไม่ยิ่งหย่อนไปกว่ากันคือ หน้าจอแสดงผลที่กว้างและให้ภาพคมชัด ซึ่งจะยิ่งเพิ่มประสิทธิภาพในการพรีเซนต์และชมคอนเทนต์ ไม่ว่าจะเป็น เวลาไปขายงานกับลูกค้า พาร์ทเนอร์ หรือร่วมโต๊ะประชุมกับทีม</p>\n<p>อย่างเช่น HUAWEI MateBook 14 ที่เป็นแล็ปท็อปรุ่นพรีเมียม น้ำหนักเบาเพียง 1.49 กิโลกรัม เทียบกันกับของใช้ในชีวิตประจำวันแล้วก็ประมาณน้ำเปล่าขวดใหญ่ ทำให้แล็ปท็อปรุ่นนี้มีคุณสมบัติสำคัญคือพกพาง่าย ใช้งานสะดวกด้วยหน้าจอทัชสกรีน ทั้งยังได้รับการออกแบบอย่างประณีตให้ขอบจอบางเฉียบ ได้มุมมองกว้างเต็มตาด้วยสัดส่วนจอ 90% ของตัวเครื่อง พร้อมความละเอียดสูงระดับ 2K เพื่อภาพที่คมชัดขึ้น สอดคล้องกับคุณสมบัติพื้นฐานของแล็ปท็อปสักเครื่องที่ตอบโจทย์วิถีใหม่ของไลฟ์สไตล์การทำงานแบบคนรุ่นใหม่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/168953b676b0ccb4763a66340fba37b1.jpg\" /></p>\n<p><strong>HUAWEI MateBook 14</strong> สี Space Gray วางจำหน่ายอย่างเป็นทางการในประเทศไทยในราคา 34,990 บาท โดยสามารถจับจองเป็นเจ้าของได้แล้วทั้งหน้าร้าน HUAWEI Experience Store และร้านค้าอื่นๆ ที่ร่วมรายการ รวมถึงสามารถสั่งซื้อออนไลน์ได้ทั้งทางเว็บไซต์ <a href=\"https://consumer.huawei.com/th/shop/product/huawei-matebook-14-2021?utm_medium=press_release&amp;utm_source=Blognone&amp;utm_campaign=th_matebookfamily2020&amp;utm_content=Blognone-MB14\">HUAWEI Online Store</a> และ <a href=\"https://item.jd.co.th/product/_22889443.html?utm_source=Huawei&amp;utm_medium=Blognone&amp;utm_campaign=MatebookFamily2021&amp;utm_content=Blognone-MB14\">JD.com</a></p>\n<p>นอกจากฟีเจอร์อันโดดเด่นของ HUAWEI MateBook 14 แล็ปท็อประดับพรีเมียมที่เบาและบาง เหมาะสำหรับนักธุรกิจ ผู้บริหาร และกลุ่มคนทำงานที่ต้องการแล็ปท็อปสเปกสูง ทนทาน และตอบโจทย์การทำงานได้ครบครันอย่างที่กล่าวมาข้างต้นแล้ว HUAWEI MateBook Family 2021 ยังมาพร้อมแล็ปท็อปอีก 2 รุ่นคือ HUAWEI MateBook D 15 และ HUAWEI MateBook D 14 ที่ใช้ชิปเซ็ตประมวลผลรุ่นล่าสุดจาก Intel® เพื่อตอบโจทย์การใช้งานของผู้บริโภคทุกไลฟ์สไตล์ โดยสามารถติดตามอ่านรายละเอียดเพิ่มเติมเกี่ยวกับผลิตภัณฑ์ได้<a href=\"https://consumer.huawei.com/th/laptops/\">ที่นี่</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/83c78c8dea7d35aaba421a89c72fca80.png\" /></p>\n<p>พลาดไม่ได้! หัวเว่ยจัดโปรโมชัน Laptop Pay Day Carnival มอบของแถมสุดคุ้มสำหรับลูกค้าที่ซื้อ HUAWEI MateBook 14 รุ่นชิปเซ็ต 11th Generation Intel® Core™ i5-1135G7 (16GB+512GB) ราคา 34,990 บาท รับทันที HUAWEI Display หน้าจอมอนิเตอร์ขนาด 23.8 นิ้ว มูลค่า 4,899 บาท หรือเมื่อซื้อ HUAWEI MateBook D 15 รุ่นชิปเซ็ต 11th Generation Intel® Core™ i5-1135G7 (16GB+512GB) ราคา 27,990 บาท รับทันทีแท็บเล็ต HUAWEI MatePad T 8 มูลค่า 3,290 บาท ระหว่างวันที่ 28 พฤษภาคม 2564 ถึง 6 มิถุนายน 2564 ที่ HUAWEI Experience Store และร้านค้าตัวแทนจำหน่ายที่ร่วมรายการ ด่วน! ของแถมมีจำนวนจำกัด</p>\n<p>ยังไม่หมดเพียงเท่านี้ หัวเว่ยยังให้ระยะเวลารับประกันสินค้า 2 ปีหลังจากวันซื้อ โดยหากซื้อผลิตภัณฑ์ในกลุ่ม HUAWEI MateBook Family ลูกค้าสามารถรับบริการรับประกันสินค้าแบบครบวงจร เช่น รับประกันตรวจเช็คตัวเครื่องฟรี 2 ปี<sup>1</sup> เปลี่ยนสินค้าคืนได้ภายใน 7 วันนับตั้งแต่วันที่ซื้อ หากพบว่ามีปัญหาการใช้งาน<sup>2</sup>  บริการบำรุงรักษาอุปกรณ์เสริม<sup>3</sup>  บริการบำรุงรักษาเครื่องเมื่อพบปัญหาในการใช้งาน โดยสามารถส่งซ่อมที่ศูนย์บริการลูกค้าของหัวเว่ยทั่วประเทศใกล้บ้านท่านหรือติดต่อคอลเซ็นเตอร์ที่หมายเลข 1800010111 สามารถติดต่อได้ทุกวันทำการ ตั้งแต่เวลา 09.00 น. ถึง 21.00 น. สามารถดูรายละเอียดได้ที่ <a href=\"https://consumer.huawei.com/th/support/warranty-policy/pc/\">https://consumer.huawei.com/th/support/warranty-policy/pc/</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/8a8cc5319a76101f69f7d6639002ec2a.jpg\" /></p>\n<p><strong>เงื่อนไขการคุ้มครอง</strong></p>\n<p>1.บริการตรวจเช็คตัวเครื่องฟรีในระยะเวลา 2 ปี นับจากวันที่ซื้อสินค้า หากพบปัญหาการใช้งานที่ไม่ได้เกิดจากการใช้งานของลูกค้า โดยต้องมีใบเสร็จของสินค้านั้นๆ เพื่อรับบริการ แต่หากไม่มีใบเสร็จ สามารถใช้ใบแจ้งหนี้ สำเนาใบแจ้งหนี้ หรือใบรับประกันสินค้าแทนได้ โดยระยะเวลาในการรับประกันสินค้าจะเปลี่ยนเป็น 90 วัน หลังจากวันที่ผลิต (ตรวจสอบได้จากหมายเลขผลิตภัณฑ์ของอุปกรณ์นั้นๆ)</p>\n<p>2.บริการเปลี่ยนคืนสินค้าภายใน 7 วัน นับจากวันที่ซื้อ หากพบปัญหาการใช้งานที่ไม่ได้เกิดจากการใช้งานของลูกค้า โดยสามารถเปลี่ยนคืนสินค้าได้ครั้งเดียวต่อใบเสร็จเดิมที่ใช้ซื้อสินค้าเท่านั้น ทั้งนี้ ตัวเครื่อง อุปกรณ์เสริม และกล่องอุปกรณ์ ต้องอยู่ในสภาพสมบูรณ์ครบถ้วนไม่เสียหาย</p>\n<p>3.ระยะเวลารับประกันการบำรุงรักษาอุปกรณ์เสริมขึ้นอยู่กับประเภทของอุปกรณ์เสริมแต่ละตัว สามารถตรวจสอบรายระเอียดและระยะเวลาการรับประกันอุปกรณ์เสริมแต่ละประเภทได้กับเจ้าหน้าที่ศูนย์บริการลูกค้าของหัวเว่ย ติดต่อได้ผ่าน<a href=\"https://consumer.huawei.com/th/support/service-center/\">ช่องทางออนไลน์</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/38b90833891ccc5b01a8fc49519dc91c.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/huawei\">Huawei</a></div><div><a href=\"/topics/laptop\">Laptop</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1e16107013dfd65decb75d47d9889fc22c8c1fad5e5f90623dcef7967f05c427","category":"Thai"}