{"title":"433 Use of polyclonal antibodies to improve the efficiency of rumen function","link":"https://academic.oup.com/jas/article/102/Supplement_3/181/7757393?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Technologies such as polyclonal antibody preparations (PAP) have been investigated as a tool to improve rumen function, by targeting specific bacteria or molecules. While PAP can be sourced from the serum of immunized mammals, isolating targeted avian-derived antibodies (immunoglobulin Y; IgY) from egg yolk gained popularity due to its reduced impact on hens and greater IgY concentration in yolks. Advantages of avian-derived PAP utilization include cost-effectiveness and convenient production, high stability, and reduced cross-reactivity compared with other PAPs. Furthermore, IgY does not activate the host immune complement system, as observed with PAP derived from mammalian serum. Several proposed strategies explain how PAP might protect the host. It is suggested that PAP can agglutinate bacteria, inhibit bacterial adhesion, suppress bacterial virulence factors, and neutralize toxins. Avian-derived PAP, mainly administered as a direct-fed product in beef and dairy cattle diets, has been studied for its impact on specific rumen microbial populations, especially during high-grain feeding. Research confirms the effectiveness of PAP-IgY in inhibiting the growth of targeted bacteria. In beef steers, feeding PAP-IgY against <span>Streptococcus bovis</span> and <span>Fusobacterium necrophorum</span> resulted in growth inhibition, while IgY against cellulolytic rumen bacteria also showed efficacy in reducing the growth of the targeted strains in vitro. In other studies, PAP-IgY targeting <span>S. bovis</span> and <span>F. necrophorum</span> increased ruminal pH in beef steers and heifers and dairy cows, while also cattle-fed PAP-IgY against <span>F. necrophorum</span> had reduced severity of liver abscesses. When performance was evaluated, PAP-IgY against S<span>. bovis</span> improved feed efficiency of feedlot beef steers, and milk production increased when dairy cows were supplemented with PAP-IgY against lipopolysaccharides, with no observed impact on cow health status. However, not all studies have consistently demonstrated positive effects of PAP-IgY on nutrient digestibility or on mitigating systemic inflammation during high-grain feeding. A recent study revealed that supplementation with PAP-IgY against <span>Methanobrevibacter ruminantium</span> M1 decreased methane output ex-situ and tended to increase molar proportion of propionate in beef steers. In summary, polyclonal antibody preparations, particularly avian-derived IgY, offer a promising alternative to improve rumen function and animal performance. This is evidenced by increased ruminal pH during high grain feeding, inhibition of targeted bacterial growth, and, most recently, methane reduction. However, not all studies demonstrate consistent effects regarding nutrient digestibility. Further research is needed to refine recommendations, including dosage and antibody combinations, and to explore the broader impacts of PAP-IgY supplementation on ruminal and systemic variables to optimize livestock performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1e1f08a2189cf6d55c954b0e7c7b862e9622b207d032c63a7445149f57df03df","category":"Environment"}