{"title":"Doom’s creators reminisce about “as close to a perfect game as anything we made”","link":"https://arstechnica.com/?p=1991059","date":1702568870000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>The archived hour-long chat is a must-watch for any long-time <em>Doom</em> fan. </p></div>\n<p>While <em>Doom</em> can sometimes feel like an overnight smash success, the seminal first-person shooter was far from the first game created by id co-founders John Carmack and John Romero. Now, in <a href=\"https://arstechnica.com/gaming/2023/11/dooms-romero-and-carmack-will-reunite-for-30th-anniversary-streaming-event/\">a rare joint interview</a> that was <a href=\"https://www.youtube.com/watch?v=QvAkaJsvAXs\">livestreamed during last weekend's 30th-anniversary celebration</a>, the pair waxed philosophical about how <em>Doom</em> struck a perfect balance between technology and simplicity that they hadn't been able to capture previously and have struggled to recapture since.</p>\n<p>Carmack said that <em>Doom</em>-precursor <em>Wolfenstein 3D</em>, for instance, \"was done under these extreme, extraordinary design constraints\" because of the technology available at the time. \"There just wasn't that much we could do.\"</p>\n<div><img alt=\"&lt;em&gt;Wolfenstein 3D&lt;/em&gt;'s grid-based mapping led to a lot of boring rectangular rooms connected by long corridors.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/wolf3dmap.png\" /><p><em>Wolfenstein 3D</em>'s grid-based mapping led to a lot of boring rectangular rooms connected by long corridors. (credit: <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1325446230\">Steam</a>)</p></div>\n<p>One of the biggest constraints in <em>Wolfenstein 3D</em> was a grid-based mapping system that forced walls to be at 90-degree angles, leading to a lot of large, rectangular rooms connected by long corridors. \"Making the levels for the original <em>Wolfenstein</em> had to be the most boring level design job ever because it was so simple,\" Romero said. \"Even [2D platformer <em>Commander Keen</em>] was more rewarding to make levels for.\"</p></div><p><a href=\"https://arstechnica.com/?p=1991059#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1991059&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1e21b9e09506a790a3b599ed33b9f5d69512d60e19d1842de9253adb70d4ce3f","category":"Tech"}