{"title":"Trump Acquitted; 57-43 Vote in Senate Falls Short of Two-Thirds Needed for Conviction","link":"https://www.washingtonpost.com/politics/trump-acquitted-impeachment-riot/2021/02/13/dbf6b172-6e12-11eb-ba56-d7e2c8defa31_story.html","date":1613263218000,"content":"\n<p>The Washington Post, today:</p>\n\n<blockquote>\n  <p>Former president Donald Trump was acquitted Saturday of inciting the Jan. 6 attack on the Capitol, becoming the first president in U.S. history to face a second impeachment trial — and surviving it in part because of his continuing hold on the Republican Party despite his electoral defeat in November.</p>\n\n<p>That grip appeared to loosen slightly during the vote Saturday afternoon, when seven Republicans crossed party lines to vote for conviction — a sign of the rift the Capitol siege has caused within GOP ranks and the desire by some in the party to move on from Trump. Still, the 57-to-43 vote, in which all Democrats and two independents voted against the president, fell far short of the two-thirds required to convict.</p>\n</blockquote>\n\n<p><a href=\"https://www.washingtonpost.com/politics/capitol-riot-goodman-impeachment/2021/02/12/ae9f074e-6d89-11eb-9f80-3d7646ce1bc0_story.html\">Yesterday</a>:</p>\n\n<blockquote>\n  <p>The Senate ended Friday’s impeachment trial proceedings with a unanimous vote to award the Congressional Gold Medal, one of the nation’s highest civilian honors, to U.S. Capitol Police Officer Eugene Goodman, who directed the violent mob away from the Senate chamber on Jan. 6.</p>\n\n<p>“Here in this trial, we saw a new video, powerful video showing calmness under pressure, his courage in the line of duty, his foresight in the midst of chaos, and his willingness to make himself a target of the mob’s rage so that others might reach safety,” Senate Majority Leader Charles E. Schumer (D-N.Y.) said before recognizing Goodman, who was sitting in the back of the chamber.</p>\n\n<p>Goodman received a standing ovation from the senators, whom he saved from danger on Jan. 6. Goodman joined in the applause when Schumer mentioned the heroism of other law enforcement officers that day.</p>\n</blockquote>\n\n<p>“<em>It is curious that physical courage should be so common in the world, and moral courage so rare.</em>” <br />\n—<span class=caps>Mark Twain</span></p>\n\n<div>\n<a  title=\"Permanent link to ‘Trump Acquitted; 57-43 Vote in Senate Falls Short of Two-Thirds Needed for Conviction’\"  href=\"https://daringfireball.net/linked/2021/02/13/trump-acquitted\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"1e302a9ff017d1e906de5c0424b35ebf41bb435217b45d489c7ec07f5de4218e","category":"Tech"}