{"title":"Food taboos and preferences among adolescent girls, pregnant women, breastfeeding mothers, and children aged 6–23 months in Mainland Tanzania: A qualitative study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003598","date":1723471200000,"content":"<p>by Aika Lekey, Ray M. Masumo, Theresia Jumbe, Mangi Ezekiel, Zahara Daudi, Nangida J. Mchome, Glory David, Winfrida Onesmo, Germana H. Leyna</p>\r\n\r\nMalnutrition is a serious public health problem and has long-lasting economic consequences for individuals and families and, in turn, affects the economic growth of the country. Understanding food taboos and individual preferences for food items is critical to the development of effective nutritional programs and educational messages. The present study aimed to explore food taboos and preferences in food items among breastfeeding mothers, pregnant women, adolescent girls, and their young children aged 6–23 months old. This is a qualitative cross-sectional study employing ethnography. A multistage sampling technique was used to select one region from the seven zones in mainland Tanzania. In each region, we purposively selected one rural ward and one urban ward. We conducted 25 focus group discussions with a total of 208 participants. We also conducted 42 in-depth interviews with nutrition officers, community health workers, religious leaders, influential persons, representatives of civil society organisations, and community leaders in the respective areas. We thematically coded the data and analyzed the narrative. Food taboos and individual preferences in food items continue to be practiced in Tanzania’s Mainland despite efforts to educate people on healthy diets. In some regions of Tanzania’s Mainland, pregnant women and breastfeeding mothers were prohibited from eating eggs, meat, fish, or vegetables. In Arusha, adolescent girls were prohibited from eating goat meat similar to Singida where adolescent girls were prohibited from eating chicken thighs. It is believed that by feeding a young child with eggs her hair gets plucked. This study underscores that food taboos and preferences still exist in Tanzania Mainland, and implies gaps in the nutrition education. Thus, nutrition education campaigns and programs should address food taboos and preferences for the meaningful tackling of malnutrition.","author":"Aika Lekey","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"1e34660398bf7ce4054563ba2e3fc870fc37b8501897c7b31eb05d686d7fd164","category":"Environment"}