{"title":"Serological Investigation for Brucella ceti in Cetaceans from the North-Western Mediterranean Sea","link":"https://www.preprints.org/manuscript/202407.0209/v1","date":1719924509000,"content":"Neurobrucellosis in cetaceans, caused by Brucella ceti, is a relevant cause of death in striped dolphins (Stenella coeruleoalba) from the Mediterranean Sea. Serological tests are not used as a routinary technique for the diagnosis of this infection. We briefly describe the pathological findings of 10 free-ranging stranded cetaceans diagnosed with Brucella infection in our veterinary necropsy service from 2012 to 2023. Findings included focal diskospondylitis, non-suppurative meningitis, choroiditis and radiculitis. Additionally, an exploratory serological study was conducted in 66 frozen sera collected in the period 2012-2022 from 57 striped dolphins, 5 Risso’s dolphins (Grampus griseus), 2 common bottlenose dolphins (Tursiops truncatus), 1 common dolphin (Delphinus delphis) and 1 pilot whale (Globicephala melas), to compare antibody levels in Brucella-infected (n=8) and non-infected (n=58) animals, classified by cause of death, sex, age class and cetacean morbillivirus (CeMV) infection status. We performed a commercial competition ELISA (cELISA) using serial serum dilutions for each sample, considering a percentage of inhibition (PI) of ≥40% as positive. A titer of 1:160 was arbitrarily determined as the seropositivity threshold. Seropositive species included striped dolphins and Risso’s dolphins. Seroprevalence was higher in animals with neurobrucellosis (87.5%) compared to the overall prevalence (31.8%) and to other causes of death, indicating a high sensitivity but low specificity for neurobrucellosis. Animals with chronic CeMV seemed to have higher seroprevalences, as well as juveniles, which also had more disease prevalence. These results suggest that high antibody titers are not always protective against clinical brucellosis, although they may indicate a carrier state, and that CeMV may potentially condition Brucella epidemiology. More research is required to elucidate the epidemiology and pathogenesis and to disentangle the complicated host-pathogen interaction in Brucella species.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1e3790c4ad75106292c35cded79d1ded9943d659931c767fe9ca7e4c3a5228f5","category":"Interdisciplinary"}