{"title":"Factors associated with bypassing primary healthcare facilities for childbirth among women in Devchuli municipality of Nepal","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302372","date":1713448800000,"content":"<p>by Manisha Maharjan, Sudim Sharma, Hari Prasad Kaphle</p>\r\nBackground <p>It is crucial to deliver a child at nearby primary healthcare facilities to prevent subsequent maternal or neonatal complications. In low-resource settings, such as Nepal, it is customary to forgo the neighboring primary healthcare facilities for child delivery. Reports are scanty about the extent and reasons for bypassing local health centers in Nepal. This study sought to determine the prevalence and contributing factors among women bypassing primary healthcare facilities for childbirth.</p> Method <p>A community-based cross-sectional study was carried out in the Devchuli municipality of Nawalparasi East district of Nepal. Utilizing an online data collection tool, structured interviews were conducted among 314 mothers having a child who is less than one year of age.</p> Results <p>This study showed that 58.9% of the respondents chose to bypass their nearest primary healthcare facility to deliver their babies in secondary or tertiary hospitals. Respondent’s husband’s employment status; informal employment (AOR: 4.2; 95% CI: 1.8–10.2) and formal employment (AOR: 3.2; 95% CI: 1.5–6.8), wealth quintile (AOR: 3.7; 95% CI: 1.7–7.7), parity (AOR): 3.0; 95% CI: 1.6–5.7], distance to nearest primary healthcare facility by the usual mode of transportation (AOR: 3.0; 95% CI: 1.5–5.6) and perceived service quality of primary healthcare facility (AOR: 3.759; 95% CI: 2.0–7.0) were associated with greater likelihood of bypassing primary healthcare facility.</p> Conclusion <p>Enhancing the quality of care, and informing beneficiaries about the importance of delivering children at primary healthcare facilities are essential for improving maternal service utilization at local primary healthcare facilities.</p>","author":"Manisha Maharjan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1e3bd5c8323415967757002d172800013501bca153e921c98dc2ba33f2701f86","category":"Interdisciplinary"}