{"title":"Vision Pro is already changing everything we know about Apple","link":"https://www.macworld.com/article/2196778/apple-vision-pro-launch.html","date":1704886200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Nearly eight months after its introduction at last year’s Worldwide Developers Conference, the Apple Vision Pro is poised to go on sale: Apple has said that <a href=\"https://www.macworld.com/article/2194939/apples-3499-vision-pro-will-hit-stores-on-february-2-with-a-free-polishing-cloth.html\">preorders for the device will begin on January 19</a>, with the Vision Pro expected to be available in stores starting on February 2.</p>\n\n\n\n<p>Despite being the company’s first new major platform in almost a decade, though, the fanfare for the Vision Pro’s arrival has been decidedly muted. Apple didn’t hold another event, opting instead for a press release and <a href=\"https://www.macworld.com/article/2196145/apple-vision-pro-ad-movie-scenes.html\">teaser ad</a>, and the company didn’t add much in the way of new information about the product and its capabilities.</p>\n\n\n\n<p>That’s not entirely surprising though. While we may have been accustomed to a certain style of product launch from Apple, the Vision Pro is a very different type of device, and that necessitates a very different kind of release.</p>\n\n\n\n<h2>Less is…less</h2>\n\n\n\n<p>By all accounts, Apple is manufacturing this first version of the Vision Pro in <em>very</em> small quantities. That is not, in and of itself, unusual for Apple: it takes time to ramp up production of new devices and even new models of existing products to the huge numbers in which the company sells them, but if reports are accurate, the <em>target</em> quantities for the spatial computer are in the hundreds of thousands for the year. For a company that regularly deals in millions and tens of millions, that’s small potatoes.</p>\n\n\n\n<figure><div>\n\n</div><figcaption>The Apple Vision Pro commercial is reminiscent of the original iPhone ad.</figcaption></figure>\n\n\n\n<p>To my mind, that helps explain part of the muted launch. Apple is aware that the high price tag and novel nature of the Vision Pro aren’t likely to capture the public’s attention the way the iPhone or even the Apple Watch have. Yes, Apple would no doubt like to eventually sell millions upon millions of these, but even the company knows that’s not going to happen with the first iteration.</p>\n\n\n\n<p>So why spend too much time, effort, and money promoting a product that the vast majority of people aren’t going to buy? I sincerely doubt that any amount of advertising is going to get someone to shell out $3,500 if they’re not already committed to doing so. The Vision Pro business is an investment for Apple, one that’s not likely to pay off for several years.</p>\n\n\n\n<h2>What’s in store</h2>\n\n\n\n<p>There’s another reason that Apple might want to soft-pedal this launch more than those of its previous products: the retail experience. The company’s often described the Apple Watch as the most personal device it makes, but I think there are certainly elements of the Vision Pro that have it beat. Not only does the device potentially require precise fitting, including the use of additional lens inserts, but it’s also something that many people–both staff and customers–are going to need to be trained to use.</p>\n\n\n\n<p>Enter the Apple Store. Reports have suggested that the company has already begun bringing in an employee or two from each store to Cupertino to train them on not only selling it to customers but also how to train their colleagues on selling the product when they go back to their respective stores.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Store\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>The Apple Store experience </p>will be vital to introducing people to the Apple Vision Pro and the spatial computing experience.</figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Given that Apple has said the Vision Pro will be available in <em>all</em> of its 273 retail stores, that’s a lot of potential customers who might be interested in at least checking out the device, if not going through the whole buying experience. While it’s clear that Apple doesn’t have any antipathy to people lining up to buy its products, the demo and buying processes are likely to be time-consuming, which may make the company more inclined to manage demand.</p>\n\n\n\n<h2>The future is yet to come</h2>\n\n\n\n<p>Looking down the road, it’s easy enough to see future versions of the Vision Pro hardware appealing more to the average consumer, but you also can’t discount the software side of the equation. The Vision Pro is a brand new platform with a brand new interaction method–in many ways, it’s as different from the iPhone and iPad as those were from the Mac. And though the company’s been working on enabling developers to create compelling software for this new platform, that is decidedly a marathon and not a sprint.</p>\n\n\n\n<p>Even more so than its previous platforms, the Vision Pro presents a chicken-and-egg problem for Apple: encouraging people to buy into a new platform rests to at least some degree on the idea that you can <em>do</em> interesting things with it. But developers may also be reluctant to invest their time and energy if there’s not a reasonably sized potential market. (Not to mention that developers have to themselves be customers first, and smaller independent developers may balk at the price tag of even investing in the platform.)</p>\n\n\n\n<p>The bridge to this is Apple’s built-in apps, allowing for a core degree of functionality as third-party software gradually gets built up. While the company has shown off a lot of its existing apps running on the platform, it seems to be taking a more conservative approach to pushing the ecosystem, potentially keeping its powder dry for a future big push centered around a more robust and populated platform.</p>\n\n\n\n<p>Even for a company as big and influential as Apple, there’s risk and volatility in releasing a brand-new platform. Everything about the nature of this launch says to me that the company is managing the long-term success of the platform. Whereas a big splashy launch could paint a target on the Vision Pro for those looking to call it a flop, Apple is instead flying under the radar, slowly and quietly building the Vision Pro up to give the device its best chance to be the company’s next big success story.</p>\n\nVirtual Reality, Wearables</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1e4c4e8ee20fc82218b003353ee1d585a8ac461ff0748d6c0f6b140cbc061381","category":"Apple"}