{"title":"WTB Gravelier saddle review: Breaking the mold","link":"https://www.cyclingtips.com/2023/04/wtb-gravelier-saddle-review/","date":1682008196000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-hero.jpg?width=1200\" alt=\"WTB Gravelier saddle review: Breaking the mold\" /></figure><p><span><a href=\"http://cyclingtips.com/tag/WTB\" target=\"_blank\">WTB</a> has launched a new saddle that strays from a number of things we typically expect from WTB. The WTB Gravelier saddle is the California company’s first foray into gravel-specific saddles, and that focus makes the saddle stand out compared to the other saddles in their range.</span></p>\n<p><span>The WTB Gravelier saddle is probably the first saddle from the California company I’ve seen with any mention of speed in its written copy. It also has a contemporary short nose shape, a central cutout for pressure relief in an aggressive, long, and low body position, and surprisingly little padding compared to even their other more performance-oriented saddles.</span></p>\n<p><span>This saddle strays away from what I expect from WTB — not that that makes it a bad thing. If anything, it seems like WTB knows exactly what they’re doing in making the new WTB Gravelier saddle.</span></p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-front-side.jpg?width=730\" alt=\"WTB Gravelier saddle base\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-front-side.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-front-side.jpg?width=190 190w\" /><figcaption>WTB designed the Gravelier with a bit of a dip with the goal of locking the rider’s hips in place. It was largely successful in this, in my experience. (Photo: Alvin Holbrook/CyclingTips)</figcaption></figure></figure>\n<figure></figure>\n<h2><span>An unfamiliar shape</span></h2>\n<p><span>The WTB Gravelier saddle is a clean-sheet design. The short-nosed saddle shape keeps up with recent trends with a 246 mm length and a 140 mm max width. These numbers are nearly identical to what you’d find from the popular short-nose saddles, including the <a href=\"https://www.cyclingtips.com/2017/10/specialized-power-vs-pro-stealth-stub-nose-saddle-comparison-review/\" target=\"_blank\">Specialized Power and Pro Stealth</a>. It is also fairly similar in dimensions to the likes of the <a href=\"https://www.cyclingtips.com/2021/08/selle-italia-model-x-green-superflow-saddle-review-only-50-rides-like-200/\" target=\"_blank\">Selle Italia Model X Green Superflow</a>.</span></p>\n<p><span>The Gravelier has a large cutout like the aforementioned saddles, though its overall shape is closest to the Pro Stealth due to its broader nose and flatter overall shape. It isn’t completely flat, however; the shape has a bit of a dip in the middle that WTB says “cradles the pelvis to provide ‘locked-in’ support.”</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-top-rear.jpg?width=730\" alt width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-top-rear.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-top-rear.jpg?width=190 190w\" /><figcaption>Yes, that is a large cutout on a WTB saddle. No, the sky isn’t falling. (Photo: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<p><span>WTB found that their team riders spent the majority of their time with their hips rotated in a forward-leaning pedaling position, which follows the need to cradle the pelvis. According to WTB, this initiated the need for everything a short-nose saddle offers: reduced pressure on sensitive areas with hips rotated forward with a wide nose for greater support when riding on the nose.</span></p>\n<p><span>Perhaps I’ve missed a WTB saddle or two in my time but this is the first WTB saddle I’ve seen with a full central cutout rather than a deep central channel. WTB says the full cutout was done after collecting pressure mapping data from their new WTB x Pivot Endurance Off-Road Team. </span></p>\n<p><span>Whereas the Pro Stealth is flat and thinly padded, however, the Gravelier has a bit more padding. There is more give to it than most performance-oriented saddles, and the foam feels softer to the touch than the <a href=\"https://www.cyclingtips.com/2023/04/ergon-allroad-collection-review-saddle-seatpost-and-handlebar-tape/\" target=\"_blank\">Ergon SR Allroad Core saddle</a>. </span></p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-base.jpg?width=730\" alt=\"WTB Gravelier saddle base\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-base.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-base.jpg?width=190 190w\" /><figcaption>The base of the Gravelier saddle is a “fiber-reinforced nylon” that is a bit stiffer than the forgiving bases WTB typically uses. (Photo: Alvin Holbrook/CyclingTips)</figcaption></figure></figure>\n<figure></figure>\n<figure></figure>\n<figure></figure>\n<p><span>There is also some give from what WTB calls their ‘Fusion Form’ base. This is a new base from WTB; their other performance-oriented saddles come with a ‘Flex-Tuned’ base. Fusion Form is designed to be their most supportive base that places an emphasis on support on the longer rides their racers come across at gravel events, with a “fiber-reinforced nylon base” regardless of what saddle rail you choose.</span></p>\n<p><span>At the back of the saddle sits a pair of bolt holes bolting shared the likes of Pro. This allows for a number of Pro’s accessories to be mounted to the back of the saddle, including a CO2 canister and tube holder, a universal Go-Pro mount, and a race number holder.</span></p>\n<p><span>WTB offers a 30-day return policy on their saddles, something I’m happy to see in the saddle world. Saddle choice is personal, so some real-world one-on-one time is imperative.</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-rails.jpg?width=730\" alt width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-rails.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-rails.jpg?width=190 190w\" /><figcaption>Titanium rails are on my test example. (Photo: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<p><span>My saddle for review was the WTB Gravelier with Titanium rails. WTB claims a weight of 210 grams, while my test sample weighed 209 grams.</span></p>\n<h2><span>The WTB Gravelier saddle, </span><i><span>ridden</span></i></h2>\n<p><span>Before I get into my impressions, I have to give you all my saddle review spiel: saddle choice is highly personal. A saddle that your friends rave about won’t mean guaranteed comfort, and the saddle you disliked previously might be something that works great for you.</span></p>\n<p><span>My personal preference for saddles is toward curvier, more supportive shapes. The Cadex Boost saddle is a good choice for me on the road, and I typically go for the Pro Stealth Offroad for gravel and trail messing about. </span></p>\n<p><span>Modern short-nose saddles have typically been a good choice for me, so long as the front of the saddle kicks up slightly to keep me better in place. Additionally, I prefer a nose that is slightly wider than the likes of something like a Specialized Power and closer to a Romin, as it gives me a better perch to hang out on as I move back and forth on the saddle to match the terrain.</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-base-detail.jpg?width=730\" alt=\"WTB-Gravelier-saddle-review---base detail\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-base-detail.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-base-detail.jpg?width=190 190w\" /><figcaption><span>The base of the Gravelier lists a range of useful information, including their suggested sit bone range. (Photo: Alvin Holbrook/CyclingTips)</span></figcaption></figure>\n<p><a href=\"https://www.wtb.com/pages/fit-right-system\"><span>The WTB ‘Fit Right System’</span></a><span> is, in my experience, a unique way to determine what saddle WTB thinks you should be riding. It takes your wrist measurement and then asks a question about your body shape, and your riding preferences to suggest a saddle that works best. It gave me an estimated sit bone measurement of 129 mm, placing me with their medium-width saddles. The Gravelier fits right into that.</span></p>\n<p><span>The Gravelier simply has less padding than one would find on WTB’s own saddles, bringing it in line with more traditional offerings. However, that same padding is denser than the other WTB saddles I’ve had on hand, closer to the Silverado in feel than the likes of the Volt. I’d call that kind of padding supportive, as I never tired of it on the longer rides I used it for. </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-top.jpg?width=730\" alt=\"WTB-Gravelier-saddle-review---top\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-top.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-top.jpg?width=190 190w\" /><figcaption>The Gravelier nose starts on the narrow end but widens quickly as it reaches the middle and end of the saddle. While this may seem to limit the number of positions possible on the saddle, I found I really only wanted the two the Gravelier offers anyways. (Photo: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<p><span>I was able to ride perched on the saddle’s nose without issues, but I could also move back to the wider part of the saddle and keep riding. The Gravelier’s flatter shape going left and right worked well for me as well. The saddle’s cover material offers just enough grippiness to help keep you in place when wearing Lycra, and it worked well in standard shorts and pants as well.</span></p>\n<p><span>WTB doesn’t claim any type of vibration damping, and to be fair I didn’t feel any extra vibrations compared to a typical saddle. Again, I didn’t have to think too much about it, which to me is about as good of praise as a saddle can receive.</span></p>\n<p><span>Connect the dots and you’ll find a saddle I get along with quite nicely in the WTB Gravelier. If anything, it is a saddle I’ve hardly thought about when I was riding it over the last month before its release. High praise when talking about a saddle</span></p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-back.jpg?width=730\" alt=\"WTB-Gravelier-saddle-review---back\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-back.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/WTB-Gravelier-saddle-review-back.jpg?width=190 190w\" /><figcaption>The back of the Gravelier has loop holes for extra bag support. The back of the saddle also curves up gently to support rotated-forward hips. (Photo: Alvin Holbrook/CyclingTips)</figcaption></figure></figure>\n<figure></figure>\n<figure>\n<figure></figure>\n</figure>\n<p><span>I really tried to pick nits when riding this saddle, and the closest thing I could find is that I thought the name, derived from the WTB Graveliers ambassador division, was a bit contrived. It’s not like I’m looking at the saddle name while I’m riding anyways, as long as I’m doing this biking thing correctly.</span></p>\n<h2><span>Conclusion</span></h2>\n<p><span>The Gravelier saddle seems like a break from what I expect from the WTB. The saddle is a good 30 + mm shorter than other WTB saddles, and the full-fledge cutout is unique in their lineup as well. And while I’ve gotten along well with the other saddles, the Gravelier is likely my go-to in the WTB lineup, both on my gravel bike and road bike for longer distances.</span></p>\n<p><span>Is being different a bad thing? Based on how well I got along with the Gravelier, not at all. The saddle shape worked great for my riding style, with plenty of comfort while pedaling on steep climbs, tucked down and in the drops, and with hands on the hood alike. If your saddle preferences match mine, I suspect you’ll find a happy home atop the Gravlelier. </span></p>\n<p><span>Price: $142.95, Ti rail option / € NA </span></p>\n<p><a href=\"https://www.wtb.com/\"><span>wtb.com</span></a></p>\n<figure></figure>\n<figure>\n<div></div>\n</figure>\n<figure></figure>","author":"Alvin Holbrook","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1e53cca08b2c96e150d190cfa91bd53569c513663621b75f5d837c8e1490daaf","category":"Cycling"}