{"title":"SpaceX’s Starship vehicle is ready to fly, just waiting for a launch license","link":"https://arstechnica.com/?p=1930354","date":1681131784000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/Starship-OFT-800x450.jpg\" alt=\"Starship is seen stacked on top of the Super Heavy rocket on April 5, 2023.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/Starship-OFT-scaled.jpg\">Enlarge</a> <span>/</span> Starship is seen stacked on top of the Super Heavy rocket on April 5, 2023. (credit: SpaceX)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>This weekend SpaceX engineers completed a final \"flight readiness review\" for the massive Super Heavy and Starship launch system, declaring the vehicle ready to make its debut test flight. SpaceX founder Elon Musk announced the decision early Sunday morning <a href=\"https://twitter.com/elonmusk/status/1644944993499357184\">on Twitter</a>, saying the vehicle was only \"awaiting regulatory approval\" before launching.</p>\n<p>Presently, the company is targeting April 17, at 7 am local time in South Texas (12:00 UTC) for the integrated flight test of the launch system. It should be quite a show—the combination of the Super Heavy first stage and Starship upper stage is the largest and most powerful rocket ever built.</p>\n<p>Sources said SpaceX has been working closely with the Federal Aviation Administration to provide the necessary data about Starship's performance and its impacts to the area surrounding the launch site. There is an expectation that a launch license will be issued this week, but there is no guarantee this will happen.</p></div><p><a href=\"https://arstechnica.com/?p=1930354#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1930354&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1e5e3cc4b3e3f76f8d41b2b755a5763a1982836b6818e67e0cede0e1d2b62a0c","category":"Tech"}