{"title":"iPhone 16 Models on Course for Exclusive AI Features Coming in iOS 18","link":"https://www.macrumors.com/2023/11/09/iphone-16-exclusive-ai-features-ios-18/","date":1699529512000,"content":"Apple at WWDC 2024 will reveal a turbo-charged version of Siri powered by large language models (LLMs) that will debut in iOS 18, but some new cutting-edge generative AI features could be exclusive to iPhone 16 models, according to a new rumor.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iPhone-16-Side-2-Feature.jpg\" width=\"3532\" height=\"1986\" />\r<br />\nLast month, <em>Bloomberg</em> reporter Mark Gurman revealed that Apple is developing a <a href=\"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/\">large array of features that use generative AI</a>, including a \"smarter version of Siri\" and new LLM-based AI features that will be baked into iOS 18 and iPadOS 18.\r<br />\n\r<br />\nGurman said Apple was still debating whether to limit generative AI to on-device processing, deploy it via the cloud, or adopt a hybrid approach combining the two. It was not mentioned either way whether some AI features would require specific hardware architecture or trickle down to all models capable of running iOS 18. \r<br />\n\r<br />\nHowever, according to new information independently shared by the leaker <a href=\"https://x.com/Tech_Reve/status/1722418466647625999?s=20\">@Tech_Reve</a>, iOS 18 will bring the company's new LLM to millions of existing devices by using cloud-based AI, while new on-device AI features will likely remain exclusive to the iPhone 16.\r<br />\n\r<br />\nIn terms of iOS 18 features, Gurman's sources mention a revamped interaction between ‌Siri‌ and the Messages app, enabling users to field complex questions and auto-complete sentences more effectively. We may also see auto-generated Apple Music playlists and integration with productivity apps like Pages and Keynote, such as AI-assisted writing and slide deck creation. Where this patina of AI integration crosses over into new hardware requirements is still unknown.\r<br />\n\r<br />\nApple is designing new A-series chips for the iPhone 16 lineup, built on TSMC's latest N3E 3-nanometer node. Efficiency and performance improvements are of course expected, but there could be other benefits that feed into Apple's AI intentions. Notably, TSMC is the sole manufacturer for Nvidia's powerful H100 and A100 AI processors, the hardware that powers AI tools like ChatGPT and which is also used in the majority of AI data centers.\r<br />\n\r<br />\nAll models in the iPhone 16 series are also <a href=\"https://www.macrumors.com/2023/10/31/iphone-16-extra-button-rumor/\">rumored to have an extra button</a> that we don't know the purpose of yet. Internal versions of the iPhone 16 that Apple is working on include an extra capacitive button, known internally as the \"Capture Button.\" \r<br />\n\r<br />\nThe button is located on the same side as the Power button, and is a capacitive button that is able to detect pressure and touch, providing haptic feedback when pressed. There has been no word yet on what this button might be used for, but it could conceivably have unforeseen practical AI applications.\r<br />\n\r<br />\nApple is said to be on course to spend $1 billion per year on AI research, with some of the company's biggest executive names overseeing development, including senior vice president of software engineering Craig Federighi, senior vice president of machine learning and AI strategy John Giannandrea, and senior vice president of services Eddy Cue.<div>Tags: <a href=\"https://www.macrumors.com/guide/artificial-intelligence/\">Artificial Intelligence</a>, <a href=\"https://www.macrumors.com/guide/revegnus/\">Revegnus</a>, <a href=\"https://www.macrumors.com/guide/apple-gpt/\">Apple GPT</a>, <a href=\"https://www.macrumors.com/guide/ios-18/\">iOS 18</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/09/iphone-16-exclusive-ai-features-ios-18/\">iPhone 16 Models on Course for Exclusive AI Features Coming in iOS 18</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-16-models-on-course-for-exclusive-ai-features-coming-in-ios-18.2410420/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1e6123044eade953f7b220633140784bf9c0559a0a931366b4f18fa0bcb29416","category":"Apple"}