{"title":"PSVII-25 Contributions to bacterial diversity of the piglet pioneer microbiome","link":"https://academic.oup.com/jas/article/102/Supplement_3/813/7757571?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The establishment of the gastrointestinal tract microbiome of the neonate, or pioneer microbiome, can predetermine the health and performance of the newborn. Previous work has established that both maternal and environmental sources are capable of shifting the pioneer microbial composition. Despite this, proportional quantifications of the maternal and environmental factors that influence the bacterial diversity of the piglet pioneer microbiome have yet to be evaluated. Therefore, the objective of this study was to determine the contributions from both maternal and environmental origins on piglet pioneer bacterial diversity. Sterile swab samples were collected from farrowing crates prior to (EMPTYCRATE) and after gilts were housed (FULLCRATE; n = 5; Landrace x Yorkshire x Duroc), gilt vaginas at farrowing (BIRTHCANAL), and piglet rectums on d 0 (pre-suckling), 3, and 10 post-farrowing and at weaning (21.6 ± 1.0 d post-farrowing). Colostrum (COLOSTRUM) from a representative number of teats was also collected from each gilt at farrowing into sterile collection cups. All samples were stored at -80°C until subsequent analyses. Gene sequencing for microbiome analysis targeted the V4 hypervariable region of the 16S rRNA bacterial gene. Sequence quality was assessed utilizing DADA2, and taxon analysis and diversity metrics were processed in the qiime2 pipeline. Alpha diversity (within sample) metrics were analyzed with Kruskal-Wallis, and beta diversity (between sample) metrics were assessed with PERMANOVA. Alpha diversity analyses included Pielou’s evenness index (i.e., within sample distribution), Shannon’s diversity index (i.e., within sample richness and evenness), observed OTUs (i.e., within sample richness), and Faith’s diversity index (i.e. within sample richness and phylogeny). Pielou’s evenness index (<span>P</span> = 0.027) and Shannon’s diversity index (<span>P</span> = 0.086) indicated differences between EMPTYCRATE and FULLCRATE. However, no differences were detected between the environmental sources for observed OTUs or Faith’s diversity index. Piglet samples by day were different for observed OTUs (<span>P</span> = 0.002), Faith’s diversity index (<span>P</span> = 0.0002), and Shannon’s diversity index (<span>P</span> = 0.073), which all consider bacterial richness within the samples. Specifically, the piglet d 3 samples were the least for these three metrics; however, there were no differences in Pielou’s evenness index for all piglet by day samples. There were no differences for all alpha diversity metrics between BIRTHCANAL and COLOSTRUM. Beta diversity metrics included unweighted UniFrac (i.e., between sample bacterial presence or absence) and weighted UniFrac (i.e., between sample bacterial presence or absence and abundance). Evaluation between the maternal contributions BIRTHCANAL and COLOSTRUM indicated differences for both unweighted UniFrac (<span>P</span> = 0.011) and weighted UniFrac (<span>P</span> = 0.007). Bacterial diversity between the environmental origins EMPTYCRATE and FULLCRATE were also different for unweighted UniFrac (<span>P</span> = 0.012) and weighted UniFrac (<span>P</span> = 0.038). There were no differences in beta diversity between all piglet by day samples. These results indicate that both maternal and environmental sources contribute to changes in piglet pioneer microbial diversity during early neonatal life.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1e65298f4cfe1c85110ccd95f6cdbf584b966cacd26294e77046af53b26dfc3c","category":"Environment"}