{"title":"Effects of temperature acclimation on the upper thermal tolerance of two Arctic fishes","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae001/7604663?rss=1","date":1707523200000,"content":"<span><div>Abstract</div>The thermally dynamic nearshore Beaufort Sea, Alaska, is experiencing climate change-driven temperature increases. Measuring thermal tolerance of broad whitefish (<span>Coregonus nasus</span>) and saffron cod (<span>Eleginus gracilis</span>), both important species in the Arctic ecosystem, will enhance understanding of species-specific thermal tolerances. The objectives of this study were to determine the extent that acclimating broad whitefish and saffron cod to 5°C and 15°C changed their critical thermal maximum (CT<sub>max</sub>) and HSP70 protein and mRNA expression in brain, muscle and liver tissues. After acclimation to 5°C and 15°C, the species were exposed to a thermal ramping rate of 3.4°C · h<sup>−1</sup> before quantifying the CT<sub>max</sub> and HSP70 protein and transcript concentrations. Broad whitefish and saffron cod acclimated to 15°C had a significantly higher mean CT<sub>max</sub> (27.3°C and 25.9°C, respectively) than 5°C-acclimated fish (23.7°C and 23.2°C, respectively), which is consistent with trends in CT<sub>max</sub> between higher and lower acclimation temperatures. There were species-specific differences in thermal tolerance with 15°C-acclimated broad whitefish having higher CT<sub>max</sub> and HSP70 protein concentrations in liver and muscle tissues than saffron cod at both acclimation temperatures. Tissue-specific differences were quantified, with brain and muscle tissues having the highest and lowest HSP70 protein concentrations, respectively, for both species and acclimation temperatures. The differences in broad whitefish CT<sub>max</sub> between the two acclimation temperatures could be explained with brain and liver tissues from 15°C acclimation having higher HSP70a-201 and HSP70b-201 transcript concentrations than control fish that remained in lab-acclimation conditions of 8°C. The shift in CT<sub>max</sub> and HSP70 protein and paralogous transcripts demonstrate the physiological plasticity that both species possess in responding to two different acclimation temperatures. This response is imperative to understand as aquatic temperatures continue to elevate.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"1e6754bd3fef1c53e6af0db060b445eee22c6a3182827aba73fcd84c5ef9d01b","category":"Environment"}