{"title":"Leu promotes C2C12 cell differentiation by regulating the GSK3β/β‐catenin signaling pathway through facilitating the interaction between SESN2 and RPN2","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13496?af=R","date":1711717374000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Leucine (Leu), an essential amino acid that facilitated skeletal muscle satellite cell differentiation, yet its mechanism remained underexplored. Sestrin2 (SESN2) served as a Leu sensor, binding directly to Leu, while Riboprotein II (RPN2) acted as a signaling factor in multiple pathways. This study aimed to elucidate Leu's impact on mouse C2C12 cell differentiation and skeletal muscle injury repair by modulating RPN2 expression through SESN2, offering a theoretical foundation for clinical skeletal muscle injury prevention and treatment.</p>\n<h2>Results</h2>\n<p>Leu addition promoted C2C12 cell differentiation compared to the control, enhancing early differentiation <i>via</i> MYOD up-regulation. Sequencing revealed SESN2 binding to and interacting with RPN2. RPN2 overexpression up-regulated MYOD, MYOG, and MYH2, concurrently decreased p-GSK3β, and increased nuclear β-catenin. Conversely, RPN2 knockdown yielded opposite results. Combining RPN2 knockdown with Leu rescued increased p-GSK3β and decreased nuclear β-catenin compared to Leu absence. HE staining results showed that Leu addition accelerated mouse muscle damage repair, up-regulating Pax7, MYOD, and RPN2 in the cytoplasm, and nuclear β-catenin, confirmed that the role of Leu's in muscle injury repair was consistent with the results in C2C12 cell.</p>\n<h2>Conclusion</h2>\n<p>Leu, bound with SESN2, up-regulated RPN2 expression, activated the GSK3β/β-catenin pathway, enhanced C2C12 differentiation, and expedited skeletal muscle damage repair.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Liu Yifan, \nJinping Li, \nDing Cong, \nHuili Tong, \nYunqin Yan, \nShuang Li, \nLi Shufeng, \nCao Yunkao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"1e6b5edb3585ad077ded84697d09bcbddd585bfa26ca8c638660e70cb6c0cff2","category":"Environment"}