{"title":"Obesity and age are transmission risk factors for SARS-CoV-2 infection among exposed individuals","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae294/7736245?rss=1","date":1724716800000,"content":"<span><div>Abstract</div>The coronavirus disease (COVID-19) pandemic has occurred in Massachusetts in multiple waves led by a series of emerging variants. While the evidence has linked obesity with severe symptoms of COVID-19, the effect of obesity on susceptibility to SARS-CoV-2 infection remains unclear. Identification of intrinsic factors, which increase the likelihood of exposed individuals succumbing to productive SARS-CoV-2 infection could help plan mitigation efforts to curb the illness. We aim to investigate whether obese individuals have a higher susceptibility to developing productive SARS-CoV-2 infection given comparable exposure to nonobese individuals. This case–control study leveraged data from the Mass General Brigham's (MGB) electronic medical records (EMR), containing 687,813 patients, to determine whether obesity at any age increases the proportion of infections. We used PCR results of 72,613 subjects who tested positive to SARS-CoV-2 or declared exposure to the virus independently of the result of the test. For this study, we defined susceptibility as the likelihood of testing positive upon suspected exposure. We demonstrate evidence that SARS-CoV-2 exposed obese individuals were more prone to become COVID positive than nonobese individuals [adjusted odds ratio = 1.34 (95% CI: 1.29–1.39)]. Temporal analysis showed significantly increased susceptibility in obese individuals across the duration of the pandemic in Massachusetts. Obese exposed individuals are at a higher risk of getting infected with SARS-CoV-2. This indicates that obesity is not only a risk factor for worsened outcomes but also increases the risk for infection upon exposure. Identifying such populations early will be crucial for curbing the spread of this infectious disease.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"1e6c0ed9740f9a9b32a6ad63263140c50e53e94836cc9b7f4dd19add85e9e793","category":"Interdisciplinary"}