{"title":"Apple Exec: We Feature Competitors' Apps 'All The Time' on the App Store","link":"https://www.macrumors.com/2021/05/07/apple-executive-feature-competing-apps/","date":1620389140000,"content":"On May 3, the <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a> trial <a href=\"https://www.macrumors.com/2021/05/03/epic-games-vs-apple-trial-begins/\">got underway</a>, and every day, new emails between Apple executives and employees continue to be shared by Epic as evidence for its case against Apple.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/09/apple-app-store-page.jpg\" />\r\n<br />\r\nIn the latest batch of emails, the vice president of the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, Matt Fischer, claims that Apple features apps made by its competitors \"all the time\" on the store and rejects the sentiment that it seeks to degrade the exposure of those apps. \r\n<br />\r\n\r\n<br />\r\nAccording to internal Apple correspondence submitted as evidence by Epic, an Apple employee wrote an email regarding a collection of apps on the ‌App Store‌ that were a part of the VoiceOver collection. In the email, which was forwarded to Sarah Herrlinger, Apple's senior director of global accessibility policy, the employee claims that Fisher feels \"extremely strong\" about not featuring competing apps on the platform. The email reads:\r\n<br />\r\n<blockquote>Hi Andrea,\r\n<br />\r\n\r\n<br />\r\nJust spoke with Tanya about featuring Google and Amazon apps in the VoiceOver collection and she asked us to exclude them from the lineup. Although they may be our best and the brightest apps, Matt feels extremely strong about not featuring our competitors on the ‌App Store‌ store, so Yanta asked us to apply the same filters for this collection. I'm sorry I didn't check this earlier.</blockquote>Responding to the claim made by the employee, Fischer says that Apple features and promotes competing apps on the ‌App Store‌ \"all the time,\" and cites the specific example of Apple featuring Peacock, Hulu, and Hulu Plus on the platform, despite them competing with its own <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a> streaming service.\r\n<br />\r\n\r\n<br />\r\nApple has long faced criticism that it decreases the exposure of competing third-party apps on the ‌App Store‌ when compared to its own apps. In 2019, the company <a href=\"https://www.macrumors.com/2019/09/09/apple-adjusts-app-store-search-algorithm/\">adjusted its App Store algorithm</a> after it realized that many of its apps were ranking higher on ‌App Store‌ search results rather than apps made by other developers. Despite the change, research from analytics firm Sensor Tower at the time showed that first-party Apple apps ranked first for over 700 search terms.\r\n<br />\r\n\r\n<br />\r\n<em>(Via <a href=\"https://www.imore.com/app-store-head-says-apple-promotes-competitors-apps-all-time\">iMore</a>)</em><div>Tag: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/07/apple-executive-feature-competing-apps/\">Apple Exec: We Feature Competitors' Apps 'All The Time' on the App Store</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-exec-we-feature-competitors-apps-all-the-time-on-the-app-store.2295191/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=BfdcMXk9DxU:-f_MxxKuJ3o:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=BfdcMXk9DxU:-f_MxxKuJ3o:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/BfdcMXk9DxU\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1e81da9dae0df8433110ce6b76061c63b16e1398dd07cc97dd840cf5d2400b82","category":"Apple"}