{"title":"Grassland woody plant management rapidly changes woody vegetation persistence and abiotic habitat conditions but not herbaceous community composition","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14716?af=R","date":1720607126000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/c7434406-198a-4969-8f5f-981bf05b126a/jpe14716-toc-0001-m.png\" alt=\"Grassland woody plant management rapidly changes woody vegetation persistence and abiotic habitat conditions but not herbaceous community composition\" />\n<p>Our findings suggest that management should focus on chemical intervention for the greatest effects on woody plant persistence and abiotic habitat conditions. Changes to herbaceous community composition may occur in the long term and seem likely since short-term effects of management were successful in altering processes related to encroachment feedbacks.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nGrasslands are among the most imperilled ecosystems worldwide, and many have experienced degradation due to the loss of historical disturbance regimes and subsequent woody encroachment. Management practitioners often use physical and chemical management interventions in combination with fire to counter encroachment, altering aboveground structure and belowground function, respectively. This may disrupt the feedbacks that perpetuate encroachment and restore the herbaceous community.\n\nWe use a large-scale field experiment to assess the initial effects of different management interventions on woody vegetation persistence, abiotic habitat conditions, and herbaceous community composition. We evaluate these effects across seven sites spanning a natural soil moisture gradient to capture one aspect of environmental heterogeneity with which managers regularly contend.\n\nWe found that chemical intervention, both with and without the addition of physical intervention, was most effective at reducing woody plant cover and abundance, and a second application reduced woody plant abundance by more than one application alone. We also found that any management intervention increased light availability and air temperature and decreased soil moisture, with the combination of physical and chemical interventions having the greatest effects. Finally, none of the management interventions affected herbaceous richness and functional group cover within the study period, indicating delayed or nonexistent effects on herbaceous community composition.\n\n<i>Synthesis and application</i>. Our findings suggest that management should focus on chemical intervention for the greatest effects on woody plant persistence and abiotic habitat conditions. Changes to herbaceous community composition may occur in the long term and seem likely since short-term effects of management were successful in altering processes related to encroachment feedbacks.\n</p>","author":"Katherine T. Charton, \nEllen I. Damschen","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"1e83a6deb14719267b03a8ba0b1fce69d1534c566e3536d31f990b059708ea3e","category":"Environment"}