{"title":"รับมือข้อมูลเท็จวัคซีนว่อนเน็ต ทำเนียบขาวจ้างอินฟลูเอนเซอร์วัยรุ่น ช่วยกระตุ้นแฟนๆ ให้มาฉีดวัคซีนกัน","link":"https://www.blognone.com/node/124014","date":1627870089000,"content":"<div><div><div><p>สหรัฐฯในขณะนี้กำลังรับมือกับโควิด-19 สายพันธุ์เดลตา ข้อมูลจาก CDC ระบุว่า ไม่ถึงครึ่งของชาวอเมริกันอายุ 18-39 ปีที่ได้รับการฉีดวัคซีนครบโดส และคนอายุ 12-17 ปี ราว 58% ยังไม่ได้ฉีดวัคซีน ซึ่งเทียบกับคนอายุมากกว่า 50 ปี ได้ฉีดแล้วถึง 2 ใน 3</p>\n<p>ทำเนียบขาวจึงแก้เกมด้วยการจ้างอินฟลูเอนเซอร์วัยรุ่นตาม TikTok, Twitch, YouTube ทำคอนเทนต์กระตุ้นให้แฟนๆ มาฉีดวัคซีนกันเยอะๆ เป้าหมายหลักคือ สื่อสารไปถึงคนอายุน้อย และตอบโต้ข้อมูลเท็จเกี่ยวกับวัคซีนที่กำลังท่วมท้นอินเทอร์เน็ตในขณะนี้</p>\n<p>ที่ผ่านมาทำเนียบขาวพยายามสื่อสารช่องทางออนไลน์อยู่เสมอ ดึงตัว Eugenio Derbez นักแสดงชาวเม็กซิกันที่มีผู้ติดตาม Instagram กว่า 16.6 ล้านคนที่เคยสงสัยเรื่องวัคซีน มาคุยกับ Anthony Fauci แพทย์ใหญ่ของอเมริกาผ่าน Instagram Live เป็นต้น แต่คนรุ่นใหม่มีแนวโน้มจะรับฟังเนื้อหาจากครีเอเตอร์มากกว่าคนดังในกระแสหลัก (ผลวิจัยจากบริษัทการตลาด MuseFind)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f1c47bc488b4dc4d2774d05725468322.jpg\" /><br />\nโจ ไบเดน และ Olivia Rodrigo นักแสดง นักร้อง<br />\nภาพจาก Facebook ทำเนียบขาว</p>\n<p>ทำเนียบขาวจึงจ้างอินฟลูเอนเอเซอร์ตามแพลตฟอร์มต่างๆ หลายราย ที่มีฐานแฟนคลับเยอะ ไม่ว่าจะเป็น Ellie Zeiler อายุ 17 ปี มีผู้ติดตามบน TikTok 10 ล้านราย,  Olivia Rodrigo อายุ 18 ปี,  Christina Najjar อายุ 30 ปีที่รู้จักใน TikTok ในชื่อ Tinx รวมถึงไมโครอินฟลูเอนเซอร์หลายรายที่มีผู้ติดตามหลักพันไปจนถึงหมื่น ช่วยเป็นกระบอกเสียงให้คนมาฉีดวัคซีน</p>\n<p>Rob Flaherty ผู้อำนวยการฝ่ายกลยุทธ์ดิจิทัลของทำเนียบขาวระบุว่า ทำเนียบขาวเริ่มใช้วิธีดึงครีเอเตอร์มาช่วยได้ระยะหนึ่งแล้ว และได้ร่วมมือกับ Village Marketing และ Made to Save แคมเปญระดับชาติที่มุ่งส่งเสริมการเข้าถึงวัคซีน จัดบรรยายผ่าน Zoom หลายครั้ง เพื่อให้ครีเอเตอร์สามารถถามคำถามเกี่ยวกับวัคซีนและวิธีการทำงานของมันได้</p>\n<p>ถือเป็นอีกวิธีที่สหรัฐฯพยายามกระตุ้นคนรุ่นใหม่ให้ไม่ลังเลใจที่จะไปฉีดวัคซีน เพราะมีจุดฉีดวัคซีนกระจายทั่วไปอยู่แล้ว ทั้งตามคลีนิค และร้านสะดวกซื้อ</p>\n<p>ที่มา - <a href=\"https://www.nytimes.com/2021/08/01/technology/vaccine-lies-influencer-army.html\">The New York Times</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/usa\">USA</a></div><div><a href=\"/topics/vaccine\">Vaccine</a></div><div><a href=\"/topics/covid-19\">COVID-19</a></div><div><a href=\"/topics/tiktok\">TikTok</a></div><div><a href=\"/topics/whitehouse\">Whitehouse</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1e84ed3d2b3b6aae9a07c1cbd9f6d082cfc804e0db811d221a7e0316b738108f","category":"Thai"}