{"title":"Hepatic and Gill Effects of Heavy Metals in Cichlid Fishes: A Systematic Review Based on In Situ Studies","link":"https://www.preprints.org/manuscript/202404.0370/v1","date":1712236233000,"content":"Environmental pollution is one of today's main ecological and social concerns.  Among these pollutants are the heavy metals present in the burning of fossil fuels, mining, smelting of metallic minerals, fertilizers and pesticides. Billions of tons of heavy metals are emitted every year from industrial chimneys and sewers, contaminating the hydrosphere and polluting rivers, lakes and seas. In this context, freshwater fish are the most affected due to their proximity to the source of contamination and are therefore used as bioindicators in assessing environmental impact following exposure to metals. However, our understanding of the effects of heavy metals on detoxification organs - such as the liver and gills - in freshwater fish in situ is still limited. Therefore, we conducted a systematic review to determine the main changes and mechanisms involved in morphological modifications in the liver and gills of cichlid fish following exposure to heavy metals in situ. Based on a structured search, 36 original articles were selected from the PubMed and SCOPUS databases. The selection of studies and the identification of duplicates were identified by Rayyan, and the study selection process was presented in the PRISMA statement diagram. Bias analysis was carried out using the Software Review Mananger (RevMan) 5.3, from the Cochrane Collaboration. Thirty-six studies were selected which showed negative effects attributed to environmental contamination by heavy metals, ranging from bioaccumulation to morphophysiological alterations. Almost all the heavy metals analyzed were found in the liver and gill tissues, especially cadmium, copper, lead, zinc, iron and manganese. In view of the continuous morphophysiological changes identified in the liver and gill studies, it is possible to state that bioaccumulation analyses, combined with these configurations, are emerging as crucial tools for assessing and guiding environmental monitoring. This approach aims not only to preserve but also to strengthen the integrity of the aquatic ecosystem and the ichthyofauna.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1e8a0ddae308c9f68f9fc205ac2d195a55e3b45a778ff579dc6c8062c184caf6","category":"Interdisciplinary"}