{"title":"Study protocol: Identifying transcriptional regulatory alterations of chronic effects of blast and disturbed sleep in United States Veterans","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301026","date":1711548000000,"content":"<p>by Molly J. Sullan, Kelly A. Stearns-Yoder, Zhaoyu Wang, Andrew J. Hoisington, Adam D. Bramoweth, Walter Carr, Yongchao Ge, Hanga Galfalvy, Fatemah Haghighi, Lisa A. Brenner</p>\r\n\r\nInjury related to blast exposure dramatically rose during post-911 era military conflicts in Iraq and Afghanistan. Mild traumatic brain injury (mTBI) is among the most common injuries following blast, an exposure that may not result in a definitive physiologic marker (e.g., loss of consciousness). Recent research suggests that exposure to low level blasts and, more specifically repetitive blast exposure (RBE), which may be subconcussive in nature, may also impact long term physiologic and psychological outcomes, though findings have been mixed. For military personnel, blast-related injuries often occur in chaotic settings (e.g., combat), which create challenges in the immediate assessment of related-injuries, as well as acute and post-acute sequelae. As such, alternate means of identifying blast-related injuries are needed. Results from previous work suggest that epigenetic markers, such as DNA methylation, may provide a potential stable biomarker of cumulative blast exposure that can persist over time. However, more research regarding blast exposure and associations with short- and long-term sequelae is needed. Here we present the protocol for an observational study that will be completed in two phases: Phase 1 will address blast exposure among Active Duty Personnel and Phase 2 will focus on long term sequelae and biological signatures among Veterans who served in the recent conflicts and were exposed to repeated blast events as part of their military occupation. Phase 2 will be the focus of this paper. We hypothesize that Veterans will exhibit similar differentially methylated regions (DMRs) associated with changes in sleep and other psychological and physical metrics, as observed with Active Duty Personnel. Additional analyses will be conducted to compare DMRs between Phase 1 and 2 cohorts, as well as self-reported psychological and physical symptoms. This comparison between Service Members and Veterans will allow for exploration regarding the natural history of blast exposure in a quasi-longitudinal manner. Findings from this study are expected to provide additional evidence for repetitive blast-related physiologic changes associated with long-term neurobehavioral symptoms. It is expected that findings will provide foundational data for the development of effective interventions following RBE that could lead to improved long-term physical and psychological health.","author":"Molly J. Sullan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1e9d016cb19d8b103f5e54a8e93f68e8b742f5e0a97211674c49e2ab2be70709","category":"Interdisciplinary"}