{"title":"Spatial variations and predictors of overweight/obesity among under-five children in Ethiopia: A geographically weighted regression analysis of the 2019 Ethiopian Mini Demographic and Health Survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312025","date":1728914400000,"content":"<p>by Agmasie Damtew Walle, Shimels Derso Kebede, Jibril Bashir Adem, Ermias Bekele Enyew, Habtamu Alganeh Guadie, Teshome Bekana, Habtamu Setegn Ngusie, Sisay Maru Wubante, Sisay Yitayih Kassie, Addisalem Workie Demsash, Wabi Temesgen Atinafu, Tigist Andargie Ferede</p>\r\nBackground <p>Overweight/ obesity among under-five children is an emerging public health issue of the twenty-first century. Due to the quick nutritional and epidemiological change, non-communicable diseases, premature death, disability, and reproductive disorders have grown in low-income countries. Besides, little attention has been given. Therefore, we aimed to explore spatial variations and predictors of overweight/obesity among under-five children in Ethiopia using a geospatial technique.</p> Methods <p>A total weighted sample of 3,609 under-five children was included in the study. A cross-sectional study was conducted using a nationally representative sample of the 2019 Ethiopia Mini Demographic and Health Survey data set. ArcGIS version 10.8 was used to explore the spatial variation of obesity. SaTScan version 9.6 software was used to analyze the spatial cluster detection of overweight/obesity. Ordinary least square and geographically weighted regression analysis were employed to assess the association between an outcome variable and explanatory variables. A p-value of less than 0.05 was used to declare it statistically significant.</p> Results <p>The spatial distribution of overweight/obesity among under-five children in Ethiopia was clustered (Global Moran’s I = 0.27, p-value&lt;0.001). The significant hot spot areas or higher rates of childhood obesity, were found in Southern Amhara, Northwest Somalia, Border of Harari, central Addis Ababa, Eastern SNNPR, and Northwestern Oromia region. In spatial SaT Scan analysis, 79 significant clusters of overweight/obesity were detected. The primary clusters were located in SNNPR, Oromia, and Addis Ababa (RR = 1.48, LLR = 31.40, P-value &lt; 0.001). In the geographically weighted regression analysis, urban residence, cesarean section, rich households, and female children were statistically significant predictors.</p> Conclusions <p>Overweight or obesity among under-five children show spatial variations across Ethiopian regions. GWR analysis identifies cesarean section, wealth index, urban residence, and child sex as significant predictors. The Ministry of Health and Ethiopian Public Health Institute should target regions with these contributing predictors, promoting localized physical education, health education campaigns, and ongoing community monitoring to encourage active lifestyles and reduce sedentary behaviors among children.</p>","author":"Agmasie Damtew Walle","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1ea2fced38aac78cb9956dbb5fe7ea234dbdc8561f07c574c0e1149bade8eac5","category":"Interdisciplinary"}