{"title":"A Giro d'Italia of fairytales continues","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-giro-ditalia-of-fairytales-continues","date":1684607746000,"content":"\n      <p>For all that the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>’s race for pink might be a frustrating slow burner, and while all the rain and crashes and illnesses make it appear that this is a cursed edition of the race, it’s equally true that this Corsa Rosa knows how to churn out fairytale stories one after the other.</p>\n<div></div>\n<p>On stage 14, a peculiar-looking day that included a HC climb early on but was characterised by near pan-flat terrain in the final 100km, Nico Denz, the unexpected hero on stage 12, converted himself into a superhero, doubling up to take a scarcely-believable second win in just three days. </p>\n<p>Prior to Thursday, the Bora-Hansgrohe rider had only won three races in 10 years on the WorldTour, and thus it was easy to understand just why he was in such disbelief after winning in Cassano Magnago. “This cannot be true,” he exclaimed. “It must be a dream. I don’t understand what’s going on. I’ve already told my soigneur to wake me up.” But it is true: out of a horrid two weeks of foul weather, Denz has emerged as one of cycling’s feel-good stories, a workhorse and a diesel engine finally getting his reward for a decade doing the hard yards as a domestique. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-stage-15-preview\"><strong><em>Read more: Giro d'Italia stage 15 preview - an up and down day in Lombardy</em></strong></a></p>\n<p>The same can be said of Bruno Armirail. Six years at the highest echelons of cycling have only brought with it one victory for the Groupama-FDJ man, that being the French national time trial championships almost a year ago. When he took to the startline of the fourteenth stage in Switzerland, he couldn’t have even imagined that five hours later with the race back in Italy he would be in the pink jersey. He was 18-37 back on the maglia rosa of Geraint Thomas, a distance so large that there were 21 riders separating the Welshman and the Frenchman.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography_-Giro_d_Italia_2023_-_Stage_14-07198.jpg?v=1684607411\" alt=\"Bruno Armirail\" /></p>\n<p><em>Bruno Armirail has taken over the overall lead of the Giro d'Italia (Zac Williams)</em></p>\n<p>But such was the way that the day played out, with 29 riders infiltrating the breakaway and just about all teams involved, Thomas and his Ineos Grenadiers team opted to take the day off, to save their legs for Sunday’s hilly profile around Lombardy and with an eye on a hellish final week in the Dolomites. The upside is that Thomas and co. crossed the line some 21 minutes after Denz, but crucially more than 20 minutes after Armirail, a time gap that saw him spectacularly leapfrog everyone else and into pink. It was an outcome that no-one, absolutely no-one, could have foreseen at the start, and no-one even thought of a possibility until the final hour-and-a-half of racing.</p>\n<p>This Giro is making a habit of creating new champions: first there was Jonathan Milan, a relatively unknown 22-year-old sprinter triumphing on stage two and now holding a very comfortable lead in the points classification. Then there was Davide Bais, a fellow Italian and equally under-the-radar rider representing Eolo-Kometa and winning stage seven on the Gran Sasso; he now has a lead of 30 points in the mountains classification to Thibaut Pinot. Both are enjoying a dream Giro d’Italia.</p>\n<p>Derek Gee is almost having a perfect Giro, too, the Canadian finishing second three times now and also placing fourth. His win will come, and if he needs convincing of that he only needs to look at Bais, at Milan, at Denz and, of course, the new race leader: Armirail. It’s been a nightmare Giro for so many, but for a handful it’s been nothing short of a fairytale.</p>\n<p><em>Cover photo by RCS Sport</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1eaba15d4a79feac1727d2a97c7f97b0f19b96ef90c7fcf332b67fc4863505eb","category":"Cycling"}