{"title":"Are Eurasian badgers responsible for lamb predation? An investigation using farmer interviews, post‐mortem examination and molecular tools","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12370?af=R","date":1725249668000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/6a997807-c61c-4f73-8706-2938c93eaa8c/eso312370-toc-0001-m.png\" alt=\"Are Eurasian badgers responsible for lamb predation? An investigation using farmer interviews, post-mortem examination and molecular tools\" />\n<p>DNA and post-mortem analysis were used to investigate claims that badgers kill lambs. The study found that foxes were responsible for all confirmed cases of predation. Badger DNA was recovered from the remains of two lambs for which cause of death could not be determined. This study highlights the importance of taking an evidence-based approach to investigating livestock predation, informing appropriate mitigation measures.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThis study investigates farmers' reports of lamb predation by badgers on Scottish sheep farms. Differentiating between predation and scavenging, and identifying the species responsible, is essential for livestock managers to effectively mitigate risk.\n\nQuestionnaire-style interviews established farmer perceptions of lamb predation by badgers and incidents of suspected predation were investigated on farms in 2022 and 2023 using post-mortem examination and molecular tools.\n\nFarmers submitted 29 carcasses for post-mortem. Of these, evidence of predation was present on 14 lambs (48%) and predation could not be ruled out for six further lambs (21%). No evidence of predation, but wounds consistent with scavenging after death, were present on nine lambs (31%). Nine (64%) of the 14 predated lambs also showed evidence of scavenging after death.\n\nSwabs were taken from 39 dead or injured lambs for potential predator/scavenger DNA recovery, and from 20 live control lambs. Badger DNA was obtained from the partial remains of two (5%) lambs. Badger DNA was not present on any of the carcasses submitted for post-mortem or from any living, wounded lambs. Fox DNA was obtained from 34 (87%) dead or injured lambs, including all lambs that exhibited evidence consistent with predation at post-mortem. Dog DNA was present on 12 (31%) lambs.\n\nWhile the results of this study cannot fully rule out the occurrence of lamb predation by badgers, no direct evidence was found to suggest that it does occur. The overall contribution of wildlife predation to lamb losses is considered to be low, but the results strongly suggest that foxes are likely to be responsible for lamb predation where it does occur. For livestock managers, a review of predator management strategies should be a key response to prevent future predation incidents.\n\n<i>Practical implications</i>. This study highlights the value of using post-mortem examination and molecular evidence to accurately confirm predation events and to identify predator species, informing appropriate management interventions.\n</p>","author":"Sheila George, \nSteve Campbell, \nHenny Martineau, \nCatherine Hale, \nJennifer Kaden, \nLucy M. I. Webster","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"1ecc19c896673a6642e2deb29a12163d166b88476aba341fe3cfd276df146cda","category":"Environment"}