{"title":"Research on enhancing the efficiency of food safety sampling inspections in China based on Pareto's law","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13822?af=R","date":1725453277000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Food safety is pivotal for public welfare and directly impacts consumer health. Food safety sampling inspections (FSSIs) are essential in detecting unqualified food products and non-compliant manufacturers, which form an integral part of government regulatory frameworks. However, given the constraints on budgetary resources, improving the efficiency of food safety sampling inspections (EFSSIs) remains a considerable challenge in China's food quality and safety supervision. This study aims to apply Pareto's law, starting from the examination of food sample testing items and major hazard types, to theoretically analyze methods for improving the EFSSIs. Following the theoretical analysis, the research employs provincial food sampling data from China in 2022 to empirically validate the proposed improvement strategies.</p>\n<h2>RESULTS</h2>\n<p>The research findings indicate that applying Pareto's law significantly reduces the number of items that should be tested for each food subcategory, effectively lowering testing costs for each batch of food samples. Theoretically, employing Pareto's law in sampling inspections can increase the EFSSIs to 2.78 times the current observed level. Furthermore, empirical validation using food sampling data confirms that EFSSIs can be improved to 2.12 times the existing level, consistent with theoretical predictions.</p>\n<h2>CONCLUSION</h2>\n<p>Implementing Pareto's law in FSSIs facilitates the detection of more unqualified food products and non-compliant manufacturers without additional financial burden, significantly enhancing the EFSSIs. This approach provides an innovative strategy for government to bolster their food safety management efforts. © 2024 Society of Chemical Industry.</p>","author":"Taiping Li, \nYun Luo, \nTong Zhao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"1ecd78ea34dd703a5d161047c4d48d40f67ce52a6046812a4ce4003108dceef2","category":"Environment"}