{"title":"Taxonomic revision of Sturisoma Swainson, 1838 (Loricariidae: Loricariinae), with descriptions of four new species","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15627?af=R","date":1712853919000,"content":"<h2>Abstract</h2>\n<p>A taxonomic revision of <i>Sturisoma</i> is presented. Individuals including both type and non-type specimens of all valid species were examined. <i>Sturisoma</i> was found to comprise 10 valid species: <i>Sturisoma barbatum</i>, <i>Sturisoma brevirostre</i>, <i>Sturisoma graffini</i>, <i>Sturisoma guentheri</i>, <i>Sturisoma lyra</i>, <i>Sturisoma monopelte</i>, <i>Sturisoma nigrirostrum</i>, <i>Sturisoma reisi</i>, <i>Sturisoma rostratum</i>, and <i>Sturisoma tenuirostre</i>. Furthermore, four new species are described: <i>Sturisoma ghazziae</i>, new species, from the Araguaia River, belonging to the Tocantins-Araguaia basin, Central Brazil; <i>Sturisoma careirensia</i>, new species, from the middle Amazon basin, Brazil; <i>Sturisoma rapppydanielae</i>, new species, from the Purus River, Amazon basin, Brazil; and <i>Sturisoma defranciscoi</i>, new species, from the Putumayo and Solimões rivers, upper Amazon basin, Colombia, and Brazil. <i>Sturisoma robustum</i> is confirmed as synonym of <i>S. barbatum</i>, species registered along the Paraguay/Parana/La Plata River basin in Argentina, Brazil, and Paraguay. New records were found for <i>S</i>. <i>nigrirostrum</i> as present in the upper Amazon basin, in the Yavari River, Brazil, in addition to its already known locality, the Ucayali River, Peru. The distribution of the type species of the genus <i>S</i>. <i>rostratum</i> is limited to the lower portion of the Amazon basin in the Araguaia, Maranhão, Mearim, Tapajós, and Tocantins rivers and its affluents, Brazil, in contrast to the assumed widespread distribution across the main basins of South America, as previously proposed for the species; the Mearim River is a new record for the species. Updated diagnoses and descriptions are offered for species of <i>Sturisoma</i>, in addition to distribution maps and an identification key for the species.</p>","author":"Alejandro Londoño‐Burbano, \nMarcelo R. Britto","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"1ecd1784a97a69cb0ccf22bf98a21a3172de24b2b65a6b57c01929512ee0931e","category":"Environment"}