{"title":"504 Relationship between vaginal microbiota and reproductive efficiency in dairy cows","link":"https://academic.oup.com/jas/article/102/Supplement_3/142/7757203?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Intrinsic and extrinsic factors determine the milk production of a dairy herd, which is affected by the reproductive efficiency of dairy farms. Infectious, nutritional, and management causes can negatively affect this efficiency. After parturition, dairy cows are sensible to clinical diseases since the physical barriers of the cervix, vagina, and vulva are compromised, allowing environmental bacteria to ascend, altering the vaginal microbiota. It is possible that the alteration of the microorganisms of the vaginal microbiota alters the response of circulating hormones related to a new conception and leads to repeat breeder cow syndrome. Repeat breeder cow (RBC) syndrome is considered when the cows have difficulties becoming pregnant after three or more attempts. This was investigated by associating the microorganisms of the vaginal microbiota with the circulating concentration of progesterone, glucose, and reproductive success in Holstein cows. We used 30 Holstein cows of similar body condition and parity (4<sup>th</sup>) assigned to two treatments based on their historical reproductive success. T-RBC with repeat breeder cow syndrome (n = 15), and T-control (CTL) without (n = 15). At insemination, we collected a vaginal mucosa sample from each cow. The samples were plated on blood agar and McConkey media under aerobiosis and micro-aerobiosis conditions. The isolated colonies were identified through Gram staining and specific biochemical tests to determine the genus and species of each bacterium. Blood samples were collected at insemination, d 5 post insemination, and every 2 d afterward for progesterone and glucose assay. Data for fertility were analyzed using PROC-GLIMMIX with a binomial distribution and logit link function. Data for progesterone and glucose were analyzed using MIXED effects and repetitive measures. Up to date, <span>Bacillus</span>, <span>E coli</span>, <span>Staphylococcus</span>, <span>Klebsiella</span>, <span>Proteus</span>, <span>Streptococcus</span>, and <span>Actinomyces</span> have been isolated. Over time, circulating progesterone and glucose did not differ between treatments (<span>P</span> &gt; 0.05). To date, the fertility rate is similar between treatments (33%; <span>P</span> &gt; 0.05); however, the number of services per conception differed (T-RBC:6 vs T-CTL:1; <span>P</span> &lt; 0.001). The incidence of <span>Bacillus</span> (31% vs 7%; <span>P</span> &lt; 0.001), <span>E. coli</span> (45% vs 4%; <span>P</span> &lt; 0.001), and <span>Staphylococcus</span> (23% vs 9%; <span>P</span> &lt; 0.01) was greater in non-pregnant cows than in pregnant cows. The incidence of the rest of the isolated bacteria was similar between pregnant and non-pregnant cows (<span>P</span> &gt; 0.05). This study suggests that the vaginal microbiota in dairy cows can change according to the reproductive state of the cow. Our study was based on fourth-parity cows; however, more research is needed to elucidate if the same condition is presented in cows with different parity.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1edb90e48ca8faf60d4d6f7412b322aa3388fac233d6f1d395dadbc6b7cd9dbe","category":"Environment"}