{"title":"Estimating the Effective Size of European Wolf Populations","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.70021?af=R","date":1729593497000,"content":"<h2>ABSTRACT</h2>\n<p>Molecular methods are routinely used to estimate the effective size of populations (<i>N</i>\n<sub>e</sub>). However, underlying model assumptions are frequently violated to an unknown extent. Although simulations can detect sources of bias and help to adjust sampling strategies and analyses methods, additional information from empirical data can also be used to calibrate methods and improve molecular <i>N</i>\n<sub>e</sub> estimation methods. Here, we take advantage of long-term genetic and ecological monitoring data of the grey wolf (<i>Canis lupus</i>) in Germany, and detailed population genetic studies in Poland, Spain and Portugal to improve <i>N</i>\n<sub>e</sub> estimation strategies in this species, and species with similar life history traits. We first calculated <i>N</i>\n<sub>e</sub> from average lifetime reproductive success and detailed census data from the German population, which served as a baseline to compare to molecular estimates based on linkage disequilibrium and sibship frequency. This yielded a robust <i>N</i>\n<sub>e</sub>/<i>N</i>\n<sub>c</sub> estimation that we used to calibrate molecular estimates of German, Polish and Iberian wolf populations. The linkage disequilibrium method was strongly influenced by spatial genetic structure, much more than the sibship frequency method. When <i>N</i>\n<sub>e</sub> was estimated in local neighbourhoods, both methods yielded comparable results. Estimates of the metapopulation effective size seemed to correspond generally well with the sum of the estimates of local neighbourhoods. Overall, we found that the number of packs is a good proxy of the effective population size. Using this as a rule of thumb, we evaluated for all European wolf populations the <i>N</i>\n<sub>e</sub> 500 indicator and concluded that half of the European wolf populations do not yet fulfil this criterion.</p>","author":"Joachim Mergeay, \nSander Smet, \nSebastian Collet, \nSabina Nowak, \nIlka Reinhardt, \nGesa Kluth, \nMaciej Szewczyk, \nRaquel Godinho, \nCarsten Nowak, \nRobert W. Mysłajek, \nGregor Rolshausen","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"1ee25116250350dc7e16cfcd9b1108822fe948ded121dc98358191e4302065a4","category":"Environment"}