{"title":"Geographical Patterns in Mortality Impacts Due To Heatwaves of Different Characteristics in Spanish Cities","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024GH001092?af=R","date":1722844504000,"content":"<h2>Abstract</h2>\n<p>The impact of heatwaves (HWs) on human health is a topic of growing interest due to the global magnification of these phenomena and their substantial socio-economic impacts. As for other countries of Southern Europe, Spain is a region highly affected by heat and its increase under climate change. This is observed in the mean values and the increasing incidence of extreme weather events and associated mortality. Despite the vast knowledge on this topic, it remains unclear whether specific types and characteristics of HW are particularly harmful to the population and whether this shows a regional interdependency. The present study provides a comprehensive analysis of the relationship between HW characteristics and mortality in 12 Spanish cities. We used separated time series analysis in each city applying a quasi-Poisson regression model and distributed lag linear and non-linear models. Results show an increase in the mortality risk under HW conditions in the cities with a lower HW frequency. However, this increase exhibits remarkable differences across the cities under study not showing any general pattern in the HW characteristics-mortality association. This relationship is shown to be complex and strongly dependent on the local properties of each city pointing out the crucial need to examine and understand on a local scale the HW characteristics and the HW-mortality relationship for an efficient design and implementation of prevention measures.</p>","author":"Laura Paredes‐Fortuny, \nCoral Salvador, \nAna M. Vicedo‐Cabrera, \nSamira Khodayar","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"1eeb5b684f46170492b68f0592680ec83f7e2de037646cdb86b20bfeca84d515","category":"Environment"}