{"title":"Lizzie Deignan: I would love to be able to aim for five monuments in my career","link":"https://www.cyclingtips.com/2023/04/lizzie-deignan-i-would-love-to-be-able-to-aim-for-five-monuments-in-my-career/","date":1681841319000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1235646767.jpg?width=1200\" alt=\"Lizzie Deignan: I would love to be able to aim for five monuments in my career\" /></figure><p><span>Lizzie Deignan’s return to racing after the birth of her second child was supposed to happen at the Vuelta Femenina in two week’s time. Although a seven-day stage race might sound like a brutal way to come back after an entire season away, the 34-year-old chose it as a way of adding a cluster of race days to her legs while she continued to find her form. </span></p>\n<p><span>Like many things in sport – and life – that didn’t quite go to plan, however. Her team, Trek-Segafredo, have had a number of riders sustain illnesses and injuries – as well as Ellen van Dijk taking her own maternity leave this year – that meant the British rider was called up to race a few weeks earlier than planned, at La Flèche Wallonne. </span></p>\n<p><span>Speaking to the media on the eve of her comeback, Deignan explained that she had low expectations for her first few races. </span></p>\n<p><span>“Physically, I’m good,” she said. “Training has gone really well, all of my endurance numbers are really good. I feel really physically fit. But in terms of like the top end, race punch fitness. I mean, I don’t have that. And I cannot ignore that I haven’t made those steps yet in training, to be here to win a race or whatever. But I hope physically that I’m strong enough to support the team tomorrow.”</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1168744383-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1168744383-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1168744383-scaled.jpg?width=190 190w\" /><figcaption><span>VARGARDA, SWEDEN – AUGUST 18: Elizabeth Deignan of United Kingdom and Team Trek – Segafredo / Marianne Vos of The Netherlands and Team CCC – Liv / during the 14th Postnord Vårgårda WestSweden – Road Race, a 145,3km stage from Vårgårda to Vårgårda / @vargardawwt / #UCIWWT / on August 18, 2019 in Vargarda, Sweden. (Photo by Luc Claessen/Getty Images)</span></figcaption></figure>\n<p><span>Being back at a race, Deignan says, is: “kind of a different range of emotions really. It’s really strange to be back at the same hotel that we always stay in. Nothing has really changed here but so much has changed in my life outside of it. So it’s kind of surreal. It’s a surreal feeling to be back. But also a really familiar and safe feeling to be back with Trek-Segafredo. I feel like I know the staff, I know the riders, I know my equipment so none of that is new. It’s just exciting, really.”</span></p>\n<p><span>As well as Flèche Wallonne, Deignan will race Liège-Bastogne-Liège on Sunday, a race she has won, but the win is far from her mind this year. “I think it’s pretty clear, if you look at our team lineup, that me and Lucinda [Brand] will be the real workers this week. And then the rest of the team is incredibly strong,” she says, highlighting Amanda Spratt, Gaia Realini, Shirin van Anrooij, and Elisa Longo Borghini (“her palmares speaks for itself, you never underestimate her in the Ardennes”) as “four real prospects that could win the race, both tomorrow and Liege.” </span></p>\n<p><span>“At the end of the day, I am a teammate. And it’s really important for me to support my teammates, and I could see that they were struggling in terms of filling the spots in terms of bad luck with crashes and sickness. And it would be silly for me to be at home training, when actually I can get the same things I need from racing,” she said of her early comeback. </span></p>\n<p><span>“There’s no pressure on me to be there in the final or to have a result. It’s really about just doing what I can for the team and I’m more than happy to do that.” </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1156100020-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1156100020-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-1156100020-scaled.jpg?width=190 190w\" /><figcaption><span>CARMARTHEN, WALES – JUNE 15: Podium / Lizzie Elizabeth Armitstead-Deignan of United Kingdom and Team Trek – Segafredo Blue HSBC UK British Cycling best British rider jersey / Celebration / during the 6th OVO Energy Women’s Tour 2019, Stage 6 a 125,9km stage from Carmarthen to Pembrey Country Park / #OVOWT / #UCIWWT / on June 15, 2019 in Carmarthen, Wales. (Photo by Charlie Crowhurst/Getty Images)</span></figcaption></figure>\n<p><span>While there might not be pressure on her right now, Deignan hopes that there will be some later on this season. Pointing out the new generation of talented British women such as Pfeiffer Georgi, Anna Henderson, and Alice Towers, Deignan said she is not taking her world championships selection for granted.</span></p>\n<p><span>“You might not be seeing riders on the podium or the top 10 right now. But I think actually there is a generation coming through. And I hope that I’m under pressure. I definitely don’t want to be comfortable in selection and things like that,” she said. </span></p>\n<p><span>“I’m certainly not sat here thinking, ‘okay, Glasgow, I’m sure that I’m going to have a spot in that team,’ which I think is a reflection of the pool of riders coming up. Because previously, I knew I was a shoo in for Yorkshire, but I don’t feel like that about Glasgow. I think I have to prove myself to be in that team. And I think that’s a really good indication of where the talent is.” </span></p>\n<p><span>It’s not just British riders that are putting Deignan under pressure, however. The former world champion described the noticeable rise in the level of the women’s peloton after she came back from having her first child. </span></p>\n<p><span>“The last time I had a year away from racing, there was a definite jump in the strength of the peloton,” she says. “So I don’t know if that will have happened again, probably it will have. When I stopped with Orla [her first child], I knew my numbers in training coming back were competitive in terms of comparison to myself on what had previously been able to produce in terms of power, but it had dropped in terms of the pecking order in the peloton. So I’m curious to see if that’s happened again.” </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-490158210-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-490158210-scaled.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/04/GettyImages-490158210-scaled.jpg?width=190 190w\" /><figcaption><span>RICHMOND, VA – SEPTEMBER 26: Elizabeth Armitstead of Great Britain reacts to winning the Elite Women’s Road Race on day seven of the UCI Road World Championships on September 26, 2015 in Richmond, Virginia. (Photo by Bryn Lennon/Getty Images)</span></figcaption></figure>\n<p><span>Deignan says that she is aware that things could be different in terms of her own physical performance this time, too. “In terms of my power and stuff it’s definitely taken a little bit longer this time to come round. I think that’s just because, I’ve said before, it was a harder pregnancy,” she says. </span></p>\n<p><span>“So that’s been difficult physically, but it will be interesting to see because the race programme is a little bit different now I have the Vuelta ahead of me not so far away. And you know, I have that back to back racing of a stage race to bring on my form hopefully quicker. So there are things that you know, and you take confidence from but I’m also still a bit in the unknown in terms of where my form will be in comparison to the other riders.”</span></p>\n<p><span>Despite the question mark above her form, however, Deignan has her sights set on some big goals in the coming years.</span></p>\n<p><span>“I would say for me the things that motivate me are obviously the same objectives like the World Championships and Olympics, but it would be really exciting for me to take part in the Tour de France,” she says. </span></p>\n<p><span>“Also the new opportunities that I hope are still going to come. I’m the rider with the most monuments at the moment. So I’d like to try and go for new monuments we don’t have, maybe we do, we don’t know yet. Milan San Remo and Lombardia. I would love to be able to aim for five monuments in my career that would be special.”</span></p>\n<p><span>One of the first high-profile, female riders to take up maternity leave and return to racing, Deignan has involuntarily become the face of motherhood in the peloton. Now, after giving birth twice and returning to racing for a second time, how does she see the landscape changing for women who want to start a family mid-career? </span></p>\n<p><span>“I’m just really pleased that it’s become normal and going forwards it will become more and more normal. I hope in the years to come a rider and announcing their pregnancy is just kind of seen as something that’s great news and ‘okay, we’ll see them next year’ sort of thing. We’re still not quite there, but I think we’ll get there” </span></p>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"1eef276e9b700ff00157d8fe46ae9812ab7040b0b36bde11fa558f0b945052b2","category":"Cycling"}