{"title":"Feasibility and acceptability of a novel biomedical device to prevent neonatal hypothermia and augment Kangaroo Mother Care in Kenya: Qualitative analysis of focus group discussions and key Informant Interviews","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001708","date":1713276000000,"content":"<p>by Nudar A. Bhuiya, Scott Liu, David Muyodi, Sherri L. Bucher</p>\r\n\r\nHypothermia is a leading newborn complication, especially among premature and/or low birth weight infants. Within low/middle-income countries where incubators and radiant warmers are often in short supply, leading to gaps in the thermal care chain, neonatal hypothermia underlies high rates of newborn morbidity and mortality. Kangaroo Mother Care/Skin-to-skin care is an effective method for prevention of hypothermia in premature and low birthweight babies but can be very burdensome for families and healthcare providers. Our international multidisciplinary team has developed a prototype for a wearable biomedical device (“NeoWarm”) to provide continuous thermal care and augment kangaroo mother care practices in low-resource settings. The objective of this study was to assess the feasibility and acceptability of NeoWarm and to obtain user design feedback for an early prototype from among adult end-users in Western Kenya. We performed key informant interviews (n = 17) among healthcare providers and 5 focus group discussions (FGDs) among 3 groups of adult stakeholders of premature babies, including: (1) parents/family members of premature babies aged 6 weeks or less (3 FGDs); (2) healthcare providers of newborns (e.g., nurses; physicians; 1 FGD); (3) community opinion leaders and stakeholders (e.g., traditional birth attendants; pastors; village elders; 1 FGD). Content and thematic analyses of transcripts indicate that NeoWarm is acceptable and feasible in promoting facility-based kangaroo mother care in the Kenyan setting. Novel findings derived from respondents include (1) the ability of the device to potentially overcome several barriers to traditional kangaroo mother care methods and (2) user-driven encouragement to expand the use case of the device to potentially include community-based kangaroo mother care and neonatal transport. User design feedback obtained during the interviews informed several key design iterations for subsequent prototypes of the device.","author":"Nudar A. Bhuiya","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"1ef1629a194c5077cff96bf94b7c3e6837a7bc346f0a8ecc8b9154bb56b8f510","category":"Environment"}