{"title":"Sexual and reproductive health research capacity strengthening programs in low- and middle-income countries: A scoping review","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003789","date":1727964000000,"content":"<p>by Julie M. Buser, Anna Grace Auma, Ella August, Gurpreet K. Rana, Rachel Gray, Faelan E. Jacobson-Davies, Tesfaye H. Tufa, Tamrat Endale, Madeleine Mukeshimana, Yolanda R. Smith</p>\r\n\r\nSexual and reproductive health (SRH) research capacity strengthening (RCS) programs in low- and middle-income countries (LMICs) are needed to foster the discovery of context-specific solutions to improve patient outcomes and population health. There remains a limited understanding of SRH research strengthening programs to raise skill sets, publications, and infrastructure and ultimately influence health policy and patient outcomes in LMICs. More information is needed to understand how SRH research is sustained after program completion. To inform efforts to implement programs that strengthen SRH research and foster sustainability, we conducted a scoping review to identify and synthesize strategies used in SRH research strengthening programs in LMICs. A literature search of nine scholarly databases was conducted. We synthesized data extracted from included articles and presented results highlighting the format, duration, and topics covered of program interventions to strengthen SRH research in LMICs. We organized information about primary outcomes into themes and summarized how SRH research capacity was sustained after program completion. Twenty-four articles were included in the scoping review. The articles generally focused on outcomes within the themes of advocacy/capacity, education, policy, project life cycle, and writing/publication. Few articles reported metrics or other evidence of long-term program sustainability of SRH RCS projects in LMICs. Results from this scoping review can be used to strengthen SRH research programs in LMICs. More energy must be directed toward correcting power imbalances in capacity strengthening initiatives. To address additional gaps, future directions for research should include an exploration of SRH research mentorship, the cost of SRH RCS interventions, and how to foster institutional support.","author":"Julie M. Buser","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"1ef2511afb841d4d08567b2980d72e597cda7ecea2dda93db8a4b372141f37be","category":"Environment"}