{"title":"Building The SSG I’ve Always Wanted: An 11ty, Vite And JAM Sandwich","link":"https://smashingmagazine.com/2021/10/building-ssg-11ty-vite-jam-sandwich/","date":1634727600000,"content":"<p>I don’t know about you, but I’ve been <em>overwhelmed</em> by all the web development tools we have these days. Whether you like Markdown, plain HTML, React, Vue, Svelte, Pug templates, Handlebars, Vibranium — you can probably mix it up with some CMS data and get a nice static site cocktail.</p>\n<p>I’m not going to tell you which UI development tools to reach for because they’re all great — depending on the needs of your project. This post is about finding the perfect static site generator for <em>any</em> occasion; something that lets us use JS-less templates like markdown to start, and bring in “islands” of component-driven interactivity as needed.</p>\n<p>I’m distilling a year’s worth of learnings into a single post here. Not only are we gonna talk code (aka duct-taping 11ty and Vite together), but we’re also going to explore <em>why</em> this approach is so universal to Jamstackian problems. We’ll touch on:</p>\n<ul>\n<li>Two approaches to static site generation, and why we should bridge the gap;</li>\n<li>Where templating languages like Pug and Nunjucks still prove useful;</li>\n<li>When component frameworks like React or Svelte should come into play;</li>\n<li>How the new, hot-reloading world of Vite helps us bring JS interactivity to our HTML with almost zero configs;</li>\n<li>How this complements 11ty’s data cascade, bringing CMS data to any component framework or HTML template you could want.</li>\n</ul>\n<p>So without further ado, here’s my tale of terrible build scripts, bundler breakthroughs, and spaghetti-code-duct-tape that (eventually) gave me the SSG I always wanted: an 11ty, Vite and Jam sandwich called <a href=\"https://slinkity.dev\">Slinkity</a>!</p>\nA Great Divide In Static Site Generation\n<p>Before diving in, I want to discuss what I’ll call two “camps” in static site generation. </p>\n<p>In the first camp, we have the <strong>“simple” static site generator.</strong> These tools don’t bring JavaScript bundles, single-page apps, and any other buzzwords we’ve come to expect. They just nail the Jamstack fundamentals: pull in data from whichever JSON blob of CMS you prefer, and slide that data into plain HTML templates + CSS. Tools like Jekyll, Hugo, and 11ty dominate this camp, letting you turn a directory of markdown and <a href=\"https://shopify.github.io/liquid/\">liquid</a> files into a fully-functional website. Key benefits:</p>\n<ul>\n<li><strong>Shallow learning curve</strong><br />If you know HTML, you’re good to go!</li>\n<li><strong>Fast build times</strong><br />We’re not processing anything complex, so each route builds in a snap.</li>\n<li><strong>Instant time to interactive</strong><br />There’s no (or very little) JavaScript to parse on the client.</li>\n</ul>\n<p>Now in the second camp, we have the <strong>“dynamic” static site generator.</strong> These introduce component frameworks like React, Vue, and Svelte to bring interactivity to your Jamstack. These fulfill the same core promise of combining CMS data with your site’s routes at build time. Key benefits:</p>\n<ul>\n<li><strong>Built for interactivity</strong><br />Need an animated image carousel? Multi-step form? Just add a componentized nugget of HTML, CSS, and JS.</li>\n<li><strong>State management</strong><br />Something like React Context of Svelte stores allow seamless data sharing between routes. For instance, the cart on your e-commerce site.</li>\n</ul>\n<p>There are distinct pros to either approach. But what if you choose an SSG from the first camp like Jekyll, only to realize six months into your project that you need some component-y interactivity? Or you choose something like NextJS for those powerful components, only to struggle with the learning curve of React, or needless KB of JavaScript on a static blog post?</p>\n<p>Few projects <em>squarely</em> fit into one camp or the other in my opinion. They exist on a spectrum, constantly favoring new feature sets as a project’s needs evolve. So how do we find a solution that lets us <em>start</em> with the simple tools of the first camp, and gradually add features from the second when we need them?</p>\n<p>Well, let’s walk through my learning journey for a bit.</p>\n<p><strong>Note:</strong> <em>If you’re already sold on static templating with 11ty to build your static sites, feel free to <a href=\"#11ty-vite-a-match-made-in-heaven\">hop down to the juicy code walkthrough</a>.</em> 😉</p>\nGoing From Components To Templates And Web APIs\n<p>Back in January 2020, I set out to do what just about every web developer does each year: rebuild my personal site. But this time was gonna be <em>different.</em> I challenged myself to build a site with my hands tied behind my back, <strong>no frameworks or build pipelines allowed!</strong></p>\n<p>This was no simple task as a React devotee. But with my head held high, I set out to build my own build pipeline from absolute ground zero. There’s a lot of poorly-written code I <em>could</em> share from v1 of my personal site... but I’ll let you <a href=\"https://github.com/Holben888/bholmesdev/tree/v1\">click this README</a> if you’re so brave. 😉 Instead, I want to focus on the higher-level takeaways I learned starving myself of my JS guilty pleasures.</p>\n<h3>Templates Go A Lot Further Than You Might Think</h3>\n<p>I came at this project a recovering JavaScript junky. There are a few static-site-related needs I loved using component-based frameworks to fill:</p>\n<ol>\n<li><strong>We want to break down my site into reusable UI components</strong> that can accept JS objects as parameters (aka “props”).</li>\n<li><strong>We need to fetch some information at build time</strong> to slap into a production site.</li>\n<li><strong>We need to generate a bunch of URL routes</strong> from either a directory of files or a fat JSON object of content.</li>\n</ol>\n<p><em>List taken from <a href=\"https://bholmes.dev/blog/before-building-your-next-static-site-with-react-consider-this/\">this post</a> on my personal blog.</em></p>\n<p>But you may have noticed... none of these <em>really</em> need clientside JavaScript. Component frameworks like React are mainly built to handle state management concerns, like the Facebook web app inspiring React in the first place. If you’re just breaking down your site into bite-sized components or design system elements, templates like Pug work pretty well too!</p>\n<p>Take this navigation bar for instance. In Pug, we can define a “mixin” that receives data as props:</p>\n<pre><code>// nav-mixins.pug\nmixin NavBar(links)\n    // pug's version of a for loop\n    each link in links\n        a(href=link.href) link.text</code></pre>\n\n<p>Then, we can apply that mixin anywhere on our site.</p>\n<pre><code>// index.pug\n// kinda like an ESM \"import\"\ninclude nav-mixins.pug\nhtml\n  body\n    +NavBar(navLinksPassedByJS)\n    main\n      h1 Welcome to my pug playground 🐶</code></pre>\n\n<p>If we “render” this file with some data, we’ll get a beautiful <code>index.html</code> to serve up to our users.</p>\n<pre><code>const html = pug.render('/index.pug', { navLinksPassedByJS: [\n    { href: '/', text: 'Home' },\n    { href: '/adopt', text: 'Adopt a Pug' }\n] })\n// use the NodeJS filesystem helpers to write a file to our build\nawait writeFile('build/index.html', html)</code></pre>\n\n<p>Sure, this doesn’t give niceties like scoped CSS for your mixins, or stateful JavaScript where you want it. But it has some very powerful benefits over something like React:</p>\n<ol>\n<li><strong>We don’t need fancy bundlers we don’t understand.</strong><br />We just wrote that <code>pug.render</code> call by hand, and we already have the first route of a site ready-to-deploy.</li>\n<li><strong>We don’t ship any JavaScript to the end-user.</strong><br />Using React often means sending a big ole runtime for people’s browsers to run. By calling a function like <code>pug.render</code> at build time, we keep all the JS on our side while sending a clean <code>.html</code> file at the end.</li>\n</ol>\n<p>This is why I think templates are a great “base” for static sites. Still, being able to reach for component frameworks where we <em>really</em> benefit from them would be nice. More on that later. 🙃</p>\n<p><strong>Recommended Reading</strong>: <a href=\"https://www.smashingmagazine.com/2020/05/angular-templates-pug/\"><em>How To Create Better Angular Templates With Pug</em></a> by Zara Cooper</p>\n<h3>You Don’t Need A Framework To Build Single Page Apps</h3>\n<p>While I was at it, I also wanted some sexy page transitions on my site. But how do we pull off something like this without a framework?</p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1cfcdeb4-7d7f-4261-a55b-8ba45d0a5c02/page-transitions.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1cfcdeb4-7d7f-4261-a55b-8ba45d0a5c02/page-transitions.gif\" /></a>Crossfade with vertical wipe transition. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1cfcdeb4-7d7f-4261-a55b-8ba45d0a5c02/page-transitions.gif\">Large preview</a>)\n\n<p>Well, we can’t do this if every page is its own <code>.html</code> file. The whole browser refreshes when we jump from one HTML file to the other, so we can’t have that nice cross-fade effect (since we’d briefly show both pages on top of each other).</p>\n<p>We need a way to “fetch” the HTML and CSS for wherever we’re navigating to, and animate it into view using JavaScript. This sounds like a job for single-page apps!\nI used a simple browser API medley for this:</p>\n<ol>\n<li>Intercept all your link clicks using an event listener.</li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API\"><strong>fetch API</strong></a><strong>:</strong> Fetch all the resources for whatever page you want to visit, and grab the bit I want to animate into view: the content outside the navbar (which I want to remain stationary during the animation).</li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Web_Animations_API\"><strong>web animations API</strong></a><strong>:</strong> Animate the new content into view as a keyframe.</li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/History_API\"><strong>history API</strong></a><strong>:</strong> Change the route displaying in your browser’s URL bar using <code>window.history.pushState({}, 'new-route')</code>. Otherwise, it looks like you never left the previous page!</li>\n</ol>\n<p>For clarity, here’s a visual illustration of that single page app concept using a simple find-and-replace (<a href=\"https://bholmes.dev/blog/spas-clientside-routing/\"><em>source article</em></a>):</p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a013427d-89c6-423f-9f22-fb5add5b69a6/1-building-ssg-11ty-vite-jam-sandwich.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a013427d-89c6-423f-9f22-fb5add5b69a6/1-building-ssg-11ty-vite-jam-sandwich.gif\" /></a>Step-by-step clientside routing process: 1. Medium rare hamburger is returned, 2. We request a well done burger using the fetch API, 3. We massage the response, 4. We pluck out the 'patty' element and apply it to our current page. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a013427d-89c6-423f-9f22-fb5add5b69a6/1-building-ssg-11ty-vite-jam-sandwich.gif\">Large preview</a>)\n\n<p><strong>Note</strong>: <em>You can also <a href=\"https://github.com/Holben888/bholmesdev/blob/v1/src/routes/_layout/client.js#L80-L96\">visit the source code</a> from my personal site.</em></p>\n<p>Sure, some pairing of React et al and your animation library of choice can do this. But for a use case as simple as a fade transition... web APIs are pretty dang powerful on their own. And if you want more robust page transitions on static templates like Pug or plain HTML, libraries like <a href=\"https://swup.js.org\">Swup</a> will serve you well.</p>\nWhat 11ty Brought To The Table\n<p>I was feeling pretty good about my little SSG at this point. Sure it couldn’t fetch any CMS data at build-time, and didn’t support different layouts by page or by directory, and didn’t optimize my images, and didn’t have incremental builds.</p>\n<p>Okay, I might need some help.</p>\n<p>Given all my learnings from v1, I thought I earned my right to drop the “no third-party build pipelines” rule and reach for existing tools. Turns out, 11ty has a treasure trove of features I need!</p>\n<ul>\n<li><a href=\"https://www.11ty.dev/docs/data-template-dir/\">Data fetching at buildtime</a> using <code>.11ydata.js</code> files;</li>\n<li><a href=\"https://www.11ty.dev/docs/data-global/\">Global data</a> available to <em>all</em> my templates from a <code>_data</code> folder;</li>\n<li><a href=\"https://www.11ty.dev/docs/usage/#re-run-eleventy-when-you-save\">Hot reloading</a> during development using browsersync;</li>\n<li>Support for <a href=\"https://www.11ty.dev/docs/config/#transforms\">fancy HTML transforms</a>;</li>\n<li>...and countless other goodies.</li>\n</ul>\n<p>If you’ve tried out bare-bones SSGs like Jekyll or Hugo, you should have a pretty good idea of how 11ty works. Only difference? 11ty uses JavaScript through-and-through.</p>\n<p>11ty supports basically every template library out there, so it was happy to render all my Pug pages to <code>.html</code> routes. It’s layout chaining option helped with my faux-single-page-app setup too. I just needed a single <code>script</code> for all my routes, and a “global” layout to import that script:</p>\n<pre><code>// _includes/base-layout.html\n&lt;html&gt;\n&lt;body&gt;\n  &lt;!--load every page's content between some body tags--&gt;\n  {{ content }}\n  &lt;!--and apply the script tag just below this--&gt;\n  &lt;script src=\"main.js\"&gt;&lt;/script&gt;\n&lt;/body&gt;\n&lt;/html&gt;\n\n// random-blog-post.pug\n---\nlayout: base-layout\n---\n\narticle\n  h2 Welcome to my blog\n  p Have you heard the story of Darth Plagueis the Wise?</code></pre>\n\n<p>As long as that <code>main.js</code> does all <a href=\"#you-don-t-need-a-framework-to-build-single-page-apps\">that link intercepting we explored</a>, we have page transitions!</p>\n<h3>Oh, And The Data Cascade</h3>\n<p>So 11ty helped clean up all my spaghetti code from v1. But it brought another important piece: <strong>a clean API to load data into my layouts.</strong> This is the bread and butter of the <a href=\"https://jamstack.org/what-is-jamstack/\">Jamstack</a> approach. Instead of fetching data in the browser with JavaScript + DOM manipulation, you can:</p>\n<ol>\n<li><strong>Fetch data at build-time using Node.</strong><br />This could be a call to some external API, a local JSON or YAML import, or even <a href=\"https://www.11ty.dev/docs/collections/\">the content of <em>other routes</em> on your site</a> (imagine updating a table-of-contents whenever new routes are added 🙃).</li>\n<li>Slot that data into your routes. Recall that <code>.render</code> function we wrote earlier:</li>\n</ol>\n<pre><code>const html = pug.render('/index.pug', { navLinksPassedByJS: [\n    { href: '/', text: 'Home' },\n    { href: '/adopt', text: 'Adopt a Pug' }\n] })</code></pre>\n\n<p>...but instead of calling <code>pug.render</code> with our data every time, we let 11ty do this behind-the-scenes.</p>\n<p>Sure, I didn’t have a lot of data for my personal site. But it felt great to whip up a <code>.yaml</code> file for all my personal projects:</p>\n<pre><code># _data/works.yaml\n- title: Bits of Good Homepage\n  hash: bog-homepage\n  links:\n    - href: https://bitsofgood.org\n      text: Explore the live site\n    - href: https://github.com/GTBitsOfGood/bog-web\n      text: Scour the Svelt-ified codebase\n  timeframe: May 2019 - present\n  tags:\n    - JAMstack\n    - SvelteJS\n- title: Dolphin Audio Visualizer\n...</code></pre>\n\n<p>And access that data across any template:</p>\n<pre><code>// home.pug\n.project-carousel\n  each work in works\n    h3 #{title}\n    p #{timeframe}\n    each tag in tags\n    ...</code></pre>\n\n<p>Coming from the world of “<a href=\"https://www.applozic.com/blog/right-way-to-render-your-jamstack-site/\">clientside rendering</a>” with <a href=\"https://create-react-app.dev\">create-react-app</a>, this was a pretty big revelation. No more sending API keys or big JSON blobs to the browser. 😁</p>\n<p>I also added some goodies for JavaScript fetching and animation improvements over version 1 of my site. If you’re curious, here’s <a href=\"https://github.com/Holben888/bholmesdev#readme\">where my README stood</a> at this point.</p>\nI Was Happy At This Point But Something Was Missing\n<p>I went surprisingly far by abandoning JS-based components and embracing templates (with animated page transitions to boot). But I know this won’t satisfy my needs forever. Remember that great divide I kicked us off with? Well, there’s clearly still that ravine between my build setup (firmly in camp #1) and the haven of JS-ified interactivity (the Next, SvelteKit, and more of camp #2). Say I want to add:</p>\n<ul>\n<li>a pop-up modal with an open/close toggle,</li>\n<li>a component-based design system like <a href=\"https://material-ui.com\">Material UI</a>, complete with scoped styling,</li>\n<li>a complex multi-step form, maybe driven by <a href=\"https://xstate.js.org/docs/\">a state machine</a>.</li>\n</ul>\n<p>If you’re a plain-JS-purist, you probably have framework-less answers to all those use cases. 😉  But there’s a reason JQuery isn’t the norm anymore! There’s something appealing about creating discrete, easy-to-read components of HTML, scoped styles, and pieces of JavaScript “state” variables. React, Vue, Svelte, etc. offer so many niceties for debugging and testing that straight DOM manipulation can’t quite match.</p>\n<p>So here’s my million dollar question:</p>\n<blockquote>Can we use straight HTML templates to start, and gradually add React/Vue/Svelte components where we want them?</blockquote>\n\n<p>The answer is <em>yes</em>. Let’s try it.</p>\n11ty + Vite: A Match Made In Heaven ❤️\n<p>Here's the dream that I’m imagining here. Wherever I want to insert something interactive, I want to leave a little flag in my template to “put X React component here.” This could be the <a href=\"https://www.11ty.dev/docs/shortcodes/\">shortcode syntax</a> that 11ty supports:</p>\n<pre><code># Super interesting programming tutorial\n\nWriting paragraphs has been fun, but that's no way to learn. Time for an interactive code example!\n\n{% react './components/FancyLiveDemo.jsx' %}</code></pre>\n\n<p>But remember, the one-piece 11ty (purposely) avoids: a way to bundle all your JavaScript. Coming from the OG guild of bundling, your brain probably jumps to building Webpack, Rollup, or Babel processes here. Build a big ole entry point file, and output some beautiful optimized code right?</p>\n<p>Well yes, but this can get pretty involved. If we’re using React components, for instance, we’ll probably need some loaders for JSX, a fancy Babel process to transform everything, an interpreter for SASS and CSS module imports, <em>something</em> to help with live reloading, and so on.</p>\n<p>If only there were a tool that could just see our <code>.jsx</code> files and know exactly what to do with them.</p>\n<h3>Enter: Vite</h3>\n<p><a href=\"https://vitejs.dev\">Vite</a>’s been the talk of the town as of late. It’s meant to be the all-in-one tool for building just about anything in JavaScript. Here’s an example for you to try at home. Let’s make an empty directory somewhere on our machine and install some dependencies:</p>\n<pre><code>npm init -y # Make a new package.json with defaults set\nnpm i vite react react-dom # Grab Vite + some dependencies to use React</code></pre>\n\n<p>Now, we can make an <code>index.html</code> file to serve as our app’s “entry point.” We’ll keep it pretty simple:</p>\n<pre><code>&lt;!DOCTYPE html&gt;\n&lt;html lang=\"en\"&gt;\n&lt;head&gt;\n  &lt;meta charset=\"UTF-8\"&gt;\n  &lt;meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge\"&gt;\n  &lt;meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\"&gt;\n  &lt;title&gt;Document&lt;/title&gt;\n&lt;/head&gt;\n&lt;body&gt;\n  &lt;h1&gt;Hello Vite! (wait is it pronounced \"veet\" or \"vight\"...)&lt;/h1&gt;\n  &lt;div id=\"root\"&gt;&lt;/div&gt;\n&lt;/body&gt;\n&lt;/html&gt;</code></pre>\n\n<p>The only interesting bit is that <code>div id=\"root\"</code> in the middle. This will be the root of our React component in a moment!</p>\n<p>If you want, you can fire up the Vite server to see our plain HTML file in your browser. Just run <code>vite</code> (or <code>npx vite</code> if the command didn’t get configured in your terminal), and you’ll see this helpful output:</p>\n<pre><code>vite vX.X.X dev server running at:\n\n&gt; Local: http://localhost:3000/\n&gt; Network: use `--host` to expose\n\nready in Xms.</code></pre>\n\n<p>Much like Browsersync or other popular dev servers, the name of each <code>.html</code> file corresponds to a route on our server. So if we renamed <code>index.html</code> to <code>about.html</code>, we would visit <code>http://localhost:3000/about/</code> (yes, you’ll need a trailing slash!)</p>\n<p>Now let’s do something interesting. Alongside that <code>index.html</code> file, add a basic React component of some sort. We’ll use React’s <code>useState</code> here to demonstrate interactivity:</p>\n<pre><code>// TimesWeMispronouncedVite.jsx\nimport React from 'react'\n\nexport default function TimesWeMispronouncedVite() {\n  const [count, setCount] = React.useState(0)\n  return (\n    &lt;div&gt;\n      &lt;p&gt;I've said Vite wrong {count} times today&lt;/p&gt;\n      &lt;button onClick={() =&gt; setCount(count + 1)}&gt;Add one&lt;/button&gt;\n    &lt;/div&gt;\n  )\n}</code></pre>\n\n<p>Now, let’s load that component onto our page. This is all we have to add to our <code>index.html</code>:</p>\n<pre><code>&lt;!DOCTYPE html&gt;\n...\n&lt;body&gt;\n  &lt;h1&gt;Hello Vite! (wait is it pronounced \"veet\" or \"vight\"...)&lt;/h1&gt;\n  &lt;div id=\"root\"&gt;&lt;/div&gt;\n  &lt;!--Don't forget type=\"module\"! This lets us use ES import syntax in the browser--&gt;\n  &lt;script type=\"module\"&gt;\n    // path to our component. Note we still use .jsx here!\n    import Component from './TimesWeMispronouncedVite.jsx';\n    import React from 'react';\n    import ReactDOM from 'react-dom';\n    const componentRoot = document.getElementById('root');\n    ReactDOM.render(React.createElement(Component), componentRoot);\n  &lt;/script&gt;\n&lt;/body&gt;\n&lt;/html&gt;</code></pre>\n\n<p>Yep, that’s it. No need to transform our <code>.jsx</code> file to a browser-ready <code>.js</code> file ourselves! Wherever Vite sees a <code>.jsx</code> import, it’ll auto-convert that file to something browsers can understand. There isn’t even a <code>dist</code> or <code>build</code> folder when working in development; Vite processes everything on the fly — complete with hot module reloading every time we save our changes. 🤯</p>\n<p>Okay, so we have an incredibly capable build tool. How can we bring this to our 11ty templates?</p>\n<h3>Running Vite Alongside 11ty</h3>\n<p>Before we jump into the good stuff, let’s discuss running 11ty and Vite side-by-side. Go ahead and install 11ty as a dev dependency into the same project directory from last section:</p>\n<pre><code>npm i -D @11ty/eleventy # yes, it really is 11ty twice</code></pre>\n\n<p>Now let’s do a little pre-flight check to see if 11ty’s working. To avoid any confusion, I’d suggest you:</p>\n<ol>\n<li>Delete that <code>index.html</code> file from earlier;</li>\n<li>Move that <code>TimesWeMispronouncedVite.jsx</code> inside a new directory. Say, <code>components/</code>;</li>\n<li>Create a <code>src</code> folder for our website to live in;</li>\n<li>Add a template to that <code>src</code> directory for 11ty to process.</li>\n</ol>\n<p>For example, a <code>blog-post.md</code> file with the following contents:</p>\n<pre><code># Hello world! It’s markdown here</code></pre>\n\n<p>Your project structure should look something like this:</p>\n<pre><code>src/\n  blog-post.md\ncomponents/\n  TimesWeMispronouncedVite.jsx</code></pre>\n\n<p>Now, run 11ty from your terminal like so:</p>\n<pre><code>npx eleventy --input=src</code></pre>\n\n<p>If all goes well, you should see an build output like this:</p>\n<pre><code>_site/\n  blog-post/\n    index.html</code></pre>\n\n<p>Where <code>_site</code> is our default output directory, and <code>blog-post/index.html</code> is our markdown file beautifully converted for browsing.</p>\n<p>Normally, we’d run <code>npx eleventy --serve</code> to spin up a dev server and visit that <code>/blog-post</code> page. But we’re using Vite for our dev server now! The goal here is to:</p>\n<ol>\n<li>Have eleventy build our markdown, Pug, nunjucks, and more to the <code>_site</code> directory.</li>\n<li>Point Vite at that same <code>_site</code> directory so it can process the React components, fancy style imports, and other things that 11ty didn’t pick up.</li>\n</ol>\n<p>So a two-step build process, with 11ty handing off the Vite. Here’s the CLI command you’ll need to start 11ty and Vite in “watch” mode simultaneously:</p>\n<pre><code>(npx eleventy --input=src --watch) &amp; npx vite _site</code></pre>\n\n<p>You can also run these commands in two separate terminals for easier debugging. 😄</p>\n<p>With any luck, you should be able to visit <code>http://localhost:3000/blog-post/</code> (again, don’t forget the trailing slash!) to see that processed Markdown file.</p>\nPartial Hydration With Shortcodes\n<p>Let’s do a brief rundown on <a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwi1lLjx2IPzAhW9F1kFHYMdAJcQFnoECAsQAw&amp;url=https%3A%2F%2Fwww.11ty.dev%2Fdocs%2Fshortcodes%2F&amp;usg=AOvVaw3B_PvBaTDeHg5ztR0i7C07\">shortcodes</a>. Time to revisit that syntax from earlier:</p>\n<pre><code>{% react '/components/TimesWeMispronouncedVite.jsx' %}</code></pre>\n\n<p>For those unfamiliar with shortcodes: they’re about the same as a function call, where the function returns a string of HTML to slide into your page. The “anatomy” of our shortcode is:</p>\n<ul>\n<li><code>{% … %}</code><br />Wrapper denoting the start and end of the shortcode.</li>\n<li><code>react</code><br />The name of our shortcode function we’ll configure in a moment.</li>\n<li><code>'/components/TimesWeMispronouncedVite.jsx'</code><br />The first (and only) argument to our shortcode function. You can have as many arguments as you’d like.</li>\n</ul>\n<p>Let’s wire up our first shortcode! Add a <code>.eleventy.js</code> file to the base of your project, and add this config entry for our <code>react</code> shortcode:</p>\n<pre><code>// .eleventy.js, at the base of the project\nmodule.exports = function(eleventyConfig) {\n  eleventyConfig.addShortcode('react', function(componentPath) {\n   // return any valid HTML to insert\n   return `&lt;div id=\"root\"&gt;This is where we'll import ${componentPath}&lt;/div&gt;`\n  })\n\n  return {\n    dir: {\n      // so we don't have to write `--input=src` in our terminal every time!\n      input: 'src',\n    }\n  }\n}</code></pre>\n\n<p>Now, let’s spice up our <code>blog-post.md</code> with our new shortcode. Paste this content into our markdown file:</p>\n<pre><code># Super interesting programming tutorial\n\nWriting paragraphs has been fun, but that's no way to learn. Time for an interactive code example!\n\n{% react '/components/TimesWeMispronouncedVite.jsx' %}</code></pre>\n\n<p>And if you run a quick <code>npx eleventy</code>, you should see this output in your <code>_site</code> directory under <code>/blog-post/index.html</code>:</p>\n<pre><code>&lt;h1&gt;Super interesting programming tutorial&lt;/h1&gt;\n\n&lt;p&gt;Writing paragraphs has been fun, but that's no way to learn. Time for an interactive code example!&lt;/p&gt;\n\n&lt;div id=\"root\"&gt;This is where we'll import /components/TimesWeMispronouncedVite.jsx&lt;/div&gt;</code></pre>\n\n<h3>Writing Our Component Shortcode</h3>\n<p>Now let’s do something useful with that shortcode. Remember that <code>script</code> tag we wrote while trying out Vite? Well, we can do the same thing in our shortcode! This time we’ll use the <code>componentPath</code> argument to generate the import, but keep the rest pretty much the same:</p>\n<pre><code>// .eleventy.js\nmodule.exports = function(eleventyConfig) {\n  let idCounter = 0;\n  // copy all our /components to the output directory\n  // so Vite can find them. Very important step!\n  eleventyConfig.addPassthroughCopy('components')\n\n  eleventyConfig.addShortcode('react', function (componentPath) {\n      // we'll use idCounter to generate unique IDs for each \"root\" div\n      // this lets us use multiple components / shortcodes on the same page 👍\n      idCounter += 1;\n      const componentRootId = `component-root-${idCounter}`\n      return `\n  &lt;div id=\"${componentRootId}\"&gt;&lt;/div&gt;\n  &lt;script type=\"module\"&gt;\n    // use JSON.stringify to\n    // 1) wrap our componentPath in quotes\n    // 2) strip any invalid characters. Probably a non-issue, but good to be cautious!\n    import Component from ${JSON.stringify(componentPath)};\n    import React from 'react';\n    import ReactDOM from 'react-dom';\n    const componentRoot = document.getElementById('${componentRootId}');\n    ReactDOM.render(React.createElement(Component), componentRoot);\n  &lt;/script&gt;\n      `\n    })\n\n  eleventyConfig.on('beforeBuild', function () {\n    // reset the counter for each new build\n    // otherwise, it'll count up higher and higher on every live reload\n    idCounter = 0;\n  })\n\n  return {\n    dir: {\n      input: 'src',\n    }\n  }\n}</code></pre>\n\n<p>Now, a call to our shortcode (ex. <code>{% react '/components/TimesWeMispronouncedVite.jsx' %}</code>) should output something like this:</p>\n<pre><code>&lt;div id=\"component-root-1\"&gt;&lt;/div&gt;\n&lt;script type=\"module\"&gt;\n    import Component from './components/FancyLiveDemo.jsx';\n    import React from 'react';\n    import ReactDOM from 'react-dom';\n    const componentRoot = document.getElementById('component-root-1');\n    ReactDOM.render(React.createElement(Component), componentRoot);\n&lt;/script&gt;</code></pre>\n\n<p>Visiting our dev server using <code>(npx eleventy --watch) &amp; vite _site</code>, we should find a beautifully clickable counter element. ✨</p>\n<h3>Buzzword Alert — Partial Hydration And Islands Architecture</h3>\n<p>We just demonstrated “islands architecture” in its simplest form. This is the idea that our interactive component trees <em>don’t</em> have to consume the entire website. Instead, we can spin up mini-trees, or “islands,” throughout our app depending on where we actually need that interactivity. Have a basic landing page of links without any state to manage? Great! No need for interactive components. But do you have a multi-step form that could benefit from X React library? No problem. Use techniques like that <code>react</code> shortcode to spin up a <code>Form.jsx</code> island.</p>\n<p>This goes hand-in-hand with the idea of “partial hydration.” You’ve likely heard the term “hydration” if you work with component-y SSGs like NextJS or Gatsby. In short, it’s a way to:</p>\n<ol>\n<li><strong>Render your components to static HTML first.</strong><br />This gives the user something to view when they initially visit your website.</li>\n<li><strong>“Hydrate” this HTML with interactivity.</strong><br />This is where we hook up our state hooks and renderers to, well, make button clicks actually trigger something.</li>\n</ol>\n<p>This 1-2 punch makes JS-driven frameworks viable for static sites. As long as the user has something to view before your JavaScript is done parsing, you’ll get a decent score on those lighthouse metrics.</p>\n<p>Well, until you don’t. 😢 It can be expensive to “hydrate” an entire website since you’ll need a JavaScript bundle ready to process <em>every last DOM element</em>. But our scrappy shortcode technique <em>doesn’t</em> cover the entire page! Instead, we “partially” hydrate the content that’s there, inserting components only where necessary.</p>\nDon’t Worry, There’s A Plugin For All This: Slinkity\n<p>Let’s recap what we discovered here:</p>\n<ol>\n<li>Vite is an incredibly capable bundler that can process most file types (<code>jsx</code>, <code>vue</code>, and <code>svelte</code> to name a few) without extra config.</li>\n<li>Shortcodes are an easy way to insert chunks of HTML into our templates, component-style.</li>\n<li>We can use shortcodes to render dynamic, interactive JS bundles wherever we want using partial hydration.</li>\n</ol>\n<p>So what about optimized production builds? Properly loading scoped styles? Heck, using <code>.jsx</code> to create entire pages? Well, I’ve bundled all of this (and a whole lot more!) into a project called Slinkity. I’m excited to see the <a href=\"https://twitter.com/jadenguitarman/status/1430988821529833473?s=20\">warm community reception</a> to the project, and I’d love for you, dear reader, to give it a spin yourself!</p>\n<p>🚀 <a href=\"https://slinkity.dev\"><strong>Try the quick start guide</strong></a></p>\n<h3>Astro’s Pretty Great Too</h3>\n<p>Readers with their eyes on cutting-edge tech <em>probably</em> thought about Astro at least once by now. 😉 And I can’t blame you! It’s built with a pretty similar goal in mind: start with plain HTML, and insert stateful components wherever you need them. Heck, they’ll even let you start writing React components <em>inside</em> Vue or Svelte components <em>inside</em> HTML template files! It’s like MDX Xtreme edition. 🤯</p>\n<p>There’s one pretty major cost to their approach though: <strong>you need to rewrite your app from scratch.</strong> This means a new template format based on JSX (which you might not be comfortable with), a whole new data pipeline that’s missing a couple of niceties right now, and general bugginess as they work out the kinks.</p>\n<p>But spinning up an 11ty + Vite cocktail with a tool like Slinkity? Well, if you already have an 11ty site, Vite should bolt into place without any rewrites, and shortcodes should cover many of the same use cases as <code>.astro</code> files. I’ll admit it’s <em>far</em> from perfect right now. But hey, it’s been useful so far, and I think it’s a pretty strong alternative if you want to avoid site-wide rewrites!</p>\nWrapping Up\n<p>This Slinkity experiment has served my needs pretty well so far (and <a href=\"https://twitter.com/Rich_McCartney/status/1428730629148061696?s=20\">a few of y’all’s</a> too!). Feel free to use whatever stack works for your JAM. I’m just excited to share the results of my year of build tool debauchery, and I’m so pumped to see how we can bridge the great Jamstack divide.</p>\n<h3>Further Reading</h3>\n<p>Want to dive deeper into partial hydration, or ESM, or SSGs in general? Check these out:</p>\n<ul>\n<li><a href=\"https://jasonformat.com/islands-architecture/\"><strong>Islands Architecture</strong></a><br />This blog post from Jason Format really kicked off a discussion of “islands” and “partial hydration” in web development. It’s chock-full of useful diagrams and the philosophy behind the idea.</li>\n<li><a href=\"https://www.smashingmagazine.com/2020/09/stack-custom-made-static-site-generator/\"><strong>Simplify your static with a custom-made static site generator</strong></a><br />Another SmashingMag article that walks you through crafting Node-based website builders from scratch. It was a huge inspiration to me!</li>\n<li><a href=\"https://bholmes.dev/blog/how-es-modules-have-redefined-web-development/\"><strong>How ES Modules have redefined web development</strong></a><br />A personal post on how ES Modules have changed the web development game. This dives a little further into the “then and now” of import syntax on the web.</li>\n<li><a href=\"https://css-tricks.com/an-introduction-to-web-components/\"><strong>An introduction to web components</strong></a><br />An excellent walkthrough on what web components are, how the shadow DOM works, and where web components prove useful. Used this guide to apply custom components to my own framework!</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"1efca3fbb62c6f19c8050f809a42c9ee53e9c77dfea9bb647a9fca447e70be81","category":"Tech"}