{"title":"Prime Video ตัด Dolby Vision และ Atmos ออกจากแพ็คเกจแบบมีโฆษณา อยากได้คืนต้องจ่ายเพิ่ม","link":"https://www.blognone.com/node/138202","date":1707910411000,"content":"<div><div><div><p>Amazon Prime Video กำลังทำการเปลี่ยนนโยบายการให้บริการ โดยผู้ใช้ที่สมัครแพ็กเกจแบบมีโฆษณาจะไม่สามารถรับชมภาพยนตร์และรายการทีวีด้วย Dolby Vision และ Atmos ได้อีกต่อไป หากอยากได้คืนให้ผู้ใช้ขยับไปใช้แพ็กเกจที่ราคาสูงกว่าที่จะไม่มีโฆษณา และได้ Dolby Vision และ Atmos กลับคืนมา</p>\n<p>ข้อมูลนี้ถูกพบครั้งแรกโดย 4KFilme เว็บไซต์ที่นำเสนอข่าวสารภาพยนตร์ของเยอรมนีที่พบว่าทีวีหลากยี่ห้อที่พวกเขาไม่แสดงภาพแบบ HDR10 และเสียงแบบ Dolby Digital 5.0 บน Prime Video ได้</p>\n<p>ภายหลัง Katie Barker โฆษกของ Amazon ออกมายืนยันกับ The Verge ว่าไม่ใช่ข้อผิดพลาดแต่ Prime Video เจตนาจำกัด Dolby Vision และ Dolby Atmos ให้มีเฉพาะบางคอนเทนต์ในแพ็กเกจแบบมีโฆษณา</p>\n<p>เดิมที Amazon Prime Video ในสหรัฐอเมริกาเป็นส่วนหนึ่งของการสมัครสมาชิก Amazon Prime โดยจ่าย 15 ดอลลาร์ต่อเดือนหรือ 139 ดอลลาร์ต่อปีเพื่อได้บริการส่งของฟรีไม่มีค่าส่งแบบ 2 วัน, 1 วัน, การจัดส่งภายในวันที่สั่งซื้อ พร้อมกับ Prime Video แบบมีโฆษณา ตอนนี้กลายเป็นว่าผู้สมัครบริการต้องจ่ายเงินเพิ่ม 18% เพื่อดูคอนเทนต์บน Prime Video ที่ได้ประสบการณ์เต็มรูปแบบ</p>\n<p>ส่วนแบบบริการ Prime Video แบบแยกต่างหากที่มีโฆษณาราคา 8.99 ดอลลาร์ต่อเดือน และต้องจ่ายเพิ่ม 2.99 ดอลลาร์เพื่อ Dolby Vision, Dolby Atmos และไม่มีโฆษณาเท่ากับว่าผู้ใช้งานต้องจ่ายเพิ่ม 28%</p>\n<p>สำหรับในไทย Prime Video ตอนนี้มีแพ็คเกจ 149 บาทต่อเดือน และ<a href=\"https://www.blognone.com/node/138040\">แพ็คเกจที่ร่วมมือกับ AIS</a> ที่แบ่งเป็น 3 เดือน 149 บาท และ 1 ปี 999 บาท</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2d804268f15c837ea63624fbe6bc72a7.png\" /></p>\n<p>ที่มา - <a href=\"https://www.4kfilme.de/amazon-prime-video-entfernt-dolby-atmos-und-dolby-vision-im-werbefinanzierten-abo/#google_vignette\">4KFilme</a> และ <a href=\"https://www.theverge.com/24071417/amazon-prime-video-no-dolby-vision-atmos\">The Verge</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon-prime-video\">Amazon Prime Video</a></div><div><a href=\"/topics/amazon\">Amazon</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1f06032fd706e4c3d88422f56a4a21c8791b16ae2e02bbeec95c92cc9559d03b","category":"Thai"}