{"title":"372 What we have learned and are still learning about enteric methane emission measurements in extensive grazing environments","link":"https://academic.oup.com/jas/article/102/Supplement_3/193/7757450?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Across the Western U.S., beef cattle spend considerable time grazing extensive rangelands. Enteric methane (CH<sub>4</sub>) production in grazing systems represents more than 80% of the total enteric CH<sub>4</sub> emissions. However, more measured CH<sub>4</sub> data from cattle grazing extensive rangelands is needed to inform measurement, reporting, modeled emissions, and to identify mitigation opportunities. The availability of pasture-ready automatic head-chamber systems (AHCS; C-Lock Inc, Rapid City, South Dakota) has allowed the determination of emissions in rangelands. In this regard, different methods to ensure an accurate determination of enteric CH<sub>4</sub> using this measurement technique have been evaluated in recent years. An initial step to obtaining accurate enteric emissions data is ensuring efforts secure adequate AHCS visitation. Investigations in small (&lt; 99 ac) pastures have shown that ≥ 15 visits to ≥ 55 visits in feedlot pens are adequate for robust enteric CH<sub>4</sub> production data. Here, our goal is to examine AHCS visitation outcomes to inform the use of this technique in extensive rangeland. For two grazing seasons at the USDA ARS Central Plains Experimental Range (CPER), we have studied enteric CH<sub>4</sub> emissions from yearling steer herds ranging in size from 26 to 60 animals in continuously stocked rangeland (Table 1). After 30 d of acclimation in 2022, 46% of individuals continued using an AHCS until the end of the drought-shortened grazing season, totaling 60 d of constant AHCS exposure. In 2023, individuals were measured first at post-weaning, and those with ≥ 15 visits to an AHCS were stocked at CPER. These steers were previously exposed to an AHCS on average 69 d earlier (range: 28 to 118). Of these 60 individuals, 68% used the two available AHCS ≥ 15 times when grazing rangeland for 76 d, totaling 137 d of discontinuous AHCS exposure. While grazing, individual visits per season were reduced in 2022 and substantially greater in 2023. At this point in our enteric CH<sub>4</sub> emission investigation, we learned that either exposing an individual multiple times to an AHCS after weaning or doubling the days of exposure in the acclimation phase increases visitation during the measurement phase by about 20% at the herd level and 450% on an individual basis. Insights learned on rangeland have uncovered several considerations for measuring enteric CH<sub>4</sub> emissions in extensive environments: lengthy past exposure to AHCS is ideal for adequate visitation during the measurement phase and visitation of unacclimated individuals is unlikely during the measurement phase. Further work should determine the true number of individual visits required for accurate methane measurement in extensive rangelands and evaluate 1) efficacy of different acclimation practices, 2) continued use of previously exposed animals and temporal visitation decay, and 3) alternative placement of AHCS, and use of palatable attractants to increase AHCS visitation may improve measurement of enteric CH<sub>4</sub> emissions.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1f1f184336585656b29c83fd58f935128a799bd4a647e4f61034e84e14837cac","category":"Environment"}