{"title":"The love for the bike: Andrea Tafi's secret to a perfect life","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-love-for-the-bike-andrea-tafis-secret-to-a-perfect-life","date":1638878012000,"content":"\n      <p>In the 1999 Paris-Roubaix, with 30 kilometres to go, there were seven men in the lead. Three were from Mapei: Wilfried Peeters, Tom Steels, and Andrea Tafi, they were joined by Frank Vandenbroucke (Cofidis), Jo Planckaert (Lotto - Mobistar), Léon Van Bon (Rabobank), and George Hincapie (US Postal). At this point, wearing the tricolour jersey as Italian champion, Tafi attacked, and nobody could catch him.</p>\n<div></div>\n<p>He won that edition of Paris-Roubaix two minutes and 14 seconds ahead of his Mapei teammates. After 1999, no Italian succeeded in repeating Tafi's success in what some would say is the hardest Monument of the season. That was until October 3 2021, when Italian Champion Sonny Colbrelli achieved this immeasurable feat.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1131489441_1_1024x1024.jpg?v=1637681837\" /><em>Andrea Tafi crosses the finish line at the 1999 Roubaix with the Italian national champion's jersey. Photo: OLIVIER MORIN/AFP via Getty Images</em></p>\n<p>\"This year was a bit of an anomalous Roubaix,\" Tafi told us at Rouleur Live, our London event at the beginning of the month. \"It was raced in October and not in its traditional season, the spring. So it was an atypical Roubaix, run on a terrible day: under the rain and very windy. And on this kind of course, it was a challenging race.\"</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/faces-of-a-roubaix-finish\">Related: Faces of a Roubaix finish</a></em></strong></p>\n<p>Tafi, when he won in 1999, played his cards perfectly, showing great guile, as well as iron legs. He attacked his opponents not on the most famous sectors like the Arenberg or Carrefour de l'Arbre, but on a stretch of asphalt as smooth as a billiard table. It was the most critical moment of the day.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1126529025_1024x1024.jpg?v=1636468723\" /><em>Tafi attacks in the Forest of Arenberg. Photo: PASCAL PAVANI/AFP via Getty Images.</em></p>\n<p>Twenty-two years later, Colbrelli showed up at Roubaix with stratospheric form and bombproof tactics, albeit following a different strategy.</p>\n<p>\"Colbrelli was coming from two months, even three, of excellent condition with great wins, like the European championship,\" Tafi said. \"He's always been among the best riders of the last period and was coming in as one of the big favourites. But I have to say that he showed he could race intelligently, going after what he thought was the beacon of the race, Van der Poel.\"</p>\n<p>And so it unfolded how Colbrelli had thought. Mathieu van der Poel ignited much of the race, but he never lost sight of him. At the Carrefour de l'Arbre, he perhaps proved to be a tad fresher than the Dutchman and then showed it in the sprint inside the André-Pétrieux velodrome. And, like Tafi, he won as the reigning Italian champion.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB1_8548_1024x1024.jpg?v=1636468692\" /><em>Roubaix 2021: Sonny Colbrelli follows Mathieu van der Poel Photo: Alex Broadway/SWpix.com</em></p>\n<p>\"To see an Italian rider on the top step of the podium in Roubaix was a huge emotion,\" Tafi confessed. \"And for me, it was even more so. I empathised with those feats that 22 years ago I was able to do, in that same velodrome.\"</p>\n<p>Tafi doesn't find the Classics to have changed much since he raced them. \"The only things that have changed are the bikes and the preparation of the athletes,\" he said. \"Also, because Classics like Roubaix or Flanders are beautiful and important for what they are, and they don't have to change. They are beautiful as they are. Their history shows that.\"</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-arenberg-trench-2021-mens-paris-roubaix-gallery\">Related: The Arenberg Trench: Men's Paris-Roubaix 2021 Gallery</a></em></strong></p>\n<p>That's perhaps part of the reason why in 2018 (at age 52), Tafi had announced that 20 years after his triumph, he would race Paris-Roubaix in 2019 at age 53. The competitive spirit was, and still is, very strong in the Tuscan from Fucecchio, and the physical form dazzling. The project faded because of a crash which resulted in a broken collarbone. However, could it be that he is preparing a new comeback, perhaps for the thirtieth anniversary of his victory?</p>\n<p>Tafi laughs when asked. \"No, I'm not coming back now,\" he replied. \"I wanted to come back after 20 years, but not now. Of course, it's important to look forward, but what's even more important to me now — and what I'd like to pass on to other people — is to show that we can stay in shape even at my age.\"</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1131499733_1024x1024.jpg?v=1636468768\" /><em>Tafi with Roubaix's winner trophy in 1999. Photo: OLIVIER MORIN/AFP via Getty Images</em></p>\n<p>On the list of Italians who could compete for more Classics victories, Tafi also includes Ganna, Moscon, Bettiol, and Ballerini.</p>\n<p>\"There are many Italian riders who can do well in the Classics,\" he said. \"Ganna could be successful, while Moscon has shown he's up to the task. And I would also put Davide Ballerini and Bettiol in there because when someone wins Flanders, they can do well in the Roubaix as well.\"</p>\n<p>Another race that impressed him was the very first women's Roubaix.</p>\n\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-femmes-a-day-in-cycling-history\">Related – Paris-Roubaix women's gallery</a></strong></em></p>\n<p>\"It was interesting, it's also a surprise,\" he confessed. \"I don't understand why it hasn't been organised before. This is definitely the future of the sport, and it's going to be one of the most important ones for women as well.\"<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CorVosSWpix.com1988_1024x1024.jpg?v=1636469351\" /><em>Lizzie Deignan at the 2021 Paris-Roubaix Femmes Photo: CorVos/SWpix.com</em></p>\n<p>Before letting him go back to Italy, where he manages the Borghetto farmhouse in Lamporecchio (near Pistoia) and takes care of the olive grove, we asked him his secret for maintaining great physical and mental form.</p>\n<p>\"Having the bike in your heart,\" he replied. \"For me, the bike is something special. I started biking when I was ten years old and raced until I was 40. That was my whole life. After retiring, I kept great memories, and even in the future, I can never be without my bike.\"</p>\n<p>And so, if you pass through the hills of Montalbano, among the many cyclists that you meet, you may find Il Gladiatore. He'll be riding his bike with the same enthusiasm and joie-de-vivre that cascaded through his professional career.<br /><span></span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1f282c0f268b9f8cd42f7cf8968744c61e902a5dc1797da24bbd82a23a5f777f","category":"Cycling"}