{"title":"Morphometric approaches to Cannabis evolution and differentiation from archaeological sites: interpreting the archaeobotanical evidence from bronze age Haimenkou, Yunnan","link":"http://link.springer.com/10.1007/s00334-023-00966-6","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>Cannabis grains are frequently reported from archaeological sites in Asia, and hypothesized centers of origins are China and Central Asia. Chinese early cannabis remains are often interpreted as evidence of hemp fabric production, in line with early textual evidence describing ritualistic hemp cloth use and hemp cultivation as a grain crop. Modern measurements on cannabis varieties show distinct sizes between fibre or oil/fibre and psychoactive varieties, the former having larger seeds on average than the latter. This paper reviews the current macro-botanical evidence for cannabis across East, Central and South Asia and builds a comparative framework based on modern cannabis seed measurements to help identify cannabis use in the past, through the metric analysis of archaeologically preserved seeds. Over 800 grains of cannabis were retrieved from the 2008 excavation of Haimenkou, Yunnan, Southwest China, dating to between 1650 and 400 <span>bc</span>. These are compared with other known archaeological cannabis and interpreted through the metric framework. This offers a basis for exploration of the seed morphometrics potential to infer cannabis cultivation and diversification in uses. At Haimenkou, cannabis seeds size mostly plot in the range of overlapping psychoactive/fibre types; we therefore suggest that the cannabis assemblage from Haimenkou is indicative of a crop beginning to undergo evolution from its early domesticated form towards a diversified crop specialized for alternative uses, including larger oilseed/fibre adapted varieties.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"1f2955d2e07dc8217833b558c5d201f4d54a7ff6a929c574ac78f388d02efaaa","category":"Environment"}