{"title":"283 Investigating molecular changes in juvenile rainbow trout muscle hyperplasia and hypertrophy over time","link":"https://academic.oup.com/jas/article/102/Supplement_3/200/7757466?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Farmed rainbow trout require specific cold, freshwater habitations to maximize overall growth for future release and general production. The growth and development of muscle tissue in rainbow trout are critical factors in understanding and maximizing the production and quality of farmed fish. Unlike mammals, rainbow trout can undergo muscle hyperplasia and hypertrophy throughout its lifetime, which only adds to its muscle growth potential as a species. This study aimed to investigate the growth patterns and gene expression changes in red, pink, and white muscle tissue over time in farmed rainbow trout. Twenty rainbow trout were harvested at 6 and 7 mo of age from the Walhalla State Hatchery (SC), and red, pink, and white muscle samples were collected in RNAlater for RNA extraction and downstream gene expression analysis. General growth pattern changes were assessed through measurements of wet body weight, wet length, empty carcass weight, and filet weight, while gene expression changes were examined using quantitative polymerase chain reaction (RT-qPCR). Genes such as PAX7A, PAX7B, MYOG, MYOD, IGF1, and IGF2B were investigated to illuminate dynamic changes in the muscle tissue of rainbow trout. These genes are associated with myogenic regulatory factors involved in muscle growth and development. Water and ambient temperature were captured to monitor potential temperature effects. Wet weight (g) and left filet weight (g) increased (<span>P</span> &lt; 0.05) over the 30-d period. PAX7A, PAX7B, and MYOG were all downregulated (<span>P</span> &lt; 0.05) in red and pink muscle in comparison to the previous 30 d. White muscle displayed no differences (<span>P</span> &gt; 0.05) in expression of PAX7A, PAX7B, and MYOG. IGF1 gene expression in red, pink and white muscle were downregulated (<span>P</span> &lt; 0.05) over the 30 d. MYOD had a very low expression in comparison with other target genes during these age points. These findings highlight the dynamic nature of muscle growth in rainbow trout and the importance of red and pink muscle dynamics. Understanding the molecular mechanisms underlying muscle growth and gene expression changes over time can inform strategies to optimize fish growth and meat quality in aquaculture systems. Further investigation is needed to elucidate the specific regulatory pathways involved in muscle development and their potential applications in fish farming.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"1f334e59eae9181a7a21a3b63d29f8064dc93a0a3c997a0a85c9ab188760b14f","category":"Environment"}