{"title":"Arginine with leucine drives reactive oxygen species-mediated integrin α5β1 expression and promotes implantation in mouse blastocysts","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae114/7627282?rss=1","date":1710201600000,"content":"<span><div>Abstract</div>The implantation rate of in vitro fertilization (IVF)-derived blastocysts after embryo transfer remains low, suggesting that the inadequate expression of specific proteins in culture-induced IVF-derived blastocysts contributes to low implantation rates. Therefore, treatment with appropriate regulation may improve the blastocyst implantation ability. This study demonstrated that the combination of <span>l</span>-arginine (Arg) and <span>l</span>-leucine (Leu) exerts distinct effects on IVF-derived mouse blastocysts. Arg with Leu promotes blastocyst implantation, whereas Arg alone decreases the blastocyst ability. Integrin α5β1 expression was increased in blastocysts treated with Arg and Leu. Arg with Leu also increased reactive oxygen species (ROS) levels and showed a positive correlation with integrin α5β1. Ascorbic acid, an antioxidant, decreased ROS and integrin α5β1 levels, which were elevated by Arg with Leu. Meanwhile, the mitochondrial membrane potential (ΔΨm) in blastocysts did not differ between treatments. Glutathione peroxidase (GPx) is involved in ROS scavenging using glutathione (GSH) as a reductant. Arg with Leu decreased GPx4 and GSH levels in blastocysts, and blastocysts with higher ROS levels had lower GPx4 and GSH levels. In contrast, Arg alone increased the percentage of caspase-positive cells, indicating that Arg alone, which attenuated implantation ability, was associated with apoptosis. This study revealed that elevated ROS levels induced by Arg with Leu stimulated integrin α5β1 expression, thereby enhancing implantation capacity. Our results also suggest that ROS were not due to increased production by oxidative phosphorylation, but rather to a reduction in ROS degradation due to diminished GPx4 and GSH levels.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"1f46bd71f3ad06d088eed2747bd8969c72ae29c500851a743d8c34218004b469","category":"Interdisciplinary"}