{"title":"Adaptation of feeding behaviors on two Brassica species by colonizing and noncolonizing Bemisia tabaci (Hemiptera: Aleyrodidae) NW whiteflies","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae084/7748068?rss=1","date":1725321600000,"content":"<span><div>Abstract</div><span>Bemisia tabaci</span> New World (NW) (Gennadius) (Hemiptera: Aleyrodidae), a whitefly in the <span>B. tabaci</span> species complex, is polyphagous on many plant species. Yet, it has been displaced, albeit not entirely, by other whitefly species. Potential causes could include issues with adaptation, feeding, and the colonization of new-hosts; however, insights that would help clarify these possibilities are lacking. Here, we sought to address these gaps by performing electropenetrography (EPG) recordings of NW whiteflies, designated “Napus” and “Rapa,” reared on 2 colony hosts, <span>Brassica napus</span> and <span>B. rapa</span>, respectively. Analysis of 17 probing and pathway (pw) phase-related EPG variables revealed that the whiteflies exhibited unique probing behaviors on their respective colony hosts, with some deterrence being encountered on <span>B. rapa</span>. Upon switching to <span>B. rapa</span> and <span>B. napus</span>, the probing patterns of Napus and Rapa whiteflies, respectively, adapted quickly to these new-hosts to resemble that of whiteflies feeding on their colony hosts. Results for 3 of the EPG variables suggested that <span>B. rapa</span>’s deterrence against Napus whitefly was significant prior to the phloem phase. This also suggested that adaptation by Rapa whitefly improved its pw probing on <span>B. rapa</span>. Based on analysis of 24 phloem phase-related EPG variables, Napus and Rapa whiteflies performed equally well once they entered phloem phase and exhibited comparable phloem acceptability on both the colony- and new-hosts. These findings demonstrate that NW whiteflies reared on a colony host are highly adaptable to feeding on a new host despite encountering some deterrence during the nonphloem phases in <span>B. rapa</span> plant.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"1f4947db7909b79d3e1e393d103b4875417b0755ed4209ebe8f0925d9e7a05cb","category":"Environment"}