{"title":"Increased response of postmenopausal bone to interval walking training depends on baseline bone mineral density","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309936","date":1725544800000,"content":"<p>by Rizka Nugraheni Martyanti, Mayuko Morikawa, Masaaki Hanaoka, Satoshi Tanaka, Yukio Nakamura, Hiroshi Nose, Shizue Masuki</p>\r\nPurpose <p>To examine the hypothesis that an increase in response of postmenopausal bone to interval walking training (IWT) depends on baseline bone mineral densities (BMDs).</p> Methods <p>Two hundred and thirty-four postmenopausal women (64±5 (SD) yr) with no medication for osteoporosis performed 5-month IWT, repeating fast and slow walking at ≥70% and ~40% peak aerobic capacity, respectively, for 3 minutes each per set, ≥5 sets/day, ≥4 days/week. They were recruited from those who had performed IWT ≥6 months before participating in the study so that their physical fitness and lifestyle-related disease symptoms had almost reached a steady state at the time of their participation. We measured BMDs for the lumbar spine (LS), bilateral femoral neck (FN), and bilateral total hip (TH) by dual-energy X-ray absorptiometry (DXA) before and after the intervention. We used a multiple regression analysis to identify significant independent factors for increasing BMDs after the intervention as baseline physical characteristics, exercise intensity, and exercise time during IWT were the candidates. For any bone site where the independent factor identified was singular, we analyzed the relationship between the identified factor vs increases in BMD after the intervention (ΔBMD) by the locally weighted scatterplot smoothing (LOWESS) method.</p> Results <p>Almost all subjects completed the designated protocol with minimal adverse events. We found that significant determinants for increasing BMDs were the baseline BMDs for all bone sites, as well as age and body mass index for TH (all, P&lt;0.02). Furthermore, the LOWESS trendline between ΔBMDs vs the baseline BMDs, divided equally into 10 bins for LS and FN, respectively, showed that ΔBMD responses (<i>Y</i>) were attenuated as the baseline BMDs (<i>X</i>) increased in the lower 4 bins and then showed a flat line (<i>Y</i> = ~0) in the remaining higher 6 bins for LS and FN. When the lower 4 bins and the higher 6 bins of the baseline BMD were pooled, respectively, BMDs significantly increased by 1.8% and 1.0% in the lower groups for LS and FN, respectively (both, P&lt;0.001) while not in the higher groups after the intervention (both, P&gt;0.3).</p> Conclusions <p>IWT may be of benefit with minimal adverse events to postmenopausal women, although the effects were greater in those with lower baseline BMDs.</p> Trial registration <p>UMIN000047428. https://rctportal.niph.go.jp/s/detail/um?trial_id=UMIN000047428#.</p>","author":"Rizka Nugraheni Martyanti","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1f4a43e4b00de06d57f18de683d6dda1e55dcce9288b1547ae7a2adfe1581335","category":"Interdisciplinary"}