{"title":"wcm.03.2024.326.330","link":"https://www.watconman.org/wcm-03-2024-326-330/","date":1716779028000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>USE OF EPHEMEROPTERA AS A BIOINDICATOR FOR ASSESSING SURFACE WATER QUALITY IN INDONESIA</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Author: Hamdhani Hamdhani</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.03.2024.326.330\">10.26480/wcm.03.2024.326.330</a></em></span></p>\n<h3>Abstract</h3>\n<div><img src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />Ephemeroptera nymphs are globally recognized for their sensitivity to decreased oxygen levels in aquatic habitats, leading to their frequent use as biological indicators in various monitoring projects worldwide. However, studies utilizing Ephemeroptera in Indonesia have remained largely unknown. This study aims to document the use of Ephemeroptera as bioindicators for assessing surface water quality status in Indonesia. This includes understanding their distribution and the types of surface water habitats that have been investigated using this order as an indicator. There are 47 published papers utilizing Ephemeroptera as a bioindicator for assessing surface water health in Indonesia which were gathered through Google Scholar. Bioindicator studies utilizing Ephemeroptera in Indonesia have only emerged in the last decade. Currently, research on Ephemeroptera as bioindicators for surface waters has predominantly focused on Java Island. Regions on other islands remain relatively understudied, particularly in eastern Indonesia. River habitats lead in the number of observed habitat types. With this knowledge, future research on utilizing Ephemeroptera as bioindicators should prioritize areas beyond Java Island and focus on habitat types that have been less explored, including irrigation canals, paddy fields, waterfalls, wetlands, and springs.</div>\n<p> </p>\n<h3>Keywords</h3>\n<p><span>Aquatic insect, mayfly, water quality, water pollution, biological assessment</span></p>\n<h3><strong>1. INTRODUCTION</strong></h3>\n<div>\n<p>The first appearance of insects in the Silurian and Devonian eras (345-405 million years ago) was not the same as the forms we see today (Lancaster and Downes, 2013). The first ancestors of aquatic insects to appear belonged to the order Ephemeroptera. As the earliest type to emerge, Ephemeroptera continued to undergo radiation until various lineages were formed. Along their journey, numerous lineages became extinct, and the Ephemeroptera we recognize today only come from one lineage that successfully survived (Lancaster and Downes, 2013). The radiation process continued into the Permian period (250-280 million years ago), marked by the appearance of the orders Plecoptera, Megaloptera, Hemiptera, and Coleoptera. Ephemeroptera has a direct lineage from its predecessors that lived in ancient times around the end of the Carboniferous period or the beginning of the Permian, about 290 million years ago (Barber-James et al., 2007). This order is often said to have a close relationship (sister group) with the Order Odonata, based on unique morphological features and phylogeny based on DNA (Wheeler et al., 2001).</p>\n<p>The order Ephemeroptera in English is known as Mayfly. In Indonesian, it is sometimes called Lalat Capung or Lalat Sehari. Like scientific nomenclature in general, its name is also derived from Greek: ephemeros, meaning “lasting for a day,” based on its adult phase, which has a relatively very short lifespan. Some species are known to survive for several days, but many of them only last for a few hours before eventually dying. Both in their adult and larval stages, these insects are known as important natural food sources for fish (Hoopes, 1960; Jacobus et al., 2019). It’s no wonder that in the sport of fishing, this type is often used as artificial bait.</p>\n<p>The larva of Ephemeroptera is called a nymph (Figure 1). Nymphs generally have up to seven pairs of abdominal gills and three caudal filaments (tail filaments). The mouthparts will adapt to the type of food gathering pattern: predators, collectors-gatherers, scrapers, collectors-filterers. Some types are burrowers and have variations in the shape of their mandibular tusks, substrate-weakening techniques, and legs that are typically flattened for digging. These burrowing types usually also have wider abdominal gills (resembling bird feathers) that can be folded against the abdomen and can also be used to create currents in the burrows they dig.</p>\n<p>In their life cycle, the nymph stage becomes dominant, and during this stage, they constantly live in aquatic environments for about less than one to two years. This variation depends on the species and the climate of their habitat (Sartori and Brittain, 2015). Species in temperate climates can have a cycle of up to two years, but in tropical areas, they can produce several generations in one year. During their growth, Ephemeroptera nymphs undergo several molting processes, the number of which depends on the species and external factors such as environmental temperature, food availability, and current velocity (Sartori and Brittain, 2015).</p>\n<p>A study conducted in 2007 that compiled information about the Order Ephemeroptera (Barber-James et al., 2007) showed that this order has 42 families, 405 genera, and more than 3000 species. Recent publications claim that the number of species in this order has exceeded 3700 species (Jacobus et al., 2019). This number is expected to continue increasing with the discovery of undocumented species, especially those in tropical areas. Based on existing documentation, ecological areas located in the northern hemisphere show higher species diversity than those in the southern hemisphere (Barber-James et al., 2007). This is likely due to the fact that species in the northern hemisphere (nearctic and palearctic) have been extensively studied and well-documented in journals and scientific books, especially those found in North America and Europe. Meanwhile, this order has been less explored and researched in ecological areas located in the southern hemisphere, such as in Central and South America, as well as Southeast Asia, including Indonesia.</p>\n<p>Ephemeroptera nymphs are globally acknowledged for their responsiveness to reduced oxygen levels in aquatic habitats, making them frequently employed as biological indicators in numerous monitoring projects (Menetrey at al., 2010). Ephemeroptera taxa have exhibited a notable sensitivity to oxygen depletion, acidification, and a range of contaminants, including metals, ammonia, and other chemicals, as demonstrated in both observational and experimental studies (Lepori et al., 2003; Beketov, 2004; Curtean-Bănăduc et al., 2021). Over the years, several Biological Indices, which incorporate mayflies as indicators, have been developed to assess water quality (Bauernfeind and Moog, 2000; Jun et al., 2012). Following this, numerous biological methods for assessing water quality in streams incorporate Ephemeroptera, such as the EPT (Ephemeroptera, Plecoptera, and Trichoptera) taxa richness. These three sensitive orders have been extensively utilized in the USA and European countries (Hall Jr et al., 2021; Timoner et al., 2021). Ephemeroptera alone offer additional advantages for monitoring purposes: they are highly visible, relatively straightforward to sample, and are typically represented by only a few species in such habitats, which simplifies identification processes.</p>\n<p>In numerous locations worldwide, Ephemeroptera are effectively utilized for monitoring surface water quality. In Indonesia, the attention of scientists in using aquatic insects, especially the order Ephemeroptera, as aquatic environmental bioindicators, is relatively recent. Hence, it is not precisely known how many studies have been conducted in Indonesia regarding the use of Ephemeroptera. This study aims to document the utilization of Ephemeroptera as bioindicators for assessing surface water quality status in Indonesia. This involves understanding their distribution and the types of surface water habitats that have been investigated using this order as a bioindicator.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"860\" height=\"569\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-01.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-01.jpg 860w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-01-300x198.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-01-768x508.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 1: </strong>Typical shapes of Ephemeroptera nymph (A. Baetidae, B. Caenidae, C. Ephemerellidae)</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<h3><strong>2. METHODOLOGY</strong></h3>\n<p>Published studies utilizing Ephemeroptera as a bioindicator for assessing surface water health in Indonesia were gathered through Google Scholar. Keywords such as “ephemeroptera bioindicator Indonesia” and “ephemeroptera bioassessment Indonesia” were used for the search. Studies focusing on the discovery of new Ephemeroptera species were excluded, as the aim was to concentrate solely on research utilizing Ephemeroptera to evaluate the health of aquatic habitats in Indonesia. A total of 47 relevant papers were identified through this search process. These papers were then categorized based on their study locations and the types of aquatic habitats examined. To visually represent the distribution of Ephemeroptera studies across Indonesia, a map with proportional circles was generated using the statistical program R (version 3.5.1: R Core Team, 2019).</p>\n<h3><strong>3. RESULTS</strong></h3>\n<p>The findings from 47 published studies in Indonesia that have utilized the Order Ephemeroptera as a bioindicator of aquatic environmental quality indicates that published literature related to the topic of bioindicators emerged since 2013, with research on macroinvertebrate diversity in the Brantas River in East Java (Rahardjanto et al., 2013), and studies on ecological indices in tertiary irrigation channels in Malang District, East Java (Kartikasari, 2013). As shown in Figure 2, the majority were conducted in Java Island, led by studies in West Java, followed by East Java and then Central Java. Sulawesi Island follows in second place, with the most studies conducted in Southeast Sulawesi, including on Buton Island. Distribution in Sulawesi is fairly even, with only West Sulawesi having no studies conducted on this topic. In Sumatra Island as the largest island located on the western side of Indonesian archipelago, the utilization of the Order Ephemeroptera as a water quality bioindicator has been carried out in North Sumatra, Aceh, and West Sumatra, while other areas in Sumatra Island have not been studied regarding the use of the Order Ephemeroptera.</p>\n<p>In Kalimantan Island, as one of the largest islands located on the middle of Indonesia archipelago, studies related to the utilization of the Order Ephemeroptera have only been conducted in East and Central Kalimantan, while other areas on this island have not been investigated.</p>\n<p>Papua in eastern side on Indonesia archipelago, has only one study related to the utilization of Ephemeroptera. Studies have also been conducted in West Nusa Tenggara and small islands such as Bawean Island, located in the Java Sea.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"1024\" height=\"352\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-02-1024x352.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-02-1024x352.jpg 1024w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-02-300x103.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-02-768x264.jpg 768w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-02.jpg 1137w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 2: </strong>Distribution of published study locations related to Ephemeroptera as bioindicator for surface water habitat in Indonesia</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"893\" height=\"747\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-03.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-03.jpg 893w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-03-300x251.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-326-330-03-768x642.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 3: </strong>The percentage of habitat types where Ephemeroptera was employed as bioindicator for assessing surface water quality in Indonesia</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>As shown in Figure 3, the majority of Ephemeroptera studies as bioindicator for assessing surface water quality in Indonesia have been conducted on river habitats, accounting for 72% of the total studies, followed by lake habitats at 9%. Furthermore, irrigation channel habitats, paddy (rice) fields, and waterfalls each accounted for 5%. The smallest number of studies were conducted on spring habitats and wetlands, each representing 2%.</p>\n<h3><strong>4. DISCUSSION</strong></h3>\n<p><strong>4.1 Study Location Distribution</strong></p>\n<p>Based on the results of the review, in general, research on the use of Ephemeroptera as bioindicator for water quality monitoring in Indonesian waters has only been conducted in the last decade. Most studies are concentrated on the island of Java. This is presumably because Java Island is the location of the capital of Indonesia, Jakarta (although now officially being relocated to a new Indonesia capital location in East Kalimantan) and is a center of economic growth, including, scientific knowledge in Indonesia. This assumption is further strengthened because in Java Island itself, the West Java region, which is the closest to Jakarta, is the most explored location. The high level of industrialization in Java Island has led to several studies involving Ephemeroptera being studies that respond to various cases of suspected water pollution due to anthropogenic activities (Fadilah et al., 2017; Herawati et al., 2020). While some other studies evaluate the water quality conditions in the upstream areas of rivers to serve as a reference for the conditions in the downstream areas that are relatively polluted (Rachman et al., 2016; Chazanah et al., 2018).</p>\n<p>Interestingly, the locations of macroinvertebrate research involving Ephemeroptera for monitoring surface water bodies on Sulawesi Island is relatively well distributed geographically. Several studies have been conducted in Southeast Sulawesi, including on Buton Island. These investigations served not only environmental monitoring purposes but also aimed to identify reference aquatic macroinvertebrates, specifically Ephemeroptera for assessing river health in the surrounding areas (Nasaruddin et al., 2023). Additionally, the presence of mining activities on Sulawesi Island, which pose potential water pollution risks, has prompted several studies focusing on environmental water monitoring involving Ephemeroptera (Hasriyanty et al., 2022; Kadim et al., 2022).</p>\n<p>Research using Ephemeroptera in Sumatra Island is still limited to the Aceh, North Sumatra, and West Sumatra regions. Most studies focus on monitoring river waters due to various anthropogenic activities (Akbar et al., 2018; Sudarso et al., 2021; Badjoeri and Samir, 2022). Similarly, research conducted on Kalimantan Island is also limited, even with only one study each recorded in East Kalimantan and Central Kalimantan. A research project conducted in Central Kalimantan investigated the Ephemeroptera community in low pH water of peat soil wetlands (Erniaty et al., 2023). Meanwhile, Kalimantan Island is recognized for its high biodiversity, yet a considerable portion of it remains unexplored. Looking ahead, the island is poised to confront significant challenges due to the relocation of Indonesia’s capital to its eastern region, slated to commence around mid-2024. Consequently, there’s a forecasted surge in research interest concerning the utilization of Ephemeroptera in this context.</p>\n<p>Moreover, numerous studies focusing on monitoring the environmental quality of surface water bodies using Ephemeroptera have been undertaken in West Nusa Tenggara. Conversely, Papua Island, being the largest island in eastern Indonesia, has only one documented study related to this subject.</p>\n<p>Finally, the overall distribution overview of Ephemeroptera studies (Figure 2) highlights a concentration of aquatic environmental bioindicator research on Java Island. Hence, it’s crucial for researchers across different regions to acknowledge this trend when formulating future research agendas.</p>\n<p><strong>4.2 Habitat Types</strong></p>\n<p>The review findings suggest that rivers are the most commonly studied habitat type in bioindicator research utilizing Ephemeroptera. This finding aligns with a global trend documenting that lotic systems were more extensively explored compared to lentic systems concerning the use of Ephemeroptera as bioindicators (Menetrey et al., 2010). Some studies on rivers compare the water quality status along the river from upstream to downstream (Kahirun et al., 2019; Utami and Fajar, 2022). While others conduct inventories to establish the ideal Ephemeroptera community conditions upstream for use as a reference (Dapas et al., 2018; Wakhid et al., 2021).</p>\n<p>The second most studied location is lake habitats. Studies investigated the water quality status of lakes in relation to the level of urbanization in the surrounding areas, ranging from relatively low urbanization conditions in rural areas to lakes surrounded by high anthropogenic activities in intensive urban settings (Priawandiputra et al., 2018; Fadilah et al., 2017).</p>\n<p>Furthermore, the proportion of research targeting irrigation canals, paddy fields, waterfalls, wetlands, and springs as habitats is relatively small. These aquatic habitats often receive insufficient attention, including for environmental quality assessment, despite being crucial for supporting various aquatic biota (Kartikasari, 2013; Wijayanti et al., 2016; Wakhid et al., 2020; Erniaty et al., 2023). Wetlands, for example, represent a potential and highly biodiverse habitat type found in several regions in Indonesia, such as Central and West Kalimantan (Giesen, 2000; Morrogh-Bernard et al., 2003).</p>\n<p>Finally, this review is expected to encourage further studies utilizing Ephemeroptera as environmental water health bioindicator in Indonesia, particularly in regions outside of Java Island, especially in the eastern part of Indonesia, including its smaller islands. Exploring unique habitat types like irrigation canals, paddy fields, waterfalls, wetlands, and springs will contribute to the knowledge of the presence of Ephemeroptera in various aquatic environments.</p>\n<h3><strong>CONCLUSION</strong></h3>\n<p>In conclusion, bioindicator studies using Ephemeroptera in Indonesia have only emerged in the last decade. Currently, research on Ephemeroptera as bioindicators for surface waters has been predominantly focused on Java Island. Regions on other islands remain relatively understudied, particularly in eastern Indonesia. River habitats lead in the number of observed habitat types. With this knowledge, future research on utilizing Ephemeroptera as bioindicators should prioritize areas beyond Java Island and focus on habitat types that have been less explored, including irrigation canals, paddy fields, waterfalls, wetlands, and springs.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>REFERENCES</strong></h3>\n<ul>\n<li>Akbar, H., Suyatna, I., Jailani, J., Putra, S. A., and Azmi, F., 2018. Effects of anthropogenic activity on stream water quality in Langsa, Aceh. Jurnal Biologi Tropis, 18 (2), 200-207.</li>\n<li>Badjoeri, M., and Samir, O., 2022. Effect of Anthropogenic Activity on Benthic Macroinvertebrate Functional Feeding Groups in Small Streams of West Sumatra, Indonesia. Sains Malaysian, 51 (11), Pp. 3551-3566.</li>\n<li>Barber-James, H. M., Gattolliat, J. L., Sartori, M., and Hubbard, M. D., 2007. Global diversity of mayflies (Ephemeroptera, Insecta) in freshwater. In Freshwater Animal Diversity Assessment, Springer Dordrecht, Pp. 339-350.</li>\n<li>Bauernfeind, E., and Moog, O. 2000. Mayflies (Insecta: Ephemeroptera) and the assessment of ecological integrity: a methodological approach. In Assessing the Ecological Integrity of Running Waters: Proceedings of the International Conference, held in Vienna, Austria, 9–11 November 1998, Springer Netherlands, Pp. 71-83).</li>\n<li>Beketov, M., 2004. Different sensitivity of mayflies (Insecta, Ephemeroptera) to ammonia, nitrite and nitrate: linkage between experimental and observational data. Hydrobiologia, 528 (1-3), Pp. 209-216.</li>\n<li>Chazanah, N., Muntalif, B. S., Sudjono, P., Rahmayunita, I., and Suantika, G., 2018. Determinant parameters for upstream ecological status assessment of Citarum River, Indonesia. GEOMATE Journal, 15 (50), Pp. 205-216.</li>\n<li>Curtean-Bănăduc, A., Burcea, A., Mihuţ, C. M., and Bănăduc, D., 2021. The benthic trophic corner stone compartment in POPs transfer from abiotic environment to higher trophic levels—Trichoptera and Ephemeroptera pre-alert indicator role. Water, 13 (13), Pp. 1778.</li>\n<li>Dapas, F., Dhahiyat, Y., Sunardi, S., Parikesit, P., Yusra, A. I., and Lananan, F., 2018. Aquatic insect larvae as an indicator of ecological integrity of Panasen Upstream, Tondano Watershed, north Sulawesi. Journal of Fundamental and Applied Sciences, 10 (1S), Pp. 590-608.</li>\n<li>Erniaty, E., Gumiri, S., Ardianor, A., Haryono, A., and Yulintine, Y., 2023. Diversity of Macrozoobenthos Species in Several Habitats in Peat Techno Park (PTP), University of Palangka Raya. Tec Empresarial, 18 (1), Pp. 98-111.</li>\n<li>Fadilah, U., Atmowidi, T., and Priawandiputra, W., 2017. Comparison of aquatic insect assemblages between managed and unmanaged artificial lakes in Indonesia. J. Entomol. Zool. Stud, (5), Pp. 496-506.</li>\n<li>Giesen, W., 2000. Flora and vegegation of Danau Sentarum: unique lake and swamp forest ecosystem of West Kalimantan. Borneo Research Bulletin, Pp. 89-123.</li>\n<li>Hall Jr, L. W., Killen, W. D., Anderson, R. D., and Alden III, R. W., 2021. Long term bioassessment multiple stressors study in a residential California stream. Journal of Environmental Science and Health, Part A, 56 (3), Pp. 346-360.</li>\n<li>Hasriyanty, H., Anshary, A., Saleh, S., Yunus, M., and Pasaru, F., 2022. The diversity of aquatic insects surrounding the gold mining areas of Central Sulawesi and their relation with mercury levels and water quality. Jurnal Entomologi Indonesia, 19 (3), Pp. 235-235.</li>\n<li>Herawati, H., Patria, E., Hamdani, H., and Rizal, A., 2020. Macrozoobenthos diversity as a bioindicator for the pollution status of Citarik River, West Java. In IOP Conference Series: Earth and Environmental Science, 535, 1, Pp. 012008. IOP Publishing.</li>\n<li>Hoopes, D. T., 1960. Utilization of mayflies and caddis flies by some Mississippi River fishes. Transactions of the American Fisheries Society, 89 (1), Pp. 32-34.</li>\n<li>Jacobus, L. M., Macadam, C. R., and Sartori, M., 2019. Mayflies (Ephemeroptera) and their contributions to ecosystem services. Insects, 10 (6), Pp. 170.</li>\n<li>Jun, Y. C., Won, D. H., Lee, S. H., Kong, D. S., and Hwang, S. J., 2012. A multimetric benthic macroinvertebrate index for the assessment of stream biotic integrity in Korea. International journal of environmental research and public health, 9 (10), Pp. 3599-3628.</li>\n<li>Kadim, M. K., Herawati, E. Y., Arfiati, D., and Hertika, A. M. S., 2022. Macrozoobenthic diversity and heavy metals (Pb and Hg) accumulation in Bone River Gorontalo Indonesia. In IOP Conference Series: Earth and Environmental Science,1118, (1).</li>\n<li>Kahirun, K., Sabaruddin, L., Mukhtar, M., and Kilowasid, L. M. H., 2019. Evaluation of land use impact on river water quality using macroinvertebrates as bioindicator in Lahumoko Watershed, Buton Island, Indonesia. Biodiversitas Journal of Biological Diversity, 20 (6).</li>\n<li>Kartikasari, D, 2013. Application of water quality and ecology indices of benthic macroinvertebrate to evaluate water quality of tertiary irrigation in Malang district. Journal of Tropical Life Science, 3 (3), Pp. 193-201.</li>\n<li>Lancaster, J., and Downes, B. J., 2013. Aquatic entomology. OUP Oxford.</li>\n<li>Lepori, F., Barbieri, A., and Ormerod, S. J., 2003. Effects of episodic acidification on macroinvertebrate assemblages in Swiss Alpine streams. Freshwater Biology, 48 (10), Pp. 1873-1885.</li>\n<li>Menetrey, N., Oertli, B., Sartori, M., Wagner, A., and Lachavanne, J. B., 2010. Eutrophication: are mayflies (Ephemeroptera) good bioindicators for ponds? Pond Conservation in Europe, Pp. 125-135.</li>\n<li>Morrogh-Bernard, H., Husson, S., Page, S. E., and Rieley, J. O., 2003. Population status of the Bornean orang-utan (Pongo pygmaeus) in the Sebangau peat swamp forest, Central Kalimantan, Indonesia. Biological Conservation, 110 (1), Pp.141-152.</li>\n<li>Nasaruddin, N., Sabaruddin, L., Analuddin, K., and La Baco, S., 2023. Taxonomic and functional diversity of aquatic macroinvertebrate from natural forest as reference for streams health indicators in Lasolo Watershed, Southeast Sulawesi, Indonesia. Biodiversitas Journal of Biological Diversity, 24 (10).</li>\n<li>Priawandiputra, W., Zakaria, F. R. N., and Prawasti, T. S., 2018. Aquatic insect community as indicator of water quality assessment in situ gede system, Bogor, Indonesia. In IOP Conference Series: Earth and Environmental Science, 197 (1), Pp. 012016. IOP</li>\n<li>R Core Team., 2019. R: A language and environment for statistical computing. Vienna: R Foundation for Statistical Computing, Vienna, Austria. http://www. R-project. org/.</li>\n<li>Rachman, H., Priyono, A., and Wardiatno, Y., 2016. Macrozoobenthos as bioindicator of river water quality in Ciliwung Hulu Sub watershed. Media Konservasi, 21 (3), Pp. 261-269.<br />\nRaha</li>\n<li>rdjanto, A., Kusnoputranto, H., Sutjiningsih, D., and Seda, F. S., 2013. Activation Communities on Sustainable River Conservation Based on Macroinvertebrates Knowledge in Brantas Upper Watershed Area. In Activation Communities on Sustainable River Conservation Based on Macroinvertebrates Knowledge in Brantas Upper Watershed Area. Proceeding International Conference, The 4th Green Technology.</li>\n<li>Sartori, M., and Brittain, J. E., 2015. Order Ephemeroptera. In Thorp and Covich’s freshwater invertebrates, Pp. 873-891. Academic Press.</li>\n<li>Sudarso, J., Suryono, T., Yoga, G. P., Samir, O., Imroatushshoolikhah., and Ibrahim, A.,2021. The impact of anthropogenic activities on benthic macroinvertebrates community in the Ranggeh River. Journal of Ecological Engineering, 22 (5), Pp. 179-190.</li>\n<li>Timoner, P., Fasel, M., Ashraf Vaghefi, S. S., Marle, P., Castella, E., Moser, F., and Lehmann, A., 2021. Impacts of climate change on aquatic insects in temperate alpine regions: Complementary modeling approaches applied to Swiss rivers. Global change biology, 27 (15), Pp. 3565-3581.</li>\n<li>Utami, S., and Fajar, E., 2022. Exploration of aquatic macroinvertebrates as a bioindicator of water quality in Nogosari River, Pacitan Regency. In 2nd International Conference on Education and Technology (ICETECH 2021), Pp. 91-98. Atlantis Press.</li>\n<li>Wakhid, W., Rauf, A., Krisanti, M., Sumertajaya, I. M., and Maryana, N., 2020. Species richness and diversity of aquatic insects inhabiting rice fields in Bogor, West Java, Indonesia. Biodiversitas Journal of Biological Diversity, 21 (1).</li>\n<li>Wakhid, W., Rauf, A., Krisanti, M., Sumertajaya, I. M., and Maryana, N., 2021. Aquatic insect communities in headwater streams of Ciliwung River watershed, West Java, Indonesia. Biodiversitas Journal of Biological Diversity, 22 (1).</li>\n<li>Wheeler, W. C., Whiting, M., Wheeler, Q. D., and Carpenter, J. M., 2001. The phylogeny of the extant hexapod orders. Cladistics, 17 (2), Pp. 113-169.</li>\n<li>Wijayanti, E., Fauzi, A., Widiansyah, A. T., Mustofa, Z., Setyanto, H. A., Sukoco, R. M., and Fadilah, R. E., 2016. The inventory of aquatic macroinvertebrates in various waterfall in east region of Malang, East Java. In Proceeding International Conference on Global Resource Conservation, 6, (1).</li>\n</ul>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>326-330</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>3</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8461\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/3wcm2024/3wcm2024-326-330.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"AqilZ","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"1f6f263a101b72653556f476601cc6dc270f267c547cbc543115c067052a879e","category":"Environment"}