{"title":"Use of capture–recapture models to evaluate abundance and dynamics of a stocked Muskellunge population","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.203?af=R","date":1725359905000,"content":"<h2>Abstract</h2>\n<p>To evaluate the success of a stocking program in Fox Lake, Minnesota, adult (≥76 cm total length) Muskellunge were captured with large nearshore trap nets and individually marked with passive integrated transponder tags during the 2011–2013 and 2015–2017 spawning seasons; then, capture–recapture data were analyzed at two different time scales. Despite substantial sampling effort, daily capture histories within a single season only supported closed-population abundance estimates for both sexes in half the years; estimates were imprecise, and there was evidence of trap shyness or violation of the short-term closure assumption in some years. Jolly–Seber models over all years supported relatively precise abundance estimates for both sexes every year, as well as estimates of annual survival, recruitment, and population growth rate. Link–Barker Jolly–Seber models provided estimates of population growth rate <i>λ</i> ≈ 1 indicating that per-capita annual recruitment rates of only about 0.15–0.20 were adequate to maintain the adult population given the high annual apparent survival rates of 0.80 for adult females and 0.89 for adult males. POPAN Jolly–Seber models revealed that about 80 adult females and 90–126 adult males were vulnerable to capture each year in the 385 ha lake, and about 16–18 fish of each sex recruited to the adult population annually. This study illustrates the importance of open-population models with multiple years of data to evaluate the abundance and population dynamics of a low-density, long-lived species.</p>","author":"Steven M. Shroyer, \nNathaniel C. Hodgins","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"1f778e395bf0f4889ce67db009539773f429e18b6eb00ac972058d08348d9965","category":"Environment"}