{"title":"Western Digital Asks 'My Book Live' Device Owners to Unplug After Reports of Remotely Wiped Drives","link":"https://www.macrumors.com/2021/06/25/wd-my-book-live-unplug-malicious-attack/","date":1624611859000,"content":"Western Digital is advising owners of its My Book Live storage drives to disconnect them from the internet until further notice, following reports from around the world that some devices have been compromised and wiped clean by malicious software.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/western-digital-my-book-live.jpg\" />\r\n<br />\r\nThe WD My Book Live is the company's network-attached storage device with the book-style design that can stand upright on a desk. The drive is typically connected to computers via USB and connects to a local network via ethernet. Meanwhile, the WD My Book Live app lets users access their stored files remotely through Western Digital's cloud servers. \r\n<br />\r\n\r\n<br />\r\nAs reported by <a href=\"https://www.bleepingcomputer.com/news/security/wd-my-book-nas-devices-are-being-remotely-wiped-clean-worldwide/\"><em>BleepingComputer</em></a>, My Book Live and Live Duo device owners on Thursday began flooding Western Digital's support forums with reports that all of their files had been mysteriously deleted and that they could no longer access the device via the offical app or a browser.\r\n<br />\r\n<blockquote>\"I have a WD My Book live connected to my home LAN that's worked fine for years,\" wrote the first poster in a <a href=\"https://community.wd.com/t/help-all-data-in-mybook-live-gone-and-owner-password-unknown/268111\">now-long thread</a>. \"I have just found that somehow all the data on it is gone today, while the directories seems there but empty. Previously the 2T volume was almost full but now it shows full capacity.\" </blockquote>When they attempted to log in using the drive's web dashboard, the drive told them they had an invalid password. Many other owners have also confirmed that their device has been hit with the same issue. \"All my data is gone too,\" another user said. \"I am totally screwed without that data... years of it.\"\r\n<br />\r\n\r\n<br />\r\nFollowing further reports, a pattern has gradually emerged in shared <a href=\"https://community.wd.com/t/help-all-data-in-mybook-live-gone-and-owner-password-unknown/268111/13\">device logs</a> that points to a remote command initiating a factory reset on affected devices beginning at around 3:00 p.m. on Thursday and continuing throughout the night. \r\n<br />\r\n\r\n<br />\r\nWestern Digital has advised customers in a <a href=\"https://community.wd.com/t/action-required-on-my-book-live-and-my-book-live-duo/268147\">new support notice</a> to disconnect their My Book Live devices while the company investigates the destructive attacks. The company has since told <em>BleepingComputer</em> they are actively investigating the attacks but do not believe it was a compromise of their servers.\r\n<br />\r\n<blockquote>\"Western Digital has determined that some My Book Live devices are being compromised by malicious software. In some cases, this compromise has led to a factory reset that appears to erase all data on the device. The My Book Live device received its final firmware update in 2015. We understand that our customers' data is very important. At this time, we recommend you disconnect your My Book Live from the Internet to protect your data on the device. We are actively investigating and we will provide updates to this thread when they are available.\"</blockquote>If the company is correct in saying its servers haven't been hacked, it's unclear how so many My Book Live accounts could be compromised at or around the same time. We've asked for more information from Western Digital regarding the matter and will post an update to this story if we hear anything back, but the advice for device owners for now is clear: Disconnect your My Book Live.<div>Tag: <a href=\"https://www.macrumors.com/guide/western-digital/\">Western Digital</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/25/wd-my-book-live-unplug-malicious-attack/\">Western Digital Asks 'My Book Live' Device Owners to Unplug After Reports of Remotely Wiped Drives</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/western-digital-asks-my-book-live-device-owners-to-unplug-after-reports-of-remotely-wiped-drives.2302234/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=2xQef2i_UVg:fIieybJlCY0:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=2xQef2i_UVg:fIieybJlCY0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/2xQef2i_UVg\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1f7b08716f8bd6117567c00d6ca4301253def66236d18672dd2e7118492aaad0","category":"Apple"}