{"title":"Join AWS Hybrid Cloud & Edge Day to Learn How to Deploy Your Applications in the Everywhere Cloud","link":"https://aws.amazon.com/blogs/aws/join-aws-hybrid-cloud-edge-day-to-learn-how-to-deploy-your-applications-in-the-everywhere-cloud/","date":1692204464000,"content":"<p><em>Editor’s note: The live event has ended, but you may still <a href=\"https://www.twitch.tv/videos/1912638901\" target=\"_blank\">watch the video on demand on Twitch.</a></em></p> \n<p>In his keynote of <a href=\"https://youtu.be/8_Xs8Ik0h1w?t=1357\">AWS re:Invent 2021</a>, Dr. Werner Vogels shared the insight of how “<strong>the everywhere cloud</strong>” is bringing AWS to new locales through AWS hardware and services and spotlighted it as one of his tech predictions for 2022 and beyond in <a href=\"https://www.allthingsdistributed.com/2021/12/tech-prediction-for-2022-and-beyond.html\">his blog post</a>.</p> \n<blockquote>\n <p>“What we will see in 2022, and even more so in the years to come, is the cloud accelerating beyond the traditional centralized infrastructure model and into unexpected environments where specialized technology is needed. The cloud will be in your car, your tea kettle, and your TV. The cloud will be in everything from trucks driving down the road, to the ships and planes that transport goods. The cloud will be globally distributed, and connected to almost any digital device or system on Earth, and even in space.”</p>\n</blockquote> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/11/2023-hybrid-edge-day-1.jpg\" alt width=\"1545\" height=\"779\" /></p> \n<p>AWS provides a truly consistent and secure experience to build and run applications across the continuum of environments where customers operate—from the cloud to large metro areas, 5G networks, on-premises locations, and to mobile and Internet of Things (IoT) devices.</p> \n<p>To learn more, join us for <a href=\"https://hybridcloudedgeday.splashthat.com/\"><strong>AWS Hybrid Cloud &amp; Edge Day</strong></a>, a free-to-attend one-day virtual event on August 30, 2023, starting at 10:00 AM PDT (1:00 PM ET). We will stream the event simultaneously across multiple platforms, including <a href=\"https://www.linkedin.com/company/amazon-web-services/\">LinkedIn Live</a>, <a href=\"https://twitter.com/AWSonAir\">Twitter</a>, <a href=\"https://www.youtube.com/c/AWSEventsChannel/featured\">YouTube</a>, and <a href=\"http://twitch.tv/awsonair\">Twitch</a>.</p> \n<p>You can hear from AWS leaders and industry analysts on the latest hybrid cloud and edge computing trends and emerging technologies and learn best practices for using AWS hybrid cloud and edge services across the cloud continuum. Also, learn from our customers on data strategies and key use cases and gain a deeper understanding of AWS hybrid cloud and edge services and new features and benefits.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/16/Hybrid-Cloud-Edge-Day-2023-1.jpg\" alt width=\"1268\" height=\"663\" /></p> \n<p>Here are some of the highlights you can expect from this event:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/11/2023-hybrid-edge-day-3.jpg\" alt width=\"450\" height=\"292\" /><strong>Leadership session</strong> – To kick off the day, we have a leadership session featuring <a href=\"https://www.linkedin.com/in/janhofmeyr/\">Jan Hofmeyr</a>, vice president of EC2 Edge, sharing insights into how customers are building high-performance, intelligent applications with recently announced AWS hybrid cloud, edge, and IoT capabilities. <a href=\"https://www.linkedin.com/in/eliaskhnaser/\">Elias Khnaser</a>, chief of research at EK Media Group, will join Jan to discuss the global, business, and economic trends impacting hybrid cloud and edge computing and discuss the customer requirements and use cases.</p> \n<p><strong>Cloud-closer sessions</strong> – We’ll discuss how AWS is bringing the cloud closer to metro areas and telco networks. Services such as <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/localzones/\">AWS Local Zones</a>, <a href=\"https://aws.amazon.com/outposts/\">AWS Outposts</a> family, and <a href=\"https://aws.amazon.com/wavelength/\">AWS Wavelength</a> bring the power of cloud compute and storage to the edge of 5G networks, unlocking more performant mobile experiences. We’ll highlight new and innovative use cases, including <a href=\"https://www.youtube.com/watch?v=9MX7Feob7rE\">Norton LifeLock</a>, <a href=\"https://aws.amazon.com/solutions/case-studies/innovators/ea/\">Electronic Arts</a>, and <a href=\"https://aws.amazon.com/solutions/case-studies/innovators/epic-games/\">Epic Games</a>, who have taken advantage of the operational consistency between AWS Regions and the edge. Also you can learn how to deploy in hybrid cloud scenarios in on-premises locations, such as examples from MindBody and ElToro through Onica, and <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/localzones/customers/\">more customer cases</a>.</p> \n<p><strong>On-premises sessions</strong> – Learn about our options to bring AWS Cloud to your data centers and on-premises locations for a truly consistent experience across your environments. We will review real-world examples of how AWS hybrid and edge services enable local processing of data for faster response time and faster decision-making. Also, we will share how <a href=\"https://aws.amazon.com/solutions/case-studies/toyota-ecs-case-study/\">Toyota</a> takes advantage of hybrid options from <a href=\"https://aws.amazon.com/ecs\">Amazon ECS</a> and <a href=\"https://aws.amazon.com/eks/\">Amazon EKS</a> to use familiar management tools across your environments to successfully modernize your applications. You can learn how to meet your on-premises regulatory requirements and real-world scenarios effectively in critical aspects of digital sovereignty and data residency.</p> \n<p><strong>Rugged edge sessions</strong> – You will learn about AWS services to support rugged, mobile, and disconnected edge, such as <a href=\"https://aws.amazon.com/snow\">AWS Snow Family</a> to enable organizations to deploy compute workloads in locations with denied, disrupted, intermittent, and limited (DDIL) connectivity. Learn how <a href=\"https://aws.amazon.com/blogs/networking-and-content-delivery/lightning-in-a-bottle-festival-2023-ddr-live-deploys-aws-private-5g/\">DDR.Live</a> deployed their own 4G/LTE or 5G private network using <a href=\"https://aws.amazon.com/private5g/\">AWS Private 5G</a> for live events in the place with limited wireless connection. We will discuss the top use cases, such as deploying a pre-trained object detection model and architecting applications at the edge. Finally, we will discuss the benefits and requirements of operating at the edge with <a href=\"https://www.linkedin.com/in/holgermueller/\">Holger Mueller</a>, vice president and principal analyst, Constellation Research, Inc.</p> \n<p><strong>IoT panel discussion</strong> – We will discuss from panelist of AWS IoT customers and industry experts on their innovation journey. Join us to see how <a href=\"https://aws.amazon.com/blogs/apn/extend-data-management-to-the-edge-with-aws-iot-core-edge-software-qualification/\">EuroTech</a> brought to market a set of devices and services that improve operational efficiencies with connectivity at the edge. You’ll also hear how <a href=\"https://press.aboutamazon.com/2022/11/wallbox-goes-all-in-on-aws\">Wallbox</a>, an Electric Vehicle charging company, reduced their operational costs and scaled efficiently with <a href=\"https://aws.amazon.com/iot/\">AWS IoT services</a>.</p> \n<p><strong>Multicloud sessions</strong> – AWS has <a href=\"https://aws.amazon.com/hybrid-multicloud/\">the tools</a> to help you run and support your multicloud operations in the areas of governance, ops management, observability, and more. We will discuss common challenges in hybrid and multicloud environments and how AWS helps you manage, operate, and automate your processes. We’ll also talk about how <a href=\"https://aws.amazon.com/solutions/case-studies/rackspace-case-study/\">Rackspace</a> used <a href=\"https://aws.amazon.com/systems-manager/\">AWS Systems Manager</a> for instance patching across hybrid and multicloud environments, automating their infrastructure management across cloud providers.</p> \n<p>This event is for any customer and builder who is eager to learn more about hybrid cloud, edge computing, IoT, networking, content delivery, and 5G. We’ll cover how you can support applications that need to remain on premises or at the edge due to low latency, local data processing, or data residency requirements.</p> \n<p>To learn more details, see the event schedule, and register for AWS Hybrid Cloud &amp; Edge Day, go to <a href=\"https://hybridcloudedgeday.splashthat.com/\">the event page</a>.</p> \n<p>— <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"1f7bd51964acb041b89be6a4a3de1846c1ce228d447afbfb1defbf2891e48481","category":"Tech"}