{"title":"Evaluating STEM Lecturers &lsquo;Experiences with Digital Assessments and Continuity of Digital Transformation in Higher Education","link":"https://www.preprints.org/manuscript/202312.0069/v2","date":1717135853000,"content":"There are clear signs that the COVID-19 pandemic has had a straining impact on the higher education sector in South Africa and the far reaches of the world. This chapter examines (Science, Technology, Engineering, Mathematics) STEM lecturers’ experiences with digital assessments and perspectives on the continuity of digital transformation in the higher education sector in the post-COVID-19 era at one of South Africa’s rural universities. In 2022, a survey of ten (10) lecturers was conducted and the reports were also consulted by four (4) e-learning practitioners to obtain their views on the use of online learning and contact courses in the post-pandemic period. A qualitative research approach was used to understand the puzzling issues faced by STEM lecturers at a previously disadvantaged institution in Limpopo Province. The results of this study show that there is a puzzling conundrum that hinders the integration of effective online learning. Furthermore, online education as the new normal in the post-COVID-19 era seems unattainable due to extremely complex and difficult-to-understand mathematical symbols. Software and tools proved to be limitations in terms of establishing an interactive learning environment for students and lecturers on online learning platforms. Lecturers’ use of learning and teaching platforms deteriorated due to numerous unknown challenges, but also the tightening of COVID-19 restrictions. Furthermore, the results showed that science and mathematics lecturers believe that contact learning remains irreplaceable across generations and eras as some are not technology enthusiasts. This paper recommends that the lack of technological systems as well as technological resistance and reluctance to adopt transformative pedagogy and innovative practices, should not be viewed as a thorny issue to end the dominance of online education in STEM courses. Keywords: connectivism, Learning Management Systems, affordances, technological resistance, Moodle, transformative pedagogy","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1f8806f22f94de8b2c5261411dca0803754f56269bdfd29f3e77cc52ad7dc41d","category":"Interdisciplinary"}