{"title":"Suspended Soils Have Common Features Regardless of the Species of Epiphyte or the Place in Which They Were Formed","link":"https://www.preprints.org/manuscript/202410.1144/v1","date":1728987278000,"content":"The Suspended soils (which are also called canopy soil), associated with epiphytic plants in tropical forest canopies, have a very special type of biological cycle, morphological organization and ecological functional role. To date, only some features of these soils have been described for certain sectors of the tropics, in particular Southeast Asia. It was studies out whether the chemical composition and hydrological parameters depend significantly on the genesis of suspended soil, or they represent a single soil phenomenon with a certain supposed ecosystem function. Suspended soils are characterized by average values of hygroscopic moisture comparable with mineral soils.  At the same time the maximum water holding capacity and field moisture capacity  reaches hundreds and even thousands of percent which cannot but lead to mesophilization of the microclimate of the near-stem environments. In any case suspended soils are characterized by 4-10 higher values of hydrologic properties than mineral terrestrial soils of the same landscapes. The carbon content in suspended soil materials varied widely and was comparable with that of tropical forest litter and boreal peatlands . At the same time, tropical suspended soils are characterized by very low nitrogen content, which is reflected in very high carbon-to-nitrogen ratios. Such a values are typical of peats and forest litter and indicates a very low degree of humification of organic matter. Soil pH values tends to the acidic, and more often very acidic range. This corresponds well to the low content of labile  forms of calcium and magnesium and corresponds to the oligotrophy of the soils. The content of mobile forms of phosphorus, potassium and ammonium nitrogen is extremely high in suspended soils.   The high content of nutrients in tropical suspended soils is enormously high compared to forest soils of other climatic zones  and should be noted as their most important attributive characteristic.  Taking into account the high accumulative-sorption capacity of suspended soils, the low content of heavy metals in them indicates the absence of modern aerotechnogenic pollution of all the studied ecosystems. Thus, we are talking about a certain deficiency of heavy metals in the eluvial ecosystem of the tropical rain forest. This once again confirms the hypothesis that the essence of epiphytic soil formation was and is that the biotic cycle breaks away from the ground and moves evolutionarily into the middle and upper tiers of the tropical rainforest ecosystem. Tree trunks in this context represent vertically and subhorizontally oriented phase interfaces, similar to parent materials, and epiphytic soils are analogues of peat accumulations with extremely high water-holding capacity, which is of extremely important environmental significance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1f8936b633f68410971639ae197ea0e9552e82b206f511cb5209c7e60c7b1643","category":"Interdisciplinary"}