{"title":"Effects of Bacillus subtilis on in vitro ruminal fermentation and methane production","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae054/7642041?rss=1","date":1712534400000,"content":"<span><div>Abstract</div>The objective of this study was to evaluate the effect of a proprietary strain of a <span>Bacillus subtilis</span> on in vitro ruminal fermentation and methane production in batch culture serum bottles. One hundred forty-nine batch culture bottles were used in a complete randomized block design. The arrangement of treatments was a 3 × 3 × 4 factorial to evaluate the effects of inoculum, time, diet, and their respective interactions. There were three experimental runs total, where the run was used as block. Inoculum treatments were 1.85 mg/mL of microcrystalline cellulose (CON); 10 billion <span>B. subtilis</span> plus microcrystalline cellulose (A1); and 60 billion <span>B. subtilis</span> plus microcrystalline cellulose (A2). Diet treatments were 0.50 g of early lactation diet (E, 30% starch), mid-lactation diet (M, 25% starch), or dry cow diet (D, 18% starch). The combination resulted in total of nine treatments. Each treatment had five replicates, two of which were used to determine nutrient degradability at 24 and 48 h after inoculation, and three were used to determine pH, ammonia nitrogen (NH<sub>3</sub>-N), volatile fatty acids, lactate, total gas, and methane production at 3, 6, 24, and 48 h after inoculation. Fixed effects of inoculum, diet, and their interaction were tested using the GLIMMIX procedure of SAS. Significance was declared at <span>P</span> ≤ 0.05. We observed that, compared to control, the supplementation of <span>B. subtilis</span>, decreased the production of acetate and propionate, while increasing the production of butyrate, <span>iso</span>-butyrate, valerate, <span>iso</span>-valerate, and caproate within each respective diet. Additionally, the total methane production exhibited mixed responses depending on the diet type. Overall, the inclusion of <span>B. subtilis</span> under in vitro conditions shows the potential to reduce ruminal methane production when supplemented with a mid-lactation diet, constituting a possible methane mitigation additive for dairy cattle diets.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"1f91629b91b6a4f52c051e14d5c23d4d8400feaa39f3f75766aa7fcf3ab80231","category":"Environment"}