{"title":"An Introduction To Figma Interactive Components","link":"https://smashingmagazine.com/2021/07/introduction-figma-interactive-components/","date":1625655600000,"content":"<p>Recently, Figma rolled out the beta for the newest interactive components feature that allows defining interactions and animations directly into the variants and propagates them to every component instance. This means that it is now possible to create a component with states (hover, active, clicked, focus) and make it interactive so that every copy of the component will inherit those same interactions by default, helping a lot in the prototyping phase. </p>\n<p>Here’s a comparison example of how the workflow will change:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4ba82d49-8dd6-4949-91eb-6e15f15a824d/28-introduction-figma-interactive-components.png\" /></p>\n<p>As you can see in the example above, it requires four screens and eight interactions to make the prototype work as a real product. And if I wanted to use three switches, I would have to add even more screens and interactions.</p>\n<p>In the next example, it only requires one screen and one component with two variants for the interactions, and the switch is the same so it can be duplicated as many times as needed:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/72d2bd25-8cb7-429c-9ccf-c4bbb54812ae/24-introduction-figma-interactive-components.png\" /></p>\n<p>Using Interactive Components simplifies not only the final prototype but also the <em>logic</em> behind it, making it easier to learn how to build, maintain and update the prototypes.</p>\n<p>Now, before we start:</p>\n<h4>Interactive Components (Beta Access)</h4>\n<p>You need to <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSctELo9clvK0uP-0zDAxMqrgtCNyK0OB2hff6O7SnK9y4jo5g/viewform\"><strong>sign up</strong></a> for the Interactive Components Beta program to start experimenting with this new feature as it is not yet available in the current stable release. Joining the Beta is free and once you submit the form, it should not take more than two or three days before you see Interactive Components appear in your Figma design tool.</p>\n<h4>Freebie</h4>\n<p>I have created a Figma design file with the examples from this article. Once you join the Beta, you can duplicate my design and follow along more easily.</p>\n<ul>\n<li><a href=\"https://www.figma.com/community/file/949638648436079728\">Download the Figma design file →</a></li>\n</ul>\n<h3>Before Starting</h3>\n<p>It’s necessary to understand some key Figma elements that we are going to use, if you’re already familiar with them you can skip this part and start directly with the first tutorial (section: “Create your first Interactive Component”).</p>\n<h4>Components</h4>\n<p>Think of these as items that, when duplicated, create a connection with its copy (called <strong>instance</strong>) and when the component is changed, the instance receives the same changes. You can also apply overrides to instances (which are basically style changes to the component properties which allow for some customization).</p>\n<ul>\n<li>Learn more about <a href=\"https://help.figma.com/hc/en-us/articles/360038662654-Guide-to-Components-in-Figma\"><strong>Components</strong> →</a></li>\n<li>Learn more about <a href=\"https://help.figma.com/hc/en-us/articles/360039150733\"><strong>Overrides</strong> →</a></li>\n</ul>\n<h4>Variants</h4>\n<p>These are the different styles a component can have and are usually used to apply different properties such as size or states.</p>\n<ul>\n<li>Learn more about <a href=\"https://help.figma.com/hc/en-us/articles/360056440594-Create-and-use-variants\"><strong>Variants</strong> →</a></li>\n</ul>\n<h4>Interaction Details Panel</h4>\n<p>It’s important to understand the Interaction Details panel because it allows us to define the different interactions and animations for our interactive components. Figma has a lot of information on their site so I will include links for those of you that want to dig deeper.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/64cea099-45ca-428f-a5ec-26b06a31d521/12-introduction-figma-interactive-components.png\" /></p>\n<h5>Hotspot</h5>\n<p>Even though this is not inside the panel, the hotspot is the element where the interaction will happen, in our case, each variant will be an interactive hotspot for which you can define triggers and actions.</p>\n<h5>Triggers</h5>\n<p>These are known in development as <strong>Events</strong> and are the different ways we the user can activate an interaction.</p>\n<ul>\n<li>On Click,</li>\n<li>On Drag,</li>\n<li>While Hovering,</li>\n<li>While Pressing,</li>\n<li>Key/gamepad,</li>\n<li>Mouse Enter,</li>\n<li>Mouse Leave,</li>\n<li>Mouse Down,</li>\n<li>Mouse Up,</li>\n<li><p>After Delay.</p>\n</li>\n<li><p>More information about <a href=\"https://help.figma.com/hc/en-us/articles/360040035834-Prototype-triggers\"><strong>Triggers</strong> →</a>.</p>\n</li>\n</ul>\n<h5>Actions</h5>\n<p>In this setting, you can define what will happen when the interaction is activated; for interactive components, we will use <strong>Change To</strong> which allows swapping the variants inside a component. </p>\n<ul>\n<li>Change To,</li>\n<li>Navigate To,</li>\n<li>Open Overlay,</li>\n<li>Scroll To,</li>\n<li>Swap With (overlay),</li>\n<li>Back,</li>\n<li>Close Overlay,</li>\n<li>Open URL.</li>\n</ul>\n<h5>Destination</h5>\n<p>This is the final target of the action. In my examples, I will use a variant as the destination to swap it from Switch OFF to Switch ON.</p>\n<h5>Animations</h5>\n<p>Figma comes with a set of pre-defined transitions that can be useful for some cases (move in, push, slide-in) but I always prefer to go with <strong>Smart Animate</strong> and define my own transitions as it’s really easy to use — it basically checks the layer names and if there are changes between the selected frame and the destination frame, it will animate those layers.</p>\n<ul>\n<li>More information about Figma <a href=\"https://help.figma.com/hc/en-us/articles/360040522373-Prototype-animations\"><strong>Transitions</strong></a> and <a href=\"https://help.figma.com/hc/en-us/articles/360039818874-Create-advanced-animations-with-Smart-Animate\"><strong>Smart Animate</strong></a> →</li>\n</ul>\n<h5>Easing</h5>\n<p>Easing refers to the way the animation moves, it’s basically how the element accelerates and decelerates. I’m going to use two settings for this tutorial: <strong>Ease In and Out</strong> for the switch, and <strong>Linear</strong> for the loops, but have in mind that it’s also possible to define a custom easing so you might want to learn more about <a href=\"https://help.figma.com/hc/en-us/articles/360051748654-Prototype-easing-curves\"><strong>Easing</strong></a>. </p>\n<h3>Creating Your First Interactive Component</h3>\n<p>Now that you have all the information you can start making your first interactive component. I’ll show you a very common case by creating a simple switch that has two states (Off and On) and use the variants to replicate those states.</p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/74698650-1de3-4868-848d-c85eea085a58/21-introduction-figma-interactive-components.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/74698650-1de3-4868-848d-c85eea085a58/21-introduction-figma-interactive-components.gif\" /></a>We’ll start by creating a simple switch.\n\n<h4>Create A Component</h4>\n<p>The first step is to create a component.</p>\n<ul>\n<li>Using the Rectangle tool (<code>R</code>), create a grey rectangle (#A7A9BC) <code>56x32</code> pixels in size and apply a corner radius of <code>16</code> px. </li>\n<li>Using the Ellipse tool (<code>O</code>) create a white circle (<code>#FFF</code>) <code>24x24</code> pixels in size and place it over the rectangle in the left part, leaving <code>4</code> px of spacing. This is how it should look:</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0804cfbb-d848-43cf-a289-241525056079/20-introduction-figma-interactive-components.png\" /></p>\n<ul>\n<li>Combine these two elements into a single component using Ctrl/Cmd + Alt + K (or using the Component icon from the top bar in Figma):</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3193dbae-c024-4593-8c91-737760b3fffc/3-introduction-figma-interactive-components.png\" /></p>\n<p><strong>Note:</strong> Here and in other places, I will use the Windows/Mac universal key notation, where the Ctrl key in Windows corresponds to the Cmd key on the Mac; Alt in Windows is the equivalent of Alt/Option on the Mac, so I’ll use Alt for short, and Shift is the same on both platforms.</p>\n<h4>Add A Variant</h4>\n<ul>\n<li>Select the component you’ve just created and, in the right panel (inside the Design tab), click on the plus button near <strong>Variants</strong>:</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/59d2db9f-6031-48f1-b70b-462f860eadae/6-introduction-figma-interactive-components.png\" /></p>\n<p>It will generate a purple frame with a dashed border that represents the group of variants you have. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/74c7e4e7-b853-4a1f-ad20-34038d7708c0/26-introduction-figma-interactive-components.png\" /></p>\n<p>You should have two variants by now, use the first one for the <strong>Off</strong> <strong>state</strong> and the second one for the <strong>On</strong> <strong>state</strong>. </p>\n<ul>\n<li>Apply a different style to the <strong>On</strong> <strong>state</strong> to make it the active option, I recommend using a blue background (#0B5FFF) and move the circle to the right. </li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a3a0f3ed-d446-4ded-b9fb-e68111adde0d/27-introduction-figma-interactive-components.png\" /></p>\n<p>These are the states of the switch that are going to change from <strong>Off</strong> to <strong>On</strong> (and vice-versa) when the user clicks on the switch.</p>\n<p><strong>Useful tip:</strong> For this case it is <em>not</em> necessary but if you need to add <em>more variants</em> you can select a component inside the box and click the purple plus button, it will add a copy of the selected component and resize the box automatically. (It’s also possible to resize the box manually as if it was a frame and freely duplicate and arrange the variants inside it.)</p>\n<h5>Alternative approach</h5>\n<p>As you’ve seen, we’ve created these components by duplicating them inside the variant group but <strong>it's also possible to create them individually and combine them as variants</strong>, the final result will be exactly the same. If you want to try this method just create and select two components, the right panel will then have another action called “Combine as variants,” click it and done — you will now have the same two variants.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/61803bd4-11c5-4852-b7b2-0033b19d167f/2-introduction-figma-interactive-components.png\" /></p>\n<p>This alternative is really useful when you already have different components and only need to define the variants, if you're working on a library it will help you update it without having to recreate everything from scratch.</p>\n<h4>Name Your Variants</h4>\n<p>Naming the variants won’t have a direct effect over the final result <em>(unless you use the same name more than once)</em>, but defining the names and hierarchies will help you have everything better organized and understandable for other colleagues that might need to use the prototype for other projects.</p>\n<p>By default the main group of variants is named “Property 1”, you can change this from the sidebar when selecting the entire group. I suggest renaming this to “State” since we’re going to use Off and On states.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2ff2e8cc-eeb1-4389-9d02-58c44d1bdfba/14-introduction-figma-interactive-components.png\" /></p>\n<p>Renaming a single variant is done by using the same process but you need to select the single variant inside the group and in the same panel you’ll find the names “Default” and “Variant 2” that you can overwrite, for the switch name these should be “Off” and “On”.</p>\n<p>As a result, the layer names of the variants will be automatically changed to “State=Off” and “State=On”.</p>\n<p><strong>Fun fact:</strong> If your component only has two variants and you use the names “Off” and “On”, it will show a switch instead of a dropdown in the destination!</p>\n<h4>Let’s Make It Interactive!</h4>\n<p>Now that you have the component and the variants it’s time to apply the <strong>interactions</strong>.</p>\n<ul>\n<li>Click on the Prototype tab (at the top-right side of the screen) to open the Prototype panel and activate its features.</li>\n<li>Select the <strong>Off</strong> variant (it should have a blue dot) and drag it over the <strong>On</strong> variant to connect it.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/550657cb-d00a-4206-be1a-3e686c96073a/4-introduction-figma-interactive-components.png\" /></p>\n<ul>\n<li>Double-check that you have selected the whole variant and not just the background layer, this will make the interaction work even when the user clicks on the circle element.</li>\n<li>In the Interaction Details panel set the trigger to <strong>On Click</strong>.</li>\n<li>Make sure the action is set to <strong>Change To</strong>.</li>\n<li>Change the animation to <strong>Smart Animate</strong> and use Ease In And Out for a natural feeling.</li>\n</ul>\n<p>I'll translate these settings into a single sentence to explain what will happen: when the user <strong>Clicks</strong> on <strong><em>Off</em></strong> <strong>State</strong> then <strong>Change to</strong> <strong><em>On</em></strong> <strong>State</strong> using <strong>Smart Animate</strong> with <strong>Ease In And Out</strong> at <strong>300 milliseconds.</strong></p>\n<ul>\n<li>Apply the same settings to the <strong>On State</strong> variant so that when clicked again it, will turn off the switch. (<strong>Note:</strong> Figma will remember the interaction settings applied to the elements inside the group and will apply the same settings when dragging a new interaction so in this case, you would only need to double-check.)</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/286d5aa0-5e13-4993-b0ea-9a00a48580b4/25-introduction-figma-interactive-components.png\" /></p>\n<p>Done! If you want to check if it works you need to include one of the variants into a frame, select the frame and then click on the presentation button (represented by the play icon) that is placed over the tabs.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d71e63cd-948e-4ddd-8162-713deb2e2bd5/17-introduction-figma-interactive-components.png\" /></p>\n<p>It should allow you to turn On/Off every switch individually. </p>\n<p>However, if you want to see the real power of this feature, duplicate the component in the frame multiple times (at least three or more) and activate them individually in the presentation.</p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/df848f72-3f4b-4425-b691-8c4147c548f1/22-introduction-figma-interactive-components.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/df848f72-3f4b-4425-b691-8c4147c548f1/22-introduction-figma-interactive-components.gif\" /></a>The switch interactive components in action.\n\n<h4>Using More Than Two Variants</h4>\n<p>This feature becomes very powerful when you add multiple variants and connect them individually to make a realistic component. Here is an example where I’ve connected a total of <strong>six</strong> <strong>variants</strong> with small changes to the background color to recreate the multiple states of a button, a classic in the web design industry nowadays.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1f241146-f537-4bc1-bf42-0273a645460c/7-introduction-figma-interactive-components.png\" /></p>\n<h5>Component States</h5>\n<p>This is the list of the different states for this component, including also the triggers we’re going to use to change from one variant to another. </p>\n<ol>\n<li>Default — Default,</li>\n<li>Hover — WhileHover,</li>\n<li>Pressed — MouseDown,</li>\n<li>Active — MouseUp (It could be possible to use On Click for the same result),</li>\n<li>Hover while Active — WhileHover,</li>\n<li>Pressed while Active — MouseDown.</li>\n</ol>\n<p><strong>Useful tip:</strong> It’s possible to use <strong>MouseDown</strong> to simulate the button being <em>pressed</em> but not released and then use <strong>MouseUp</strong> to activate a transition, it’s a nice interaction detail that makes the button feel more real.</p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/193b1539-0945-4c03-b91c-ee20cad2bbb6/8-introduction-figma-interactive-components.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/193b1539-0945-4c03-b91c-ee20cad2bbb6/8-introduction-figma-interactive-components.gif\" /></a>Use the MouseDown trigger before the Click trigger.\n\n<h4>Nested Interactive Components</h4>\n<p>As for the regular components, you can also create <strong>nested</strong> interactive components. </p>\n<p>Using the same example of the dropdown it would be possible to create a single interactive component called <em>Dropdown</em> with two interactive components inside it: the <em>Dropdown Button</em> and the <em>Dropdown Menu.</em> This will help you control how the button and the menu interact with each other, allowing you to define which variant of the button will trigger the opening of the menu.</p>\n<p><strong>Note:</strong> It would be possible to create another nested component for the dropdown menu options and use the override to change the different texts.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/45458569-40d5-4658-8823-b25ca4668fd5/15-introduction-figma-interactive-components.png\" /></p>\n<p>The main benefit of using nested interactive components is the new level of modularity that it provides for prototypes, you could define the interactions individually and mix them into infinite interactive components. The <em>Dropdown Menu</em> could be included in other components (a card, for example) without having to prototype how it works every single time. </p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8e7b8fe9-a988-4711-bd15-ad8ccd7301ae/10-introduction-figma-interactive-components.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/90c6fce3-989c-4bed-8a17-3188d989e1dc/10-introduction-figma-interactive-components-800w.gif\" /></a>It’s possible to simulate real Hover and Click effects. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8e7b8fe9-a988-4711-bd15-ad8ccd7301ae/10-introduction-figma-interactive-components.gif\">Large preview</a>)\n\n<h4>Navigation</h4>\n<p>We can go even further, it’s also possible to navigate from a variant to an external frame, you can connect the single variant to the frame by using the <strong>On Click</strong> trigger and <strong>Navigate To</strong> action. In this example I’ve connected each one of the actions from the <em>Dropdown Menu</em> component to an external frame with a grey rectangle in the same position as the menu (Right, Top, Left, Bottom).</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/90711a09-4a37-403d-8e5b-dbc3f559bb34/16-introduction-figma-interactive-components.png\" /></p>\n<p>When one of these actions is clicked, it will navigate to the connected frame as it happens with regular prototypes, the real magic happens when you need to reuse the <em>Dropdown Menu</em> for another component, it will have all the interactions inside already done, so you don’t have to connect it over and over again. </p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e1a75579-a4f9-4b75-814e-e86f20009c11/9-introduction-figma-interactive-components.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0b39f389-bdb1-4fca-aee1-7957d9994eaf/9-introduction-figma-interactive-components-800w.gif\" /></a>This dropdown menu is a great example of how real an interactive component can get. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e1a75579-a4f9-4b75-814e-e86f20009c11/9-introduction-figma-interactive-components.gif\">Large preview</a>)\n\n<p>This workflow and the features of the nested components are amazing for product design cases where you have tons of frames to connect as they will reduce the amount of work required to create a high-fidelity prototype for testing, or even if you want to create a components library for prototypes.</p>\n<h3>Special Effects</h3>\n<p>That was all for the introduction to Figma <strong>interactive components</strong>. As you can see, it’s pretty easy to use this feature to create and connect interactions inside a prototype. But it’s also possible to create various kinds of special effects using <strong>variants</strong>.</p>\n<p>In the following section, I will take a close look at these!</p>\n<h4>Loops</h4>\n<p>It’s finally possible to make infinity loops inside Figma without too much effort and also you can create various spinners and loading indicators. </p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7726525c-3a0e-4e7b-a277-1b65d134ca92/18-introduction-figma-interactive-components.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/93c5191e-0041-437c-b1f6-b24ef37d8af8/18-introduction-figma-interactive-components-500w.gif\" /></a>Elements can be resized to create infinite loops. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7726525c-3a0e-4e7b-a277-1b65d134ca92/18-introduction-figma-interactive-components.gif\">Large preview</a>)\n\n<p>To create a loop, use the <strong>After Delay</strong> trigger set to <code>1</code> ms to swap the variants automatically and connect at least two of them.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/722f4dec-52d2-42ec-8616-b17b443128fb/5-introduction-figma-interactive-components.png\" /></p>\n<p><strong>Note:</strong> <code>1</code> ms is the <strong>minimum</strong> amount of time we can set in Figma to change from a variant to another and make it an almost instantaneous change; and, thanks to the AfterDelay trigger, it will happen automatically. It’s possible to use a higher delay time if you need the loop to look like it has a pause between the variants.</p>\n<h4>Rotation</h4>\n<p>Let me start the next part of the article with a note about how strangely Figma handles rotation.</p>\n<p>Figma has a weird way to rotate elements, it seems to be limited from <code>-179</code>º to a maximum of <code>180</code>º and does not allow to go further than these values. In addition, there is no way to define a rotation direction so if you try to rotate from <code>0</code>º to <code>180</code>º and vice-versa, instead of doing a <code>360</code>º turn, it will first rotate to <code>180</code>º and then come back to <code>0</code>º (like a swing). </p>\n<p>So, to let the system identify correctly the rotation you will need to use at least <strong>three</strong> variants.</p>\n<p>Here’s how you can do it:</p>\n<ul>\n<li>Create a component with three variants: VariantA, VariantB, VariantC (for this example I modified an ellipse to make the triangle shape).</li>\n<li>Apply the following rotation to the elements <strong>inside</strong> the variants (<strong>not</strong> the variants themselves).<ul>\n<li><strong>VariantA:</strong> set the element to <code>0</code>º and connect the variant to <strong>VariantB</strong>.</li>\n<li><strong>VariantB:</strong> set the element to <code>-120</code>º and connect the variant to <strong>VariantC</strong>.</li>\n<li><strong>VariantC:</strong> set the element to <code>120</code>º and connect the variant to <strong>VariantA</strong> to complete the loop.</li>\n</ul>\n</li>\n<li>All the interactions should have <strong>After Delay (1ms)</strong> as a trigger and a <strong>Linear</strong> easing.</li>\n</ul>\n<p>The result will be a neutral spinner that will have three small pauses of <code>1</code> ms each because of the variant swap, not perfect but fast and for a prototype, it’s good enough — and you will be probably the only one that will notice the pauses anyway. </p>\n<p><strong>Useful tip</strong>: You can either use the same animation time for each variant to make a linear loop, or you can play with the animation using a faster time for some variants and a slower time for others, this will simulate a curved easing.</p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8cc57af1-e8c7-41eb-bf40-c3add3232315/19-introduction-figma-interactive-components.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/cc11b95e-c702-4149-bf81-f26f3b6b2938/19-introduction-figma-interactive-components-800w.gif\" /></a>The rotation is the same but the animation times are different. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8cc57af1-e8c7-41eb-bf40-c3add3232315/19-introduction-figma-interactive-components.gif\">Large preview</a>)\n\n<h5>Complex Spinners</h5>\n<p>I wouldn’t suggest using Figma interactive components for complex spinners, for such cases it might be better to create the spinner with a dedicated animation app (such as After Effects) and import it into the prototype as a GIF. </p>\n<h4>Micro Interactions</h4>\n<p>Interactive components allow you to include more delightful details into prototypes. I’ll go back to the switch example to show you how to add micro-interactions to this component using <strong>MouseDown</strong> and <strong>On Click</strong>. </p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/21775d66-5c50-435d-aba3-075595de86cb/23-introduction-figma-interactive-components.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/21775d66-5c50-435d-aba3-075595de86cb/23-introduction-figma-interactive-components.gif\" /></a>Do you want to turn a simple switch into an amazing switch?\n\n<h5>Component</h5>\n<p>To recreate this example you need to apply some changes to the structure of the switch:</p>\n<ul>\n<li>Make a copy of the <strong>Off</strong> state switch that you already created.</li>\n<li>Create another ellipse shape of <code>16*24</code> px, place it over the previous ellipse (the circle).</li>\n<li><p>Unify the two ellipses as a boolean group using <strong>Union</strong>.</p>\n</li>\n<li><p>Learn more about <a href=\"https://help.figma.com/hc/en-us/articles/360039957534-Boolean-Operations\"><strong>Boolean groups</strong> →</a>.</p>\n</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0880468c-9b60-4d74-83b5-22e65bcd3e68/1-introduction-figma-interactive-components.png\" /></p>\n<ul>\n<li>Apply <code>32</code> px of border-radius to the Union layer, this will create the distortion effect you can see in the example.</li>\n<li>Create the component (Ctrl/Cmd + Alt + K).</li>\n</ul>\n<h5>Variants and Prototype</h5>\n<p>You’ll need a total of four variants to make this work: <code>OffState</code>, <code>OffStatePressed</code>, <code>OnState</code>, and <code>OnStatePressed</code>.</p>\n<ul>\n<li>Use the <strong>Mouse Down</strong> trigger to simulate the mouse being pressed and activate the distortion by moving the bigger ellipse <code>8</code> px to the other side.</li>\n<li>Use the <strong>On Click</strong> trigger to change states from Off to On.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1f0c2836-1fed-4ef4-9c28-e589ea1de8a7/13-introduction-figma-interactive-components.png\" /></p>\n<h4>3D Animation With A Sequence Of Images</h4>\n<p>Before we continue, I want to thank <a href=\"https://twitter.com/aerdna_c\"><strong>Andrea Cau</strong></a>, the author of this cool 3D sequence that I’m going to use as an example. </p>\n<p>This is more of a hack to integrate 3D animations into a Figma prototype, you could also use GIFs but this way you gain full control over the images, not just play/stop, allowing you to create a prototype that simulates an interface to rotate objects, commonly seen in car websites where you can rotate the car.</p>\n<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/57b98cb4-3803-4af7-9b72-b307c221e513/11-introduction-figma-interactive-components.gif\"><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ebd3177a-c9dc-4905-bc76-9a048767e4ed/11-introduction-figma-interactive-components-500w.gif\" /></a>Imagine an e-commerce website with a 3D model that you can turn around. (<a href=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/57b98cb4-3803-4af7-9b72-b307c221e513/11-introduction-figma-interactive-components.gif\">Large preview</a>)\n\n<p>In this case, I’ve used nine images (you could use more, or less, depending on the rotation you need), the important steps to reproduce this interaction are: </p>\n<ul>\n<li>Create one variant per image (in this case 9 variants will be needed) and include one image in each one, following the sequence order.</li>\n<li>Create the arrow button, it will be the Hotspot.</li>\n<li>Connect the right arrow to the next variant (repeat for every variant).</li>\n<li>Connect the left arrow to the previous variant (repeat for every variant).</li>\n<li>Use the <strong>Instant</strong> animation instead of Smart Animate to avoid the fade in/out effect and create the illusion of movement.</li>\n</ul>\n<h3>Conclusion</h3>\n<p>The more I use this feature the more I think it will be a game-changer for companies working in the areas of web and product design. Mastering interactive components and variants will allow designers to produce better, more advanced, and realistic prototypes with less effort, giving you the freedom to work on the actual designs and focus less on the design tool itself.</p>\n<p>As mentioned earlier, I’ve created a Figma community file with the examples from this article (and a few more experiments that I’ve been doing during the testing of the new feature). Once you <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSctELo9clvK0uP-0zDAxMqrgtCNyK0OB2hff6O7SnK9y4jo5g/viewform\">join the Beta</a>, feel free to duplicate my design, follow along or start experimenting, and <strong>share your results!</strong> Play with the animation times, change the easing, try to rotate, scale elements, try to nest different interactive components.</p>\n<ul>\n<li><a href=\"https://www.figma.com/community/file/949638648436079728\">Download the Figma design file →</a></li>\n</ul>\n<p>If you have questions or something is not entirely clear, leave a question in the Comments section below, or ping me on Twitter (<a href=\"https://twitter.com/emi_cicero\">@emi_cicero</a>) — I’d be glad to help! :)</p>\n<h4>Further Reading</h4>\n<ul>\n<li><a href=\"https://help.figma.com/hc/en-us/articles/360038662654-Guide-to-Components-in-Figma\">Components</a></li>\n<li><a href=\"https://help.figma.com/hc/en-us/articles/360039150733\">Overrides</a></li>\n<li><a href=\"https://help.figma.com/hc/en-us/articles/360056440594-Create-and-use-variants\">Variants</a></li>\n<li><a href=\"https://help.figma.com/hc/en-us/articles/360040035834-Prototype-triggers\">Triggers</a></li>\n<li><a href=\"https://help.figma.com/hc/en-us/articles/360039818874-Create-advanced-animations-with-Smart-Animate\">Smart Animate</a></li>\n<li><a href=\"https://help.figma.com/hc/en-us/articles/360051748654-Prototype-easing-curves\">Easing</a></li>\n<li><a href=\"https://www.figma.com/community/file/946809607056414616\">Figma interactive components playground</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=slmLyaolF50\">Interactive Components in Figma</a> (video by <a href=\"https://twitter.com/mds\">@mds</a>)</li>\n<li><a href=\"https://www.youtube.com/watch?v=ChAyF6JeANw&amp;ab_channel=MDSMDS\">Advanced Interactive Components in Figma</a> (video by <a href=\"https://twitter.com/mds\">@mds</a>)</li>\n<li><a href=\"https://www.youtube.com/watch?v=plD2XRrK7hw&amp;ab_channel=SketchTogether\">SketchTogether interactive components video</a></li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"1f93bcaf5647aa721d7a47c7b06e43f586bda324496538b57f529be410fb4f24","category":"Tech"}