{"title":"Apple Watch Series 9 and Ultra 2 Reviews: Small Steps Forward","link":"https://www.macrumors.com/review/apple-watch-series-9-and-ultra-2/","date":1695216808000,"content":"The new <a href=\"https://www.macrumors.com/2023/09/12/apple-watch-series-9-unveiled/\">Apple Watch Series 9</a> and <a href=\"https://www.macrumors.com/2023/09/12/apple-announces-apple-watch-ultra-2/\">Apple Watch Ultra 2</a> will begin arriving to customers and launch in stores on Friday. Ahead of time, select media outlets and YouTube channels have shared the first reviews of the watches.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Apple-Watch-9-Hands-On-Thumb.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nKey new features for both Apple Watch models include brighter displays, up to a 30% faster S9 chip, a \"Double Tap\" gesture for interacting with the watches without touching the screen, an increased 64GB of internal storage, and more.\r<br />\n\r<br />\nMany reviews agree that the Apple Watch Series 9 and Ultra 2 are iterative upgrades that likely aren't worth upgrading to from a Series 8 or the original Ultra.\r<br />\n\r<br />\n<a href=\"https://www.theverge.com/23878981/apple-watch-series-9-ultra-2-review-double-tap-precision-finding-siri\"><em>The Verge</em>'s Victoria Song</a> on upgrading to the Series 9 or Ultra 2:<blockquote>If you have a Series 7 or later, you don't really need to update. For owners with a Series 5 or earlier, it might be worth it since you'll get a bigger screen, several new sensors, and a processing bump. Series 6 owners are the ones I see being most on the fence — and to those folks, I mostly encourage upgrades if your battery life isn't cutting it anymore. For folks with an Ultra, seriously. Cool your jets. You're getting the Modular Ultra watchface with watchOS 10, and 3,000 nits vs. 2,000 nits doesn't make a huge difference.</blockquote><a href=\"https://www.cnbc.com/2023/09/20/apple-watch-series-9-review-it-turns-your-hand-into-a-button.html\"><em>CNBC</em>'s Kif Leswing</a> on Double Tap:<blockquote>In testing, I didn't find the double tap to be an indispensable daily gesture for me, although it was fun to play around with, and the haptic feedback when it works is satisfying.\r<br />\n\r<br />\nNor did I find the \"smart stack\" widget that the double tap brings up to be that useful — I generally don't like widgets, and the suggestions it made by default were not helpful, like a card with tips for my new Apple Watch. The individual widgets are selected through machine learning, so it could get better with use.\r<br />\n\r<br />\nThe gesture also requires the Apple Watch interface to be activated, with its backlight on. You can't just double tap when your arm is at your side. Instead, you have to raise your arm to wake the display first, then tap your fingers twice, which makes it feel like a much more exaggerated motion.</blockquote><a href=\"https://www.cnet.com/tech/mobile/apple-watch-ultra-2-review-a-brighter-screen-makes-my-favorite-watch-better/\"><em>CNET</em>'s Lexy Savvides</a> said the Apple Watch Ultra 2's brighter display with up to 3,000 nits peak brightness benefits the flashlight feature:<blockquote>But it's the flashlight that gets a bigger boost. It's able to illuminate a small dark room, light your way if you drop your keys, and even cast a spooky glow if you're reading your kids a bedtime story. I took the Apple Watch Ultra 2 into a cave and it lit up the rockface much better than the first Ultra when I compared the two.</blockquote><a href=\"https://mobilesyrup.com/2023/09/20/apple-watch-series-9-review/\"><em>MobileSyrup</em>'s Patrick O'Rourke</a> on the S9 chip:<blockquote>Next, there's the new S9 chip. Given Apple has stuck with the S8 chip since the Series 6, the smartwatch is long overdue for a processor bump. That said, I didn't run into slowdown issues with the S8, and while the S9 is clearly more powerful, I haven't noticed much of a performance boost in day-to-day use. On the other hand, Apple says the S9 chip powers the Series 9's on-device Siri processing, allowing the smartwatch to quickly respond to requests like starting a workout or setting a timer.</blockquote><h2>Videos</h2>\r<br />\n<div></div>\r<br />\n<div></div>\r<br />\n<div></div>\r<br />\n<div></div>\r<br />\n<div></div><div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 9</a>, <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra 2</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#Apple_Watch_Ultra\">Apple Watch Ultra (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/apple-watch-series-9-and-ultra-2/\">Apple Watch Series 9 and Ultra 2 Reviews: Small Steps Forward</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-watch-series-9-and-ultra-2-reviews-small-steps-forward.2403452/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"1f95aa9e6e6e97e03926b7285c856fb03c02b7721b4b968c192da63963ca5dea","category":"Apple"}