{"title":"Increasing trends of pharmaceutical payments to breast cancer specialists in Japan: A retrospective study from 2016 to 2019","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310880","date":1727359200000,"content":"<p>by Yudai Kaneda, Erika Yamashita, Hiroaki Saito, Kenji Gonda, Masahiro Wada, Tetsuya Tanimoto, Akihiko Ozaki</p>\r\nIntroduction <p>The introduction of new drugs often leads to aggressive promotion and potential financial conflicts of interest, which may bias treatment decisions and potentially harm patients. The breast cancer therapeutics market is rapidly evolving globally, and Japan is no exception. This study aimed to analyze trends in pharmaceutical payments to breast cancer specialists in Japan from 2016 to 2019, focusing on company-level data, relationships with new drug introductions, and individual specialist payment patterns.</p> Methods <p>This retrospective study examined financial relationships between pharmaceutical companies and breast cancer specialists in Japan from 2016 to 2019. The analysis focused on certified specialists as of May 2023 and used payment data from 93 pharmaceutical companies for activities such as lecturing, writing, and consulting. First, a company-level analysis examined total payments, categories, and trends for all companies and the top 10 individually; second, a specialist-level analysis looked at payment amounts amount and counts. The Gini index was employed to assess the concentration of payments among specialists.</p> Results <p>Total payments reached USD 13,329,911, growing at 10.1% annually, with 81.4% allocated to lecturing engagements. The top 10 companies, led by Chugai Pharmaceutical, Eisai, and AstraZeneca, accounted for 89.5% of all payments. Companies like Pfizer Japan and Eli Lilly Japan saw notable increases following the introduction of new drugs such as palbociclib and abemaciclib. Payment distribution was highly skewed, with an average of $7,692 per specialist but a median of only $2,884. A Gini index of 0.994 further confirmed that a small group of specialists received a disproportionately large share of the payments</p> Conclusion <p>From 2016 to 2019, pharmaceutical payments to Japanese breast cancer specialists increased significantly, coinciding with new drug introductions. The concentration of payments among a select group of specialists raises concerns about potential influences on clinical decision-making and guideline recommendations.</p>","author":"Yudai Kaneda","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1fa6bef70fc5ef25438587c31dfd612140ec115dcc7c84fc308a6381b90b5566","category":"Interdisciplinary"}