{"title":"Barriers and facilitators to physical activity: A comparative analysis of transplant athletes competing in high intensity sporting events with other transplant recipients","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307095","date":1724421600000,"content":"<p>by Bart Rienties, Elaine Duncan, Perry Judd, Ben Oakley, Liset H. M. Pengel, Keetie Roelen, Nicholas Topley</p>\r\nBackground <p>There is widespread recognition that many transplant recipients struggle to become and remain physically active. However, some transplant recipients do undertake strenuous training and significant physical activity (PA) and participate in intensive sports.</p> Aim <p>This study sought to understand facilitators and barriers to be physically active for Transplant Athletes (TXA) compared to a group of Dutch transplantees. This explorative mixed methods study analysed race performance and interview data from TxA who participated in cycling and/or the sprint triathlon at the World Transplant Games 2023, and compared their lived experiences in terms of barriers and facilitators of PA with those of 16 transplantees in a study from the Netherlands previously published in this journal.</p> Methods <p>Using Patient and Public Involvement and engagement (PPI), race data from World Transplant Games 2023 and subsequent in-depth interviews were used from 27 TxA. A visual artefact of barriers and facilitators from the previous Dutch study was used to prompt identification and discussion of barriers and facilitators of PA. Interview data were coded by three coders.</p> Results <p>Many of the barriers to PA previously reported by Dutch transplant recipients were not shared by the majority of TxA in this study. The TxA in this study reported significantly lower physical limitations, lower fear to undertake exercise, and no comorbidity issues for TxA. Furthermore, TxA perceived they received substantial social support, had the strength to do PA, and were in control of their weight.</p> Conclusion <p>Several TxA reported a lack of understanding from medical and other professionals about the appropriate intensity of PA. An evidence-based framework of PA for transplant recipients and transplant athletes is needed for safe and appropriate PA.</p>","author":"Bart Rienties","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1fadef2533d3f0769ca39c75d4d9f12629d3bbd7f275c3c5a9d78093f2a53be1","category":"Interdisciplinary"}