{"title":"Recovery after human bone marrow mesenchymal stem cells (hBM-MSCs)-derived extracellular vesicles (EVs) treatment in post-MCAO rats requires repeated handling","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312298","date":1729519200000,"content":"<p>by Yolanda Gomez-Galvez, Malvika Gupta, Mandeep Kaur, Salvatore Fusco, Maria Vittoria Podda, Claudio Grassi, Amit K. Srivastava, Lorraine Iacovitti, Elena Blanco-Suarez</p>\r\n\r\nRehabilitation is the only current intervention that improves sensorimotor function in ischemic stroke patients, similar to task-specific intensive training in animal models of stroke. Bone marrow mesenchymal stem cells (BM-MSCs)-derived extracellular vesicles (EVs) are promising in restoring brain damage and function in stroke models. Additionally, the non-invasive intranasal route allows EVs to reach the brain and target specific ischemic regions. Yet unclear is how handling might enhance recovery or influence other therapies such as EVs after stroke. We used the transient middle cerebral artery occlusion (MCAO) model of stroke in rats to assess how intensive handling alone, in the form of sensorimotor behavioral tests, or in combination with an intranasal treatment of EVs restored neurological function and ischemic damage. Handled rats were exposed to a battery of sensorimotor tests, including the modified Neurological Severity Score (mNSS), beam balance, corner, grid walking, forelimb placement, and cylinder tests, together with Magnetic Resonance Imaging (MRI) at 2, 7, 14, 21, and 28 days post-stroke (dps). Handled MCAO rats were also exposed to an intranasal multidose or single dose of EVs. Non-handled rats were evaluated only by mNSS and MRI at 2, 28, and 56 dps and were treated with a single intranasal dose of EVs. Our results showed that handling animals after MCAO is necessary for EVs to work at the tested dose and frequency, and that a single cumulative dose of EVs further improves the neurological function recovered during handling. These results show the importance of rehabilitation in combination with other treatments such as EVs, and highlight how extensive behavioral testing might influence functional recovery after stroke.","author":"Yolanda Gomez-Galvez","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1fb16203a6b8aad4e0afb2cfc3f4cb585af4b7ed2db3a20f8f6c77a3c8eb13c3","category":"Interdisciplinary"}