{"title":"Peroxisomal 4-coumaroyl-CoA ligases participate in shikonin production in Lithospermum erythrorhizon","link":"https://academic.oup.com/plphys/article/195/4/2843/7628150?rss=1","date":1710288000000,"content":"<span><div>Abstract</div>4-Coumaroyl-CoA ligase (4CL) is a key enzyme in the phenylpropanoid pathway, which is involved in the biosynthesis of various specialized metabolites such as flavonoids, coumarins, lignans, and lignin. Plants have several 4CLs showing divergence in sequence: Class I 4CLs involved in lignin metabolism, Class II 4CLs associated with flavonoid metabolism, and atypical 4CLs and 4CL-like proteins of unknown function. Shikonin, a Boraginaceae-specific specialized metabolite in red gromwell (<span>Lithospermum erythrorhizon</span>), is biosynthesized from <span>p</span>-hydroxybenzoic acid, and the involvement of 4CL in its biosynthesis has long been debated. In this study, we demonstrated the requirement of 4CL for shikonin biosynthesis using a 4CL-specific inhibitor. In silico analysis of the <span>L. erythrorhizon</span> genome revealed the presence of at least 8 <span>4CL</span> genes, among which the expression of 3 (<span>Le4CL3</span>, <span>Le4CL4</span>, and <span>Le4CL5</span>) showed a positive association with shikonin production. Phylogenetic analysis indicated that Le4CL5 belongs to Class I 4CLs, while Le4CL3 and Le4CL4 belong to clades that are distant from Class I and Class II. Interestingly, both Le4CL3 and Le4CL4 have peroxisome targeting signal 1 in their C-terminal region, and subcellular localization analysis revealed that both localize to the peroxisome. We targeted each of the 3 <span>Le4CL</span> genes by CRISPR/Cas9-mediated mutagenesis and observed remarkably lower shikonin production in <span>Le4CL3</span>-ge and <span>Le4CL4</span>-ge genome-edited lines compared with the vector control. We, therefore, conclude that peroxisomal Le4CL3 and Le4CL4 are responsible for shikonin production and propose a model for metabolite-specific 4CL distribution in <span>L. erythrorhizon</span>.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"1fbb38741daad4e103fbd12d0a34766271573ff03a05548b485be5faccb7c9c6","category":"Environment"}