{"title":"FhMYB108 Regulates the Expression of Linalool Synthase Gene in Freesia hybrida and Arabidopsis","link":"https://www.preprints.org/manuscript/202406.1141/v1","date":1718616832000,"content":"Acting as the most abundant and widely distributed volatile secondary metabolites in plants, terpenoids play crucial roles in diverse physiological regulations and metabolic processes. Terpene synthases occupy a decisive proportion in determining the composition and diversity of terpenoids; though their regulatory effects have been extensively investigated across various plant species, limited studies have focused on the upstream transcriptional regulation of terpene synthases. In this study, we unveil linalool as the predominant volatile compound in Freesia hybrida flowers, demonstrating a gradual release pattern during flower blooming. In the context of the transcriptome, a typical MYB transcription factor, FhMYB108, was screened based on digital expression profile correlation analysis and homologous gene comparison. FhMYB108 is capable of regulating the expression of terpene synthase FhTPS1, and both their expression levels exhibit a gradual increase concomitant with flower opening. Moreover, transcriptional regulation and transient expression assays revealed that FhMYB108 exerts a stimulatory effect on the transcription of A. thaliana AtTPS14, while no significant increase in AtTPS14 expression was observed upon stabilization of FhMYB108 in Arabidopsis. Investigate its reason, the highly expressed AtMYC2 in A. thaliana can interact with FhMYB108 to suppress the activation of AtTPS14 by FhMYB108. The present study not only elucidated the regulatory mechanism underlying linalool synthesis, but also discovered the synergistic effect of MYB and bHLH transcription factors in governing the biosynthesis of volatile terpenoids.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1fbce8b328e686f51d9ba75462dbe87fe98a17c310360e778b8b6214a57abe3e","category":"Interdisciplinary"}