{"title":"รู้จัก Parag Agrawal ซีอีโอคนใหม่ของทวิตเตอร์ ผู้เป็นมือขวาสำคัญของ Jack Dorsey มายาวนาน","link":"https://www.blognone.com/node/126062","date":1638239700000,"content":"<div><div><div><p>Jack Dorsey <a href=\"https://www.blognone.com/node/126053\">ประกาศลาออกจากตำแหน่งซีอีโอทวิตเตอร์</a> บริษัทที่ตัวเองเป็นผู้ก่อตั้งขึ้นมาจนกลายเป็นหนึ่งในเครื่องมือโซเชียลทรงพลังของโลก โดยปผู้มาดำรงตำแหน่งเป็นซีอีโอแทนคือ Parag Agrawal ผู้ที่เป็นซีทีโอดูแลเทคโนโลยีของทวิตเตอร์มาอย่างยาวนาน</p>\n<p>ที่ผ่านมาไม่ค่อยมีข้อมูลข่าวสารของ Agrawal ปรากฏตามหน้าสื่อมากนัก แต่เขาเป็นหนึ่งในมือขวาสำคัญของ Dorsey เลยทีเดียว โดย Agrawal เป็นซีทีโอตั้งแต่ปี 2017 ปัจจุบันอายุ 37 ปี เชื้อชาติอินเดีย มีบทบาทสำคัญในการสร้างแมชชีนเลิร์นนิงและปัญญาประดิษฐ์ของทวิตเตอร์ รวมถึงปรับโครงสร้างพื้นฐานของบริษัท</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a15b18420bb79ecbcc5157109b1f306e.png\" /></p>\n<p>นอกจากนี้ ในปี 2019 Dorsey เผยทิศทางอนาคตของโซเชียลมีเดียแบบกระจายศูนย์ หรือโปรเจกต์ Bluesky อย่างเช่นเทคโนโลยีบล็อกเชน เขาก็ดึงตัว Agrawal มาดูแลเรื่องนี้ด้วย ซึ่ง Dorsey เขียนถึง Agrawal ในโพสต์แถลงลาออกว่า Agrawal เป็นตัวเลือกของฉันมาระยะหนึ่งแล้ว เนื่องจากเขาเข้าใจบริษัทและความต้องการของบริษัทอย่างลึกซึ้ง</p>\n<p>Agrawal สำเร็จการศึกษาระดับปริญญาเอก สาขาวิทยาการคอมพิวเตอร์จากมหาวิทยาลัยสแตนฟอร์ด และปริญญาตรีสาขาวิทยาการคอมพิวเตอร์และวิศวกรรมศาสตร์จากสถาบันเทคโนโลยีแห่งอินเดีย (Indian Institute of Technology) ช่วงที่กำลังเรียนเขาได้เข้าร่วมกลุ่มวิจัยฐานข้อมูลและเป็นหนึ่งในนักศึกษาที่โดดเด่นแม้อยู่ท่ามกลางนักศึกษาสแตนฟอร์ด และได้เข้าทำงานที่ทวิตเตอร์ในปี 2011</p>\n<p>ระหว่างทำงานที่ทวิตเตอร์ Agrawal เข้ามาอยู่ในกลุ่ม Twitter Architecture Group หรือ T.A.G. ซึ่งเป็นทีมวิศวกรชั้นนำที่ตรวจสอบและปรับปรุงโครงการของบริษัท จนกระทั่ง Dorsey กลับมาเป็นซีอีโอที่ทวิตเตอร์อีกครั้งในปี 2015 Agrawal ก็พยายามผลักดันไทม์ไลน์ หรือเนื้อหาที่ฟีดเข้าแอปทวิตเตอร์ จนเข้าได้โปรโมทเป็นซีทีโอในปี 2017</p>\n<p>Agrawal ยังมีส่วนช่วยผลักดันการเชื่อมต่อระบบคริปโตเข้ากับแพลตฟอร์ม จ่ายทิปด้วยบิทคอยน์ สนับสนุนการแสดงความโปร่งใสของอัลกอริทึมที่ทำพลาดได้ เช่นระบบครอปรูปอัตโนมัตินั้นมีปัญหาและมีอคติ</p>\n<p>ตามเอกสารรายงานของบริษัทระบุว่า Agrawal จะได้รับเงินเดือนประจำปี 1 ล้านดอลลาร์พร้อมโบนัส</p>\n<p>ที่มา - <a href=\"https://www.nytimes.com/2021/11/29/technology/parag-agrawal-twitter.html\">The New York Times</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/twitter\">Twitter</a></div><div><a href=\"/topics/jack-dorsey\">Jack Dorsey</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"1fca00abd658321cb008998cc2790e5f9bb1c9b620ce1751754bf51c98143dc3","category":"Thai"}