{"title":"Environmental flow assessment for benthic macroinvertebrate communities using pseudo‐2D hydraulic habitat modelling at a green small hydropower plant","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2574?af=R","date":1721273930000,"content":"<h2>Abstract</h2>\n<p>The determination of minimum flow requirements for green small hydropower plants (GSHP) in China primarily relies on hydrological methods such as the Tennant method with no seasonal variation. However, the direct application of hydrological methods without local ecological data for calibration lacks ecological validity, potentially resulting in unsuitable minimum flow recommendations for local aquatic biota. Hydraulic-habitat modelling (HHM) is assumed to provide more ecologically relevant and reliable environmental flow recommendations (EFRs), but benthic macroinvertebrates (BMs), crucial in the aquatic food web, have rarely been the focus in HHM studies. Moreover, the strong subjectivity in HHM processes hinders the comparison of EFRs across different biota and geographical regions. This study aims to investigate the ecological validity of using the Tennant method to set minimum flow requirements for local BM communities and the impacts of various methods used in HHM on derived EFRs. To achieve this, a pseudo-2D HHM approach is employed, integrating the 1D hydraulic models HEC-RAS and CASiMiR with the habitat model HABFUZZ. The EFRs downstream of Jiufeng reservoir, one of China's first GSHPs, are derived for wet (April–June) and dry seasons (July–September). Our findings highlight that setting minimum flow alone is inadequate for preserving BM community integrity downstream of GSHPs. It is crucial to incorporate more diverse environmental flow criteria, including minimum flows and peak flows, into GSHP assessment standards, with recommended flow levels varying across different seasons. Additionally, the development of a standardized HHM methodology is essential to mitigate the inherent subjectivity in HHM and facilitate the comparison of EFRs generated from different studies. This study's innovative modelling framework and findings will enhance the optimization of minimum flow assessment criteria for GSHP in China, deepen understanding of seasonal e-flow requirements of BM communities, and refine the methodology used in BM HHM for e-flow recommendation.</p>","author":"Shuyi Hu, \nMeili Feng, \nShuyang Xu, \nChaofan Wu, \nZhen Zeng","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"1fdba219d77b693927c2fe100354022de6aa6ab978059d11dc4840a28d33bc93","category":"Environment"}