{"title":"Europe’s major satellite players line up to build Starlink competitor","link":"https://arstechnica.com/?p=1936275","date":1683127074000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-1248376827-800x533.jpg\" alt=\"EU Commissioner for Internal Market Thierry Breton wants Europe to have its own secure satellite communications network.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-1248376827-scaled.jpg\">Enlarge</a> <span>/</span> EU Commissioner for Internal Market Thierry Breton wants Europe to have its own secure satellite communications network. (credit: Thierry Monasse/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A consortium of nearly every major European satellite company <a href=\"https://www.businesswire.com/news/home/20230502005637/en/European-Space-and-Telecoms-Players-Sign-Partnership-Agreement-to-Bid-for-IRIS2-Constellation\">announced Tuesday</a> that it plans to bid for a proposed satellite constellation to provide global communications. Essentially, such a constellation would provide the European Union with connectivity from low-Earth orbit similar to what SpaceX's Starlink offers.</p>\n<p>The bid, which includes large players such as Airbus Defence and Space, Eutelsat, SES, and Thales Alenia Space, comes in response to a request by the European Union for help in constructing a sovereign constellation to provide secure communications for government services, including military applications.</p>\n<p>European Union Commissioner Thierry Breton announced the continent's plans for this constellation—known as Infrastructure for Resilience, Interconnectivity and Security by Satellite, or IRIS²—last November. The European Union will provide 2.4 billion euro, with additional contributions expected from the European Space Agency and private investments.</p></div><p><a href=\"https://arstechnica.com/?p=1936275#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1936275&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"1fe2741b787946b9db93bedd83ee692fffc5708d00968a8bc80bb90f0ad58af4","category":"Tech"}