{"title":"Deep-learning-based segmentation using individual patient data on prostate cancer radiation therapy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308181","date":1722434400000,"content":"<p>by Sangwoon Jeong, Wonjoong Cheon, Sungjin Kim, Won Park, Youngyih Han</p>\r\nPurpose <p>Organ-at-risk segmentation is essential in adaptive radiotherapy (ART). Learning-based automatic segmentation can reduce committed labor and accelerate the ART process. In this study, an auto-segmentation model was developed by employing individual patient datasets and a deep-learning-based augmentation method for tailoring radiation therapy according to the changes in the target and organ of interest in patients with prostate cancer.</p> Methods <p>Two computed tomography (CT) datasets with well-defined labels, including contoured prostate, bladder, and rectum, were obtained from 18 patients. The labels of the CT images captured during radiation therapy (<i>CT</i><sup>2nd</sup>) were predicted using CT images scanned before radiation therapy (<i>CT</i><sup>1st</sup>). From the deformable vector fields (DVFs) created by using the VoxelMorph method, 10 DVFs were extracted when each of the modified CT and <i>CT</i><sup>2nd</sup> images were deformed and registered to the fixed <i>CT</i><sup>1st</sup> image. Augmented images were acquired by utilizing 110 extracted DVFs and spatially transforming the <i>CT</i><sup>1st</sup> images and labels. An nnU-net autosegmentation network was trained by using the augmented images, and the <i>CT</i><sup>2nd</sup> label was predicted. A patient-specific model was created for 18 patients, and the performances of the individual models were evaluated. The results were evaluated by employing the Dice similarity coefficient (DSC), average Hausdorff distance, and mean surface distance. The accuracy of the proposed model was compared with those of models trained with large datasets.</p> Results <p>Patient-specific models were developed successfully. For the proposed method, the DSC values of the actual and predicted labels for the bladder, prostate, and rectum were 0.94 ± 0.03, 0.84 ± 0.07, and 0.83 ± 0.04, respectively.</p> Conclusion <p>We demonstrated the feasibility of automatic segmentation by employing individual patient datasets and image augmentation techniques. The proposed method has potential for clinical application in automatic prostate segmentation for ART.</p>","author":"Sangwoon Jeong","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"1fe4ece912463f71c468300bcc4cab2f62071b2225be977ad566270a6c5cd8e8","category":"Interdisciplinary"}