{"title":"If cycling did an American-style draft, what would happen?","link":"https://www.cyclist.co.uk/news/9560/if-cycling-did-an-american-style-draft-what-would-happen","date":1619714972000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>30 Apr 2021</span></div>    </div></div><p>\nWhat would happen if the WorldTour was taken over by Americans and cycling adopted the draft system for signing young riders?</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/04/pressesports_582850_tdf_031.jpg?itok=I-VXUrOD\" />  </div>\n<div>\n      <p> <strong><em>Cyclist</em> investigates what might happen if the WorldTour was taken over by Americans and cycling adopted the draft system for signing young riders</strong></p>\n<p><strong>Words</strong>: Will Strickson <strong>Photos</strong>: Offside and Chris Auld</p>\n<p>Picture it: teams, fans and prospects gather at the Roubaix velodrome. Topless Belgian fans cradling their beers are chanting 'Remco! Remco! Remco!' David Lappartient steps up to the podium and begins, 'With the first pick of the 2021 UCI WorldTour draft, Israel Start-Up Nation select...'</p>\n<p>It's absolutely bonkers, but that's American sports and given last night was the first round of the NFL Draft, we thought it would be fun to imagine what it might look like if men's cycling had a draft.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1803/giro-ditalia-2021-route-riders-start-list-live-tv\">Giro d'Italia 2021: Full details for this year's race</a></div>      <div><a href=\"/in-depth/9561/join-our-giro-ditalia-fantasy-league\">Join our Giro d'Italia fantasy league</a></div>      <div><a href=\"/news/8760/how-to-watch-and-live-stream-the-giro-ditalia-2021\">How to watch and live stream the Giro d'Italia 2021</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 113: on sale now!</a></div>    </div></div><p>\nFor the purpose of the exercise, let's just forget everything that's plausible or realistic – yes, if this actually happened an actual <a href=\"/tags/tour-de-france\">Tour de France</a> winner wouldn't be involved.</p>\n<p>To have some semblance of realism, we used the <a href=\"https://www.uci.org/road/rankings\" target=\"_blank\">UCI's team rankings</a> from the end of the 2020 season – in reverse order for parity – and a list of the <a href=\"https://www.procyclingstats.com/teams/youngest-riders\" target=\"_blank\">100 youngest WorldTour riders</a> and off we go.</p>\n<h3>1. Israel Start-Up Nation – Tadej Pogačar</h3>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2020/09/pogacar_stage_win_colombier.jpg\" />  </div>\n</div>\n<p>Much to <em>Cyclist </em>digital editor Joe Robinson's disgust*, Pogačar is the only selection here. He already had a <a href=\"/tags/tour-de-france\">Tour de France</a> and a Monument under his belt and looks almost unbeatable every time he gets on the bike. A sensation with the potential to win any race on the calendar.</p>\n<p>*See Remco below.</p>\n<h3>2. Qhubeka-Assos – Remco Evenepoel</h3>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2019/09/cauldphoto-worlds-menitt-0405.jpg\" />  </div>\n</div>\n<p>The fact that young Remco hasn't yet been fully unleashed onto the WorldTour is a travesty, we're praying that his recovery has gone well enough that he can compete at the <a href=\"/tags/giro-ditalia\">Giro d'Italia</a>.</p>\n<p>Not only does he think he's the GOAT but Joe was adamant he would be picked first in any draft.</p>\n<h3>3. Intermarché-Wanty-Gobert Matériaux – Tom Pidcock</h3>\n<p>His potential was no secret before the season began, but the longer it goes on the more Pidcock cements himself as GB cycling's next hero. A win and a half in the Classics only scratches the surface of what he can do, let's see how he goes at the <a href=\"/tags/vuelta-a-espana\">Vuelta a Espana</a>.</p>\n<p>He'd rock Intermarché's fluorescent kit too.</p>\n<h3>4. Cofidis – Marc Hirschi</h3>\n<p>Hirschi's stock is plummeting as the days go by, if this had been done in January then he could've been higher. An outstanding 2020 season showed Hirschi as an immense talent in the Classics and as a breakaway <em>artiste, </em>his big move to <a href=\"/tags/uae-team-emirates\">UAE Team Emirates</a> hasn't exactly gone well so far results-wise but there's still time.</p>\n<p>Cofidis would be wise to take the punt.</p>\n<h3>5. Movistar – João Almeida</h3>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/04/italy_photo_press_985495.jpg\" />  </div>\n</div>\n<p>The Portuguese youngster thrilled the hearts and minds of cycling fans everywhere with his performance at the Giro last year. Not only did he hold onto the <em>Maglia Rosa </em>for most of the race, he fought for every sprint and showed out in the <a href=\"/tags/time-trial\">time-trials</a>. Massive potential and would suit <a href=\"/tags/movistar\">Movistar</a> well – one more contender can't hurt.</p>\n<h3>6. Lotto-Soudal – Brandon McNulty</h3>\n<p>The next American GC prospect, McNulty has already shown that he can compete at the highest level with a couple of standout performances at last year's Giro. He almost did the business at the Itzulia Basque Country but blew up on the final stage.</p>\n<p>He might not be as Belgian as <a href=\"/tags/lotto-soudal\">Lotto-Soudal</a> but competing in the General Classification would keep the sponsors happy.</p>\n<h3>7. AG2R-Citroën – Mauri Vansevenant</h3>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/04/mauri-vansevenant-2.jpg\" />  </div>\n</div>\n<p>AG2R are going all in for one-day racing, and Mauri Vansevenant is a <a href=\"/in-depth/9513/mauri-vansevenant-and-the-rise-of-the-heavy-metal-cyclist\" target=\"_blank\">heavy metal cyclist</a>. Enough said.</p>\n<h3>8. Bahrain Victorious – Ivan Sosa</h3>\n<p>This will either push Mikel Landa over the edge or just add another big talent to that mountains train that's yet to get a big result. Sosa has proven his climbing credentials with a couple of wins in the Tour de la Provence, he just needs to take the next step. </p>\n<h3>9. Team BikeExchange – Robert Stannard</h3>\n<p>Not only is he Australian (and rides for BikeExchange in real life) but he's stood out in the Classics this year. While a podium is yet to come, he's got legs. Plus he's called Stannard, he <em>must</em> be good.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1803/giro-ditalia-2021-route-riders-start-list-live-tv\">Giro d'Italia 2021: Full details for this year's race</a></div>      <div><a href=\"/in-depth/9561/join-our-giro-ditalia-fantasy-league\">Join our Giro d'Italia fantasy league</a></div>      <div><a href=\"/news/8760/how-to-watch-and-live-stream-the-giro-ditalia-2021\">How to watch and live stream the Giro d'Italia 2021</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 113: on sale now!</a></div>    </div></div><h3>10. EF Education-Nippo – Ide Schelling</h3>\n<p>Like Stannard, Schelling has had a good start to the year in the one-day races including a fourth at De Brabantse Pijl. EF are the most stylish team, both in kit and the way they race, Ide would fit right in.</p>\n<h3>11. Groupama-FDJ – Clément Champoussin</h3>\n<p>He's the best French talent on the list.</p>\n<h3>12. Trek-Segafredo – Stefan Bissegger</h3>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/04/pressesports_583811_etape3-3.jpg\" />  </div>\n</div>\n<p><a href=\"/tags/trek-segafredo\">Trek-Segafredo</a> have a dual threat in the Classics, several talented climbers including <em>Lo Squalo. </em>It's time to win a TT or two.</p>\n<h3>13. Astana-Premier Tech – Vadim Pronskiy</h3>\n<p>Place of birth: Astana. Say no more.</p>\n<h3>14. Bora-Hansgrohe – Ethan Hayter</h3>\n<p>Hayter's versatility and pedigree mean he's destined for a few big wins. Bora could strengthen both their Classics and stage racing squads.</p>\n<h3>15. Team DSM – Max Kanter</h3>\n<p>Sprinters are the running backs of cycling, a necessity for the top teams but not necessarily valued as highly as your GC contenders, therefore they only start to pop up at the end of the first round. Plus he's called Max Kanter and he's a sprinter!</p>\n<h3>16. Ineos Grenadiers – Jake Stewart</h3>\n<p>A huge British talent, Ineos would need mere seconds to make this call. Stewart announced himself in a big way bagging second at Omloop Het Nieuwsblad, and that was only the beginning.</p>\n<h3>17. UAE Team Emirates – Quinn Simmons</h3>\n<p>Controversial? Yes. Talented? Yes.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1803/giro-ditalia-2021-route-riders-start-list-live-tv\">Giro d'Italia 2021: Full details for this year's race</a></div>      <div><a href=\"/in-depth/9561/join-our-giro-ditalia-fantasy-league\">Join our Giro d'Italia fantasy league</a></div>      <div><a href=\"/news/8760/how-to-watch-and-live-stream-the-giro-ditalia-2021\">How to watch and live stream the Giro d'Italia 2021</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 113: on sale now!</a></div>    </div></div><h3>18. Deceuninck-QuickStep – Mikkel Bjerg</h3>\n<p>Bjerg's engine would get Lefevere another win or two. Despite not being Belgain, several U23 World titles in the TT more than shows his talent. In real life they would trade all their picks for the next three years to move up and bag Remco though, it's the only way.</p>\n<h3>19. Jumbo-Visma – Matteo Jorgenson</h3>\n<p>Let's give the Killer Bees another rider with big GC potential to close out the first round. The high mountains would be like that episode of Black Mirror, Pogačar swarmed by yellow and black. Roglic, Van Aert, Kuss, Bennett, Vingegaard, Gesink, Kruijswijk, Oomen, Jorgenson. (Please come back Dumoulin, we miss you.)</p>\n<h4>For balance, here are digital editor Joe Robinson's draft picks</h4>\n<ol>\n<li>Israel Start-Up Nation – Remco Evenepoel (soon to be the GOAT)</li>\n<li>Qhubeka-Assos – Tadej Pogacar (obvious second choice)</li>\n<li>Intermarche Wanty Gobert Materiaux – Tom Pidcock (guaranteed Classics victories)</li>\n<li>Cofidis – Marc Hirschi (the obvious next pick)</li>\n<li>Movistar – Joao Almeida (another Grand Tour nearly man!)</li>\n<li>Lotto-Soudal – David Dekker (next generation sprint giant)</li>\n<li>AG2R Citroen – Mauri Vansevenant (Heavy. Metal. Hitter)</li>\n<li>Bahrain-Victorious – Brandon McNulty (lots of GT potential)</li>\n<li>BikeExchange – Jake Stewart (will fit the Michael Matthews mould <em>sans earring</em>)</li>\n<li>EF Education-Nippo – Ivan Sosa (just feels right)</li>\n<li>Groupama-FDJ – Clement Champousssin (Madiot backing the French talent)</li>\n<li>Trek-Segafredo – Ethan Hayter (bolsters impressive Classics roster)</li>\n<li>Astana-Premier Tech – Andrea Bagnoli (aggressive and punchy)</li>\n<li>Bora-Hansgrohe – Max Kanter (young, German, talented)</li>\n<li>Team DSM – Stefan Bissenger (mad strong and suits DSM’s no-nonsense style)</li>\n<li>Ineos Grenadiers – Quinn Simmons (\"we can reform him\")</li>\n<li>UAE Team Emirates – Carlos Rodriquez (secret hitter, future GT winner)</li>\n<li>Deceuninck-QuickStep – Mikkel Berg (Classics powerhouse incoming)</li>\n<li>Jumbo-Visma – Stan DeWulf (big help for Wout's Classics team)</li>\n</ol>\n  </div>\n<div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"1ff0b200f69431c3316b3e268848b0b72682ab03a428aed825a2d84578278e5c","category":"Cycling"}