{"title":"NT- Pro BNP as a Prognostic Indicator for Decompensated Heart Failure in Elderly Population","link":"https://www.preprints.org/manuscript/202410.0340/v1","date":1728111969000,"content":"Abstract: Background The incidence of Heart failure is increasing across the world. Over one million people in the UK have heart failure and around 200,000 new diagnoses are made every year (Conrad et al, 2018).Estimates suggest that, further 385,000 people with heart failure who are currently undetected, undiagnosed and, consequently, are missing out on life-preserving treatments. Most of the heart failure cases are of elderly population. The prevalence of heart failure slowly increases with age until about 65 years of age, and then more rapidly. In United Kingdom, the prevalence of heart failure in elderly population is estimated to be about [NICE, 2018a] 1 in 35 people who are aged between 65 – 74 years of age and 1 in 15 people who are aged 75 – 84 years of age. The average age at first diagnosis is 76 years of age [NICE, 2018a]. As per the statistics, heart failure accounts for 2% of bed occupancy in entire NHS as well as accounts for 5% of all NHS emergency admissions. Hospitalization for decompensated heart failure (DHF) carries a poor prognosis, with frequent readmissions. As per the updated NICE guidelines, B-type natriuretic peptide (BNP) is used in the diagnostic criteria and management of heart failure. BNP is secreted by overloaded left ventricle as a response to fluid overload. This study is to evaluate the prognostic value of BNP in elderly population with decompensated heart failure. Methods We conducted a retrospective observational cohort study of 88 elderly patients who were admitted with decompensated heart failure between September 2023 to April 2024 in Lagan valley hospital – Lisburn and Ulster Hospital – Dundonald, Northern Ireland.  Suspected heart failure admissions were randomly selected as snapshots of each month. Among these admissions, 88 Heart failure cases were identified based on echocardiogram findings and NT- pro BNP levels performed on initial admission. The same cohort was followed up for 12 weeks period for specific end points. The end points that were considered were readmissions with heart failure or deaths. Furthermore, Heart failure follow ups were also assessed during post discharge as well. A fraction of patients had repeat BNP checked during the follow up and their clinical features were correlated. All cases were categorized in to two main cohorts as HFrEF cohort and HFpEF cohort. Patients with left ventricular ejection fraction ≥50% were categorized as HFpEF, while those with &lt;40% as were categorized as HFrEF. Each cohort was subdivided to further 3 sub categories depending on the BNP values. Prognostic values and all-cause mortality after discharge were assessed separately in patients with HFpEF and HFrEF by multivariable adjusted Cox regression analysis. Comorbidities were compared between heart failure groups.  ROC curve was carried out to establish the cutoff level of BNP and the mortality analysis was done utilizing Kaplan Meier curves. Results In this cohort study, two major heart failure cohorts were analyzed for specific end points under six main sub-cohorts. The data analysis shows that mortality rate is 29.1% when NT Pro BNP values is more than 2000. The heart failure readmission rate is 45.6% when NT Pro BNP value is more than 2000. 66.6% re-admission rate was demonstrated with rising NT-Pro BNP values during heart failure follow up. This was much lower with patients who had declining NT- Pro -BNP values during heart failure follow u which was 33.3% Satisfactory statistical power of the study, which demonstrated that NT- Pro BNP can be used as prognostic marker for mortality in elderly patients with heart failure irrespective of their ejection fraction. Conclusions NT Pro BNP can be used as a prognostic biomarker for elderly patients with heart failure. Satisfactory statistical evidence was shown on this study to prove that higher BNP values on admission predicts higher mortality rate. Significant evidence was demonstrated in this study to show that there are higher re-admission rates with higher NT pro BNP levels specially in elderly population. Furthermore, the study demonstrated that, there is higher mortality and morbidity rate with rising NT Pro BNP levels during heart failure follow up. In conclusion, all these three parameters shows that NT Pro- BNP levels can be used as a prognostic bio marker for elderly patients with heart failure, irrespective of their ejection fraction status. Furthermore, we would like to indicate that monitoring NT Pro BNP levels in all heart failure cases could be beneficial to prevent mortality and morbidity. Furthermore, it would be an aid to optimize heart failure medications prior to have an episode of decompensation of heart failure as well.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"1ff1bdff61bb95641792a63f5426ab7e58119f670072ea105cf8bc242d1a4537","category":"Interdisciplinary"}