{"title":"Large Language Models in Healthcare Decision Support: A Review","link":"https://www.preprints.org/manuscript/202407.1842/v1","date":1721743110000,"content":"Large language models (LLMs) have recently garnered significant attention due to their remarkable ability to assimilate vast amounts of information and effectively process natural language. In healthcare, natural language constitutes a substantial portion of medical data, rendering LLMs highly promising for various healthcare applications. This study seeks to explore the potential of LLMs in healthcare and clinical decision support (CDS), following PRISMA guidelines for reviews. The analysis encompasses 44 LLMs, each influenced by several factors impacting their performance. Notably, the datasets utilized for pretraining and finetuning processes play a crucial role in determining the model’s domain specificity. Furthermore, distinct model architectures are tailored for specific tasks, while prompting strategies are frequently employed to refine and enhance the model’s performance. LLMs exhibit considerable promise for a wide array of healthcare applications. For instance, LLMs possess the potential to handle and analyze medical information efficiently, facilitate contextual understanding among clinicians and patients, as well as automate the documentation of clinical notes and reports. Presently, however, their implementation within the field remains limited. Notable improvements have been witnessed in the performance of current healthcare-oriented LLMs, with some achieving expert-level competence in medical question-answering (MQA). However, these LLMs face prominent challenges, encompassing ethical concerns, issues related to accountability, and a lack of appropriate regulations. Nevertheless, this study reveals numerous promising applications in healthcare where LLMs could significantly augment the efficiency, accessibility, and manageability of healthcare delivery. Addressing the challenges LLMs encounter is essential for their seamless integration into practical healthcare applications. As a relatively new technology, the development of LLMs is still in its early stages, but their potential is evident through this study. Consequently, fostering collaboration among healthcare professionals, developers, regulators, and other stakeholders is imperative to cultivate dependable LLMs that align with the demands of the healthcare sector.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"201124954f5015259906fb3643f5b9b2650640f8e1f3703f6504894d33baab50","category":"Interdisciplinary"}