{"title":"macOS Sonoma: How to train your Mac to talk in your voice","link":"https://www.macworld.com/article/2050750/how-to-make-your-mac-talk-like-you-macos-sonoma.html","date":1695294900000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>With macOS Sonoma, you can create a Personal Voice, which is a voice that your Mac uses that sounds like you. The Mac’s text-to-speech capabilities can be used to recite in a voice similar to yours anything typed using the Live Speech feature.</p>\n\n\n\n<p>According to Apple, the voice that is created uses the Mac’s machine learning, and since everything is kept on the Mac, the user’s voice information is kept private and secure. So you don’t have to worry about your recording being used for nefarious reasons by Apple or anyone else. </p>\n\n\n\n<p>The Personal Voice isn’t perfect. It sounds robotic, lacking inflection and emotion. But is more personal than the artificial voices that come with the Mac. To hear what it sounds like, I created samples. The first recording is me speaking, and the second is My Personal Voice created in macOS Sonoma. Give it a listen.</p>\n\n\n\n<div><a href=\"https://soundcloud.com/macworld\" target=\"_blank\">Macworld</a> · <a href=\"https://soundcloud.com/macworld/romans-real-voice-recorded-in-macos-sonoma\" target=\"_blank\">Roman’s real voice recorded in macOS Sonoma</a></div>\n\n\n\n\n<div><a href=\"https://soundcloud.com/macworld\" target=\"_blank\">Macworld</a> · <a href=\"https://soundcloud.com/macworld/romans-personal-voice-made-in-macos-sonoma\" target=\"_blank\">Roman’s Personal Voice made in macOS Sonoma</a></div>\n\n\n\n\n<p>The process of creating a Personal Voice involves a long recording session. If you are using a MacBook, you can get away with using its built-in microphone. For best results, however, you should use an external USB mic.</p>\n\n\n\n<p>Here’s how to create a Personal Voice in macOS Sonoma. For more information about Apple’s new Mac operating system, check out our <a href=\"https://www.macworld.com/article/1670742/macos-14-release-date-features-compatibility-beta.html\">macOS Sonoma superguide</a>.</p>\n\n\n\n<h2>How to create a Personal Voice in macOS Sonoma</h2>\n\n\n\n<div>\n<div><div><div>At a glance </div></div><ul><li>Tools required: microphone if your Mac doesn’t have one</li><li>Materials required: macOS Sonoma</li></ul></div>\n\n\n\n<div>\n<div><span>1.</span>\n<h3>Accessibility settings</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-system-setting-personal-voice.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma Personal Voice system setting\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>In System Settings, click on <em>Accessibility</em> in the left column. In the main section of the window, scroll down to the <em>Speech</em> section and click <em>Personal Voice</em>.</p>\n\n\n\n<p>This will open the <em>Personal Voice</em> section. Click <em>Create a Personal Voice</em>.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>2.</span>\n<h3>Get ready to record</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-personal-voice-create-intro.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma Personal Voice create intro\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>After entering the user password, an introduction appears. It tells you that you’ll need to recite 150 phrases that will be used to create the Personal Voice. This voice can then be used in FaceTime, Phone, and other apps. The process takes 15 to 20 minutes. Click <em>Continue</em>.</p>\n\n\n\n<p>Another intro screen appears, advising you on how to get the best results. You should perform the recordings in a quiet place that creates very little echo, and you should speak naturally. If you need to, you can stop the session, save the results, and finish it later. Click <em>Continue</em> again to start.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>3.</span>\n<h3>Recording check</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-personal-voice-check-loud-quality.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma Personal Voice Sound Quality Check\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Before you begin recording, you need to provide a name for the voice. Enter it and click <em>Continue</em>.</p>\n\n\n\n<p>Now the Mac will check the sound quality. At the bottom of the window is a red record button and a label that indicates which mic it is recording from. If it is not the mic you want, you’ll need to cancel the session and then go into the Sound System Settings and select the mic you want to use. Then you need to go back to the first step and start over.</p>\n\n\n\n<p>If the red button shows the correct mic, you may proceed. Click the red circle and read the bold phrase. Remember, speak as you normally would in a conversation. When you are done, the process will automatically sense that you are finished talking and proceed to the next step.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>4.</span>\n<h3>Recording Considerations</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-personal-voice-recording-considerations.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma Personal Voice recording considerations\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>When you finish the initial recording, the Mac analyzes it and will let you know if there are any issues. For example, the analysis shown here says that there is too much background noise. You can take this opportunity to address any issues you may have and then click <em>Check Again</em> to do another test.</p>\n\n\n\n<p>You can also ignore these suggestions and plow ahead. Or maybe you got the all-clear in the first place. In any case, click <em>Continue</em> to start the procedure.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>5.</span>\n<h3>Do this before recording the first phrase</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-personal-voice-read-phrase-1.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma Personal Voice phrase 1\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>The first <em>Read the Phrase</em> screen appears, but don’t click the red record button just yet. There are a few  things you should know:</p>\n\n\n\n<ul>\n<li>Under Read the Phrase is an indicator of your progress. If you want to go back to a previous phrase, click the left button. Click the right button to move forward in the list.</li>\n\n\n\n<li>At any time you can click Done, even if you haven’t read all 150 phrases. Your place in line will be saved and you can come back and continue the process.</li>\n\n\n\n<li>The blue Preview button will have the Mac read the phrase to you, in case you have trouble reading. You can then click the red button and repeat what you heard.</li>\n\n\n\n<li>A setting in the lower left corner gives you two options that you can set at any time:\n<ul>\n<li><em>Continuous Recording</em>: After saying each phrase, the next one automatically appears and you don’t need to press the record button at all.</li>\n\n\n\n<li><em>Stop at Each Phrase</em>: After saying each phrase, the next one automatically appears, but you must click the record button.</li>\n</ul>\n</li>\n</ul>\n\n\n\n<p>Now that you know what’s going on with the UI, make any adjustments you want. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>6.</span>\n<h3>Start recording the phrases</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-personal-voice-read-phrase-9.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma Personal Voice phrase 9\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Click the record button to start the process. This will take 15 to 20 minutes.</p>\n\n\n\n<p>Tip: If you are reading a phrase, mess up, and want to start over, click the record button to stop. When you’re ready, click the record button and continue recording.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>7.</span>\n<h3>How to pause and then restart later</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-personal-voice-continue-recording.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma Personal Voice continue recording\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Maybe you need a break or have to go do something else. To stop the session, click <em>Done</em> to exit. To restart the session, follow these steps:</p>\n\n\n\n<ol>\n<li>Go into <em>S</em>ystem Settings &gt; <em>Accessibility</em>, look for the <em>Speech</em> section, and click <em>Personal Voice</em>.</li>\n\n\n\n<li>Under the Personal Voice section you’ll see an entry with the name of your personal voice and underneath it is the number of phrases you need to record. Click the “i” icon next to it.</li>\n\n\n\n<li>Enter your user password in the pop-up that appears.</li>\n\n\n\n<li>A window appears with a <em>Continue Recording</em> button. Click it.</li>\n</ol>\n\n\n\n<p>You’ll need to do the sound quality check again, but after that, the phrase recording will proceed and you can continue the process.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>8.</span>\n<h3>You’re Done Recording</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-personal-voice-done.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma Personal Voice Done\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>After you say the 150th phrase, you’ll reach the end of the session. A <em>You’re Done Recording</em> window appears and after you’re done patting yourself on the back, click <em>Continue</em>.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>9.</span>\n<h3>Prepare Your Personal Voice</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-Prepare-Your-Personal-Voice.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma Prepare Your Personal Voice\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Now your Mac needs to get to work–and it’s going to take a while, so if you’re using a MacBook, plug it in. You’ll get a notification when the Personal Voice is done and ready to use. On a M1 Pro MacBook Pro, this took about 90 minutes.</p>\n\n\n\n<p>Click <em>Done</em> to start the process. The Personal Voice section in the Accessibility System Setting will display the progress made on making your voice. You can use your Mac for other work while this is going on, but you shouldn’t shut it down. When the process is done, the progress notification will be replaced by the creation date.</p>\n\n\n\n<p>The Personal Voice System Setting has a couple of other preferences to set:</p>\n\n\n\n<ul>\n<li><em>Share across devices</em>: This allows your Personal Voice to be used on other Macs running macOS Sonoma, iPhones with iOS 17, and iPads with iPadOS 17. Turn this one if you’d like to do that.</li>\n\n\n\n<li><em>Allow applications to use your Personal Voice</em>: Turning this on allows applications to request to use Personal Voice to speak aloud through the Mac’s speakers or during calls.</li>\n</ul>\n</div>\n</div>\n</div>\n\n\n\n<div><span>10.</span>\n<h3>Adjust the Live Speech System Setting</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-live-speech-personal-voice.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma live speech personal voice\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>Now that your Personal Voice has been created, you need to adjust the Mac’s settings so you can use it in apps. This is done in the <em>Live Speech</em> setting,</p>\n\n\n\n<ol>\n<li>Go to System Settings &gt; <em>Accessibility</em>, then scroll down to the <em>Speech</em> section and click on <em>Live Speech</em>.</li>\n\n\n\n<li>In the <em>Voice</em> setting, click the pop-up menu. Look for your Personal Voice and select it.</li>\n\n\n\n<li>Turn on the switch at the top for <em>Live Speech</em>.</li>\n</ol>\n\n\n\n<p>A Type to Speak box will appear, and you can enter some text and hit Return to sample your Personal Voice. If you want to hide the box, click the menu bar icon that looks like the Live Speech icon (a keyboard with a microphone in the lower right corner).</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>11.</span>\n<h3>How to use Text to Speech in FaceTime, macOS</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/sonoma-facetime-transciption-input.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS Sonoma FaceTime transciption input\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<div>\n<div>\n<p>If you want to use text-to-speech input in FaceTime, go to the <em>Video</em> menu in the FaceTime app, and select <em>Transcriptions Text-To-Speech</em> under the <em>Microphone</em> section.</p>\n\n\n\n<p>If you want to set macOS to use Text to Speech for the Mac, go to <em>System Settings</em> &gt; <em>Sound</em>, then scroll down to the <em>Output &amp; Input </em>section and click on <em>Input</em>. Click on <em>Transcriptions Text-To-Speech.</em></p>\n</div>\n</div>\n</div>\n</div>\n</div>\n\n\n\n<p>That’s it! You should be able to use your Personal Voice in text-to-speech situations. If you don’t like how the Personal Voice sounds, you can delete it and do the procedure again. You even add another Personal Voice by doing the procedure again.</p>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"201d743317e3884ad60ccd21234ad8a9477185b943751a16f5b37bd65f32f4e7","category":"Apple"}