{"title":"Fitting metabolic models to dissolved oxygen data: The estuarine Bayesian single‐station estimation method","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10620?af=R","date":1723031735000,"content":"<h2>Abstract</h2>\n<p>Continuous measurements of dissolved oxygen (DO) are useful for quantifying ecosystem metabolism, which is critical for understanding estuarine biogeochemistry and ecology, but current methods applied to these data may lead to estimates that are physically impossible and poorly constrained errors. Here, we present a new approach for estimating estuarine metabolism: Estuarine BAyesian Single-station Estimation (EBASE). EBASE applies a Bayesian framework to a simple process-based model and DO observations, allowing the estimation of critical model parameters, specifically light efficiency and respiration, as informed by a set of prior distributions. EBASE improves upon the stream-based model from which it was derived by accommodating missing DO data and allowing the user to set the time period over which parameters are estimated. We demonstrate that EBASE can recover known metabolic parameters from a synthetic time series, even in the presence of noise (e.g., due to tidal advection) and when prior distributions are uninformed. Optimization periods of 7 and 30 d are more preferable than 1 d. A comparison with the more-conventional method of Odum reveals the ability of EBASE to avoid unphysical results (such as negative photosynthesis and respiration) and improves when the DO data are detided. EBASE is available using open-source software (R) and can be readily applied to multiple years of long-term monitoring data that are available in many estuaries. Overall, EBASE provides an accessible method to parameterize a simple metabolic model appropriate for estuarine systems and will provide additional understanding of processes that influence ecosystem status and condition.</p>","author":"Marcus W. Beck, \nJill M. Arriola, \nMaria Herrmann, \nRaymond G. Najjar","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"2025878fa85a7f241fe687ebaa5638e7f05f1dce6038a6bd4328b60490117716","category":"Environment"}