{"title":"Apple's Unusual Headset Design Has Led to Unprecedented Production Challenges","link":"https://www.macrumors.com/2023/05/31/report-details-apple-headset-unusual-design/","date":1685545604000,"content":"Apple's mixed-reality headset will reportedly be the most complicated hardware product ever made by the company, sporting an unusual design that has proven to be an unprecedented challenging to manufacture, <a href=\"https://www.theinformation.com/articles/apples-learning-curve-how-headsets-design-caused-production-challenges?rc=583sff\"><em>The Information</em></a> reports.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/02/apple-mixed-reality-headset-concept-by-david-lewis-and-marcus-kane.jpg\" alt width=\"1600\" height=\"900\" /><em>Apple headset concept by <a href=\"https://twitter.com/marcusckane\">Marcus Kane</a></em></div>\r<br />\nThe headset apparently features an \"unconventional curved design, thinness, and ultralight weight.\" Several renders seen by <em>The Information</em> \"show a piece of curved glass with edges wrapped in a smooth aluminum frame that appears to be slightly thicker than an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>.\" The thin profile requires users who wear glasses to buy prescription lenses that magnetically clip into the headset.\r<br />\n\r<br />\nApple had to develop a first-of-its-kind \"bent motherboard\" to fit inside the headset's curved outer shell. Carbon fiber is used inside the headset to reinforce the structure without adding additional weight.\r<br />\n\r<br />\nA small dial is located above the right eye, allowing users to transition between augmented and virtual reality, and a power button is located above the left eye. A round connector that looks similar to an Apple Watch charger attaches to the headset's left temple and runs down via a cable to a waist-mounted battery pack.\r<br />\n\r<br />\nThe headset's headband is primarily made of a soft material and attached to two short, hard temples which also contain the left and right speakers. A soft, removable cover attaches to the back of the headset for comfort against the wearer's face. Apple is said to have debated adding additional eye-tracking cameras or further adjustments to the motorized lenses to accommodate more face shapes.\r<br />\n\r<br />\nApple's industrial design team apparently pushed for the front of the headset to be made of a thin piece of curved glass, requiring more than a dozen cameras and sensors to be concealed for aesthetic reasons. There have apparently been concerns about the glass warping the images captured by the cameras, which could cause nausea if left unfixed, and the material is more prone to shattering than an ‌iPhone‌ screen due to its shape, leading to worries about broken glass from the headset injuring users.\r<br />\n\r<br />\nThe design is said to be the main driver behind the device's ~$3,000 retail price. Assembly workers apparently struggle to maneuver tools and install components at awkward angles inside the device due to its shape and densely packed electronics. Testing of the glass housing and cameras also takes far longer than equivalent processes for other Apple devices.\r<br />\n\r<br />\nThe headset's microOLED displays are also said to be so expensive that Apple has to fix defective units rather than discard them. Sony, the displays' supplier, could struggle to manufacture enough panels for more than 250,000 headsets this year due to their small size and pixel density.\r<br />\n\r<br />\nApple has struggled to build prototype headsets due to its complicated design. At an earlier stage in development, Apple was making 100 headsets a day, but only 20 units were up to the company's standards. In mid-April, the headset underwent design validation testing, where it reportedly remained for an unusually long period compared to more mature products like the ‌iPhone‌. Apple apparently made unusually late design tweaks as late as April, to make it easier to manufacture.\r<br />\n\r<br />\nWhile mass production of the headset has not yet begun, Luxshare, its sole manufacturer, has purportedly told workers that the factory that will make the headset must be fully staffed by July. <em>The Information</em> believes this points to a launch in the fall or winter. Apple is expected to ship less than half a million headsets during the first year of its release. For more details, see <a href=\"https://www.theinformation.com/articles/apples-learning-curve-how-headsets-design-caused-production-challenges\"><em>The Information</em>'s full report</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/theinformation-com/\">The Information</a>, <a href=\"https://www.macrumors.com/guide/luxshare/\">Luxshare</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/31/report-details-apple-headset-unusual-design/\">Apple's Unusual Headset Design Has Led to Unprecedented Production Challenges</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-unusual-headset-design-has-led-to-unprecedented-production-challenges.2391151/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"203d8c090dbcbcc1788fc7f17c8e2ccdcdc1c41292a57cb3d14a95c9906e4790","category":"Apple"}