{"title":"Effects of Saccharomyces cerevisiae and Bacillus subtilis on in vitro fermentation in the rumen of Hu sheep","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13848?af=R","date":1725282195000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The demand for animal products is increasing in developing countries due to population growth. However, livestock production contributes significantly to global warming, accounting for 25%. Probiotics can help improve livestock efficiency by enhancing gut microbes and fat metabolism. They can modify rumen populations, enhance fermentation, reduce methane emissions and improve feed digestion. In this study, the goal was to determine the most effective method of reducing methane emissions in the rumen of sheep <i>in vitro</i> by adding different concentrations of <i>Saccharomyces cerevisiae</i> and <i>Bacillus subtilis</i>.</p>\n<h2>RESULTS</h2>\n<p>Adding 8 × 10<sup>6</sup> CFU g<sup>−1</sup>\n<i>S. cerevisiae</i> during fermentation reduced pH levels after 48 h. This also increased the concentrations of NH<sub>3</sub>-N, microbial protein and total gas production. At the same time, it decreased methane emissions. Furthermore, adding 20 × 10<sup>6</sup> CFU g<sup>−1</sup>\n<i>B. subtilis</i> to the mixture increased total gas production (TGP) and methane production, with the highest production observed after 48 h. However, it did not affect pH levels after 48 h.</p>\n<h2>CONCLUSION</h2>\n<p>It can be concluded that <i>S. cerevisiae</i> had significantly increased microbial protein and NH<sub>3</sub>-N concentrations after fermentation without altering pH. Additionally, the addition of <i>S. cerevisiae</i> enhanced TGP and reduced methane emissions. It is worth noting that TGP increased because <i>B. subtilis</i> was added at a concentration of 20 × 10<sup>6</sup> CFU g<sup>−1</sup>, with no significant differences between concentrations. Therefore, we recommend adding <i>S. cerevisiae</i> and <i>B. subtilis</i> to the diet at doses of 8 and 20 × 10<sup>6</sup> CFU g<sup>−1</sup>, as it resulted in higher TGP and reduced methane emissions. © 2024 Society of Chemical Industry.</p>","author":"Mahmoud Kamal, \nKou Linlin, \nJian Gao, \nZhao Xinrui, \nCheng Xinming, \nWang Haibo, \nDai Lulu, \nMohamed E. Abd El‐Hack, \nKhalid Mahrose, \nYanfen Cheng","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"2044d155c07b490bce4650dc53e11b9267549362f7ce26bc03a76904a3b40b59","category":"Environment"}