{"title":"F10 Gene Expression and Ethnic Disparities Present in Papillary Thyroid Carcinoma","link":"https://www.preprints.org/manuscript/202404.1370/v1","date":1713773835000,"content":"Papillary thyroid carcinoma (PTC) presents a significant health concern, particularly among Hispanic women in the United States, who exhibit a disproportionately higher chance of developing an advanced disease when compared to the non-Hispanic population. Emerging evidence suggests coagulation factor X, encoded by F10 gene, has a potential role in inhibiting cancer cell migration. However, comprehensive investigations into the differential expression patterns of F10 in Hispanic versus non-Hispanic females remain limited. RNA-sequencing data was acquired from the TCGA database for white female patients, 166 non-Hispanic and 25 Hispanic. A statistically significant (p &amp;lt; 0.05) 2.06-fold increase in F10 expression levels was detected in disease-free tumors compared to recurrent PTC tumors. Furthermore, an increase in F10 gene expression levels was also observed corresponding to approximately a 1.74-fold increase in non-Hispanic patients compared to Hispanic patients. The probability of tumor recurrence was 1.82 times higher in the cohort with low expression of F10 compared to the high expression cohort, correlating with the lower disease-free rates observed in Hispanic patients’ cohort when compared to non-Hispanics. This finding underscores the relevance of ethnic disparities in molecular profiles for understanding cancer susceptibility. Identifying F10 as a potential prognostic biomarker highlights avenues for targeted interventions and contributes to improving diagnostic and treatment strategies for diverse patient populations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"20451ffee712406033433307ac64d1716f4ea9188ef32f5b516354229ac7b14e","category":"Interdisciplinary"}