{"title":"SMARCAL1 ubiquitylation controls its association with RPA-coated ssDNA and promotes replication fork stability","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002552","date":1710856800000,"content":"<p>by Maïlyn Yates, Isabelle Marois, Edlie St-Hilaire, Daryl A. Ronato, Billel Djerir, Chloé Brochu, Théo Morin, Ian Hammond-Martel, Sari Gezzar-Dandashi, Lisa Casimir, Elliot Drobetsky, Laurent Cappadocia, Jean-Yves Masson, Hugo Wurtele, Alexandre Maréchal</p>\r\n\r\nImpediments in replication fork progression cause genomic instability, mutagenesis, and severe pathologies. At stalled forks, RPA-coated single-stranded DNA (ssDNA) activates the ATR kinase and directs fork remodeling, 2 key early events of the replication stress response. RFWD3, a recently described Fanconi anemia (FA) ubiquitin ligase, associates with RPA and promotes its ubiquitylation, facilitating late steps of homologous recombination (HR). Intriguingly, RFWD3 also regulates fork progression, restart and stability via poorly understood mechanisms. Here, we used proteomics to identify putative RFWD3 substrates during replication stress in human cells. We show that RFWD3 interacts with and ubiquitylates the SMARCAL1 DNA translocase directly in vitro and following DNA damage in vivo. SMARCAL1 ubiquitylation does not trigger its subsequent proteasomal degradation but instead disengages it from RPA thereby regulating its function at replication forks. Proper regulation of SMARCAL1 by RFWD3 at stalled forks protects them from excessive MUS81-mediated cleavage in response to UV irradiation, thereby limiting DNA replication stress. Collectively, our results identify RFWD3-mediated SMARCAL1 ubiquitylation as a novel mechanism that modulates fork remodeling to avoid genome instability triggered by aberrant fork processing.","author":"Maïlyn Yates","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"204b5754ef287dd5c9ac7df4df6392e454a1274cd06a4ceec7b2acad1cbec583","category":"Environment"}