{"title":"Climate change is shifting polar bears’ Arctic menu, research shows","link":"https://arstechnica.com/?p=1808463","date":1635446018000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-97203089-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-97203089.jpg\">Enlarge</a> <span>/</span> Polar bear (<em>Ursus maritimus</em>) standing upright on fjord ice at Sabinebukta Bay at Irminger Point on a summer morning. (credit: <a href=\"https://www.gettyimages.com/detail/photo/polar-bear-nordaustlandet-svalbard-norway-royalty-free-image/97203089?adppopup=true\">Paul Souders / Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Arctic is warming <a href=\"https://phys.org/news/2021-05-arctic-faster-planet.html\">three times faster</a> than the rest of the world. Because of that warming, some organisms are adapting by shifting their natural stomping grounds, and the region is seeing some species move in as they follow the warmth north and stick around there for longer.</p>\n<p>As such, the menu for polar bears is changing, according to a <a href=\"https://www.sciencedirect.com/science/article/pii/S1470160X21009109\">recently published paper</a>. The research also suggests that studying fat tissue from polar bears—a practice that can shed light on what prey they’ve been consuming—can be a useful tool in monitoring how species distribution in the Arctic is changing as temperatures increase and ice melts.</p>\n<p>“The Arctic is changing. It is changing at a very rapid pace, especially in comparison to really any other region of the world. Temperatures are warming faster,” Melissa Galicia, a PhD candidate in York University’s department of biology and one of the authors of the paper, told Ars. “The ice is declining. Sea ice is becoming more fragmented. The water temperatures are warming. You’re getting an ecosystem that is changing rapidly, and all of the species within that ecosystem also need to adapt.”</p></div><p><a href=\"https://arstechnica.com/?p=1808463#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1808463&amp;comments=1\">Comments</a></p>","author":"Doug Johnson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"20529ead26b218b5be874d5a580b9b7427d4a5ab53090d3a31ec4da907f67348","category":"Tech"}