{"title":"Neonatal resveratrol administration promotes skeletal muscle growth and insulin sensitivity in intrauterine growth‐retarded suckling piglets associated with activation of FGF21–AMPKα pathway","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13256?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Skeletal muscle is a major insulin-sensitive tissue with a pivotal role in modulating glucose homeostasis. This study aimed to investigate the effect of resveratrol (RES) intervention during the suckling period on skeletal muscle growth and insulin sensitivity of neonates with intrauterine growth retardation (IUGR) in a pig model.</p>\n<h2>RESULTS</h2>\n<p>Twelve pairs of normal birth weight (NBW) and IUGR neonatal male piglets were selected. The NBW and IUGR piglets were fed basal formula milk diet or identical diet supplemented with 0.1% RES from 7 to 21 days of age. Myofiber growth and differentiation, inflammation and insulin sensitivity in skeletal muscle were assessed. Early RES intervention promoted myofiber growth and maturity in IUGR piglets by ameliorating the myogenesis process and increasing thyroid hormone level. Administering RES also reduced triglyceride concentration in skeletal muscle of IUGR piglets, along with decreased inflammatory response, increased plasma fibroblast growth factor 21 (FGF21) concentration and improved insulin signaling. Meanwhile, the improvement of insulin sensitivity by RES may be partly regulated by activation of the FGF21/AMP-activated protein kinase <i>α</i>/sirtuin 1/peroxisome proliferator activated receptor-<i>γ</i> coactivator-1<i>α</i> pathway.</p>\n<h2>CONCLUSION</h2>\n<p>Our results suggest that RES has beneficial effects in promoting myofiber growth and maturity and increasing skeletal muscle insulin sensitivity in IUGR piglets, which open a novel field of application of RES in IUGR infants for improving postnatal metabolic adaptation. © 2023 Society of Chemical Industry.</p>","author":"Guangyi Bai, \nJinyong Chen, \nYue Liu, \nJun Chen, \nHonglin Yan, \nJinming You, \nTiande Zou","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"20553242692e0f95bb116143b8e8a191250aae704f6c46d9ab1e5ce581728534","category":"Environment"}