{"title":"Environmental DNA metabarcoding reveals temporal dynamics but functional stability of arthropod communities in cattle dung","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14119?af=R","date":1718188430000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/5cd882f1-8036-49c9-9bb8-c63d71514dad/jane14119-toc-0001-m.png\" alt=\"Environmental DNA metabarcoding reveals temporal dynamics but functional stability of arthropod communities in cattle dung\" />\n<p>The study shows temporal dynamics of invertebrate succession in cattle dung by a multi-taxon approach. Functional redundancy was found within groups of beetles and flies important for dung decomposition, suggesting functional stability and resilience in the system.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTerrestrial invertebrates are highly important for the decomposition of dung from large mammals. Mammal dung has been present in many of Earth's ecosystems for millions of years, enabling the evolution of a broad diversity of dung-associated invertebrates that process various components of the dung. Today, large herbivorous mammals are increasingly introduced to ecosystems with the aim of restoring the ecological functions formerly provided by their extinct counterparts. However, we still know little about the ecosystem functions and nutrient flows in these rewilded ecosystems, including the dynamics of dung decomposition. In fact, the succession of insect communities in dung is an area of limited research attention also outside a rewilding context.\n\nIn this study, we use environmental DNA metabarcoding of dung from rewilded Galloway cattle in an experimental set-up to investigate invertebrate communities and functional dynamics over a time span of 53 days, starting from the time of deposition.\n\nWe find a strong signal of successional change in community composition, including for the species that are directly dependent on dung as a resource. While several of these species were detected consistently across the sampling period, others appeared confined to either early or late successional stages. We believe that this is indicative of evolutionary adaptation to a highly dynamic resource, with species showing niche partitioning on a temporal scale. However, our results show consistently high species diversity within the functional groups that are directly dependent on dung.\n\nOur findings of such redundancy suggest functional stability of the dung-associated invertebrate community, with several species ready to fill vacant niches if other species disappear. Importantly, this might also buffer the ecosystem functions related to dung decomposition against environmental change. Interestingly, alpha diversity peaked after approximately 20–25 days in both meadow and pasture habitats, and did not decrease substantially during the experimental period, probably due to preservation of eDNA in the dung after the disappearance of visiting invertebrates, and from detection of tissue remains and cryptic life stages.\n</p>\n<h2>Resumé</h2>\n<p>\n\nNedbrydning af gødning (afføring) fra store pattedyr udføres i høj grad af insekter og andre hvirvelløse dyr. Gødning fra pattedyr har været til stede i mange økosystemer gennem millioner af år, hvilket har muliggjort evolutionen af mange forskellige gødnings-tilknyttede arter, der omsætter og udnytter forskellige dele af gødningen. I dag bliver store planteædere hyppigt udsat i økosystemer for at genskabe økologiske funktioner som tidligere blev udført af uddøde arter. Vores viden om økosystem-funktioner og næringstransport i sådanne “genforvildede” (rewildede) økosystemer, blandt andet dynamikken i nedbrydning af gødning er dog stadig begrænset. Faktisk er successionen i samfund af gødnings-tilknyttede insekter ikke særligret velstuderet.\n\nI dette studie bruger vi miljø-DNA til at undersøge samfund af hvirvelløse dyr og funktionelle dynamikker i gødning fra Galloway kvæg i et eksperimentelt forsøg over 53 dage efter gødningen er placeret.\n\nVi finder tydelige ændringer i samfundenes sammensætning over tid, også for de artsgrupper der er direkte afhængige af gødningen som en føderessource. Selvom flere af disse arter blev fundet konsekvent gennem forsøgsperioden, var der andre som tilsyneladende var tilknyttet enten tidlige- eller sene stadier i gødningens nedbrydning. Vi mener at dette indikerer evolutionær tilpasning til en ekstremt dynamisk ressource, hvor arter har tilpasset sig til at udnytte gødningen på bestemte tidspunkter i nedbrydningsprocessen. Dog viser vores resultater konstant høj artsrigdom gennem forsøgsperioden inden for de grupper der udnytter gødningen direkte som føderessource.\n\nVores resultater tyder på at der er funktionel stabilitet inden for det gødnings-tilknyttede samfund af hvirvelløse dyr, med flere arter tilstede som potentielt kan fylde frie nicher hvis andre arter forsvinder. Sådan en overflod af arter der udfører bestemte funktioner kan fungere som en buffer mod fremtidige miljøændringer, hvilket er særligt relevant i dag. Artsrigdommen toppede efter ca. 20–25 dage i prøver fra både eng og overdrev og faldt ikke særligt gennem forsøgsperioden. Dette skyldes formentlig at DNA bevares i gødningen efter organismen er væk, samt at vævsrester og svært identificerbare livsstadier også tilfører DNA til prøverne som kan opfanges.\n</p>","author":"Emil Ellegaard Thomassen, \nEva Egelyng Sigsgaard, \nMads Reinholdt Jensen, \nKent Olsen, \nMorten D. D. Hansen, \nPhilip Francis Thomsen","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"205aa6da475c38e12fe19839b3257d91baa6dd982cca7f6cc4b542ff3f8ee910","category":"Environment"}