{"title":"USB worm unleashed by Russian state hackers spreads worldwide","link":"https://arstechnica.com/?p=1985993","date":1700611349000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/malicious-usb-800x800.jpg\" alt=\"USB worm unleashed by Russian state hackers spreads worldwide\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/malicious-usb.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A group of Russian-state hackers known for almost exclusively targeting Ukranian entities has branched out in recent months either accidentally or purposely by allowing USB-based espionage malware to infect a variety of organizations in other countries.</p>\n<p>The group—known by many names, including Gamaredon, Primitive Bear, ACTINIUM, Armageddon, and Shuckworm—has been active since at least 2014 and has been attributed to Russia’s Federal Security Service by the Security Service of Ukraine. Most Kremlin-backed groups take pains to fly under the radar; Gamaredon doesn't care to. Its espionage-motivated campaigns targeting large numbers of Ukrainian organizations are easy to detect and tie back to the Russian government. The campaigns typically revolve around malware that aims to obtain as much information from targets as possible.</p>\n<p>One of those tools is a computer worm designed to spread from computer to computer through USB drives. Tracked by researchers from Check Point Research as LitterDrifter, the malware is written in the Visual Basic Scripting language. LitterDrifter serves two purposes: to promiscuously spread from USB drive to USB drive and to permanently infect the devices that connect to such drives with malware that permanently communicates with Gamaredon-operated command and control servers.</p></div><p><a href=\"https://arstechnica.com/?p=1985993#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1985993&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"205a8ba3e49d2e469803902841f2cd70339ef0d749c538b0569218d2e2aecc9b","category":"Tech"}