{"title":"Google เลื่อนปล่อยฟีเจอร์แจ้งเตือน Find My Device เพราะต้องรอ Apple ออกมาตรการป้องกันการติดตามบน iOS เองก่อน","link":"https://www.blognone.com/node/135068","date":1690798923000,"content":"<div><div><div><p>Google ประกาศผ่านบล็อกว่าจะชะลอการ<a href=\"https://www.blognone.com/node/133787\">ปล่อยฟีเจอร์แจ้งเตือนหากมี AirTag ถูกติดตามตัว</a> ซึ่งเป็นส่วนหนึ่งของ Find My Device ออกไปก่อน จนกว่า Apple ยืนยันสเปคกลาง และเริ่มใช้ฟีเจอร์นี้ใน iOS เพื่อปกป้องผู้ใช้งานจากการติดตามตำแหน่งที่ไม่ต้องการ</p>\n<p>แม้ว่า Find My Device จะเป็นฟีเจอร์ที่มีประโยชน์มาก แต่เป็นฟีเจอร์ที่เปิดการติดตามตำแหน่งที่ผู้ใช้งานไม่ต้องการด้วย ตัวอย่างเช่น มีคนจงใจทิ้งผลิตภัณฑ์ที่มีเครือข่าย Find My Device ในกระเป๋าของผู้ใช้ แล้วสามารถติดตามตำแหน่งของคุณผ่านผลิตภัณฑ์นั้นได้</p>\n<p>เพื่อป้องกันการติดตามที่ไม่พึงประสงค์นี้ <a href=\"https://www.blognone.com/node/135035\">Google ได้ออกมาตรการใน Android</a> หากโทรศัพท์ Android ตรวจพบผลิตภัณฑ์ที่มีการติดตามอยู่ใกล้ ๆ โทรศัพท์ก็จะแจ้งให้ผู้ใช้ทราบว่ากำลังถูกติดตามอยู่ แต่ถ้าผู้ใช้คนนั้นใช้ iPhone จะไม่มีมาตรการนี้ เพราะ Apple ยังไม่ได้ออกมาตรการใด ๆ ใน iOS เพื่อตรวจจับการติดตามตำแหน่งด้วยอุปกรณ์ที่ใช้เครือข่าย Find My Device (iOS มีแค่การตรวจจับ AirTags ที่ไม่มีเจ้าของ แต่ไม่มีการตรวจจับอุปกรณ์ติดตามยี่ห้ออื่นๆ)</p>\n<p>โดยสาเหตุหลักที่ Google ต้องการรอให้ Apple ออกมาตรการออกมาก่อนเพราะ ไม่ต้องการให้ผู้ใช้งาน iPhone ได้รับความเดือดร้อนแบบที่ผู้ใช้ Android เคยเจอนั่นเอง นอกจากนี้ Apple และ Google กำลังพัฒนาข้อกำหนดการแจ้งเตือนติดตามของอุตสาหกรรมเทคโนโลยีร่วมกัน โดยทั้งสองบริษัทมีกำหนดการที่จะเสร็จสิ้นข้อกำหนดภายในสิ้นปีนี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/42bdb7e8a75950bbaeecb78bfb3d83bf.png\" alt /></p>\n<p>ที่มา - <a href=\"https://blog.google/products/android/unknown-tracker-alert-google-android/\">Google</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/android\">Android</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/airtag\">AirTag</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/privacy\">Privacy</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2064d3a1757d2e7ad5a6b62ed8907bf36f75407ebcb0b3749634ecd7322786e0","category":"Thai"}