{"title":"Nutritional status of primary school children and their caregiver’s knowledge on malnutrition in rural and urban communities of Ekiti State, Southwest Nigeria","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303492","date":1715608800000,"content":"<p>by Taofeek Adedayo Sanni, Olusegun Elijah Elegbede, Kayode Rasak Adewoye, Kabir Adekunle Durowade, Tope Michael Ipinnimo, Ayodele Kamal Alabi, John Olujide Ojo, Richard Dele Agbana, Mustapha Muhammad Raji, Oluseyi Adedeji Aderinwale, Mojoyinola Oyindamola Adeosun, Ademuyiwa Adetona, Opeyemi Oladipupo Abioye, Olumide Temitope Asake, Olanrewaju Kassim Olasehinde, Olawale Bashir-ud-deen Oni</p>\r\nBackground <p>Nutritional imbalance is an underlying cause of 2.6million death annually and a third of child’s death globally. This study assessed and compared the nutritional status of primary school children and their caregiver’s knowledge on malnutrition in rural and urban communities of Ekiti State.</p> Methods <p>This is a cross-sectional comparative study carried out among 983 urban and rural primary school children in Ekiti State (495 in urban and 488 in rural) using interviewer-administered semi-structured questionnaire. A multi-stage sampling technique was used and data collected was analyzed using SPSS 23 with level of statistical significance set at p &lt; 0.05.</p> Results <p>Underweight and stunting were relatively higher in rural (6.5% and 22.7% respectively) than in urban (6.3% and 19.4% respectively) and these differences are not statistically significant (p = 0.898, p = 0.197). However, wasting, overweight and obesity were higher in urban (12.7%, 6.1% and 7.7% respectively) than rural (11.5%, 3.7% and 7.5% respectively) but the difference is not statistically significant. (p = 0.242). Majority of the caregivers in both settings had good knowledge of malnutrition though higher in urban mothers (89.5%) with statistical significance than their rural counterparts (71.5%). However, there is no significant association between caregiver’s knowledge and malnutrition in this study. Being in lower primary school class, relationship with caregiver, educational status of caregiver and occupation of caregiver were the common predictors of malnutrition among the school children in both community settings.</p> Conclusion <p>Generally, the prevalence of malnutrition was high in both urban and rural primary school children in this study. However, while underweight and stunting were more prevalent among the children in the rural communities, wasting, overweight and obesity were more prevalent in the urban. The caregivers in both communities had good knowledge of malnutrition (better in the urban) but this is not good enough to bring a significant relationship with the occurrence of malnutrition in the children. Common predictors of malnutrition in both community settings are being in lower primary school class, relationship with caregiver, educational status of caregiver and occupation of caregiver. It is therefore recommended that regular continuous public enlightenment, nutritional education programmes and other programmes targeted at improving the economic power of the caregivers are measures that will improve the nutritional status of the primary school children.</p>","author":"Taofeek Adedayo Sanni","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2071299925502e376f2499f9cd4df6a07429cbd094c98cf26484d04b44286960","category":"Interdisciplinary"}