{"title":"The collaboration of private Hospitals with the Public Health System: the case of La Rioja, Spain (1986-2019).","link":"https://www.preprints.org/manuscript/202403.0529/v1","date":1709895249000,"content":"In Spain, the National Health System, of a public nature, provides care to Spaniards and other residents in Spain. It is a system adapted to the State of Autonomies, decentralized. Each Auton-omous Community has legislative capacity in its organization and management. We studied the agreement of private hospitals by the public system in La Rioja, an Autonomous Community of Spain located in the North of the Iberian Peninsula. Documentary sources from the General archives of La Rioja, the Institute of Riojan Studies, municipal funds (Logroño, Haro, Calahorra), and in-formation from catalogs and censuses of hospitals from the Ministry of Health, National Institute of Statistics, and Institute of Statistics of La Rioja have been reviewed. The hospital model of La Rioja is characterized by a predominance of public beds over private ones, although there is a growing trend in the number of private beds from 2013 onwards, due to the incorporation of two conva-lescent socio-health hospitals. A characteristic element of La Rioja has been the promotion of pub-lic-private collaboration, conceived as a strategic alliance. Regarding agreements, in La Rioja there has been a specialization in the socio-health space, whose formulas have been the management service contract and the concession of work. The development of the Health System in La Rioja, 1986-2019, has been determined by the presence of a mixed public-private hospital system and a progressively lower dependence on specialized hospitals from other Autonomous Communities.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"207544b46d6c2281f392cdc8b6085a12ed2a5871ebb303c83cb31c00ec0ca0c8","category":"Interdisciplinary"}