{"title":"TFEB ameliorates DEHP‐induced neurotoxicity by activating GAL3/TRIM16 axis dependent lysophagy and alleviating lysosomal dysfunction","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24221?af=R","date":1710506128000,"content":"<h2>Abstract</h2>\n<p>Di-(2-ethylhexyl) phthalate (DEHP) is a commonly used plasticizer with known neurotoxic effects. However, the specific mechanism underlying this neurotoxicity remains unclear. This study aimed to investigate the role of lysosomal function and lysophagy in DEHP-induced neurotoxicity, with a particular focus on the regulatory role of Transcription factor EB (TFEB). To achieve this, we utilized in vitro models of DEHP-exposed SH-SY5Y cells and HT22 cells. Our findings revealed that DEHP exposure led to lysosomal damage and dysfunction. Moreover, we observed impaired autophagic degradation, characterized by elevated levels of LC3II and p62. DEHP treatment downregulated the expression of TFEB, GAL3, and TRIM16, while upregulating the expression of PARP. This led to the inhibition of GAL3/TRIM16 axis dependent lysophagy and ultimately excessive apoptosis in neuronal cells. Importantly, TFEB overexpression alleviated lysosomal dysfunction, activated lysophagy, and mitigated DEHP-induced apoptosis. Overall, our results suggest that DEHP induces not only lysosomal dysfunction, but also inhibits lysophagy through the suppression of GAL3/TRIM16 axis. Consequently, impaired clearance of damaged lysosomes occurs, culminating in neuronal apoptosis. Taken together, our findings highlight the critical role of TFEB in regulating lysophagy and lysosomal function. Furthermore, TFEB may serve as a potential therapeutic target for mitigating DEHP-induced neuronal toxicity.</p>","author":"Hengrui Xing, \nPanpan Xu, \nYue Ma, \nTingting Li, \nYue Zhang, \nXueman Ding, \nLi Liu, \nMulatibieke Keerman, \nQiang Niu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"20756a6e51e538d3cc144a3a10cbf06abd4897e673ab6bc046ca1876d4ad118e","category":"Environment"}