{"title":"Hate Campaigns against Liberation War of Bangladesh through Social Media","link":"https://www.preprints.org/manuscript/202407.0277/v1","date":1719992420000,"content":"Liberation war of Bangladesh was estimated to be held in financial year 1971 to gain independence from Pakistan. Bangladesh alone generated 70% of export return and in turn it received only 25%. The fabric mills of Bangladesh faced a slow increment from 11 to only 26 mills operating from 1947 till the fiscal year 1970.  Nationalization of Urdu speaking language finally created outrage and turmoil among citizens of West and East Pakistan and generated war of Freedom Movement. This article mainly sheds light of different challenges faced by Bangladesh citizens such as genocide, women torture and communal disparity. Different factors such as economic turmoil political unrest and minor treatments were major reason behind the hate campaign of the liberation war. Thus, this article critically demonstrates the strategies adopted for mitigating challenges such as peaceful negotiation and maintenance of equality and similar priority to every citizen. This article critically evaluates the concept of hate campaign and Liberation War of Bangladesh. Its aim at analyzes ways incorporated by liberation war of Bangladesh for triggering hate campaigns along with different factors affecting hate campaigns. This study shed light on illustrating three different case studies including when government of Bangladesh undertook strict actions against mobs that tend to vandalize on Communal activities. In addition, second case study includes when social media platform Facebook formed a partnership with Asia foundation for combating online haters-based intolerance. Apart from that, third case study evaluating hate campaign on using social media platform it blocks two groups of people for hacking allegations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"20801b0c778494d37b58b5bbd64d18268bfafff9cae88782ce6fc12701139c91","category":"Interdisciplinary"}