{"title":"ข้อมูลล่าสุดเฮดเซต Mixed Reality ของ Apple - ต้องใช้แบตเตอรี่เสริมต่อสายไว้ตลอดเวลา","link":"https://www.blognone.com/node/133530","date":1682266417000,"content":"<div><div><div><p>จดหมายข่าว Power On ของ Mark Gurman แห่ง Bloomberg ตอนล่าสุด ให้ข้อมูลเกี่ยวกับ<a href=\"https://www.blognone.com/node/133173\">เฮดเซต Mixed Reality</a> ของแอปเปิล ที่คาดว่าจะเปิดตัว<a href=\"https://www.blognone.com/node/133213\">ในงาน WWDC เดือนมิถุนายน</a> โดยบนข้อมูลที่เขามีตอนนี้ มาพร้อมคำถามว่า ลูกค้าทั่วไปจะยังสนใจซื้อเฮดเซตที่ราคาอาจสูงถึง 3,000 ดอลลาร์นี้หรือไม่?</p>\n<p>ข้อมูลแรกว่าด้วยเรื่องแอปที่รองรับ เขาบอกว่าแอปเปิลยังหาแอปหมัดเด็ดที่จะนำเสนอเพื่อเรียกความสนใจไม่ได้ ฉะนั้นแนวทางคือจัดทุกอย่างใส่ลงไปทั้ง เกม ออกกำลังกาย ไปจนถึงแอปอ่านหนังสือใน VR โดยหวังว่าต้องมีสักอย่างที่ดึงดูดได้ อย่างไรก็ตาม Gurman บอกว่าการนำเสนอแบบไล่เรียงฟีเจอร์มากมายนี้ ตอนเปิดตัว Apple Watch ก็เป็นแบบเดียวกัน แอปเปิลจึงหวังว่าเมื่อเวลาผ่านไปจะเจอแนวทางที่ตลาดต้องการ (ตอนนั้น<a href=\"https://www.blognone.com/node/60241\">มีกระทั่งฟีเจอร์ส่งอัตราเต้นหัวใจ</a>ให้อีกฝ่าย)</p>\n<p>ตัวอย่างฟีเจอร์ที่คาดว่าจะเปิดตัวในเฮดเซตนี้ เช่น แอปนั่งสมาธิแบบกราฟิกสวยงาม, ใช้งานแอปพื้นฐานใน iPad ได้แบบ VR, ดูถ่ายทอดสดกีฬาแบบ VR, Virtual Meeting Room และอื่น ๆ</p>\n<p>ข้อมูลถัดมาคือดีไซน์ของเฮดเซต เขาบอกว่าแอปเปิลตัดสินใจทำให้ตัวเฮดเซตสวมศีรษะนั้นเบามากที่สุด จึงต้องใช้แบตเตอรี่เสริมต่อไว้ในการใช้งาน เฮดเซตจะมีสองพอร์ต USB-C อันหนึ่งสำหรับเชื่อมต่อข้อมูล อีกอันสำหรับแบตเตอรี่เสริม ผู้สวมใส่ต้องเก็บแบตเตอรี่ในกระเป๋าเสื้อ โดยสายเชื่อมต่อมีตัวล็อกแม่เหล็กเพื่อกันหลุดด้วย แบตเตอรี่ 1 ก้อน ใช้งานได้ประมาณ 2 ชั่วโมง</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/newsletters/2023-04-23/apple-s-ar-vr-headset-plans-ipad-apps-fitness-sports-viewing-gaming-music-lgtgopgx\">Bloomberg</a></p>\n<p>หมายเหตุ: ภาพประกอบไม่ใช่เฮดเซตที่แอปเปิลจะผลิต</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1ce48782f49b2152ab177dfa34f7149f.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/rumors\">Rumors</a></div><div><a href=\"/topics/mixed-reality\">Mixed Reality</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2083f536a3f6068c107128062d67e71dae04db352bc7deae0532e545dbad7e88","category":"Thai"}