{"title":"Evaluation of Antiproliferative Potentials Associated with the Volatile Compounds of Lantana camara Flowers: A Selective In Vitro Activity","link":"https://www.preprints.org/manuscript/202410.1666/v1","date":1729588515000,"content":"Contemporary analysis of the chemical composition of medicinal plants, and their biological activities, is important to find new potent therapeutic products. This study deciphers the chemical profiles of three essential oils (EOs) obtained from different flowers of Lantana camara, and evaluates their antioxidant and anticancer activities. The three flowers (white, pink, and orange) were collected, dried, ground, and further extracted by hydrodistillation to yield EO1, EO2 and EO3 respectively. Gas chromatography-mass spectroscopy was employed to identify existing chemical compounds in all samples. Their antioxidant activities were screened through DPPH (2,2-diphenyl-1-picrylhydrazyl) scavenging assay in addition to the FRAP (ferric reducing antioxidant power) assay. The anti-proliferative effects were evaluated on two different breast cancer cell lines, MCF-7 and MDA-MB-231, and compared to a normal human breast cell line MCF-10A, using MTT (3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium) assay. The three EOs showed notable antioxidant potential attributed to the active phytochemical compounds. Results were supported by positive correlation between the antioxidant activity and the total phenolic and flavonoid content. Most notably, EO1 (from white flowers) exhibited a remarkable dose-dependent anti-proliferative effect in both breast cancer cell lines. Marked by a sharp reduction in cell proliferation after only 24 hours of treatment, EO1 reflects its potent role as anti-cancer agent. We suggest that this highly selective activity is associated with the presence of bicyclogermacrene and epi-bicyclosesquiphellandrene in its chemical composition.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"209048f590217025e95abba75c0cd2557d07f3549dcbdc9011015d2bd668aaa5","category":"Interdisciplinary"}