{"title":"เจาะลึกโครงการ SKILLKAMP จาก KBank แหล่งเพิ่มทักษะ สร้างโอกาสใหม่ในโลกยุคดิจิทัล","link":"https://www.blognone.com/node/134462","date":1687433400000,"content":"<div><div><div><p>เรื่องของ Digital Transformation เป็นสิ่งที่องค์กรถูกบังคับให้ต้องทำอย่างหลีกเลี่ยงไม่ได้ ซึ่งองค์ประกอบสำคัญที่หลายองค์กรมองข้ามคือ “คน” ที่ต้องเป็นตัวขับเคลื่อนการทำ Digital Transformation ให้เกิดขึ้นจริง เรียกว่า คนต้องลงมือทำเพื่อให้องค์กรเปลี่ยนแปลง ดังนั้นเรื่องที่สำคัญยิ่งกว่า จึงอยู่ที่ความพร้อมของคนในองค์กร</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/yPdi9JJ.jpg\" /></p>\n<p>ประเด็นสำคัญจึงอยู่ที่ว่า คนในองค์กรมีความรู้ความเข้าใจเพียงพอหรือไม่ และคนนอกองค์กรที่กำลังหางาน หรือคนที่กำลังจะจบเพื่อเข้าสู่ตลาดงาน มีความพร้อมมากน้อยแค่ไหน</p>\n<p><strong>ทักษะดิจิทัลและเทคโนโลยี สร้างมูลค่าเพิ่มทางเศรษฐกิจ</strong></p>\n<p><strong>พิพิธ เอนกนิธิ</strong> กรรมการผู้จัดการ ธนาคารกสิกรไทย บอกว่า รายงาน The Future of Jobs โดย จาก World Economic Forum ระบุว่า ก่อนจะถึงปี 2568 พนักงานกว่า 50% ทั่วโลกจะเป็นจะต้องมีการพัฒนาทักษะใหม่ (Reskill) เพื่อปรับตัวให้สอดคล้องกับเทคโนโลยีที่จะเข้ามามีบทบาทในอนาคต</p>\n<p>ขณะที่ข้อมูลจาก Amazon Web Service ระบุว่า 90% ขององค์กรในไทย ต้องการบุคลากรที่มีทักษะด้านดิจิทัล และ 93% ของบุคลากรในไทยที่สำเร็จการฝึกอบรมทักษะด้านดิจิทัลมีโอกาสในการเลื่อนตำแหน่งที่เพิ่มขึ้น นอกจากนี้พบว่าแรงงานที่ใช้ทักษะดิจิทัลในไทยสามารถสร้างรายได้มากกว่า 1 ล้านล้านบาท</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/VjSpZJ5.jpg\" /></p>\n<p>นั่นกลายเป็นจุดเริ่มต้นของโครงการ SKILLKAMP เพื่อสนับสนุนกลุ่มเป้าหมาย คือ คนทำงานรุ่นใหม่ทั้งที่เรียนและทำงานในสายดิจิทัลและเทคโนโลยีโดยตรง รวมถึงคนที่ไม่ได้เรียนหรือทำงานในสายนี้ แต่มีความสนใจและต้องการพัฒนาตนเองเพื่อสร้างโอกาสเติบโตในวิชาชีพ</p>\n<p>กล่าวได้ว่า นี่คือโครงการที่จะเป็นโอกาสให้กับทุกคนที่สนใจในอาชีพสายดิจิทัล ได้มีโอกาสเข้าถึง Business Case ของจริงจากบริษัทชั้นนำที่เข้ามาร่วมเป็นพันธมิตร ได้คิดและลงมือทำจริง เพื่อสร้างประสบการณ์ตรงที่หาไม่ได้ที่ไหน และความพิเศษคือ มี Mentor หรือผู้เชี่ยวชาญตัวจริง มาให้คำปรึกษาในระหว่างร่วมโครงการ เรียกได้ว่าเป็นการเปิดโอกาสให้คนได้แสดงความสามารถอย่างเต็มที่</p>\n<p>โดย KBank ได้ร่วมมือกับ แพลตฟอร์ม SEEN จาก BASE Playhouse สตาร์ทอัพที่เชี่ยวชาญด้านการออกแบบกระบวนการเรียนรู้ พร้อมร่วมมือกับพันธมิตรองค์กรธุรกิจชั้นนำ ได้แก่ แอสเซนด์ (Ascend) กสิกร ไลน์ (KASIKORN Line) ไรส์ (Rise) สตอรี่ล็อก (Storylog) และ ไทยเบฟเวอเรจ (ThaiBev) จัดหลักสูตรที่เน้นพัฒนาทักษะด้านดิจิทัลใน 5 วิชาชีพซึ่งเป็นที่ต้องการในตลาดแรงงาน ได้แก่ 1) Business Analyst 2) Data Analytics and Visualization 3) Front-End Developer 4) Performance Marketing 5) Web Developer</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/PpsEdCX.jpg\" /></p>\n<p><strong>เมธวิน ปิติพรวิวัฒน์</strong> ประธานคณะกรรมการบริหาร และผู้ร่วมก่อตั้ง BASE Playhouse กล่าวว่า ทาง BASE Playhouse และทางธนาคารกสิกรไทยใช้จุดแข็งของทั้งสองฝ่ายในการพัฒนาโครงการนี้ให้เหมาะสมกับคนรุ่นใหม่มากที่สุด โดยธนาคารฯ เป็นพันธมิตรกับบริษัทชั้นนำและมีช่องทางกระจายข้อมูลที่เป็นประโยชน์ให้แก่คนรุ่นใหม่ ในขณะที่ BASE Playhouse มีแพลตฟอร์ม SEEN ที่ถูกสร้าง จากความเชื่อที่ว่า การเรียนรู้ที่มีความหมาย เกิดจากผู้คนควรรู้ว่าตัวเองเด่นด้านใดและขาดทักษะอะไร เพื่อสร้างเส้นทางการเรียนรู้ที่เหมาะสมกับตัวเอง SEEN จึงเป็น แพลตฟอร์มวัดระดับความสามารถได้ชัดเจน ตรงจุด และมีความแม่นยำ</p>\n<p>จากงานวิจัยด้านการเรียนรู้ ครอบคลุมทั้ง Hard skill ที่ประเมินทักษะทางวิชาการและ Soft skill ที่จำเป็นต่อการทำงานแต่ละสายอาชีพได้จริง พร้อมระบบป้องกันการทุจริต โครงการ SKILLKAMP จะเป็นพื้นที่สำหรับให้คนรุ่นใหม่ได้แสดงศักยภาพที่มีในสายงานนั้นได้อย่างเต็มที่</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/g57U4M6.jpg\" /></p>\n<p><strong>SKILLKAMP ลงมือทำ รับประสบการณ์ตรงจาก Business Case ของจริง</strong></p>\n<p><strong>วรภัทร ปราณีประชาชน</strong> ผู้จัดการโครงการ กล่าวว่า มีแรงงานที่จบการศึกษาใหม่จากทั่วประเทศ หรือแม้แต่คนที่ต้องการได้ประสบการณ์จริงจากงานสายดิจิทัล แต่อาจจะถูกมองข้ามไป เพราะขาดประสบการณ์ หรือไม่ได้จบการศึกษามาโดยตรง ทำให้พลาดโอกาสทั้งกับแรงงานที่จะได้เข้าสู่ตลาดงานที่กำลังขาดแคลน และองค์กรก็พลาดโอกาสที่จะได้คนมีความสามารถด้วย ดังนั้น SKILLKAMP จึงมาช่วยสร้างประสบการณ์และเตรียมความพร้อมให้คนที่สนใจจริงๆ</p>\n<p>สิ่งที่จะได้รับจากโครงการ SKILLKAMP เริ่มจาก จำลองการทำงานจริงเพื่อให้ผู้เข้าร่วมได้รับประสบการณ์ในสายงานที่สนใจ ได้โจทย์ที่เป็น Business Case ของจริง จากนั้นจะได้นำเสนอ Idea Business Case กับ Business Unit ของบริษัทพันธมิตร และรับ Feedback โดยตรงทันที ผู้ที่ผ่านเข้าสู่การทำ Final Pitching เพื่อนำเสนอผลงาน และจะได้เข้าฟัง Panel Discussion จากผู้บริหารด้วย เหนืออื่นใดงานนี้ยังเป็นการสร้างคอนเนคชั่นทั้งกับบริษัทชั้นนำและเพื่อนในสายงานดิจิทัล</p>\n<p>SKILLKAMP มีคนมาสมัครเข้าร่วมโครงการมากกว่า 2,800 คน ผ่านการทดสอบและคัดกรองจนเหลือ 400 คน จากนั้นให้ทำโจทย์ Business Case อย่างน้อยคนที่สมัครเข้ามาจะได้รู้ระดับของตัวเอง จะได้รู้ว่าต้องไปเรียนรู้เพิ่มเติมอีกมากน้อยแค่ไหน ส่วนคนที่ผ่านเข้ามาร่วมโครงการได้ ก็แสดงว่าเป็นคนที่มีความรู้ในระดับที่พร้อม เพื่อมาลงมือทำ รับประสบการณ์จริง โดยมีผู้ผ่านเข้ารอบสุดท้ายได้รับโอกาสให้นำเสนอโมเดลธุรกิจดิจิทัลกับบริษัทชั้นนำดังกล่าว 45 คน</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/XaR4HJS.jpg\" /></p>\n<p>เป้าหมายคือ คนที่ผ่านโครงการ SKILLKAMP จะเป็นคนที่พร้อมเป็นแรงงานในสายดิจิทัลที่ทำงานได้จริง ได้รับประสบการณ์พร้อมคำแนะนำในเบื้องต้น เป็นการสร้างคนให้พร้อมสำหรับองค์กรในระดับกลาง หรือระดับ SME ที่ต้องการคนสายดิจิทัลไปทำงานเพื่อยกระดับองค์กรสู่ Digital Transformation ได้</p>\n<p>นี่เป็นปีแรกของโครงการ SKILLKAMP ช่วยจุดประกายให้กับหลายๆ คนได้เป็นอย่างดี และทำให้พบว่า คนที่สนใจสายงานดิจิทัลจากทั่วประเทศ ยังมีอีกไม่น้อย และมี “เพชรในตม” หรือคนที่มีความสามารถระดับสูงแต่ไม่ได้รับโอกาส เพราะอาจถูกมองข้ามไปเนื่องจากก่อนหน้านี้ยังไม่มีประสบการณ์ นั่นแปลว่าจากนี้ตลาดแรงงานสายดิจิทัลจะใหญ่ขึ้นทันที มีแรงงานพร้อมทำงานมากขึ้น</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/HucTEh2.jpg\" /></p>\n<p><strong>ก้าวต่อไปของ SKILLKAMP แหล่งรวมความรู้ด้านดิจิทัล</strong></p>\n<p>โครงการ SKILLKAMP ปีแรกจบไปแล้ว แต่การค้นหาและพัฒนาคนสายดิจิทัลยังคงดำเนินต่อไป และเพื่อเป็นการเสริมศักยภาพด้านดิจิทัลให้กับคนทำงานรุ่นใหม่ ได้เปิดเว็บไซต์ <a href=\"http://www.skillkamp.com\">www.skillkamp.com</a> รวม 250 คอร์สเรียนจากผู้พัฒนาหลักสูตรออนไลน์ชั้นนำ 14 แห่ง ได้แก่ 9Expert, BorntoDev, ConicleX, DataRockie, FutureSkill, HACKaTHAILAND, Klasssi, LINE Developers Thailand, PrasertCBS, SkillLane, Thai MOOC, ThaiWinner, WeStride และ Zinglecode</p>\n<p>นี่คือแหล่งรวมความรู้ให้กับผู้ที่สนใจ เพราะที่ผ่านมา ความรู้มีจากหลากหลายแหล่งมาก แต่ไม่รู้ว่าที่ไหนมีคุณภาพและมีความถูกต้อง SKILLKAMP จะรวบรวมและคัดกรองมาให้ โดยเน้นที่เป็นความรู้เบื้องต้นก่อน ทั้งหมดเพื่อสร้างหลักสูตรการเรียนรู้ ให้กับคนที่สนใจได้เรียนรู้และพัฒนาตัวเองอย่างถูกต้อง เพื่อได้รู้ว่าอะไรคือทักษะที่สำคัญและจำเป็น</p>\n<p>SKILLKAMP เป็นโครงการที่ช่วยให้ผู้ประกอบการโดยเฉพาะธุรกิจขนาดกลางและขนาดเล็กที่มองหาบุคลากรด้านเทคโนโลยีเพื่อการพัฒนาธุรกิจหรือต้องการทำ Digital Transformation สามารถเข้าถึงบุคลากรที่มีคุณภาพและมีคุณสมบัติที่ตรงกับความต้องการ เพื่อเป็นกำลังสำคัญที่ช่วยให้ธุรกิจเติบโตต่อไป และร่วมเป็นกำลังในการขับเคลื่อนเศรษฐกิจของประเทศไทยในโลกธุรกิจแห่งอนาคต</p>\n<p><strong>จัดเต็มความรู้ บททดสอบ ประสบการณ์ที่แปลกใหม่ เพื่อคนดิจิทัล</strong></p>\n<p><strong>ธรรพ์ณธร จักคำบาง (ฟอร์ม)</strong> เพิ่งสำเร็จการศึกษาจากคณะการจัดการ ธุรกิจการบิน มหาวิทยาลัยแม่ฟ้าหลวง กล่าวว่า เพิ่งเรียนจบและมีความสนใจงานด้าน Marketing แต่ยังไม่มีความรู้และประสบการณ์ เมื่อเห็นโครงการ SKILLKAMP เลยลองสมัครดู การที่ได้เข้ามาทำแบบทดสอบและเข้าสู่รอบ Business Case ทำให้ได้เห็นมุมมองงานด้าน Marketing มากยิ่งขึ้น อีกทั้งการนำเสนอผลงานต่อกรรมการทำให้ได้รับคำแนะนำที่ดี ข้อชี้แนะในประเด็นต่างๆ ที่ตนอาจยังนึกไม่ถึง ทำให้เติมเต็มความรู้และประสบการณ์ได้เป็นอย่างดี</p>\n<p><strong>กัณติกรณ์ สรสุริยวงษ์ (เพชร)</strong> นักศึกษาชั้นปีที่ 1 ปวส. สาขานักพัฒนาซอฟต์แวร์คอมพิวเตอร์ กล่าวว่า SKILLKAMP เป็นโครงการที่เปิดกว้าง ไม่จำกัดว่าจะมีความรู้หรือประสบการณ์มากน้อยเพียงใดก็สามารถสมัครได้ อีกทั้งบริษัทร่วมในโครงการก็เป็นบริษัทที่น่าสนใจในสายงานเลยสมัครเข้ามา เมื่อผ่านเข้ารอบ Business Case มาก็มีเมนเทอร์ที่เป็นผู้เชี่ยวชาญให้คำปรึกษาเป็นอย่างดี ถ้ามีโครงการนี้เกิดขึ้นก็อยากจะชวนเพื่อนๆ ที่สนใจสายงานเหล่านี้มาสมัคร เพราะเป็นโอกาสที่ดีที่เราจะได้ลองทำจริง ได้พัฒนาตัวเอง ได้ประสบการณ์ที่จะได้เข้าไปสู่สายงานเทคโนโลยีได้</p>\n<p><strong>ปวีณ์นุช ฐานานุศักดิ์ (ยู้ว)</strong> นักศึกษาชั้นปีที่ 4 คณะพาณิชศาสตร์และการบัญชี จุฬาลงกรณ์มหาวิทยาลัย บอกว่า เข้าร่วมโครงการ SKILLKAMP เพราะสนใจและต้องการพัฒนาทักษะด้าน Performance Marketing ชอบโปรแกรมที่ทาง SKILLKAMP จัดให้ เพราะมีความกระชับ ครบ และจบใน 1 เดือน ได้ลองทำงานคนเดียว แบบมีเวลาจำกัด รวมถึงได้รับคอมเมนต์จากเมนเทอร์ที่มาให้คำแนะนำ ทำให้สามารถนำไปปรับและใช้ในงานต่อไปได้ รู้สึกท้าทายที่ได้ทดลองและได้พัฒนาทักษะที่ตัวเองชอบ</p>\n<p><strong>ณัฐณิชา ธนปุณยนันท์ (ไอโกะ)</strong> นักศึกษาชั้นปีที่ 3 คณะเศรษฐศาสตร์ มหาวิทยาลัยธรรมศาตร์ บอกว่า ตอนนี้กำลังหาที่ฝึกงานว่าจะเลือกฝึกอะไรดี และเห็นข่าวว่าโครงการ SKILLKAMP เปิดรับสมัครผู้ที่มีความสนใจอยากทำในสายดิจิทัล จึงได้เข้ามาลองดู ชอบในความแปลกใหม่มาก เพราะได้ทำโจทย์ธุรกิจ Business Case เป็นครั้งแรก ซึ่งเป็นสิ่งที่ท้าทาย และยาก แต่ในขณะเดียวกันก็ได้รับประสบการณ์ ได้ทำอะไรใหม่ๆ</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/si5Ws5T.jpg\" /></p>\n<p><strong>บทสรุปส่งท้าย SKILLKAMP โอกาสของแรงงานดิจิทัล</strong></p>\n<p>การทำ Digital Transformation คือหัวใจสำคัญขององค์กรยุคใหม่ สำหรับองค์กรขนาดกลางและเล็ก ถือเป็นโจทย์ที่ผ่านไปไม่ง่าย ปัจจัยสำคัญ คือต้องมีบุคลากรที่มีทักษะดิจิทัล ที่พร้อมจะช่วยยกระดับองค์กร และ SKILLKAMP คือหนึ่งในโครงการที่เป็นโอกาสให้กับแรงงานดิจิทัลได้ทดสอบตัวเอง เรียนรู้และลงมือทำเพื่อรับประสบการณ์จริง เป็นโครงการจาก KBank ที่ยกระดับแรงงานไทยได้อย่างชัดเจน</p>\n<p>นอกเหนือจากโครงการสร้างเสริมประสบการณ์ด้านดิจิทัลให้ผู้ที่สนใจผ่านทาง Business case ข้างต้น KBank ยังเปิดเว็บไซต์ <a href=\"https://www.skillkamp.com/\">https://www.skillkamp.com</a>  ที่เป็นแหล่งรวบรวมคอร์สออนไลน์หลักสูตรด้านดิจิทัลกว่า 250 คอร์ส จาก 14 แพลตฟอร์ม ได้แก่ 9Expert, BorntoDev, ConicleX, DataRockie, FutureSkill, HACKaTHAILAND, Klasssi, LINE Developers Thailand, PrasertCBS, SkillLane, Thai MOOC, ThaiWinner, WeStride และ Zinglecode ด้วย 4 ไฮไลท์ฟีเจอร์พิเศษที่สำคัญ ที่จะช่วยประหยัดเวลา และทำให้การค้นหาตรงตามความต้องการ คือ</p>\n<ol>\n<li>Curated course aggregator รวบรวม และคัดเลือกหลักสูตรคุณภาพด้านดิจิทัล และเทคโนโลยี เป็นที่ต้องการของตลาด</li>\n<li>Suggestion learning path แนะนำคอร์สเรียนจากหลากหลายแพลตฟอร์ม เพื่อเสนอหลักสูตรการเรียนรู้ (Learning path) สู่การเริ่มต้นในสายอาชีพ Data analyst Database admin Front-End Web Developer และ Digital Marketer ที่ถูกต้อง เหมาะสม รวดเร็ว และดีที่สุด เพื่อการเตรียมตัวให้บรรลุเป้าหมายอาชีพที่ต้องการ</li>\n<li>Blog review บทความพิเศษ จากผู้มีประสบการณ์ในสายงานจริง ที่จะมาแชร์ประสบการณ์การทำงาน การย้ายสายงาน เพื่อเป็นแนวทางในการศึกษา และค้นหาความสนใจของตัวเองได้อย่างตรงความต้องการ</li>\n<li>Mentor feature เมนเทอร์ที่คอยให้คำปรึกษาเจาะลึกของแต่ละหลักสูตร ไขข้อสงสัย และให้คำแนะนำกับผู้เรียน</li>\n</ol>\n<p>พิเศษ! เมื่อลงทะเบียนแคมเปญหลักสูตรการเรียนรู้จาก SKILLKAMP ซึ่งมีให้เลือกหลากหลายทั้ง Front-End Developer, Data Analyst, Database Admin และ Digital Marketer โดยเรียนจบภายใน 1 มิถุนายน ถึง 31 สิงหาคมนี้ สามารถเลือกรับ Voucher เรียนออนไลน์แบบบุฟเฟ่ต์บนเว็บไซต์ FutureSkill หรือ e-voucher starbucks มูลค่าสูงสุด 750 บาท อ่านรายละเอียดแล้วสมัครเลยที่ <a href=\"https://www.skillkamp.com/campaign\">https://www.skillkamp.com/campaign</a></p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/KGHTH1m.png\" /></p>\n<p>(*เงื่อนไขเป็นไปตามที่ธนาคารกำหนด)</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/kasikorn-bank\">Kasikorn Bank</a></div><div><a href=\"/topics/skillkamp\">skillkamp</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2092560587d24f387d98a2d5d181dc1b5901076d0f44e8df642fd885a063f79f","category":"Thai"}