{"title":"Apple Allegedly Buys Ads for Subscription-Based Apps to Collect More Commission [Updated]","link":"https://www.macrumors.com/2021/11/15/apple-buys-ads-to-collect-commission/","date":1636991246000,"content":"<strong>Update:</strong> Apple has now said that the suggestion that it \"secretly\" or \"quietly\" buys ads for third-party apps is a mischaracterization. The company says that it regularly communicates with developers about the ads it runs on their behalf. <a href=\"https://www.macrumors.com/2021/11/15/apple-defends-its-ads-for-third-party-apps/\">See Apple's full clarification</a> for more information.\r\n<br />\r\n<hr />\r\n<br />\r\nApple allegedly buys Google ads for popular subscription-based third-party apps to bolster its collection of commission on in-app purchases, according to an article by <em><a href=\"https://www.forbes.com/sites/johnkoetsier/2021/11/12/apple-quietly-buying-ads-via-google-for-high-value-subscription-apps-to-capture-app-publisher-revenue/?sh=565fda81b523\">Forbes</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/app-store-blue-banner.jpg\" />\r\n<br />\r\nApple has purportedly been buying Google ads for subscription-based third-party apps, including HBO, Masterclass, Babbel, Tinder, Plenty of Fish, and Bumble, for at least two years. A marketer speaking to <em>Forbes</em> suggested that many of the brands Apple appears to be advertising for have been assertive about attempting to circumvent <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> policies. The ads are said to be placed without the developer's consent and Google apparently refuses to remove them.\r\n<br />\r\n\r\n<br />\r\nThe ads do not disclose that they are paid for by Apple, but redirect to the ‌App Store‌ rather than subscription sign-up pages on the brand's website. One source, speaking to <em>Forbes</em>, explained: <blockquote>Apple is trying maximize the money they're making by driving in-app purchases that people buy through the Apple Store. Apple has figured out that they can make more money off these developers if they push people to the App Store to purchase there versus a web flow.</blockquote>\r\n<br />\r\n\r\n<br />\r\nAds encouraging users to subscribe to a service usually lead to pages that encourage users to sign up online, bypassing Apple's 15 or 30 percent in-app purchase fee and allowing the business to collect all of the subscription's revenue.\r\n<br />\r\n\r\n<br />\r\nGoogle claims that it is not responsible for who buys ads on its platform. Google's ad policies allow companies to use another company's trademark if \"primarily dedicated to selling (or clearly facilitating the sale of) products or services, components, replacement parts, or compatible products or services corresponding to the trademark.\"\r\n<br />\r\n\r\n<br />\r\nThere are apparently indications that Apple is hiring a single agency to place the ads since they each have \"similar tracking links with near-identical parameters.\"\r\n<br />\r\n\r\n<br />\r\n<em>Forbes</em> speculates that Apple's unsolicited ads are potentially losing some third-party apps millions of dollars in revenue and resulting in high customer acquisition and advertising costs for their own campaigns, since prices rise when multiple parties bid on the same ad slots. The practice amounts to \"a form of ad arbitrage,\" according to <em>Forbes</em>.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/forbes-com/\">forbes.com</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/11/15/apple-buys-ads-to-collect-commission/\">Apple Allegedly Buys Ads for Subscription-Based Apps to Collect More Commission [Updated]</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-allegedly-buys-ads-for-subscription-based-apps-to-collect-more-commission-updated.2323474/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=oybypdgENmc:DF9q99YGZdw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=oybypdgENmc:DF9q99YGZdw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"209ad03b457f8d7bba5b32c5df5ea230ff3aeef1b1102c77c1f6de77ffc7f78c","category":"Apple"}