{"title":"From general rejection to individual normalization: Ambivalences in discourses on intimate partner violence by young Spaniards","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310745","date":1727186400000,"content":"<p>by Ismael Ocampo Bernasconi, Eva Espinar-Ruiz, Daniel La Parra-Casado, Carmen Vives-Cases</p>\r\n\r\nViolence against women continues to be a serious social and public health problem all over the world, despite its high level of social condemnation. The aim of this study is to include the concept of ambivalence in order to analyze the perceptions that young people have of intimate partner violence (IPV). We conducted a qualitative study based on 20 semi-structured interviews with young Spaniards (men and women) who were segmented according to involvement or not in activism against IPV. A critical discourse analysis was performed based on situational, attitudinal and temporal ambivalences. The results show the presence of ambivalent discourses that express a high level of condemnation towards IPV and, at the same time, justify certain violent practices when considering the situational framework. This leads to discursive contradictions when considering jealousy in a couple’s relationship, the responsibilities of violence that women suffer and the social origin of IPV. These ambivalences are influenced by the social context, as those involved in activism against IPV express a more coherent discourse that does not justify or accept any kind of violence. Nonetheless, non-activists represent ambivalences in their attitudes towards IPV studied in this research. The results suggest the need to reflect on the strategies used with young people to eradicate IPV by considering the ambivalent nature of attitudes.","author":"Ismael Ocampo Bernasconi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"209ba86fefb6456a399459e6711e55c7d4ddd74cc54897453981b54595f5ecf1","category":"Interdisciplinary"}