{"title":"End of an era: CD Baby stops distributing artists’ CDs, vinyl, and other goods","link":"https://arstechnica.com/?p=1941193","date":1684845984000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/cdbaby2-800x473.jpg\" alt=\"Artist whose head has a CD transposed over it\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/cdbaby2.jpg\">Enlarge</a> <span>/</span> CD Baby no longer sells or distributes CDs but will help an artist figure out <a href=\"https://diymusician.cdbaby.com/music-career/how-to-price-your-cds/\">how much to charge for their discs</a>. (credit: CD Baby)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>CD Baby, an online indie music pioneer and the go-to place for indie music artists looking to get their music into storefronts, has told its customers that it will no longer distribute physical goods, like CDs, after June 22, 2023.</p>\n<p>As seen <a href=\"https://twitter.com/joeymikes/status/1660952194319785984\">on Twitter</a>, <a href=\"https://rezonatz.com/2023/05/22/cd-baby-announced-today-that-they-have-stopped-distributing-physical-products/\">on music blogs</a>, and in its <a href=\"https://support.cdbaby.com/hc/en-us/articles/115002355206\">Help section</a>, the Portland, Oregon-based distributor of independent music will continue to help artists get their music onto the digital stores of Spotify, Amazon, and Apple. But as of June 22, CD Baby will no longer warehouse, ship, or distribute CDs, vinyl, cassette tapes, or DVDs to Amazon or music wholesaler Alliance. Once artists with inventory in CD Baby's warehouse receive notice, they'll have 60 days to decide whether to get their inventory shipped back to them or have it recycled.</p>\n<p>Like other services that date back to the late-1990s dot-com boom, CD Baby has gradually shifted away from its namesake offering. Launched from Woodstock, New York, in 1998 by Derek Sivers, it was one of the first web-based CD stores that focused on selling independent artists' work. By 2009, according to the company, physical sales through its store accounted for only 27 percent of the revenue it paid out to artists.</p></div><p><a href=\"https://arstechnica.com/?p=1941193#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1941193&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"20a179dd5a6ef9858e437f811ed788b7885ae090c61be6104dd32bb38c9e364d","category":"Tech"}