{"title":"334 Metagenomic- and culture-based characterization of the ocular microbiome in cattle with infectious bovine keratoconjunctivitis","link":"https://academic.oup.com/jas/article/102/Supplement_3/63/7757283?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Pinkeye, clinically known as infectious bovine keratoconjunctivitis (IBK), is one of the most highly contagious diseases impacting cattle at all ages. Despite extensive use of antibiotics and vaccines targeting <span>Moraxella bovis</span>, the primary IBK pathogen, the incidence of pinkeye has been increasing in North American beef cow-calf operations. This highlights the incomplete understanding of the pathogenesis of this disease and the need for novel and alternative approaches to control IBK. The objectives of this study were to: 1) characterize the ocular microbiome of beef cattle with and without IBK using shotgun metagenomic sequencing; 2) investigate the genetic diversity of <span>M. bovis</span>, <span>Moraxella bovoculi</span>, and commensal ocular bacterial isolates; 3) evaluate whether selected ocular probiotic candidate strains inhibit Moraxella pathogen growth in the presence of the ocular microbiome in culture using qPCR. A total of 143 ocular swabs were collected from cattle with (n = 102) or without IBK (n = 42) and before antibiotic treatment from beef herds across North Dakota, USA. Fifty samples from IBK (n = 38) and healthy cattle (n = 12) were also subjected to shotgun metagenomic sequencing. Seven bacterial species were relatively more abundant (<span>P</span> &lt; 0.05) in the healthy cattle ocular microbiome including Bifidobacterium globosum, <span>Bacillus licheniformis</span>, Pasteurella multocida, <span>Ruminococcus</span> sp900316555, and <span>Ruminococcus</span> sp900100595. <span>Arthrobacter luteus</span> was the only bacterial species significantly associated with IBK-affected cattle. From the metagenomes, 37 high-quality dereplicated metagenome-assembled genomes (MAGs) were recovered, nearly a third of which were identified as <span>Mesomycoplasma bovoculi</span> (n = 10). <span>M. bovis</span> (n = 5) and <span>M. bovoculi</span> (n = 13) were also isolated from the ocular swabs of both healthy and IBK-affected cattle. These isolates represented 9 <span>M. bovoculi</span> and 5 <span>M. bovis</span> strains (average nucleotide identity &lt; 99.99%). We also isolated and sequenced several potentially beneficial bacterial species from healthy cattle including Bacillus pumilus, <span>Lactiplantibacillus plantarum</span>, <span>Lentilactobacillus buchneri</span>, <span>Levilactobacillus brevis</span>, and Weizmannia coagulans. Four of these probiotic candidates were also tested for their inhibitory effects against <span>M. bovoculi</span> in co-culture with the ocular <span>microbiome after 24 h incubation using qPCR. The B. pumilus, L. buchneri, L. plantarum, and W. coagulans</span> strains, as well as a mixture of all four isolates, significantly reduced the growth of Moraxella. In summary, our results provide important information on the culturable and non-culturable fraction of the bovine ocular microbiome potentially associated with IBK and suggest that certain bacterial species in the eye may inhibit the growth of <span>Moraxella spp</span>.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"20a137d6a03ae0a60b7d2145ebbc61ba6519b1f31f06af448a405e6a860c4560","category":"Environment"}