{"title":"Age-dependent hypopharyngeal gland size and protein content of stingless bee workers, <i>Tetragonula pagdeni</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308950","date":1723816800000,"content":"<p>by Lars Straub, Tanatip Sittisorn, Jinatchaya Butdee, Woranika Promsart, Athitta Rueangwong, Domenic Camenzind, Jakkrawut Maitip</p>\r\n\r\nEusocial insects, such as stingless bees (Meliponini), depend on division of labour, overlapping generations, and collaborative brood care to ensure the functionality and success of their colony. Female workers transition through a range of age-specific tasks during their lifespan (i.e., age-polyethism) and play a central role in the success of a colony. These age-specific tasks (e.g., brood care or foraging) often closely coincide with key physiological changes necessary to ensure optimal performance. However, our understanding of how nutrition, age, and polyethism may affect the development of such physiological traits in stingless bees remains limited. Here we show that pollen consumption and age-polyethism govern hypopharyngeal gland (HPG) acini size and protein content in <i>Tetragonula pagdeni</i>. By conducting a controlled laboratory experiment we monitored the effect of pollen consumption on worker bee survival as well as assessed how a pollen diet and age affected their HPG acini width and protein content. Further, we sampled nurses and foragers from field colonies to measure the effect of age-polyethism on HPG acini width. We found that pollen consumption enhanced survival and led to increased HPG acini width and protein content and that HPG acini were as expected largest in nurse bees. Our findings highlight the beneficial effects of an adequate diet for physiological development and health in stingless bees and reveal that age-polyethism is the key factor governing HPG size in worker bees. As HPGs are imperative for collaborative brood care—an essential component of eusociality—the data provide a foundation for future studies to investigate the impact of potential environmental stressors on a critical physiological trait in stingless bees which may serve as a proxy to understand the effects at the colony level.","author":"Lars Straub","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"20a70f319bf852c86e613ef5dfcd52d58c9dd36bc1c8148522bc66d8ced63f20","category":"Interdisciplinary"}