{"title":"Apple Lobbies Against 'Right to Repair' Bill Over Privacy Concerns of Third Party Repair Shops Accessing User Data","link":"https://www.macrumors.com/2021/03/30/apple-lobbies-against-right-to-repair-bill/","date":1617101095000,"content":"Apple, HP, and Honeywell are lobbying against a bill in the Nevada statehouse that would require electronic hardware manufacturers to provide device schematics, device parts, and instructions to third-party repair shops for device repairs, according to the <em><a href= \"https://apnews.com/article/legislature-nevada-coronavirus-pandemic-laws-5ade405a7befdf16e9f0107b7e142be3\">Associated Press</a></em>.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-independent-repair-program.jpg\" alt=\"\" width=\"1960\" height=\"1306\" class=\"aligncenter size-full wp-image-791329\" />\r\n<br/>\r\nThe bill being contemplated in Nevada is one of many bills that states across the US are considering to put into law. The global health crisis has placed a higher emphasis on work and learning from home, requiring increased reliance on laptops and tablets, which sometimes need repairs. \r\n<br/>\r\n\r\n<br/>\r\nSpecifically, the bill would require Apple and others to directly provide independent third-party repair shops with the parts, instructions, and schematics to repair devices less than &#36;5,000. With that price threshold, most Apple products such as iPhones, iPads, Apple Watches, and many Macs would be subject to the bill.\r\n<br/>\r\n\r\n<br/>\r\nThe bill aims to remove the requirement for customers to go to authorized dealers for repairs by allowing them to use smaller independent repair shops as well. Apple has long faced pressure to expand accessibility to device parts and schematics, and it's <a href=\"https://www.macrumors.com/2019/04/30/apple-right-to-repair-consumer-harm/\">previously put up battles</a> to maintain its tight control over device repairs. \r\n<br/>\r\n\r\n<br/>\r\nCameron Demetre, the regional executive director of TechNet, a trading group representing Apple, HP, and Honeywell in committee hearings on the bill, says that his clients are concerned about the potential exposure that third-party repair shops will have to personal users' data when repairing devices. Demetre warns that opening up repair access and freedom could lead to \"unintended consequences.\"\r\n<br/>\r\n<blockquote>Cameron Demetre, the organization's regional executive director, said manufacturers worried about \"unvetted third parties\" having access to the personal information stored in consumer electronics. He said the bill had \"the potential for troubling unintended consequences, including serious adverse security, privacy, and safety risks.\" </blockquote>In a bid to ease the pressure, in 2019, Apple <a href=\"https://www.macrumors.com/2019/08/29/apple-independent-repair-program/\">introduced</a> its Independent Repair Provider program, which provides repair shops with direct access to device parts, tools, manuals, and diagnostic information for out-of-warranty devices. The program initially started in the United States and Canada, but yesterday Apple announced it would be <a href=\"https://www.macrumors.com/2021/03/29/apple-expands-independent-repair-program-worldwide/\">expanding the program internationally</a>.\r\n<br/>\r\n\r\n<br/>\r\nThe significant expansion of the program opens the door for thousands of repair shops to obtain direct resources from Apple instead of relying on other providers, which can sometimes provide non-genuine parts or incorrect device information. Given the close timing of the Nevada bill and the expansion of the independent repair provider program, it's unclear whether the international expansion will have an impact on state legislature stances.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/privacy/\">privacy</a>, <a href=\"https://www.macrumors.com/guide/right-to-repair/\">Right to Repair</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/30/apple-lobbies-against-right-to-repair-bill/\">Apple Lobbies Against &#039;Right to Repair&#039; Bill Over Privacy Concerns of Third Party Repair Shops Accessing User Data</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-lobbies-against-right-to-repair-bill-over-privacy-concerns-of-third-party-repair-shops-accessing-user-data.2290065/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=IHiLSPtiJ-8:yrFAjZwV2YE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=IHiLSPtiJ-8:yrFAjZwV2YE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/IHiLSPtiJ-8\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"20b33459863c2fca1dc6388ecd4f2c55a19b212b7427cc84116481ebb2d35624","category":"Apple"}