{"title":"Bloomberg: Apple May Launch Rugged Apple Watch Model for Extreme Sports as Soon as This Year","link":"https://www.macrumors.com/2021/03/26/apple-launch-apple-watch-extreme-sports-2021/","date":1616754288000,"content":"Apple is weighing up the possibility of launching an Apple Watch with a rugged casing that's made for use in extreme environments, according to a new report from <em>Bloomberg</em>'s Mark Gurman.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-watch-6s-202009.jpeg\" alt=\"\" width=\"1200\" height=\"630\" class=\"aligncenter size-full wp-image-786980\" />\r\n<br/>\r\nFrom the <a href=\"https://www.bloomberg.com/news/articles/2021-03-26/apple-considers-launching-rugged-watch-for-extreme-sports?srnd=technology-vp\">report</a>:\r\n<br/>\r\n<blockquote>Apple Inc. is considering launching an Apple Watch with a rugged casing aimed at athletes, hikers and others who use the device in more extreme environments, according to people familiar with the matter.\r\n<br/>\r\n\r\n<br/>\r\nThe Cupertino, California-based technology giant has internally discussed introducing such a Watch variation later in 2021 or 2022 at the earliest, said the people, who asked not to be identified discussing private matters.</blockquote>As noted by Gurman, this isn't the first time Apple has considered a rugged smartwatch. The company mulled releasing a model to appeal to extreme sports athletes alongside the original Apple Watch, which launched in 2015. \r\n<br/>\r\n<blockquote>If Apple goes ahead this time, the rugged version would be an additional model similar to how Apple offers a lower-cost option called the <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a> and special editions co-branded with Nike Inc. and Hermes International. Sometimes dubbed the \"Explorer Edition\" inside Apple, the product would have the same functionality as a standard Apple Watch but with extra impact-resistance and protection in the vein of Casio's G-Shock watches.</blockquote>The latest Apple Watch models are water resistant to 50 meters, but Gurman suggests that Apple could make a new device more \"rugged\" by giving it a rubberized casing, making it more resistant to damage in extreme environments compared to the current lineup of aluminum, titanium, and stainless steel cases.\r\n<br/>\r\n\r\n<br/>\r\nDespite actively considering such a model, Gurman includes the usual caveat about rumored future products by noting that his sources say it could be ultimately canceled or delayed. \r\n<br/>\r\n\r\n<br/>\r\nApple is also working on new swim tracking features for the Apple Watch, according to the report, although no additional details were given. \r\n<br/>\r\n\r\n<br/>\r\nApple typically launches new Apple Watch models in September, but rumors are thin on the ground when it comes to a Series 7 model. According to Korean site <em>ETNews</em>, Apple will add <a href=\"https://www.macrumors.com/2021/01/25/apple-watch-series-7-blood-glucose-monitoring/\">blood glucose monitoring capabilities</a> to the Apple Watch Series 7 using a non-invasive optical sensor. \r\n<br/>\r\n\r\n<br/>\r\nOther rumors indicate a future version of the Apple Watch may adopt <a href=\"https://www.macrumors.com/2018/06/08/apple-watch-solid-state-haptic-buttons/\">solid state buttons</a> that don't physically click but instead provide haptic feedback to users when the buttons are touched, but it's not clear when this is coming. <div class=\"linkback\">Related Roundups: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a>, <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a></div><div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">bloomberg.com</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><div class=\"linkback\">Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Neutral)</a>, <a href=\"https://buyersguide.macrumors.com/#Apple_Watch_SE\">Apple Watch SE (Buy Now)</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/26/apple-launch-apple-watch-extreme-sports-2021/\">Bloomberg: Apple May Launch Rugged Apple Watch Model for Extreme Sports as Soon as This Year</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/bloomberg-apple-may-launch-rugged-apple-watch-model-for-extreme-sports-as-soon-as-this-year.2289668/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=XXkbu4BH_9M:-iXAv1dlw7Q:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=XXkbu4BH_9M:-iXAv1dlw7Q:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/XXkbu4BH_9M\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"20be6d8a0bd294d8b9cffa900f9f87ba64f83320629f4e2ce42ef8b5bfcdf4a0","category":"Apple"}