{"title":"Predicting the Dry Season Habitat Occupancy of African Savannah Elephant Using Vegetation Indices and Modelling Landscape Variability in a Mesic Protected Area","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13318?af=R","date":1726729200000,"content":"<h2>ABSTRACT</h2>\n<p>African savannah elephants (<i>Loxodonta africana</i>) are key ecosystem engineers that migrate over large spatiotemporal scales foraging as they require copious amounts of food and water across habitable landscapes. Therefore a need to understand movement patterns arises in relation to vegetation type and landscape variability, moreso in forage depauparate arid areas such as Gonarezhou National Park (GNP) in Zimbabwe. The objectives of this study were to: (i) assess the performance of vegetation indices in modelling the distribution of African savannah elephants, and (ii) model future landscape variability in Gonarezhou National Park (GNP) in Zimbabwe. Maximum entropy (MaxEnt) algorithm was used to explore the relationship between vegetation indices and distribution of African savannah elephants in the GNP. The Soil Adjusted Vegetation Index (SAVI) performs better relative to other indices in modelling the distribution of African savannah elephants across all habitat types in the GNP. Cellular automata-Artificial Neural Network (CA-ANN) showed a significant future decrease (Kruskal Anova; <i>p</i> &lt; 0.05) in landscape suitable to sustain large populations of African savannah elephants in the GNP by the year 2083. Future remote sensing reveals directional insights into the future consequences of current landscape management for African savannah elephant conservation which is a crucial in the sustainability of climate threatened arid protected areas such as the GNP.</p>\n<h2>Abstrait</h2>\n<p>Les éléphants de savane africaine (<i>Loxodonta africana</i>) sont des ingénieurs clés de l’écosystème, qui migrent sur de grandes échelles spatio-temporelles pour se nourrir, car ils ont besoin de grandes quantités de nourriture et d’eau à travers des paysages habitables. Il est donc nécessaire de comprendre les schémas de déplacement en fonction du type de végétation et de la variabilité du paysage, en particulier dans les zones arides pauvres en fourrage, telles que le parc national de Gonarezhou (GNP) au Zimbabwe. Les objectifs de cette étude étaient les suivants : (i) évaluer la performance des indices de végétation dans la modélisation de la répartition des éléphants de savane africaine, et (ii) modéliser la variabilité future du paysage dans le parc national de Gonarezhou (GNP) au Zimbabwe. L’algorithme d’entropie maximale (MaxEnt) a été utilisé pour analyser la relation entre les indices de végétation et la répartition des éléphants de savane africaine dans le GNP. L’indice de végétation ajusté au sol (SAVI) est plus performant que d’autres indices dans la modélisation de la répartition des éléphants de savane africaine dans tous les types d’habitats du GNP. Le réseau de neurones artificiels d’automates cellulaires (CA-ANN) a montré une diminution future considérable (Kruskal Anova ; <i>p</i> &lt; 0,05) du paysage propice au maintien de grandes populations d’éléphants de savane africaine dans le GNP d’ici 2083. La télédétection future révèle des perspectives directionnelles sur les conséquences futures de la gestion actuelle du paysage pour la conservation des éléphants de savane africaine, ce qui est crucial pour la durabilité des zones protégées arides menacées par le climat, comme le GNP.</p>","author":"Nobert Tafadzwa Mukomberanwa, \nPhillip Taru, \nBeaven Utete, \nHonest Komborero Madamombe","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"20c00082890b09dac19e73069d38cd6fd6e7dc13dd3cb693eb9fb681534218ac","category":"Environment"}