{"title":"Porsche Previews New CarPlay Interface","link":"https://www.motortrend.com/news/2024-porsche-cayenne-suv-infotainment-preview-apple-carplay/","date":1693248316000,"content":"\n<p>Remember <em>last</em> year at WWDC, when Apple previewed the next generation of CarPlay, with support for screens that span the entire dashboard? Here’s a MotorTrend report on the 2024 Porsche Cayenne SUV. <a href=\"https://www.motortrend.com/news/2024-porsche-cayenne-suv-infotainment-preview-apple-carplay?slide=2\">Slide 2</a> shows a CarPlay interface that spans the entire dashboard.</p>\n\n<p><strong>Update 1:</strong> A few readers have chimed in to suggest this is <em>not</em> next-gen CarPlay 2, it’s just extended use of CarPlay 1. It’s definitely improved, but it might not be the new stuff Apple previewed last June. My question: If this is <em>not</em> CarPlay 2, when, if ever, will we actually see a carmaker announce CarPlay 2 support?</p>\n\n<p><strong>Update 2:</strong> <a href=\"https://9to5mac.com/2023/07/28/hands-on-porsche-new-carplay-app/\">Here’s a hands-on report by Jameson Dow</a> for 9to5Mac from last month:</p>\n\n<blockquote>\n  <p>We got a chance to test out some of its features on a 2024\nCayenne, and it’s the first time we’ve felt an Apple-like\nexperience from software made by a traditional automaker.</p>\n\n<p>We’re still waiting for the <a href=\"https://9to5mac.com/2023/02/03/new-carplay-interface-features-release/\">next-gen CarPlay\nexperience</a>\nwhich Apple announced last year, which promises greater\nintegration with vehicle functions than today’s version of\nCarPlay. In the meantime, though, Porsche has taken it upon itself\nto build its own app which offers the best of both worlds — a\nsnappy, CarPlay-like user interface, along with control of some\nvehicle functions which were heretofore unavailable through\nApple’s software.</p>\n</blockquote>\n\n<p>So it might be the best CarPlay interface yet to ship in a car, but it’s <em>not</em> the next-gen CarPlay announced by Apple last year.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/28/porsche-carplay\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"20c442c49a34a450d012b5ef0b4166dba10f0e0fed82bece73b5428f7a1ab1c7","category":"Tech"}