{"title":"iOS 17 beta reveals how the iPhone 15 Pro Action Button may work","link":"https://www.macworld.com/article/2009607/ios-17-beta-reveals-how-the-iphone-15-pro-action-button-may-work.html","date":1690390047000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Of all the rumored features of the upcoming <a href=\"https://www.macworld.com/article/1968238/iphone-15-pro-rumors-a17-processor-telephoto-camera-titanium-action-button.html\">iPhone 15 Pro</a>, perhaps the one we’re most excited about is the <a href=\"https://www.macworld.com/article/1674628/iphone-mute-switch-apple-watch-ultra-action-button.html\">Action Button</a>. It’s rumored to replace the mute switch that has been a feature of every iPhone since the original. Taking its lead from the new Apple Watch Ultra, Apple is said to be making the Action Button’s function customizable instead of simply a mute toggle.</p>\n\n\n\n<p>Buried in the code of <a href=\"https://www.macworld.com/article/1963238/ios-17-beta-features-release-date-how-to-install.html\">iOS 17 Developer Beta 4</a>, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/07/26/ios-17-beta-action-button-iphone-15-pro/&amp;xcust=1-1-2009607-1-0-0&amp;sref=https://www.macworld.com/feed\">Steve Moser of MacRumors</a> has found a bit of code that may reveal the functions of the Action Button. The code lists the names of nine different actions:</p>\n\n\n\n<ul>\n<li>Accessibility</li>\n\n\n\n<li>Camera</li>\n\n\n\n<li>Flashlight</li>\n\n\n\n<li>Focus</li>\n\n\n\n<li>Magnifier</li>\n\n\n\n<li>Shortcuts</li>\n\n\n\n<li>Silent Mode</li>\n\n\n\n<li>Translate</li>\n\n\n\n<li>Voice Memos</li>\n</ul>\n\n\n\n<p>Only the function names are listed, so it’s not clear exactly what each of these would do. With Shortcuts, for example, it’s easy to see how you might be able to choose a specific Shortcut to automatically run when you tap the button, or it might open the app so you can choose from the list of those you have installed. Camera might simply launch the camera, or it might immediately take a photo or video. There may even be settings to give you the options to choose.</p>\n\n\n\n<p>One of the things that has us excited about the Action Button is the fact that it is inherently software-driven, and therefore can be improved and modified over time. It’s possible that the button will be accessible to developers so they can make it perform a specific function within their apps while it performs the user-chosen function when at the Home or Lock screen. With subsequent iOS releases, Apple will be able to expand the list of functions for the Action Button, and even develop new iOS features with it in mind.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"20c820f41a10a3861ff89dc95c6c2c10a3a3cc3ebeeec36a43c7ae48a84e08e4","category":"Apple"}