{"title":"Tree pruning improves tree form but not understory plant production in mixed stands of Sitka spruce and western hemlock, USA","link":"https://academic.oup.com/forestry/article/97/2/309/7242316?rss=1","date":1691971200000,"content":"<span><div>Abstract</div>Precommercial thinning and tree pruning are frequently used together to improve timber quality and wildlife habitat in even-aged Sitka spruce (<span>Picea sitchensis</span>) and western hemlock (<span>Tsuga heterophylla</span>) stands. Thinning enhances crop tree growth and understory plant production; however, the benefits and drawbacks of tree pruning have received less attention. Tree pruning was investigated in two long-term experiments on the Tongass National Forest, Alaska, USA. Experiment 1 tracked four uniformly thinned sites for ~30 years that received 2.4, 3.6, and 5.2 m lift, and no pruning treatments. Experiment 2 tracked 11 sites for 16 years that received thinning/no pruning, thinning plus pruning (25% of trees), thinning plus pruning (50% of trees), and no thinning/no pruning treatments. We investigated (i) how pruning lift height affects tree form and understory production and (ii) how pruning density affects canopy closure and understory production. In Experiment 1, pruning reduced butt log taper and did not adversely affect diameter or height in either species. Pruning lift was visible in height-to-live crown measurements. Crown recession occurred first in low lift treatments and later in all treatments until crown form was similar after 28–31 years. Epicormic branching rates in Sitka spruce peaked 6–9 years after treatment before falling sharply. Deer forage declined through time and did not differ between lift treatments. In Experiment 2, canopy closure was lower shortly after thinning and pruning, but did not differ from the control after 16 years. Epicormic branching rates were greater shortly after thinning and pruning but did not differ from the control after 16 years. Deer forage declined with canopy closure and thinned and pruned treatments exhibited greater forage than the control. We conclude that pruning can improve log quality for timber applications but does not enhance understory plant biomass and deer forage over thinning treatment alone.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"20d07db9f7370437422613bce4414e5e792dcec9419adbeaf5ddb1c3ce40e2c7","category":"Environment"}