{"title":"Apple Launches Online Store on China's WeChat Platform","link":"https://www.macrumors.com/2023/07/11/apple-launches-online-store-china-wechat/","date":1689064991000,"content":"Apple has launched an online store in China's WeChat app, the Tencent-owned social media platform has announced (via <em><a href=\"https://www.reuters.com/technology/apple-store-goes-live-wechat-mini-programme-2023-07-11/\">Reuters</a></em>).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/08/apple_wechat.jpg\" alt width=\"1000\" height=\"460\" />\r<br />\nChina's dominant messaging app will host the Apple store via one of its mini-programs, which typically offers e-commerce, financial, and live-streaming services to WeChat's over 1.2 billion users.\r<br />\n\r<br />\nCustomers will be able to purchase the full line of Apple products including iPhones, iPads, and Macs on the store. Orders via WeChat are eligible for free shipping, and some users can pay for three-hour delivery and access Apple's trade-in program.\r<br />\n\r<br />\nThe move follows a pattern of Apple branching out its sales in China by turning to social media platforms, which Chinese consumers increasingly use to shop. \r<br />\n\r<br />\nAs <em>Reuters</em> points out, Apple already operates a similar shop on Tencent-rival Alibaba Group's Tmall online marketplace, while JD.com, China's second-largest online retailer, is an official Apple reseller. Apple also tried marketing its products on a livestream in China  in May for the first time with an hour-long show.\r<br />\n\r<br />\nChina's smartphone sales in the first quarter fell 5% year on year, marking the lowest first-quarter sales figure for the country since 2014, according to data from Counterpoint Research cited by <em>Reuters</em>.\r<br />\n\r<br />\nHowever, the research firm said Apple bucked the trend in the same quarter by recording a 19.9% share of the Chinese smartphone market – its biggest since 2014 – as it increased sales by 6% year-on-year in a declining market.<div>Tags: <a href=\"https://www.macrumors.com/guide/china/\">China</a>, <a href=\"https://www.macrumors.com/guide/wechat/\">WeChat</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/11/apple-launches-online-store-china-wechat/\">Apple Launches Online Store on China's WeChat Platform</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-launches-online-store-on-chinas-wechat-platform.2395586/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"20d5810fb209c6cfcb7ebe1017efb43d193013a65c28816085dca88d164b678a","category":"Apple"}