{"title":"What’s the Point of Apple TV Hardware?","link":"https://www.bloomberg.com/news/newsletters/2021-08-08/why-should-i-buy-an-apple-aapl-tv-instead-of-amazon-fire-google-chromecast-ks3ihfcz","date":1628623933000,"content":"\n<p><a href=\"https://daringfireball.net/linked/2021/08/10/gurman-iphone-camera-features\">Speaking of Mark Gurman</a>, his Power On newsletter continues to be an excellent read. His main topic this week argues that Apple TV (hardware) is “mostly pointless”:</p>\n\n<blockquote>\n  <p>Most importantly, buying an Apple TV no longer gives users a\ncontent advantage. We are in the age of streaming services like\nNetflix, Amazon Prime Video and Hulu, and business models have\nshifted so that every service is available on every device — phones, tablets, TV sets, streaming sticks and game consoles.</p>\n\n<p>Apple, known for its closed ecosystem, is even embracing the shift\nby offering many services on smart TVs and boxes made by\ncompetitors. […] That made the Apple TV a mostly pointless\naccessory, and consumers seem to agree: <a href=\"https://news.strategyanalytics.com/press-releases/press-release-details/2020/Strategy-Analytics-Samsung-Leads-As-Global-TV-Streaming-Device-Population-Reaches-1.1-Billion/default.aspx\">2020 data from Strategy\nAnalytics</a> found that the Apple TV holds 2% of the streaming\ndevice market.</p>\n\n<p>The product isn’t without its benefits, though, for the Apple\necosystem’s most loyal users. Integration with HomeKit, Fitness+,\nAirPods and the iOS remote app is useful. The new remote control\nand faster chip in this year’s version are definite improvements,\nand the box is getting SharePlay and Spatial Audio support later\nthis year. Still, I don’t see these enhancements moving the needle\nfor most people.</p>\n</blockquote>\n\n<p>I’d argue that Apple TV is a quintessential Apple product: its primary point is to deliver a superior user experience for those who care and are willing to pay a premium for it. If you look only at “content” there’s little reason to buy an iPhone or Mac or iPad, either. The Mac in particular seems an apt comparison. The reason to buy a Mac instead of a PC isn’t that the Mac can do things PCs can’t, but that what you do on a Mac is delivered through a superior experience. That’s Apple TV, too — especially now that Apple is shipping a good remote control. For a lot of us, it clearly delivers a superior and more private user experience that is worth paying a premium for.</p>\n\n<p>2 percent market share is really low, no question about it, but if you look at those market share numbers from Strategy Analytics, no TV platform has a dominant position. It’s a remarkably diverse market, with no platform over 12 percent share. And Apple’s market share isn’t just any random 2 percent of the market, it’s 2 percent at the very high end of the market. It’s a premium product for Apple’s core customer base.</p>\n\n<p><strong>Update:</strong> An alternative response to Gurman’s “What’s the point of Apple TV?” question is just one word: <em>privacy</em>. Here’s a note I just got from an Apple TV devotee friend:</p>\n\n<blockquote>\n  <p>Remarkable that Gurman never even mentions the privacy benefits of\nApple TV hardware. There are no circumstances in which I’d feel OK\nconnecting a TV to the internet, or buying a streaming box from a\ncompany monetizing it with user tracking, so his “<em>content is\navailable everywhere, shrug emoji</em>” outlook looks myopic. What’s\nthe second-best option supposed to be?</p>\n</blockquote>\n\n<p>That’s a great point and a good question. If Apple were to get out of the streaming hardware game, what’s the next best choice?</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/08/10/apple-tv-point\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"20d8cd1f476645e516eeaadf6ab787ff72f417d58c2b5ed8d8ed58a70a76468b","category":"Tech"}