{"title":"Priorities for quality of life after traumatic brain injury","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306524","date":1720188000000,"content":"<p>by Jasleen Grewal, Kix Citton, Geoff Sing, Janelle Breese Biagioni, Julia Schmidt</p>\r\nBackground <p>After traumatic brain injury (TBI), individuals can experience changes to quality of life (QOL). Despite understanding the factors that impact QOL after TBI, there is limited patient-oriented research to understand the subjective priorities for QOL after TBI. This study aims to understand the priorities for QOL after TBI using a group consensus building method.</p> Methods <p>The Technique for Research of Information by Animation of a Group of Experts (TRIAGE) method was used to determine priorities for QOL after TBI. In phase one, expert participants were consulted to understand the context of QOL after TBI. In phase two, participants with TBI completed a questionnaire to broadly determine the factors that contributed to their QOL. In phase three, a portion of participants from phase two engaged in focus groups to identify the most relevant priorities. Data was analyzed thematically. In phase four, expert participants were consulted to finalize the priorities.</p> Results <p>Phase one included three expert participants who outlined the complexity and importance of QOL after TBI. Phase two included 34 participants with TBI who described broad priorities for QOL including social support, employment, and accessible environments. Phase three included 13 participants with TBI who identified seven priorities for QOL: ensuring basic needs are met, participating in everyday life, trusting a circle of care, being seen and accepted, finding meaning in relationships, giving back and advocating, and finding purpose and value. In phase four, four expert participants confirmed the QOL priorities.</p> Interpretations <p>Findings emphasize the critical need to address priorities for QOL after TBI to ensure improved health outcomes.</p>","author":"Jasleen Grewal","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"20e67a1fac28eb07075f2e81fadc2d8097d98808a9f149bd65e21809626a1fd3","category":"Interdisciplinary"}