{"title":"Association Between Nutrition-Related Indicators and Non-Alcoholic Fatty Liver Disease and Advanced Liver Fibrosis: Evidence from NHANES 2017&ndash;2020","link":"https://www.preprints.org/manuscript/202409.1692/v1","date":1727087080000,"content":"Background: Non-alcoholic fatty liver disease (NAFLD) is one of the most common chronic liver diseases worldwide, and its incidence has been rising in parallel with the prevalence of obesity and diabetes. A critical marker for the progression of NAFLD is advanced hepatic fibrosis (AHF), which can result in cirrhosis and hepatocellular carcinoma. This study sought to investigate the potential associations between five nutrition-related indices—the geriatric nutritional risk index (GNRI), prognostic nutritional index (PNI), controlled nutritional score (CONUT), triglyceride-total cholesterol-body mass index (TCBI), and albumin/globulin ratio (AGR)—and the progression of NAFLD and AHF. Methods: This study analyzed the association between five nutrition-related indicators and the occurrence of NAFLD and AHF by utilizing data from the National Health and Nutrition Examination Survey (NHANES) from 2017 to 2020.03. After adjusting for demographic, lifestyle, clinical, and laboratory-related factors, the associations were examined employing various statistical techniques, including multivariate logistic regression, subgroup analysis, and smooth curve fitting analysis. Results: This study included 5,514 subjects, of whom 2,088 were diagnosed with NAFLD and 359 with AHF. After adjusting for potential confounding factors using multivariate logistic regression analysis, the results revealed that GNRI, PNI, and TCBI were positively associated with the incidence of NAFLD, while CONUT and AGR demonstrated negative associations with NAFLD. Additionally, GNRI, CONUT, and TCBI were positively associated with the incidence of AHF, while AGR demonstrated a negative association with AHF.Conclusions: The study demonstrates that nutritional status plays a dual role in the progression of NAFLD and AHF, serving as both a risk and protective factor. These findings offer a scientific foundation for the early identification of high-risk populations and the development of individualized nutritional intervention strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"20eb7be1dd4b6cfc0f989c141af973b66b5972d31140691732daab80d98c8fad","category":"Interdisciplinary"}