{"title":"How to set up a tubeless tyre","link":"https://www.bikeradar.com/advice/workshop/how-to-set-up-a-tubeless-tyre/","date":1692712824000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2018/11/Bike-Radar051022kg1094-cb4873c.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2018/11/Bike-Radar051022kg1094-cb4873c.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2018/11/Bike-Radar051022kg1094-cb4873c.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2018/11/Bike-Radar051022kg1094-cb4873c.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2018/11/Bike-Radar051022kg1094-cb4873c.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2018/11/Bike-Radar051022kg1094-cb4873c.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2018/11/Bike-Radar051022kg1094-cb4873c.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2018/11/Bike-Radar051022kg1094-cb4873c.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2018/11/Bike-Radar051022kg1094-cb4873c.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2018/11/Bike-Radar051022kg1094-cb4873c.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Pouring Pirelli P-Zero sealant into Pirelli Cinturato Velo tyre\" title=\"Pouring Pirelli P-Zero sealant into Pirelli Cinturato Velo tyre\" />                                            <p>Tubeless tyres are rising in popularity and for good reason – they can be run safely at lower tyre pressures, which increases comfort, and forego an inner tube, relying on sealant inside to clog up any small holes.</p>\n<p>Although tubeless setup can seem to the uninitiated like a bit of a dark art, it doesn’t need to be with the correct know-how.</p>\n<p>In this guide, we’ll take you through a step-by-step process and explain exactly how to set up your tubeless tyres. Although we’ve demonstrated using a road bike tyre in this guide, the process is exactly the same for gravel and mountain bike tyres.</p>\n<h2>What you need for a tubeless setup</h2>\n<p>To understand how to set up your tubeless tyres, it’s first useful to explain what makes up a tubeless setup and what each component does.</p>\n<h3>Tubeless tape</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Tubeless rim tape on a shop towel\" title=\"Tubeless rim tape on a shop towel\" />\n\n</div><div><figcaption><span><i></i> Tubeless tape seals up the bed of the rim.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Tubeless tape is applied to the bed of a rim, providing an airtight barrier so air doesn’t escape from the spoke holes.</p>\n<p>Tape will often be specific to road, gravel or mountain bikes and is available in different sizes to suit your <a href=\"https://www.bikeradar.com/advice/buyers-guides/rim-width-explained-for-road-bikes-mountain-bikes-and-gravel-bikes/\">rim width</a>.</p>\n<p>Some rims often come pre-taped and there are even some on the market, such as those from Campagnolo, which don’t require rim tape because there are aren’t any spoke holes.</p>\n<h3>Tubeless valves</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Tubeless valves on a shop towel\" title=\"Tubeless valves on a shop towel\" />\n\n</div><div><figcaption><span><i></i> A tubeless valve is much like a regular Presta valve. The tool on the top is for removing the valve core.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>A tubeless valve is identical in function to a regular <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tube Presta valve</a>. It’s usually (though not always) fitted to a conical bung that sits in the valve hole.</p>\n<p>When the lockring is tightened down, it deforms the bung around the valve hole and tape, creating an airtight seal.</p>\n<p>Any good tubeless valve should have a removable core. This helps with initial inflation and seating and, should the valve core become clogged up with sealant, allows you to either clean or replace this easily without having to unseat the tyre.</p>\n<p>A valve core removal tool often comes with tubeless valves but if it doesn’t, they can be purchased separately. Alternatively, some of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-multi-tool/\">best bike multi-tools</a> incorporate this tool.</p>\n<h3>Sealant</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Pirelli P-Zero sealant in front of a Cinturato Velo tyre\" title=\"Pirelli P-Zero sealant in front of a Cinturato Velo tyre\" />\n\n</div><div><figcaption><span><i></i> The sealant is designed to plug any small holes.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Sealant is a liquid designed to plug small holes in a tyre’s casing, usually before you’ve even noticed there’s a puncture at all. They are most commonly latex-based.</p>\n<p>An excellent explainer on how tubeless sealant works can be found in our guide to the <a href=\"https://www.bikeradar.com/mtb/gear/article/best-tubeless-sealant-52683/\">best tubeless sealants</a>.</p>\n<h3>A tubeless-ready rim</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Hunt Alloy SL Disc wheelset on tarmac\" title=\"Hunt Alloy SL Disc wheelset\" />\n\n</div><div><figcaption><span><i></i> These Hunt Alloy SL Discs feature a 25mm rim depth.</span></figcaption><span> <i>Steve Sayers / Our Media </i></span></div>\n<p>Like the tyre, tubeless-ready road rims are visually identical to a regular clincher rim.</p>\n<p>However, closer inspection reveals that, like tubeless tyres, the profile of the hook of the rim (where the bead of the tyre interlocks with the rim) is subtly different. The well of the rim is often slightly deeper as well.</p>\n<p>A select few rims – mostly from Mavic – are built to UST (Universal System Tubeless) standards. Among other things, this standard dictates the rim must be sealable without tape, with the rim bed free of holes.</p>\n<p>These are relatively few and far between and you’re much more likely to come across a rim with a regular drilled bed.</p>\n<p>Hooked rims have been the norm for many years, but <a href=\"https://www.bikeradar.com/features/hookless-rims-road-tubeless/\">hookless rims</a> have proliferated on road and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-wheels/\">gravel wheels</a>. A hookless rim has straight, vertical sides as opposed to bead hooks and they are typically only compatible with tubeless tyres.</p>\n<p>If your rims are hookless, double-check your tyre is compatible and be sure to not exceed 73psi when inflating them because this is the ETRTO-recommended maximum pressure limit.</p>\n<h3>Tubeless tyre</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Pirelli Cinturato Velo tyre\" title=\"Pirelli Cinturato Velo tyre\" />\n\n</div><div><figcaption><span><i></i> You risk blowing the tyre off the rim if it isn’t tubeless-compatible.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Tubeless tyres may look the same as regular clincher tyres, but they are subtly and critically different.</p>\n<p>The two key differences are the dimensions and profile of the bead; the bead is usually very slightly smaller (or, more accurately, made to tighter tolerances) than a clincher and the profile of the bead is designed specifically to interlock with the unique hook of a tubeless rim.</p>\n<p>It’s fairly straightforward to find out if a tyre is tubeless-compatible, because brands will often include a note on the tyre itself – tubeless tyres from WTB, for example, feature a ‘TCS’ (tubeless-compatible system) graphic.</p>\n<p>The majority of performance mountain and gravel bike tyres are tubeless-compatible but this is not always the case on road, so pay attention to the label.</p>\n<h3>Tubeless pump (recommended but not always essential)</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Bontrager tubeless pump in a workshop setting\" title=\"Bontrager tubeless pump in a workshop setting\" />\n\n</div><div><figcaption><span><i></i> A tubeless pump will make the job much easier.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>In order to get some tubeless tyres to seat, they may require a sudden blast of air. <a href=\"https://www.bikeradar.com/features/6-of-the-best-tubeless-pumps-and-inflators/\">Tubeless pumps</a> incorporate an air chamber, which you pump up first and you can then discharge all of the air in the chamber into the tyre in one hit.</p>\n<p>If you don’t have a tubeless pump, many tyres will seat with a typical track pump. If you’re having problems, you could use an air compressor, which are often found at petrol stations. Just make sure you use a Presta valve adaptor on the head of the compressor.</p>\n<p>We’d recommend against the use of <a href=\"https://www.bikeradar.com/advice/buyers-guides/6-of-the-best-co2-inflators/\">CO2 inflators</a> because they are not always compatible with the sealant.</p>\n<h2>How to fit and set up tubeless tyres</h2>\n\n<h3>1. Prepare and tape the rim</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Hunt tubeless tape on a Hunt Alloy SL wheel\" title=\"Bike Radar_051022_kg1077\" />\n\n</div><div><figcaption><span><i></i> The tape should be pulled taut when wrapping it.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Before applying tape, ensure your rim bed is completely clean, dry and free of residue from any old tape or sealant.</p>\n<p>It’s best to avoid mechanical removal for all but the most stubborn of residue. Instead, turn to isopropyl alcohol and a clean rag to soften up any old glue. Some brands, such as Muc-Off, offer specific sealant removers.</p>\n<p>Starting from the couple of spokes past the valve hole, install into the well of the rim with a few fingers and apply around 6 to 8 inches onto the rim, ensuring it is central and kept very taut.</p>\n<div>\n<a href=\"https://media.immediate.co.uk/volatile/sites/21/2018/11/TubelessTape720_2Mb-fc5be98.mp4\">https://media.immediate.co.uk/volatile/sites/21/2018/11/TubelessTape720_2Mb-fc5be98.mp4</a></div>\n<p>Once you have applied this small section, the tape should hold itself in place. At this point, I like to hold the wheel around the hub and rotate the wheel away from me as I apply further tape, keeping the tension high and ensuring it stays nice and central.</p>\n<p>Wrap all the way around the rim, again keeping the tension high and avoiding straying to the edges. Once you have reached the start of the tape, overlap by around 4 inches, cut the tape and firmly press the tape down with your thumbs, working out any bubbles.</p>\n<p>Inspect the tape – if there is any damage, it is best to start again and re-tape the rim rather than try to patch it.</p>\n<p>Getting this component of the task correct will avoid any heartache later and many failed tubeless setups are the result of poorly installed tape.</p>\n<h3>2. Fit the tubeless valve</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Installing tubeless valve into Hunt Alloy SL rim\" title=\"Installing tubeless valve into Hunt Alloy SL rim\" />\n\n</div><div><figcaption><span><i></i> Use a small prick or soldering iron to make a hole for the valve</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Start by finding the valve hole on the rim and pushing, from the inside outward, a small prick to mark exactly where the valve hole is. Then, from the outside, make a small hole in this.</p>\n<p>Push the valve through the hole and let it ‘cut’ the hole to size. Some recommend cutting the tape with a Stanley knife, but this tears the tape and doesn’t cut a circular hole.</p>\n<p>Push down on the valve with your thumb such that it deforms the bung and screw on the lockring. It’s good practice to put the tiniest dab of grease on the lockring to make roadside removal easier.</p>\n<p>Unless the manufacturer says otherwise, we’d suggest avoiding the use of tools to secure the valve because that can quite often deform any O-rings.</p>\n<h3>3. Fit the tubeless tyre</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Fitting Pirelli Cinturato Velo tyre onto Hunt Alloy SL wheel\" title=\"Fitting Pirelli Cinturato Velo tyre onto Hunt Alloy SL wheel\" />\n\n</div><div><figcaption><span><i></i> Because there’s no tube to pinch, you can be a bit more liberal with your use of tyre levers, though you’ll gain big kudos if you can fit tyres without them</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Fitting a road tubeless tyre is exactly the same as a regular clincher, but can be a bit more difficult due to the tighter bead.</p>\n<p>The good news is that you can be a bit more liberal with your use of <a href=\"https://www.bikeradar.com/features/6-of-the-best-tyre-levers/\">tyre levers</a>, because there’s no tube to worry about. Don’t go totally gung-ho though because it’s still very easy to nick or otherwise damage tubeless tape, forcing you to start again.</p>\n<p>Once you’ve got both sides of the tyre on, massage the tyre and ensure it is sitting in the well all the way around the rim and sits on either side of the valve.</p>\n<p>If you’re finding the final part of the tyre’s bead difficult to install, it can help to go around the rest of the tyre and push the tyre inwards. This helps install it into the bead of the rim, which should take up any slack at the final section of the bead.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Putting a dab of sealant on the sidewall of a Pirelli Cinturato Velo tyre.\" title=\"Putting a dab of sealant on the sidewall of a Pirelli Cinturato Velo tyre.\" />\n\n</div><div><figcaption><span><i></i> A small dab of sealant on the sidewall can help if the tyre’s being stubborn.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Another tip is to put a small dab of the tubeless sealant you are going to use on the the tyre sidewall because this essentially acts as a lubricant.</p>\n<h3>4. Add the tubeless sealant</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Pouring Pirelli P-Zero sealant into Pirelli Cinturato Velo tyre\" title=\"Pouring Pirelli P-Zero sealant into Pirelli Cinturato Velo tyre\" />\n\n</div><div><figcaption><span><i></i> Fill your tyres with the recommended amount of sealant.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>If you’re confident in your ability to get the tyre on with minimal fuss, you could add your sealant before fully fitting the tyre. Once added, rotate the wheel slightly to encourage the sealant away from the final part of the bead you need to install to avoid getting it everywhere.</p>\n<p>However, if it’s a new combination, you may find it much easier to add the sealant via the valve. This can be done via a syringe or a small applicator bottle.</p>\n<p>Gently rotate the wheel to coat the inside of the tyre.</p>\n<h3>5. Seat the tyre</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Pumping up a Pirelli Cinturato Velo tyre using a Bontrager tubeless pump\" title=\"Bike Radar_051022_kg2133\" />\n\n</div><div><figcaption><span><i></i> A few swift blasts from a decent track pump should seat the tyre.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>It’s best to seat the tyre with the valve core removed, because this allows for the most direct path for air to head into the tyre.</p>\n<p>Fit your track pump and, hopefully, a few swift blasts of air will pop the tyre into place.</p>\n<p>If only one side or a section of the tyre seats, keep pumping until you hear a number of satisfying pings and the tyre is seated around the full circumference of the wheel. As mentioned, you may need a tubeless pump or air compressor if you are using a track pump.</p>\n<p>As soon as it is seated, remove the head of the pump and replace the valve core.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Mechanic listening for any noises in a tubeless tyre set-up\" title=\"Mechanic listening for any noises in a tubeless tyre set-up\" />\n\n</div><div><figcaption><span><i></i> Listen for any hissing.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Add a bit more air then give the tyre a vigorous shake and spin to fully coat the inside of the tyre. Once done, pump your tyres up to the recommended pressure.</p>\n<p>Many tyres have witness marks, so you can check to see if the tyre has correctly seated.</p>\n<p>We’d recommend heading out for a brief ride post-setup so the sealant can fully coat the tyre.</p>\n<h2>How to maintain tubeless tyres</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Oscar Huckle fitting Hunt Alloy SL wheel to BMC Teammachine SLR01\" title=\"Oscar Huckle fitting Hunt Alloy SL wheel to BMC Teammachine SLR01\" />\n\n</div><div><figcaption><span><i></i> It’s worth checking sealant levels every two to three months.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>For the most part, tubeless tyres are fit-and-forget, but you will periodically need to top up the sealant because it dries out over time. Different sealants will dry up at different rates, but it’s worth getting into the habit of checking your sealant levels every two to three months.</p>\n<p>You can do this either by removing a small section of the tyre’s bead and visually inspecting the sealant levels or by inserting a cable tie (with its end chopped off) through the valve core, which effectively acts like a dipstick on a car.</p>\n<p>Either pour some fresh sealant into the exposed section of the tyre or inject it through the valve core. Once every year or 18 months, it’s worth fully removing the tyre and giving everything a thorough clean to remove any sealant that may have clogged up inside the tyre.</p>","author":"Oscar Huckle","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"20fa9763deb20642185a8943314d028ced0e0ece18880f590d00dfdd80b17c06","category":"Cycling"}