{"title":"An Oxford Nanopore Technology-Based Hepatitis B Virus Sequencing Protocol Suitable For Genomic Surveillance Within Clinical Diagnostic Settings","link":"https://www.preprints.org/manuscript/202410.0268/v2","date":1728381473000,"content":"Chronic Hepatitis B Virus (HBV) infection remains a significant public health concern, particularly in Africa, where the burden is substantial. HBV is an enveloped virus, classified into ten phylogenetically distinct genotypes (A – J). Tests to determine HBV genotypes are based on full-genome sequencing or reverse hybridization. In practice, both approaches have limitations. Whereas diagnostic sequencing, generally using the Sanger approach, tends to focus only on the S-gene and yields little or no information on intra-patient HBV genetic diversity, reverse hybridization detects only known genotype-specific mutations. To resolve these limitations, we developed an Oxford Nanopore Technology (ONT)-based HBV diagnostic sequencing protocol suitable for clinical virology that yields both complete genome sequences and extensive intra-patient HBV diversity data. Specifically, the protocol involves tiling-based PCR amplification of HBV sequences, library preparation using the ONT Rapid Barcoding Kit, ONT GridION sequencing, genotyping using Genome Detective software, recombination analysis using jpHMM and RDP5 software, and drug resistance profiling using Geno2pheno software. We prove the utility of our protocol by efficiently generating and characterizing high-quality near full-length HBV genomes from 148 residual diagnostic samples from HBV-infected patients in the Western Cape province of South Africa, providing valuable insights into the genetic diversity and epidemiology of HBV in this region of the world.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"20ff56bd6e18cc88a7e465dc822b2708a411b871e0753b9d9db85979b5a4c8bf","category":"Interdisciplinary"}