{"title":"Remotely Sensed Changes in the Qinghai-Tibet Plateau Wetland Ecosystems and Their Response to Drought","link":"https://www.preprints.org/manuscript/202404.0666/v1","date":1712656064000,"content":"Wetland ecosystems in the Qinghai-Tibet Plateau are pivotal for global ecology and regional sustainability, contributing significantly to terrestrial ecosystems by regulating runoff, mitigating floods, and enhancing water quality. This study investigates the dynamic changes in wetland ecosystems within the Chaidamu Basin and their response to drought, aiming to foster sustainable wetland utilization in the Qinghai-Tibet Plateau. Using Landsat TM/ETM/OLI data on the Google Earth Engine platform, we employed a random forest method for annual long-term land cover classification. Meteorological drought conditions were assessed using SPEI3, SPEI6, SPEI9, and SPEI12, derived from monthly precipitation and evapotranspiration data. Pearson correlation analysis examined the relationship between wetland changes and various SPEI scales. The BFASAT method evaluated the impact of SPEI12 trends on wetlands, while cross-wavelet analysis explored teleconnections between SPEI12 and atmospheric circulation factors. Our findings revealed that the land cover dataset of the Chaidamu Basin (1990-2020) exhibited diverse categories with high classification accuracy (OA: 90.27%, Kappa: 88.34%). Wetlands, including lake, glacier, and marsh types, exhibited a noticeable increasing trend. Wetland expansion occurred during specific periods (1990-1997, 1998-2007, 2008-2020), featuring extensive conversions between wetland and other types, notably from other types to wetlands. Spatially, lake and marsh wetlands predominated in the low-latitude basin, while glacier wetlands were situated at higher altitudes. The study identified significant negative correlations between SPEI at various scales and total wetland area and types, with SPEI12 exhibiting the most substantial effect between September and December (r &lt;-0.75) on wetlands. SPEI12 displayed a decreasing trend with non-stationarity and distinct breakpoints in 1996, 2002, and 2011, indicating heightened drought severity. Atmospheric circulation indices (ENSO, NAO, PDO, AO, WP) exhibited varying resonance with SPEI12, with NAO, PDO, AO, and WP demonstrating longer resonance times and pronounced responses.The continuous growth of wetlands amidst increasing aridification emphasizes the need for thoughtful wetland development to establish a sustainable \"forest-lake-grass-field-river\" ecological community. These findings underscore the significance of comprehending wetland changes and drought dynamics for effective ecological management in the Chaidamu Basin of the Qinghai-Tibet Plateau.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"20ff9e7e802796902c73fb92849c5bddc357fd74fff03524a79ae928cf44dbdc","category":"Interdisciplinary"}