{"title":"Enhanced Bone Healing in Critical-Sized Rabbit Femoral Defects: Impact of Helical and Alternate Scaffold Architectures.","link":"https://www.preprints.org/manuscript/202403.0801/v1","date":1710405951000,"content":"This study investigates the effect of scaffold architecture on bone regeneration, focusing on 3D-printed polylactic acid-bioceramic calcium phosphate (PLA-bioCaP) composite scaffolds in rabbit femoral condyle critical defects. To assess their influence on bone healing and scaffold performance, we explored two distinct scaffold designs, alternate and helical laydown patterns. The scaffolds were meticulously characterized for pore size, strut thickness, porosity, pore accessibility, and mechanical properties. The in vivo efficacy of these scaffolds was evaluated using a rabbit femoral condyle critical defect model. Our findings indicate that both scaffold architectures are biocompatible and support bone formation. The helical scaffolds, characterized by larger pore sizes and higher porosity, demonstrated significantly greater bone regeneration than the alternate structures. However, their lower mechanical strength presented limitations for use in load-bearing sites. This study highlights the importance of scaffold architecture in bone tissue engineering and underscores the need to balance porosity and mechanical strength for optimal bone regeneration. The findings provide crucial insights for the design of 3D- printed scaffolds in clinical applications, particularly in the context of critical-sized bone defects. The study also outlines potential areas for future research, including exploring hybrid scaffold designs to achieve optimal porosity without compromising mechanical integrity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"210a00fb2d348cf67e1d983ecfc293787160b09229d584f7de9a018d25e8a7a5","category":"Interdisciplinary"}