{"title":"Comprehensive Flow Turbulence Metrics to Improve Bar Rack Guidance for Downstream Migrating Fish","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR034900?af=R","date":1725623705000,"content":"<h2>Abstract</h2>\n<p>Turbulent flows are investigated upstream of a bar rack system that is recommended as optimum in recent literature from tests with several fish species of different morphology, swimming ability, and behavior. Both two-dimensional two-component and two-dimensional three-component state-of-the-art particle image velocimetry were used to quantify and analyze hydrodynamic metrics important for downstream migrating species. The inclination angles of the bar and rack were 45° and 30°, respectively, and the thickness of the bottom overlay was 13% of the water depth. The two Reynolds numbers investigated, based on incoming velocity and bar thickness, were 4,000 and 6,000. The statistical and structural characteristics of turbulent flows in the streamwise-spanwise plane at 5% water depth, and the streamwise-vertical plane at channel mid-span are discussed. Upstream of the bottom overlay, the mean flow is deflected and accelerated toward the bypass, leading to an increase in the Reynolds stresses, while the turbulence eddies become smaller. For effective fish guidance, it is recommended that sweeping velocity (<i>V</i>\n<sub>\n   <i>p</i>\n</sub>) be larger than normal velocity (<i>V</i>\n<sub>\n   <i>n</i>\n</sub>), with <i>V</i>\n<sub>\n   <i>p</i>\n</sub> parallel and <i>V</i>\n<sub>\n   <i>n</i>\n</sub> perpendicular to the bar rack and bottom overlay. In the downstream half of the bar rack, <i>V</i>\n<sub>\n   <i>n</i>\n</sub> may increase sufficiently to surpass <i>V</i>\n<sub>\n   <i>p</i>\n</sub> near the bypass, possibly reducing effective guidance for some species and sizes. Upstream of the bars, the levels of streamwise mean velocity vary abruptly, which may deter fish from contacting the bars. Although inferences on passage effectiveness are made based on previous studies, tests with different species and sizes are needed to confirm fish responses.</p>","author":"X. Fang, \nS. Kumahor, \nM. F. Tachie, \nC. Katopodis, \nH. Ghamry","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"2111183a5d4d823dcf031547c9d066e35931c40dbe0f0365b1287ef5407e51e2","category":"Environment"}