{"title":"PFG = PostgreSQL + Fluent-bit + Grafana","link":"https://lewcpe.com/blog/archives/2239/pfg-postgresql-fluent-bit-grafana/","date":1614008041000,"content":"<figure class=\"wp-block-image size-large\"><a href=\"https://lewcpe.com/blog/wp-content/uploads/image-1.png\"><img loading=\"lazy\" width=\"1024\" height=\"656\" src=\"https://lewcpe.com/blog/wp-content/uploads/image-1-1024x656.png\" alt=\"\" class=\"wp-image-2241\" srcset=\"https://lewcpe.com/blog/wp-content/uploads/image-1-1024x656.png 1024w, https://lewcpe.com/blog/wp-content/uploads/image-1-300x192.png 300w, https://lewcpe.com/blog/wp-content/uploads/image-1-768x492.png 768w, https://lewcpe.com/blog/wp-content/uploads/image-1-1536x985.png 1536w, https://lewcpe.com/blog/wp-content/uploads/image-1-2048x1313.png 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></a></figure>\n\n\n\n<p>ปีที่ผ่านมาความรับผิดชอบหนึ่งของผมใน MFEC คือการดู centralized log ทั้งบริษัท โดยทั่วไปการใช้ ELK (Elasticsearch + Logstash + Kibana) ก็เป็นแนวทางมาตรฐาน แม้จะทำงานได้ดีแต่ก็มีส่วนที่ไม่ชอบหลายอย่าง เช่น</p>\n\n\n\n<ul><li>ผมไม่เคยอัพเกรด Elasticsearch สำเร็จเลย หลังๆ เลยยอมลง cluster ใหม่แล้วชี้ Logstash ออกไปที่ใหม่ชัวร์กว่ามาก</li><li>ภาษา query ค่อนข้างเฉพาะตัว คนไม่เคยใช้งงแน่นอน </li><li>ทั้ง Stack เป็น Java กินแรมเริ่มต้นค่อนข้างสูง</li><li>จากปัญหากินแรม ใน edge จริงๆ ฝั่ง ELK เลยมักใช้ filebeat ไปกวาดข้อมูลขึ้น logstash แต่จะเจอว่า filebeat มันจำกัดมาก process อะไรกับ log แทบไม่ได้เลย</li></ul>\n\n\n\n<p>ผมเองเห็น fluentd มาพักใหญ่ๆ แล้วได้ลองมาพักหนึ่งแต่ไม่เคยเอาขึ้น production จริงจัง พอดีมีโปรเจคใหม่กำลังขึ้นเลยจะขอลอง พออ่านไปอ่านมาก็เจอว่า fluentbit มันเล็กกว่า แม้จะมีฟีเจอร์น้อยกว่า fluentd มาก แต่รวมๆ ก็ถือว่าเยอะกว่า filebeat อยู่ดี (มี stream processor ด้วยซ้ำไป)</p>\n\n\n\n<p>จุดสำคัญคือ PostgreSQL นั้นมีคนเข้าใจมันเยอะกว่า Elasticsearch มาก งาน operation ทั่วๆ ไป การ query ข้อมูล, backup, restore, upgrade นั้นมักมีคนได้เป็นเรื่องปกติ ส่วนจุดขายของ ELK จะเป็นการทำงานกับข้อมูลแบบไม่มี schema ที่เหมาะกับ log มากกว่า แต่ PostgreSQL เองก็รองรับข้อมูลแบบ JSON/JSONB มาตั้งแต่เวอร์ชั่น 9.4</p>\n\n\n\n<p>fluentbit รองรับ postgesql ในตัว โดยตารางที่เขียนข้อมูลมีแค่ 3 column คือ time, tag, data แล้วใส่ตัว data ไว้เป็น JSONB</p>\n\n\n\n<p>พอลองเล่นแล้วพบว่าเวิร์คกว่าที่คิด จุดประหลาดที่สุดคงเป็น Grafana ที่คุมให้กราฟมันออกอย่างที่อยากได้ยากกว่า ELK แม้ ELK จะ alien กว่าตอนเริ่มต้น แต่พอทำงานจริงๆ แล้วจะพบว่ามันคิดอะไรให้เยอะแล้ว พวกกด drill down ข้อมูล ELK ทำได้ดีกว่ามากกดเงื่อนไขเพิ่มจากในกราฟได้เลย นับเป็นข้อได้เปรียบของการใช้ UI ที่ผูกกับ data source เดียว</p>\n\n\n\n<p>ในแง่ประสิทธิภาพผมยังไม่ได้ทดสอบเองแต่เจอว่า <a href=\"https://portavita.github.io/2018-07-31-blog_influxdb_vs_postgresql\">Postgres เสียเปรียบเรื่องการกินพื้นที่ดิสก์มาก</a> แต่ประสิทธิภาพการคิวรีดีกว่า InfluxDB ไว้มีเวลาแล้วค่อยเอา data ชุดเดียวกันมาเทียบอีกที (ยังหา benchmark เทียบกับ elasticsearch ไม่เจอ)</p>","author":"lewcpe","siteTitle":"LewCPE's Blog","siteHash":"be60e5c67c985916e913225e0fa8794018c33c335df997dc89cd85d60cc43d78","entryHash":"211b408bae8db1dea309489c1fd18d4243ea81362e53ac5b28c37874ee5685fb","category":"Thai"}