{"title":"Why this team rode bright green front wheels at the Tour of Britain","link":"https://www.cyclist.co.uk/news/10082/why-this-team-rode-bright-green-front-wheels-at-the-tour-of-britain","date":1631521043000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>13 Sep 2021</span></div>    </div></div><p>\nNew Zealand Continental team Global 6 Cycling raises awareness for refugees at Tour of Britain</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/09/global-six.jpeg?itok=B1i6UbJC\" />  </div>\n<div>\n      <p> Raising awareness can take shape in many forms. For Global 6 Cycling, it’s through green front wheels for Refugee Action at the <a href=\"https://www.cyclist.co.uk/news/913/tour-of-britain-route-riders-live-tv-guide-all-you-need-to-know\" target=\"_blank\">Tour of Britain</a>.</p>\n<p>Global 6 Cycling is a New Zealand UCI Continental team that raced the recent Tour of Britain. They were founded by one of their riders – James Mitri, of British and New Zealand background – who derived the name from uniting the six continents.</p>\n<p>‘It’s about giving an opportunity to people from all backgrounds. Because I think there's so many people who are missing out on achieving their goals, their dreams, because they're not being seen or given a chance to be seen. What I'm trying to do here is provide that opportunity, and that's where the name came from with the six continents. Our philosophy is that where you start shouldn't decide where you finish. I get energy from helping other people and seeing them grow.’</p>\n<p>With riders from Brazil, Poland, Norway and the Netherlands, a mix of languages circulates throughout the team. The soigneurs and staff speak in Spanish too. Nicolas Sessler, nicknamed ‘Radio Nico’ for his ability to talk a lot, can speak up to seven languages. Michał Paluta adds that Nico knows some words in Polish too as a debate ensued by how many he’s actually fluent in, but Belgian, Dutch, French, Italian, Spanish, Portuguese and English is no mean feat.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/10017/flanders-uci-road-cycling-world-championships-2021-key-information\">Flanders UCI Road Cycling World Championships 2021: Key information</a></div>      <div><a href=\"/in-depth/1015/paris-roubaix-all-you-need-to-know\">Paris-Roubaix 2021: Route, start list and all you need to know</a></div>      <div><a href=\"/news/10084/british-cycling-announces-impressive-world-championships-roster\">British Cycling announces impressive World Championships roster </a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 118: on sale now!</a></div>    </div></div><p>\nThe koru is a Mãori term for an unfurling fern leaf. It’s said to symbolise strength, peace and growth, and can be seen on the team kit and team cars of Global 6 Cycling. It’s easy to see how much they’re willing to grow with one another, despite being together for only nine months. They’re open with spectators, posing for photographs and recounting the moment Sessler accidentally hit a fan with a bidon the day prior.</p>\n<p>‘Damn, I apologise to the guy. It was supposed to be a gift! But it’s one he might not forget so soon.’</p>\n<p>There’s a relaxed vibe that flows through the air. But things were less than relaxed on the opening day, after a crash in the opening 10km took down the riders, broke bikes and left them chasing to get back on.</p>\n<p>It’s for this reason they waited until Stage 4 of the Tour of Britain - the Queen stage from Aberaeron to Great Orme, Llandudno — to unveil their green front wheels. It would be unfortunate if people didn’t witness them in action, especially when their message is so important.</p>\n<p>Global 6 Cycling rode the Tour of Britain in support of Refugee Action. A fitting collaboration with the team whose motto is ‘where you start shouldn’t determine where you finish’ after all. The charity is now in its 40th year of existence, its aim to welcome and support refugees and those seeking asylum in the UK to rebuild their lives. They’ve helped people fleeing crises in Vietnam, Bosnia and Syria and want to help those currently forced to flee Afghanistan.</p>\n<p>Cycling doesn’t exist within its own bubble, nor does it always grasp how powerful its influence can be on the wider world. Those once liberated by riding a bike in Afghanistan are burning their cycling gear in the hopes the Taliban won’t find them. Women are to be banned from participating in sport. Luck plays a large part in us being able to take things as simple as riding a bike for granted. We aren’t experiencing the pain inflicted upon the Afghan people, but if situations were different, we might. It can be easy for some to shut out the world and focus on people turning pedals, but that doesn’t appeal to Global 6 Cycling.</p>\n<p>Their riders are passionate about the cause. Before Stage 5 from Alderley Park, Sessler told <em>Cyclist</em>, ‘the idea with the green wheels is so people look at it and say “hey, what is that? That’s something different.”’</p>\n<p>‘It’s support for Refugee Action, a company that helps refugees. It helps integrate people into having a better life here in the UK. So what better than something nice in cycling that brings joy and happiness to people to bring attention to the cause.’</p>\n<p>Global 6 Cycling will be donating a set of wheels used in the Tour of Britain to a charity for auction.</p>\n<p>The team didn’t make the breakaway on Stage 5 – mostly to save energy for the upcoming harder stages – but Paluta navigated a hectic final kilometre to sprint to seventh on the rainy streets of Warrington.</p>\n<p>‘Our focus was on a safe finish. The last few kilometres were super dangerous and super slippery on the roads. So we decided that we will see how it goes at the end. I spoke with James [Mitri]. We stayed in a good position, then I saw some possibility to try at the end. It was all about positioning. I'm quite happy with the result and I think we are very happy and looking forward for the next stages.’</p>\n<p>Through his breakaway efforts, Sessler finished second on the mountains classification behind winner Jacob Scott of Canyon dhb Sungod with the race's conclusion on Sunday in Aberdeen. A fitting showcase of the team's talents and green tyres for Refugee Action. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"212cc1eb78ad2034ac2d6ad77586d259b05e26b089fcad4e354388a9fbb86e90","category":"Cycling"}