{"title":"Reasons to Work","link":"https://markpeak.net/reasons-to-work/","date":1632150316000,"content":"<p>จากที่เขียนเรื่อง <a href=\"https://markpeak.net/amazon-as-the-employer/\">Amazon as the Employer</a> เรื่องนโยบายการจ้างงานและค่าแรงของ Amazon ไป เลยมีโอกาสได้เข้าไปอ่าน<a href=\"https://hiring.amazon.com/#/\">เว็บไซต์ตำแหน่งงานของ Amazon</a> (Amazon Hiring) ค่อนข้างละเอียด</p>\n<p>ปกติเว็บไซต์สมัครงานลักษณะนี้จะมีการจูงใจให้มาทำงานกับเรา ด้วยข้อความชวนเชื่อต่างๆ มากมาย (555) แต่กรณีของ Amazon Hiring ที่เป็นเว็บหางานเน้นไปที่งานจ้างรายชั่วโมงด้วย มีข้อความชักจูงตรง footer ด้านล่างของเว็บที่ค่อนข้างตรงไปตรงมา เข้าประเด็น</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/09/why-amazon.png\" /></p>\n<p>การทำงานแบบรายชั่วโมง (blue collar) คงไม่มีสิทธิประโยชน์ฟู่ฟ่า หรูหรามากเท่ากับงานออฟฟิศ (white collar) อยู่แล้ว และถ้ากล่าวกันอย่างพื้นฐานที่สุดแล้ว นอกจากเรื่องค่าตอบแทนในทางตรง (compensation) สิ่งที่คนทำงานอยากได้จากนายจ้างคงมีแค่ 4 ข้อนี้จริงๆ</p>\n<ol>\n<li><strong>Benefits</strong> สิทธิประโยชน์อื่นๆ นอกเหนือจากค่าจ้างโดยตรง เช่น ประกันสุขภาพ ค่ารักษาพยาบาล วันหยุดวันลาต่างๆ</li>\n<li><strong>Culture</strong> มีความสุขทางใจ องค์กรมีวัฒนธรรมการทำงานที่ดี มีความยุติธรรม ไม่กลั่นแกล้ง ไม่เหยียดหยาม เพื่อนร่วมงานดี เจ้านายดี ใช้ชีวิตอยู่แล้วไม่เลวร้าย มีความสุข</li>\n<li><strong>Work-Life Balance</strong> มีความสุขทางกาย เวลาทำงานคาดเดาได้-ไม่หนักจนเกินไป มีเวลาให้ตัวเองและครอบครัว หรือสามารถเลือกทำงานได้เหมาะกับความต้องการของตัวเอง (เช่น เฉพาะวันหยุด เฉพาะพาร์ทไทม์) เลือกจังหวะชีวิตของตัวเองได้</li>\n<li><strong>Career Advancement</strong> เห็นเป้าหมาย ทำงานไปนานๆ แล้วมีความก้าวหน้าทางวิชาชีพ มองเห็นว่าจะไปสู่จุดไหน ไม่ใช่ทำงานกินค่าแรงรายชั่วโมงไปเรื่อยๆ จนเกษียณ ในทางปฏิบัติคือมี career path หรือเปิดโอกาสให้ข้ามสายงาน เปิดโอกาสให้พัฒนาตัวเองผ่านเทรนนิ่งหรือการเรียนเต็มหลักสูตร</li>\n</ol>\n<p>กรณีข้อ 1-2 คงเป็นเหตุผลแบบ universal สำหรับงานออฟฟิศนั่งโต๊ะด้วย ใครๆ ย่อมอยากได้สิทธิประโยชน์ที่ดี และวัฒนธรรมที่ดี</p>\n<p>แต่ข้อ 3-4 สำหรับชาวออฟฟิศนั้นอาจเป็น default อยู่แล้วทำให้เรามองข้ามกันไป เช่น การทำงานออฟฟิศมีเวลาทำงานที่ค่อนข้างตายตัว (เข้า 9 โมงเลิก 5 โมง ไม่ต้องทำงานวันหยุด) ไม่มีระบบจ้างรายชั่วโมงหรือเป็นกะ ส่วนเรื่อง career advancement ก็มีเรื่องการเลื่อนขั้น ขึ้นเงินเดือนเป็นปกติอยู่แล้ว</p>\n<p>ความแตกต่างตรงนี้ สังเกตได้จากอีกเว็บของ Amazon คือ <a href=\"https://www.amazon.jobs/en/search\">Amazon Jobs</a> ที่เน้นงานออฟฟิศ จะมีแค่สองข้อแรก ส่วนเมนูที่เหลือจะเป็นเรื่องอื่นๆ ที่ชาวออฟฟิศสนใจ เช่น diversity หรือ leadership principles แทน</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/09/working-amazon.png\" /></p>\n<p>แต่พอเป็นการชักจูงให้คนทำงานรายชั่วโมงมาทำงานที่นี่ ข้อ 3-4 ที่เป็นพื้นฐานสำคัญจึงต้องถูกขับเน้นให้เด่นชัดขึ้นถึงขั้นเป็นเมนูแยกต่างหาก ชวนให้ระลึกถึงว่า มันเป็นความจำเป็นพื้นฐานจริงๆ ในการตัดสินใจว่าอยากทำงานที่นี่หรือไม่</p>\n<p>และเราก็สามารถนำหลักการทั้ง 4 ข้อ กลับไปถามตัวเองได้เสมอในฐานะนายจ้าง ว่าเราตอบคำถามทั้ง 4 ข้อนี้ให้กับทั้งพนักงานปัจจุบัน และว่าที่พนักงานในอนาคตได้ดีจริงๆ เต็มปากเต็มคำแล้วหรือยัง</p>The post <a href=\"https://markpeak.net/reasons-to-work/\">Reasons to Work</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"212e0ce7f654f066b16ecb3a6df5192fc0a979b5c4c56e9dc0d849fd1cb359cb","category":"Thai"}