{"title":"A new model approach to mapping bioclimatic comfort conditions","link":"http://link.springer.com/10.1007/s00704-023-04816-3","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Bioclimatic comfort is the state of please with the climatic conditions of the environment in which people live. These are situations in which the human body does not experience cold or heat stress and the hypothalamus in the human brain is not stimulated. Uncomfortable conditions cause many social and physical problems. In the study, bioclimatic comfort conditions were determined according to the PET (Physiological Equivalent Temperature) index using the RayMan model. The study developed a new modeling approach for producing bioclimatic comfort maps. The model was making using the measurement of the reference station. Base maps were used for the spatial distribution of PET values. Base maps include the following: elevation, solar radiations, land cover, mean radiant temperature (MRT), and wind velocity. These base maps were used because they vary in short distances and affect PET values. The distribution of bioclimatic comfort conditions and base maps was prepared with Geographic Information Systems (GIS) software. The model output has been tested in three different climatic regions. In the tests performed, <em>R</em><sup>2</sup> (correlation coefficient) occurred between 0.996 and 0.999. RMSE (root mean square error) values occurred between 0.53 and 0.57ʡC. The IA (index of agreement) results were determined as 0.999 in the entire study area. It was see that the result was close to perfect. This showed that the model can be used in different climatic regions. It is recommend using this method approach in studies such as making sustainable and ecological city designs, determining appropriate site selections, and identifying urban heat islands.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"212fc42b18d41af9c1851e8f307ff1a26789ce91bb8d1b54f1b9398b180162f9","category":"Environment"}