{"title":"Transitional Strategies of Juvenile Green Sturgeon from a Riverine to a Brackish Water Environment","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/6637511?af=R","date":1708416000000,"content":"<p>Information on habitat transitions is critical to understand whether efforts to manage the freshwater phase of juvenile green sturgeon (<i>Acipenser medirostris</i>) rearing habitats are feasible or beneficial. We implanted microacoustic transmitters in naturally produced age-0 juvenile green sturgeon in the Sacramento River to evaluate residency, general spatial distribution, movement rates, and downstream migration patterns over 300 river kilometers. Furthermore, we investigated whether changes in three environmental variables (discharge, turbidity, and water temperature) were associated with the beginning of movements resulting in the transition from riverine to brackish waters during their outmigration to the Sacramento-San Joaquin Delta Estuary. We captured 183 juvenile green sturgeon by trawl of which 88 were implanted with microacoustic tags. An additional 10 individuals were collected and tagged from the Red Bluff Diversion Dam rotary-screw traps. Linear mixed models showed that individuals caught by trawl had longer upper river residence times, post-tagging, than those caught by trap. Intergate velocity models showed that trap-caught individuals relocated at higher upper river reach velocities than trawl-caught fish, but there were no differences between trap- and trawl-caught fish within the middle or lower reach. Detections showed that juvenile green sturgeon began the downstream transition to brackish water habitat when discharge and turbidity increased. Temperature was not found to significantly influence the initiation of downstream migration. Both continuous and stepped downstream migration patterns were observed in each of the four cohorts, with smaller individuals being more likely to exhibit stepped migration. These data provide information that was previously unknown about the life history of the southern distinct population segment of the North American green sturgeon and can be utilized to assist with water resource management and recovery of this threatened fish species.</p>","author":"William R. Poytress, \nLeo C. Polansky, \nJoshua J. Gruber, \nMohammed A. E. Naiel","siteTitle":"Wiley: Journal of Applied Ichthyology: Table of Contents","siteHash":"411fbab4e21e579add0b45892c8bae33151f2fc1dcfa886f71382f3516ee5117","entryHash":"2137ff6dc56db5c9c9d190321cb0da766d6edad98d8c4d406fe3005b95f220aa","category":"Environment"}