{"title":"What Wi-Fi 6E means for the future of the iPhone","link":"https://www.macworld.com/article/334313/wifi-6e-explained-spectrum-speeds-reliability-iphone-ipad-mac.html","date":1637243719000,"content":"<div>\n<section><div></div></section><p>It was just a few short years ago when we told you about a then-upcoming wireless technology called <a href=\"https://www.macworld.com/article/231968/wi-fi-6-faq.html\">Wi-Fi 6</a>. At the time, what was once known as 802.11ax was henceforth given a much more consumer-friendly name, and previous convoluted Wi-Fi standards got similar names: 802.11ac became Wi-Fi 5, 802.11n became Wi-Fi 4, and so on.</p>\n\n\n\n<p>And now we have an even newer name, Wi-Fi 6E. In short, it’s an updated version of Wi-Fi 6  that includes access to the new 6GHz frequency band. But while it doesn’t bring new technology over Wi-Fi 6, this new frequency could be a huge deal and will make a major impact on the future of wireless networking. Recent rumors suggest that Wi-Fi 6E could show up <a href=\"https://www.macworld.com/article/352696/2022-iphone-14-rumors-specs-design-release-date.html\">as early as the iPhone 14</a>.</p>\n\n\n\n<h2>What’s up with that E?</h2>\n\n\n\n<p>It’s hard to believe, but the Wi-Fi standard has been using the same chunks of the 2.4GHz and 5GHz frequency bands for over 20 years! Wi-Fi 6 is just the latest attempt to use fancy processing to wring more bandwidth out of it and make it more reliable.</p>\n\n\n\n<p>In April of 2020, the FCC took the long-awaited step of offering up <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.fcc.gov/document/fcc-opens-6-ghz-band-wi-fi-and-other-unlicensed-uses&amp;xcust=1-1-334313-1-0-0&amp;sref=https://www.macworld.com/feed\">1,200MHz of new unlicensed spectrum in the 6GHz range</a>, more spectrum for Wi-Fi than we’ve ever gotten at once. Wi-Fi 6E is simply the first technology to support these new radio frequencies. It didn’t get a new name because it’s not actually a new technology—the encoding standards and block size and all the other stuff are exactly the same as Wi-Fi 6.</p>\n\n\n\n<p>That’s also why it’s not called Wi-Fi 7, which is otherwise known as 802.11be and is still a few years out. Since it’s still Wi-Fi 6, Wi-Fi 6E is still classified as 802.11ax, but they stuck an “E” on there so people know which products are able to use the new 6GHz spectrum.</p>\n\n\n\n<h2>More spectrum means more bandwidth</h2>\n\n\n\n<p>Allow us to get technical for a moment: The 1200MHz of new spectrum in the 6GHz range is divided up into fourteen 80MHz channels and seven 160MHz channels (they overlap). Wi-Fi 6E routers can use these new channels in addition to the 2.4GHz and 5GHz channels already available to them, which means they can move a lot more data at once.</p>\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2021/03/wifi-6e-6ghz-100879782-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2021/03/wifi-6e-6ghz-100879782-large.jpg?auto=webp&amp;quality=85,70\" /></a></figure></div>\n\n\n\n\n<p>How much more bandwidth? Well, that will depend on the router and the device and what features they support, but we’re talking about <em>multi-gigabit</em> speeds at the high end. Wi-Fi 6E sets up Wi-Fi to support the internet of the future, speeds that are currently <em>way</em> faster than the internet coming into almost any home.</p>\n\n\n\n<p>Technically, the top theoretical limit of Wi-Fi 6E is the same as you’d get on the 5GHz band of Wi-Fi 6 (9.6Gbps), but you’re much more likely to one day test those limits with the big spacious 6GHz spectrum.</p>\n\n\n\n<p>Wi-Fi 6E also uses more antennas. With Wi-Fi 6 on the iPhone 13, Apple uses 2X2 MIMO (Multiple-Input Multiple-Output), which is a two-antenna configuration with two receiver antennas. Wi-Fi 6E could double that capability to 4X4, which would increase the bandwidth and download speed.</p>\n\n\n\n<h2>Less interference means better reliability</h2>\n\n\n\n<p>The other big selling point of Wi-Fi 6E is that there’s nothing else in that range contending with it. With Wif-Fi 6’s 2.5GHz and 5GHz spectrums have to fight with a ton of old Wi-Fi networks, microwave ovens, you name it, Wi-Fi 6E enjoys a bunch of big, wide channels. There are other technologies broadcasting in the 6GHz frequency range, but with so many big channels to work with, automated frequency control should be able to easily take care of it.</p>\n\n\n\n<p>Higher frequencies tend to mean lower latency, too, so your Wi-FI could get closer to wired networking responsiveness. There’s a downside, of course: higher frequencies also don’t travel as far or through walls as well, so Wi-Fi 6E doesn’t necessarily offer any improvements to range over regular Wi-Fi 6.</p>\n\n\n\n<h2>When is Wi-Fi 6E coming?</h2>\n\n\n\n<p>It’s already here! You can buy Wi-Fi 6E routers today from companies like <a href=\"https://www.techhive.com/article/3602817/linksys-wi-fi-6e-router-is-a-mesh-network-model.html\">Linksys</a> or <a href=\"https://www.techhive.com/article/3603028/netgear-nighthawk-raxe500-wi-fi-6e-router.html\">Netgear</a>. Of course, they’re very new and very expensive, and they’re only going to help if the devices you connect to them (laptops, tablets, phones, game consoles, and so on) also support Wi-Fi 6E. And most of them don’t, including the most recent iPhones, iPads, and Macs. </p>\n\n\n\n<p>Apple isn’t always the first to support a new Wi-Fi technology, but it doesn’t wait very long. With <a href=\"https://www.pcworld.com/article/3608416/samsung-galaxy-s21-ultra-review-all-of-android-for-somewhat-less.html\">the Samsung Galaxy S21 Ultra</a> already ushering Wi-Fi 6E support on Android phones, there’s a very good chance that the <a href=\"https://www.macworld.com/article/352696/2022-iphone-14-rumors-specs-design-release-date.html\">iPhone 14</a> will support Wi-Fi 6E. Higher-end Macs and iPads released in 2023 stand a very good chance of supporting it as well as Apple gets on board with the latest in wireless technology.</p>\n\n\n\n<p>So if you’re looking to update your router, you might want to wait a bit for the Wi-Fi 6E routers to come down in price. Wi-Fi 6 is great but Wi-Fi 6E is even better, and the last thing you want when investing in a new Wi-Fi system is buyer’s remorse.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"21383dc03278b449d1a485b1179ab19c49d5bd3ebe2ccc27520e39c48cbbe66d","category":"Apple"}