{"title":"Response of the shallow groundwater level to the changing environment in Zhongmu County, China","link":"http://link.springer.com/10.1007/s11600-023-01236-9","date":1727740800000,"content":"<h3>Abstract</h3>\n                    <p>The analysis of the influence of human activities and climate change on groundwater is an important basis for formulating groundwater management policies. However, the relationship between climate change, human activities and groundwater system is complex, and the research on the response of groundwater to changing environment is in the initial stage. In this paper, the interactions between groundwater water cycle and climate change and human activities are analyzed, based on climate change data and hydrogeological information from the Fifth Assessment Report of the Intergovernmental Panel on Climate Change (IPCC). The MODFLOW model was used to develop a numerical model of shallow groundwater movement in Zhongmu County, Henan province, and to predict the response of groundwater levels to climate change and human activities in three cases from 2016 to 2050. The results show that under the current scenario, the groundwater level will decrease at an average annual rate of 4.24 cm/A from 2016 to 2050. Under the climate change scenario, the precipitation increased by an average of 5.01%, the annual evaporation increased by an average of 17.84% and the annual temperature increased by an average of 1.29 °C from 2016 to 2050 under the three emission cases of RCP2.6, RCP4.5 and RCP8.5, under the climate change–autonomous human activities scenario, when water conservation and South–North Water Transfer Project water supply are implemented simultaneously, the water table will decrease by an average of 5.58 CMA per year under the direct impact scenario and by an average of 4.44 CMA per year under the indirect impact scenario, the water table dropped by 3.21 cm/A. The changing environment will have an important effect on groundwater circulation, and appropriate measures must be taken to deal with the continuous decline of groundwater level.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"2139ec1ed407ccf44e69b203e06332463730de0e81751928db491eb2835a7938","category":"Environment"}