{"title":"Evaluating the seasonal efficacy of commonly used chemical treatments on Varroa destructor (Mesostigmata: Varroidae) population resurgence in honey bee colonies","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae011/7683870?rss=1","date":1716854400000,"content":"<span><div>Abstract</div>The purpose of this research was to determine how common chemical treatments influence <span>Varroa destructor</span> (Anderson and Trueman) population resurgence rates (defined as time posttreatment for mite populations to reach 3 mites/100 adult bees) in managed honey bee (<span>Apis mellifera</span> L.) colonies seasonally. We conducted 2 experiments that followed the same basic protocol to address this purpose. We established 6 treatment groups in Experiment 1 in the fall of 2014: untreated control, Apivar, Apistan, CheckMite+, ApiLifeVar, and Mite Away II applied to 10 colonies per treatment. In Experiment 2, we applied 8 chemical treatments to each of 4 seasonal (spring, summer, fall, and winter) cohorts of honey bee colonies to determine how mite populations are influenced by the treatments. The treatments/formulations tested were Apivar, Apistan, Apiguard, MAQS, CheckMite+, oxalic acid (dribble), oxalic acid (shop towels), and amitraz (shop towels soaked in Bovitraz). In Experiment 1, Apivar and Mite Away II were able to delay <span>V. destructor</span> resurgence for 2 and 6 months, respectively. In Experiment 2, Apiguard, MAQS, oxalic acid (dribble), and Bovitraz treatments were effective at delaying <span>V. destructor</span> resurgence for at least 2 months during winter and spring. Only the Bovitraz and MAQS treatments were effective at controlling <span>V. destructor</span> in the summer and fall. Of the 2 amitraz-based treatments, the off-label Bovitraz treatment was the only treatment to reduce <span>V. destructor</span> populations in every season. The data gathered through this study allow for the refinement of treatment recommendations for <span>V. destructor</span>, especially regarding the seasonal efficacy of each miticide and the temporal efficacy posttreatment.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"2145f0931fe44ab8d1cb03d3657b2f8846db74952b85b829d3e07f8c49307d5b","category":"Environment"}