{"title":"Amazon เพิ่ม RFID ในระบบร้านค้าไม่มีแคชเชียร์ Just Walk Out รองรับสินค้าประเภทเสื้อผ้า","link":"https://www.blognone.com/node/135825","date":1695165609000,"content":"<div><div><div><p>Amazon มีระบบร้านค้าแบบไม่มีแคชเชียร์ <a href=\"https://www.blognone.com/node/115080\">Just Walk Out</a> ที่นำไปใช้กับร้านหลายแห่งอยู่แล้ว อย่างไรก็ตามด้วยการทำงานที่อาศัยข้อมูลจากกล้องบนเพดาน เซ็นเซอร์ตามชั้นวางสินค้า เพื่อดูว่าลูกค้าหยิบสินค้าใดบ้าง เป็นข้อมูลในการคิดเงินขั้นตอนสุดท้าย ก็ทำให้มีข้อจำกัดกับสินค้าบางประเภท</p>\n<p>สินค้ากลุ่มที่ Amazon บอกว่ามีข้อจำกัดในวิธีการนี้คือกลุ่ม Softline หรือเสื้อผ้า เครื่องแต่งกาย สินค้าเหล่านี้หากต้องขายด้วย Just Walk Out ก็ต้องอยู่บนชั้นวางสินค้า และใส่ไว้ในกล่องแยกเป็นชิ้น ซึ่งขัดแย้งกับพฤติกรรมการซื้อที่ลูกค้าต้องการเห็นตัวสินค้า ได้สัมผัส หยิบมาทาบลอง และบางทีก็วางกลับคืนเข้าชั้น</p>\n<p>Amazon จึงแก้ปัญหานี้โดยร่วมมือกับบริษัท Avery Dennison นำ RFID มาติดแท็กกับสินค้ากลุ่มดังกล่าว เช่น เสื้อผ้า หมวก โดยทดสอบกับร้านสินค้าที่ระลึกของสโมสรฮอกกี้ Seattle Kraken ลูกค้าเพียงหยิบเลือกสินค้าที่ต้องการ และจ่ายเงินด้วยบัตรเครดิต หรือใช้ฝ่ามือจ่ายผ่าน Amazon One ตรงประตูทางออกเป็นอันเสร็จขั้นตอน</p>\n<p>ปัจจุบันระบบ Just Walk Out มีการใช้งานในหลายแห่งในอเมริกา อังกฤษ ออสเตรเลีย ทั้งร้านค้าในสนามบิน, ร้านสินค้าที่ระลึกของหลายสโมสรกีฬา, สวนสนุก Six Flags Great Adventure และร้านค้าในมหาวิทยาลัยหลายแห่ง</p>\n<p>ที่มา: <a href=\"https://www.aboutamazon.com/news/retail/amazon-just-walk-out-rfid-technology\">Amazon</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ff195372237ff7e01f669c53220edc48.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/amazon-go\">Amazon Go</a></div><div><a href=\"/topics/retail\">Retail</a></div><div><a href=\"/topics/rfid\">RFID</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"214f8ae314cc9c39819c024699c84a54cb78bd731030fdec00ad6eb450e92f1a","category":"Thai"}