{"title":"เปิดตัว Samsung Galaxy Z Flip 5 ปรับเปลี่ยนไม่มาก ราคาเริ่มต้น 39,900 บาท","link":"https://www.blognone.com/node/135015","date":1690373838000,"content":"<div><div><div><p>Samsung เปิดตัว Samsung Galaxy Z Flip 5 รุ่นใหม่แล้ว ซึ่งคราวนี้ชูจุดเด่นหน้าจอด้านหลังอย่าง Flex Window (จอเล็ก) ที่ใหญ่ขึ้นจากรุ่นก่อน 3.78 เท่า เมื่อเทียบกับรุ่นก่อนหน้า</p>\n<p>Flex Window ได้รับการออกแบบใหม่หมดในเชิงซอฟต์แวร์ ซึ่งทำให้ผู้ใช้งานปรับแต่ง และใช้งานหน้าจอนี้ได้หลากหลายมากขึ้น อย่างการการใช้วิดเจ็ตต่าง ๆ เช่น ควบคุมการเล่นเพลง, อัพเดตความคืบหน้าในตลาดหุ้นของ Google Finance โดยสลับไปมาระหว่างวิดเจ็ตได้ทันที ด้วยการบีบหน้าจอเพื่อเปิดใช้งาน Multi Widget View เข้าถึงการตั้งค่า Wi-Fi หรือ Bluetooth, เรียกดูประวัติการโทรเพื่อโทรกลับสายที่ไม่ได้รับ และตอบกลับข้อความโดยใช้ Quick Reply ที่รองรับคีย์บอร์ด QWERTY เต็มรูปแบบ, ดูประวัติการแชทโดยไม่ต้องเปิดอุปกรณ์ ด้วยการปัดหน้าจอ, เข้าถึง Samsung Wallet เพื่อชำระเงิน, การเข้าถึงรหัส QR ไปจนถึง Boarding Pass, บัตรสมาชิก และ กุญแจดิจิทัล ต่าง ๆ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0aaca5dd55979b2d1a53925e802adee8.png\" /></p>\n<p>ในด้านกล้อง Galaxy Z Flip 5 สามารถถ่ายเซลฟี่ได้ด้วยกล้องหลังเหมือนเดิม รองรับการถ่ายภาพแบบแฮนด์ฟรี แก้ไข, ปรับโทนสี หรือลบภาพได้ด้วย Quick View ในหน้าจอ Flex Window เมื่อถ่ายรูปเสร็จจะมี Dual Preview ช่วยให้เพื่อนเห็นตัวเองใน Flex Window เพื่อให้สามารถปรับแต่งภาพได้ นอกจากนี้ยังมี Super Steady ที่เป็นการป้องกันการสั่นไหวของกล้อง และยังรองรับที่การจัดเฟรมอัตโนมัติ ช่วยให้มั่นใจได้ว่าไม่มีใครหลุดจากเฟรม</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/afe2715b2d27b77a39b26fc166cd84c7.png\" /></p>\n<p>Galaxy Z Flip 5 ปรับปรุง AI ทำให้ประสบการณ์การถ่ายภาพดีขึ้น ทั้งในสภาพปกติ และแสงน้อย โดยใช้อัลกอริทึมการประมวลผลสัญญาณภาพ (ISP) ที่ขับเคลื่อนด้วย AI จะแก้ไขสัญญาณรบกวนภาพที่มักจะทำให้ภาพที่มีแสงน้อยเสียคุณภาพไป และสามารถซูมแบบดิจิตอลได้สูงสุด 10 เท่า</p>\n<p>สเปคทางด้านอื่นมาคร่าว ๆ ดังนี้</p>\n<ul>\n<li>หน้าจอหลัก Infinity Flex 6.7 นิ้ว ความละเอียด FHD+ (2640 x 1080) รองรับ Adaptive Refresh rate 1-120Hz</li>\n<li>หน้าจอหลัง Super AMOLED 3.4 นิ้ว ความละเอียด 720 x 748 60Hz</li>\n<li>น้ำหนัก 187 กรัม</li>\n<li>ใช้ชิป Snapdragon 8 Gen 2 for Galaxy</li>\n<li>แรม 8 GB</li>\n<li>ความจุภายในมีให้เลือกระหว่าง 256 และ 512 GB</li>\n<li>มาตราฐานกันน้ำ และฝุ่น IPX8</li>\n<li>ความจุแบต 3,700mAh จำนวน 2 ก้อนรวมกัน</li>\n<li>รองรับ 5G, Wi-Fi 6E และ Bluetooth 5.3</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8a89936b39f47235b74029434430f8fc.png\" /></p>\n<p>ตัว Galaxy Z Flip 5 มีให้เลือกหลายสีได้แก่ Mint, Graphite, Cream, Lavender และสีพิเศษจากการสั่งในเว็บของซัมซุงได้แก่ สีเทา, สีน้ำเงิน, สีเขียว และ เหลือง โดยขายในราคา 39,900 บาท สำหรับความจุ 256 GB และ 45,900 บาท สำหรับความจุ 512 GB</p>\n<p>ที่มา - <a href=\"https://news.samsung.com/global/samsung-galaxy-z-flip5-and-galaxy-z-fold5-delivering-flexibility-and-versatility-without-compromise\">Samsung Newsroom</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/galaxy-z-flip\">Galaxy Z Flip</a></div><div><a href=\"/topics/samsung\">Samsung</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"215fb3a26256c5b31860492d01d61203646a343fa01dcfd1b859e4f520cbd7f3","category":"Thai"}