{"title":"An empirical study of feature extraction for Hubei folk art of carved paper-cutting","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311923","date":1729692000000,"content":"<p>by Zhen Yang, Yanqi Liu, Weiling Wang, Yu Li, Xiuxia Yuan</p>\r\n\r\nExcellent traditional culture is the root and soul of a nation, which is the carrier of historical precipitation and continuous development. In this aspect, Hubei folk art of carved paper-cutting has important cultural value and historical significance in the composition of Chinese traditional culture, which is a national intangible cultural heritage under key protection and urgently needs to be carried forward. This paper carried out an empirical study using the survey and comparative analysis methods on the feature extraction for Hubei folk art of carved paper-cutting. Through investigation and comparative analysis of vast artworks of Hubei carved paper-cutting, the classics are selected as the representative to extract the regional characteristics, the artistic values, and the composition and modelling methods. Results indicate that the common features exist on the artistic values in beautification of life and education, the composition principles of central-based, symmetry, balanced or conformal, and the modelling techniques using Yin and Yang carving, unobstructive perspective, distortion and exaggeration. However, the regional features in cultural expression, folklore communication, modelling skills are apparent and strong interlinked with the regional historical development in social activities, labor productivity and surrounding environment. This study provides a multi-dimensional perspective for the modern inheritance and development of traditional Hubei artworks of carved paper-cutting with specified characteristics.","author":"Zhen Yang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2174b771eac3b00fb57aa410621efaa04c9a3dc366b597040eba097f5abbfe5a","category":"Interdisciplinary"}