{"title":"The mediation effects of COVID-19-related traumatic stress symptoms and mentalization on the relationship between perceived stress and psychological well-being in healthcare workers transitioning to a post-pandemic world","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309561","date":1725458400000,"content":"<p>by Qian Wang, You Zhou, Gang Wang, Xinyu Pan, Sha Sha, Zhe Wang, Yinqi Liu, Tengfei Tian, Sixiang Liang</p>\r\nBackground <p>In context of COVID-19 as a collective trauma and the intense involvement of healthcare workers (HCWs) in the pandemic, perceived stress continues to have a tremendous impact on their psychological well-being. However, few studies have attempted to delineate the underlying mechanisms. This study examined whether COVID-19-related traumatic stress symptoms and mentalization act as mediators.</p> Methods <p>A sample of HCWs (N = 2610) from 22 hospitals in Beijing, China participated in this cross-sectional investigation. Data on their perceived stress, psychological well-being, the impact of event, and reflective function during the COVID-19 pandemic were collected using self-report questionnaires. Different mediating models were tested.</p> Results <p>COVID-19-related stress symptoms and mentalization independently mediate the association between perceived stress and psychological well-being. These two mediators also compose a serial mediation model. In particular, higher perceived stress inhibits the psychological well-being of HCWs through increased severity of traumatic stress symptoms, which in turn is associated with hypomentalizing.</p> Conclusion <p>These findings shed light on the mechanisms underlying the relationship between perceived stress and psychological well-being in HCWs. We strongly recommend incorporating a mentalization framework with trauma-informed practice in prevention and intervention work with this population during this and future healthcare crisis.</p>","author":"Qian Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"21779585a497cabef5c7281979dfd8fff7bf3710c000317b7d4249d600bbfbc6","category":"Interdisciplinary"}