{"title":"Exploring m6A‐linked aging genes in osteoarthritis and broad cancer spectrum: Prospects for diagnostic and therapeutic advancements","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24149?af=R","date":1706693099000,"content":"<h2>Abstract</h2>\n<p>Osteoarthritis (OA) is a prevalent degenerative joint disease that significantly impacts individuals and healthcare systems worldwide. However, the exploration of N6-methyladenosine (m6A)-related aging genes in OA pathogenesis remains largely underexplored. This study aimed to elucidate the role of m6A-related aging genes in OA and to develop a robust diagnostic model based on their expression profiles. Leveraging publicly available gene expression datasets, we conducted consensus clustering to categorize OA into distinct subtypes, guided by the expression patterns of m6A-related aging genes. Utilizing XGBoost, a cutting-edge machine learning approach, we identified key diagnostic genes and constructed a predictive model. Our investigation extended to the immune functions of these genes, shedding light on potential therapeutic targets and underlying regulatory mechanisms. Our analysis unveiled specific OA subtypes, each marked by unique expression profiles of m6A-related aging genes. We pinpointed a set of pivotal diagnostic genes, offering potential therapeutic avenues. The developed diagnostic model exhibited exceptional capability in distinguishing OA patients from healthy controls. To corroborate our computational findings, we performed quantitative real-time polymerase chain reaction analyses on two cell lines: HC-OA (representing adult osteoarthritis cells) and C-28/I2 (representative of normal human chondrocytes). The gene expression patterns observed were consistent with our bioinformatics predictions, further validating our initial results. In conclusion, this study underscores the significance of m6A-related aging genes as promising biomarkers for diagnosis and prognosis, as well as potential therapeutic targets in OA. Although these findings are encouraging, further validation and functional analyses are crucial for their clinical application.</p>","author":"Qiuchen Cai, \nWenyang Xia, \nQihang Su, \nHeng'an Ge, \nLiyang Chen, \nCentao Liu, \nBin'an Zhao, \nChao Xue, \nJinbiao Huang, \nChenlong Huang, \nJun Li, \nPeng Wu, \nBiao Cheng","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"218324be342a4241a53507399cdc16cb4e9433f04a660808a0215602d82fcc5a","category":"Environment"}