{"title":"The role of social norms, intergroup contact, and ingroup favoritism in weight stigma","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305080","date":1718892000000,"content":"<p>by Erin C. Standen, Andrew Ward, Traci Mann</p>\r\n\r\nAlthough average body size in the U.S. has increased in recent decades, stigma directed at individuals with higher weight has not diminished. In this study, we explored this phenomenon by investigating the relationship between people’s perceived social norms regarding higher weight and their reported levels of weight bias (i.e., anti-fat attitudes). Our predictions for perceived social norms drew on the concepts of intergroup contact and ingroup favoritism, which were also probed in this study. We hypothesized that both greater descriptive norms and more favorable injunctive norms regarding higher weight would be associated with lower reported weight bias. Individuals’ quantity and quality of social contact with people with higher weight were also predicted to be associated with lower weight bias. Finally, we predicted that individuals who perceived themselves as heavier would display ingroup favoritism (i.e., report less weight bias). Participants (<i>N</i> = 272) from the United States completed a set of online questionnaires about their perceived social norms, social contact with people with higher weight, and explicit weight bias. We found support for each of these pre-registered predictions (<i>p</i>s &lt; 0.03), and <i>post hoc</i> analyses revealed that quality, but not quantity, of social contact with individuals with higher weight was an important predictor of lower weight bias. Together, these findings provide insight into the social psychology of weight bias and help to lay a theoretical foundation for future efforts to reduce weight stigma.","author":"Erin C. Standen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2189b78cf2ed42e53d4a76c767f03b3bdfd69ac372dcc8b9659e5f69afa1d4ba","category":"Interdisciplinary"}