{"title":"AWS Control Tower adds new controls to help customers meet digital sovereignty requirements","link":"https://aws.amazon.com/blogs/aws/aws-control-tower-helps-customers-meet-digital-sovereignty-requirements/","date":1701112063000,"content":"<p>Today, we added to <a href=\"https://aws.amazon.com/controltower/\">AWS Control Tower</a> a set of 65 purpose-built controls to help you meet your digital sovereignty requirements.</p> \n<p>Digital sovereignty is the control of your digital assets: where the data resides, where it flows, and who has control over it. Since <a href=\"https://aws.amazon.com/blogs/aws/amazon_simple_q/\">the creation</a> of the AWS Cloud 17 years ago, we have been committed to giving you control over your data.</p> \n<p>In November last year, we launched <a href=\"https://aws.amazon.com/blogs/security/aws-digital-sovereignty-pledge-control-without-compromise/\">the AWS Digital Sovereignty Pledge</a>, our commitment to offering all AWS customers the most advanced set of sovereignty controls and features available in the cloud. Since then, we have announced several steps in that direction. The <a href=\"https://aws.amazon.com/ec2/nitro/\">AWS Nitro System</a> <a href=\"https://aws.amazon.com/blogs/security/delivering-on-the-aws-digital-sovereignty-pledge-control-without-compromise/\">has been validated by an independent third party</a> to confirm that it contains no mechanism that allows anyone at AWS to access your data on AWS hosts. We launched <a href=\"https://aws.amazon.com/dedicatedlocalzones\">AWS Dedicated Local Zones</a>, a piece of infrastructure that is fully managed by AWS and built for exclusive use by a customer or community and placed in a customer-specified location or data center. And more recently, we announced the construction of a new <a href=\"https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\">independent sovereign Region in Europe</a>.</p> \n<p>The introduction of AWS Control Tower controls that support digital sovereignty is an additional step in our roadmap of capabilities for data residency, granular access restriction, encryption, and resilience.</p> \n<p>AWS Control Tower offers a simple and efficient way to set up and govern a secure, multi-account AWS environment. It establishes a <a href=\"https://docs.aws.amazon.com/prescriptive-guidance/latest/migration-aws-environment/understanding-landing-zones.html\">landing zone</a> that is based on best-practices blueprints, and it enables governance using controls you can choose from a prepackaged list. The landing zone is a <a href=\"https://aws.amazon.com/architecture/well-architected/\">well-architected</a>, multi-account baseline that follows <a href=\"https://wa.aws.amazon.com/wellarchitected/2020-07-02T19-33-23/wat.concept.best-practice.en.html\">AWS best practices</a>. <a href=\"https://docs.aws.amazon.com/controltower/latest/userguide/controls.html\">Controls</a> implement governance rules for security, compliance, and operations.</p> \n<p>The level of control required for digital assets greatly varies across industries and countries. Customers operating in highly regulated sectors might have the obligation to keep their data in a specific country or region, such as the European Union. Others might have obligations related to data encryption and where the encryption keys are kept, and so on. Furthermore, digital sovereignty requirements evolve rapidly, making it challenging to define and implement all the required controls. Many customers have told us they are concerned that they will have to choose between the full power of AWS and a feature-limited sovereign cloud solution that could hamper their ability to innovate, transform, and grow. We firmly believe that you shouldn’t have to make this choice.</p> \n<p>AWS Control Tower helps reduce the time it takes to define, implement, and manage controls required to govern where your data is stored, transferred, and processed at scale.</p> \n<p>AWS Control Tower offers you a consolidated view of the controls enabled, your compliance status, and controls evidence across your multiple accounts. This information is available on the console and by calling our APIs. As requirements and AWS services evolve, AWS Control Tower provides you with updated controls to help you continually manage your digital sovereignty needs.</p> \n<p>Here are a couple of examples of the controls we added:</p> \n<ul> \n <li><strong>Operator access</strong> – Require that an <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> dedicated host uses an <a href=\"https://aws.amazon.com/ec2/nitro/\">AWS Nitro</a> instance type.</li> \n <li><strong>Controlling access to your data</strong> – Require that an <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (Amazon EBS)</a> snapshot cannot be publicly restorable.</li> \n <li><strong>Encryption at rest and in transit</strong>, including advanced key management strategies – Require an EC2 instance to use an AWS Nitro instance type that supports encryption in-transit between instances when created using the <code>AWS::EC2::Instance</code> resource type. It also requires that an <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (Amazon RDS)</a> database instance has encryption at rest configured to use an AWS KMS key that you specify for supported engine types.</li> \n</ul> \n<p>These are just four examples from three categories. We’ve added 65 new controls, with over 245+ controls available under the digital sovereignty category grouping. <a href=\"https://docs.aws.amazon.com/controltower/latest/userguide/controls-reference.html\">The full list is available in the AWS Control Tower documentation</a>.</p> \n<p>One of the technical mechanisms AWS Control Tower uses to prevent accidental data storage or flow in a Region is the <a href=\"https://docs.aws.amazon.com/controltower/latest/userguide/region-deny.html\">Region deny control</a>. This parameter allows system administrators to deny access to AWS services and operations in selected AWS Regions. Until today, Region deny control could only be applied for an entire <a href=\"https://docs.aws.amazon.com/prescriptive-guidance/latest/migration-aws-environment/understanding-landing-zones.html\">landing zone</a> and all its organizational units (OUs) and accounts. With this launch, you can configure a new Region deny control at the organizational unit level and select the services and IAM principals to allow based on your unique business needs.</p> \n<p><span><strong>Let’s see how to get started<br /> </strong></span>For this demo, let’s imagine that I want to restrict access to AWS services in a set of Regions.</p> \n<p>I open the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a> and navigate to <a href=\"https://console.aws.amazon.com/controltower/home/landing\">the AWS Control Tower page</a>. On the left navigation pane, under <strong>Control Library</strong> , I select <strong>Categories</strong> &gt; <strong>Groups</strong> &gt; <strong>Digital Sovereignty</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/01-Digital-Sov-Groups-Tab-v2.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/01-Digital-Sov-Groups-Tab-v2.png\" alt=\"Control Tower - Digital Sovereignty - 01\" width=\"800\" height=\"355\" /></a></p> \n<p>I can review the list of controls available.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/02-Digital-Sov-Groups-Detail-Page-v3.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/02-Digital-Sov-Groups-Detail-Page-v3.png\" alt=\"Control Tower - Digital Sovereignty - 02\" width=\"800\" height=\"1105\" /></a></p> \n<p>I locate and select the control I want to enable: <strong>Deny access to AWS based on the requested AWS Region for an organizational unit</strong>. There is a description of the control and a list of frameworks it applies to (<strong>NIST 800</strong> and <strong>PCI DSS</strong>). I select <strong>Enable control</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/03-OU-Region-Deny-Control-Abouts-Tab.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/03-OU-Region-Deny-Control-Abouts-Tab.png\" alt=\"Control Tower - Digital Sovereignty - 03\" width=\"800\" height=\"483\" /></a></p> \n<p>On the next page, I select the <strong>Organizational units</strong> (OU) for which I want to enable this control.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/05-Enable-Control-Step-1-Configured.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/05-Enable-Control-Step-1-Configured.png\" alt=\"Control Tower - Digital Sovereignty - 04\" width=\"800\" height=\"406\" /></a></p> \n<p>I select the AWS <strong>Regions</strong> where I will allow access. All Regions left unchecked will have their access denied once the control is enforced.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/07-Enable-Control-Step-2-Configured.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/07-Enable-Control-Step-2-Configured.png\" alt=\"Control Tower - Digital Sovereignty - 05\" width=\"800\" height=\"703\" /></a></p> \n<p>Then, I review the service control policy (SCP). It contains a <strong>Deny</strong> statement to prevent access to the services or APIs listed. Optionally, I can add <strong>NotActions</strong>. This is a list of exceptions. The services or APIs listed under <strong>NotActions</strong> are authorized. In this example, I deny everything excepted three APIs: <code>sqs:SendMessage</code>, <code>ec2:StartInstances</code>, and <code>s3:GetObject</code>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/09-Enable-Control-Step-3-Configured.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/09-Enable-Control-Step-3-Configured.png\" alt=\"Control Tower - Digital Sovereignty - 06\" width=\"800\" height=\"1044\" /></a></p> \n<p>On the last page, I add a list of <strong>IAM principals</strong> (users or roles) that will be exempted from the control. This is an exception list. I also tag my control as usual with AWS resources.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/11-Enable-Control-Step-4-Configured.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/11-Enable-Control-Step-4-Configured.png\" alt=\"Control Tower - Digital Sovereignty - 07\" width=\"800\" height=\"691\" /></a></p> \n<p>On the last screen (not shown here), I review all my parameters and select <strong>Enable control</strong>.</p> \n<p>I can verify the list of OU for which the control is enabled under the <strong>OUs enabled</strong> tab.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/14-OU-Region-Deny-Control-Enabled-OU-Tab.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/14-OU-Region-Deny-Control-Enabled-OU-Tab.png\" alt=\"Control Tower - Digital Sovereignty - 08\" width=\"800\" height=\"512\" /></a></p> \n<p>The summary page shows all Regions, APIs, and IAM principals enabled for this OU. All the rest is denied. I can update the parameters at any time.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/15-View-configuration-modal.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/17/15-View-configuration-modal.png\" alt=\"Control Tower - Digital Sovereignty - 09\" width=\"800\" height=\"372\" /></a></p> \n<p><span><strong>Pricing and availability<br /> </strong></span>AWS Control Tower is available in all commercial Regions and in US GovCloud.</p> \n<p>There is no additional charge to use AWS Control Tower. However, when you set up AWS Control Tower, you will begin to incur costs for AWS services configured to set up your landing zone and mandatory controls.</p> \n<p>Certain AWS services, such as <span>Organizations</span> and AWS IAM Identity Center, come at no additional charge. However, you will pay for services such as <a href=\"https://aws.amazon.com/servicecatalog/\">AWS Service Catalog</a>, <a href=\"https://aws.amazon.com/cloudtrail/\">AWS CloudTrail</a>, <a href=\"https://aws.amazon.com/config/\">AWS Config</a>, <a href=\"https://aws.amazon.com/cloudwatch/\">Amazon CloudWatch</a>, <a href=\"https://aws.amazon.com/sns/\">Amazon Simple Notification Service (Amazon SNS)</a>, <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a>, and <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Cloud (Amazon VPC)</a> based on your usage of these services. You only pay for what you use, as you use it. The <a href=\"https://aws.amazon.com/controltower/pricing/\">AWS Control Tower pricing page has the details</a>.</p> \n<p>The new AWS Control Tower controls alleviate the burden of identifying and deploying safeguards to meet your digital sovereignty requirements. This set of controls is fully managed, and we will update them as AWS services and digital sovereignty requirements evolve over time.</p> \n<p>Go and configure the <a href=\"https://console.aws.amazon.com/controltower/home/landing\">AWS Control Tower controls that help support your digital sovereignty requirements</a> today.</p> \n<a href=\"https://twitter.com/sebsto\">-- seb</a>","author":"Sébastien Stormacq","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"218f63d5af91c794564c55a149c7826c528c4a0734e9e495570dd07fb6b376be","category":"Tech"}