{"title":"Riffle algal and macroinvertebrate recovery from wet‐season flood disturbance in a tropical savannah river, Northern Australia","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2617?af=R","date":1706539818000,"content":"<h2>Abstract</h2>\n<p>Succession occurs when river biota recovers from the loss of biomass and diversity caused by flood disturbance, and has rarely been examined in the tropical savannah biome. Hypotheses are tested which address the environmental context and recovery of riffle macroinvertebrates in an Australian perennial, tropical savannah river, located in a catchment with low anthropogenic impact. Recovery occurred over a 32-week dry-season period of gradually declining discharge with near-stable water quality, after a 23-week wet-season flood-disturbance period, which was typical of the river's flow regime. Prolonged, benign environmental conditions during recovery facilitated the accrual of macroalgae. Macroinvertebrate abundance, mediated by macroalgal biomass, and diversity increased at a logarithmic, asymptotic rate over the recovery period. Macroinvertebrate assemblages and functional feeding groups (FFGs) tended to become more similar between consecutive sample dates as recovery progressed, though with variable abundances of core taxa (Orthocladiinae, Hydropsychidae, <i>Orthotrichia</i>, Chironominae and Pyralidae) and prominence of <i>Hydroptila</i> late in the recovery period. Filterer abundances fluctuated most, whilst the relative abundance of herbivorous shredders and predators generally increased. The return of macroinvertebrate abundance and diversity to its pre-disturbance state is attributed to the similar pre- and post-disturbance environmental conditions. Recovery broadly agreed with the secondary succession paradigm for macroinvertebrates. Macroinvertebrate succession was probably driven mainly by biotic factors, after the initial colonisation period. However, this requires elucidation and expansion of the current paradigm of river benthic succession from flood disturbance to address macroinvertebrate population dynamics under benign abiotic environmental conditions.</p>","author":"Simon Townsend","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"219aecc1fc56deb79ecf13ce8d554e342186bc1c25b47462a169074ce88f4343","category":"Environment"}