{"title":"How Students&rsquo; Well-Being, Education for Sustainability, and Sustainable Development Relate: A Theoretical Model","link":"https://www.preprints.org/manuscript/202405.1910/v1","date":1716964412000,"content":"This study investigates how students' well-being relates to sustainable development and education for sustainability at Prince Mohammad Bin Fahd University, Saudi Arabia. The authors endeavor to answer the question \"How Does Students' Well-Being Relate to Sustainable Development Via Education for Sustainable Development?\" and four sub-questions. Primary data were collected by semi-structured interviews exploring the viewpoints of twenty female and male students (n=26) aged between 18 and 26. The content analysis results have identified additional well-being and education for sustainability factors that influence sustainable education and, therefore, sustainable development. These antecedents include workload, transparency, grading criteria, fairness, belonging, work-life balance, mental health support, missing emotional intelligence factors, factors related to Education for Sustainable Development, such as instructors' role models, institutional commitment, leadership, and collaboration with government. In addition, the study developed a theoretical model for the relationship between antecedents for Education for Sustainable Development, Education for Sustainable Development, and Sustainable Development in the Saudi context. Finally, the study answers four research questions: What factors contribute to education for sustainable development? What are the antecedents of education for sustainable development? How do university educators contribute to sustainable education? How do the antecedents of education for sustainable development, education for sustainable development, and sustainable development relate?","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"21a01d11a5354f73651cec35518d8271c3db6ff8207486d2bffd1aa6688830d8","category":"Interdisciplinary"}