{"title":"California deploys AI-powered wildfire detection systems","link":"https://arstechnica.com/?p=1962998","date":1692913842000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/wildfiles_getty-800x450.jpg\" alt=\"Burning trees from wildfires and smoke cover the landscape in California, U.S. Photographer: David Swanson/Bloomberg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/wildfiles_getty.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>California's main firefighting agency, <a href=\"https://www.fire.ca.gov/\">Cal Fire</a>, is training AI models to detect visual signs of wildfires using a network of 1,039 high-definition cameras, reports <a href=\"https://www.nytimes.com/2023/08/24/us/wildfires-ai-detection-california.html\">The New York Times</a> and the <a href=\"https://www.latimes.com/california/story/2023-08-24/can-ai-fight-wildfires-california-is-counting-on-it\">Los Angeles Times</a>. When it sees signs of smoke, it quickly warns firefighters of emerging threats. During the pilot program, the system has already detected 77 wildfires before dispatch centers received 911 calls—about a 40 percent success rate, according to the NYT.</p>\n\n<p>Traditionally, Cal Fire detects emerging wildfires by relying on the same network of over 1,000 mountaintop cameras monitored by humans, who look out for signs of smoke. But it's tedious and tiring work. Phillip SeLegue, the staff chief of intelligence for Cal Fire, told the NYT that the new AI system has not only improved response times but also identified some fires early, allowing those blazes to be tackled while still being a manageable size.</p>\n<p>However, the technology is not without limitations. It can only detect fires that are visible to its network of cameras, and human intervention is still required to confirm the AI model's alerts. Engineers from <a href=\"https://www.digitalpath.net/\">DigitalPath</a>, the California-based company responsible for creating the software, have been manually vetting each fire the AI identifies. The process has been challenging, with many false positives from fog, haze, dust kicked up from tractors, and steam from geothermal plants, according to Ethan Higgins, a chief architect of the software. “You wouldn’t believe how many things look like smoke,” Higgins told the NYT.</p></div><p><a href=\"https://arstechnica.com/?p=1962998#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1962998&amp;comments=1\">Comments</a></p>","author":"Benj Edwards","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"21ac9ed95f10705ab9fc23db82fe35974a275b9d34b6108103b63be126250c5c","category":"Tech"}