{"title":"Uncovering Urban Palimpsest through Descriptive and Ana-Lytical Approaches to Urban Morphology. Understanding the Ottoman Urban Fabric of Bursa, T&uuml;rkiye","link":"https://www.preprints.org/manuscript/202407.2307/v1","date":1722251727000,"content":"This study investigates the structured spatial organization through a focus on streets, blocks and buildings, proposing them as fundamental components in conceptualizing cities as layered pal-impsests. Former Ottoman capital city, Bursa, serve as case study due to its rich evolutionary history and the potentiality of the urban heritage values/elements they demonstrate. Following the “Tanzimat” Era, a period marked by modernization and renewal, the urban fabric of Ottoman capital cities underwent significant reforms aimed at aligning them with the principles of mo-dernity. Maps dating back to the 19th century serve as the most illustrative sources for compre-hending the evolving character and layout of these cities. The foundational aspects of the charac-ter and appearance of the historic environment played crucial roles not only in shaping the mod-ern city but also in preserving and enhancing urban heritage areas by harmonizing them with contemporary urban conditions. Factors such as street age, street hierarchy, block typology, and the localization of historical landmarks are indispensable for grasping the developmental trajec-tory of these cities, offering insights that bridge spatial scales and span across historical eras. Employing a combination of qualitative and quantitative data, this research builds upon descrip-tive and analytical approaches to urban morphology. The methodology entails comprehensive morphological analysis, which involves assessing changes and persistence in the urban fabric of selected heritage site, both pre-existing and post-modernization, drawing from its historically scientific maps. The analysis focuses on abstracting key attributes such as type, configuration, size, and the relationship between the elements.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"21c0c33ac4b49072cbfbffe09127ca39c51c0ed720eaecce8c98c600852035ee","category":"Interdisciplinary"}