{"title":"Increased serum caspase-1 in adult-onset Still’s disease","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307908","date":1722261600000,"content":"<p>by Haruki Matsumoto, Shuhei Yoshida, Tomohiro Koga, Yuya Fujita, Yuya Sumichika, Kenji Saito, Jumpei Temmoku, Tomoyuki Asano, Shuzo Sato, Masashi Mizokami, Masaya Sugiyama, Kiyoshi Migita</p>\r\nBackground <p>Caspase-1 is a crucial component in the inflammasome activation cascade. This study evaluated the potential of serum caspase-1 level as an inflammatory biomarker in patients with adult-onset Still’s disease (AOSD).</p> Methods <p>The study included 51 consecutive patients diagnosed with AOSD based on the Yamaguchi criteria, 66 patients with rheumatoid arthritis (RA) as disease control, and 36 healthy controls (HCs). Serum caspase-1 concentrations were measured using enzyme-linked immunosorbent assay. The serum 69 cytokine levels were analyzed using a multisuspension cytokine array in patients with AOSD, and a cluster analysis of each cytokine was performed to determine specific molecular networks.</p> Results <p>Patients with AOSD had significantly increased serum caspase-1 levels versus patients with RA (<i>p</i> &lt; 0.001) and HCs (<i>p</i> &lt; 0.001). Additionally, serum caspase-1 demonstrated significant positive correlations with AOSD disease activity score (Pouchot score, r = 0.59, <i>p</i> &lt; 0.001) and serum ferritin (r = 0.54, <i>p</i> &lt; 0.001). Furthermore, among patients with AOSD, significant correlations existed between serum caspase-1 and inflammatory cytokines, including interleukin-18. Immunoblot analysis detected the cleaved form of caspase-1 (p20) in the serum of untreated patients with AOSD, not in those from patients with inactive AOSD receiving immunosuppressive treatments.</p> Conclusions <p>Caspase-1 is a useful biomarker for AOSD diagnosis and monitoring. Caspase-1 activation could be correlated with the inflammatory component of AOSD, specifically through proinflammatory cytokine induction via inflammasome activation cascades.</p>","author":"Haruki Matsumoto","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"21c544bae1a01dfeb484c1876044e78251a2764551da7e517a273bcd54564023","category":"Interdisciplinary"}