{"title":"Preliminary Analysis of Quality and Cryopreservation of Sex‐Reversed Female Culter alburnus Sperm","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/1672265?af=R","date":1688713200000,"content":"<p>Sex-reversed females are the fathers of all-female fish and their sperm quality directly affects the quality of all-female fish. In this study, fecundity, physiological characteristics, biochemical characteristics, ultrastructure, and viability of sex-reversed female sperm after cryopreservation were investigated to understand sperm quality. (1) The sex-reversed female sperm had a lower fertilization rate, hatching rate, and larval survival rate of 72 hr and higher larval deformation rate compared with normal male sperm. (2) The changes in activation rate between normal male and sex-reversed female sperm under different salinity and pH conditions were the same; the optimum salinity was between 0 and 4%, and the optimum pH was 5.5. (3) The preservation time of sex-reversed female sperm is significantly shorter than that of normal male sperm at room temperature. (4) Sex-reversed female sperm had lower ATPase content and <i>c/p</i> value than normal male sperm. (5) Ultrastructural injury including damaged membranes of the head and mitochondria, broken flagella, greater mitochondrial damage, and mitochondrial membrane expansion were found in the sex-reversed female sperm. (6) The most suitable antifreeze for cryopreservation of sex-reversed female and normal male sperm was 10% ethylene glycol and dilution was D-15, but the activation rate, movement, and life span of sex-reversed female sperm were reduced after cryopreservation. It was speculated that the sperm mitochondria of the sex-reversed female were more damaged than those of the normal male, which led to differences in fertility and cryopreservation.</p>","author":"Shun Cheng, \nMan Liu, \nShi-li Liu, \nJian-bo Zheng, \nMei-li Chi, \nWen-ping Jiang, \nYi-nuo Liu, \nXiao-ying Hang, \nMiao Peng, \nFei Li, \nDan-li Wang, \nUmit Acar","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"21c53eb93e54bba60a65089e00ca3098507c13cfb28ecdbb99cde369577971b3","category":"Environment"}