{"title":"T-Mobile Confirms Data Breach, Unclear If Personal Customer Data Was Accessed","link":"https://www.macrumors.com/2021/08/16/t-mobile-data-breach/","date":1629143381000,"content":"T-Mobile <a href=\"https://www.t-mobile.com/news/network/cybersecurity-incident-update-august-2021\">today confirmed</a> that some of its data had been accessed without authorization in a breach that may impact more than 100 million of its users.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/03/tmobilelogo.jpg\" />\r\n<br />\r\nOver the weekend, T-Mobile began investigating a forum post that offered data from more than 100 million people. T-Mobile was not mentioned in that post, but the person selling the data told <em><a href=\"https://www.vice.com/en/article/akg8wg/tmobile-investigating-customer-data-breach-100-million\">Motherboard</a></em> that it had come from T-Mobile's servers, thus leading T-Mobile to look into it. The hacker who spoke to <em>Motherboard</em> claimed that several T-Mobile servers had been breached.\r\n<br />\r\n\r\n<br />\r\nT-Mobile has now confirmed that there was indeed unauthorized access to some customer data, but T-Mobile <a href=\"https://www.t-mobile.com/news/network/cybersecurity-incident-update-august-2021\">in a statement says</a> it does not yet know if personal customer data has been accessed. \r\n<br />\r\n\r\n<br />\r\n<blockquote>We have been working around the clock to investigate claims being made that T-Mobile data may have been illegally accessed. We take the protection of our customers very seriously and we are conducting an extensive analysis alongside digital forensic experts to understand the validity of these claims, and we are coordinating with law enforcement.\r\n<br />\r\n\r\n<br />\r\nWe have determined that unauthorized access to some T-Mobile data occurred, however we have not yet determined that there is any personal customer data involved. We are confident that the entry point used to gain access has been closed, and we are continuing our deep technical review of the situation across our systems to identify the nature of any data that was illegally accessed. This investigation will take some time but we are working with the highest degree of urgency. Until we have completed this assessment we cannot confirm the reported number of records affected or the validity of statements made by others.\r\n<br />\r\n\r\n<br />\r\nWe understand that customers will have questions and concerns, and resolving those is critically important to us. Once we have a more complete and verified understanding of what occurred, we will proactively communicate with our customers and other stakeholders.</blockquote>According to the original forum post, the data for sale includes social security numbers, phone numbers, names, physical addresses, IMEI numbers, and driver licenses information. <em>Motherboard</em> said that it was provided with some samples of data and was able to confirm that they contained accurate information on T-Mobile customers. \r\n<br />\r\n\r\n<br />\r\nT-Mobile says that the entry point used to gain access to the data has been closed, and it is now conducting a \"deep technical review\" of the situation to determine the nature of the data that was obtained. The company will not be able to confirm the reported number of records affected until the internal investigation is complete, and it plans to proactively communicate with customers when the information is available. <div>Tag: <a href=\"https://www.macrumors.com/guide/t-mobile/\">T-Mobile</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/16/t-mobile-data-breach/\">T-Mobile Confirms Data Breach, Unclear If Personal Customer Data Was Accessed</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/t-mobile-confirms-data-breach-unclear-if-personal-customer-data-was-accessed.2307748/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wQ_dioE237k:gJ_8J2L0lXk:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wQ_dioE237k:gJ_8J2L0lXk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/wQ_dioE237k\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"21d4d5896cd0e2963a74807f2dd450092850ef4a5caf0c78ffecedd91cfb14a7","category":"Apple"}