{"title":"Lineup Changes on Apple’s Board of Directors: Al Gore and James Bell Retire; Wanda Austin Joins","link":"https://www.apple.com/newsroom/2024/01/wanda-austin-to-join-apples-board-of-directors/","date":1705096651000,"content":"\n<p>Apple Newsroom:</p>\n\n<blockquote>\n  <p>Apple today announced Dr. Wanda Austin, former president and CEO \nof The Aerospace Corporation, has been nominated for election to \nApple’s board of directors. Dr. Austin brings decades of science \nand technology experience to her role, and she has a significant \ntrack record of advancing innovation and shaping corporate \nstrategy. </p>\n\n<p>As president and CEO of The Aerospace Corporation, Dr. Austin led \nan organization dedicated to supporting the U.S. space program and \nexpanding opportunities for future exploration. She was the first \nwoman and the first African American to hold the position. [...] </p>\n\n<p>The board has a longstanding policy that directors generally may \nnot stand for reelection after reaching age 75. As a result, Al \nGore, who has served since 2003, and James Bell, who joined in \n2015, will both retire from Apple’s board this year. </p>\n\n<p>“We’re deeply grateful to Al and James for their many years of \nservice to Apple — their insights, energy, and values have made \nus a stronger company in so many ways,” said Cook. “For more than \n20 years, Al has contributed an incredible amount to our work — from his unconditional support for protecting our users’ privacy, \nto his incomparable knowledge of environment and climate issues.” </p>\n</blockquote>\n\n<p>I strongly suspect that even if Gore had never joined the board, Apple would be a staunchly environmentally-minded company today, but surely Gore pushed them hard in that direction. And I think he was instrumental in Apple’s hiring of Lisa Jackson.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/12/apple-board-lineup\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"21da60f3031d1690d01aec8fe79fa7f4a28564bc797109d69f875ff042ddba47","category":"Tech"}