{"title":"Aluminum mining waste could be a source of green steel","link":"https://arstechnica.com/?p=1998830","date":1706140538000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/image-10-800x461.jpeg\" alt=\"Image of a largely green landscape with a large, square area of red much in the center.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/image-10.jpeg\">Enlarge</a> <span>/</span> A red mud retaining pond in Germany. (credit: <a href=\"https://creativecommons.org/licenses/by-sa/3.0\">Wikimedia Commons</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The metals that form the foundation of modern society also cause a number of problems. Separating the metals we want from other minerals is often energy-intensive and can leave behind large volumes of toxic waste. Getting them in a pure form can require a second and considerable energy input, increasing the associated carbon emissions.</p>\n<p>A team of researchers from Germany has now figured out how to handle some of these problems for a specific class of mining waste created during aluminum production. Their method relies on hydrogen and electricity, which can both be sourced from renewable power and extracts iron and potentially other metals from the waste. What's left behind may still be toxic but isn't as environmentally damaging.</p>\n<h2>Out of the mud</h2>\n<p>The first step in aluminum production is the isolation of aluminum oxide from the other materials in the ore. This leaves behind a material known as red mud; it's estimated that nearly 200 million tonnes are produced annually. While the red color comes from the iron oxides present, there are a lot of other materials in it, some of which can be toxic. And the process of isolating the aluminum oxide leaves the material with a very basic pH.</p></div><p><a href=\"https://arstechnica.com/?p=1998830#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1998830&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"21eb478736a272ffd752e667352f24a47bb6e6529eed8ed5b013c56a479ec97b","category":"Tech"}