{"title":"Complementary environmental analysis and functional characterization of lower glycolysis-gluconeogenesis in the diatom plastid","link":"https://academic.oup.com/plcell/article/36/9/3584/7688883?rss=1","date":1717632000000,"content":"<span><div>Abstract</div>Organic carbon fixed in chloroplasts through the Calvin–Benson–Bassham Cycle can be diverted toward different metabolic fates, including cytoplasmic and mitochondrial respiration, gluconeogenesis, and synthesis of diverse plastid metabolites via the pyruvate hub. In plants, pyruvate is principally produced via cytoplasmic glycolysis, although a plastid-targeted lower glycolytic pathway is known to exist in non-photosynthetic tissue. Here, we characterized a lower plastid glycolysis–gluconeogenesis pathway enabling the direct interconversion of glyceraldehyde-3-phosphate and phospho-enol-pyruvate in diatoms, ecologically important marine algae distantly related to plants. We show that two reversible enzymes required to complete diatom plastid glycolysis–gluconeogenesis, Enolase and <span>bis-</span>phosphoglycerate mutase (PGAM), originated through duplications of mitochondria-targeted respiratory isoforms. Through CRISPR-Cas9 mutagenesis, integrative ‘omic analyses, and measured kinetics of expressed enzymes in the diatom <span>Phaeodactylum tricornutum</span>, we present evidence that this pathway diverts plastid glyceraldehyde-3-phosphate into the pyruvate hub, and may also function in the gluconeogenic direction. Considering experimental data, we show that this pathway has different roles dependent in particular on day length and environmental temperature, and show that the cpEnolase and cpPGAM genes are expressed at elevated levels in high-latitude oceans where diatoms are abundant. Our data provide evolutionary, meta-genomic, and functional insights into a poorly understood yet evolutionarily recurrent plastid metabolic pathway.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"21f234ab919e1a8d82cec5892cd332be804bd5cfcf107671534ed94a7c943df6","category":"Environment"}