{"title":"Influence of four hook types across four hook removal tools, including bare hands, on the effectiveness of hook removal and reflex impairment of Bluegill (Lepomis macrochirus) captured from a lake in Eastern Ontario","link":"https://onlinelibrary.wiley.com/doi/10.1111/fme.12672?af=R","date":1701270012000,"content":"<h2>Abstract</h2>\n<p>Hook removal devices have been developed to enable rapid release of angled fish, yet little research has evaluated their effectiveness and potential for injury among hook types. We compared the performance of hook removal tools and bare hands with four hook types on freshwater <i>Lepomid</i> sunfish. Dehooking performance was assessed using hook removal time, unhooking difficulty, degree of tissue damage at the hooking location, and immediate reflex impairment. Unhooking difficulty was positively related to hooking depth. Unhooking difficulty was lowest for hemostats and the mechanical dehooking device; however, the mechanical dehooking device caused the largest tearing of mouth tissue. Unhooking difficulty was the main driver for hook removal time, tissue tear length, and overall reflex impairment. Hooks that were harder to remove caused higher reflex impairment. Hook type had little influence on the effectiveness of hook removal tools, although circle hooks were more difficult to remove and caused greater injury when using tools. Although use of hook removal tools can be beneficial for fish that are released, more research is needed on more species targeted by recreational anglers, and more hook removal tools. We suggest that hemostats should be used to remove hooks from fish to reduce unhooking difficulty, tissue tears, long air exposure, and thereby to increase the welfare of the fish.</p>","author":"Jeremy Hussey, \nLuc LaRochelle, \nAndy J. Danylchuk, \nSascha Clark Danylchuk, \nBenjamin W. C. Cooke, \nJoshua T. H. Cooke, \nCameron J. A. Cooke, \nSteven J. Cooke","siteTitle":"Wiley: Fisheries Management and Ecology: Table of Contents","siteHash":"2b1b3fff230d9382f58e34a4967fc2d5f8d98012b5e160c81a8e044227f32245","entryHash":"21f3343e5bbdcfde88382b0eb9008da89a4fdbf8a65af15e7faffb2c142f3233","category":"Environment"}