{"title":"“Exploring therapeutic potential and toxicological profiles of Cuscuta species: insights from pharmacological studies and an anti-cholinergic toxicity report.”","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae160/7808465?rss=1","date":1727913600000,"content":"<span><div>Abstract</div>This study examines the therapeutic potential and toxicological profiles of <span>Cuscuta</span> species based on recent pharmacological investigations: “a therapeutic potential vs. toxicological risks of <span>Cuscuta</span> species: a pharmacological-toxicology dilemma.” The study encompasses diverse research areas, including the mitigation of Bisphenol A (BPA)-induced ovarian damage using <span>Cuscuta chinensis</span> flavonoids (CCFs), acute and sub-acute toxicity assessments of <span>Cuscuta chinensis Lam.</span> water extract (CLW), and observations on <span>Cuscuta campestris</span> toxicity in horses. In addition, this scientific study discusses the interplant communication dynamics between soybean and the parasitic dodder (<span>Cuscuta australis</span>) under nutrient deficiency conditions. Key significant findings highlight the efficacy of CCFs in alleviating BPA-induced ovarian damage, the safety profile of CLW within specified doses, and clinical manifestations of <span>C. campestris</span> toxicity in horses. Moreover, insights into interplant communication mechanisms emphasise the significance of protein-mediated interactions in nutrient-deficient environments. The report illustrates the potential toxicity of Dodder in humans, and further research findings into its chemical composition and toxicological profiles reveal great data on its phytotoxicity. Greater awareness and understanding of the risks associated with consuming Dodder and other similar plant species are crucial for preventing plant intoxication and have been a significant major focus of the present toxicology study of <span>Cuscuta</span> species. Hence, by addressing these objectives, the scientific study aims to balance the therapeutic benefits of Cuscuta species with their potential toxicological risks, contributing to a more nuanced understanding of their role in pharmacology and toxicology. This dual focus is crucial for guiding future research and informing safe usage practices.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"21fb9d9af503359fcc1c98b03a7663a1f8c657f4bda6595741b82c6cda09e9d5","category":"Environment"}