{"title":"A time trial win, but a slender margin: Is Remco Evenepoel starting to struggle at the Giro d’Italia?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-time-trial-win-but-a-slender-margin-is-remco-evenepoel-starting-to-struggle-at-the-giro-d-italia","date":1684089308000,"content":"\n      <p><span>Nine hundredths of a second. This was the margin by which Remco Evenepoel won stage nine of the 2023 Giro d’Italia ahead of Geraint Thomas. He was just 0.02 of a second in front of Tao Geoghegan Hart in third place. By comparison, when he took victory in the race’s opening individual time trial, he put almost one minute into the Ineos Grenadiers duo. Today’s stage was longer and less technical – something many expected to suit Evenepoel even better. It’s fair to say that in the last nine days, everything has changed in this year’s edition of La Corsa Rosa. It may be the same rider standing on the top step of the podium, but behind him the jaws of his rivals are snapping at his heels, closing in on Evenepoel like predators hungry for their prey.</span></p>\n<div></div>\n<p><span>It’s a testament to Evenepoel’s palmarès and past performances that a stage win at the Giro d’Italia still raises questions about his form. We’ve become so accustomed to seeing the road world champion dominate by huge margins in individual time trials in the past that anything else seems out of the ordinary. When he came through the intermediate first time check eleven seconds ahead of Thomas, everything seemed to be going as expected, but when he’d slipped down to third at the final one, that was when this Giro really felt like it had shifted gear.</span></p>\n\n<p><span>In his post-race interview, Evenepoel told reporters: “The first part was good, the second bad. In the first part I was able to follow the pacing plan as we envisioned it. But in the second part I felt worse. It is certainly not the best time trial I have done.”</span><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/FF66718_1024x1024.jpg?v=1684089200\" alt /></span><span>Without reading too much into the Soudal-Quick Step’s body language and physical appearance, he did not appear to be elated with his stage victory. Speaking in a weary and monotone voice, with dark circles sitting deeply under his eyes, Evenepoel looked tired. It was a different rider to the one we watched at the start of this race, who answered questions with a cheeky air of confidence, who smiled on the podium with energy and enthusiasm. With over 70km of time trialling, the route of this year’s Giro looked to be almost tailor made for the Belgian rider who excels against the clock. Today should have been an opportunity for him to grow the gap to his rivals that he established on the very first stage of the race. Instead, although he still took victory, today's result will have given confidence to those who finished behind him.</span></p>\n<p><span></span><span>For the likes of Thomas and Geoghegan Hart to be so close to the world champion is a sign that he is not as far ahead of them physically as the first stage of this race indicated. There were glimpses of the 23-year-old’s weakness yesterday as he conceded time on the final climb to the Ineos Grenadiers riders and Primož Roglič during the run-in to Fossombrone, but today’s stage was an even clearer indicator that Evenepoel can be beaten in this race. He now sits 45 and 47 seconds in front of Thomas and Roglič, with Geoghegan Hart close behind at 50 seconds. The gaps get bigger as you look down the standings, but just three minutes separates the riders in the top-10 after nine days of racing.</span></p>\n<p><span>A rest day tomorrow might be exactly what Evenepoel needs to regain his momentum and it will give him a chance to recover physically, but the importance of today’s time trial could lie in how it impacts each rider mentally, too. For the GC contenders behind Evenepoel like Thomas and Geoghegan Hart, this can only be positive: they know that they are close enough to the world champion to attack him and put him under pressure in the next week of racing. For Evenepoel himself, despite the stage win, today has made him far more vulnerable than he was when he was putting close to one minute into these very same riders nine days ago. Today's stage might have still shown he was the fastest, but only by the slenderest of margins.</span></p>\n<p><span>Whether Evenepoel can regain his momentum again or not, if that nine hundredths of a second time gap in today’s ITT is anything to go by, we have got one hell of a race on our hands.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"22045d482805548aedd248dbdee3db806bbeb1f25357e78f63aa83ae58faa807","category":"Cycling"}