{"title":"A High‐Performance Coupled Human And Natural Systems (CHANS) Model for Flood Risk Assessment and Reduction","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036269?af=R","date":1720076400000,"content":"<h2>Abstract</h2>\n<p>In recent years, flood risk in urban areas has been rapidly increasing due to unsustainable urban development, changes of hydrological processes and frequent occurrence of extreme weather events. Flood risk assessment should realistically take into account the complex interactions between human and natural systems to better inform risk management and improve resilience. In this study, we propose a novel Coupled Human And Natural Systems (CHANS) modeling framework to capture the intricate interactive human behaviors and flooding process at a high spatial resolution. The new CHANS modeling framework integrates a high-performance hydrodynamic model with an agent-based model to simulate the complex responses of individual households to the evolving flood conditions, leveraging the computing power of graphics processing units (GPUs) to achieve real-time simulation. The framework is applied to reproduce the 2015 Desmond flood in the 2,500 km<sup>2</sup> Eden Catchment in England, demonstrating its ability to predict interactive flood-human dynamics and assess flood impact at the household-level. The study also further explores the effectiveness of different flood risk management strategies, including the provision of early warning and distribution of sandbags, in mitigating flood impact. The new CHANS model potentially provides a useful tool for understanding short-term human behaviors and their impact on flood risk during a flood event, which is important for the development of effective disaster risk management plans.</p>","author":"Haoyang Qin, \nQiuhua Liang, \nHuili Chen, \nVaruna De Silva","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"22249571766670b1146343059a06349eb3bd604e06357c3ae4e16650423ac401","category":"Environment"}