{"title":"Week in Review–June 4th, 2023","link":"https://www.dcrainmaker.com/2023/06/week-in-review-june-4th-2023.html","date":1685895549000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2019/08/WeekinReview_thumb3_thumb_thumb1_thu.jpg\"><img title=\"WeekInReview22\" src=\"https://media.dcrainmaker.com/images/2020/03/WeekInReview22.jpg\" alt=\"WeekInReview22\" width=\"720\" height=\"479\" /></a></p>\n<p>The Week in Review is a collection of both all the goodness I’ve written during the past week around the internet, as well as a small pile of links I found interesting – generally endurance sports related. I’ve often wondered what to do with all of the coolness that people write, and while I share a lot of it <a href=\"http://twitter.com/dcrainmakerblog\">on Twitter</a> and <a href=\"http://www.facebook.com/dcrainmaker\">Facebook</a>, this is a better forum for sending it on to y’all. Most times these different streams don’t overlap, so be on the lookout at all these places for good stuff!</p>\n<p>So with that, let’s get into the action!</p>\n<h3><span>DCR Posts in the Past Week:</span></h3>\n<p>Here’s all the latest on the site:</p>\n<p>Wednesday: <a href=\"https://www.dcrainmaker.com/2023/05/garmin-epix-pro-in-depth-review-now-in-three-sizes.html\">Garmin Epix Pro In-Depth Review: Now In Three Sizes!</a><br />\nWednesday: <a href=\"https://www.dcrainmaker.com/2023/05/garmin-fenix-7-pro-in-depth-review-flashlight-and-multiband-for-everyone.html\">Garmin Fenix 7 Pro In-Depth Review: Flashlight and Multiband for Everyone!</a><br />\nThursday: <a href=\"https://www.dcrainmaker.com/2023/06/the-complete-list-of-all-epix-fenix-pro-features-going-to-fr955-965-fenix-7-epix.html\">The Complete List of All Epix/Fenix Pro Features Going to FR955/965/Fenix 7/Epix</a><br />\nSunday: <a href=\"https://www.dcrainmaker.com/2023/06/hammerhead-revamps-karoo-user-interface-internet-revolts.html\">Hammerhead Revamps Karoo User Interface: Internet Revolts</a></p>\n<h3><span>YouTube Videos This Past Week:</span></h3>\n<p>Here’s what hit the tubes over on the You of Tube, <a href=\"http://youtube.com/dcrainmakerblog\">definitely don’t forget to subscribe there</a> to get notified of videos the second they hit!</p>\n<p></p>\n<p><span>﻿</span></p>\n<h3><span>Stuff I Found Interesting around the Interwebs:</span></h3>\n<p>Here’s a smattering of all the random things that I stumbled on while doing my civic duty to find the end of the Internet:</p>\n<p><strong>1) </strong><a href=\"https://www.pelobuddy.com/peloton-western-european-expand/\"><strong>Peloton discusses Western European expansion:</strong></a> It’ll be really interesting to see where they go here. Logically, they already have Spanish classes, so going into Spain makes sense. But at the same time, I think Peloton (and American companies in general), often overthink the must-have-in-native language thing. Plenty of companies offer products in various European markets without native content. And the demand for Peloton hardware products is absurdly high in Europe in countries where it’s not sold (one only need to look at how instantly the rare used listings disappear in France, the Netherlands, etc…).</p>\n<p><strong>2) </strong><a href=\"https://www.theverge.com/23728368/wwdc-2023-date-time-live-stream-watch-how-to-rumors\"><strong>Apple’s WWDC event is tomorrow, I’ll be there:</strong></a> While much of the circus will be focused on the rumored VR headset, I’ll likely be focused more on the watch side. Unless the VR headset has some unique sport/fitness applications – in which case, I’ll be there already.</p>\n<p><strong>3) </strong><a href=\"https://www.slowtwitch.com/Lifestyle/A_Comprehensive_70.3_Fueling_Guide_for_First-Timers_8687.html\"><strong>A Comprehensive Guide to Half-Iron Distance Fueling for First Timers:</strong></a> I found this guide both accurate in being comprehensive, and actually pretty informative. Thankfully, it also meshed with my recent fueling strategy for <a href=\"https://www.dcrainmaker.com/2023/05/ironman-aix-en-provence-race-report.html\">my race a few weeks ago</a>.</p>\n<p><strong>4) </strong><a href=\"https://petapixel.com/2023/05/17/new-california-wildfire-alert-system-is-a-network-of-1000-cameras/\"><strong>New California Wildfire Alert System is Network of 1,000 Cameras:</strong></a> Look, this is only vaguely sports/fitness (ok, maybe outdoors), but I found this fascinating. Thus, you get to hear about it.</p>\n<p><strong>5) </strong><a href=\"https://www.theverge.com/2023/5/24/23735576/samsung-galaxy-watch-6-rotating-bezel-leaked-renders\"><strong>Galaxy Watch 6 Might Get Rotating Bezel Back:</strong></a> Pretty self-explanatory title and post. I didn’t really care one way or another for the rotating bezel previously, but I would agree the digital variant (non-physical rotating bezel concept) mostly sucked. So if you’re gonna rotate, I want it to be physically moving like before.</p>\n<p><strong>6) </strong><a href=\"https://www.pelobuddy.com/cpsc-rear-guard-fix/\"><strong>Consumer Product Safety Commission approves Peloton Tread+ safety fix:</strong></a> Yes, it’s been like two years since Peloton yanked their larger slat-enabled Peloton Tread+ treadmill (the other smaller Peloton Tread model wasn’t subject to the recall). Peloton had said it was their goal to return back to the market with it. It’ll be interesting to see if they actually do however. Interestingly, despite the recall, people continued to use it – and people continued to get hurt (almost certainly kids or pets). The CPSC noted, “<em>Since the May 2021 recall, there have been 279 additional reported incidents and 61 additional reports of injuries</em><em>.” – </em>As I’ve noted before, this issue isn’t actually unique to the Peloton Tread+, one can easily find examples of the effect on YouTube on plenty of other treadmills. What’s more surprising to me is that despite all the warnings and new safety features (it auto-locks within seconds of stepping off the treadmill, and you can also remove the key too – keeping it even more locked down) – people still managed to keep hurting their kids. Sigh.</p>\n<p><strong>7) </strong><a href=\"https://nltimes.nl/2023/06/02/jumbo-stopping-max-verstappen-sponsorship-formula-1-season\"><strong>Jumbo Visma on sports sponsorship stoppages:</strong></a> While Jumbo dropping their cycling sponsorships (all sports actually) is old news, the new-news is that they’re also stopping their sponsorship of a very popular Formula 1 driver. I don’t care about motorsports, but I thought the CEO’s exact quote was really interesting and a good example of the balance between sponsoring a pro athlete and ROI:<em> “With Max Verstappen and Jumbo-Visma, we stop for a completely different reason. That sponsorship has brought us a lot of brand awareness, but we have now won everything there is to win.”</em> – He goes on to say that at this point, with Jumbo really only being a small brand in the Netherlands and Belgium, on the comparative world scale, it didn’t make sense for them anymore. Anyways, I thought it was a typically straightforward and practical Dutch answer to the question.</p>\n<p><strong>8) </strong><a href=\"https://www.engadget.com/fitbit-users-can-log-in-with-their-google-accounts-starting-on-june-6th-173329923.html\"><strong>Fitbit users can use Google accounts starting June 6th:</strong></a> This isn’t required yet, that’ll come in a couple of years (2025 to be exact). But if you want all your Fitbit &amp; Google stuff tied together, you’ll be able to do that starting this Tuesday.</p>\n<p>—</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"222726732bed7424a20ff6004ef7233adfb25454730648a37b681d86bf60278a","category":"Cycling"}