{"title":"Luteolin target HSPB1 regulates endothelial cell ferroptosis to protect against radiation vascular injury","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311922","date":1728655200000,"content":"<p>by Li Wen, Weiyuan Zhang, Jia Hu, Tao Chen, Yiming Wang, Changchang Lv, Min Li, Lisheng Wang, Fengjun Xiao</p>\r\n\r\nVascular endothelial damage due to ionizing radiation is the main pathological process of radiation injury and the main cause of damage to various organs in nuclear accidents. Ferroptosis plays an important role in ionizing radiation-induced cell death. We have previously reported that luteolin is highly resistant to ferroptosis. In the present study, body weight, microvessel count, H&amp;E, and Masson staining results showed that luteolin rescued radial vascular injury <i>in vivo</i>. Cell Counting Kit 8 (CCK8), Giemsa staining clarified the anti-ferroptosis ability of luteolin with low toxicity. Malondialdehyde (MDA), superoxide dismutase (SOD), NADP<sup>+</sup>/NADPH, Fe<sup>2+</sup> staining, dihydroethidium (DHE) and MitoTracker assays for ferroptosis-related metrics, we found that luteolin enhances human umbilical vein endothelial cells (HUVECs) antioxidant damage capacity. Drug affinity responsive target stability (DARTS), surface plasmon resonance (SPR), computer simulated docking and western blot showed that heat shock protein beta-1 (HSPB1) is one of the targets of luteolin action. Luteolin inhibits ferroptosis by promoting the protein expression of HSPB1/solute carrier family 7 member 11 (SLC7A11)/ glutathione peroxidase 4 (GPX4). In conclusion, we have preliminarily elucidated the antioxidant damage ferroptosis ability and the target of action of luteolin to provide a theoretical basis for the application of luteolin in radiation injury diseases.","author":"Li Wen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"222e2b7ac938f4fdcf2a383e99f81afc94edae79848a06686778063325d81508","category":"Interdisciplinary"}