{"title":"Charting the Intersection of Corporate Sustainability and Firm Performance: A Scientometric and Bibliometric Examination","link":"https://www.preprints.org/manuscript/202405.2118/v1","date":1717145393000,"content":"Corporate Sustainability has garnered increasing attention within the business community, as corporates communicate to influence its stakeholders for building sustainable relationships. There has been a surge in research exploring its connection to firm performance but, existing studies lack a cohesive and concentrated approach. This study employs scientometric and bibliometric methods to analyse scientific production which signals a scarcity of research from developing countries, indicating a need for greater investigation. Focussing on specific subfields of Corporate Sustainability and\nFirm Performance, we analyze and narrow down the scope of our study to a focussed sample. Employing use of structured methods and PRISMA Protocol, this scientifically\nrigorous study, points towards identification of research themes linking sustainability\npractices to firm performance for achieving business excellence. It goes beyond\nmapping of literature, thereby establishing linkages to Sustainable Development Goals\n(SDGs). Our analysis reveals clusters centered on Environmental Performance, Firm\nPerformance, Corporate Sustainability Reporting, Corporate Social Performance and\nGreen Supply Chain Management with significant citations related to various SDGs. We\nmake use of time series analysis to determine the future trends of research in the field.\nThis scientometric and bibliometric analysis study contributes to a more focused\nunderstanding of the linkages between corporate sustainability and firm performance,\nemphasizing the need for cohesive research approaches to address the complexities of\nsustainable business practices and their implications for financial performance and the\neconomy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2232551c39c093bb572f0f8bb286b6da919c3ca4518e03707689c279d609c4b8","category":"Interdisciplinary"}