{"title":"Antixenosis and antibiosis mechanisms of resistance to Asian rice gall midge, Orseolia oryzae (Wood‐Mason) in rice land races","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12876?af=R","date":1724923492000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d7330e08-fb1d-42b6-9b1f-2da1e081686f/aab12876-toc-0001-m.png\" alt=\"Antixenosis and antibiosis mechanisms of resistance to Asian rice gall midge, Orseolia oryzae (Wood-Mason) in rice land races\" />\n<p>Rice gall midge resistance was governed by antixenosis and antibiosis mechanisms working in tandem. Antixenosis tests showed susceptible genotypes were preferred for egg laying and had faster adult emergence with a higher sex ratio. Resistant genotypes had higher levels of phenols, wax, flavonoids, and free amino acids, while susceptible ones had more sugars and protein. This study informs breeding for gall midge-resistant rice varieties.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Asian rice gall midge is one of the important pests of rice, which attacks the crop from nursery to the end of the tillering stage. Managing this pest through plant resistance is the most viable and economical. Two hundred-two rice genotypes were phenotyped against Asian rice gall midge, <i>Orseolia oryzae</i> (Wood-Mason) and the mechanism of resistance in terms of antixenosis and antibiosis was studied. Antixenosis mechanism for adult settlement and egg laying indicated that the susceptible genotypes were preferred more than the resistant genotypes in a free choice test. First instar maggots were found and did not continue their growth on resistant genotypes further. However, in susceptible genotypes, they molted successfully and emerged as adults. No choice tests revealed that the emergence of adults in susceptible genotypes took less time than in resistant genotypes. Higher adult sex ratio was found in susceptible genotypes. Estimation of biochemical components in rice shoot apices of selected genotypes revealed that higher levels of total phenols, wax content, total flavonoids and total free amino acids were present in the resistant genotypes. Still, the number of total sugars, reducing sugars and total protein contents were significantly higher in the susceptible genotypes. Hence, the resistance mechanism in rice gall midge was displayed as a combination of antixenosis and antibiosis mechanism. The output of the study would be helpful in breeding for rice varieties resistant to Asian rice gall midge.</p>","author":"Nandini Sahu, \nBasana Gowda Gadratagi, \nGovindharaj Guru‐Pirasanna‐Pandi, \nNaveenkumar B. Patil, \nNabaneeta Basak, \nPrakash Chandra Rath, \nChandrappa Anilkumar, \nLadu Kishore Rath","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"223681f3c55754503474003efa2b553a1db588ce3de68e1131ab612e506c2d21","category":"Environment"}