{"title":"Caleb Ewan is out of the Tour de France with a fractured collarbone","link":"https://cyclingtips.com/2021/06/caleb-ewan-is-out-of-the-tour-de-france-with-a-fractured-collarbone/","date":1624898931000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/ewan-1-650x433.jpg\" /></div><h2>Caleb Ewan is out of the Tour de France with a fractured collarbone</h2><p>\n</p><p>Caleb Ewan (Lotto-Soudal) has abandoned the <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a> after taking a bad fall in the finale of Monday’s <a href=\"https://cyclingtips.com/2021/06/tim-merlier-wins-a-crash-marred-stage-3-of-the-tour-de-france/\">stage 3</a> and breaking his collarbone in multiple places.</p>\n\n\n\n<p>In the final few hundred meters of a stage that had already seen several big names hit the deck, Ewan was sitting third wheel at the head of the pack as Jasper Philipsen (Alpecin-Fenix) led riders around the final corner, with Peter Sagan (Bora-Hansgrohe) in close proximity on Ewan’s left and making some contact with his shoulder. Then, as Tim Merlier (Alpecin-Fenix) was jumping out of the saddle start his sprint just behind Philipsen and just in front of Ewan, Ewan clipped Merlier’s rear wheel.</p>\n\n\n\n<p>As the 26-year-old Australian fell to his left side, he took Sagan down with him.</p>\n\n\n\n<p>Merlier went on to take the stage win. Sagan was quickly back up, but Ewan remained on the ground for quite some time, clearly in pain. He did not finish the stage, ultimately abandoning the race and being taken away in an ambulance.</p>\n\n\n\n<p>After the stage, Lotto-Soudal confirmed that Ewan had suffered a broken collarbone in the crash, with Ewan himself eventually providing an update and explaining the way his unfortunate experience in the finale played out.</p>\n\n\n\n<p>“It all happened quite quickly, but I just remember that I wanted to go quite early in the chicane. But yeah, I started riding, sprinting on the left, and then I started, and then saw that the the guys on the front were closing to the right, so then I had to stop sprinting and then afterward to open up again,” Ewan said. “I think when all that happened, then I became next to Peter and then we were quite close together on the on the wheel, and then when Merlier went against the right, then I just touched the wheel and then went down. It all happened quite quickly. Usually when you crash, you obviously don’t feel so much, like the adrenaline is there, but straight away I felt a lot of pain, and then they [the doctors] were pressing on my collarbone and I could feel it like clicking.</p>\n\n\n\n<p>“It’s the first bone I’ve ever broken, but they told me it’s broken in four spots. They said it’s broken in four spots. It’s enough to get some surgery on it to to put it back into place. But I think out of any bone to be broken, I think it’s one of the good ones, or one of the ones [where] it’s easiest to come back.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/caleb-ewan-is-out-of-the-tour-de-france-with-a-fractured-collarbone/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"2237b12b521f7ce1d56777b092302a2eb813bc82391a6664a7e3214b86adb9ff","category":"Cycling"}