{"title":"The role of seasonal hypoxia and benthic boundary layer exchange on iron redox cycling on the Oregon shelf","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12476?af=R","date":1703324107000,"content":"<h2>Abstract</h2>\n<p>Widespread hypoxia occurs seasonally across the Oregon continental shelf, and the duration, intensity, and frequency of hypoxic events have increased in recent years. In hypoxic regions, iron reduction can liberate dissolved Fe(II) from continental shelf sediments. Fe(II) was measured in the water column across the continental shelf and slope on the Oregon coast during summer 2022 using both a trace metal clean rosette and a high-resolution benthic gradient sampler. In the summer, Fe(II) concentrations were exceptionally high (40–60 nM) within bottom waters and ubiquitous across the Oregon shelf, reflecting the low oxygen condition (40–70 μM) at that time. The observed inverse correlation between Fe(II) and bottom water oxygen concentrations is in agreement with expectations based on previous work that demonstrates oxygen is a major determinant of benthic Fe fluxes. Rapid attenuation of Fe(II) from the benthic boundary layer (within 1 m of the seafloor) probably reflects efficient cross-shelf advection. One region, centered around Heceta Bank (~ 44°N) acts a hotspot for Fe release on the Oregon continental shelf, likely due to its semi-retentive nature and high percent mud content in sediment. The results suggest that hypoxia is an important determinant of the inventory of iron is Oregon shelf waters and thus ultimately controls the importance of continental margin-derived iron to the interior of the North Pacific Basin.</p>","author":"Natalya Evans, \nAlexis E. Floback, \nJustin Gaffney, \nPeter J. Chace, \nZachary Luna, \nJoël Knoery, \nClare E. Reimers, \nJames W. Moffett","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"223c825c6ecadf657adf2a54363ac6177fa5ba562ec228c321be2c7355ac0f92","category":"Environment"}