{"title":"Fish Diversity Assessment in the Malaysian Straits: Insights into Climate Change Resilience","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/3913221?af=R","date":1723559698000,"content":"<p>The Malaysian Straits, a region of significant ecological and economic importance, face growing challenges due to climate change and human activities. This study aimed to assess fish diversity in the Pulai River, situated within the Malaysian Straits, and examine the impact of urbanization and climate change on these fish populations. Rapid industrialization, urbanization, and agricultural runoff have contributed to habitat degradation and water pollution, exacerbating stressors on marine ecosystems. The objective of this study was to evaluate the current status of fish diversity and understand how environmental changes affect fish diversity. Field surveys were conducted to identify fish species in the Pulai River, with specimens collected and categorized into families. The study identified representatives from families such as Latidae, Serranidae, Lutjanidae, Polynemidae, Sciaenidae, Scombridae, and Carangidae, with Carangidae emerging as the dominant family, accounting for 163 individuals out of a total of 380 fish observed. Diversity indices for the marine fish community were calculated, yielding a diversity index (<i>H</i>′) of 2.02143, a species richness index (<i>R</i>′) of 2.474168, and an evenness index (<i>E</i>′) of 0.877896. The analysis revealed a positive allometric growth pattern (<i>b</i> = 1.73), indicating that as fish length increases, their weight decreases disproportionately. These findings highlight the complex responses of fish populations to environmental stressors such as water quality deterioration and habitat alteration. This study provides valuable insights into the fish ecology of the Malaysian Straits, particularly regarding the impacts of urbanization and climate change on fish diversity. The research supports informed conservation efforts aimed at preserving biodiversity in this ecologically significant region. Recommendations for future studies include ongoing monitoring of fish populations, assessment of specific pollutants and habitat changes, and the implementation of targeted conservation strategies to mitigate the impacts of urbanization and climate change on marine ecosystems in the Malaysian Straits.</p>","author":"Mai Izatul Nuraishah Mior Hazri, \nNoorashikin Md Noor, \nSajjad Pourmozaffar","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"2240780d31805540d67bb12a4d0b937e1cf86e603b4693743c4ed0544a09cb6a","category":"Environment"}