{"title":"iPhone 16 to Feature First A-Series Chip Designed Specifically for Standard Models","link":"https://www.macrumors.com/2023/09/25/iphone-16-first-chip-designed-for-standard/","date":1695647652000,"content":"The A17 chip designed for the <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a> and ‌iPhone 16‌ Plus will be made using a fundamentally different manufacturing process to the A17 Pro in the <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> to cut costs, according to a rumor that has now been clarified by a reliable source.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/A17-Feature-Dark.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nA <a href=\"https://weibo.com/u/1833340431\">Weibo user</a> who claims to be an integrated circuit expert with 25 years of experience working on Intel's Pentium processors was first to <a href=\"https://www.macrumors.com/2023/06/23/apple-to-switch-tech-behind-a17-to-cut-costs/\">float the rumor in June</a>. Now, the same source has clarified Apple's apparent plan for its standard iPhones' chip in 2024.\r<br />\n\r<br />\nThe ‌iPhone 15 Pro‌'s A17 Pro chip is fabricated <a href=\"https://www.macrumors.com/2023/05/15/apple-tsmc-3nm-production-capacity/\">using TSMC's N3B process</a>, but Apple reportedly plans to switch to the lower-cost N3E process for next year's standard A17 chip designed for the ‌iPhone 16‌ and ‌iPhone 16‌ Plus. This will mark the first time that Apple has designed a chip specifically for its standard <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> models. In previous years, Apple simply gave the entire ‌iPhone‌ lineup the same chip before staggering them by one year between the standard and the Pro models starting with 2022's <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a>.\r<br />\n\r<br />\nThe A15 Bionic chip in the ‌iPhone 14‌ and ‌‌‌iPhone 14‌‌‌ Plus is a higher binned variant with one additional GPU core than the A15 used in the ‌<a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a>‌ and ‌‌‌iPhone 13‌‌‌ mini, so some cross-generational differences despite outwardly featuring the same chip would not be unheard of, but this would effectively be the retention of the same name on a fundamentally different chip.\r<br />\n\r<br />\nN3B is TSMC's original <a href=\"https://www.macrumors.com/guide/3nm/\">3nm</a> node created in partnership with Apple. N3E, on the other hand, is the simpler and cheaper node that most other TSMC clients will use. N3E has fewer EUV layers and lower transistor density than N3B, resulting in lower efficiency. N3B has also been ready for mass production for longer than N3E, but it has much lower yield. N3B was effectively designed as a trial node and is not compatible with TSMC's successor processes including N3P, N3X, and N3S, meaning that Apple has to redesign its future chips to take advantage of TSMC's innovations.\r<br />\n\r<br />\nApple was originally believed to be planning to use N3B for the A16 Bionic chip, but had to revert to N4 because it was not ready in time. It is likely the case that Apple is using the N3B CPU and GPU core design <a href=\"https://www.macrumors.com/2022/12/23/iphone-14-pro-setback-removed-graphics-processor/\">originally designed for the A16 Bionic</a> in the A17 Pro, before switching to the original A17 designs with N3E later in 2024. This architecture will presumably be iterated on through TSMC's successor nodes for chips like the \"A18\" and \"A19.\"\r<br />\n\r<br />\nThe Weibo user was first to say that the standard ‌iPhone 14‌ models would retain the A15 Bionic chip, with the A16 being exclusive to the ‌iPhone 14‌ Pro models – a rumor that went on to be widely corroborated and turned out true. Earlier this month, Haitong International Securities analyst Jeff Pu <a href=\"https://www.macrumors.com/2023/09/12/iphone-16-rumored-to-feature-enhanced-a17-and-8gb/\">corroborated the rumor</a> about 2024's A17 chip being fabricated with N3E, adding that the ‌iPhone 16‌ and ‌iPhone 16‌ Plus will also feature 8GB of memory, up from 6GB on the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> and ‌iPhone 15‌ Plus.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/apple-silicon/\">Apple Silicon</a>, <a href=\"https://www.macrumors.com/guide/phone-chip-expert/\">Phone Chip Expert</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/25/iphone-16-first-chip-designed-for-standard/\">iPhone 16 to Feature First A-Series Chip Designed Specifically for Standard Models</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-16-to-feature-first-a-series-chip-designed-specifically-for-standard-models.2404586/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"22416d0bc869ed82ac2e26663aab7fbd98194371e50486b2db94b19eb02b79ac","category":"Apple"}