{"title":"Biophysical characteristics, distribution and conservation challenges of critically endangered Bhutan poppy (Papaver bhutanicum) in Jigme Dorji National Park, Bhutan不丹吉格梅多吉国家公园中极度濒危的不丹罂粟（Papaver bhutanicum）的生物物理特征、分布和保护挑战","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.40?af=R","date":1713263431000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3fd6aa9e-e900-4f29-9d2c-8f46449fe2a9/inc340-gra-0001-m.png\" alt=\"Biophysical characteristics, distribution and conservation challenges of critically endangered Bhutan poppy (Papaver bhutanicum) in Jigme Dorji National Park, Bhutan 不丹吉格梅多吉国家公园中极度濒危的不丹罂粟（Papaver bhutanicum）的生物物理特征、分布和保护挑战\" /><p>Jigme Dorji National Park is the exclusive refuge for the critically endangered Bhutan poppy in Bhutan and worldwide, confined to alpine screes in Tshophu, Tshophu base and Jichudrakey base in Soe gewog, Thimphu. The primary conservation threats to this species stem from harvesting, grazing and trampling by livestock, despite the majority of Bhutan poppy flourishing in the southwestern aspect. To safeguard this rare and endemic plant, local communities must be informed about responsible Bhutan poppy collection and actively engaged in its protection.\n</p><br />\n<h2>Abstract</h2>\n<p>The occurrence of certain rare plant species in specific ecological habitats is intricately linked to a myriad of environmental conditions, encompassing both biotic and abiotic factors. The prioritisation of monitoring efforts becomes more impactful when conservationists possess a comprehensive understanding of the ecology and distribution of rare species within their designated habitats and across the entire range of the species. In September 2023, a study was conducted in Jigme Dorji National Park to assess the ecology, distribution and threats to the critically endangered Bhutan poppy. This survey, employing random sampling, covered approximately 87 ha across Tshophu, Tshophu base and Jichudrakey base in Soe Gewog and analysed 202 2 × 2 m plots. The survey revealed 57 plant species from 24 families, with Asteraceae (17.5%) and Papaveraceae (12.3%) dominating. Notably, 46% of families comprised a single species, and significant species richness differences were observed between Tshophu, Tshophu base and Jichudrakey base. Correlations between species richness and environmental variables, including slope, rock cover (%), bare soil cover (%) and herb cover (%), were identified as significant. The Bhutan poppy was positively and significantly associated with the southwest aspect, occupying 59% of surveyed plots. Species distribution modelling predicted a distribution area of approximately 37.29 square kilometres within the national park. However, future climate scenarios indicated a significant shift in the distribution of the Bhutan poppy. By 2041–2060, there is an anticipated decrease of 33% in its distribution area, with a shift towards the northeast. In the period from 2061 to 2080, the distribution is expected to increase by 8% from its current range, maintaining the northeast shift. The study identified three primary threats: grazing, trampling and harvesting, with livestock activities prevalent in 92% of plots and signs of harvesting in 45%. These findings provide crucial insights into the ecological dynamics, distribution patterns and potential conservation challenges facing the Bhutan poppy in Jigme Dorji National Park's alpine habitats, emphasising the need for informed conservation strategies amidst changing environmental conditions.</p>\n<h2>摘要</h2>\n<p>某些珍稀植物物种在特定生态栖息地的出现与无数环境条件密切相关，包括生物因素和非生物因素。当保护工作者对稀有物种在其指定栖息地和整个分布区的生态和分布情况有了全面了解后，监测工作的优先次序就会变得更加有效。2023 年9月，在吉格梅多吉国家公园开展了一项研究，以评估极度濒危的不丹罂粟的生态、分布和面临的威胁。这项调查采用随机抽样的方式，覆盖了索悟（Soe Gewog）的梭布（Tshophu）、梭布基地（Tshophu base）和吉曲德基基地（Jichudrakey base）约87公顷的土地，分析了202个 2 ×2米的样方。调查发现了 24 个科的 57 种植物，其中以菊科（17.5%）和罂粟科（12.3%）为主。值得注意的是，46% 的科中只有一个物种，而且在Tshoph的高山流石滩、Tshophu基地和廷布Soe Gewog的Jichudrakey基地之间观察到显著的物种丰富度差异。物种丰富度与环境变量（包括坡度、岩石覆盖率（%）、裸土覆盖率（%）和草本覆盖率（%））之间存在显著相关性。不丹罂粟与西南坡向呈显著正相关，占据了 59%的调查样方。物种分布模型预测，不丹罂粟在国家公园内的分布面积约为 37.29平方公里。然而，未来气候情景表明不丹罂粟的分布将发生重大变化。到 2041–2060年，不丹罂粟的分布面积预计将减少33%，并向东北部转移。在 2061-2080年期间，不丹罂粟的分布范围预计将比目前增加8%，并保持向东北部转移的趋势。本研究识别出了三个主要威胁:放牧、践踏和采伐，其中92%的样方普遍存在牲畜活动，45% 的样方有采伐迹象。这些发现为了解不丹罂粟在吉格梅多吉国家公园高山栖息地的生态动态、分布模式和潜在保护挑战提供了重要信息，强调了在不断变化的环境条件下制定明智保护战略的必要性。【审阅:杨斌】</p>","author":"Pema Dendup, \nPema Kuenzang, \nTandin Dorji, \nWangchuk Wangchuk","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"224102062cc46bc9f4004d5d83e24c83a08267a0f92f209cdbb392d4740a9e1d","category":"Environment"}