{"title":"Se‐Methylselenocysteine Ameliorates DEHP‐Induced Ferroptosis in Testicular Sertoli Cells via the Nrf2/GPX4 Axis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24425?af=R","date":1727949213000,"content":"<h2>ABSTRACT</h2>\n<p>Di (2-ethylhexyl) phthalate (DEHP) is an important plasticizer in industrial production, and its toxic effects on testes are widely recognized. Se-methylselenocysteine (SMC) is a major selenium compound found in selenium-rich plants, which possesses unique biological properties such as antioxidants. However, the effect of SMC on DEHP-induced testicular injury and the specific mechanism remains unknown. In this study, 50 mice were randomly divided into 5 groups and were given corn oil (Control), DEHP, low-dose SMC (L-SMC), moderate-dose SMC (M-SMC), or high-dose SMC (H-SMC). The sperm quality of the mice in each group was determined, and HE staining and transmission electron microscopy (TEM) were applied to observe testicular morphology, and testicular tissues were collected for the subsequent molecular biological analyses. The TM4 cell line was applied in vitro for mechanism validation. Our results showed that DEHP could lead to decreased sperm quality and blood–testis barrier damage in mice, which could be alleviated by SMC. Mitochondrial damage accompanied by accumulation of total iron content, MDA, and 4-HNE, as well as downregulation of antioxidants SOD, GSH, and GSH-Px were observed after DEHP treatment, which exhibited a typical ferroptosis feature. In vitro experiments confirmed that SMC promoted upregulation of GPX4 in TM4 cells and was able to alleviate DEHP metabolite MEHP-induced ferroptosis and promote the expression of cell junction key proteins ZO-1, Occludin, and Connexin 43, which could be inhibited by the GPX4 inhibitor RSL3 or the Nrf2 inhibitor ML385. Overall, the above results suggest that SMC ameliorates the DEHP-induced ferroptosis in testicular Sertoli cells, protects the blood–testis barrier, and prevents sperm aberrations via the Nrf2/GPX4 axis.</p>","author":"Weilin Mao, \nYan Liu, \nWei Gu, \nWenchao Xu, \nJihong Liu, \nQing Ling, \nJiaxin Wang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"224a00f631d59f1cdbdee32a805b78cf8fcfe83e3b5e3df0112ef2eef7f94a95","category":"Environment"}