{"title":"Apple Reportedly Wants to Sell Products in Korean LG Retail Stores","link":"https://www.macrumors.com/2021/06/17/apple-selling-products-in-lg-stores/","date":1623913524000,"content":"Apple is reportedly eyeing a new partnership with LG that would allow the South Korean tech giant to sell iPhones, iPads, and Apple Watches at its more than 400 retail \"LG Best Shops\" in South Korea, according to a report from <a href=\"http://www.businesskorea.co.kr/news/articleView.html?idxno=69816\"><em>Business Korea</em></a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2017/09/apple-store-retail.jpg\" />\r\n<br />\r\n<a href=\"https://www.macrumors.com/2021/04/05/lg-to-shut-down-smartphone-business/\">LG recently shut down its smartphone business</a>, leaving retail space previously used for marketing its handsets being left empty. Apple is now, apparently, eyeing to use that retail space to sell its own iPhones, iPads, and Apple Watches. Apple's own retail presence in South Korea is <a href=\"https://www.macrumors.com/2021/02/19/second-apple-store-opening-south-korea/\">still relatively small</a>, and accepting a deal with LG to sell its products at more than 400 \"LG Best Shops\" is an easy way to expand its presence.\r\n<br />\r\n<blockquote>The two companies are reportedly discussing the establishment of separate Apple corners within the shops that are directly run by Apple employees or allowing LG Best Shop employees to sell Apple products after LG Electronics acquires the right to the sale of Apple products. The two sides have yet to decide when the partnership starts, but some market experts predict that it will be some time after the end of July when LG Electronics completely pull out of the smartphone business</blockquote>According to the report, LG and Apple are at a disagreement over the sale of Mac computers. LG sells its own \"Gram\" laptops, and offering Apple's Mac in the store would be a disadvantage. As a result, the two sides are likely only to agree on selling iPhones, iPads, and Apple Watches. An LG spokesperson said in a statement to <em>Business Korea</em> that \"nothing has been decided yet\" and that they're \"exploring all possibilities.\" <div>Tags: <a href=\"https://www.macrumors.com/guide/lg/\">LG</a>, <a href=\"https://www.macrumors.com/guide/south-korea/\">South Korea</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/17/apple-selling-products-in-lg-stores/\">Apple Reportedly Wants to Sell Products in Korean LG Retail Stores</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-reportedly-wants-to-sell-products-in-korean-lg-retail-stores.2301236/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=LQxv3xwjaAU:T29xNPuNSVc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=LQxv3xwjaAU:T29xNPuNSVc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/LQxv3xwjaAU\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"224f83ec4b964cda6f2d44abba67bd6a500963a3be04a6637a0d4e29d99cac3e","category":"Apple"}