{"title":"This is probably why Blue Origin keeps protesting NASA’s lunar lander award","link":"https://arstechnica.com/?p=1786407","date":1628706803000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/blueorigin_hlsannouncement_web-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/blueorigin_hlsannouncement_web.jpg\">Enlarge</a> <span>/</span> Blue Origin founder Jeff Bezos announces the company’s partnership with Lockheed Martin, Northrop Grumman, and Draper to develop a Human Landing System in 2019. (credit: Blue Origin)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>On Wednesday, the US Government Accountability Office released its full-but-redacted decision that ruled in favor of NASA's selection of a Human Landing System contractor. The document (<a href=\"https://www.gao.gov/assets/b-419783.pdf\">see PDF</a>) makes clear that SpaceX offered NASA the most technically ready, well-managed, lowest-cost option.</p>\n<p>Furthermore, the decision document says NASA was entirely justified in selecting a single winner for the lunar lander bid because Congress appropriated only about one-quarter of the funds sought by the space agency. NASA, the document states, \"expressly put all offerors on notice that the number of awards was subject to available funding, and the agency could make multiple contract awards, a single award, or no award at all.\"</p>\n<p>As it has already done several times since <a href=\"https://arstechnica.com/science/2021/04/nasa-selects-spacex-as-its-sole-provider-for-a-lunar-lander/\">NASA's original decision</a> to select SpaceX in April, Blue Origin greeted the GAO's full decision with a testy response. \"We stand by our assessment that SpaceX received preferential treatment,\" <a href=\"https://twitter.com/wapodavenport/status/1425433746757595141/photo/1\">the statement says</a>, in part.</p></div><p><a href=\"https://arstechnica.com/?p=1786407#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1786407&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2255ebb815a07d1435095d7f27a39c16aba0eca7f4874cbc9b3cc3df0925af2d","category":"Tech"}