{"title":"Google, Environmental Defense Fund will track methane emissions from space","link":"https://arstechnica.com/?p=2003398","date":1707941860000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/MethaneSAT-mapping-800x450.jpg\" alt=\"computer-generated image of a satellite highlighting emissions over a small square on the globe.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/MethaneSAT-mapping.jpg\">Enlarge</a> <span>/</span> With color, high resolution. (credit: Google/EDF)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>When discussing climate change, attention generally focuses on our soaring carbon dioxide emissions. But levels of methane have risen just as dramatically, and it's a far more potent greenhouse gas. And, unlike carbon dioxide, it's not the end result of a valuable process; methane largely ends up in the atmosphere as the result of waste, lost during extraction and distribution.</p>\n<p>Getting these losses under control would be one of the easiest ways to slow down greenhouse warming. But tracking methane emissions often comes from lots of smaller, individual sources. To help get a handle on all the leaks, the Environmental Defense Fund has been working to put its own methane-monitoring satellite in orbit. On Wednesday, it announced that it was partnering with Google to take the data from the satellite, make it publicly available, and tie it to specific sources.</p>\n<h2>The case for MethaneSAT</h2>\n<p>Over the course of 20 years, methane is 84 times more potent than carbon dioxide when it comes to greenhouse warming. And most methane in the atmosphere ultimately reacts with oxygen, producing water vapor and carbon dioxide—both of which are also greenhouse gasses. Those numbers are offset by the fact that methane levels in the atmosphere are very low, currently just under two parts per million (versus over 400 ppm for CO<sub>2</sub>). Still, levels have <a href=\"https://gml.noaa.gov/ccgg/trends_ch4/\">gone up considerably</a> since monitoring started.</p></div><p><a href=\"https://arstechnica.com/?p=2003398#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2003398&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"22648f9a3a0315d7924ec0c921b95a5b9e0928a98c60458e7a882ceb611a3656","category":"Tech"}