{"title":"Assessing the sustained effects of a water filter intervention: A 30-month longitudinal study in Rwamagana, Rwanda","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000161","date":1721916000000,"content":"<p>by Sabrina S. Haque, Miles A. Kirby, Laurien Iyakaremye, Alemayehu Gebremariam, Matthew C. Freeman, Howard H. Chang, Thomas Clasen</p>\r\n\r\nHousehold water treatment and safe storage interventions can improve microbiological water quality and reduce diarrheal disease in areas lacking access to safe water. However, with few studies evaluating effectiveness of interventions delivered programmatically for more than a year post-implementation, little is known about their sustainability. We aimed to assess the longer-term use and health effects of a household-based filter with a safe storage tank delivered through Rwanda’s Community based Environmental Health Promotion Programme (CBEHPP). We undertook a 30-month longitudinal study in Rwamagana district, following 608 households across 30 villages receiving the intervention. We conducted four unannounced follow-up visits and measured filter presence, condition and use as well as drinking water quality and child diarrhea prevalence approximately 6, 15, 24, and 30 months after the delivery of the intervention. Coverage of the water filter remained high throughout the follow-up period, with 94% of households observed to have the filter by the 30-month visit. Compared to the 6-month visit, the households with filters observed to be in good condition declined from 94.0% to 84.5% at the 30 month-visit. Reported use declined over this period from 96.9% to 84.3% of households, though presence of water in the storage tank of the filter fell from 81.4% to 59.4%. Fecal contamination of point-of-use drinking water did not get worse over the follow-ups compared to the 6-month visit. Child diarrhea prevalence in the study population varied over the follow up period, from 5.7% to 3.9%, 2.9% and 5.9% at 6, 15, 24 and 30 month visits, respectively. In summary, an intervention to promote uptake and use of water filters as part of the Rwandan national environmental health program was found to show that filters were still largely present, in good condition and in use after 30 months, meaning that the intervention effects were largely maintained.","author":"Sabrina S. Haque","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"22698656b27d23f1f35247e850b024f6f5ac39f3d4cb88ca33b581c4e5d0d5de","category":"Environment"}