{"title":"Variant hunters race to find new strains where variant testing lags","link":"https://arstechnica.com/?p=1755992","date":1618052404000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/data-visualization-800x533.jpg\" alt=\"Variant hunters race to find new strains where variant testing lags\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/data-visualization.jpg\" class=\"enlarge-link\" data-height=\"1600\" data-width=\"2400\">Enlarge</a> (credit: Marina Dekhnik | Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>In mid-February, three travelers were stopped at the airport in Luanda, Angola. Even during the pandemic, the country, a hub for the oil industry, had seen plenty of passengers from Europe and South Africa, where two concerning variants of the virus that causes Covid-19 hold sway. But the strains weren’t yet circulating widely in Angola, so this winter, health officials battened down the hatches. Before any passports get stamped, travelers receive a rapid antigen test and wait 30 minutes for a result. A negative test means self-quarantine, followed by another test a few days later. A positive test means a two-week stay at a quarantine hotel. For the three travelers, it was option two.</p>\n<p>A few weeks later, samples taken from their noses arrived 2,000 miles south in South Africa, at the lab of Tulio de Oliveira, a geneticist at the University of KwaZulu-Natal. He was in for a surprise. The virus that had infected these three travelers didn’t resemble the strains circulating in most other places, including those labeled as “variants of concern” for their ability to spread faster and evade certain types of immunity. If those variants are like siblings, this one was more like a forgotten second cousin. It came from a lineage of the virus that emerged in the early days of the pandemic but had disappeared soon thereafter, apparently outcompeted by other variants. And yet here it was, a year later. And it had been busy. The virus had since accumulated dozens of mutations, including many of the same ones that made those other strains worrisome because of increased transmissibility and immune evasion. It had arrived at a similar genetic conclusion all on its own.</p>\n<h2>A scarcity of data</h2>\n<p></p></div><p><a href=\"https://arstechnica.com/?p=1755992#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1755992&comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"226ae8674061582418061bc1e4a6ab72cfb926ca47fda08ff633631e42f8d7a8","category":"Tech"}