{"title":"The Influence of Cultural Factors on Supply Chain Integration in Multinational Corporations","link":"https://www.preprints.org/manuscript/202406.0209/v1","date":1717505735000,"content":"In today's globalized business environment, multinational corporations (MNCs) face significant challenges in achieving and sustaining effective supply chain integration across diverse cultural contexts. This qualitative research explores the influence of cultural factors on supply chain integration within MNCs, employing in-depth interviews and thematic analysis to uncover key insights. Findings reveal the complex interplay between culture and supply chain practices, highlighting challenges related to cross-cultural communication, trust-building, decision-making, and organizational culture alignment. However, the study also identifies opportunities for leveraging cultural diversity as a source of competitive advantage, emphasizing the importance of cultural intelligence and cross-cultural competence for supply chain professionals. The implications of the research extend to managerial practice, suggesting the development of culturally sensitive strategies for supply chain integration and investment in cultural training and development programs. Moreover, the study underscores the need for a holistic approach to supply chain integration that considers not only technical and operational aspects but also cultural and social dimensions. While the research offers valuable insights, limitations such as the qualitative nature of the study and the focus on supply chain managers' perspectives should be considered. Future research could address these limitations and explore the interdependencies among various contextual factors to enhance our understanding of cultural influences on supply chain integration in MNCs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"22749fbeb9102e86ac683d238da6aa011c8f414c2de5590eb2ae8f01a2bbe612","category":"Interdisciplinary"}