{"title":"Cryoprotective effects and mechanisms of soybean oligosaccharides on the grass carp (Ctenopharyngodon idellus) surimi during frozen storage","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13475?af=R","date":1720851246000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Conventional cryoprotectant mixtures (sucrose and sorbitol) impart excessive sweetness and calories to surimi. Therefore, there is a need to explore alternative cryoprotectants with low sweetness and low-calorie content. The cryoprotective effects and possible mechanisms of soybean oligosaccharides (SBOS) on the frozen stability of grass carp (<i>Ctenopharyngodon idellus</i>) surimi were investigated during 120 days of frozen storage in a comparison with commercial cryoprotectants (4% sucrose and 4% sorbitol, w/w).</p>\n<h2>RESULTS</h2>\n<p>SBOS at 6–8% (w/w) and commercial cryoprotectants could restrain water mobility and reduce thawing loss of frozen surimi by increasing non-freezable water content. SBOS could maintain the structural stability of proteins by preventing sulfhydryl groups from being rapidly oxidized to disulfide bonds, retarding the reduction of the solubility, Ca<sup>2+</sup>-ATPase activity and α-helix content of myofibrillar proteins (MP), as well as hindering the increasing surface hydrophobicity of MP of surimi during 120 days of frozen storage. The introduction of SBOS increased the gel strength and water-holding capacity of frozen-stored surimi. Compared with commercial cryoprotectants, 8% SBOS was more effective in stabilizing protein structure, whereas it was slightly less effective with respect to ice-forming inhibition.</p>\n<h2>CONCLUSION</h2>\n<p>The results obtained in the present study suggest that 8% SBOS could be potentially developed as a new cryoprotectant for surimi as a result of its ice-forming inhibition abilities and protein structure stability. © 2024 Society of Chemical Industry.</p>","author":"Yijie Mo, \nXia Zhang, \nLingzhi Zhang, \nXiao Guo, \nYanxin Lin, \nJing Ren, \nYuqin Ding","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"227888737ae37945864304ef2e44a50b9bdd2063245d3ff7d2fe2b3068a8c88c","category":"Environment"}