{"title":"Air India รายงานข้อมูลถูกแฮก กระทบผู้โดยสารกว่า 4.5 ล้านคน","link":"https://www.blognone.com/node/122812","date":1621704326000,"content":"<div><div><div><p>สายการบิน Air India รายงานเหตุการณ์ข้อมูลหลุดครั้งใหญ่ กระทบผู้โดยสารที่เคยโดยสารกับสายการบินกว่า 4.5 ล้านคนที่ลงทะเบียนผ่านระบบ SITA ซึ่งเป็นระบบเก็บและประมวลผลข้อมูลผู้โดยสารของ Air India ตั้งแต่เดือนสิงหาคมปี 2011 จนถึงช่วงปลายเดือนกุมภาพันธ์ที่ผ่านมา คิดเป็นเวลาราว 10 ปี</p>\n<p>สำหรับข้อมูลที่ Air India ระบุว่าหลุดออกไปมีทั้งชื่อผู้โดยสาร, วันเดือนปีเกิด, ข้อมูลการติดต่อ, ข้อมูลบัตรโดยสาร และข้อมูลโปรแกรมสมาชิก frequent flyer ของทั้ง Air India เอง รวมถึงของพาร์ทเนอร์สายการบินสมาชิกในกลุ่ม Star Alliance ด้วย ซึ่งข้อมูล frequent flyer จะมีหลุดในส่วนของชื่อ, เลขสมาชิก และสถานะของสมาชิกเท่านั้น (ไม่มีรหัสผ่านหลุดออกไป)</p>\n<p>ส่วนข้อมูลการชำระเงินก็มีหลุดออกไปในครั้งนี้เช่นกัน โดยเฉพาะข้อมูลบัตรเครดิต แต่ไม่มีเลข CVV/CVC หลุดออกไปในการรั่วครั้งนี้</p>\n<p>Air India รับทราบเหตุการณ์นี้ครั้งแรกตั้งแต่วันที่ 25 กุมภาพันธ์ที่ผ่านมา เริ่มออกแจ้งเตือนครั้งแรกวันที่ 19 มีนาคม ซึ่งตอนนี้ทางสายการบินได้จัดการล็อกดาวน์เซิร์ฟเวอร์ที่ได้รับผลกระทบ และรีเซ็ทรหัสผ่านของโปรแกรมสมาชิก frequent flyer ของบริษัทแล้ว รวมถึงทำการสืบสวนเหตุการณ์ครั้งนี้ทันทีที่ได้รับรายงานความผิดปกติ</p>\n<p>โฆษกของ SITA ระบุว่า การรั่วของข้อมูลครั้งนี้ไม่ได้มีเฉพาะ Air India ที่ได้รับผลกระทบ แต่มีบางสายการบินที่ได้รับผลกระทบตามไปด้วย เช่น Lufthansa (และสายการบินลูก), Air New Zealand, Singapore Airlines, SAS, Cathay Pacific, Jeju Air, Malaysia Airlines และ Finnair</p>\n<p>ที่มา - <a href=\"https://www.bleepingcomputer.com/news/security/air-india-data-breach-impacts-45-million-customers/\">Bleeping Computer</a>, <a href=\"https://www.engadget.com/air-india-data-breach-163950054.html\">Engadget</a>, <a href=\"http://www.airindia.in/images/pdf/Data-Breach-Notification.pdf\">Air India</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a6e5394472f88ec1219990ad0cea35ba.jpg\" /><br />\nภาพจาก <a href=\"https://pixahive.com/photo/air-india-plane-through-mountains/\">Pixahive</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/security\">Security</a></div><div><a href=\"/topics/data-breach\">Data Breach</a></div><div><a href=\"/topics/air-india\">Air India</a></div><div><a href=\"/topics/airline\">Airline</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2278d4691b9627a49f4506a8ce8aafeeab6c305a6e32ce0424e81e4ed400d17c","category":"Thai"}