{"title":"New insights into population structure, demographic history, and effective population size of the critically endangered blue shark <i>Prionace glauca</i> in the Mediterranean Sea","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305608","date":1718632800000,"content":"<p>by Violaine Dolfo, Emilie Boissin, Matthieu Lapinski, Serge Planes</p>\r\n\r\nThe blue shark, <i>Prionace glauca</i>, is the most abundant pelagic shark in the open ocean but its vulnerability remains poorly understood while being one of the most fecund sharks. In the Mediterranean Sea, the blue shark is listed as Critically Endangered (CR) by the International Union for Conservation of Nature. The species is facing a strong decline due to fishing, and scientific data regarding its genetic structure and vulnerability are still lacking. Here, we investigated the genetic diversity, demographic history, and population structure of the blue shark within the Mediterranean Sea, from samples of the Gulf of Lion and Malta, using sequences of the mtDNA control region and 22 microsatellite markers. We also compared our mitochondrial data to previous studies to examine the Atlantic-Mediterranean population structure. We assessed the blue shark’s genetic vulnerability in the Mediterranean basin by modelling its effective population size. Our results showed a genetic differentiation between the Atlantic and the Mediterranean basins, with limited gene flow between the two areas, and distinct demographic histories making the Mediterranean population an independent management unit. Within the Mediterranean Sea, no sign of population structure was detected, suggesting a single population across the Western and Central parts of the sea. The estimated effective population size was low and highlighted the high vulnerability of the Mediterranean blue shark population, as the estimated size we calculated might not be sufficient to ensure the long-term persistence of the population. Our data also provide additional evidence that the Gulf of Lion area acts as a nursery for <i>P</i>. <i>glauca</i>, where protection is essential for the conservation strategy of the species in the Mediterranean.","author":"Violaine Dolfo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"227cede0805c3fb48780c3d7b7b7f90dd08c841bc10a0287b6d4c442ae7198cc","category":"Interdisciplinary"}