{"title":"Morphological Characteristics, Genetic Diversity, and Microsatellite Analysis of the Progenies (F1, F2, and Backcross Descendant) of Siniperca chuatsi and Siniperca scherzeri","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/6672569?af=R","date":1727360358000,"content":"<p>Hybridization is a common technique in the breeding of new varieties. In this study, we obtained F<sub>1</sub> and F<sub>2</sub> hybrids through interspecific hybridization between <i>Siniperca chuatsi</i> and <i>Siniperca scherzeri</i> and backcross offspring by backcrossing between F<sub>1</sub> and <i>Siniperca chuatsi</i>. We analyzed the morphological traits and genetic diversity of the parents and their progeny. The results showed that although most morphological traits of the progeny were not significantly different from those of their parents, the F<sub>1</sub> hybrids exhibited the most pronounced morphological variations. The F<sub>2</sub> and backcross hybrids appeared morphological differentiation within their populations. The CPL/CPW ratio emerged as a reliable marker for identifying hybrids morphologically. The expected heterozygosity for F<sub>1</sub> (0.6264), F<sub>2</sub> (0.6677), and backcross offspring (0.5260) were intermediate between <i>Siniperca chuatsi</i> (0.7388) and <i>Siniperca scherzeri</i> (0.3910), indicating a relatively high level of genetic diversity in the offspring. Additionally, the private allele frequency of F<sub>1</sub> and F<sub>2</sub> was higher than backcross offspring. One SSR marker (G<sub>5220</sub>) was identified as a specific molecular marker to distinguish the hybrid F<sub>1</sub> population from the parents, hybrid F<sub>2</sub>, and backcross F<sub>1</sub> populations by analyzing specific alleles. The result of <i>Ne</i>, <i>He</i>, <i>I</i>, and <i>PIC</i> confirmed that F<sub>2</sub> maintained the genetic diversity of F<sub>1</sub>. We speculated that both F<sub>1</sub> and F<sub>2</sub> have higher breeding potential. This study provides essential baseline data for genetic breeding of mandarin fish that will be instrumental in the future.</p>","author":"Zhilun Zhang, \nJijia Sun, \nShuang Liu, \nJiahui Chen, \nXuchong Wei, \nChenlei Huang, \nLi Lin, \nQiuxian Chen, \nXuange Liu, \nHaiyang Li, \nHuadong Yi, \nSheng Bi, \nLinqiang Han, \nJianhui Liang, \nYong Zhang, \nGuifeng Li, \nZhitao Qi","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"2286a0ed984181f4c679e9b95d89fbbfb56df01305626802bd97af1437f72cf9","category":"Environment"}