{"title":"How to join Apple’s beta program and try out new software","link":"https://www.macworld.com/article/674359/how-to-join-apples-beta-program-and-try-out-new-software.html","date":1685109576000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you’ve ever wanted to take an early look at new versions of Apple’s operating systems before they launch, and maybe help shape them in the process, then Apple’s beta program is something you should consider. This initiative allows developers and public beta testers to gain access to the updates before they’re released, so they can help test for bugs and give any new features a thorough workout before they’re unleashed on the general public.</p>\n\n\n\n<p>Apple will soon be revealing the details of the next round of operating system updates at its worldwide developers conference (<a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC</a>) – which kicks off with a Keynote on June 5. Soon after the keynote closes the first developer betas of <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17</a> and <a href=\"https://www.macworld.com/article/1670742/macos-14-release-date-features-compatibility-beta.html\">macOS 14</a> will arrive and it’s likely that lots of Apple fans will be interested in how they can get their hands on the beta versions of the new software. </p>\n\n\n\n<p>If you are keen to get involved in testing the new software – and any other Apple operating system – read on to find out how to apply. </p>\n\n\n\n<p>In this article we explain how to get involved with testing the betas, but also point out some of the reasons why you may wish to give it a pass and wait for the final versions of iOS 17,  macOS 14 and other OSs to arrive.</p>\n\n\n\n<h2><strong>What is the Apple beta programme?</strong></h2>\n\n\n\n<p>As the name suggests, this is a chance for volunteers to download a beta version of the new operating system for their device and test it out. It’s completely free and you can sign up for the following software:</p>\n\n\n\n<ul><li>iOS</li><li>iPadOS</li><li>macOS</li><li>tvOS</li><li>watchOS </li><li>HomePod software</li></ul>\n\n\n\n<p>The idea is that you install the pre-release software and use it as you would your normal OS and send Apple comments through the built-in Feedback Assistant regarding crashes or other behavioural anomalies that you encounter when testing your apps, or when using the software as you would normally.</p>\n\n\n\n<p>It comes in two flavours – Public and Developer – with the latter including some extra options that we outline below.</p>\n\n\n\n<h2>When will the iOS beta come out?</h2>\n\n\n\n<p>The first developer beta of iOS 16 usually arrives just after the WWDC keynote in June. So expect it to arrive on June 5. </p>\n\n\n\n<p>The first public beta of iOS is likely to arrive in late June or early July. </p>\n\n\n\n<h2>When will the macOS beta come out?</h2>\n\n\n\n<p>The first developer beta of a new version of macOS is also usually issued following the WWDC keynote. So expect the developer versions macOS 14 on June 5.</p>\n\n\n\n<p>There is a longer wait for the first public betas to arrive. The the first public beta of macOS may come a few weeks later than the iOS public beta, around the middle of July. </p>\n\n\n\n<h2>Who can join the Apple beta programme?</h2>\n\n\n\n<p>For the four operating systems mentioned at the top of the article (watchOS is slightly different), Apple offers two types of beta. The developer beta is available to any paid member of Apple’s Developer Program. You can enrol as a developer <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/enroll/&amp;xcust=1-1-674359-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">here</a>. It costs $99 a year.</p>\n\n\n\n<p>There also a free public beta testing programme that’s free and open to anyone with a valid Apple ID (iCloud accounts qualify) who goes to the \n<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/sp/betaprogram/welcome&amp;xcust=1-1-674359-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Apple Beta Software Program page</a> and signs up.</p>\n\n\n\n<p>You’ll obviously need to agree to the terms and conditions. Be sure to read them first, as participating in the programme can open your device up to code that has the potential to cause trouble with its functionality.</p>\n\n\n\n<p>Depending on whether you are joining the Developer Beta Program or the Public Beta you may also have to abide by an NDA. Be aware that releasing details of what you’re seeing in the beta may be breaking the rules.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Beta-Program.jpg?quality=50&amp;strip=all\" alt=\"How to get macOS, iOS beta\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Beta-Program.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Beta-Program.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Beta-Program.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/05/Apple-Beta-Program.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"683\" /><figcaption>Try out the new Apple operating systems early by joining the beta.</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2><strong>Is it safe to install the Apple beta?</strong></h2>\n\n\n\n<p>There are a few reasons why becoming a beta tester for the next version of iOS or macOS might seem attractive. For a start you might gain bragging rights for being one of the first to use the new software. However, Apple regards the programme as confidential, so you won’t actually be able to blog or post on social media about the features or problems until Apple itself makes them public knowledge.</p>\n\n\n\n<p>Becoming a beta tester also gives you a chance to shape the development of the software – your feedback could be invaluable in stopping a bug or just generally improving the quality of the software on your Mac or iPhone. You will be providing a service to others in ensuring that all bugs are ironed out before the final release.</p>\n\n\n\n<p>However, beta software, by its very nature, is unstable and it’s worth noting that participating in Apple’s macOS Beta Seed Program is not a light undertaking. You should consider whether it’s really right for you before downloading and installing the pre-release software, which is bound to have bugs and issues that could cause things to go spectacularly wrong with your Mac.</p>\n\n\n\n<p>This won’t be helped by the fact that Apple is not obligated to provide any support for pre-release software.</p>\n\n\n\n<p>If you only have one Mac, and you’re intending to run the pre-release software on that machine, you might want to reconsider. Apple suggests that you should run the pre-release software on a dedicated Mac, not a Mac that you use for business or production purposes.</p>\n\n\n\n<p>This means that we would heavily advise against putting it on a device upon which you’re reliant. Bugs in the code could see the device stop working at any moment or in worst case scenarios it could actually brick your machine, leaving it a very expensive paperweight.</p>\n\n\n\n<p>If you don’t have a spare Mac to hand at least consider \n<a href=\"https://www.macworld.com/article/672589/how-to-dual-boot-mac-run-macos-monterey-and-big-sur-together.html\">installing the macOS beta on a separate volume</a>. Or you could \n<a href=\"https://www.macworld.com/article/672585/how-to-install-macos-on-an-external-drive.html\">run the beta on an external drive</a>.</p>\n\n\n\n<p>Similarly if you don’t want to be stuck without a working iPhone don’t install the beta of iOS on yours. If you have an old iPhone handy that might be a better option for running the new iOS (if it’s supported).</p>\n\n\n\n<p>Luckily participating in the beta programme doesn’t invalidate your warranty, so if something does go wrong, a trip to the Apple Store would hopefully see it rectified.</p>\n\n\n\n<p>The threat of bugs and other stability issues is a good reason to think carefully about whether you want to take the risk of using the beta. If you do decide to install the beta software, make sure that you create a full backup beforehand. Read \n<a href=\"https://www.macworld.com/article/668696/protect-your-mac-with-these-mac-backup-software-options.html\">Best backup software for Mac</a> and \n<a href=\"https://www.macworld.com/article/671444/how-to-back-up-an-iphone-or-ipad.html\">How to back up an iPhone or iPad</a> for some ideas on how to do this safely.</p>\n\n\n\n<p>Also, remember that installing software can take a good few minutes – if you don’t have time to wait for 20 minutes every few weeks while your Mac installs the latest version (especially if that’s only going to break everything for you) you might find the frustration outweighs the novelty value of having the latest updates.</p>\n\n\n\n<p>There’s also the important matter of privacy. By agreeing to test the macOS beta software, you’re essentially giving Apple permission to collect diagnostic, technical and usage data from you, unless you go through the process of opting out.</p>\n\n\n\n<p>For example, the first beta version of Mac OS X 10.10 Yosemite came with several issues, including problems in Safari while trying to access Netflix content, iPhoto, Photo Stream and iCloud Photo Sharing problems, iCloud Drive issues and AirDrop issues, so beware. In another example, early beta versions of macOS High Sierra attempted to use AFPS (Apple’s new file system) on Fusion Drives. This feature was later removed, but those people who had already installed the beta had to perform a complicated uninstall process and revert their Fusion Drives back to the previous file system. </p>\n\n\n\n<p>If you install the beta and then think you made a mistake, here’s <a href=\"https://www.macworld.com/article/671318/how-to-downgrade-macos-revert-back.html\">how to revert to an older version of macOS</a>. We also have a guide to <a href=\"https://www.macworld.com/article/1067004/how-to-remove-ios-beta-iphone.html\">How to remove an iOS beta from your iPhone</a> and <a href=\"https://www.macworld.com/article/673127/how-to-remove-macos-beta-from-a-mac.html\">How to remove macOS beta from a Mac</a>.</p>\n\n\n\n<h2>Is Apple’s beta program free?</h2>\n\n\n\n<p>It’s free to join the Public Beta. </p>\n\n\n\n<p>Developers get the developer version beta for free – but they need to have signed up to Apple Developer Program (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/enroll/&amp;xcust=1-1-674359-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">here</a>), which costs $99 a year.</p>\n\n\n\n<h2>Do you get paid for being an Apple beta tester?</h2>\n\n\n\n<p>No. This is strictly a voluntary pursuit.</p>\n\n\n\n<h2>What’s the difference between Public &amp; Developer Beta?</h2>\n\n\n\n<p>The Developer Beta is usually a few steps ahead of the Public Beta, which essentially means that the Public Beta will be slightly more stable.</p>\n\n\n\n<p>The Developer Beta normally comes out after the WWDC keynote presentation. There is usually a slightly longer wait until the Public Beta arrives.</p>\n\n\n\n<p>However, once the programmes are under way there is usually only a few days between the developer beta being released and the public version arriving.</p>\n\n\n\n<p>While the Public version is aimed at the user experience, those who develop apps for Apple products can use the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/whats-included/&amp;xcust=1-1-674359-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Apple Developer Program</a> to gain early access to the beta software and be able to implement the necessary changes into their code so that apps are ready to go when the full version of the OS is released.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3790536/how-to-join-the-apple-beta-program-developer_thumb.png\" alt=\"How to join Apple beta program: Apple Developer program\" loading=\"lazy\" /></figure></div>\n\n\n\n<p>There’s also the TestFlight platform which enables developers to invite up to 10,000 users to give their in-development apps a trial run. Plus, Apple provides a range of software tools such as Xcode, CloudKit Dashboard and many others.</p>\n\n\n\n<h2>What does being an Apple beta tester involve?</h2>\n\n\n\n<p>The purpose of the beta program is to provide Apple with feedback about the upcoming OS. If you experience bugs or other issues, report them to Apple using the Feedback Assistant app. And don’t just say something crashed, explain exactly what you were doing when the crash happened and try and reproduce the crash to see if you can identify what steps lead to it.</p>\n\n\n\n<p>Don’t just tell Apple that you don’t like the ‘flat’ look of the user interface. Your purpose as a beta tester is to provide feedback on bugs, not try and assume Apple’s software designer’s role.</p>\n\n\n\n<p>That said, it won’t always be bugs you need to provide feedback on. Perhaps you can’t work out how to do something and a user interface tweak is required.</p>\n\n\n\n<p>You can also provide feedback if third-party apps aren’t working as they should – there is actually a 3rd-party Application Compatibility category in which to submit feedback.</p>\n\n\n\n<p>Expect there to be bugs and issues in the beta – the versions of macOS available through the Beta Software Program are not finished products, by installing it you are agreeing to become a tester and helping Apple to iron out these issues.</p>\n\n\n\n<h2>How to sign up to the macOS Beta Seed Program – developer</h2>\n\n\n\n<p>Registered Apple Developers are able to download pre-release versions of most of Apple’s software too, but it costs $99 (approx £80) per year to register as a developer.</p>\n\n\n\n<p>To register as a developer head over to the  <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/&amp;xcust=1-1-674359-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Developer Program registration page</a> and click Enroll. Registering as an Apple developer will give you access to support materials, and enable you to register Macs and iOS devices with Apple so you can use them to run your software.</p>\n\n\n\n<p>You can sign in with your own Apple ID (recommended if you’re a single developer), or you can create an Apple ID just for the developer account (recommended if you are developing for a company).</p>\n\n\n\n<p>You don’t have to pay Apple to register as a developer. You can sign up and gain access to all the developer tools without paying a penny. The basic registration is fine for developing and testing an app, although you will need to sign up with Apple for membership if you want to download the developer previews.</p>\n\n\n\n<h2>How to sign up to the macOS Beta Seed Program – public</h2>\n\n\n\n<p>If you are a member of the public you can also run the beta – but each version of the beta comes a little later than the developer version. Apple tries to make sure the worst of the issues are ironed out before it goes on wider release. That’s why there are often a number of weeks between the first developer beta and the first public beta being released. You can also expect a delay between each version of the developer beta and the matching public beta arriving.</p>\n\n\n\n<p>To sign up you’ll need to go to the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/sp/betaprogram/welcome&amp;xcust=1-1-674359-1-0-0&amp;sref=https://www.macworld.com/feed\">macOS Beta Seed Program</a> website. From there, you can find out more about the program by clicking Learn More or FAQ.</p>\n\n\n\n<p>You must be aged 18 or older with a valid Apple ID, and you’ll also need to be willing to accept the Confidentiality Agreement, which means you agree not to share information or screenshots of the update.</p>\n\n\n\n<p>By clicking ‘Get Started’ on the macOS Beta Seed Program website, you’ll be taken to the ‘Sign In’ page. If you don’t already have an Apple ID, you can create one by clicking ‘create one now’ in the grey box on the left. If you do have one, however, you can go ahead and sign in using the password you normally use for your iTunes and other Apple services.</p>\n\n\n\n<p>Next, you’ll be taken to the macOS Beta Seed and Confidentiality Agreement. You’ll need to read the agreement (you can view it as a PDF if you prefer by clicking the link beneath the scroll link) and then click accept. Unless of course you don’t agree with the terms in which case you’ll want to stop the registration process now.</p>\n\n\n\n<p>Once you are registered for the Apple Beta Software Program you will need to enrol your Mac <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/sp/betaprogram/redemption#osx&amp;xcust=1-1-674359-1-0-0&amp;sref=https://www.macworld.com/feed\">here</a> in order to be able to get the updates from the Mac App Store. You will have to re-enrol your Mac if you had previously been a tester.</p>\n\n\n\n<p>You will find a download link and your redemption code on that page. Click on the link and enter your code to download the latest beta. We cover <a href=\"https://www.macworld.com/article/671123/how-to-install-macos-beta.html#:~:text=Go%20to%20Downloads%20on%20your,if%20there%20are%20any%20updates.\">How to get the macOS Beta</a> and <a href=\"https://www.macworld.com/article/671198/how-to-install-ios-beta.html\">How to get the iOS beta</a> and  <a href=\"https://www.macworld.com/article/673117/how-to-install-the-tvos-beta-on-apple-tv.html\">How to get tvOS beta</a> separately.</p>\n\n\n\n<p>If, at any point, you decide that you’d like to end your participation in the beta software program, simply visit the  <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/sp/betaprogram/unenroll&amp;xcust=1-1-674359-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Unenroll</a> page on Apple’s website and follow the instructions.</p>\n\n\n\n<div></div>\n\n\nApple, Personal Software</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"228955c32a486291b82401faa03212508e0416df937afbad7f5005021e02688a","category":"Apple"}