{"title":"'Nine Steaming Nine Sun‐drying' processing enhanced properties of Polygonatum kingianum against inflammation, oxidative stress and hyperglycemia","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13203?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p><i>Polygonatum kingianum</i> Coll. &amp; Hemsl (PK), a prominent medicine and food homology plant, has been consumed as a decoction from boiling water for thousands of years. 'Nine Steaming Nine Sun-drying' processing has been considered an effective method for enriching tonic properties, but studies investigating such impacts on PK and underlying mechanisms are extremely rare.</p>\n<h2>RESULTS</h2>\n<p>We first demonstrated substantial improvements in the anti-oxidative, anti-inflammatory and anti-hyperglycemia effects of the Nine Steaming Nine Sun-drying processed PK water extracts compared with crude PK in cell models (i.e., HepG2 and Raw 264.7 cells). We then integrated foodomics and network pharmacology analysis to uncover the key compounds responsible for the improved benefits. A total of 551 metabolites of PK extracts were identified, including polyphenols, flavonoids, alkaloids, and organic acids. During processing, 204 metabolites were enhanced, and 32 metabolites were recognized as key constituents of processed PK responsible for the improved health-promoting activities, which may affect PI3K-Akt-, MAPK-, and HIF-1 pathways. We further confirmed the high affinity between identified key constituents of processed PK and their predicted acting targets using molecular docking.</p>\n<h2>CONCLUSION</h2>\n<p>Our results provide novel insights into bioactive compounds of processed PK, elaborating the rationality of processing from the perspective of tonic effects. Consuming processed PK could be an efficacious strategy to combat the high prevalence of metabolic diseases that currently affect millions of people worldwide. © 2023 Society of Chemical Industry.</p>","author":"Lanqi Zhou, \nTianqi Liu, \nTao Yan, \nMinmin Yang, \nPeng Wang, \nLin Shi","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"228b9ff51cc902b07f65aad207825b663f4e567aa8dc381b8e12023e463bea99","category":"Environment"}