{"title":"Samsung Debuts New Fifth-Generation Foldable Galaxy Z Smartphones","link":"https://www.macrumors.com/2023/07/26/samsung-new-galaxy-z-foldable-smartphones/","date":1690369260000,"content":"Samsung today announced the launch of its fifth-generation foldable smartphones, introducing <a href=\"https://howl.me/ckeOdMh8sUU\">the Galaxy Z Flip5</a> and the <a href=\"https://howl.me/ckeOdMF0E8U\">Galaxy Z Fold5</a>. Samsung has been producing foldable smartphones since 2019, and the latest models have a range of new features that improve upon the foldable design.\r<br />\n\r<br />\n<div></div><div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThe Galaxy Z Flip5, <a href=\"https://howl.me/ckeOdM8aV3L\">priced starting at $1,000</a>, is Samsung's smartphone that folds in half. When unfolded, it measures in at 6.7 inches, and when closed, there is a 3.4-inch interactive Flex Window available, which is the best new feature. Prior models had a small window that showed the time, notifications, camera controls, and other limited information, but the expanded window is 3.78 times bigger and almost functions as a full smartphone display.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/galaxy-z-flip5-date.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nIn addition to supporting clocks that can match the face of Samsung's latest watches or Flipsuit Cases, the Flex Window supports widgets for checking the weather, taking and editing photos, texting, controlling music, making payments, browsing social networks, and even watching YouTube videos.\r<br />\n\r<br />\nThe flip design allows users to take hands-free selfies when the phone is half open, and there is a Dual Preview mode that lets a person being photographed see the result and make adjustments in real time. There are improved \"Nightography\" capabilities that optimize photos in situations with low light, and there's an AI-powered noise correction feature.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/galaxy-z-flip5-weather.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nCamera hardware has not seen notable updates, with the Z Flip5 featuring a 10-megapixel selfie camera, a 12-megapixel ultra wide camera, and a 12-megapixel wide-angle camera.\r<br />\n\r<br />\nSamsung's Galaxy Z Fold5 is its flagship foldable smartphone, <a href=\"https://howl.me/ckeOdNvmHsU\">priced starting at $1,800</a>. The Galaxy Z Fold5 opens like a book, and there is a new Flex Hinge design that improves the folding functionality. Samsung says that the Galaxy Z Fold5 is its thinnest and lightest Fold yet, and it is paired with a slimmer, more compact S Pen Fold.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/galaxy-z-fold5-open.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThere is a 6.2-inch Cover Screen that's usable as a standard smartphone when the Galaxy Z Fold5 is closed, and a 7.6-inch AMOLED 2X display with a 120Hz refresh rate when the device is unfolded. The main display's brightness has increased by upwards of 30 percent for improved viewing in bright sunlight.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/07/galaxy-z-fold-hinges.jpg\" alt width=\"1600\" height=\"900\" /><em>Fold4 (top) vs. Fold5 (bottom)</em></div>\r<br />\nThe Galaxy Z Fold5 is powered by the Snapdragon Gen 2 mobile platform (as is the Flip5). Samsung improved the software-based Taskbar of the device by allowing for quick switching between frequently used apps, and there is a two-handed drag and drop for moving content between apps.\r<br />\n\r<br />\nCameras include a 10-megapixel selfie camera, a 4-megapixel under display camera, a 12-megapixel rear ultra wide camera, a 50-megapixel rear wide-angle camera, and a 10-megapixel rear telephoto camera. Other features include 12GB memory, up to 1TB internal storage, a 4,400mAh battery, and a fingerprint sensor.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/galaxy-watch6-models.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nAlong with new smartphones, Samsung today also introduced the <a href=\"https://howl.me/ckeOdNn4GcZ\">Galaxy Watch6 series</a> and new <a href=\"https://howl.me/ckeOdMUpsOy\">Galaxy Tab tablets</a>. The Galaxy Watch6 and Galaxy Watch6 Classic feature slimmed-down bezels, 20 percent larger displays, improved peak brightness, longer battery life, and an improved user interface.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/galaxy-watch6.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nHealth features include sleep score calculations, sleep consistency ratings, body composition measurements, personalized heart rate zone information, fall detection, irregular heart rhythm notifications, menstrual cycle tracking, and skin temperature measurements. <a href=\"https://howl.me/ckeOdNBCYFJ\">Pricing starts at $300</a> for the Galaxy Watch6 and $400 for the Galaxy Watch6 Classic.\r<br />\n\r<br />\nThe <a href=\"https://howl.me/ckeOdM3gjhU\">Galaxy Tab S9, S9+, and S9 Ultra</a> feature 11-inch, 12.4-inch, and 14.6-inch display sizes, respectively. The S9+ and S9 Ultra have dual rear camera setups, with all three tablets offering on-screen fingerprint recognition, Snapdragon 8 Gen 2 chips, and S Pen support.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/galaxy-tab-s9.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nPreorders for the Galaxy Z Fold5, Galaxy Z Flip5, Galaxy Watch6 series, and Galaxy Tab S9 series start today, and the devices will be <a href=\"https://howl.me/ckeOhZlVtsA\">available from Samsung's website</a>. General availability is slated for August 11.\r<br />\n\r<br />\nSamsung is offering a number of bonus offers for early customers, including free storage upgrades from 256GB to 512GB for the Z Fold5 and the Z Flip5 or $150 off on the 1TB model of the Z Fold5. Both phone models also qualify for enhanced trade-in credit for select Galaxy, <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, and Pixel models of up to $1,000 toward the Z Fold5 or up to $900 toward the Z Flip5.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/galaxy-fold5-lineup.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nCustomers pre-ordering either of the new Galaxy Watch6 models will receive a free Fabric Band and can receive up to $250 in trade-in credit for select Apple Watch and Galaxy Watch models.\r<br />\n\r<br />\nFinally, customers interested in bundling multiple devices can save between $130 and $300 when bundling a Z Flip5 or Z Fold5 with a Watch6 or Watch6 Classic, Buds2 Pro, or one of the new Galaxy Tab S9 models.\r<br />\n\r<br />\n<em><small>Note: MacRumors is an affiliate partner with Samsung. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.</small></em><div>Tag: <a href=\"https://www.macrumors.com/guide/samsung/\">Samsung</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/26/samsung-new-galaxy-z-foldable-smartphones/\">Samsung Debuts New Fifth-Generation Foldable Galaxy Z Smartphones</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/samsung-debuts-new-fifth-generation-foldable-galaxy-z-smartphones.2396946/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"228e7daef3a8b2696a5e0f5a1c578c8568bd05c0d211cb89e82f6b51b5088d36","category":"Apple"}