{"title":"Connectivity patterns of bottlenose dolphins (Tursiops truncatus) in the north-east Mediterranean: implications for local conservation","link":"http://link.springer.com/10.1007/s10592-023-01577-4","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Accurate description of population structure and genetic connectivity is essential for efficient conservation efforts. Along the European coastline, <em>Tursiops truncatus</em> typically shows high site fidelity to relatively small areas, often semi-enclosed waters, but patterns of genetic connectivity among such areas are often poorly understood. In this study, we investigate the patterns of genetic structure and connectivity of <em>Tursiops truncatus</em> in the Adriatic Sea and contiguous Mediterranean, using multilocus microsatellite genotypes. We focus particularly on areas where photo-ID studies suggest the occurrence of local ‘resident communities’. Patterns of geographic structure were identified using multivariate methods, Bayesian assignment methods, and analyses of relatedness. Our results are consistent with the occurrence of communities with high site fidelity to the Gulf of Ambracia, Croatian island archipelagos, and the Gulf of Trieste. Dolphins in these regions do not fit a model of complete panmixia, but neither do they exhibit multiple discrete population units. Even for the community in the Gulf of Ambracia, which is well separated by several population genetic estimates, we can unambiguously identify individual dispersal to the most distant area in the Northern Adriatic Sea. We suggest that the population structure patterns in these animals might be best described as a stable metapopulation and discuss the implications of such a model for regional conservation efforts. The critically endangered Ambracian sub-population is particularly well differentiated, and is therefore at high risk of local extinction due to relatively small size, high degree of isolation and exposure to several anthropogenic pressures. The exact geographic boundaries of individual sub-populations cannot always be determined due to lack of sampling and low resolution of the methods used. Nevertheless, our results have important implications for effective conservation of local communities showing strong site fidelity.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"2291c8a3936fcc8dcd4244ab18323a5aedf2f68bf02b38d5bc183f6091c4a6fc","category":"Environment"}