{"title":"PSIII-21 Variation in mitochondrial genes involved in oxidative phosphorylation in cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/491/7757639?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The mitochondrion is a maternally inherited organelle that produces approximately 90% of cellular energy. The mitochondrial genome (mtDNA) consists of 13 genes that are critical components of oxidative phosphorylation. Identifying and understanding variation within this genome could elucidate differences in metabolic and physiological traits, specifically growth efficiency in cattle. Our aim is to identify how variation in the mitochondrial genome influences efficiency in beef cattle. Low-pass sequencing data (average 0.5X coverage of the autosomes) were collected (Neogen) from 49 animals within the UNL herd (composite Simmental, Red Angus, and Gelbvieh). The data were trimmed and mapped (BWA-MEM) to the ARS-UCD1.2 cattle genome. After variant impacts were predicted (Ensembl VEP) haplotype networks were created to visualize variation among samples. Over 60X coverage was achieved across the mitochondrial genome, on average. Excluding the D-loop, 62 variants were identified in the 49 animals: 2 tRNA, 6 rRNA, and 54 coding single nucleotide polymorphisms (SNPs). These 62 variants were encompassed in 23 unique haplotypes. Of the coding variants, 13 were nonsynonymous and found in the following genes encoding components of oxidative phosphorylation: ND1 (n = 3), ND2 (n = 1), ND3 (n = 1), ND4 (n = 1), ND5 (n = 1), ND6 (n = 3), COX3 (n = 2), and CYTB (n = 1). Nine unique haplotypes were present considering only nonsynonymous variants. Nonsynonymous mutations were identified in complex I genes (ND1-6), in the complex IV gene COX3, and in CYTB, which is involved in multiple processes including the electron transport chain. These data, from a closed herd at UNL, support that there is a great deal of mtDNA variation present among beef cattle for which to analyze the impact of mitochondrial genotype on animal efficiency. Performance data demonstrate variation in average daily gain (ADG) and residual feed intake (RFI) in this herd, with a mean ADG of 1.95 kg/d (SD = 0.23 kg/d) and a mean RFI of -0.11 kg (SD = 0.57 kg). Data on individual feed intake, growth rates, and carcass performance values will continue to be collected on all animals sequenced. Based upon these data we hypothesize that variation in the mitochondrial genome will be associated with altered complex I and IV activity. For a more comprehensive understanding of this variation, the sample size will be expanded to over 1,500 animals in the next 2 yr. Overall, from our initial analysis of the mitochondrial genomes from 49 animals, we have identified 62 variants that we anticipate will explain variation in cellular and growth efficiency.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"229b0ffeef1a81a1d9f5bce90d14c7db4be7b9c9ecb278a884848112e06a2f50","category":"Environment"}