{"title":"Radioactive elements in wastewater and potable water: Sources, effects, and methods of analysis and removal","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11106?af=R","date":1724050800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/bcf52230-ebd8-4b11-bad9-95df5c63ca4e/wer11106-toc-0001-m.png\" alt=\"Radioactive elements in wastewater and potable water: Sources, effects, and methods of analysis and removal\" />\n<p>The review article provides insight into the worldwide problem of radioactive materials being discharged into wastewater and drinking water sources, highlighting the possible risks to both human health and the environment.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Radioactive effluents, originating from nuclear power plants, medical-nuclear applications, and various extraction industries worldwide, present a significant and dangerous contamination challenge. The concentrations of radioactive substances in wastewater, surface water, and potable water vary widely depending on the source and location. For example, cesium-137 levels in wastewater from nuclear facilities can range from 0.1 to 10 Bq/L, while tritium concentrations in surface water near nuclear plants can reach up to 100 Bq/L. Regulatory guidelines, like the maximum contaminant level of 0.185 Bq/L for combined radium-226 and radium-228 in drinking water, are critical for ensuring safety and environmental protection. Specifically, in Fukushima, Japan, cesium-137 levels in surface water range from 0.1 to 10 Bq/L due to the nuclear accident. In contrast, regions with natural uranium deposits, like parts of the United States, have reported radium-226 concentrations in potable water up to 1 Bq/L. These variations highlight the necessity for focused monitoring and evaluation to protect water quality and community health. Among various methods, Gamma spectrometry and inductively coupled plasma mass spectrometry are precise for radionuclide quantification, scintillation detectors, and ion exchange, and adsorption techniques efficiently remove radioactive substances from water. This critical review examines the sources, adverse effects, and analysis and remediation strategies for various radioactive elements in wastewater. By thoroughly evaluating the origins and potential dangers associated with radioactive effluents, this report emphasizes the urgent need for rigorous monitoring and effective treatment practices to maintain the integrity of water resources and ecosystems.</p>\n<h2>Practitioner Points</h2>\n<p>\nComprehensive analysis of the radioactive elements frequently found in wastewater and drinking water.\nAssess the negative effects of radioactive elements in water systems.\nExamine the treatment methods used to eliminate radioactive pollutants from water sources.\nOutline effective methods and tactics for addressing and controlling radioactive contamination occurrences.\nAnalyze the latest advancements in technology, regulatory enhancements, and optimal methods to guarantee the safety of drinking water and the sustainable handling of radioactive substances in wastewater.\n</p>","author":"Shubham Sharma, \nVivek Sharma, \nAnkit Mittal, \nDipak Kumar Das, \nSonika Sethi, \nSuman Yadav, \nBhaskar Vallamkonda, \nVinod Kumar Vashistha","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"22a32b1cedf316f080adbab7f3b8b79e135bf2770f98053dc61e1028a581c3bf","category":"Environment"}