{"title":"Deroceras laeve as a potential agricultural pest in Darjeeling Himalayas, India: Palatability and preference of economically important plants","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12869?af=R","date":1696059525000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/cd1203c3-17f9-4702-93ba-dcd4203c055a/aab12869-toc-0001-m.png\" alt=\"Deroceras laeve as a potential agricultural pest in Darjeeling Himalayas, India: Palatability and preference of economically important plants\" />\n<p>The plant food preference and palatability of the slug <i>Deroceras laeve</i>, reported from Darjeeling Himalayas, India, was assessed. The pumpkin leaf was consumed maximally by <i>D</i>. <i>laeve</i> while mint leaf was least consumed, though the fecundity was higher in lettuce and cabbage diet. Apart from being positively linked with body mass, the consumption rate of <i>D</i>. <i>laeve</i> was considerably higher than the controphic slug, <i>Meghimatium bilineatum</i>.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The invasion of the terrestrial ecosystem by gastropods has immense negative impacts on ecosystem functions, health, and agricultural plants. The non-native slug, <i>Deroceras laeve</i> (O. F. Müller, 1774), a recognised agricultural pest in native and invaded regions, was recently reported from the Darjeeling Himalayas, India. We assessed the plant palatability and preference of <i>D</i>. <i>laeve</i> using selected plants being farmed in Darjeeling Himalayas (basil, cabbage, coriander, lettuce, mint, pumpkin leaf, and spinach) by laboratory-based choice and non-choice experiments. Moreover, we evaluated the correlation between different chemical features of the plants with the consumption rate of <i>D</i>. <i>laeve</i> and observed the fecundity of <i>D</i>. <i>laeve</i> reared on different plant diets. The highest consumption rate of <i>D</i>. <i>laeve</i> was observed for pumpkin (12.99 ± 1.33 mg dry mass) and the lowest for mint (1.63 ± 0.13 mg dry mass), with a significant positive correlation between consumption rate and <i>D</i>. <i>laeve</i> body mass (for lettuce: <i>R</i> = .47, <i>p</i> = .0009 and other plant species: <i>R</i> = .52, <i>p</i> = .00004) was observed through the non-choice experiment. Moreover, the consumption rate of the non-native slug, <i>D</i>. <i>laeve</i>, was considerably higher than a controphic slug, <i>Meghimatium bilineatum</i>. In the choice experiment, <i>D</i>. <i>laeve</i> preferred lettuce, followed by pumpkin, cabbage, and coriander, even in the presence of detritus and significantly avoided spinach, mint, and basil. The consumption rate of <i>D</i>. <i>laeve</i> had a significant negative correlation with calcium (<i>R</i> = −.49, <i>p</i> = .003) and potassium (<i>R</i> = −.37, <i>p</i> = .03), and a positive correlation was observed for magnesium (<i>R</i> = .37, <i>p</i> = .03). However, no correlation was observed for zinc, silica, total carbohydrate, protein, and phenol content of the leaves. The highest fecundity of <i>D</i>. <i>laeve</i> was observed in the lettuce and cabbage diet, while no eggs were laid on the mint diet. Hence, the consumption of different leaves, irrespective of physical and chemical features (hairiness, amount of silicon, protein, carbohydrate, and phenol), suitable life history traits, and suitable habitats, may facilitate <i>D</i>. <i>laeve</i> as a potential agricultural pest in the Darjeeling Himalayas, India.</p>","author":"Neha Kumari Gupta, \nPranesh Paul, \nGautam Aditya","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"22a52e203efa13ce3d1d8c3aa859777d53410ad353be1938e77082103c5f7b0c","category":"Environment"}