{"title":"Zack Snyder unveils extended teaser for his Netflix sci-fi saga Rebel Moon","link":"https://arstechnica.com/?p=1962407","date":1692742018000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>The first part of director Zack Snyder's epic space opera <em>Rebel Moon</em> is coming to Netflix in December. </p></div>\n<p>Years ago, director <a href=\"https://en.wikipedia.org/wiki/Zack_Snyder\">Zack Snyder</a> had an idea for an epic Star Wars movie that he pitched to Lucasfilm. That project never panned out for a variety of reasons. But the idea continued to germinate until it became <a href=\"https://en.wikipedia.org/wiki/Rebel_Moon\"><em>Rebel Moo</em>n</a>, a two-part film for Netflix that Snyder and the streaming giant hope will launch a new franchise. Snyder unveiled the first extended teaser at Gamescom in Germany.</p>\n<p>Apart from Star Wars, Snyder has said that his influences include the films of Akira Kurosawa, especially <em>The Seven Samurai</em> and <em>The Dirty Dozen</em>. He has set his epic saga in a universe controlled by a ruthless and corrupt government of the Mother World (the Imperium) with an army led by one Regent Balisarius (Fra Fee), and the rebel moon of the title is called Veldt. Per the official premise:</p>\n<blockquote><p>When a peaceful colony on the edge of a galaxy finds itself threatened by the armies of a tyrannical ruling force, Kora (Sofia Boutella), a mysterious stranger living among the villagers, becomes their best hope for survival. Tasked with finding trained fighters who will unite with her in making an impossible stand against the Mother World, Kora assembles a small band of warriors—outsiders, insurgents, peasants and orphans of war from different worlds who share a common need for redemption and revenge. As the shadow of an entire Realm bears down on the unlikeliest of moons, a battle over the fate of a galaxy is waged, and in the process, a new army of heroes is formed.</p></blockquote>\n<p>Kora knows something about the oppressive nature of the Imperium, since she used to be an Imperium leader, and now seeks redemption from her past. The band of allies that Kora assembles includes a former Imperium general named Titus (Djimon Hounsou); her farmer friend Gunnar (Michiel Huisman); Tarak (Staz Nair), a blacksmith who can bond with animals to rally them to a fight; a cyborg sword master named Nemesis (Doona Bae); a warrior named Darrian Bloodaxe (Ray Fisher) and his sister Devra (Cleopatra Coleman); a spider warrior named Harmada (Jena Malone); and Jimmy, the last of a race of mechanical knights from a fallen kingdom, voiced by Anthony Hopkins. Ed Skrein plays Admiral Atticus Noble, right hand to the tyrannical Regent, and Cary Elwes has also been cast in an as-yet-unnamed role.</p></div><p><a href=\"https://arstechnica.com/?p=1962407#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1962407&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"22a96ef43fd25948ae27359b525020345f8a406504292700c6ab6ced5c3ae5b7","category":"Tech"}