{"title":"Tile CEO: 'We Welcome Competition From Apple, But We Think It Needs to Be Fair'","link":"https://www.macrumors.com/2021/05/04/tile-ceo-on-competition-from-apple/","date":1620147082000,"content":"Just after Apple announced its <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a>, Tile CEO CJ Prober relayed his concerns about competing with Apple in the tracking space, and said that Tile would ask Congress to <a href=\"https://www.macrumors.com/2021/04/20/tile-complains-about-airtag-launch/\">investigate Apple's business practices</a> specific to <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> and item trackers.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2019/10/tile-sticker-e1570533758981.jpg\" />\r\n<br />\r\nProber this week did an <a href=\"https://www.bloomberg.com/news/videos/2021-05-03/tile-ceo-explains-how-apple-s-airtag-puts-them-at-a-disadvantage-video\">interview with <em>Bloomberg</em></a>, where he further expanded on Tile's complaints about Apple and why he feels that Tile is disadvantaged on Apple's platform. Prober said that while Tile \"welcomes competition,\" he doesn't feel that Apple is being fair.<blockquote>Tile welcomes competition. We've been competing for 8 years with small companies to Fortune 50 companies, so we welcome competition from Apple, but we think it needs to be fair.</blockquote>Prober claims that when Apple \"launched\" ‌Find My‌ in 2019, there were changes to iOS that made it harder for Tile to operate. Apple did release a unified ‌Find My‌ app in 2019, but has long had ‌Find My‌ <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and ‌Find My‌ Mac apps for devices.<blockquote>If you look at the history between Tile and Apple, we had a very symbiotic relationship. They sold Tile in their stores, we were highlighted at WWDC 2019, and then they launched ‌Find My‌ in 2019, and right when they launched their ‌Find My‌ app, which is effectively a competitor of Tile, they made a number of changes to their OS that made it very difficult for our customers to enable Tile. And then once they got it enabled, they started showing notifications that basically made it seem like Tile was broken.</blockquote>Prober is talking about changes that Apple made to location services permissions. For privacy purposes, Apple stopped making it easy for apps to get permanent access to a user's location. Apps in iOS 13 were not initially allowed to present an \"Always Allow\" option when requesting location access, and the feature had to be enabled in the Settings app. Apple also started sending regular reminders to customers letting them know their location was being used.\r\n<br />\r\n\r\n<br />\r\nTile was not happy with these privacy changes and that privacy tweak set Tile against Apple, with Tile in 2019 calling on Congress to \"level the playing field.\"\r\n<br />\r\n\r\n<br />\r\nProber said that Apple has now launched a Tile competitor that has access to platform capabilities that Tile cannot access, referencing seamless activation and Ultra Wideband technology.<blockquote>The main points of differentiation of ‌AirTags‌ vis a vis Tile are enabled by platform capabilities that we don't have access to.</blockquote>Apple has, in fact, launched the ‌Find My‌ network that gives third-party accessories some of the same access that ‌AirTags‌ have, and ‌Find My‌ network accessories will be able to access the U1 chip in the <a href=\"https://www.macrumors.com/roundup/iphone-11/\">iPhone 11</a> and 12 models much like the ‌AirTags‌, but Tile won't be able to use the ‌Find My‌ network unless it abandons its own app and infrastructure, which it is likely unwilling to do.\r\n<br />\r\n\r\n<br />\r\nProber said that Tile has been \"seeking to access\" the U1 chip since its introduction in the ‌iPhone‌, and has been denied.\r\n<br />\r\n\r\n<br />\r\nIt's too early to tell whether Tile's sales will be impacted by AirTag, but Prober says that Tile is \"well-positioned\" with a \"super differentiated product\" that's available across platform and in many form factors. He suggested Tile has several benefits over ‌AirTags‌.<blockquote>We have many form factors. You don't need an accessory to attach it to your things. We're louder, we've got better range. So we have a lot going for us. We feel good about our competitive position, but we don't feel like we should be competing in the way we are with Apple. This is much broader than Tile, this is about long term consumer choice, innovation thriving, and lower prices. That's why we're being so vocal about this.</blockquote>According to Prober, Apple could take the advantages that it has on its platform and make them available to everyone for a more level competitive playing field. He called for legislation to allow for innovation and competition. \"We should be competing fairly and no excessive taxes on developers,\" he said.\r\n<br />\r\n\r\n<br />\r\nProber's full interview can be watched over at <em><a href=\"https://www.bloomberg.com/news/videos/2021-05-03/tile-ceo-explains-how-apple-s-airtag-puts-them-at-a-disadvantage-video\">Bloomberg</a></em>.<br />This article, \"<a href=\"https://www.macrumors.com/2021/05/04/tile-ceo-on-competition-from-apple/\">Tile CEO: 'We Welcome Competition From Apple, But We Think It Needs to Be Fair'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/tile-ceo-we-welcome-competition-from-apple-but-we-think-it-needs-to-be-fair.2294800/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=oI2Tb-CEWJY:N9zfLkOdafY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=oI2Tb-CEWJY:N9zfLkOdafY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/oI2Tb-CEWJY\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"22ad758f6bb6288933356fd5d1f55049c447b92a0748f0333d30837c19252af9","category":"Apple"}