{"title":"The recent evolution of the salt marsh ‘Pantano Grande’ (NE Sicily, Italy): interplay between natural and human activity over the last 3700 years","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3583?af=R","date":1707372847000,"content":"<h2>Abstract</h2>\n<p>Combined natural processes and human activities shaped the late Holocene landscape history in many Mediterranean regions. This is especially true with areas subjected to specific human interest, such as coastal areas morphologically suitable to the establishment of harbours. Here, we test the hypothesis on the location of the Roman harbour <i>Portus Trajectus</i> in Peloro Cape (NE Sicily, Italy) and describe the evolution of the area over the last 3700 years through lithostratigraphic, geochemical, meiofauna and microfossil analyses performed on a new sediment core recovered from the coastal salt marsh <i>Pantano Grande</i> (aka <i>Lago di Ganzirri</i>). The age–depth model was developed on radiocarbon dates and geochemical fingerprinting of two tephra layers. Results indicate that the area underwent dramatic changes <i>ca</i>. 650 <span>bce.</span> The anthropogenic impact of Greek colonies may have contributed to modifying the coastal environment of Peloro Cape due to their widespread impact on natural resources. This happened at many localities in the Mediterranean, indicating the magnitude of impact of the Greek colonies over the landscape. According to our results, it is unlikely that the current <i>Pantano Grande</i> basin was used as a harbour in Roman times, although the presence of a harbour in the nearby <i>Pantano Piccolo</i> marsh cannot be excluded. <i>Pantano Grande</i> had been isolated from the sea for more than 2000 years. Human intervention in the 19<sup>th</sup> century halted that isolation and provided the background for the ecological, economic and social functions the salt marsh performs today.</p>","author":"Jordan Palli, \nLorenzo Monaco, \nMonica Bini, \nEmanuela Cosma, \nBiagio Giaccio, \nAdam Izdebski, \nAlessia Masi, \nScott Mensing, \nGianluca Piovesan, \nVeronica Rossi, \nLaura Sadori, \nBernd Wagner, \nGiovanni Zanchetta","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"22ae25f877746e95850fafa1f0c6d8f251b515b76ee0a57e4173b7cb358f030e","category":"Environment"}