{"title":"Causal relationship between periodontal disease-related phenotype and knee osteoarthritis: A two-sample mendelian randomization analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304117","date":1717164000000,"content":"<p>by Longqiang Shen, Di Niu, Gang Deng</p>\r\nObjective <p>This study aimed to explore the bidirectional causal relationship between periodontal disease-related phenotype (PDRP) and knee osteoarthritis (KOA) in a European population using a two-sample Mendelian Randomization (MR) approach.</p> Methods <p>We leveraged publicly available GWAS summary statistics for PDRP (n = 975) and KOA (n = 403,124), assessing their roles as both exposures and outcomes. Our comprehensive MR analysis employed various methods, including inverse variance weighting (IVW), weighted median, Egger regression, simple mode, and weighted mode, to enhance the robustness of our findings. To ensure the reliability of our instrumental variables, we implemented a rigorous screening process based on p-values and F-values, utilized Phenoscanner to investigate potential confounders, and conducted sensitivity analyses.</p> Results <p>Our analysis identified five SNPs associated with PDRP and three SNPs with KOA, all surpassing the genome-wide significance threshold, as instrumental variables. The IVW method demonstrated a significant causal relationship from PDRP to KOA (beta = 0.013, SE = 0.007, P = 0.035), without evidence of directional pleiotropy (MR-Egger regression intercept = 0.021, P = 0.706). No support was found for reverse causality from KOA to PDRP, as further MR analyses yielded non-significant P-values. Additionally, funnel plots and Cochran’s Q test detected no significant heterogeneity or directional pleiotropy, confirming the robustness of our results. In multivariate analysis, when considering smoking, alcohol consumption, BMI collectively no direct causal relationship between KOA and PDRP. Conversely, smoking and higher BMI were independently associated with an increased risk of KOA.</p> Conclusion <p>In conclusion, our analysis revealed no direct causal relationship from KOA to PDRP. However, a causal relationship from PDRP to KOA was observed. Notably, when adjusting for potential confounders like smoking, alcohol intake, and BMI, both the causal connection from PDRP to KOA and the inverse relationship were not substantiated.</p>","author":"Longqiang Shen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"22b1c13d27f155fbe54c5e3e4e2efc045530a289238ee943677b4fe91464075e","category":"Interdisciplinary"}