{"title":"Perspectives of providing magnesium sulfate to patients with preeclampsia and eclampsia: A qualitative study amongst nurse-midwives in Dar es Salaam, Tanzania","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308382","date":1723039200000,"content":"<p>by Victor Z. Chikwala, Agnes F. Massae, Stella E. Mushy, Edith A. M. Tarimo</p>\r\nBackground <p>Preeclampsia and eclampsia are among the leading direct causes of maternal death and morbidity worldwide. Up to 34% of maternal deaths in Tanzania are due to preeclampsia/ eclampsia. Magnesium sulfate is recommended for preventing and treating convulsions in women with Preeclampsia or eclampsia. However, evidence suggests limited knowledge of its dosage and proper toxicity assessment after administration among health care providers.</p> Aim of the study <p>This study explored nurse-midwives’ perspectives on providing MgSO<sub>4</sub> to patients with preeclampsia or eclampsia in Tanzania.</p> Materials and methods <p>A descriptive exploratory qualitative study using in-depth interviews was conducted to understand nurse-midwives’ perspectives on providing magnesium sulfate to patients with PE/E. Nineteen nurse-midwives were interviewed from three hospitals in the Dar es Salaam region. We used a semi-structured interview guide in Kiswahili language to collect data. All interviews were digitally recorded and transcribed verbatim. We analyzed data using inductive content analysis.</p> Results <p>This study revealed that nurse-midwives provide magnesium sulfate to save the lives of women and their unborn children. Nurse-midwives reasoned that confidence in their skill enhances provision of magnesium sulfate. However, they were concerned about its effect on the progress of labour. Ineffective use of magnesium sulfate emerged from inadequate training, an unsupportive work environment, and underutilization of the existing guidelines.</p> Conclusion <p>Nurse-midwives have clear drive to provide magnesium sulfate to women with preeclampsia or eclampsia. However, inadequate training, underutilization of guidelines and unsupportive work environment lead to ineffective use of magnesium sulfate. Targeted practical training should be emphasized for nurse-midwives mastery of clinical competencies.</p>","author":"Victor Z. Chikwala","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"22b73a6aff807c96327b3d9669f4eef65ddfcfcd4df694a4c75c6ca42c564d09","category":"Interdisciplinary"}