{"title":"Hands-On With Sonnet's DuoModo Modular Desktop Enclosures and eGPU","link":"https://www.macrumors.com/2021/07/28/hands-on-sonnet-duomodo/","date":1627485117000,"content":"Sonnet in June announced a new <a href=\"https://www.sonnettech.com/product/duomodo/overview.html\">DuoModo</a> series of mix and match modular Thunderbolt expansion options both for the desktop and for rack installation, and we thought we'd take a hands-on look at the new offerings for MacRumors readers who are looking to power up their desktops.\r\n<br />\r\n\r\n<br />\r\n<div></div><div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r\n<br />\r\nThere are <a href=\"https://www.sonnettech.com/product/duomodo/overview.html\">three interchangeable expansion modules</a> that are part of the DuoModo line, including a three-slot PCIe card system, an eGPU card system, and a <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a> mounting system with an integrated Thunderbolt storage dock, plus a series of enclosures. Since these are mix and match you can pick and choose, but Sonnet also offers a few <a href=\"https://www.sonnetstore.com/collections/duomodo-expansion-systems\">preconfigured options</a>.\r\n<br />\r\n\r\n<br />\r\nThe DuoModo Echo III includes one x16 and two x8 PCIe slots that connect to a Mac's Thunderbolt port, along with a 400W power supply and a 75W auxiliary power connector for cards that require additional power.\r\n<br />\r\n\r\n<br />\r\nSonnet's DuoModo eGPU Module, which is what most <em>MacRumors</em> readers may be interested in, supports full-length, full-height 2.5-slot width GPU cards, and it has built-in variable-speed fans for cooling purposes. It's future proof with an 800W power supply. We used an AMD Radeon 6800 in the eGPU with an Intel ‌Mac mini‌ and saw OpenCL and Metal scores of 97499 and 132543, respectively, vastly outperforming the 4561 OpenCL and 4522 Metal scores from the integrated Graphics 630 card.\r\n<br />\r\n\r\n<br />\r\nThere's also a DuoModo xMac mini Module that holds an Intel or <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> ‌Mac mini‌ and allows it to be mounted in an enclosure. There's a built-in Thunderbolt 3 storage dock with two 10Gb/s USB-C ports, one USB-A port, and one 40Gb/s Thunderbolt 3 port. It also has two M.2 NVMe PCIe SSD sockets to let users add up to 16TB of storage.\r\n<br />\r\n\r\n<br />\r\nThese modules can go in one of Sonnet's enclosures, such as the Dual-Module Desktop Enclosure. Sonnet's dual enclosure holds any two of the DuoModo modules, and there's also a single-module option.\r\n<br />\r\n\r\n<br />\r\nSonnet's DuoModo system is comprehensive, versatile, and easy to use for those who need professional expansion options. Make sure to check out our video up above to see the DuoModo in action.<div>Tag: <a href=\"https://www.macrumors.com/guide/sonnet/\">Sonnet</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/28/hands-on-sonnet-duomodo/\">Hands-On With Sonnet's DuoModo Modular Desktop Enclosures and eGPU</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/hands-on-with-sonnets-duomodo-modular-desktop-enclosures-and-egpu.2305785/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=WIg7lnNCmE0:Xj3RNR5K_gA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=WIg7lnNCmE0:Xj3RNR5K_gA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/WIg7lnNCmE0\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"22beb7626ca6cff70924a2b80b66b668703a1471223b2a351ca9fd3f467c22db","category":"Apple"}