{"title":"A Decade of Experience between Open and Minimally-Invasive Hepatectomies for Hepatocellular Carcinoma","link":"https://www.preprints.org/manuscript/202409.1078/v1","date":1726217019000,"content":"Background \n\nHepatic resection offers promising outcomes for patients with hepatocellular carcinoma (HCC) but can be constrained by factors like patient suitability. Continuous advancements in laparoscopic and robotic technologies have made minimally invasive hepatectomies (MIH) viable alternatives to open hepatectomies with benefits in recovery and complications. \n\nMaterials and Methods\n\nWe completed a retrospective review on 138 HCC patients at the Hume-Lee Transplant Center that underwent OH or MIH between 2010 and 2020. Univariate and multivariate analyses were completed on demographic, clinical, and tumor-specific data were collected to assess the impact of these variables on overall and disease-free survival at 1-, 3-, and 5-years. Preoperative metrics like length of hospital stay (LOS) and operation duration were also evaluated. \n\nResults\n\nOf the 109 OH and 29 MIH patients, MIH patients demonstrated shorter LOS and operative times. However, overall survival (OS) and disease-free survival (DFS) were similar between groups, with no significant variations in 1-, 3-, and 5-year survival rates. Ages &gt; 60 years and lack of preoperative transcatheter arterial chemoembolization (TACE) were significant predictors of inferior OS and DFS in multivariate analyses. \n\nConclusions\n\nMIH is an efficient substitute to OH with comparable survival even in older patients. The reduced LOS and operation time enhances its feasibility, and older patients previously denied for curative resection may qualify for MIH. Preoperative TACE also enhances survival outcomes, emphasizing its general role in managing resectable HCCs. Both robotic and laparoscopic hepatectomies offer acceptable short- and long-term clinical outcomes, highlighting MIH as the standard choice for HCC patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"22d6ac14fff0030d6ebe8cfcd4c46247e1b03babfc2ceb68b3e857290bf55c2a","category":"Interdisciplinary"}