{"title":"RNA editing factor SlORRM2 regulates the formation of fruit pointed tips in tomato","link":"https://academic.oup.com/plphys/article/195/4/2757/7658669?rss=1","date":1714089600000,"content":"<span><div>Abstract</div>Domestication of tomato (<span>Solanum lycopersicum</span>) has led to large variation in fruit size and morphology. The development of the distal end of the fruit is a critical factor in determining its overall shape. However, the intricate mechanisms underlying distal fruit development require further exploration. This study aimed to investigate the regulatory role of an organelle RNA recognition motif (RRM)-containing protein SlORRM2 in tomato fruit morphology development. Mutant plants lacking SlORRM2 exhibited fruits with pointed tips at the distal end. However, this phenotype could be successfully restored through the implementation of a “functional complementation” strategy. Our findings suggest that the formation of pointed tips in the fruits of the CR-<span>slorrm2</span> mutants is linked to alterations in the development of the ovary and style. We observed a substantial decrease in the levels of indole-3-acetic acid (IAA) and altered expression of IAA-related response genes in the ovary and style tissues of CR-<span>slorrm2</span>. Moreover, our data demonstrated that SlORRM2 plays a role in regulating mitochondrial RNA editing sites, particularly within genes encoding various respiratory chain subunits. Additionally, the CR-<span>slorrm2</span> mutants exhibited modified organellar morphology and increased levels of reactive oxygen species. These findings provide valuable insights into the mechanisms underlying the formation of fruit pointed tips in tomato and offer genetic resources for tomato breeding.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"22dc14ca58bc59603403d9803b787d6e7ddd23924c74c1575111b588b84b9ad0","category":"Environment"}