{"title":"Scaling of respiration in colonial invertebrates","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12626?af=R","date":1720230847000,"content":"<h2>Abstract</h2>\n<p>Coloniality may grant colony members an energetic advantage in the form of lower individual respiration rates as colony size increases. If this occurs it should be apparent as negative allometric scaling of respiration with colony size, and colonial organisms should have scaling factors &lt; 1. However, colonial members from phylum Rotifera have yet to be examined. To test if colonial rotifers possess allometric scaling relationships between respiration rate and colony size, we measured respiration rates for four solitary and three colonial rotifer species; from these respiration rates we estimated scaling factors. We found mixed evidence for allometric scaling of respiration rate in colonial rotifers. Both rotifers with allometric scaling of respiration rate, <i>Conochilus hippocrepis</i> and <i>Lacinularia flosculosa</i>, have extensive mucilaginous coverings. These coverings may represent an investment of colony members into a shared structure, lowering individual metabolic costs and thus respiratory needs. Additionally, we determined which traits are associated with allometric scaling of respiration. We compiled known scaling factors for animal phyla from a wide phylogenetic spectrum with colonial representatives and conducted a hierarchical mixed regression that included attributes of colonies. Traits associated with allometric scaling in colonial animals included colony shape, the presence of shared extrazooidal structures, and planktonic lifestyle. There are many other colonial rotifers and animal taxa for which allometric scaling factors have yet to be estimated, knowing these may enhance our understanding of the benefits of coloniality in animals.</p>","author":"Patrick D. Brown, \nElizabeth J. Walsh","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"22eebce80a4a09a9fa838677f9c6177918abd529dd0b0ac245b75ed7da343234","category":"Environment"}