{"title":"Developing and validating a self-assessment tool for assessing confidence of nurse-midwives against competency domains of the International Confederation of Midwives, in India","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003766","date":1729692000000,"content":"<p>by Bharati Sharma, Malin Bogren, Prabhu Ponnusamy, Vaibhav Rastogi, Minjan Patel, Sunanda Gupta, Arvind Pandey, Ram Chahar, Emma Frances MCCONVILLE, Medha Gandhi, Paridhi Jha</p>\r\n\r\nWhile midwives are recognized as primary care-providers for maternal and new-born care in many parts of the world, India is transitioning to professional midwifery. The pathway to midwifery in India has been through integrated nursing and midwifery education. Since 2018, India has introduced an 18-month post nursing midwifery education programme. To establish a baseline for midwives’ competence and measure progress, there is a need for a quick, easy-to-administer and low-cost tool that can be used at scale to guide programme efforts. This paper describes the process of validation and testing of a tool to assess the confidence of practicing nurse-midwives as a proxy indicator for competence against the seven competency domains of the International Confederation of Midwives (2013). A total of 2198 nurse-midwives, providing maternal and new-born services at the time of the study, from 442 public and private hospitals across six states in India, responded to a self-administered questionnaire. The tool is psychometrically sound and can potentially be used in low-middle-income countries to measure confidence of midwives and nurse-midwives against international competence standards. It is suitable for quick large-scale programmatic assessments within a short time period, providing evidence to inform midwifery strengthening initiatives. The tool can be contextualized to suit specific country contexts. Since it was tested in India, where a distinct cadre of midwives is not yet established and nurse-midwives provide maternity care, the tool can be easily adapted for use in other countries in the South East Asia Region with similar contexts.","author":"Bharati Sharma","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"22effb59aa1f372547a197029b7f57d88846d5e3365ab2a9c658d3a6dae866d6","category":"Environment"}