{"title":"Talent Identification In Football: Different Effects of Maturation on Sprinting, Change of Direction and Jumping in 13-Year-Old Players","link":"https://www.preprints.org/manuscript/202405.0518/v1","date":1715183040000,"content":"The aim of this cross-sectional study was to assess the influence of the maturity status on speed, explosive power and change of direction (COD) in 13-year-old football players. Ninety-eight male players (age: 13.1 ± 1.0 y) were divided into late, average, and early maturation groups. Physical fitness testing included the following variables: 10 and 30-meter sprint time and maximum speed in the 20-30 m segment of the 30-meter sprint test, the T-test time, countermovement jump height and horizontal distance in the triple jump. The data showed a significant effect of maturity status on performance in three parameters: in maximum speed in the 20-30 m section (p = 0,024), however, the only significant differences were found between the early-maturation group and average-maturation group (p = 0.033); in the COD (p = 0.024), where significant differences were confirmed between the late-maturation group and the average-maturation group (p = 0.033); in the unilateral triple jump distance of the dominant and non-dominant (p = 0,007 and p = 0.001, respectively) lower limb. For both limbs, significant differences between the late-maturation group and average maturation group (p = 0.005 and p = 0.013, respectively) as well as the late-maturation group and early-maturation group (p = 0.007 and p = 0.045, respectively) were proved. These results indicate that maximal speed, COD speed and unilateral lower limb reactive strength are moderated by biological age in football players aged 13 years.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"22f6494f0accec78ae51bc34838252c68a8e4250fb8203074870324af03c24f9","category":"Interdisciplinary"}