{"title":"Fungal Elicitor-Induced Resistance Against Pine Wilt Disease in Pinus densiflora","link":"https://www.preprints.org/manuscript/202409.1981/v1","date":1727260407000,"content":"Pinosylvin and its methylated derivatives, pinosylvin monomethyl ether (PME) and dihydropinosylvin monomethyl ether (DPME), are representative phytoalexins found in Pinus species. Both PME and DPME have strong nematicidal activity against pine wood nematodes (PWNs). In this study, we investigated the resistance of Pinus densiflora to PWN after trunk injection or soil drenching with a fungal elicitor prepared from Penicillium chrysogenum. Fungal elicitor treatment by soil drenching resulted in increased accumulation of PME and DPME in the needles of the plants. When the pine trees without fungal elicitor pretreatment were inoculated with PWNs, 67.9% died after five months, but only 33.3% died among the plants pretreated with the fungal elicitor. Injection of the fungal elicitor into the trunks of P. densiflora trees also strongly increased the synthesis of PMEs. The concentration of PME in the leaves of P. densiflora reached a maximum (155.4 µg/g DW) after 4 weeks of fungal elicitor injection. The second injection of the elicitor after the first injection of the fungal elicitor also increased the accumulation of PME. To investigate PWN resistance in P. densiflora after two months of trunk injection of elicitor, the downward movement of PWNs from the top of branches to the bottom was monitored after PWNs were inoculated on the holes of the upper internodal segments of branches. The number and mobility of PWNs that moved from the bottom of branches were highly reduced in fungal elicitor-injected pine plants. This result suggests an eco-friendly approach for eliciting-induced PWN resistance in PWN-susceptible P. densiflora via fungal elicitor treatment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2300287a4f2290f5be066c360e13c041d2ba1c52d030cf25e7fff9191bac408b","category":"Interdisciplinary"}