{"title":"Substantial Differences in Crop Yield Sensitivities Between Models Call for Functionality‐Based Model Evaluation","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003773?af=R","date":1710211428000,"content":"<h2>Abstract</h2>\n<p>Crop models are often used to project future crop yield under climate and global change and typically show a broad range of outcomes. To understand differences in modeled responses, we analyzed modeled crop yield response types using impact response surfaces along four drivers of crop yield: carbon dioxide (C), temperature (T), water (W), and nitrogen (N). Crop yield response types help to understand differences in simulated responses per driver and their combinations rather than aggregated changes in yields as the result of simultaneous changes in various drivers. We find that models' sensitivities to the individual drivers are substantially different and often more different across models than across regions. There is some agreement across models with respect to the spatial patterns of response types but strong differences in the distribution of response types across models and their configurations suggests that models need to undergo further scrutiny. We suggest establishing standards in model evaluation based on emergent functionality not only against historical yield observations but also against dedicated experiments across different drivers to analyze emergent functional patterns of crop models.</p>","author":"Christoph Müller, \nJonas Jägermeyr, \nJames A. Franke, \nAlex C. Ruane, \nJuraj Balkovic, \nPhilippe Ciais, \nMarie Dury, \nPete Falloon, \nChristian Folberth, \nTobias Hank, \nMunir Hoffmann, \nR. Cesar Izaurralde, \nIngrid Jacquemin, \nNikolay Khabarov, \nWenfeng Liu, \nStefan Olin, \nThomas A. M. Pugh, \nXuhui Wang, \nKarina Williams, \nFlorian Zabel, \nJoshua W. Elliott","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"2310e048f73e83a752e0bf7d3919a268df42394627206d9c0a491f6beea5de88","category":"Environment"}