{"title":"Eight-Chop Technique in Phacoemulsification Using Iris Hooks for Patients with Cataracts and Small Pupils","link":"https://www.preprints.org/manuscript/202409.1709/v1","date":1727085135000,"content":"Objectives: This study investigated the efficacy and safety of performing phacoemulsification using the eight-chop technique with iris hooks in patients with small pupils. Methods: The iris hooks and control groups each included 65 eyes. Cataract surgeries were performed using the eight-chop technique. The operative time, phaco time, aspiration time, cumulative dissipated energy, and volume of fluid used were measured. Best-corrected visual acuity, corneal endothelial cell density (CECD), and intraocular pressure (IOP) were measured preoperatively and postoperatively. Results: In total, 130 eyes of 107 patients (mean age, 75.9 ± 7.1 years; 58 men, 72 women) with cataracts were evaluated. The mean operative time, phaco time, aspiration time, cumulative dissipated energy, and volume of fluid used were 10.6 min, 20.7 s, 101.1 s, 7.8, and 38.0 mL, respectively, in the iris hooks group and 4.6 min, 16.2 s, 72.1 s, 7.0, and 28.9 mL, respectively, in the control group. The decrease in CECD at 19 weeks postoperatively was 2.1% and 1.2% for the iris hooks and control groups, respectively. In both groups, IOP decreased significantly (all p &amp;lt; .01) at 7 and 19 weeks postoperatively. No intraoperative complications were observed in either group. Conclusions: The eight-chop technique using iris hooks resulted in a small postoperative reduction in CECD and excellent values for intraoperative outcome measures. In addition, those cataract surgeries were very short, efficient, and safe, without complications. The eight-chop technique using iris hooks could provide an ideal solution for patients with small pupils.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"23146633fc5ccafb45e4796e7c11cf812508dae022869a7c218352775b52e008","category":"Interdisciplinary"}