{"title":"AIS จัดสัมนาออนไลน์ 5G for Business is Now เน้นความสำคัญของ 5G ในการเสริมความแข็งแกร่งให้ธุรกิจ และฟื้นฟูเศรษฐกิจของประเทศ","link":"https://www.blognone.com/node/125894","date":1637216100000,"content":"<div><div><div><p>เมื่อวันที่ 11 พฤศจิกายนที่ผ่านมา AIS จัดงานสัมนา 5G for Business is Now เน้นย้ำความสำคัญของ 5G เพื่อเป็นเครื่องมือในการเสริมขีดความสามารถการทำงานของภาคอุตสาหกรรม ทั้งภาคการผลิต โรงงานเครื่องจักร โซลูชัน หรือแม้แต่กระบวนการทำงานในขั้นตอนต่างๆ</p>\n<p>AIS พูดถึงความพร้อมทั้งจากการทำงานร่วมกับพันธมิตรที่หลากหลายทั้งในระดับนโยบายการขับเคลื่อนกับภาครัฐ และในระดับของการพัฒนาโซลูชันในด้านต่างๆ กับภาคเอกชน เพื่อติดปีกภาคอุตสาหกรรมไทยให้สามารถสร้างความได้เปรียบทางการแข่งขันได้ด้วยเทคโนโลยีจาก AIS 5G ทั้งด้าน Platforms และ Solutions</p>\n<p><strong>คุณธนพงษ์ อิทธิสกุลชัย หัวหน้าคณะผู้บริหาร กลุ่มลูกค้าองค์กร AIS</strong> ให้ข้อมูลเพิ่มเติม ว่าจากการเดินหน้าลงทุนพัฒนาขีดความสามารถของเทคโนโลยีโครงข่ายอย่างต่อเนื่อง ทำให้วันนี้โครงสร้างพื้นฐานเครือข่ายมีความสมบูรณ์ พร้อมให้บริการกับภาคอุตสาหกรรมแล้ว โดยจะยึดแนวทางการทำงานร่วมกับพาร์ทเนอร์ที่หลากหลายเพื่อสร้างความสมบูรณ์ของ Digital Ecosystem ที่จะช่วยส่งเสริมธุรกิจในภาคอุตสาหกรรมของประเทศให้มีความแข็งแกร่งมากขึ้นได้</p>\n<p>AIS ร่วมมือกับสำนักงานส่งเสริมเศรษฐกิจดิจิทัล หรือ depa พัฒนา 5G Innovation Center บนเขตพัฒนาเศรษฐกิจพิเศษภาคตะวันออก หรือ EEC ภายในพื้นที่ตั้งของ Thailand Digital Valley ซึ่งเป็นพื้นที่เศรษฐกิจใหม่ที่จะเป็นศูนย์กลางการลงทุนด้านอุตสาหกรรมและนวัตกรรมดิจิทัลของภูมิภาค โดยได้นำศักยภาพ 5G ที่ครอบคลุม 100% ในพื้นที่ EEC ที่มีการใช้งานมาเปิดโอกาสให้กลุ่ม Digital Tech ซึ่งมีความต้องการจะทดสอบบริการบนเครือข่าย AIS 5G  อันจะทำให้เกิดการลงทุนในธุรกิจดิจิทัลควบคู่กับการสร้างสรรค์นวัตกรรมดิจิทัลเชิงพาณิชย์ โดยพร้อมที่จะเปิดตัวในปี 2022</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2be48e86c38acc1c55034e9020aac601.jpg\" /></p>\n<p>นอกจากนี้ AIS ยังทำงานร่วมกับภาครัฐอย่าง ศูนย์เทคโนโลยีอิเล็กทรอนิกส์และคอมพิวเตอร์แห่งชาติ (เนคเทค) สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ (สวทช.) โดยมีแผนงานสนับสนุน 5G infrastructure สำหรับเป็นสนามทดสอบ 5G (5G testbeds)</p>\n<p>ทั้งนี้เพื่อเป็นการเตรียมความพร้อมของภาคธุรกิจและอุตสาหกรรมการผลิต รับการมาถึงของเทคโนโลยี 5G ณ ศูนย์นวัตกรรมการผลิตยั่งยืน หรือ Sustainable Manufacturing Center: SMC อ.วังจันทร์ จ.ระยอง ซึ่งจะเป็นศูนย์กลางนวัตกรรมของภาคอุตสาหกรรมการผลิต Smart Manufacturing แห่งใหม่ในพื้นที่ EEC</p>\n<p>AIS ยังได้ทำงานร่วมกับนิคมอุตสาหกรรม และสมาคมต่างๆ ที่มีวัตถุประสงค์ในการร่วมพัฒนาธุรกิจดิจิทัลของประเทศ อาทิ สมาคมผู้ประกอบการระบบอัตโนมัติและหุ่นยนต์ไทย (TARA) และ สมาคมไทยไอโอที (TIoT) เพื่อกระตุ้นให้ภาคธุรกิจและอุตสาหกรรมมองเห็นประโยชน์จากการลงทุนด้านเทคโนโลยี และสร้างธุรกิจดิจิทัลให้เกิดขึ้นในประเทศไทย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c0403356f28cd39e3b9a69b40fa1566a.jpg\" /></p>\n<p>นอกจากนี้ AIS ยังได้จับมือร่วมกับพันธมิตรที่มีความแข็งแกร่งในด้านของ Platforms และ Solutions ชั้นนำ และยังเข้าร่วมมือกับหน่วยงานระดับภูมิภาคอย่างเช่น GSMA ในการร่วมก่อตั้ง APAC 5G Industry Community และร่วมมือกับอีกหลายองค์กร อาทิเช่น 5GEC (5G Enterprise solution Consortium) เพื่อให้เกิดการเชื่อมต่อการทำงานและนำเสนอบริการที่สามารถสร้างความได้เปรียบทางการแข่งขันของภาคอุตสาหกรรมได้อย่างแท้จริง และยังประกาศความพร้อมในการให้บริการต่างๆ ดังนี้</p>\n<p><strong>MEC (Multi-access Edge Computing)</strong> เป็นบริการที่นำศักยภาพในการประมวลผล และการจัดการข้อมูลมาอยู่ใกล้กับผู้ใช้งานหรืออุปกรณ์มากขึ้น ช่วยลดปริมาณการรับส่งข้อมูลระหว่างอุปกรณ์ และ Cloud และช่วยลดความหน่วง (latency) โดย AIS ให้บริการร่วมกับพาร์ทเนอร์ เช่น Huawei, HPE, Microsoft และ ZTE  และให้บริการได้แล้วใน 2 โมเดล คือ Shared MEC และ Dedicated MEC ที่จะช่วยเพิ่มความเป็นส่วนตัวของข้อมูล</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/729db2112d2d1287130b15164b321e61.jpg\" /></p>\n<p><strong>5G Private Network</strong> บริการเครือข่าย 5G ส่วนตัวสำหรับการใช้งานเฉพาะของแต่ละธุรกิจ สามารถทำ Network Slicing  สร้างโครงข่ายส่วนบุคคลเสมือนในระดับคลื่นความถี่ ทำให้เชื่อมต่อภายในองค์กรเป็นส่วนตัวแม้จะใช้เครือข่ายแบบไร้สาย โดย 5G Private Network จะให้บริการใน 3 รูปแบบ ได้แก่</p>\n<ul>\n<li>Virtual private network การให้บริการแบบใช้อุปกรณ์เครือข่ายต่างๆ แชร์กัน สามารถให้บริการในพื้นที่ที่มีเครือข่าย 5G ได้ทั่วประเทศ โดยสามารถทำ Network Slicing เพื่อรองรับ use cases ที่หลากหลายในสถานที่เดียวกันได้</li>\n<li>Zoning virtual private network ให้บริการในพื้นที่ zone เฉพาะเจาะจง เช่น ในพื้นที่ EEC เพื่อให้การรับส่งข้อมูลมีความคล่องตัวและมีความหน่วงในการทำงานต่ำ (Low latency) เนื่องจากอยู่ในพื้นที่บริเวณใกล้เคียงกัน</li>\n<li>Dedicated private network ให้บริการโดยการติดตั้งอุปกรณ์เครือข่ายเฉพาะสำหรับแต่ละหน่วยงาน ซึ่งมีข้อดีในเรื่องความเป็นส่วนตัวสูง สามารถบริหารจัดการได้คล่องตัว, และทำให้ผู้ใช้งานเข้าถึงระบบและข้อมูลที่เก็บอยู่ได้อย่างรวดเร็ว</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/76870e80cec0193f38aeceee3a762cf9.jpg\" /></p>\n<p><strong>Smart Manufacturing Solutions</strong> อาทิ การเพิ่มประสิทธิภาพและความยืดหยุ่นในการผลิต การทำงานระยะไกลสำหรับภาคอุตสาหกรรม เป็นต้น ผ่านการทำงานร่วมกับ Mitsubishi, Omron, TKK และล่าสุด Schneider ผู้นำด้านโซลูชันการผลิตอัจฉริยะที่จะมาเสริมการทำงานภายใต้แพลตฟอร์ม EcoStruxture ซึ่งประกอบไปด้วย 3 แอปพลิเคชันได้แก่</p>\n<ul>\n<li>Machine Advisor ซึ่งสามารถตรวจสอบอุปกรณ์ต่างๆ ได้ว่าทำงานอย่างไร</li>\n<li>Augmented Operator Advisor เพื่อใช้ AR เทคโนโลยีในการดูข้อมูลต่างๆ</li>\n<li>Secure Connect Advisor ให้คำแนะนำผู้ที่ปฏิบัติงานได้อย่างถูกต้องและปลอดภัย</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/245e7fb181b8b95ec5d1e84704079f50.jpg\" /></p>\n<p><strong>5G IoT solutions</strong> ร่วมกับ TCS โดย AIS เข้าไปให้บริการโซลูชันด้าน IoT ที่ช่วยตอบโจทย์ในการเสริมประสิทธิภาพด้านการผลิตการปรับปรุงและตรวจสอบความปลอดภัยในสถานที่ทำงานและพนักงาน การจัดการพลังงานและสิ่งแวดล้อม รวมถึงควบคุมต้นทุนในการผลิตที่ครอบคลุมในทุกมิติอย่างมีประสิทธิภาพ</p>\n<p><strong>5G Security Platform</strong> ร่วมกับ Palo Alto Network และ Cisco AIS เข้าไปให้บริการ AIS Managed Secure Access Service Edge (SASE), AIS SD-WAN และบริการด้านความปลอดภัยไซเบอร์อื่นๆ รวมทั้ง AIS CSOC ซึ่งเป็นระบบควบคุมแบบรวมศูนย์บนคลาวด์เพื่อตรวจจับและป้องกันการโจมตีทางไซเบอร์ที่สามารถทำงานร่วมกับโซลูชันด้านความปลอดภัยจากพันธมิตรชั้นนำเหล่านี้ได้อย่างสมบูรณ์</p>\n<p>5G ยังสามารถผสานการทำงานร่วมกับเทคโนโลยีต่างๆ อาทิ AR, VR, AI ทำให้เกิดการใช้งานจริงในธุรกิจมากมาย เช่น การประยุกต์ใช้ 5G เพื่อสร้างความยั่งยืนและความปลอดภัยในการเป็น Smart Green Mining ของ SCG และการสร้าง use cases ในเครือข่ายภาคี Thailand A.I. University Consortium intelligent connectivity ในภาคการศึกษาได้อีก เป็นต้น</p>\n<p>ผู้ที่สนใจข้อมูลจาก AIS Business เพิ่มเติม สามารถติดต่อทีมขายที่ดูแลองค์กรของท่าน หรืออ่านรายละเอียดเพิ่มเติมได้ที่เว็บไซต์  <a href=\"https://business.ais.co.th/5g/\">AIS Business</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ais\">AIS</a></div><div><a href=\"/topics/5g\">5G</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2315145204fc6c9c020e56df7d7ca4ccc91dff39201962cb8cf32439b427198e","category":"Thai"}