{"title":"Enhancing highway transportation safety resilience during emergencies: A network-based analysis and assessment","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307233","date":1721397600000,"content":"<p>by Xue Zhang, Yi Lu, Jie Wang, Yongzheng Qi</p>\r\n\r\nIn order to evaluate the impact of emergencies on the resilience of highway transportation, a resilience network hierarchical model of the highway transportation system was constructed by analyzing the formation and emergence process of safety resilience in the highway transportation system. Four layers of networks were divided, including highway network, transport network, traffic network, and emergency network. Combined with the network hierarchical model, a resilience evaluation index system was designed, and an assessment method for highway transportation systems based on the fuzzy analytic hierarchy process(FAHP) was proposed. Finally, a case study of a public health emergency in a region of Hunan was carried out. The results show that the proposed method for evaluating the safety resilience of highway transportation systems can better reflect the overall resilience under public health emergencies, which is consistent with the quantitative analysis results through the system resilience curve. It helps to accurately evaluate the safety resilience of the system. At the same time, this method has the advantages of flexibility and simplicity in solving unstructured decision-making problems of the system, which helps to improve the safety production management and safety resilience level of highway transportation systems. In the future, the scope of research scenarios and regions can be expanded, and further analysis of the evolution of safety resilience and the ability of resilience development in different stages under external disturbances can be conducted in order to further explore and optimize the resilience of the system.","author":"Xue Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"23181a964f8a2279da3c5014e27190e14e00b4bcbe7407bb63410be3787f060c","category":"Interdisciplinary"}