{"title":"Deciphering molecular bridges: Unveiling the interplay between metabolic syndrome and Alzheimer’s disease through a systems biology approach and drug repurposing","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304410","date":1716991200000,"content":"<p>by Zahra Azizan, Hakimeh Zali, Seyed Amir Mirmotalebisohi, Maryam Bazrgar, Abolhassan Ahmadiani</p>\r\n\r\nThe association between Alzheimer’s disease and metabolic disorders as significant risk factors is widely acknowledged. However, the intricate molecular mechanism intertwining these conditions remains elusive. To address this knowledge gap, we conducted a thorough investigation using a bioinformatics method to illuminate the molecular connections and pathways that provide novel perspectives on these disorders’ pathological and clinical features. Microarray datasets (GSE5281, GSE122063) from the Gene Expression Omnibus (GEO) database facilitated the way to identify genes with differential expression in Alzheimer’s disease (141 genes). Leveraging CoreMine, CTD, and Gene Card databases, we extracted genes associated with metabolic conditions, including hypertension, non-alcoholic fatty liver disease, and diabetes. Subsequent analysis uncovered overlapping genes implicated in metabolic conditions and Alzheimer’s disease, revealing shared molecular links. We utilized String and HIPPIE databases to visualize these shared genes’ protein-protein interactions (PPI) and constructed a PPI network using Cytoscape and MCODE plugin. SPP1, CD44, IGF1, and FLT1 were identified as crucial molecules in the main cluster of Alzheimer’s disease and metabolic syndrome. Enrichment analysis by the DAVID dataset was employed and highlighted the SPP1 as a novel target, with its receptor CD44 playing a significant role in the inflammatory cascade and disruption of insulin signaling, contributing to the neurodegenerative aspects of Alzheimer’s disease. ECM-receptor interactions, focal adhesion, and the PI3K/Akt pathways may all mediate these effects. Additionally, we investigated potential medications by repurposing the molecular links using the DGIdb database, revealing Tacrolimus and Calcitonin as promising candidates, particularly since they possess binding sites on the SPP1 molecule. In conclusion, our study unveils crucial molecular bridges between metabolic syndrome and AD, providing insights into their pathophysiology for therapeutic interventions.","author":"Zahra Azizan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"231de8b8ac3c5263819a7a38c34e856f33dd36f7c4cd8f6c6a0bd4d2d32b3e94","category":"Interdisciplinary"}