{"title":"Telesat books 14 launches with SpaceX, bypassing Blue Origin and Relativity","link":"https://arstechnica.com/?p=1966948","date":1694447330000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/f9launch1-800x533.jpeg\" alt=\"A Falcon 9 rocket streaks into space from Cape Canaveral, Florida, in this long-exposure photo.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/f9launch1-scaled.jpeg\">Enlarge</a> <span>/</span> A Falcon 9 rocket streaks into space from Cape Canaveral, Florida, in this long-exposure photo. (credit: <a href=\"SpaceX\">https://twitter.com/SpaceX/status/1700366036141580654/photo/1</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>SpaceX will launch 14 Falcon 9 rockets beginning in 2026 to deploy satellites for Telesat's Lightspeed network, a constellation designed to provide broadband connectivity for businesses, governments, and telecom operators, officials announced Monday.</p>\n<p>Telesat, a Canadian company that has been in business since 1969, has long been an operator of large communications satellites in geostationary orbit. But in 2016, the company announced it would deploy a fleet of low-Earth orbit satellites to beam low-latency, high-speed Internet around the world. The network, which Telesat calls Lightspeed, has faced delays and setbacks, eventually leading Telesat to <a href=\"https://www.telesat.com/press/press-releases/telesat-contracts-mda-as-prime-satellite-manufacturer-for-its-advanced-telesat-lightspeed-low-earth-orbit-constellation/\">switch satellite manufacturers from the European firm Thales Alenia Space to Canada-based MDA earlier this year</a>.</p>\n<p>On Monday, Telesat said it has selected SpaceX to launch the Lightspeed satellites on 14 Falcon 9 rockets from launch sites in Florida and California. Each Falcon 9 mission will loft up to 18 Lightspeed satellites on a single launch, according to Telesat. This announcement also signals a change in direction for Telesat, which previously announced launch contracts with Blue Origin and Relativity Space.</p></div><p><a href=\"https://arstechnica.com/?p=1966948#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1966948&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"23213dff10fe6c20ee732fa8aff8fb0bb833a1437a05cab024d25c4bd53039dc","category":"Tech"}