{"title":"Google says late Pixel Watch alarms will be fixed “in the coming weeks”","link":"https://arstechnica.com/?p=1925612","date":1679420937000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/10/18-800x546.jpg\" alt=\"The Pixel Watch. It's a perfect, round little pebble. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/10/18.jpg\">Enlarge</a> <span>/</span> The Pixel Watch. It's a perfect, round little pebble.  (credit: Ron Amadeo)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>What good is a watch that can't help you keep track of the time? That's a problem the Pixel Watch has been facing recently, with reports of the watch <a href=\"https://9to5google.com/2023/03/03/pixel-watch-late-alarms/\">missing alarm times</a>. <a href=\"https://support.google.com/googlepixelwatch/thread/207047349/google-pixel-watch-update-march-2023?hl=en\">Google says</a> it has the problem nailed down, though, and that a fix will be out eventually.</p>\n<p>Google doesn't explain what the problem is, but it's most likely related to Android's power-saving \"Doze\" functionality. The Pixel Watch complaints mostly have to do with alarms for the morning, so the watch was in an idle \"bedtime mode\" for the night, and the right part of the OS isn't awake to know that it's time to set off an alarm. Doze mode is a constant problem for non-Pixel Android phones, which get aggressive sleep settings from manufacturers and <a href=\"https://dontkillmyapp.com/\">frequently miss push notifications</a>. More aggressive power savings on a watch with a tiny 300 mAh battery makes sense, but Google apparently went too far. Most reports of faulty alarms only say that the alarm was delayed by 1–10 minutes, not missed entirely, but that's still annoying and makes it hard to trust the Pixel Watch for important tasks.</p>\n<p>The rollout for the fix is a bit strange. First, this announcement is for Google's March 2023 update for the Pixel Watch, but there's not much of \"March\" left—usually, these come out in the first week of the month—and Google says the update will take a week or two to hit everyone. That still won't fix your alarms, though. You'll also need an update for the clock app, which Google says will arrive via the Play Store \"in the coming weeks.\" Having to change the OS <em>and </em>the app suggests this wasn't a small bug and that Google needed to create a special carve-out specifically for alarms.</p></div><p><a href=\"https://arstechnica.com/?p=1925612#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1925612&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"23211f0e9c5526bc641d60de8076fb1290c717bc7a56e7f85353b12d821d34de","category":"Tech"}