{"title":"203 Genome Wide Association Study for reduced dry period in dairy goats","link":"https://academic.oup.com/jas/article/102/Supplement_3/38/7757091?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Canada’s goat herd is about 243,000 animals, with national yearly milk production of approximately 62.6 million L. However, the ongoing import of 182,000 kg of goat cheese highlights the potential for further expansion in milk production within the country. The period between two lactations when females are not producing milk is called the “dry period”, which ranges between 50 to 60 d in Ontario goats. Shortening the dry period without compromising animal health or production would be advantageous for producers. In Ontario, records have revealed a herd where a substantial percentage of animals experience a dry period between lactations as short as one day. A genomic study of this herd could provide an understanding regarding the genetic background of these short dry periods (= 1 d). The goal of this research was to perform a Genome Wide Association Study (GWAS) aiming to identify genes associated with dry period length. A total of 209 Saanen dairy goats with usual dry periods (coded as 0) and 54 with short dry periods (coded as 1) were analyzed. All animals were genotyped using GoatSNP50 Bead Chip from Illumina Inc. and, following genotyping quality control, 44,692 variants were retained for analysis. A GWAS using a mixed linear model implemented in GCTA software version v1.94.1 was performed, employing the “leave-one-chromosome-out” approach, excluding the chromosome containing the candidate SNP from the genetic relationship matrix (GRM) calculation. P-values were adjusted for multiple comparisons using the Benjamini &amp; Hochberg method. Additionally, a qq-plot was used to assess possible inflation of the test statistic, but no inflation (λ=1.03) was observed. Four significant SNPs (FDR &lt; 0.05) associated with short dry periods were identified, all located on chromosome 20. Subsequently, within a 60 k base pair range upstream and downstream of these markers, two candidate genes (OSMR and GHR) and one QTL associated with cannon bone circumference were identified. Of particular interest is the OSMR gene, previously linked to apoptosis in goat mammary gland mRNA profiles and showing increased mRNA and protein levels post-weaning in mice. Additionally, GHR gene has been associated with lactation persistency and various milk production traits in cows. The gene network analysis also revealed interactions between OSMR and GHR. This region on chromosome 20 seems to harbor genes influencing the dry period in dairy goats as well as the milk production traits. Further investigation of this genetic region could help increase the knowledge about the genetic background of the observed short dry periods.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"232b58a60c25627a085a23ac6ed05ea59254bdcfc6f7e40c8fe714e05ccfcaa5","category":"Environment"}