{"title":"Telenor ถอนตัวจากพม่า เตรียมขายหุ้นธุรกิจมือถือให้ M1 Group ระบุเพื่อความปลอดภัย","link":"https://www.blognone.com/node/123617","date":1625723398000,"content":"<div><div><div><p>Telenor เตรียมขายหุ้นธุรกิจมือถือทั้งหมดในประเทศพม่า (Telenor Myanmar) ให้ <a href=\"https://www.m1group.com/\">M1 Group</a> บริษัทสัญชาติเลบานอน ในราคา 105 ล้านดอลลาร์สหรัฐ<br />\nTelenor แจ้งเหตุผลของการถอนตัวว่าเหตุการณ์ในพม่าทำให้ Telenor ดูแลความปลอดภัยของพนักงานไปพร้อมๆ กับการทำตามระเบียบท้องถิ่นได้ยาก หลังก่อนหน้านี้<a href=\"https://www.blognone.com/node/123578\">รัฐบาลพม่าสั่งให้โอเปอร์เรเตอร์ทุกรายต้องติดตั้งระบบดักฟังข้อมูล และห้ามผู้บริหารเดินทางออกนอกประเทศ</a></p>\n<p>ดีลนี้ตีมูลค่าของ Telenor Myanmar ที่ 600 ล้านดอลลาร์ กระบวนการจ่ายเงินจะแบ่งจ่ายบางส่วนทันทีและอีก 55 ล้านดอลลาร์จ่ายในอีก 5 ปีข้างหน้า M1 Group จะถือหุ้นทั้งหมดของ Telenor Myanmar และเป็นผู้ดำเนินธุรกิจต่อ ที่ผ่านมา Telenor เข้าไปเปิด Telenor Myanmar ตั้งแต่ปี 2014 และเริ่มมีกระแสเงินสดเป็นบวกตั้งแต่ปี 2017 รวมจ่ายเงินปันผลออกมาแล้วกว่า 3,200 ล้าน NOK (11,800 ล้านบาท)</p>\n<p>ระหว่างนี้ Telenor จะยังถือ Telenor Myanmar เป็นสินทรัพย์ที่ถือไว้เพื่อการขายและการดำเนินงานที่ยกเลิก (asset held for sale and discontinued operations) โดยยอดขาดทุน-กำไร จะถูกนับในงบประมาณรวมของบริษัทอยู่</p>\n<p>ที่มา - <a href=\"https://www.telenor.com/media/press-release/telenor-group-sells-telenor-myanmar-to-m1-group%e2%80%af\">Telenor</a> via <a href=\"https://au.finance.yahoo.com/news/telenor-group-sells-telenor-myanmar-050100056.html\">Yahoo Finance</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/dd5dc917650668bb26637789c18c3abd.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/telenor\">Telenor</a></div><div><a href=\"/topics/myanmar\">Myanmar</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2332e445f15504de9e82363dd52fbb8e04f5aeecc27662f7650f96480d05fef4","category":"Thai"}