{"title":"Evaluation of Dunaliella salina Growth in Different Salinities for Potential Application on Saline Wastewater Treatment and Biomass Production","link":"https://www.preprints.org/manuscript/202405.0013/v1","date":1714574832000,"content":"This study investigated the adaptability of Dunaliella salina to different salinity levels, with emphasis on growth, pigment concentration, and desalination potential. It was found that among the 21 salinity levels (0-20%), 75‰ salinity produced consistently favorable results in cell count (13.08 x 103 ± 1.41 x 103 cells/mL), dry biomass (2.46 ± 0.06 g/L), pigment content (chlorophyll a = 9.75 ± 0.01 µg/L, chlorophyll b = 12.36 ± 0.03 µg/L), and desalination (9.32 ± 0.47 % reduction). Therefore, 75‰ salinity level was selected for the final trial (scale-up), which revealed unanticipatedly high cell counts (58.96 x 103 ± 535.22 cells/mL), with dry biomass weight being statistically extremely different (higher) than the expected (4.21 ± 0.02 g/L) (p&amp;lt;0.0001), most likely due to high cell count and energy reserve storage for high salinity adaption in the form of bio-compounds. Pigment growth continued (chlorophyll a = 9.54 ± 0.2 µg/L, chlorophyll b = 12.81 ± 0.51 µg/L), indicating pigment production under salt stress. Notably, desalination did not occur in this stage, possibly due to the necessity for a bigger initial inoculate, prolonged exposure or bioaccumulation becoming the prevailing mechanism over desalination. Despite this, the microalgae thrived in high salinity conditions. These findings point to further study into the mechanics of salt build-up within cells, which might lead to successful desalination technologies. Dunaliella salina adaptation to high salinity settings suggests its possible usage in natural pools or soils that are normally inappropriate for traditional production, giving a chance for enterprises to function in rough extreme salinity conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2332d13817e3211bb72e30bf48b034459363c8555e8bb3d0cc16dbb3829d01bb","category":"Interdisciplinary"}