{"title":"Mechanics of Rainfall-Induced Landslides after a Prolonged Dry Period Based on Laboratory Tests and Numerical Models Incorporating Soil-Water Characteristic Curves","link":"https://www.preprints.org/manuscript/202403.1735/v1","date":1711605245000,"content":"In India, particularly within its North-Eastern territories, the occurrence of landslides triggered by post-dry period rainfall events is a significant concern, with the phenomena persistently causing extensive damage to both life and infrastructure. Despite the inevitability of such natural disasters, it is understood that the impact they exert can be substantially mitigated through the implementation of pre-emptive measures. Critical to the endeavour of landslide prevention is the application of a spectrum of mitigation strategies, predicated upon a foundational analysis of slope stability to ascertain critical surfaces for intervention. This investigation delves into the dynamics of partially saturated soils, a condition commonly resultant from the prolonged dry periods preceding the monsoonal rains. The study's focal point is an experimental examination conducted on soil samples to assess parameters such as soil matric suction and unconfined compressive strength across varying degrees of saturation and density, alongside performing analyses of slope failure incidents after dry period during the 2017 monsoon in the Lunglei district, Mizoram based on some established data. The Soil-Water Characteristic Curve (SWCC), derived from soil suction measurements employing the ASTM D5298-10 standard, utilizes a contact filter paper method and serves to delineate the moisture transition phases of the slope. To replicate the desiccation of the soil slope after monsoonal rains, a microwave drying technique based on the ASTM standard was employed to prepare unsaturated soil samples for Unconfined Compressive Strength (UCS) testing. The integrity of the slope was evaluated in a temporal context, before and after rainfall events of varied intensities throughout the calendar year, utilizing a blend of numerical modeling and empirical laboratory investigations. The persistence of real onsite slope failures underscores the necessity for a numerical analysis approach to unravel the underlying factors causing slope instability, especially given the absence of prior stability assessments for the landslide in question. An evaluation of SWCC curves, UCS tests on partially saturated soil at different densities and saturation and the utilization of the benchmark data collected in 2017 on the shallow transitional landslide in Lunglei, Mizoram caused by intense monsoonal precipitation, are central key data and information used to carry out this research. Rainfall data for Lunglei, sourced from the Mizoram Meteorological Department, facilitated a real-time monsoonal data-driven numerical analysis. This analysis elucidated the pivotal role of rainfall in inducing slope failure, indicating a marked destabilization of the slope after precipitation events. The implications of these findings are far-reaching, suggesting a foundational basis for the development of an advanced landslide early warning system, thereby enhancing disaster preparedness, and mitigating potential damages.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"233ca606ef96c5112800cb076d11b1aa18f900444221f2264cd8717b58b44980","category":"Interdisciplinary"}