{"title":"Pfizer’s anti-COVID drug still looks effective after further analysis","link":"https://arstechnica.com/?p=1820983","date":1639596313000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1296011310-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1296011310.jpg\">Enlarge</a> <span>/</span> Scenes like this might become less common if a new SARS-CoV-2 protease inhibitor becomes widely available. (credit: <a href=\"https://www.gettyimages.com/detail/photo/doctors-examining-woman-in-icu-during-covid-19-royalty-free-image/1296011310?adppopup=true\">Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Monday, pharmaceutical giant Pfizer released more data on its anti-COVID-19 drug, named Paxlovid. The company had released its initial data on the drug in early November, and it <a href=\"https://arstechnica.com/science/2021/11/pfizer-says-its-antiviral-pill-can-cut-89-of-covid-hospitalizations-and-deaths/\">looked extremely promising</a>: a drop in hospitalization and death of 89 percent in high-risk patients. But preliminary results like that don't always hold up, as we <a href=\"https://arstechnica.com/science/2021/11/womp-womp-efficacy-of-mercks-thor-inspired-covid-pill-crumbles-vexing-experts/\">saw with a drug from Merck</a>. But there's good news in this case: Paxlovid appears to be just as effective once more patients and numbers from a second trial are included.</p>\n<h2>On trial</h2>\n<p>Paxlovid inhibits a viral protein called a protease, which normally breaks chemical bonds in other viral proteins, converting them into their mature, functional forms. This processing is needed before the virus is able to copy its own genome, so inhibiting the protease should block viral reproduction.</p>\n<p>Pfizer started at least two clinical trials with Paxlovid. One involved unvaccinated individuals who are at high risk from COVID-19 due to age or health issues. The second trial involved moderate risks: either unvaccinated individuals with no risk factors, or those who have been vaccinated but are at elevated risk. In both trials, treatments started within days of a confirmed infection.</p></div><p><a href=\"https://arstechnica.com/?p=1820983#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1820983&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"234ac25d9b007ca092669759cc3eab2cd8c9240bcc576e1d8f4537153927edbd","category":"Tech"}