{"title":"Curly Hair Follicle is Sculpted by a Contracted Arrector Pili Muscle. A Hypothesis with Treatment Implications","link":"https://www.preprints.org/manuscript/202409.1791/v1","date":1727094384000,"content":"The enormous diversity of hair fibers found in human population is striking, while the basic structure of human fibers is often the same! But why do some fibers curl? Curling is related to the machinery and processes that produce different keratin filament orientation in relation to the axis of hair growth, influenced by developmental and molecular control. It is established that a curly hair shaft is produced by a curved hair follicle that have an angulated dermal implantation, with a bulb bent in the shape of golf club, while the outer root sheath is dissymmetrical; have an outer side that is convex bulging and thin and a concave side in which the cells express alpha-smooth muscle protein reflecting internal mechanical force. Yet, the exact cause of hair curling is not known. All the previous studies were short of impacting curly hair treatment. My hypothesis is that the curling mechanical force is generated by a hypersensitive contracted Arrector Pili muscle (APM) of the hair follicle. In curly hair, each APM fiber is shortened; pulling its attachment spot upward towards the epidermis and obliquely or laterally; curling the outer root sheath to produce the curved follicle described above. This contraction has the influence at a time when the young hair root is being formed and keratin microfibrils are being oriented and packed. APM is a multi-unit muscle wherein each fiber contracts independently to create the enormous diversity of curly hair types. APM contraction can be modulated by oral administration of selective smooth muscle relaxing treatment that relax the curved follicle from within. Further studies are needed to confirm the role of APM in shaping curly hair follicle including AI studies, i.e., computer-aided target identification to demonstrate APM active site that can interact with herbal small molecules.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2352393a46aeca193608840829dfd8fe4ef25fb4e3870cfd610339bd989e1bf8","category":"Interdisciplinary"}