{"title":"Existing wetland conservation programs miss nutrient reduction targets","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae129/7644603?rss=1","date":1713225600000,"content":"<span><div>Abstract</div>Restoring wetlands will reduce nitrogen contamination from excess fertilization but estimates of the efficacy of the strategy vary widely. The intervention is often described as effective for reducing nitrogen export from watersheds to mediate bottom-level hypoxia threatening marine ecosystems. Other research points to the necessity of applying a suite of interventions, including wetland restoration to mitigate meaningful quantities of nitrogen export. Here, we use process-based physical modeling to evaluate the effects of two hypothetical, but plausible large-scale wetland restoration programs intended to reduce nutrient export to the Gulf of Mexico. We show that full adoption of the two programs currently in place can meet as little as 10% to as much as 60% of nutrient reduction targets to reduce the Gulf of Mexico dead zone. These reductions are lower than prior estimates for three reasons. First, net storage of leachate in the subsurface precludes interception and thereby dampens the percent decline in nitrogen export caused by the policy. Unlike previous studies, we first constrained riverine fluxes to match observed fluxes throughout the basin. Second, the locations of many restorable lands are geographically disconnected from heavily fertilized croplands, limiting interception of runoff. Third, daily resolution of the model simulations captured the seasonal and stormflow dynamics that inhibit wetland nutrient removal because peak wetland effectiveness does not coincide with the timing of nutrient inputs. To improve the health of the Gulf of Mexico efforts to eliminate excess nutrient, loading should be implemented beyond the field-margin wetland strategies investigated here.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"235afe09d89c685de0b75272a1bc765cd616bc155430c6ab11dafd36a4a49712","category":"Interdisciplinary"}