{"title":"Stability mechanism of Monascus pigment–soy protein isolate–maltodextrin complex","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13539?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p><i>Monascus</i> pigment (MP) is a natural food coloring with vital physiological functions but prone to degradation and color fading under light conditions.</p>\n<h2>RESULTS</h2>\n<p>This study investigated the effect of complex formation of soybean protein isolate (SPI), maltodextrin (MD), and MP on the photostability of MP. Light stability was assessed through retention rate and color difference. Fluorescence spectroscopy (FS), circular dichroism (CD), Fourier-transform infrared (FTIR) spectroscopy, and X-ray diffraction (XRD) explored MP, SPI, and MD interactions, clarifying the MP–SPI–MD complex mechanism on the light stability of MP. Microstructure and differential scanning calorimetry (DSC) analyzed the morphology and thermal properties. The retention rate of MP increased to approximately 80%, and minimal color difference was observed when adding SPI and MD simultaneously. FS revealed hydrophobic interaction between MP and SPI. FTIR analysis showed intensity changes and peak shifts in amide I band and amide II band, which proved the hydrophobic interaction. CD showed a decrease in α-helix content and an increase in β-sheet content after complex formation, indicating strengthened hydrogen bonding interactions. Scanning electron microscopy (SEM) analysis demonstrated that MP was attached to the surface and interior of complexes. XRD showed MP as crystalline, while SPI and MD were amorphous, complexes exhibited weakened or absent peaks, suggesting MP encapsulation. The results of DSC were consistent with XRD.</p>\n<h2>CONCLUSION</h2>\n<p>SPI and MD enveloped MP through hydrogen bonding and hydrophobic interaction, ultimately enhancing its light stability and providing insights for pigment–protein–polysaccharide interactions and improving pigment stability in the food industry. © 2024 Society of Chemical Industry.</p>","author":"Qiuyu Wang, \nXiaoyu Li, \nJia Hao, \nDuoxia Xu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"235f00ffff2157628a12ea94b68db60d386d02a4e84b404c78b19eda6246b99f","category":"Environment"}