{"title":"USPS picks a new mail truck—and no, they won’t all be electric","link":"https://arstechnica.com/?p=1744806","date":1614186120000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/suburb2_9-scaled-980x670.jpg\" alt=\"\"></div>\n        <p>\n          No, this isn't a rendering from a Pixar film, it's what the new USPS mail delivery vehicle will look like.                       [credit:\n                        USPS                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>The United States Postal Service has decided on a new delivery vehicle. On Tuesday afternoon, the USPS awarded a 10-year, $485-million contract to Oshkosh Defense—better known for armored vehicles—to deliver between 50,000 and 165,000 Next Generation Delivery Vehicles, with the first trucks due on the road in 2023.</p>\n<p>Neither the USPS nor Oshkosh is ready to share in-depth specs for the NGDV; Oshkosh still has to finalize the design, according to the press release. We do know that the new fleet will be made of a mix of powertrains. Some will be battery electric, but others will use \"fuel-efficient internal combustion engines,\" with the ability to be retrofitted \"to keep pace with advances in electric vehicle technology.\"</p>\n<p>The rendered images certainly show a uniquely styled vehicle. The combination of an extremely low hood and very tall windshield gives it more than a little resemblance to a Pixar creation, but the payoff for this anatine look should be excellent forward visibility. Luckily for future postal workers, air conditioning is standard-issue, so they shouldn't get too hot due to that expanse of glass trapping the Sun's heat.</p></div><p><a href=\"https://arstechnica.com/?p=1744806#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1744806&comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"23615dcdaa596216a5d64609c3ac0940cc862dff3459983fdb56a4e167dc765b","category":"Tech"}