{"title":"Citizen Lab พบมัลแวร์จากบริษัทอิสราเอล ถูกใช้โจมตีนักการเมือง, สื่อ, นักสิทธิมนุษยชน","link":"https://www.blognone.com/node/123757","date":1626455152000,"content":"<div><div><div><p>Citizen Lab ร่วมมือกับไมโครซอฟท์วิเคราะห์มัลแวร์จากบริษัท Candiru ในอิสราเอล โดยไมโครซอฟท์เรียกกลุ่มมัลแวร์นี้ว่า SOURGUM ให้บริการมัลแวร์ DevilsTongue ในรูปแบบ hacking-as-a-service แก่รัฐบาลทั่วโลก</p>\n<p>ไมโครซอฟท์พบว่าเหยื่อของมัลแวร์ DevilsTongue กระจุกตัวอยู่ในแถบปาเลสไตน์ประมาณครึ่งหนึ่ง ที่เหลืออยู่ใน อิสราเอล, อิหร่าน, เลบานอน, เยเมน, สเปน, สหราชอาณาจักร, ตุรกี, อาร์เมเนียร์, และสิงคโปร์ โดยไม่แน่ชัดว่าผู้ว่าจ้างให้โจมตีมาจากชาติใดบ้าง</p>\n<p>Citizen Lab หาข้อมูลของ Candiru จากเอกสารหลุดและคำฟ้องในคดีที่เคยมี พบว่าบริษัททำงานคล้ายบริษัทรับแฮกอื่นๆ เช่น NSO Group โดยลูกค้าต้องจ่ายเงินค่าแรกเข้าเพื่อใช้งานบริการแฮก คิดเป็นเงิน 16 ล้านยูโรหรือประมาณ 620 ล้านบาท และจะแฮกคอมพิวเตอร์ได้ไม่จำกัดจำนวน แต่จะมอนิเตอร์การทำงานของอุปกรณ์ที่เป็นเหยื่อได้พร้อมกันเพียง 10 อุปกรณ์เท่านั้น หากต้องการใช้งานเพิ่มต้องซื้อไลเซนส์เพิ่ม 15 อุปกรณ์และจะโจมตีเหยื่อเพิ่มขึ้นได้อีกหนึ่งชาติ หากจ่ายเพิ่ม 5.5 ล้านยูโรจะมอนิเตอร์อุปกรณ์ได้อีก 25 ตัวและโจมตีเหยื่อเพิ่มได้อีก 5 ชาติ</p>\n<p>ตัวมัลแวร์สามารถดึงข้อมูลออกจาก Gmail, Skype, Facebook สามารถดึงประวัติการเข้าเว็บและรหัสผ่าน รวมถึงสามารถบันทึกภาพจากเว็บแคม, เสียงจากไมโครโฟน, และภาพหน้าจอ สามรรถจ่ายเพิ่มเพื่อมอนิเตอร์ทวิตเตอร์, Viber, และ Signal ได้</p>\n<p>ทาง Citizen Lab พบมัลแวร์จากนักกิจกรรมทางการเมืองในยุโรป และขอสำเนาอิมเมจของฮาร์ดดิสก์ออกมาได้ ทำให้ได้ตัวอย่างมัลแวร์ ทางไมโครซอฟท์วิเคราะห์มัลแวร์พบว่าใช้ช่องโหว่ที่ไม่เคยมีการรายงานมาก่อนสองรายการ ได้แก่ CVE-2021-31979 และ CVE-2021-33771 ที่เปิดทางให้โค้ดเจาะทะลุ sandbox ของเบราว์เซอร์และเพิ่มสิทธิจนทำงานในระดับเคอร์เนลได้ ช่องโหว่ทั้งสองตัวแพตช์ในรอบเดือนกรกฎาคมเรียบร้อยแล้ว</p>\n<p>ตัวมัลแวร์ DevilsTongue มีการออกแบบเป็นโมดูล มีความสามารถพื้นฐานในตัว เช่นการดึง cookie จากเบราว์เซอร์ (รองรับทั้ง Chrome, Chromium, Edge, UCBrowser, Yandex, Firefox, Opera) และยังมีความสามารถใช้ cookie กับบริการเช่น Facebook, Twitter, Gmail, Yahoo เพื่อดึงข้อความจากบริการเหล่านี้ออกมาตรงๆ รวมถึงส่งข้อความโดยรวมรอยบัญชีเหยื่อ</p>\n<p>ที่มา - <a href=\"https://citizenlab.ca/2021/07/hooking-candiru-another-mercenary-spyware-vendor-comes-into-focus/\">Citizen Lab</a>, <a href=\"https://blogs.microsoft.com/on-the-issues/2021/07/15/cyberweapons-cybersecurity-sourgum-malware/\">Microsoft</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1f21fff9753316515f1e822edf3a55a2.jpg\" /></p>\n<p>ภาพโดย  <a href=\"https://pixabay.com/th/photos/%e0%b8%81%e0%b8%b2%e0%b8%a3%e0%b9%81%e0%b8%ae%e0%b9%87%e0%b8%81-%e0%b9%84%e0%b8%8b%e0%b9%80%e0%b8%9a%e0%b8%ad%e0%b8%a3%e0%b9%8c-blackandwhite-2903156/\">iAmMrRob</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/citizen-lab\">Citizen Lab</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/malware\">Malware</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"236c288e4ddf3123cb48759be8880b522480016883899ea9e35460bcefeb1693","category":"Thai"}