{"title":"Home (DreamWorks Animations)","link":"https://markpeak.net/home-dreamworks/","date":1682911333000,"content":"<p>Home เป็นภาพยนตร์การ์ตูนแอนิเมชันปี 2015 ของค่าย DreamWorks Animation ที่เพิ่งมารู้จักและได้ดูเมื่อไม่นานนี้เอง</p>\n<p>หลังจากยุค Shrek, Kang Fu Panda และ Madagascar รุ่งเรืองในทศวรรษ 2000s เหมือน DreamWorks เงียบๆ ไปอยู่ช่วงหนึ่ง ซึ่ง Home ถือเป็นอีกหนึ่งงานที่เงียบๆ ของยุคนี้</p>\n<p>Home เป็นเรื่องของมนุษย์ต่างดาวเผ่า Boov ตัวสีม่วง หนีภัยจากมนุษย์ต่างดาวอีกเผ่าคือ Gorg เลยบุกมาอาศัยอยู่ในโลกมนุษย์ ด้วยวิทยาการที่เหนือกว่า เผ่า Boov จับมนุษย์ไปอยู่ในเมืองใหม่ที่สร้างขึ้นตามทะเลทราย (เช่น ในออสเตรเลีย) แล้วตัวเองก็ย้ายเข้ามาอยู่ในบ้านของมนุษย์ตามเมืองใหญ่ๆ ของโลก</p>\n<p>ตัวเอกของเรื่องเป็นมนุษย์ต่างดาว Boov ที่ไม่มีใครชอบ เพราะทำอะไรเฟอะฟะเสมอ เพื่อนๆ เลยเรียกว่า Oh เพราะเวลาโผล่มา คนอื่นก็จะร้อง โอ้ แล้วเบือนหน้าหนี</p>\n<p>ส่วนฝ่ายมนุษย์เป็นวัยรุ่นสาวชื่อ Tip ที่รอดจากการดูดของเผ่า Boov มาได้แบบบังเอิญ แต่ก็ทำให้เธอต้องแยกกับแม่ที่ถูกดูดไป</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2023/05/home-gallery-4.jpg\" alt width=\"1000\" height=\"563\" srcset=\"https://markpeak.net/wp-content/uploads/2023/05/home-gallery-4.jpg 1000w, https://markpeak.net/wp-content/uploads/2023/05/home-gallery-4-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2023/05/home-gallery-4-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2023/05/home-gallery-4-700x394.jpg 700w\" /></p>\n<p>แกนของเรื่องคือทั้ง Oh และ Tip ต้องมาร่วมผจญภัยกันบนรถยนต์บินได้ (เป็น road movie หน่อยๆ) เพื่อตามหาแม่ของ Tip และตามหา “บ้าน” ที่แท้จริงของทุกคน ตามชื่อเรื่อง</p>\n<p>หนังมี plot twist เล็กน้อยพอให้สนุกๆ แต่โครงพล็อตหลักก็คาดเดาได้ไม่ยากตามสไตล์หนังเด็ก มีตลกไร้สาระและแอคชั่นผจญภัยตามสมควร ภาพรวมดูได้เพลินๆ เหมาะสำหรับเด็กๆ</p>\n<p>ข้อเสียคือไม่มีอะไรเด่น โดยเฉพาะตัวละครที่ออกแบบได้ไม่ค่อยน่าดึงดูดนัก (เดินไปถามใคร คงแทบไม่มีใครรู้จักว่าเผ่า Boov มาจากเรื่องไหน หากเทียบกับตัวละครค่ายเดียวกันอย่าง Puss in Boots ที่คนรู้จักกันถ้วนหน้า)</p>\n<p>หนังทำเงินได้ 386 ล้านดอลลาร์ คะแนนรีวิวเฉลี่ย 52% ถือว่าสะท้อนภาพความกลางๆ ไปซะทุกอย่างได้ดี (ต้องบอกว่าทำเงินได้ดีกว่าที่คาดด้วยซ้ำ)</p>\n<p></p>The post <a href=\"https://markpeak.net/home-dreamworks/\">Home (DreamWorks Animations)</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"2371bdd8f08f5f31e2ab8b3a3c273bdcd90310054c6ef27fb00820fea75c5244","category":"Thai"}