{"title":"Top 10: Finish Line Faces of Milan-San Remo","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/top-10-finish-line-faces-of-milan-sanremo","date":1615887000000,"content":"\n      <p>The effect of racing for seven hours and the lifting of the lid on a day-long exercise in concentration produces an explosion of delight and exhaustion on the faces of the riders who emerge triumphant on the Italian Riviera. </p>\n<p>Mix this in with the total pandemonium that only Italy can conjure, and Milan-San Remo is almost guaranteed to produce some of the finest images of celebration from the entire season.</p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2021-preview\"><em>Related: Milan-San Remo 2021 Preview</em></a></p>\n<p>First up is Laurent Fignon (above) – young and carefree in the spring of 1989 – as he celebrates two comically oversized additions to his trophy cabinet with the insouciance of someone who has battled for seven hours in the final throes of winter’s worst weather and can pull whatever face he wants to pull. </p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Eddy_Merckx_04_190376_1024x1024.jpg?v=1596632034\" alt=\"Eddy Merckx Milan Sanremo\"></p>\n<h3>Eddy Merckx, 1976</h3>\n<p>One of the most iconic finish line shots in cycling history, Merckx throws his hands in the air after winning his seventh and final edition of Milan-San Remo.</p>\n<p>Even at the age of 30 and after countless career wins, the Belgian displays the consummate swagger of a serial winner and the genuine delight of a man addicted to the thrill of victory.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-killer-smile-of-milan-sanremo-s-original-campionissimo\">Related: The first real superstar of Italian cycling: Costante Girardengo, six-time Milan-San Remo winner</a></p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Eddy_Merckx_1966_08_1024x1024.jpg?v=1596632096\" alt=\"Eddy Merckx\"></p>\n<h3>Eddy Merckx, 1966</h3>\n<p>Compare and contrast. Ten years earlier and the youthful joy of Merckx’s biggest win to date – his debut Milan-San Remo and his first taste of big time success – is clear to see.</p>\n<p>Aged just 20 years-old, March 20, 1966, was the bright dawning of a new era in cycling: the era of the Cannibal.</p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Milan-SanRemo_26_2009_1024x1024.jpg?v=1596632178\" alt=\"Mark Cavendish\"></p>\n<h3>Mark Cavendish, 2009</h3>\n<p>The emotion bursts out of Mark Cavendish as the significance of his last gasp lunge to the line to overhaul Heinrich Haussler hits home. Meanwhile former winner, Mario Cipollini, offers his congratulations and shares in Cavendish’s joy. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/what-does-2021-hold-for-mark-cavendish\">Related: What does 2021 hold for Mark Cavendish?</a></p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/Petacchi_joy_2_190305_OFS_1024x1024.jpg?v=1596632215\" alt=\"Petacchi\"></p>\n<h3>Alessandro Petacchi, 2005</h3>\n<p>Even the experienced can shed a tear on the Via Roma. Amongst the crowds of <em>tifosi </em>on the famous finish line, teammates battle to congratulate the Italian while photographers jostle for that key shot. <img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Germain_Derycke_1955_04_1024x1024.jpg?v=1596632256\" alt=\"Germain Derycke\"></p>\n<h3>Germain Derycke, 1955</h3>\n<p>Mobbing by fans, press, entourage and police officers is a common theme in the pandemonium of the finish area in San Remo.</p>\n<p>Classics specialist Derycke, who also won Liege-Bastogne-Liège, the Tour of Flanders and Paris-Roubaix in his career, shows his displeasure at having a giant panettone shoved in his face by an unknown assailant.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/philippe-gilbert-the-road-to-recovery-dreaming-of-san-remo\">Related: Philippe Gilbert: The Road to Recovery, dreaming of San Remo</a></p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_MilanSanRemo_2014_15_1024x1024.jpg?v=1596632341\" alt=\"Kristoff\"></p>\n<h3>Alexander Kristoff, 2014</h3>\n<p>There is barely space to swing a telephoto lens but somehow Luca Paolini fights through the scrum to find his teammate Kristoff and embrace over the fence surrounding the finish line enclosure.</p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_De-Vlaeminck_1973_02_1024x1024.jpg?v=1596632525\" alt=\"De Vlaeminck\"></p>\n<h3>Roger De Vlaeminck, 1973</h3>\n<p>In some instances, riders can do nothing but let the adrenalin and exhaustion overcome them. De Vlaeminck is wheeled to the podium after his breathless solo break to the line held off the sprinting pack. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related: The 2021 Men's Early Season: The Rouleur Racing Guide</a></p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/Gomez_2_1982_OFS_1024x1024.jpg?v=1596632618\" alt=\"Marc Gomez\"></p>\n<h3>Marc Gomez, 1982</h3>\n<p>The form book might as well be thrown out of the window for the roulette wheel of tactics, skills, strength and fortune that rolls in the finale of Milan-San Remo.</p>\n<p>In 1982 Marc Gomez won <em>La Primavera </em>only three months<em> </em>into his debut season as a professional. Riding over the crest of the Poggio in an improbable two-man breakaway, his companion and compatriot Alain Bondue slipped on the greasy tarmac, handing him a solo ride to the line.</p>\n<p>There’s something Merckx-esque about the orange jersey, upturned white casquette and podium scene. The cream stucco building with shutters half open is even in the same place as the shot from 1976.</p>\n<p>But rather than standing proud, the improbable champion, practically lost in a sea of faces, is almost swept away by the maelstrom of activity on the podium.</p>\n<p style=\"text-align: left;\"><img alt=\"Sean Kelly\" src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/ofs_cycling_sean_kelly_05_1024x1024.jpg?v=1596632683\" style=\"float: none;\"></p>\n<h3>Sean Kelly, 1986</h3>\n<p>Sometimes, after the longest day of racing on the cycling calendar, all that matters is making it to the podium and throwing your hands in the air for all to see.</p>\n<div class=\"klaviyo-form-UFKPji\"></div> \n    ","author":"AppHQ Collaborator","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"23733fdf4cee35cf22d8f7cb88b674e3a4dfedc62c4346ec65e6de10b85ca9f4","category":"Cycling"}