{"title":"Telomere length links with physiological phenotype and breeding patterns in a long-lived seabird","link":"https://academic.oup.com/auk/article/doi/10.1093/ornithology/ukad049/7276405?rss=1","date":1694995200000,"content":"<span><div>Abstract</div>Telomere length (TL) is known to covary with a suite of physiological traits involved in energy balances that may influence breeding success. Thus, TL may be an indicator of individual quality, influencing mate choice and breeding strategies. In the Brown Booby (<span>Sula leucogaster</span>), a long-lived seabird, we investigated in a total of 72 pairs whether TL may indicate the individual physiological phenotype by examining how it relates to mitochondrial DNA copy number (mtDNAcn) and corticosterone (CORT) levels. Then, we tested if TL is associated with mating patterns by looking for covariation with skin coloration (a condition-dependent sexual trait), whether there is assortative mating by TL, and if the degree of TL similarity between partners influences an individual’s likelihood of changing mates between reproductive seasons. Because environmental conditions can have important effects on the condition and reproductive strategies of individuals, the study was performed in 2 colonies with contrasting breeding conditions. We found that TL was positively related to mtDNAcn (but not CORT levels), suggesting that individuals with shorter telomeres may have a reduced mitochondrial density. TL was reflected in sexual coloration, but only in the colony with good breeding conditions. There was positive assortative mating by TL; however, the degree of assortative mating was unrelated to the probability of mate change, which greatly varied between the 2 colonies. Our results suggest that TL is associated with the physiological phenotype of individuals and their breeding patterns. Importantly, contrasting environmental conditions influenced the link between TL and sexual coloration and the propensity of individuals to change mate, highlighting the importance of environmental variation on mating patterns.</span>","author":"","siteTitle":"Ornithology Current Issue","siteHash":"4b42e15d9ceec568e037973cb16bc8a0448c103c6eaf3f714117d3650f8eefe7","entryHash":"2388662cfca2d9940aa1080c6ee6d1bc5e0bf7b8128af18817fbdca8ce797ae9","category":"Environment"}