{"title":"Climate variability in West Anatolia from Last Glacial Maximum to present based on the µXRF data from Buldan Yayla Lake (Denizli)","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3658?af=R","date":1727952210000,"content":"<h2>ABSTRACT</h2>\n<p>Studying climate changes in the Eastern Mediterranean and Aegean region, particularly in Western Anatolia, is crucial for understanding environmental dynamics over time. We present high-resolution, long-term micro-X-ray fluorescence data from Buldan Yayla Lake (Denizli-Buldan), a key area, covering the period from the Last Glacial Maximum (LGM) to the present. Sedimentological and paleoclimate data are supported by high-resolution radiocarbon analyses, as well as two tephra chronologies from Cape Riva and Minoan. According to the results, a cold and arid climate is observed during the LGM, Post-LGM and Younger Dryas. From the LGM to the present, there has been a trend towards increasing warmth and humidity. During the Late Glacial (LG) and Holocene (especially in the early Holocene), the climate was warmer and more humid. A short-lived climate change associated with the Older Dryas is recorded during the Bølling–Allerød warm period (~13 200–12 350 cal a <span>bp</span>) within the LG. The data indicate that the sediment cores of Buldan Yayla Lake are highly sensitive in reflecting climate information between the LGM and the present day. At the same time, the climate in Western Anatolia is recorded as more stable throughout the Holocene. In conclusion, this study enhances our understanding of Western Anatolia's climate dynamics and environment–society relationship from the LGM to the present.</p>","author":"Mustafa DoĞan, \nYasemin Ünlü, \nŞule Gürboğa, \nSabina Fiołna, \nÇetin Şenkul","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"238f777d024c6476dc29760255b5a19086ff5e653286d62ea0098f72abbb16d3","category":"Environment"}