{"title":"Where did Safari 15 put iCloud Tabs? On the Start Page","link":"https://www.macworld.com/article/538751/where-did-safari-15-put-icloud-tabs-on-the-start-page.html","date":1633338000000,"content":"<div>\n<section><div></div></section><p>The iCloud Tabs feature that syncs open tabs in Safari across all your devices didn’t disappear in iOS 15, iPadOS 15, and Safari 15 for macOS, but it might seem like it. Previously, you found shared tabs in these places (and also see “<a href=\"https://www.macworld.com/article/235004/what-operating-systems-works-with-icloud-tabs-across-devices.html\">What Apple operating systems work with iCloud Tabs across devices?</a>”):</p>\n\n\n\n<ul><li><strong>iOS 14/iPadOS 14 and earlier:</strong> In Safari, tap the Tab Overview button (two overlapping rectangles) and swipe down past locally opened tabs until you see listings for other devices by name, showing each tab. Tap to open one of those in the current device’s Safari browser.</li><li><strong>Safari 14 and earlier in macOS:</strong> Click the similar Tab Overview button and then see list of tabs by devices below open tabs as you scroll down. Click to open.</li></ul><h2>How to access iCloud Tabs in iOS 15, iPadOS 15, and macOS</h2>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/mac911-new-icloud-tabs.png?w=1107\" /><figcaption>The Start Page hides iCloud Tabs at the bottom in iOS 15/iPadOS 15 and Safari 15 for macOS.</figcaption></figure></div></div>\n\n\n\n<p>The new approach of using the Start Page makes more sense from an organizational standpoint, but you might have been unable to find it.</p>\n\n\n\n<ol><li>Create a new Start page. In iOS 15 or iPadOS 15, tap the + button; in Safari 15 for macOS, options vary—see below.</li><li>Swipe or scroll down to find the name of one of your devices in large bold type with a list of its tab.</li><li>Optionally tap or click that device name to select another Mac, iPad, and iPhone.</li><li>Tap or click to open the tab.</li></ol><p>Safari 15 lets you create a Start Page in several ways:</p>\n\n\n\n<ul><li>In any tab, click the Start Page icon in the upper-left corner.</li><li>In any tab, choose <em>Bookmarks &gt; Show Start Page</em>.</li><li>Set <em>Safari &gt; Preferences &gt; General &gt; New windows open with</em> or <em>New tabs open with</em> to Start page, and you can use Command-N or Command-T to create a new Start Page.</li></ul><p>If you use iCloud Tabs all the time in Safari for macOS, you can also add a toolbar icon to show all your devices’ tabs at once in a dropdown menu. Choose <em>View &gt; Customize Toolbar</em>, drag the iCloud Tabs icon into the position on the toolbar you want, and then click Done.</p>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/mac911-icloud-tabs-button.png\" /><figcaption>Add an iCloud Tabs button in Safari for rapid access.</figcaption></figure></div></div>\n\n\n\n<p>One problem with the new tab groups organization feature in iOS 15, iPadOS 15, and Safari 15 for macOS is that iCloud Tabs only shows tabs open in the <em>currently</em> chosen tab group on Safari on your other devices. This may mean tabs you are trying to access don’t appear. </p>\n\n\n\n<p>Also, many readers have reported that iCloud Tabs can fall out of date and not list current pages open in their other devices’ Safaris. Sometimes, items listed include tabs they closed some time ago. There’s no fix for that except signing out of iCloud on your device and back in, which brings a host of other issues with it related to syncing—I don’t recommend it to solve this problem.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"2392e3fa0a92ea028559eb7bae23b1fd217f30de0072171525b8597781b62dc8","category":"Apple"}