{"title":"Temporal variability in host availability alters the outcome of competition between two parasitoid species","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14191?af=R","date":1727327423000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/71202b38-e60b-4b40-84f2-c3e10e26573c/jane14191-toc-0001-m.png\" alt=\"Temporal variability in host availability alters the outcome of competition between two parasitoid species\" />\n<p>Temporal resource availability is a common attribute in trophic interactions, but how small magnitude temporal resource variability shifts the fitness and interspecific competition between consumers are not clearly understood. Considering the high frequency of such resource variability happens, it is necessary to study the effect of temporal variability on species dynamics.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nVariability in the availability of resources through time is a common attribute in trophic interactions, but its effects on the fitness of different consumer species and on interspecific competition between them are not clearly understood.\n\nTo investigate this, we allowed two parasitoid species, <i>Trichopria drosophilae</i> and <i>Pachycrepoideus vindemiae</i>, to exploit <i>Drosophila</i> host pupae under different temporal variability treatments, either on their own or simultaneously.\n\nWhen tested individually (in the absence of interspecific competition), both parasitoid species had lower fitness when hosts were exposed for a short duration at high density than when exposed for a long duration at low density. When both parasitoid species exploited hosts simultaneously, interspecific competition significantly decreased the number of offspring for both parasitoid species. The outcome of this interspecific competition depended on host temporal variability, with <i>T. drosophilae</i> or <i>P. vindemiae</i> dominating in short and long host exposure treatments, respectively.\n\nThese results can be explained by the combination of host availability and egg load of female adult parasitoids. When abundant hosts are provided for a short period, the ample mature eggs of the proovigenic <i>T. drosophilae</i> enable them to exploit hosts more efficiently than <i>P. vindemiae</i>, which is synovigenic. However, <i>P. vindemiae</i> is an intrinsically superior competitor and dominates when multiparasitism occurs. Multiparasitism is more frequent when hosts are at low levels relative to the egg load of the parasitoids.\n\nOur results clearly demonstrate that resource temporal availability can alter the outcome of competition between consumers with different reproductive traits.\n</p>","author":"Hua Wang, \nTiantian Liu, \nShucun Sun, \nOwen T. Lewis, \nXinqiang Xi","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"23938b3cbdcd7619fb1ff1dc541adb2a54f3af302f61abd0f6f42d2270b4801c","category":"Environment"}