{"title":"What mimes can teach us about visual perception","link":"https://arstechnica.com/?p=1766305","date":1621552747000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>When we watch a mime seemingly pull rope, climb steps, or try to escape that infernal box, we don't struggle to recognize the implied objects. Rather, our minds automatically \"see\" them, a new study concludes. </p></div>\n<p>The art of mime has been around in some form for millennia, although when it comes to contemporary depictions in popular culture, mimes seem to be almost <a href=\"https://allthetropes.fandom.com/wiki/Everyone_Hates_Mimes\">universally hated</a>. But they still have something to teach us. Scientists at Johns Hopkins University have brought mime into the laboratory for a series of experiments exploring how the human brain fills in perceptual gaps. When a performer mimes an action on an unseen object, we form a kind of visual representation of that object in our mind, even though there is no physical object there. The implication of its physical presence is sufficient, according to <a href=\"https://journals.sagepub.com/doi/abs/10.1177/0956797620939942?journalCode=pssa\">a recent paper</a> published in the journal Psychological Science.</p>\n<p>\"Most of the time, we know which objects are around us because we can just see them directly,\" said co-author <a href=\"https://perception.jhu.edu/chaz/\">Chaz Firestone</a> of JHU's <a href=\"https://perception.jhu.edu/\">Perception &amp; Mind Laboratory</a>. \"But what <a href=\"https://releases.jhu.edu/2021/04/01/mimes-help-us-see-objects-that-dont-exist/\">we explored here</a> was how the mind automatically builds representations of objects that we can't see at all but that we know must be there because of how they are affecting the world. That's basically what mimes do. They can make us feel like we're aware of some object just by seeming to interact with it.\"</p>\n<p>Firestone's research to date has focused on a couple of key questions in cognitive psychology. First, how do people come to possess basic intuitions about the physics of the objects around us? If we see a precariously stacked pile of dishes, for instance, we worry about the possibility it might topple over, breaking the dishes. </p></div><p><a href=\"https://arstechnica.com/?p=1766305#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1766305&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2396ef9e16cdfabe1acea7d9bf37b6995e63c94f780333b4a059bf6f5ee9760d","category":"Tech"}