{"title":"Predicted short‐term mesoscavenger release gives way to apex‐scavenger dominance","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14180?af=R","date":1726809615000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/da284bff-cc19-433d-a39f-095437b6a3d8/jane14180-toc-0001-m.png\" alt=\"Predicted short-term mesoscavenger release gives way to apex-scavenger dominance\" />\n<p>Following the global collapse of vulture populations, researchers ask if this ecologically important scavenging group can re-establish itself in a scavenging community from a point of near extirpation. Using a mechanistic model parameterised with field data, they analyse vultures' path to recovery and generate general insights into threatened vulture populations. Note that the silhouettes are from <a target=\"_blank\" href=\"https://www.phylopic.org/\">https://www.phylopic.org/</a> under public domain.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nVultures play a crucial role in scavenging communities as apex scavengers. Scavenging communities in turn are a key component of terrestrial ecosystems, ensuring that dead biomass is removed quickly and efficiently. Anthropogenic disturbances, particularly mass poisonings, have caused crashes in vulture populations in Africa and Asia.\n\nWe ask if vultures can re-establish themselves in a scavenging community from a point of near extirpation. To allow for maximum knowledge transfer across ecosystems, we focus on an ecosystem that is otherwise considered pristine.\n\nWe chose Kruger National Park (KNP), a well-documented African scavenging community, as our focal ecosystem and parameterised a mathematical model of scavenging-community dynamics using field data from the park. We predicted the upper limit of vulture population size in an ecosystem like KNP. We then analysed vultures' path to recovery, using this empirically parameterised scavenging-community model. We used perturbation methods to determine how parameter values that may be specific to KNP influence our predictions.\n\nComparisons of predicted vulture carrying capacity with recent population estimates suggest that the cumulative effect of human activities on vulture abundance is larger than previously believed. Our analysis shows that vulture populations can reach their carrying capacity approximately five decades after a poisoning event that would almost extirpate the population. Over shorter time scales, we predict a decade of enhanced mammal abundance (i.e. mesoscavenger release) before the mammals are excluded from the scavenging community. In our study system, jackals and hyenas are the mammalian groups predicted to benefit from the absence of vultures. However, neither group removes biomass as efficiently as vultures and animal carcasses are predicted to accumulate in the ecosystem while the vulture population recovers.\n\nIn our framework, the carrying capacity for vulture populations is determined by carcass availability. As evidence for an alternative regulating factor is lacking, we conclude that present-day vulture population densities are orders of magnitude below their upper limits. Our results therefore suggest that with a recovery plan in place, the long-term prospects for vulture species and the associated ecosystems are positive.\n</p>","author":"J. G. Donohue, \nP. T. Piiroinen, \nA. Kane","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"23989d6146b16ad45924c7a22e4f25d4cff339d326b874cefe73fc186072df0a","category":"Environment"}