{"title":"Dope Log: Richard Freeman receives four-year ban from sport and Toon Aerts gets two-year ban for Letrozole","link":"https://www.cyclist.co.uk/news/2023-pro-cycling-doping","date":1692720376000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/news/2023-pro-cycling-doping\">Dope Log: Richard Freeman receives four-year ban from sport and Toon Aerts gets two-year ban for Letrozole</a></p>\n\n<p>Welcome back to another edition of <a href=\"https://www.cyclist.co.uk/tags/pro-log\" target=\"_blank\">Pro Log</a>. This weekend, I went to my first cycling race of the year (how wild!), the Ryedale Grand Prix. Millie Couzens (Fenix-Deceuninck) won the sprint ahead of Hutchinson-Brother UK’s Tiffany Keep and Mary Wilkinson of Team Boompods. Harry Birchill was victorious in the men’s race as his <a href=\"https://www.cyclist.co.uk/in-depth/saint-piran\" target=\"_blank\">Saint Piran</a> team pulled off an impressive 1-2-3-4-5 finish.</p>\n\n\n\n<p>On to this week’s Pro Log, which covers the <a href=\"https://www.cyclist.co.uk/in-depth/doping-cycling\" target=\"_blank\">doping</a> bans received by Richard Freeman and Toon Aerts. </p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/giro-vuelta-weather-swap\">Is it time to swap the dates of the Giro and Vuelta?</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/doping-cycling\">Doping in cycling: Everything you need to know</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\">Vuelta a España 2023: Stage-by-stage preview and everything we know so far</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>1. Richard Freeman given four-year ban</h2>\n\n\n\n<figure><img width=\"970\" height=\"657\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/GettyImages-462742042-970x657.jpg\" alt=\"portrait photo of former team sky doctor Richard Freeman\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/GettyImages-462742042-970x657.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/GettyImages-462742042-300x203.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/GettyImages-462742042-768x521.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/GettyImages-462742042-1536x1041.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/GettyImages-462742042-2048x1388.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/GettyImages-462742042-750x508.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/GettyImages-462742042-1140x773.jpg 1140w\" /><figcaption>Bryn Lennon/Getty Images</figcaption></figure>\n\n\n\n<p>Former <a href=\"https://www.cyclist.co.uk/tags/british-cycling\" target=\"_blank\">British Cycling</a> and <a href=\"https://www.cyclist.co.uk/tags/ineos-grenadiers\" target=\"_blank\">Team Sky</a> doctor Richard Freeman received a four-year ban from all sport after violating anti-doping rules for ‘possession of a prohibited substance’ and ‘tampering’. In May 2011, Freeman possessed an order of 30 testosterone gel sachets at the National Cycling Centre in Manchester and lied to UK Anti-Doping (UKAD) about doing so. Testosterone is a banned substance and prohibited under UK Anti-Doping rules. </p>\n\n\n\n<p>After receiving information in September 2016 of a possible anti-doping rule violation by Team Sky at the Criterium du Dauphiné in June of 2011, UKAD began an investigation into the alleged content of the <a href=\"https://www.cyclist.co.uk/news/ukad-closes-wiggins-jiffy-bag-investigation\" target=\"_blank\">‘jiffy bag’ package</a> delivered to Freeman. This was later closed after being unable to refute the claim it contained the decongestant Fluimicil. It was during this investigation that UKAD also uncovered said previously mentioned delivery of 30 Testogel sachets to the Manchester Velodrome.</p>\n\n\n\n<p><a href=\"https://www.ukad.org.uk/news/former-british-cycling-and-team-sky-doctor-richard-freeman-receives-ban-sport-anti-doping-rule\" target=\"_blank\">UKAD said</a> that in February 2017, Freeman claimed to have ordered the Testogel for ‘a non-rider member of British Cycling staff’ whose identity has not been revealed. Freeman lied when saying the Testogel had been returned to the supplier for destruction. In March 2021, an independent Medical Practitioners Tribunal Service (MPTS) ‘found proven’ the allegation of Freeman ordering testosterone, ‘knowing or believing it’ to be for an unnamed rider to improve athletic performance, had lied to UKAD that the Testogel was for a ‘non-rider’ and had lied that it was returned to the supplier. As a result, Freeman was removed from the Medical Register. He appealed but this decision was upheld by the High Court. </p>\n\n\n\n<p>Concurrently with the MPTS hearing, UKAD suspended Freeman and charged him with possession of a prohibited substance and two separate tampering violations. These occurred when Freeman lied about the Testogel being returned to the supplier and knowingly providing UKAD with false information (that he had written to a non-rider staff member to wave patient confidentiality and claimed they refused to do so). An independent tribunal of the National Anti-Doping Panel found all charges proven and that Freeman intended to make the prohibited substance delivered to the Manchester Velodrome available to one or more of his athletes.</p>\n\n\n\n<p>The identity of the athletes involved is unknown. </p>\n\n\n\n<h2>2. Toon Aerts receives two-year ban</h2>\n\n\n\n<div><blockquote><p>Final statement (English) <a href=\"https://t.co/qxn7LnJgry\" target=\"_blank\">pic.twitter.com/qxn7LnJgry</a></p>— Aerts Toon (@ToAerts) <a href=\"https://twitter.com/ToAerts/status/1693720492606148860?ref_src=twsrc%5Etfw\" target=\"_blank\">August 21, 2023</a></blockquote> </div>\n\n\n\n<p>Cyclocross rider Toon Aerts has received a two-year ban after testing positive for Letrozole in an out-of-competition test taken in January 2022. The UCI found the 29-year-old Belgian failed to establish how the prohibited substance entered his body. His two-year ban is backdated to 16th February 2022 (when he accepted the initial provisional suspension) and his results from 19th January 2022 to 5th February 2022 have been scratched. Letrozole can be used to treat breast cancer and is a banned drug on the World Anti-Doping Agency Prohibited List due to its potential use with anabolic steroids to avoid adverse effects and/or boost testosterone production. </p>\n\n\n\n<p>In a statement posted on social media, Aerts said, ‘I wish to comment one last time on the UCI ruling that fell last Friday. I was working really hard towards the first races. The feeling was getting better by the week, wattages were rising, fun was returning… and then suddenly, during a tough training session in the Ardennes, I got the message that the verdict would come one day later. And it came. While I was choosing lighting fixtures in a wholesaler, my girlfriend’s phone suddenly keeps ringing. From her eyes, I could see enough. Even before I got through the mail from the UCI or could speak to anyone, the ruling was made world famous. 1.5 years I had to wait for this final verdict. I may have typed in the word Letrozole on Google 5,000 times during this period, hoping to find the missing piece of the puzzle. But we didn’t find it. Now where on earth did it come from? I still don’t know exactly how this got into my body. But I can’t blame myself. I threw thousands of euros at it, visited several universities, had several reports written by experts, and in the meantime I just kept on running, cycling and teaching.</p>\n\n\n\n<p>‘Never was I invited by the UCI or given the chance to speak to anyone physically. Everything was via email or registered mail. We were always bound by tight deadlines to reply within a few days, which often included holidays. But on the other hand, we always had to wait weeks, sometimes months, before we could receive anything back. Waiting, waiting, waiting… and meanwhile watching the races go by without finding my name somewhere in a result. I think they sometimes forget that riders are also just flesh-and-blood people. It has also become clear to me over the past few months that the ‘presumption of innocence’ simply doesn’t exist here. I thought this was a basic right. We tried to explain everything we knew ourselves as transparently as possible and to substantiate it scientifically. This showed with 100% certainty that I am not a conscious doping user. You then at least hope for common sense from the people on the other side. But there just isn’t any. The legal framework is sacred.</p>\n\n\n\n<p>‘In terms of personality, I changed through this period. I was sometimes unlovable. Someone who was only concerned with himself and this case. Lost a bit of faith in humanity. Maybe became a bit of an asshole myself because of everything. My girlfriend told me several times that I wasn’t like the Toon I used to be. But you know, I had to defend myself tooth and nail against the people and authority who suddenly started claiming out of the blue that I had taken doping [sic]. Doping… I am someone who could always stand to lose, that was just extra motivation to do better next week! I was a rider who took podiums almost every week, had successes and had a role in every race I started. I lived from race to race… [] Suddenly, I would be a doper? I never took doping and never even considered it. I’m much smarter than that! </p>\n\n\n\n<p>‘Here we are. After a year and a half in a legal tug-of-war, now portrayed as a cheater. Along with my entire family… suddenly labelled losers. It hurts and doesn’t feel right. Well here UCI, a big and heartfelt middle finger! You could have made us the happiest people on earth… but who is Toon Aerts in the big circus of cycling? I am now closing this rotten period here in front of me and together with my family and entourage I am trying to quietly find some peace and joy in life again. I only hope that my case rings a bell with everyone… my heart is already bleeding for Shari [Bossuyt] who is in the same situation.’</p>\n\n\n\n<p>Here, Aerts references <a href=\"https://www.cyclist.co.uk/news/2023-pro-cycling-shari-bossuyt\" target=\"_blank\">the case of Shari Bossuyt</a> who also tested positive for Letrozole during the Tour de Normandie Féminin in March and was made provisionally non-active by her Canyon-SRAM team. She is awaiting a decision from the French Anti-Doping Agency. </p>\n\n\n\n<p>See you next week, when the Vuelta a España will be underway. The last Grand Tour of the year… how time flies.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/news/2023-pro-cycling-doping\">Dope Log: Richard Freeman receives four-year ban from sport and Toon Aerts gets two-year ban for Letrozole</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Robyn Davidson &#124; Editorial Assistant","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"239aea59a585d05164551902af40b7cf0a6134d68269fdb60286fb3a5d7738a8","category":"Cycling"}