{"title":"Assessing the evidence for treating developmental plasticity and phenotypic flexibility as different phenomena","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14590?af=R","date":1717655651000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/99a19db8-1d66-4b3a-9388-610146ac00d9/fec14590-toc-0001-m.png\" alt=\"Assessing the evidence for treating developmental plasticity and phenotypic flexibility as different phenomena\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/05/07/assessing-the-evidence-for-treating-developmental-plasticity-and-phenotypic-flexibility-as-different-phenomena/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPhenotypic plasticity has long played a central role in eco-evolutionary theory, but it was not until 20 years ago that it was proposed that the term encompasses two distinct phenomena—developmental plasticity and phenotypic flexibility. While this terminology has since been adopted by some, the question of whether they are distinct phenomena remains contentious and they are both frequently lumped under the umbrella of ‘plasticity.’\n\nHere, we treat the dichotomy between developmental plasticity and phenotypic flexibility as a hypothesis, put forth a set of predictions that follow from this hypothesis, and review the support for this hypothesis in the literature. We predict that, if they result from separate phenomena, developmentally plastic and phenotypically flexible traits should differ in: (1) the environmental context under which they evolve, (2) their mechanisms of regulation, (3) their costs of production, (4) how selection acts on them and (5) their influence on a population's evolutionary trajectory.\n\nIn general, most evidence supports treating developmental plasticity and phenotypic flexibility as separate phenomena, but much remains to be learned, and few studies have specifically investigated their potential differences. In particular, explorations of their regulation, as well as the costs of trait production and reversal are needed.\n\nGiven the hypothesized link between developmental plasticity, phenotypic flexibility and resiliency in the face of rapid environmental change, this is an urgent topic that will further our understanding of phenotypic evolution across environmental contexts.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/05/07/assessing-the-evidence-for-treating-developmental-plasticity-and-phenotypic-flexibility-as-different-phenomena\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>Resumen</h2>\n<p>\n\nLa plasticidad fenotípica ha jugado un papel central en la teoría eco-evolutiva por largo tiempo, sin embargo solo hace veinte años que se propuso que el término abarca dos fenómenos distintos: la plasticidad del desarrollo y la flexibilidad fenotípica. Aunque algunos han adoptado esta terminología, la cuestión de si se trata de fenómenos distintos es polémica y con frecuencia ambos se agrupan bajo el paraguas de la “plasticidad.”\n\nAquí, tratamos la dicotomía entre plasticidad del desarrollo y flexibilidad fenotípica como una hipótesis, presentamos predicciones que se derivan de esta hipótesis y revisamos el apoyo a esta hipótesis en la literatura. Predecimos que, si son el resultado de fenómenos separados, los rasgos que se desarrollan plásticamente y que son fenotípicamente flexibles deberían diferir en: (1) el contexto ambiental bajo el cual evolucionan, (2) sus mecanismos de regulación, (3) sus costos de producción, (4) cómo actúa la selección sobre ellos, y (5) su influencia en la trayectoria evolutiva de una población.\n\nEn general, la mayor parte de la evidencia respalda el tratamiento de la plasticidad del desarrollo y la flexibilidad fenotípica como fenómenos separados, pero aún queda mucho por aprender y pocos estudios han investigado específicamente sus posibles diferencias. En particular, se necesitan explorar como se regulan, así como los costos de producción y reversión de rasgos.\n\nDado el vínculo hipotético entre la plasticidad del desarrollo, la flexibilidad fenotípica y resiliencia al rápido cambio ambiental, este es un tema urgente que mejorará nuestra comprensión de la evolución fenotípica en contextos ambientales.\n</p>","author":"Maria Stager, \nJonathan P. Velotta, \nZachary A. Cheviron, \nNathan R. Senner","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"239c3ff96ca1c154ece36915c91243ab277cb6015eb228ec684ccbb5820d7b5c","category":"Environment"}