{"title":"Diagnosing deception: How doctors solved a woman’s dramatically faked condition","link":"https://arstechnica.com/?p=1935503","date":1682720727000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-1337944295-800x532.jpeg\" alt=\"A health care worker in a medical intensive care unit.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-1337944295-scaled.jpeg\">Enlarge</a> <span>/</span> A health care worker in a medical intensive care unit. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/medical-intensive-care-unit-at-jacques-cartier-hospital-in-news-photo/1337944295?adppopup=true\">Getty | BSIP</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Diagnosing medical conditions is not easy. Patients can have nondescript symptoms that could point to common problems as easily as rare or poorly understood ones. They can sprinkle in irrelevant details while forgetting crucial ones. And they can have complex medical histories and multiple conditions that can muddy the diagnostic waters.</p>\n<p>But then, there are the rare cases of pure deception. Such was the case of a woman seen at Massachusetts General Hospital for intense pain and jerking movements. <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMcpc2300896\">The woman's case record</a>, published this week in the New England Journal of Medicine, documents the thorough investigation of her dramatic condition. Doctors' initial alarm at her symptoms led to puzzlement as inconsistencies and oddities piled up.</p>\n<p>It began when the woman presented to another hospital complaining of abdominal pain, jerking motions in her right arm and leg that she worried were seizures, as well as confusion, agitation, a rash on her chest, and a dislocated jaw bone. She told doctors at that hospital that she had a history of acute intermittent porphyria and that her symptoms matched previous flares of the condition.</p></div><p><a href=\"https://arstechnica.com/?p=1935503#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1935503&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"239f314e9eb9742ffaece8720b5a036af8e50c1070f8cc48608c2993869680f0","category":"Tech"}