{"title":"Previous assessments of faecal glucocorticoid metabolites in Cape mountain zebra (Equus zebra zebra) were flawed","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14621?af=R","date":1721915694000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/932848e5-8bbb-448c-ada3-79e7e120b0de/fec14621-toc-0001-m.png\" alt=\"Previous assessments of faecal glucocorticoid metabolites in Cape mountain zebra (Equus zebra zebra) were flawed\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/12/previous-assessments-of-faecal-glucocorticoid-metabolites-in-cape-mountain-zebra-were-flawed/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSteroid hormones, especially glucocorticoids (GCs), are widely used to assess physiological responses to stressors. As steroid hormones are heavily metabolised prior to excretion, it is essential to validate enzyme immunoassays (EIAs) for measuring faecal glucocorticoid metabolites (fGCMs). Although problems with unvalidated assays have been raised repeatedly, their use persists widely.\n\nLea et al. (2017) used an unvalidated corticosterone assay (CJM006) to relate fGCM concentrations to habitat quality, demography and population performance in the Cape mountain zebra (<i>Equus zebra zebra</i>). Here, we revisit their findings and evaluate the validity of their conclusions using a validated EIA. First, we evaluate the biological sensitivity of six EIAs (three group-specific metabolite assays and three corticosterone assays, including CJM006) through a biological validation experiment (translocation) for two sub-species of mountain zebra, Cape mountain and Hartmann's mountain zebra (<i>E. z. hartmannae</i>). Second, we reanalyse the faecal extracts from Lea et al. (2017) using a validated EIA.\n\nfGCM concentrations consistently increased following translocation, when using two 11-oxoaetiocholanolone (lab codes: 72T and 72a) and an 11ß-hydroxyaetiocholanolone (69a) EIA, but did not with three different corticosterone EIAs. All corticosterone EIAs (including CJM006) failed to detect an increase in fGCMs within the critical 48–72-h period post translocation. Therefore, the CJM006 EIA utilised in Lea et al. (2017) does not sensitively measure hypothalamic–pituitary–adrenal (HPA) axis activity in CMZ faeces.\n\nUsing a validated assay (72T), fGCM concentrations were no longer associated with adult sex ratio or habitat quality (measured by grassiness) and these variables were dropped from predictive models. fGCM concentrations now varied between seasons and were negatively associated with female fecundity (foal:mare ratio). Consequently, we can conclude that the results of the previous study are unreliable.\n\nWe introduce the terms “insensitive” and “sub-optimal” to categorise assays that are tested but fail validation, and assays that are comparatively poor at detecting relevant hormone changes, respectively. We discuss how both “insensitive” and “sub-optimal” assays could lead to incorrect inferences about population stressors and counterproductive conservation recommendations.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/07/12/previous-assessments-of-faecal-glucocorticoid-metabolites-in-cape-mountain-zebra-were-flawed/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Jake A. Britnell, \nRupert Palme, \nGraham I. H. Kerley, \nJohn Jackson, \nSusanne Shultz","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"239f9b9b129603e70e3a0bedfc80285b53bf17a3e7ba544602f59c951922b320","category":"Environment"}