{"title":"People exaggerate the consequences of saying no to invites","link":"https://arstechnica.com/?p=1992723","date":1703271616000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1442576398-800x533.jpg\" alt=\"A green envelope with a white card within it.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1442576398.jpg\">Enlarge</a> <span>/</span> The invitation might be nice, but you can feel free to say no. (credit: <a href=\"https://www.gettyimages.com/detail/photo/green-envelope-with-a-white-sheet-on-a-gray-royalty-free-image/1442576398?phrase=party+invite\">Maryna Terletska</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The holidays can be a time of parties, events, dinners, outings, get-togethers, impromptu meetups—and <a href=\"https://arstechnica.com/science/2009/12/stress-in-the-ancient-americas/\">stress</a>. Is it really an obligation to say yes to every single invite? Is not showing up to Aunt Tillie’s annual ugly sweater party this once going to mean a permanent ban? Turning down some of those invitations waiting impatiently for an RSVP can feel like a risk.</p>\n<p>But wait! Turning down an invite won’t necessarily have the harsh consequences that are often feared (especially this time of year). A group of researchers led by psychologist and assistant professor Julian Givi of West Virginia University put test subjects through a series of experiments to see if a host’s reaction to an invitation being declined would really be as awful as the invitee feared. In the experiments, those who declined invitations were not guilted or blacklisted by the inviters. Turns out that hosts were not so upset as invitees thought they would be when someone couldn’t make it.</p>\n<p>“Invitees have exaggerated concerns about how much the decline will anger the inviter, signal that the invitee does not care about the inviter, make the inviter unlikely to offer another invitation in the future, and so forth,” the researchers said in a <a href=\"https://www.apa.org/pubs/journals/releases/psp-pspi0000443.pdf\">study</a> published by the American Psychological Association.</p></div><p><a href=\"https://arstechnica.com/?p=1992723#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1992723&amp;comments=1\">Comments</a></p>","author":"Elizabeth Rayne","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"23afaffe0939b9d812b9672967c5d09f993d0c642eb8fdf57c07c0b0d702bed8","category":"Tech"}