{"title":"Rivian’s electric truck features include air compressor and AC outlets","link":"https://arstechnica.com/?p=1763611","date":1620496152000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Rivian-R1T-profile-980x653.jpeg\" /></div>\n        <p>\n          Unless we're mistaken, the Rivian R1T will be the first battery electric truck in the US market.                      [credit:\n                        <a href=\"https://rivian.com/\">Rivian</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Electric vehicle startup Rivian is moving closer to production of its <a href=\"https://arstechnica.com/cars/2018/11/rivian-reveals-400-mile-range-electric-truck-and-suv-starting-at-61500/\">innovative-looking trucks and SUVs</a>. The first launch edition R1T pickup trucks are expected in June, with series production models arriving at the start of 2022. And even though I'm not really a truck person, I remain as fascinated now by this new entrant into the most quintessentially American part of the vehicle market as I was <a href=\"https://arstechnica.com/cars/2019/04/these-are-the-best-new-vehicles-of-the-2019-new-york-international-auto-show/\">after first seeing one in 2019</a>.</p>\n<p>Ahead of those initial deliveries, the company reached out to share some of info about the R1T, which looks like it will offer Swiss Army knife-levels of versatility to its owners. It's about the size you'd expect of a full-size pickup truck: 217.1 inches (5.51 m) long, 81.8 inches (2.08 m) wide, and between 72.1-78.3 inches (1.83-1.99 m) tall depending on whether it's in kneel mode (ground clearance: 8.7 inches/0.22 m) or off-road mode (ground clearance: 14.9 inches/0.38 m).</p>\n<p>The big lockable cargo area under the hood (also known as a frunk) can stash 11 cubic feet (311 L) of stuff. And at the rear, you'll find a tow hook capable of pulling up to 11,000 lbs (4,989 kg). It lives beneath an aerodynamic cover when not in use.</p></div><p><a href=\"https://arstechnica.com/?p=1763611#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763611&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"23b4c936eaf24d094289515ad4c39dba2e80e309f3d199cd2769c4d8c20b15f1","category":"Tech"}