{"title":"iPhone Other storage: What is it and how do you clear it?","link":"https://www.macworld.com/article/232651/iphone-other-storage-what-is-it-and-how-do-you-delete-it.html","date":1618853998000,"content":"\n<div>\n<section><div></div></section><p>I’m sure this sounds familiar: You’re trying to download and install the <a href=\"https://www.macworld.com/article/331864/ios-14-5-features-release-date-beta-how-to-install.html\">latest iOS release</a>, or take some photos, or download that cool app your friend told you about, and your iPhone says the storage is full.</p>\n\n\n\n<p>You’ve already deleted every app you don’t think you need, and there’s <em>still</em> not enough space. So you look at your iPhone storage in Settings and, sure enough, your iPhone is full. Worst of all, a <em>huge</em> chunk of it is just listed as <em>Other</em>. What’s that supposed to mean? How do you get rid of it?</p>\n\n\n\n<p>The Other storage section is mysterious and confusing, and there’s no one answer that works for everyone, but hopefully this guide will help you deal with this problem.</p>\n\n\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<h4>\n\t\t\t\t\t\t\t\t\t</h4>\n\t\t\t</div>\n\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>Apple iPhone 12</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images.idgesg.net/images/article/2020/10/iphone-12-press-100864210-orig.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t\t\t</div><a href=\"https://www.macworld.com/article/234703/iphone-12-review.html\" target=\"_blank\">Read our review</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\tMSRP:\n\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t64GB $799 | 128GB $849 | 256GB $949\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/buy-iphone/iphone-12&amp;subid1=1-1-232651-0-0-0\" target=\"_blank\">US$829 at Apple</a> | <a href=\"https://www.amazon.com/dp/B08L5NZHK6?tag=macworld05-20&amp;#038;linkCode=ogi&amp;#038;th=1&amp;#038;psc=1&amp;ascsubtag=1-1-232651-0-0-0\" target=\"_blank\">$829.00 at Amazon</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</div>\n\t\t</div>\n\n\t\t\n\n\n<h2>How to view your iPhone storage</h2>\n\n\n\n<p>To see how much storage all your apps and data are taking up on your iPhone’s storage, open the <em>Settings</em> app, select <em>General</em>, then <em>iPhone Storage</em>. Up top you’ll see a bar graph showing your total iPhone storage and which types of data are filling it up. Beneath that you’ll find a list of applications on your phone and how much room they take up, both for the app itself and its stored data.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/04/iphone-storage-100793337-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/04/iphone-storage-100793337-large.jpg\" /></a><figcaption><p>You’ll find your iPhone storage details a few layers deep in the Settings app.</p>\n</figcaption></figure></div>\n\n\n\n<p>It may take several seconds for your iPhone to show the graph, as it takes time to scan and analyze its storage. Even after the chart first appears, you’ll want to wait several seconds more for it to stabilize, as the app list and storage sizes can change while your phone completes its analysis.</p>\n\n\n\n<h2>What is Other storage, anyway?</h2>\n\n\n\n<p>Your iPhone Storage menu will divide that bar up top into familiar categories like Apps, Media, Photos, and Mail, but also an Other category that is sometimes <em>very</em> large. It’s common for Other to be in the 5-10GB range, but if it’s way over 10GB, it has probably grown out of control. You can scroll all the way down to the bottom of the app list to see how much space “System” and “Other” are taking up.</p>\n\n\n\n<p>The Other category is big and varied, because it’s a real catch-all category. It’s comprised of system files, caches, Siri voices (if you’ve <a href=\"https://www.macworld.com/article/3255944/how-to-change-siri-voice.html\">downloaded other voices</a>), logs, updates, and so much more. One of the biggest culprits for Other growing out of hand is streaming lots of music and video. When you <em>download</em> video or music from the iTunes store, TV app, or Music app, it’s indexed as Media. But <em>streams</em> have caches used to ensure smooth playback, and those are categorized as Other.</p>\n\n\n\n<p>Safari’s caches can start to grow pretty large, too. And if you send tons of texts with images or video, the caches for that can start to fill up a lot of space.</p>\n\n\n\n<p>Your iPhone is supposed to manage these caches to keep your storage from becoming completely full, but it doesn’t always do a great job.</p>\n\n\n\n<h2>How to reduce the size of Other data</h2>\n\n\n\n<p>You can’t get rid of Other entirely, but you can sometimes reduce its size.</p>\n\n\n\n<p>First, let’s try clearing your Safari caches. Open <em>Settings</em> &gt; <em>Safari</em> and choose <em>Clear History and Website Data</em>. If you have a <em>lot</em> of Safari tabs open on your iPhone, you might want to close most of them, too.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/04/iphone-safari-history-100793344-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/04/iphone-safari-history-100793344-large.jpg\" /></a><figcaption><p>Clearing your Safari data might reduce the size of Other.</p>\n</figcaption></figure></div>\n\n\n\n<p>You might also want to change Messages to save fewer old messages. Open <em>Settings</em>, then <em>Messages</em>, and scroll down to the <em>Message History</em> setting. By default, <em>Keep Messages</em> is set to <em>Forever</em>, but you may want to change it to <em>1 Year</em> or even <em>30 Days</em> to reduce the data that the Messages app caches.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/04/iphone-messages-keep-100793345-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/04/iphone-messages-keep-100793345-large.jpg\" /></a><figcaption><p>If you’re a heavy texter, your Messages app might be filling up your storage with a <em>lot</em> of data.</p>\n</figcaption></figure></div>\n\n\n\n<p>Finally, go back to iPhone Storage and look at the apps list. Most of the apps store data that is categorized as Apps, but some will keep caches that are categorized as Other. If, say, the Podcasts app is taking up a couple gigabytes of space, it’s likely mostly cached data. Deleting the app and re-downloding it might put a dent in the Other category.</p>\n\n\n\n<h2>The nuclear option: Backup and Reset with iTunes</h2>\n\n\n\n<p>You can go through your iPhone trying to delete every little cache that could grow the size of Other storage, but if you really want to make it as small as possible, you need to back up your phone and reset it. This can take a little while.</p>\n\n\n\n<p>The best way to do this is to use iTunes on your Mac or PC.</p>\n\n\n\n<p>Connect your iPhone to your computer and launch iTunes. You may be prompted to allow access on your iPhone and required to enter your passcode, which you should do.</p>\n\n\n\n<p>Select your iPhone by clicking the little phone icon in the upper left, and under Backups, choose <em>This Computer</em>. Checking <em>Encrypt local backup</em> is a good idea, so your account passwords and Health data gets backed up, too. Just choose a password you won’t forget. Click the button to <em>Back up now</em>.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2017/09/itunes_backup_iphone_encrypted-100736704-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2017/09/itunes_backup_iphone_encrypted-100736704-large.jpg\" /></a><figcaption><p>Create an encrypted backup to make the restore process as painless as possible.</p>\n</figcaption></figure></div>\n\n\n\n<p>When the backup is done, disconnect your iPhone and head to <em>Settings</em> &gt; <em>General</em> &gt; <em>Reset</em> and choose <em>Erase All Content and Settings</em>. This will return your iPhone to an out-of-the-box state. When it restarts and it’s in the initial setup process, re-connect it to your computer with iTunes open, and follow the instructions on screen to restore your device.</p>\n\n\n\n<p>This is the longest and most involved way to reduce the size of Other storage, but it’s also the best; there’s just no way to get it any smaller than it will be after a fresh reset and restore.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"23b68080717d2c9bc01bdecda73b91828c8468a1527f098de95cf3e563a519fe","category":"Apple"}