{"title":"Impact of the Mbarara University of Science and Technology residency training on increasing access to specialty care workforce","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003021","date":1710943200000,"content":"<p>by Leevan Tibaijuka, Jonathan Kajjimu, Lorna Atimango, Asiphas Owaraganise, Adeline Adwoa Boatin, Musa Kayondo, Nixon Kamukama, Joseph Ngonzi</p>\r\n\r\nGraduate tracer studies provide an avenue for assessing the impact of residency training on the distribution and access to specialty care and exploring job and professional satisfaction of alumnus. This study examined how the Mbarara University of Science and Technology (MUST) clinical residency training program influenced the spatial distribution and career paths of specialists. We conducted a mixed methods study involving an online survey and 12 in-depth interviews (IDIs) from June to September 2022. The online survey was distributed to a convenient sample of clinical residency alumnus from MUST via email and Whatsapp groups. Alumnus were mapped across the countries of current work in QGIS (version 3.16.3) using GPS coordinates. Descriptive and thematic analyses were also conducted. Ninety-five alumni (34.3%) responded to the tracer survey. The majority were males (80%), aged 31–40 years (69%), and Ugandans (72%). Most graduated after 2018 (83%) as obstetricians/gynecologists (38%) and general surgeons (19%). There was uneven distribution of specialists across Uganda and the East-African community—with significant concentration in urban cities of Uganda at specialized hospitals and academic institutions. Residency training helped prepare and equip alumnus with competencies relevant to their current work tasks (48%) and other spheres of life (45%). All respondents were currently employed, with the majority engaged in clinical practice (82%) and had obtained their first employment within six months after graduation (76%). The qualitative interviews revealed the reported ease in finding jobs after the training and the relevance of the training in enhancing the alumnus’ ability to impact those they serve in teaching, research, management, and clinical care. Graduates cited low payment, limited resources, and slow career advancement concerns. Residency training improves the graduates’ professional/career growth and the quality of health care services. Strategic specialty training addressing imbalances in subspecialties and rural areas coverage could optimize access to specialist services.","author":"Leevan Tibaijuka","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"23b749138d4d1467372ef5a71eb100d13f391c742b052c4ae98d2ae7c55c7014","category":"Environment"}