{"title":"Green Supply Chain: The Path to Decarbonizing the Supply Chain","link":"https://www.preprints.org/manuscript/202406.0805/v1","date":1718177973000,"content":"The global movement of inputs, raw materials, products, and the marketing of products requires the use of supply chains. Green logistics refers to the set of policies and measures aimed at reducing the environmental impacts generated by logistics activities. The traditional supply chain has a certain inability to adapt to the rules agreed in Coop 15. The Green Supply Chain deals with the distribution flows of goods with a view to generating low environmental impact. The Green Supply Chain (GSC) involves aspects of reducing negative impacts throughout the logistics chain, from raw material suppliers, production to the distribution of the product to the customer. In this way, this article seeks to identify the factors that generate negative impacts in the traditional Supply Chain, thus helping to decarbonize it, and create a path for the development of the GSC and thus avoid interruptions in the distribution flow due to not meeting environmental targets. The main problem in decarbonizing the Supply Chain is its difficulty in complying with the rules agreed by the nations in COOP 15. To this end, a systematic literature review was carried out based on the available literature. Based on various articles and books, the parameters that define a Green Supply Chain and the factors that generate environmental impacts in conventional chains were identified. As a result, it was possible to verify a positive relationship between the carbon emission reduction factors that are linked to the supply chain performance factors found in the literature. Of the factors relating to the decarbonization of supply chains, some were more clearly related, such as reducing carbon emissions, reducing environmental risks and the ability to operate using new technologies. Future research could build on the limitations of this study.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"23badd7a918760c8f2b80e0ae7ae4ccbaa8707597bda0d73e650c4e6b24dec73","category":"Interdisciplinary"}