{"title":"BikeRadar’s High-Mileage Heroes | Shimano ME7 shoes","link":"https://www.bikeradar.com/features/shimano-me7-shoes/","date":1623783648000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Shimano-ME7-shoes-pair-e51c961.jpg?quality=45&amp;resize=620,413\" />                                            <p>Shoes are a very personal thing. Over time, I’ve come to realise that a good pair of comfortable shoes is a thing worth holding on to, at least until the day comes when they really aren’t serviceable anymore… and then it’s worth getting another identical set.</p>\n<p><a href=\"https://www.bikeradar.com/reviews/shoes/mountain-bike-shoes/shimano-me7-mtb-shoe-review/\">Shimano’s ME7 trail shoe</a> is that shoe for me. It’s a love affair that was blossoming even before the ME7 was a twinkle in the eye of Mr and Mrs Shimano.</p>\n<p>I can’t remember the name of my first pair of <a href=\"https://www.bikeradar.com/brand/shimano/\">Shimano</a> trail shoes, but trawling back through the annals of <a href=\"https://www.bikeradar.com/features/best-shoes-for-mountain-bikers/\">BikeRadar’s best mountain bike shoe reviews</a> reveals the lineage of this premium trail slipper, including numerous I’ve worn to destruction.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Here I am enjoying my ME7s on my Marin El Roy.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<h2>The forefront of design</h2>\n<p>I’ll admit shoes aren’t as flashy or exciting as electronic drivetrains or super-sensitive suspension, but I get excited by new pairs of kicks nevertheless.</p>\n<p>Shimano might not be known for being the most progressive of companies, but its products are almost always faultless and its dedication to refined performance comes from long product development cycles and, I’d argue, a little less risk-taking in regard to the specs of its components.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Ventilation keeps them cool, while the lace cover protects the speed lace system and shrugs off splashes.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>Lace covers, clicky buckles, hike-a-bike friendly soles and treads, and ankle gaiters are all features that were seen on Shimano’s shoes before many other brands followed suit.</p>\n<p>While I’m sure a successor to the ME7 won’t be too far away, at the moment I’d say they represent the pinnacle of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\">clipless</a> mountain bike shoe.</p>\n<p>But let’s start by digging through those reviews before I wax lyrical about the scrappy pair of shoes currently in my kit bag.</p>\n<section><div>\n        <h2>BikeRadar’s High-Mileage Heroes</h2>\n<p><a href=\"https://www.bikeradar.com/tags/high-mileage-heroes/\">High-Mileage Heroes</a> is a new series on BikeRadar showcasing the products that have stood the test of time and become part of our everyday riding.</p>\n<p>These aren’t reviews, but rather a chance to talk about the kit we depend on and the products we choose to use when we’re not reviewing fresh gear. </p>\n<p>\n\n    </p></div>\n    </section><h2>A history of shoes (in my kitbag)</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> I’d still rock these now!</span></figcaption><span></span></div>\n<p>Back when I started at BikeRadar in 2013, I was rocking a pair of white <a href=\"https://www.bikeradar.com/reviews/shoes/mountain-bike-shoes/updated-shimano-mp66-dx-mountain-bike-shoes-review/\">Shimano MP66 DX shoes</a>.</p>\n<p>Their white exterior was a little clumpy and all that material soaked up water like a sponge (probably because sponge made up a fair proportion of the shoe’s construction).</p>\n<p>The large lace cover kept all but the worst splashes at bay and the laces clean (vital on a mountain bike, in my opinion).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Shimano’s M200 shoes represented a step-change in trail shoes, in my opinion</span></figcaption><span></span></div>\n<p>Next up was a pair of <a href=\"https://www.bikeradar.com/reviews/shoes/mountain-bike-shoes/shimano-m200-shoes-review/\" target=\"_blank\">Shimano M200</a> shoes. These retained the lace cover but added a speed-lace system with a ratchet buckle.</p>\n<p>The shoes were slimmed down compared to the MP66, so they soaked up far less water, but retained the high inner-ankle to protect against scuffs.</p>\n<p>For me, what separated them was their lightweight and use of Shimano’s Torbal sole. This design is stiff front-to-back but allows some twist.</p>\n<p>As a fan of big days in big mountains, these shoes (along with the very similar and excellently named <a href=\"https://www.bikeradar.com/reviews/shoes/mountain-bike-shoes/scott-shr-alp-mtb-shoes-review/\" target=\"_blank\">Scott Shr-Alp</a>) were the bomb.</p>\n<p>I abused these shoes like no other – huge days in the Alps, wet and muddy sessions in the woods and everything in between. Eventually, the sole lugs started peeling off and they too were destined for the proverbial scrap heap in the sky.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A raised inner ankle and neoprene cuff meant the Terraduro’ were popular with BikeRadar’s testers, including me.</span></figcaption><span> <i>Russell Eich / Immediate Media</i></span></div>\n<p>Interestingly (if the history of my cycling shoes can be classed as interesting by anyone), it was a pair of Giro shoes that next took my fancy. Sorry, Shimano.</p>\n<p>The <a href=\"https://www.bikeradar.com/reviews/shoes/mountain-bike-shoes/giro-terraduro-mid-shoes-review/\" target=\"_blank\">Terraduro Mid</a> took many of the things I liked about the Shimano M200 but put them in a slightly burlier-looking package. However, it was the addition of the ankle gaiter that blew my mind.</p>\n<p>An ankle gaiter is a thin sleeve of neoprene that surrounds the ankle opening and hugs just around the ankle bone.</p>\n<p>Why is this good? It simply prevents the shoe from filling with trail detritus that inevitably works its way into your shoe on those dry, dusty rides. No more pine needles, stones or chunks of dried mud filling up my shoes. Incredible.</p>\n<p>And this brings me on to the ME7.</p>\n<h2>The Holy Grail</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> In my opinion, the best mountain bike shoes.</span></figcaption><span> <i> Immediate Media</i></span></div>\n<p>As soon as I saw the release of the Shimano ME7, I knew I had to get hold of a pair.</p>\n<p>The shoes took the M200’s closure system, the excellent fit and the Torbal sole with its long cleat channel (because your cleats should be slammed as far back as possible!) and added in an ankle gaiter similar to the Terraduro’s.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A Michelin sole? Wowzer. It’s pretty good too, as is the Torbal sole structure.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>The perfect shoe finally existed and really has matched my expectations.</p>\n<p>It’s comfy – everyone’s feet are different, but mine are definitely Shimano-shaped – and the speed-lace plus ratchet strap closure comfortably holds my feet in the shoe.</p>\n<p>The lace cover does a good job of stopping splashes, too, and the Michelin rubber sole with its well-spaced, grippy lugs combined with the Torbal sole to make them one of the best hike-a-bike shoes I’ve worn.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The gaiter is arguably the best bit of the shoe. It’s well-worn but still does its job.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>And the gaiter? It works as well I imagined.</p>\n<p>I’ve had a few pairs now, but my black versions are the ones I keep returning to (mostly because black is the best colour).</p>\n<p>My job means I do a lot of pedalling, a lot of scrambling and a lot of descending, so a pair of comfortable shoes that are able to do it all are very handy.</p>\n<p>My kit room at home includes a couple of dozen pairs of riding shoes, so it speaks volumes that despite being nearly worn out, the ME7 is still my go-to.</p>\n<p>The sole is stiff enough that on all-day rides I don’t feel like I’m burning energy unnecessarily, and if I’m using them with cageless pedals, I don’t get hot spots on the balls of my feet.</p>\n<p>While XC-focused race slippers display similarly stiff pedalling performance, the twist afforded by the Torbal sole, as well as a little extra toe flex, means that when I’m pushing a bike back up a muddy scramble to hit a line again for a photo, the tread digs in as predictably as possible.</p>\n<p>Back when international travel was still a thing, it was these shoes that took me out on some silly alpine adventures, with hours and hours of hike-a-bike to find snow-covered tracks that needed hiking down. There aren’t many clipless shoes in which I’d happily partake a day’s hiking in.</p>\n<blockquote><div> <a href=\"https://www.instagram.com/p/BzgRLkKH684/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/BzgRLkKH684/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Tom Marvin (@tommarvin1)</a></p></div></blockquote><p>When it comes to the UK’s inclement weather, while the lace cover doesn’t stop <em>all</em> the water coming in, it certainly keeps some of the worst at bay.</p>\n<p>Our annual Trail Bike of the Year test typically takes place from November to March, which is prime time for some grim conditions, and when the shoe does get covered in muck it’s a simple job to spray the dirt off.</p>\n<p>And because the lace is protected, it’s similarly easy to remove the shoe with numb hands – something other closures can’t always boast.</p>\n<blockquote><div> <a href=\"https://www.instagram.com/p/CKOwAuMh3lg/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CKOwAuMh3lg/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Tom Marvin (@tommarvin1)</a></p></div></blockquote><p>They’re getting tatty now – the neoprene is well-worn, the upper is scuffed and tired looking, the sole is worn, and the lace cover Velcro is losing its velcroyness.</p>\n<p>And, sadly, in a crash last year, the buckle clip got ripped off. But, while I can still manually feed the ratchet through the buckle, these shoes are still being put onto my feet day in, day out. Until the next evolution of the ME7 appears, of course.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The speed lace is backed up by the top strap giving a secure fit. The end of the speed lace sticks to the inside of the lace cover – something sadly missing on the AM9 shoe.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>","author":"Tom Marvin","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"23c8fa478a602c94e2827e264daba3923ae2fe67fec59991f21db8de30ffe77e","category":"Cycling"}