{"title":"HashiCorp Cloud Platform Adds Transit Gateway and Okta Support, New SKUs","link":"https://www.hashicorp.com/blog/hashicorp-cloud-platform-adds-transit-gateway-okta-new-skus","date":1623235800000,"content":"<p>Last year, we announced the <a href=\"https://www.hashicorp.com/blog/announcing-cloud-platform\">HashiCorp Cloud Platform</a> (HCP), a fully managed platform offering the HashiCorp products as a service to automate infrastructure on any cloud. We’re excited about our progress with the platform and with what practitioners are already doing with these new cloud services. In this blog, we will highlight some of the new features we’ve shipped recently and preview our future plans for HCP.</p>\n<h2><a href=\"#core-enhancements-to-hcp\">»</a><a></a>Core Enhancements to HCP</h2>\n<p><strong>Support for AWS Transit Gateway attachments.</strong> As you grow your HCP footprint, you’ll need more elegant ways to simplify networking at scale. That’s why we introduced support for transit gateway attachments in HCP.</p>\n<p>Transit gateways enable a “hub-and-spoke” configuration of your networks, a simpler and more secure option compared to the complexity of managing separate virtual private cloud (VPC) connections over time. Instead of establishing a VPC peering connection for every environment, you can create an “attachment” to a transit gateway. The transit gateway then manages these connections centrally. With a transit gateway, you can secure a single ingress/egress point, instead of monitoring multiple peering connections. To get started, <a href=\"https://learn.hashicorp.com/tutorials/cloud/amazon-transit-gateway\">read this tutorial</a> and <a href=\"https://www.hashicorp.com/events/webinars/connecting-hcp-consul-with-aws-transit-gateways\">watch this recent webinar</a>.</p><img src=\"https://www.datocms-assets.com/2885/1622853135-hcp-transit-gateways.png\" /><p><strong>Single sign-on with Okta.</strong> Identity management is foundational to any platform. With HCP, we want to enable frictionless access to resources while simultaneously respecting enterprise permissions and controls. You now have a new option for single sign-on for HCP: <a href=\"https://www.okta.com/\">Okta</a>.</p>\n<p>This option will appeal to organizations that require added security protections via SAML-based single sign-on. HCP also offers authentication via GitHub, and email/password (with optional multi-factor authentication).</p>\n<p>Ready to connect Okta to HCP? Check out the <a href=\"https://cloud.hashicorp.com/docs/hcp/sso\">step-by-step setup instructions</a>.</p>\n<p><strong>Terraform Provider for HCP adds new actions.</strong> The HashiCorp Cloud Platform has a <a href=\"https://registry.terraform.io/providers/hashicorp/hcp/latest\">Terraform Provider for HCP</a> that we update regularly to keep pace with the capabilities of the platform. Practitioners use the provider to manage their HVNs, connectivity to HCP, HashiCorp Consul deployments, and snapshots.</p>\n<p>Now, we’ve added the first HashiCorp Vault resources to this provider in concert with <a href=\"https://www.hashicorp.com/blog/vault-on-the-hashicorp-cloud-platform-ga\">the general availability of HCP Vault</a>. Authorized users can interact with the HCP Terraform Provider to:</p>\n<ul>\n<li><a href=\"https://registry.terraform.io/providers/hashicorp/hcp/latest/docs/resources/vault_cluster_admin_token\">Create an admin token for an HCP Vault cluster</a></li>\n<li><a href=\"https://registry.terraform.io/providers/hashicorp/hcp/latest/docs/resources/vault_cluster\">Create an HCP Vault cluster</a></li>\n<li><a href=\"https://registry.terraform.io/providers/hashicorp/hcp/latest/docs/data-sources/vault_cluster\">Retrieve information about an HCP Vault cluster</a></li>\n</ul><pre><code>resource \"hcp_hvn\" \"example\" {\n  hvn_id         = \"hvn\"\n  cloud_provider = \"aws\"\n  region         = \"us-west-2\"\n  cidr_block     = \"172.25.16.0/20\"\n}\n\nresource \"hcp_vault_cluster\" \"example\" {\n  cluster_id = \"vault-cluster\"\n  hvn_id     = hcp_hvn.example.hvn_id\n}</code></pre><p>Keep tabs on our progress with the Provider via <a href=\"https://github.com/hashicorp/terraform-provider-hcp/releases\">the project’s GitHub releases page</a>.</p>\n<h2><a href=\"#hcp-consul-prepares-new-configurations-more-federation-options\">»</a><a></a>HCP Consul Prepares New Configurations, More Federation Options</h2>\n<p>HCP Consul hit <a href=\"https://www.hashicorp.com/blog/announcing-hcp-consul-general-availability\">GA in February</a>. We offer a dev/test package and three sizes suitable for production deployments. All feature <a href=\"https://cloud.hashicorp.com/pricing/consul\">hourly pricing</a>. We’re excited about the reaction to HCP Consul so far, and we are investing in new configurations for additional cloud service networking scenarios.</p>\n<p><strong>Starter and Plus configurations.</strong> For entry-level production environments, we’re planning an HCP Consul Starter tier. This option will appeal to:</p>\n<ul>\n<li>Practitioners looking to support a production-ready environment, but still early in their adoption journey.</li>\n<li>Open source users looking to minimize the operational cost of managing Consul in their own environment.</li>\n</ul>\n<p>We can envision an organization deploying Consul Starter clusters initially, then gracefully growing into more powerful HCP Consul configurations over time. (If you want to know when the Consul Starter package launches, <a href=\"https://forms.gle/smWJp47CjZj2oyCy6\">sign up to be notified</a>.)</p>\n<p>At the other end of the spectrum, we’re also building an HCP Consul Plus tier. This package is designed for organizations with a more distributed service-networking footprint. The Plus tier will feature multi-cluster federation, which aids enterprises running services in different regions or looking to build out additional redundancy.</p>\n<p>Of course, resiliency and segmentation of clusters are also important within a single region, so we’re building intra-region federation as well. Look for these federation capabilities to hit HCP later in 2021.</p>\n<p><strong>Consul 1.10.</strong> You can expect HashiCorp services running atop HCP to keep pace with our open source releases. As such, we’ll upgrade HCP Consul to Consul 1.10 in the coming months. The Consul 1.10 flagship feature is the transparent proxy. Instead of requiring prescriptive steps to govern the flow of traffic between services, <a href=\"https://www.consul.io/docs/connect/transparent-proxy\">the transparent proxy</a> allows Consul to figure out the destination based on details embedded in the service itself. Developers will appreciate this feature’s ability to transparently intercept and redirect traffic from applications without any extra work. (Check out <a href=\"https://www.hashicorp.com/blog/announcing-consul-1-10-beta\">the Consul 1.10 beta blog post</a> to learn more.)</p>\n<h2><a href=\"#hcp-vault-readies-more-production-packages-cross-region-replication\">»</a><a></a>HCP Vault Readies More Production Packages, Cross-Region Replication</h2>\n<p>The second service we brought to HCP was Vault, which <a href=\"https://www.hashicorp.com/blog/vault-on-the-hashicorp-cloud-platform-ga\">launched in April</a>. As with HCP Consul, we launched with <a href=\"https://cloud.hashicorp.com/pricing/vault\">dev/test and standard production packages</a> to fit a range of scenarios.</p>\n<p>Even in its early days, HCP Vault demonstrates HashiCorp’s commitment to lifecycle management; we updated from Vault 1.6 in our beta period to Vault 1.7 for GA. Best of all, HashiCorp engineers did the upgrade work, so you didn’t have to.</p>\n<p><strong>Starter and Plus configurations.</strong> Vault is used by a wide range of organizations, and we want to add more sizing options so HCP Vault can serve even more companies. A Starter package — coming soon — will be ideal for folks bringing over new cloud security workloads running in production that need room to grow. After that, we’ll look to the higher end of the market with a Plus configuration catering to organizations that need cross-region replication for HCP Vault clusters. We’re also planning to add encryption-as-a-service and other features.</p>\n<h2><a href=\"#hcp-packer-aims-to-accelerate-image-management-workflows\">»</a><a></a>HCP Packer Aims to Accelerate Image Management Workflows</h2>\n<p>The next service coming to HCP is HashiCorp Packer. For many users, an automation gap exists between <em>image builds</em> with Packer and <em>image deployments</em> with Terraform. Practitioners often use custom scripts and spreadsheets to choose which image to deploy. These manual tasks can be slow and error-prone.</p><img src=\"https://www.datocms-assets.com/2885/1622852878-hcp-packer-registry.png\" /><p>The initial launch of HCP Packer will provide a cloud-hosted registry that streamlines this workflow, bridging the gap between Packer image builds and Terraform instance provisioning. The service will host the metadata associated with artifacts generated by Packer. From there, you’ll be able to expose the metadata for downstream consumption and deployment. To learn more, check out the <a href=\"https://www.hashicorp.com/blog/announcing-hcp-packer\">HCP Packer announcement blog post</a> and <a href=\"https://go.hashicorp.com/HCP-Packer-Beta.html\">sign-up to be a beta tester</a>.</p>\n<h2><a href=\"#try-hcp-and-get-a-50-in-credit\">»</a><a></a>Try HCP and Get a $50 in Credit</h2>\n<p>HCP provides you the convenience of consuming HashiCorp tools as a managed service. To help you get started, we’re offering a $50 credit when you create an HCP account and spin up your first cluster. <a href=\"https://cloud.hashicorp.com\">Sign up today</a>.</p>","author":"Jared Ruckle","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"23d7a558d4c171d1aeb1ea887f992ef2b34d5eb0b020f527e47aff73557c444f","category":"Tech"}