{"title":"Physicochemical and antioxidant properties of <i>Apis cerana</i> honey from Lombok and Bali Islands","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301213","date":1712325600000,"content":"<p>by Fahrul Huyop, Saeed Ullah, Roswanira Abdul Wahab, Nurul Huda, I. Gede Arya Sujana, Satrijo Saloko, Anak Agung Sagung Putri Risa Andriani, Nyoman Semadi Antara, Ida Bagus Wayan Gunam</p>\r\n\r\nLimited honey production worldwide leads to higher market prices, thus making it prone to adulteration. Therefore, regular physicochemical analysis is imperative for ensuring authenticity and safety. This study describes the physicochemical and antioxidant properties of <i>Apis cerana</i> honey sourced from the islands of Lombok and Bali, showing their unique regional traits. A comparative analysis was conducted on honey samples from Lombok and Bali as well as honey variety from Malaysia. Moisture content was found slightly above 20% in raw honey samples from Lombok and Bali, adhering to the national standard (SNI 8664:2018) of not exceeding 22%. Both honey types displayed pH values within the acceptable range (3.40–6.10), ensuring favorable conditions for long-term storage. However, Lombok honey exhibited higher free acidity (78.5±2.14 meq/kg) than Bali honey (76.0±1.14 meq/kg), surpassing Codex Alimentarius recommendations (≤50 meq/kg). The ash content, reflective of inorganic mineral composition, was notably lower in Lombok (0.21±0.02 g/100) and Bali honey (0.14±0.01 g/100) compared to Tualang honey (1.3±0.02 g/100). Electric conductivity, indicative of mineral content, revealed Lombok and Bali honey with lower but comparable values than Tualang honey. Hydroxymethylfurfural (HMF) concentrations in Lombok (14.4±0.11 mg/kg) and Bali (17.6±0.25 mg/kg) were slightly elevated compared to Tualang honey (6.4±0.11 mg/kg), suggesting potential processing-related changes. Sugar analysis revealed Lombok honey with the highest sucrose content (2.39±0.01g/100g) and Bali honey with the highest total sugar content (75.21±0.11 g/100g). Both honeys exhibited lower glucose than fructose content, aligning with Codex Alimentarius guidelines. The phenolic content, flavonoids, and antioxidant activity were significantly higher in Lombok and Bali honey compared to Tualang honey, suggesting potential health benefits. Further analysis by LC-MS/MS-QTOF targeted analysis identified various flavonoids/flavanols and polyphenolic/phenolic acid compounds in Lombok and Bali honey. The study marks the importance of characterizing the unique composition of honey from different regions, ensuring quality and authenticity in the honey industry.","author":"Fahrul Huyop","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"23db36754937717b7cf6ed67a159ad6db8bc28df9e5c7429eb250d22cacc2417","category":"Interdisciplinary"}