{"title":"The &ldquo;Other&rdquo; Workplace Design Factors: An Insight into What New Zealand Workers Want","link":"https://www.preprints.org/manuscript/202408.1611/v1","date":1724307963000,"content":"The recent COVID-19 pandemic has led to a reassessment of workplace necessities. It has resulted in the current shift from traditional workplace design to creating work experiences - a new par-adigm in workplace management. Hence, while some conventional workplace factors remain important to the experiences of workers and, thus, to their well-being, comfort and productivity, recent studies suggest other factors, not widely known, as important in creating the appropriate work experience. Our study explores these other factors in the workplace that contribute to, or may be very important to, workers’ comfort, well-being and productivity. These include working mode, facilities, sustainability practices and Diversity, Equity, and Inclusion (DEI) – cultural connection. A sample of 149 occupants across offices in New Zealand was conveniently collected for the study and analysed using descriptive and content analysis in SPSS vs 24. The results show that the occupants prefer to have private offices in the workplace and separate meeting rooms for better concentration on work. In terms of working mode, a combined model of remote working and in-office working is preferred. Furthermore, occupants prefer to have access control and fire safety systems essentially in the workplace and for their offices to be cleaned daily. For sustainable measures in the workplace, the respondents choose the following as practical and convenient: turning off computers outside work hours, using more LED light bulbs in the office, opening windows and doors when required and using a motion sensor lighting system. Interestingly, most of the respondents did not think having a cultural connection in their workplace was important. The study findings represent significant progress in identifying the needs of contemporary office workers. These findings assist facility managers and workplace designers in developing more proactive approaches to anticipated user issues in buildings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"23de7a94952d55a688dbad26658f3743be1269fef04abfa2d31cc68b0fdb052d","category":"Interdisciplinary"}