{"title":"Microtextural Characteristics of Ultramafic Rock-Forming Minerals and Their Effects on Carbon Sequestration","link":"https://www.preprints.org/manuscript/202405.0743/v1","date":1715579469000,"content":"Ultramafic rocks become promising candidates for carbon sequestration by enhanced carbon dioxide (CO2) mineralization strategies due to their highly CO2-reactive mineral composition and its abundant availability. This study reports a mineralogy and microtextures of a representative ultramafic rock from the Ma-Hin Creek in northern Thailand and observes evidence of CO2 mineralization occurring through the interaction between CO2 and the rock with the existence of water under ambient conditions. After sample collection, rock description was determined by optical petrographic analysis. The rock petrography reveals a cumulated wehrlite comprising over 50% olivine and minor amounts of clinopyroxene, plagioclase, and chromian spinel. Approximately 25% of the wehrlite has altered to serpentine and chlorite. A series of CO2 batch experiments were conducted on six different rock sizes at a temperature of 40°C and pressure of 1 atm over five consecutive days. The post-experimental products were dried, weighed, and geochemically analyzed to detect changes in mineral species. Experimental results showed that product weight and the presence of calcite increased with reducing grain size. Additionally, the modal mineralogy of the wehrlite theoretically suggests a potential CO2 uptake of up to 53%, which is higher than the average uptake values of mafic rocks. These findings support the suitable rock investigation approach and the preliminary assessment of carbon mineralization potential, contributing to enhanced rock weathering techniques for CO2 removal that could be adopted by mining and rock supplier industries.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"23e5ad23ee5b22fe93506fee3d090eac034fcad283e870b3288cb7f2b7be2ed3","category":"Interdisciplinary"}