{"title":"Updated PC Health Check app will actually tell you why you can’t run Windows 11","link":"https://arstechnica.com/?p=1797056","date":1632240032000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Screenshot-2021-09-21-114003-800x600.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Screenshot-2021-09-21-114003.png\">Enlarge</a> <span>/</span> It doesn't fix how strict the new Windows requirements are, but the new PC Health Check app can at least give you detailed information and more useful recommendations. (credit: Andrew Cunningham)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>When it announced Windows 11 and its <a href=\"https://arstechnica.com/gadgets/2021/08/why-windows-11-has-such-strict-hardware-requirements-according-to-microsoft/\">strict new hardware requirements</a>, Microsoft also released a PC Health Check tool that would analyze your hardware and tell you whether your computer could upgrade to Windows 11. The problem is that the app wouldn't tell you <em>why</em> your computer failed the test, leading some people with relatively new PCs to believe that they wouldn't be able to run the OS without hardware upgrades.</p>\n\n<p><a href=\"https://www.microsoft.com/en-us/software-download/windowsinsiderpreviewpchealth\">A new version of the PC Health Check app</a>, available to anyone who signs up for a Windows Insider account, fixes that problem. In our testing, it's still pretty bad at guessing the approximate age of the PC that it's running on, but it at least presents more detailed information when it's telling you that you won't be able to upgrade to a new OS.</p>\n<p>The new version of the Health Check app makes recommendations if your PC has easily fixable compatibility problems, like if there's a <a href=\"https://arstechnica.com/gadgets/2021/06/heres-what-youll-need-to-upgrade-to-windows-11/\">firmware TPM module that simply isn't enabled</a>, if Secure Boot is turned off, or if you need a RAM or disk space upgrade. But for more serious problems, like a processor that isn't on one of <a href=\"https://arstechnica.com/gadgets/2021/08/loosened-windows-11-requirements-cover-the-surface-studio-2-but-not-much-else/\">Microsoft's compatibility lists</a>, your only options are to upgrade to a supported processor (not always an option but possible for some AMD Ryzen desktops in particular), replace the computer, continue running Windows 10, or run <a href=\"https://arstechnica.com/gadgets/2021/08/youll-be-able-to-run-windows-11-on-older-pcs-if-you-install-the-update-manually/\">an \"unsupported\" Windows 11 install</a> that <a href=\"https://arstechnica.com/gadgets/2021/08/microsoft-may-withhold-security-updates-from-unsupported-windows-11-pcs/\">may or may not receive updates</a> going forward.</p></div><p><a href=\"https://arstechnica.com/?p=1797056#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1797056&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"23e8f6ec41c9d95a7ea1ffd79bb6cc53e935cbab856afa54b1b4ea09486ce0a9","category":"Tech"}