{"title":"Interfacial Origins of Electrical Breakdown Strength Enhancement in AlScN through Multilayer Structure","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.531/7719743?rss=1","date":1721779200000,"content":"<span>The origins of recently reported electrical breakdown strength enhancement in 45nm-AlScN multilayered films [<a href=\"#ozae044.531-B1\">1</a>] are investigated using scanning transmission electron microscopy (STEM). To fully understand and control the unique electrical properties of thin film materials, a technique that can provide information about their local in-plane and out-of-plane structural deformations is needed [<a href=\"#ozae044.531-B2\">2</a>]. The four-dimensional scanning transmission electron microscopy (4D-STEM) technique revealed that the lattice-mismatch strain is distributed and relaxed at interfaces of the multilayered film with sequential deposition of Al<sub>0.72</sub>Sc<sub>0.28</sub>N and Al<sub>0.64</sub>Sc<sub>0.36</sub>N. Here, the crucial roles of strain in ferroelectric multilayer AlScN systems are revealed. These findings are thus able to explain the observed electrical breakdown strength enhancement in AlScN multilayered films with increasing number of interfaces. It is demonstrated how this technique enables measurement of local pico-scale out-of-plane lattice distortions, and therefore provides a means to better understand the interplay between electronic properties and precise structural arrangements of multilayered materials. This work suggests that interfaces with intentionally designed lattice strain provide a new materials design strategy in AlScN for achieving an increase in the breakdown field to coercive field (EBD/Ec) ratios, as well as the characteristic breakdown field.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"2405e7e1c5255b7255d4f0a4abec393e9747fa42b0d937e90dd8e4d58d342c0a","category":"Environment"}