{"title":"Paris-Nice 2024: Will Primož Roglič make a winning start to his Bora-Hansgrohe career?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice-2024-primoz-roglic-returns-with-new-team-bora-hansgrohe","date":1709207666000,"content":"\n      <p>Few riders in the history of cycling have mastered the art of the week-long stage race quite as well as Primož Roglič has. Since winning the Tour of the Basque Country in the spring of 2018, he has gone on an extraordinary run of winning 10 out of 13 in WorldTour-ranked stage races of this kind. Aside from one occasion when injuries forced him to abandon (the 2020 Critérium du Dauphiné), and a couple of other times when either crashes (Paris-Nice 2021) or fatigue (2022 Tour of the Basque Country) saw him lose the overall lead, he’s come out on top in every GC battle he’s taken part in. It's a record even more remarkable when you consider that he’s had to overcome riders of the calibre of Egan Bernal, Tadej Pogačar and Remco Evenepoel to do so. His Grand Tour record might not be quite so good (he’s won four out of 11 in the same time span), but when it comes to week-long races, he’s the master.</p>\n<div></div>\n<div></div>\n<p>Naturally, therefore, he’s the top favourite to win <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice\">Paris-Nice</a> when he makes his season bow for 2024 in that race this Sunday. However, this race will be different from every other he’s done in the past in one significant respect — for the first time since 2015, he will compete for a team other than Visma-Lease a Bike.</p>\n<p>Paris-Nice will mark Roglič’s much-anticipated debut for Bora-Hansgrohe, the team that won the hotly-contested battle to sign him after he announced his intentions to leave Visma-Lease a Bike. It was a major coup for Bora, a team that, though usually competitive in stage races, have lacked top-tier stars to really put themselves in the peloton’s elite, winning just the four WorldTour stage race titles in their history, and only one Grand Tour. But for Roglič it feels like more of a risk. All of his success in the past has come while being backed by the mighty resources commanded by Visma-Lease a Bike, a team that, during his time there, grew to be the very best in the world. Will he still be able to dominate the same way without them?</p>\n<p>Roglič’s move was motivated by his desire to return to the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> as a GC leader, something no longer possible at Visma-Lease a Bike since the emergence of Jonas Vingegaard, and Paris-Nice is set to be a trial-run for how well Bora-Hansgrohe can protect him for that race. The race is in many ways a mini-Tour de France, taking place in the same country and featuring a similar balance of climbing and time trialling. It’s also proven to be a good predictor of what will happen in July, too, with the victor here occasionally going on to also win the Tour.</p>\n<p>Perhaps with this in mind, many of the riders who have been outlined (though not yet officially confirmed) as probable candidates for a spot in Bora’s Tour line-up in support of Roglič will be present at Paris-Nice. In the climbing department, both Alexsandr Vlasov and Bob Jungels will be tasked with protecting Roglič in the mountains, the former having already been earmarked for a role a the Tour by team manager Rolf Aldag, and the latter expressing his desire to ride it this year. Whereas Jungels rode in a support role throughout the 2023 season, Vlasov isn’t so used to riding in support of another; he was signed in 2022 to be the team’s main GC leader, and led them to top 10 finishes at both the 2022 Tour de France and 2023. <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>. Taking on a super-domestique role will therefore be a demotion, and Paris-Nice a first test of his willingness to sacrifice his own chances.</p>\n<p><img alt=\"Primoz Roglic Paris-Nice\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/cy21-pn-js-07-0037_1024x1024.jpg?v=1709207391\" /></p>\n<p>Winning stage races requires protection not just in the mountains, but in all types of terrain, so the pressure will also be on the rest of Bora’s Paris-Nice line-up. In the engine room, they will have Matteo Sobrero, Nico Denz, Danny van Poppel and Marco Haller, four riders for whom this race will also be something of an audition for the Tour de France. None of these riders are at the level of Wout van Aert, who did such sterling work for Roglič while at Visma-Lease a Bike, but they’re talented and will be vying to impress enough to seal selection. Like Vlasov, Sobrero was singled out as a likely starter for the Tour by Aldag back in January, and has both a great engine and strong climbing legs to be exactly the kind of all-rounder domestique that are so invaluable in teams chasing GC at Grand Tours. And Denz too was said to be in contention having done so well at the Giro last year, where he won two stages. Van Poppel and Haller are veterans of both the last two Tours de France, but may need to up their game if they’re to keep their place given the increased competition.</p>\n<p>Even if Bora-Hansgrohe do look a little short in Paris-Nice, they can take comfort in the fact that some top riders will be absent, and could come into the team for the Tour. Jai Hindley, most notably, is going to ride Tirreno-Adriatico rather than Paris-Nice, but is set to have a crucial role at the Tour as the only rider aside from Roglič in the squad who has won a Grand Tour. That was the 2022 Giro d’Italia, and one of the riders who played a key role in helping him to do so, Lennard Kämna, will also be riding Tirreno-Adriatico next week. Kämna’s participation at the Tour will be dependent on how well he recovers from the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, which he is down to ride; as is Dani Martínez’s, another riding Tirreno, and who has already made an eye-catching start to the season with two uphill finish stage wins at Volta ao Algarve, both at the expense of Remco Evenepoel, no less.</p>\n<p>Even without these star climbers, expectations of Bora-Hansgrohe will certainly be high at Paris-Nice. Roglič has an excellent record in early season races, and is the kind of rider who can begin the season already in form without having to gradually build his way up it. His old teammate Jonas Vingegaard is riding Tirreno-Adriatico instead, while Tadej Pogačar is focussing on the Classics, leaving Remco Evenepoel as his likely main rival — a rider he got the better of in all three of their stage race meets last year. There’s a real opportunity here for both him and Bora-Hansgrohe to make a real statement and win Paris-Nice, with a performance that could put them right in the conversation of challenging Visma-Lease a Bike and UAE Team Emirates for the yellow jersey in July. <br /><br /></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2407481dfd46f9beeccd5a25007b5e6e8d07b17daba8b2ce2f8d4f53e4759375","category":"Cycling"}