{"title":"Diagnosis, Treatment and Long-Term Management of Vitamin B12 Deficiency in Adults: A Delphi Expert Consensus","link":"https://www.preprints.org/manuscript/202403.1075/v3","date":1711517957000,"content":"Background/Objectives: Vitamin B12 deficiency can cause variable symptoms, which may be irreversible if not diagnosed and treated in a timely manner. We aimed to develop a widely accepted expert consensus to guide the practice of diagnosing and treating B12 deficiency. Methods: We conducted a scoping review of the literature published in PubMed since January 2003. Data were used to design a two-round Delphi survey to study the level of consensus among 42 experts. Results: The panelists agreed on the need for educational and organizational changes in the current medical practices for diagnosing and treating B12 deficiency. Recognition of clinical symptoms should receive the highest priority in establishing the diagnosis. There is agreement that the serum B12 concentration is useful as a screening marker, whereas methylmalonic acid or homocysteine can support the diagnosis. Patient lifestyle, disease history and medications can provide clues to the cause of B12 deficiency. Regardless of the cause of the deficiency, initial treatment with parenteral B12 was regarded as the first choice for patients with acute and severe manifestations of B12 deficiency. The use of high-dose oral B12 at different frequencies may be considered for long-term treatment. Prophylactic B12 supplementation should be considered for specific high-risk groups. Conclusions: There is a consensus that clinical symptoms need to receive more attention and weight in establishing a diagnosis. B12 laboratory markers can support the diagnosis. The severity of clinical symptoms, the causes of B12 deficiency and the treatment goals govern decisions regarding the route and dose of B12 therapy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"240ae028a9da7579c49f78d53c83a041a207d4d5bfaba44654328298480a90b8","category":"Interdisciplinary"}