{"title":"Neuronal cell cycle reentry events in the aging brain are more prevalent in neurodegeneration and lead to cellular senescence","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002559","date":1713880800000,"content":"<p>by Deng Wu, Jacquelyne Ka-Li Sun, Kim Hei-Man Chow</p>\r\n\r\nIncreasing evidence indicates that terminally differentiated neurons in the brain may recommit to a cell cycle-like process during neuronal aging and under disease conditions. Because of the rare existence and random localization of these cells in the brain, their molecular profiles and disease-specific heterogeneities remain unclear. Through a bioinformatics approach that allows integrated analyses of multiple single-nucleus transcriptome datasets from human brain samples, these rare cell populations were identified and selected for further characterization. Our analyses indicated that these cell cycle-related events occur predominantly in excitatory neurons and that cellular senescence is likely their immediate terminal fate. Quantitatively, the number of cell cycle re-engaging and senescent neurons decreased during the normal brain aging process, but in the context of late-onset Alzheimer’s disease (AD), these cells accumulate instead. Transcriptomic profiling of these cells suggested that disease-specific differences were predominantly tied to the early stage of the senescence process, revealing that these cells presented more proinflammatory, metabolically deregulated, and pathology-associated signatures in disease-affected brains. Similarly, these general features of cell cycle re-engaging neurons were also observed in a subpopulation of dopaminergic neurons identified in the Parkinson’s disease (PD)-Lewy body dementia (LBD) model. An extended analysis conducted in a mouse model of brain aging further validated the ability of this bioinformatics approach to determine the robust relationship between the cell cycle and senescence processes in neurons in this cross-species setting.","author":"Deng Wu","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"241ca1db32da23a3822cd1cbbea46fc9110fe3105403707626391d9f9d9aae47","category":"Environment"}