{"title":"บริษัทแคนาดาเตรียมส่งดาวเทียมจิ๋วพร้อมป้ายโฆษณา เช่าป้ายได้ผ่านคริปโต อาจรับ Dogecoin","link":"https://www.blognone.com/node/124132","date":1628498816000,"content":"<div><div><div><p>Geometric Energy Corporation (GEC) บริษัทวิจัยและพัฒนาสัญชาติแคนาดา เปิดเผยรายละเอียดเพิ่มเติมของดาวเทียม CubeSat หลังจ่ายเงินเช่าพื้นที่ Falcon 9 ในภารกิจ Doge-1 ของ SpaceX <a href=\"https://brandinside.asia/elon-musk-doge-1-dogecoin-payment/\">เป็นเหรียญ Dogecoin</a> ล้วนๆ โดย CubeSat จะมีด้านหนึ่งเป็นจอภาพ พร้อมกล้องถ่ายหน้าจอสไตล์ไม้เซลฟี่ที่จะถ่ายทอดสดหน้าจอลง Youtube และ Twitch ด้วย</p>\n<p>Doge-1 เป็นภารกิจส่งจรวด Falcon 9 ของ SpaceX ไปยังดวงจันทร์ ซึ่ง GEC เช่าพื้นที่สำหรับดาวเทียมน้ำหนัก 40 กิโลกรัมนี้ไว้ ก่อนหน้านี้ระบุว่าจะเป็นดาวเทียมเก็บข้อมูลอวกาศและดวงจันทร์ แต่ข้อมูลตอนนี้ระบุว่าดาวเทียมจะมีจอโฆษณาอยู่ด้วย โดย Doge-1 จะปล่อยดาวเทียมนี้โคจรในวงโคจรรอบโลก ก่อนจรวดจะบินต่อไปยังดวงจันทร์ต่อไป</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/4308d7ceaced5de1c15a0e7da1ac28d2.jpg\" /></p>\n<p>ผู้ที่ต้องการแสดงภาพบนหน้าจอ จะต้องซื้อโทเค่นด้วยเงินคริปโตเพื่อเช่าพิกเซล โดยจะมีโทเค่นที่ต้องซื้อ 5 ชนิด คือ Beta ระบุตำแหน่งพิกเซลในแกนนอน (X), Rhoe ระบุตำแหน่งพิกเซลแกนตั้ง (Y), Gamma ระบุความสว่าง Kappa ระบุสี และ XI ระบุระยะเวลาที่จะแสดงภาพ เงินคริปโตที่ใช้ซื้ออาจเป็นสกุลหลักเช่น BTC หรือ ETH ก่อน แต่ GEC มีเป้าหมายจะพัฒนาให้รองรับ Dogecoin ในอนาคต แต่ยังไม่เปิดเผยราคาค่าแสดงข้อความบนดาวเทียม</p>\n<p>Samuel Reid ระบุว่าเขาต้องการที่จะ “ทำให้การเข้าถึงอวกาศเป็นประชาธิปไตยมากขึ้น และมีส่วนร่วมแบบไร้ตัวกลางได้” เขายังหวังว่า “ผู้คนจะไม่เสียเงินไปกับการแสดงอะไรที่ไม่เหมาะสม ไม่สุภาพ หรือคุกคามผู้อื่น” บนป้ายโฆษณานี้</p>\n<p>ว่ากันตรงๆ แทบจะเป็นไปไม่ได้ที่จะห้ามอะไรแบบนี้ หากมีการอนุญาตให้เช่าหน้าจอได้ผ่านอินเทอร์เน็ตโดยใช้เงินคริปโตที่ติดตามตัวยาก และไม่มีการตรวจสอบก่อนแสดงภาพ ไม่นานก็คงมีภาพมีม หรือภาพไม่เหมาะสมอยู่บนจอแน่ๆ แต่คงต้องรอดูช่วงต้นปีหน้าว่าจะป่วนแค่ไหน</p>\n<p>ที่มา - <a href=\"https://www.businessinsider.com/spacex-start-up-launch-satellite-space-advertising-cryptocurrency-2021-7\">Business Insider</a>, <a href=\"https://www.spaceflightinsider.com/missions/commercial/doge-1-cubesat-to-fly-to-the-moon-atop-a-falcon-9-rocket/\">Space Insider</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/satellite\">Satellite</a></div><div><a href=\"/topics/spacex\">SpaceX</a></div><div><a href=\"/topics/space\">Space</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"2427cb8c40eadcaddc2d271221a21bc215851be7914be009a926a1ee6763a100","category":"Thai"}