{"title":"Quantification of Soil Water Erosion Using the RUSLE Method in the M&eacute;krou Watershed (Middle Niger River)","link":"https://www.preprints.org/manuscript/202409.1994/v1","date":1727257648000,"content":"Despite nearly a century of research on water related issues, water erosion remains one of the greatest threats to soil health and soil ecosystem services around the world. Yet to date, data on water erosion needed to develop mitigation strategies is scarce, especially in the Sahelian regions. The current study therefore sets out to estimate annual soil losses caused by water erosion and to analyze trends over the period of 1981-2020 in the Mékrou watershed, located in the Middle Niger river sub-basin in West Africa. The revised universal soil loss equation, remote sensing and the Geographic Information System (GIS) were deployed in this study. Several types of data were used, including rainfall, soil conditions, topography and satellite images. The estimated average annual amount of water erosion in the Mékrou watershed is 6.49 t/ha/yr over 1981-2020. The dynamics of the ten-year average are highly variable, with a minimum of 3.45 t/ha/yr between 1981 and 1990, and a maximum of 8.50 t/ha/yr between 1991 and 2000. Even though these average soil losses in the Mékrou basin are below the tolerable threshold of 10 t/ha/yr, mitigation actions are needed for prevention. In addition, the spatial dynamics of water erosion are noticeably heterogeneous. The study reveals that 72.7% of the surface area of the Mékrou watershed is subject to slight water erosion below the threshold, compared with 27.3%, particularly in the mountainous south-western part, which is subject to intense erosion above the threshold.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"242be65ade9ca3066f289d63edf80b165c0e10e7fc3a8c43f59a08e4f65e0035","category":"Interdisciplinary"}