{"title":"Synthetically derived BiAux modulates auxin co-receptor activity to stimulate lateral root formation","link":"https://academic.oup.com/plphys/article/195/2/1694/7611682?rss=1","date":1708387200000,"content":"<span><div>Abstract</div>The root system plays an essential role in plant growth and adaptation to the surrounding environment. The root clock periodically specifies lateral root prebranch sites (PBS), where a group of pericycle founder cells (FC) is primed to become lateral root founder cells and eventually give rise to lateral root primordia or lateral roots (LRs). This clock-driven organ formation process is tightly controlled by modulation of auxin content and signaling. Auxin perception entails the physical interaction of TRANSPORT INHIBITOR RESPONSE 1 (TIR1) or AUXIN SIGNALING F-BOX (AFBs) proteins with AUXIN/INDOLE-3-ACETIC ACID (Aux/IAA) repressors to form a co-receptor system. Despite the apparent simplicity, the understanding of how specific auxin co-receptors are assembled remains unclear. We identified the compound bis-methyl auxin conjugated with <span>N</span>-glucoside, or BiAux, in Arabidopsis (<span>Arabidopsis thaliana</span>) that specifically induces the formation of PBS and the emergence of LR, with a slight effect on root elongation. Docking analyses indicated that BiAux binds to F-box proteins, and we showed that BiAux function depends on TIR1 and AFB2 F-box proteins and AUXIN RESPONSE FACTOR 7 activity, which is involved in FC specification and LR formation. Finally, using a yeast (<span>Saccharomyces cerevisiae</span>) heterologous expression system, we showed that BiAux favors the assemblage of specific co-receptors subunits involved in LR formation and enhances AUXIN/INDOLE-3-ACETIC ACID 28 protein degradation. These results indicate that BiAux acts as an allosteric modulator of specific auxin co-receptors. Therefore, BiAux exerts a fine-tune regulation of auxin signaling aimed to the specific formation of LR among the many development processes regulated by auxin.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"242d25503942993acdf5f2700f138e336c3bddbe4924b6d1ec9b493324e7ccd6","category":"Environment"}