{"title":"A Holistic Approach to Define Important Digital Skills for the Digital Society","link":"https://www.preprints.org/manuscript/202404.0076/v2","date":1721382143000,"content":"Nowadays, transactions carried out with digital currencies are increasing. Modern societies are asked to respond to growing challenges related to the management of digital currencies in their daily lives. However, due to the lack of digital skills of users, the management of digital currencies hides risks. To the best of our knowledge, the originality of the current research lies in the act of combining the concept of digital skills with the use of digital currencies. After all, the use of digital currencies is constantly increasing, which means that citizens should familiarize themselves with their use, an element that makes this study valuable for digital societies. Digital skills effectively contribute to the development of digital societies because they increase the employment of citizens, facilitate access to information, and contribute to the social inclusion of individuals through digital communication, while also increasing efficiency and productivity in the workplace. Also, the government and banking institutions can more effectively sensitize citizens to digital skills for more effective use of digital currencies. In this way, tax payments will be facilitated, the use of e-wallets will be safer, and e-governance will be greatly promoted, while the quality of banking services will be improved. The methodology of this study was based on the Digital Competence Framework for Modern Societies (DigComp) and was applied through a questionnaire completed by 443 respondents. The main objective was to evaluate their digital skills from the perspective of digital currency use. The analysis of the responses was carried out by using Structural Equation Modeling (SEM). The most important result from this research reveals that users of digital currencies are significantly capable of developing communication to solve everyday problems. At the same time, users of digital currencies mostly detect digital threats and effectively manage fake news without being affected by them. However, users of digital currencies consider that security issues are important, but only for transactions and not for their supporting functions. The study concludes with suggestions for improving the experience of digital currency users through individual actions, thus having a positive impact on the state and banking institutions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2443e9900dd4407af06b62f234f9b74dfbcc31c8146673fe800c7ce8ff9748d1","category":"Interdisciplinary"}