{"title":"Hands-On With the $1,700 'OnePlus Open' Foldable Smartphone","link":"https://www.macrumors.com/2023/10/20/oneplus-open-hands-on/","date":1697834134000,"content":"Chinese smartphone company OnePlus this week introduced its first foldable smartphone, the OnePlus Open. OnePlus joins several other manufacturers that have come out with foldable smartphones, including Samsung, Google, and Xiaomi. We picked up the OnePlus Open to see how it compares to Apple's latest flagship, the <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> Max.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThe OnePlus Open is similar to the Galaxy Fold in that it opens up like a book. When folded, the cover screen has a 6.31-inch display that's about in the middle of the ‌iPhone 15 Pro‌ and Pro Max in terms of size. Unfolded, the display measures in at 7.82 inches, so a bit smaller than the <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a>. The displays are OLED and support a 120Hz refresh rate, with OnePlus advertising a \"Ceramic Guard\" cover glass, which sounds almost identical to the Ceramic Shield that Apple uses.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/oneplus-open.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nWhen it comes to form factor, the OnePlus Open is nothing like the ‌iPhone 15 Pro‌ Max from Apple since Apple hasn't delved into foldable smartphones as of yet, but there are similar components inside. The OnePlus Open has a premium feel, and size wise, it's between the Z Fold5 and the Pixel Fold. It is able to fold down flat with a crease that's almost unnoticeable, plus it's thin and lightweight.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/oneplus-open-2.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThe Open is 11.7mm thick when it's folded in half, but when you open it up, it's 5.8mm. For comparison, the ‌iPhone 15 Pro‌ Max is 8.25mm thick. As for weight, it is 239 grams, or 18 grams heavier than the 15 Pro Max.\r<br />\n\r<br />\nOnePlus has a partnership with camera company Hasselblad, and it is using a 48-megapixel wide-angle camera, a 64-megapixel telephoto camera with 6x in-sensor lossless zoom, and a 48-megapixel ultra wide-angle camera. There's also a 20-megapixel front-facing selfie camera accessible when the OnePlus Open is unfolded, and a 32-megapixel selfie camera that can be used when it's closed.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/oneplus-open-3.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nDesign wise, the lenses are in a large circular housing at the back of the device, which OnePlus likens to a the face of a luxury watch. The lens housing is super massive, and it can be hard to get photos from some of the lenses without your fingers getting in the way.\r<br />\n\r<br />\nOther features include the Snapdragon 8 Gen 2 mobile platform, 16GB RAM, a fingerprint sensor power button, a 4,805mAh battery, and support for Wi-Fi 7.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/oneplus-open-4.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThe OnePlus Open is <a href=\"https://www.oneplus.com/us/open\">available for pre-order</a> as of now, and it is set to launch on October 26. It is priced starting at $1,700.\r<br />\n\r<br />\nWhat do you think of the OnePlus Open? Let us know in the comments below.<div>Tag: <a href=\"https://www.macrumors.com/guide/oneplus/\">OnePlus</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/20/oneplus-open-hands-on/\">Hands-On With the $1,700 'OnePlus Open' Foldable Smartphone</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/hands-on-with-the-1-700-oneplus-open-foldable-smartphone.2408215/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"244750954671643a187040d3c79d47fefa5954831c1c55e309f4d5946e86f013","category":"Apple"}