{"title":"Wealth and privilege allowed Elizabeth Holmes to start Theranos","link":"https://arstechnica.com/?p=1814865","date":1637604200000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-1353829953-800x543.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-1353829953.jpg\">Enlarge</a> <span>/</span> Theranos founder and former CEO Elizabeth Holmes, left, walks with her mother, Noel Holmes, as they arrive for Elizabeth Holmes' trial at the Robert F. Peckham Federal Building on November 17, 2021, in San Jose, California. Holmes is facing charges of conspiracy and wire fraud for allegedly engaging in a multimillion-dollar scheme to defraud investors. (credit: Justin Sullivan/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>For months, legal observers have been speculating whether Elizabeth Holmes would take the stand in her own criminal trial. Friday afternoon, Holmes put those questions to rest and was sworn in.</p>\n<p>In her testimony, it was abundantly clear that, without her family’s wealth and status, Theranos would have been little more than a college student’s flight of fancy.</p>\n<p>Holmes traced the beginnings of Theranos for the jury. As a college freshman at Stanford studying engineering, she had wanted to miniaturize the blood testing process—initially, her dream was to cram everything into a pill or patch, she told the court. Patients would either swallow the pill or slap on the patch, <i>et voilà</i>, get results beamed to a separate device. Sounds exactly like the sort of thing a college first-year would dream up.</p></div><p><a href=\"https://arstechnica.com/?p=1814865#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1814865&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"244a8679685ac2357c7b47aca9135651486bd158be5a86c61a5cfe2d4a37bb5d","category":"Tech"}