{"title":"กลุ่มนักพากย์เสียงรวมตัวกันคุยถึงข้อกำหนดการใช้งาน AI ในวงการพากย์เสียง","link":"https://www.blognone.com/node/134971","date":1690192251000,"content":"<div><div><div><p>Variety รายงานว่ากลุ่มนักพากย์เสียงที่งาน San Diego Comic-Con ร่วมกันพูดคุยถึงประเด็น AI กำลังส่งผลกระทบต่ออาชีพนักพากย์เสียงและข้อกำหนดสัญญาที่ควรจะมีเมื่อใช้ AI ทำงานร่วมกับนักพากย์เสียง</p>\n<p>ในกลุ่มนักพากย์เสียงที่เข้ามาร่วมพูดคุยได้แก่ Duncan Crabtree-Ireland ผู้อำนวยการสมาคมนักแสดงแห่งสหรัฐอเมริกา SAG-AFTRA, Linsay Rousseau นักพากย์ให้กับ God of War: Ragnarok, Ashly Burch นักพากย์ให้กับ Mythic Quest, Cissy Jones นักพากย์ให้กับ The Owl House, Zeke Alton นักพากย์ให้กับ Call of Duty และ Tim Friedlander ประธานและผู้ก่อตั้งสมาคมสนับสนุนอุตสาหกรรมนักพากย์เสียงไม่แสวงหากำไร National Association of Voice Actors (NAVA)</p>\n<p>ในประเด็นที่คุย มีการหารือกันถึงความกังวลในการใช้ AI สร้างเสียงแทนนักพากย์ในบทที่นักพากย์ไม่เห็นด้วยและไม่ยินยอมอ่าน นักพากย์ได้เสนอทางเลือกให้ใส่ข้อกำหนดที่เน้นความสามารถของศิลปินเป็นอันดับแรกและต้องการให้บริษัทยืนยันว่าการใช้ AI จะต้องเป็นการทำงานร่วมกับนักพากย์ รวมไปถึงค่าตอบแทนที่เหมาะสมด้วย</p>\n<p>Crabtree-Ireland ยังกล่าวเพิ่มเติมว่า นอกจากอุตสาหกรรมบันเทิงแล้ว AI ยังนำไปสู่ภัยคุกคามที่จะเกิดขึ้นในอนาคต เพราะเทคโนโลยีตอนนี้สามารถเลียนแบบเสียงและใบหน้าของเราได้ ยังกล่าวเสริมว่าไม่ต้องการให้นักพากย์เสียงรุ่นใหม่ พลาดโอกาสจากอาชีพนี้ นอกจากนี้ยังมีการพูดข้อกังวลถึงเรื่องการควบคุมภาษา ที่ยังไม่ได้รับการควบคุมที่เหมาะสม Friedlander กล่าวว่า “งานแรกของคุณได้ อาจจะเป็นงานสุดท้ายของคุณ”<br />\n<img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/fe561d0a48c294b2b2bc977b3969118b.jpg\" /></p>\n<p>ที่มา: <a href=\"https://gizmodo.com/sdcc-2023-voice-actors-ai-sag-strike-1850668591\">Gizmodo</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"244c7ce8bb596257bdf7da7e1558ef4691d7bda5ebd7329aaca292817c250d24","category":"Thai"}