{"title":"Recruitment and phoresy of the endangered limpet Patella ferruginea in Ceuta (Strait of Gibraltar)","link":"https://academic.oup.com/mollus/article/doi/10.1093/mollus/eyae018/7693222?rss=1","date":1718323200000,"content":"<span><div>ABSTRACT</div><span>Patella ferruginea</span>, an endemic marine mollusc of the western Mediterranean, faces a severe threat due to historical overexploitation, habitat loss and habitat vulnerability. This specie forms reproductive populations on sheltered dikes within Alboran Sea ports, presenting a persistent management challenge. Investigating both recruitment rates and preferences in artificial habitats, as well as early life stages, is crucial for its conservation. Three experiments, focusing on recruits under 25 mm, were conducted, with two exclusively in Ceuta's port in the Strait of Gibraltar. The first study explored intra-annual recruitment variations across three sites with different elevations (up, down) and inclinations (horizontal, vertical), utilizing fixed quadrats. Quadrats (20 × 20 cm) were surveyed for recruitment in March, April, May, July, October and December 2017. The second experiment, with similar factors, spanned 2017–2019, studying recruitment variations in March, May and July. The third examined the phoresy phenomenon—recruitment over conspecific shells—by comparing Ceuta and Melilla populations. Results revealed higher recruitment rates and smaller recruits in the lower midlittoral zone, followed by postrecruitment migration upwards. No discernible differences emerged regarding the slope or location for phoresy. This study highlights the potential of <span>P. ferruginea</span> recruitment data as an indicator of harbour health, acknowledging the influence of external factors on recruitment success. Long-term monitoring of recruitment patterns, alongside other ecological indicators, is crucial for informing sustainable management of <span>P. ferruginea</span> in port environments.</span>","author":"","siteTitle":"Journal of Molluscan Studies Current Issue","siteHash":"50e5bd74f9c9bc6ffdefd16d0eef1528d858cc544080b551025ae62157896b1d","entryHash":"244d6429892e07927d9dbf54fcf009c4a616490ded5b228d04656359287547a5","category":"Environment"}