{"title":"How an iPhone 14 ‘literally’ saved a family trapped in the Hawaii wildfires","link":"https://www.macworld.com/article/2027967/iphone-14-emergency-sos-via-satellite-hawaii-maui-wildfires.html","date":1691749800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>You might think that features such as Crash Detection and Emergency SOS are gimmicks that iPhone users won’t ever actually need, but a report out of Maui might make you think twice. According to a post on X (formerly Twitter), five people trapped in their car in Maui were able to use Emergency SOS via satellite to call emergency services.</p>\n\n\n\n<p>X user Michael J. Miraflor reports that his brother’s girlfriend’s cousin and his family were caught in their vehicle in Maui while the wildfires suddenly erupted around them. Due to the conditions, they couldn’t connect to their wireless network so “Apple Emergency SOS was the only way they could get in contact with first responders,” according to Miraflor.</p>\n\n\n\n<figure><div>\n<blockquote><p>My brother’s girlfriend’s cousin and his family were caught in their vehicle in Maui while the wildfires suddenly erupted around them. <br /><br />No cell service, so Apple Emergency SOS was the only way they could get in contact with first responders. Literally saved their lives. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/PpxNwTGOAf&amp;xcust=1-1-2027967-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/PpxNwTGOAf</a></p>— Michael J. Miraflor (@michaelmiraflor) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/michaelmiraflor/status/1689452794443632640?ref_src=twsrc%5Etfw&amp;xcust=1-1-2027967-1-0-0&amp;sref=https://www.macworld.com/feed\">August 10, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>He said the feature “literally saved their lives.” The family was rescued at a bank in a strip mall, though it’s not clear if they were already trying to evacuate the area.</p>\n\n\n\n<p>Miraflor posted a screenshot of the exchange between the family member and first responders, and it appears it took about 35 minutes from the time they used the feature to make contact with emergency responders to the time they were rescued. The dispatcher was able to get their location from the iPhone, instruct them to put on their hazard lights, and relay information to the fire department.</p>\n\n\n\n<p>The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.nytimes.com/live/2023/08/10/us/wildfires-maui-hawaii&amp;xcust=1-1-2027967-1-0-0&amp;sref=https://www.macworld.com/feed\">wildfires in Maui</a> have caused more than 50 deaths and “billions” in damage to Lahaina and the surrounding area.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"244eb28025d9a0a15f054fa466dc63ca7d13d7d209d7ff783a75a8e66b78a1d1","category":"Apple"}