{"title":"Women’s Olympic Road Race 2021: Route, Predictions and Contenders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/women-s-olympic-road-race-2021-will-we-see-dutch-dominance","date":1626780276000,"content":"\n      <p>A year later than planned, and after much uncertainty on whether the event will go ahead, the Tokyo Olympics finally looks like it may become a reality. Participating nations have been announcing their selected athletes and, with the level of racing in the female peloton at an all time high, the Women’s Road Race on Sunday 25th July will be a highlight of the Games.</p>\n<p>We can be sure that it will differ from any race so far this season. With a peloton of 67 riders, it will be a dramatic change from the competitive fields of over 100 athletes we’re accustomed to seeing in Women’s World Tour events. 130 riders will compete in the men’s road race, highlighting a startling lack of parity between the male and female events. The UCI has, at least, since announced that there will be full gender parity in the 2024 Olympics (with 90 athletes in each event).</p>\n<div></div>\n<p>Another aspect of the Olympic Road Race which will set it apart from other races is the disparity in the number of riders in each team. While nations like Italy and the Netherlands have qualified four riders each, other countries, like Denmark and Great Britain, will only have two athletes competing.</p>\n<p>This gives a pre-race advantage to the teams with more riders, allowing them to work collectively and isolate riders without as much support. Still, with the mountainous terrain that lies ahead, it could be the case that form and strength will prevail over tactics.</p>\n\n<p><span><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/men-s-olympic-road-race-2021-route-predictions-and-contenders\">Related – Men's Olympic Road Race Preview</a></strong></em><br /></span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/olympic-individual-time-trial-preview-route-predictions-and-contenders\"><span><em><strong>Related – Olympic Individual Time Trial Preview</strong></em></span></a></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide\">Related – Women's WorldTour Calendar</a></em></strong></p>\n<h4>The Route</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Olympic_women_s_cycling_1024x1024.jpg?v=1621440302\" /></p>\n<p>Inequality in the amount of participants isn’t the only controversy surrounding the women’s race. While the men will tackle the lower slopes of Mount Fuji, the women’s route omits this iconic mountain, a typically decisive climb which could incite attacks. </p>\n<p>Riders like Annemiek van Vleuten and Marianne Vos voiced their concerns about the course when it was announced back in 2018, arguing that the staggering differences between the men’s and women’s parcours did not represent equality. Recently, in an interview on television channel Discovery+, Danish rider Cecilie Uttrup Ludwig said “Mount Fuji is so iconic — I feel that everyone knows Mount Fuji, and that we should not go over that, I just think it's a real shame.\"</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/road-race-women-profile_600x600.jpg?v=1621440388\" /></p>\n<p>Instead, the women’s race will begin with a false flat which runs onto the first classified climb. At 5.9 kilometres long with slopes at 5.7%, the climb to Doushi Road is gradual and perhaps not quite steep enough for the pure climbers to do serious damage.</p>\n<p>The route continues along the Yamanakako Lake to crest Kagosaka Pass almost 20 kilometres later. The riders will then descend to the Fuji International Speedway, where they’ll complete one lap before the finish.</p>\n<p>Despite not having any huge mountains, the race will still cover 2,692m of climbing over 137km <span>—</span> by no means an easy feat. The steadier slopes to the top of the climb mean the race will be harder to control by the big nations and strong climbers like van Vlueten will find it difficult to create a gap between their rivals. The race’s shorter distance means that we’re unlikely to see any warming up or chatting in the peloton in the early stages, as we might do in the longer men’s race, instead, riders will be investing their energy into explosive and exciting racing.</p>\n<p>The descent, followed by a flat run into the line, means that this course could favour sprinters who can make it over a tough climb, or climbers who can also pack a punch at the finish. With each nation only having a maximum of four riders, it’s going to be difficult for teams to work collectively and set a hard tempo on the climb, without using up the riders they will need for the finish.</p>\n<h4>The contenders</h4>\n<p>Think fast finishers who can get over climbs and two names come to mind: Marianne Vos and Demi Vollering, two riders who will form a part of the Dutch team come July. With Annemiek van Vleuten and Anna van der Breggen completing their roster, the orange-clad squad are certainly the favourites for Olympic gold.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_4768_1024x1024_ff622ba0-8df7-41d8-9ed0-5fd68097aa30_1024x1024.jpg?v=1621440474\" /></p>\n<p><em> Photo: Simon Wilkinson/SWpix.com</em></p>\n<p>They have riders for a range of scenarios: Van Vleuten and Van der Breggen are the two strongest climbers in the women’s peloton, so they will be able to close any attacks down on the climb to Doushi Road or try and go solo themselves. Vos and Vollering can wait patiently in the wheels, trusting in their impressive sprint abilities.</p>\n<p>The only thing which could hold back the Dutch team is the possibility of them not working cohesively. With a team of four winners, could we see some internal rivalry? It’s Van der Breggen’s last season of racing, so she’ll want to go out with a bang. Should Vos and Vollering come to the finish line, who will they choose to sprint? Van Vleuten is used to being the leader in Movistar, her trade team, so will she be prepared to sacrifice her own chances? It’s certainly going to be an interesting dynamic.</p>\n<p>The USA, Australia, Italy and Germany are the other nations to qualify four riders for the event. The American team includes Ruth Winder, a rider who has shown herself to be in excellent shape when riding for her trade team Trek Segafredo. Leah Thomas is also a strong climber who could play an important part in a supporting role for Winder. Coryn Rivera is another great option for the USA should the race finish in a small bunch sprint.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_2026056_cycle_1024x1024.jpg?v=1621437726\" /></p>\n<p>Uber talent Chloe Dygert is also selected, and if she has recovered from her crash in the time trial at the Imola World Championships she will be going to Tokyo for the road race, time trial and pursuit on the track. On the road, she is a bit of an unknown quantity, seeing as she is yet to race in Europe this year. However, Dygert has proven she can peak at the right time for big events and she can’t be underestimated. </p>\n<p>Amanda Spratt is a strong climber who will lead the Australian outfit, with Grace Brown being a rider with the potential to go for a long-range attack. Young talent Sarah Gigante will also be an asset to the team in the mountains, as will Tiffany Cromwell who can use her wealth of experience to play a super domestique role.</p>\n<p>Italy’s Elisa Longo Borghini is a rider who could pose a true threat to the potential dominance of the Dutch team. Her win in Trofeo Binda shows she can disrupt their authority if she times her moves correctly, and she could be supported by Soraya Paladin whose form has been slowly building in recent months.</p>\n<div></div>\n<p>Despite having 4 spots in the race, Germany is without a pure climber who is well suited to the event in Tokyo. Lisa Brennauer is their most successful rider based on results, but the climb may be too difficult for her to get to the finish, and she will be focusing on bettering her 8th place from Rio in the time trial. However, less well-known rider Clara Koppenburg could be suited to the hilly terrain, as could Team DSM’s Liane Lippert.</p>\n<p>Other contenders include Denmark’s Cecilie Uttrup Ludwig, Poland’s Kasia Niewiadoma and Spain’s Mavi Garcia. With each of their respective nations only qualifying one or two riders, however, they may find it difficult to compete with the teams of Italy and the Netherlands. Despite racing under different colours, there could be a possibility of smaller nations working together to quash the power of the Dutch and Italian teams.</p>\n<p>Lotte Kopecky is selected to race for Belgium in the road race, supported by Valerie Demey and Julie van de Velde. Although Kopecky isn't known as a climber, she proved in Strade Bianche that she can survive over some tough gradients. If she does make it over the main ascent of the day, she could be a serious contender to win from a reduced bunch kick at the finish. </p>\n<p>Lizzie Deignan is likely to lead the Great Britain team, she recently took victory at the women's Tour de Suisse and finished 4th in the Giro d'Italia Donne which has proved she's heading back to her best after early season sickness. With only two spots available for GB, Anna Shackley is the second rider for GB. At 20 years old, she'll likely be heading to the race for experience but will still be an asset to Deignan over the hilly course.</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/to-the-wire-the-first-women-s-tour-de-suisse?_ke=\">Related: To the wire: the first women's Tour de Suisse</a></em></strong></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_2568_1024x1024.jpg?v=1621437892\" /></p>\n<p><em>Photo: Alex Whitehead/SWPix</em></p>\n<p>The temperature in Japan could also be a decisive factor, with average highs of between 29 and 31 degrees in July and August, the race will suit riders who can perform well in the heat.</p>\n<h4>Prediction</h4>\n<p>The competition is going to be stiff, but we can’t see past the strong Dutch team to take the win.<strong> Anna van der Breggen</strong> has been unbeatable when she goes for solo breakaways, and we think she has the ability to stay away alone on the flat run into the line if she launches her attack on the climb. She’ll have three of the best riders in today’s peloton working for her behind who will be able to shut down any counter moves, and she will be able to take the risk of attacking early as she can rely on Vollering or Vos to win a sprint from the chasing group in the unlikely event of her being caught.</p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2451348380536803d681df8e434d8865b17a5d4bc551d376bc7f958db6f2b5cc","category":"Cycling"}