{"title":"Attention Apple beta testers: The latest iOS 17.3 version is bricking iPhones","link":"https://www.macworld.com/article/2191771/ios-17-3-beta-2-boot-loop-install.html","date":1704311944000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Following a weeks-long holiday break, Apple on Tuesday released the second beta for iOS 17.3, but almost immediately reports began cropping up of major issues installing it. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://x.com/iswupdates/status/1742630646726406343?s=46&amp;t=KeNv190kZok_LLb57m5tjg&amp;xcust=1-1-2191771-1-0-0&amp;sref=https://www.macworld.com/feed\">According to several accounts on X</a> (formerly Twitter), the newest <a href=\"https://www.macworld.com/article/2169796/ios-17-3-beta-features-release-stolen-device-protection.html\">iOS 17.3 beta</a> is putting iPhones in a so-called “boot loop,” meaning they continually restart without ever properly loading the system.</p>\n\n\n\n<p>The first iOS 17.3 beta arrived on December 12, just a day after iOS 17.2 arrived. The upcoming release is largely focused on bug fixes and security updates, but it should bring at least two new features: Stolen Device Protection and Apple Music collaborative playlists. Apple Music collaborative playlists, which let friends add songs to and edit shared playlists, also appeared in iOS 17.2 betas but was removed from the final release.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/2169903/ios-17-3-stolen-device-protection-enable-face-id-touch-id.html\">Stolen Device Protection</a> is a newly announced feature that limits the power of your iPhone’s passcode. Currently, thieves can change your iCloud password with just your passcode, which could then be used to access passwords and accounts, but the new feature lets users turn on Face ID authentication to access passwords among other features.</p>\n\n\n\n<p>Apple will likely pull iOS 17.3 beta 2 and reissue a newer build to fix the issues so hold off on installing it for now. If you have already installed the beta and are experiencing a boot loop, you’ll need to perform a factory reset by plugging your iPhone into a Mac with a USB-C cable. Once plugged in you’ll find your iPhone a connected device in the finder (though you may need to click “Trust” in a macOS dialogue box first). Then click <em>General</em> and <em>Restore, and follow the instructions</em> for restoring for your latest backup.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"24557aac6fae7f74efe4bdd9ff74091f242337191f3373ea22a539d887f985c2","category":"Apple"}