{"title":"Just what the Dr. Ordered: White Rim in a Day","link":"https://moots.com/blog/just-what-the-dr-ordered/","date":1683321920000,"content":"<p> </p>\n<p><img src=\"https://moots.com/wp-content/uploads/2023/05/IMG_1117-e1683322530466.jpeg\" width=\"1920\" height=\"1108\" srcset=\"https://moots.com/wp-content/uploads/2023/05/IMG_1117-e1683322530466.jpeg 1920w, https://moots.com/wp-content/uploads/2023/05/IMG_1117-e1683322530466-300x173.jpeg 300w, https://moots.com/wp-content/uploads/2023/05/IMG_1117-e1683322530466-1024x591.jpeg 1024w, https://moots.com/wp-content/uploads/2023/05/IMG_1117-e1683322530466-768x443.jpeg 768w, https://moots.com/wp-content/uploads/2023/05/IMG_1117-e1683322530466-1536x886.jpeg 1536w\" /></p>\n<p>It’s been a long, yet amazing winter in Steamboat and after a ton of time playing in the snow,<span></span> we are more than ready for Spring.<span>  </span>Everyone has their own winter training plan, so when it is time to ride, it’s always a question as to how ready you’ll be.<span>  </span>Well, after a discussion with my friend Dr. Dallas Bailes, we decided it would be fun to tackle the White Rim trail in a day as an early season fitness test.<span>  </span>For those that don’t know, this is an iconic 100 mile MTB ride in Canyonlands National Park near Moab, UT.<span>  </span>Snaking through canyons, amazing rock formations and a river valley always in sight, this is a really beautiful yet challenging ride.</p>\n<p>Neither Dallas or I had been on many rides at all this season, yet we approach fitness in a similar way – stay focused on total body fitness and always be ready to go when asked for something challenging.<span>  </span>So it didn’t take long for us to agree this seemed like a great idea, plus, the team had built me a new Routt ESC I was dying to test out before a big trip planned in May.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2023/05/IMG_0053.jpeg\" width=\"1920\" height=\"1440\" srcset=\"https://moots.com/wp-content/uploads/2023/05/IMG_0053.jpeg 1920w, https://moots.com/wp-content/uploads/2023/05/IMG_0053-300x225.jpeg 300w, https://moots.com/wp-content/uploads/2023/05/IMG_0053-1024x768.jpeg 1024w, https://moots.com/wp-content/uploads/2023/05/IMG_0053-768x576.jpeg 768w, https://moots.com/wp-content/uploads/2023/05/IMG_0053-1536x1152.jpeg 1536w\" /></p>\n<p>The <a href=\"https://moots.com/bikes/gravel/routt-esc/\">Routt ESC</a> is the perfect bike for these kinds of all terrain rides and man, was it time for an escape after the incredible winter in Steamboat.<span>  </span>The team built this one w our SRAM AXS build spec, featuring Maxxis Ikon 2.35 tires and in this case a Moots seatpost.<span>  </span>A dropper post would have been a better choice for this ride, yet I’m preparing for a bikepacking trip in May so a fixed Moots post was chosen.<span>  </span>In addition, this bike features a burly titanium rigid fork with anything cage mounts, which coupled with three other water bottle cages, affords plenty of space to stuff the water we knew we’d need throughout the ride.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2023/05/IMG_0041.jpeg\" width=\"1920\" height=\"1440\" srcset=\"https://moots.com/wp-content/uploads/2023/05/IMG_0041.jpeg 1920w, https://moots.com/wp-content/uploads/2023/05/IMG_0041-300x225.jpeg 300w, https://moots.com/wp-content/uploads/2023/05/IMG_0041-1024x768.jpeg 1024w, https://moots.com/wp-content/uploads/2023/05/IMG_0041-768x576.jpeg 768w, https://moots.com/wp-content/uploads/2023/05/IMG_0041-1536x1152.jpeg 1536w\" /></p>\n<p>Arriving into Moab, UT during Spring is exciting and even more so coming from our climate in Steamboat.<span>  </span>Cyclists and off road vehicles everywhere, it is a playground for those that love the outdoors.<span>  </span>We were excited to get going and met at 5AM to head to the trail.<span>  </span>We had decided we would tackle this ride by starting at the bottom of the canyon off Mineral Bottom trail and, riding clockwise, immediately begin by climbing straight out of the canyon.<span>  </span>This proved to be a good strategy and the best thing about riding in this fashion was knocking out the road section along with the descent on Shafer Trail before there was any traffic.</p>\n<p>The biggest issue on this ride to solve for is water, simply because there is no easy way to access any along the route.<span>  </span>Having ridden this once before, I thought I had it figured out and brought along two nalgene’s, each with one liter that I mounted to my fork and then 3 full water bottles.<span>  </span>Dr. Bailes had a bottle along with a 3L Camelbak and we both had enough food to feed an army it seemed.</p>\n<p> </p>\n<p><img src=\"https://moots.com/wp-content/uploads/2023/05/IMG_0033-e1683322446190.jpeg\" width=\"1920\" height=\"993\" srcset=\"https://moots.com/wp-content/uploads/2023/05/IMG_0033-e1683322446190.jpeg 1920w, https://moots.com/wp-content/uploads/2023/05/IMG_0033-e1683322446190-300x155.jpeg 300w, https://moots.com/wp-content/uploads/2023/05/IMG_0033-e1683322446190-1024x530.jpeg 1024w, https://moots.com/wp-content/uploads/2023/05/IMG_0033-e1683322446190-768x397.jpeg 768w, https://moots.com/wp-content/uploads/2023/05/IMG_0033-e1683322446190-1536x794.jpeg 1536w\" /></p>\n<p>We enjoyed seeing the sun rise as we climbed out of the canyon and just over 20 miles into the ride, we began the descent down Shafer trail where you could just let it rip given the total absence of any traffic at all.<span>  </span>It was absolutely gorgeous and we were both just talking about how thankful we are to share experiences like this in life.<span>  </span>Once you’re down in the valley floor, you’re riding throughout the day on chunky two track terrain with varying conditions from full on rock surface to loose sand to packed gravel.<span>  </span>The key on this ride is keeping your head up and avoiding flats.</p>\n<p>The scenery along every mile is truly stunning and that’s what is so special about this ride.<span>  </span>Plus, the National Parks service does a great job of minimizing traffic throughout so it makes for a special backcountry experience.<span>  </span>We certainly soaked it all in and had all smiles until about mile 65, when hot and tired, you had a big climb up and over the ridge.<span>  </span>It was at the top of this ridge while recovering we determined that the 5 liters of water wasn’t going to be enough so time to start watching consumption.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2023/05/IMG_0043-1005x1024.jpeg\" width=\"800\" height=\"815\" srcset=\"https://moots.com/wp-content/uploads/2023/05/IMG_0043-1005x1024.jpeg 1005w, https://moots.com/wp-content/uploads/2023/05/IMG_0043-295x300.jpeg 295w, https://moots.com/wp-content/uploads/2023/05/IMG_0043-768x782.jpeg 768w, https://moots.com/wp-content/uploads/2023/05/IMG_0043-1508x1536.jpeg 1508w, https://moots.com/wp-content/uploads/2023/05/IMG_0043.jpeg 1885w\" /></p>\n<p>It’s fair to say those last 30 miles were spent counting down the time to the finish and being very careful not to drink all our fluids.<span>  </span>Unfortunately those were not an easy 30 miles, as we still had a number of super steep punchy climbs and then the real kicker was the super loose sandy paths over the last 10 miles.<span>  </span>Thanks to a nice gentleman cruising around in his Jeep, we did score a 500ml warm bottle of lemonade that was a life saver.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2023/05/IMG_0036.jpeg\" width=\"1920\" height=\"1440\" srcset=\"https://moots.com/wp-content/uploads/2023/05/IMG_0036.jpeg 1920w, https://moots.com/wp-content/uploads/2023/05/IMG_0036-300x225.jpeg 300w, https://moots.com/wp-content/uploads/2023/05/IMG_0036-1024x768.jpeg 1024w, https://moots.com/wp-content/uploads/2023/05/IMG_0036-768x576.jpeg 768w, https://moots.com/wp-content/uploads/2023/05/IMG_0036-1536x1152.jpeg 1536w\" /></p>\n<p>We arrived back at the car around 5:30PM after a long and amazing day outdoors.<span>  </span>Ride time was just over 9 hours and we were out there almost 11 hours.<span>  </span>Tired, incredibly thirsty and filthy, we headed straight back to the hotel to shower and celebrate with a nice meal.<span>  </span>It felt great knocking this ride out so early in the season without a lot of preparation.<span>  </span>A ride like this so early gets you fired up about all the adventures ahead and it is also a reminder that you can do anything when you’re mentally prepared.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2023/05/IMG_0050.jpeg\" width=\"1440\" height=\"1920\" /></p>\n<p>The <a href=\"https://moots.com/bikes/gravel/routt-esc/\">Routt ESC</a> was amazing and one might question the wisdom of your first ride on a new bike to be in such tough terrain with no bailouts, but it proved to be more than ready for the challenge.<span>  </span>I much prefer the drop bar positioning on the long distance required here and although some may prefer a suspension fork on this ride specifically, I like the ability to feel the trail and the need to remain focused on tire placement.<span>  </span>This bike is super smooth though and just feels solid and it proved to be the right choice.<span>  </span>I’ve got many more adventures planned on my <a href=\"https://moots.com/bikes/gravel/routt-esc/\">Routt ESC</a> this season and this is a bike that forces you to think differently about rides and I guarantee you’ll have as much fun as you can imagine with one of these in your garage.</p>\n<p>The post <a href=\"https://moots.com/blog/just-what-the-dr-ordered/\">Just what the Dr. Ordered: White Rim in a Day</a> appeared first on <a href=\"https://moots.com\">Moots Cycles</a>.</p>","author":"Jon Cariveau","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"2468bda31bb500d1f2f48ed8ec5a9c5a9f66f1012ad1cc46c31c07d80817aa26","category":"Cycling"}