{"title":"Probabilistic reaction norm reveals family‐related variation in the association between size, condition, and sexual maturation onset in Atlantic salmon (Salmo salar)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15626?af=R","date":1712853919000,"content":"<h2>Abstract</h2>\n<p>This study investigated the relationship between the size, condition, year class, family, and sexual maturity of Atlantic salmon (<i>Salmo salar</i>) using data collected in an aquaculture selective breeding programme. Males that were sexually mature at 2 years of age (maiden spawn) have, on average, greater fork length and condition factor (<i>K</i>) at 1 year of age than their immature counterparts. For every 10-mm increase in fork length or 0.1 increase in <i>K</i> at 1 year of age, the odds of sexual maturity at 2 years of age increased by 1.48 or 1.22 times, respectively. Females that were sexually mature at 3 years of age (maiden spawn) have, on average, greater fork length and <i>K</i> at 2 years of age than their immature counterparts. For every 10-mm increase in fork length or 0.1 increase in <i>K</i> at 2 years of age, the odds of sexual maturity at 3 years of age increased by 1.06 or 1.44 times, respectively. The family explained 34.93% of the variation in sexual maturity among 2-year-old males that was not attributable to the average effects of fork length and <i>K</i> at 1 year of age and year class. The proportion of variation in sexual maturity among 3-year-old females explained by the family could not be investigated. These findings suggest that the onset of sexual maturation in Atlantic salmon is conditional on performance (with respect to energy availability) surpassing a threshold, the magnitude of which can vary between families and is determined by a genetic component. This could support the application of genetic selection to promote or inhibit the onset of sexual maturation in farmed stocks.</p>","author":"Morgan S. Brown, \nRoberto Carvalheiro, \nRichard S. Taylor, \nWagdy Mekkawy, \nTimothy D. W. Luke, \nLewis Rands, \nDamien Nieuwesteeg, \nBrad S. Evans, \nNicholas M. Wade, \nCurtis E. Lind, \nPollyanna E. Hilder","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"246d9711bc0c422e9f6f8d98b049a8c0fd9c76bf312b7cde7b018718916a0982","category":"Environment"}