{"title":"Automatically Detected CSES Ionospheric Precursors During Aftershocks of the Wushi MS 7.1 Earthquake on 23 January 2024 in Northwest China","link":"https://www.preprints.org/manuscript/202409.1482/v1","date":1726740078000,"content":"Launched on 2 February 2018, CSES is the first constellation in China to advance our understanding of seismo-ionospheric influence and lithosphere-atmosphere-ionosphere coupling process in electromagnetic environment during earthquake prediction practice. For this purpose, a software platform developed for automatically searching ionospheric perturbations from the CSES plasma data had been put into service immediately after the Wushi MS 7.1 earthquake occurred on 23 January 2024 to weekly detect possible precursory information before impending aftershocks. Effective ionospheric variations were successfully detected two times during more than four weeks. An ionospheric perturbation with an enhanced magnitude 38.3% was primarily detected on electron density but none on ion density on 24 January 2024 at night orbit 33175 and the corresponding variations in different parameters recorded at the same orbit presented a complex features. There irregularities possibly combined with influence both from three following strong aftershocks with magnitudes over 5.0 during 25–30, January and magnetic storm disturbance due to Kp value once up to 3.7 on 24 January. An electron perturbation with an amplitude 24.6%, as well as an ion one with 27.3%, was successfully searched automatically at the same revisiting orbit 33251 occurred on the revisiting date of 3 February 2024 in a magnetic quiet period. These two plasma variations, as well as ones on other ionospheric parameters, were characterized by highly similar properties, which increases the availability as seismic precursors. However, no obvious variations had been observed at other revisiting orbits or other orbits near the aftershock areas during this period till the occurrence of a magnitude 5.3 earthquake on 24 February and the strongest one 5.8 on 25 February, respectively, 20 days after and 1000 km away.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2470ad1306198538ba02c07ba4d67e67bc515525476b88fc76c6343c0cd816f1","category":"Interdisciplinary"}