{"title":"UCI bans blood glucose and lactate monitoring devices from competition","link":"https://www.bikeradar.com/news/uci-bans-supersapiens/","date":1623080055000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/©INEOS-Grenadiers-IMG-447007a.jpg?quality=45&amp;resize=620,413\" />                                            <p>The UCI has introduced a ban on the in-competition use of devices that capture information on metabolic values including, but not limited to, glucose and lactate.</p>\n<p>Published last week, the rule 1.3.006bis amendment will come into effect on 10 June 2021 and will most notably be bad news for Supersapiens, whose blood glucose monitoring technology is used by professional cycling teams including Team Ineos Grenadiers and EF Education-Nippo.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Supersapiens has started working with many professional cycling teams.</span></figcaption><span> <i>Supersapiens</i></span></div>\n<p>Supersapiens’ Abbot Libre Sensor is a small device worn on the back of the arm and has become a common sighting at professional races. It works in conjunction with either a smartphone app or cycling computer to give live read-outs of blood sugar levels, helping inform riders on fuelling effectively.</p>\n<p>However, under the new rule, professional riders will no longer be able to use the device in races and it will only be allowed as a training device.</p>\n<p>The UCI has not commented on why these devices have been banned, but EF Education-Nippo cycling team’s CEO John Vaughters took to Twitter stating that it is “On brand” from the UCI saying “If they can’t understan’ it, they ban it.”</p>\n<blockquote><p>On brand. If they can’t understan’ it, they ban it.</p>— Jonathan Vaughters (@Vaughters) <a href=\"https://twitter.com/Vaughters/status/1401556311641399297?ref_src=twsrc%5Etfw\">June 6, 2021</a></blockquote><p>Other Twitter users commented on the fact that banning glucose measuring devices could have an impact on diabetic riders, where they are used as a medical aid.</p>\n<p>The <a href=\"https://www.uci.org/docs/default-source/rules-and-regulations-right-column/part-i-general-organisation/1-gen-20210610-e-amendments-on-10.06.2021.pdf\" target=\"_blank\">regulations</a> do say that the UCI may grant derogations to individual riders, teams or events for any envisaged use of unauthorised technology, but they do not specify what reasons could permit an exemption.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The glucose measuring devices have become a common sighting at professional races.</span></figcaption><span> <i>Supersapiens</i></span></div>\n<p>While the UCI has banned Supersapien devices from competition, Ironman Triathlon recently announced <a href=\"https://www.tri247.com/triathlon-news/industry/supersapiens-partners-ironman\" target=\"_blank\">a partnership with the company</a> – a tale that might come as little surprise to anyone that follows the banning foibles of the UCI and the more technophilic developments of triathlon.</p>\n<p>Other devices that capture or transmit physiological data could be interpreted as being banned by rule 1.3.006bis, but the UCI has stated that some other devices are allowed. These include heart rate monitors as well as devices that measure body temperature and sweat rate.</p>\n<p>BikeRadar has contacted Supersapiens for comment and is currently awaiting a response.</p>\n<section><div>\n        <h2>BikeRadar’s take | Not a surprise, but implications go beyond stifling tech alone</h2>\n<h3>Simon Bromley, a dedicated data nerd, on UCI rule 1.3.006bis</h3>\n<p>Here we go again… Is anybody really surprised? The UCI shows no signs of reneging on its ‘ban it first, ask questions later’ policy.</p>\n<p>Of course, being a tech writer, I’m somewhat biased. I love new tech and don’t want to see innovations snuffed out before they’ve had a chance to establish themselves.</p>\n<p>But I also think there’s a good argument to be made for considering the future financial viability of the sport. As many will know, <a href=\"https://theouterline.com/race-economics-what-covid-19-has-revealed/\" target=\"_blank\">road cycling isn’t a particularly profitable sport</a>.</p>\n<p>Even the sport’s premier event, the Tour de France, was reported to have lost money in 2020 (largely thanks to the <a href=\"https://www.bikeradar.com/features/covid-19-cycling/\">global pandemic</a>, but it shows how precarious the situation is).</p>\n<p>But why bother innovating or putting money into cycling if the UCI is just going to arbitrarily ban whatever exciting new product or thing you’ve developed?</p>\n<p>Where will brands like Supersapiens put their money going forward? Another sport, no doubt.</p>\n<p>\n\n    </p></div>\n    </section>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"247374f25bf9e58ea5fd9f030da6d574b53e3d1cb99b73c199b4c5147f92820e","category":"Cycling"}