{"title":"OpenAI says mysterious chat histories resulted from account takeover","link":"https://arstechnica.com/?p=1999872","date":1706645728000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/chatgpt-800x520.jpg\" alt=\"OpenAI logo displayed on a phone screen and ChatGPT website displayed on a laptop screen.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/chatgpt.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>OpenAI officials say that the ChatGPT histories a user reported result from his ChatGPT account being compromised. The unauthorized logins came from Sri Lanka, an Open AI representative said. The user said he logs into his account from Brooklyn, New York.</p>\n<p>“From what we discovered, we consider it an account take over in that it’s consistent with activity we see where someone is contributing to a ‘pool’ of identities that an external community or proxy server uses to distribute free access,” the representative wrote. “The investigation observed that conversations were created recently from Sri Lanka. These conversations are in the same time frame as successful logins from Sri Lanka.”</p>\n<p>The user, Chase Whiteside, has since changed his password, but he doubted his account was compromised. He said he used a nine-character password with upper- and lower-case letters and special characters. He said he didn’t use it anywhere other than for a Microsoft account. He said the chat histories belonging to other people appeared all at once on Monday morning during a brief break from using his account.</p></div><p><a href=\"https://arstechnica.com/?p=1999872#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1999872&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"24760b28b6fa0d99a3e7cf07b284628a3bcb48c4910afc44276a5544abf3235d","category":"Tech"}