{"title":"Canyon Ring bar end bell review: It’s chime time","link":"https://cyclingtips.com/2021/08/canyon-ring-bar-end-bell-review-its-chime-time/","date":1628217460000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Canyon-Ring-bar-end-bell-review-CyclingTips-1-2-650x433.jpg\" /></div><h2>Canyon Ring bar end bell review: It's chime time</h2><p>\n</p><p>Hey, remember when bike bells used to be the first thing you’d take off a new bike? When they were sneered at by ‘serious cyclists’ as the calling card of the novice rider? When they were the favoured “gotcha” of anti-bike police officers? </p>\n\n\n\n<p>I think bike riding’s come a bit of a way since then. I hope it has. It at least <em>seems</em> to me that bells are no longer destined for landfill as soon as they leave the shop, because, improbably enough, bells are kinda cool now. </p>\n\n\n\n<p>The <a href=\"https://cyclingtips.com/2016/08/a-tale-of-two-bells-spurcycle-vs-the-counterfeiters/\">SpurCycle bell</a>, released on Kickstarter in 2013, is the bellwether bell to thank for that. It’s luxurious. It’s lovely. It lasts forever. </p>\n\n\n\n<p>Almost as important as SpurCycle’s individual success, however, was the gently pinging arms race its product sparked in the niche bike bell industry, as other manufacturers realised that they needed to get with the program. The venerable Japanese bell specialist, <a href=\"https://cyclingtips.com/2020/05/crane-e-ne-bike-bell-review-and-comparison/\">Crane, introduced the e-Ne</a>. Knog crowdfunded the Oi – <a href=\"https://cyclingtips.com/2016/12/spurcycle-vs-knog-oi-review/\">which wasn’t very good</a> – and followed it up with the <a href=\"https://cyclingtips.com/2019/09/knog-oi-luxe-bell-review-better-in-every-way-but-maybe-not-better-enough/\">Oi Luxe, which is a lot better</a>. </p>\n\n\n\n<p>Now there’s a fancy new bell in town, quietly released earlier this year. </p>\n\n\n\n<p>Its manufacturer is Canyon, the German direct-to-consumer bike juggernaut. After testing the Crane e-Ne last year – and, just quietly, <a href=\"https://cyclingtips.com/2020/05/crane-e-ne-bike-bell-review-and-comparison/\">having quite a lot of fun doing so</a> – I thought it was time to see how Canyon’s offering stacks up against the competition. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Canyon-Ring-bar-end-bell-review-CyclingTips-7-1340x893.jpg\" /></figure>\n\n\n\n<h2>Ring-a-ding-ding</h2>\n\n\n\n<p>The Canyon Ring has a trick up its sleeve – instead of mounting around the handlebar, it is designed for the end of a drop bar. It installs tool-free, replacing a bar-end plug. There’s an expander plug built into the end of it, so, Canyon says, you push it in, twist it until it’s tight and go on your merry way.</p>\n\n\n\n<p>It’s a bit more complicated than that in the real world. If you’ve got a lot of bar tape tucked into the bar you might be alright, but for a really tight fit you may need to wrap some extra tape on the inside or around the plug to increase its diameter and get it snug.</p>\n\n\n\n<p>It’s a neat design, though. There’s only the most subtle of Canyon branding on it, in the form of a black-on-black logo on the bell, and the whole thing is pretty unobtrusive – just a small black extension to the handlebar with a little paperclip-looking hammer off to the side of it. Nothing remotely dorky here: blink and you’d miss it. </p>\n\n\n\n<p>It weighs 40 grams. I have no idea if that will appease the weight weenies or not, and I don’t particularly care.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Canyon-Ring-bar-end-bell-review-CyclingTips-6-1340x893.jpg\" /></figure>\n\n\n\n<p>Canyon’s design has a couple of good practical things going for it. It frees up a bit of space on the flats of your handlebars – space for your handlebar bag, or a light, or a computer mount. It’s also much more discreet if you’re a reformed bell-sneerer trying to keep things as neat and tidy as possible. </p>\n\n\n\n<p>It’s not all upside, though. The placement of the bell puts it out of finger reach and basically necessitates a whole hand off the bar to activate it. That requires a bit of premeditation, and is less of an intuitive action. </p>\n\n\n\n<p>Sure, it’s fine if you’re approaching somebody on a straight, well-made trail. It’s much more of a scramble if you’re on a bumpy path or suddenly round a bend to find pedestrians in front of you, where you’re having to make a snap decision between using a brake or sounding a bell. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Canyon-Ring-bar-end-bell-review-CyclingTips-9-1340x893.jpg\" /><figcaption>It’s a long way from the brake lever to that bell if you’re under pressure. </figcaption></figure>\n\n\n\n<p>The sound of the Ring is quite nice; a bit lower in pitch than a Spurcycle, but with less sustain. Canyon reckons it’s good for 85 decibels. That’s somewhere just below a lawn mower, albeit in a much more polite and melodic format. I don’t have a way of independently verifying that, but I will say that it seems to do a good job of alerting people to your approach. </p>\n\n\n\n<p>The position of the bell, or the fact that you can’t easily brace your hand against the bar when using it, means that the Ring has a fairly wide dynamic range. You can feather it for a gentle ding, or give it a hearty twang for a louder one. Both of those actions, though, require more thought than just extending your thumb from a hand wrapped around a bar. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Canyon-Ring-bar-end-bell-review-CyclingTips-3-1340x893.jpg\" /></figure>\n\n\n\n<p>This bell is – at first glance – pretty decent value. At AU$31.95 (US$23.99 / €19.99), it’s considerably cheaper than any of the equivalent bells I’ve mentioned – about a third the price of a SpurCycle, and about half the price of either the Crane e-Ne or the Knog Oi Luxe. </p>\n\n\n\n<p>But once you factor in shipping costs, the value proposition begins to pale considerably for certain markets. It’s happy days in Europe – just €5-€10 postage – but to get one to Australia you’re looking at an extra AU$59 in shipping. Spare a thought for bell enthusiasts in the United Arab Emirates, who can expect to fork out an extra US$128.81. </p>\n\n\n\n<p>It’s a good bell, but you’d <em>really</em> have to want it if you were paying that for shipping. </p>\n\n\n\n<p>On the other hand, if you’re bundling it with a bike purchase from Canyon, it’s cheap enough and good enough to basically be a no-brainer.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Canyon-Ring-bar-end-bell-review-CyclingTips-8-1340x893.jpg\" /><figcaption>You can align the hammer up, down, pointing out, or pointing in. Canyon’s promo pics all seem to have it positioned downward, but the above felt most natural for me.</figcaption></figure>\n\n\n\n<h2>Pings and things</h2>\n\n\n\n<p>Ah, but how does the thing sound? An excellent question, and thank you. Please view the below video, which compares the Canyon Ring with the Crane e-Ne, Spurcycle, and the Knog Oi Luxe (all in that order).</p>\n\n\n\n<div></div>\n\n\n\n<p>What’s that? You want<em> more</em> data in the form of a table ranking the four bells for all the factors you might care about?</p>\n\n\n\n<p>Oh, I got ya.</p>\n\n\n\n \n\n\n\n\n<table>\n<thead>\n  <tr>\n    <th><span>Category</span></th>\n    <th><span>Canyon Ring</span></th>\n    <th><span>Crane e-Ne</span></th>\n    <th><span>Spurcycle</span></th>\n    <th><span>Knog Oi Luxe</span></th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td>Volume</td>\n    <td>2</td>\n    <td>2</td>\n    <td><span>1</span></td>\n    <td>4</td>\n  </tr>\n  <tr>\n    <td>Sustain</td>\n    <td>2</td>\n    <td>3</td>\n    <td><span>1</span></td>\n    <td>4</td>\n  </tr>\n  <tr>\n    <td>Design</td>\n    <td>2</td>\n    <td>4</td>\n    <td>3</td>\n    <td><span>1</span></td>\n  </tr>\n  <tr>\n    <td>‘Angel on glockenspiel’-ness</td>\n    <td>2</td>\n    <td>4</td>\n    <td>3</td>\n    <td><span>1</span></td>\n  </tr>\n  <tr>\n    <td>Artisanal charm</td>\n    <td>4</td>\n    <td><span>1</span></td>\n    <td>2</td>\n    <td>3</td>\n  </tr>\n  <tr>\n    <td>Value for money</td>\n    <td>2 (ish)</td>\n    <td><span>1</span></td>\n    <td>4</td>\n    <td>3</td>\n  </tr>\n  <tr>\n    <td>Reassuring heft</td>\n    <td>4</td>\n    <td><span>1</span></td>\n    <td>3</td>\n    <td>2</td>\n  </tr>\n  <tr>\n    <td>Cuteness</td>\n    <td><span>1</span></td>\n    <td>4</td>\n    <td>2</td>\n    <td>3</td>\n  </tr>\n  <tr>\n    <td>Actual ability to get people out of your way<br />(without any truly rigorous data to back it up)</td>\n    <td>2</td>\n    <td><span>1</span></td>\n    <td>2</td>\n    <td>4</td>\n  </tr>\n  <tr>\n    <td>Likelihood you’d give it to your Dad for his 60th birthday</td>\n    <td>4</td>\n    <td>2</td>\n    <td><span>1</span></td>\n    <td>3</td>\n  </tr>\n  <tr>\n    <td><span>Je ne sais quoi</span></td>\n    <td>3</td>\n    <td>2</td>\n    <td><span>1</span></td>\n    <td>4</td>\n  </tr>\n</tbody>\n</table>\n\n\n\n \n\n\n\n<p>As you can see, on most of the categories that most people would care the most about – chiefly volume and sustain – SpurCycle is hard to look past. The Canyon Ring is an extremely well-rounded contender, coming second in most of the vital categories, but also bottom of the pack for ‘Artisanal charm’, ‘Reassuring heft’ and the all important ‘Dad’s Big Birthday’ distinctions, due to its plastic base and relative lack of luxury compared to the all-metal construction of the other three.</p>\n\n\n\n<p>Crane’s up there with the SpurCycle, jostling with Canyon for the silver medal, while Knog’s Oi Luxe – while much improved – is more style than substance.</p>\n\n\n\n<h2>Compare and contrast</h2>\n\n\n\n<p>We’ve spoken about the SpurCycle, the Crane, the Knog – but perhaps another useful data point is the HideMyBell computer mount, which conceals its bell under your Garmin or Wahoo in an out-front mount. That’s a design that is useful at moving the bell away from the centre section of the bar, with some similar ergonomic drawbacks in requiring you to take a hand off the bar to activate it. </p>\n\n\n\n<p>Purely in terms of the dinging bit, the Canyon Ring is way better than the HideMyBell, a fair bit better than the Oi Luxe, about on a par with the e-Ne, but not as good as the carryover champ, SpurCycle. </p>\n\n\n\n<p>If you’re an infrequent bell-user and in a favourable shipping zone, it’s well worth a look. If you’re going to get stung for shipping – or if you need more ready or regular access to your bell – I’d look elsewhere.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/canyon-ring-bar-end-bell-review-its-chime-time/\">Read More</a>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"2487ceaa028aa9458e63360a8c766c01d0243ef92ea600c9427b2db67b4be386","category":"Cycling"}