{"title":"Validation of the patient reported experiences and outcomes of safety in primary care compact Form Brazil","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305414","date":1719842400000,"content":"<p>by Ana Elisa Bauer de Camargo Silva, Tanielly Paula Sousa, Rafael Alves Guimaraes, Valéria Pagotto, Juliana Carvalho de Lima, Maiana Regina Gomes de Sousa, Cristina Alves Bernardes</p>\r\nObjective <p>To analyze the psychometric properties of the cross-culturally adapted version of the Patient Reported Experiences and Outcomes of Safety in Primary Care (PREOS–PC) Compact Form Brazil.</p> Methods <p>A methodological study was conducted with 281 adult Primary Health Care users. Data collection took place online. Confirmatory Factor Analysis (CFA) was used to evaluate the psychometric properties of the PREOS–PC after the process of cross-cultural adaptation to the Brazilian context. Internal consistency was evaluated through Cronbach’s alpha coefficient (α) and McDonald’s omega coefficient (ω).</p> Results <p>The sample consisted of 73.3% women. The mean age was 36.1 years (<i>SD</i> = 12.2). Of the 23 items of the PREOS–PC that were eligible for CFA, a model with four correlated domains and 16 items presented satisfactory fit indexes. The domains were Practice Activation (PrA) (four items), Patient Activation (PaA) (two items), Experiences of patient safety events (EPaS) (five items) and Outcomes of patient safety (OPaS) (six items). One domain (GPeS) presented one question with a 0 to 10 response scale and two open questions, which cannot be inserted in the CPA due to the nature of the items, but can be included in the application of the scale, being evaluated individually. In this factorial model, five items (EPaS2, EPaS3, EPaS4, EPaS5, EPaS6 and EPaS8) presented factor loadings ≤ 0.30. The α and ω values demonstrated good internal consistency for all domains of the PREOS–PC.</p> Conclusions <p>The Brazilian version of the PREOS–PC Compact Form Brazil composed of four domains (PrA, PA, EPaS and OPaS) and 16 items presented evidence of validation of its psychometric properties and can be used to evaluate the experiences and results of patient safety in Primary Health Care in the Brazilian context.</p>","author":"Ana Elisa Bauer de Camargo Silva","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"24897e7b1f85636cb1777082f57bace81fa8a29af909e80dd97c6fa9599284f2","category":"Interdisciplinary"}