{"title":"Will Apple follow Google’s move and remove the lock icon from Safari?","link":"https://www.macworld.com/article/1807709/google-chrome-lock-tune-icon-safari.html","date":1683184637000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you’re reading this story on a browser, you’ll see a small lock icon in the address bar just like you would if you were reading something on 9to5Mac, the Verge, or Apple’s site. For years, it’s been a universal symbol of safety and security… and now <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blog.chromium.org/2023/05/an-update-on-lock-icon.html&amp;xcust=1-1-1807709-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Google has announced</a> that it’s going away.</p>\n\n\n\n<p>Why? Because the lock never actually meant what people thought it meant. As a universal symbol of security, the lock conveys a sense of trustworthiness and encryption, but it really means something much more mundane: the network connection between the browser and the site is encrypted and cannot be tampered with or eavesdropped on by third parties. That doesn’t necessarily mean the site itself is trustworthy. In fact, the lock symbol is more of a remnant of a pre-HTTPS era and now is as common as a favicon. Yet most people still see it as a symbol of trust.</p>\n\n\n\n<p>With version 117, Chrome is rolling out a new symbol based on the “tune” icon, which will look something like two toggles. When you click or tap it, it will show permission controls and make additional security information more accessible, while avoiding the misunderstandings of the lock icon.</p>\n\n\n\n<p>It will certainly take some getting used to. The lock symbol has been sitting in our address bars for decades and the new icon is definitely different. But if it gets people to understand the purpose of the symbol and be a little more cautious when browsing the web, it’s definitely a good change. In fact, in a research study, Google found that the new icon prompted users to open the site controls more often.</p>\n\n\n\n<p>So will Safari be next? Apple uses the same universal lock symbol to denote sites that use an encrypted connection, so a similar change could accomplish the same thing. It would also give users more control over the sites they visit, with greater visibility over cookies and site data.</p>\n\n\n\n<p>With the first look at Safari 17 coming at <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC</a> in just a couple of weeks, it’s likely that Apple will make a similar change so users aren’t confused when Chrome–which should hit version 117 by late summer or early fall–makes the change. If you don’t want to wait, you can test the new icon now in Chrome Canary by enabling Chrome Refresh 2023 at chrome://flags#chrome-refresh-2023.</p>\n\niOS, Mac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"248bc5946cf5444b834e2c823aa88b2d849a4d9fccf00a149462c3a0d9c314d0","category":"Apple"}