{"title":"Relating gut microbiome composition and life history metrics for pronghorn (<i>Antilocapra americana</i>) in the Red Desert, Wyoming","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306722","date":1720620000000,"content":"<p>by Courtney E. Buchanan, Stephanie J. Galla, Mario E. Muscarella, Jennifer S. Forbey, Adele K. Reinking, Jeffrey L. Beck</p>\r\n\r\nHost microbial communities (hereafter, the ‘microbiome’) are recognized as an important aspect of host health and are gaining attention as a useful biomarker to understand the ecology and demographics of wildlife populations. Several studies indicate that the microbiome may contribute to the adaptive capacity of animals to changing environments associated with increasing habitat fragmentation and rapid climate change. To this end, we investigated the gut microbiome of pronghorn (<i>Antilocapra americana</i>), an iconic species in an environment that is undergoing both climatic and anthropogenic change. The bacterial composition of the pronghorn gut microbiome has yet to be described in the literature, and thus our study provides important baseline information about this species. We used 16S rRNA amplicon sequencing of fecal samples to characterize the gut microbiome of pronghorn—a facultative sagebrush (<i>Artemisia spp</i>.) specialist in many regions where they occur in western North America. We collected fecal pellets from 159 captured female pronghorn from four herds in the Red Desert of Wyoming during winters of 2013 and 2014. We found small, but significant differences in diversity of the gut microbiome relative to study area, capture period, and body fat measurements. In addition, we found a difference in gut microbiome composition in pronghorn across two regions separated by Interstate 80. Results indicated that the fecal microbiome may be a potential biomarker for the spatial ecology of free-ranging ungulates. The core gut microbiome of these animals—including bacteria in the phyla Firmicutes (now Bacillota) and Bacteroidota—remained relatively stable across populations and biological metrics. These findings provide a baseline for the gut microbiome of pronghorn that could potentially be used as a target in monitoring health and population structure of pronghorn relative to habitat fragmentation, climate change, and management practices.","author":"Courtney E. Buchanan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"248c246f04ea8cf04131eab4b278a5abe6facd8789e4582ce026f69520f52452","category":"Interdisciplinary"}