{"title":"Cyanobacterial Blooms Formation by Enhanced Ecological Adaptability and Competitive Advantage of Microcystis&mdash; Non-Negligible Role of Quorum-Sensing","link":"https://www.preprints.org/manuscript/202406.0921/v1","date":1718273467000,"content":"Microcystis-dominated cyanobacterial blooms (MCBs) frequently occur in freshwaters worldwide due to massive Microcystis colonies formation and severely threaten human and ecosystems health. Quorum sensing (QS) is a direct cause of Microcystis colonies formation, possibly regulating MCBs occur and Microcystis population behaviors [1, 2]. Many novel findings in fundamental knowledge of Microcystis QS phenomenon and the signaling molecules have been documented. However, little effort has devoted to comprehensively summarize and discuss research progresses and exploration direction on QS signaling molecules-mediated QS system in Microcystis. This article summarizes action process of N-acyl homoserine lactones (AHLs) as major signaling molecules in Microcystis and discussed the detailed roles of AHLs-mediated QS system in cells aggregation, colonies formation, ecological adaptability and competitive advantage. And the progress was summarized in research on the QS mechanism in Microcystis. Compared to other QS system, the LuxI/LuxR-type QS system is more likely to found in Microcystis. Also, we introduced Quorum quenching (QQ) — QS blocking process in Microcystis, with emphasizing on the potential of QS inhibitors in MCBs control. Finally, in response to the research deficiencies and gaps in Microcystis QS and QQ, we proposed several future research directions in these fields. This review may deepen the understanding of Microcystis QS knowledge and provide theoretical guidance for the development of strategies to monitor, control and harness MCBs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"248c7c5efe011c00694e04de9ef9a0e4c85967012a76e4b2af5279e55d2ce811","category":"Interdisciplinary"}