{"title":"Pre-operative prediction of BCR-free survival with mRNA variables in prostate cancer","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311162","date":1727791200000,"content":"<p>by Autumn O’Donnell, Michael Cronin, Shirin Moghaddam, Eric Wolsztynski</p>\r\n\r\nTechnological innovation yielded opportunities to obtain mRNA expression data for prostate cancer (PCa) patients even prior to biopsy, which can be used in a precision medicine approach to treatment decision-making. This can apply in particular to predict the risk of, and time to biochemical recurrence (BCR). Most mRNA-based models currently proposed to this end are designed for risk classification and post-operative prediction. Effective pre-operative prediction would facilitate early treatment decision-making, in particular by indicating more appropriate therapeutic pathways for patient profiles who would likely not benefit from a systematic prostatectomy regime. The aim of this study is to investigate the possibility to leverage mRNA information pre-operatively for BCR-free survival prediction. To do this, we considered time-to-event machine learning (ML) methodologies, rather than classification models at a specific survival horizon. We retrospectively analysed a cohort of 135 patients with clinical follow-up data and mRNA information comprising over 26,000 features (data accessible at NCBI GEO database, accession GSE21032). The performance of ML models including random survival forest, boosted and regularised Cox models were assessed, in terms of model discrimination, calibration, and predictive accuracy for overall, 3-year and 5-year survival, aligning with common clinical endpoints. Results showed that the inclusion of mRNA information could yield a gain in performance for pre-operative BCR prediction. ML-based time-to-event models significantly outperformed reference nomograms that used only routine clinical information with respect to all metrics considered. We believe this is the first study proposing pre-operative transcriptomics models for BCR prediction in PCa. External validation of these findings, including confirmation of the mRNA variables identified as potential key predictors in this study, could pave the way for pre-operative precision nomograms to facilitate timely personalised clinical decision-making.","author":"Autumn O’Donnell","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2497ce2b3934531355d014654226c17df27bb9cd667c9256cd0bfab490b08386","category":"Interdisciplinary"}