{"title":"A multi‐metric index for assessing two decades of community responses to broad‐scale shoreline enhancement and restoration along the Toronto waterfront","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4141?af=R","date":1711953221000,"content":"<h2>Abstract</h2>\n<p>\nBiodiversity and habitat loss due to historical and continued urbanization and anthropogenic development require continuous efforts to abate ongoing environmental decline. Restoration and enhancement efforts that aim to address biodiversity and habitat loss, have shown some promise at providing suitable habitat for species in the more urbanized nearshore areas of Lake Ontario.\nUsing 20 years of fish community data from the Toronto waterfront, this study examined ecosystem responses in a spatio-temporal context across wetland and embayment ecotypes. The goals of this study were to (1) assess how fish communities have changed over time in restored, reference and more and less urbanized nearshore ecosystems and (2) determine if restored and enhanced habitats meet the defined fish community management targets.\nFish communities were assessed through a newly developed multi-metric index based on species life history traits and habitat associations like trophic and thermal guild.\nFish communities along the waterfront have transitioned from cool and coldwater pelagic species to a higher proportion of native warmwater species, many of them piscivores, associated with cover and vegetation, that meet community targets. These changes are more pronounced at the largest restoration site ‘Tommy Thompson Park’, where community indices approach natural reference levels. This result indicates the benefits and effectiveness of the decade-long restoration efforts and subsequent monitoring of responses. Our results underline that large-scale restoration projects in urbanized settings can be of vital importance for freshwater conservation efforts, as well as application scenarios for multi-metric community indices, and will play an even larger role when looking at Lake Ontario or the Great Lakes as a whole.\n</p>","author":"Sebastian Theis, \nLyndsay Cartwright, \nAndrea Chreston, \nBrynn Coey, \nBrian Graham, \nDon Little, \nMark Poesch, \nRick Portiss, \nRyan Scott, \nAngela Wallace, \nJonathan L. W. Ruppert","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"249a77295ee2ab713076f05b9b607b791e48327580920c2443d749e3e130cf3c","category":"Environment"}