{"title":"Frequency of Viral Hepatitis in the Governorate of Hajjah, Yemen, for Four Years: Between 2020 and 2023","link":"https://www.preprints.org/manuscript/202406.1492/v1","date":1718942137000,"content":"Viral hepatitis is currently acknowledged as a significant public health issue that necessitates a prompt and immediate response. Hepatitis is a significant worldwide health problem that causes the death of approximately 1.5 million individuals annually. The objective of this study was to ascertain the occurrence rate of hepatitis A, E, B, and C infections in the Hajjah governorate of Yemen from 2020 to 2023.A retrospective study was conducted in the Hajjah Governorate of Yemen for four years, 2020– 2023. About 41162 cases were collected from the clinical records of epidemiological surveillance in the Public Health Office of the Hajjah Governorate. All cases were diagnosed in different laboratories based on direct observation of viral hepatitis in the blood sample. The required data were obtained by using the designed questionnaire. The findings of the present investigation were summarized as follows: The current findings indicate that the prevalence rate of Hepatitis A and E was 761 (1.85%), while the prevalence rate of Hepatitis B and C was 971 (2.36%) among the participants of the study. The current findings indicate that the incidence of Hepatitis A and E was greater in 2022 (2.3%), while Hepatitis B and C had a higher rate in 2020 (2.9%). The study revealed a higher prevalence of hepatitis A and E among individuals originating from Al Miftah district 116, with a rate of 7.5%. Furthermore, the prevalence of hepatitis B and C in Hajjah city was significantly higher, reaching 579 cases (22.9%). The month with the highest incidence of hepatitis A and E viruses was September, with a rate of 85 cases (2.6%), while the lowest incidence was observed in April, with a rate of 1.3%. The prevalence of hepatitis B and C viruses was highest in October 1997, with a rate of 2.8%, followed by November 1997 with the same rate. The lowest observed incidence of 1.6% was recorded in April. In Autumn, a significant prevalence of hepatitis A and B viruses, as well as hepatitis B and C viruses, was identified at rates of 2.2% and 2.6%, respectively.The study findings indicate that the occurrence of HAV, HEV, HBV, and HCV in the study area is consistent with global trends. Although the study found a low prevalence of hepatitis viruses, these types of viruses will continue to pose a significant risk to public health. Based on this study, it is imperative for authorities to actively enhance public awareness in order to enable prompt planning and essential arrangements for an effective response to outbreaks or epidemics. This will ultimately lead to a reduction in illness, death, and economic burden.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"249d1ba45aa62aee6c4c8497a19532adca07234bcac6b145336f07d0641c02cb","category":"Interdisciplinary"}