{"title":"The Impact of Breast Cancer Risk Factors: Socio-Economic, Hormonal, and Clinical Insights from Hassan II Regional Oncology Center, Morocco","link":"https://www.preprints.org/manuscript/202409.0823/v1","date":1726006450000,"content":"Background/Objectives: This study aimed to identify various risk factors associated with breast cancer and explore different treatment strategies based on socio-economic, hormonal, and clinical perspectives.; Methods: We analyzed socio-economic, hormonal, genetic, and clinical variables using data from 356 questionnaires obtained from breast cancer patients at Hassan II Regional Hospital in Agadir, Morocco ; Results:The study reveals that the average age of breast cancer patients is 50 ± 10.72 years, with a mode of 47 years and an age range from 29 to 94 years. Notably, women aged 38 are most frequently diagnosed with triple-negative breast cancer. Significant socio-economic trends were observed among the participants, with the majority being housewives (91%) and nearly half residing in rural areas (48.60%). High rates of illiteracy (74.72%) and financial difficulties (54.2%) pose challenges in accessing healthcare services. Psychological distress is prevalent, with 40.7% experiencing anxiety and 30.1% experiencing sadness. The use of oral contraceptives varies, with implications for breast cancer risk. Additionally, statistics on menarche and menopause suggest hormonal influences on breast cancer development. Histological analysis indicates a predominance of grade II invasive ductal carcinoma and left breast localization. Metastases are present in nearly 38.20% of cases. Notably, surgery as the primary treatment effectively treats medium-sized tumors while limiting metastasis. Furthermore, a comparison of treatment strategies reveals a preference for letrozole among postmenopausal patients and tamoxifen among premenopausal patients; Conclusions:These findings highlight the complexity of breast cancer risk factors and therapeutic approaches, emphasizing the importance of personalized care and targeted interventions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"249e60d04094b32951bb7bf1986add32acb16fab82d6d67ac85f1cfa18d79da2","category":"Interdisciplinary"}