{"title":"Evaluation of Serological Tests on Different Disease Stages of Leptospirosis Infection in Humans","link":"https://www.preprints.org/manuscript/202410.1223/v1","date":1729040068000,"content":"Background/Objectives: Leptospirosis is a globally distributed zoonosis with symptomatology similar to other febrile syndromes in tropical countries, making clinical diagnosis difficult. This study aimed to analyze the performance and agreement between serological diagnostic tests for the detection of acute and convalescent human leptospirosis compared to the micro agglutination test (MAT) in an endemic region of the Colombian Caribbean. Methods: A prospective descriptive study was conducted on 275 patients with suspected leptospirosis. Paired serum samples were collected, and an epidemiological survey completed. Positive and negative predictive values, sensitivity, specificity, and kappa index were calculated using MAT as the gold standard. A Bayesian latent class model was used to compare the diagnostic tests. Results: In 223 paired serum samples, the sensitivity values for different stages of the disease varied between 10.8% to 54.1% in the acute and 6.1% to 66.7% in the convalescent phase when compared to MAT; and when using the Bayesian model 9.5% to 75.3% in the acute and 5.7% to 85.3% in the convalescent phase. The Kappa value, an indicator of agreement, was moderate for the IgM ELISA (0.553) in the acute phase, and substantial (0.692) in the convalescent phase. Conclusions: MAT was the best confirmatory test in both acute and convalescent phases. Despite the high specificity of ELISA, 21.62% of patients diagnosed as negative by IgM-ELISA in the acute and convalescent phases were confirmed as positive by MAT. It is necessary to re-evaluate diagnostic guidelines that do not employ MAT for confirmation, and to strengthen diagnostic and clinical identification of leptospirosis in healthcare institutions and public health laboratories, while providing a rapid and reliable test for its implementation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"24a984857d7813d33af15cdd4aa829ede3e47a29a6033ca7d0662216b303e5d8","category":"Interdisciplinary"}