{"title":"Kuo: Apple Could Spend $4.75 Billion on AI Servers in 2024","link":"https://www.macrumors.com/2023/10/23/apple-ai-server-spending-2024/","date":1698087388000,"content":"Apple is expected to spend several billion on hardware to support its artificial intelligence development in 2024, according to speculation from <a href=\"https://medium.com/@mingchikuo/how-much-does-apple-need-to-invest-annually-in-generative-ai-to-catch-up-with-the-competition-56e237ea3feb\">Apple analyst Ming-Chi Kuo</a>. Kuo expects Apple to spend \"at least\" $620 million on servers in 2023 and $4.75 billion on servers in 2024.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/03/hey-siri-banner-apple.jpg\" width=\"1200\" height=\"630\" />\r<br />\nApple could purchase between 2,000 and 3,000 servers this year, and up to 20,000 next year. Kuo thinks that Apple is purchasing servers equipped with Nvidia's HGX H100 8-GPU for generative AI training, with the company planning to upgrade to B100 next year. Nvidia calls its H100 an AI supercomputing platform, and each one is priced at around $250,000.\r<br />\n\r<br />\nKuo appears to be guessing at Apple's purchasing plans here, and he says that he expects Apple will use AI servers it is purchasing and installing itself to train large language models rather than virtual hosting from other cloud service providers for improved security and privacy. He does say that Apple could develop its own server chips to save on server costs, but he has seen no evidence that Apple is doing that at this time.\r<br />\n\r<br />\nWhile Apple appears to be making a major investment into AI, Apple's server purchasing will fall behind other companies like Meta and Microsoft. Apple will also need to invest in labor costs, infrastructure, and more, and Kuo suggests that Apple will need to spend several billion dollars annually to have a chance of catching up with competitors. Kuo claims that he is \"genuinely concerned\" about the future of Apple's generative AI business if Apple spends just a billion dollars a year as suggested by <a href=\"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/\"><em>Bloomberg</em>'s Mark Gurman</a>.\r<br />\n\r<br />\nOver the weekend, Gurman said that Apple is on track to spend $1 billion per year on its AI efforts. Gurman says that <a href=\"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/\">Apple is working on</a> a new, smarter version of <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> and is aiming to integrate AI into many Apple apps.<div>Tags: <a href=\"https://www.macrumors.com/guide/artificial-intelligence/\">Artificial Intelligence</a>, <a href=\"https://www.macrumors.com/guide/kuo/\">Kuo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/23/apple-ai-server-spending-2024/\">Kuo: Apple Could Spend $4.75 Billion on AI Servers in 2024</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/kuo-apple-could-spend-4-75-billion-on-ai-servers-in-2024.2408458/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"24abbcdc029591dd18bb86e704b88591a86e43ce61c52ab8686eca18ac1081c5","category":"Apple"}