{"title":"Winter training for cyclists: how to make this your best winter yet","link":"https://www.bikeradar.com/advice/fitness-and-training/how-to-plan-your-winter-training/","date":1632925800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/01/Road-cyclist-in-winter-ea7527b.jpg?quality=90&amp;resize=620,413\" />                                            <p><span>Winter is a tough time for cyclists. Reduced daylight hours, inclement weather and component-destroying conditions can all make it difficult to get into a rhythm</span><span> with your training.</span><span> </span></p>\n<p><span>Even so, it’s still possible to get around these limitations by putting together a well-thought-out, purposeful and time-efficient plan.</span></p>\n<p><span>Here are five steps to make the most of winter, so you can build a solid foundation of fitness for the year ahead.</span></p>\n<h2>1. Do some testing</h2>\n<p><span>The first step in embarking on any <a href=\"https://www.bikeradar.com/advice/fitness-and-training/the-5-key-areas-of-training-for-road-cyclists/\">cycling training</a> schedule is to understand where it is you’re starting from.</span></p>\n<p><span>By conducting some simple testing using the training tools you have available, you’re able to get a clear picture of where your fitness is right now.</span></p>\n<p><span>You can test your fitness using a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-choose-a-heart-rate-monitor/\">heart rate monitor</a> – however, for the ability to really target future fitness adaptations, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-train-with-power/\">training with a power meter</a> is recommended. We’ve got a round-up of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">best smart trainers</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">best power meters</a>, as tested by BikeRadar.</span></p>\n<p><span>Testing options include:</span></p>\n<ul><li>A <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\"><span>Functional Threshold Power</span></a><span> (FTP), 4DP or Functional Threshold Heart Rate</span> test</li>\n<li><span>A <a href=\"https://www.bikeradar.com/advice/fitness-and-training/critical-power/\">Critical Power</a> test, whereby you perform a number of maximal efforts to get a fuller picture of your power profile. Wahoo’s <a href=\"https://www.bikeradar.com/news/ftp-is-dead-the-sufferfest-claims-and-launches-4dp-training/\">4DP test</a> works in a similar way</span></li>\n<li><span>Blood lactate analysis and/or lab-based <a href=\"https://www.bikeradar.com/advice/fitness-and-training/vo2-max/\">VO2 max</a> testing, if you want to take a more scientific approach</span></li>\n</ul><p><span>Testing your current fitness will mean you’re able to establish appropriate <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zones</a>, helping you to target specific fitness improvements with much greater accuracy, as well as set benchmarks to measure your progress against later on.</span></p>\n<h2>2. Plan your goals and objectives</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Having a clear idea of your goals and objectives will give your training focus and structure.</span></figcaption><span> <i>Cn0ra / Getty Images</i></span></div>\n<p>The next step is to decide on your goals and objectives, in order to plan your training effectively. What do you want to achieve?</p>\n<p>These long-term goals can be fitness-related, performance-based, or a mixture of the two. A fitness-based goal, such as achieving a particular threshold power or VO2 max value, works well, as does a more performance-based goal, such as a time on a virtual Strava segment.</p>\n<p>Use the popular S.M.A.R.T approach to make them Specific, Measurable, Achievable, Relevant and Time-bound. This is really helpful when setting meaningful goals.</p>\n<p>Alongside these goals, you’ll also want to set appropriate short-term objectives to measure your progress along the way. For example, a target threshold power improvement by the halfway stage of your training if you’re building towards a hilly event.</p>\n<p>These objectives will help to ensure you’re constantly heading in the right direction.</p>\n<h2>3. Understand the purpose</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Make sure you understand the demands of the ride or race you’re preparing for.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p><span>As we’ve just alluded to, the fitness adaptations you’ll want to see will depend on what your goals are, as well as the demands of the ride or race you’re preparing for. </span></p>\n<p><span>For example, a mountainous sportive or race could make <a href=\"https://www.bikeradar.com/advice/fitness-and-training/power-to-weight-ratio/\">power-to-weight ratio</a> a key focus, while criterium or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cyclocross-what-it-is-and-how-to-get-into-it/\">cyclocross racing</a> puts a greater emphasis on short, repetitive and punchy efforts.</span></p>\n<p><span>However, most cyclists will want to focus on improving their aerobic capacity as a priority.</span></p>\n<p><span>As an endurance athlete, you want your aerobic energy system to be as strong as possible. This will allow you to ride at higher power outputs for longer without the anaerobic energy system (used for shorter, more explosive efforts) causing fatigue.</span></p>\n<p><span>It also offers greater potential for you to raise other key performance indicators, such as your anaerobic threshold (i.e. the point at which lactate begins to accumulate in the muscles and blood).</span><span> </span></p>\n<p><span>What’s more, you’ll also have a stronger foundation of base fitness to build on top of, when it’s appropriate to focus on improving your anaerobic energy production. That will be necessary for shorter, higher intensity efforts such as <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-improve-your-sprinting/\">sprinting</a> and making attacks.</span></p>\n<p><span>You can build your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/5-ways-to-improve-your-cycling-endurance/\">endurance</a> with lower intensity <a href=\"https://www.bikeradar.com/advice/fitness-and-training/base-training-cycling/\">base training</a> rides around zone two (using heart rate or power) or ‘muscular endurance’ blocks of perhaps 15 to 20 minutes each at lower cadences of around 60 to 80RPM.</span></p>\n<p><span><a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">Interval training</a> close to intensities that work on VO2 max (e.g. the popular 30 seconds on/15 seconds off workout) can also be effective, while <a href=\"https://www.bikeradar.com/advice/fitness-and-training/sweetspot-training/\">sweetspot training</a> is also popular for riders with limited time. </span><span>Sweetspot intervals take place at around 88-93% of your FTP, or approximately 75-85% of your maximum heart rate.</span></p>\n<h2>4. Schedule your workouts</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Using a training calendar will help you keep track of your workouts.</span></figcaption><span> <i>Wahoo Fitness</i></span></div>\n<p><span>Once you’ve set your long-term goals, short-term objectives and understood exactly what it is you’re striving for, the next step is to work backward and schedule the training sessions that will move you towards your desired outcome.</span></p>\n<p><span>What you’re looking for here is a wide variety of workouts that fulfil the purpose outlined above. This will keep your training interesting and motivating, and result in greater adaptations since the body responds better when it’s challenged in different ways.</span></p>\n<p><span>For structured workouts where you’re targeting specific training zones, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">indoor cycling apps</a> such as <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a>, <a href=\"https://www.bikeradar.com/reviews/training/training-software/trainerroad-training-software-review/\">Trainerroad</a> and <a href=\"https://www.bikeradar.com/news/wahoo-systm/\">Wahoo SYSTM</a> are ideal for getting high-quality sessions done in a very time-efficient manner. Many of these apps also offer tailor-made training plans for you to follow.</span></p>\n<p><span>Using <a href=\"https://www.bikeradar.com/advice/fitness-and-training/erg-mode/\">ERG mode</a> on a </span><span>smart trainer</span><span>, where the power is set at a prescribed output for your session (or the intervals within it), can really help with hitting the numbers necessary to achieve the desired improvements.</span></p>\n<p><span><a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">Indoor cycling</a> also means you avoid any interruptions from traffic – again allowing you to get the most out of every session.</span></p>\n<p><span>At the same time, variety and stimulation is important. One great tip is to have a dedicated <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-road-bikes/\">winter bike</a> that you’re happy to ride outdoors in bad conditions. </span></p>\n<p><span>Having the right equipment — including a cost-effective bike with <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mudguards-fenders-a-buyers-guide/\">mudguards</a> and puncture-resistant <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-road-bike-tyres/\">winter tyres</a> — can go a long way to keeping your motivation intact through winter.</span></p>\n<p><span>After all, you’re far more likely to get out onto the road or trail if you’re not too worried about wearing out expensive parts or having to meticulously <a href=\"https://www.bikeradar.com/features/clean-your-bike-in-7-simple-steps/\">clean your bike</a> after your ride.</span></p>\n<h2>5. Feedback and adjustments</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Smart trainer workouts are ideal for targeting specific fitness adaptations.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p><span>Finally, it’s important to constantly adjust your training as you go, based on how you’re responding to the workouts and how much time and energy you realistically have available. </span></p>\n<p><span>Making tweaks and iterations will help ensure you’re not leaving any fitness on the table – or worse, risk <a href=\"https://www.bikeradar.com/advice/fitness-and-training/overtraining-syndrome/\">overtraining</a> and burnout.</span><span> </span></p>\n<p><span>Busy riders often underestimate the impact of stress external to training (such as work and family pressures) and the extent to which they can negatively affect athletic performance, so always stay on the conservative side and don’t be too wedded to what you originally planned at the outset.</span></p>\n<p><span>In addition, leaving feedback on your key workouts, whether in a diary or as comments on your <a href=\"https://www.bikeradar.com/features/routes-and-rides/strava-tips-20-of-the-best/\">Strava</a> file, will help you to avoid making the same mistakes in the future. It will also guide you towards the right training approach to take further down the line.</span></p>","author":"Tom Bell","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"24b03cbf3296e83b99337d0fd09786cae616ce5f727f25041727e831b7390219","category":"Cycling"}