{"title":"Apple Could Face Investigation in India Over App Store In-App Purchase System","link":"https://www.macrumors.com/2021/09/02/apple-possible-investigation-india-app-store/","date":1630571110000,"content":"Apple could be facing a widespread investigation into the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> in India, and more specifically, the company's in-app purchasing system, which grants it a 15% to 30% commission for all purchases made, reports <em><a href=\"https://www.reuters.com/technology/exclusive-apple-hit-with-antitrust-case-india-over-in-app-payments-issues-2021-09-02/\">Reuters</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/app-store-blue-banner.jpg\" />\r\n<br />\r\nThe Competition Commission of India (CCI), which oversees cases of possible anti-competitive and antitrust behavior, is reviewing an antitrust challenge case against Apple presented by a non-profit Indian group. The group claims, in their case, that Apple's standard 30% commission for in-app purchases \"hurts competition\" since it raises costs for both the developer and the customer. \r\n<br />\r\n<blockquote>\"The existence of the 30% commission means that some app developers will never make it to the market ... This could also result in consumer harm,\" said the filing, which has been seen by Reuters.</blockquote>Apple has already faced countless similar cases worldwide, including in the European Union and by developer groups in the United States. In its current stage, the case is not prompting a more exhaustive investigation by the Indian government. Instead, <em>Reuters</em> says that it will be reviewed by the CCI in the coming weeks, possibly leading to a probe. \r\n<br />\r\n\r\n<br />\r\nThe group behind the case is ultimately asking for Apple to allow third-party payment methods into its app, allowing developers to bypass its 15% to 30% commission. The new case was reported just hours after Apple announced that, beginning sometime next year, it will allow \"reader\" apps to <a href=\"https://www.macrumors.com/2021/09/01/apple-reader-app-changes-japan-ftc/\">link users to external websites for purchases</a>. \r\n<br />\r\n\r\n<br />\r\nThe new policy change is the second of just the past few weeks. Last week, Apple conceded to <a href=\"https://www.macrumors.com/2021/08/26/app-store-changes-developer-lawsuit-settlement/\">allow developers to email users about payment methods</a> available outside of their apps. However, the new changes stop short of not requiring developers to use the company's proprietary in-app purchasing system and instead allows them to just add a clearly distinguished link to an external website for payment. <div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/india/\">India</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/02/apple-possible-investigation-india-app-store/\">Apple Could Face Investigation in India Over App Store In-App Purchase System</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-could-face-investigation-in-india-over-app-store-in-app-purchase-system.2309492/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=-4e5otbc85k:Zkx22I6tQ7g:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=-4e5otbc85k:Zkx22I6tQ7g:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/-4e5otbc85k\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"24b9dda5fdaa09b24f95016abd153cea4eec90e2b85c62a9a8b24e88032b3d7f","category":"Apple"}