{"title":"Grass leaf structural and stomatal trait responses to climate gradients assessed over the 20th century and across the Great Plains, USA","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae055/7776988?rss=1","date":1727308800000,"content":"<span><div>Abstract</div><strong>Abstract</strong>. Using herbarium specimens spanning 133 years and field-collected measurements, we assessed intraspecific trait (leaf structural and stomatal) variability from grass species in the Great Plains of North America. We focused on two widespread, closely related grasses from the tribe Paniceae: <span>Dichanthelium oligosanthes</span> subsp. <span>scribnerianum</span> (C<sub>3</sub>) and <span>Panicum virgatum</span> (C<sub>4</sub>). Thirty-one specimens per taxon were sampled from local herbaria from the years 1887 to 2013 to assess trait responses across time to changes in atmospheric [CO<sub>2</sub>] and growing season precipitation and temperature. In 2021 and 2022, the species were measured from eight grasslands sites to explore how traits vary spatially across natural continental precipitation and temperature gradients.Δ<sup>13</sup>C increased with atmospheric [CO<sub>2</sub>] for <span>D</span>. <span>oligosanthes</span> but decreased for <span>P</span>. <span>virgatum</span>, likely linked to increases in precipitation in the study region over the past century. Notably, this is the first record of decreasing Δ<sup>13</sup>C over time for a C<sub>4</sub> species illustrating <sup>13</sup>C linkages to climate. As atmospheric [CO<sub>2</sub>] increased, C:N increased and δ<sup>15</sup>N decreased for both species and %N decreased for <span>D</span>. <span>oligosanthes</span>. Across a large precipitation gradient, <span>D</span>. <span>oligosanthes</span> leaf traits were more responsive to changes in precipitation than those of <span>P</span>. <span>virgatum</span>. In contrast, only two traits of <span>P</span>. <span>virgatum</span> responded to increases in temperature across a gradient: specific leaf area (increase) and leaf dry matter content (decrease). The only shared significant trend between species was increased C:N with precipitation. Our work demonstrates that these closely related grass species with different photosynthetic pathways exhibited various trait responses across temporal and spatial scales, illustrating the key role of scale of inquiry for forecasting leaf trait responses to future environmental change.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"24c8ccba9a0ebdb3071bbb33632d4ce5ef6ed39d0a5002b31730bef45322d23e","category":"Environment"}