{"title":"Screening instruments of cognition: The relation of the mini-mental state examination to the Edinburgh cognitive and behavioural ALS screen in amyotrophic lateral sclerosis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304593","date":1718892000000,"content":"<p>by Angela Serian, Julia Finsel, Albert C. Ludolph, Ingo Uttner, Dorothée Lulé</p>\r\nObjective <p>The Edinburgh Cognitive and Behavioural ALS Screen (ECAS) is an established cognitive screening instrument for patients with amyotrophic lateral sclerosis (ALS). Different from tools like the Mini-Mental State Examination (MMSE), it is adjusted for motor impairment, yet, the latter remains one of the most widely used screening instruments, also in ALS studies. Thus, it is of utmost importance to relate outcome scores of both instruments to allow for comparison in ALS patients. This study reports on the performance of ALS patients in both tests with regard to incidence and degree of cognitive impairment, and the correspondence of both, ECAS and MMSE scores.</p> Methods <p>We examined N = 84 ALS patients with the German versions of the ECAS and the MMSE. Performance in both tests regarding incidence and degree of cognitive impairment, and correspondence of frequency of cognitive impairment according to both tests was examined. The relationship between ECAS and MMSE scores was modelled with a non-linear regression model.</p> Results <p>All ALS patients were able to complete the ECAS, 89.3% (N = 75) were capable to complete the MMSE. Prevalence of cognitive impairment was in both tests 22.7%, however agreement was only 52.9%. Despite, regression analyses yielded a strong positive relationship (adjusted R<sup>2</sup> = .68) between the ECAS total score and the MMSE total score. Both tests were able to identify all patients with dementia.</p> Conclusion <p>These results suggest that the MMSE is not ideal for cognitive screening in early-stage ALS patients. However, a rough translation of MMSE scores in ECAS scores is possible to estimate the cognitive performance level of patients, with the ECAS being more discriminative in the lower range of cognitive dysfunction (ECAS score: 80–136), for which the MMSE does not define cognitive impairment (corresponding MMSE score: 27–30).</p>","author":"Angela Serian","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"24caff776e308df1c05896893436e46b38c86876cbfd67c8420d6e6bd48b7554","category":"Interdisciplinary"}