{"title":"Apple Releases watchOS 10 With Widget-Focused Interface, New Watch Faces and More","link":"https://www.macrumors.com/2023/09/18/apple-releases-watchos-10/","date":1695056593000,"content":"Apple today released <a href=\"https://www.macrumors.com/roundup/watchos-10/\">watchOS 10</a>, the newest version of the watchOS operating system designed to run on the Apple Watch. ‌watchOS 10‌ is compatible with the Apple Watch Series 4 and later.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\n‌watchOS 10‌ can be downloaded for free through the Apple Watch app on an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> running <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> by opening it up and going to General &gt; Software Update. To install the new software, the Apple Watch needs to have at least 50 percent battery and it needs to be placed on a charger.\r<br />\n\r<br />\nWith ‌watchOS 10‌, Apple overhauled the Apple Watch interface with a renewed focus on widgets. Turning the Digital Crown now brings up the widget Smart Stack, which displays the information that you need most, and it changes throughout the day. The Control Center is now activated with the side button rather than a swipe.\r<br />\n\r<br />\nApple's built-in apps have been simplified with an information-forward design that developers will also be adopting. Maps, Messages, Activity, Heart, Home, and more have been revamped. There are two new watch faces, including the colorful Palette face and the Snoopy face featuring characters from the popular cartoon.\r<br />\n\r<br />\nThere are updated Activity integrations for cyclists, as well as location features in the Compass app for hikers. The <a href=\"https://www.macrumors.com/guide/apple-maps/\">Apple Maps</a> app now shows topography, hiking trails, and points of interest, and there's a new mood tracking feature that can be accessed in the Mindfulness app. Apple's full release notes for the update are below.<blockquote>watchOS 10 is the biggest update since the introduction of Apple Watch, and brings a fresh look for virtually every app, new ways to navigate, and a new Smart Stack to display the information you need, right when you need it, from any watch face. It introduces enhanced capabilities for cycling workouts and hiking, a new mental health experience in the Mindfulness app to reflect on your state of mind, and the ability to track the time you spend in daylight.\r<br />\n\r<br />\n<strong>Experience</strong>\r<br />\n- Use redesigned apps that utilize the rounded corners and full surface area of the display\r<br />\n- View timely information that is adaptive to context like time of day and location with the Smart Stack by turning the Digital Crown from any watch face\r<br />\n- Access the Control Center by clicking the side button\r<br />\n- Push Digital Crown once to access all apps and twice to access recently used apps\r<br />\n\r<br />\n<strong>Watch Faces</strong>\r<br />\n- Snoopy features over 100 different animations with Snoopy and Woodstock that respond to the time of day, local weather, and activity such as workout\r<br />\n- Palette depicts time as color using three distinct overlapping layers that shift as time goes by\r<br />\n- Solar Analog features classic hour marks on a luminous dial with light and shadow that shift throughout the day in response to the position of the sun\r<br />\n- Modular Ultra utilizes the edges of the display for real time data through three user selectable options and seven different complications (Available on Apple Watch Ultra)\r<br />\n\r<br />\n<strong>Messages</strong>\r<br />\n- View Memoji or photos of contacts\r<br />\n- Pin favorites\r<br />\n- Edit, Undo Send, and sort by unread\r<br />\n\r<br />\n<strong>Workout</strong>\r<br />\n- Cycling Workouts now support Bluetooth-enabled sensors like power meters, speed sensors, and cadence sensors with new power and cadence metrics\r<br />\n- Cycling Power view displays your power output during your workout, measured in watts\r<br />\n- Power Zone view uses Functional Threshold Power, which measures the highest power you can maintain for a 60 minute session, to create personalized zones and shows time spent in each zone\r<br />\n- Cycling Speed view shows current and max speed, distance, heart rate, and/or power\r<br />\n- Cycle metrics, workout views, and cycling experiences from your Apple Watch can now appear as a Live Activity on iPhone, which can be mounted to the handlebar of your bike\r<br />\n\r<br />\n<strong>Activity</strong>\r<br />\n- Icons in the corners provide quick access to Weekly Summary, Sharing, and awards\r<br />\n- Move, Exercise, and Stand Rings are visible on individual screens by scrolling the Digital Crown along with the ability to adjust goals, view steps, distance, flights climbed, and activity history\r<br />\n- Weekly Summary now includes Exercise and Stand totals in addition to the Move total\r<br />\n- Activity Sharing shows photos or avatars of your friends\r<br />\n- Trainer Tips from the expert trainers at Fitness+ provide guidance on areas like workout techniques, mindfulness, healthy habits, and staying motivated in the Fitness app on iPhone\r<br />\n\r<br />\n<strong>Fitness+</strong>\r<br />\n- Create a workout and meditation schedule with Custom Plans\r<br />\n- Choose your selected activity days, workout durations and types, trainers, music, and plan length and Fitness+ will automatically create the plan\r<br />\n- Build a queue of workouts and meditations that you want to do in a row with Stacks\r<br />\n\r<br />\n<strong>Compass</strong>\r<br />\n- Last Cellular Connection Waypoint automatically estimates the last location on your route where your device was able to connect to your carrier's network\r<br />\n- Last Emergency Call Waypoint automatically estimates the last location available for you to connect to any carrier's network to contact emergency services\r<br />\n- POI Waypoints display points of interests you have saved in Guides within Maps\r<br />\n- Waypoint Elevation is a new view that uses data from the altimeter to create a 3D representation of the elevation of your saved waypoints\r<br />\n- Elevation Alerts notify you when you have passed a particular elevation threshold\r<br />\n\r<br />\n<strong>Maps</strong>\r<br />\n- Walking radius shows roughly how long it might take to walk to nearby restaurants, shops, or other points of interests with rich information for places like hours, ratings, and more\r<br />\n- Offline Maps downloaded on your iPhone can be viewed on your paired Apple Watch when your iPhone is on and within range\r<br />\n- Routes for driving, cycling, walking or taking public transit are supported in offline maps including estimated arrival time based on predicted traffic\r<br />\n- Topographic maps display features in national and regional parks in the US like trails, contour lines, elevation, and points of interest\r<br />\n- Hiking trail information in the US with detailed information like trail length and elevation information\r<br />\n\r<br />\n<strong>Weather</strong>\r<br />\n- See weather information quickly with background and contextual visual effects\r<br />\n- Access important information like Ultraviolet Index, Air Quality Index, and Wind Speed in one view\r<br />\n- View data like Condition, Temperature, Precipitation, Wind Speed, UVI, Visibility, Humidity, and AQI by swiping right\r<br />\n- Scroll to see Hourly and Daily views\r<br />\n- View Humidity complication on your watch face\r<br />\n\r<br />\n<strong>Mindfulness</strong>\r<br />\n- State of Mind reflection allows you to log your momentary emotion or daily mood\r<br />\n- Contributing factors such as work, family, and current events can be included, and you can describe your feeling, such as joyful, content, and worried\r<br />\n- Reminders to log your State of Mind are available through notifications, watch complications, and prompts following a breathe session, reflect session, or audio meditation from Fitness+\r<br />\n\r<br />\n<strong>Medications</strong>\r<br />\n- Follow-up reminders notify you to log a medication if you haven't logged one 30 minutes after the scheduled time\r<br />\n- Option to set follow-up reminders as critical alerts so they can be seen even if your device is muted or you have a Focus enabled\r<br />\n\r<br />\n<strong>Other features and improvements:</strong>\r<br />\n- Time in Daylight now measured using the ambient light sensor (Available on Apple Watch SE, Apple Watch Series 6 and later, and Apple Watch Ultra)\r<br />\n- Grid Forecast in Home app and watch face complication use live data from your local electric grid to show when it's running on cleaner sources so you can plan when to charge devices or run appliances (Contiguous US only)\r<br />\n- Communication Safety now detects if kids are sending or receiving sensitive videos\r<br />\n- Sensitive Content Warning for adults brings Communication Safety technology to all users by blurring photos and videos containing nudity, and allowing you to choose if you want to see them\r<br />\n- Notifications to emergency contacts after an Emergency SOS call will be delivered as critical alerts\r<br />\n- Group FaceTime audio calls are now supported</blockquote>Several of the ‌watchOS 10‌ features will be delayed until later this year, including the NameDrop option for exchanging contact information from watch to watch or watch to ‌iPhone‌, Audio Focus for Fitness+ to prioritize trainer voice or music, and media suggestions for the Smart Stack if nothing is playing on a <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> near an Apple Watch.\r<br />\n\r<br />\nMore detail on all of the new features in ‌watchOS 10‌ can be <a href=\"https://www.macrumors.com/roundup/watchos-10/\">found in our watchOS 10 roundup</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2023/09/18/apple-releases-watchos-10/\">Apple Releases watchOS 10 With Widget-Focused Interface, New Watch Faces and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-watchos-10-with-widget-focused-interface-new-watch-faces-and-more.2403032/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"24d598c171570c254df6378bdcb7b6d0c7cd1d737803ab3007bccab931fe109f","category":"Apple"}