{"title":"Equity in the geographical distribution of general practitioners in Iran","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003609","date":1727186400000,"content":"<p>by Farahnaz Khajehnasiri, Ali Mohammad Mosadeghrad, Mohammad Hossein Alibeiginejad</p>\r\nBackground <p>The equitable distribution of workforce is imperative for achieving public health goals. This study was conducted to evaluate the equity of the distribution of general practitioners (GPs) in Iran.</p> Methods <p>In this descriptive and cross-sectional study, data from the Information System of Benefits for Iranians and the Iranian Statistics Center were utilized. The study population encompasses all GPs operating in Iran in 2022. To assess equity in the geographical distribution of physicians, the Gini coefficient and Lorenz curve were calculated using Excel software. Additionally, ArcGIS software was used to create a distribution map.</p> Results <p>The population of Iran and active GPs in 2022 were 85,874,000 and 67,852 respectively, resulting in an average of 7.9 active GPs per 10,000 people. The provinces of Yazd, Tehran, Mazandaran, and Fars exhibited the highest concentration of active GPs per capita, collectively representing more than 28% of the population and 37% of the active GPs. Fifty percent of the active GPs were women. The Gini coefficients for the provincial and intercity distributions of GPs were 0.08 and 0.2, respectively.</p> Conclusion <p>The distribution of GPs among provinces and cities was deemed fair and relatively fair, respectively. Iran has a lower ratio of GPs per capita than the European nations. Policymakers should pay more attention to the implementation of appropriate policies with the aim of increasing equity in the geographical distribution of GPs in the country.</p>","author":"Farahnaz Khajehnasiri","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"24d7c3a6884172f707833b91e20cb2ad7195162c21760e550d9e865404be3a61","category":"Environment"}