{"title":"The impact of microplastics polystyrene on the microscopic structure of mouse intestine, tight junction genes and gut microbiota","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304686","date":1717596000000,"content":"<p>by Qi-Ling Su, Jiang Wu, Shao-Wen Tan, Xiao-Yun Guo, Ding-Zhe Zou, Kai Kang</p>\r\n\r\nMicroplastics, which are tiny plastic particles less than 5 mm in diameter, are widely present in the environment, have become a serious threat to aquatic life and human health, potentially causing ecosystem disorders and health problems. The present study aimed to investigate the effects of microplastics, specifically microplastics-polystyrene (MPs-PS), on the structural integrity, gene expression related to tight junctions, and gut microbiota in mice. A total of 24 Kunming mice aged 30 days were randomly assigned into four groups: control male (CM), control female (CF), PS-exposed male (PSM), and PS-exposed female (PSF)(n = 6). There were significant differences in villus height, width, intestinal surface area, and villus height to crypt depth ratio (V/C) between the PS group and the control group(C) (p &lt;0.05). Gene expression analysis demonstrated the downregulation of <i>Claudin-1</i>, <i>Claudin-2</i>, <i>Claudin-15</i>, <i>and Occludin</i>, in both duodenum and jejunum of the PS group (p &lt; 0.05). Analysis of microbial species using 16S rRNA sequencing indicated decreased diversity in the PSF group, as well as reduced diversity in the PSM group at various taxonomic levels. Beta diversity analysis showed a significant difference in gut microbiota distribution between the PS-exposed and C groups (R2 = 0.113, p&lt;0.01), with this difference being more pronounced among females exposed to MPs-PS. KEGG analysis revealed enrichment of differential microbiota mainly involved in seven signaling pathways, such as nucleotide metabolism(p&lt;0.05). The relative abundance ratio of transcriptional pathways was significantly increased for the PSF group (p&lt;0.01), while excretory system pathways were for PSM group(p&lt;0.05). Overall findings suggest that MPs-PS exhibit a notable sex-dependent impact on mouse gut microbiota, with a stronger effect observed among females; reduced expression of tight junction genes may be associated with dysbiosis, particularly elevated levels of <i>Prevotellaceae</i>.","author":"Qi-Ling Su","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"24d8cfb89aa0c0731f447c9860cd04a1893ea84047af30036a4688cf28d16291","category":"Interdisciplinary"}