{"title":"Utilizing ISSRseq genotyping to assist growth selection in tomato grouper (Cephalopholis sonnerati) without broodstock information","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13035?af=R","date":1712550638000,"content":"<h2>Abstract</h2>\n<p>Growth selection in fish is essential for aquaculture; however, long generation times and artificial breeding limitations present challenges for breeding endeavors. The tomato grouper (<i>Cephalopholis sonnerati</i>) is an emerging aquaculture species with a generation cycle of at least 5 to 10 years. Mixed culture of broodstocks and natural mating are commonly employed in hatcheries. To expedite the selection process for tomato grouper, we utilized ISSRseq technology for assisted future growth selection. After 6 months of rearing, we selected 48 individuals, including 24 fast-growing and 24 slow-growing individuals (representing the top and bottom 10% of samples). These samples produced 932 SNPs. Although specific broodstock pairing information is unavailable, our results suggest that these fry likely originated from multiple broodstock exhibiting considerable diversity. Further analysis of genetic relationships among individuals revealed three main clades. One clade contained a higher proportion of faster-growing individuals (80%), while another featured a lower proportion of rapidly growing individuals (28.6%). Through the relatedness network and further exclusion of individuals, the faster-growth clade comprised 92.3% of fast-growing individuals. The faster-growth clade is appropriate for further development into a high-growth strain. Our findings demonstrate that molecular markers can advance population selective breeding to family selection in aquaculture breeding research.</p>","author":"Te‐Hua Hsu, \nPei‐Yun Chu, \nHong‐Yi Gong, \nFan‐Hua Nan, \nChang‐Wen Huang","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"24de5a5df5f5b65f42ba1b4c3b1e2de698e128edb4d83b2e87c7ff4bbcc9cc13","category":"Environment"}