{"title":"Here's What's New for CarPlay on iOS 17 Ahead of Next-Generation CarPlay Later This Year","link":"https://www.macrumors.com/2023/06/07/carplay-new-features-on-ios-17/","date":1686165897000,"content":"CarPlay didn't receive much attention during the WWDC keynote, but the iPhone-based software platform did receive a few new features with iOS 17, including SharePlay support in the Music app and real-time electric vehicle charging station availability.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/CarPlay-SharePlay.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nSharePlay support in the Music app allows all passengers in a car to control what music is playing from their own devices, even if they do not have an Apple Music subscription. The primary user can initiate a SharePlay session from CarPlay.\r<br />\n\r<br />\nApple Maps now provides electric vehicle drivers with real-time charging availability information for their preferred charging network, and this feature extends to the Maps app on CarPlay, making it easy to find an available charging location while driving.\r<br />\n\r<br />\nThe new CarPlay features are automatically available after updating an iPhone to iOS 17. The software update will be released to the public later this year for the iPhone XS and newer, and it is currently available in beta for developers.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/06/next-generation-carplay-multi-display.jpg\" alt width=\"1960\" height=\"1102\" />\r<br />\nThe wait continues for the <a href=\"https://www.macrumors.com/2023/03/10/next-gen-apple-carplay-features/\">next generation of CarPlay</a> that Apple announced at WWDC 2022. Apple said the first vehicles with next-generation CarPlay support would be announced in late 2023, so more details should be provided in the coming months. New features previewed last year included integration with a vehicle's instrument cluster and climate controls, support for multiple displays, a built-in FM radio app, widgets, and more.\r<br />\n\r<br />\nApple said automakers committed to offering the next generation of CarPlay in future vehicles included Acura, Audi, Ford, Honda, Infiniti, Jaguar, Land Rover, Lincoln, Mercedes-Benz, Nissan, Polestar, Porsche, Renault, and Volvo.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/homepod-homekit-carplay-home-auto-technology.193\">HomePod, HomeKit, CarPlay, Home &amp; Auto Technology</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/07/carplay-new-features-on-ios-17/\">Here's What's New for CarPlay on iOS 17 Ahead of Next-Generation CarPlay Later This Year</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/heres-whats-new-for-carplay-on-ios-17-ahead-of-next-generation-carplay-later-this-year.2392110/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"24fbf7a1cbd8f864e5da3ac08ed12d2b4776e965b0766d78d00317315f9b51e6","category":"Apple"}