{"title":"Self-Perceived Health, Mood, and Substance Use Among Adolescents: An Analysis to Enhance Family, Community, and Mental Health Care","link":"https://www.preprints.org/manuscript/202409.1626/v1","date":1726842098000,"content":"Adolescence is a critical period for the development of self-perception, emotional well-being, and health-related behaviors. During this stage, adolescents undergo significant physical, emotional, and social changes that influence their overall health and interactions with their environment. This study analyzes the prevalence of behaviors related to self-perceived health, mood, and substance use among adolescents, identifies risk factors, and draws comparisons between different groups. It also examines how these factors interact with family and community dynamics to inform strategies for improving mental health care. Method: A descriptive cross-sectional study using questionnaires was conducted. Participants were adolescents aged 14 to 18 years from a school in the Baix Llobregat province of Catalonia. Descriptive and bivariate statistical analyses were performed using the chi-square test and p-value calculations with R Project software. Frequency and percentage analyses were employed to describe the health behaviors and emotional states of the participants. Results: The study reveals significant variations in adolescents' self-perceived health, emotional management, and substance use patterns. Adolescents with lower self-perceived health and negative mood states tend to exhibit higher rates of substance use, particularly alcohol and tobacco. Gender differences were observed, with girls generally reporting better health awareness and emotional regulation compared to boys. Conclusions: This study highlights the need for integrated approaches to family, community, and mental health care. Findings emphasize the importance of early intervention programs addressing emotional well-being and substance use in a holistic manner. Public health policies should prioritize comprehensive strategies involving schools, families, and communities to foster healthier behaviors and improve adolescent mental health outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"250da20c5b41df53f66f3b592c5e450c3e095eb8aeb3c2bee6a763ca52fb8387","category":"Interdisciplinary"}