{"title":"The U-box E3 ubiquitin ligase PUB35 negatively regulates ABA signaling through AFP1-mediated degradation of ABI5","link":"https://academic.oup.com/plcell/article/36/9/3277/7699767?rss=1","date":1719360000000,"content":"<span><div>Abstract</div>Abscisic acid (ABA) signaling is crucial for plant responses to various abiotic stresses. The Arabidopsis (<span>Arabidopsis thaliana</span>) transcription factor ABA INSENSITIVE 5 (ABI5) is a central regulator of ABA signaling. ABI5 BINDING PROTEIN 1 (AFP1) interacts with ABI5 and facilitates its 26S-proteasome-mediated degradation, although the detailed mechanism has remained unclear. Here, we report that an ABA-responsive U-box E3 ubiquitin ligase, PLANT U-BOX 35 (PUB35), physically interacts with AFP1 and ABI5. PUB35 directly ubiquitinated ABI5 in a bacterially reconstituted ubiquitination system and promoted ABI5 protein degradation in vivo. ABI5 degradation was enhanced by AFP1 in response to ABA treatment. Phosphorylation of the T201 and T206 residues in ABI5 disrupted the ABI5–AFP1 interaction and affected the ABI5–PUB35 interaction and PUB35-mediated degradation of ABI5 in vivo. Genetic analysis of seed germination and seedling growth showed that <span>pub35</span> mutants were hypersensitive to ABA as well as to salinity and osmotic stresses, whereas <span>PUB35</span> overexpression lines were hyposensitive. Moreover, <span>abi5</span> was epistatic to <span>pub35</span>, whereas the <span>pub35-2 afp1-1</span> double mutant showed a similar ABA response to the two single mutants. Together, our results reveal a PUB35–AFP1 module involved in fine-tuning ABA signaling through ubiquitination and 26S-proteasome-mediated degradation of ABI5 during seed germination and seedling growth.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"2510d6286120966f539f7dee0dc8673cb752d7cae0b7c155d310ea6d0e87f8d4","category":"Environment"}