{"title":"Sex chromosome turnover plays an important role in the maintenance of barriers to post-speciation introgression in willows","link":"https://academic.oup.com/evlett/article/8/4/467/7636794?rss=1","date":1711584000000,"content":"<span><div>Abstract</div>Almost all species in the genus <span>Salix</span> (willow) are dioecious and willows have variable sex-determining systems, the role of this variation in maintaining species barriers is relatively untested. We first analyzed the sex determination systems (SDS) of two species, <span>Salix cardiophylla</span> and <span>Salix interior</span>, whose positions in the <span>Salix</span> phylogeny make them important for understanding a sex chromosome turnover that has been detected in their relatives, and that changed the system from male (XX/XY) to female (ZW/ZZ) heterogamety. We show that both species have male heterogamety, with sex-linked regions (SLRs) on chromosome 15 (termed a 15XY system). The SLRs occupy 21.3% and 22.8% of the entire reference chromosome, respectively. By constructing phylogenetic trees, we determined the phylogenetic positions of all the species with known SDSs. Reconstruction of ancestral SDS character states revealed that the 15XY system is likely the ancestral state in willows. Turnovers of 15XY to 15ZW and 15XY to 7XY likely contributed to early speciation in <span>Salix</span> and gave rise to major groups of the <span>Vetrix</span> and <span>Salix</span> clades. Finally, we tested introgression among species in the phylogenetic trees based on both autosomes and SLRs separately. Frequent introgression was observed among species with 15XY, 15ZW, and 7XY on autosomes, in contrast to the SLR datasets, which showed less introgression, and in particular no gene flow between 15ZW and 7XY species. We argue that, although SDS turnovers in willow speciation may not create complete reproductive barriers, the evolution of SLRs plays important roles in preventing introgression and maintaining species boundaries.</span>","author":"","siteTitle":"Evolution Letters Current Issue","siteHash":"ccc44437a8276654c44dddd156a8ce3b5dae5730f1c2406ed04aa90599bdf071","entryHash":"25112f757507a6744cbd7be3988f29c8d31e6cd6fa38b8308aa21f6cce94da10","category":"Environment"}