{"title":"Empirical and simulation data reveal a lack of avoidance of wind turbines by Gyps fulvus (Griffon Vulture)","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duae019/7754267?rss=1","date":1716336000000,"content":"<span><div>Abstract</div>The increase of wind turbine installations to limit climate change may affect bird populations because of collisions with rotor blades. Birds may respond to wind turbine presence along a gradient of behavioral changes: avoiding the wind farm (macro-scale) or the wind turbines either by anticipating wind turbine locations (meso-scale) or engaging in last-minute flee attempts (micro-scale). We investigated flight responses of 25 adult <span>Gyps fulvus</span> (Griffon Vulture) equipped with GPS tags over 3 years in an area that included 10 wind farms in Causses, France. At the macro-scale, foraging range and habitat use revealed that <span>G. fulvus</span> did not avoid wind farms. To investigate avoidance at meso- and micro-scales, we focused on the 4 most visited wind farms. We compared vulture flights to null movement models, which allowed us to keep the correlation between flights and topography while creating movement independent of wind turbine locations. At most sites, <span>G. fulvus</span> did not show avoidance behavior. Overall, our results suggest wind farm-specific responses by soaring birds as a function of landscape topography. Thus, to reduce collision risks, stakeholders should first avoid constructing wind farms close to vulture nesting colonies. When siting, developers should investigate <span>G. fulvus</span> use of local topography to avoid areas in which birds are likely to travel. Finally, managers must prioritize the detection of species not able to avoid turbines when designing preventive measures, such as switching off on-demand technologies.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"2519d0d75b6781aba4d013eacf62010b9397bac7b26700602d576feaa436c7cf","category":"Environment"}