{"title":"Enhancing Smart City Connectivity: a Multi-Metric CNN-LSTM beamforming based Approach to Optimize Dynamic Source Routing in 6G Networks for MANETs and VANETs","link":"https://www.preprints.org/manuscript/202407.1161/v1","date":1721036033000,"content":"The advent of Sixth Generation (6G) wireless technologies introduces challenges and opportunities for Mobile Ad Hoc Networks (MANETs) and Vehicular Ad Hoc Networks (VANETs), necessitating a reevaluation of traditional routing protocols. This paper introduces the Multi-Metric Scoring Dynamic Source Routing (MMS-DSR), a novel enhancement of the Dynamic Source Routing (DSR) protocol, designed to meet the demands of 6G-enabled MANETs and the dynamic environments of VANETs. MMS-DSR integrates advanced technologies and methodologies to enhance routing performance in dynamic scenarios. Key among these is the use of a CNN-LSTM based beamforming algorithm, which optimizes beamforming vectors dynamically, exploiting spatial-temporal variations characteristic of 6G channels. This enables MMS-DSR to adapt beam directions in real-time based on evolving network conditions, improving link reliability and throughput. Furthermore, MMS-DSR incorporates a multi-metric scoring mechanism that evaluates routes based on multiple QoS parameters, including latency, bandwidth, and reliability, enhanced by the capabilities of Massive MIMO and the IEEE 802.11ax standard. This ensures route selection is context-aware and adaptive to changing dynamics, making it effective in urban settings where vehicular and mobile nodes coexist. Additionally, the protocol uses machine learning techniques to predict future route performance, enabling proactive adjustments in routing decisions. The integration of dynamic beamforming and machine learning allows MMS-DSR to effectively handle the high mobility and variability of 6G networks, offering a robust solution for future wireless communications, particularly in smart cities.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"252784726414a69079e30f5a092a366e04349dc32c4ee2b36b2f8c97ebf48f72","category":"Interdisciplinary"}