{"title":"Early-Stage Mapping of Winter Canola by Combining Sentinel-1 and Sentinel-2 Data in Jianghan Plain China","link":"https://www.preprints.org/manuscript/202406.0464/v1","date":1717740620000,"content":"Early and accurate mapping of winter canola planting areas provides critical support for sustainable cropland management. Although some methods have been proposed to map the winter canola at the flowering or later stage, mapping winter canola planting areas at the early stage is still challenging, due to the insufficient understanding of the multi-source remote sensing features sensitive for winter canola mapping. This study proposed an early-stage winter canola area mapping method by using the combination of optical and synthetic aperture radar (SAR) data. We analyzed the spectral features, backscatter coefficients, and textural features of winter canola based on Sentinel-2 and Sentinel-1 images. Random forest (RF) and Support Vector Machine (SVM) classification models were built to map winter canola based on early-stage images and field samples in 2017 and then apply the best model to corresponding satellite data in 2018-2022. Results showed that: (1) The red edge and near-infrared-related spectral features were most important for the mapping of early-stage winter canola, followed by VV, DVI and GOSAVI, which also showed greater differences than the other features; (2) Based on Sentinel-1 and Sentinel-2 data, winter canola could be earliest mapped around 130 days prior to ripening (i.e., early overwinter stage) with the F-score over 0.85 and the OA over 81%; (3) Adding Sentinel-1 could improve the OA by about 2%-4% and the F-score by about 1% -2% in winter canola mapping. (4) The F-score of winter canola mapping based on the classifier transfer approach in 2018-2022 varied between 0.75 and 0.97, and the OA ranged from 79% to 86%. This study demonstrates the potential of early-stage winter canola mapping using the combination of Sentinel-2 and Sentinel-1 images, which could provide valuable and timely information for stakeholders and decision makers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"252b7b8c02cc9f70ae8fada7b26dc64e7902618233a3ed7671224226deae6c0a","category":"Interdisciplinary"}