{"title":"Behind the Scenes in Private Facebook Groups for America Special Forces Vets","link":"https://www.nbcnews.com/news/military/secret-facebook-groups-america-s-best-warriors-share-racist-jabs-n1263985","date":1618756681000,"content":"\n<p>Carol E. Lee, reporting for NBC News:</p>\n\n<blockquote>\n  <p>They’re the most elite, lethally trained members of the U.S.\nmilitary, widely considered the best of the best. And yet in\nsecret Facebook groups exclusively for special operations forces\nthat were accessed by NBC News, they share misinformation about a\n“stolen” 2020 election, disparaging and racist comments about\nAmerica’s political leadership and even QAnon conspiracy theories.</p>\n\n<p>Among the hundreds of Facebook posts NBC News reviewed from forums\nfor current and former Rangers, Green Berets and other elite\nwarriors: a member of a special forces group lamenting that\nseveral aides to former Vice President Mike Pence were part of a\n“Concerted effort by the thieves and pedophiles walking the\nhallowed halls of the peoples government” to undermine former\nPresident Donald Trump.</p>\n\n<p>“In a just world, they would have already been taken out behind\nthe court house and shot,” another member commented.</p>\n</blockquote>\n\n<p>Without Facebook these views would still exist, but Facebook is the accelerant that gives these groups critical mass.</p>\n\n<p><strong>Update:</strong> Tess Owen, reporting for Vice last June: “<a href=\"https://www.vice.com/en/article/xg8g87/the-us-military-has-a-boogaloo-problem\">The U.S. Military Has a Boogaloo Problem</a>” — all about private Facebook groups. Facebook knows about these groups, and have for years.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/04/18/facebook-special-forces\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"25477a21efa7ff0ff805e48ec1cf205e6a205cf19c7562c71374aa2d64b5369a","category":"Tech"}