{"title":"What to Expect at WWDC 2021: iOS 15, macOS 12, watchOS 8, New MacBook Pro?","link":"https://www.macrumors.com/guide/wwdc-2021-what-to-expect/","date":1622835628000,"content":"Apple's 32nd annual Worldwide Developers Conference will continue to be held in a digital-only capacity much like the 2020 WWDC event, which means it's free for all developers worldwide to attend.\r\n<br />\r\n\r\n<br />\r\n<div></div><div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r\n<br />\r\nApple is holding a virtual keynote that will take place on Monday, June 7, with the event set to give us our first look at new operating system updates. We don't know a lot about this year's event, but everything that we're expecting to see based on rumors has been highlighted below.\r\n<br />\r\n\r\n<br />\r\n<ul><li><a href=\"https://www.macrumors.com/how-to/watch-wwdc-2021-keynote/\">How to Watch Apple's WWDC 2021 Keynote on June 7</a></li></ul>\r\n<br />\r\n\r\n<br />\r\n<h2>New MacBook Pro?</h2>\r\n<br />\r\nApple is working on new 14 and 16-inch MacBook Pro models that could perhaps see a launch at WWDC. The rumor <a href=\"https://www.macrumors.com/2021/05/24/wwdc-new-macbook-pro-models/\">comes from leaker Jon Prosser</a>, who has something of a mixed track record when it comes to predicting Apple's plans. Other more reliable sources have pointed more broadly to a launch in the second half of the year and haven't pinpointed June as a specific launch month for the new machines.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/Flat-2021-MacBook-Pro-Mockup-Feature-1.jpg\" />\r\n<br />\r\nAnalysts from <a href=\"https://www.macrumors.com/2021/06/03/new-macbook-pros-at-wwdc-wedbush-analyst/\">Wedbush</a> and <a href=\"https://www.macrumors.com/2021/06/04/new-apple-silicon-macbook-wwdc-morgan-stanley/\">Morgan Stanley</a> have also said that new Apple silicon Macs could debut at WWDC, but a recent <em>DigiTimes</em> report said that redesigned MacBook Pro models won't be shipping to customers until late 2021, so it's unclear what's going to happen.\r\n<br />\r\n\r\n<br />\r\nApple has in the past launched new hardware at WWDC, but since 2017, WWDC events have focused on software. <em>MacRumors</em> recently discovered a database listing for a battery that <a href=\"https://www.macrumors.com/2021/06/03/16-inch-macbook-pro-regulatory-filing/\">could be used</a> in the next-generation MacBook Pro, but that also doesn't offer a clear picture on a release timeline.\r\n<br />\r\n\r\n<br />\r\nThe new MacBook Pro models will feature the most radical redesign to the MacBook Pro lineup since 2016. Apple is reintroducing the <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> port, and the new MacBook Pro models will include an HDMI port and an SD Card reader in addition to a trio of Thunderbolt/USB-C ports.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/Ports-2021-MacBook-Pro-Mockup-Feature-1-copy.jpg\" />\r\n<br />\r\nThere will be no Touch Bar, with Apple instead returning to a traditional function row of keys, and there will also be a redesigned thermal system to accommodate the upgraded Apple silicon chips that the machines are expected to include. Additional color options are also a possibility.\r\n<br />\r\n\r\n<br />\r\nA complete overview of all the rumors we've heard about new MacBook Pro models so far can be <a href=\"https://www.macrumors.com/guide/14-inch-macbook-pro/\">found in our 14 and 16-inch MacBook Pro guide</a>.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Silicon Updates</h2>\r\n<br />\r\nEven if we don't end up getting new MacBook Pro models at WWDC, we could possibly hear about the next-generation Apple silicon chips that are in the works.\r\n<br />\r\n\r\n<br />\r\nApple is working on 10-core Apple silicon chips for the MacBook Pro models, with the chips expected to include eight high-performance cores and two energy-efficient cores, along with 16 or 32-core GPU options and support for up to 64GB RAM.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/m2-feature-purple.jpg\" />\r\n<br />\r\nHigher-end chips are coming too. For a future <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a>, Apple <a href=\"https://www.macrumors.com/2021/05/18/bloomberg-mac-pro-32-high-performance-cores/\">is working on</a> Apple silicon chip options with 20 or 40 computing cores, made up of 16 or 32 high-performance cores and four or eight high-efficiency cores. These upgraded chips are also expected to include 64 or 128 core GPUs, and at the top of the line, the graphics chips would be several times faster than the graphics modules Apple uses from Nvidia and AMD.\r\n<br />\r\n\r\n<br />\r\nLast year, Apple unveiled details about Apple silicon chips, but it was when developers needed to prepare for the transition to Arm technology. That's not the case this year, so there's no clear word on if we might get more Apple silicon info at WWDC.\r\n<br />\r\n\r\n<br />\r\nFor more on what to expect from the next-generation Apple silicon chips, we have a <a href=\"https://www.macrumors.com/guide/apple-silicon/\">dedicated Apple silicon guide</a>.\r\n<br />\r\n\r\n<br />\r\n<h2>iOS and iPadOS 15</h2>\r\n<br />\r\nThere have been several years where early versions of iOS leaked, giving us a clear picture of what to expect from the next-generation version of the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>'s operating system, but that didn't happen this year. We've heard little about iOS and iPadOS 15, but there have been a few hints about what to expect, mainly sourced from <a href=\"https://www.macrumors.com/2021/04/22/bloomberg-apple-plans-imessage-upgrades/\"><em>Bloomberg</em>'s Mark Gurman</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/iOS-15-icon-mock-in-article.jpg\" />\r\n<br />\r\n<h3>Notification Updates</h3>\r\n<br />\r\n‌iPhone‌ and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> users will be able to set notification preferences based on their status. So if you're awake, for example, you might set your ‌iPhone‌ to send notifications with sound, while sound might be disabled if you're sleeping.\r\n<br />\r\n\r\n<br />\r\nUsers will be able to select from categories like driving, working, or sleeping, and there will be a feature for creating custom categories for handling incoming notifications in different ways, along with new settings for automatic replies. Menu options for selecting a mode will be available on the Lock Screen and in the Control Center.\r\n<br />\r\n\r\n<br />\r\n<h3>iMessage Changes</h3>\r\n<br />\r\nApple is updating iMessage to better compete with other messaging apps like WhatsApp, but what new features we can expect remains unknown.\r\n<br />\r\n\r\n<br />\r\nLast year, there <a href=\"https://www.macrumors.com/2020/03/09/imessage-mentions-retractions-more/\">was evidence</a> that Apple was testing features like retracting sent messages, group chat typing indicators, and marking messages as unread, but none of these materialized in the <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a> update. It's possible that we might see some of these surface in the <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a> update. \r\n<br />\r\n\r\n<br />\r\n<h3>Privacy Enhancements</h3>\r\n<br />\r\nApple plans to enhance user privacy even further with the addition of a new menu that shows which apps silently collect data from users.\r\n<br />\r\n\r\n<br />\r\n<h3>Food Tracking</h3>\r\n<br />\r\nAn <a href=\"https://www.macrumors.com/2021/05/25/ios-15-food-tracking-feature/\">unconfirmed rumor</a> has suggested that Apple is planning to add a new food tracking feature to the Health app, but it is not clear how expansive it might be. It could allow users to log the food items that they consume, providing nutritional details and calorie tracking through a built-in database, or it could be something more simple where users are required to manually enter information.\r\n<br />\r\n\r\n<br />\r\n<h3>Interface Updates</h3>\r\n<br />\r\nWe've seen some minor interface changes spotted in screenshots of Accessibility features coming in ‌iOS 15‌, with Apple using inset cells and merged navigation bars in the Settings app. These changes could also be brought to other areas of the operating system.\r\n<br />\r\n\r\n<br />\r\nApple is also said to be making some minor tweaks to the colors that are used when an ‌iPhone‌ is in <a href=\"https://www.macrumors.com/guide/ios-dark-mode/\">Dark Mode</a>.\r\n<br />\r\n\r\n<br />\r\n<h3>New iPad Home Screen</h3>\r\n<br />\r\nApple is working on a new <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a> for the ‌iPad‌ that will let users place <a href=\"https://www.macrumors.com/guide/home-screen/\">widgets</a> anywhere. An entire app grid will be replaceable with ‌widgets‌ on the ‌iPad‌, a design that is available already on the ‌iPhone‌.\r\n<br />\r\n\r\n<br />\r\n<h3>Accessibility Updates</h3>\r\n<br />\r\nApple is working on <a href=\"https://www.macrumors.com/2021/05/19/apple-new-accessibility-features/\">several new Accessibility features</a> that are likely to debut in ‌iOS 15‌, including Background Sounds, an option that will allow ‌iPhone‌ users to play various soothing sounds like ocean, rain, or white noise to drown out unwanted environmental or external noise.\r\n<br />\r\n\r\n<br />\r\nAssistiveTouch, another new feature, will let the Apple Watch be used without the need to touch the display or the controls. the optical heart rate sensor, and on-device machine learning will let Apple Watch detect subtle differences in muscle movement and tendon activity that will control a cursor on the screen through hand gestures like a pinch or a clench.\r\n<br />\r\n\r\n<br />\r\nApple is also working on ‌iPad‌ eye-tracking, more inclusive Memoji, MFi hearing aid improvements, and more.\r\n<br />\r\n\r\n<br />\r\n<h3>Other New Features</h3>\r\n<br />\r\n<em>The Wall Street Journal</em>'s Joanna Stern said on the Friday before WWDC that she's heard Apple will introduce improvements to Safari, iMessage, Maps, and Health, but she did not provide additional context. \r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>Of course, next week at WWDC the walls will get even higher. I hear there are big updates coming to Safari, Health, Maps and iMessage at WWDC next week.</p>— Joanna Stern (@JoannaStern) <a href=\"https://twitter.com/JoannaStern/status/1400845550958911495?ref_src=twsrc%5Etfw\">June 4, 2021</a></blockquote> </div>\r\n<br />\r\n\r\n<br />\r\n<h3>Read More</h3>\r\n<br />\r\nFor more on what's coming in ‌iOS 15‌, we have <a href=\"https://www.macrumors.com/roundup/ios-15/\">a dedicated iOS 15 roundup</a> with more details.\r\n<br />\r\n\r\n<br />\r\n<h2>macOS 12</h2>\r\n<br />\r\nAs little as we know about ‌iOS 15‌, we know even less about <a href=\"https://www.macrumors.com/roundup/macos-12/\">macOS 12</a>, the next-generation version of the Mac's operating system. We do expect it to be labeled ‌macOS 12‌, however. For a long time, macOS updates were labeled as 10.x, but with the launch of <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">macOS Big Sur</a>, Apple jumped to macOS 11. We've already had 11.x software updates, so the next-generation version of macOS will be ‌macOS 12‌.\r\n<br />\r\n\r\n<br />\r\nApple will also give the operating system the name of a California landmark. Apple has been using California landmark names since 2013, and so far, we've had Mavericks, Yosemite, El Capitan, Sierra, High Sierra, Mojave, Catalina, and Big Sur.\r\n<br />\r\n\r\n<br />\r\nThere's no word yet on what Apple will use for ‌macOS 12‌, but the company has trademarked Mammoth, Monterey, and Skyline. Trademarks aren't a good guide to names, though, because Apple has used several names without trademarking them.\r\n<br />\r\n\r\n<br />\r\n<h2>watchOS 8</h2>\r\n<br />\r\nApple will introduce a new version of watchOS, watchOS 8, but what it will include is unknown at this time. Some of the features expected in iOS will naturally extend to watchOS, like the notification updates, but we don't know what's coming beyond that.\r\n<br />\r\n\r\n<br />\r\n<h2>tvOS 15</h2>\r\n<br />\r\nWe've also heard no hints of what to expect for tvOS 15, but a new version of tvOS always accompanies new versions of iOS.\r\n<br />\r\n\r\n<br />\r\n<h2>homeOS?</h2>\r\n<br />\r\nIn the days before WWDC, Apple mistakenly referenced \"homeOS\" as an operating system <a href=\"https://www.macrumors.com/2021/06/02/apple-homeos-mentioned-in-job-listing/\">in a job listing</a> before later removing it. There's a possibility that tvOS will be renamed to homeOS, given that tvOS is the operating system that runs on both the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> and the <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a>. It's also possible that the \"homeOS\" mention was just a mistake on Apple's part. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/homeOS2.jpg\" />\r\n<br />\r\n<h2>MacRumors Coverage</h2>\r\n<br />\r\nApple plans to live stream the WWDC keynote on its website, the ‌Apple TV‌ app, and YouTube, but for those unable to watch, we'll be covering the event on MacRumors.com and through the <a href=\"https://twitter.com/macrumorslive\">MacRumorsLive Twitter account</a>.\r\n<br />\r\n\r\n<br />\r\nWe'll also have in-depth coverage of all of Apple's announcements throughout the rest of the week and going forward as we test the new software.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC 2021</a>, <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a>, <a href=\"https://forums.macrumors.com/forums/ios-14.224\">iOS 14</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/wwdc-2021-what-to-expect/\">What to Expect at WWDC 2021: iOS 15, macOS 12, watchOS 8, New MacBook Pro?</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/what-to-expect-at-wwdc-2021-ios-15-macos-12-watchos-8-new-macbook-pro.2299240/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=9E_qZdnpDHw:oHL9LIyI0x8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=9E_qZdnpDHw:oHL9LIyI0x8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/9E_qZdnpDHw\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"255136302b6e11ee749ae795d522f221072d04ba8ff8284bab24d5ab1ee4b36c","category":"Apple"}