{"title":"Toward a better understanding of polymeric aluminum‐modified attapulgite for the efficient removal of low phosphorus concentration","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11122?af=R","date":1725604534000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/cc0f334b-07d7-4b82-bb3b-4acd900b81c6/wer11122-toc-0001-m.png\" alt=\"Toward a better understanding of polymeric aluminum-modified attapulgite for the efficient removal of low phosphorus concentration\" />\n<p>The polymeric aluminum-modified attapulgite is highly effective in treating low phosphorus concentrations, thereby assisting drinking water plants in reducing the phosphorus concentration to a level below 5 μg/L.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Attapulgite (ATP) is a biocompatible clay mineral that efficiently absorbs water. It is widely used in water treatment due to its environmental friendliness and cost-effectiveness. This study aimed to develop a volume-expansion structure-based attapulgite flocculant (VES-ATP) using aluminum salt and attapulgite (ATP) under alkaline conditions, specifically for the treatment of water containing low levels of phosphorus. The VES-ATP was characterized by scanning electron microscopy, Fourier transform infrared spectroscopy, X-ray diffraction, and X-ray photoelectron spectroscopy. The removal of phosphorus by the VES-ATP was conducted by varying the mass ratio of Al to attapulgite (denoted as R<sub>mAl/mATP</sub>), ATP dosage, and pH. The results showed that the VES-ATP had a good expansion and dispersibility in the presence of alkalized aluminum species. The basicity as the molar ratio of OH to Al (0.8 or 1.6) determined the expansion feasibility, and the coverage degree of Al onto ATP, as indicated by the mass ratio of Al to attapulgite (denoted as R<sub>mAl/mATP</sub>), determined Al flocculation efficiency. Higher values such as R<sub>mAl/mATP</sub> = 4:1 and 2:1 may result in a better flocculation. Low phosphorus treatment was successfully achieved through Al flocculation and ATP adsorption, including complexation, hydrogen bonding, and electrostatic attraction. As expected, the VES-ATP generated larger size flocs with a bigger fractal dimension than that with the sole Al flocculation. As a result, the total phosphorus could be reduced to the level below 5 μg/L. It is more efficient in the pH range of 5–9. Overall, the coupling of aluminum and attapulgite has significantly enhanced both purification capabilities of phosphorus.</p>\n<h2>Practitioner Points</h2>\n<p>\nPolymeric aluminum-modified attapulgite was efficient for removal of low phosphorus concentration.\nPhosphorus concentrations can be reduced to below 5 μg/L.\nPolymeric aluminum and attapulgite are both safe, and this technology is suitable for water treatment.\n</p>","author":"Xiaoben Yang, \nJunming Chen, \nXuewen Wu, \nGuocheng Zhu","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"255846fa8985285428155cd1d00912032b739f00fbd51ec6473daaac2c37b28f","category":"Environment"}