{"title":"Using machine learning to determine the nationalities of the fastest 100-mile ultra-marathoners and identify top racing events","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303960","date":1724335200000,"content":"<p>by Beat Knechtle, Katja Weiss, David Valero, Elias Villiger, Pantelis T. Nikolaidis, Marilia Santos Andrade, Volker Scheer, Ivan Cuk, Robert Gajda, Mabliny Thuany</p>\r\n\r\nThe present study intended to determine the nationality of the fastest 100-mile ultra-marathoners and the country/events where the fastest 100-mile races are held. A machine learning model based on the XG Boost algorithm was built to predict the running speed from the athlete’s age (<i>Age group</i>), gender (<i>Gender</i>), country of origin (<i>Athlete country</i>) and where the race occurred (<i>Event country</i>). Model explainability tools were then used to investigate how each independent variable influenced the predicted running speed. A total of 172,110 race records from 65,392 unique runners from 68 different countries participating in races held in 44 different countries were used for analyses. The model rates <i>Event country</i> (0.53) as the most important predictor (based on data entropy reduction), followed by <i>Athlete country</i> (0.21), <i>Age group</i> (0.14), and <i>Gender</i> (0.13). In terms of participation, the United States leads by far, followed by Great Britain, Canada, South Africa, and Japan, in both athlete and event counts. The fastest 100-mile races are held in Romania, Israel, Switzerland, Finland, Russia, the Netherlands, France, Denmark, Czechia, and Taiwan. The fastest athletes come mostly from Eastern European countries (Lithuania, Latvia, Ukraine, Finland, Russia, Hungary, Slovakia) and also Israel. In contrast, the slowest athletes come from Asian countries like China, Thailand, Vietnam, Indonesia, Malaysia, and Brunei. The difference among male and female predictions is relatively small at about 0.25 km/h. The fastest age group is 25–29 years, but the average speeds of groups 20–24 and 30–34 years are close. Participation, however, peaks for the age group 40–44 years. The model predicts the event location (country of event) as the most important predictor for a fast 100-mile race time. The fastest race courses were occurred in Romania, Israel, Switzerland, Finland, Russia, the Netherlands, France, Denmark, Czechia, and Taiwan. Athletes and coaches can use these findings for their race preparation to find the most appropriate racecourse for a fast 100-mile race time.","author":"Beat Knechtle","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"255cb438cce760232e08c05a445402171ce4b5a82e2b372eb50780539a695f7b","category":"Interdisciplinary"}