{"title":"In the US, wind power is getting bigger and better, report says","link":"https://arstechnica.com/?p=1790689","date":1630412898000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-1233272264-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-1233272264.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/wind-turbines-at-the-san-gorgonio-pass-wind-farm-in-news-photo/1233272264?adppopup=true\">Bloomberg / Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Wind power doesn't make up the largest part of the United States' energy mix, but it grew over the last year, according to the <a href=\"https://emp.lbl.gov/wind-technologies-market-report/\">Wind Technologies Market Report</a>. The renewable energy source increased to more than 8 percent of the country's electricity supply—reaching 10 percent in a growing number of states—and saw a whopping $25 billion in investments in what will translate to 16.8 gigawatts of capacity, according to the report.</p>\n<p>Released by the US Department of Energy, the sizeable report draws on a variety of data sources, including government data from the Energy Information Administration, trade data from the US International Trade Commission, and hourly pricing data from the various system operators. “The report itself covers the entire gamut of the US wind industry,” Mark Bolinger, a research scientist at Lawrence Berkeley National Laboratory and one of the authors of the report, told Ars.</p>\n<h2>Bigger is sometimes better</h2>\n<p>According to the report, the performance of wind power operations in the US has improved a great deal. We can measure this metric based on capacity factor, a ratio of the amount of energy a turbine actually produces compared to the amount it could have made if it ran at its peak constantly. For recently constructed wind power projects, the average capacity factor has now cleared 40 percent. The biggest gains in this area, however, are seen in the US's “wind belt,” a region that stretches from the Dakotas to Texas and receives a large amount of wind.</p></div><p><a href=\"https://arstechnica.com/?p=1790689#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1790689&amp;comments=1\">Comments</a></p>","author":"Doug Johnson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2562d28b9413b0e0cae9701df28d9803ba3690474d5aa208ec8017785440de00","category":"Tech"}