{"title":"Impact of cigarette smoking on long-term clinical outcomes in patients with coronary chronic total occlusion lesions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308835","date":1726236000000,"content":"<p>by HyeYon Yu, Jihun Ahn, Seung-Woon Rha, Byoung Geol Choi, Se Yeon Choi, Jae Kyeong Byun, Jin Ah Cha, Soo Jin Hyun, Soohyung Park, Cheol Ung Choi</p>\r\n\r\nCigarette smoking is a significant risk factor for coronary artery disease. However, there is insufficient evidence regarding the long-term clinical effects of smoking in Asian populations with chronic total occlusion (CTO). This study aimed to assess the effects of smoking on 5-year (median follow-up period, 4.2 ± 1.5 [interquartile range, 4.06–5.0] years) clinical outcomes in patients with CTO lesions who underwent percutaneous coronary intervention (PCI) or medical treatment (MT). We enrolled 681 consecutive patients with CTO who underwent diagnostic coronary angiography and subsequent PCI or MT. The patients were categorized into smokers (n = 304) and nonsmokers (n = 377). The primary endpoint was major adverse cardiovascular events (MACE), including a composite of all-cause death, myocardial infarction, and revascularization over a 5-year period. Propensity score matching (PSM) analysis was performed to adjust for potential baseline confounders. After PSM analysis, two propensity-matched groups (200 pairs, n = 400) were generated, and the baseline characteristics of both groups were balanced. The smokers exhibited a higher cardiovascular risk of MACE (29.5% vs. 18.5%, <i>p</i> = 0.010) and non-TVR (17.5 vs. 10.5%, <i>p</i> = 0.044) than the nonsmokers. In a landmark analysis using Kaplan–Meier curves at 1 year, the smokers had a significantly higher rate of MACE in the early period (up to 1 year) (18.8% and 9.2%, respectively; <i>p</i> = 0.008) compared with the nonsmokers. The Cox hazard regression analysis with propensity score adjustment revealed that smoking was independently associated with an increased risk of MACE. These findings indicate that smoking is a strong cardiovascular risk factor in patients with CTO, regardless of the treatment strategy (PCI or MT). In addition, in the subgroup analysis, the risk of MACE was most prominently elevated in the group of smokers who underwent PCI.","author":"HyeYon Yu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"256461d6fdba9db52cf7e2b3b51944735a49c16cb54b3e200dcbf6b2c5020539","category":"Interdisciplinary"}