{"title":"Race history: Jacobs secures a historic rainbow jersey in 1958","link":"https://www.cyclist.co.uk/in-depth/elsy-jacobs-cyclist","date":1693482064000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/elsy-jacobs-cyclist\">Race history: Jacobs secures a historic rainbow jersey in 1958</a></p>\n\n<p>Saturday, 30th August 1958. A host of the world’s best female riders lines up in front of the grandstands of the Reims-Gueux motor racing circuit. Poised, they wait for the pistol crack that will start the first women’s World Championships Road Race.</p>\n\n\n\n<p>Thirty riders have signed up across eight countries: Britain, France, Belgium and the Soviet Union have six riders apiece, and they are joined by riders from the Netherlands, Romania and the German Democratic Republic. Alongside them is a lone 25-year-old Luxembourger: Elsy Jacobs.</p>\n\n\n\n<p>Jacobs was born in March 1933. The youngest of nine children in a family that lived in the small community of Garnich, close to the Belgian border, she grew up surrounded by cycling, with elder brothers Roger, Edmond and Raymond all racing bikes (Edmond would start the 1956 Tour de France though he would only complete the first stage). Inspired by her brothers’ exploits, Jacobs started borrowing their bikes for training rides. Soon she was racing, regularly crossing the border and searching out events in France, such was the paucity of organised competition at home. By 1958 she was based in Paris, having become a full-time cyclist the year before.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/uci-world-championships-2023-highlights\">Pro Log: 5 things to remember from the 2023 UCI World Championships</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/nicole-cooke-cyclist\">Pro race history: Nicole Cooke tames Mont Ventoux</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 143: on sale now!</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>Ahead of Jacobs and her fellow riders that day in Reims were three laps of a circuit just shy of 20km, making for a total race distance of 59.4km. From the start/finish straight of Reims-Gueux – which used rural public roads – the route took in an extended 12km loop into the hills to the west of the village of Gueux, offering up a couple of punchy climbs before the route rejoined the race circuit.</p>\n\n\n\n<p>Jacobs was no sprinter, and her race tactics were well known: she would attack early and look to break away from distance. And so Jacobs focussed on constructing her race around those punchy hills – the perfect place to attack.</p>\n\n\n\n<p>On the second lap, just as the toughest part of the circuit approached, Belgium’s Yvonne Reynders went, prompting a flurry of activity. Reynders wasn’t able to stay at the front but her move created a leading group over the top of the circuit’s first major climb. Still, there was more than half the race to go, but Jacobs decided the time was right for her move. On the second climb, the Côte de Calvaire, she struck out alone.</p>\n\n\n\n<p>The entire British team along with three Soviet riders gave chase, but even they couldn’t catch Jacobs. By the end of the second lap she had nearly a whole minute over her rivals; by the end of the race her lead was unassailable.</p>\n\n\n\n<p>All the way through, Jacobs was a study in concentration and discipline, never wavering, riding hell for leather in the face of the logic that said she should be caught. She was just too strong.</p>\n\n\n\n<h3>A long road to Reims</h3>\n\n\n\n<p>‘The committee of the Women’s Cycle Racing Association [WCRA] desire to make known in greater detail its intention as to World Championships for Women.’ So begins a policy statement published by the WCRA in early 1957.</p>\n\n\n\n<p>Formed in Britain in 1949 as the Women’s Track Racing Association (before changing its name in 1956), and under the guiding hand of Eileen Gray – who in 1976 would be elected president of British Cycling – the WCRA had long been lobbying governing bodies at home and abroad for an increase in the quantity and quality of women’s cycle races. By 1957 they had successfully secured a British National Championships as well as the ‘institution of World Records’ for women cyclists. Now the association had eyes on a World Championships programme.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"970\" height=\"347\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-300x107.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-768x275.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1536x550.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-750x269.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1140x408.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4.jpg 1818w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p>By 1957 the WCRA was affiliated to Britain’s National Cycling Union (NCU) but, in the words of Gray, the NCU ‘had little time for women’s affairs nor the support of our campaign for World Championships for Women.’ Thus the association sent a policy statement to every member state of the UCI informing them that:</p>\n\n\n\n<p>‘The association… acknowledges the efforts made at the last congress of the UCI to obtain World Championships for women, but being mindful of that failure, and the persistent refusal of the UCI to reply to direct negotiation, hereby announce its intention to promote an annual series of races to be known as: The Women’s Cycle Racing Association, World Championships.’</p>\n\n\n\n<p>The statement confirmed that the WCRA had the means to promote such an event and intended to proceed ‘if the present inequality for women is persisted with by the UCI’.</p>\n\n\n\n<p>Later, at the UCI’s congress in Paris, a motion for a women’s World Championships was again tabled, and while a majority voted in favour, it wasn’t by the required margin. Thus, encouraged by the incumbent president of the UCI, the WCRA went ahead with its plan and in July organised its International Weekend of track and road races, with Yvonne Reynders and Jacobs both securing titles.</p>\n\n\n\n<h3>Trial by road</h3>\n\n\n\n<p>Fast forward eight months and yet another motion was tabled, this time at the UCI’s congress in Zurich, with even more backing from member nations. But still the UCI wasn’t wholly supportive, with the resultant press release stating, ‘In principle the cycling officials are not opposed to the establishment of World Championships for women; how the women’s events will be organised will be elaborated on at a future session. It is still to be considered as probable that the program of a women’s World Championships will include only a few sprints. In any case, they will exclude a road test.’</p>\n\n\n\n<p>That future session, held in March 1958 at the Palais d’Orsay in Paris, confirmed ‘the creating, on a trial basis, of a female World Championship in three disciplines (60km road, 3km pursuit, 500m sprint). France is responsible for its organisation.’ Women at last had their official World Championships, and it would include a road race. </p>\n\n\n\n<p>So it was that Elsy Jacobs won the inaugural World Championships so many years in the making by 2min 51secs. Later she would pose on a balcony in her new rainbow jersey, still wearing mitts on the hands that had guided her home. Jacobs had entered history as road racing’s first official women’s World Champion, and with that a new era of women’s cycling had begun.</p>\n\n\n\n<p><strong>• This article originally appeared in issue 143 of Cyclist magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/elsy-jacobs-cyclist\">Race history: Jacobs secures a historic rainbow jersey in 1958</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"2567db42af190f58f6d4c1e19f950d8eb0a67d46df83fd41c55317633961069d","category":"Cycling"}