{"title":"Precipitation and temperature timings underlying bioclimatic variables rearrange under climate change globally","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17496?af=R","date":1726219912000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6a365546-596c-495e-b150-9b0bc35a7b66/gcb17496-toc-0001-m.png\" alt=\"Precipitation and temperature timings underlying bioclimatic variables rearrange under climate change globally\" />\n<p>Bioclimatic variables are chief components of models targeting climate change effects on the potential distribution of species. Predicted distributions depend on the values of the bioclimatic variable (e.g., precipitation of the wettest quarter). At the same time, a shift in the period underlying the variable calculation (e.g., wettest quarter) easily remains hidden, even though the ecological meaning of these variables depends heavily on it. Our study uncovers how the within-year position of these specific climate periods is expected to shift in a global context in reaction to climate change according to four future time periods, four scenarios, and four global climate models.</p>\n<br />\n<h2>Abstract</h2>\n<p>Modeling how climate change may affect the potential distribution of species and communities typically utilizes bioclimatic variables. Distribution predictions rely on the values of the bioclimatic variable (e.g., precipitation of the wettest quarter). However, the ecological meaning of most of these variables depends strongly on the within-year position of a specific climate period (SCP), for example, the wettest quarter of the year, which is often overlooked. Our aim was to determine how the within-year position of the SCPs would shift (SCP shift) in reaction to climate change in a global context. We calculated the deviations of the future within-year position of the SCPs relative to the reference period. We used four future time periods, four scenarios, and four CMIP6 global climate models (GCMs) to provide an ensemble of expectations regarding SCP shifts and locate the spatial hotspots of the shifts. Also, the size and frequency of the SCP shifts were subjected to linear models to evaluate the importance of the impact modeler's decision on time period, scenario, and GCM. We found ample examples of SCP shifts exceeding 2 months, with 6-month shifts being predicted as well. Many areas in the tropics are expected to experience both temperature and precipitation-related shifts, but precipitation-related shifts are abundantly predicted for the temperate and arctic zones as well. The combined shifts at the Equator reinforce the likelihood of the emergence of no-analogue climates there. The shifts become more pronounced as time and scenario progress, while GCMs could not be ranked in a clear order in this respect. For most SCPs, the modeler's decision on the GCM was the least important, while the choice of time period was typically more important than the choice of scenario. Future predictive distribution models should account for SCP shifts and incorporate the phenomenon in the modeling efforts.</p>","author":"Ákos Bede‐Fazekas, \nImelda Somodi","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"2572f4dcbc0b097bf37efdae487eb02879f60afd2ad9e1469e30d0013b3ef63b","category":"Environment"}