{"title":"Koen de Kort on retirement, injury and the next chapter with Trek-Segafredo","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/koen-de-kort-on-retirement-injury-and-the-next-chapter-with-trek-segafredo","date":1628854385000,"content":"\n      <p><span>A few months ago, Koen de Kort, a professional rider for Trek-Segafredo, had a life-changing accident. At home in Andorra, he was driving an off-road vehicle with friends when everything went wrong: the vehicle rolled over and De Kort was left with a severe injury as a result of the crash. Despite being air-lifted to hospital, the doctors were unable to save three fingers of his right hand. The Dutch rider is now learning to adapt to his new circumstances, and is looking ahead to some big life changes.</span></p>\n<div></div>\n<p><span>Currently recovering at his family home in Holland, De Kort explains that he’d planned to retire at the end of this season regardless, but he didn’t go out in the way he’d have liked. “Obviously, it would have been great to go to a race and tell everyone around it was my last race. I didn't really want to be in a hospital bed and say like: okay, I guess I've done my last race,” he tells me via Zoom.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/arthritis-forces-ian-stannard-to-retire\">Related – Stannard's last stand: Ian Stannard on retirement and arthritis</a></strong></em></p>\n<p><span>It would have been easy for De Kort to be defeated by such a sudden and severe incident, but his outlook reveals nothing but positivity — perhaps no surprise considering the mental fortitude that carried him through such a long and illustrious career on the bike. </span></p>\n<p><span>De Kort turned professional in 2005, and proved himself as a strong rider suited to the Classics. As his career wore on, he found his place as a team captain, eventually becoming one of the most experienced and respected riders in the professional peloton.</span></p>\n<p><span>“I'm actually very happy and proud of what I have achieved,” he says. “I think I had a very nice, long career with the team. We achieved a lot of great things and I think I really got the maximum out of myself for a long t</span><span>ime,” he says. As De Kort looks back on his career, what shines through is his unwavering love for the sport, something that hasn’t dwindled despite being a professional for almost two decades. “I think I found the right balance between working really hard but also still enjoying being out on the bike every day without doing things that I didn't want to do,” he explains.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1272231975_1024x1024.jpg?v=1628782727\" /><em><span>Image: Getty Images</span></em></span></p>\n<p><span>Despite still enjoying riding, De Kort believes that he was ready for retirement at the end of this year, acknowledging that the level in the peloton has risen exponentially over recent years. “I started to feel that it was getting harder and harder to get to the right level for me. If I got sick for a few days, that would throw me back so much. I think my body was telling me: you know, it's time to start doing something else.”</span></p>\n<p><span>Although being a professional cyclist may seem like a dream job to those of us on the outside, it comes with extremely tough physical demands that challenge commitment and motivation. “I didn’t want to just try to just finish races,” says De Kort. “You want to make a difference to the race and do something. So if it's just to finish races, it's hard to stay motivated.”</span></p>\n<p><span>De Kort may have been ready to step away from the professional scene, but his innate love for cycling means that he was keen to move into a role which would allow him to travel to races and still be amongst the peloton. He tells me that two days after his accident, he got a call from Trek confirming that he had a job with the the team's management for the year. “That was good news,” he says. “It's a bit of a worry for the future when a big accident like that happens, but this took a lot of the doubt away, which helps a lot.”</span></p>\n<p><span>He’d interviewed for the Team Support Management role earlier in the season, believing that it was important to prepare for life once he made the decision to retire from professional racing.  “A few years ago, I felt like the end of my career was getting closer. So I thought: what can I best do to prepare myself for afterwards?” he says. The 38-year-old studied Human Movement Sciences in Amsterdam before turning professional, and completed a Masters in Sports Management online while competing in recent years. “With my education, I could get a pretty good job. But I felt my interests had shifted a little bit so I wanted to specifically prepare for that, which is why I did the Sports Management Masters,” he says.</span></p>\n<p><span>De Kort explains that companies like Trek are often looking for ex-athletes. Despite someone like himself not having so much experience in the workplace, many skills learnt in the peloton are transferable to other roles. “[Athletes] have this kind of drive and they pick up a lot of leadership skills,” says De Kort. Often being a road captain in his time as a professional cyclist, his talent for leadership and management meant that the role at Trek was ideal for the Dutch rider.</span></p>\n<p><span><em><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Koen-de-Kort1_1024x1024.jpg?v=1628849971\" /></span></em></span></p>\n<p><span><em><span>Image: Peter Stuart</span></em></span></p>\n<p><span>He will be the main source of communication between the riders and sponsors, gathering feedback from riders about their equipment and ensuring they have everything they need ahead of the season. “I've got to make sure that the riders get the best equipment, but the sponsors also require feedback from the riders to improve their products,” De Kort explains. “I just have to try to get the most out of the riders and try to give them all the information that I have, which is kind of what I've already been doing when I was racing.”</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/finding-britain-s-future-stars-the-coach-behind-the-gb-talent-factory\">Related – Finding Britain’s future stars: The coach behind the GB talent factory</a></strong></em></p>\n<p><span>Of course, next year will be a very different experience for De Kort, despite still being among his team-mates. “I'm not on the start lines with them anymore,” he says. “But I think I have built up a strong relationship with most of the riders and therefore I think I can ask quite a lot of them. Hopefully, I can show them that I can really help them.” </span></p>\n<p><span>Being part of a team and helping his colleagues has long been an important part of the sport for De Kort, he explains that, throughout his career, he gave his all to help the team succeed and expects his new role to be a continuation of this. He talks about the 8 years he spent on Team Giant Alpecin (now Team DSM) prior to Trek Segafredo, discussing how the camaraderie of the team meant it had a family-like atmosphere. When he moved to Trek Segafredo, he found a similar feeling. “I really wanted to choose a team where I would feel at home,” he says. </span></p>\n<p><span>A strong bond developed with Trek, making it the obvious place to continue his career after he stopped racing. He talks about all of his teammates checking in on him after his accident earlier in the year. “I think every single rider from the team messaged me and they still message me regularly asking how I'm going and what's happening,” says. “All of them say that they're looking forward to seeing me at the races again, and I think that I can help them to make the team better. I know that I always worked really hard for the team and I've always done everything I can for the team, and I'll continue to do that.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC08530_1024x1024.jpg?v=1628782835\" /><em><span>Image: </span>Zac Williams/SWpix.com</em></span></p>\n<p><span>With a huge amount of experience and such a good relationship with the riders, De Kort thinks he will offer more in-depth feedback to sponsors regarding equipment, especially in races like the Classics. With the unpredictable weather and bad road conditions, equipment choices are of utmost importance in these races. “I think it's a big advantage to know these roads and know what the bike and your body goes through,” he says. “Obviously, the equipment sponsors do great testing themselves, but it's always different when you're actually riding the bike to what the test results say. Sometimes it just feels different than what it should, but that's just how it feels.”</span></p>\n<p><span>De Kort is under no illusions that the role won’t be challenging for him, though. He talks about how he will have to prove himself in the corporate side of things, dealing with budget and finances in ways which he hasn’t had to in his career so far. “As a cyclist you get to a race and they grab your suitcase, they put it in your room, you get a massage and everything's done, everything's organised for you,” he says. “Now I'm going to be the one who organises the riders.”</span></p>\n<p><span>Still, it’s a challenge he looks forward to and one that he won’t be attempting alone. Long-term mechanic for Trek Segafredo, Glen Leven, will share the role with De Kort, something the Dutch rider thinks is important with the workload they will take on. “The women's team is becoming so big and the sport of women’s cycling is getting bigger and bigger,” De Kort says. “They really deserve as much attention as the men's team and with one person it's just too much to cover, so I think it's great that Glen and I can combine forces and be able to look after the men's and women's teams equally.”</span></p>\n<p><span>De Kort may not have retired quite in the way he’d liked, but he certainly isn’t saying goodbye to the sport. It seems like this is just the start of an entirely new chapter for him, one in which he could likely have the same, if not more, impact on his teammates and their success as he did when he was racing.</span></p>\n<p><span>“I love cycling. I love the sport,” he says. “I think for me, this is the perfect combination where I get the experience of being on the corporate side of things, but I’ll also still be involved in races and be part of, hopefully, winning a lot of races. That’s something I think I would really miss if I were to just go into a nine to five desk job.”</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2587bed1e46bbce418ba087d38c4962d4ec796c8230329389512320ca851fde0","category":"Cycling"}