{"title":"Apple Generative AI Features and Smarter Siri Could Launch Next Year","link":"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/","date":1697979185000,"content":"Apple is developing a large array of features that use generative AI, including a new version <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a>, that could launch next year, according to <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/03/hey-siri-banner-apple.jpg\" width=\"1200\" height=\"630\" />\r<br />\nIn his latest <a href=\"https://www.bloomberg.com/news/newsletters/2023-10-22/what-is-apple-doing-in-ai-revamping-siri-search-apple-music-and-other-apps-lo1ffr7p\">\"Power On\" newsletter</a>, Gurman said that despite Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a>'s claim that Apple has been working on generative AI technology for years, Apple's executives were \"caught off guard\" by the industry's sudden interest in AI and have been anxiously \"scrambling since late last year to make up for lost time.\"\r<br />\n\r<br />\nApple's senior vice president of machine learning and AI strategy, John Giannandrea, and senior vice president of software engineering Craig Federighi are apparently leading the company's AI efforts. <a href=\"https://www.macrumors.com/guide/eddy-cue/\">Eddy Cue</a>, Apple's senior vice president of services, is also involved in the push.\r<br />\n\r<br />\nGiannandrea is said to be overseeing development of the underlying technologies for a new AI system. Most notably, his team is working on a new, \"smarter version of ‌Siri‌\" that is deeply integrated with AI. Gurman says it could be ready as soon as next year.\r<br />\n\r<br />\nOn the other hand, Federighi is supervising the integration of AI into to the next major version of iOS by introducing features running on Apple's large language model (LLM). Among the new features is a revamped interaction between ‌Siri‌ and the Messages app, enabling users to field complex questions and auto-complete sentences more effectively. Federighi's team is also looking at integrating AI into Xcode to help developers write code more quickly, bringing it in line with services like Microsoft's GitHub Copilot.\r<br />\n\r<br />\nCue is reportedly attempting to add AI to as many Apple apps as possible, including features in <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>, such as auto-generated playlists, and productivity apps like Pages and Keynote, where AI could assist with writing or creating slide decks. Apple is also apparently testing the use of generative AI for internal customer service apps within <a href=\"https://www.macrumors.com/guide/applecare/\">AppleCare</a>. \r<br />\n\r<br />\nApple is purportedly on course to spend $1 billion per year on AI research. Whether Apple should deploy generative AI as a completely on-device experience, a cloud-based setup, or a hybrid approach, is currently a source of debate internally.\r<br />\n\r<br />\nGurman previously reported that Apple is <a href=\"https://www.macrumors.com/2023/03/15/apple-engineers-working-on-chatgpt-like-ai/\">working on</a> a chatbot tool that some engineers have dubbed \"<a href=\"https://www.macrumors.com/2023/07/19/apple-experimenting-with-chatgpt-tool/\">Apple GPT</a>\" to rival OpenAI's ChatGPT.<div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a>, <a href=\"https://www.macrumors.com/guide/artificial-intelligence/\">Artificial Intelligence</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>, <a href=\"https://www.macrumors.com/guide/apple-gpt/\">Apple GPT</a>, <a href=\"https://www.macrumors.com/guide/ios-18/\">iOS 18</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/\">Apple Generative AI Features and Smarter Siri Could Launch Next Year</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-generative-ai-features-and-smarter-siri-could-launch-next-year.2408328/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"258d011c92705b08cd381b2eb34ee435223b33e852ec29287435be12f989b222","category":"Apple"}