{"title":"Unexpected suppressive fungal diversity and stimulative soil carbon loss under soil acidification in an alkaline grassland","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14685?af=R","date":1729743602000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/858ff2f1-6b7b-4549-b713-2d08ba5af874/fec14685-toc-0001-m.png\" alt=\"Unexpected suppressive fungal diversity and stimulative soil carbon loss under soil acidification in an alkaline grassland\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/11/impact-of-soil-acidification-on-microbial-community-and-soil-carbon-dynamics-in-alkaline-soils/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSoil acidification caused by acid deposition and N fertilization can significantly affect the composition and activity of microbial communities in acidic soils. However, whether and how acidification affects soil microorganisms and microbial-mediated carbon (C) dynamics in alkaline soils are less known.\n\nBased on a 7-year (2016–2023) acid addition experiment in an alkaline grassland (pH &gt; 8) on the Loess Plateau in Northwest China, we examined the effects of soil acidification on soil fungal and bacterial communities and their C metabolism.\n\nUnexpectedly, our results showed that soil acidification mainly reduced fungal diversity, rather than bacterial diversity, possibly because acidification led to soil NH<sub>4</sub>\n<sup>+</sup> accumulation and decreased plant diversity. Also, soil acidification reduced forb but increased grass biomass, and enhanced root production and turnover rate. Laboratory incubation experiments showed that changes in the microbial community and soil properties jointly promoted microbial decomposition of soil organic C (SOC), with more promotion for the decomposition of labile C (i.e. glucose) (+68.4%) than recalcitrant C (i.e. tannin) (+29.1%).\n\n<i>Synthesis</i>. Soil acidification reduced fungal diversity and stimulated SOC decomposition in an alkaline grassland. Given that pH decline can also accelerate soil inorganic C dissolution and carbonate-derived CO<sub>2</sub> release, these results highlight that soil acidification can exacerbate C loss in the alkaline soils over the long term.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/11/impact-of-soil-acidification-on-microbial-community-and-soil-carbon-dynamics-in-alkaline-soils/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Tongshuo Bai, \nShicheng He, \nYitian Li, \nJun Deng, \nFan Sang, \nYunfeng Zhao, \nHao Wang, \nTangqing He, \nKangcheng Zhang, \nYunpeng Qiu, \nPeng Wang, \nChenglong Ye, \nYi Zhang, \nYi Wang","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"259883b4a1c16b2cbae1b0ab8ec2ddf5638f278e07b2c7a95de179af90aadb3b","category":"Environment"}