{"title":"Research on Sound Source Localisation Method for UAV Detection Based on Improved EMD","link":"https://www.preprints.org/manuscript/202404.0101/v1","date":1711975603000,"content":"Abstract\nIn order to solve the problem that it is difficult to obtain the accurate trigger signal moment when using the time difference of UAV flight acoustic signals collected by acoustic sensors arranged in advance to locate the position of UAVs when they cannot be tracked by radar and are difficult to be observed by the human eye, an acoustic source localisation method with improved empirical modal decomposition (REMD) under an adaptive frequency window is proposed. Firstly, the collected UAV flight signals are smoothed and filtered, then the robust empirical modal decomposition (REMD) is used for IMF modal decomposition and spectral analysis of the collected signals, and a panning frequency window with variable bandwidth is introduced for corresponding frequency locking and extracting the IMFs; the GWO optimisation is used and the sliding metrics are set to determine the position of the panning frequency window automatically; finally, the extracted Finally, the extracted IMF components are reconstructed according to the criterion, and the trigger signal moments in the reconstructed IMF components are resolved and recorded, and the algorithm is used to calculate the difference between the reception moments of different sensors; for the traditional sound source localisation algorithms with a small detection range, which are prone to fall into the no-solution or false-solution, i.e., unable to achieve the localisation, a weighted least-squares-based Chan-Taylor algorithm is proposed for the localisation computation, and a weighted least-squares algorithm is proposed for the localisation computation, through the Inputting the sensor delay parameter and solving the linear equation system to get the target position information; finally, this paper verifies the robustness and performance of the design method with simulated and actual signals. The results show that the maximum positioning error is no more than 5% in an area with a side length of 15m in the measurement area. With the improved accuracy of time delay estimation, the positioning simulation results meet the positioning requirements even though the positioning error is further expanded when the measurement area is further expanded.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"259b44c5eda362c8319e14d20964d1561d59d919105a23f15d9f8bcdf807a2d1","category":"Interdisciplinary"}