{"title":"Microbes as medicine","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15237?af=R","date":1728667489000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/250bc967-42ac-4af6-8ad7-d4c6f1cfa6ad/nyas15237-gra-0001-m.png\" alt=\"Microbes as medicine\" />\n<p>The explosion of research into the human microbiome has revealed the many ways in which our microbes enhance our health. Could these host-associated microbes be exploited as novel therapies to treat disease? In this review, the various strategies for using microbes as medicine that have been thus far employed, as well as the potential new treatments of the future, are explored and current research gaps are highlighted. \n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Over the last two decades, advancements in sequencing technologies have significantly deepened our understanding of the human microbiome's complexity, leading to increased concerns about the detrimental effects of antibiotics on these intricate microbial ecosystems. Concurrently, the rise in antimicrobial resistance has intensified the focus on how beneficial microbes can be harnessed to treat diseases and improve health and offer potentially promising alternatives to traditional antibiotic treatments. Here, we provide a comprehensive overview of both established and emerging microbe-centric therapies, from probiotics to advanced microbial ecosystem therapeutics, examine the sophisticated ways in which microbes are used medicinally, and consider their impacts on microbiome homeostasis and health outcomes through a microbial ecology lens. In addition, we explore the concept of rewilding the human microbiome by reintroducing “missing microbes” from nonindustrialized societies and personalizing microbiome modulation to fit individual microbial profiles—highlighting several promising directions for future research. Ultimately, the advancements in sequencing technologies combined with innovative microbial therapies and personalized approaches herald a new era in medicine poised to address antibiotic resistance and improve health outcomes through targeted microbiome management.</p>","author":"Brendan A. Daisley, \nEmma Allen‐Vercoe","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"25acb1aa3728f20fc240d625548f21be3cf85a24601b1a66b65a47c48478dc41","category":"Environment"}