{"title":"The rise of the opportunists: What are the drivers of the increase in infectious diseases caused by environmental and commensal bacteria?","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12922?af=R","date":1714551588000,"content":"<h2>Abstract</h2>\n<p>The aquaculture sector is currently experiencing a global disease crisis. Emerging bacterial diseases—often opportunistic or syndromic—have collapsed production in nations across the world. Losses in the shrimp industry associated with opportunistic <i>Vibrio</i> spp. exceed 40% of global capacity. This paper reviews potential drivers of syndromic diseases involving opportunistic bacterial pathogens affecting global aquaculture. We provide key examples from major industries where such conditions have prompted greater antibiotic use and have resulted in significant mortality. We challenge the conventional definitions of opportunistic pathogens and propose a fluid categorisation that acknowledges the continuum of host adaptation and the complexity of microbial ecology. We discuss the implications of environmental and dietary stressors such as climate change, coastal eutrophication and pollution, and the transition to plant-based feeds, which have been linked to impaired epithelial barrier function, gut health disorders and increased disease susceptibility. We critique the ‘one-pathogen one-disease’ paradigm, suggesting that Rothman's causal pie model is more useful for understanding opportunistic infections as it emphasises the multicausal nature of disease. We provide examples of bacterial and viral interactions in aquatic disease and occurrence of bacterial diseases resulting from host damage from eukaryotic parasites or increasing frequency and severity of interventions to control such parasites. We recognise the need for corroborative evidence to validate the rise of opportunistic bacterial pathogens as a global trend, and we advocate for the application of nuanced disease causation models to reduce the incidence of opportunistic infections and improve the sustainability of the aquaculture industry.</p>","author":"Francisca Samsing, \nAndrew C. Barnes","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"25b25014771d0761fc74bbf19456a8f6a6af0c536443b66cdcff3584bf331c05","category":"Environment"}