{"title":"Spectrum and Incidences of Adverse Reactions Post-immunizations in Taiwanese Population (2014 &ndash; 2019): An Analysis Using the National Vaccine Injury Compensation Program","link":"https://www.preprints.org/manuscript/202408.1499/v1","date":1724192033000,"content":"Background: Post-marketing surveillance is crucial for gathering data on vaccine reactogenicity, enhancing public trust in immunization, and promoting vaccine uptake. This study aims to characterize adverse events following immunization (AEFI) and estimate the incidence rates of adverse reactions (ARs) associated with vaccines included in Taiwan's Expanded Program on Immunization (EPI). The study utilizes data from Taiwan's Vaccine Injury Compensation Program (VICP). Methods: Vaccine injury claims submitted to the VICP between 2014 and 2019 were analyzed. ARs were defined as AEFIs adjudicated as ‘related’ or ‘indeterminate’ by the VICP committee. Data on the annual number of vaccine doses administered was obtained from the Taiwan CDC, which helped calculate AR incidence rates. Results: A total of 491 AEFI claims were reviewed, with 327 (66.6%) categorized as ARs. AEFIs were mainly associated with the Bacillus Calmette-Guérin (BCG) vaccine (43.4%) and the seasonal influenza vaccine (22.0%). Most EPI vaccines demonstrated low AR incidence rates, ranging from 1.68 to 13.6 per million doses, with the exception of BCG, which exhibited 162.5 ARs per million doses. Shifting BCG immunization from below 5 months to at least 5 months reduced osteomyelitis incidence significantly, from 41.4 to 7.9 (P = 0.0014), but increased abscess and lymphadenitis cases. Conclusion: EPI vaccines in Taiwan are highly safe, with minimal AR incidences in the general population. The BCG vaccine remains an exception, occasionally causing severe ARs like osteomyelitis. Adjusting the immunization schedule to an older age may mitigate some of these adverse effects.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"25baddb383de12bda555351a7c9c4493990af65d82a5a5e7f1d90666aeaec8f2","category":"Interdisciplinary"}