{"title":"Tour de France 2021 Stage 20 Preview - The Final Time Trial","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-stage-20-preview-the-final-time-trial","date":1626358534000,"content":"\n      <p><span>The penultimate stage of the 2021 Tour de France is a 30km time trial between Libourne and Saint-Émilion, which takes place on Saturday 17th July.</span></p>\n<p><span> Last year, the stage 20 time trial caused drama, elation and heartbreak all in equal measure. Tadej <span>Pogačar </span>soared up La Planche des Belles Filles to win the Tour de France, stealing the race from his compatriot <span>Primož Roglič</span> at the final opportunity. His Jumbo-Visma teammates Wout van Aert and Tom Dumoulin looked on astounded</span>, creating one of the most iconic pro cycling images in recent memory.</p>\n<p><span>Expecting drama to a similar degree this year would be hopeful. </span><span><span>Pogačar </span>holds a five-minute lead in the yellow jersey — something would have to go terribly wrong for him to lose the race. However, a stage win at the Tour de France is still up for grabs, and the best of the rest will give their all to finish positively in the general classification.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b>Tour de France 2021 Guide</b></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tagged/tour-de-france-2021\"><b>Tour de France 2021 articles</b></a></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_PROFILS_ETAPES_SANS_RAVITO_ETP20_1024x1024.jpg?v=1626351298\" />Stage 20 profile</span></i></p>\n<p><span>The riders will leave the start ramp in Libourne for a largely flat time trial. The first time check occurs in Pomerol 7.6km in, which will provide the first indications as to who is feeling strong.</span></p>\n<p><span>Around 16.5km into the stage, there is a short 500 metre ramp uphill which averages around 4.5%. This marks the halfway point of the time trial, so the riders should continue to measure their effort. However, those who have the form should try to power up this section. Next, a</span><span> short rise carries the riders to the penultimate time check in Montage at kilometre 20.</span></p>\n<p><span>The final few kilometres slowly rise uphill to a false flat. Although the percentages don't exceed 3%, plenty of time can be won and lost here, so the riders must keep sufficient energy in reserve with this section in mind.</span></p>\n<h4><b>Contenders</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1233732522-min_1024x1024.jpg?v=1626351324\" />Image credit: CHRISTOPHE PETIT TESSON/AFP via Getty Images</span></i></p>\n<p><span>The time trial is similar to the stage 5 time trial that took place earlier in the Tour. This route is only a couple of kilometres longer and features similar terrain — mostly flat with a couple of short ramps which must be accounted for.</span></p>\n<p><b>Tadej <span>Pogačar </span></b><span>was the winner that day which surprised many. It was a sublime display from the Slovenian, who beat Stefan <span>Küng </span>by an exceptional 19 seconds despite the terrain seemingly favouring the Swiss powerhouse. After his win on La Planche des Belles Filles last year, <span>Pogačar </span>is now bidding to win his third Tour de France time trial in a row. He starts the stage as one of the favourites not only to defend the yellow jersey, but also win the stage.</span></p>\n<p><b>Stefan <span>Küng </span></b><span>was second in Laval and was visibly gutted after <span>Pogačar </span>crossed the line to beat his long-standing time at the top of the leaderboard. Since then, <span>Küng </span>has been largely anonymous with his eyes firmly placed on this stage. The Swiss time trial champ has never won a Tour de France stage (bar contributing to the BMC team time trial win in 2018), and he will be desperate to change that here.</span></p>\n<p><b>Wout van Aert</b><span> targeted both stage victory and the yellow jersey on the stage 5 time trial, so was disappointed to only come away with fourth place. Van Aert won the only other time trial he entered this year — he defeated <span>Küng</span>, <span>Pogačar </span>and Filippo Ganna at Tirreno-Adriatico. Van Aert has found his form as the Tour de France has progressed after suffering from appendicitis before the race began. He must be considered among the leading contenders.</span></p>\n<p><span>EF Education - Nippo’s </span><b>Stefan Bissegger</b><span> was one of the favourites entering the stage five time trial, but he could only finish 18th. However, that doesn’t tell the full story. Unlike the other favourites, Bissegger was subject to wet weather conditions which meant he was unable to attack the corners, ultimately putting pay to his chances. If he gets a little more luck, he could be challenging for the stage this time.</span></p>\n<p><span>Other TT specialists with a chance include </span><b>Mikkel Bjerg </b>and<b> Kasper Asgreen.</b></p>\n<p><span>Behind <span>Pogačar</span>, there is still plenty up for grabs in the general classification. Less than five minutes separate second and eighth, and the time trial will decide the final standings. <strong>Jonas Vingegaard </strong>and<strong> Richard Carapaz</strong> currently hold the two lower steps on the podium. With just a few seconds separating them, </span><span><span>Vingegaard will feel more comfortable. The Dane is an elite time trialist which is proven by his third place on stage 5. This makes </span></span><span>Vingegaard the heavy favourite to finish second overall, ahead of Carapaz.</span></p>\n<p>Further back, <strong>Rigoberto Urán, Ben O'Connor </strong>and<strong> Wilco Kelderman</strong> will fight for the following places in the GC. <span>Urán </span>won the time trial at the Tour de Suisse a few weeks before the Tour de France departed from Brest. He will hope to finish fourth at the very least.</p>\n<p>Further back,<strong> Alexey Lutsenko</strong> sits eighth in the GC, which is a fine performance — his previous best GC position at any Grand Tour was 19th. He is a strong time trialist too, so could impose himself on<strong> Enric Mas</strong> ahead. However, Lutsenko has lost too much time in the mountains to worry the top five.</p>\n<p><i><span>Cover image: A.S.O./Pauline Ballet</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"25c19a52fbf26422efa5b86f901985aa2035afc511f213fa3bd267ceaf39f17b","category":"Cycling"}