{"title":"Seasonal variations in household food security and consumption affect women’s nutritional status in rural South Ethiopia","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003294","date":1724162400000,"content":"<p>by Bethelhem Mezgebe, Taye Gari, Mehretu Belayneh, Bernt Lindtjørn</p>\r\n\r\nFood availability varies seasonally in most rural areas of developing nations, especially in areas affected by drought and climate change, with women being one of the most vulnerable groups. This study aimed to assess the effect of seasonal variation in household food security, adequate dietary diversity, food consumption, and wealth on the nutritional status of women of reproductive age in a rural community in South Ethiopia. Further, the study aimed at identifying associated factors with women’s nutrition status. An open cohort study was conducted from June 2021 to June 2022, with follow-up visits every three months. Anthropometric measurements were carried out along with interviews. Data were analyzed using STATA version 15. Multilevel, multiple linear regressions were employed. Findings revealed that women’s average body mass index (BMI) was 20.4 kg/m<sup>2</sup> (95% CI: 20.4–20.5). The highest (20.6 kg/m<sup>2</sup>, 95% CI: 20.5–20.8) was observed in December, while the lowest (20.2 kg/m<sup>2</sup>, 95% CI: 20–20.3) occurred in September. During the main postharvest period in December, the household food insecurity score was the lowest (median: 4, Inter quartile range (IQR): 0–9), while the household dietary diversity score (median: 6, IQR: 5–7), and the household food consumption score were the highest (median: 50.5, IQR: 44–70). Factors such as household food security, food consumption, previous season BMI, age, marital status, and membership in safety net programs were identified as determinants of women’s BMI. The study showed the vulnerability of women in drought-prone areas to seasonal undernutrition. We recommend collaborative work among stakeholders to ensure sustainable food access and minimize seasonal food shortages’ effect on women’s nutrition and overall well-being.","author":"Bethelhem Mezgebe","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"25c5c2180de5e2fa4e17b2752952330d044079d2f6f904d8aeda6cc8753b83c0","category":"Environment"}