{"title":"Comprehensive assessment of combined inorganic and organic fertilization strategies on cotton cultivation: implications for sustainable agriculture","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13673?af=R","date":1719396960000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The integration of inorganic and organic fertilizers is increasingly being recommended to address the demand for sustainable cotton cultivation and to mitigate the ecological impacts of reliance on inorganic fertilizers. However, the nuanced effects of this combined fertilization approach on soil quality, cotton growth, yield, and their interaction mechanisms, remain unclear.</p>\n<h2>METHOD</h2>\n<p>To elucidate this, a 2-year field trial (2022–2023) was conducted, incorporating five fertilization treatments: low inorganic fertilizer (BI1), high inorganic fertilizer (BI2), organic fertilizer (BO), combined low inorganic and organic fertilizer (BIO1), and combined high inorganic and organic fertilizer (BIO2). This study aimed to evaluate the influence of these treatments on soil quality, cotton growth, and yield.</p>\n<h2>RESULTS</h2>\n<p>The results indicate that the BO treatment significantly enhanced plant height growth rate, and BIO1 treatment increased leaf area index and dry matter accumulation growth rate. Critical soil parameters such as alkali-hydrolyzed nitrogen and available potassium emerged as pivotal determinants of soil quality over the trial period, corresponding to soil quality index (SQI) values of 0.482 and 0.478, and yields of 7506.19 kg ha<sup>−1</sup> and 6788.02 kg ha<sup>−1</sup>, respectively. Water productivity reached optimum levels at SQI values of 0.461 and 0.462, with corresponding efficiencies of 13.31 kg (ha mm)<sup>−1</sup> and 12.16 kg (ha mm)<sup>−1</sup>. Partial least squares path modeling revealed that integrating organic fertilizer with reduced inorganic fertilizer usage significantly boosts cotton yield by enhancing soil quality (path coefficient: 0.842).</p>\n<h2>CONCLUSION</h2>\n<p>In conclusion, this integrated fertilization strategy not only improves soil health but also increases agricultural productivity. It presents a promising approach for optimizing crop yields while fostering sustainable agricultural practices. © 2024 Society of Chemical Industry.</p>","author":"Shudong Lin, \nQuanjiu Wang, \nKai Wei, \nXue Zhao, \nWanghai Tao, \nYan Sun, \nLijun Su, \nMingjiang Deng","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"25c7298ee8fc9c36daa44404985826fcf7bc124eb4285c7ab509ba854927bbb0","category":"Environment"}