{"title":"Twitter Accuses Meta of Poaching Employees to Build Threads","link":"https://www.macrumors.com/2023/07/06/twitter-accuses-meta-of-poaching-employees/","date":1688676051000,"content":"Twitter appears to be unhappy with the runaway success of Threads, Meta's Twitter alternative <a href=\"https://www.macrumors.com/2023/07/05/instagram-threads-app-now-available/\">that launched last night</a>. Threads has amassed more than 30 million users in under 24 hours, making it the biggest threat to Twitter to date.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/03/Twitter-Feature.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\n<a href=\"https://www.semafor.com/article/07/06/2023/twitter-is-threatening-to-sue-meta-over-threads\">According to <em>Semafor</em></a>, Twitter lawyer Alex Spiro yesterday sent Meta CEO Mark Zuckerberg a letter [<a href=\"https://cdn.sanity.io/files/ifn0l6bs/production/27109f01431939c8177d408d3c9848c3b46632cd.pdf\">PDF</a>] accusing Meta of \"systemic, willful, and lawful misappropriation of Twitter's trade secrets and other intellectual property.\"\r<br />\n\r<br />\nTwitter claims that Meta hired \"dozens\" of former Twitter employees that \"had and continue to have access to Twitter's trade secrets and other highly confidential information.\" The company further says that the employees \"improperly retained Twitter documents and electronic devices,\" and that Meta took advantage of this to have those workers develop the \"copycat\" Threads app on an accelerated timeline.\r<br />\n\r<br />\nWhen Elon Musk took over as CEO of Twitter, he fired thousands of employees who then had to look for work. It is likely that some of those employees transitioned to Meta, but hiring people actively looking for a job is typically considered poaching.\r<br />\n\r<br />\n<div><blockquote><p>Competition is fine, cheating is not</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1677042708756439041?ref_src=twsrc%5Etfw\">July 6, 2023</a></blockquote> </div>\r<br />\nTwitter's letter says that it plans to \"enforce its intellectual property rights,\" with the company demanding that Meta \"take immediate steps to stop using any Twitter trade secrets.\" Twitter threatens that it reserves the right to seek \"civil remedies and injunctive relief\" to prevent Meta from using its intellectual property.\r<br />\n\r<br />\nAlong with claims that Meta poached Twitter employees to develop Threads, Twitter says that Meta is \"expressly prohibited\" from scraping Twitter's followers or following data. Twitter is asking Meta to \"preserve any documents\" that could be relevant to a future dispute, suggesting that Twitter might be planning to file a lawsuit in the future.\r<br />\n\r<br />\nTwitter has not gone after other Twitter-like social networks that include Bluesky and Mastodon, but Threads is a newly-launched app that is built off of Instagram, giving it a notable user base from its debut. Mastodon and Bluesky have far fewer users. In February, for example, Mastodon had <a href=\"https://www.wired.com/story/the-mastodon-bump-is-now-a-slump/\">1.4 million active users</a>, while Bluesky <a href=\"https://techcrunch.com/2023/07/06/what-is-bluesky-everything-to-know-about-the-app-trying-to-replace-twitter/\">had 50,000 users</a> at the end of April.\r<br />\n\r<br />\nFollowing Twitter's accusations, <a href=\"https://www.threads.net/t/CuXeGudAEXr/\">Meta's communications director Andy Stone</a> said that no one on the Threads engineering team is a former Twitter employee. \"That's just not a thing,\" he wrote.<div>Tag: <a href=\"https://www.macrumors.com/guide/twitter/\">Twitter</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/06/twitter-accuses-meta-of-poaching-employees/\">Twitter Accuses Meta of Poaching Employees to Build Threads</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/twitter-accuses-meta-of-poaching-employees-to-build-threads.2395229/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"25c8debb2195c123f28d8acfaab114c9d7913314a8d40a37f5b7dcd2b7d74979","category":"Apple"}