{"title":"Technology Innovation for Discovering Renal Autoantibodies in Autoimmune Conditions","link":"https://www.preprints.org/manuscript/202408.1027/v1","date":1723682585000,"content":"Autoimmune Glomerulonephritis represents a homogeneous area of renal pathology with clinical relevance for either the numerical impact or difficulties in treatment. SLE and Lupus nephritis are the most frequent occurrences. They are characterized by glomerular deposition of circulating autoantibodies that recognize glomerular antigens Technologies for studying tissue and circulating antibodies have evolved over the years and culminated with the direct analysis of the antigen-antibody complex in renal bioptic fragments. Mass-spectrometry of immunoprecipitates from the renal tissue is, in fact, the most recent evolution that eliminates the need for tissue microdissection. The results obtained with this technique have led to the discovery of several new glomerular antigens in Membranous Nephropathy and in Lupus Nephritis, two conditions whose pathogenesis remained unknown for decades, Peptide and protein arrays (Immunopeptidomics and immunoproteomics, respectively) for the characterization of circulating autoantibodies represent the new frontier for identifying autoantibodies. Immunopeptidomics consists in 7.5 million aligned peptides of 16 amino acids each which cover the whole human proteome; immunoproteomics utilizes a chip containing structured proteins, 26.000 overall. Both are very sensitive techniques that allow the characterization of hundreds of new antibodies in circulation. The contribution of arrays to amplify the panel of potential autoantibodies involved in glomerulonephritis is expected to be relevant for improving our knowledge of the pathogenesis of several autoimmune conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"25daec0643f4a72bddeb9efd04f93e4ad0489f202ce07ef11928b7f0ef0cd7ae","category":"Interdisciplinary"}