{"title":"The role of supermountain belts and climatic controls on the genesis of copper deposits in the Kupferschiefer and the Central African Copperbelt","link":"http://link.springer.com/10.1007/s00126-023-01227-2","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Sedimentary rock–hosted stratiform copper deposits are the world’s second largest source of copper and the largest source of cobalt, with about 73% of the copper occurring in two basins: the Katangan Basin (Central African Copperbelt) and the Permian Basin (Kupferschiefer). Why these two sedimentary basins are so highly endowed in copper is puzzling because sedimentary rock–hosted stratiform copper deposits have formed since the Paleoproterozoic and they all share remarkably similar ore mineralogy, host-rock characteristics and basin settings. We suggest that this discrepancy is due to the development of these two basins close to the bases of ~ 8000-km-long supermountain belts. The supermountain belts were instrumental in raising oxygen levels in Earth’s atmosphere, as well as providing a voluminous source of groundwater and a powerful and long-lived driver for the fluid-flow system. The elevated oxygen levels facilitated the diagenetic processes that converted copper-bearing labile minerals to amorphous iron-oxides and smectite and then in turn to hematite and illite. When oxidized brines flushed through the basin successions, the liberated copper was transported to units containing carbon-rich mudstone and the metals were deposited. For the Katangan Basin, development of the Transgondwanan supermountain belt along its margins between about 525 and 510 Ma explains the delay of several hundreds of millions of years between basin formation and mineralization in the Central African Copperbelt. In contrast, development of the Mid-Pangean supermountain belt formed penecontemporaneous with the Permian Basin explains the similarity in timing between basin formation and mineralization in the Kupferschiefer.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"25dbcf33d381e877b72865a3e5a5b5f286e1110cf2358c09653c66452901c424","category":"Environment"}