{"title":"The effect of swimming activity and feed restriction of rainbow trout (Oncorhynchus mykiss) on water quality and fish‐plant growth performance in aquaponics","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15697?af=R","date":1716279641000,"content":"<h2>Abstract</h2>\n<p>In this study, we investigated the effects of swimming activity and feed restriction on juvenile rainbow trout (<i>Oncorhynchus mykiss</i>) in decoupled aquaponic systems. Our focus was on assessing their impact on water quality parameters within the aquaponic setup and evaluating the growth performance of the fish, including final weight (FW), condition factor (<i>K</i>), coefficient of variation (<span>c.v.</span>) in weight, specific growth rate (SGR), total feed intake (g/fish), feed conversion rate (FCR), hepatosomatic index (HSI), and viscerosomatic index (VSI), as well as the growth of lettuce (<i>Lactuca sativa</i> L. var. elmaria). The study involved 108 juvenile rainbow trout with an average initial weight of 26.54 ± 0.36 g and 60 ten-day-old lettuce seedlings, over a period of 42 days. We designed four treatment groups, each with three fish tanks: static ad libitum (SA), where fish were in static water conditions and fed to satiation; static restriction (SR), with fish in static water and a 25% feed restriction; current ad libitum (CA), where fish experienced forced swimming at 1 BL s<sup>−1</sup>; and current restriction (CR), with swimming exercise at 1 BL s<sup>−1</sup> and a 25% feed restriction. Using a flow rate of 1 BL s<sup>−1</sup> in the tanks for rainbow trout yielded several benefits. Notably, the fish in the CA group exhibited increased feed intake (60 ± 1.78 g fish<sup>−1</sup>) and enhanced fish growth with an FW of 91.72 ± 0.91 g, compared to the SA group (55.88 ± 0.88 g fish<sup>−1</sup> for feed intake and 89.26 ± 0.81 g for FW). In contrast, the CR group showed a reduced feed intake (39.02 ± 2.78 g fish<sup>−1</sup>) and a lower FW (67.85 ± 1.49 g) compared to the CA group. In addition, the CA group demonstrated positive contributions to fish development with a reduced HSI (1.26 ± 0.02) in comparison to the SA group (1.56 ± 0.14). Inadequate nutrient provisioning in the SR and CR groups negatively impacted fish growth and system efficiency. Our findings suggest that optimizing water flow and feed benefits fish and plants and enhances system sustainability.</p>","author":"Gökhan Tunçelli, \nDevrim Memiş","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"25e2adb9929e0a1e6a9833aa96b222761f71b1318f95c0a9d9d276e30159d0b4","category":"Environment"}