{"title":"Ecotoxicological assessment, in freshwater environment, of wastewater sludge coupled and uncoupled with micro‐polyvinyl chloride on algae and water fleas","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11089?af=R","date":1722841200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/222004eb-2fcd-442d-b643-c160e0a306f9/wer11089-toc-0001-m.png\" alt=\"Ecotoxicological assessment, in freshwater environment, of wastewater sludge coupled and uncoupled with micro-polyvinyl chloride on algae and water fleas\" />\n<p>From this investigation, it emerged that the same toxicants' exposure, supplied at different trophic level, affects differently <i>S. capricornutum</i> and <i>D. magna</i>. In particular, the primary consumer is most negatively affected at the highest WS concentration supplied.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>In the frame of bioeconomy and circular economy, wastewater sludge (WS) could be a good candidate for its use in agriculture as fertilizer, due to its high content of organic matter, N and P, but on the other hand, it is full of toxicants such as heavy metal, microplastics, detergent, antibiotics, and so on that can reach groundwater and water bodies in leachate form. In this study, we have investigated different sludge concentrations in the eluate form, combined and not with PVC on two different freshwater organisms <i>Selenastrum capricornutum</i> and <i>Daphnia magna</i>, using ecotoxicity tests. At the endpoint, we have evaluated inhibition growth rate, oxidative stress, and pigments production for <i>S. capricornutum</i>, while in case of <i>D. magna</i>, we have assessed organism immobilization and development. From our results, it emerged that at the higher WS concentration, there was not inhibition growth rate, while at oxidative stress, it was higher in algae treated with WS and PVC. Higher Chl-a production was shown for algae treated with 0.3 g/L of sludge coupled with PVC, where higher phaeopigments production were recorded for algae treated with 0.3 g/L of WS. <i>D. magna</i> has shown an opposite trend when compared with algae, where at the highest WS concentrations supplied was corresponding to an increased mortality explaned as the highest immobility percentage.</p>\n<h2>Practitioner Points</h2>\n<p>\nWastewater sludge is used in agriculture as fertilizer.\nPVC microplastic presence and associate ecotoxicity was tested.\nPVC presence increased oxidative stress in <i>S. capricornutum</i>.\n<i>D. magna</i> was significantly affected by sludge concentrations supplied.\n</p>","author":"Sara Pignattelli, \nFrancesca Provenza, \nDarian Rampih, \nAlfonso Crisci, \nMonia Renzi","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"25e67f721bd55fa93f38a62c8fac37bd293405a716468ce1e500065564592a17","category":"Environment"}