{"title":"Top Stories: visionOS SDK, iOS 17 Beta 2, and More","link":"https://www.macrumors.com/2023/06/24/top-stories-visionos-sdk/","date":1687611600000,"content":"It's been two weeks since WWDC wrapped up, and this week saw Apple release the second round of betas of its upcoming operating system updates introduced at the conference, plus the initial release of developer tools and a simulator needed to allow developers to build apps for the Vision Pro headset.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/top-stories-24jun2023.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThis week also saw another iPhone 15 rumor while we continue to dig into all of the changes in iOS 17, so read on below for a few tidbits we've seen over the past week!\r<br />\n\r<br />\n<h2>Vision Pro Developer Tools Now Available With New visionOS SDK</h2>\r<br />\nApple this week <a href=\"https://www.macrumors.com/2023/06/21/apple-vision-pro-sdk/\">released a visionOS SDK</a>, allowing developers to start creating apps for the Vision Pro headset ahead of its launch in early 2024. Apple has also made a <a href=\"https://www.macrumors.com/2023/06/21/apple-releases-first-ever-visionos-beta/\">visionOS simulator available in Xcode 15 beta 2</a> on the Mac that offers an emulated Vision Pro experience.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/apple-vision-pro-sdk.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThe visionOS developer tools are available for Apple Developer Program members at developer.apple.com.\r<br />\n\r<br />\nStarting in July, developers will also be able to apply for a Vision Pro developer kit and have the opportunity to attend developer labs in Cupertino, London, Munich, Shanghai, Singapore, and Tokyo.\r<br />\n\r<br />\n<h2>Video: A First Look at visionOS for the Apple Vision Pro</h2>\r<br />\nOn our YouTube channel, we have shared a <a href=\"https://www.macrumors.com/2023/06/22/visionos-hands-on/\">video offering a first look at the visionOS simulator</a> in Xcode. The simulator provides access to apps like Safari and Settings, Control Center, and more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/visionOS-Demo-Thumb-2.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThe simulator offers a much more limited visionOS experience than will be available on the actual Vision Pro, but it provides a preview of what to expect when the device launches to the public early next year.\r<br />\n\r<br />\n<h2>Everything New in iOS 17 Beta 2</h2>\r<br />\nApple made the <a href=\"https://www.macrumors.com/2023/06/21/apple-seeds-ios-17-beta-2-to-developers/\">second beta of iOS 17</a> available to developers this week for testing. As usual, there are a handful of smaller changes in the beta, so <a href=\"https://www.macrumors.com/2023/06/21/everything-new-in-ios-17-beta-2/\">check out our list of everything new</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/General-iOS-17-Feature-Blue-Green.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\niOS 17 developer betas are available to anyone with a free Apple developer account, and a public beta will be available in July. The software update will be released later this year for the iPhone XS and newer.\r<br />\n\r<br />\n<h2>Kuo: iPhone 15 to Have Upgraded Ultra Wideband Chip for Enhanced Vision Pro Integration</h2>\r<br />\nApple's next-generation iPhone 15 models coming later this year will be <a href=\"https://www.macrumors.com/2023/06/19/iphone-15-new-u1-chip-vision-pro-headset/\">equipped with an upgraded Ultra Wideband chip</a> for enhanced compatibility with the Vision Pro headset.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/iphone-15-dummy-models.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\niPhone 11 models and newer are equipped with a U1 chip for spatial awareness. The chip helps to power features such as Precision Finding for AirTags, directional AirDrop, handing off music to a HomePod, and more.\r<br />\n\r<br />\n<h2>iOS 17 and macOS Sonoma Add Passkey Support to Your Apple ID</h2>\r<br />\nStarting with iOS 17, iPadOS 17, and macOS Sonoma, users with an Apple ID will <a href=\"https://www.macrumors.com/2023/06/20/ios-17-macos-sonoma-apple-id-passkey/\">automatically be assigned a passkey</a>, allowing them to sign into their Apple ID with Face ID or Touch ID instead of their password on various Apple sign-in pages, like iCloud.com.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/iOS-17-Passkey-With-Apple-ID-Feature-3.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nPasskey support for Apple IDs will also be available for third-party apps and websites that support the \"Sign in with Apple\" feature, according to Apple.\r<br />\n\r<br />\n<h2>5 New AirDrop Features Coming in iOS 17</h2>\r<br />\nSince its introduction in iOS 7, AirDrop has become the favored way for iPhone users to instantly share photos, videos, documents, and more to nearby Apple devices with relative ease.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/5-New-AirDrop-Features-Feature.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nGiven its widespread popularity, the feature hasn't changed all that much over the years. But this year, Apple is stepping things up a gear by <a href=\"https://www.macrumors.com/2023/06/17/5-new-airdrop-features-for-ios-17/\">bringing several new capabilities to AirDrop</a> that make it even more useful.\r<br />\n\r<br />\n<h3>MacRumors Newsletter</h3>\r<br />\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r<br />\n\r<br />\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/jun-22-2023\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/24/top-stories-visionos-sdk/\">Top Stories: visionOS SDK, iOS 17 Beta 2, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-visionos-sdk-ios-17-beta-2-and-more.2394026/\">Discuss this article</a> in our forums<br /><br />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"25ebd5fbafb42372b17274f5f88b4d9e4285508da25efd34239d8c8e0d733d52","category":"Apple"}