{"title":"Antiproliferative And Ultrastructural Analysis Triggered by Drugs Contained In The Medicines for Malaria Venture Covid-Box Against Toxoplasma gondii Tachyzoites","link":"https://www.preprints.org/manuscript/202408.1034/v1","date":1723628104000,"content":"Toxoplasma gondii is a protozoan and the etiologic agent of toxoplasmosis causes high mortality in immunocompromised individuals and newborns. Despite the medical importance of toxoplasmosis, few drugs are available for its treatment, which are associated with side events and parasite resistance. Here, we show a screening of molecules present in Covid-Box as a way of discovering new hits with anti-T. gondii activity. Covid-Box contains 160 molecules with known or predicted activity against SARS-CoV-2. Our analysis selected 23 Covid-Box molecules that can inhibit the tachyzoite forms of the RH strain of T. gondii in vitro by more than 70% at 1 µM after seven days of treatment. The inhibitory curves showed that most of these molecules inhibited the proliferation of tachyzoites with IC50 values below 0.80 µM; Cycloheximide and (-)-Anisomycin were the most active drugs, with IC50 values of 0.02 μM. Cell viability assays showed that the compounds are not toxic at active concentrations, and most are highly selective for parasites. Overall, all 23 compounds were selective, and for three of them (Apilimod, Midostaurin, and Salinomycin), this is the first report of activity against T. gondii. To better understand the effect of the drugs, we analyzed the effect of six of them on the ultrastructure of T. gondii using transmission electron microscopy. The main changes observed in parasite morphology after treatment with the selected drugs were changes in cell division and parasite organelles","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"25ec9e0df8d8284ab8d497af8a4e01c02cd093ad43136bdc27198cd817129944","category":"Interdisciplinary"}