{"title":"<i>CHRM3 (rs2165870)</i> gene polymorphism is related to postoperative vomiting in female patients undergoing laparoscopic surgery. Prospective observational study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309136","date":1724162400000,"content":"<p>by Meng Cai, Lin Gan, Jing Li, Xiaofeng Lei, Jin Yu</p>\r\nBackground <p>Postoperative nausea and vomiting are common complications after surgery, and female patients are more likely to experience these adverse events. The goal of this study was to explore the relationship between the <i>CHRM3 rs2165870</i> polymorphism and postoperative vomiting incidence in female patients who underwent laparoscopic surgery.</p> Methods <p>Two hundred female patients who underwent elective laparoscopic surgery with subsequent patient-controlled intravenous analgesia using dexmedetomidine and sufentanil were prospectively enrolled. The <i>CHRM3 rs2165870</i> and <i>KCNB2 rs349358</i> polymorphisms were genotyped using MassARRAY SNP typing technology. Demographic data and preoperative laboratory results of all patients were recorded. Postoperative analgesia-related information, incidence of postoperative nausea and vomiting, and other adverse events were followed up and recorded for analysis.</p> Results <p>No significant differences were observed in any of the demographic characteristics of these patients among the different genotype carriers (<i>P</i>&gt;0.05). The percentages of patients with each genotype of <i>CHRM3</i> were 67% (GG), 28.5% (GA) and 4.5% (AA). We found that the AA or A allele of the <i>CHRM3 rs2165870</i> polymorphism elevated the risk of postoperative vomiting (AA versus GG; OR, 6.94; 95% CI, 1.49–32.46; <i>P</i> = 0.014; A versus G; OR, 2.52; 95% CI, 1.22–5.19; <i>P</i> = 0.012). The percentages of patients with each genotype of <i>KCNB2</i> were 84.5% (TT), 15.5% (CT) and 0% (CC). There were no significant differences in the postoperative nausea or vomiting rate across the <i>KCNB2 rs349358</i> polymorphisms (<i>P</i>&gt;0.05).</p> Conclusion <p>The <i>CHRM3 rs2165870</i> polymorphism is associated with the occurrence of postoperative vomiting in female patients who have undergone laparoscopic surgery. The AA genotype or A allele of the <i>CHRM3 rs2165870</i> polymorphism elevates the risk of postoperative vomiting.</p> Trial registration <p>www.chictr.org.cn, registration number: ChiCTR2200062425.</p>","author":"Meng Cai","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"25fbc30032b69a0adc03c47fa9aa9ba4e790d0f068911f4f3fc98b1003cd3d64","category":"Interdisciplinary"}