{"title":"Artificially Controlled Nanoscale Chemical Reduction via Electron Beam Illumination","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.538/7719977?rss=1","date":1721779200000,"content":"<span>Chemical reduction is one of the most generic and essential reactions in solid state chemistry, which could drastically change the physical and chemical properties of functional materials [<a href=\"#ozae044.538-B1\">1</a>, <a href=\"#ozae044.538-B2\">2</a>]. In complex oxides, this reaction is usually dominated by the formation of oxygen vacancy [<a href=\"#ozae044.538-B3\">3</a>], and the incorporation of oxygen vacancies through chemical reduction forms an important pathway to manipulate the ground state of strongly correlated materials, as every oxygen vacancy would donate two electrons into the lattice. Furthermore, the oxygen vacancy forms an indispensable ingredient for the manipulation of ionic conductivity [<a href=\"#ozae044.538-B4\">4</a>] and catalysis [<a href=\"#ozae044.538-B5\">5</a>] properties, as well as demonstrates novel approaches to design advanced piezoelectric [<a href=\"#ozae044.538-B6\">6</a>] and magnetoelectric [<a href=\"#ozae044.538-B7\">7</a>] couplings. Conventionally, the thermal treatment within the reducing environment or chemical agents forms the most accessible method to achieve this purpose as it can dramatically modify the thermodynamic phase diagram of the bulk compounds. However, this approach faces its fundamental limitation for functional miniaturization, as the whole sample would undergo the identical environment. Alternative approaches, using electric-field [<a href=\"#ozae044.538-B8\">8</a>, <a href=\"#ozae044.538-B9\">9</a>], ultraviolet light [<a href=\"#ozae044.538-B10\">10</a>] or scanning tip [<a href=\"#ozae044.538-B11\">11-13</a>], etc., have been proposed and demonstrated to manipulate the thermodynamic stability at the microscale, while nanoscale control is still of great challenge, as these methods are constrained by the corresponding intrinsic length scales.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"260b725939a0fd9ae145ce291dad91e26eca6ca029cef599901445fc6f867680","category":"Environment"}