{"title":"iFixit says the Playdate is a surprisingly repairable Game Boy throwback","link":"https://arstechnica.com/?p=1789401","date":1629822774000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/ifixit-playdate-1-980x735.jpg\" /></div>\n        <p>\n          The Playdate on iFixit's operating table.                       [credit:\n                        <a href=\"https://www.ifixit.com/Teardown/Playdate+Teardown/143811\">iFixit</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>The teardown artists at iFixit have <a href=\"https://www.ifixit.com/Teardown/Playdate+Teardown/143811\">gotten their hands on</a> the banana-yellow plastic Playdate, the be-cranked retro throwback handheld gaming system <a href=\"https://arstechnica.com/gaming/2021/07/playdate-preview-you-wont-believe-how-fun-this-dorky-179-game-system-is/\">we previewed last month</a> ahead of its launch later this year. And just as Game Boys of yore are simple to <a href=\"https://arstechnica.com/features/2018/04/how-to-make-your-old-game-boy-as-good-as-or-better-than-new/\">take apart, fix, and rebuild</a>, the Playdate will be relatively easy to fix if you ever need to replace its battery or buttons.</p>\n<p>The most interesting findings: The Playdate's signature crank uses a Hall effect sensor rather than a spring or another kind of wear-out-able physical mechanism, so it shouldn't suffer from drift over time like some console controller joysticks do. And while there is a warranty sticker inside the Playdate, it specifically says that you'll void the system's warranty if you break anything inside it, <em>not</em> that you'll void it just by taking the system apart. This strikes a good balance between \"don't come in here if you don't know what you're doing\" and \"we trust you to make your own repairs if you need to.\"</p>\n<p>The teardown also gives us a few specifics on the Playdate's intentionally low-powered hardware, which includes a 216MHz ARM Cortex M7 processor, 128 megabits (or 16MB) of RAM, and 4GB of eMMC storage. The one major complaint iFixit had is that the LCD screen appears to be glued to the front of the Playdate—replacing the screen will probably necessitate replacing the entire rest of the casing as well. But since the front of the Playdate is simple yellow plastic rather than metal and glass, this part shouldn't cost as much as it does when your phone's screen breaks.</p></div><p><a href=\"https://arstechnica.com/?p=1789401#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1789401&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"26147cb97937f8ac5e08347d0854b40f857fae3b0c1b73d9eae63cbf31ad29c0","category":"Tech"}