{"title":"Coastal Copper Tailings Dispersal: 3D Mapping And Shoreline Impacts, Particle Migration, Leaching, And Toxicity","link":"https://www.preprints.org/manuscript/202404.0945/v1","date":1713169942000,"content":"Tailings generated by mining account for the largest proportion of global waste from industrial activities. Copper is relatively uncommon world-wide, with low concentrations in sediments and waters, yet is very elevated around mining sites. On the Keweenaw Peninsula of Michigan, USA, jutting out into Lake Superior, 140 mines extracted native copper from the Portage Lake Volcanic Series, part of an intercontinental rift system. Between 1901-1932, two mills at Gay (Mohawk, Wolverine) sluiced 22.7 million metric tonnes (MMT) of copper-rich tailings (stamp sands) into Grand (Big) Traverse Bay. Here we examine: 1) 3D coastal elevation and reef bathymetry, 2) particle dispersal, 3) copper concentrations and leaching, plus 4) shoreline toxicity. About 10 MMT of tailings created a migrating coastal beach that stretches 7 km from the Gay pile to the Traverse River Seawall. Another 10 MMT are moving underwater on the coastal shelf, threatening Buffalo Reef, an important lake trout and whitefish breeding ground. Aerial photos, ALS (plane) LiDAR, and relatively inexpensive UAS (drone) surveys characterize shoreline structure and aid initial remediation. Because sands (natural beach quartz, stamp sand basalt) are silicates of similar density, particle dispersal is similar and challenging. However, stamp sand beaches contrast greatly with natural sand beaches in both physical profile and chemistry. Dispersing particles retain copper, and release toxic concentrations. Leaching is elevated by exposure to high DOC and low pH waters. Field experiments, shoreline seining, and benthic sampling confirm serious impacts on aquatic biota, supporting tailings removal.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"261a3c471eeaa4a165fa0cd33016623820ff9bfbe2d30ab78df5cefab386699a","category":"Interdisciplinary"}