{"title":"Exploring the cyanobacterial diversity in Portugal: Description of four new genera from LEGE‐CC using the polyphasic approach","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13502?af=R","date":1729597128000,"content":"<h2>Abstract</h2>\n<p>Culture collections such as the Blue Biotechnology and Ecotoxicology Culture Collection (LEGE-CC) hold approximately 1200 cyanobacterial strains and are critical community resources. However, many isolates in this and other collections have not been described with a polyphasic approach, and this limits further study. Here, we employed a polyphasic methodology that integrates 16S rRNA gene phylogenetic analyses, similarity (<i>p</i>-distance), 16S-23S ITS rRNA region secondary structures, morphological analyses, and habitat assessments to describe four novel cyanobacterial genera from the LEGE-CC, Portugal. <i>Pseudolimnococcus planktonicus</i> gen. et sp. nov. (Chroococcales) is phylogenetically and morphologically related to <i>Limnococcus</i>. The 16S rRNA gene similarity between the types of both genera is only 93.1%. Morphologically, <i>Pseudolimnococcus</i> cells do not reach the original spherical shape before the next division or have aerotopes and firm mucilage, while <i>Limnococcus</i> cells reach the original shape, lack aerotopes, and have diffluent mucilage. <i>Eucapsopsis lusitanus</i> gen. et sp. nov. (Chroococcales) is morphologically similar to <i>Eucapsis</i> but differs from it by having aerotopes and diffluent envelope. <i>Eucapsis</i> lacks aerotopes and has firm mucilaginous envelopes, rarely diffluent. Both genera are phylogenetically very distant from each other and have only 90.68% 16S rRNA gene similarity. <i>Pseudoacaryochloris arrabidensis</i> gen. et sp. nov. (Acaryochloridales) differs from <i>Acaryochloris</i> by the lack of mucilaginous envelope, which is present in <i>Acaryochloris</i>. Both genera are phylogenetically distant and have only 94.1% 16S rRNA gene similarity. Moreover, <i>Acaryochloris</i> is marine (sponge symbiont), while <i>Pseudoacaryochloris</i> is from freshwater. <i>Vasconcelosia minhoensis</i> gen. et sp. nov. (Nodosilineales) is phylogenetically related to <i>Cymatolege</i> but has only 94.3% similarity with this genus. Morphologically both genera are distinct. <i>Vasconcelosia</i> has a <i>Romeria</i>-like structure, while <i>Cymatolege</i> has a <i>Phormidium</i>-like structure. In all cases the 16S-23S ITS rRNA region secondary structures are in agreement with the other analyses. These novel genera expand the diversity of cyanobacteria in culture collections.</p>","author":"Flavio Luis de Oliveira, \nGuilherme Scotta Hentschke, \nJoão Morais, \nRaquel Silva, \nPedro Cruz, \nVitor M. Vasconcelos","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"2623f6905cedb82f5c0e71ec38f19239bb6ed2ea730910962203097e3515c846","category":"Environment"}