{"title":"PSIX-7 A multi-strain probiotic modifies fecal microbial populations of healthy adult dogs","link":"https://academic.oup.com/jas/article/102/Supplement_3/578/7757518?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Probiotics can modulate the intestinal microbiota and benefit the health of the host, whereas environmental stressors can negatively impact the composition of the intestinal microbiota. Lactic acid bacteria (LAB), most commonly <span>Lactobacillus</span> and <span>Bifidobacterium</span> species, are well-known organisms with probiotic potential. The objective of this study was to determine the impact on the fecal microbial population of healthy dogs, after ingestion of a probiotic blend of <span>Lactobacillus acidophilus</span>-286, <span>Bifidobacterium animalis subs. Lactis</span>-689, and <span>Enterococcus faecium</span>-202. Adult dogs [n = 30; 15 male, 15 female; mean body weight (BW) = 14.7 kg; mean age = 3.3 yr) were enrolled in this placebo-controlled and blinded study. After a 7-d washout period, dogs were allocated into two groups similar in terms of breed, BW, age, and sex. Dogs were fed a complete dry extruded diet and at time 0 h on d 0 received orally 4 g of a placebo paste or probiotic paste corresponding to the target dose of 4x10<sup>7</sup> total CFU. Administration of the placebo or probiotic was repeated 12 h and 24 h after the first dose. Afterward, fecal scores were evaluated daily for 7 d. Fresh fecal samples were collected on d 0, 3, and 7 for microbial enumerations and fecal metabolite measurements. Fecal microbial count data did not conform to the assumptions of normality and homogeneity of variances, consequently, non-parametric tests were performed for comparisons. Fecal scores, dry matter, and metabolites were not different between groups. Fecal counts of <span>Lactobacillus spp</span>., <span>Bifidobacterium spp.</span>, and <span>Enterococcus spp.</span> were greater on both d 3 and d 7 (<span>P</span> &lt; 0.01) in dogs that consumed probiotics. Fecal counts of both <span>Escherichia coli</span> and <span>Clostridium perfringens</span> were fewer (<span>P</span> &lt; 0.01) in dogs that consumed probiotics. In conclusion, the consumption by dogs on d 0 of a probiotic blend of <span>Lactobacillus acidophilus</span>-286, <span>Bifidobacterium animalis subs. Lactis</span>-689, and <span>Enterococcus faecium</span>-202 modified the intestinal microbiota up to 7 d after consumption, as evidenced by the increase of lactic acid bacteria and the decrease of Escherichia coli and <span>Clostridium perfringens</span> in feces.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"2624abbebc459c13fa8a555a392cd12938a04fdafd51793e64d04e42752fcaa0","category":"Environment"}