{"title":"Apple's iPhone 15 Event Page Goes Live, Features Animation Instead of AR Easter Egg","link":"https://www.macrumors.com/2023/08/29/apple-iphone-15-event-page/","date":1693327731000,"content":"Following the announcement of an upcoming September 12 iPhone-centric event, Apple has <a href=\"https://www.apple.com/apple-events/\">made its Events page live</a> with details on timing, how to watch, and more. The <a href=\"https://www.macrumors.com/guide/apple-event/\">Apple Event</a> page is updated ahead of every event, and typically features an interactive augmented reality easter egg viewable on iOS devices, but Apple did not create one this time around.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/apple-2023-event.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nRather than an AR experience, the Events page features an animated Apple logo made from grains of a metallic material. The grains float off into the distance continually, for a swirling effect. It has not gone unnoticed that the Apple logo is a metallic gray and blue shade, which happen to be two of the colors rumored for the upcoming <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> and ‌iPhone 15 Pro‌ Max.\r<br />\n\r<br />\nThe two higher-end <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> models will feature a titanium frame instead of a stainless steel frame, with a brushed titanium finish that will look different than the shiny stainless steel. Color options are said to include a titanium gray shade (similar to the color of the <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra</a>), a blue gray color, a black shade, and a lighter silver shade.\r<br />\n\r<br />\nApple's tagline for the event is \"Wonderlust,\" a play on the word wanderlust.\r<br />\n\r<br />\nThe September 12 event will take place at 10:00 a.m. Pacific Time. There will be an in-person component for some YouTubers and members of the media, but the majority of people will watch online through the Apple Events page in any browser, on YouTube, or through the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> app on compatible devices. The event is prerecorded, similar to last year's event.\r<br />\n\r<br />\n<div><blockquote><p>Wonder awaits. September 12. <a href=\"https://twitter.com/hashtag/AppleEvent?src=hash&amp;ref_src=twsrc%5Etfw\">#AppleEvent</a> <a href=\"https://t.co/48gRXu3Ux4\">pic.twitter.com/48gRXu3Ux4</a></p>— Greg Joswiak (@gregjoz) <a href=\"https://twitter.com/gregjoz/status/1696558706857594970?ref_src=twsrc%5Etfw\">August 29, 2023</a></blockquote> </div>\r<br />\nFor those unable to watch, MacRumors will be providing full event coverage on MacRumors.com and the <a href=\"https://twitter.com/macrumorslive\">MacRumorsLive Twitter account</a>. We'll cover the event live, and we'll also have in-depth coverage of the announcements in the following days.<div>Tag: <a href=\"https://www.macrumors.com/guide/september-2023-apple-event/\">September 2023 Apple Event</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/29/apple-iphone-15-event-page/\">Apple's iPhone 15 Event Page Goes Live, Features Animation Instead of AR Easter Egg</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-iphone-15-event-page-goes-live-features-animation-instead-of-ar-easter-egg.2399943/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"26294ecf25717e7d9f52ce4b6bace358534728da53e2f1f8d43301a7e5726dd8","category":"Apple"}