{"title":"Species composition of dung beetles (Scarabaeiade: Scarabaeinae) from different habitat types in a protected area in eastern Africa","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13298?af=R","date":1721235309000,"content":"<h2>Abstract</h2>\n<p>Understanding the composition and distribution of dung beetle species across various habitat types is crucial for elucidating their ecosystem functions. Dung beetles play pivotal roles in ecological processes such as nutrient cycling, seed dispersal and parasite suppression. Despite numerous studies on the influence of habitat types on dung beetle communities, knowledge gaps persist, particularly on how these beetles respond to different vegetation types in protected areas. In this study, we surveyed dung beetle species in Nyerere National Park, Tanzania, using baited pitfall traps across four habitat types: closed miombo woodland, open miombo woodland, marshland and riverine. We identified a total of 5534 individuals representing 63 species, 29 genera and nine tribes. Significant variations in species diversity were observed among the habitats, with the closed miombo woodland exhibiting the highest diversity and the open miombo woodland the lowest. Notably, certain species, such as <i>Euoniticellus intermedius</i>, <i>Euonthophagus carbonarius</i>, <i>Gymnopleurus ignites</i>, <i>Onitis alexis</i>, <i>Onthophagus</i>, <i>Onthophagus vinctus</i>, <i>Onthophagus plebejus</i> and <i>Sisyphus goryi</i> displayed a generalist distribution across all habitat types. Our findings underscore the critical importance of maintaining and conserving the quality of diverse habitat types to ensure the long-term preservation of dung beetle biodiversity and the ecosystem services they provide. This study contributes valuable insights into dung beetle ecology and offers practical implications for ecosystem management and conservation strategies.</p>\n<h2>Résumé</h2>\n<p>Il faut comprendre la composition et la répartition des espèces de bousiers dans leurs différents types d'habitats pour élucider leurs fonctions dans l'écosystème. Les bousiers jouent un rôle essentiel dans les processus écologiques tels que le cycle des nutriments, la dispersion des graines et l'élimination des parasites. Malgré les nombreuses études sur l'influence des types d'habitat sur les communautés de bousiers, ils préservent encore beaucoup de mystère, en particulier sur la façon dont ils réagissent aux différents types de végétation dans les zones protégées. Au cours de cette étude, nous avons recensé les espèces de bousiers dans le parc national de Nyerere, en Tanzanie, en utilisant des pièges à fosse appâtés dans quatre types d'habitat : forêt de miombo fermée, forêt de miombo ouverte, marais et rivière. Nous avons recensé au total 5 534 individus représentant 63 espèces, 29 genres et neuf tribus. L'observation a permis de constater des variations significatives de la diversité des espèces selon les habitats, la forêt de miombo fermée présentant la plus grande diversité et la forêt de miombo ouverte la plus faible. Nous avons noté que certaines espèces telles que <i>Euoniticellus intermedius</i>, <i>Euonthophagus carbonarius</i>, <i>Gymnopleurus ignites</i>, <i>Onitis alexis</i>, <i>Onthophagus</i>, <i>Onthophagus vinctus</i>, <i>Onthophagus plebejus</i> et <i>Sisyphus goryi</i> présentaient une distribution fréquente dans tous les types d'habitats. Nos résultats soulignent l'importance cruciale du maintien et de la conservation de la qualité des divers types d'habitats afin d'assurer la préservation à long terme de la biodiversité des bousiers et des services écosystémiques qu'ils fournissent. Cette étude éclaire de façon pertinente l'écologie des bousiers et débouche sur des pistes pratiques pour la gestion des écosystèmes et les stratégies de conservation.</p>","author":"Evaristo A. Bruda, \nGeofrey Soka, \nEmmanuel Masenga, \nGimo M. Daniel, \nEblate Mjingo","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"263dda3030046beef283a56cda31b2673765c7f2e7d3de0a1ea348fe96acf0a6","category":"Environment"}