{"title":"Farmed fish welfare research status in Latin America: A review","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15854?af=R","date":1721097019000,"content":"<h2>Abstract</h2>\n<p>Latin America (LATAM) plays an important role in the world's production of aquatic animals and is the second most productive region in the world. Chile, Ecuador, Brazil, Mexico, Colombia, and Perú contribute 87% of LATAM aquaculture production. The fish welfare in aquaculture is of increasing public concern globally, and LATAM is no exception, growing in importance for fish farmers, authorities, and scientists. Although the topic is somewhat controversial, the welfare status of farmed fish has direct implications for their production and the sustainability of the industry. Therefore, this study analyses scientific papers on animal welfare in farmed fish, from the six countries in LATAM with the highest aquaculture production. The main objectives were to quantify the number of papers published between 2000 and 2023 on fish welfare by using scientific databases. A total of 285 papers were found for the period analysed. The country with the largest number of publications was Brazil (75.79%), followed by Chile (13.33%), Mexico (7.02%), Peru (1.75%), Ecuador, and Colombia (1.05%). Nile tilapia was the most studied species, appearing in 30.18% of the publications, with most of the studies mainly dealing with nutrition (32.28%). The growth of aquaculture is leading to joint efforts to generate knowledge on welfare issues, especially in poorly studied species with high production, to create policies that help minimize welfare risks. Given this, the insights generated by this review could be a useful addition to approaches investigating the trends and concepts of fish welfare in LATAM.</p>","author":"Joel Fitzgerald Linares‐Cordova, \nAna Roque, \nMaría de Lourdes Ruiz‐Gómez, \nSonia Rey‐Planellas, \nAnaïs Boglino, \nGustavo Alejandro Rodríguez‐Montes de Oca, \nZohar Ibarra‐Zatarain","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"264f0d9e1b423ee7ef7b07629fea21a4c7275d64f96e29f534d7eaa4d73bc17d","category":"Environment"}