{"title":"Marc Rubinstein: ‘The Demise of Silicon Valley Bank’","link":"https://www.netinterest.co/p/the-demise-of-silicon-valley-bank","date":1678565849000,"content":"\n<p>The best explanation of what happened to Silicon Valley Bank is this piece by Marc Rubinstein at Net Interest:</p>\n\n<blockquote>\n  <p>“When you’re not working, what do you do to de-stress?”</p>\n\n<p>That was the last question Greg Becker, CEO of Silicon Valley\nBank, fielded at an investor conference on Tuesday this week.</p>\n\n<p>“Cycling is my advice,” he replied. “Living in Northern California\nand being on the peninsula. That’s just — I think it’s the best\nbike-riding cycling in the world, period.”</p>\n\n<p>Three days later, Becker’s bank is in receivership.</p>\n</blockquote>\n\n<p>Now that’s a lede.</p>\n\n<p>Rubinstein links to <a href=\"https://nongaap.substack.com/p/sivb-held-to-mortem-governance\">this piece at another Substack site</a>, Nongaap Investing, which points to a boy-that-sure-looks-bad-in-hindsight oddity in SVB’s corporate governance: the bank did not have a Chief Risk Officer for most of 2022:</p>\n\n<blockquote>\n  <p>In particular, the most interesting disclosure is the company\ndidn’t have a Chief Risk Officer for much of 2022, and (from what\nI can gather) doesn’t explicitly communicate this to shareholders\nuntil the 2023 Preliminary Proxy is filed on March 8, 2023.</p>\n\n<p>This non-disclosure immediately makes me wonder what caused\nformer Chief Risk Officer Laura Izurieta to leave the role and\ncreate such a glaring hole in risk oversight during such a\ncritical time. [...]</p>\n\n<p>Given that <a href=\"https://www.sec.gov/Archives/edgar/data/719739/000156218021007555/xslF345X03/primarydocument.xml\">Ms. Izurieta sold $4 million worth of shares in\nDecember 2021</a> just before the company would approach her to\nbegin discussions regarding her transition out of the Chief Risk\nOfficer role, I can’t help but wonder if she realized the bank’s\nbalance sheet was a ticking time bomb when she sold the stock.</p>\n\n<p>The optics look pretty bad.</p>\n</blockquote>\n\n<p>Pretty bad indeed.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/11/rubinstein-svb\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"26555bbad37afecdb4e607e2588cb0a62ff0f10edcf8e8c02415ee17011be606","category":"Tech"}