{"title":"How Does Heavy Precipitation of Varying Durations Respond to Urbanization in China?","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004412?af=R","date":1720534334000,"content":"<h2>Abstract</h2>\n<p>Heavy precipitation, which is changing significantly as Earth's climate warms, can result in flooding that seriously damages societies. However, little is known about how heavy precipitation of varying durations responds to the diverse gradients of urban development in China. Through statistical analyses spanning from 1990 to 2021, we have examined shorter-duration (≤3 days) and longer-duration (&gt;3 days) heavy precipitation across a spectrum of urban development, encompassing long-term built-up (LTB), recently built-up (RTB), and rural background catchments within each urban agglomeration catchment (UAC) across China. We find that urbanization primarily influences shorter-duration heavy precipitation, with a more pronounced effect observed in the LTB catchments. Conversely, the influence of urbanization on longer-duration heavy precipitation appears to be more weakened in the RTB catchments. The intensification of shorter-duration heavy precipitation induced by urbanization is more pronounced in humid regions and within larger UACs, while the urban effect on longer-duration heavy precipitation is weaker in humid regions and within larger UACs. Notably, the attribution analysis results of the geographical detector model confirm our findings. Anthropogenic-related factors (population density, nighttime light data, impervious surface percent, land surface temperature) significantly influence shorter-duration heavy precipitation in more UACs than natural factors (distance from the coast, wind and elevation), while natural factors dominate longer-duration events in larger UACs across China. Our results highlight the necessity of considering the spatial difference between the UAC center and UAC periphery for accurate projections and effective prevention of heavy precipitation and potential flood risks in the future.</p>","author":"Xue Xie, \nKairong Lin, \nMingzhong Xiao, \nXudong Zhou, \nGang Zhao, \nDai Yamazaki","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"265a75dd5e37b1d70faa313897b40e0ffd45819bd8ee0add8167a305c2d1f502","category":"Environment"}