{"title":"Activities of daily living, self-efficacy and motor skill related fitness and the interrelation in children with moderate and severe Developmental Coordination Disorder","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299646","date":1713880800000,"content":"<p>by Faiçal Farhat, Marisja Denysschen, Nourhen Mezghani, Mohamed Moncef Kammoun, Adnene Gharbi, Haithem Rebai, Wassim Moalla, Bouwien Smits-Engelsman</p>\r\nBackground <p>Children with Developmental Coordination Disorder (DCD) are diagnosed based on poor motor skills that impact their daily activities. However, this may also lead to lower predilection and participation in physical activities and a higher risk to develop health problems.</p> Objective <p>To determine motor skill related levels in children with moderate and severe DCD and compare that to typically developing children (TD). The study also aimed to determine the level of activities of daily living (ADL) as reported by their parent and self-efficacy as reported by the children. Lastly, the relation of motor skill related fitness, ADL, and self-efficacy has been examined.</p> Methods <p>A cross-sectional study has compared TD children (n = 105) and children with DCD (n = 109; 45 moderate DCD and 64 severe DCD) from elementary schools in Tunisia between 7 and 10 years of age. The DCDDaily-Questionnaire and Children’s Self-perceptions of Adequacy in and Predilection for Physical Activity Questionnaire have been used to determine ADL and adequacy towards physical activity, respectively. The PERF-FIT has been used to measure motor skill related fitness levels.</p> Results <p>Large group differences (p = 0.001) were found for ADL and all domains of self-efficacy between TD and DCD children. However, ADL and self-efficacy were not different between moderate and severe DCD. Motor skill related fitness was significantly lower (p = 0.01) for children with DCD than TD children, and between children with moderate and severe DCD. The relation between self-efficacy and DCDDaily-Q was different in the two DCD groups. Slow motor learning was associated with lower perceived enjoyment in physical education in the moderate DCD group, and with lower perceived adequacy in physical education in the severe DCD group.</p> Conclusions <p>Children with DCD participate and enjoy physical activity less than their peers. This combination of lower participation, lower predilection to physical activity and lowered motor skill-related fitness is a concern for the present and future health status of children with DCD.</p>","author":"Faiçal Farhat","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2662dfa8dd072c4a6505031d6ccaf14365bcae295264da65c0e3c562fb3fc21c","category":"Interdisciplinary"}