{"title":"PSVI-7 A transcriptomic analysis of uterine endometrium from beef heifers of divergent fertility status","link":"https://academic.oup.com/jas/article/102/Supplement_3/537/7757665?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Reproductive failure in beef females is one of the most prevalent issues in the cow-calf industry. One of the key contributing factors is early pregnancy loss caused by a poor uterine environment, specifically uterine signaling and receptivity. Here, we investigated the expression profiles of endometrial genes from heifers classified as fertile (conceptus present after artificial insemination (AI)) or sub-fertile (conceptus absent after AI and natural bull breeding). Before the breeding season, a cohort (n = 51) of crossbred Simmental-Angus heifers were evaluated for pubertal status by reproductive tract score. All heifers were subjected to an estrous synchronization plus fixed-time AI protocol, followed by a 60-d natural breeding season with proven fertile bulls (n = 2). Pregnancy was evaluated via transrectal ultrasound 42 d post-AI. Fertility status was assigned according to pregnancy results, and 7 fertile and 5 sub-fertile heifers were selected for harvest and collection of uterine endometrium. Fertile heifer pregnancies were terminated at pregnancy diagnosis to remove the effect of pregnancy, and all animals from both groups were cycling when endometrial samples were collected. Total RNA was extracted from all samples, and those with integrity quality (IQ) ≥ 7 were subjected to sequencing on the Illumina NovaSeq 6000 Platform. After data quality control, reads were aligned with STAR to the Ensembl ARS-UCD1.2 <span>Bos taurus</span> reference genome. Differentially expressed genes (DEGs) were identified using DESeq2, and significance was defined based on a <span>P</span>-value ≤ 0.05 and log2FC | &gt; 0.5|. We identified 579 upregulated and 219 downregulated genes in fertile heifers. Specifically, genes such as GNGT2, interleukin (IL) 1B, and PTGS2 were upregulated in fertile heifers. Previously, GNGT2 was reported as upregulated in the caruncular endometrium of fertile dairy cows versus sub-fertile ones. In several studies, upregulation of IL1B in the uterine epithelium and trophoblast has been associated with fertility in human, mice, and livestock species. PTGS2 (a.k.a COX2), plays critical roles in the luteolytic cascade in ruminants through activation in the luminal and glandular epithelium. Upregulation of PTGS2 outside of gestation can also be indicative of a receptive uterine environment. The DEGs were over-represented in biological pathways such as calcium ion binding, positive regulation of IL-6 production, and inflammatory response to antigenic stimulus. Among the KEGG pathways, we identified G-protein coupled receptor (GPCR) signaling, GPCR ligand binding, and class A/1 (rhodopsin-like receptors). These pathways have been associated with early pregnancy success and key hormones involved with estrous cyclicity and uterine receptivity. These findings unveiled known and novel candidate genes and pathways involved with endometrial function and presented potential differences between fertile and sub-fertile heifers. Further studies should focus on validating these genes in larger sample sizes and investigating possible mechanisms of action.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"26658202b0baf9a20db5476b6717fce42b6ef754053577208d456231610e4d49","category":"Environment"}