{"title":"Uncovering structural variants in Creole cattle from Guadeloupe and their impact on environmental adaptation through whole genome sequencing","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309411","date":1724680800000,"content":"<p>by Slim Ben-Jemaa, Mekki Boussaha, Nathalie Mandonnet, Philippe Bardou, Michel Naves</p>\r\n\r\nStructural variants play an important role in evolutionary processes. Besides, they constitute a large source of inter individual genetic variation that might represent a major factor in the aetiology of complex, multifactorial traits. Their importance in adaptation is becoming increasingly evident in literature. Yet, the characterization of the genomic landscape of structural variants in local breeds remains scarce to date. Herein, we investigate patterns and gene annotation of structural variants in the Creole cattle from Guadeloupe breed using whole genome sequences from 23 bulls representative of the population. In total, we detected 32821 ascertained SV defining 15258 regions, representing ~ 17% of the Creole cattle genome. Among these, 6639 regions have not been previously reported in the Database of Genomic Variants archive. Average number of structural variants detected per individual in the studied population is in the same order of magnitude of that observed in indicine populations and higher than that reported in taurine breeds. We observe an important within-individual variability where approximately half of the detected structural variants have low frequency (MAF &lt; 0.25). Most of the detected structural variants (55%) occurred in intergenic regions. Genic structural variants overlapped with 7793 genes and the predicted effect of most of them is ranked as “modifier”. Among the structural variants that were predicted to have a high functional impact on the protein, a 5.5 Kb in length, highly frequent deletion on chromosome 2, affects <i>ALPI</i>, a gene associated with the interaction between gut microbiota and host immune system. The 6639 newly identified structural variants regions include three deletions and three duplications shared by more than 80% of individuals that are significantly enriched for genes related to tRNA threonylcarbamoyladenosine metabolic process, important for temperature adaptation in thermophilic organisms, therefore suggesting a potential role in the thermotolerance of Creole cattle from Guadeloupe cattle to tropical climate. Overall, highly frequent structural variants that are specific to the Creole cattle population encompass olfactory receptor and immunity genes as well as genes involved in muscle tone, muscle development and contraction. Beyond mapping and characterizing structural variants in the Creole cattle from Guadeloupe breed, this study provides valuable information for a better understanding of the potential role of chromosomal rearrangements in adaptive traits in cattle.","author":"Slim Ben-Jemaa","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"2665da8fe6d6e6bd8b5e589d2e0e8b4e562f90cd8810cd25feceee3e66ae1c89","category":"Interdisciplinary"}