{"title":"Design Under Constraints: Challenges, Opportunities, And Practical Strategies","link":"https://smashingmagazine.com/2023/06/design-constraints-challenges-opportunities-practical-strategies/","date":1686304800000,"content":"<p><em>“If you don’t want to work within constraints, become an artist.”</em> That is what one of my design lecturers told me when I was at university back when the web wasn’t even a thing.</p>\n<p>That has turned out to be one of the most useful pieces of advice I ever received in my career and has led me to embrace and even enjoy working within constraints, which probably explains why I tend to specialize in highly regulated sectors with enormous amounts of stakeholders and legacy.</p>\n<p>So, if you find working within constraints challenging, this is the post for you. In it, I hope to change your attitude towards constraints and provide practical ways of dealing with even the most frustrating barriers.</p>\n<p>But let’s begin by looking at the kind of constraints you could find yourself facing.</p>\nConstraints On Every Side\n<p>The constraints we face come in all shapes and sizes, from technical constraints due to legacy technology or backwards compatibility to legal constraints relating to compliance requirements or accessibility.</p>\n<p>Then there can be inadequate availability of images, video, and text or simply a lack of access to stakeholders.</p>\n<p>However, the biggest two, without a doubt, are a <strong>lack of time</strong> and a <strong>lack of resources</strong> (either money or people). In fact, it is rare to encounter a project where somebody is not in a hurry, and you have enough resources to do the job properly!</p>\n<p>It is easy to let all of these obstacles demoralize you, but I would encourage you to embrace, rather than resist, their constraints.</p>\nWhy You Should Embrace Your Constraints\n<p>Constraints are not a set of necessary evils we have to endure. Instead, they are the core of what shapes the work we do.</p>\n<ul>\n<li>Constraints <strong>provide a clear set of guidelines and limitations</strong>, which can help focus the design process and prevent scope creep.</li>\n<li>Constraints <strong>help to build trust with clients or stakeholders</strong>, as they can see that the designer is able to work within their limitations and still deliver a high-quality product.</li>\n<li>But most importantly of all, constraints can <strong>lead to more creative and innovative solutions</strong>, as designers are forced to think creatively within the given limitations.</li>\n</ul>\n<p>I have done some of my best work over the years precisely because of the constraints placed upon me, not despite them.</p>\n<p>Also, some constraints are a good idea. <a href=\"https://boagworld.com/emails/case-for-accessibility/\">Ensuring a site is accessible just makes sense</a>, as does limiting the time and money an organization is willing to invest.</p>\n<p>Not that you should blindly accept every constraint placed upon you.</p>\nKnow When To Push Back Against Constraints\n<p>Unsurprisingly, I would encourage you to challenge constraints that are based on incorrect assumptions or outdated information. However, you won’t come across those that frequently.</p>\n<p>More common are constraints that make sense from “a certain point of view.” However, these kinds of constraints are not always right within the context of the project and its long-term objectives.</p>\n<p>For example, attempting to deliver a project within a strict budget and on an aggressive schedule may reduce the cost to the organization. But it will substantially increase the risk of the project failing, and so ultimately, the money and time that were spent will be wasted.</p>\n<p>Another common example is <strong>compliance constraints</strong>. These constraints exist to protect the organization from possible risk, but many larger organizations become so risk-averse that they undermine their competitiveness in the market. They swap one type of risk for another.</p>\n<p>The key in these situations is to demonstrate the cost of any constraint placed upon you.</p>\nDemonstrating The Cost Of An Unhealthy Constraint\n<p>Often, those who impose constraints upon you do not see the problems these constraints create. This is usually because they are only thinking in terms of their own area of responsibility. For example, a compliance officer is only going to be thinking about compliance and not the broader user experience. Equally, the IT department is going to be more focused on security and privacy than conversion or usability.</p>\n<p>Ultimately the decision of whether to enforce a constraint or not comes down to balancing multiple factors. Therefore, what you need to do is </p>\n<p>Demonstrate the cost associated with a constraint so that senior management (who take a more holistic view) has all of the facts to make a final decision.</p>\n<p>You can demonstrate the cost in one of three ways. You can either focus on the damage that a constraint causes, the cost of not taking an action the constraint prevents, or the lost opportunities imposed by the constraint.</p>\n<p>Let’s look at each to help you see more clearly how this can work.</p>\n<h3>Highlight The Hidden Damage Of A Constraint</h3>\n<p>I once worked for a consumer electronics company. One of their biggest sellers was a kettle that included a water filter which prevented limescale build-up (I know, I work on the most exciting projects!)</p>\n<p>The company insisted that when somebody added the kettle to their shopping cart, we should automatically add a set of water filters as well.</p>\n<p>This is a <a href=\"https://www.interaction-design.org/literature/article/sneaking-products-into-users-shopping-baskets\">well-known dark pattern</a> that damages the user experience, but I also knew that it was increasing the average order value, a key metric the e-commerce team tracked.</p>\n<p>To combat this constraint, I knew I had to demonstrate that it was causing damage that the e-commerce team and leadership were unaware of. So, I took the following steps:</p>\n<ul>\n<li>I gathered evidence on social media of users complaining about this issue.</li>\n<li>I contacted the customer support team to get some metrics about the number of complaints.</li>\n<li>I contacted the returns team to find out how many people returned the filters.</li>\n<li>I looked on review sites to see the number of negative reviews relating to filters.</li>\n</ul>\n<p>Sure enough, I found substantial evidence that this was a major issue among consumers. But I didn’t stop there. I wanted to associate a financial cost with the decision, so I made some estimates:</p>\n<ul>\n<li>I made my best guess at the cost of combating the negative reviews, <a href=\"https://www.reviewcontrolcenter.com/how-much-can-a-bad-review-cost-you/\">referencing various sources I found online</a>.</li>\n<li>I researched the average cost of dealing with a complaint and combined it with the data from the customer services team to guess the overall cost of dealing with filter complaints.</li>\n<li>I used a similar approach to work out an approximate cost of processing returned filters.</li>\n</ul>\n<p>Now, let me be clear, these were nothing more than guesses on my part. My figures were not accurate, and people in the company were quick to challenge them. But associating a dollar value with the problem got their attention!</p>\n<p>I agreed that my figures were probably wildly off and suggested we did some proper research to find out the real cost.</p>\n<p>You don’t need hard data to demonstrate there is a problem. An educated guess is good enough to start a discussion.</p>\n<p>Of course, not all constraints are actively causing damage. Some are merely preventing some better action from being taken. In these cases, you need a different approach.</p>\n<h3>Focus On The Cost Of Inaction</h3>\n<p>Over time, an organization establishes processes and procedures that have been proven to work for them. The bigger the organization, the more standard operating procedures they have, and the more constraints you encounter.</p>\n<p>Well-established companies become so afraid of losing their position that they become extremely risk-averse, and so place considerable constraints on any project.</p>\n<p>People succeed in organizations like this by doing what has been done before. This can be problematic for those of us who work in digital because most of what we are trying to do is new.</p>\n<p>To combat this bias towards the status quo, we need to demonstrate the cost of inaction. Put another way, we need to show management that if they do not do things differently, it will threaten the market position the organization has established.</p>\n<p>In most cases, the best approach is to <strong>focus on the competition</strong>. Do a bit of research and show that the competition is less risk-averse and gaining market share as a result. Keep mentioning how they are doing things differently and how that threatens your organization’s market position.</p>\n<p>Another tactic is to <strong>demonstrate how customer expectations have changed</strong> and that if the company does not act, they will begin to lose market share.</p>\n<p>This is particularly easy to do because users’ expectations regarding digital have skyrocketed in recent years.</p>\n<blockquote> “The last best experience that anyone has anywhere becomes the minimum expectation for the experiences they want everywhere.”<br />— Bridget van Kranlingen, Senior Vice President of IBM Global Markets</blockquote>\n\n<p>Put another way, users are comparing your organization’s subpar digital experience to the very best of what they are interacting with online, even when that comparison is not fair.</p>\n<p>A bit of user research goes a long way in this regard. For example, consider running a <a href=\"https://measuringu.com/sus/\">system usability scale survey</a> to compare your digital platforms to this industry benchmark. Alternatively, run a survey asking how important the digital experience is to customers.</p>\n<p>While fear of losing market share is a big motivator to well-established businesses, younger, hungrier businesses tend to be more motivated by lost opportunities.</p>\n<h3>Demonstrate Lost Opportunities</h3>\n<p>Your management, stakeholders, and colleagues often do not realize what they are missing out on because of the constraints they place upon you. It, therefore, falls to you to demonstrate those opportunities.</p>\n<p>Sometimes, you can make this case with analytics. For example, recently, I was working with a client who insisted on having a pricing page on their website, despite the fact the page showed no pricing! Instead, the page had a request pricing form.</p>\n<p>They wanted to keep the page because they were afraid to lose the handful of leads that came via the page. However, I was able to convince them otherwise by pointing out that the page was actively alienating the majority of users who visited it, effectively losing them leads.</p>\n<p>I did this by demonstrating the page had a higher bounce rate than any other page on the site, was the most common exit page, and had the lowest dwell time.</p>\n<p>But analytics is not my favorite approach for demonstrating lost opportunities. Instead, I typically turn to prototyping.</p>\n<p>Prototyping is a great way of demonstrating exactly what an organization will miss out on if they insist on unreasonable constraints, presuming, that is, that you create a prototype that is free from those constraints.</p>\n<p>I use this approach all the time. Imagine, for example, that you have been told that a particular technology stack imposes a set of restrictive constraints on how an interface is designed. By prototyping what the interface could be if you were free from those constraints, you can make a powerful case for changing the technology stack.</p>\n<p>Having a prototype gives you something to test against. You can use <strong>usability testing</strong> to provide hard evidence of how much it improves the user experience, findability, and even conversion.</p>\n<p>Even more significantly, a prototype will excite internal stakeholders. If your prototype is compelling enough, they will want that solution, and that changes the conversation.</p>\n<p>Instead of you having to justify why the IT stack needs to be changed, now the IT team has to justify why their IT stack cannot accommodate your solution. Stakeholders and management will want to know why they cannot have what they have fallen in love with.</p>\n<p>Of course, people will not always fall in love with your prototype, and ultimately, many of your attempts to overcome constraints will fail despite your best efforts, and you need to accept that.</p>\nConceding Defeat With Grace\n<p>Let’s be clear. It is your job to demonstrate to management or clients that a constraint placed upon you is unhealthy. They cannot be expected to know instinctively. They do not have your perspective on the project and so cannot see what you see.</p>\n<p>This means that if they fail to remove the constraint you consider unhealthy, it is your failing to demonstrate the problem, not their fault.</p>\n<p>Sure, you might consider them shortsighted or naive. But ultimately, you failed to make your case.</p>\n<p>Also, it is important to note that <strong>you don’t always have the whole picture</strong>. A decision may be bad from a user experience perspective, for example, but it may be the right thing for the business. There will always be other factors at play that you are unaware of.</p>\n<p>So when you fail to make your case, accept that with grace and do your best to work within the constraints given to you.</p>\n<p>Ultimately your working relationship with management, colleagues, and clients is more important than your professional pride and getting your way.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"266a7e9ce88cacee109ffb63c010dcde7342c3d53f0979eaafa079702aab1f34","category":"Tech"}