{"title":"Spatio‐temporal integrated Bayesian species distribution models reveal lack of broad relationships between traits and range shifts","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13819?af=R","date":1708942795000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Climate change and habitat loss or degradation are some of the greatest threats that species face today, often resulting in range shifts. Species traits have been discussed as important predictors of range shifts, with the identification of general trends being of great interest to conservation efforts. However, studies reviewing relationships between traits and range shifts have questioned the existence of such generalized trends, due to mixed results and weak correlations, as well as analytical shortcomings. The aim of this study was to test this relationship empirically, using analytical approaches that account for common sources of bias when assessing range trends.</p>\n<h2>Location</h2>\n<p>Tanzania, East Africa.</p>\n<h2>Time period</h2>\n<p>1980–1999 and 2000–2020.</p>\n<h2>Major taxa studied</h2>\n<p>57 savannah specialist birds found in Tanzania, belonging to 26 families and 11 orders.</p>\n<h2>Methods</h2>\n<p>We applied recently developed integrated spatio-temporal species distribution models in R-INLA, combining citizen science and bird Atlas data to estimate ranges of species, quantify range shifts, and test the predictive power of traditional trait groups, as well as exposure-related and sensitivity traits. We based our study on 40 years of bird observations in East African savannahs, a biome that has experienced increasing climatic and non-climatic pressures over recent decades. We correlated patterns of change with species traits using linear regression models.</p>\n<h2>Results</h2>\n<p>We find indications of relationships identified by previous research, but low average explanatory power of traits from an ecological perspective, confirming the lack of meaningful general associations. However, our analysis finds compelling species-specific results.</p>\n<h2>Main conclusions</h2>\n<p>We highlight the importance of individual assessments while demonstrating the usefulness of our analytical approach for analyses of range shifts.</p>","author":"Joris H. Wiethase, \nPhilip S. Mostert, \nChristopher R. Cooney, \nRobert B. O'Hara, \nColin M. Beale","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"266b5d33118f6adc0e17553b486630d049f6b051cd34149f9af7a4e587bd0523","category":"Environment"}