{"title":"A history of Apple’s mistakes and failures–and how it hates to fix them","link":"https://www.macworld.com/article/2148795/how-apple-learns-or-doesnt-from-its-failures.html","date":1700652600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Nobody’s perfect. We all make mistakes, from the littlest kindergarteners to the world’s most valuable and powerful corporations. What’s most important is how we respond to our mistakes, of course. Do we learn and grow? Do we deny and deflect? Or do we just give up?</p>\n\n\n\n<p>What I’m saying is that Apple sometimes takes its failures and learns important lessons that inform its future attempts… but sometimes, it seems to just give up.</p>\n\n\n\n<h2>Adorable failures and their reactions</h2>\n\n\n\n<p>Apple is a proud company that hates making mistakes and hates owning up to them even more. When Apple corrects a mistake, it generally does so by pointing out how much better the correction is and how customers are just going to <em>love</em> it. It doesn’t dwell on the past–and doesn’t want anyone else to do so, either.</p>\n\n\n\n<p>In 2015, Apple introduced a new keyboard that it bragged about. It was thin and light and clearly an improvement on what had come before. The “butterfly keyboard,” it turned out, had limited key travel that turned off many laptop users, and <a href=\"https://www.macworld.com/article/232811/apple-improves-butterfly-keyboard-again-offers-to-free-fixes-for-some-macbook-models.html\">reliability problems</a> that made it a nightmare for others. (And, of course, laptop users can’t swap out their keyboards for an alternative–so it was a pretty critical failure.)</p>\n\n\n\n<p>For years, Apple tried to modify the keyboard to make it more reliable. Did it finally succeed? It’s hard to say because in 2019, the company began replacing the butterfly keyboard entirely. The new “Magic Keyboard” design was more like the external keyboard of the same name. When the company explained just how much effort it had invested in researching and designing the new keyboard, it came about as <a href=\"https://www.macworld.com/article/232602/apple-apology-macbook-keyboard-butterfly-fail.html\">close to apologizing</a> as it’ll ever do.</p>\n\n\n\n<p>My favorite Apple failure reaction came in the wake of the introduction of the <a href=\"https://www.macworld.com/article/195541/3gipodshufflereview.html\">third-generation iPod Shuffle</a>. If you don’t remember, the <a href=\"https://www.macworld.com/article/225948/in-praise-of-the-ipod-shuffle.html\">iPod Shuffle</a> was a very small iPod music player with no screen, just a set of buttons to control play/pause, next/previous, and volume up/down. But for the device’s third generation, Apple introduced a model with… no buttons at all! Instead, to control the iPod Shuffle, you had to use compatible headphones with a microphone (for voice control) and a set of inline control buttons. If your preferred headphones weren’t incompatible, well, tough.</p>\n\n\n\n<p>It was a disaster. A little over a year later, Apple released a “<a href=\"https://www.macworld.com/article/207550/4gshuffle-review.html\">fourth-generation</a>” model that was a complete reversion to the <a href=\"https://www.macworld.com/article/182283/2gshuffle.html\">second-generation model</a>, with a complete set of controls on the device. I don’t know if I can recall another time when Apple immediately tossed out a new design and <em>returned to the previous one</em>. What a failure! But at least it got the message and responded.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/macbook-pro-touchbar-2019.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"MacBook Pro Touch Bar\" width=\"951\" height=\"634\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/macbook-pro-touchbar-2019.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2021/05/macbook-pro-touchbar-2019.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2021/05/macbook-pro-touchbar-2019.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2021/05/macbook-pro-touchbar-2019.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2021/05/macbook-pro-touchbar-2019.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2021/05/macbook-pro-touchbar-2019.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" /><figcaption><p>The problem with the Touch Bar was that Apple didn’t do anything to improve it.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Papa Homer, you are so learned</h2>\n\n\n\n<p>As Homer Simpson taught us, when you fail, you learn the most important lesson of all: never try. Sometimes, Apple reacts to failure by running away from the scene of the crime, never to return. I don’t really like it when this happens because if something’s worth doing, it’s worth trying until you get it right.</p>\n\n\n\n<p>Take the Touch Bar. A lot of people are still out dancing in the streets at the <a href=\"https://www.macworld.com/article/2120980/13-inch-macbook-pro-touch-bar-discontinued.html\">discontinuation of the final Mac laptop with a Touch Bar</a>, which happened last month. And I agree: the Touch Bar was a failure for so many reasons.</p>\n\n\n\n<p>But is the lesson that Apple should just never try to do anything new and different with its keyboards? I sure hope not. Sitting next to my Mac’s keyboard is a 15-key programmable keyboard supplement from Elgato called a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.elgato.com/us/en/s/welcome-to-stream-deck&amp;xcust=1-1-2148795-1-0-0&amp;sref=https://www.macworld.com/feed\">Stream Deck</a>. I love it. I can program each key to do something different and create a custom icon for each one. I can even use keys to switch to other screens, allowing each key to support different commands in different contexts.</p>\n\n\n\n<p>Personally, I think the Touch Bar failed because it was a featureless strip that didn’t allow use by feel–you had to look right at it to use it–and because Apple never allowed users (or app developers) to customize it. I get the sense that Apple was so burned by the Touch Bar that it’s never going to ship a keyboard with anything but standard function keys, but I’d love a customizable, programmable set of tactile keys like those on my Stream Deck at the top of my laptop keyboard, too. Apple just needs to take another crack at it.</p>\n\n\n\n<p>Or consider the <a href=\"https://www.macworld.com/article/232994/the-12-inch-macbook-is-dead-and-it-will-be-missed.html\">12-inch MacBook</a>, ironically the laptop that introduced the butterfly keyboard design. That laptop was underpowered, overpriced, and only offered a single USB-C port. It never caught on, and it fairly rapidly vanished from Apple’s offerings. But now, in the era of Apple silicon Macs, couldn’t an ultra-thin, ultra-small Mac laptop be more affordable <em>and</em> offer plenty of performance? There are rumors that Apple’s working on a new 12-inch MacBook, but I seriously doubt it will be an ultraportable. Instead, it’ll probably just be a MacBook Air with cheaper parts.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Visual-Pro-1-1.jpg?quality=50&amp;strip=all\" alt=\"Vision Pro\" width=\"951\" height=\"634\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Visual-Pro-1-1.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Visual-Pro-1-1.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Visual-Pro-1-1.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/Visual-Pro-1-1.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" /><figcaption><p>The Vision Pro is an ambitious product, but it’s unclear as to how Apple will gauge whether it’s a success or not.</p></figcaption></figure><p>Petter Ahrnstedt / Foundry</p></div>\n\n\n\n<h2>What’s next for failure?</h2>\n\n\n\n<p>I also think about what current Apple products or features might one day lead to retrenchment or denial. Will Apple’s replacement for leather, <a href=\"https://www.macworld.com/article/2081435/iphone-15-finewoven-cases-criticism.html\">FineWoven</a>, sell well enough for it to survive, or will Apple take another crack at a more leather-like material? After the failure of the <a href=\"https://www.macworld.com/article/230469/apple-airpower-features-specs-price-faq.html\">AirPower</a> charging case and the discontinuation of the <a href=\"https://www.macworld.com/article/234927/apple-magsafe-duo-charger-review.html\">MagSafe Duo</a>, will Apple try to create innovative device chargers, or will it give up and leave that as a third-party opportunity?</p>\n\n\n\n<p>Then there’s the Magic Mouse. I assume the next model won’t charge via a <a href=\"https://www.macworld.com/article/626532/magic-mouse-charging-upside-down-why.html\">port on its belly that renders it unusable</a>, but who knows when Apple will ever <a href=\"https://www.macworld.com/article/2121681/magic-mouse-trackpad-keyboard-lightning-usb-c-charging.html\">update</a> its mouse?</p>\n\n\n\n<p>Finally, I wonder about the <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Vision Pro</a>. It’s not even out yet, but it’s still worth considering: what will it take for Apple to judge it as a success? How many years will Apple give the platform before it makes a decision? And when it does figure out what’s wrong or right with the Vision Pro, what will its reaction be? After so many years and so much money, you’d think it would be aggressive in making changes and fixing whatever ails the product. I sure hope so. It would be a shame if Apple just gave up, walked away, and pretended the whole thing had never happened.</p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"266ddb627d6606ae2f5266000f1a156610d16cfc41223f67dc134c2fa08149e4","category":"Apple"}