{"title":"Impact of Oxidation Layer in the Resistive Switching Behavior of Nitride-Based Memristor Devices","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.783/7719575?rss=1","date":1721779200000,"content":"<span>The memristive switching devices have shown great promises in next-generation digital memory and neuromorphic computing due to their valuable properties including non-volatility, fast switching speed, and high endurance [<a href=\"#ozae044.783-B1\">1</a>, <a href=\"#ozae044.783-B2\">2</a>]. Many metal-insulator-metal (MIM) systems made of transitional metal oxides (TMO) which have been studied show a filamentary switching mechanism, where the operating voltages and resistance states suffer from undesirable temporal and spatial variations due to the random formation and rupture of conductive filaments [<a href=\"#ozae044.783-B3\">3</a>]. Very recently, some researchers have reported another interface-type RS devices with much lower operation voltage/current and more reliable switching repeatability [<a href=\"#ozae044.783-B4\">4</a>, <a href=\"#ozae044.783-B5\">5</a>]. Different from conductive filamentary channels formation and rupturing, the charge species trapping and/or de-trapping at the switching interfaces lead to a wide fluctuation of the oxygen stoichiometry and transitional metal valence states, resulting in the transition from high resistance state (HRS) to low resistance state (LRS) and vice versa. This type of devices has great promise in the ultra-low-energy and logic-in-memory next-generation nanoelectronic devices. However, the resistive switching (RS) mechanism of the interface-type memristor devices are still in debate. Hence, it is full of scientific significance to investigate the RS of those interface-type memristor devices.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"266fcc7553e1f9e683e170f79ae8f13c9a02ecc3ebb1cca3b031f2866010ded6","category":"Environment"}