{"title":"Developmental Predictors of Suicidality in Schizophrenia: A Systematic Review","link":"https://www.preprints.org/manuscript/202409.1282/v1","date":1726565022000,"content":"Abstract: Background/Objectives: Schizophrenia (SZ) is a severe psychiatric disorder characterized by a complex interplay of genetic, developmental, and environmental factors that significantly increase the risk of suicidal ideation (SI) and suicide attempts (SAs). This systematic review synthesizes current research on the developmental predictors of SI in individuals with SZ, aiming to delineate the multifactorial etiology of suicide within this population. Methods: A comprehensive search across Medline, PsycINFO, and EMBASE databases identified 23 eligible studies, emphasizing the varied methodological approaches and the global distribution of research efforts. Results: These studies demonstrate a robust association between early life adversities, particularly childhood trauma such as physical neglect, emotional abuse, and sexual abuse, and the increased prevalence of SI and SAs in SZ. This review also highlights the significant genetic factors associated with development of suicidality in SZ, suggesting that polymorphisms in inflammation-related genes and neurodevelopmental abnormalities may influence susceptibility to SI. Notably, family history of psychiatric conditions may exacerbate the risk of SI through both hereditary and environmental mechanisms. Environmental factors, including socioeconomic status and social support, are also implicated, underscoring the role of broader socio-environmental conditions influencing outcomes. Conclusions: This review supports the integration of biopsychosocial models in understanding SI in SZ, advocating for interventions addressing the complex interplay of risk factors and the need for longitudinal studies to elucidate the dynamic interactions between risk factors over time. This comprehensive understanding is crucial for developing targeted preventative strategies and enhancing the clinical management of SZ, aiming to reduce suicidality in this vulnerable population.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"2676dc41fcc0fd166ff3423695b0636f1bdcb240146d7c40dbb1bcd8d42a5aad","category":"Interdisciplinary"}