{"title":"Bioecological Attributes as Predictors of Global Extinction Risk for Marine Chondrichthyans (Chondrichthyes, Huxley, 1880)","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4238?af=R","date":1724742000000,"content":"<h2>ABSTRACT</h2>\n<p>\n\nMarine chondrichthyans are experiencing a global decline, but identifying appropriate conservation actions is challenging due to the lack of basic biological information, such as growth parameters and reproduction. In this study, we identify biological and ecological attributes that can be both easily obtainable and are effective predictors of extinction threat.\n\nA bioecological attribute database was constructed for marine chondrichthyan species, including information on maximum length, habitat, reproductive mode, trophic level and conservation status, among others. Data sources included the Shark-References, IUCN and FishBase databases. Following this, a generalized linear model was built with conservation status as the response variable and bioecological attributes as explanatory variables, and the model's accuracy was tested for each group. Then, the model was applied to species not yet classified (data deficient [DD] or not evaluated [NE]) to determine their probability of extinction risk.\n\nIn total, data were compiled for 1225 species of marine Chondrichthyes (537 sharks, 636 rays and 52 chimaeras); approximately 20% of these species are classified as DD or NE. The model demonstrated high accuracy overall: 95% for chimaeras, 77% for rays and 72% for sharks. Our analysis indicates that, among the species that are classified as DD or NE, 58% of rays, 44% of sharks and 66% of chimaeras may be at risk of extinction.\n\nThese results clearly demonstrate how bioecological attributes can serve as proxies of extinction risk in Chondrichthyes and provide a solid foundation for conservation planning and prioritization for this ecologically important yet data poor taxon.\n</p>","author":"Cicero Diogo L. Oliveira, \nJanaine Conceição da Silva, \nRichard J. Ladle, \nVandick S. Batista","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"267fd4bffa33439fc16d3072deeba9132e14835e3fdf59d979a0fe84b35b2bc2","category":"Environment"}