{"title":"Bontrager launches revamped Adventure range of bikepacking bags","link":"https://www.bikeradar.com/news/bontrager-adventure-bikepacking-bags/","date":1633021233000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/BT21_Adventure_Bags0544-6f7d107.jpg?quality=45&amp;resize=620,413\" />                                            <p><span>Bontrager has launched a new range of Adventure bags, including a saddle pack, bar bag and frame pack, designed in tandem with the <a href=\"https://www.bikeradar.com/news/2022-trek-checkpoint/\">new Trek Checkpoint</a> gravel bike but ready for use on any <a href=\"https://www.bikeradar.com/features/routes-and-rides/heres-what-you-need-for-a-bikepacking-adventure/\">bikepacking</a> rig.</span></p>\n<p><span>The bikepacking bags are made from a durable, abrasion-resistant and waterproof fabric, and also come with waterproof or water-resistant zips.</span></p>\n<p><span>The new Adventure line replaces Bontrager’s previous range of bikepacking luggage, though the existing top tube bag continues from the previous collection.</span></p>\n<h2><span>Bontrager Adventure handlebar bag</span></h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The handlebar bag has a 9.7-litre capacity and includes a hydration bladder.</span></figcaption><span> <i>Trek</i></span></div>\n<p><span>The bar bag has a capacity of 9.7 litres, a roll-top closure and mounts to your handlebar via removable straps. </span></p>\n<p><span>It includes a front pocket with a 1.5-litre HydraPak hydration bladder, freeing up space in your frame triangle for a frame pack. </span></p>\n<p><span>There’s a 92cm-long hose with a bite valve, letting you slurp as you ride, and a magnetic clip to secure the hose in place when not in use.</span></p>\n<p><span>For extra carrying capacity, Bontrager has included a bungee cord across the top of the bag, which you can use to stash extra layers where they’re easy to access. </span></p>\n<p><span>The price is £99.99 / $119.99 / €119.99 / AU$179.99.</span></p>\n<h2><span>Bontrager Adventure saddle</span><span> pack</span></h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Side zips on the saddle pack should make for easy access without unclipping the roll top.</span></figcaption><span> <i>Trek</i></span></div>\n<p><span>Bontrager uses the usual clip-on loops around the saddle rails and velcro strap around the seatpost to secure its new saddle pack to your bike. </span></p>\n<p><span>There’s a roll-top closure and that’s also paired with water-resistant side zips, so you can get at contents without having to open the whole bag and dig around inside. </span></p>\n<p><span>Bontrager includes a removable internal plastic skeleton to help keep the bag more rigid.</span></p>\n<p><span>As with the handlebar bag, there’s a daisy chain cord on the top of the saddle pack to stow extra kit. </span></p>\n<p><span>The saddle pack has nine litres of storage capacity, but note that Bontrager says the bag is not designed for use with a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">dropper post</a>. </span></p>\n<p><span>Like the bar bag, it’s priced at £99.99 / $119.99 / €119.99 / AU$179.99.</span></p>\n<h2><span>Bontrager Adventure Boss frame bag</span></h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Bontrager’s Adventure Boss frame bag comes in six sizes to fit the new Checkpoint frame.</span></figcaption><span> <i>Trek</i></span></div>\n<p><span>Finally, the new range includes a frame bag that sits under your top tube. </span></p>\n<p><span>Again, there are straps to attach to the frame, with a lever-down catch to hold the straps secure, and a rubber coating so you don’t damage your frame’s paint.</span></p>\n<p><span>The frame bags have been specifically designed to fit the newly-launched Trek Checkpoint and come in six sizes with volumes between 1.3 litres for the 49cm frame and 5.9 litres for the 60cm frame. </span></p>\n<p><span>Bontrager says they’ll work equally well with other bikes though.</span></p>\n<div>\n    <img /></div><div><figcaption><span><i></i> You can attach the frame pack using rubberised straps or bolt it to the underside of the Checkpoint’s frame.</span></figcaption><span> <i>Trek</i></span></div>\n<p><span>The design includes slots to let you screw the bag into the underside of the Checkpoint frame, where there are two bosses designed to hold it more securely and dispense with the straps (you need to buy the required bolts separately). </span></p>\n<p><span>There are two main pockets and dividers inside the bag to help keep things organised. </span></p>\n<p><span>Bontrager is selling the new Adventure Boss frame bag for £89.99 / $99.99 / €99.99 / AU$129.99.</span></p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"268143eacb85c349970e21b24a426f8398ef23a775e50fd99c253514ee2519de","category":"Cycling"}