{"title":"French Regulator to Probe Apple's Upcoming Anti-Tracking Feature","link":"https://www.macrumors.com/2021/03/17/french-regulator-probe-apple-anti-tracking/","date":1615978284000,"content":"Apple will face a French antitrust probe into its upcoming App Tracking Transparency feature, following a complaint from advertisers in the country that the planned changes are anticompetitive.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/07/app-tracking-pop-up-ios-14.jpg\" alt=\"\" width=\"800\" height=\"448\" class=\"aligncenter size-full wp-image-748920\" />\r\n<br/>\r\nStarting in iOS 14.5, Apple will require apps to get opt-in permission from users to collect their random advertising identifier, which advertisers use to deliver personalized ads and track how effective their campaigns were.\r\n<br/>\r\n\r\n<br/>\r\nIn light of the planned changes, a group of advertising companies and publishers filed a complaint in France <a href=\"https://www.macrumors.com/2020/10/28/ios-14-anti-tracking-prompt-antitrust-complaint/\">last year</a> alleging that the wording of Apple's permission prompt will lead most users to decline tracking of their device's advertising identifier, which could result in lost revenue.\r\n<br/>\r\n\r\n<br/>\r\nOn Wednesday, France's competition regulator rejected a plea from the group to block Apple's plan to restrict tracking of users' app usage, on the grounds that obtaining consent \"doesn't appear to be abusive.\" Instead, the probe will scrutinize whether Apple is being consistent in applying the same rules to itself. \r\n<br/>\r\n\r\n<br/>\r\nVia <em><a href=\"https://www.bloomberg.com/news/articles/2021-03-17/apple-faces-french-antitrust-probe-into-ios-14-ad-changes\">Bloomberg</a></em>:\r\n<br/>\r\n<blockquote>The investigation will \"look closely\" at whether Apple applied less stringent rules to itself than to other services as it makes privacy changes to curb online tracking in its forthcoming <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a> software update, the authority's chief, Isabelle de Silva told reporters at a Paris press conference on Wednesday. The case shows the need for fast antitrust action into technical issues, she said, promising a final ruling by early 2022 at the latest.</blockquote>Apple's planned rollout of its new App Tracking Transparency feature has been controversial among advertisers from the off, with the upcoming feature drawing criticism from the likes of Facebook, which is <a href=\"https://www.macrumors.com/2020/08/26/facebook-ios-14-anti-tracking-ad-revenue-drop/\">concerned</a> that many users will not consent to being tracked across apps for ad personalization purposes. \r\n<br/>\r\n\r\n<br/>\r\nApp Tracking Transparency is different from Apple's own personalized advertising system, which the regulator is likely to scrutinize as part of its probe. Apple's ads system doesn't track users across apps and doesn't identify users to target its ads. Instead, it relies on the anonymous grouping of users' shared characteristics such as apps downloaded, age, country or city of residence, and gender.\r\n<br/>\r\n\r\n<br/>\r\nIn a statement given to <em>Bloomberg</em>, Apple said it was \"grateful\" to the authority for \"recognizing that app tracking transparency in &zwnj;iOS 14&zwnj; is in the best interest of French iOS users,\" and said it looked forward to working with regulators on user privacy and competition.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">bloomberg.com</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">antitrust</a>, <a href=\"https://www.macrumors.com/guide/france/\">France</a>, <a href=\"https://www.macrumors.com/guide/app-tracking-transparency/\">App Tracking Transparency</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/17/french-regulator-probe-apple-anti-tracking/\">French Regulator to Probe Apple&#039;s Upcoming Anti-Tracking Feature</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/french-regulator-to-probe-apples-upcoming-anti-tracking-feature.2288610/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=tVr5jYqcsWw:DGGRWQCNbdM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=tVr5jYqcsWw:DGGRWQCNbdM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/tVr5jYqcsWw\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"268d7c356bca9d85a8be070c307a5d62d3e00a08cbacfdc201868cd9a7b4cd83","category":"Apple"}