{"title":"UK orders Facebook to sell Giphy, rejects Meta’s proposed merger conditions","link":"https://arstechnica.com/?p=1816906","date":1638292760000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/getty-facebook-giphy-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/getty-facebook-giphy.jpg\">Enlarge</a> (credit: Getty Images | Anadolu Agency )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The UK's Competition and Markets Authority (CMA) today ordered Facebook owner Meta to sell Giphy, <a href=\"https://www.gov.uk/government/news/cma-directs-facebook-to-sell-giphy\">saying</a> the merger \"would reduce competition between social media platforms and that the deal has already removed Giphy as a potential challenger in the display advertising market.\"</p>\n<p>Facebook <a href=\"https://arstechnica.com/information-technology/2020/05/facebook-spends-400m-buy-giphy-plans-to-integrate-it-with-instagram/\">bought Giphy</a> in May 2020 for a reported $400 million \"but has been required to hold the businesses separate\" since June 2020, when the CMA imposed an Initial Enforcement Order (IEO), the UK government body said in a <a href=\"https://assets.publishing.service.gov.uk/media/61a4bfa2e90e07044a559d57/Facebook_GIPHY_-_Summary_of_Final_Report.pdf\">summary of its final report</a> today. After the 17-month investigation, \"we have decided that the only effective way to address the competition issues that we have identified is for Facebook to sell Giphy, in its entirety, to a suitable buyer,\" the CMA wrote.</p>\n<p>The CMA said it found that \"Facebook would be able to increase its already significant market power in relation to other social media platforms by denying or limiting other platforms' access to Giphy GIFs, driving more traffic to Facebook-owned sites—Facebook, WhatsApp and Instagram—which already account for 73 percent of user time spent on social media in the UK\" and by \"changing the terms of access by, for example, requiring TikTok, Twitter, and Snapchat to provide more user data in order to access Giphy GIFs.\"</p></div><p><a href=\"https://arstechnica.com/?p=1816906#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1816906&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"269a644b644f518fde2dab6281bb94c19efc336f4340ab0d2c7bf65f53e3be53","category":"Tech"}