{"title":"Best indoor bikes 2021 | Everything you need to know about dedicated smart bikes","link":"https://www.bikeradar.com/advice/buyers-guides/indoor-bikes/","date":1633521600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/10/Wahoo-Kickr-Bike-ce9181f.jpg?quality=90&amp;resize=620,413\" />                                            <p><span>The turbo has long been a staple of <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-plan-your-winter-training/\">winter training</a> routines but </span><a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\"><span>indoor cycling</span></a><span> is now more enjoyable, effective and realistic than ever, thanks to the growing popularity of the </span><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\"><span>best smart trainers</span></a><span> and </span><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\"><span>training apps</span></a><span>. The latest generation of indoor bikes takes that up a notch.</span></p>\n<p><span>If you’re growing to love cycling in the great indoors</span><span>, whether that’s to beat bad weather or make the most of limited time, a smart bike provides a dedicated training setup designed for the task in hand.</span></p>\n<p><span>Unlike the turbo, a smart bike packages up everything you need to ride indoors in one bundle. You don’t need to worry about <a href=\"https://www.bikeradar.com/advice/fitness-and-training/using-bike-on-turbo-trainer/\">using your carbon fibre bike on the turbo trainer</a>, nor do you need to be concerned about the increased wear and tear of expensive components. </span></p>\n<p><span>On the flip side, smart bikes are a significant investment and require space for a dedicated <a href=\"https://www.bikeradar.com/advice/fitness-and-training/tips-for-building-the-ideal-indoor-training-space/\">pain cave</a>.</span></p>\n<p>Here’s BikeRadar’s pick of the indoor bikes we’ve tested, plus our buyer’s guide on what to look for if you’re thinking about splashing out on smart bike.</p>\n<section><div>\n        <h2>The best indoor bikes reviewed by BikeRadar</h2>\n<ul><li><b>Wattbike Atom (Next Generation)</b>: £1,899 </li>\n</ul><p>Also consider:</p>\n<ul><li><b>Wahoo Kickr Bike</b>: £2,999 / $3,500 / €3,500 / AU$6,000</li>\n<li><strong>Tacx NEO Bike Smart:</strong> £2,299 / $3,200 / €2,600 / AU$5,000</li>\n</ul><p>\n\n    </p></div>\n    </section><h3>Wattbike Atom (Next Generation)</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Wattbike Atom is easy to set up and adjust.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<ul><li>£1,899 as tested</li>\n<li>Easy to set up and adjust with good connectivity</li>\n<li>Lots of metrics and plenty of training routines available from Wattbike</li>\n</ul><p>The Wattbike Atom is easy to set up and get connected to your computer, tablet (for which there’s integrated support) or smartphone, as well as third-party <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">indoor training apps</a>, including <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a>. There are plenty of training routines available in the accompanying Wattbike app, too.</p>\n<p>It’s easy to change <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/\">saddle height</a>, <a href=\"https://www.bikeradar.com/advice/workshop/how-to-adjust-your-handlebar-height/\">handlebar height</a> and a number of bike fit adjustments, but <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/what-is-the-best-crank-length-for-cycling/\">crank length</a> is fixed at 170mm. Although it’s heavy, you can roll the Atom around on its small front wheels.</p>\n<p>With a chain drive for the resistance unit, there’s an outdoor bike feel to the Atom, although that does generate a bit more noise than its competitors. The drop handlebar at the front mimics the setup of a road bike but, with 22 sequential gears, set ratios and no brake levers, that’s where the comparison ends.</p>\n<p>The Atom generates loads of data on power output, pedalling smoothness and other metrics, although when doing <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">HIIT sessions</a>, we found the lag when changing resistance sometimes made for awkward transitions.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wattbike-atom-next-generation-review/\">Read our full review of the Wattbike Atom</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Also consider…</h2>\n<p>These indoor bikes scored less than 4 out of 5 in our reviews but are still worth considering.</p>\n<h3><span>Wahoo Kickr Bike</span></h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>3.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Kickr delivers clever setup options and gradient simulation.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<ul><li>£2,999 / $3,500 / €3,500 / AU$6,000 as tested</li>\n<li>Quick and easy setup options</li>\n<li>Gradient simulation</li>\n<li>Expensive compared to its rivals</li>\n</ul><p>The Wahoo Kickr Bike’s key selling point is the fact it can simulate climbs and descents by tilting on its axis – a clever feature when using virtual cycling apps. You can also set up the combined shifter/brake levers to mimic your favourite brand’s shifting pattern and gear ratios.</p>\n<p>It’s easy to set up your position on the bike, with quick-release levers to help, and you can alter crank length, too. Wahoo provides three ways to work out your fit, including using your smartphone to shoot your outdoor bike, with the app then telling you how to position things.</p>\n<p>Pedalling can be a little rough and at lower speeds the bike can be prone to rocking. A spike in power is needed when resistance changes significantly, too. The Kickr Bike is also expensive compared to its rivals.</p>\n<p>We didn’t find the stock saddle comfortable, but both the saddle and handlebar use a standard clamp, so can be swapped out for your preferred model.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wahoo-kickr-bike-review/\">Read our full review of the Wahoo Kickr Bike</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Tacx NEO Bike Smart</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>3.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div>\n    <div>\n    <span>\n                    <i>Tom Marvin / Immediate Media</i>\n            </span>\n</div>\n<ul><li>£2,299 / $3,200 / €2,600 / AU$5,000 as tested</li>\n<li>Tricky adjustment</li>\n<li>Works well in Normal mode, but difficult to maintain correct power in Erg mode</li>\n</ul><p>The step-through frame of the Tacx NEO Bike Smart makes getting on and off easy and there’s an extension for your tablet, which also includes a couple of fans and the bike’s display.</p>\n<p>There’s lots of adjustment possible, including crank length, although it’s a bit fiddly to get your setup right. You can adjust the gear ratios to match your outdoor bike; the Shimano-like shifters were awkward to use, though. We found that we had to supplement the small, built-in fans to get effective cooling.</p>\n<p>The Tacx NEO doesn’t tilt like the Wahoo Kickr Bike, but the Road Feel, Gear Feel and Descent Simulation features do add to the ride realism.</p>\n<p>In Normal mode, the Neo Smart’s resistance changes were realistic through the testing period, but in <a href=\"https://www.bikeradar.com/advice/fitness-and-training/erg-mode/\">ERG mode</a>, the bike sometimes struggled to maintain the power required by Zwift.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/tacx-neo-bike-smart-review/\">Read our full review of the Tacx NEO Bike Smart</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Other options</h2>\n<p>The smart bike market has grown significantly in the past couple of years. We haven’t tested these indoor bikes, but here’s a range of alternative options.</p>\n<h3><span>StagesBike</span></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Stages is better known for its power meters, but also produces a dedicated smart bike.</span></figcaption><span> <i>Stages</i></span></div>\n<p><span>Best known for its <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meters</a>, Stages also makes gym hardware and has married the two in the $2,900 </span><a href=\"https://www.bikeradar.com/news/stages-bike/\"><span>StagesBike</span></a><span>. </span></p>\n<p><span>It’s designed to be highly adjustable to fit like your road bike, allowing you to alter the crank length, with programmable shift buttons on the levers and built-in simulation of braking and steering. </span></p>\n<p><span>There’s dual-sided power measurement and a Gates belt drive. Stages says the flywheel offers resistance of up to 3,000 watts.</span></p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3><span>TrueKinetix TrueBike</span></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The TrueBike has a flywheel-free design.</span></figcaption><span> <i>TrueKinetix</i></span></div>\n<p><span>The TrueBike is a neat-looking option from Dutch brand TrueKinetix. </span></p>\n<p><span>Priced at €3,250, the company says it’s designed to offer a realistic ride feel, with an algorithm that takes into account factors including your weight.</span></p>\n<p><span>Its flywheel-free design will provide resistance of up to 1,500 watts and simulate gradients of up to 15 per cent up or down, with 22 gears and connectivity to Zwift and other training apps.</span></p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3><span>SRM SmartIT</span></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The SmartIT is SRM’s take on the smart bike.</span></figcaption><span> <i>SRM</i></span></div>\n<p><span>If you’ve got deep pockets and have become accustomed to hunkering down in your bunker, there’s the </span><a href=\"https://www.bikeradar.com/news/srm-smartit-indoor-training-bike/\"><span>SRM SmartIT</span></a><span>.</span></p>\n<p>Unlike most of its competitors, the SmartIT runs off a regular drivetrain with 11-speed shifting courtesy of Shimano 105 components. Resistance is controlled via a handlebar-mounted remote, plus it has wireless connectivity for use with third-party software. SRM says the SmartIT can simulate up to 1,400 watts.</p>\n<p><span>It’s a suitably spendy option from the maker of the pros’ favoured power meter, and it’s fair to say the design doesn’t quite look as sleek as other options we’ve listed here. </span></p>\n<p><span>It does, however, incorporate SRM’s Origin power meter, which the brand says has an accuracy of +/- 1%. That, however, does mean crank length is fixed.</span></p>\n<p><span>The 65kg weight and stainless steel frame mean you’ll probably want a home gym to keep the SRM in – but you’ve got that already, haven’t you?</span></p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3><span>Peloton</span></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Peloton has made a splash in recent years but is aimed more at the home fitness crowd.</span></figcaption><span> <i>Peloton</i></span></div>\n<p><span>Peloton’s exercise bike is another indoor training option, although unlike the other options featured here, this one isn’t really designed specifically with cyclists in mind. It</span><span>’s more of a replacement for the spinning classes at your gym than support for structured cycling workouts. </span></p>\n<p><span>Unlike most smart bikes, power is an estimate from an algorithm based on <a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">cadence</a> and resistance – there’s no strain gauge built into the bike.</span></p>\n<p><span>There is, however, a built-in screen to pipe video of live daily classes to you, as well as access to Peloton’s library of workouts. There’s also a monthly fee, though that does give you access to community features such as leaderboards, music and playlists.</span></p>\n<p><span>Peloton is a closed system, so you won’t be able to hook it up to third-part training apps.</span></p>\n<h2>Buyer’s guide to indoor bikes</h2>\n<h3>What does an indoor bike offer?</h3>\n<p><span>Unlike the spin bikes you might see in a gym, the latest generation of smart bikes are designed with dedicated cyclists in mind, so you can expect accurate power measurement, a highly adjustable position and variable (and automatically-controlled) resistance.</span></p>\n<p><span>Whereas an indoor exercise bike will usually have limited manual adjustability to resistance, indoor smart bikes use similar tech to smart trainers and are designed to offer a realistic, road-like feel when pedalling.</span></p>\n<p><span>They will measure your power output and, if you want them to, automatically adjust resistance, whether that’s to match the incline of a virtual road on </span><span>Zwift</span><span> or so you hit the required wattage in a </span><span>structured workout</span><span>.</span></p>\n<p>The best indoor bikes will offer lots of adjustment, too, including saddle height and fore/aft, handlebar position and even crank length, allowing you to replicate the position of your regular bike. That adjustability will also allow multiple members of the same household to use the bike.</p>\n<h3>Connectivity to third-party training apps</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Cycling-specific smart bikes offer wireless connectivity to link up to apps.</span></figcaption><span> <i>Wahoo</i></span></div>\n<p><span>Most smart bike brands offer workouts developed in-house, as well as Bluetooth and/or ANT+ connectivity to third-party apps such as Zwift, Wahoo SYSTM, <a href=\"https://www.bikeradar.com/advice/buyers-guides/rgt-cycling-guide/\">RGT Cycling</a> and TrainerRoad.</span></p>\n<p><span>Training apps provide a much more engaging and immersive indoor ride experience, often with a video or virtual simulation of outdoor terrain. They’ll also let you </span><a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-group-rides/\"><span>challenge your mates</span></a>, embark on a training plan<span> or simply ride against others.</span></p>\n<h2><span>Do you have the space?</span></h2>\n<p><span>Unlike most turbo trainers or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-on-rollers/\">rollers</a>, which fold down for storage, smart bikes are a permanent fixture.</span></p>\n<p><span>What’s more, in order to handle a cyclist riding at full tilt or out of the saddle, smart bikes are usually heavy and have large bases, so they’re not something you will want to lug around. Nor will they fit in the bottom of a cupboard when not in use. </span></p>\n<p><span>With that in mind, you’ll want to make sure you’ve got the space for a smart bike, with an electricity supply close by so it’s set up ready to ride.</span></p>\n<p><span>Plus, all that tech is pricey – a dedicated smart indoor bike will set you back at least four figures and a lot more for the latest crop of machinery.</span></p>\n<p><span>The flip side, of course, is a dedicated, high-tech training tool ready to jump onto at any point.</span></p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"26a07d1f65d8c6b4da2f309a5d2a9434db2671f21afbda1f22a5c1c136003fa5","category":"Cycling"}