{"title":"M2 Max and M2 Ultra Macs pop up in Apple’s testing logs as WWDC23 nears","link":"https://www.macworld.com/article/1938937/m2-max-ultra-macs-testing-wwdc.html","date":1685634457000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>A day after Bloomberg’s Mark Gurman tweeted that “<a href=\"https://www.macworld.com/article/1937070/wwdc-15-inch-macbook-air-mac-pro-studio-imac-announcements.html\">several new Macs</a>” will arrive at WWDC23 on Monday, he has provided more information on what Apple may reveal during the keynote on Monday, June 5.</p>\n\n\n\n<p>Gurman tweeted on Thursday that “Apple is testing two new Mac desktops” that have the M2 Max and M2 Ultra chips. Gurman also points out that Apple will start accepting Mac Studio trade-ins on Monday, suggesting that the tested Macs are new Mac Studios.</p>\n\n\n\n<figure><div>\n<blockquote><p>NEW: Apple is testing two new Mac desktops, dubbed Mac 14,13 and Mac 14,14, with M2 Ultra and M2 Max chips. This comes ahead of WWDC where Macs will be featured and a plan to start accepting Mac Studio trade-ins on Monday. Full story coming soon. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/73m6w0Y9gS&amp;xcust=1-1-1938937-1-0-0&amp;sref=https://www.macworld.com/feed\">https://t.co/73m6w0Y9gS</a></p>— Mark Gurman (@markgurman) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/markgurman/status/1664042684678275073?ref_src=twsrc%5Etfw&amp;xcust=1-1-1938937-1-0-0&amp;sref=https://www.macworld.com/feed\">May 31, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>The Mac with the M2 Max has specs that are similar to that of the 16-inch MacBook Pro: a 12-core CPU (8 performance cores, 4 efficiency cores), a 30-core GPU, and 96GB of memory. The Mac with the ‌M2‌ Ultra chip has a 24-core CPU (16 performance cores, 8 efficiency cores) and a 60-core GPU. As with the M1 Max and Ultra, Apple will offer different GPU core configurations and memory options.</p>\n\n\n\n<p>The current Mac Studio is available with M1 Max and M1 Ultra chips, so along with the trade-in program, it’s logical to conclude that these Macs being tested are Mac Studio upgrades. The upgrades would come over a year after its introduction, which is a shorter cycle than Apple has had with other Macs. Before the Mac Studio, the quickest cycle was with the 14- and 16-inch MacBook Pro, which were upgraded 16 months after they were initially introduced with the M1 Pro and Max. The M1 iMac, on the other hand, has been on the market for 25 months, the longest cycle so far.</p>\n\n\n\n<p>If these Macs being tested are new Mac Studios, where is the Mac Pro? It’s possible that one (or both) of these Macs are actually Mac Pro models, but considering recent reports, that’s not likely. It’s possible that another unidentified Mac model could pop up between now and Monday’s WWDC keynote, but it’s more likely that if the Mac Pro is to make its debut, Apple will announce the Mac Pro and make it available later this year.</p>\n\n\n\n<p>Our <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC23 guide has all the information you need</a> about Apple’s big event. Learn <a href=\"https://www.macworld.com/article/673537/how-to-watch-apple-wwdc-keynote.html\">how to watch the WWDC keynote</a>, get more information about the <a href=\"https://www.macworld.com/article/1670742/macos-14-release-date-features-compatibility-beta.html\">next version of macOS</a>, and read our <a href=\"https://www.macworld.com/article/1484944/mac-studio-m2-m3-max-ultra-release-date-price-specs.html\">guide to the M2 Mac Studio</a>.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"26a6fe9fea7bf3d80fbc1fe5d94f841f6ccf713aed399ee87b8c1cce472b72c8","category":"Apple"}