{"title":"Neuralink ได้รับการอนุมัติจาก FDA สหรัฐฯ ให้ทดลองฝังชิปในมนุษย์ได้แล้ว","link":"https://www.blognone.com/node/134029","date":1685078344000,"content":"<div><div><div><p>Reuters รายงานว่า Neuralink บริษัทสตาร์ทอัพพัฒนาเทคโนโลยีที่เชื่อมสมองของมนุษย์เข้ากับคอมพิวเตอร์ ของ Elon Musk ได้รับอนุมัติให้ทดลองในมนุษย์แล้วจาก U.S. Food and Drug Administration (FDA) หรือองค์การอาหารและยาของสหรัฐฯ</p>\n<p>Neuralink ได้ทวีตข้อความว่า การอนุมัติจาก FDA เป็นขั้นตอนแรกที่สำคัญที่จะทำให้เทคโนโลยีของเราสามารถช่วยคนจำนวนมากได้ในวันหนึ่ง แต่ทางบริษัทไม่ได้พูดเพิ่มเติมถึงจุดประสงค์ของการศึกษาและจะบอกรายละเอียดเพิ่มเติมเร็วๆ นี้</p>\n<p>Musk เชื่อว่า การฝังชิปในสมองของมนุษย์ จะสามารถช่วยรักษาโรคต่างๆ ได้เช่น โรคอ้วน, โรคออทิสติก, ภาวะซึมเศร้าและโรคจิตเภท นอกจากนี้ชิปที่ฝังอยู่ในสมองสามารถควบคุมและใช้สมาร์ตโฟนได้ผ่านความคิด เมื่อปลายปีที่มีข่าวออกมาว่า ค่อนข้างมั่นใจในความปลอดภัยของอุปกรณ์เหล่านี้ ซึ่ง Musk ก็ยินดีที่จะฝังชิปในสมองของลูกตัวเองด้วย</p>\n<p>ในปี 2019 Musk ได้ทำนายว่า Neuralink จะเริ่มมีการทดลองในมนุษย์อย่างน้อย 4 ครั้ง ทางบริษัทเริ่มทำการขออนุมัติจาก FDA ตั้งแต่ต้นปี 2022 แต่ก็ถูกปฏิเสธคำขอไปก่อนหน้า</p>\n<p>FDA ได้ชี้แจงปัญหาหลายข้อที่ Neuralink ต้องแก้ไขก่อนที่จะได้รับการอนุมัติให้ทดลองในมนุษย์ ซึ่งปัญหาสำคัญอยู่ที่อุปกรณ์มีส่วนประกอบของแบตเตอรี่ลิเธียม, ความกังวลว่าสายไฟของอุปกรณ์ที่ฝังเข้าไปจะเคลื่อนที่ภายในสมอง และการถอดอุปกรณ์ออกจากสมองของมนุษย์โดยไม่ทำลายเนื้อเยื่อสมอง</p>\n<p>ในเดือนพฤษภาคมที่ผ่านมา มีผู้เรียกร้องให้หน่วยงานกำกับดูแลเข้าไปตรวจสอบการทดลองในสัตว์ของ Neuralink เช่น การทดลองนำชิปออกจากสมองลิงรวมไปถึงการละเมิดสวัสดิภาพของสัตว์ทดลอง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c6e8d9f333d4c683cfd93d281f12422f.jpg\" /></p>\n<blockquote><p>We are excited to share that we have received the FDA’s approval to launch our first-in-human clinical study!This is the result of incredible work by the Neuralink team in close collaboration with the FDA and represents an important first step that will one day allow our…</p>\n<p>— Neuralink (@neuralink) <a href=\"https://twitter.com/neuralink/status/1661857379460468736?ref_src=twsrc%5Etfw\">May 25, 2023</a></p></blockquote>\n<p>ที่มา: <a href=\"https://www.reuters.com/science/elon-musks-neuralink-gets-us-fda-approval-human-clinical-study-brain-implants-2023-05-25/\">reuters</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/neuralink\">Neuralink</a></div><div><a href=\"/topics/elon-musk\">Elon Musk</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"26a7bdf5ad09ed52073f7a68c5a19fcc0bcb242a55e82337f17c982c2ae8ee65","category":"Thai"}