{"title":"Ontogenetic growth responses to the environmental changes of the swordtip squid (Uroteuthis edulis) spring stock in the East China Sea","link":"https://onlinelibrary.wiley.com/doi/10.1111/fog.12666?af=R","date":1704776968000,"content":"<h2>Abstract</h2>\n<p>Swordtip squid (<i>Uroteuthis edulis</i>) is characterized by a complex population structure and rapid generation renewal and sensitive to habitat changes. Its population growth response to environmental variations implies its flexible life history traits. In this study, with the samples collected in the north-central waters of the East China Sea from 2017 to 2021, the daily growth of the spring stock was analyzed based on the age and increment width of statolith. The gradient forest method (GFM) and generalized additive mixed models (GAMMs) were used to explore the changes in the weights of environmental variables and the relationships between daily growth and environmental variables in various growth stages. The age of the samples collected from 2017 to 2021 mainly ranged from 180 to 240 days, and the spring stock was the dominant stock. According to the distance from daily increment to core in the statolith, the life history of the spring stock was divided into four growth stages (S1 embryo–larval stage, S2 juvenile stage, S3 subadult stage, and S4 adult stage). For the spring stock, the cumulative weight of temperature and salinity in the population growth was the largest in S1 stage; the cumulative weight of temperature and velocity was the largest in S2 stage; the cumulative weight of temperature was the largest in S3 stage; and the cumulative weight of mixed layer depth (MLD), temperature, and salinity was the largest in S4 stage. The relationship between temperature at the depth of 25 m (T25) and daily growth of the spring stock was first positively correlated (S1–S2), then negatively correlated (S3), and finally positively correlated (S4). The relationship between environment variable and growth of the spring stock gradually decreased with the increase in MLD (30 to 50 m) and SSS (S3–S4, 32.2‰ to 33.2‰) and gradually increased with the increase in the velocity of currents (S1, .1 to .2 m/s). The differences in the responses of the spring stock to environmental variations in different growth stages may lead to the changes in the growth traits for the spring stock. This study provides a scientific basis for a comprehensive understanding of the life history traits of <i>U. edulis</i>.</p>","author":"Nan Li, \nPeiwu Han, \nXinjun Chen, \nZhou Fang","siteTitle":"Wiley: Fisheries Oceanography: Table of Contents","siteHash":"ddf10675d11d4e916ea2c59904318f6a27094a133dc6841be0937d77cc7558c9","entryHash":"26ab4d81b2a829083daa50a0aedb19477abbee05953822031d94e9cf978d4030","category":"Environment"}