{"title":"NASA gets what it wanted: Independent, reliable access to space","link":"https://arstechnica.com/?p=1759680","date":1619190020000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/IMG_0975-980x735.jpg\" /></div>\n        <p>\n          Aftermath of the liftoff of the SpaceX Crew-2 mission taking four astronauts to the International Space Station for NASA.                  </p>\n        </div>\n      </li>\n      </ul><p>In three months, NASA will come upon the 10th anniversary of the final space shuttle flight, a period that was surely melancholy for the space agency.</p>\n<p>When the big, white, winged vehicles touched down for the final time in July 2011, NASA surrendered its ability to get humans into space. It had to rely on Russia for access to the International Space Station. And the space agency had to fight the public perception that NASA was somehow a fading force, heading into the sunset.</p>\n<p>Now we know that will not be the case, and the future appears bright for the space agency and its international partners. On Friday morning, NASA and SpaceX launched the third mission of Crew Dragon that has carried astronauts into space. After nearly a decade with no human orbital launches from the United States, there have been three in less than 11 months. Another successful mission further confirmed that the combination of Falcon 9 rocket and Crew Dragon spacecraft is a reliable means of getting crews to the International Space Station.</p></div><p><a href=\"https://arstechnica.com/?p=1759680#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1759680&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"26ac0381b894c9cb83b217bf1ebb517cf2e72c1efb3f3b10725ca7636a2b5bf0","category":"Tech"}