{"title":"Syncopation and synchrony: Phenological dynamics of Pyropia nereocystis (Bangiophyceae) in central California","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13448?af=R","date":1718080861000,"content":"<h2>Abstract</h2>\n<p><i>Pyropia nereocystis</i> is an annual northeastern Pacific-bladed bangialean species whose macroscopic stage epiphytized the annual canopy forming bull kelp <i>Nereocystis luetkeana</i>. I examined three in situ facets of these epiphyte-host dynamics in the central California region: (1) spatial and temporal variation in the presence of <i>P. nereocystis</i> epiphytes as a function of host density, (2) the relationship between individual host morphology and epiphytic <i>P. nereocystis</i> biomass, and (3) the ecophysiological growth ramifications for subtidal transplants of both life stages of <i>P. nereocystis</i>. Swath canopy surveys and whole host collections were conducted at five sites between November 2017 and February 2019. Additionally, transplants of <i>P. nereocystis</i> gametophytes and sporophytes were conducted across multiple subtidal depths. I observed temporal changes in the proportions of hosts epiphytized by <i>P. nereocystis</i>, with differences in seasonal persistence of <i>P. nereocystis</i> among sites and between years. Biomass of <i>P. nereocystis</i> was positively correlated with individual host stipe length, stipe surface area, and the primary principal component (PC) of stipe morphometrics denoted by principal component analysis (PCA). Gametogenesis in <i>P. nereocystis</i> epiphytes was spatially heterogeneous and limited for the 2018–2019 cohort due to comprehensive removal of hosts by the February 2019 sampling period. Transplants of <i>P. nereocystis</i> gametophytes yielded similar growth responses among depths, and sporophyte (conchocelis) transplant areal growth was positively correlated with transplant depth. These findings detail spatiotemporal complexity and multi-scale (individual, site, and whole region) phenological nuances for central Californian <i>P. nereocystis</i> epiphytes.</p>","author":"Daniel J. Gossard","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"26af45528dda9ca12e93bfc6a1c5308e62d51bad11400202f1c71ed9a2a68290","category":"Environment"}