{"title":"Plant metabolites modulate social networks and lifespan in a sawfly","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2656.14189?af=R","date":1727066448000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/73b66ab0-6b88-4c0d-9417-7be474439939/jane14189-toc-0001-m.png\" alt=\"Plant metabolites modulate social networks and lifespan in a sawfly\" />\n<p>Specialised plant metabolites, clerodanoids, from non-food plants influence sawfly social networks and lifespan. Access to these chemicals increases social interactions but may reduce lifespan, highlighting new dimensions of plant–animal interactions and their ecological consequences.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSocial interactions influence disease spread, information flow and resource allocation across species, yet heterogeneity in social interaction frequency and its fitness consequences are still poorly understood. Additionally, the role of exogenous chemicals, such as non-nutritive plant metabolites that are utilised by several animal species, in shaping social networks remains unclear.\n\nHere, we investigated how non-nutritive plant metabolites impact social interactions and the lifespan of the turnip sawfly, <i>Athalia rosae</i>. Adult sawflies acquire neo-clerodane diterpenoids (‘clerodanoids’) from non-food plants and this can serve as a defence against predation and increase mating success.\n\nWe found intraspecific variation in clerodanoids in natural populations and laboratory-reared individuals. Clerodanoids could also be acquired from conspecifics that had prior access to the plant metabolites, which led to increased agonistic social interactions.\n\nNetwork analysis indicated increased social interactions in sawfly groups where some or all individuals had prior access to clerodanoids, while groups with no prior access had fewer interactions. The frequency of social interactions was influenced by the clerodanoid status of the focal individual and that of other conspecifics.\n\nFinally, we observed a shorter lifespan in adults with prior clerodanoid access when grouped with individuals without prior access, suggesting that social interactions to obtain clerodanoids have fitness costs. Our findings highlight the role of intraspecific variation in the acquisition of non-nutritional plant metabolites in shaping social networks. This variation influences individual fitness and social interactions, thereby shaping the individualised social niche.\n</p>","author":"Pragya Singh, \nLeon Brueggemann, \nSteven Janz, \nYasmina Saidi, \nGaurav Baruah, \nCaroline Müller","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"26b74387920befd15850f932e3b3972c94da92d084ace86f9db68e14400d5a9e","category":"Environment"}