{"title":"Uptake and cardiac events of COVID-19 vaccinations among Canadian youth and young adults","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003363","date":1722434400000,"content":"<p>by Kimball Zhang, Emilie Terebessy, Jingqin Zhu, Catherine Birken, Cornelia M. Borkhoff, Andrea Gershon, Theo J. Moraes, Tetyana Kendzerska, Smita Pakhale, Teresa To</p>\r\n\r\nFew studies have examined population-level data of the COVID-19 original and bivalent vaccine on its uptake and potential side effects. We used population-based health administrative data from Jan 2021–Feb 2023 to identify Ontario residents aged 12–35 years old to calculate their rates of COVID-19 vaccine uptake and vaccine-related cardiac events (myocarditis and pericarditis). Multivariable Cox, logistic, and negative binomial regression analyses were used to adjust for covariates. Hazard ratios (HR) were reported with 95% confidence intervals (CI). The study population included 5,012,721 individuals. Comparing to the general population, those with chronic diseases were associated with 13–37% higher rates of vaccine uptake and 1.39–2.27 times higher odds of receiving booster doses. Overall, post-vaccination cardiac event incidence rates ranged from 3–12 per 100,000 persons. Compared to the general population, the incidence rate of cardiac events among those with asthma and allergic diseases was significantly higher, 3.7 events per 100,000 persons. Compared to the general population, those with asthma and/or allergic diseases had significantly higher associated likelihoods of a cardiac event (HR = 1.31, 95% CI: 1.08–1.57). Females, adults, and those with prior COVID-19 infections had decreased odds of cardiac events after 2<sup>nd</sup> vaccine doses. No significant differences in post-vaccine cardiac events were detected between original and bivalent doses. This Canadian population-based study reported substantially higher rates of vaccine uptake and a very rare incidence of temporally associated post-vaccination cardiac events. While substantially smaller than the benefits of vaccination, our results indicated a continued small risk of cardiac side effects from bivalent COVID-19 vaccines in individuals with comorbidities.","author":"Kimball Zhang","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"26bcfe3da9485643b4ae8f8b32050bcd8c70e7f422edbf97292496cc2eace498","category":"Environment"}