{"title":"An Implementation Evaluation of the Smartphone-Enhanced Visual Inspection with Acetic Acid (SEVIA) Program for Cervical Cancer Prevention in Urban and Rural Tanzania","link":"https://www.preprints.org/manuscript/202405.0165/v1","date":1714714401000,"content":"Introduction: The World Health Organization (WHO) recommends visual inspection with acetic acid (VIA) for cervical cancer screening (CCS) in lower-resource settings; however, quality varies widely, and it is difficult to maintain a well-trained cadre of providers. The Smartphone-Enhanced Visual Inspection with Acetic acid (SEVIA) program was designed to offer secure sharing of cervical images and real-time supportive supervision to health care workers providing screening in semirural Tanzania, in order to improve quality and accuracy of visual assessment of the cervix for treatment. The purpose of this evaluation was to document early learnings from patients, providers, and higher-level program stakeholders, on barriers and enablers to program implementation. Methods: From September 9th to December 8th, 2016, observational activities and open-ended interviews were conducted with image reviewers (n= 5), providers (n=17), community mobilizers (n=14), patients (n=21), supervisors (n=4) and implementation partners (n=5) involved with SEVIA. Sixty-six interviews were conducted at 14 facilities, in all 5 of the program regions. Results SEVIA was found to be a highly regarded tool for the enhancement of CCS services in Northern Tanzania. Acceptability, adoption, appropriateness, feasibility, and coverage of the intervention were highly recognized. It appeared to be an effective means of improving good clinical practice among providers and fit seamlessly into existing roles and processes. Barriers to implementation included network connectivity issues, and community misconceptions and adoption of CCS more generally. Conclusion: SEVIA is a practical and feasible mobile health intervention and tool that easily integrated into the National CCS program to enhance quality of care. With the introduction of HPV DNA testing as a primary screening strategy for cervical cancer prevention in settings such as Tanzania, the role of a mobile health platform for program surveillance, tracking follow-up care, and quality assurance of visual assessment of the cervix for treatment (in women who test positive for high-risk HPV) further supports the importance of programs, such as SEVIA, in low resource contexts. Further expansion of the program, especially to rural areas where screening providers can benefit from virtual support for screening services through the use of the mobile App, could strengthen the delivery of services within the national cervical cancer prevention program.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"26c891da9281a01314491f563a6e25d6cba17685b89ffe63574baf7f82c46578","category":"Interdisciplinary"}