{"title":"PSIV-18 Evaluation of lactose level and whey permeate form on nursery pig performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/309/7665021?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>A total of 1,512 pigs [initial body weight (BW) = 4.7 kg] were used to evaluate lactose level and whey permeate form on nursery pig performance in a commercial environment. Pigs were weaned at approximately 19 d of age and allotted to 1 of 4 dietary treatments arranged in a 2 × 2 factorial utilizing low or high lactose levels with either granular whey permeate (Dairylac 80, International Ingredients Corporation, Fenton, MO) or spray-dried whey permeate. Each whey permeate source contained 80% lactose. The low lactose diets consisted of 10.00 and 4.13% whey permeate for phase 1 and 2, respectively, and targeted a total lactose intake of 363 g/pig. The high lactose diets consisted of 20.00 and 8.25% whey permeate for phase 1 and 2, respectively, and targeted a total lactose intake of 726 g/pig. There were 27 pigs per pen and 14 replications per treatment. Pigs were fed experimental diets in two phases with feed budgets of 2.3 kg/pig in phase 1 and 5.4 kg/pig in phase 2. Following experimental diets, all pigs were fed a common corn-soybean meal-based diet until the completion of the study on d 42. Pigs experienced flu-like health challenges throughout the experiment. There were no lactose level × whey permeate form interactions for the duration of the study (<span>P</span> &gt; 0.10; Table). For main effects of lactose level, pigs fed high lactose levels had increased (<span>P</span> ≤ 0.024) average daily feed intake (ADFI) compared with pigs fed low lactose levels during the experimental period (d 0 to 21). For main effects of whey permeate form, there were no differences from d 0 to 21. However, overall (d 0 to 42), pigs fed spray-dried whey permeate in phase 1 and 2 tended to have greater (<span>P</span> = 0.080) average daily gain (ADG) and had improved (<span>P</span> = 0.041) gain to feed ratio (G:F) compared with pigs fed granular whey permeate. There were no differences in mortality or removals between treatments (<span>P</span> &gt; 0.10). In conclusion, this study suggests a lactose intake of 726 g/pig increased feed intake compared with 363 g/pig during the experimental period regardless of whey permeate form. Additionally, spray-dried whey permeate improved feed efficiency regardless of lactose level fed.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"26de2f65f75d6662beb8b9b359caa954dbceac95d92574dd68a577a6c8307613","category":"Environment"}