{"title":"161 Effect of replacement of dried distiller’s grains plus solubles with increasing extruded and expelled soybean meal on feedlot performance and carcass characteristics in finishing steers","link":"https://academic.oup.com/jas/article/102/Supplement_2/209/7664714?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to evaluate the effects of increasing inclusion of extruded and expelled soybean meal (EESBM) as a partial replacement of dried distiller’s grains plus solubles (DDGS) feedlot performance and carcass characteristics in steers. Steers [n = 144; initial shrunk body weight (BW) = 399 ± 27 kg] were assigned to 1 of 18 pens (8 steers/pen). Pens were randomly assigned to one of three dietary treatments (6 pens/treatment): 100% DDGS included at 15% of diet dry matter (DM; NO-SBM), a blend of 70% DDGS and 30% SBM included at 15% of diet DM (30-EESBM), and a blend of 40% DDGS and 60% SBM included at 15% of diet DM (60-EESBM) in a randomized complete block design with pen as experimental unit. Data were analyzed as a RCBD with fixed effects of treatment and random effect of block (location within feedyard). Linear and quadratic contrasts were used to assess EESBM level effects. All growth performance results were determined on a carcass-adjusted [hot carcass weight (HCW)/0.625] basis. Supplementation of EESBM increased (<span>P</span> ≤ 0.04) final BW and average daily gain (ADG) by 1.6 and 3.8%, respectively. Additionally, dietary treatment tended to result in increased (<span>P</span> ≤ 0.07) DMI and improved feed conversion by 1.2 and 2.6%. Final BW, ADG and gain to feed ratio (G:F) increased (linear; <span>P</span> ≤ 0.03) with increasing inclusion of EESBM in replacement of DDGS. Dry matter intake (DMI) tended to increase quadratically (<span>P</span> = 0.10) with increasing EESBM inclusion. No differences (<span>P</span> ≥ 0.37) were observed in any other carcass-adjusted growth performance responses as well as apparent utilization of dietary net energy (<span>P</span> ≥ 0.15). Increasing inclusion of EESBM resulted in a linear increase (<span>P</span> = 0.02) in HCW. A tendency for a linear increase (<span>P</span> = 0.09) was noted for empty body fat% with greater EESBM inclusion. No other differences (<span>P</span> ≥ 0.12) were observed in carcass performance, distribution of yield and quality grades, and lung and liver health outcomes. In conclusion, feeding EESBM as a partial replacement of DDGS resulted in greater DMI, ADG and carcass weight, without negatively influencing measures of carcass quality or cutability. Under the conditions of this experiment, the NE value of EESBM is 8.5% greater than DDGS.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"26ea8e3795380938ecedbef65554cf4b33b55c4a034a457689d620bca95c8876","category":"Environment"}