{"title":"After a week of controversy, SD Worx answers everything with collective strength","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/after-a-week-of-controversy-sd-worx-answers-everything-with-collective-strength","date":1690744305000,"content":"\n      <p><span>In the press room after the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> finishes, it is customary for the jersey winners, the top-three in the general classification and the final stage winner to come and field questions from probing journalists. They sit on a raised platform in front of rows of plastic seats – usually in a hot and stuffy sports hall – and one by one are subjected to a type of interrogation about the main talking points of the day.</span></p>\n<div></div>\n<p><span>After the final stage of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a>, Kasia Niewiadoma was the first to enter the questioning room for finishing third on the podium and winning the polka dot jersey. Once the Canyon//SRAM rider was finished, the three remaining riders all walked through the grey doors together. They were a splash of colour in yellow, green and red, herded by the SD Worx’s press officer clad in a black polo shirt. It was not the usual routine, not the normal thing to happen at the end of one of the biggest stage races in the world. The first and second in the general classification, the green jersey winner and the stage winner are not supposed to all be from the same team. But, as this week has proven, SD Worx is not a normal team at all.</span></p>\n<p><span>“We won almost everything, I can hardly believe it,” winner of the final time trial, Marlen Reusser commented with a grin.</span></p>\n<p><span>SD Worx has always been very good. Their supremacy in the women’s peloton has been rife since 2015 when they won their first World Championship title and, since then, there has been no stopping them. Anna van der Breggen won it all and when she retired, Demi Vollering looked to take up the mantle with ease. There have been a couple of years where their results have occasionally tailed off by their high standards, but never for long. SD Worx always seems to have an answer.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230730TDFFAZ0062-A.S.O._Thomas_Maheux_1024x1024.jpg?v=1690743671\" alt />They proved that this week at the Tour de France Femmes. It was a race that started well for the Dutch squad with Lotte Kopecky winning the first stage and taking the yellow jersey with her. Things began to go south, however, when Danny Stam was thrown off the race mid-way through for pacing Vollering back to the peloton after a puncture and subsequently responding very badly to his punishment in the eyes of the UCI. The riders and staff gave angry, scathing interviews about the race commissaires and it was a PR disaster for the team. The stress of it all was palpable at the SD Worx bus earlier in the race – the tension high, the curt “no comment,” responses to media a sign of their anger and defiance.</span></p>\n<p><span>Despite all the controversy, however, SD Worx has, like they always do, answered back. The last two, pivotal days of racing in the Tour de France Femmes has seen the squad show stubborn resilience. Vollering’s brutal attack on the Tourmalet yesterday was the first step, then it was Kopecky clinging on to the GC contenders over the mountain too – no doubt a show of strength that played mind games with the pure climbers. Less than 24 hours later, Marlen Reusser took the stage win in the time trial on the final stage by ten seconds and her closest two rivals were, you guessed it, Vollering and Kopecky themselves, who finished third and second on the stage.</span></p>\n<p><span>With that, it was a clean sweep of the podium for SD Worx on the final stage and almost a full collection of jerseys to go alongside it, plus the team classification, of course, and not forgetting the two stage wins. Their answer to any vitriol towards the team came in the form of their results, they spoke with their strength and their legs, something that, regardless of anyone’s opinion surrounding the team's behaviour this week, can only be applauded.</span></p>\n<p><span>“It’s amazing what we did this week,” yellow jersey winner Vollering commented after today's stage. “We had a lot of ups and downs but we really showed how strong our team is and how motivated we are to take the best out of the day and really fight for stage wins and make each other stronger. I love to see this in the team but it’s really nice for the world to see it too.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230730TDFFAZ0082-A.S.O._Thomas_Maheux_1024x1024.jpg?v=1690743692\" alt />The reality is, however, that we only see a snippet of what really goes on in the SD Worx team. We watch the high adrenaline post-race interviews and we read the snippets of quotes that are pulled out from them as headlines. We see them as ruthless competitors in races who only have winning on their minds, but as they bumbled into the press room today to give their interviews, you could have mistaken them for any normal group of friends. </span></p>\n<p><span>They shared looks at each other's phones and giggled at the screens, Swiss woman Reusser shouted at Vollering to say she loved Switzerland during her interview, to which Vollering burst into laughter and then obliged. Kopecky interrupted the journalists with a joke question about who Reusser’s favourite teammate was, while Vollering snickered behind, her yellow jersey bright on her shoulders. They breathed life into the stale air of the press room, an energetic bubble which left a strange silence when it was all over. It was an example of SD Worx being normal, an expression of their humanity that might have been missed at points in this Tour de France Femmes so far.</span></p>\n<p><span>Yet still, tonight they will not celebrate fully, with Kopecky keen to stay “healthy and recover as quickly as possible for the World Championships” in two weeks time. The same goes for Reusser and Vollering. This is the hard, relentless routine of professional athletes and something that can often make them seem like well programmed robots. SD Worx showed today, though, that they have beating hearts and a strong bond, leaving the Tour de France Femmes rightly proud of their achievements. </span></p>\n<p><span>“This week is only something we could have dreamed of,” Vollering concluded with a smile.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"26f4d3ca04a3d413ae926ef7f0e0ffb6e5de063b55863f7f4251cd5bd63380a5","category":"Cycling"}