{"title":"Why Apple’s ‘Scary Fast’ Mac event could be a big bore","link":"https://www.macworld.com/article/2118594/apple-scary-fast-mac-event-m3-macbook-pro-disappointment.html","date":1698615154000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>In just a few hours, Apple will hold its second event of the fall and third of the year—dubbed “Scary Fast” and seemingly focused on the Mac. The announcement caught us off-guard since we had heard there wouldn’t be an October event this year, and something about the whole thing just seemed off. Apple is reportedly holding this event to renew interest in the Mac before the holiday season. Still, it’s starting to look like this <a href=\"https://www.macworld.com/article/1064916/apple-october-event-date-time-mac-ipad.html\">“Scary Fast” event</a> could have the opposite effect.</p>\n\n\n\n<h2>The time</h2>\n\n\n\n<p>In our years covering Apple, we can’t remember another event that was purposefully planned for the evening. Sure there were trade shows in Paris or Tokyo that forced Apple to hold keynotes at odd times, but this one is completely in Apple’s control. The event will take place at 5 p.m. PT—or 8 p.m. on the East Coast. That’s very late for a U.S.-based event, especially one that involves showing a prerecorded video. Spare a thought for the rest of the world too, with the U.K. expected to watch the event at midnight. </p>\n\n\n\n<p>The timing could be due to Halloween and Apple’s just leaning into the “spooky” side of things (the company did send out <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.tiktok.com/@lamarrwilson/video/7295111728801713454&amp;xcust=1-1-2118594-1-0-0&amp;sref=https://www.macworld.com/feed\">candy- and AirPods Max-filled care packages</a> to influencers). Or it could be a way to bury not-so-great news. Even with a company like Apple, an event at 8 p.m. ET is going to get far less coverage than one at 1 in the afternoon. So Apple might be trying to limit its exposure here.</p>\n\n\n\n<h2>The rumors</h2>\n\n\n\n<p>For months we had heard that Apple wasn’t holding a second fall event this year. And the rumors backed that up—yes there was an M3 processor in the works, but the new products were largely the same as the M2 models but faster. And that’s still the case. The latest reports say Apple will unveil a <a href=\"https://www.macworld.com/article/1484743/24-inch-imac-release-date-specs-m2-m3-processor-price.html\">new iMac</a> and 14-inch and 16-inch <a href=\"https://www.macworld.com/article/2111544/m3-macbook-pro-release-date-price-specs.html\">MacBook Pros</a> on Monday with a faster chip and not much else—no Airs, no AirPods, no iPads, nothing. </p>\n\n\n\n<p>Is an updated chip that’s slightly faster than the previous-gen, some extra brightness in the display, and maybe Wi-Fi 7 enough to carry an event? The iMac, which hasn’t been updated since April 2021, isn’t even expected to get new colors. So can Apple really keep our attention for an hour or so with a slightly faster chip and a lot of Johny Srouji?</p>\n\n\n\n<h2>The chip</h2>\n\n\n\n<p>Finally, there’s the M3 processor itself. We had extremely high hopes for the M3 when we first heard a new 3nm Mac chip was in development. Now we’re not so sure. After the A17 Pro brought very modest gains over the A16 Bionic and rumors, we expect the M3 to bring similar speed gains as the M2, roughly 15 percent. That’s fine, but It’s also not event-worthy.</p>\n\n\n\n<p>The M3 Pro and M3 Max may bring bigger gains, especially when it comes to graphics, but we’re not all that optimistic, especially since all three chips will debut at the same time. If the M3 was a big leap, Apple would be happy to let it stand alone, instead, it’s going to seemingly be overshadowed by faster chips, which may not be all that fast themselves. Rumors say the M3 Pro and M3 Max will have similar core and speed upgrades as the M2, which could make for a very meh event.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"26f56b811b3c8255646fe7b4214d4fdde65e13e06eb3d7e92ec655679a8aefe2","category":"Apple"}