{"title":"PSIII-18 Effects of dietary exogenous fibrolytic enzymes on ruminal degradation kinetics of beef steers offered a high- and low-quality feedlot growing diets","link":"https://academic.oup.com/jas/article/102/Supplement_3/509/7757770?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The post-consumption effects of dietary pre-treatment with exogenous fibrolytic enzymes on the ruminal degradation kinetics of wheat hay when beef steers were offered high- and low-quality feedlot growing diets were evaluated. Ruminally cannulated crossbreed steers [n = 5; body weight (BW) = 520 ± 30 kg] were used in a 5 × 4 unbalanced Latin square design, in which a 2 × 2 factorial arrangement of treatments was used as follows: a) growing diet quality (high = HQ; and low = LQ); and b) enzyme inclusion (0 or 0.75 mL/kg of diet DM; ABVista, UK). Steers were offered diets to ad libitum intake during four periods. Pre-dehydrated (55 ºC for 72 h) wheat hay substrate was ground (2 mm) and placed into 10 × 20 cm (28 µm) nylon bags (5 g, as-is). Substrate in situ bags were placed within a nylon mesh (with weights) at the ruminal ventral sac and reversely removed at 0, 3, 6, 12, 18, 24, 30, 48, 72, and 96 h after feeding. Samples were removed, rinsed, and dehydrated for 72 h at 55 <sup>o</sup>C. Residues were composited within the period, steer, and incubation time, corrected for residual moisture, and were used to fit a first-order kinetics model using the NLIN procedure of SAS and the Glimmix procedure of SAS used for the statistical analysis (animal = experimental unit). No interaction (<span>P</span> ≥ 0.35) diet × enzyme was observed for the ruminal effective degradability (ED) fractions of the substrate. Regardless of dietary type, steer consuming diets pre-treated with fibrolytic enzymes increased (<span>P</span> ≤ 0.05) the substrate ED for organic matter (OM), neutral detergent fiber (NDF), acid detergent fiber (ADF), and hemicellulose (HEMI). No interaction (<span>P</span> ≥ 0.09) diet × enzyme was observed for the ruminal rate of degradation (kd) of any fraction. Steers offered feed pre-treated with fibrolytic enzymes, regardless of dietary type, increased the substrate ruminal rate of degradation (<span>P</span> ≤ 0.01) for OM and HEMI, while high-quality diets showed an increase kd for OM and HEMI compared with low-quality diets (<span>P</span> ≤ 0.03). An interaction (<span>P</span> = 0.03) diet × enzyme was observed for OM lag time, in which the enzyme decreased the lag time of the substrate on the high-quality diet, while increasing for steers consuming the low-quality diet. No interaction (<span>P</span> ≥ 0.14) diet × enzyme was observed for the lag time for NDF, ADF, and HEMI. Steers consuming grower diets pre-treated with fibrolytic enzymes had improved ruminal effective degradable fraction of wheat hay substrate, regardless of the grower diet quality offered to animals. A reduction in the lag time does not seem to be a probable cause for such an effect but rather an improvement in the rate of degradation of organic matter, especially hemicellulose.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"26f888c65c4e1c6adf124e4a1cd49d21112b49a26336fe0beeac45b9c36b5266","category":"Environment"}