{"title":"Decoding autumn phenology: Unraveling the link between observation methods and detected environmental cues","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17231?af=R","date":1710313200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/233d7aff-2872-404d-abcd-5eeeee66c64e/gcb17231-toc-0001-m.png\" alt=\"Decoding autumn phenology: Unraveling the link between observation methods and detected environmental cues\" />\n<p>Understanding autumn phenology is challenging due to the multitude of likely environmental cues and substantial variations in timing caused by different derivation methods. This study in a German beech forest investigated start and end (EOS) of the growing season from 2000 to 2020 using four derivation methods and determined their influence on a predictor analysis of leaf senescence. Most notable were the large differences in sign and strength of potential drivers of leaf coloring and fall in the analyses when comparing EOS data sets. The results suggest an ensemble analysis for general statements on trends and drivers of autumn phenology.</p>\n<br />\n<h2>Abstract</h2>\n<p>Leaf coloring and fall mark the end of the growing season (EOS), playing essential roles in nutrient cycling, resource allocation, ecological interactions, and as climate change indicators. However, understanding future changes in autumn phenology is challenging due to the multitude of likely environmental cues and substantial variations in timing caused by different derivation methods. Yet, it remains unclear whether these two factors are independent or if methodological uncertainties influence the environmental cues determined. We derived start of growing season (SOS) and EOS at a mixed beech forest in Central Germany for the period 2000–2020 based on four different derivation methods using a unique long-term data set of in-situ data, canopy imagery, eddy covariance measurements, and satellite remote sensing data and determined their influence on a predictor analysis of leaf senescence. Both SOS and EOS exhibited substantial ranges in mean onset dates (39.5 and 28.6 days, respectively) across the different methods, although inter-annual variations and advancing SOS trends were similar across methods. Depending on the data, EOS trends were advanced or delayed, but inter-annual patterns correlated well (mean <i>r</i> = .46). Overall, warm, dry, and less photosynthetically productive growing seasons were more likely to be associated with a delayed EOS, while colder, wetter, and more photosynthetically productive vegetation periods resulted in an earlier EOS. In addition, contrary to recent results, no clear influence of pre-solstice vegetation activity on the timing of senescence was detected. However, most notable were the large differences in sign and strength of potential drivers both in the univariate and multivariate analyses when comparing derivation methodologies. The results suggest that an ensemble analysis of all available phenological data sources and derivation methods is needed for general statements on autumn phenology and its influencing variables and correct implementation of the senescence process in ecosystem models.</p>","author":"Simon Kloos, \nAnne Klosterhalfen, \nAlexander Knohl, \nAnnette Menzel","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"27082e7a7f5c0c0ed7171f28edd36e4b16df09d4afa6de061622dc92d88e5fc8","category":"Environment"}