{"title":"Leaked Apple silicon roadmap reveals plans for Mac Pro, MacBook Air","link":"https://arstechnica.com/?p=1810891","date":1636147760000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Screen-Shot-2021-10-18-at-1.20.47-PM-800x400.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/Screen-Shot-2021-10-18-at-1.20.47-PM.jpg\">Enlarge</a> <span>/</span> The M1 SoC die compared to M1 Pro and M1 Max. (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Apple has already finalized the second generation of Mac processors, and the third generation is expected to be made with a new 3-nanometer process, according to a report in <a href=\"https://www.theinformation.com/articles/apples-road-map-for-mac-chips-shows-likely-advantage-over-intel\">The Information</a> citing people with direct knowledge of the plans.</p>\n<p>The report says that the second-generation chips will use an \"upgraded version\" of the 5-nanometer process used for the M1, M1 Pro, and M1 Max found in recent Apple Silicon Macs. But unlike those first-generation chips, some of the second-generation chips will have two dies instead of one, allowing for more processor cores.</p>\n<p>A second-generation chip with just one die will be included in the long-rumored, redesigned MacBook Air as well as in iPads. That chip is code-named Staten. On the other hand, the MacBook Pro will feature more powerful second-generation chips code-named Rhodes. The second-generation chips have already been finalized and are ready to enter trial production, according to The Information's sources.</p></div><p><a href=\"https://arstechnica.com/?p=1810891#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1810891&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"2709b0b2a52c82252275d1a2a905dd2bd2d2d1bc8eecf0da180c6bedbf83869b","category":"Tech"}